SVTM     TITLE 'ISTINCY4 - RTGOH REQUEST PROCESSOR                     *00001000
                        '                                               00002000
ISTINCY4 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTINCY4  75.307'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
*/* END OF ATBUILD */                                              0006 00014000
*                                                                  0006 00015000
*          DO;                                                     0006 00016000
*/***  CRRMAINT  RPHADD((R01->NCSPLRPH))PROCNM(ISTINCY4)COMP(VY)FUNC(SU 00017000
*)  ***/                                                           0007 00018000
*                                                                  0007 00019000
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTVYCRR)  */                  0007 00020000
*          RFY ISTLCCW ;                                           0007 00021000
*          RFY ISTLCPB ;                                           0008 00022000
*          RFY ISTZSAVE;                                           0009 00023000
*          RFY ISTPFCRR;                                           0010 00024000
*          RFY ISTCFCRR;                                           0011 00025000
*          RFY ISTZCRR ;                                           0012 00026000
*          RFY ISTASCRR;                                           0013 00027000
*          RFY ISTAPCRR;                                           0014 00028000
*          RFY ISTCRA  ;                                           0015 00029000
*          RFY ISTCNSTA;                                           0016 00030000
*          RFY ISTVYCRR;                                           0017 00031000
*/* END OF ATBUILD */                                              0018 00032000
*          /*** SET ENTERED BIT FOR THIS PROCEDURE ***/            0018 00033000
*R01->NCSPLRPH->RPHCRR->CRACRR->NINCY4 = '1'B;                     0018 00034000
         L     @02,NCSPLRPH(,R01)                                  0018 00035000
         L     @02,RPHCRR(,@02)                                    0018 00036000
         L     @02,CRACRR(,@02)                                    0018 00037000
         OI    NINCY4(@02),B'00000100'                             0018 00038000
*          /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/           0019 00039000
*R01->NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                     0019 00040000
         XC    VYCCRT+1(11,@02),VYCCRT+1(@02)                      0019 00041000
         MVI   VYCCRT(@02),B'00000000'                             0019 00042000
*R01->NCSPLRPH->RPHCRR->CRACRR->CINCY4 = '1'B;                     0020 00043000
         OI    CINCY4(@02),B'00000100'                             0020 00044000
*          END;                                                    0021 00045000
*          DCL R01 PTR(31) REG(01) RSTD;/* INPUT PARAMETER REG    */    00046000
*          DCL R13 PTR(31) REG(13) RSTD;/* SAVE AREA PTR REGISTER */    00047000
*          DCL R15 PTR(31) REG(15) RSTD;/* WORK REGISTER          */    00048000
*          DCL R10 PTR(31) REG(10) RSTD;/* BASE REG FOR NCSPL     */    00049000
*          DCL R11 PTR(31) REG(11) RSTD;/* DATA AREA PTR REGISTER */    00050000
*          DCL @SIZDATD FIXED(31) GEND;/* size of DATA area       */    00051000
*          R10 = R01;                /* INIT NCSPL BASE REGISTER  */    00052000
         LR    R10,R01                                             0028 00053000
*          RFY ISTNCSPL BASED(R10);  /* ADDRESSABILITY FOR NCSPL  */    00054000
*          RFY ISTRPH BASED(NCSPLRPH);/* ADDRESSABILITY FOR RPH   */    00055000
*          R15 = R13;                /* SAVE CALLER SAVE AREA ADR */    00056000
         LR    R15,R13                                             0031 00057000
*          R13 = R13 - LENGTH(ISTRSA);/* SET SAVE AREA PTR REG    */    00058000
         SL    R13,@CF00359                                        0032 00059000
*          R15->RSAFPT = R13;        /* SET CALLERS FORWARD PTR   */    00060000
         ST    R13,RSAFPT(,R15)                                    0033 00061000
*          R13->RSABPT = R15;        /* SET MY BACK PTR           */    00062000
         ST    R15,RSABPT(,R13)                                    0034 00063000
*          R13->RSAFPT = 0;          /* SET MY FORWARD PTR        */    00064000
         SLR   @02,@02                                             0035 00065000
         ST    @02,RSAFPT(,R13)                                    0035 00066000
*          R11= VWANAV + 7 & 'FFFFFFF8'X;/* DATAREG = DWORD BDY   */    00067000
         L     @02,NCSPLWKA(,R10)                                  0036 00068000
         LA    R11,7                                               0036 00069000
         AL    R11,VWANAV(,@02)                                    0036 00070000
         N     R11,@CF00073                                        0036 00071000
*          VWANAV = R11 + @SIZDATD;  /* ALLOCATE DATA AREA        */    00072000
         LR    @00,R11                                             0037 00073000
         AL    @00,@SIZDATD                                        0037 00074000
         ST    @00,VWANAV(,@02)                                    0037 00075000
*          GEN (USING @DATD,R11);    /* ESTAB BASE REG FOR DATA   */    00076000
         USING @DATD,R11                                                00077000
*/* END OF CPPROC EXPANSION */                                     0039 00078000
*                                                                  0039 00079000
*/* ATBUILD (ISTNCSPL,ISTRDT,ISTRH,ISTRU)  */                      0039 00080000
* RFY ISTLOK  ;                                                    0039 00081000
* RFY ISTDEVCH;                                                    0040 00082000
* RFY (ISTRPRE,ISTRCPRE,ISTRDT,ISTRAP,ISTRLC,ISTRRN,ISTRGP,ISTRLN,ISTRP 00083000
*,ISTRCL,ISTRTR,ISTRIN,ISTRDS,ISTDOT,ISTRCC,ISTRLU,ISTRPX,ISTRLX,ISTRSW 00084000
*ISTRDA,ISTRLS,ISTDNT,ISTGNT,ISTPAT);                              0041 00085000
* RFY ISTRH   ;                                                    0042 00086000
* RFY (ISTRU,ISTRUB);                                              0043 00087000
*/* END OF ATBUILD */                                              0044 00088000
*/*                                                                  */ 00089000
*/* DECLARATIONS OF REGISTERS AND CONSTANTS                          */ 00090000
*/*                                                                  */ 00091000
*DCL R00 PTR(31) REG(00);         /* CIDCTL INTERFACE REGISTER       */ 00092000
*DCL R02 PTR(31) REG(02);         /* CIDCTL INTERFACE REGISTER       */ 00093000
*DCL R03 PTR(31) REG(03) RSTD;    /* RC REG                 @AS09726 */ 00094000
*DCL REG15 PTR(15) REG(15);       /* RC FROM CIDCTL         @AS09726 */ 00095000
*DCL R14 PTR(31) REG(14) RSTD;    /* RETURN ADDRESS REGISTER         */ 00096000
*DCL B0 BIT(1) CONSTANT('0'B);    /* BINARY ZERO CONSTANT            */ 00097000
*DCL B1 BIT(1) CONSTANT('1'B);    /* BINARY ONE CONSTANT             */ 00098000
*DCL D0 FIXED(31) CONSTANT(0);    /* DECIMAL ZERO CONSTANT           */ 00099000
*/*                                                                  */ 00100000
*/* DECLARATIONS OF VARIABLES                                        */ 00101000
*/*                                                                  */ 00102000
*DCL 1 RESPONSE AUTO,             /* AREA TO BUILD SNA RESPONSE UNIT */ 00103000
*      2 RESPSENS CHAR(4),        /* AREA FOR SENSE DATA             */ 00104000
*      2 RESPDATA CHAR(3);        /* FOR 1ST 3 BYTES OF REQ          */ 00105000
*/*                                                                  */ 00106000
*/* SCAFFOLDING                                                      */ 00107000
*/*                                                                  */ 00108000
*DCL 1 * CHAR(12) DEFINED(VYCNTRD),                                0053 00109000
*      2 * BIT(13),                                                0053 00110000
*      2 NINCY4 BIT(1);                                            0053 00111000
*DCL 1 * CHAR(12) DEFINED(VYCCRT),                                 0054 00112000
*      2 * BIT(13),                                                0054 00113000
*      2 CINCY4 BIT(1);                                            0054 00114000
*/*                                                                  */ 00115000
*/* MAINLINE CODE OF ISTINCY4                                        */ 00116000
*/*                                                                  */ 00117000
*RFY ISTRU BASED(ADDR(RESPONSE)); /* ADDRESSABILITY FOR SENSE RU     */ 00118000
*RFY ISTRUB BASED(ADDR(SENRU));   /* ADDRESSABILITY FOR REQUEST UNIT */ 00119000
*RFY ISTRH BASED(ADDR(NCSPLRH));  /* ADDRESSABILITY FOR RH           */ 00120000
*SRUSENSE = D0;                   /* INITIALIZE SENSE = 0            */ 00121000
         LA    @02,RESPONSE                                        0058 00122000
         SLR   @00,@00                                             0058 00123000
         STCM  @00,15,SRUSENSE(@02)                                0058 00124000
*NSRUID = SRNETSRV;               /* SET CATEGORY = NETWORK SERVICES */ 00125000
         LA    @09,4                                               0059 00126000
         ALR   @09,@02                                             0059 00127000
         MVI   NSRUID(@09),X'01'                                   0059 00128000
*NSRUSUB = NSRUPCS;               /* SUBCATEGORY = PHYS CONFIG SERV  */ 00129000
         MVI   NSRUSUB(@09),X'02'                                  0060 00130000
*NSRURCD = NSRUONHK;              /* REQUEST CODE = RTGOH            */ 00131000
         MVI   NSRURCD(@09),X'1B'                                  0061 00132000
*IF NCSPLRPT->RCCBRKCN = B1       /* IF DISCNT=YES FOR PU            */ 00133000
*  THEN DO;                       /* THEN REJECT RTGOH REQUEST:      */ 00134000
         L     @09,NCSPLRPT(,R10)                                  0062 00135000
         TM    RCCBRKCN(@09),B'00000010'                           0062 00136000
         BNO   @RF00062                                            0062 00137000
*    SRUSNS1 = SRURRE;            /* SENSE = REQUEST REJECT,         */ 00138000
         MVI   SRUSNS1(@02),X'08'                                  0064 00139000
*    SRUSNST = SRUFUNS;           /* FUNCTION NOT SUPPORTED          */ 00140000
         MVI   SRUSNST(@02),X'0C'                                  0065 00141000
*    END;                                                          0066 00142000
*  ELSE                           /* OTHERWISE:                      */ 00143000
*    IF NCSPLRPT->RCCRTGOH = B1   /* IF PREVIOUS RTGOH RECEIVED      */ 00144000
*      THEN DO;                                                    0067 00145000
         B     @RC00062                                            0067 00146000
@RF00062 L     @02,NCSPLRPT(,R10)                                  0067 00147000
         TM    RCCRTGOH(@02),B'00000001'                           0067 00148000
         BNO   @RF00067                                            0067 00149000
*        IF NCSPLRPT->RCCOHIMM = B0 /* IF PREVIOUS RTGOH NORMAL      */ 00150000
*           & NCSPLRTY = NSRUHKI  /* AND THIS RTGOH IMMEDIATE        */ 00151000
*          THEN                   /* THEN ACCEPT RTGOH COMMAND:      */ 00152000
         TM    RCCOHIMM(@02),B'00001000'                           0069 00153000
         BNZ   @RF00069                                            0069 00154000
         CLI   NCSPLRTY(R10),X'80'                                 0069 00155000
         BNE   @RF00069                                            0069 00156000
*            NCSPLRPT->RCCOHIMM = B1; /* INDIC IMMED RTGOH RECVD     */ 00157000
         OI    RCCOHIMM(@02),B'00001000'                           0070 00158000
*          ELSE DO;               /* OTHERWISE REJECT RTGOH REQUEST: */ 00159000
         B     @RC00069                                            0071 00160000
@RF00069 DS    0H                                                  0072 00161000
*            SRUSNS1 = SRURRE;    /* SENSE = REQUEST REJECT,         */ 00162000
         LA    @02,RESPONSE                                        0072 00163000
         MVI   SRUSNS1(@02),X'08'                                  0072 00164000
*            SRUSNST = SRUMI;     /* MODE INCONSISTENCY              */ 00165000
         MVI   SRUSNST(@02),X'09'                                  0073 00166000
*            END;                                                  0074 00167000
*        END;                                                      0075 00168000
*      ELSE DO;                   /* OTHERWISE (NO PREVIOUS RTGOH)   */ 00169000
         B     @RC00067                                            0076 00170000
@RF00067 DS    0H                                                  0077 00171000
*        NCSPLRPT->RCCRTGOH = B1; /* INDICATE RTGOH RECEIVED         */ 00172000
         L     @02,NCSPLRPT(,R10)                                  0077 00173000
         OI    RCCRTGOH(@02),B'00000001'                           0077 00174000
*        IF NCSPLRTY = NSRUHKI    /* IF RTGOH IS IMMEDIATE           */ 00175000
*          THEN NCSPLRPT->RCCOHIMM = B1; /* THEN INDIC IMMED RTGOH   */ 00176000
         CLI   NCSPLRTY(R10),X'80'                                 0078 00177000
         BNE   @RF00078                                            0078 00178000
         OI    RCCOHIMM(@02),B'00001000'                           0079 00179000
*          ELSE NCSPLRPT->RCCOHIMM = B0; /* OTHERWISE INDIC NORMAL   */ 00180000
         B     @RC00078                                            0080 00181000
@RF00078 L     @02,NCSPLRPT(,R10)                                  0080 00182000
         NI    RCCOHIMM(@02),B'11110111'                           0080 00183000
*        END;                                                      0081 00184000
@RC00078 DS    0H                                                  0082 00185000
*IF SRUSENS1 = D0                 /* IF RTGOH ACCEPTABLE             */ 00186000
*  THEN DO;                       /* THEN PROCEED:                   */ 00187000
@RC00067 DS    0H                                                  0082 00188000
@RC00062 LA    @02,RESPONSE                                        0082 00189000
         ICM   @00,3,SRUSENS1(@02)                                 0082 00190000
         BNZ   @RF00082                                            0082 00191000
*    IF (RHFME = B1)              /* IF DEFINITIVE RESPONSE RQD      */ 00192000
*      & (RHEXCEPT = B0)          /* BUT NOT EXCEPTION ONLY          */ 00193000
*      THEN DO;                   /* THEN SEND (POSITIVE) RESPONSE   */ 00194000
         TM    RHFME+260(R10),B'10000000'                          0084 00195000
         BNO   @RF00084                                            0084 00196000
         TM    RHEXCEPT+260(R10),B'00010000'                       0084 00197000
         BNZ   @RF00084                                            0084 00198000
*        NCSPLCMD = NCSCFME;      /* SET CMD CODE TO SEND +FME       */ 00199000
         MVC   NCSPLCMD(2,R10),@CB00645                            0086 00200000
*        NCSPLOLN = LENGTH(RESPDATA); /* SET LENGTH OF RU DATA       */ 00201000
         MVC   NCSPLOLN(2,R10),@CH00117                            0087 00202000
*        NCSPLRUO = ADDR(RESPDATA); /* SET ADDRESS OF RESPONSE UNIT  */ 00203000
         LA    @02,RESPDATA                                        0088 00204000
         ST    @02,NCSPLRUO(,R10)                                  0088 00205000
*        CALL CALLCIO;            /* GO SEND (POSITIVE) RESPONSE     */ 00206000
         BAL   @14,CALLCIO                                         0089 00207000
*        END;                                                      0090 00208000
*      ELSE;                      /* OTHERWISE DO NOT SEND RESPONSE  */ 00209000
@RF00084 DS    0H                                                  0092 00210000
*  /*REG 3 TEST FOR CALLING ISTINCY5 REMOVED-ERROR IF NO     @VS42022*/ 00211000
*  /*           RESPONSE WAS SENT SINCE REG3 NOT INITIALIZED THEN    */ 00212000
*        DO; /* CPCALL(ISTINCY5) */                                0092 00213000
*        R01 = ADDR(ISTNCSPL);     /* SET INPUT REGISTER        */ 0093 00214000
         LR    R01,R10                                             0093 00215000
*        CALL ISTINCY5;    /* CALL SSCP SUBROUTINE      */         0094 00216000
*                                                                  0094 00217000
         L     @15,@CV00159                                        0094 00218000
         BALR  @14,@15                                             0094 00219000
*        DO;                                                       0095 00220000
*/***  CRRMAINT  RPHADD((NCSPLRPH))PROCNM(ISTINCY4)COMP(VY)FUNC(RET)  * 00221000
**/                                                                0096 00222000
*        /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/             0096 00223000
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0096 00224000
         L     @02,NCSPLRPH(,R10)                                  0096 00225000
         L     @02,RPHCRR(,@02)                                    0096 00226000
         L     @02,CRACRR(,@02)                                    0096 00227000
         XC    VYCCRT+1(11,@02),VYCCRT+1(@02)                      0096 00228000
         MVI   VYCCRT(@02),B'00000000'                             0096 00229000
*NCSPLRPH->RPHCRR->CRACRR->CINCY4 = '1'B;                          0097 00230000
         OI    CINCY4(@02),B'00000100'                             0097 00231000
*        END;                                                      0098 00232000
*        END; /* CPCALL(ISTINCY5) */        /* PROCESS RTGOH       0099 00233000
*XM00845*/                                                         0099 00234000
*    END;                                                          0100 00235000
*  ELSE                           /* IF RTGOH TO BE REJECTED         */ 00236000
*    IF RHFME = B1                /* AND EXCEPTION RESPONSE RQD      */ 00237000
*      THEN DO;                   /* THEN SEND (NEGATIVE) RESPONSE:  */ 00238000
         B     @RC00082                                            0101 00239000
@RF00082 TM    RHFME+260(R10),B'10000000'                          0101 00240000
         BNO   @RF00101                                            0101 00241000
*        NCSPLCMD = NCSCEXCP;     /* SET CMD CODE TO SEND -FME       */ 00242000
         MVC   NCSPLCMD(2,R10),@CB00646                            0103 00243000
*        NCSPLOLN = LENGTH(RESPONSE); /* SET LENGTH OF RU DATA       */ 00244000
         MVC   NCSPLOLN(2,R10),@CH00072                            0104 00245000
*        NCSPLRUO = ADDR(RESPONSE); /* SET ADDRESS OF RU             */ 00246000
         LA    @02,RESPONSE                                        0105 00247000
         ST    @02,NCSPLRUO(,R10)                                  0105 00248000
*        CALL CALLCIO;            /* GO SEND (NEGATIVE) RESPONSE     */ 00249000
         BAL   @14,CALLCIO                                         0106 00250000
*        END;                                                      0107 00251000
*/*                                                                  */ 00252000
*/* INTERNAL PROCEDURE TO INTERFACE TO ISTINCIO                      */ 00253000
*/*                                                                  */ 00254000
*CALLCIO:PROC OPTIONS(NOSAVE,NOSAVEAREA);                          0108 00255000
         B     @PB00002                                            0108 00256000
CALLCIO  DS    0H                                                  0109 00257000
*DCL R14SAVE FIXED(31);           /* A PLACE TO SAVE REGISTER 14     */ 00258000
*R14SAVE = R14;                   /* SAVE THE RETURN ADDRESS         */ 00259000
         LR    R14SAVE,R14                                         0110 00260000
*RFY (R00,R02) RSTD;              /* RESTRICT CIDCTL INTERFACE REGS  */ 00261000
*NCSPLSAF = D0;                   /* SET SAF = 0 (ONLY WANT CCNCB)   */ 00262000
         SLR   @09,@09                                             0112 00263000
         STH   @09,NCSPLSAF(,R10)                                  0112 00264000
*NCSPLDAF = NCSPLRPT->RPRDAF;     /* SET DAF = PU TO FIND CCNCB      */ 00265000
         L     @09,NCSPLRPT(,R10)                                  0113 00266000
         MVC   NCSPLDAF(2,R10),RPRDAF(@09)                         0113 00267000
*R01 = ADDR(ISTRPH);              /* GET ADDRESS OF THE RPH          */ 00268000
         L     R01,NCSPLRPH(,R10)                                  0114 00269000
*R02 = NCSPLCID;                  /* SET CIDCTL INPUT = CID FOR PU   */ 00270000
         L     R02,NCSPLCID(,R10)                                  0115 00271000
*RFY REG15 RSTD;                                           /*@AS09726*/ 00272000
*                                                                  0116 00273000
* DO; /* CIDCTL(FIND)  */                                          0117 00274000
*                                                                  0117 00275000
* RFY (EMCR2,EMCR3) RSTD;                                          0118 00276000
*                                                                  0118 00277000
* RFY ISTPAB  ;                                                    0119 00278000
* RFY ISTDYPAB;                                                    0120 00279000
* RFY ISTATCVT;                                                    0121 00280000
*   GEN SETS(RPHWORK)                                              0122 00281000
*        (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);      0122 00282000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              00283000
*   EMCR3 = '00'X; /*CLEAR EXTRA BITS*/                            0123 00284000
         SLR   EMCR3,EMCR3                                         0123 00285000
*   EMCR3 = '01'X; /*INDICATE SHARED LOCK*/                        0124 00286000
         LA    EMCR3,1                                             0124 00287000
*   CALL ATCLCPTR->ATCCDFND->ISTSDCCF; /*PROCESS REQUEST*/         0125 00288000
*                                                                  0125 00289000
         L     @09,ATCLCPTR                                        0125 00290000
         L     @15,ATCCDFND(,@09)                                  0125 00291000
         BALR  @14,@15                                             0125 00292000
* RFY (EMCR2,EMCR3) UNRSTD;                                        0126 00293000
* END; /*CIDCTL*/                   /* LOCATE CCNCB, GET DAF LOCK  0127 00294000
*/                                                                 0127 00295000
*IF REG15^=0                      /* IF CIDCTL NOT OK        @AS00926*/ 00296000
* THEN;                           /* DO NOT CALL CIO         @AS09726*/ 00297000
         LTR   REG15,REG15                                         0128 00298000
         BNZ   @RT00128                                            0128 00299000
* ELSE DO;                        /* GET CCNCB ADDR IF RC OK @AS09726*/ 00300000
*RFY REG15 UNRSTD;                                         /*@AS09726*/ 00301000
*R02 = R00;                       /* SET CIO INPUT REG = ADDR(CCNCB) */ 00302000
         LR    R02,R00                                             0132 00303000
* DO; /* CPCALL(ISTINCIO) */                                       0133 00304000
* R01 = ADDR(ISTNCSPL);     /* SET INPUT REGISTER        */        0134 00305000
         LR    R01,R10                                             0134 00306000
* CALL ISTINCIO;    /* CALL SSCP SUBROUTINE      */                0135 00307000
*                                                                  0135 00308000
         L     @15,@CV00180                                        0135 00309000
         BALR  @14,@15                                             0135 00310000
* DO;                                                              0136 00311000
*/***  CRRMAINT  RPHADD((NCSPLRPH))PROCNM(ISTINCY4)COMP(VY)FUNC(RET)  * 00312000
**/                                                                0137 00313000
* /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                    0137 00314000
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0137 00315000
         L     @09,NCSPLRPH(,R10)                                  0137 00316000
         L     @09,RPHCRR(,@09)                                    0137 00317000
         L     @09,CRACRR(,@09)                                    0137 00318000
         XC    VYCCRT+1(11,@09),VYCCRT+1(@09)                      0137 00319000
         MVI   VYCCRT(@09),B'00000000'                             0137 00320000
*NCSPLRPH->RPHCRR->CRACRR->CINCY4 = '1'B;                          0138 00321000
         OI    CINCY4(@09),B'00000100'                             0138 00322000
* END;                                                             0139 00323000
* END; /* CPCALL(ISTINCIO) */               /* GO SEND RESPONSE TO RTGO 00324000
*       */                                                         0140 00325000
* END;                                                     /*@AS09726*/ 00326000
*RFY (R00,R02) UNRSTD;            /* FREE CIDCTL, CIO INTERFACE REGS */ 00327000
@RT00128 DS    0H                                                  0143 00328000
*R14 = R14SAVE;                   /* REACQUIRE RETURN ADDRESS        */ 00329000
         LR    R14,R14SAVE                                         0143 00330000
*END;                             /* (RETURN TO THE CALLER)          */ 00331000
*                                                                  0144 00332000
@EL00002 DS    0H                                                  0144 00333000
@EF00002 DS    0H                                                  0144 00334000
@ER00002 BR    @14                                                 0144 00335000
@PB00002 DS    0H                                                  0145 00336000
*/* TPEPILOG   */                                                  0145 00337000
* GEN (PRINT OFF);                                                 0145 00338000
*                                                                  0145 00339000
         PRINT OFF                                                      00340000
*/* RPL HEADER                                                        * 00341000
*/*  REVISIONS                                         006 04/09/75   * 00342000
*DCL RPHPTR PTR(31) REGISTER(1) RESTRICTED;                        0146 00343000
*DCL  1  ISTRPH BDY(WORD) BASED(RPHPTR),                           0147 00344000
*       2  RPHCNTL FIXED(32),          /* CONTROL INFORMATION         * 00345000
*       3  RPHTYPE CHAR(1),            /* CONTROL BLOCK TYPE          * 00346000
*       3  RPHLNGTH PTR(8),            /* LENGTH IN BYTES             * 00347000
*       3  RPHFLAGS BIT(8),            /* SYSTEM DEPENDENT FLAGS      * 00348000
*         4  RPHOGIND BIT(1),          /* OPEN GATE INDICATOR         * 00349000
*         4  RPHSPGIN BIT(1),          /* SPECIAL GATE OPEN IND.      * 00350000
*         4  RPHAPTYP BIT(1),          /* APS IS A USER EXIT          * 00351000
*            5  RPHAUTEX BIT(1),        /*EXIT TO AUTHORIZED USER VS2 * 00352000
*         4  RPHSMQ BIT(1),            /* INDICATOR IF RPH IS TO BE   * 00353000
*                                      /* QUEUED                      * 00354000
*         4  RPHSMTYP BIT(1),          /* REQUEST TYPE IS BUFFER OR   * 00355000
*                                      /* DOUBLE-WORD                 * 00356000
*         4  RPHSMCLR BIT(1),          /* INDICATOR IF BUFFER TO BE   * 00357000
*                                      /* CLEARED                     * 00358000
*           4  RPHMLTCP BIT(1),        /* USED BY LOCAL 3270  SUPPORT * 00359000
*                                      /* WHEN BUILDING MULTIPLE CHAN * 00360000
*                                      /* PROGRAM                     * 00361000
*           4  RPHFSTLC BIT(1),        /* USED BY LOCAL 3270 SUPPORT  * 00362000
*                                      /* TO INDICATE FIRST LCCW      * 00363000
*              5  RPHFNFLG BIT(1),     /* LCCW SET FUNCTION FLAGS     * 00364000
*        3  RPHFLGB BIT(8),            /* SECOND FLAG BYTE            * 00365000
*           4  RPHLOCK BIT(1),         /* LOCKING OPTION              * 00366000
*           4  RPHBSSP BIT(1),         /* SYSTEM SERVICES PROGRESS    * 00367000
*           4  RPHFBAPS BIT(1),        /* STG. OBTAINED BY APS        * 00368000
*           4  RPHPGCMP BIT(1),        /* BIT ON INDICATES RESOURCE   * 00369000
*                                      /* MGR HAS COMPLETED UNLOCK    * 00370000
*           4  RPHNRSAV BIT(1),        /* DO NOT SAVE ON ACTIVATE     * 00371000
*           4  RPHRLCRA BIT(1),        /* RPH CAN BE RELEASED         * 00372000
*                                      /* WHEN PURGE COMPLETE         * 00373000
*           4  *        BIT(2),        /* RESERVED                    * 00374000
*       2  RPHRPHA PTR(31),            /* ADDR.OF NEXT RPL HEADER     * 00375000
*         3  RPHGATE BIT(1),           /* GATING FLAG                 * 00376000
*         3  *       BIT(7),           /* RESERVED                    * 00377000
*         3  RPHRPHAP PTR(24),                                     0147 00378000
*       2  RPHTSKID PTR(31),           /* TASK IDENTIFICATION         * 00379000
*                                      /* OR ADDR.OF APS TABLE        * 00380000
*          3  *     CHAR(3),           /* RPH TSK ID                  * 00381000
*          3  RPHTIK PTR(8),           /* TIK                         * 00382000
*       2  RPHDVTA PTR(31),            /* ADDR.OF  CURRENT DVT        * 00383000
*       2  RPHRESMA PTR(31) BDY(WORD), /* TPWAIT-POST INFO */      0147 00384000
*         3 RPHWPFLG CHAR(1),          /* WAIT-POST FLAGS */       0147 00385000
*           4 RPHRSKEY BIT(4),         /* STORAGE PROTECT KEY TO RESUME 00386000
*                                         PROCESSING                  * 00387000
*           4 RPHWT BIT(1),            /* WAIT BIT */              0147 00388000
*           4 RPHPT BIT(1),            /* POST BIT */              0147 00389000
*           4 RPHPURGE BIT(1),         /* RPH FLAGGED BY RECOVERY    */ 00390000
*                                      /* TO BE PURGED BY PSS        */ 00391000
*                                      /* VS/2 ONLY                  */ 00392000
*           4 RPHRSV01 BIT(1),        /* RESERVED                    */ 00393000
*         3 RPHRESUM PTR(24),          /* RESUME ADDRESS */        0147 00394000
*       2  RPHPABOF PTR(8),            /* OFFSET OF PAB IN CONTROL BLK* 00395000
*       2  RPHMAJCB PTR(24),           /* ADDR.OF MAJOR CONTROL BLOCK * 00396000
*       2  RPHWEA PTR(31),             /* ADDR.OF WORK ELEMENT        * 00397000
*         3  RPHCSPA PTR(31),          /* ADDR OF ISTCSP              * 00398000
*           4  RPHWEGT BIT(1),         /* GATE FOR WORK ELEMENT PROC. * 00399000
*       2  RPHSRPRM PTR(31),           /* SERVICE ROUTINE PARM.FIELD  * 00400000
*         3 RPHSRP12 FIXED(15),        /* COUNT OF Q'ED SMS REQUESTS  * 00401000
*         3 RPHSRP34 FIXED(15),        /* SIZE OF Q'ED SMS REQUESTS   * 00402000
*       2  RPHCRR PTR(31),             /* ADDR.OF COMPONENT RECOVERY  * 00403000
*                                      /* RECORD                      * 00404000
*       2  RPHPABQA PTR(31),           /* PAB QUEUE ADDRESS           * 00405000
*          3 RPHPABFG CHAR(1),         /* FLAG BYTE CARRIED FROM PAB  * 00406000
*          3 RPHPABQP PTR(24),         /* POINTER TO QUEUE OF PAB'S   * 00407000
*       2  RPHWORK CHAR(64) BDY(WORD), /* 16 WORD WORK AREA           * 00408000
*         3  RPHSAVE1 FIXED(31),       /*                             * 00409000
*           4  RPHSBYTE CHAR(1),       /* 1-BYTE SAVE FIELD           * 00410000
*           4  RPHSBITS BIT(8),        /* SAVE FIELD FOR FLAG BYTE    * 00411000
*              5  RPHSBIT1 BIT(1),     /* 1ST SAVE FIELD              * 00412000
*              5  RPHSBIT2 BIT(1),     /* 2ND SAVE FIELD              * 00413000
*              5  RPHSBIT3 BIT(1),     /* 3RD SAVE FIELD              * 00414000
*              5  RPHSBIT4 BIT(1),     /* 4TH SAVE FIELD              * 00415000
*              5  RPHSBIT5 BIT(1),     /* 5TH SAVE FIELD              * 00416000
*              5  RPHSBIT6 BIT(1),     /* 6TH SAVE FIELD              * 00417000
*              5  RPHSBIT7 BIT(1),     /* 7TH SAVE FIELD              * 00418000
*              5  RPHSBIT8 BIT(1),     /* 8TH SAVE FIELD              * 00419000
*           4  RPHSHALF FIXED(15),     /* HALF WORD SAVE AREA         * 00420000
*         3  RPHSAVE2 FIXED(31),       /*                             * 00421000
*         3  RPHSAVE3 FIXED(31),       /*                             * 00422000
*         3  RPHSAVE4 FIXED(31),       /*                             * 00423000
*         3  RPHSAVE5 FIXED(31),       /*                             * 00424000
*         3  RPHSAVE6 FIXED(31),       /*                             * 00425000
*         3  RPHSAVE7 FIXED(31),       /*                             * 00426000
*         3  RPHSAVE8 FIXED(31),       /*                             * 00427000
*         3  RPHSAVE9 FIXED(31),       /*                             * 00428000
*         3  RPHSAV10 FIXED(31),       /*                             * 00429000
*         3  RPHSAV11 FIXED(31),       /*                             * 00430000
*         3  RPHSAV12 FIXED(31),       /*                             * 00431000
*         3  RPHSAV13 FIXED(31),       /*                             * 00432000
*         3  RPHSAV14 FIXED(31),       /*                             * 00433000
*         3  RPHSAV15 FIXED(31),       /*                             * 00434000
*         3  RPHSAV16 FIXED(31),       /*                             * 00435000
*       2  RPHNEXPO PTR(31);           /* ADDR.NEXT RPH TO BE POSTED  * 00436000
* DCL RPTYPE BIT(8) CONSTANT('01'X);   /* TYPE CODE FOR RPH           * 00437000
* DCL RPHWT0 BIT(32) CONSTANT('F7FFFFFF'X);   /* TURN RPHWT OFF */ 0149 00438000
* DCL RPHWT1 BIT(32) CONSTANT('08000000'X);   /* TURN RPHWT ON */  0150 00439000
* DCL RPHPT0 BIT(32) CONSTANT('FBFFFFFF'X);   /* TURN RPHPT OFF */ 0151 00440000
* DCL RPHPT1 BIT(32) CONSTANT('04000000'X);   /* TURN RPHPT ON */  0152 00441000
* DCL RPHPABQ1 BIT(24) CONSTANT('000000'X); /* TURN RPHPBQ GATE */ 0153 00442000
*/*   PROGRAM OPERATOR MESSAGE HEADER                                */ 00443000
*DCL  1  ISTPOHD  BDY(WORD) BASED,                                 0154 00444000
*        2 POHRSVD1 CHAR(1),       /* RESERVED                       */ 00445000
*        2 POHSTAT,                /* HEADER STATUS BITS             */ 00446000
*          3 POHEND   BIT(1),      /* END LINE 1=YES                 */ 00447000
*          3 POHDATA  BIT(1),      /* DATA LINE 1=YES                */ 00448000
*          3 POHLBL   BIT(1),      /* LABEL LINE 1=YES               */ 00449000
*          3 POHCNTRL BIT(1),      /* CONTROL LINE 1=YES             */ 00450000
*          3 POHRSVD2 BIT(2),      /* RESERVED                       */ 00451000
*          3 POHRREQ  BIT(1),      /* REPLY REQUESTED 1=YES          */ 00452000
*          3 POHGEN   BIT(1),      /* ID ORIGIN  0=GENERATED BY VTAM */ 00453000
*                                  /*            1=GENERATED BY POA  */ 00454000
*        2 POHID    FIXED(16);     /* MESSAGE IDENTIFIER             */ 00455000
*/*            VTAM PREFIX FOR QUEUE ELEMENTS                         * 00456000
*/*  INITIAL LEVEL                                     001 03/04/75  */ 00457000
*DECLARE                                                           0155 00458000
*  1 ISTPFX  BDY(WORD)  BASED,                                     0155 00459000
*   2 PFXID        CHAR(4),             /* QUEUE ACRONYM (SAME AS  0155 00460000
*                                          QABID)                     * 00461000
*     3 PFXCBID    BIT(8),              /* CONTROL BLOCK ID           * 00462000
*   2 PFXPRTY      CHAR(1),             /* PRIORITY OF ELEMENT        * 00463000
*   2 PFXLNG       CHAR(3),             /* ELEMENT LENGTH,         0155 00464000
*                                          INCLUDING PREFIX           * 00465000
*   2 PFXFWD       PTR(31),   /* POINTER TO NEXT QUEUE             0155 00466000
*                                          ELEMENT (IF LAST        0155 00467000
*                                          POINTER TO QAB)            * 00468000
*   2 PFXBCK       PTR(31) ;   /* POINTER TO PREVIOUS              0155 00469000
*                                          QUEUE ELEMENT (IF       0155 00470000
*                                          FIRST, POINTER TO QAB)     * 00471000
*DCL NCSPLTYP BIT(8) CONSTANT('60'X);   /* NCSPL CONTROL BLOCK ID     * 00472000
*   /* NETWORK CONFIGURATION SERVICES CONTROL BLOCK  */            0157 00473000
*/*  REVISIONS                                         14 07/01/75  */  00474000
*DECLARE                                                           0157 00475000
*  1 ISTNCSPL BASED BDY(DWORD),                                    0157 00476000
*   2 *      CHAR(16) BDY(WORD),                                   0157 00477000
*     3 NCSPFX CHAR(LENGTH(ISTPFX)), /* QUE ELEMENT PREFIX           */ 00478000
*       4 *        CHAR(12),                                       0157 00479000
*       4 NCSCRWKA PTR(31),       /* PTR TO WORK AREA FOR C/R I/O    */ 00480000
*   2 *           BIT(8),         /*RESERVED                         */ 00481000
*   2 NCSPLVCD    BIT(8),         /*VERB CODE                        */ 00482000
*   2 NCSPLVBF    CHAR(2),        /*VERB MODIFIER FLAGS              */ 00483000
*      3 NCSVBF01 BIT(1),         /* UNUSED                          */ 00484000
*      3 NCSVBF02 BIT(1),         /* UNUSED                          */ 00485000
*      3 NCSVBF03 BIT(1),         /* MODIFY MSG SUP                  */ 00486000
*      3 NCSVBF04 BIT(1),         /* TYPE=VTAM                       */ 00487000
*      3 NCSVBF05 BIT(1),         /* LINETRACE=1                     */ 00488000
*      3 NCSVBF06 BIT(1),         /* I/O TRACE=1                     */ 00489000
*      3 NCSVBF07 BIT(1),         /* BUFFER TRACE=1                  */ 00490000
*      3 NCSVBF08 BIT(1),         /* MODIFY TPRINT                   */ 00491000
*      3 NCSVBF09 BIT(1),         /* MODIFY TEST                     */ 00492000
*      3 NCSVBF10 BIT(1),         /* MODIFY TRACE=NO                 */ 00493000
*      3 NCSVBF11 BIT(1),         /* VARY INTERNAL ONLY & MODIFY     */ 00494000
*                                 /*  TRACE = YES                    */ 00495000
*      3 NCSVBF12 BIT(1),         /* VARY IMMEDIATE  & MODIFY        */ 00496000
*                                 /*  NETSOL=NO                      */ 00497000
*      3 NCSVBF13 BIT(1),         /* MODIFY NETSOL=YES               */ 00498000
*      3 NCSVBF14 BIT(1),         /* VARY LOGON & MODIFY             */ 00499000
*                                 /*  CHANGE                         */ 00500000
*      3 NCSVBF15 BIT(1),         /* VARY DEACTIVATE & VARY NORMAL   */ 00501000
*                                 /*  CLOSE(ERP)                     */ 00502000
*      3 NCSVBF16 BIT(1),         /* VARY ACTIVATE & ERP REQUEST     */ 00503000
*                                 /*   & MODIFY DUMP                 */ 00504000
*   2 NCSPLVFL    CHAR(1),        /*COMMAND FLAGS                    */ 00505000
*    3 NCSVNCSA   BIT(1),         /*NCSPL IS ACTIVE                  */ 00506000
*    3 NCSVDEL    BIT(1),         /*DELETE NCSPL                     */ 00507000
*    3 NCSVSTAT   BIT(1),         /*INDICATE NCSPL WAS NOT GETMAINED */ 00508000
*    3 NCSDCONT   BIT(1),         /* DO DISCONACT                    */ 00509000
*    3 NCSABCON   BIT(1),         /* DO ABANDON CONNECTION           */ 00510000
*    3 NCSDACLK   BIT(1),         /* DO ACTIVATE LINE                */ 00511000
*    3 NCSRSV02   BIT(2),         /* RESERVED                        */ 00512000
*   2 NCSPLVF1    CHAR(1),        /* SPECIAL PROC FLAGS              */ 00513000
*    3 NCSOVFMC   BIT(1),         /* PURGE ONLY VARY'S FMCB          */ 00514000
*   2 NCSPRMRC    CHAR(1),        /* PURGE MINOR RETURN CODE FIELD   */ 00515000
*   2 NCSIORC     CHAR(1),        /* I/O OR RESTART RETURN CODE      */ 00516000
*   2 NCSRRNPT    CHAR(4),        /* ADDR RN ENTRY FOR LINE TRACE    */ 00517000
*   2 NCSPLRID    CHAR(8),        /*ID = 'NODENAME'                  */ 00518000
*   2 NCSPLLID    CHAR(8),        /*LOGON = 'NODENAME'               */ 00519000
*   2 NCSDLID     CHAR(6),        /* OFFHOOK ID                      */ 00520000
*   2 NCSCRCMD    FIXED(8),       /* C/R I/O COMMAND CODE            */ 00521000
*   2 NCSCRPID    PTR(8),         /* C/R PATH ID (PID)               */ 00522000
*   2 NCSPLRPT    PTR(31),        /*ID='NODENAME' RDTE ADDRESS       */ 00523000
*   2 NCSPLLPT    PTR(31),        /*LOGON/LOGOFF='NODENAME' RDTE ADDR*/ 00524000
*   2 NCSPLCMD    CHAR(2),        /*3705 CONTROL COMMAND CODES       */ 00525000
*     3 NCSCMDA  BIT(8),          /*RH FLAGS                         */ 00526000
*       4 NCSPLSYS BIT(1),        /*ON-SYSTEM OFF-FM                 */ 00527000
*       4 NCSPLCTL BIT(1),        /*ON-CONTROL OFF-DATA              */ 00528000
*       4 NCSPLSYN BIT(1),        /*ON=SYNCHR OFF-ASYNCHR            */ 00529000
*       4 NCSPLFLO BIT(1),        /*ON-WITH FLOW  OFF-AGAINST FLOW   */ 00530000
*       4 NCSPLUFM BIT(1),        /*ON=UNFORMATTED RU,OFF=FORMATTED  */ 00531000
*       4 *        BIT(3),        /*RESERVED                         */ 00532000
*     3 NCSCMDB  BIT(8),          /*COMMAND FIELD                    */ 00533000
*   2 NCSNCPEP    BIT(8),         /* EP SUBCHANNEL ADDR              */ 00534000
*   2 NCSMSGSP    CHAR(1),        /* RESERVED FOR MESSAGE SURPRESSION*/ 00535000
*   2 NCSPLUAD    CHAR(3),        /*U = 'UNIT ADDRESS'               */ 00536000
*   2 NCSCRFLG    CHAR(1),        /* MISCELLANEOUS C/R FLAGS         */ 00537000
*     3 NCSPLWRM    BIT(1),       /* COMMAND SPECIFIED WARM PARAM,   */ 00538000
*                                 /* 1 = YES                         */ 00539000
*     3 NCSPLCLD    BIT(1),       /* COMMAND SPECIFIED COLD PARAM,   */ 00540000
*                                 /* 1 = YES                         */ 00541000
*     3 NCSFMCLD    BIT(1),       /* 370X RESPONDED COLD TO ACTPU    */ 00542000
*                                 /* (ERP), 1 = YES                  */ 00543000
*     3 NCSFMERP    BIT(1),       /* 370X RESPONDED ERP TO ACTPU     */ 00544000
*                                 /* (ERP), 1 = YES                  */ 00545000
*     3 NCSCRDSE    BIT(1),       /* 0=C/R DATA SET DOES NOT EXIST   */ 00546000
*                                 /* OR IS NULL                      */ 00547000
*                                 /* 1=C/R DATA SET EXISTS           */ 00548000
*                                 /* AND IS NOT NULL                 */ 00549000
*     3 NCSOPRQU    BIT(1),       /* OPERATOR REQUESTS REIPL, 1 = YES*/ 00550000
*     3 NCSUSRNF    BIT(1),       /* EARLY WARNING PURGE HAS ALREADY */ 00551000
*                                 /* OCCURED, 1 = YES                */ 00552000
*     3 NCSSTCMD    BIT(1),       /* ACTIVATE IS A RESULT OF         */ 00553000
*                                 /* START VTAM COMMAND, 1 = YES     */ 00554000
*   2 NCSPLWRE    BIT(32),        /* WTOR ECB                        */ 00555000
*   2 NCSPLWRF    CHAR(72),       /* WTOR REPLY AREA                 */ 00556000
*   2 NCSPLRAD    PTR(31),        /* RDTE PTR FOR ALLOCATE/DEALLOCATE*/ 00557000
*     3 NCSLSCMD BIT(8),          /* LINE SCHED COMMAND TYPE         */ 00558000
*     3 NCSPLRCD BIT(8),          /* HEX VALUE FOR LINE SCHED PARAM  */ 00559000
*   2 NCSIOCID    CHAR(4),        /* CURRENT CID FOR DAF LOCK HELD   */ 00560000
*     3  NCSPLCID CHAR(4),        /* ALIAS FOR ABOVE                 */ 00561000
*        4  NCSPLSAF  CHAR(2),    /* SOURCE ADDRESS                  */ 00562000
*        4  NCSPLDAF  CHAR(2),    /* DESTINATION ADDRESS             */ 00563000
*   2 NCSPLWKA    PTR(31),        /* NCS WORK AREA ADDRESS           */ 00564000
*   2 NCSPLCVT    PTR(31),        /* POINTER TO VTAM CVT             */ 00565000
*   2 NCSPLRPH    PTR(31),        /* POINTER TO RPH                  */ 00566000
*   2 NCSPLECB    BIT(32),        /* ECB FOR VARY PGS                */ 00567000
*   2 NCSPLFSB    PTR(31),        /* ADDRESS OF USS-FSS FSB OR RU    */ 00568000
*   2 NCSPLRCR    PTR(31),        /* ADDRESS RDTE FOR CR             */ 00569000
*   2 NCSPLFL1    CHAR(1),        /* VARY FLAGS                      */ 00570000
*     3 NCSPL2IN  BIT(1),         /* SECOND ENTRY                    */ 00571000
*     3 NCSPLSOM  BIT(1),         /* SUPRESS OP. MESSAGE             */ 00572000
*     3 NCSPLEBN  BIT(1),         /* ENTRY FROM BNN SSCP             */ 00573000
*     3 NCSPLREQ  BIT(1),         /* NCSPL FROM RESTORE              */ 00574000
*     3 NCSPLNON  BIT(1),         /* DO NOT ADDR RDT SEGMENT         */ 00575000
*     3 NCSPLAPU  BIT(1),         /* ACTIVATE PHYSICAL DONE BY LOAD  */ 00576000
*     3 NCSPL2CN  BIT(1),         /* SECOND CONTACT REQUEST          */ 00577000
*     3 NCSPLPOS  BIT(1),         /* BNN POSTED                      */ 00578000
*   2 NCSPLFL2    CHAR(1),        /* VARY FLAGS                      */ 00579000
*     3 NCSPLVDP  BIT(1),         /* NCSPL ON VARDEF PAB             */ 00580000
*     3 NCSPLRSF  BIT(1),         /* NO SICK CLEAR BEFORE I/O        */ 00581000
*     3 NCSPLRIO  BIT(1),         /* I/O = RESTART I/O               */ 00582000
*     3 NCSOUFMC  BIT(1),         /* PURGE ONLY USER FMCB            */ 00583000
*     3 NCSPLDS   BIT(1),         /* 1=CIO SAVED RESPONSE DATA       */ 00584000
*     3 NCSREMPO  BIT(1),         /* REMOTE POWER OFF SPEC BY OPER   */ 00585000
*     3 NCSPLVIS  BIT(1),         /* VARY IMM START CALLER OF CVP    */ 00586000
*     3 NCSPLVIT  BIT(1),         /* VARY IMM TERM CALLER OF CVP     */ 00587000
*   2 NCSPLFL3    CHAR(1),        /* FLAG BYTE                       */ 00588000
*     3 NCSPLMOM  BIT(1),         /* ERP CAUSED BY FAILURE OF      0157 00589000
*                                    HIGHER NODE                     */ 00590000
*     3 NCSEPP    BIT(1),         /* 1=EP SUBCHANNEL PRESENT         */ 00591000
*     3 NCSPLANS  BIT(1),         /* ON FOR ACT IN ANSWER MODE       */ 00592000
*                                 /* OFF FOR ACT IN NON-ANSWER MODE  */ 00593000
*     3 NCSGID    BIT(1),         /* ON FOR PATH WITH GID PARM       */ 00594000
*     3 NCSPID    BIT(1),         /* ON FOR PATH WITH PID PARM       */ 00595000
*     3 NCSANS    BIT(1),         /* ON FOR ACTIVATE WITH ANS PARM   */ 00596000
*     3 NCSFINAL  BIT(1),         /* FINAL PARM EXISTS               */ 00597000
*     3 NCSEND    BIT(1),         /* END PARM EXISTS                 */ 00598000
*   2 NCSPLFL4    CHAR(1),        /* FLAG BYTE                       */ 00599000
*     3 NCSDLNID  BIT(1),         /* ID PRESENT IN NCSPL - OFF       */ 00600000
*     3 NCSPLRSO  BIT(1),         /* RESET ONLY                      */ 00601000
*     3 NCSPLVID  BIT(1),         /* ORIG CMD WAS MODIFY DUMP        */ 00602000
*     3 NCSDSPE   BIT(1),         /* DISPLAY EVERY                   */ 00603000
*     3 NCSDSPA   BIT(1),         /* DISPLAY ACT                     */ 00604000
*     3 NCSDSPI   BIT(1),         /* DISPLAY INACT                   */ 00605000
*     3 NCSDSPN   BIT(1),         /* DISPLAY NONE                    */ 00606000
*     3 NCSPL2AP  BIT(1),         /* SECOND ACTPU TO 320X            */ 00607000
*   2 NCSDLRSN    CHAR(1),        /* DIAL REASON CODES               */ 00608000
*   2 NCSPLFL5    CHAR(1),        /* FLAG BYTE                       */ 00609000
*     3 NCSSCPPS  BIT(1),         /* SSCP WORK AREA IN PVT STORAGE   */ 00610000
*     3 NCSSDLK   BIT(1),         /* ON-SDLC LINK PROCESSED          */ 00611000
*     3 NCSFORCE  BIT(1),         /* FORCED DEACT IN PROGRESS        */ 00612000
*     3 *         BIT(5),         /* RESERVED                        */ 00613000
*   2 NCSPLOLN    FIXED(15),      /* LENGTH O/B RU                   */ 00614000
*   2 NCSPLP1     PTR(31),        /* ADDR VARY PAB                   */ 00615000
*   2 NCSPLP2     PTR(31),        /* ADDR D/L/R PAB                  */ 00616000
*   2 NCSPLP3     PTR(31),        /* ADDR ERP PAB                    */ 00617000
*   2 NCSPLSPL    PTR(31),        /* ADDR ASSOC. NCSPL               */ 00618000
*   2 NCSPLWEL    PTR(31),        /* ADDR POST RPH                   */ 00619000
*   2 NCSPLRRP    PTR(31),        /* ADDR REMOTE RN RDTE IN LOCAL RDT*/ 00620000
*   2 NCSPLRUO    PTR(31),        /* ADDR O/B RU                     */ 00621000
*   2 NCSPLRUI    PTR(31),        /* ADDR BUFFER FOR I/B RU          */ 00622000
*   2 NCSPLAPP    PTR(31),        /* ADDR NCSPL APPENDAGE            */ 00623000
*   2 NCSRNAME    CHAR(8),        /* RNAME=FROM VARY ACTIVATE        */ 00624000
*   2 NCSPLSQN    FIXED(15),      /* SEQUENCE=NR. FOR RESPONSE       */ 00625000
*   2 NCSPLGID    BIT(8),         /* BINARY REP OF GID VALUE         */ 00626000
*   2 NCSPLPID    BIT(8),         /* BINARY REP OF PID VALUE         */ 00627000
*   2 NCSPLMID    CHAR(8),        /* LOGMODE = 'MODENAME'            */ 00628000
*   2 NCSPLNSN    PTR(31),        /* RDTE NSNEA AT CLSDST            */ 00629000
*   2 NCSSENSE    CHAR(4),        /* SENSE                           */ 00630000
*     3 NCSSNS1  CHAR(1),         /* SENSE DATA MAJOR CODE           */ 00631000
*     3 NCSSNS2  CHAR(1),         /* SENSE MODIFIER BYTE             */ 00632000
*     3 NCSSENS2 CHAR(2),         /* USER SENSE DATA                 */ 00633000
*   2 NCSCPWPT    PTR(31),        /* ADDRESS OF CPWA                 */ 00634000
*   2 NCSMGLPT    PTR(31),        /* PTR TO USS/FSS MSG PARAM LIST   */ 00635000
*   2 NCSUFMCB    PTR(31),        /* POINTER TO SSCP-LU FMCB         */ 00636000
*   2 NCSPLRH     CHAR(3),        /* REQUEST RH                      */ 00637000
*   2 NCSPLRTY    CHAR(1),        /* TYPE FROM RTGOH RU              */ 00638000
*   2 NCSCRDTE    PTR(31),        /* PTR TO RDTE BEING PROCESSED     */ 00639000
*                                 /* FOR C/R I/O                     */ 00640000
*   2 NCSCRMSK,                   /* FLAGS FOR C/R CHECK POINTING    */ 00641000
*     3 NCSCHKPT    CHAR(2),      /* FLAGS FOR ITEMS CHECK POINTED   */ 00642000
*       4 NCSACTV     BIT(1),     /* ACTICE/INACTIVE STATUS CHANGED  */ 00643000
*                                 /* 1 = YES                         */ 00644000
*       4 NCSPACTV    BIT(1),     /* PORT ACT/INACTIVE STATUS CHANGED*/ 00645000
*                                 /* 1 = YES                         */ 00646000
*       4 NCSPOLD     BIT(1),     /* POLL DELAY VALUE CHANGED, 1=YES */ 00647000
*       4 NCSNRPL     BIT(1),     /* NEGATIVE RESPONSE TO POLL       */ 00648000
*                                 /* LIMIT VALUE CHANGED, 1 = YES    */ 00649000
*       4 NCSESLM     BIT(1),     /* SESSION LIMIT VALUE CHANGED,1=YES* 00650000
*       4 NCSDTRLM    BIT(1),     /* DEVICE TRANSMISSION LIMIT       */ 00651000
*                                 /* VALUE CHANGED, 1 = YES          */ 00652000
*       4 NCSLGAPL    BIT(1),     /* APPLICATION CONTROLLER NAME     */ 00653000
*                                 /* (LOGAPPL) CHANGED, 1 = YES      */ 00654000
*       4 NCSLGMOD    BIT(1),     /* LOGON MODE (LOGMODE)            */ 00655000
*                                 /* CHANGED, 1 = YES                */ 00656000
*       4 NCSANSMD    BIT(1),     /* ANSWER MODE STATUS CHANGED,1=YES*/ 00657000
*       4 NCSCUA      BIT(1),     /* CUA VALUE CHANGED, 1 = YES      */ 00658000
*       4 NCSRNME     BIT(1),     /* RNAME VALUE CHANGED, 1 = YES    */ 00659000
*       4 NCSPTUSE    BIT(1),     /* PATH USE/NOUSE STATUS CHANGED   */ 00660000
*                                 /* 1 = YES                         */ 00661000
*       4 NCSRSVD1    BIT(4),     /* RESERVED                        */ 00662000
*     3 NCSCRMOD    CHAR(1),      /* NEW VALUES FOR ITEMS CHECKPOINTED* 00663000
*                                 /* NOT OBTAINED FROM RDTE          */ 00664000
*       4 NCSAIMOD    BIT(1),     /* ACTIVE/INACTIVE STATUS, 1=ACTIVE*/ 00665000
*       4 NCSPTMOD    BIT(1),     /* PORT ACT/INACT STATUS, 1=ACTIVE */ 00666000
*       4 NCSRSVD2    BIT(6),     /* RESERVED                        */ 00667000
*   2 NCSPLSID BDY(BYTE),         /* MESSAGE ROUTING INFORMATION     */ 00668000
*     3 NCSPLSTA    CHAR(1),      /* STATUS FLAG BYTE                */ 00669000
*       4 NCSRSVD4    BIT(7),     /* RESERVED                        */ 00670000
*       4 NCSPLPO     BIT(1),     /* 0 = CONSOLE ID FOLLOWS, 1 =     */ 00671000
*                                 /* PROGRAM OPERATOR HEADER FOLLOWS */ 00672000
*     3 NCSPLPHD CHAR(LENGTH(ISTPOHD)), /* PO HEADER IF NCSPLPO = 01 */ 00673000
*       4 NCSPLNID    FIXED(8),   /* CONSOLE ID IF NCSPLPO = 0       */ 00674000
*     3 NCSPLPDB    PTR(31);      /* PTR TO PO ACDEB PREFIX          */ 00675000
*/*   COMMAND VALUES FOR C/R FIELD NCSCRCMD                          */ 00676000
*DCL NCSCRWR  FIXED(8) CONSTANT(0);  /* WRITE TO C/R DATA SET        */ 00677000
*DCL NCSCROPN FIXED(8) CONSTANT(1);  /* OPEN C/R DATA SET            */ 00678000
*DCL NCSCRCLS FIXED(8) CONSTANT(2);  /* CLOSE C/R DATA SET           */ 00679000
*DCL NCSCRDEL FIXED(8) CONSTANT(3);  /* DELETE C/R DATA SET RECORD   */ 00680000
*DCL NCSCROPQ FIXED(8) CONSTANT(4);  /* OPERATOR QUERY               */ 00681000
*DCL NCSDCID  FIXED(8) CONSTANT(1);  /* CONSOLE ID INDICATOR         */ 00682000
*DCL NCSCRIO  BIT(16) CONSTANT('0800'X); /* INDICATES REQUESTS       */ 00683000
*                                        /* FOR VSAM I/O FOR C/R     */ 00684000
*DCL NCSCRVIO BIT(16) CONSTANT('0C00'X); /* VSAM I/O OPERATION       */ 00685000
*/* NCSPL APPENDAGE DEFINATION                                       */ 00686000
*DCL  1  NCSAPP BASED(NCSPLAPP),                                   0166 00687000
*        2 NCSAPSA  CHAR(72),     /* SAVE AREA                       */ 00688000
*        2 NCSAPECB CHAR(4),      /* ECB                             */ 00689000
*        2 NCSAPTXT CHAR(8),      /* DUMP DATA                       */ 00690000
*        2 NCSAPEND PTR(31),      /* HIGH STORAGE ADDRESS            */ 00691000
*        2 NCSAPBUE CHAR(520),                                     0166 00692000
*          3 NCSRSV04 CHAR(3),    /* RESERVED                        */ 00693000
*          3 NCSAPRU  CHAR(5),    /* IPL CMD RU PREFIX               */ 00694000
*          3 NCSAPDAT CHAR(512),  /* RESP FOR DUMP, O/B LOAD         */ 00695000
*        2 NCSAPPAB PTR(31);      /* BNN VARY PAB ADDR               */ 00696000
*/*    USS/FSS RU AREA MAP                                           */ 00697000
*DCL  1  NCSUSSRU BASED(NCSPLFSB),                                 0167 00698000
*        2 NCSRULEN FIXED(15),    /* LENGTH OF RU                    */ 00699000
*        2 NCSRUITS CHAR(*);      /* START OF RU                     */ 00700000
*/*    GENERAL CONSTANTS                                             */ 00701000
*DCL NCSWASZ  FIXED(15) CONSTANT(2032);   /* NCSPL WORK AREA SIZE    */ 00702000
*DCL NCSRTGOH BIT(16) CONSTANT('1000'X);  /* VBF VALUE FOR INTERNAL  */ 00703000
*                                         /* COMMAND-RTGOH RECVD.    */ 00704000
*/*    CONSTANTS FOR VERB CODES                                      */ 00705000
*DCL NCSPLVC0 BIT(08) CONSTANT('00'X);    /* ERROR                   */ 00706000
*DCL NCSPLVC1 BIT(08) CONSTANT('01'X);    /* VARY                    */ 00707000
*DCL NCSPLVC2 BIT(08) CONSTANT('02'X);    /* MODIFY                  */ 00708000
*DCL NCSPLVC3 BIT(08) CONSTANT('03'X);    /* ERP                     */ 00709000
*DCL NCSPLVC4 BIT(08) CONSTANT('04'X);    /* DISPLAY                 */ 00710000
*DCL NCSPLVC5 BIT(08) CONSTANT('05'X);    /* STATUS TO SM            */ 00711000
*DCL NCSPLVC6 BIT(08) CONSTANT('06'X);    /* INTERNAL CMD            */ 00712000
*DCL NCSPLVC7 BIT(08) CONSTANT('07'X);    /* INIT/TERM TUSM          */ 00713000
*DCL NCSPLVC8 BIT(08) CONSTANT('08'X);    /* DIAL                    */ 00714000
*/*    CONSTANTS FOR VARY COMMAND MODIFIERS                          */ 00715000
*DCL NCSVACT BIT(16) CONSTANT('0001'X);   /*ACTIVATE                 */ 00716000
*DCL NCSVDEA BIT(16) CONSTANT('0002'X);   /* DEACTIVATE              */ 00717000
*DCL NCSVLON BIT(16) CONSTANT('0004'X);   /* LOGON                   */ 00718000
*DCL NCSVVPP BIT(16) CONSTANT('0080'X);   /* VARY NORMAL CLEANUP REQST* 00719000
*DCL NCSVIMM BIT(16) CONSTANT('0010'X);   /* IMMEDIATE               */ 00720000
*DCL NCSVINT BIT(16) CONSTANT('0020'X);   /* INTERNAL ONLY           */ 00721000
*DCL NCSVALO BIT(16) CONSTANT('0005'X);   /* ACTIVATE WITH LOGON     */ 00722000
*DCL NCSVDEI BIT(16) CONSTANT('0012'X);   /* DEACTIVATE IMMEDIATE    */ 00723000
*DCL NCSVDII BIT(16) CONSTANT('0032'X);   /* DEACTIV. IMMEDIATE INTERNA 00724000
*                                            ONLY*/                0187 00725000
*DCL NCSCNOTF BIT(16) CONSTANT('FFF8'X);  /* NOTIFY REQUEST          */ 00726000
*DCL NCSVANON BIT(16) CONSTANT('0008'X);  /* ANSWER = ON             */ 00727000
*DCL NCSVANOF BIT(16) CONSTANT('0040'X);  /* ANSWER = OFF            */ 00728000
*DCL NCSVPUSE BIT(16) CONSTANT('0100'X);  /* PATH = USABLE           */ 00729000
*DCL NCSVPNUS BIT(16) CONSTANT('0200'X);  /* PATH = NOT USABLE       */ 00730000
*DCL NCSVINOP BIT(16) CONSTANT('0400'X);  /* INOPERATIVE             */ 00731000
*/*    CONSTANTS FOR MODIFY COMMAND MODIFIERS                        */ 00732000
*DCL NCSMDUM BIT(16) CONSTANT('0001'X);   /* DUMP 3705               */ 00733000
*DCL NCSMCHA BIT(16) CONSTANT('0004'X);   /* CHANGE                  */ 00734000
*DCL NCSMNSY BIT(16) CONSTANT('0008'X);   /* NETSOL = YES            */ 00735000
*DCL NCSMNSN BIT(16) CONSTANT('0010'X);   /* NETSOL = NO             */ 00736000
*DCL NCSMTRY BIT(16) CONSTANT('0020'X);   /* TRACE = YES             */ 00737000
*DCL NCSMVTRY BIT(16) CONSTANT('1020'X);                           0199 00738000
*DCL NCSMVTRN BIT(16) CONSTANT('1040'X);                           0200 00739000
*DCL NCSMTRN BIT(16) CONSTANT('0040'X);   /* TRACE = NO              */ 00740000
*DCL NCSMTPR BIT(16) CONSTANT('0100'X);   /* TRACE PRINT             */ 00741000
*DCL NCSMTST BIT(16) CONSTANT('0080'X);   /* MODIFY TEST             */ 00742000
*DCL NCSDPF   BIT(16) CONSTANT('0000'X);  /* POTENTIAL FAIL          */ 00743000
*DCL NCSDSTRT BIT(16) CONSTANT('0001'X);  /* DIAL START              */ 00744000
*DCL NCSDOH1  BIT(16) CONSTANT('0002'X);  /* OFFHOOK 1               */ 00745000
*DCL NCSDOH2  BIT(16) CONSTANT('0004'X);  /* OFFHOOK 2               */ 00746000
*DCL NCSDDF   BIT(16) CONSTANT('0010'X);  /* DIAL FAILED             */ 00747000
*DCL NCSDLKS  BIT(16) CONSTANT('0008'X);  /* LINK START              */ 00748000
*DCL NCSDLKC  BIT(16) CONSTANT('0020'X);  /* LINK COMPLETION         */ 00749000
*DCL NCSDHU   BIT(16) CONSTANT('0040'X);  /* HANGUP                  */ 00750000
*DCL NCSDLK   BIT(16) CONSTANT('0080'X);  /* DEALLOCATE              */ 00751000
*DCL NCSDGIVE BIT(16) CONSTANT('0100'X);  /* GIVE                    */ 00752000
*DCL NCSDINOP BIT(16) CONSTANT('0200'X);  /* INOP                    */ 00753000
*DCL NCSDLRST BIT(16) CONSTANT('0400'X);  /* RECOVERY SW LINKS       */ 00754000
*                                         /* AFTER RN FAILURE        */ 00755000
*/*    CONSTANTS FOR ERP COMMAND MODIFIERS                           */ 00756000
*DCL NCSEERRA BIT(16) CONSTANT('0001'X);  /* ERP REQUEST          */    00757000
*DCL NCSECLOR BIT(16) CONSTANT('0002'X);  /* VARY NORMAL CLOSE REQUEST* 00758000
*DCL NCSEDACT BIT(16) CONSTANT('0004'X);  /* ERP DEACTIVATE REQUEST   * 00759000
*DCL NCSERSTR BIT(16) CONSTANT('0008'X);/* RSTRT ENTRY FROM DLR PROC */ 00760000
*DCL NCSVFORC BIT(16) CONSTANT('0802'X);/* FORCED DEACT              */ 00761000
*DCL NCSVRACT BIT(16) CONSTANT('1002'X);/* DEACT AND REACT           */ 00762000
*/*   PURGE MINOR RETURN CODES CONSTANTS                             */ 00763000
*DCL NCSAPABN BIT(8) CONSTANT('05'X),    /* APPLICATION ABEND        */ 00764000
*    NCSCLDST BIT(8) CONSTANT('06'X),    /* CLOSE DEST OCCURED       */ 00765000
*    NCSDDISC BIT(8) CONSTANT('08'X),    /* DIAL DISCONNECT OCCURED     00766000
*                                           - CONN NO LONGER AVAILABL*/ 00767000
*    NCSBTHEX BIT(8) CONSTANT('09'X);    /* BUFFER THRESHOLD EXCEEDED*/ 00768000
*/*   I/O OR RESTART RETURN CODES CONSTANTS                          */ 00769000
*DCL NCSIOSUC BIT(8) CONSTANT('00'X),    /* I/O SUCCESSFUL           */ 00770000
*    NCSIOERR BIT(8) CONSTANT('04'X),    /* I/O ERROR                */ 00771000
*    NCSIOPRG BIT(8) CONSTANT('08'X),    /* I/O PURGED               */ 00772000
*    NCSRSSUC BIT(8) CONSTANT('00'X),    /* RESTART SUCCESSFUL       */ 00773000
*    NCSRSERR BIT(8) CONSTANT('04'X),    /* RESTART ERROR            */ 00774000
*    NCSVAIPL BIT(8) CONSTANT('00'X),  /* IPL NO RESTART ON VARY ACTV*/ 00775000
*    NCSVANRA BIT(8) CONSTANT('10'X),    /* IPL SUCCESSFUL, NO RESTART  00776000
*                                           AVAILABLE ON VARY ACTIVE  * 00777000
*    NCSVAWMF BIT(8) CONSTANT('08'X),    /* WARM START FAILURE FOR 0223 00778000
*                                           VARY ACTIVATE            */ 00779000
*    NCSVAIPF BIT(8) CONSTANT('0C'X),   /* IPL FAILED ON VARY ACTIVATE* 00780000
*    NCSDSIA  BIT(8) CONSTANT('14'X),   /* INVALID ADDRESS SPECIFIED    00781000
*                                          ON DISPLAY STORAGE CMND    * 00782000
*    NCSVAISZ BIT(8) CONSTANT('08'X),   /* NCP SIZE TOO LARGE         * 00783000
*    NCSIPLSC BIT(8) CONSTANT('00'X),   /* IPL SUCCESSFUL             * 00784000
*    NCSIOER  BIT(8) CONSTANT('0C'X),   /* I/O ERROR ON REMOTE IPL    * 00785000
*    NCSNCPAC BIT(8) CONSTANT('04'X),   /* REMOTE NCP ALREADY ACTIVE  * 00786000
*    NCSNCRPF BIT(8) CONSTANT('70'X),   /* REMOTE POWER OFF           * 00787000
*    NCSCRIOS BIT(8) CONSTANT('30'X),   /* SUCCESSFUL I/O             * 00788000
*    NCSCRION BIT(8) CONSTANT('34'X),   /* NULL D.S. OPENED           * 00789000
*    NCSCRIOF BIT(8) CONSTANT('38'X);   /* FAILURE ON I/O             * 00790000
*/*           CONSTANTS FOR LIBERTY SUPPORT                           * 00791000
*DCL  NCSES   BIT(16) CONSTANT('0001'X),/* END SESSION                * 00792000
*     NCSBF   BIT(16) CONSTANT('0002'X),/* BIND FAILURE               * 00793000
*     NCSUF   BIT(16) CONSTANT('0004'X),/* UNBIND FAILURE             * 00794000
*     NCSINIT BIT(16) CONSTANT('0001'X),                           0224 00795000
*     NCSTERM BIT(16) CONSTANT('0002'X);                           0224 00796000
*DCL NCSTPPST BIT(16) CONSTANT('0001'X);/* TPPST COMMAND              * 00797000
*DCL NCSII    BIT(16) CONSTANT('0002'X);/* IPL INIT COMMAND           * 00798000
*DCL NCSIT    BIT(16) CONSTANT('0004'X);/* IPL COMMAND                * 00799000
*DCL NCSIF    BIT(16) CONSTANT('0008'X);/* IPL FINAL COMMAND          * 00800000
*DCL NCSDI    BIT(16) CONSTANT('0010'X);/* DUMP INIT COMMAND          * 00801000
*DCL NCSDT    BIT(16) CONSTANT('0020'X);/* DUMP TEXT COMMAND          * 00802000
*DCL NCSDF    BIT(16) CONSTANT('0040'X);/* DUMP FINAL COMMAND         * 00803000
*DCL NCSCON   BIT(16) CONSTANT('0080'X);/* CONTACT COMMAND            * 00804000
*DCL NCSDICON BIT(16) CONSTANT('0100'X);/* DISCONTACT COMMAND         * 00805000
*DCL NCSMSFMD BIT(16) CONSTANT('0200'X);/* SEND FMD                   * 00806000
*DCL NCSSEND  BIT(16) CONSTANT('0400'X);/* SEND                       * 00807000
*DCL NCSPURGE BIT(16) CONSTANT('0800'X);/* PAB PURGE                  * 00808000
*DCL NCSMSSUP BIT(16) CONSTANT('2000'X);/* CONSTANT FOR MSG SUP       * 00809000
*DCL NCSCRDS  BIT(16) CONSTANT('3023'X);/* RECORD DEV STATS COMMAND   * 00810000
*DCL NCSCQUIS BIT(16) CONSTANT('F01A'X);/* QUIESCE COMMAND            * 00811000
*DCL NCSSNUSS BIT(16) CONSTANT('381F'X);/* SEND USS MESSAGE           * 00812000
*/*                                                                   * 00813000
*DCL NCSNC    BIT(8)  CONSTANT('04'X);  /* NOT CONTACTED              * 00814000
*DCL NCSLD    BIT(8)  CONSTANT('00'X);  /* CONTACTED LOADED           * 00815000
*DCL NCSNLD   BIT(8)  CONSTANT('0C'X);  /* CONTACTED NEEDS LOAD       * 00816000
*DCL NCSNCD   BIT(8)  CONSTANT('08'X);  /* NOT CONTACTED DUE TO DEACT * 00817000
*DCL NCSNCE   BIT(8)  CONSTANT('10'X);  /* NOT CONTACTED DUE TO ERP   * 00818000
*DCL NCSNFME  BIT(8)  CONSTANT('24'X);  /* NEGATIVE FME               * 00819000
*/*  CONSTANTS FOR IORC FOR DISPLAY STORAGE                          */ 00820000
*DCL NCSDSDEA BIT(8)  CONSTANT('0C'X);  /* PRIOR DEACT                * 00821000
*DCL NCSDSFAL BIT(8)  CONSTANT('04'X);  /* FAIL OTHER THAN PRIOR DEACT* 00822000
*/* TYPE CODES FOR CONFIGURATION RESTART                              * 00823000
*DCL NCSCTRLM BIT(8) CONSTANT('01'X);   /* CHANGE DEV TRANS LIMIT     * 00824000
*DCL NCSCNPOL BIT(8) CONSTANT('02'X);   /* CHANGE NEG POLL RESP LIMIT * 00825000
*DCL NCSCSESS BIT(8) CONSTANT('03'X);   /* CHANGE SESSION LIMIT       * 00826000
*DCL NCSCPOLL BIT(8) CONSTANT('04'X);   /* CHANGE LINE SERV SEEK PAUSE* 00827000
*/*  FM DATA COMMAND CODES                                            * 00828000
*DCL NCSCAPU  BIT(16) CONSTANT('D001'X);   /* ACT PHYS                * 00829000
*DCL NCSCDPU  BIT(16) CONSTANT('D002'X);   /* DEACT PHYS              * 00830000
*DCL NCSCALU  BIT(16) CONSTANT('D003'X);   /* ACT LOG                 * 00831000
*DCL NCSCDLU  BIT(16) CONSTANT('D004'X);   /* DEACT LOG               * 00832000
*DCL NCSCSDT  BIT(16) CONSTANT('D005'X);   /* SDT                     * 00833000
*DCL NCSCFME  BIT(16) CONSTANT('2006'X);   /* SEND POS RESP           * 00834000
*DCL NCSCEXCP BIT(16) CONSTANT('2007'X);   /* SEND NEG RESP           * 00835000
*DCL NCSCCON  BIT(16) CONSTANT('3008'X);   /* CONTACT                 * 00836000
*DCL NCSCDCON BIT(16) CONSTANT('3009'X);   /* DISCONTACT              * 00837000
*DCL NCSCIPLI BIT(16) CONSTANT('300A'X);   /* IPL INIT                * 00838000
*DCL NCSCIPLT BIT(16) CONSTANT('300B'X);   /* IPL                     * 00839000
*DCL NCSCIPLF BIT(16) CONSTANT('300C'X);   /* IPL FINAL               * 00840000
*DCL NCSCDUMI BIT(16) CONSTANT('300D'X);   /* DUMP INIT               * 00841000
*DCL NCSCDUMP BIT(16) CONSTANT('300E'X);   /* DUMP                    * 00842000
*DCL NCSCDUMF BIT(16) CONSTANT('300F'X);   /* DUMP FINAL              * 00843000
*DCL NCSCACTL BIT(16) CONSTANT('3010'X);   /* ACT LINK                * 00844000
*DCL NCSCDACL BIT(16) CONSTANT('3011'X);   /* DEACT LINK              * 00845000
*DCL NCSCSSV  BIT(16) CONSTANT('3012'X);   /* SET STATE VECTOR        * 00846000
*DCL NCSCNSP  BIT(16) CONSTANT('3013'X);   /* NS PROC ERROR           * 00847000
*DCL NCSCSTD  BIT(16) CONSTANT('3019'X);   /* SET TIME & DATE         * 00848000
*DCL NCSCSEP  BIT(16) CONSTANT('9014'X);   /* SWITCH TO EP            * 00849000
*DCL NCSCSNC  BIT(16) CONSTANT('9015'X);   /* SWITCH TO NCP           * 00850000
*DCL NCSCLSD  BIT(16) CONSTANT('3016'X);   /* LINE SCHED PARM         * 00851000
*DCL NCSCDS   BIT(16) CONSTANT('3017'X);   /* DISPLAY STORAGE         * 00852000
*DCL NCSCPWO  BIT(16) CONSTANT('3018'X);   /* REMOTE POWER OFF        * 00853000
*DCL NCSSNFMD BIT(16) CONSTANT('301C'X);   /* SEND FMD                * 00854000
*DCL NCSCDIAL BIT(16) CONSTANT('301A'X);   /* DIAL                    * 00855000
*DCL NCSCADIL BIT(16) CONSTANT('301B'X);   /* ABANDON DIAL            * 00856000
*DCL NCSCEANS BIT(16) CONSTANT('301D'X);   /* ENABLE ANS MODE         * 00857000
*DCL NCSCAANS BIT(16) CONSTANT('301E'X);   /* ABANDON ANS MODE        * 00858000
*DCL NCSCANA  BIT(16) CONSTANT('301F'X);   /* ASSIGN NET ADDRESS      * 00859000
*DCL NCSCFNA  BIT(16) CONSTANT('3020'X);   /* FREE NET ADDRESS        * 00860000
*DCL NCSCACON BIT(16) CONSTANT('3021'X);   /* ABANDON CONNECTION      * 00861000
*DCL NCSCSCV  BIT(16) CONSTANT('3022'X);   /* SET CONTROL VECTOR      * 00862000
*DCL NCSNCPPG BIT(16) CONSTANT('FFFF'X);   /* PURGE                   * 00863000
*/* NEW VALUES FOR NCSPLCMD   */                                   0288 00864000
*DCL NCSCLCND BIT(16) CONSTANT('0041'X);  /* LOAD CONDITIONALLY  */     00865000
*DCL NCSCUCND BIT(16) CONSTANT('0042'X); /* LOAD UNCONDITIONALLY */     00866000
*DCL NCSCRSRT BIT(16) CONSTANT('0043'X); /* RESTART 370X OR CLUS  */    00867000
*DCL NCSDUCMD BIT(16) CONSTANT('0044'X); /* DUMP 370X  */          0291 00868000
*DCL NCSCERPP BIT(16) CONSTANT('0045'X); /* PERFORM ERP DUMP AND   0292 00869000
*                                           RELOAD OF 370X  */     0292 00870000
*DCL NCSDOUT  BIT(16) CONSTANT('0046'X); /* DIAL OUT                 */ 00871000
*DCL NCSDCNT  BIT(16) CONSTANT('0047'X); /* DIAL CONTACT             */ 00872000
*DCL NCSDABDN BIT(16) CONSTANT('0048'X); /* DIAL ABANDON             */ 00873000
*DCL NCSDENAS BIT(16) CONSTANT('0049'X); /* DIAL ENABLE ANSWER       */ 00874000
*/*  VALUES FOR NCSCMDB                                              */ 00875000
*DCL NCSBFME BIT(8) CONSTANT('06'X);     /* SEND POS RESP COMMAND    */ 00876000
*DCL NCSBEXC BIT(8) CONSTANT('07'X);     /* SEND NEG RESP COMMAND    */ 00877000
*/*  CONSTANTS FOR DIAL REASON CODES                                 */ 00878000
*DCL NCSDLRRD BIT(8) CONSTANT('01'X);    /* REDIAL                   */ 00879000
*DCL NCSDLRQT BIT(8) CONSTANT('02'X);    /* QUIT                     */ 00880000
*/* NEW VALUES FOR NCSIORC   */                                    0301 00881000
*DCL NCSLDAOK BIT(8) CONSTANT('00'X);  /* COMMAND PROCESSED SUCESS */   00882000
*DCL NCSLDACT BIT(8) CONSTANT('04'X);  /* NCP ACTIVE-LOAD NOT PERF */   00883000
*DCL NCSLDCAN BIT(8) CONSTANT('04'X);  /* RELOAD DECLINED BY OPER  */   00884000
*DCL NCSLDIOP BIT(8) CONSTANT('08'X);  /* I/O PURGED               */   00885000
*DCL NCSLDNOG BIT(8) CONSTANT('0C'X);  /* COMMAND FAILED           */   00886000
*DCL NCSDUCOM BIT(8) CONSTANT('14'X);  /* DUMP COMPLETE            */   00887000
*DCL NCSHALTD BIT(8) CONSTANT('18'X);  /* CMD REJECTED,HALT IN PROG*/   00888000
*DCL NCSUNREC BIT(8) CONSTANT('1C'X);  /* COMMAND UNRECOGNIZED     */   00889000
*DCL NCSNOSTG BIT(8) CONSTANT('20'X);  /* CMD REJ,INSUFF STORAGE   */   00890000
*DCL NCSDOS   BIT(8) CONSTANT('00'X);  /* DIAL-OUT SUCCESSFUL      */   00891000
*DCL NCSDOF   BIT(8) CONSTANT('04'X);  /* DIAL-OUT UNSUCCESSFUL    */   00892000
*DCL NCSDOP   BIT(8) CONSTANT('08'X);  /* DIAL-OUT PENDING         */   00893000
*DCL NCSDCS   BIT(8) CONSTANT('00'X);  /* DIAL-CONTACT LOADED      */   00894000
*DCL NCSDCF   BIT(8) CONSTANT('0C'X);  /* DIAL-CONTACT FAILED      */   00895000
*DCL NCSDAS   BIT(8) CONSTANT('00'X);  /* DIAL-ABANDON CONN COMPLETE*/  00896000
*DCL NCSDENSO BIT(8) CONSTANT('00'X);  /* ENABLE ANSWER SUCCESSFUL  */  00897000
*DCL NCSDOFHR BIT(8) CONSTANT('04'X);  /* OFFHOOK REQUIRED          */  00898000
*DCL NCSDENSF BIT(8) CONSTANT('08'X);  /* ENABLE ANSWER FAIL        */  00899000
*/*  NEW VALUES FOR NCSPRMRC    */                                 0319 00900000
*DCL NCSFIRM  BIT(8) CONSTANT('10'X);  /* RESTART SUCC,OPENDST REQ */   00901000
*DCL NCSEWRN  BIT(8) CONSTANT('11'X);  /* CON LOST,RECOV IN  PROG  */   00902000
*/* CONSTANTS FOR TRACE                                            */   00903000
*DCL NCSACTLT BIT(16) CONSTANT('0820'X); /* ACTIVATE LINE TRACE    */   00904000
*DCL NCSDACLT BIT(16) CONSTANT('0840'X); /* DEACTIVATE LINE TRACE  */   00905000
*DCL NCSCACLT BIT(16) CONSTANT('301D'X); /* SSCP ACT LINE TRACE    */   00906000
*DCL NCSCDCLT BIT(16) CONSTANT('301E'X); /* SSCP DEACT LINE TRACE  */   00907000
*/* DISPLAY COMMAND MODIFIER CONSTANTS                             */   00908000
*DCL NCSDPATH BIT(16) CONSTANT('0001'X); /* PATHS                  */   00909000
*/* LOGICAL CHANNEL COMMAND WORD                                      * 00910000
*/* ADD A DECLARE                                      003 10/18/74   * 00911000
*DCL  1  ISTLCCW BDY(WORD) BASED,                                  0326 00912000
*        2  LCCWOP    CHAR(1),         /* OPERATION CODE -CONTROL     * 00913000
*           3  LCCWSI BIT(1),          /* SESS INIT / START DIALOG FLG* 00914000
*           3  LCCWSD BIT(1),          /* SESS DISCON/END DIALOG FLG  * 00915000
*           3  LCCWRWOP BIT(6),        /* READ/WRITE OPERATION CODE   * 00916000
*              4  * BIT(1),            /* RESERVED                    * 00917000
*              4  LCCWSOP BIT(1),      /* SPECIAL OPERATION LIKE   0326 00918000
*                                         ERASE OR READ CONT          * 00919000
*              4  LCCWCTL BIT(4),      /* CONTROL TYPE                * 00920000
*                 5  LCCWMODE BIT(2),  /* MODE TYPE                   * 00921000
*                 5  LCCWTYPE BIT(2),  /* OPERATION TYPE              * 00922000
*        2  LCCWFLAG  CHAR(1),         /* FLAG BYTE                   * 00923000
*           3  LCCWCD BIT(1),          /* CHAIN DATA                  * 00924000
*           3  LCCWCC BIT(1),          /* CHAIN COMMAND               * 00925000
*           3  LCCWCKPT BIT(1),        /* SUPPRESS 3705 CHECK POINT     00926000
*                                         RECORD                      * 00927000
*           3  LCCWNTVC BIT(1),        /* DO NOT PERFORM VALCHEK      * 00928000
*           3  LCCWIDAT BIT(1),        /* LCCWDATA CONTAINS DATA      * 00929000
*           3  LCCWLSI BIT(1),         /* LCCW SYNCH INDICATOR        * 00930000
*              4  LCCWPER BIT(1),      /* POST=RESP                   * 00931000
*           3  LCCWRFI BIT(1),         /* REQUEST FEEDBACK INDICATOR  * 00932000
*           3  LCCWACI BIT(1),         /* ADDITION COMMAND INDICATOR  * 00933000
*        2  LCCWCNT FIXED(16),         /* DATA COUNT                  * 00934000
*        2  LCCWDATA PTR(31);          /* DATA ADDRESS OR IMMED. DATA * 00935000
*/* LOGICAL COMMAND CODES */                                       0327 00936000
*DCL  LXDQ     BIT(8) CONSTANT('3B'X), /* RESET DEVICE QUEUE          * 00937000
*     LXEC     BIT(8) CONSTANT('4B'X), /* RESET AT END OF COMMAND     * 00938000
*     LXO      BIT(8) CONSTANT('5B'X), /* RESET ORDERLY               * 00939000
*     LCCWPRGE BIT(8) CONSTANT('6B'X), /* PURGE                       * 00940000
*     LWH      BIT(8) CONSTANT('0F'X), /* WRITE HEADER INDI. 1ST BLOCK* 00941000
*     LWRVI    BIT(8) CONSTANT('1F'X), /* WRITE RVI                   * 00942000
*     LWNA     BIT(8) CONSTANT('2F'X), /* WRITE NEGATIVE ACK          * 00943000
*     LWAA     BIT(8) CONSTANT('3F'X), /* WRITE ALTERNATE ACK         * 00944000
*     LWPLG    BIT(8) CONSTANT('5F'X), /* WRITE ACK LEADING GRAPHICS  * 00945000
*     LWNLG    BIT(8) CONSTANT('6F'X), /* WRITE NACK LEADING GRAPHICS * 00946000
*     LSMDE    BIT(8) CONSTANT('4F'X), /* SET MODE                    * 00947000
*     LIFBM    BIT(8) CONSTANT('7F'X), /* INDIC 1ST BLOCK OF MESSAGE  * 00948000
*     LTEST    BIT(8) CONSTANT('FE'X), /* TEST LCCW                   * 00949000
*     LPRMPT   BIT(8) CONSTANT('13'X), /* PREEMPT LCCW                * 00950000
*     LRSTR    BIT(8) CONSTANT('43'X), /* RESTORE LCCW                * 00951000
*     LEXEC    BIT(8) CONSTANT('FF'X), /* SPECIAL CONTROL OPERATION   * 00952000
*     LREAD    BIT(2) CONSTANT('10'B),  /* READ TYPE LCCW             * 00953000
*     LWRITE   BIT(2) CONSTANT('01'B),  /* WRITE TYPE LCCW            * 00954000
*     LCNTRL   BIT(2) CONSTANT('11'B),  /* CONTROL TYPE LCCW          * 00955000
*     LRESET   BIT(4) CONSTANT('1011'B),/* RESET COMMANDS             * 00956000
*     LTIC     BIT(8) CONSTANT('08'X),  /* LOGICAL TIC                * 00957000
*     LWR      BIT(6) CONSTANT('000001'B),  /* WRITE CONVERSATIONAL   * 00958000
*     LWB      BIT(6) CONSTANT('000101'B),  /* WRITE BLOCK            * 00959000
*     LWM      BIT(6) CONSTANT('001001'B),  /* WRITE MESSAGE          * 00960000
*     LWT      BIT(6) CONSTANT('001101'B),  /* WRITE TRANSMISSION     * 00961000
*     LEWM     BIT(6) CONSTANT('011001'B),  /* ERASE/WRITE MESSAGE    * 00962000
*     LEWT     BIT(6) CONSTANT('011101'B),  /* ERASE/WRITE TRNSMSSN   * 00963000
*     LEAU     BIT(6) CONSTANT('010001'B),  /* ERASE ALL UNPROTECTED  * 00964000
*     LRB      BIT(6) CONSTANT('000110'B),  /* READ BLOCK             * 00965000
*     LRM      BIT(6) CONSTANT('001010'B),  /* READ MESSAGE           * 00966000
*     LRT      BIT(6) CONSTANT('001110'B),  /* READ TRANSMISSION      * 00967000
*     LRMOD    BIT(6) CONSTANT('010010'B),  /* READ MODIFIED          * 00968000
*     LRBUF    BIT(6) CONSTANT('010110'B),  /* READ BUFFER            * 00969000
*     LRCONT   BIT(6) CONSTANT('011010'B),  /* READ CONTINUOUS        * 00970000
*     LRPEP    BIT(6) CONSTANT('011110'B),  /* READ PERPETUAL         * 00971000
*     LCPYM    BIT(6) CONSTANT('101001'B),  /* COPY MESSAGE           * 00972000
*     LCPYT    BIT(6) CONSTANT('101101'B),  /* COPY TRANSMISSION      * 00973000
*     LD       BIT(8) CONSTANT('23'X),  /* DISCONNECT                 * 00974000
*     LDEC     BIT(8) CONSTANT('33'X),  /* DISCONNECT WITH END OF CALL* 00975000
*     LEOC     BIT(8) CONSTANT('53'X),  /* END OF CALL COMMAND        * 00976000
*     LXEL     BIT(8) CONSTANT('0B'X),  /* RESET ERROR LOCK           * 00977000
*     LXC      BIT(8) CONSTANT('1B'X),  /* RESET CONDITIONAL          * 00978000
*     LXI      BIT(8) CONSTANT('2B'X),  /* RESET IMMEDIATE            * 00979000
*     LC       BIT(8) CONSTANT('03'X),  /* CONTACT                    * 00980000
*     LWPA     BIT(8) CONSTANT('FD'X); /* WRITE POSITIVE ACK          * 00981000
*DCL  LMT      BIT(2) CONSTANT('11'B), /* TRANSMISSION MODE           * 00982000
*     LMS      BIT(2) CONSTANT('00'B), /* SPECIAL MODE LIKE CONV, EAU * 00983000
*     LMB      BIT(2) CONSTANT('01'B), /* BLOCK MODE                  * 00984000
*     LMM      BIT(2) CONSTANT('10'B); /* MSG OR CONTINUOUS MODE      * 00985000
*/* FOLLOWING EQUATES FOR  - PORT SOLICITOR (DIAL)                    * 00986000
*/* PORT SOLICITOR COMMAND CODES                                      * 00987000
*DCL PSOL    BIT(8) CONSTANT('FE'X), /* SPECIAL PORT SOLICITOR     0329 00988000
*                                       COMMAND                       * 00989000
*    STCTL    BIT(8) CONSTANT('01'X), /* START CONTROL                * 00990000
*    RESTCTL  BIT(8) CONSTANT('02'X), /* RESET & CONTROL - REDRIVE    * 00991000
*    STIPUT   BIT(8) CONSTANT('03'X); /* START INPUT                  * 00992000
*/*   FOLLOWING EQUATES FOR SDLC SUPPORT                              * 00993000
*DCL  LCCHOLD  BIT(8) CONSTANT('01'X),  /* HOLD                       * 00994000
*     LCCRHOLD BIT(8) CONSTANT('02'X),  /* RELEASE HOLD               * 00995000
*     LSEND    BIT(8) CONSTANT ('F1'X), /* SEND                       * 00996000
*     LCLEAR   BIT(8) CONSTANT ('F2'X), /* CLEAR                      * 00997000
*     LCRUD    BIT(8) CONSTANT ('F3'X), /* CLEAR, UNBIND              * 00998000
*     LCRUDNFY BIT(8) CONSTANT ('F4'X), /* CLEAR, UNBIND, NOTIFY      * 00999000
*     LNFY     BIT(8) CONSTANT ('F5'X), /* NOTIFY                     * 01000000
*     LRELCB   BIT(8) CONSTANT ('F6'X), /* RELEASE CB                 * 01001000
*     LRESTSR  BIT(8) CONSTANT ('F7'X), /* RESETSR                    * 01002000
*     LCLRNFY  BIT(8) CONSTANT('F8'X),  /* CLEAR/NOTIFY               * 01003000
*     LCHPUR   BIT(8) CONSTANT('F9'X);  /* PURGE                      * 01004000
*DCL  LCCWSIZE FIXED(8) CONSTANT(8);    /* LCCW SIZE                  * 01005000
*DCL  LRDS     BIT(8) CONSTANT('FF'X);  /* RECORD DEV STATS COMMAND   * 01006000
*DCL  LQUIS    BIT(8) CONSTANT('FE'X);  /* QUIESCE COMMAND            * 01007000
*/*              LOGICAL CHANNEL PROGRAM BLOCK                       */ 01008000
*/*                                                                  */ 01009000
*/*  REVISIONS                                         007 05/19/75  */ 01010000
*/*                                                                  */ 01011000
*DCL  1  ISTLCPB BDY(WORD) BASED(LCPBPTR),                         0334 01012000
*        2 LCPTYPE CHAR(1),            /* TYPE CODE                  */ 01013000
*        2 LCPLNGTH  PTR(8),           /* LENGTH IN BYTES            */ 01014000
*        2 LCPREQTG CHAR(2),           /* LCPB REQ. TAG FIELD        */ 01015000
*          3 LCPFLAGS BIT(8),          /* FLAG BYTE                  */ 01016000
*            4 LCPZRT00 BIT(1),        /* LOGICAL ERROR FLAG         */ 01017000
*            4 LCPZRT01 BIT(1),        /* CONTROL BLOCK ERROR        */ 01018000
*            4 LCPZF001 BIT(1),        /* LCP START PROCESS FLAG     */ 01019000
*              5 LCPZRT02 BIT(1),      /* I/O INITIATION DISABLED    */ 01020000
*                6 LCPZRTL2 BIT(1),    /* END OF SCHEDULABLE BLOCK   */ 01021000
*            4 LCPZF002 BIT(1),        /* LCP IN PROCESSING FLAG     */ 01022000
*              5 LCPZRT03 BIT(1),      /* GO LOOK AT FMCB LINE STATE */ 01023000
*                                      /* FIELD (REQ. TAG OVERLAY)   */ 01024000
*                6 LCPZRTL3 BIT(1),    /* WRITE/READ REQUEST         */ 01025000
*            4 LCPZF003 BIT(1),        /* LCP PROCESSING COMPLETE FLAG* 01026000
*              5 LCPZRT04 BIT(1),      /* STPR SET IN BDU FLAG       */ 01027000
*                                      /* (REQ. TAG OVERLAY)         */ 01028000
*                6 LCPZRTL4 BIT(1),    /* FEEDBACK REQUESTED         */ 01029000
*            4 LCPZF004 BIT(1),        /* SINGLE LCCW/LCP FLAG       */ 01030000
*              5 LCPZRT05 BIT(1),      /* FEEDBACK TO BE ROUTED TO   */ 01031000
*                                      /* ICNCB FMCB (REQ. TAG       */ 01032000
*                                      /* OVERLAY)                   */ 01033000
*                6 LCPZRTL5 BIT(1),    /* DECREMENT SCHED COUNT ON DEQ* 01034000
*            4 LCPZRT06 BIT(1),        /* CRITICAL TEXT BLOCK        */ 01035000
*                                      /* FLAG (REQ. TAG OVERLAY)    */ 01036000
*              5 LCPZRTL6 BIT(1),      /* WRITE REQUEST              */ 01037000
*            4 LCPZRT07 BIT(1),        /* BUFFER TRACE ACTIVE        */ 01038000
*                                      /* FLAG (REQ. TAG OVERLAY)    */ 01039000
*              5 LCPZRTL7 BIT(1),      /* SCHEDULING FLAG            */ 01040000
*          3 LCPMNRCD CHAR(1),         /* LCP MINOR REJECTION CODE   */ 01041000
*            4 LCPZRT08 BIT(1),        /* I/O TRACE ACTIVE FLAG      */ 01042000
*                                      /* (REQ. TAG OVERLAY)         */ 01043000
*              5 LCPZRTL8 BIT(1),      /* DEVICE END NOTIFICATION    */ 01044000
*            4 LCPZRT09 BIT(1),        /* DIALOGUE SCHED DISABLED    */ 01045000
*              5 LCPZRTL9 BIT(1),      /* CRITICAL TEXT FLAG         */ 01046000
*            4 LCPZRT0A BIT(1),        /* SIMULATED CONTACT FLAG     */ 01047000
*            4 LCPZRT0B BIT(1),        /* SIMULATED DISCONNECT FLAG  */ 01048000
*        2 LCPCHAIN PTR(31),           /* APS CHAIN                  */ 01049000
*          3 LCPCHAI1 PTR(8),                                      0334 01050000
*            4 LCPCHNG BIT(1),         /* GATE BIT                   */ 01051000
*          3 LCPCHAI2 PTR(24),         /* ADDRESS FIELD              */ 01052000
*        2 LCPRUCNT PTR(8),            /* NUMBER OF RU FOR THIS LCPB */ 01053000
*          3 LCPZMIRC CHAR(1),         /* MINOR RETURN CODE          */ 01054000
*        2 LCPFLAG2 CHAR(1),           /* SECOND FLAG BYTE           */ 01055000
*          3 LCPPRFLG BIT(1),          /* PACING REQUIRED            */ 01056000
*          3 LCPASYN  BIT(1),          /* ASYNCHRONOUS LCPB          */ 01057000
*          3 LCPRSTRT BIT(1),          /* RESTART LCPB               */ 01058000
*          3 LCPTLBPI BIT(1),          /* TPIOS BLOCK LCCW           */ 01059000
*            4 LCPZRIMM BIT(1),        /* RESET IMMED REQUIRED ON ERR*/ 01060000
*          3 LCPFID0  BIT(1),          /* FID0 TH INDICATOR FOR RECORD* 01061000
*            4 LCPEXRES BIT(1),        /* EXCEP. RESPONSE SPEC. 3270R*/ 01062000
*          3 LCPDSTAT BIT(1),          /* DIALOGUE STATE BIT, 3270R  */ 01063000
*                                      /* 0=REQ. REJECT,1=STATE ERROR*/ 01064000
*          3 LCPFREE  BIT(1),          /* DEALLOCATE LCPB 3270R      */ 01065000
*          3 LCPATOP  BIT(1),          /* ATOP LCPB  3270R           */ 01066000
*        2 LCPSEQ   FIXED(16),         /* OUTBOUND SEQUENCE NUMBER   */ 01067000
*          3 LCPRRCCT PTR(8),          /* COUNT OF RESPONSES RECEIVED*/ 01068000
*          3 LCPRRCNT PTR(8),          /* COUNT OF RESPONSES REQUESTED* 01069000
*        2 LCPLCCW1 PTR(31),           /* ADDR FIRST LCCW FOR FID1   */ 01070000
*        2 LCPCID CHAR(4) BDY(WORD),   /* COMMUNICATION ID           */ 01071000
*          3 LCPSAF BIT(16),           /* SOURCE IDENTIFICATION      */ 01072000
*          3 LCPDAF BIT(16),           /* DESTINATION IDENTIFICATION */ 01073000
*        2 LCPNXLCW PTR(31),           /* ADDR NEXT LCCW             */ 01074000
*        2 LCPFDBA PTR(31),            /* BTU ADDRESS                */ 01075000
*          3 LCPFDB1 PTR(8),                                       0334 01076000
*          3 LCPFDB2 PTR(24),          /* ADDRESS FIELD              */ 01077000
*        2 LCPTLBAD PTR(31),           /* ADDRESS OF TLB             */ 01078000
*        2 LCPFOSN  BIT(16),           /* SEQUENCE NUMBER FIRST RU   */ 01079000
*        2 LCPFSNCH FIXED(16),         /* 1ST SEQ NUMBER IN RU CHAIN */ 01080000
*        2 LCPSTYPE FIXED(8),          /* LCPB SUB-TYPE X'FF' = RESET,* 01081000
*                                      /* X'00' = NON-RESET          */ 01082000
*        2 LCPFLG1 CHAR(1),            /* FLAGS                      */ 01083000
*          3 LCPRESET BIT(1),          /* A TPQUE WITH RESET QUEUED  */ 01084000
*                                      /* THIS ELEMENT               */ 01085000
*          3 LCPINTER BIT(1),          /* INTERNAL LCPB              */ 01086000
*          3 LCPDIRPT BIT(1),          /* NOT SEND W/POST=SCHED=0    */ 01087000
*          3 LCPREDRV BIT(1),          /* LCPB IS FOR REDRIVE        */ 01088000
*          3 LCPSTLB  BIT(1),          /* TLB NOT TO BE FREED        */ 01089000
*          3 LCPTRANS BIT(1),          /* DATA INCLUDES CONTROL CHARS*/ 01090000
*          3 LCPRSV78 BIT(2),          /* RESERVED                   */ 01091000
*        2 LCPLCCWC BIT(8),            /* COUNT OF LCCWS             */ 01092000
*        2 LCPRSV77 CHAR(1),           /* RESERVED                   */ 01093000
*        2 LCPFLCCW PTR(31),           /* ADDR OF FIRST LCCW         */ 01094000
*          3 LCPUBFSB PTR(31),         /* UNBIND FSB ADDRESS         */ 01095000
*        2 LCPCLREP PTR(31),           /* PTR TO CLEAR LCPB IN UCB   */ 01096000
*/*  NOTE:  THE FOLLOWING FIELD - LCPLCCW MUST BE THE LAST FIELD     */ 01097000
*/*         IN THIS CONTROL BLOCK.  THE CONTROL BLOCK ISTDCLCP HAS   */ 01098000
*/*         FIELDS IN IT WHICH MUST BE CONTIGUOUS WITH LCPLCCW       */ 01099000
*        2 LCPLCCW  CHAR(LENGTH(ISTLCCW)) BDY(WORD), /* FIRST LCCW   */ 01100000
*          3 LCPRSTQH PTR(31),         /* RESET LCPB QUEUE HEADER    */ 01101000
*          3 LCPPABA  PTR(31),         /* PAB POINTER                */ 01102000
*            4 LCPRPHA  PTR(31),       /* RPH POINTER                */ 01103000
*              5 LCPFTYPE BIT(1);      /* FEEDBACK TYPE              */ 01104000
*/*     CONSTANTS FOR LCPTYPE                                         * 01105000
*DCL  LCRPHFT  BIT(1) CONSTANT('1'B);                              0335 01106000
*DCL  LCPABFT  BIT(1) CONSTANT('0'B);                              0336 01107000
*DCL LCPBFIRM BIT(8) CONSTANT('10'X);  /* LU FAILED, CLSDST, SCHED LOST 01108000
*                                         TERM, OPNDST MAY BE TRIED   * 01109000
*DCL LCPBTERM BIT(8) CONSTANT('11'X);  /* TERM RECEIVED,CLSDST,    0338 01110000
*                                         SCHED LOST TERM             * 01111000
*/*                                                                   * 01112000
*                                                                  0339 01113000
*DCL 1 LCPZTIE BDY(WORD) DEFINED(LCPCID), /* TOLTEP INTERFACE      0339 01114000
*                                         ELEMENT OVERLAY            */ 01115000
*       2  LCPZFMCA PTR(31),           /* ACTIVE FMCB ADDRESS        */ 01116000
*       2  LCPZSNA PTR(31),            /* SYMBOLIC NAME ADDRESS      */ 01117000
*       2  LCPZSNAM CHAR(8) BDY(WORD), /* SYMBOLIC NAME              */ 01118000
*          3  LCPZTRV1 PTR(31),        /* RESERVED FOR RESTORE LCP   */ 01119000
*          3  LCPZTRV4 PTR(31);        /* RESERVED FOR RESTORE LCP   */ 01120000
*DCL LCTYPE BIT(8) CONSTANT('04'X);                                0340 01121000
*DCL PLCPTYPE BIT(8) CONSTANT('28'X);  /* PURGE LCPB TYPE ID         */ 01122000
*DCL LCPCLACB BIT(8) CONSTANT('04'X);  /* LCPB FROM CLOSE ACB        */ 01123000
*DCL LSRSTYPE BIT(8) CONSTANT('FF'X);  /* RESET SUBTYPE              */ 01124000
*DCL LCPETYPE BIT(8) CONSTANT('40'X);  /* EXTENDED LCPB TYPE ID      */ 01125000
*/*                                                                  */ 01126000
*/*  MINOR RETURN CODES                                              */ 01127000
*/*                                                                  */ 01128000
*DCL LCMCRSTR BIT(8) CONSTANT('F7'X),  /* MINOR RC FOR RESETSR       */ 01129000
*    LCPMNEW  BIT(8) CONSTANT('02'X),  /* EARLY WARNING,             */ 01130000
*                                      /* RECOVERY IN PROGRESS       */ 01131000
*    LCPMNPF  BIT(8) CONSTANT('03'X),  /* PERM. I/O FAILURE          */ 01132000
*    LCPMNAS  BIT(8) CONSTANT('04'X),  /* AUTO NETWORK SHUTDOWN      */ 01133000
*    LCPMNCL  BIT(8) CONSTANT('06'X),  /* CLOSE/CLSDST OCCURED       */ 01134000
*    LCPMNVD  BIT(8) CONSTANT('07'X),  /* VARY DEACTIVATE            */ 01135000
*    LCPMNTF  BIT(8) CONSTANT('10'X),  /* TEMP RECORD DEVICE FAILURE */ 01136000
*    LCPMNSF  BIT(8) CONSTANT('01'X),  /* TEMP BASIC FAILURE /       */ 01137000
*    LCPMNTS  BIT(8) CONSTANT('11'X),  /* TERMINATE SELF             */ 01138000
*    LCPMNAP  BIT(8) CONSTANT('0A'X),  /* APPL. ISSUED CLEAR         */ 01139000
*    LCPMNPR  BIT(8) CONSTANT('0B'X),  /* PREEMPT                    */ 01140000
*    LCPMNRE  BIT(8) CONSTANT('0C'X);  /* RESTORE                    */ 01141000
*/* VS1, VS2 TPIOS SAVEAREA FORMAT */                              0346 01142000
*DCL  1  ISTZSAVE BDY(WORD) BASED,                                 0346 01143000
*        2   ZSAZSVBC PTR(31),         /* SAVEAREA BACK CHAIN        */ 01144000
*            3   ZSAZSVMS CHAR(1),     /* MODULE TRACE CODE          */ 01145000
*                4 ZSAZACTV BIT(1),    /* ACTIVE SAVE AREA FLAG      */ 01146000
*        2   ZSAZSVFC PTR(31),         /* SAVEAREA FORWARD CHAIN     */ 01147000
*        2   ZSAZSVRR PTR(31),         /* RETURN REGISTER            */ 01148000
*        2   ZSAZSVVR (6) PTR(31),    /* VARIABLE REGS (7-12) SVEAREA*/ 01149000
*        2   ZSAZTRAC CHAR(4);        /* EBCDIC NAME OF OWNER        */ 01150000
*/*                                                                0347 01151000
*THE FOLLOWING EQUATES SHOULD READ ''FIXED(8) CONSTANT(LENGTH(X))'',    01152000
*WHERE X IS THE NAME OF THE VARIABLE CONTROL BLOCK OR FIELD OF WHICH    01153000
*LENGTH IS THE VALUE BEING EQUATED, SHOULD THE PLS COMPILER BE     0347 01154000
*BE ABLE TO TAKE IT.                                               0347 01155000
*                                                                    */ 01156000
*DCL ZSAZSVVA FIXED(8) CONSTANT(8);  /* DISPLACEMENT TO VARIABLE REGS*/ 01157000
*DCL ZSAZSVSZ FIXED(8) CONSTANT(40); /* LENGTH OF ISTZSAVE           */ 01158000
*/* PREFIX FOR CRR                                                   */ 01159000
*/*                                                                  */ 01160000
*/* RELEASE 1 - JUNE 28, 1973                                        */ 01161000
*/*                                                                  */ 01162000
*DCL 1 ISTPFCRR BASED BDY(WORD),        /* PREFIX FOR CRR            */ 01163000
*     2  PFCCRR   CHAR(4),              /* CRR HEADER                */ 01164000
*        3  PFCCRRID CHAR(1),           /* CRR ID FIELD              */ 01165000
*           4  CRRID CHAR(1),           /* BASIC CTL LAYER DEFINITION*/ 01166000
*        3  PFCRSV10 CHAR(1),           /* RESERVED FOR ALIGNMENT    */ 01167000
*        3  PFCCRRLN CHAR(2),           /* CRR LENGTH                */ 01168000
*           4  CRRLEN CHAR(2),          /* BASIC CTL LAYER DEF       */ 01169000
*     2  PFCHDR CHAR(8) BDY(WORD),      /* SAVE AREA FOR OLD CRR FRR */ 01170000
*        3  PFCCRRO  PTR(31),           /* PTR TO OLD CRR            */ 01171000
*           4  CRRCHAIN PTR(31),        /* BASIC CTL LAYER DEFINITION   01172000
*                                          FOR OLD CRR PTR           */ 01173000
*        3  PFCFRRO  PTR(31),           /* PTR TO OLD FRR            */ 01174000
*           4  CRRFRR   PTR(31),        /* BASIC CTL LAYER         0349 01175000
*                                          DEFINITION OF OLD FRR PTR */ 01176000
*     2  PFCFTA BIT(8),                 /* ID OF LAST FUNCTION TRACED*/ 01177000
*     2  PFCRSV01 CHAR(3);              /* ALIGNMENT                 */ 01178000
*DCL PFIDPIE BIT(8) CONSTANT('80'X);    /* DOS/VS TPIOS              */ 01179000
*DCL PFIDORE BIT(8) CONSTANT('81'X);    /* DOS/VS BMS                */ 01180000
*DCL PFIDAPE BIT(8) CONSTANT('82'X);    /* DOS/VS PSS                */ 01181000
*DCL PFCIDPSV BIT(8) CONSTANT('38'X); /* COMPONENT ID              0353 01182000
*                                          PSS - VS1 AND 2           */ 01183000
*DCL PFCIDTPV BIT(8) CONSTANT('3C'X); /* COMPONENT ID              0354 01184000
*                                          TPIOS VS1 AND 2           */ 01185000
*DCL PFCIDSME BIT(8) CONSTANT('3D'X); /* COMPONENT ID              0355 01186000
*                                          STORAGE MANAGEMENT DOS    */ 01187000
*DCL PFCIDOC BIT(8) CONSTANT('31'X);    /* COMPONENT ID OPEN/CLOSE   */ 01188000
*DCL PFCIDPS BIT(8) CONSTANT('32'X);    /* PORT SOLICITOR            */ 01189000
*DCL PFCIDCS BIT(8) CONSTANT('34'X);    /* CLUSTER SOLICITOR         */ 01190000
*DCL PFCIDIT BIT(8) CONSTANT('35'X);    /* INIT/TERM                 */ 01191000
*DCL PFCIDVY BIT(8) CONSTANT('36'X);    /* VARY                      */ 01192000
*DCL PFCIDNS  BIT(8) CONSTANT('37'X);   /* NET. STAT.SRV.            */ 01193000
*DCL PFCIDTPE BIT(8) CONSTANT('38'X);   /* COMPONENT ID            0362 01194000
*                                          TPIOS - DOS               */ 01195000
*DCL PFCIDCL BIT(8) CONSTANT('39'X);    /* COMPONENT ID            0363 01196000
*                                          CONTROL LAYER             */ 01197000
*DCL PFCIDPSE BIT(8) CONSTANT('3A'X);   /* COMPONENT ID            0364 01198000
*                                          PSS - DOS                 */ 01199000
*DCL PFCIDSMV BIT(8) CONSTANT('3F'X);   /* COMPONENT ID            0365 01200000
*                                          STORAGE MANAGEMENT        */ 01201000
*DCL PFCIDTIO BIT(8) CONSTANT('40'X);   /* COMPONENT ID TIIO       0366 01202000
*                                          PROCESSING (VS2)          */ 01203000
*DCL PFCIDRS  BIT(8) CONSTANT('41'X);   /* ID FOR REMOTE SOLICITOR   */ 01204000
*/* CRR FOR COMMAND FACILITIES                                      */  01205000
*/*  REVISIONS                                         001 06/02/75 */  01206000
*DCL  1  ISTCFCRR BDY(WORD) BASED, /* CRR FOR COMMAND FACILITIES    */  01207000
*        2 CFCAUDIT,               /* AUDIT TRAIL FOR CMD FACILITIES*/  01208000
*          3 CFCNTRD  CHAR(1),     /* LIST OF MODULES IN COMMAND    */  01209000
*                                  /* FACILITIES ENTERED            */  01210000
*            4 NCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 ENTERED   */  01211000
*            4 NCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 ENTERED   */  01212000
*            4 NCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 ENTERED   */  01213000
*            4 NCFCRP   BIT(1),    /* IND MODULE ISTCFCRP ENTERED   */  01214000
*            4 NCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 ENTERED   */  01215000
*            4 NCFRSVD  BIT(3),    /* RESERVED                      */  01216000
*          3 CFCCRT   CHAR(1),     /* LIST OF MODULES IN COMMAND    */  01217000
*                                  /* FACILITIES RUNNING            */  01218000
*            4 CCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 RUNNING   */  01219000
*            4 CCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 RUNNING   */  01220000
*            4 CCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 RUNNING   */  01221000
*            4 CCFCRP   BIT(1),    /* IND MODULE ISTCFCRP RUNNING   */  01222000
*            4 CCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 RUNNING   */  01223000
*            4 CCFRSVD1 BIT(3);    /* RESERVED                      */  01224000
*DCL TIDCFCS1 BIT(8) CONSTANT('00'X); /* THREAD ID FOR ISTCFCS1     */  01225000
*DCL TIDCFCR1 BIT(8) CONSTANT('01'X); /* THREAD ID FOR ISTCFCR1     */  01226000
*DCL TIDCFCR2 BIT(8) CONSTANT('02'X); /* THREAD ID FOR ISTCFCR2     */  01227000
*/* COMPONENT RECOVERY RECORD FOR TPIOS */                         0372 01228000
*/*  DELTA                                             006 02/10/75  */ 01229000
*DCL                                                               0372 01230000
*1  ISTZCRR BDY(WORD) BASED,     /* CONTROL WORD                     */ 01231000
*   2  ZCRCRR CHAR(4),           /* CONTROL WORD                     */ 01232000
*      3  ZCRID CHAR(1),         /* CONTROL BLOCK ID                 */ 01233000
*      3  ZCRLEN CHAR(2),        /* LENGTH OF ZCR                    */ 01234000
*      3  ZCRFLAG CHAR(1),       /* FLAGS                            */ 01235000
*   2  ZCRCHAIN PTR(31),         /* POINTER TO PREVIOUS ZCR          */ 01236000
*   2  ZCRFRRA PTR(31),          /* PTR TO FRR                       */ 01237000
*   2  ZCRFLGS1 CHAR(1),         /* FLGS USED BY REQUEST COMPLETION  */ 01238000
*      3  ZCREXSW BIT(1),        /* EXIT SWITCH                      */ 01239000
*      3  ZCRQUESW BIT(1),       /* QUEUE SWITCH                     */ 01240000
*      3  ZCRDEQSW BIT(1),       /* DEQUEUE SWITCH                   */ 01241000
*      3  ZCRWAIT BIT(1),        /* WAIT Q ANALYSIS COMPLETE         */ 01242000
*      3  ZCRNRMEX BIT(1),       /* NORMAL EXIT TO BE TAKEN          */ 01243000
*      3  ZCRENDLP BIT(1),       /* END OF LOOP SWITCH               */ 01244000
*      3  ZCRUNSOL BIT(1),       /* UNSOLICITED DATA                 */ 01245000
*      3  ZCRFEXIT BIT(1),       /* FORCE EXIT SWITCH                */ 01246000
*   2  ZCRFLGS2 CHAR(1),         /* FLAGS USED WITHIN TPIOS          */ 01247000
*      3  ZCRLOCAL BIT(1),       /* LOCAL SUPPORT                    */ 01248000
*      3  ZCRSHEDI BIT(1),       /* IMMEDIATE SCHEDULE               */ 01249000
*      3  ZCRFMSED BIT(1),       /* FMCB SEARCH ENDED                */ 01250000
*      3  ZCROB    BIT(1),       /* OUTBOUND PROC IN PROGRESS        */ 01251000
*      3  ZCRIF0E1 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   01252000
*                                   INBOUND PROCESSING               */ 01253000
*      3  ZCRIF0E2 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   01254000
*                                   INBOUND PROCESSING               */ 01255000
*      3  ZCRIF0E3 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   01256000
*                                   INBOUND PROCESSING               */ 01257000
*   2  ZCRSWFLD CHAR(1),         /* SWITCHES FOR TPIOS OUTBOUND      */ 01258000
*      3  ZCRENDSH BIT(1),       /* EXIT FROM REMOTE DEV SCHEDULER   */ 01259000
*         4  ZCRSLCP BIT(1),     /* SCHEDULE LCPB                    */ 01260000
*      3  ZCREXTYP BIT(1),       /* TPEXIT TYPE                      */ 01261000
*      3  ZCRENDPR BIT(1),       /* EXIT FROM INNER PROCESS          */ 01262000
*      3  ZCRNDLCP BIT(1),       /* EXIT FROM LCPB PROCESSING        */ 01263000
*         4  ZCROB1 BIT(1),      /* REMOTE DEV SCHED 1ST TIME SWITCH */ 01264000
*      3  ZCRENDX BIT(1),        /* EXIT FROM LCCW/BTU XLATION       */ 01265000
*      3  ZCRENDXL BIT(1),       /* EXIT FROM LCCW PROC              */ 01266000
*      3  ZCRENDAN BIT(1),       /* EXIT FROM LCPB ANALYSIS          */ 01267000
*      3  ZCRRESET BIT(1),                                         0372 01268000
*         4  ZCRCNLXL BIT(1),    /* CANCEL FURTHER XLATE             */ 01269000
*   2  ZCRFLGS3 CHAR(1),         /* FLAGS FOR OUTBOUND PROCESSING    */ 01270000
*      3  ZCRTIC BIT(1),         /* SELECT NOT TO BE SENT            */ 01271000
*      3  ZCRTPCON BIT(1),       /* TPIOS CONTACT SENT               */ 01272000
*      3  ZCRTPDIS BIT(1),       /* TPIOS DISCONNECT TO BE SENT      */ 01273000
*      3  ZCRDISC  BIT(1),       /* DISCONNECT IN PROCESS            */ 01274000
*      3  ZCREDRIV BIT(1),       /* DO DERIVE                        */ 01275000
*      3  ZCRNOFRE BIT(1),       /* NO FREEING OF SIO QUEUE          */ 01276000
*      3  ZCRWRPTR BIT(1),       /* WRITE TO PRINTER REQUEST         */ 01277000
*      3  ZCRINLCP BIT(1),       /* ERROR OCCURED DURING OUTBND PROC */ 01278000
*   2  ZCRGENSW CHAR(1),         /* GENERAL SWITCHES                 */ 01279000
*      3  ZCRTSW1  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 01280000
*      3  ZCRTSW2  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 01281000
*      3  ZCRRT06  BIT(1),       /* CRITICAL TEXT OPTION             */ 01282000
*      3  ZCRLCSYN BIT(1),       /* LCCW SYNC SPECIFIED              */ 01283000
*      3  ZCREXRES BIT(1),       /* EXCEPTION RESPONSE SPECIFIED     */ 01284000
*      3  ZCRCLRBD BIT(1),       /* FLAG INDICATING BIND WAS CLEARED */ 01285000
*      3  ZCRBRIS  BIT(1),       /* BRACKET REJECTED DUE TO IN BRAC. */ 01286000
*      3  ZCRF1RES BIT(1),       /* FID1 RESPONSE TO BE GENERATED    */ 01287000
*   2  ZCRPFLGS CHAR(1),         /* UTILITIES PROC OPTION FLAGS      */ 01288000
*      3  ZCRQAHED BIT(1),      /* QXFR RTN TO USE INSERT OPT'N ON TPQ* 01289000
*      3  *        BIT(7),      /* RESERVED                          */ 01290000
*   2  ZCRIBPR CHAR(1),          /* INBOUND PROCESSING FLAGS         */ 01291000
*         3  ZCRNOBUF BIT(1),    /* FSB WITH NO BUFFER               */ 01292000
*         3  ZCRERR   BIT(1),    /* ERROR INDICATOR                  */ 01293000
*         3  ZCRRELK  BIT(1),    /* RESET ERROR LOCK FUNCTION REQ.   */ 01294000
*         3  ZCRLCPFR BIT(1),    /* FLAG IND. DEALLOCATE ATOP LCPB   */ 01295000
*         3  ZCRLCPFD BIT(1),    /* FLAG IND. LCPB FOUND ON WAITQ    */ 01296000
*         3  ZCR3270  BIT(1),    /* 3270 DEVICE                      */ 01297000
*         3  ZCR3270R BIT(1),    /* 3270 DEVICE IN RECORD MODE       */ 01298000
*         3  *        BIT(1),    /* RESERVED                         */ 01299000
*   2  ZCRSCPSW CHAR(1),         /* SESSION CONTROL FLAGS            */ 01300000
*         3  ZCRTPEX BIT(1),     /* TP EXIT                          */ 01301000
*         3  ZCRTPINV BIT(1),    /* INVOKE TPIOS                     */ 01302000
*         3  ZCRRJLCP BIT(1),    /* LCPB REJECTED                    */ 01303000
*         3  ZCRLREQ BIT(1),     /* REQUEST                          */ 01304000
*         3  ZCRPRCMP BIT(1),    /* PROCESSING COMPLETE              */ 01305000
*         3  ZCRFSBWE BIT(1),    /* FSB IS WORK ELEMENT              */ 01306000
*         3  ZCRSKIPT BIT(1),    /* SKIP TRACE FLAG                  */ 01307000
*         3  *       BIT(1),     /* RESERVED                         */ 01308000
*   2  ZCRCRLCP PTR(31),         /* CURRENT LCPB PTR                 */ 01309000
*   2  ZCRPARMS BDY(WORD),       /* PARAMETERS PASSED TO UTILITIES */   01310000
*      3  ZCRFBPTR PTR(31),      /* PTR TO FROM BUFFER               */ 01311000
*         4  ZCRCBPTR PTR(31),   /* PTR TO CURRENT BUFFER            */ 01312000
*      3  ZCRTBPTR PTR(31),      /* PTR TO TO-OR-TRANSLATE BUFFER    */ 01313000
*      3  ZCRMLNG FIXED(15),     /* LENGTH TO MOVE                   */ 01314000
*      3  ZCRDFRDA FIXED(15),    /* OFFSET FROM DATA ADDR IN FROM BUF*/ 01315000
*         4  ZCRDTODA FIXED(15), /* OFFSET FROM DATA ADDR XLATE BUF  */ 01316000
*      3  ZCRPCOD1 CHAR(1),      /* CODE BYTE FOR ALLOC/DISALLOC     */ 01317000
*         4  ZCRPPG BIT(1),      /* GET PAGEABLE BUFF                */ 01318000
*         4  ZCRPLNG BIT(1),     /* LENGTH OF BUFFER SPECIFIED       */ 01319000
*         4  ZCRPFSB BIT(1),     /* GET FSB                          */ 01320000
*         4  ZCRPLSBF BIT(1),    /* GET LSCB AND BUFFER              */ 01321000
*            5 ZCRPLSBQ BIT(1),  /* PURGE LSCB QUEUE                 */ 01322000
*         4  ZCRPLSCB BIT(1),    /* GET OR RELEASE LSCB              */ 01323000
*         4  ZCRPBUF BIT(1),     /* GET OR RELEASE BUFFER            */ 01324000
*         4  ZCRPCFTX BIT(1),    /* CONFIDENTIAL TEXT                */ 01325000
*         4  ZCRPRES BIT(1),     /* RESERVED                         */ 01326000
*      3  ZCRPCOD2 CHAR(1),      /* CODE BYTE FOR MOVE               */ 01327000
*         4  ZCRPPG2 BIT(1),     /* GET PAGEABLE BUFFER              */ 01328000
*         4  ZCRPFHDR BIT(1),    /* FROM BUFFER FDB TO BE USED       */ 01329000
*         4  ZCRPMFGF BIT(1),    /* MOVE STARTS WIHT 1ST BUFF IN BLOCK* 01330000
*         4  ZCRPRES2 BIT(5),    /* RESERVED                         */ 01331000
*      3  ZCRPCHAR CHAR(1),      /* TRANSLATE & TEST SEARCH CHARACTER*/ 01332000
*      3  ZCRPSW   CHAR(1),      /* SWITCH FIELD                     */ 01333000
*   2  ZCRCCWA PTR(31),          /* PTR TO CURRENT CCW (CCW 1 OR 2)  */ 01334000
*   2  ZCRBFPTR PTR(31),         /* SAVE 1ST BUFF PTR IN TO-BUFF CHN    01335000
*                                   OR LAST BUFFER IN CHANNEL PGM    */ 01336000
*   2  ZCRZLB PTR(31),           /* PTR TO CURR BUFF IN CHANNEL PGM  */ 01337000
*   2  ZCRPVZB PTR(31),          /* PTR TO PREVIOUS BUFF IN CHAN PGM */ 01338000
*   2  ZCRSVRTN BDY(WORD),       /* REG 14 SAVE AREAS                */ 01339000
*      3  ZCRSVF1 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01340000
*      3  ZCRSVF2 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01341000
*      3  ZCRSVF3 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01342000
*      3  ZCRSVF4 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01343000
*      3  ZCRSVF5 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01344000
*      3  ZCRSVF6 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01345000
*      3  ZCRSVF7 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01346000
*      3  ZCRSVF8 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01347000
*      3  ZCRSVF9 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01348000
*      3  ZCRSVF10 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01349000
*      3  ZCRSVF11 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01350000
*      3  ZCRSVF12 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01351000
*      3  ZCRSVF13 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01352000
*      3  ZCRSVF14 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01353000
*      3  ZCRSVF15 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01354000
*      3  ZCRSVF16 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01355000
*      3  ZCRSVF17 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01356000
*      3  ZCRSVF18 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01357000
*      3  ZCRSVF19 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01358000
*      3  ZCRSVF20 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01359000
*      3  ZCRSVF21 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01360000
*      3  ZCRSVF22 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01361000
*      3  ZCRSVF23 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01362000
*      3  ZCRSVF24 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01363000
*      3  ZCRSVF25 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01364000
*   2  ZCRWKARA BDY(WORD),       /* TEMPORARY REG SAVE AREA          */ 01365000
*      3  ZCRSVWK1 PTR(31),      /* SAVE REQUIRED REG                */ 01366000
*      3  ZCRSVWK2 PTR(31),      /* SAVE REQUIRED REG                */ 01367000
*      3  ZCRSVWK3 PTR(31),      /* SAVE REQUIRED REG                */ 01368000
*      3  ZCRSVWK4 PTR(31),      /* SAVE REQUIRED REG                */ 01369000
*      3  ZCRSVWK5 PTR(31),      /* SAVE REQUIRED REG                */ 01370000
*   2  ZCRFSBSV PTR(31),         /* FSB CHAIN PTR SAVEAREA           */ 01371000
*   2  ZCRFBPRC BIT(1),          /* FSB PROCESS SW                   */ 01372000
*   2  ZCRMOREL BIT(1),          /* MORE ELEMENTS SW                 */ 01373000
*   2  ZCRSCANQ BIT(1),          /* SCAN QUEUE SW                    */ 01374000
*   2  ZCRNXTEL BIT(1),          /* NEXT ELEMENT SW                  */ 01375000
*   2  ZCRXSCHD BIT(1),          /* EXIT SCHEDULE SW                 */ 01376000
*   2  ZCRLSTFB BIT(1),          /* INBOUND PROC LAST FSB FOR ELEM SW*/ 01377000
*   2  ZCRTOPQ  BIT(1),          /* QUEUE ELEMENT TO TOP SW          */ 01378000
*   2  ZCRAWQSW BIT(1),          /* CHECK AWAITQ FOR MORE WORK =1    */ 01379000
*                                /* CHECK WAITQ =0                   */ 01380000
*   2  ZCRRCDSV CHAR(1),         /* RETURN CODE SAVEAREA             */ 01381000
*   2  ZCRPRMTC CHAR(1),         /* PREEMPT COMPLETION PARAMETER BYTE*/ 01382000
*   2  ZCROPCDE CHAR(1),         /* OP CODE TO BE TRANSFORMED         * 01383000
*   2  ZCRR2SV PTR(31),          /* ISTZBFDI REG 2 SAVE EREA         */ 01384000
*   2  ZCRR13SV PTR(31),         /* ISTSBFDI REG 13 SAVE EREA        */ 01385000
*   2  ZCRCIDSV BDY(WORD),       /* ISTZBFDI CID SAVE AREA           */ 01386000
*      3  ZCRSAFSV CHAR(2),      /* ISTZBFDI SAF SAVE AREA           */ 01387000
*      3  ZCRDAFSV CHAR(2),      /* ISTZBFDI DAF SAVE AREA           */ 01388000
*   2  ZCRSAVEZ (6) BDY(WORD) CHAR(LENGTH(ISTZSAVE)),              0372 01389000
*                                /* SAVE/TRACE AREAS FOR TPIOS MODS  */ 01390000
*   2  ZCRREMIC PTR(31),        /* POINTER TO REMOTE RN ICNCB        */ 01391000
*   2  ZCRAUDIT CHAR(36),        /* TPIOS AUDIT TRAIL AREA           */ 01392000
*      3  ZCRTID CHAR(1),        /* THREAD I.D.                      */ 01393000
*      3  ZCRTNAME CHAR(4),      /* LAST 4 CHARS OF THREAD NAME      */ 01394000
*      3  ZCRENTER BIT(248),     /* BIT ARRAY FOR MODULES ENTERED    */ 01395000
*         4  ZCREAC1A BIT(1),    /* ISTZAC1A ENTERED                 */ 01396000
*         4  ZCREAC0A BIT(1),    /* ISTZAC0A ENTERED                 */ 01397000
*         4  ZCREAC0B BIT(1),    /* ISTZAC0B ENTERED                 */ 01398000
*         4  ZCREAC1B BIT(1),    /* ISTZAC1B ENTERED                 */ 01399000
*         4  ZCREBCAA BIT(1),    /* ISTZBCAA ENTERED                 */ 01400000
*         4  ZCREBCAB BIT(1),    /* ISTZBCAB ENTERED                 */ 01401000
*         4  ZCREBCAE BIT(1),    /* ISTZBCAE ENTERED                 */ 01402000
*         4  ZCREBCAG BIT(1),    /* ISTZBCAG ENTERED                 */ 01403000
*         4  ZCREBCAI BIT(1),    /* ISTZBCAI ENTERED                 */ 01404000
*         4  ZCREBCAM BIT(1),    /* ISTZBCAM ENTERED                 */ 01405000
*         4  ZCREBCBA BIT(1),    /* ISTZBCBA ENTERED                 */ 01406000
*         4  ZCREBCBB BIT(1),    /* ISTZBCBB ENTERED                 */ 01407000
*         4  ZCREBCBI BIT(1),    /* ISTZBCBI ENTERED                 */ 01408000
*         4  ZCREBCCB BIT(1),    /* ISTZBCCB ENTERED                 */ 01409000
*         4  ZCREBCDI BIT(1),    /* ISTZBCDI ENTERED                 */ 01410000
*         4  ZCREBCEB BIT(1),    /* ISTZBCEB ENTERED                 */ 01411000
*         4  ZCREBCFA BIT(1),    /* ISTZBCFA ENTERED                 */ 01412000
*         4  ZCREBCFB BIT(1),    /* ISTZBCFB ENTERED                 */ 01413000
*         4  ZCREBCGA BIT(1),    /* ISTZBCGA ENTERED                 */ 01414000
*         4  ZCREBCGB BIT(1),    /* ISTZBCGB ENTERED                 */ 01415000
*         4  ZCREBCHA BIT(1),    /* ISTZBCHA ENTERED                 */ 01416000
*         4  ZCREBCHB BIT(1),    /* ISTZBCHB ENTERED                 */ 01417000
*         4  ZCREBCIA BIT(1),    /* ISTZBCIA ENTERED                 */ 01418000
*         4  ZCREBCIB BIT(1),    /* ISTZBCIB ENTERED                 */ 01419000
*         4  ZCREBCID BIT(1),    /* ISTZBCID ENTERED                 */ 01420000
*         4  ZCREBCJA BIT(1),    /* ISTZBCJA ENTERED                 */ 01421000
*         4  ZCREBCJB BIT(1),    /* ISTZBCJB ENTERED                 */ 01422000
*         4  ZCREBCKA BIT(1),    /* ISTZBCKA ENTERED                 */ 01423000
*         4  ZCREBCKB BIT(1),    /* ISTZBCKB ENTERED                 */ 01424000
*         4  ZCREBCLA BIT(1),    /* ISTZBCLA ENTERED                 */ 01425000
*         4  ZCREBCLB BIT(1),    /* ISTZBCLB ENTERED                 */ 01426000
*         4  ZCREBCMB BIT(1),    /* ISTZBCMB ENTERED                 */ 01427000
*         4  ZCREBCND BIT(1),    /* ISTZBCND ENTERED                 */ 01428000
*         4  ZCREBCNE BIT(1),    /* ISTZBCNE ENTERED                 */ 01429000
*         4  ZCREBCOB BIT(1),    /* ISTZBCOB ENTERED                 */ 01430000
*         4  ZCREBCPB BIT(1),    /* ISTZBCPB ENTERED                 */ 01431000
*         4  ZCREBCQB BIT(1),    /* ISTZBCQB ENTERED                 */ 01432000
*         4  ZCREBCRA BIT(1),    /* ISTZBCRA ENTERED                 */ 01433000
*         4  ZCREBCRB BIT(1),    /* ISTZBCRB ENTERED                 */ 01434000
*         4  ZCREBCSC BIT(1),    /* ISTZBCSC ENTERED                 */ 01435000
*         4  ZCREBCXA BIT(1),    /* ISTZBCXA ENTERED                 */ 01436000
*         4  ZCREBCX0 BIT(1),    /* ISTZBCX0 ENTERED                 */ 01437000
*         4  ZCREBCY0 BIT(1),    /* ISTZBCY0 ENTERED                 */ 01438000
*         4  ZCREBCZ0 BIT(1),    /* ISTZBCZ0 ENTERED                 */ 01439000
*         4  ZCREBC0A BIT(1),    /* ISTZBC0A ENTERED                 */ 01440000
*         4  ZCREBC0B BIT(1),    /* ISTZBC0B ENTERED                 */ 01441000
*         4  ZCRECC0A BIT(1),    /* ISTZCC0A ENTERED                 */ 01442000
*         4  ZCRECC0B BIT(1),    /* ISTZCC0B ENTERED                 */ 01443000
*         4  ZCRECC1A BIT(1),    /* ISTZCC1A ENTERED                 */ 01444000
*         4  ZCRECC1B BIT(1),    /* ISTZCC1B ENTERED                 */ 01445000
*         4  ZCRECC2B BIT(1),    /* ISTZCC2B ENTERED                 */ 01446000
*         4  ZCREDCA0 BIT(1),    /* ISTZDCA0 ENTERED                 */ 01447000
*         4  ZCREDCB0 BIT(1),    /* ISTZDCB0 ENTERED                 */ 01448000
*         4  ZCREDCC0 BIT(1),    /* ISTZDCC0 ENTERED                 */ 01449000
*         4  ZCREDCD0 BIT(1),    /* ISTZDCD0 ENTERED                 */ 01450000
*         4  ZCREDCE0 BIT(1),    /* ISTZDCE0 ENTERED                 */ 01451000
*         4  ZCREDCF0 BIT(1),    /* ISTZDCF0 ENTERED                 */ 01452000
*         4  ZCREDCH0 BIT(1),    /* ISTZDCH0 ENTERED                 */ 01453000
*         4  ZCREDCI0 BIT(1),    /* ISTZDCI0 ENTERED                 */ 01454000
*         4  ZCREDCJ0 BIT(1),    /* ISTZDCJ0 ENTERED                 */ 01455000
*         4  ZCREDCKA BIT(1),    /* ISTZDCKA ENTERED                 */ 01456000
*         4  ZCREDCKB BIT(1),    /* ISTZDCKB ENTERED                 */ 01457000
*         4  ZCREDCL0 BIT(1),    /* ISTZDCL0 ENTERED                 */ 01458000
*         4  ZCREDCMB BIT(1),    /* ISTZDCMB ENTERED                 */ 01459000
*         4  ZCREECBA BIT(1),    /* ISTZECBA ENTERED                 */ 01460000
*         4  ZCREECBB BIT(1),    /* ISTZECBB ENTERED                 */ 01461000
*         4  ZCREECCA BIT(1),    /* ISTZECCA ENTERED                 */ 01462000
*         4  ZCREECCB BIT(1),    /* ISTZECCB ENTERED                 */ 01463000
*         4  ZCREECDA BIT(1),    /* ISTZECDA ENTERED                 */ 01464000
*         4  ZCREECEA BIT(1),    /* ISTZECEA ENTERED                 */ 01465000
*         4  ZCREECTA BIT(1),    /* ISTZECTA ENTERED                 */ 01466000
*         4  ZCREFCEA BIT(1),    /* ISTZFCEA ENTERED                 */ 01467000
*         4  ZCREFCEB BIT(1),    /* ISTZFCEB ENTERED                 */ 01468000
*         4  ZCREGCAB BIT(1),    /* ISTZGCAB ENTERED                 */ 01469000
*         4  ZCREGCBB BIT(1),    /* ISTZGCBB ENTERED                 */ 01470000
*         4  *        BIT(1),    /* NOT USED                         */ 01471000
*         4  ZCREGCDB BIT(1),    /* ISTZGCDB ENTERED                 */ 01472000
*         4  ZCREGCEB BIT(1),    /* ISTZGCEB ENTERED                 */ 01473000
*         4  ZCREGCLA BIT(1),    /* ISTZGCLA ENTERED                 */ 01474000
*         4  ZCREGC0A BIT(1),    /* ISTZGC0A ENTERED                 */ 01475000
*         4  ZCREGC0B BIT(1),    /* ISTZGC0B ENTERED                 */ 01476000
*         4  ZCREHCAN BIT(1),    /* ISTZHCAN ENTERED                 */ 01477000
*         4  ZCREICAA BIT(1),    /* ISTZICAA ENTERED                 */ 01478000
*         4  ZCREICAB BIT(1),    /* ISTZICAB ENTERED                 */ 01479000
*         4  ZCREICBB BIT(1),    /* ISTZICBB ENTERED                 */ 01480000
*         4  ZCREICBI BIT(1),    /* ISTZICBI ENTERED                 */ 01481000
*         4  ZCREICCB BIT(1),    /* ISTZICCB ENTERED                 */ 01482000
*         4  ZCREICCI BIT(1),    /* ISTZICCI ENTERED                 */ 01483000
*         4  ZCREICDB BIT(1),    /* ISTZICDB ENTERED                 */ 01484000
*         4  ZCREICEB BIT(1),    /* ISTZICEB ENTERED                 */ 01485000
*         4  ZCREICGB BIT(1),    /* ISTZICGB ENTERED                 */ 01486000
*         4  ZCREICHB BIT(1),    /* ISTZICHB ENTERED                 */ 01487000
*         4  ZCREICIB BIT(1),    /* ISTZICIB ENTERED                 */ 01488000
*         4  ZCREICID BIT(1),    /* ISTZICID ENTERED                 */ 01489000
*         4  ZCREICJB BIT(1),    /* ISTZICJB ENTERED                 */ 01490000
*         4  ZCREICKB BIT(1),    /* ISTZICKB ENTERED                 */ 01491000
*         4  ZCREICKE BIT(1),    /* ISTZICKE ENTERED                 */ 01492000
*         4  ZCREICKG BIT(1),    /* ISTZICKG ENTERED                 */ 01493000
*         4  ZCREICLB BIT(1),    /* ISTZICLB ENTERED                 */ 01494000
*         4  ZCREICMB BIT(1),    /* ISTZICMB ENTERED                 */ 01495000
*         4  ZCREICNA BIT(1),    /* ISTZICNA ENTERED                 */ 01496000
*         4  ZCREICNB BIT(1),    /* ISTZICNB ENTERED                 */ 01497000
*         4  ZCREICOA BIT(1),    /* ISTZICOA ENTERED                 */ 01498000
*         4  ZCREICOB BIT(1),    /* ISTZICOB ENTERED                 */ 01499000
*         4  ZCREICQA BIT(1),    /* ISTZICQA ENTERED                 */ 01500000
*         4  ZCREICQB BIT(1),    /* ISTZICQB ENTERED                 */ 01501000
*         4  ZCREICRB BIT(1),    /* ISTZICRB ENTERED                 */ 01502000
*         4  ZCREICSB BIT(1),    /* ISTZICSB ENTERED                 */ 01503000
*         4  ZCREICSC BIT(1),    /* ISTZICSC ENTERED                 */ 01504000
*         4  ZCREICTB BIT(1),    /* ISTZICTB ENTERED                 */ 01505000
*         4  ZCREICUB BIT(1),    /* ISTZICUB ENTERED                 */ 01506000
*         4  ZCREICVB BIT(1),    /* ISTZICVB ENTERED                 */ 01507000
*         4  ZCREICWB BIT(1),    /* ISTZICWB ENTERED                 */ 01508000
*         4  ZCREICX0 BIT(1),    /* ISTZICX0 ENTERED                 */ 01509000
*         4  ZCREIC0B BIT(1),    /* ISTZIC0B ENTERED                 */ 01510000
*         4  ZCREIC1B BIT(1),    /* ISTZIC1B ENTERED                 */ 01511000
*         4  ZCREJCAB BIT(1),    /* ISTZJCAB ENTERED                 */ 01512000
*         4  ZCREJCBB BIT(1),    /* ISTZJCBB ENTERED                 */ 01513000
*         4  ZCREJCCB BIT(1),    /* ISTZJCCB ENTERED                 */ 01514000
*         4  ZCREJCDB BIT(1),    /* ISTZJCDB ENTERED                 */ 01515000
*         4  ZCREJC0B BIT(1),    /* ISTZJC0B ENTERED                 */ 01516000
*         4  ZCREKCBB BIT(1),    /* ISTZKCBB ENTERED                 */ 01517000
*         4  ZCREKCBN BIT(1),    /* ISTZKCBN ENTERED                 */ 01518000
*         4  ZCREKCCN BIT(1),    /* ISTZKCCN ENTERED                 */ 01519000
*         4  ZCREDCWR BIT(1),    /* ISTZDCWR ENTERED                 */ 01520000
*         4  ZCREDCWB BIT(1),    /* ISTZDCWB ENTERED                 */ 01521000
*         4  ZCREDCXR BIT(1),    /* ISTZDCXR ENTERED                 */ 01522000
*         4  ZCREBCBR BIT(1),    /* ISTZBCBR ENTERED                 */ 01523000
*         4  ZCREBCDR BIT(1),    /* ISTZBCDR ENTERED                 */ 01524000
*         4  ZCREBCAR BIT(1),    /* ISTZBCAR ENTERED                 */ 01525000
*         4  ZCRECCBI BIT(1),    /* ISTZCCBI ENTERED                 */ 01526000
*         4  ZCRECCAI BIT(1),    /* ISTZCCAI ENTERED                 */ 01527000
*         4  ZCRECCCI BIT(1),    /* ISTZCCCI ENTERED                 */ 01528000
*         4  ZCREAC1R BIT(1),    /* ISTZAC1R ENTERED                 */ 01529000
*         4  ZCREBCSB BIT(1),    /* ISTZBCSB ENTERED                 */ 01530000
*         4  ZCREDCPR BIT(1),    /* ISTZDCPR ENTERED                 */ 01531000
*         4  ZCREDCQR BIT(1),    /* ISTZDCQR ENTERED                 */ 01532000
*         4  ZCREBCAL BIT(1),    /* ISTZBCAL ENTERED                 */ 01533000
*         4  ZCREBC0L BIT(1),    /* ISTZBC0L ENTERED                 */ 01534000
*         4  ZCREBCNB BIT(1),    /* ISTZBCNB ENTERED                 */ 01535000
*         4  ZCREICOE BIT(1),    /* ISTZICOE ENTERED                 */ 01536000
*         4  ZCREDCNB BIT(1),    /* ISTZDCNB ENTERED                 */ 01537000
*         4  ZCREKCCB BIT(1),    /* ISTZKCCB ENTERED                 */ 01538000
*         4  ZCRECFY0 BIT(1),    /* ISTZCFY0 ENTERED                 */ 01539000
*         4  ZCREDCK0 BIT(1),    /* ISTZDFK0 ENTERED                 */ 01540000
*         4  ZCREICSG BIT(1),    /* ISTZICSG ENTERED                 */ 01541000
*         4  ZCREBCIF BIT(1),    /* ISTZBCIF ENTERED                 */ 01542000
*         4  ZCREDCMF BIT(1),    /* ISTZDCMF ENTERED                 */ 01543000
*         4  ZCRELCAB BIT(1),    /* ISTZLCAB ENTERED                 */ 01544000
*         4  ZCREAC2B BIT(1),    /* ISTZAC2B ENTERED                 */ 01545000
*         4  ZCREIC2B BIT(1),    /* ISTZIC2B ENTERED                 */ 01546000
*         4  ZCRRSV97 BIT(97),   /* RESERVED                         */ 01547000
*   2  ZCRCMNRC CHAR(1),                /* PURGE MWOR RETURN CODE    */ 01548000
*   2  ZCRWORDA CHAR(3),                /* RESERVED FOR LATER USE    */ 01549000
*   2  ZCRLCPB  CHAR(LENGTH(ISTLCPB)),  /* 3270 S/R LCPB             */ 01550000
*      3 ZCRRHRU,                       /* SAVEAREA FOR RH AND RU    */ 01551000
*        4 ZCRRH    CHAR(3),            /* RH                        */ 01552000
*        4 ZCRRU    CHAR(*);            /* RU                        */ 01553000
*DCL ZCTYPE BIT(8) CONSTANT('00'X);   /* ZCR TYPE                   */  01554000
*DCL ZCLNG FIXED(15) CONSTANT(172);   /* ZCRR LENGTH                */  01555000
*DCL ZCRSAVNO BIT(8) CONSTANT('06'X); /* NUMBER OF SAVEAREAS IN ZCRR */ 01556000
*DCL ZCRLSVNO BIT(8) CONSTANT('04'X); /* NUMBER OF SAVE AREAS IN   0376 01557000
*                                         LOCAL SUPPORT              */ 01558000
*/* *** EQUATES FOR ZCRRCDSV *** */                                0377 01559000
*                                                                  0377 01560000
*DCL ZCRMRFSB BIT(8) CONSTANT('0C'X);  /* REQUEST COMPLETION MOVE FSB   01561000
*                                         TO PROCESS                 */ 01562000
*DCL ZCRSRCHQ BIT(8) CONSTANT('10'X);  /* REQUEST COMPLETION SEARCH     01563000
*                                         REQUEST QUEUE              */ 01564000
*DCL ZCREXIT  BIT(8) CONSTANT('14'X);  /* REQUEST COMPLETION EXIT    */ 01565000
*DCL ZCRSFSB  BIT(8) CONSTANT('18'X);  /* REQUEST COMPLETION SINGLE     01566000
*                                         FSB                        */ 01567000
*DCL ZCRDLFSB BIT(8) CONSTANT('1C'X);  /* REQUEST COMPLETION DUAL FSB * 01568000
*DCL ZCRNOSCH BIT (8) CONSTANT('20'X); /* REQUEST COMPLETION, EXIT WITH 01569000
*                                         SCHED NONE                 */ 01570000
*DCL ZCRNRSCH BIT (8) CONSTANT('24'X); /* REQUEST COMPLETION, EXIT WITH 01571000
*                                         SCHED NORM                 */ 01572000
*DCL ZCRLGERR FIXED(8) CONSTANT(8);    /* LOGICAL ERROR              */ 01573000
*DCL ZCPLSCB BIT(8) CONSTANT('08'X);   /* GET A RELEASE LSCB         */ 01574000
*DCL ZCPBUF  BIT(8) CONSTANT('04'X);   /* GET A RELEASE BUFFER       */ 01575000
*DCL ZCRTAC0A FIXED(8) CONSTANT(01);   /* LOCAL DEVICE SCHEDULER(OUT)*/ 01576000
*DCL ZCRTAC0B FIXED(8) CONSTANT(02);   /* REMOTE DEVICE SCHEDLER(OUT)*/ 01577000
*DCL ZCRTCC1A FIXED(8) CONSTANT(03);   /* LOCAL DIALOG SCHEDLER(IN)  */ 01578000
*DCL ZCRTCC1B FIXED(8) CONSTANT(04);   /* REMOTE DIALOG SCHEDLER(IN) */ 01579000
*DCL ZCRTDCE0 FIXED(8) CONSTANT(05);   /* NCP SLOWDOWN RECOVERY      */ 01580000
*DCL ZCRTDCKA FIXED(8) CONSTANT(06);   /* LOCAL GENERAL FUNCTIONS    */ 01581000
*DCL ZCRTDCKB FIXED(8) CONSTANT(07);   /* REMOTE GENERAL FUNCTIONS   */ 01582000
*DCL ZCRTFCEB FIXED(8) CONSTANT(08);   /* REMOTE READ BUFFER ALLOC.  */ 01583000
*DCL ZCRTGCLA FIXED(8) CONSTANT(09);   /* LCAL CTL & TEST FEEDBACK(IN)* 01584000
*DCL ZCRTGC0A FIXED(8) CONSTANT(10);   /* LOCAL REQ. COMPLETION(IN)  */ 01585000
*DCL ZCRTGC0B FIXED(8) CONSTANT(11);   /* REMOTE REQ. COMPLETION(IN) */ 01586000
*DCL ZCRTICWB FIXED(8) CONSTANT(12);   /* RESET CLEANUP (PHASE 5)    */ 01587000
*DCL ZCRTIC0B FIXED(8) CONSTANT(13);   /* REMOTE REQ COMPLTION CTL(IN)* 01588000
*DCL ZCRTAC1B FIXED(8) CONSTANT(14);   /* ISTZAC1B THREAD ID         */ 01589000
*DCL ZCRTIC1B FIXED(8) CONSTANT(15);   /* ISTZIC1B THREAD ID         */ 01590000
*DCL ZCRTCCBI FIXED(8) CONSTANT(16);   /* ISTZCCBI THREAD ID         */ 01591000
*DCL ZCRTAC1R FIXED(8) CONSTANT(17);   /* ISTZAC1R THREAD ID         */ 01592000
*DCL ZCRTAC1A FIXED(8) CONSTANT(18);   /* ISTZAC1A THREAD ID         */ 01593000
*DCL ZCRTLCAB FIXED(8) CONSTANT(19);   /* ISTZLCAB THREAD ID         */ 01594000
*/* COMPONENT RECOVERY                                               */ 01595000
*/*                                                                  */ 01596000
*DCL 1 ISTASCRR BDY(WORD) BASED,        /* CRR FOR SMS               */ 01597000
*     2  ASCPFCRR CHAR(LENGTH(ISTPFCRR)),                          0406 01598000
*     2  ASCFLAGS CHAR(7),              /* FLAGS                     */ 01599000
*        3  ASCFLG1 CHAR(2),            /* MODULE TRACE FLAGS        */ 01600000
*           4  ASCFBA BIT(1),           /* ALLOCATION IN PATH        */ 01601000
*           4  ASCFBD BIT(1),           /* DE-ALLOCATION IN PATH     */ 01602000
*           4  ASCFSR BIT(1),           /* FSR IN PATH               */ 01603000
*           4  ASCPASTR BIT(13),        /* RESERVED PATH FLAGS       */ 01604000
*        3  ASCFLG2 CHAR(2),            /* MODULE IN CONTROL FLAGS   */ 01605000
*           4  ASCFBAIC BIT(1),         /* ALLOCATION IN CONTROL     */ 01606000
*           4  ASCFBDIC BIT(1),         /* DE-ALLOCATION IN CONTROL  */ 01607000
*           4  ASCFSRIC BIT(1),         /* FSR IN CONTROL            */ 01608000
*           4  ASCICR BIT(13),          /* RESERVED IN CONTROL FLAGS */ 01609000
*        3  ASCFLG3 CHAR(3),            /* AUDIT FLAGS               */ 01610000
*           4  ASCFSRGT BIT(1),         /* FSR DOING GET PROCESSING  */ 01611000
*           4  ASCFBDAL BIT(1),         /* FBD DOING ALLOCATION      */ 01612000
*           4  ASCKEYF BIT(1),          /* KEY HAS BEEN ALTERED      */ 01613000
*           4  ASCLLKF BIT(1),          /* LOCAL LOCK HELD           */ 01614000
*           4  ASCFBDUD BIT(1),         /* FBD USING USER DATA       */ 01615000
*           4  ASCAUDIT BIT(19),        /* RESERVED AUDIT BITS       */ 01616000
*     2  ASCKEY CHAR(1),                /* ORIGINAL KEY              */ 01617000
*     2  ASCETRYA PTR(31),              /* RETRY ADRS FOR CONTINUE 0406 01618000
*                                          OPTION                    */ 01619000
*     2  ASCUSRGS CHAR(16),             /* SAVE AREA FOR USER REGS 0406 01620000
*                                          14 - 1                    */ 01621000
*        3  ASCUSR14 CHAR(4),           /* REGISTER 14               */ 01622000
*        3  ASCUSR15 CHAR(4),           /* REGISTER 15               */ 01623000
*        3  ASCUSR00 CHAR(4),           /* REGISTER 0                */ 01624000
*        3  ASCUSR01 CHAR(4),           /* REGISTER 1                */ 01625000
*     2  ASCPSREG CHAR(16);             /* SAVE AREA FOR PSS       0406 01626000
*                                          REGS 1 - 4                */ 01627000
*/*  INITIAL LEVEL                                      001 04/09/75 */ 01628000
*DCL 1 ISTAPCRR BDY(WORD) BASED,                                   0407 01629000
*     2 APCHDRSV CHAR(LENGTH(ISTPFCRR)),  /* HEADER                  */ 01630000
*     2  APCATFLG CHAR(2),              /* AUDIT TRACE FLAGS         */ 01631000
*        3  APC51E BIT(1),              /* ISTAPC51 WAS ENTERED      */ 01632000
*        3  APC52E BIT(1),              /* ISTAPC52  '     '         */ 01633000
*        3  APC53E BIT(1),              /* ISTAPC53                  */ 01634000
*        3  APC54E BIT(1),                                         0407 01635000
*        3  APC56E BIT(1),                                         0407 01636000
*        3  APC57E BIT(1),                                         0407 01637000
*        3  APC58E BIT(1),                                         0407 01638000
*        3  APC31E BIT(1),                                         0407 01639000
*        3 * BIT(8),                    /* RESERVED                  */ 01640000
*     2  APCRFLG CHAR(2),               /* AUDIT TRACE FLAGS         */ 01641000
*        3  APC51R BIT(1),              /* ISTAPCR1 IS RUNNING       */ 01642000
*        3  APC52R BIT(1),              /* ISTAPC52 IS RUNNING       */ 01643000
*        3  APC53R BIT(1),                                         0407 01644000
*        3  APC54R BIT(1),                                         0407 01645000
*        3  APC56R BIT(1),                                         0407 01646000
*        3  APC57R BIT(1),                                         0407 01647000
*        3  APC58R BIT(1),                                         0407 01648000
*        3  APC31R BIT(1),                                         0407 01649000
*        3  *      BIT(8),              /* RESERVED                  */ 01650000
*     2  APCPSTA PTR(31),               /* PST@                      */ 01651000
*     2  APCTCBA PTR(31),               /* TCB@                      */ 01652000
*     2  APCRTRN PTR(31),               /*@ TO BR14 TO RTN TO SYSTEM */ 01653000
*     2  APCPABSV PTR(31),              /*SAVED PAB@ TO REDISPATCH   */ 01654000
*     2  APCQWFO PTR(31),               /* Q@ IN PST WORK AREA ON    */ 01655000
*     2  APCFRRPM PTR(31),              /* WORKAREA@ RTN'D FROM SETFR*/ 01656000
*     2  APCSAVE CHAR(72),                                         0407 01657000
*        3  APCESTAL CHAR(72),          /* ESTAE PARAMETER LIST AREA */ 01658000
*     2  APCCOMF CHAR(4) BDY(HWORD),    /* FLAGS USED BY ALL PSS RTN */ 01659000
*        3  APCCOMF1 CHAR(2),                                      0407 01660000
*           4  APCSSTSK BIT(1),         /* IRB TYPE WORK             */ 01661000
*           4  APCUETSK BIT(1),         /* USER EXIT RUNNING UNDER IRB* 01662000
*           4  APCSMCR BIT(1),          /* SMA CRA BEING USED        */ 01663000
*           4  APCIRB1 BIT(1),          /* IRB1 BEING USED           */ 01664000
*           4  APCIRB2 BIT(1),          /* IRB2 BEING USED           */ 01665000
*           4  APCRELR BIT(1),          /*CALL ISTAPC58 TO RLEASE CRA*/ 01666000
*           4  APCEXIT BIT(1),          /* TELLS ISTAPC58 TO EXIT SYS*/ 01667000
*           4  APCZLBER BIT(1),         /* ERR WHILE RUNNING ZLFAB PAB* 01668000
*           4  * BIT(8),                /* RESERVED                  */ 01669000
*        3  APCRETCD FIXED(15),         /* RTN CODE FOR R15 FOR SYS  */ 01670000
*     2  APCSAV1 PTR(31),               /* 1ST SAVE WORD             */ 01671000
*     2  APCSAV2 PTR(31),               /* 2ND SAVE WORD             */ 01672000
*     2  APCSWTWD CHAR(4),              /* SWITCH AREA FOR PSS RTN   */ 01673000
*     2  APC31FLG CHAR(1),              /* ISTAPC31 FLAGS            */ 01674000
*        3  APCTPXIT BIT(1),            /* TPEXIT IN PROGRESS        */ 01675000
*        3  APCRESCH BIT(1),            /*PAB TPEXIT OCCURED  RESCHED*/ 01676000
*        3  APCSORT BIT(1),       /* PAB SORTED TO PROPER PST/MPST   */ 01677000
*        3  *       BIT(5),       /* RESERVED                        */ 01678000
*     2  APC52FLG CHAR(1),        /* ISTAPC52 FLAGS                  */ 01679000
*        3  APCCKRQ BIT(1),       /* CHECK RDY Q FOR WORK            */ 01680000
*        3  APCSMSR BIT(1),       /* RETURNING SMS RPH               */ 01681000
*        3  APCQENQ BIT(1),       /* ENQUEUEING PAB'S ON PST Q'S     */ 01682000
*        3  APCRDQ BIT(1),        /* DEQUEING PAB'S FROM PST RDY Q   */ 01683000
*        3  APCNWF BIT(1),        /* NO WORK FOUND                   */ 01684000
*        3  APCWKF   BIT(1),      /* WORK FOUND                      */ 01685000
*        3    *      BIT(2),      /* RESERVED                        */ 01686000
*     2  APC53FLG CHAR(1),        /* ISTAPC53 FLAGS                  */ 01687000
*        3  APCPR153 BIT(1),      /* USED PREALLOCATED CRA           */ 01688000
*     2  APC54FLG CHAR(1),        /* ISTAPC54 FLAGS                  */ 01689000
*        3  APCRLST BIT(1),       /* SMS BEING CALLED TO RELEASE UECB*/ 01690000
*        3  * BIT(7),             /* RESERVED                        */ 01691000
*     2  APC57FLG CHAR(1),        /* ISTAPC57 FLAGS                  */ 01692000
*        3  APCRECRA BIT(1),      /* RELEASE CRA BEING DONE          */ 01693000
*        3  APCNREL BIT(1),       /* DID NOT RELEASE CRA             */ 01694000
*        3  *   BIT(6),           /* RESERVED                        */ 01695000
*     2  * CHAR(15);              /* RESERVED                        */ 01696000
*/*               COMPONENT RECOVERY AREA                            */ 01697000
*/*  REVISIONS                                         005 04/09/75  */ 01698000
*DCL 1  ISTCRA BASED BDY(DWORD),        /* COMPONENT RECOVERY AREA   */ 01699000
*     2  CRABASIC BDY(WORD),            /* CRA WITHOUT PROCESS CRR   */ 01700000
*      3 CRAHDR CHAR(8) BDY(WORD),      /* CRA HEADER                */ 01701000
*        4  CRACRR PTR(31),             /* PTR TO ACTIVE CRR         */ 01702000
*        4  CRAFRR PTR(31),             /* PTR TO ACTIVE FRR         */ 01703000
*      3 CRALKACT BIT(32),              /* LOCK LEVEL AND          0408 01704000
*                                          OWNERSHIP FLAGS           */ 01705000
*        4  CRALEV32 BIT(1),            /* 1 = LEVEL 32 LOCK HELD    */ 01706000
*        4  CRALEV31 BIT(1),            /* 1 = LEVEL 31 LOCK HELD    */ 01707000
*        4  CRALEV30 BIT(1),            /* 1 = LEVEL 30 LOCK HELD    */ 01708000
*        4  CRALEV29 BIT(1),            /* 1 = LEVEL 29 LOCK HELD    */ 01709000
*        4  CRALEV28 BIT(1),            /* 1 = LEVEL 28 LOCK HELD    */ 01710000
*        4  CRALEV27 BIT(1),            /* 1 = LEVEL 27 LOCK HELD    */ 01711000
*        4  CRALEV26 BIT(1),            /* 1 = LEVEL 26 LOCK HELD    */ 01712000
*        4  CRALEV25 BIT(1),            /* 1 = LEVEL 25 LOCK HELD    */ 01713000
*        4  CRALEV24 BIT(1),            /* 1 = LEVEL 24 LOCK HELD    */ 01714000
*        4  CRALEV23 BIT(1),            /* 1 = LEVEL 23 LOCK HELD    */ 01715000
*        4  CRALEV22 BIT(1),            /* 1 = LEVEL 22 LOCK HELD    */ 01716000
*        4  CRALEV21 BIT(1),            /* 1 = LEVEL 21 LOCK HELD    */ 01717000
*        4  CRALEV20 BIT(1),            /* 1 = LEVEL 20 LOCK HELD    */ 01718000
*        4  CRALEV19 BIT(1),            /* 1 = LEVEL 19 LOCK HELD    */ 01719000
*        4  CRALEV18 BIT(1),            /* 1 = LEVEL 18 LOCK HELD    */ 01720000
*        4  CRALEV17 BIT(1),            /* 1 = LEVEL 17 LOCK HELD    */ 01721000
*        4  CRALEV16 BIT(1),            /* 1 = LEVEL 16 LOCK HELD    */ 01722000
*        4  CRALEV15 BIT(1),            /* 1 = LEVEL 15 LOCK HELD    */ 01723000
*        4  CRALEV14 BIT(1),            /* 1 = LEVEL 14 LOCK HELD    */ 01724000
*        4  CRALEV13 BIT(1),            /* 1 = LEVEL 13 LOCK HELD    */ 01725000
*        4  CRALEV12 BIT(1),            /* 1 = LEVEL 12 LOCK HELD    */ 01726000
*        4  CRALEV11 BIT(1),            /* 1 = LEVEL 11 LOCK HELD    */ 01727000
*        4  CRALEV10 BIT(1),            /* 1 = LEVEL 10 LOCK HELD    */ 01728000
*        4  CRALEV09 BIT(1),            /* 1 = LEVEL 9 LOCK HELD     */ 01729000
*        4  CRALEV08 BIT(1),            /* 1 = LEVEL 8 LOCK HELD     */ 01730000
*        4  CRALEV07 BIT(1),            /* 1 = LEVEL 7 LOCK HELD     */ 01731000
*        4  CRALEV06 BIT(1),            /* 1 = LEVEL 6 LOCK HELD     */ 01732000
*        4  CRALEV05 BIT(1),            /* 1 = LEVEL 5 LOCK HELD     */ 01733000
*        4  CRALEV04 BIT(1),            /* 1 = LEVEL 4 LOCK HELD     */ 01734000
*        4  CRALEV03 BIT(1),            /* 1 = LEVEL 3 LOCK HELD     */ 01735000
*        4  CRALEV02 BIT(1),            /* 1 = LEVEL 2 LOCK HELD     */ 01736000
*        4  CRALEV01 BIT(1),            /* 1 = LEVEL 1 LOCK HELD     */ 01737000
*      3 CRAL1PTR PTR(31),              /* PTR TO LEVEL 1 LOCK       */ 01738000
*      3 CRAL2PTR PTR(31),              /* PTR TO LEVEL 2 LOCK       */ 01739000
*      3 CRAL3PTR PTR(31),              /* PTR TO LEVEL 3 LOCK       */ 01740000
*      3 CRAL4PTR PTR(31),              /* PTR TO LEVEL 4 LOCK       */ 01741000
*      3 CRAL5PTR PTR(31),              /* PTR TO LEVEL 5 LOCK       */ 01742000
*      3 CRAL6PTR PTR(31),              /* PTR TO LEVEL 6 LOCK       */ 01743000
*      3 CRAL7PTR PTR(31),              /* PTR TO LEVEL 7 LOCK       */ 01744000
*      3 CRAL8PTR PTR(31),              /* PTR TO LEVEL 8 LOCK       */ 01745000
*      3 CRAL9PTR PTR(31),              /* PTR TO LEVEL 9 LOCK       */ 01746000
*      3 CRALAPTR PTR(31),              /* RESERVED                  */ 01747000
*/*                                                                  */ 01748000
*/*   VS1/VS2 EXTENSION                                              */ 01749000
*/*                                                                  */ 01750000
*     2  CRARPH CHAR(LENGTH(ISTRPH)),   /* RPH ASSOCIATED WITH     0408 01751000
*                                          THIS CRH                  */ 01752000
*     2  CRAPSS CHAR(LENGTH(ISTAPCRR)), /* PSS CRR                   */ 01753000
*     2  CRAPROCR CHAR(LENGTH(ISTZCRR)) BDY(DWORD), /* PROCESS CRR   */ 01754000
*     2  CRASVC CHAR(72) BDY(WORD),     /* SERVICE RTN CRA           */ 01755000
*        3  CRAASCRR CHAR(LENGTH(ISTASCRR)), /* CRR FOR SMS          */ 01756000
*        3  CRAHSIZ  PTR(31),           /* HEADER SIZE QUED SMS REQ  */ 01757000
*        3  CRAMASK  PTR(31),           /* PREFIX MASK QUED SMS REQ  */ 01758000
*        3  CRABUFA  FIXED(31),         /* BUFF QUE FOR FBQ ALLOCATION* 01759000
*           4 CRABFTBA BIT(1),          /* NO BUFFERS ALLOCATED YET   * 01760000
*     2  CRARSV01 PTR(31),              /* RESERVED                  */ 01761000
*     2  CRARSV02 PTR(31),              /* RESERVED                  */ 01762000
*     2  CRACHAIN PTR(31);              /* CHAIN FIELD USED TO QUEUE    01763000
*                                          CRA TO PREALLOCATE QUEUE     01764000
*                                          WHEN NOT IN USE           */ 01765000
*DCL CRALMS32 BIT(32) CONSTANT('80000000'X); /* 32ND LEVEL LOCK MASK */ 01766000
*DCL CRALMS31 BIT(32) CONSTANT('40000000'X); /* 31ST LEVEL LOCK MASK */ 01767000
*DCL CRALMS30 BIT(32) CONSTANT('20000000'X); /* 30TH LEVEL LOCK MASK */ 01768000
*DCL CRALMS29 BIT(32) CONSTANT('10000000'X); /* 29TH LEVEL LOCK MASK */ 01769000
*DCL CRALMS28 BIT(32) CONSTANT('08000000'X); /* 28TH LEVEL LOCK MASK */ 01770000
*DCL CRALMS27 BIT(32) CONSTANT('04000000'X); /* 27TH LEVEL LOCK MASK */ 01771000
*DCL CRALMS26 BIT(32) CONSTANT('02000000'X); /* 26TH LEVEL LOCK MASK */ 01772000
*DCL CRALMS25 BIT(32) CONSTANT('01000000'X); /* 25TH LEVEL LOCK MASK */ 01773000
*DCL CRALMS24 BIT(32) CONSTANT('00800000'X); /* 24TH LEVEL LOCK MASK */ 01774000
*DCL CRALMS23 BIT(32) CONSTANT('00400000'X); /* 23RD LEVEL LOCK MASK */ 01775000
*DCL CRALMS22 BIT(32) CONSTANT('00200000'X); /* 22ND LEVEL LOCK MASK */ 01776000
*DCL CRALMS21 BIT(32) CONSTANT('00100000'X); /* 21ST LEVEL LOCK MASK */ 01777000
*DCL CRALMS20 BIT(32) CONSTANT('00080000'X); /* 20TH LEVEL LOCK MASK */ 01778000
*DCL CRALMS19 BIT(32) CONSTANT('00040000'X); /* 19TH LEVEL LOCK MASK */ 01779000
*DCL CRALMS18 BIT(32) CONSTANT('00020000'X); /* 18TH LEVEL LOCK MASK */ 01780000
*DCL CRALMS17 BIT(32) CONSTANT('00010000'X); /* 17TH LEVEL LOCK MASK */ 01781000
*DCL CRALMS16 BIT(32) CONSTANT('00008000'X); /* 16TH LEVEL LOCK MASK */ 01782000
*DCL CRALMS15 BIT(32) CONSTANT('00004000'X); /* 15TH LEVEL LOCK MASK */ 01783000
*DCL CRALMS14 BIT(32) CONSTANT('00002000'X); /* 14TH LEVEL LOCK MASK */ 01784000
*DCL CRALMS13 BIT(32) CONSTANT('00001000'X); /* 13TH LEVEL LOCK MASK */ 01785000
*DCL CRALMS12 BIT(32) CONSTANT('00000800'X); /* 12TH LEVEL LOCK MASK */ 01786000
*DCL CRALMS11 BIT(32) CONSTANT('00000400'X); /* 11TH LEVEL LOCK MASK */ 01787000
*DCL CRALMS10 BIT(32) CONSTANT('00000200'X); /* 10TH LEVEL LOCK MASK */ 01788000
*DCL CRALMS09 BIT(32) CONSTANT('00000100'X); /* 9TH LEVEL LOCK MASK  */ 01789000
*DCL CRALMS08 BIT(32) CONSTANT('00000080'X); /* 8TH LEVEL LOCK MASK  */ 01790000
*DCL CRALMS07 BIT(32) CONSTANT('00000040'X); /* 7TH LEVEL LOCK MASK  */ 01791000
*DCL CRALMS06 BIT(32) CONSTANT('00000020'X); /* 6TH LEVEL LOCK MASK  */ 01792000
*DCL CRALMS05 BIT(32) CONSTANT('00000010'X); /* 5TH LEVEL LOCK MASK  */ 01793000
*DCL CRALMS04 BIT(32) CONSTANT('00000008'X); /* 4TH LEVEL LOCK MASK  */ 01794000
*DCL CRALMS03 BIT(32) CONSTANT('00000004'X); /* 3RD LEVEL LOCK MASK  */ 01795000
*DCL CRALMS02 BIT(32) CONSTANT('00000002'X); /* 2ND LEVEL LOCK MASK  */ 01796000
*DCL CRALMS01 BIT(32) CONSTANT('00000001'X); /* 1ST LEVEL LOCK MASK  */ 01797000
*DCL CRACRA   CHAR(4) CONSTANT('CRA ');      /* CHARACTER C.B. ID    */ 01798000
* /*  CONNECTION SERVICES COMPONENT RECOVERY RECORD                  */ 01799000
* /* COMPLETED DCR SOLUTIONS                                         */ 01800000
* /* 1H0540 APRIL 28, 1973 MB                                        */ 01801000
*/* ZTR4417 JUNE 20, 73 DNM */                                     0442 01802000
* DCL 1 ISTCNSTA BDY(WORD) BASED,       /* CONNECTION SERVICES     0442 01803000
*                                          COMPONENT RECOVERY RECORD */ 01804000
*     2  CNSTPFX CHAR(LENGTH(ISTPFCRR)), /* STANDARD PREFIX        0442 01805000
*                                          FOR CRR                   */ 01806000
*     2  CNSTFLDA CHAR(3),              /* TRACE FIELD A - HISTORY   */ 01807000
*        3  CNSMRINA BIT(1),            /* MASTER ENTERED            */ 01808000
*        3  CNSAUTHA BIT(1),            /* ABOUT TO CALL AUTHORI-  0442 01809000
*                                          SATION EXIT       ZTR4417 */ 01810000
*        3  CNSAQINA BIT(1),            /* ACQUIRE ENTERED           */ 01811000
*        3  CNSXREQA BIT(1),            /* ACQUIRE SATISFIED         */ 01812000
*        3  CNSQREQA BIT(1),            /* ACQUIRE QUEUED            */ 01813000
*        3  CNSRLINA BIT(1),            /* RELEASE ENTERED           */ 01814000
*        3  CNSDORLA BIT(1),            /* DOREL REALLOCATION      0442 01815000
*                                          ENTERED                   */ 01816000
*        3  CNSTRRLA BIT(1),            /* RELEASE OF ACTIVE       0442 01817000
*                                          CONNECTION                */ 01818000
*        3  CNSRQRLA BIT(1),            /* RELEASE QUEUED REQUEST    */ 01819000
*        3  CNSPSINA BIT(1),            /* PASS ENTERED              */ 01820000
*        3  CNSACINA BIT(1),            /* ACCEPT ENTERED            */ 01821000
*        3  CNSLGINA BIT(1),            /* LOGON ENTERED             */ 01822000
*        3  CNSGBINA BIT(1),            /* PREEMPT ENTERED           */ 01823000
*        3  CNSCLINA BIT(1),            /* CANCEL ENTERED            */ 01824000
*        3  CNSCLAQA BIT(1),            /* CANCEL ACQUIRES           */ 01825000
*        3  CNSTCONA BIT(1),            /* TCONNECT                  */ 01826000
*        3  CNSACONA BIT(1),            /* ACONNECT                  */ 01827000
*        3  CNSQUEUA BIT(1),            /* QUEUE                     */ 01828000
*        3  CNSSEARA BIT(1),            /* SEARCH Q                  */ 01829000
*        3  CNSGETSA BIT(1),            /* CONNECTION SERVICES     0442 01830000
*                                          GETSTORE                  */ 01831000
*        3  CNSFREEA BIT(1),            /* CONNECTION SERVICES     0442 01832000
*                                          FREESTORE                 */ 01833000
*        3  CNSACCTA BIT(1),            /* ABOUT TO CALL           0442 01834000
*                                          ACCOUNTING EXIT           */ 01835000
*        3  CNSLOG0A BIT(1),            /* LOGON 0                   */ 01836000
*        3  CNSRSV01 BIT(1),            /* RESERVED                  */ 01837000
*     2  CNSTFLDB CHAR(3),              /* TRACE FIELD B -         0442 01838000
*                                          CURRENT ACTIVITY          */ 01839000
*        3  CNSMRINB BIT(1),                                       0442 01840000
*        3  CNSAUTHB BIT(1),                                       0442 01841000
*        3  CNSAQINB BIT(1),                                       0442 01842000
*        3  CNSXREQB BIT(1),                                       0442 01843000
*        3  CNSQREQB BIT(1),                                       0442 01844000
*        3  CNSRLINB BIT(1),                                       0442 01845000
*        3  CNSDORLB BIT(1),                                       0442 01846000
*        3  CNSTRRLB BIT(1),                                       0442 01847000
*        3  CNSRQRLB BIT(1),                                       0442 01848000
*        3  CNSPSINB BIT(1),                                       0442 01849000
*        3  CNSACINB BIT(1),                                       0442 01850000
*        3  CNSLGINB BIT(1),                                       0442 01851000
*        3  CNSGBINB BIT(1),                                       0442 01852000
*        3  CNSCLINB BIT(1),                                       0442 01853000
*        3  CNSCLAQB BIT(1),                                       0442 01854000
*        3  CNSTCONB BIT(1),                                       0442 01855000
*        3  CNSACONB BIT(1),                                       0442 01856000
*        3  CNSQUEUB BIT(1),                                       0442 01857000
*        3  CNSSEARB BIT(1),                                       0442 01858000
*        3  CNSGETSB BIT(1),                                       0442 01859000
*        3  CNSFREEB BIT(1),                                       0442 01860000
*        3  CNSACCTB BIT(1),                                       0442 01861000
*        3  CNSLOG0B BIT(1),                                       0442 01862000
*        3  CNSRSV05 BIT(1);                                       0442 01863000
*/*    CRR FOR VARY                                                  */ 01864000
*/*  REVISIONS                                         009 03/24/75  */ 01865000
*/*                                                                  */ 01866000
* DCL 1 ISTVYCRR BDY(WORD) BASED,       /* CRR FOR SSCP              */ 01867000
*     2  VYCCNS   CHAR(LENGTH(ISTCNSTA)), /* RESERVE SPACE FOR     0443 01868000
*                                          CONN. SVCS. AUDIT         */ 01869000
*     2  VYCAUDIT,                      /* AUDIT TRAIL FOR SSCP      */ 01870000
*        3  VYCNTRD CHAR(12),           /* LIST OF MODULES IN SSCP   */ 01871000
*                                       /* 1 = ENTERED               */ 01872000
*           4  NINCCL BIT(1),           /* MODULE = ISTINCCL         */ 01873000
*           4  NINCIO BIT(1),           /* MODULE = ISTINCIO         */ 01874000
*           4  NINCDL BIT(1),           /* MODULE = ISTINCDL         */ 01875000
*           4  NINCMY BIT(1),           /* MODULE = ISTINCMY         */ 01876000
*           4  NINCMD BIT(1),           /* MODULE = ISTINCMD         */ 01877000
*           4  NINCVI BIT(1),           /* MODULE = ISTINCVI         */ 01878000
*           4  NINCVA BIT(1),           /* MODULE = ISTINCVA         */ 01879000
*           4  NINCLF BIT(1),           /* MODULE = ISTINCLF         */ 01880000
*           4  NINCR1 BIT(1),           /* MODULE = ISTINCR1         */ 01881000
*           4  NINCSM BIT(1),           /* MODULE = ISTINCSM         */ 01882000
*           4  NINCFS BIT(1),           /* MODULE = ISTINCFS         */ 01883000
*           4  NINCVX BIT(1),           /* MODULE = ISTINCVX         */ 01884000
*           4  NINCVP BIT(1),           /* MODULE = ISTINCVP         */ 01885000
*           4  NINCVS BIT(1),           /* MODULE = ISTINCVS         */ 01886000
*           4  NINCVN BIT(1),           /* MODULE = ISTINCVO         */ 01887000
*           4  NINCMS BIT(1),           /* MODULE = ISTINCMS         */ 01888000
*           4  NINCR2 BIT(1),           /* MODULE = ISTINCR2         */ 01889000
*           4  NINCIP BIT(1),           /* MODULE = ISTINCIP         */ 01890000
*           4  NINCD1 BIT(1),           /* MODULE = ISTINCD1         */ 01891000
*           4  NINCD2 BIT(1),           /* MODULE = ISTINCD2         */ 01892000
*           4  NINCD3 BIT(1),           /* MODULE = ISTINCD3         */ 01893000
*           4  NINCD4 BIT(1),           /* MODULE = ISTINCD4         */ 01894000
*           4  NINCD5 BIT(1),           /* MODULE = ISTINCD5         */ 01895000
*           4  NINCD6 BIT(1),           /* MODULE = ISTINCD6         */ 01896000
*           4  NINCD7 BIT(1),           /* MODULE = ISTINCD7         */ 01897000
*           4  NINCD8 BIT(1),           /* MODULE = ISTINCD8         */ 01898000
*           4  NINCD9 BIT(1),           /* MODULE = ISTINCD9         */ 01899000
*           4  NINCE0 BIT(1),           /* MODULE = ISTINCE0         */ 01900000
*           4  NINCE2 BIT(1),           /* MODULE = ISTINCE2         */ 01901000
*           4  NINCE3 BIT(1),           /* MODULE = ISTINCE3         */ 01902000
*           4  NINCE4 BIT(1),           /* MODULE = ISTINCE4         */ 01903000
*           4  NINCFM BIT(1),           /* MODULE = ISTINCFM         */ 01904000
*           4  NINCF1 BIT(1),           /* MODULE = ISTINCF1         */ 01905000
*           4  NINCF3 BIT(1),           /* MODULE = ISTINCF3         */ 01906000
*           4  NINCF4 BIT(1),           /* MODULE = ISTINCF4         */ 01907000
*           4  NINCL0 BIT(1),           /* MODULE = ISTINCL0         */ 01908000
*           4  NINCL1 BIT(1),           /* MODULE = ISTINCL1         */ 01909000
*           4  NINCL2 BIT(1),           /* MODULE = ISTINCL2         */ 01910000
*           4  NINCL3 BIT(1),           /* MODULE = ISTINCL3         */ 01911000
*           4  NINCL4 BIT(1),           /* MODULE = ISTINCL4         */ 01912000
*           4  NINCL5 BIT(1),           /* MODULE = ISTINCL5         */ 01913000
*           4  NINCL6 BIT(1),           /* MODULE = ISTINCL6         */ 01914000
*           4  NINCL7 BIT(1),           /* MODULE = ISTINCL7         */ 01915000
*           4  NINCL8 BIT(1),           /* MODULE = ISTINCL8         */ 01916000
*           4  NINCS1 BIT(1),           /* MODULE = ISTINCS1         */ 01917000
*           4  NINCUM BIT(1),           /* MODULE = ISTINCUM         */ 01918000
*           4  NINCU0 BIT(1),           /* MODULE = ISTINCU0          * 01919000
*           4  NINCU1 BIT(1),           /* MODULE = ISTINCU1         */ 01920000
*           4  NINCU2 BIT(1),           /* MODULE = ISTINCU2         */ 01921000
*           4  NINCU3 BIT(1),           /* MODULE = ISTINCU3         */ 01922000
*           4  NINCU4 BIT(1),           /* MODULE = ISTINCU4         */ 01923000
*           4  NINCU5 BIT(1),           /* MODULE = ISTINCU5         */ 01924000
*           4  NINCU6 BIT(1),           /* MODULE = ISTINCU6         */ 01925000
*           4  NINCU7 BIT(1),           /* MODULE = ISTINCU7         */ 01926000
*           4  NINCU8 BIT(1),           /* MODULE = ISTINCU8         */ 01927000
*           4  NINCV2 BIT(1),           /* MODULE = ISTINCV2         */ 01928000
*           4  NINCV3 BIT(1),           /* MODULE = ISTINCV3         */ 01929000
*           4  NINCV4 BIT(1),           /* MODULE = ISTINCV4         */ 01930000
*           4  NINCV5 BIT(1),           /* MODULE = ISTINCV5         */ 01931000
*           4  NINCV6 BIT(1),           /* MODULE = ISTINCV6         */ 01932000
*           4  NINCV7 BIT(1),           /* MODULE = ISTINCV7         */ 01933000
*           4  NINCV8 BIT(1),           /* MODULE = ISTINCV8         */ 01934000
*           4  NINCV9 BIT(1),           /* MODULE = ISTINCV9         */ 01935000
*           4  NINCW0 BIT(1),           /* MODULE = ISTINCW0         */ 01936000
*           4  NINCW2 BIT(1),           /* MODULE = ISTINCW2         */ 01937000
*           4  NINCW4 BIT(1),           /* MODULE = ISTINCW4         */ 01938000
*           4  NINCW5 BIT(1),           /* MODULE = ISTINCW5         */ 01939000
*           4  NINCW6 BIT(1),           /* MODULE = ISTINCW6         */ 01940000
*           4  NINCW7 BIT(1),           /* MODULE = ISTINCW7         */ 01941000
*           4  NINCW8 BIT(1),           /* MODULE = ISTINCW8         */ 01942000
*           4  NINCW9 BIT(1),           /* MODULE = ISTINCW9         */ 01943000
*           4  NINCX0 BIT(1),           /* MODULE = ISTINCX0         */ 01944000
*           4  NINCX1 BIT(1),           /* MODULE = ISTINCX1         */ 01945000
*           4  NINCX2 BIT(1),           /* MODULE = ISTINCX2         */ 01946000
*           4  NINCX3 BIT(1),           /* MODULE = ISTINCX3         */ 01947000
*           4  NINCX6 BIT(1),           /* MODULE = ISTINCX6         */ 01948000
*           4  NINCX7 BIT(1),           /* MODULE = ISTINCX7         */ 01949000
*           4  NINCX8 BIT(1),           /* MODULE = ISTINCX8         */ 01950000
*           4  NINCX9 BIT(1),           /* MODULE = ISTINCX9         */ 01951000
*           4  NINCUA BIT(1),           /* MODULE = ISTINCUA         */ 01952000
*           4  NINCUB BIT(1),           /* MODULE = ISTINCUB         */ 01953000
*           4  NINCUQ BIT(1),           /* MODULE = ISTINCUQ         */ 01954000
*           4  NINCE1 BIT(1),           /* MODULE = ISTINCE1         */ 01955000
*           4  NINCE5 BIT(1),           /* MODULE = ISTINCE5         */ 01956000
*           4  NINCE6 BIT(1),           /* MODULE = ISTINCE6         */ 01957000
*           4  NINCE7 BIT(1),           /* MODULE = ISTINCE7         */ 01958000
*           4  NINCE8 BIT(1),           /* MODULE = ISTINCE8         */ 01959000
*           4  NINCR3 BIT(1),           /* MODULE = ISTINCR3         */ 01960000
*           4  NINCR5 BIT(1),           /* MODULE = ISTINCR5         */ 01961000
*           4  NINCVO BIT(1),           /* MODULE = ISTINCVO         */ 01962000
*           4  NINCE9 BIT(1),           /* MODULE = ISTINCE9         */ 01963000
*           4  NINCFE BIT(1),           /* MODULE = ISTINCFE         */ 01964000
*           4  VYCRSV01 BIT(4),         /* RESERVED                  */ 01965000
*        3  VYCCRT CHAR(12),            /* LIST OF SSCP MODULES      */ 01966000
*                                       /* 2 =  RUNNING              */ 01967000
*           4  CINCCL BIT(1),           /* MODULE = ISTINCCL         */ 01968000
*           4  CINCIO BIT(1),           /* MODULE = ISTINCIO         */ 01969000
*           4  CINCDL BIT(1),           /* MODULE = ISTINCDL         */ 01970000
*           4  CINCMY BIT(1),           /* MODULE = ISTINCMY         */ 01971000
*           4  CINCMD BIT(1),           /* MODULE = ISTINCMD         */ 01972000
*           4  CINCVI BIT(1),           /* MODULE = ISTINCVI         */ 01973000
*           4  CINCVA BIT(1),           /* MODULE = ISTINCVA         */ 01974000
*           4  CINCLF BIT(1),           /* MODULE = ISTINCLF         */ 01975000
*           4  CINCR1 BIT(1),           /* MODULE = ISTINCR1         */ 01976000
*           4  CINCSM BIT(1),           /* MODULE = ISTINCSM         */ 01977000
*           4  CINCFS BIT(1),           /* MODULE = ISTINCFS         */ 01978000
*           4  CINCVX BIT(1),           /* MODULE = ISTINCVX         */ 01979000
*           4  CINCVP BIT(1),           /* MODULE = ISTINCVP         */ 01980000
*           4  CINCVS BIT(1),           /* MODULE = ISTINCVS         */ 01981000
*           4  CINCVN BIT(1),           /* MODULE = ISTINCVO         */ 01982000
*           4  CINCMS BIT(1),           /* MODULE = ISTINCMS         */ 01983000
*           4  CINCR2 BIT(1),           /* MODULE = ISTINCR2         */ 01984000
*           4  CINCIP BIT(1),           /* MODULE = ISTINCIP         */ 01985000
*           4  CINCD1 BIT(1),           /* MODULE = ISTINCD1         */ 01986000
*           4  CINCD2 BIT(1),           /* MODULE = ISTINCD2         */ 01987000
*           4  CINCD3 BIT(1),           /* MODULE = ISTINCD3         */ 01988000
*           4  CINCD4 BIT(1),           /* MODULE = ISTINCD4         */ 01989000
*           4  CINCD5 BIT(1),           /* MODULE = ISTINCD5         */ 01990000
*           4  CINCD6 BIT(1),           /* MODULE = ISTINCD6         */ 01991000
*           4  CINCD7 BIT(1),           /* MODULE = ISTINCD7         */ 01992000
*           4  CINCD8 BIT(1),           /* MODULE = ISTINCD8         */ 01993000
*           4  CINCD9 BIT(1),           /* MODULE = ISTINCD9         */ 01994000
*           4  CINCE0 BIT(1),           /* MODULE = ISTINCE0         */ 01995000
*           4  CINCE2 BIT(1),           /* MODULE = ISTINCE2         */ 01996000
*           4  CINCE3 BIT(1),           /* MODULE = ISTINCE3         */ 01997000
*           4  CINCE4 BIT(1),           /* MODULE = ISTINCE4         */ 01998000
*           4  CINCFM BIT(1),           /* MODULE = ISTINCFM         */ 01999000
*           4  CINCF1 BIT(1),           /* MODULE = ISTINCF1         */ 02000000
*           4  CINCF3 BIT(1),           /* MODULE = ISTINCF3         */ 02001000
*           4  CINCF4 BIT(1),           /* MODULE = ISTINCF4         */ 02002000
*           4  CINCL0 BIT(1),           /* MODULE = ISTINCL0         */ 02003000
*           4  CINCL1 BIT(1),           /* MODULE = ISTINCL1         */ 02004000
*           4  CINCL2 BIT(1),           /* MODULE = ISTINCL2         */ 02005000
*           4  CINCL3 BIT(1),           /* MODULE = ISTINCL3         */ 02006000
*           4  CINCL4 BIT(1),           /* MODULE = ISTINCL4         */ 02007000
*           4  CINCL5 BIT(1),           /* MODULE = ISTINCL5         */ 02008000
*           4  CINCL6 BIT(1),           /* MODULE = ISTINCL6         */ 02009000
*           4  CINCL7 BIT(1),           /* MODULE = ISTINCL7         */ 02010000
*           4  CINCL8 BIT(1),           /* MODULE = ISTINCL8         */ 02011000
*           4  CINCS1 BIT(1),           /* MODULE = ISTINCS1         */ 02012000
*           4  CINCUM BIT(1),           /* MODULE = ISTINCUM         */ 02013000
*           4  CINCU0 BIT(1),           /* MODULE = ISTINCU0          * 02014000
*           4  CINCU1 BIT(1),           /* MODULE = ISTINCU1         */ 02015000
*           4  CINCU2 BIT(1),           /* MODULE = ISTINCU2         */ 02016000
*           4  CINCU3 BIT(1),           /* MODULE = ISTINCU3         */ 02017000
*           4  CINCU4 BIT(1),           /* MODULE = ISTINCU4         */ 02018000
*           4  CINCU5 BIT(1),           /* MODULE = ISTINCU5         */ 02019000
*           4  CINCU6 BIT(1),           /* MODULE = ISTINCU6         */ 02020000
*           4  CINCU7 BIT(1),           /* MODULE = ISTINCU7         */ 02021000
*           4  CINCU8 BIT(1),           /* MODULE = ISTINCU8         */ 02022000
*           4  CINCV2 BIT(1),           /* MODULE = ISTINCV2         */ 02023000
*           4  CINCV3 BIT(1),           /* MODULE = ISTINCV3         */ 02024000
*           4  CINCV4 BIT(1),           /* MODULE = ISTINCV4         */ 02025000
*           4  CINCV5 BIT(1),           /* MODULE = ISTINCV5         */ 02026000
*           4  CINCV6 BIT(1),           /* MODULE = ISTINCV6         */ 02027000
*           4  CINCV7 BIT(1),           /* MODULE = ISTINCV7         */ 02028000
*           4  CINCV8 BIT(1),           /* MODULE = ISTINCV8         */ 02029000
*           4  CINCV9 BIT(1),           /* MODULE = ISTINCV9         */ 02030000
*           4  CINCW0 BIT(1),           /* MODULE = ISTINCW0         */ 02031000
*           4  CINCW2 BIT(1),           /* MODULE = ISTINCW2         */ 02032000
*           4  CINCW4 BIT(1),           /* MODULE = ISTINCW4         */ 02033000
*           4  CINCW5 BIT(1),           /* MODULE = ISTINCW5         */ 02034000
*           4  CINCW6 BIT(1),           /* MODULE = ISTINCW6         */ 02035000
*           4  CINCW7 BIT(1),           /* MODULE = ISTINCW7         */ 02036000
*           4  CINCW8 BIT(1),           /* MODULE = ISTINCW8         */ 02037000
*           4  CINCW9 BIT(1),           /* MODULE = ISTINCW9         */ 02038000
*           4  CINCX0 BIT(1),           /* MODULE = ISTINCX0         */ 02039000
*           4  CINCX1 BIT(1),           /* MODULE = ISTINCX1         */ 02040000
*           4  CINCX2 BIT(1),           /* MODULE = ISTINCX2         */ 02041000
*           4  CINCX3 BIT(1),           /* MODULE = ISTINCX3         */ 02042000
*           4  CINCX6 BIT(1),           /* MODULE = ISTINCX6         */ 02043000
*           4  CINCX7 BIT(1),           /* MODULE = ISTINCX7         */ 02044000
*           4  CINCX8 BIT(1),           /* MODULE = ISTINCX8         */ 02045000
*           4  CINCX9 BIT(1),           /* MODULE = ISTINCX9         */ 02046000
*           4  CINCUA BIT(1),           /* MODULE = ISTINCUA         */ 02047000
*           4  CINCUB BIT(1),           /* MODULE = ISTINCUB         */ 02048000
*           4  CINCUQ BIT(1),           /* MODULE = ISTINCUQ         */ 02049000
*           4  CINCE1 BIT(1),           /* MODULE = ISTINCE1         */ 02050000
*           4  CINCE5 BIT(1),           /* MODULE = ISTINCE5         */ 02051000
*           4  CINCE6 BIT(1),           /* MODULE = ISTINCE6         */ 02052000
*           4  CINCE7 BIT(1),           /* MODULE = ISTINCE7         */ 02053000
*           4  CINCE8 BIT(1),           /* MODULE = ISTINCE8         */ 02054000
*           4  CINCR3 BIT(1),           /* MODULE = ISTINCR3         */ 02055000
*           4  CINCR5 BIT(1),           /* MODULE = ISTINCR5         */ 02056000
*           4  CINCVO BIT(1),           /* MODULE = ISTINCVO         */ 02057000
*           4  CINCE9 BIT(1),           /* MODULE = ISTINCE9         */ 02058000
*           4  CINCFE BIT(1),           /* MODULE = ISTINCFE         */ 02059000
*           4  VYCRSV03 BIT(4),         /* RESERVED                  */ 02060000
*     2  VYCRRSAV CHAR(72),             /* SAVE AREA USED BY ISTINCIP*/ 02061000
*                                       /* TO CALL ISTINCW3          */ 02062000
*     2  VYCRRCW3 CHAR(8),              /* PARAM LIST USED BY        */ 02063000
*                                       /* ISTINCIP TO CALL ISTINCW3 */ 02064000
*     2  VYCRSV04 CHAR(2),              /* RESERVED                  */ 02065000
*     2  VYCRSV02 PTR(31);              /* RESERVED                  */ 02066000
*DCL TIDINCDL BIT(8) CONSTANT('00'X);   /* THREAD ID FOR ISTINCDL    */ 02067000
*DCL TIDINCMY BIT(8) CONSTANT('01'X);   /* THREAD ID FOR ISTINCMY    */ 02068000
*DCL TIDINCCL BIT(8) CONSTANT('02'X);   /* THREAD ID FOR ISTINCCL    */ 02069000
*DCL TIDINCFE BIT(8) CONSTANT('04'X);   /* THREAD ID FOR ISTINCFE    */ 02070000
*/* LOCKWORD FORMAT DSECT                                            */ 02071000
*/*  INITIAL LEVEL                                     001 05/24/74  */ 02072000
*DCL 1 ISTLOK BDY(WORD) BASED,                                     0448 02073000
*     2  LOKCT CHAR(1) BDY(WORD),       /* COUNT OF LOCK OWNERS      */ 02074000
*     2  LOKCHN PTR(24),                /* ADDR OF NEXT RPH WAITING     02075000
*                                          ON LOCK                   */ 02076000
*        3  LOKCHNG CHAR(3),            /* CHAIN/FLAGS               */ 02077000
*           4 *        CHAR(2),                                    0448 02078000
*           4 *        BIT(8),                                     0448 02079000
*             5 *        BIT(6),                                   0448 02080000
*             5  LOKPRY BIT(1),         /* PRIORITY FLAG, 1 = ON     */ 02081000
*             5  LOKXCL BIT(1);         /* EXCLUSIVE FLAG, 1 = ON    */ 02082000
*DCL LOKXCL1  BIT(32) CONSTANT('00000001'X); /* CONSTANT TO TURN LOKXCL 02083000
*                                          ON                        */ 02084000
*DCL LOKPRY1  BIT(32) CONSTANT('00000002'X); /* CONSTANT TO TURN LOKPRY 02085000
*                                          ON                        */ 02086000
*DCL LOKCHN1  BIT(32) CONSTANT('00FFFFFC'X); /* CONSTANT TO TURN LOKXCL 02087000
*                                          AND LOKPRY OFF            */ 02088000
*DCL LOKCT1   BIT(32) CONSTANT('01000000'X); /* CONSTANT TO MAKE LOKCT  02089000
*                                          = 1                       */ 02090000
*DCL LOKCT255 BIT(32) CONSTANT('FF000000'X); /* CONSTANT TO CHECK FOR   02091000
*                                          MAX LOKCT (255)           */ 02092000
*/*   DEVICE CHARACTERISTICS TABLE - ORIGINATES IN RDT USED TO DEFINE   02093000
*    DEVICE CHARACTERISTICS IN DNCB,FMCB AND NIB  */               0454 02094000
*/*  INITIAL LEVEL                                     001 08/07/74  */ 02095000
*DCL  1  ISTDEVCH  BDY(WORD)BASED,                                 0454 02096000
*        2  DEVSHCH BIT(8),            /* DEV SCHED CHARACTERISTICS  */ 02097000
*           3  DEVCHAR  BIT(8),        /* COMPATIBILITY EXISTING CODE*/ 02098000
*              4  DEVINPUT  BIT(1),    /* DEVICE IS FOR INPUT        */ 02099000
*              4  DEVOTPUT  BIT(1),    /* DEVICE IS FOR OUTPUT       */ 02100000
*              4  DEVCONVR  BIT(1),    /* DEVICE IS CONVERSATION     */ 02101000
*                                      /* RN DEFINITION              */ 02102000
*              4  DEVSUBND  BIT(1),    /* DEVICE HAS SCHEDULABLE     */ 02103000
*                                      /*   SUB-NODES                */ 02104000
*              4  DEVSPS BIT(1),       /* DEV IS START PRINT SENSITIVE* 02105000
*              4  DEVNNSPT BIT(1),     /* NODE HAS NETWRK MNGMNT SPRT*/ 02106000
*              4  DEVCCTL BIT(1),      /* NODE HAS CONN CNTRL DEPENDCS* 02107000
*              4  DEVRSV01  BIT(1),    /* RESERVED                   */ 02108000
*        2  DEVTCODE BIT(8),           /* DEVICE TYPE CODES          */ 02109000
*           3  DEVCHAR2  BIT(8),       /* COMPATIBILITY EXISTING CODE*/ 02110000
*        2  DEVMCODE BIT(8),           /* DEVICE MODEL CODE           * 02111000
*        2  DEVFLAGS BIT(8),           /*USE DEPENDS ON DEVSHCH VALUES* 02112000
*           3  DEVFCCTL BIT(4),        /* USED IF DEVICE REQ CONN CTRL* 02113000
*              4  DEVCBSC BIT(1),      /* RESET ORDERLY, BI-SYNCH  0454 02114000
*                                         TERMINALS EXCEPT 3270'S    */ 02115000
*              4  DEVCSSL BIT(1),      /*RESET AT END OF COMMAND. 3270' 02116000
*                                         AND START/STOP EXCEPT TERMS   02117000
*                                         WITH REVERSE BREAK FEATURE */ 02118000
*                                                                  0454 02119000
*              4  DEVCRVB BIT(1),      /* RESET IMMEDIATE. START/STOP   02120000
*                                         TERMS WITH REVERSE BREAK 0454 02121000
*                                         FEATURE                    */ 02122000
*              4  DEVCSWL BIT(1),      /* 1=HIGHER NODE IS SWITCH CON-  02123000
*                                         NECTION, 0=LEASED CONNECTION* 02124000
*           3  DEVCHAR3 BIT(4),        /* COMPATIBILITY EXISTING CODE*/ 02125000
*              4  DEVCATTN BIT(1),     /* TERMINAL CAN INTERRUPT WITH   02126000
*                                         ATTENTION                  */ 02127000
*              4  DEVCCHEK BIT(1),     /* TERMINAL HAS CHECKING      */ 02128000
*              4  DEVCSTCL BIT(1),     /* TERMINAL HAS STATION     0454 02129000
*                                         CONTROL                    */ 02130000
*              4  DEVCSLPN BIT(1),     /* TERMINAL HAS SELECTOR PEN  */ 02131000
*        2  DEVPHYSA CHAR(1),          /* PHYSICAL DEVICE ADDRESS    */ 02132000
*        2  DEVRSV03 CHAR(3);          /* RESERVED                   */ 02133000
*/* DEVICE TYPE CODES */                                           0455 02134000
*DCL DEV2740 BIT(8) CONSTANT ('01'X);  /* DEVICE IS A 2740           */ 02135000
*DCL DEV2741 BIT(8) CONSTANT ('02'X);  /* DEVICE IS A 2741           */ 02136000
*DCL DEV1050 BIT(8) CONSTANT ('03'X);  /* DEVICE IS A 1050           */ 02137000
*DCL DEVTWX  BIT(8) CONSTANT ('04'X);  /* DEVICE IS A TWX            */ 02138000
*DCL DEVWTTY BIT(8) CONSTANT ('05'X);  /* DEVICE IS A WTTY           */ 02139000
*DCL DEV115A BIT(8) CONSTANT ('06'X);  /* DEVICE IS A 115A           */ 02140000
*DCL DEV83B3 BIT(8) CONSTANT ('07'X);  /* DEVICE IS AN 83B3          */ 02141000
*DCL DEV2715 BIT(8) CONSTANT ('08'X);  /* DEVICE IS A 2715           */ 02142000
*DCL DEV2770 BIT(8) CONSTANT ('09'X);  /* DEVICE IS A 2770           */ 02143000
*DCL DEV2780 BIT(8) CONSTANT ('0A'X);  /* DEVICE IS A 2780           */ 02144000
*DCL DEV3735 BIT(8) CONSTANT ('0B'X);  /* DEVICE IS A 3735           */ 02145000
*DCL DEV3780 BIT(8) CONSTANT ('0C'X);  /* DEVICE IS A 3780           */ 02146000
*DCL DEV1130 BIT(8) CONSTANT ('0D'X);  /* DEVICE IS AN 1130          */ 02147000
*DCL DEV1800 BIT(8) CONSTANT ('0E'X);  /* DEVICE IS AN 1800          */ 02148000
*DCL DEV3125 BIT(8) CONSTANT ('11'X);  /* DEVICE IS A 3125           */ 02149000
*DCL DEV3135 BIT(8) CONSTANT ('12'X);  /* DEVICE IS A 3135           */ 02150000
*DCL DEVSYS3 BIT(8) CONSTANT ('13'X);  /* DEVICE IS SYS 3            */ 02151000
*DCL DEV2701 BIT(8) CONSTANT ('14'X);  /* DEVICE IS A 2701 OZ05270   */ 02152000
*DCL DEV2703 BIT(8) CONSTANT ('15'X);  /* DEVICE IS A 2703 OZ05270   */ 02153000
*DCL DEV3704 BIT(8) CONSTANT ('16'X);  /* DEVICE IS A 3704           */ 02154000
*DCL DEV3705 BIT(8) CONSTANT ('17'X);  /* DEVICE IS A 3705           */ 02155000
*DCL DEV2980 BIT(8) CONSTANT ('18'X);  /* DEVICE IS A 2980           */ 02156000
*DCL DEV3277 BIT(8) CONSTANT ('19'X);  /* DEVICE IS A 3277           */ 02157000
*DCL DEV3284 BIT(8) CONSTANT ('1A'X);  /* DEVICE IS A 3284           */ 02158000
*DCL DEV3286 BIT(8) CONSTANT ('1B'X);  /* DEVICE IS A 3286           */ 02159000
*DCL DEV3275 BIT(8) CONSTANT ('1C'X);  /* DEVICE IS A 3275           */ 02160000
*DCL DEV3741 BIT(8) CONSTANT ('1D'X);  /* DEVICE IS A 3741           */ 02161000
*DCL DEV3747 BIT(8) CONSTANT ('1E'X);  /* DEVICE IS A 3747           */ 02162000
*DCL DEVMTA  BIT(8) CONSTANT ('28'X);  /* DEVICE IS AN MTA           */ 02163000
*DCL DEV2972 BIT(8) CONSTANT ('33'X);  /* DEVICE IS A 2972           */ 02164000
*DCL DEV3271 BIT(8) CONSTANT ('34'X);  /* DEVICE IS A 3271           */ 02165000
*DCL DEV3272 BIT(8) CONSTANT ('36'X);  /* DEVICE IS A 3272           */ 02166000
*DCL DEVCC   BIT(8) CONSTANT ('35'X);  /* DEVICE IS A PHYSICAL UNIT  */ 02167000
*DCL DEV1052 BIT(8) CONSTANT ('64'X);  /* DEVICE IS A 1052           */ 02168000
*DCL DEV1053 BIT(8) CONSTANT ('65'X);  /* DEVICE IS A 1053           */ 02169000
*DCL DEV1054 BIT(8) CONSTANT ('66'X);  /* DEVICE IS A 1054           */ 02170000
*DCL DEV1055 BIT(8) CONSTANT ('67'X);  /* DEVICE IS A 1055           */ 02171000
*DCL DEV1056 BIT(8) CONSTANT ('68'X);  /* DEVICE IS A 1056           */ 02172000
*DCL DEV1057 BIT(8) CONSTANT ('69'X);  /* DEVICE IS A 1057           */ 02173000
*DCL DEV1058 BIT(8) CONSTANT ('6A'X);  /* DEVICE IS A 1058           */ 02174000
*DCL DEV1092 BIT(8) CONSTANT ('6B'X);  /* DEVICE IS A 1092           */ 02175000
*DCL DEV1093 BIT(8) CONSTANT ('6C'X);  /* DEVICE IS A 1093           */ 02176000
*DCL DEVLU   BIT(8) CONSTANT ('6D'X);  /* DEVICE IS A LOGICAL UNIT   */ 02177000
*DCL DEV545  BIT(8) CONSTANT ('78'X);  /* DEVICE IS A 545            */ 02178000
*DCL DEV1017 BIT(8) CONSTANT ('79'X);  /* DEVICE IS A 1017           */ 02179000
*DCL DEV1018 BIT(8) CONSTANT ('7A'X);  /* DEVICE IS A 1018           */ 02180000
*DCL DEV2203 BIT(8) CONSTANT ('7B'X);  /* DEVICE IS A 2203           */ 02181000
*DCL DEV2213 BIT(8) CONSTANT ('7C'X);  /* DEVICE IS A 2213           */ 02182000
*DCL DEV2265 BIT(8) CONSTANT ('7D'X);  /* DEVICE IS A 2265           */ 02183000
*DCL DEV2502 BIT(8) CONSTANT ('7E'X);  /* DEVICE IS A 2502           */ 02184000
*DCL DEV50   BIT(8) CONSTANT ('7F'X);  /* DEVICE IS A 50             */ 02185000
*DCL DEV1255 BIT(8) CONSTANT ('80'X);  /* DEVICE IS A 1255           */ 02186000
*DCL DEV5496 BIT(8) CONSTANT ('81'X);  /* DEVICE IS A 5496           */ 02187000
*/* MODEL CODES */                                                 0508 02188000
*DCL DEVMOD1 BIT(8) CONSTANT ('00'X);  /* MODEL 1                    */ 02189000
*DCL DEVMOD2 BIT(8) CONSTANT ('01'X);  /* MODEL 2                    */ 02190000
*/*              RESOURCE DEFINITION TABLE                           */ 02191000
*/*  REVISIONS                                         013 07/01/75  */ 02192000
*DCL                                                               0510 02193000
*1  ISTRPRE BDY(WORD) BASED,     /* COMMON PREFIX                    */ 02194000
*   2  RPRNAME  CHAR(8),         /* RESOURCE NAME                    */ 02195000
*   2  RPRCOMID FIXED(31),       /* COMMUNICATION ID                 */ 02196000
*      3  RPRSAF BIT(16),        /* SOURCE ADDRESS FIELD             */ 02197000
*      3  RPRDAF BIT(16),        /* DESTINATION ADDRESS FIELD-       */ 02198000
*                             /* CONTAINS DAF OF CTERM IN PORT ENTRY */ 02199000
*   2  RPRRLOCK CHAR(LENGTH(ISTLOK)),  /* RESOURCE LOCK              */ 02200000
*   2  RPRELEN  FIXED(15),       /* CURRENT ENTRY LENGTH             */ 02201000
*   2  RPRPELEN FIXED(15),       /* PREVIOUS ENTRY LENGTH            */ 02202000
*   2  RPRENTRY BIT(8),          /* FLAG FIELD 1 (ENTRY TYPE)        */ 02203000
*   2  RPRFLAGA BIT(8),                                            0510 02204000
*      3  RPRACT BIT(1),         /* ACTIVE                           */ 02205000
*      3  RPRINV BIT(1),         /* INVALID                          */ 02206000
*      3  RPRTIED BIT(1),        /* TIED                             */ 02207000
*      3  RPRENTBF BIT(1),       /* BUFFER TRACE THIS NODE           */ 02208000
*      3  RPRENTIO BIT(1),       /* RESERVED                         */ 02209000
*      3  RPRENTED BIT(1),       /* LAST ENTRY IN RDT SEGMENT        */ 02210000
*      3  RPRVRYPD BIT(1),       /* VARY PENDING ON ENTRY            */ 02211000
*      3  RPRLIVE  BIT(1),       /* RESOURCE IS LIVE                 */ 02212000
*   2  RPRFLAGB BIT(8),          /* FLAG FIELD                       */ 02213000
*      3  RPRENTVH BIT(1),       /* WHEN 1, ENTRY IS A VTAM HEADER   */ 02214000
*      3  RPRENTVT BIT(1),       /* WHEN 1, ENTRY IS VTAM            */ 02215000
*      3  RPRAOPN BIT(1),        /* NODE OPENABLE BY APPLICATION     */ 02216000
*      3  RPRVIODN BIT(1),       /* VARY I/O HAS BEEN DONE           */ 02217000
*      3  RPRONLIN BIT(1),       /* NODE VARIED ONLINE               */ 02218000
*      3  RPRHLVPD BIT(1),       /* VARY PENDING IN HIGHEST        0510 02219000
*                                   LEVEL NODE                       */ 02220000
*      3  RPRVYIMM BIT(1),       /* VARY IMMEDAITE ISSUED FOR NODE   */ 02221000
*      3  RPRINTST BIT(1),       /* DEVICE IN TEST MODE              */ 02222000
*   2  RPRCAUSE BIT(8),          /* FLAGS INDICATING CAUSE OF ENTRY     02223000
*                                                      INVALIDATION  */ 02224000
*      3  RPRNOSRT BIT(1),       /* RPRINV SET BECAUSE NO SRTE BUILT */ 02225000
*      3  RPRCRCPT BIT(1),       /* C/R CHECKPOINT ACTIVE 1=ACTIVE   */ 02226000
*      3  RPRRSYNC BIT(1),       /* C/R RE-SYNC ON FIRST I/O         */ 02227000
*                                /* REQUIRED: 1=YES                  */ 02228000
*      3  RPRRSV03 BIT(5),       /* RESERVED                         */ 02229000
*   2  RPRPEPCT FIXED(15),       /* VARY PENDING COUNTER             */ 02230000
*   2  RPRTIOCT FIXED(8),        /* I/O TRACE COUNT                  */ 02231000
*   2  RPRHDTYP BIT(8),          /* HEADER TYPE                      */ 02232000
*   2  RPRLGONF PTR(31),         /* SIM. LOGON CHAIN FORWARD PTR     */ 02233000
*   2  RPRLGONB PTR(31),         /* SIM. LOGON CHAIN BACKWARD PTR    */ 02234000
*   2  RPRNSNEA PTR(31),         /* NEXT SCHEDULABLE NODE ENTRY ADDR */ 02235000
*   2  RPRNCBA PTR(31),          /* ADDR OF ASSOCIATED NCB FOR     0510 02236000
*                                    OPENED NODES                    */ 02237000
*   2  RPRDEVCH CHAR(LENGTH(ISTDEVCH)),  /* DEVICE CHARACTERISTICS   */ 02238000
*   2  RPRRVPT1 PTR(31),         /* RESERVED                         */ 02239000
*   2  RPRSTPCT FIXED(15),       /* COUNT OF SHOULDER TAPS           */ 02240000
*   2  RPRSWDAF BIT(16),         /* SWITCHED DAF                     */ 02241000
*   2  RPRPTHCT FIXED(8),        /* COUNT OF AVAILABLE PATHS       0510 02242000
*                                   TO THIS DEVICE                   */ 02243000
*   2  RPRFLAGD CHAR(1),         /* FLAG BYTE                        */ 02244000
*      3 RPRLTASN BIT(1),        /* LINE TRACE ACTIVE = 1            */ 02245000
*      3 RPRCONCT BIT(1),        /* PHYSICAL CONNECTION EXISTS       */ 02246000
*      3 RPRRSON  BIT(1),        /* RESET ONLINE                     */ 02247000
*      3 RPRACTP  BIT(1),        /* ACTIVATE IN PROGRESS             */ 02248000
*      3 RPRCONP  BIT(1),        /* CONTACT IN PROGRESS              */ 02249000
*      3 RPRRSV05 BIT(2),        /* RESERVED                         */ 02250000
*      3 RPRINIMM BIT(1),        /* ON=INACTIVATE IMMED. IN PROGRESS */ 02251000
*   2  RPRFLAGC BIT(8),          /* FLAG FIELD                       */ 02252000
*      3  RPRCLVPD BIT(1),       /* THIS ENTRY HAS BEEN CLOSED       */ 02253000
*   2  RPRCONID CHAR(9);         /* CONTROL BLOCK ID                 */ 02254000
*                                                                  0510 02255000
*                                                                  0510 02256000
*/* RPRENTRY - FOLLOWING EQUATES ARE FOR THE VARIOUS ENTRY TYPES     */ 02257000
*DCL RPRENTCM BIT(8) CONSTANT('90'X);  /* ENTRY IS A COMPONENT       */ 02258000
*DCL RPRENTIN BIT(8) CONSTANT('82'X);  /* ENTRY IS INTERMEDIATE NODE */ 02259000
*DCL RPRENTTR BIT(8) CONSTANT('80'X);  /* ENTRY IS A TERMINAL        */ 02260000
*DCL RPRENTUT BIT(8) CONSTANT('75'X);  /* ENTRY IS UTERM             */ 02261000
*DCL RPRENTCL BIT(8) CONSTANT('70'X);  /* ENTRY IS A CLUSTER         */ 02262000
*DCL RPRENTLN BIT(8) CONSTANT('50'X);  /* ENTRY IS A LINE            */ 02263000
*DCL RPRENTLH BIT(8) CONSTANT('03'X);  /* ENTRY IS A LOCAL HEADER    */ 02264000
*DCL RPRENTGP BIT(8) CONSTANT('30'X);  /* ENTRY IS A GROUP           */ 02265000
*DCL RPRENTLC BIT(8) CONSTANT('45'X);  /* ENTRY IS A LOCAL DEVICE    */ 02266000
*DCL RPRENTAH BIT(8) CONSTANT('02'X);  /* ENTRY IS APPLICATION HEADER*/ 02267000
*DCL RPRENTAP BIT(8) CONSTANT('55'X);  /* ENTRY IS APPLICATION       */ 02268000
*DCL RPRENTDS BIT(8) CONSTANT('20'X);  /* ENTRY IS LCDO            0522 02269000
*                                         (DIALSET)                  */ 02270000
*DCL RPRENTRN BIT(8) CONSTANT('01'X);  /* ENTRY IS THE RN            */ 02271000
*DCL RPRENTCC BIT(8) CONSTANT('71'X);  /* ENTRY IS A PU              */ 02272000
*DCL RPRENTLU BIT(8) CONSTANT('81'X);  /* ENTRY IS LOGICAL UNIT      */ 02273000
*DCL RPRENTSW BIT(8) CONSTANT('04'X);  /* ENTRY IS SWITCHED          */ 02274000
*                                      /* SUBAREA HEADER             */ 02275000
*DCL RPRENTLS BIT(8) CONSTANT('05'X);  /* ENTRY IS LOCAL             */ 02276000
*                                      /* SUBAREA HEADER             */ 02277000
*DCL RPRENTPX BIT(8) CONSTANT('72'X);  /* ENTRY IS A PUX             */ 02278000
*DCL RPRENTLX BIT(8) CONSTANT('10'X);  /* ENTRY IS A LUX             */ 02279000
*DCL RPRENTDA BIT(8) CONSTANT('51'X);  /* ENTRY IS A DAN             */ 02280000
*                                                                  0530 02281000
*                                                                  0530 02282000
*/* THE FOLLOWING IS A PREFIX FOR ALOCATION ENTRIES                  */ 02283000
*/*   ISTRCL-CLUSTER,ISTRTR-TERMINAL,ISTRCM-COMPONENT                */ 02284000
*                                                                  0531 02285000
*DCL                                                               0531 02286000
*1  ISTRCPRE BDY(WORD) BASED,    /* LEVEL 1 DECLARE                  */ 02287000
*   2  RCPPRE  CHAR(LENGTH(ISTRPRE)),      /* COMMON PREFIX          */ 02288000
*   2  RCPICELN PTR(31),         /* PTR LOGON ICE QUEUE              */ 02289000
*   2  RCPLNAPA PTR(31),         /* PTR APLICATION ENTRY FOR SIMLOGON*/ 02290000
*   2  RCPICEAQ PTR(31),         /* PTR ACQUIRE ICE QUEUE            */ 02291000
*   2  RCPACETR PTR(31),         /* PTR ACE QUEUE                    */ 02292000
*   2  RCPBHSI1 CHAR(1),         /* GEN'D BHSET ID                   */ 02293000
*   2  RCPBHSI2 CHAR(1),         /* OVERRIDING BHSET ID SPECIFIED  0531 02294000
*                                   BY USER                          */ 02295000
*   2  RCPBFLIM PTR(8),          /* BUFFER LIMIT                     */ 02296000
*   2  RCPPMODE CHAR(1),         /* PERMISSABLE MODES                */ 02297000
*      3 RCPRBASC BIT(1),        /* 1= BASIC OK                      */ 02298000
*      3 RCPRRECD BIT(1),        /* 1= RECORD OK                     */ 02299000
*      3 *        BIT(6),        /* RESERVED                         */ 02300000
*   2  RCPLGNIN CHAR(20) BDY(WORD), /* INIT LOGON DATA               */ 02301000
*      3 RCPLGNAP CHAR(8),       /* APPL FOR VTAM SIMLOGON           */ 02302000
*      3 RCPLGNCT CHAR(8),       /* NAME OF LOGON CHAR TABLE         */ 02303000
*      3 RCPINTA  PTR(31),       /* ADDR OF INTERPRET TABLE          */ 02304000
*   2  RCPRSV03 PTR(31),         /* RESERVED FOR C/R                 */ 02305000
*   2  RCPRSV04 PTR(31),         /* RESERVED FOR C/R                 */ 02306000
*   2  RCPRSV05 PTR(31);         /* RESERVED FOR C/R                 */ 02307000
*                                                                  0531 02308000
*                                                                  0531 02309000
*DCL                                                               0532 02310000
*1  ISTRDT BDY(WORD) BASED,      /* LEVEL 1 DECLARE                  */ 02311000
*   2  RDTPRE CHAR(LENGTH(ISTRPRE)), /* ENTRY PREFIX                 */ 02312000
*   2  RDTPLEN CHAR(4)BDY(WORD), /* PRIORITY AND LENGTH FIELD        */ 02313000
*      3  RDTPRIOR,              /* DETERMINES SEGMENT TYPE          */ 02314000
*         4  * BIT(3),           /*    NOT USED                      */ 02315000
*         4  RDTPRIAP BIT(1),    /*    APPLICATION SEGMENT           */ 02316000
*         4  RDTPRILC BIT(1),    /*    LOCAL SEGMENT                 */ 02317000
*         4  RDTPRIRN BIT(1),    /*    RN SEGMENT                    */ 02318000
*         4  RDTPRISW BIT(1),    /*    SWITCHED SEGMENT              */ 02319000
*         4  RDTPRILS BIT(1),    /*    LOCAL SUBAREA SEGMENT         */ 02320000
*      3  RDTLEN FIXED(24),      /* LENGTH OF RDT                    */ 02321000
*   2  RDTFORW PTR(31),          /* FOREWARD POINTER                 */ 02322000
*   2  RDTBACK PTR(31),          /* BACKWARD POINTER                 */ 02323000
*   2  RDTFLAGS BIT(16),         /* SEGMENT FLAGS,UNUSED/REUSED      */ 02324000
*   2  RDTCTSNT FIXED(15),       /* COUNT OF SNT ENTRIES FOR       0532 02325000
*                                   SEGMENT                          */ 02326000
*   2  RDTMAXID PTR(8),          /* MAXIMUM NODE ID FOR            0532 02327000
*                                   NETWORK                          */ 02328000
*   2  RDTNODID PTR(8),          /* NODE ID FOR THIS SEGMENT         */ 02329000
*   2  RDTLGCT  PTR(8),          /* COUNT OF LOGONS OUTSTANDING      */ 02330000
*   2  RDTFLAGB BIT(8),          /* FLAG BYTE                        */ 02331000
*      3 RDTOUERP BIT(1),        /* 1 = REPEAT ERP                   */ 02332000
*      3 RDTPRGDN BIT(1),        /* 1 = PURGE ISSUED                 */ 02333000
*      3 RDTCTPGD BIT(1),        /* 1 = CONTACT PURGED               */ 02334000
*      3 RDTCTCFL BIT(1),        /* HIGHER FAILURE-CONTACT FLUSHED   */ 02335000
*      3 RDTBHSET BIT(1),        /* BHSET REQUIRED                   */ 02336000
*      3 RDTRSV01 BIT(3),        /* RESERVED                         */ 02337000
*   2  RDTVPAB  PTR(31),         /* ADDR OF VARY PAB                 */ 02338000
*   2  RDTEPAB  PTR(31),         /* ADDR OF ERP PAB                  */ 02339000
*   2  RDTDPAB  PTR(31),         /* ADDR OF DUMP/LOAD/RESTART PAB    */ 02340000
*   2  RDTTPAB  PTR(31),         /* TOLTEP SSCP PAB                  */ 02341000
*   2  RDTVYRPH PTR(31),         /* @ OF VARY RPH WAITING            */ 02342000
*                                /* FOR RESTART COMPLETION           */ 02343000
*      3 RRNVYRPH PTR(31),       /* DELETE ALIAS IN NEXT             */ 02344000
*                                /* FIRST SNA/2 BUILD                */ 02345000
*   2  RDTSTCNT PTR(8),          /* ACTIVE SUBNODE COUNT             */ 02346000
*      3 RRNSTCNT PTR(8),        /* DELETE ALIAS IN NEXT             */ 02347000
*                                /* FIRST SNA/2 BUILD                */ 02348000
*   2  *        CHAR(3),         /* RESERVED                         */ 02349000
*   2  RDTCRSDS CHAR(8),         /* C/R DATA SET IDENTIFIER          */ 02350000
*                                /* BLANK IMPLIES NOT SPECIFIED      */ 02351000
*   2  RDTCRSPW CHAR(8),         /* C/R DATASET PASSWORD             */ 02352000
*                                /* BLANK IMPLIES NOT SPECIFIED      */ 02353000
*   2  RDTVSRPL PTR(31);         /* C/R PTR TO VSAM RPL              */ 02354000
*                                                                  0532 02355000
*                                                                  0532 02356000
*DCL                                                               0533 02357000
*1  ISTRAP BDY(WORD) BASED,      /* APPLICATION ENTRY                */ 02358000
*   2  RAPPRE CHAR(LENGTH(ISTRPRE)), /*  USE ISTRPRE DSECT           */ 02359000
*   2  RAPACBA PTR(31),          /*   POINTER TO ACB                 */ 02360000
*   2  RAPACDEB PTR(31),         /*  POINTER TO ACBDEB               */ 02361000
*   2  RAPAPPWD CHAR(8),         /* APPLICATION PASSWORD             */ 02362000
*   2  RAPICELG PTR(31),         /* ANCHOR FOR LOGON ICE TO APLICATION* 02363000
*   2  RAPICEAC PTR(31),         /* ANCHOR ACEPT ICE FOR APPLICATION */ 02364000
*   2  RAPICEAQ PTR(31),         /*  ANCHOR ACQUIRE ICE BY APPLI     */ 02365000
*   2  RAPACEAP PTR(31),         /* ANCHOR FOR APPLICATION ACES      */ 02366000
*   2  RAPTRPRE FIXED(15),       /* COUNT OF PREMPTED TERMINALS      */ 02367000
*   2  RAPACEQD FIXED(15),       /* COUNT OF ACES QUEUED             */ 02368000
*   2  RAPFLG BIT(8),            /*  FLAG FIELD                      */ 02369000
*      3 RAPABLGN BIT(1),        /*  PERMANENTLY BLOCK LOGONS BIT    */ 02370000
*      3 RAPAQUI BIT(1),         /* QUIESCE IN PROCESS               */ 02371000
*      3 RAPASLGI BIT(1),        /*  APPLICATION FIRST TIME LOGON  0533 02372000
*                                    ISSUED FLAG                     */ 02373000
*      3 RAPATLGN BIT(1),        /*  TEMPORARILY BLOCK LOGONS BIT    */ 02374000
*      3 RAPRSV03 BIT(1),        /*  RESERVED                        */ 02375000
*      3 RAPRSV04 BIT(1),        /*  RESERVED                        */ 02376000
*      3 RAPRSV05 BIT(1),        /*  RESERVED                        */ 02377000
*      3 RAPRSV06 BIT(1),        /*  RESERVED                        */ 02378000
*   2  RAPFLGB BIT(8),           /* AUTHORIZATION FLAGS              */ 02379000
*      3 RAPALLF BIT(1),         /* ALL FUNCTIONS AUTH.              */ 02380000
*      3 RAPABLCK BIT(1),        /* BLOCK I/O AUTH.                  */ 02381000
*      3 RAPAPASS BIT(1),        /* PASS AUTH.                       */ 02382000
*      3 RAPAPRMT BIT(1),        /* PREEMPT AUTH.                    */ 02383000
*      3 RAPAACQ BIT(1),         /* ACQUIRE AUTH.                    */ 02384000
*      3 RAPAPPO  BIT(1),        /* RNO PPO (PRIMARY PROGRAM AUTH    */ 02385000
*      3 RAPASPO  BIT(1),        /* RNO SPO (SECONDARY PROGRAM AUTH  */ 02386000
*      3 RAPRSV09 BIT(1),        /* RESERVED                         */ 02387000
*   2  RAPFLGC BIT(8),           /* AUTHORIZATION FLAGS RESERVED     */ 02388000
*      3 RAPRSV10 BIT(1),        /*  RESERVED                        */ 02389000
*      3 RAPRSV11 BIT(1),        /*  RESERVED                        */ 02390000
*      3 RAPRSV12 BIT(1),        /*  RESERVED                        */ 02391000
*      3 RAPRSV13 BIT(1),        /*  RESERVED                        */ 02392000
*      3 RAPRSV14 BIT(1),        /*  RESERVED                        */ 02393000
*      3 RAPRSV15 BIT(1),        /*  RESERVED                        */ 02394000
*      3 RAPRSV16 BIT(1),        /*  RESERVED                        */ 02395000
*      3 RAPRSV17 BIT(1),        /*  RESERVED                        */ 02396000
*   2  RAPBFACT PTR(8),          /* BUFFER LIMIT FACTOR              */ 02397000
*   2  RAPRVPT1 PTR(31),         /*  RESERVED                        */ 02398000
*   2  RAPRVPT2 PTR(31);         /*  RESERVED                        */ 02399000
*                                                                  0533 02400000
*                                                                  0533 02401000
*DCL                                                               0534 02402000
*1  ISTRLC BDY(WORD) BASED,      /* LOCAL ENTRY                      */ 02403000
*   2  RLCPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX               */ 02404000
*   2  RLCADR PTR(31),                                             0534 02405000
*      3  RLCFLAG BIT(8),        /* FLAG BYTE                        */ 02406000
*         4  RLCRSV22 BIT(1),    /* RESERVED                         */ 02407000
*         4  RLCRBISA BIT(1),    /* INITIAL STATUS - 1 = ACTIVE      */ 02408000
*         4  RLCRSV14 BIT(3),    /* UNUSED/RESERVED                  */ 02409000
*         4  RLCACNT BIT(1),     /* MESSAGE BLOCK ACCEPTED           */ 02410000
*         4  RLCRSVDE BIT(2),    /* RESERVED                         */ 02411000
*      3  RLCUCBAD PTR(24),      /* UCB /PUB ADDRESS                 */ 02412000
*   2 RLCLCCUA CHAR(3),          /* DEVICE CHANNEL UNIT ADDR         */ 02413000
*   2 RLCRVPT1 CHAR(1),          /* RESERVED                         */ 02414000
*   2 RLCRVPT2 PTR(31);          /* RESERVED                         */ 02415000
*                                                                  0534 02416000
*                                                                  0534 02417000
*DCL                                                               0535 02418000
*1  ISTRRN BDY(WORD) BASED,      /* RN ENTRY                         */ 02419000
*   2  RRNPRE CHAR(LENGTH(ISTRDT)),  /*  USE ISTRDT DSECT            */ 02420000
*   2  RRNADR PTR(31),                                             0535 02421000
*      3  RRNFLAG BIT(8),                                          0535 02422000
*         4  RRNRSV89 BIT(1),    /* RESERVED                         */ 02423000
*         4  RRNRBISA BIT(1),    /* INITIAL STATUS 1 = ACTIVE        */ 02424000
*         4  RRNLCSIP BIT(1),    /* NODE BEING ACTIVATED             */ 02425000
*         4  RRNLCDIE BIT(1),    /* HIGHER NODE NOT SUCCESFULLY      */ 02426000
*                                /*             ACTIVATED            */ 02427000
*         4  RRNLCDIP BIT(1),    /* NODE BEING DEACTIVATED           */ 02428000
*         4  RRNERPIP BIT(1),    /* ERP IN PROCESS                   */ 02429000
*         4  RRNDSTCT BIT(1),    /* DEACT TO DECREMENT STCNT         */ 02430000
*         4  RRNRSV11 BIT(1),    /* UNUSED/RESERVED                  */ 02431000
*      3  RRNUCBAD PTR(24),      /* UCB/PUB ADDR                     */ 02432000
*         4 RRNCHQI  BIT(8),     /* CHANNEL QUEUE INDEX              */ 02433000
*         4 RRNLUBA  PTR(16),    /* DESCRIBE ENTRY IN PUB            */ 02434000
*                                /* OWNERSHIP TABLE                  */ 02435000
*   2  RRNGRPA PTR(31),          /* POINTER TO FIRST GROUP ENTRY     */ 02436000
*   2  RRNRNCUA CHAR(3),         /* CHANNEL UNIT ADDR                */ 02437000
*   2  RRNRLDIP FIXED(8),        /* REMOTE LOAD/DUMP IN PROG. COUNT  */ 02438000
*   2  RRNTRENT PTR(31),         /* ADDR TERM ENTRY IN LOCAL         */ 02439000
*   2  RRNBHSET PTR(31),         /* POINTER TO TABLE OF BHSET NAMES  */ 02440000
*   2  RRNCTBHS FIXED(15),       /* COUNT OF BHSET NAMES IN RRNBHSET */ 02441000
*   2  RRNCTEGP FIXED(15),       /* COUNT OF GROUP ENTRIES FOR RN    */ 02442000
*   2  RRNCTELI FIXED(15),       /* COUNT OF LINE ENTRIES FOR RN     */ 02443000
*   2  RRNCTECL FIXED(15),       /* COUNT OF CLUSTER ENTRIES FOR RN  */ 02444000
*   2  RRNCTETR FIXED(15),       /* COUNT OF TERMINAL ENTRIES FOR RN */ 02445000
*   2  RRNCTEIN FIXED(15),       /* COUNT OF INT. NODE ENTRIES FOR RN*/ 02446000
*   2  RRNCTECM FIXED(15),       /* CNT OF COMPONENT ENTRIES FOR RN  */ 02447000
*   2  RRNCTENT FIXED(15),       /* # ALL ENTRIES IN 370X RDT SEGMENT*/ 02448000
*   2  RRNRDF CHAR(4),           /*  RESOURCE DEFINITION FLAG        */ 02449000
*      3  RRNRDFA  BIT(8),       /* FLAGS (WORD 1 BYTE 1)            */ 02450000
*         4  RRNRASHT BIT(1),    /* AUTO NETWORK SHUTDOWN            */ 02451000
*         4  RRNRAIPL BIT(1),    /* AUTO IPL ON RN FAILURE           */ 02452000
*         4  RRNRADMP BIT(1),    /* AUTO DUMP ON RN FAILURE          */ 02453000
*         4  RRNRASYN BIT(1),    /* C/R AUTOMATICALLY RESYNCHRONIZED */ 02454000
*                                /* IF ALREADY LOADED NCP            */ 02455000
*                                /* 0=NO, 1=YES                      */ 02456000
*         4  RRNRAOLT BIT(1),    /* ON-LINE TERMINAL TEST            */ 02457000
*         4  RRNRBREM  BIT(1),   /* REMOTE RN FLAG                   */ 02458000
*         4  RRNRANCP BIT(1),    /* GENERATION TYPE NCP              */ 02459000
*         4  RRNRAPEP BIT(1),    /* GENERATION TYPE PEP              */ 02460000
*      3  RRNRDFB BIT(16),       /* FLAG FIELD B (RDF)               */ 02461000
*         4  RRNRBMDL BIT(1),    /* (=1 IF 3705) ELSE 3704           */ 02462000
*         4  RRNRSV02 BIT(1),    /* RESERVED                         */ 02463000
*         4  RRNRBCCL BIT(1),    /* LOOSELY COUPLED CHANNEL          */ 02464000
*         4  RRNRBCCT BIT(1),    /* TIGHTLY COUPLED CHANNEL          */ 02465000
*         4  RRNRBSEC BIT(1),    /* SECONDARY CHANNEL EXIST          */ 02466000
*         4  RRNRBCT1 BIT(1),    /* PRIM CHAN TYPE (0=TYPE1,1=TYPE2) */ 02467000
*         4  RRNRBCT2 BIT(1),    /* SEC CHAN TYPE (0=TYPE1,1=TYPE2)  */ 02468000
*         4  RRNRSV03 BIT(1),    /* RESERVED                         */ 02469000
*         4  RRNRBBUP BIT(1),    /* BRINGUP IS TO BE EXERCISED     0535 02470000
*                                         FOR THIS RN DURING IPL     */ 02471000
*         4  RRNVYDON BIT(1),    /* RDT SEG IS BEING FREED           */ 02472000
*         4  RRNRSV01 BIT(5),    /* RESERVED                         */ 02473000
*         4  RRNPTASL BIT(1),    /* SOME PORT SOLICITOR IS WAITING 0535 02474000
*                                   TO BE REDRIVEN BY CLSDST         */ 02475000
*      3  RRNRSV55 CHAR(1),      /*  RESERVED                        */ 02476000
*   2  RRNCMF CHAR(4),           /*  FLAG FIELDS FOR COMMANDS        */ 02477000
*      3  RRNCMFA  BIT(8),       /* FLAG FIELD A -COMMANDS           */ 02478000
*         4  RRNCAALL BIT(1),    /* PHYSICAL DISCONNECT              */ 02479000
*         4  RRNCAATD BIT(1),    /* ACTIVATE DEVICE                  */ 02480000
*         4  RRNCAATG BIT(1),    /* ACTIVATE GROUP                   */ 02481000
*         4  RRNCAATI BIT(1),    /* ACTIVATE INVITES                 */ 02482000
*         4  RRNCAMBH BIT(1),    /* MODIFY BLOCK HANDLER SET         */ 02483000
*         4  RRNCACDT BIT(1),    /* CHANGE DATE AND TIME             */ 02484000
*         4  RRNCADTD BIT(1),    /* DEACTIVATE DEVICE                */ 02485000
*         4  RRNCADGO BIT(1),    /* DEACTIVATE GROUP ORDERLY         */ 02486000
*      3  RRNCMFB  BIT(8),       /* FLAG FIELD B - COMMANDS          */ 02487000
*         4  RRNCBDLO BIT(1),    /* DEACTIVATE LINE ORDERLY          */ 02488000
*         4  RRNCBDLH BIT(1),    /* DEACTIVATE LINE HALT             */ 02489000
*         4  RRNCBDLR BIT(1),    /* DISPLAY LINE RESOURCE ID         */ 02490000
*         4  RRNCBRDS BIT(1),    /* REQUEST DEVICE STATUS            */ 02491000
*         4  RRNCBRLS BIT(1),    /* REQUEST LINE STATUS              */ 02492000
*         4  RRNCBNPL BIT(1),    /* CHANGE LINE NEG POLL RESPONSE LIM*/ 02493000
*         4  RRNCBMOD BIT(1),    /* COPY/SET DESTINATION NODE        */ 02494000
*         4  RRNCBALT BIT(1),    /*  ACTIVATE LINE TRACE             */ 02495000
*      3  RRNCMFC  BIT(8),       /* FLAG FIELD C - COMMANDS          */ 02496000
*         4  RRNCCRCN BIT(1),    /* RESET CONDITIONAL                */ 02497000
*         4  RRNCCRDQ BIT(1),    /* RESET DEVICE QUEUE               */ 02498000
*         4  RRNCCRST BIT(1),    /* REQUEST DEVICE STATISTICS        */ 02499000
*         4  RRNCCCRC BIT(1),    /* CHANGE RETRY COUNTS              */ 02500000
*         4  RRNCCRIM BIT(1),    /* RESET IMMEDIATE                  */ 02501000
*         4  RRNCCRCM BIT(1),    /* RESET CONTROL MODE               */ 02502000
*         4  RRNCCSIM BIT(1),    /* COPY/REPLACE SESSION INIT INFO   */ 02503000
*         4  RRNCCCSL BIT(1),    /* CHANGE SESSION LIMIT             */ 02504000
*      3  RRNCMFD  BIT(8),       /* FLAG FIELD D - COMMANDS          */ 02505000
*         4  RRNCDCSP BIT(1),    /* CHANGE SERIVCE PAUSE             */ 02506000
*         4  RRNCDSTD BIT(1),    /* DISPLAY STORAGE                  */ 02507000
*         4  RRNCDDTL BIT(1),    /* CHANGE DEVICE TRANSMIT LIMIT     */ 02508000
*         4  RRNCDBCK BIT(1),    /* SWITCHED NETWORK BACKUP          */ 02509000
*         4  RRNCDDSI BIT(1),    /* COPY/REPLACE DEV SESSION INIT INFO* 02510000
*         4  RRNCDREC BIT(1),    /* RESET AT END OF COMMAND          */ 02511000
*         4  RRNREMPO BIT(1),    /* REMOTE POWER OFF                 */ 02512000
*         4 RRNRSV05  BIT(1),    /*       NOT  USED                  */ 02513000
*   2  RRNFLUX  PTR(31),         /* POINTER TO FIRST LUX             */ 02514000
*   2  RRNCPLUB CHAR(6),         /* SYMBOLIC UNIT NAME OF NCP DATASET*/ 02515000
*   2  RRNEPADR PTR(15),         /* EP SUBCHANNEL ADDRESS            */ 02516000
*   2  RRNNMDPD  CHAR(8),        /* FILENAME FOR DUMP DATA SET       */ 02517000
*      3  RRNDPLUB CHAR(6),      /* LUB NAME FOR DUMP DATASET        */ 02518000
*      3  RRNPUBI  BIT(8),       /* PUB INDEX                        */ 02519000
*      3  RRNRSV88 CHAR(1),      /* RESERVED-DOS ONLY                */ 02520000
*   2  RRNRSV04  CHAR(6),        /* RESERVED                         */ 02521000
*   2  RRNDELAY  CHAR(2),        /* INITIAL VALUE FROM DELAY         */ 02522000
*   2  RRNNMNCP  CHAR(8),        /* DSNAME FOR NCP LOAD MODULE       */ 02523000
*   2  RRNHPRE PTR(16),          /* HOST PREFIX INFORMATION          */ 02524000
*      3  RRNHLENH PTR(8),       /* LENGTH OF HOST HEADER PREFIX     */ 02525000
*      3  RRNHLENT PTR(8),       /* LENGTH OF HOST TEXT PREFIX       */ 02526000
*   2  RRNHBUFS FIXED(15),       /* SIZE OF BUFFER UNITS FOR HOST    */ 02527000
*   2  RRNCTPCC PTR(8),          /* CNT OF BUFFERS RECEIVING PCCU DATA* 02528000
*   2  RRNNCPNM CHAR(7),         /* NAME OF NCP LOAD MOD 7 CHAR MAX  */ 02529000
*   2  RRNMSIZE PTR(31),         /* MAX SIZE OF SEND                 */ 02530000
*   2  RRNRPLPT PTR(31),         /* C/R POINTER TO RPL               */ 02531000
*   2  RRNNCSPL PTR(31),         /* POINTER TO NCSPL                 */ 02532000
*   2  RRNLASTE PTR(31),         /* PTR TO LAST ENTRY IN RN SEGMENT  */ 02533000
*   2  RRNRDCUA CHAR(3),         /* DEFAULT CUA                      */ 02534000
*   2  *        PTR(8),          /* RESERVED                         */ 02535000
*   2  RRNRINNM CHAR(8);         /* DEFAULT INNODE NAME IN LOCAL   0535 02536000
*                                   RDT TO CONNECT REMOTE RN         */ 02537000
*                                                                  0535 02538000
*DCL                                                               0536 02539000
*1  ISTRGP BDY(WORD) BASED,      /* GROUP ENTRY                      */ 02540000
*   2  RGPPRE CHAR(LENGTH(ISTRPRE)),        /*  USE ISTRPRE DSECT    */ 02541000
*   2  RGPFLG BIT(8),            /*  FLAG FIELD                      */ 02542000
*      3  RGPADIL BIT(1),        /* =1 SWITCHED, =0 NON-SWIT         */ 02543000
*      3  RGPASS  BIT(1),        /* START/STOP                       */ 02544000
*      3  RGPABSC  BIT(1),       /* BINARY SYNCHRONOUS               */ 02545000
*      3  RGPASDLC BIT(1),       /* DATA LINK CONTROL                */ 02546000
*      3 RGPRSV02  BIT(4),       /*     NOT USED                     */ 02547000
*   2  RGPRSV03 FIXED(8),        /* USED TO FORCE ALINEMENT          */ 02548000
*   2  RGPCTELN FIXED(15),       /* COUNT OF LINE ENTRIES FOR GROUP  */ 02549000
*   2  RGPCTECL FIXED(15),       /* CNT OF CLUSTER ENTRIES FOR GROUP */ 02550000
*   2  RGPCTETR FIXED(15),       /* CNT TERMINAL ENTRIES FOR GROUP   */ 02551000
*   2  RGPCTEIN FIXED(15),       /* COUNT OF INNODE ENTRIES FOR GROUP*/ 02552000
*   2  RGPCTECM FIXED(15),       /* CNT COMPONENT ENTRIES FOR GROUP  */ 02553000
*   2  RGPRVPT1 PTR(31),         /* RESERVED                         */ 02554000
*   2  RGPRVPT2 PTR(31);         /* RESERVED                         */ 02555000
*                                                                  0536 02556000
*                                                                  0536 02557000
*DCL                                                               0537 02558000
*1  ISTRLN BDY(WORD) BASED,      /* LINE ENTRY                       */ 02559000
*   2  RLNPRE CHAR(LENGTH(ISTRPRE)), /* USE COMMON PREFIX            */ 02560000
*   2  RLNADR PTR(31),                                             0537 02561000
*      3  RLNFLAG BIT(8),                                          0537 02562000
*         4  RLNEAM   BIT(1),    /* ENABLE ANSWER MODE DONE          */ 02563000
*         4  RLNRBISA BIT(1),    /* INITIAL STATUS 1=ACTIVE          */ 02564000
*         4  RLNRSV01 BIT(6),    /* RESERVED                         */ 02565000
*      3  RLNUCBAD PTR(24),      /* UCB/PUB ADDRESS                  */ 02566000
*         4  RLNCUA CHAR(3),     /* NOT USED                         */ 02567000
*   2  RLNCTECL FIXED(15),       /* CNT OF CLUSTER ENTRIES FOR LINE  */ 02568000
*   2  RLNCTETR FIXED(15),       /* CNT OF TERMINAL ENTRIES FOR LINE */ 02569000
*   2  RLNCTEIN FIXED(15),       /* COUNT OF INNODE ENTRIES FOR LINE */ 02570000
*   2  RLNCTECM FIXED(15),       /* CNT OF COMPONENT ENTRIES FOR LINE*/ 02571000
*   2  RLNACTCT FIXED(15),       /* COUNT OF COMPONENTS, CLUSTERS  0537 02572000
*                                             AND TERMINALS ON LINE  */ 02573000
*   2  RLNSTAT1 BIT(8),          /* LINK TRAP STATUS                 */ 02574000
*      3 RLNTRAP  BIT(1),        /* INTERCEPT NEXT LINK OPERATION    */ 02575000
*      3 RLNLRST  BIT(1),        /* LINK RESTART COND CAUSED TRAP    */ 02576000
*      3 RLNINOPL BIT(1),        /* LINK INOP CONDITION CAUSED TRAP  */ 02577000
*      3 RLNINOPP BIT(1),        /* PU INOP CONDITION CAUSED TRAP    */ 02578000
*      3 RLNVD    BIT(1),        /* VARY INACT CONDITION CAUSED TRAP */ 02579000
*      3 RLNRSV03 BIT(3),        /* RESERVED                         */ 02580000
*    2 RLNSTAT2 BIT(8),          /* LINK NORMAL STATUS               */ 02581000
*      3 RLNOHIN  BIT(1),        /* OFFHOOK REPORTED TO SW SUBAREA-  */ 02582000
*                                /* REPLY DUE                        */ 02583000
*      3 RLNINUSE BIT(1),        /* LINK RESOURCES ALLOCATED TO PU   */ 02584000
*      3 RLNRSV04 BIT(6),        /* RESERVED                         */ 02585000
*   2  RLNRDF CHAR(4),           /*  RESOURCE DEFINITION FLAG        */ 02586000
*      3  RLNRDFA  BIT(8),       /* FLAGS FIELD A                    */ 02587000
*         4  RLNRACNT BIT(2),    /*  NEXT TWO FIELDS                 */ 02588000
*            5  RLNRACAT BIT(1), /* CALL INITIATOR-TERMINAL          */ 02589000
*            5  RLNRACAN BIT(1), /* CALL INITIATOR-NCP               */ 02590000
*         4  RLNGANSW BIT(1),    /* C/R GENNED IN ANSWER MODE, 1=YES */ 02591000
*         4  RLNPORT  BIT(1),    /* THIS IS A PORT ENTRY             */ 02592000
*         4  RLNIDV   BIT(1),    /* THIS IS AN ID VERIFIED PORT      */ 02593000
*         4  RLNRAEP  BIT(1),    /* TYPE IS EP                       */ 02594000
*         4  RLNRANCP BIT(1),    /* TYPE IS NCP                      */ 02595000
*         4  RLNRAPEP BIT(1),    /* TYPE IS PEP                      */ 02596000
*      3  RLNRDFB  BIT(8),       /* FLAGS FIELD B                    */ 02597000
*         4  RLNRBUSE BIT(1),    /* EP/NCP USE  1=NCP                */ 02598000
*         4  RLNANSWR BIT(1),    /* ON = SEND ENABLE ANSWER          */ 02599000
*                                /* AT ACTIVATE                      */ 02600000
*         4  RLNAUTOD BIT(1),    /* ON=AUTODIAL, OFF=MANUAL          */ 02601000
*         4  RLNRSV0B BIT(1),    /* RESERVED                         */ 02602000
*         4  RLNTTV   BIT(1),    /* THIS IS TERM TYPE VERIFICATION 0537 02603000
*                                   PORT                             */ 02604000
*         4  RLNRAPOL BIT(1),    /* POLLED LINE                      */ 02605000
*         4  RLNRATRN BIT(1),    /* SDLC LINE                        */ 02606000
*         4  RLNMULTP BIT(1),    /* 0 = POINT TO POINT,            0537 02607000
*                                   1 = MULTI POINT                  */ 02608000
*      3  RLNRDFC  BIT(8),       /* FLAGS FIELD C - LINE CODES       */ 02609000
*                                /* SEE CONSTANTS FOR DEFINITION     */ 02610000
*      3  RLNRDFD  BIT(8),       /* FLAGS FIELD D - RESERVED         */ 02611000
*   2  RLNAUTOA FIXED(15),       /* AUTOCALL ADDRESS                 */ 02612000
*   2  RLNRDSLM FIXED(8),        /* SCHED. LIM BASED ON LINE SPEED 2-4* 02613000
*   2  RLNCTSES FIXED(8),        /* COUNT OF CONCURRENT SESSIONS     */ 02614000
*   2  RLNACTRM PTR(8),          /* COUNT OF ACTIVE REMOTES FOR THIS    02615000
*                                   TRUNK                            */ 02616000
*   2  RLNRESV1 BIT(8),          /* RESERVED/UNUSED                  */ 02617000
*   2  RLNACTSN FIXED(15),       /* COUNT ACTIVE NODES ON LINK       */ 02618000
*   2  RLNPOLMT FIXED(8),        /* NEG POLL RESPONSE LIMIT          */ 02619000
*   2  RLNPAUSE FIXED(8),        /* POLL DELAY/PAUSE                 */ 02620000
*   2  RLNCRFLG BIT(8),          /* FLAG-CONFIGURATION RESTART       */ 02621000
*      3 RLNACTLN BIT(1),        /* ACTIVATE LINK OK                 */ 02622000
*      3 RLNSWNCP BIT(1),        /* SWITCH PEP LINE TO NCP OK        */ 02623000
*      3 RLNLSCMD BIT(3),        /* LINE SCHEDULING COMMANDS       0537 02624000
*                                   ISSUED OK                        */ 02625000
*        4 RLNNPRLM BIT(1),      /* CHNG NEG POLL RESP LIMIT OK      */ 02626000
*        4 RLNSESLM BIT(1),      /* CHNG SESSION LIMIT OK            */ 02627000
*        4 RLNSVSKP BIT(1),      /* CHNG SERVICE SEEK PAUSE OK       */ 02628000
*      3 RLNSWEP  BIT(1),        /* SWITCH TO EP                     */ 02629000
*      3 RLNCRRSV BIT(2),        /* RESERVED FOR CONFIG RESTART      */ 02630000
*   2  *        CHAR(1),         /* RESERVED                         */ 02631000
*   2  RLNX2SW  PTR(31),         /* ADDRESS OF 370X TO SWITCH        */ 02632000
*                                /* COMMUNICATION NCSPL              */ 02633000
*   2  RLNNCSPL PTR(31),         /* ADDRESS OF SPIN-OFF NCSPL        */ 02634000
*                                /* FOR VARY DEACTIVATE              */ 02635000
*   2  RLNRVPT2 PTR(31);         /* RESERVED                         */ 02636000
*                                                                  0537 02637000
*                                                                  0537 02638000
*DCL RLNRCEDC BIT(8) CONSTANT('01'X);  /* EBCDIC (CONSTANTS)         */ 02639000
*DCL RLNRCUSA BIT(8) CONSTANT('02'X);  /* USASCII                    */ 02640000
*DCL RLNRCBCD BIT(8) CONSTANT('03'X);  /* BCD                        */ 02641000
*DCL RLNRCEBC BIT(8) CONSTANT('04'X);  /* EBCD                       */ 02642000
*DCL RLNRCCOR BIT(8) CONSTANT('05'X);  /* COR                        */ 02643000
*DCL RLNRCKAT BIT(8) CONSTANT('06'X);  /* KATAKANA                   */ 02644000
*DCL RLNRCIT2 BIT(8) CONSTANT('08'X);  /* ITA2                       */ 02645000
*DCL RLNRCZS3 BIT(8) CONSTANT('09'X);  /* ZSC3                       */ 02646000
*                                                                  0545 02647000
*                                                                  0545 02648000
*DCL                                                               0546 02649000
*1  ISTRPT BDY(WORD) BASED,        /* PORT ENTRY                     */ 02650000
*   2 RPTLN CHAR(LENGTH(ISTRLN)),  /* INCLUDE LINE ENTRY             */ 02651000
*   2 RPTLNCID BDY(WORD) CHAR(4),  /* COMM ID OF LINE                */ 02652000
*     3 RPTLNSAF CHAR(2),          /* SAF                            */ 02653000
*     3 RPTLNDAF CHAR(2),          /* DAF                            */ 02654000
*   2 RPTCTNM CHAR(8),             /* CTERM NAME                     */ 02655000
*   2 RPTDITT PTR(31),             /* POINTER TO DITT TABLE          */ 02656000
*     3 RPTDIVT PTR(31),           /* POINTER TO DIVT TABLE          */ 02657000
*   2 RPTATERM PTR(31),            /* POINTER TO ASSOCIATED ENTRY    */ 02658000
*   2 RPTUTERM PTR(31),            /* POINTER TO UTERM ENTRY         */ 02659000
*   2 RPTFLAG1 CHAR(1),            /* PORT SOLICITOR FLAGS           */ 02660000
*     3  RPTASLEP BIT(1),          /* THIS PORT SOLICITOR IS WAITING    02661000
*                                     TO BE REDRIVEN BY CLSDST       */ 02662000
*     3 RPTVRYPD BIT(1),           /* VARY PENDING IN THIS CTERM     */ 02663000
*     3 RPTHLVPD BIT(1),           /* VARY PENDING IN HIGHER LEVEL 0546 02664000
*                                     NODE                           */ 02665000
*     3 RPTONLIN BIT(1),           /* ONLINE/OFFLINE(VARY)           */ 02666000
*     3 RPTVIODN BIT(1),           /* I/O DONE FOR THIS NODE         */ 02667000
*     3 RPTVYIMM BIT(1),           /* VARY IMM ISSUED FOR PORT       */ 02668000
*     3 RPTDYNAM BIT(1),           /* BHSET = DYNAMIC                */ 02669000
*     3 RPTISTAT BIT(1),           /* CTERM(PORT) IS INITIALLY ACTIVE*/ 02670000
*                                  /* 1 = YES                        */ 02671000
*   2 RPTRSV01 CHAR(1),            /* RESERVED                       */ 02672000
*   2 RPTDAFSV BIT(16),            /* SAVE TERMINAL DAF              */ 02673000
*   2 RPTPEPCT FIXED(15),          /* PEP COUNT FOR CTERM            */ 02674000
*   2 RPTPTHCT FIXED(15),          /* PATH COUNT FOR CTERM           */ 02675000
*   2 RPTNSNSV PTR(31),            /* SAVE TERMINAL NEXT SCHED NODE     02676000
*                                     POINTER                        */ 02677000
*   2  RPTRSV02 PTR(31),           /* RESERVED                       */ 02678000
*   2  RPTRSV03 PTR(31);           /* RESERVED                       */ 02679000
*                                                                  0546 02680000
*                                                                  0546 02681000
*DCL                                                               0547 02682000
*1  ISTRCL BDY(WORD) BASED,      /* CLUSTER ENTRY                    */ 02683000
*   2  RCLPRE CHAR(LENGTH(ISTRPRE)),    /* USE COMMON PREFIX         */ 02684000
*   2  RCLADR PTR(31),                                             0547 02685000
*      3  RCLFLAG BIT(8),                                          0547 02686000
*         4  RCLRSV22 BIT(1),    /* RESERVED                         */ 02687000
*         4  RCLRBISA BIT(1),    /* INITIAL STATUS 1=ACTIVE          */ 02688000
*         4  RCLBATCH BIT(1),    /* BATCHED MESSAGE INPUT          0547 02689000
*                                   FEATURE                          */ 02690000
*         4  RCLRSV33 BIT(5),    /* RESERVED                         */ 02691000
*      3  RCLGPADR PTR(24),      /* ADDRESSING INFORMATION POINTER 0547 02692000
*                                                  (ADDR RCLCNGP)    */ 02693000
*   2  RCLCTETR FIXED(15),       /* CNT TERMINAL ENTRIES FOR CLUSTER */ 02694000
*   2  RCLCTECM FIXED(15),       /* CNT COMPONENT ENTRIES FOR CLUSTER*/ 02695000
*   2  RCLRSV01 FIXED(15),       /* FILLER TO FORCE ALIGNMENT        */ 02696000
*   2  RCLCTNGP FIXED(15),       /* GPOLL CHARACTER COUNT            */ 02697000
*   2  RCLGPOLA PTR(31),         /* GPOLL CHARACTER STRING POINTER   */ 02698000
*   2  RCLRVPT1 PTR(31),         /* RESERVED                         */ 02699000
*   2  RCLRVPT2 PTR(31);         /* RESERVED                         */ 02700000
*                                                                  0547 02701000
*                                                                  0547 02702000
*DCL                                                               0548 02703000
*1  ISTRTR BDY(WORD) BASED,      /* TERMINAL AND/OR COMPONENT ENTRY  */ 02704000
*   2  RTRCRPR CHAR(LENGTH(ISTRCPRE)),     /* USE ISTRCPRE DSECT     */ 02705000
*   2  RTRADR PTR(31),                                             0548 02706000
*      3  RTRFLAG BIT(8),                                          0548 02707000
*         4  RTRRSV21 BIT (1),   /* RESERVED */                    0548 02708000
*         4  RTRRBISA BIT(1),    /* INITIAL STATUS 1 = ACITVE        */ 02709000
*         4  RTRRSV51 BIT(3),    /* RESERVED                         */ 02710000
*         4  RTRVTERM BIT(1),    /* VTERM TERMINAL ENTRY             */ 02711000
*         4 RTRRSV22 BIT(2),     /* UNUSED                           */ 02712000
*      3  RTRADRPT PTR(24),      /* TO BE USED FOR POINTER TO      0548 02713000
*                                            ADDRESSING INFORMATION  */ 02714000
*   2  RTRCTECM FIXED(15),       /* COUNT OF COMPONENT             0548 02715000
*                                               ENTRIES FOR TERMINAL */ 02716000
*   2  RTRRSV01 FIXED(15),       /*  FILLER TO FORCE ALINEMENT       */ 02717000
*   2  RTRRSV45 CHAR(4),         /* RESERVED                         */ 02718000
*   2  RTRRDFA  BIT(8),          /* FLAG FIELD A                     */ 02719000
*      3  RTRRAATN BIT(1),       /* TERMINAL CAN INTERRUPT PCCU      */ 02720000
*      3  RTRRAALL BIT(3),       /* 3 FLAG FIELD                     */ 02721000
*         4  RTRRAPT1 BIT(1),    /* PT1 BLOCK HANDLER FLAGS          */ 02722000
*         4  RTRRAPT2 BIT(1),    /* PT2                              */ 02723000
*         4  RTRRAPT3 BIT(1),    /* PT3                              */ 02724000
*      3  RTRRACDT BIT(1),       /* CRITICAL DATA FLAG               */ 02725000
*      3  RTRRSV60 BIT(1),       /* RESERVED                         */ 02726000
*      3  RTRRACTR BIT(1),       /* LOGICAL DEVICE FLAG              */ 02727000
*      3  RTRRSV02 BIT(1),       /* UNUSED                           */ 02728000
*   2  RTRRDFB  BIT(8),          /* FLAG FIELD B - RESOURCE DEF      */ 02729000
*      3  RTRRBECT BIT(1),       /* EMBEDDED LINE CONTROL            */ 02730000
*      3  RTRRBEND BIT(1),       /* EOT/EOB                          */ 02731000
*      3  RTRRSV32 BIT(6),       /* RESERVED                         */ 02732000
*   2  RTRRDFC  BIT(8),          /* FLAG FIELD C - RESOURCE DEF      */ 02733000
*      3  RTRRCIT1 BIT(1),       /* EIB CHAR AFTER ITB ON RECV       */ 02734000
*      3  RTRRCIT2 BIT(1),       /* EIB CHAR AFTER ITB ON SEND       */ 02735000
*      3  RTRRCPT3 BIT(1),       /* DEVICE HAS PT3 BHSET             */ 02736000
*      3  RTRRCBLK BIT(1),       /* RECORD DATA - BLOCK              */ 02737000
*      3  RTRRCMSG BIT(1),       /* RECORD DATA - MESSAGE            */ 02738000
*      3  RTRRCXMS BIT(1),       /* RECORD DATA - XMISSION           */ 02739000
*      3  RTRRSV23 BIT(2),       /* RESERVED/UNUSED                  */ 02740000
*   2  RTRRDFD  BIT(8),          /* FLAG FIELD D - RESERVED          */ 02741000
*      3  RTRRDBHN  BIT(1),      /* BHSET = NONE                     */ 02742000
*      3  RTRRDBHD  BIT(1),      /* BHSET = DYNAMIC                  */ 02743000
*      3  RTRRDBHI  BIT(1),      /* BHSET = SETNAME AND EXECUTR      */ 02744000
*      3  RTRRSV10 BIT(2),       /* RESERVED                         */ 02745000
*      3  RTRRSV11 BIT(3),       /* RESERVED                         */ 02746000
*   2  RTRRDFE  BIT(8),          /* FLAG FIELD E - RESOURCE DEF      */ 02747000
*/*                RTRREFT1  FEATURE FLAGS  (9 BITS)                 */ 02748000
*      3  RTRREBRK BIT(1),       /* TRANSMIT INTERRUPT               */ 02749000
*      3  RTRRSV0A BIT(1),       /* RESERVED                         */ 02750000
*      3  RTRREACR BIT(1),       /* ACCELERATED CARRIAGE RETURN      */ 02751000
*      3  RTRRECHK BIT(1),       /* CHECKING FEATURE                 */ 02752000
*      3  RTRREATT BIT(1),       /*  TERMINAL INTERRUPT              */ 02753000
*      3  RTRRESUP BIT(1),       /*  TIMEOUT SUPPRESSION             */ 02754000
*      3  RTRRESCT BIT(1),       /*  STATION CONTROL                 */ 02755000
*   2  RTRRDFF  BIT(8),          /* FLAG FIELD F - RESOURCE DEF      */ 02756000
*      3  RTRRFXCT BIT(1),       /* TRANSMIT CONTROL                 */ 02757000
*/*                      RTRRFFT2 FEATURE 2 FLAGS (NEXT 5 BITS)      */ 02758000
*      3  RTRRFPEN BIT(1),       /* SELECTOR PEN                     */ 02759000
*      3  RTRRFPFK BIT(1),       /* PROGRAM FUNCTION DEYBOARD        */ 02760000
*      3  RTRRFANK BIT(1),       /* STANDARD ALPHA-NUMERIC KEYBOARD  */ 02761000
*      3  RTRRFDEK BIT(1),       /* DATA ENTRY KEYBOARD              */ 02762000
*      3  RTRRSV24 BIT(3),       /* UNUSED/RESERVED                  */ 02763000
*   2  RTRTRMAX CHAR(1),         /* MAX # TRANSMISSIONS TERM TO PCCU */ 02764000
*   2  RTRCRFLG PTR(8),          /* FLAG-CONFIGURATION RESTART       */ 02765000
*      3 RTRCRSV1 BIT(2),        /* RESERVED FOR CONFIG RESTART      */ 02766000
*      3 RTRLSCMD BIT(1),        /* LINE SCHEDULING CMD ISSUED OK    */ 02767000
*        4 RTRDTRLM BIT(1),      /* CHNG DEV TRANSMISSION LIMIT OK   */ 02768000
*      3 RTRCRSV2 BIT(5),        /* RESERVED FOR CONFIG. RESTART     */ 02769000
*   2  RTRBHSN1 CHAR(8),         /* DEFAULT BHSET NAME IS BHF IS ON  */ 02770000
*   2  RTRRVPT1 PTR(31),         /* RESERVED                         */ 02771000
*   2  RTRRSV03 FIXED(15),       /* FILLER TO FORCE ALIGNMENT        */ 02772000
*   2  RTRCTDIA FIXED(15),       /* CNT OF CHARS. IN TERM DIAL NUMBER*/ 02773000
*   2  RTRCTPOL FIXED(15),       /* # CHARS. IN TERM POLL STRING     */ 02774000
*   2  RTRCTADR FIXED(15),       /* COUNT OF ADDRESSING CHARACTERS   */ 02775000
*   2  RTRCADDR  CHAR(8),        /* COMPONENT ADDRESSING CHARS       */ 02776000
*   2  RTRPOLA PTR(31),          /* POINTER TO POLLING CHARACTERS    */ 02777000
*   2  RTRDIAA PTR(31),          /* POINTING TO DIAL CHARACTERS      */ 02778000
*   2  RTRRDFG  BIT(8),          /* CORRESPONDENCE CODE USED BY THIS    02779000
*                                   TERM LINE. SEE CONSTANTS.        */ 02780000
*   2  RTRRSVDD CHAR(7),         /* RESERVED                         */ 02781000
*   2  RTRBSCID CHAR(21),        /* BSC ID FIELD                     */ 02782000
*      3  RTRIDLEN FIXED(8),     /* LENGTH OF ID                     */ 02783000
*      3  RTRIDCAS CHAR(20),     /* ID CHARACTER                     */ 02784000
*   2  RTRLCTI BIT(8),           /* LINE CONTROL TYPE ID             */ 02785000
*   2  RTRRSV04 CHAR(2);         /* RESERVED                         */ 02786000
*                                                                  0548 02787000
* DCL RTRDNCBA PTR(31) DEF(ISTRTR) POS(41);  /* SCAFFOLDING          */ 02788000
*/* CONSTANTS FOR FIELD RTRRDFG                                      */ 02789000
*DCL RTRRCBCD BIT(8) CONSTANT('03'X); /* BCD                         */ 02790000
*DCL RTRRCEBC BIT(8) CONSTANT('04'X); /* EBCD                        */ 02791000
*DCL RTRRCCOR BIT(8) CONSTANT('05'X); /* COR                         */ 02792000
*                                                                  0552 02793000
*/*     CONSTANTS FOR FIELD RTRLCTI                                  */ 02794000
*DCL RTR2741  BIT(8) CONSTANT('00'X);  /* 2741                       */ 02795000
*DCL RTR2740A BIT(8) CONSTANT('02'X);  /* 2740-1 A (BASIC)           */ 02796000
*DCL RTR2740D BIT(8) CONSTANT('06'X);  /* 2740-1 D (TRANS CONTROL)   */ 02797000
*DCL RTR2740E BIT(8) CONSTANT('0A'X);  /* 2740-1 E (TRANS          0556 02798000
*                                   CONTROL WITH CHECKING            */ 02799000
*DCL RTR2740F BIT(8) CONSTANT('0C'X);  /* 2740-1 F (CHECKING)        */ 02800000
*DCL RTR1050  BIT(8) CONSTANT('1C'X);  /* 1050                       */ 02801000
*DCL RTRTWX   BIT(8) CONSTANT('22'X);  /* TWX                        */ 02802000
*/*                                                                  */ 02803000
*/*   ENTRY IN LOCAL RN FOR REMOTE SEGMENT                           */ 02804000
*/*                                                                  */ 02805000
*DCL  1  ISTRIN   BDY(WORD) BASED,   /* INNODE REMOTE ENT IN LOCAL RN*/ 02806000
*        2 RINCRPRE CHAR(LENGTH(ISTRCPRE)),  /* PREFIX               */ 02807000
*        2 RINDFD   BIT(8),          /* FLAG FIELD                   */ 02808000
*          3 RINREMPO BIT(1),        /* REMOTE POWER OFF             */ 02809000
*            4 RTRREMPO BIT(1),      /* ALIAS                        */ 02810000
*          3 RINNODEF BIT(1),        /* REMOTE TERM ENTRY INV AS ENT */ 02811000
*            4 RTRNODEF BIT(1),      /* ALIAS                        */ 02812000
*          3 RINLDISC BIT(1),        /* DISCONNECT REMOTE REQUIRED   */ 02813000
*            4 RTRLDISC BIT(1),      /* ALIAS                        */ 02814000
*          3 RINRSV01 BIT(5),        /* RESERVED                     */ 02815000
*        2 RINNODID PTR(8),          /* NODE ID OF REMOTE            */ 02816000
*          3 RTRNODID PTR(8),        /* ALIAS                        */ 02817000
*        2 RINRLDAF CHAR(2),         /* DAF OF REMOTE WHEN ACTIVE    */ 02818000
*          3 RTRRLDAF CHAR(2),       /* ALIAS                        */ 02819000
*        2 RINREMOT PTR(31),         /* PTR TO RN ENTRY FOR REMOTE   */ 02820000
*          3 RTRREMOT PTR(31),       /* ALIAS                        */ 02821000
*        2 RINVPAB  PTR(31),         /* ADDR VARY PAB FOR REMOTE     */ 02822000
*          3 RTRVPAB  PTR(31),       /* ALIAS                        */ 02823000
*        2 RINRPHCN PTR(31),         /* ADDR RPH WAITING FOR CONTACT */ 02824000
*          3 RTRRPHCN PTR(31),       /* ALIAS                        */ 02825000
*        2 RINNCSPL PTR(31),         /* ADDR FOR NCSPL FOR DEACTIVATE*/ 02826000
*          3 RTRNCSPL PTR(31),       /* ALIAS                        */ 02827000
*        2 RINCNCNT PTR(8),          /* CONTACT COUNT FOR REMOTE     */ 02828000
*          3 RTRCNCNT PTR(8),        /* ALIAS                        */ 02829000
*        2 RINRSV02 CHAR(3),         /* RESERVED                     */ 02830000
*        2 RINLOCRN PTR(31),         /* PTR TO RN ENTRY OF LOCAL     */ 02831000
*        2 RINRSV04 CHAR(4),         /* RESERVED                     */ 02832000
*        2 RINRSV05 CHAR(4);         /* RESERVED                     */ 02833000
*/*                                                                  */ 02834000
*DCL                                                               0561 02835000
*1   ISTRDS BDY(WORD) BASED,       /* LCDO ENTRY                     */ 02836000
*           2  RDSPRE CHAR(LENGTH(ISTRPRE)), /* ENTRY PREFIX         */ 02837000
*           2  RDSCTTRM FIXED(15), /* COUNT OF ENTRY POINTERS      0561 02838000
*                                     IN DIAL OUT TABLE              */ 02839000
*           2  RDSCTATR FIXED(15), /*                                */ 02840000
*           2  RDSADDOT PTR(31);   /* ADDRESS OF DIAL OUT TABLE      */ 02841000
*/*                                                                  */ 02842000
*DCL                                                               0562 02843000
*1   ISTDOT BDY(WORD) BASED,       /* DIAL OUT TABLE                 */ 02844000
*           2  DOTADTRM PTR(31);   /* PTR TO DIAL OUT OR DIAL IN/  0562 02845000
*                                     OUT TERMINAL RDTE              */ 02846000
*/*                                                                  */ 02847000
*DCL                                                               0563 02848000
*1 ISTRCC BDY(WORD) BASED,             /* PU ENTRY                   */ 02849000
*  2 RCCPRE   CHAR(LENGTH(ISTRPRE)),   /* COMMON PREFIX              */ 02850000
*  2 RCCTYPE  CHAR(1),                 /* PU TYPE                    */ 02851000
*  2 RCCFLAG  BIT(8),                  /* FLAG FIELD                 */ 02852000
*    3 RCCRBISA BIT(1),                /* I STATUS 1=ACTIVE          */ 02853000
*    3 RCCCUDIE BIT(1),                /* CLUSTER DEACTIVATING       */ 02854000
*    3 RCCERPIP BIT(1),                /* ERP IN PROCESS             */ 02855000
*    3 RCCLDISC BIT(1),                /* DISCONNECT REQUEST         */ 02856000
*    3 RCCOHIMM BIT(1),                /* RTGOH RECEIVED AND WAS     */ 02857000
*                                      /* AN IMMEDIATE TYPE          */ 02858000
*    3 RCCOUERP BIT(1),                /* REPEAT ERP                 */ 02859000
*    3 RCCPRGDN BIT(1),                /* PURGE ISSUED               */ 02860000
*    3 RCCCTPGD BIT(1),                /* CONTACT PURGED             */ 02861000
*  2 RCCFLAGB BIT(8),                  /* FLAG FIELD                 */ 02862000
*    3 RCCDSTCT BIT(1),                /* DEACT TO DECR STCNT IN HDR */ 02863000
*    3 RCCDIALP BIT(1),                /* DIAL IN PROGRESS           */ 02864000
*    3 RCCIRETR BIT(1),                /* IRETRY 1 = YES             */ 02865000
*    3 RCCBNNSP BIT(1),                /* BNNSUP FOR 3270            */ 02866000
*    3 RCCFINAL BIT(1),                /* ON = DEACT PU FINAL REQD   */ 02867000
*    3 RCCRESET BIT(1),                /* ON = RESET DEACT IN PROCESS*/ 02868000
*    3 RCCBRKCN BIT(1),                /* ON-DISCOUNT=YES SPECIFIED  */ 02869000
*                                      /* OFF-DISCOUNT=NO SPECIFIED  */ 02870000
*    3 RCCRTGOH BIT(1),                /* ON=RTGOH RECEIVED          */ 02871000
*  2 RCCCNCNT  PTR(8),                 /* CONTACT COUNT              */ 02872000
*  2 RCCCTELU FIXED(15),               /* COUNT OF PU LU ENTRIES     */ 02873000
*  2 RCCSTAID CHAR(8),                 /* 64 BIT PU STATION ID       */ 02874000
*    3 RCCIDPA1 BIT(16),               /* FILLER OF 2 BYTES OF 0     */ 02875000
*    3 RCCID48,                                                    0563 02876000
*      4 RCCIDPUT BIT(8),              /* PU TYPE                    */ 02877000
*      4 RCCIDPA2 BIT(8),              /* FILLER OF 1 BYTE OF 0      */ 02878000
*      4 RCCIDBLK BIT(12),             /* IDBLK VALUE                */ 02879000
*      4 RCCIDNUM BIT(20),             /* IDNUM VALUE                */ 02880000
*  2 RCCSESCT PTR(8),                  /* SESSION COUNT              */ 02881000
*  2 *        CHAR(1),                 /* RESERVED                   */ 02882000
*  2  RCCVPAB PTR(31),                 /* ADDRESS OF VARY PAB        */ 02883000
*  2 RCCDPAB  PTR(31),                 /* ADDR RESTART PAB           */ 02884000
*  2 RCCEPAB  PTR(31),                 /* ADDR OF ERP PAB            */ 02885000
*  2 RCCRPHCN PTR(31),                 /* ADDR RPH WAIT FOR CONTACT  */ 02886000
*  2 RCCNCSPL PTR(31),                 /* ADDR NCSPL FOR DEACTIVATE  */ 02887000
*  2 RCCCRFLG BIT(8),                  /* FLAG-CONFIGURATION RESTART */ 02888000
*    3 RCCACTPU BIT(1),                /* ACTIVATE PHYSICAL          */ 02889000
*    3 RCCCTCFL BIT(1),          /* HIGHER FAILURE-CONTACT FLUSHED   */ 02890000
*    3 RCCCRRSV BIT(6),                /* RES. FOR CONFIG. RESTART   */ 02891000
*  2 RCCRSV02 PTR(24),                 /* RESERVED                   */ 02892000
*  2 RCCTPAB  PTR(31),                 /* TOLTEP SSCP PAB            */ 02893000
*  2 RCCDPQ   PTR(31),                 /* DIAL PENDING NCSPL QUE PTR */ 02894000
*  2 RCCPATHT PTR(31),                 /* PTR TO PATH TABLE          */ 02895000
*  2 RCCPATHZ FIXED(15),               /* # ENTRIES IN PATH TABLE    */ 02896000
*  2 RCCINDEX FIXED(15),               /* INDEX TO PATH TABLE        */ 02897000
*  2 RCCMXDAT FIXED(15),               /* MAXDATA SIZE               */ 02898000
*  2 RCCMXOUT FIXED(8),                /* MAXOUT VALUE               */ 02899000
*  2 RCCPASSL FIXED(8),                /* PASSLIM VALUE              */ 02900000
*  2 RCCADDR  FIXED(8),                /* STATION ADDRESS            */ 02901000
*  2 RCCRSPT2 PTR(24),                 /* RESERVED                   */ 02902000
*  2 RCCSWTOX PTR(31),                 /* SWITCHED TO 370X           */ 02903000
*                                      /* COMMUNICATIONS NCSPL       */ 02904000
*  2 RCCXTOSW PTR(31),                 /* 370X TO SWITCHED           */ 02905000
*                                      /* COMMUNICATIONS NCSPL       */ 02906000
*  2 RCCRVPT2 PTR(31);                 /* RESERVED                   */ 02907000
*/* RCCTYPE - PU TYPE CODES                                          */ 02908000
*DCL RCCPU01  BIT(8) CONSTANT('01'X);  /* PU TYPE 1                  */ 02909000
*DCL RCCPU02  BIT(8) CONSTANT('02'X);  /* PU TYPE 2                  */ 02910000
*DCL RCCPU03  BIT(8) CONSTANT('03'X);  /* PU TYPE 3                  */ 02911000
*DCL RCCPU04  BIT(8) CONSTANT('04'X);  /* PU TYPE 4                  */ 02912000
*/*                                                                  */ 02913000
*DCL                                                               0568 02914000
*1 ISTRLU BDY(WORD) BASED,             /* LU ENTRY                   */ 02915000
*  2 RLUCRPR CHAR(LENGTH(ISTRCPRE)),   /* COMMON PREFIX              */ 02916000
*  2 RLUTYPE  CHAR(1),                 /* LU TYPE                    */ 02917000
*  2 RLUFLAG  CHAR(1),                 /* RLU FLAGS                  */ 02918000
*    3 RLURBISA BIT(1),                /* I STATUS 1=ACTIVE          */ 02919000
*    3 RLUBATCH BIT(1),                /* 1 IF BATCH = YES           */ 02920000
*    3 RLUGSTAT BIT(1),                /* C/R GENNED ISTATUS VALUE   */ 02921000
*                                      /* 1 = ACTIVE                 */ 02922000
*    3 RLUNDSES BIT(1),                /* SPECIAL END SESSION        */ 02923000
*    3 RLURSV00 BIT(4),                /* RESERVED                   */ 02924000
*  2 RLUCRFLG BIT(8),                  /* FLAG-CONFIGURATION RESTART */ 02925000
*    3 RLUACTLU BIT(1),                /* ACTIVATE LOGICAL UNIT OK   */ 02926000
*    3 RLUCRRSV BIT(7),                /* RESERVED FOR CONFIG RESTART*/ 02927000
*  2 RLUSSCFM BIT(8),                  /* FUNCTION MANAGER TYPE      */ 02928000
*  2 RLUINTA PTR(31),                  /* RESERVED                   */ 02929000
*  2 RLUPACE CHAR(2),                  /* VPACING COUNTS             */ 02930000
*    3 RLUPACEN CHAR(1),               /* N COUNT                    */ 02931000
*    3 RLUPACEM CHAR(1),               /* M COUNT                    */ 02932000
*  2 RLUNCPPC CHAR(2),                 /* NCP PACING COUNTS          */ 02933000
*    3 RLUNCPPN CHAR(1),               /* N COUNT                    */ 02934000
*    3 RLUNCPPM CHAR(1),               /* M COUNT                    */ 02935000
*  2 RLULOCAD CHAR(1),                 /* LOCAL ADDRESS OF LU        */ 02936000
*  2 RLURSV01 CHAR(3),                 /* RESERVED                   */ 02937000
*  2 RLUUSSTB CHAR(12) BDY(WORD),      /* USSTAB                     */ 02938000
*    3 RLUUSSNM CHAR(8),               /* USSTAB NAME                */ 02939000
*    3 RLUUSSPT PTR(31),               /* USSTAB ADDRESS             */ 02940000
*  2 RLUMODET CHAR(12) BDY(WORD),      /* MODETAB                    */ 02941000
*    3 RLUMODEN CHAR(8),               /* MODETAB NAME               */ 02942000
*    3 RLUMODEP PTR(31),               /* MODETAB ADDRESS            */ 02943000
*  2 RLULGMOD CHAR(8),                 /* LOGMODE                    */ 02944000
*  2 RLURSV02 PTR(31);                 /* RESERVED                   */ 02945000
*/*  RLUSSCFM - FOLLOWING EQUATES ARE FOR THE VARIOUS                */ 02946000
*/*             FUNCTION MANAGER TYPES                               */ 02947000
*DCL RLUFSS   BIT(8) CONSTANT('01'X);  /* FORMATTED SYS SERVICES     */ 02948000
*DCL RLUUSS   BIT(8) CONSTANT('02'X);  /* UNFORMATTED SYS SERVICES   */ 02949000
*DCL RLUU3270 BIT(8) CONSTANT('04'X);  /* UNFORMATTED SYS SVCS 3270  */ 02950000
*/*  RLUTYPE - EQUATES FOR LU TYPE                                   */ 02951000
*DCL RLUTYP04 BIT(8) CONSTANT('04'X);  /* LU TYPE IS 4               */ 02952000
*/*                                                                  */ 02953000
*DCL 1 ISTRPX BDY(WORD) BASED,     /* SKELETON PUX ENTRY             */ 02954000
*      2 RPXPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX             */ 02955000
*      2 RPXFLUX  PTR(31),         /* PTR TO FIRST LUX IN CHAIN      */ 02956000
*      2 RPXMAXLU PTR(8),          /* MAX NUMBER OF LU'S             */ 02957000
*                                  /* FOR THIS LINK                  */ 02958000
*      2 RPXRSV02 PTR(24),         /* RESERVED                       */ 02959000
*      2 RPXRSV01 PTR(31);         /* RESERVED                       */ 02960000
*/*                                                                  */ 02961000
*DCL 1 ISTRLX BDY(WORD) BASED,     /* SKELETON LUX ENTRY             */ 02962000
*      2 RLXPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX             */ 02963000
*      2 RLXNLUX  PTR(31),         /* PTR TO NEXT LUX IN CHAIN       */ 02964000
*      2 RLXFLAGA CHAR(1),         /* FLAG BYTE                      */ 02965000
*        3 RLXINUSE BIT(1),        /* ON = LUX IS IN USE             */ 02966000
*        3 RLXRSV01 BIT(7),        /* RESERVED                       */ 02967000
*      2 RLXRSV02 CHAR(3),         /* RESERVED                       */ 02968000
*      2 RLXRSV03 PTR(31);         /* RESERVED                       */ 02969000
*/*                                                                  */ 02970000
*DCL 1 ISTRSW BDY(WORD) BASED,     /* SWITCHED SUBAREA HDR ENTRY     */ 02971000
*      2 RSWPRE CHAR(LENGTH(ISTRDT)),   /* USE ISTRDT DSECT          */ 02972000
*      2 RSWDIALT PTR(31),         /* PTR TO DIAL #'S TABLE          */ 02973000
*      2 RSWGRUPT PTR(31),         /* PTR TO GROUP NAMES TABLE       */ 02974000
*      2 RSWDIALZ FIXED(15),       /* # ENTRIES IN DIAL NO. TABLE    */ 02975000
*      2 RSWGRUPZ FIXED(15),       /* # ENTRIES IN GRP NAME TABLE    */ 02976000
*      2 RSWCTELU FIXED(15),       /* COUNT OF LU ENTRIES IN THIS SEG*/ 02977000
*      2 RSWRSV02 CHAR(2),         /* RESERVED                       */ 02978000
*      2 RSWRSV01 PTR(31);         /* RESERVED                       */ 02979000
*/*                                                                  */ 02980000
*DCL 1 ISTRDA BDY(WORD) BASED,     /* DAN ENTRY                      */ 02981000
*      2 RDAPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX             */ 02982000
*      2 RDAADR   PTR(31),                                         0576 02983000
*        3 RDAFLAG  BIT(8),        /* FLAG BYTE                      */ 02984000
*          4 RDARBISA BIT(1),      /* INITIAL STATUS, 1 = ACTIVE     */ 02985000
*          4 RDARSV01 BIT(7),      /* RESERVED                       */ 02986000
*        3 RDAUCBAD PTR(24),       /* UCB.PUB ADDRESS                */ 02987000
*          4 RDACHQI  BIT(8),      /* CHANNEL QUEUE INDEX            */ 02988000
*          4 RDALUBA  BIT(16),     /* @ OF LOGICAL UNIT BLOCK        */ 02989000
*      2 RDADACUA CHAR(3),         /* CHANNEL UNIT ADDRESS           */ 02990000
*      2 RDACTPCC PTR(8),          /* CNT OF BUFFERS RECEIVING DATA  */ 02991000
*      2 RDADFCUA CHAR(3),         /* DEFAULT CUA                    */ 02992000
*      2 RDAPUBI  BIT(8),          /* PUB INDEX                      */ 02993000
*      2 RDARSVPT PTR(31);         /* RESERVED                       */ 02994000
*/*                                                                  */ 02995000
*DCL 1 ISTRLS BDY(WORD) BASED,     /* LOCAL SUBAREA HEADER ENTRY     */ 02996000
*      2 RLSPRE CHAR(LENGTH(ISTRDT)),   /* USE ISTRDT DSECT          */ 02997000
*      2 RLSCTELU FIXED(15),       /* COUNT OF LU ENTRIES IN THIS SEG*/ 02998000
*      2 RLSRSV01 FIXED(15),       /* RESERVED                       */ 02999000
*      2 RLSRSV02 PTR(31);         /* RESERVED                       */ 03000000
*/*                                                                  */ 03001000
*DCL  1  ISTDNT BDY(WORD) BASED,  /* DIAL NUMBER TABLE               */ 03002000
*        2 DNTCTDIG FIXED(8),     /* NUMBER OF DIGITS IN TEL. NUM.   */ 03003000
*        2 DNTTELNO CHAR(32);     /* TELEPHONE NUMBER                */ 03004000
*/*                                                                  */ 03005000
* DCL  1  ISTGNT BDY(WORD) BASED, /* GROUP NAMES TABLE               */ 03006000
*         2 GNTGRPNM CHAR(8);     /* GROUP NAME ENTRY                */ 03007000
*/*                                                                  */ 03008000
*DCL  1  ISTPAT BDY(WORD) BASED,  /* PATH TABLE                      */ 03009000
*        2 PATGINDX FIXED(15),    /* INDEX TO GROUP NAME TABLE       */ 03010000
*        2 PATDINDX FIXED(15),    /* INDEX TO DIAL NUMBER TABLE      */ 03011000
*        2 PATPTHID PTR(8),       /* PATH ID                         */ 03012000
*        2 PATGRPID PTR(8),       /* GROUP PATH ID                   */ 03013000
*        2 PATRDCNT PTR(8),       /* REDIAL COUNT                    */ 03014000
*        2 PATFLAGA BIT(8),       /* FLAG BYTE                       */ 03015000
*          3 PATUSEFG BIT(1),     /* ON = PATH INITIALLY USABLE      */ 03016000
*          3 PATRSV01 BIT(7);     /* RESERVED                        */ 03017000
*DCL  1  ISTRH     BDY(WORD) BASED,      /* REQUEST HEADER           */ 03018000
*       2  RHFLAGS  CHAR(3),             /* REQUEST HEADER FLAGS     */ 03019000
*        3  RH1    BIT(8),               /* FIRST RH BYTE            */ 03020000
*           4  RHQS     BIT(1),          /* 0-REQUEST,1-RESPONSE     */ 03021000
*           4  RHTYPE   BIT(1),          /* 0-DATA,1-CONTROL         */ 03022000
*           4  RHSCI    BIT(1),          /* 0-FM,1-SYSTEM CONTROL    */ 03023000
*           4  RHDIRI   BIT(1),          /* 0-WITH,1-AGAINST         */ 03024000
*           4  RHFORMAT BIT(1),          /* 0-UNFORMATTED,1-FORMATTED*/ 03025000
*           4  RHSENSE  BIT(1),          /* 0-NOT INCLUDED,1-INCLUDED*/ 03026000
*           4  RHCHAIN  BIT(2),          /* CHAINING CONTROL         */ 03027000
*                                        /* 0-MIDDLE                 */ 03028000
*                                        /* 1-LAST                   */ 03029000
*                                        /* 2-FIRST                  */ 03030000
*                                        /* 3-ONLY                   */ 03031000
*        3  RH2    BIT(8),               /* SECOND RH BYTE           */ 03032000
*           4  RHFME    BIT(1),          /* Q-FME REQUESTED,S-FME    */ 03033000
*           4  RHPE     BIT(1),          /* Q-PE REQUESTED,S-PE      */ 03034000
*           4  RHRRN    BIT(1),          /* Q-RRN REQUESTED,S-RRN    */ 03035000
*           4  RHEXCEPT BIT(1),          /* Q-EXCEPTION RESPONSES    */ 03036000
*                                        /* ONLY,S-ERROR             */ 03037000
*           4  RHRETRY  BIT(1),          /* Q-RETRY,                 */ 03038000
*              5  RHBUSY  BIT(1),        /* S-BUSY                   */ 03039000
*           4  RHRSVD1  BIT(1),          /* Q-RESERVED               */ 03040000
*              5  RHINOP  BIT(1),        /* S-INOPERATIVE            */ 03041000
*           4  RHRSVD2  BIT(1),          /* Q-RESERVED,S-RESERVE     */ 03042000
*           4  RHPACE   BIT(1),          /* Q-PACING REQUEST,S-PACE  */ 03043000
*        3  RH3    BIT(8),               /* THIRD RH BYTE            */ 03044000
*           4  RHBB     BIT(1),          /* BEGIN SEQUENCE           */ 03045000
*           4  RHEB     BIT(1),          /* END SEQUENCE             */ 03046000
*           4  RHCDIR   BIT(1),          /* CHANGE DIRECTION         */ 03047000
*           4  RHRCDIR  BIT(1),          /* REQUEST CHANGE DIRECTION */ 03048000
*           4  RHRSVD3  BIT(1),          /* RESERVED                 */ 03049000
*           4  RHLOG    BIT(1),          /* LOG                      */ 03050000
*           4  RHRSVD4  BIT(1),          /* RESERVED                 */ 03051000
*           4  RHRSVD5  BIT(1);          /* RESERVED                 */ 03052000
*DCL RHFIRST  BIT(2) CONSTANT('10'B);    /* FIRST IN CHAIN           */ 03053000
*DCL RHMIDLE  BIT(2) CONSTANT('00'B);    /* MIDDLE OF CHAIN          */ 03054000
*DCL RHLAST   BIT(2) CONSTANT('01'B);    /* LAST IN CHAIN            */ 03055000
*DCL RHONLY   BIT(2) CONSTANT('11'B);    /* ONLY ONE IN CHAIN        */ 03056000
*DCL RHRESP   BIT(24) CONSTANT('938000'X); /* RH RESPONSE MASK       */ 03057000
*DCL RHREQ    BIT(24) CONSTANT('030000'X); /* RH REQUEST MASK        */ 03058000
*/* REQUEST RESPONSE UNIT                                            */ 03059000
*/*  REVISIONS                                         009 06/05/75  */ 03060000
*/*                                                                  */ 03061000
*DCL 1 ISTRU BASED BDY(BYTE),      /* BASIC RU STRUCTURE             */ 03062000
*     2 RUDATA CHAR(*);            /* DATA PORTION OF RU             */ 03063000
*/*                                                                  */ 03064000
*/* THIS PORTION DEFINES THE FIELDS WHICH ARE PRESENTED AS SENSE     */ 03065000
*/* INFORMATION FOR THOSE RU'S WHICH CONTAIN SENSE. IT IS THE INITIAL*/ 03066000
*/* PORTION OF THE RU.                                               */ 03067000
*/*                                                                  */ 03068000
*DCL 1 ISTSENRU DEF(RUDATA),       /* SENSE RU INFORMATION           */ 03069000
*     2 SRUSENSE CHAR(4),          /* SENSE DATA WORD                */ 03070000
*      3 SRUSENS1 CHAR(2),         /* SYSTEM SENSE BYTES             */ 03071000
*       4 SRUSNS1  CHAR(1),        /* SENSE DATA MAJOR CODE          */ 03072000
*       4 SRUSNST  CHAR(1),        /* SENSE MODIFIER BYTE            */ 03073000
*      3 SRUSENS2 CHAR(2),         /* REMAINING SENSE BYTES          */ 03074000
*       4 SRUSNS3  CHAR(1),        /* THIRD SENSE BYTE               */ 03075000
*       4 SRUSNS4  CHAR(1),        /* FOURTH SENSE BYTE              */ 03076000
*     2 SENRU CHAR(*);             /* REMAINDER OF RU                */ 03077000
*/*                                                                  */ 03078000
*/* THIS PORTION IS A DUMMY LEVEL 1 DECLARE TO ALLOW FOR EASY        */ 03079000
*/* IMPLEMENTATION. ALL RU DEFINITIONS WHICH FOLLOW ARE DEFINED ON   */ 03080000
*/* ISTRUB. FOR IMPLEMENTATION RESPECIFY ISTRUB BASED(RUDATA) IF NO  */ 03081000
*/* SENSE AND ISTRUB BASED(SENRU) IF SENSE. THIS AVOIDS CONSTANT     */ 03082000
*/* RESPECIFIES FOR EACH RU TYPE.                                    */ 03083000
*/*                                                                  */ 03084000
*DCL 1 ISTRUB BASED,               /* RU BASE FOR COMMON ADDRESSING  */ 03085000
*     2 RUBDATA  CHAR(*);          /* DATA PORTION OF RU             */ 03086000
*/*                                                                  */ 03087000
*/* STANDARD RU                                                      */ 03088000
*/*                                                                  */ 03089000
*DCL 1 ISTSRU DEF(ISTRUB),         /* STANDARD RU                    */ 03090000
*     2 SRUQSREQ CHAR(1),          /* REQUEST RESPONSE CODE          */ 03091000
*     2 SRUDATA,                   /* RU DATA                        */ 03092000
*       3 SRUTYPE  CHAR(1),        /* RU TYPE                        */ 03093000
*         4 SRUSPAC  BIT(2),       /* S TO P ACTION CODE             */ 03094000
*         4 SRUPSAC  BIT(2),       /* P TO S ACTION CODE             */ 03095000
*         4 *        BIT(4),       /* RESERVED                       */ 03096000
*       3 SRULDID  CHAR(8),        /* LOAD ID-ACTPU                  */ 03097000
*         4 SRUSPSN  CHAR(2),      /* SEQUENCE NUMBER STOP           */ 03098000
*           5 SRUDFCLV CHAR(1),    /* DFC LEVEL                      */ 03099000
*         4 SRUPSSN  CHAR(2),      /* SEQUENCE NUMBER PTOS           */ 03100000
*         4 SRURSV01 CHAR(4);      /* RESERVED                       */ 03101000
*/*                                                                  */ 03102000
*/* NETWORK SERVICES RU                                              */ 03103000
*/*                                                                  */ 03104000
*DCL 1 ISTNSRU DEF(ISTRUB),        /* NETWORK SERVICES RU            */ 03105000
*     2 NSRUNETS CHAR(3),          /* FM DATA-NETWORK SERVICES       */ 03106000
*      3 NSRUID   CHAR(1),         /* RU TYPE                        */ 03107000
*      3 NSRUSUB  CHAR(1),         /* NS SUB CATEGORY                */ 03108000
*      3 NSRURCD  CHAR(1),         /* REQUEST CODE                   */ 03109000
*     2 NSRUDATA CHAR(*);          /* RU DATA                        */ 03110000
*DCL NSRUONHK BIT(8) CONSTANT('1B'X); /* READY TO GO ON HOOK REQ CODE*/ 03111000
*DCL  1  NSRUHOOK DEF(NSRUDATA),   /* RTGOH RU                       */ 03112000
*        2 NSRUHKTY CHAR(1);       /* TYPE CODE                      */ 03113000
*/*   CONSTANTS FOR NSRUHKTY                                         */ 03114000
*DCL NSRUHKNR BIT(8) CONSTANT('00'X); /* NORMAL                      */ 03115000
*DCL NSRUHKI  BIT(8) CONSTANT('80'X); /* IMMEDIATE                   */ 03116000
*/*                                                                  */ 03117000
*/*  DEFINATION OF SET STATE VECTOR RU'S                             */ 03118000
*DCL 1 NSSSVRU  DEF(NSRUDATA),                                     0597 03119000
*      2 NSSSVDAF CHAR(2),         /* LINK DAF                       */ 03120000
*      2 NSSSVT   CHAR(1),         /* VECTOR TYPE                    */ 03121000
*      2 NSSSVNOD PTR(8);          /* REMOTE NCP NODE I.D.           */ 03122000
*/*                                                                  */ 03123000
*DCL 1 NSSSVT3  DEF(NSSSVNOD),     /* SET SWITCHED PU PARAMETERS     */ 03124000
*      2 NSSSVT3A CHAR(1),         /* SDLC ADDRESS                   */ 03125000
*      2 NSSSVT3B CHAR(1),         /* PU TYPE                        */ 03126000
*      2 NSSSVT3C CHAR(1),                                         0598 03127000
*        3 NSSSVT3D BIT(1),        /* PU IS 3270                     */ 03128000
*        3 *        BIT(7),        /* RESERVED                       */ 03129000
*      2 NSSSVT3E CHAR(1),         /* MAXOUT                         */ 03130000
*      2 NSSSVT3F CHAR(1),         /* PASSLIM                        */ 03131000
*      2 NSSSVT3G CHAR(1),                                         0598 03132000
*        3 NSSSVT3H BIT(1),        /* IRETRY = YES                   */ 03133000
*        3 *        BIT(7),        /* RESERVED                       */ 03134000
*      2 NSSSVT3I CHAR(1),         /* SECOND LEVEL PAUSE             */ 03135000
*      2 NSSSVT3J CHAR(1),         /* SECOND LEVEL LIMIT             */ 03136000
*      2 NSSSVT3K FIXED(15) BDY(BYTE); /* MAXDATA                    */ 03137000
*/*                                                                  */ 03138000
*DCL 1 NSSSVT4  DEF(NSSSVNOD),     /* SET SWITCHED LU PARAMETERS     */ 03139000
*      2 NSSSVT4A CHAR(1),         /* LOCAL ADDRESS                  */ 03140000
*      2 NSSSVT4B PTR(8),          /* N PACING                       */ 03141000
*      2 NSSSVT4C PTR(8),          /* M PACING                       */ 03142000
*      2 NSSSVT4D CHAR(1);         /* SCHEDULING PARAM               */ 03143000
*DCL NSBATCH BIT(8) CONSTANT('01'X); /* BATCH                        */ 03144000
*DCL NSINTER BIT(8) CONSTANT('02'X); /* INTERACTIVE                  */ 03145000
*/*                                                                  */ 03146000
*DCL 1 NSSSVT5  DEF(NSSSVNOD),                                     0602 03147000
*      2 NSSSVT5A CHAR(2);                                         0602 03148000
*DCL NSDELAY  BIT(8) CONSTANT('05'X);                              0603 03149000
*DCL NS0DELAY BIT(16) CONSTANT('0000'X);                           0604 03150000
*/*                                                                  */ 03151000
*/*  CONSTANTS FOR NSSSVT                                            */ 03152000
*DCL NSTIME BIT(8) CONSTANT('01'X),  /* SET TIME AND DATE            */ 03153000
*    NSNODE BIT(8) CONSTANT('02'X),  /* SET NODE I.D.                */ 03154000
*    NSPU   BIT(8) CONSTANT('03'X),  /* SET PU PARAMS                */ 03155000
*    NSLU   BIT(8) CONSTANT('04'X);  /* SET LU PARAMS                */ 03156000
*/*                                                                  */ 03157000
*/* THIS LEVEL 1 DEFINITION IS A FORM OF THE NSRU WHICH CONTAINS THE */ 03158000
*/* DAF WITHIN THE DATA FIELD. IT IS AN OVERLAY OF NSRUDATA.         */ 03159000
*/*                                                                  */ 03160000
*DCL 1 NSRUDAT1 DEF(NSRUDATA),     /* NSRU WITH DAF                  */ 03161000
*     2 NSRUDAF  CHAR(2),          /* DAF IN RU DATA FIELD           */ 03162000
*     2 NSRUDAT2 CHAR(*);          /* RU DATA                        */ 03163000
*/*                                                                  */ 03164000
*/*   TRACE RU                                                       */ 03165000
*/*                                                                  */ 03166000
*DCL  1  ISTTRRU  DEF(NSRUDAT2),                                   0607 03167000
*        2 TRRTYPE  BIT(8),        /* X'01' RU IS LINE TRACE         */ 03168000
*        2 TRRTIME  BIT(8),        /* TIME OUT VALUE/TIME STAMP      */ 03169000
*        2 TRRPEP   BIT(8),        /* EP SUBCHANNEL ADDRESS          */ 03170000
*        2 TRRSTAT  BIT(8),        /* TRACE STATUS                   */ 03171000
*        2 TRRDATA  CHAR(*);       /* TRACE DATA                     */ 03172000
*/*                                                                  */ 03173000
*/*   CONTACTED RU DATA                                              */ 03174000
*/*                                                                  */ 03175000
*DCL  1  ISTCTDRU DEF(NSRUDAT2),   /* DATA PORTION FOR CONTACTED RU  */ 03176000
*        2 CTDRUSTA BIT(8);        /* STATUS                         */ 03177000
*/*   VALUES FOR STATUS (CTDRUSTA) FIELD                             */ 03178000
*DCL CTDRULD  BIT(8) CONSTANT('01'X),  /* LOADED                     */ 03179000
*    CTDRULDR BIT(8) CONSTANT('02'X),  /* LOAD REQUIRED              */ 03180000
*    CTDRUERR BIT(8) CONSTANT('03'X);  /* ERROR ON CONTACT           */ 03181000
*/*                                                                  */ 03182000
*/*   INOPERATIVE RU DATA                                            */ 03183000
*/*                                                                  */ 03184000
*DCL  1  ISTINORU DEF(NSRUDAT2),   /* DATA PORTION FOR INOPERATIVE RU*/ 03185000
*        2 INORUET  BIT(8);        /* ELEMENT TYPE                   */ 03186000
*/*   VALUES FOR ELEMENT TYPE FIELD (INORUET)                        */ 03187000
*DCL INORUPU  BIT(8) CONSTANT('01'X),  /* PHYSICAL UNIT              */ 03188000
*    INORULNK BIT(8) CONSTANT('02'X),  /* LINK                       */ 03189000
*    INORURNS BIT(8) CONSTANT('FE'X),  /* SOFT FAILURE OF LOCAL RN   */ 03190000
*    INORURNH BIT(8) CONSTANT('FF'X);  /* HARD FAILURE OF LOCAL RN   */ 03191000
*/*                                                                  */ 03192000
*DCL  1  SRUDAT1  DEF(SRUDATA),    /* ACT PHYS OR LOGICAL UNIT REQ.  */ 03193000
*        2 SRUDAT1T CHAR(1),       /* TYPE ACTIVATION DESIRED        */ 03194000
*        2 SRUDAT1L CHAR(1),       /* LEVEL OF CONTROL               */ 03195000
*          3 SRUFMPRO BIT(4),      /* FM PROFILE                     */ 03196000
*          3 SRUTSPRO BIT(4),      /* TS PROFILE                     */ 03197000
*        2 SRUDAT1I CHAR(6);       /* SSCP ID                        */ 03198000
*/*                                                                  */ 03199000
*DCL  1  SRUDAT2 DEF(SRUDATA),     /* ACT PHYS UNIT RESPONSE         */ 03200000
*        2 SRUDAT2T CHAR(1),       /* TYPE ACTIVATION                */ 03201000
*        2 SRUDAT2N CHAR(8);       /* LOAD ID                        */ 03202000
*/*                                                                  */ 03203000
*/*  MAINTENANCE SERVICES RESPONSE UNIT                              */ 03204000
*/*                                                                  */ 03205000
*DCL  1  ISTMRU DEF(ISTRUB),                                       0614 03206000
*        2 MRUPREF  CHAR(2),       /* PREFIX                         */ 03207000
*        2 MRUREQ   CHAR(1),       /* REQUEST = EXECUTE TEST         */ 03208000
*        2 MRUDAF   CHAR(2),       /* NET ADDR OF LINK               */ 03209000
*        2 MRUCMND  CHAR(1),       /* COMMAND                        */ 03210000
*        2 MRUMODIF CHAR(1),       /* MODIFIER                       */ 03211000
*        2 MRURESP  CHAR(2),       /* RESPONSE                       */ 03212000
*        2 MRUDATA  CHAR(*);       /* DATA                           */ 03213000
*/*                                                                  */ 03214000
*/*   CONSTANTS FOR SRUDAT1T AND SRUDAT2T                            */ 03215000
*/*                                                                  */ 03216000
*DCL SRUCOLD  BIT(8) CONSTANT('01'X),  /* COLD ACTIVATION            */ 03217000
*    SRUERP   BIT(8) CONSTANT('02'X),  /* ERP ACTIVATION             */ 03218000
*    SRUWARM  BIT(8) CONSTANT('04'X);  /* WARM ACTIVATION            */ 03219000
*/*   CONSTANTS FOR SRUDAT1L                                         */ 03220000
*DCL SRUFMP0  BIT(4) CONSTANT('0000'B),/* FM PROFILW 0               */ 03221000
*    SRUFMP5  BIT(4) CONSTANT('0101'B),/* FM PROFILE 5               */ 03222000
*    SRUTSP0  BIT(4) CONSTANT('0000'B),/* TS PROFILE 0               */ 03223000
*    SRUTSP1  BIT(4) CONSTANT('0001'B),/* TS PROFILE 1               */ 03224000
*    SRUTSP2  BIT(4) CONSTANT('0010'B),/* TS PROFILE 2               */ 03225000
*    SRUTSP3  BIT(4) CONSTANT('0011'B),/* TS PROFILE 3               */ 03226000
*    SRUTSP4  BIT(4) CONSTANT('0100'B),/* TS PROFILE 4               */ 03227000
*    SRUTSP5  BIT(4) CONSTANT('0101'B);/* TS PROFILE 5               */ 03228000
*/*                                                                  */ 03229000
*/*   TS PROFILE DEFINATIONS:                                        */ 03230000
*/*                                                                  */ 03231000
*/*       TS PROFILE  SEQ. NO.  SDT   STSN  CLEAR  PACING            */ 03232000
*/*           0          N       N      N     N      N               */ 03233000
*/*           1          N       N      N     N      N               */ 03234000
*/*           2          Y       N      N     Y      Y               */ 03235000
*/*           3          Y       Y      N     Y      Y               */ 03236000
*/*           4          Y       Y      Y     Y      Y               */ 03237000
*/*           5          Y       Y      N     N      N               */ 03238000
*/*                                                                  */ 03239000
*DCL  1  SRUDATA3 DEF(SRUDATA),    /* DEACT PHYS UNIT OR UNBND SESSN */ 03240000
*        2 SRUDAT3I CHAR(1);       /* TYPE DEACTIVATION              */ 03241000
*/*                                                                  */ 03242000
*/*   CONSTANTS FOR SRUDAT3I                                         */ 03243000
*/*                                                                  */ 03244000
*DCL SRUFINAL BIT(8) CONSTANT('01'X),  /* FINAL USE                  */ 03245000
*    SRUNOFIN BIT(8) CONSTANT('02'X),  /* NOT FINAL USE              */ 03246000
*    SRUNORM  BIT(8) CONSTANT('01'X),  /* NORMAL END SESSION         */ 03247000
*    SRUBF    BIT(8) CONSTANT('02'X),  /* BIND FAILURE               */ 03248000
*    SRUVS    BIT(8) CONSTANT('04'X);  /* CLEAR SESSION PROCEDURE    */ 03249000
*/*                                                                  */ 03250000
*DCL  1  SRUDATA4 DEF(SRUDATA),    /* SWITCH EP OR NCB RU            */ 03251000
*        2 SRUDAT4D CHAR(2);       /* DAF OF LINE                    */ 03252000
*/*                                                                  */ 03253000
*/*   ADDITIONAL SUBCAT VALUES                                       */ 03254000
*/*                                                                  */ 03255000
*DCL NSRUNCP  BIT(8) CONSTANT('00'X),  /* BASIC SUPPORT              */ 03256000
*    NSRUMAT  BIT(8) CONSTANT('03'X);  /* PHYS MAINTENANCE SERVICES  */ 03257000
*/*                                                                  */ 03258000
*DCL  1  NSRUDAT3 DEF(NSRUDAT2),  /* CONTACTED RESPONSE              */ 03259000
*        2 NSRUDA3S CHAR(1);      /* STATE                           */ 03260000
*/*   CONSTANTS FOR NSRUDA3S                                         */ 03261000
*DCL NSRULOAD BIT(8) CONSTANT('01'X),  /* LOADED                     */ 03262000
*    NSRUNLOD BIT(8) CONSTANT('02'X),  /* LOAD REQUIRED              */ 03263000
*    NSRUCERR BIT(8) CONSTANT('03'X);  /* CONTACT FAILED             */ 03264000
*DCL  1  NSRUDAT4 DEF(NSRUDAT2),  /* IPL TEXT REQUIRED               */ 03265000
*        2 NSRUDA4T CHAR(512);    /* TEXT                            */ 03266000
*DCL  1  NSRUDAT5 DEF(NSRUDAT2),  /* IPL FINAL REQUIRED              */ 03267000
*        2 NSRUDA5E CHAR(4);      /* ENTRY POINT ADDRESS             */ 03268000
*DCL  1  NSRUDAT6 DEF(NSRUDAT2),  /* DUMP TEXT REQUIRED              */ 03269000
*        2 NSRUDA6S CHAR(4),      /* STARTING LOCATION               */ 03270000
*        2 NSRUDA6L CHAR(2);      /* LENGTH                          */ 03271000
*DCL  1  NSRUDAT7 DEF(NSRUDAT2),  /* INOP                            */ 03272000
*        2 NSRUDA7T CHAR(1);      /* ELEMENT TYPE                    */ 03273000
*/*   CONSTANTS FOR NSRUDA7T                                         */ 03274000
*DCL NSRUBOX  BIT(8) CONSTANT('01'X),  /* PHYS UNIT FAILED           */ 03275000
*    NSRULINK BIT(8) CONSTANT('02'X);  /* LINK FAILED                */ 03276000
*/*                                                                  */ 03277000
*/*   DIAL RU                                                        */ 03278000
*DCL  1  NSRUDIL  DEF(NSRUDAT2),                                   0628 03279000
*        2 NSRUDILA CHAR(1),      /* SDLC STATION ADDRESS            */ 03280000
*        2 NSRUDILB CHAR(1),                                       0628 03281000
*          3 *        BIT(1),                                      0628 03282000
*          3 NSRUDILC BIT(1),     /* AUTO OR MANUAL DIAL             */ 03283000
*        2 NSRUDILD PTR(8),       /* REDIAL COUNT                    */ 03284000
*        2 NSRUDILE PTR(8),       /* NUMBER OF DIGITS                */ 03285000
*        2 NSRUDILF CHAR(*);      /* START TELEPHONE NO.             */ 03286000
*/*                                                                  */ 03287000
*/*   ASSIGN FREE NETWORK ADDR RUS                                   */ 03288000
*DCL  1  NSRUNA    DEF(NSRUDAT2),                                  0629 03289000
*        2 NSRUNA1  PTR(8),       /* NUMBER OF ADDRS TO ASSIGN OR FREE* 03290000
*        2 NSRUNA2  CHAR(1),                                       0629 03291000
*          3 NSRUNA3  BIT(1),     /* CONTIGUOUS OR NOT               */ 03292000
*        2 NSRUNA4  CHAR(*);                                       0629 03293000
*DCL  1  NSRUNA5  BASED,                                           0630 03294000
*        2 NSRUNA6  CHAR(2);      /* NETWORK ADDR TO ASSIGN          */ 03295000
*/*                                                                  */ 03296000
*/*   CONSTANTS FOR NSRUNA1                                          */ 03297000
*DCL NSRUFALL BIT(8) CONSTANT('00'X);  /* FREE ALL                   */ 03298000
*/*                                                                  */ 03299000
*/*   CHANGE LINE SCHED PARAM RU                                     */ 03300000
*DCL  1  NSRUCLSP DEF(NSRUDAT2),                                   0632 03301000
*        2 NSRULSV  PTR(8);       /* VALUE OF CHANGED PARAMETER      */ 03302000
*/*                                                                  */ 03303000
*/*   OFFHOOK RU                                                     */ 03304000
*DCL  1  NSRUOH1  DEF(NSRUDAT2),                                   0633 03305000
*        2 NSRUOHID CHAR(6);      /* STATION ID                      */ 03306000
*/*                                                                  */ 03307000
*DCL  1  NSRUDAT8 DEF(NSRUDATA),  /* DUMP INIT & DUMP TEXT RESP      */ 03308000
*        2 NSRUDA8T CHAR(512);    /* DUMP DATA                       */ 03309000
*/*                                                                  */ 03310000
*/* RU CONSTANTS                                                     */ 03311000
*/*                                                                  */ 03312000
*DCL TRRACT   BIT(8) CONSTANT('01'X),      /* LINE TRACE ACTIVE      */ 03313000
*    TRLINE   BIT(8) CONSTANT('01'X),      /* LINETRACE DESIRED      */ 03314000
*    TRLNTIM1 BIT(8) CONSTANT('FF'X),      /* TIME OUT VALUE WHEN    */ 03315000
*                                          /* TRACE ACTIVATED        */ 03316000
*    TRLNTIM2 BIT(8) CONSTANT('00'X),      /* TIME OUT RESET WHEN    */ 03317000
*                                          /* TRACE STOPPED          */ 03318000
*    TRRDEACT BIT(8) CONSTANT('02'X),      /* TRACE TERMINATED BECAUSE  03319000
*                                             OF DEACTIVATE          */ 03320000
*    TRRSLOW  BIT(8) CONSTANT('03'X);      /* TRACE TERMINATED BECAUSE  03321000
*                                             OF SLOWDOWN            */ 03322000
*/*                                                                  */ 03323000
*DCL SRUCONT  BIT(24) CONSTANT('010280'X), /* CONTACTED              */ 03324000
*    SRUINOP  BIT(24) CONSTANT('010281'X), /* INOPERATIVE            */ 03325000
*    SRURLNTR BIT(24) CONSTANT('010383'X); /* RECORD LINE TRACE      */ 03326000
*/*                                                                  */ 03327000
*DCL SRUSSEN  BIT(24) CONSTANT('010214'X), /* SYS SLOWDOWN ENTRY     */ 03328000
*    SRUSSEX  BIT(24) CONSTANT('010215'X), /* SYS SLOWDOWN EXIT      */ 03329000
*    SRUANSTO BIT(8) CONSTANT('02'X),      /* ANS CHAN T.O.          */ 03330000
*    SRUANSPL BIT(8) CONSTANT('01'X),      /* ANS PANEL              */ 03331000
*    SRUANSS  BIT(8) CONSTANT('06'X),      /* ANS START              */ 03332000
*    SRUANSC  BIT(8) CONSTANT('07'X),      /* ANS COMPLETE           */ 03333000
*    SRUSDCOM BIT(8) CONSTANT('C1'X),      /* SHUTDOWN COMPLETE      */ 03334000
*    SRUINITC BIT(8) CONSTANT('50'X),      /* INIT COMPLETE          */ 03335000
*    SRUSWNCP BIT(8) CONSTANT('51'X),      /* SW TO NCP              */ 03336000
*    SRUSWEP  BIT(8) CONSTANT('52'X);      /* SW TO EP               */ 03337000
*/*                                                                  */ 03338000
*DCL SRIGNAC  BIT(2) CONSTANT('00'B),      /* STSN IGNORE ACTION CODE*/ 03339000
*    SRSETAC  BIT(2) CONSTANT('01'B),      /* STSN SET ACTION CODE   */ 03340000
*    SRINVAC  BIT(2) CONSTANT('10'B),      /* STSN INVAL ACTION CODE */ 03341000
*    SRSTSAC  BIT(2) CONSTANT('11'B),      /* STSN SET/TEST ACT. CODE*/ 03342000
*    SRRQRAC  BIT(2) CONSTANT('00'B),      /* STSN REQ RESET ACT CODE*/ 03343000
*    SRTSPAC  BIT(2) CONSTANT('01'B),      /* STSN TEST POS. ACT CODE*/ 03344000
*    SRTSNAC  BIT(2) CONSTANT('11'B);      /* STSN TEST NEG. ACT CODE*/ 03345000
*/*                                                                  */ 03346000
*DCL SRDFCL1  BIT(8) CONSTANT('01'X),      /* DATA FLOW CONTROL LEV-1*/ 03347000
*    SRDFCL2  BIT(8) CONSTANT('02'X),      /* DATA FLOW CONTROL LEV-2*/ 03348000
*    SRDFCL3  BIT(8) CONSTANT('03'X),      /* DATA FLOW CONTROL LEV-3*/ 03349000
*    SRDFCL4  BIT(8) CONSTANT('04'X);      /* DATA FLOW CONTROL LEV-4*/ 03350000
*/*                                                                  */ 03351000
*DCL SRNETSRV  BIT(8) CONSTANT('01'X),  /* NETWORK SERVICES          */ 03352000
*    SRPHYMS  BIT(8) CONSTANT('03'X),   /* PHYSICAL MAINTENANCE      */ 03353000
*    SRACTPU  BIT(8) CONSTANT('11'X),   /* ACTIVATE PHYSICAL UNIT    */ 03354000
*    SRDACTPU BIT(8) CONSTANT('12'X),   /* DEACTIVATE PHYSICAL UNIT  */ 03355000
*    SRACTLU  BIT(8) CONSTANT('0D'X),   /* ACTIVATE LOGICAL UNIT     */ 03356000
*    SRDACTLU BIT(8) CONSTANT('0E'X),   /* DEACTIVATE LOGICAL UNIT   */ 03357000
*    SRBIND   BIT(8) CONSTANT('31'X),   /* BIND SESSION              */ 03358000
*    SRUNBIND BIT(8) CONSTANT('32'X),   /* UNBIND SESSION            */ 03359000
*    SRRMSTAT BIT(8) CONSTANT('81'X),   /* RMS REQUEST CODE          */ 03360000
*    SRSDT    BIT(8) CONSTANT('A0'X),   /* START DATA TRAFFIC        */ 03361000
*    SRCLEAR  BIT(8) CONSTANT('A1'X),   /* CLEAR                     */ 03362000
*    SRSTSN   BIT(8) CONSTANT('A2'X);   /* SET AND TEST SEQ NUMBER   */ 03363000
*/*                                                                  */ 03364000
*DCL SRESYSS  BIT(8) CONSTANT('00'X),  /* TO BE DEFINED LATER        */ 03365000
*    SRLSYSS  BIT(8) CONSTANT('00'X),  /* TO BE DEFINED LATER        */ 03366000
*    SRMDR    BIT(8) CONSTANT('00'X),  /* TO BE DEFINED LATER        */ 03367000
*    SRANSOP  BIT(8) CONSTANT('00'X),  /* TO BE DEFINED LATER        */ 03368000
*    SRANSCT  BIT(8) CONSTANT('00'X),  /* TO BE DEFINED LATER        */ 03369000
*    SRCAPM   BIT(8) CONSTANT('00'X);  /* TO BE DEFINED LATER        */ 03370000
*/*      FORMATTED SYSTEM SERVICES TYPE                              */ 03371000
*DCL  NSRUNS  BIT(8) CONSTANT('01'X);  /* NETWORK SERVICES INDICATOR */ 03372000
*/*      NS SUBCATEGORY VALUES FOR NETWORK SERVICES                  */ 03373000
*DCL                                                               0643 03374000
*     NSRUPCS BIT(8) CONSTANT('02'X),  /* PHYSICAL CONFIG. SERVICES  */ 03375000
*     NSRUDSS BIT(8) CONSTANT('06'X);  /* DATA/SESSION SERVICES      */ 03376000
*/*      REQUEST CODE VALUES FOR PHYSICAL CONFIGURATION SERVICES     */ 03377000
*DCL                                                               0644 03378000
*     NSRUCT  BIT(8) CONSTANT('01'X),  /* CONTACT                    */ 03379000
*     NSRUCTD BIT(8) CONSTANT('80'X),  /* CONTACTED                  */ 03380000
*     NSRUDSCT BIT(8) CONSTANT('02'X), /* DISCONTACT                 */ 03381000
*     NSRUIPLI BIT(8) CONSTANT('03'X), /* IPL INITIAL                */ 03382000
*     NSRUIPLT BIT(8) CONSTANT('04'X), /* IPL TEXT                   */ 03383000
*     NSRUIPLF BIT(8) CONSTANT('05'X), /* IPL FINAL                  */ 03384000
*     NSRUDMPI BIT(8) CONSTANT('06'X), /* DUMP INITIAL               */ 03385000
*     NSRUDMP  BIT(8) CONSTANT('07'X), /* DUMP                       */ 03386000
*     NSRUDMPF BIT(8) CONSTANT('08'X), /* DUMP FINAL                 */ 03387000
*     NSRUACTL BIT(8) CONSTANT('0A'X), /* ACTIVATE LINK              */ 03388000
*     NSRUDCTL BIT(8) CONSTANT('0B'X), /* DEACTIVATE LINK            */ 03389000
*     NSRURPO  BIT(8) CONSTANT('09'X), /* REMOTE POWER OFF           */ 03390000
*     NSRUSSV  BIT(8) CONSTANT('11'X), /* SET STATE VECTOR           */ 03391000
*     NSRUANS  BIT(8) CONSTANT('16'X), /* ENABLE ANSWER              */ 03392000
*     NSRUAANS BIT(8) CONSTANT('17'X), /* ABANDON ANSWER             */ 03393000
*     NSRUDIAL BIT(8) CONSTANT('0E'X), /* DIAL                       */ 03394000
*     NSRUADIL BIT(8) CONSTANT('18'X), /* ABANDON DIAL               */ 03395000
*     NSRUACON BIT(8) CONSTANT('0F'X), /* ABANDON CONNECTION         */ 03396000
*     NSRUANA  BIT(8) CONSTANT('19'X), /* ASSIGN NET ADDRESS         */ 03397000
*     NSRUFNA  BIT(8) CONSTANT('1A'X), /* FREE NET ADDRESS           */ 03398000
*     NSRUOH   BIT(8) CONSTANT('84'X), /* OFF HOOK                   */ 03399000
*     NSRUINOP BIT(8) CONSTANT('81'X); /* INOPERATIVE                */ 03400000
*/*   REQUEST CODE VALUES FOR MAINTENANCE SERVICES                   */ 03401000
*DCL  NSRUATRC BIT(8) CONSTANT('02'X), /* ACTIVATE TRACE             */ 03402000
*     NSRUDTRC BIT(8) CONSTANT('03'X); /* DEACTIVATE TRACE           */ 03403000
*/*   REQUEST CODE VALUES FOR PRE-SNA SERVICES                       */ 03404000
*DCL  NSRUCTXL BIT(8) CONSTANT('01'X), /* CHANGE TRANS LIMIT         */ 03405000
*     NSRUCNPL BIT(8) CONSTANT('02'X), /* CHANGE NEGATIVE POLL       */ 03406000
*     NSRUCSL  BIT(8) CONSTANT('03'X), /* CHANGE SESSION LIMIT       */ 03407000
*     NSRUCPL  BIT(8) CONSTANT('04'X); /* CHANGE POLL                */ 03408000
*/*      REQUEST CODE VALUES FOR DATA/SESSION SERVICES               */ 03409000
*DCL                                                               0647 03410000
*     NSRUINSF BIT(8) CONSTANT('81'X), /* INITATE-SELF               */ 03411000
*     NSRUTMSF BIT(8) CONSTANT('83'X), /* TERMINATE-SELF             */ 03412000
*     NSRUNSPE BIT(8) CONSTANT('04'X); /* NS PROCEDURE ERROR         */ 03413000
*/*  UNBIND RU---THIS STRUCTURE IS AN OVERLAY FOR SRUDATA            */ 03414000
*DCL  1  ISTUNBRU DEF(SRUTYPE),    /* UNBIND MINUS OPCODE            */ 03415000
*        2 UNBTYPE  CHAR(1);       /* TYPE OF UNBIND                 */ 03416000
*                                                                  0648 03417000
*                                                                  0648 03418000
*DCL SRRQR  BIT(8) CONSTANT('A3'X);    /* ELEMENT RECOVERY          */  03419000
*DCL SRUSTERR BIT(32) CONSTANT('20000000'X); /* STATE ERROR MASK     */ 03420000
*DCL SRURRERR BIT(32) CONSTANT('08000000'X); /* REQUEST REJECT MASK  */ 03421000
*DCL SRUFIERR BIT(32) CONSTANT('10000020'X); /* FUNCTION INTERP MASK */ 03422000
*DCL SRUFISEN BIT(16) CONSTANT('1000'X);     /* FUNCTION INTERP SENSE*/ 03423000
*DCL SRUPESEN BIT(16) CONSTANT('8000'X);     /* PATH ERROR SENSE     */ 03424000
*DCL SRUOPCHK BIT(32) CONSTANT('00000001'X); /* OPERATION CHK SENSE  */ 03425000
*DCL SRUPESNS BIT(32) CONSTANT('80000000'X); /* PATH ERROR SENSE     */ 03426000
*DCL SRSIGNAL BIT(8) CONSTANT('C9'X);                              0657 03427000
*DCL SRUSRBID BIT(8) CONSTANT('C8'X);                              0658 03428000
*DCL SRLUS    BIT(8) CONSTANT('04'X);                              0659 03429000
*DCL SRRTR    BIT(8) CONSTANT('05'X);                              0660 03430000
*DCL SRRSHUTD BIT(8) CONSTANT('C2'X);                              0661 03431000
*/*                                                                  */ 03432000
*DCL SRUPE    BIT(8) CONSTANT('80'X),     /* PATH ERROR              */ 03433000
*    SRUCPME  BIT(8) CONSTANT('40'X),     /* CPM ERROR               */ 03434000
*    SRUSTATE BIT(8) CONSTANT('20'X),     /* STATE ERROR             */ 03435000
*    SRUFIE   BIT(8) CONSTANT('10'X),     /* FUNCTION INTERPRETER ERR*/ 03436000
*    SRURRE   BIT(8) CONSTANT('08'X),     /* REQUEST REJECT          */ 03437000
*    SRUZERO  BIT(8) CONSTANT('00'X);                              0662 03438000
*/*  PATH ERRORS                                                     */ 03439000
*DCL SRUINF   BIT(8) CONSTANT('01'X),     /* INTERMED. NODE FAILURE  */ 03440000
*    SRULF    BIT(8) CONSTANT('02'X),     /* LINK FAILURE            */ 03441000
*    SRULUI   BIT(8) CONSTANT('03'X),     /* LU INOPERATIVE          */ 03442000
*    SRUNODAF BIT(8) CONSTANT('04'X),     /* NO DAF                  */ 03443000
*    SRUNOSES BIT(8) CONSTANT('05'X),     /* NO SESSION              */ 03444000
*    SRUFID   BIT(8) CONSTANT('06'X),     /* FID                     */ 03445000
*    SRUMPF   BIT(8) CONSTANT('07'X),     /* MPF                     */ 03446000
*    SRUPRI   BIT(8) CONSTANT('08'X),     /* PRIORITY                */ 03447000
*    SRUSEC   BIT(8) CONSTANT('09'X),     /* SECURITY                */ 03448000
*    SRUCODE  BIT(8) CONSTANT('0A'X),     /* CODE                    */ 03449000
*    SRUINTH  BIT(8) CONSTANT('0B'X);     /* INCOMPLETE TH           */ 03450000
*/*  CPM ERRORS                                                      */ 03451000
*DCL SRUPENS  BIT(8) CONSTANT('01'X),     /* PE NOT SUPPORTED        */ 03452000
*    SRURRNNS BIT(8) CONSTANT('02'X),     /* RRN NOT SUPPORTED       */ 03453000
*    SRURNS   BIT(8) CONSTANT('03'X),     /* RETRY NOT SUPPORTED     */ 03454000
*    SRULNS   BIT(8) CONSTANT('04'X),     /* LOG NOT SUPPORTED       */ 03455000
*    SRUINRH  BIT(8) CONSTANT('05'X);     /* INCOMPLETE RH           */ 03456000
*/*  STATE ERRORS                                                    */ 03457000
*DCL SRUSEQNR BIT(8) CONSTANT('01'X),     /* SEQUENCE NUMBER         */ 03458000
*    SRUCHAIN BIT(8) CONSTANT('02'X),     /* CHAINING                */ 03459000
*    SRUBRCAT BIT(8) CONSTANT('03'X),     /* BRACKET ( CATASTROPHIC )*/ 03460000
*    SRUCHDIR BIT(8) CONSTANT('04'X);     /* CHANGE DIRECTION        */ 03461000
*/*  FUNCTION INTERPRETER ERRORS                                     */ 03462000
*DCL SRURUDE  BIT(8) CONSTANT('01'X),     /* RU DATA ERROR           */ 03463000
*    SRURUSE  BIT(8) CONSTANT('02'X),     /* RU STRUCTURE ERROR      */ 03464000
*    SRUFUNC  BIT(8) CONSTANT('03'X),     /* FUNCTION UNKNOWN        */ 03465000
*    SRUFNS   BIT(8) CONSTANT('04'X),     /* FUNCTION NOT SUPPORTED  */ 03466000
*    SRUHFE   BIT(8) CONSTANT('05'X),     /* HORIZONTAL FORMAT ERROR */ 03467000
*    SRUVFE   BIT(8) CONSTANT('06'X);     /* VERTICAL FORMAT ERROE   */ 03468000
*/*  REQUEST REJECT ERRORS                                           */ 03469000
*DCL SRURNA   BIT(8) CONSTANT('01'X),     /* RESOURCE NOT AVAILABLE  */ 03470000
*    SRUINREQ BIT(8) CONSTANT('02'X),     /* INTERVENTION REQUIRED   */ 03471000
*    SRUMCW   BIT(8) CONSTANT('03'X),     /* MISSING CODEWORD        */ 03472000
*    SRUINCW  BIT(8) CONSTANT('04'X),     /* INVALID CODEWORD        */ 03473000
*    SRUSLE   BIT(8) CONSTANT('05'X),     /* SESSION LIMIT EXCEEDED  */ 03474000
*    SRULUU   BIT(8) CONSTANT('06'X),     /* LU UNKNOWN              */ 03475000
*    SRULUIN  BIT(8) CONSTANT('07'X),     /* LU INACTIVE             */ 03476000
*    SRULURS  BIT(8) CONSTANT('08'X),     /* LU RESERVED             */ 03477000
*    SRUMI    BIT(8) CONSTANT('09'X),     /* MODE INCOSISTENCY       */ 03478000
*    SRUPR    BIT(8) CONSTANT('0A'X),     /* PERMISSION REJECTED     */ 03479000
*    SRUFD    BIT(8) CONSTANT('16'X),     /* FUNCTION DISABLED       */ 03480000
*    SRUFUNS  BIT(8) CONSTANT('0C'X),     /* FUNCTION NOT SUPPORTED  */ 03481000
*    SRUQUED  BIT(8) CONSTANT('0D'X),     /* QUEUED                  */ 03482000
*    SRULUNA  BIT(8) CONSTANT('0E'X),     /* LU NOT AUTHORIZED       */ 03483000
*    SRUEUMNA BIT(8) CONSTANT('0F'X),     /* EUM NOT AUTHORIZED      */ 03484000
*    SRUMRID  BIT(8) CONSTANT('10'X),     /* MISSING REQUESTOR ID    */ 03485000
*    SRUBREAK BIT(8) CONSTANT('11'X),     /* BREAK                   */ 03486000
*    SRUISR   BIT(8) CONSTANT('12'X),     /* INSUFFICIENT SYS RESRCE */ 03487000
*    SRUBRE   BIT(8) CONSTANT('13'X);     /* BRACKET RACE ERROR      */ 03488000
*/*  FOUR BYTE EQUATES FOR SRUSENSE                                  */ 03489000
*DCL SRUSEQNQ BIT(32) CONSTANT('20010000'X); /* SEQUENCE NUMBER ERR. */ 03490000
*/* PROCESS ANCHOR BLOCK                                              * 03491000
*/*  INITIAL LEVEL                                     001 01/16/75  */ 03492000
*DCL  1  ISTPAB BDY(DWORD) BASED,                                  0669 03493000
*       2  PABWQCHN CHAR(8) BDY(DWORD), /* CPS SWAP FIELD FOR NEQ&CHN * 03494000
*        3  PABWEQA PTR(31) BDY(WORD), /* WORK ELEMENT QUEUE ADDRESS  * 03495000
*           4  PABWEQG BIT(1),         /* GATING BIT                  * 03496000
*           4  PABRSV01 BIT(7),        /* RESERVED                    * 03497000
*           4  PABWEQP PTR(24),        /* WKEL PTR                    * 03498000
*        3  PABCHAIN PTR(31) BDY(WORD), /* APS CHAIN                  * 03499000
*           4  PABCHNG BIT(1),         /* GATING BIT                  * 03500000
*           4  PABRESCH BIT(1),        /* RESCHEDULE PAB AT        0669 03501000
*                                         TPEXIT                      * 03502000
*           4  PABCDP BIT(1),          /* CLOSE DST/CHANGE IN PROGRESS* 03503000
*           4  PABUNCON BIT(1),        /* UNCONDITIONALLY RESCHEDULE    03504000
*                                         PAB AT TPEXIT               * 03505000
*           4  PABRESET BIT(1),        /* RESET ISSUED ON THIS PAB    * 03506000
*           4  PABRUNNG BIT(1),        /* PAB RUNNING                 * 03507000
*           4  PABRSV02 BIT(2),        /* RESERVED                    * 03508000
*           4  PABCHNGP PTR(24),       /* PSS CHAIN PTR               * 03509000
*        2  PABOFFST PTR(8),           /* OFFSET FROM CONTROL BLOCK   * 03510000
*        2  PABDVTA PTR(24),           /* DVT ADDRESS                 * 03511000
*        2  PABRPHFG PTR(31),          /* SCHED FLAGS AND RPH         * 03512000
*           3  PABFLAGS BIT(8),        /* SCHEDULING FLAGS            * 03513000
*              4  PABAPYP BIT(1),      /* APPLICATION IS A USER EXIT  * 03514000
*              4  PABPRIOR BIT(1),     /* IMMEDIATE PRIORITY          * 03515000
*              4  PABNORPR BIT(1),     /* NORMAL PRIORITY -           * 03516000
*                                      /* RESCHEDUALABLE              * 03517000
*              4  PABDYNAM BIT(1),     /* DYNAMIC                     * 03518000
*              4  PABSSN BIT(1),       /* SYSTEM SERVICES             * 03519000
*              4  PABERLCK BIT(1),     /* PAB ERROR LOCK FLAG         * 03520000
*                 5  PABERRLK BIT(1),  /* ERROR LOCK                  * 03521000
*                    6  PABERLOK BIT(1), /* ERROR LOCK                * 03522000
*/*    ABNORMAL TO ALLOW VARY COMPARE AND SWAP                        * 03523000
*              4  PABINHBT BIT(1) ABNL,/* 1=INHIBIT TRAFFIC,0=NO      * 03524000
*              4  PABNODQ BIT(1),      /* DO NOT DEQ WORK ELEMENT     * 03525000
*           3  PABRPHA PTR(24);        /* RPL HEADER ADDRESS          * 03526000
*DCL PABWEQG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABWEQG OFF     * 03527000
*    PABWEQG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABWEQG ON      * 03528000
*    PABCHNG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABCHNG OFF     * 03529000
*    PABCHNG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABCHNG ON      * 03530000
*    PABRESC0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PABRESCH OFF    * 03531000
*    PABRESC1 BIT(32) CONSTANT('40000000'X),  /* TURN PABRESCH ON     * 03532000
*    PABCDP0  BIT(32) CONSTANT ('DFFFFFFF'X), /* TURN PABCDP OFF      * 03533000
*    PABCDP1  BIT(32) CONSTANT ('20000000'X), /* TURN PABCDP ON       * 03534000
*    PABERLK0 BIT(32) CONSTANT('FBFFFFFF'X),  /* TURN PABERRLK ON     * 03535000
*    PABERLK1 BIT(32) CONSTANT('04000000'X),  /* TURN PABERRLK OFF    * 03536000
*    PABUNCO0 BIT(32) CONSTANT('EFFFFFFF'X),  /* TURN PABUNCON OFF    * 03537000
*    PABUNCO1 BIT(32) CONSTANT('10000000'X),  /* TURN PABUNCON ON     * 03538000
*    PABPRIR0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PAB PRIOR OFF   * 03539000
*    PABPRIR1 BIT(32) CONSTANT('40000000'X),  /* TURN PAB PRIOR ON    * 03540000
*    PABRST0  BIT(32) CONSTANT('F7FFFFFF'X),  /* TURN PABRESET OFF    * 03541000
*    PABRST1  BIT(32) CONSTANT('08000000'X);  /* TURN PABRESET ON     * 03542000
*              /* DYNAMIC PAB 1K633 */                             0671 03543000
* /* 1K0997 JAN 20, 1973  MB   */                                  0671 03544000
* /* 1K1142 MAR 03, 1973  MB   */                                  0671 03545000
* DCL 1 ISTDYPAB BDY(DWORD) BASED, /* LEVEL 1 DECLARE 1K633 */     0671 03546000
*       2  DYPTYPE CHAR(1), /* CONTROL BLOCK TYPE CODE 1K633 */    0671 03547000
*       2  DYPLNGTH PTR(8), /* CONTROL BLOCK LENGTH (BYTES)  1K633 */   03548000
*       2 DYPFLGS CHAR(2),     /* FLAGS 1K633 */                   0671 03549000
*       2 DYPCHAIN PTR(31),    /* CHAIN POINTER 1K633 */           0671 03550000
*       2 DYPTSKID PTR(31),    /* TASKID OR PTR TO PSS TABLES 1K633 */  03551000
*       2  DYPRSV01 PTR(31),   /* RESERVED TO PRESERVE ALIGNMENT   0671 03552000
*                                                             1K0997 */ 03553000
*       2 DYPPAB CHAR(LENGTH(ISTPAB)) BDY(DWORD); /* LENGTH OF 1K0997   03554000
*                                                    PAB         */     03555000
*DCL DYTYP   BIT(8) CONSTANT ('11'X);   /* TYPE           1K1142 */     03556000
*/*  REVISIONS                                         014 10/14/75   * 03557000
*DCL ATCLCPTR PTR LOCATION(1032);      /* POINTER TO ATCVT            * 03558000
*DCL  1  ISTATCVT BDY(DWORD) BASED,                                0674 03559000
*        2  ATCCOM BDY(WORD),          /* SYSTEM INDEPENDENT FIELDS   * 03560000
*           3  ATCSTAT CHAR(4),        /* VTAM  STATUS INDICATORS     * 03561000
*              4  ATCSTAT1 CHAR(1),    /* VTAM  STATUS BYTE 1         * 03562000
*                 5  ATCSTART BIT(1),  /* VTAM  IS STARTING           * 03563000
*                 5  ATCACTIV BIT(1),  /* VTAM  IS ACTIVE             * 03564000
*                 5  ATCSNHLT BIT(1),  /* VTAM  SESSION HALT          * 03565000
*                 5  ATCQKHLT BIT(1),  /* VTAM  QUICK HALT            * 03566000
*                 5  ATCNETSL BIT(1),  /* NETSOL=YES SPECIFIED ON CMD * 03567000
*                 5  ATCINHLT BIT(1),  /* INTERNAL VTAM HALT QUICK    * 03568000
*                 5  ATCMDHLT BIT(1),  /* VTAM CMD PROC HALTED        * 03569000
*                 5 * BIT(1),          /* RESERVED                    * 03570000
*              4  ATCSTFLG BIT(8),     /* STORAGE MANAGEMENT FLAGS    * 03571000
*                 5  ATCHSDMF BIT(1),  /* SYSTEM SLOW DOWN FLAG       * 03572000
*              4  ATCPOFLG BIT(8),     /* PROGRAM OPERATOR            * 03573000
*                                      /* INTERFACE FLAGS             * 03574000
*                 5 ATCPOUNS BIT(1),   /* APPLICATION AUTHORIZED TO   * 03575000
*                                      /* RECEIVE UNSOLICITED MESSAGES* 03576000
*                                      /* 1 = YES                     * 03577000
*                 5 *        BIT(7),   /* RESERVED                    * 03578000
*              4  ATCSTAT4 CHAR(1),    /* VTAM  STATUS BYTE 4         * 03579000
*                 5  ATCPRTAT BIT(1),  /* 1 = TRACE PRINT ACTIVE,  0674 03580000
*                                         0 = NOT ACTIVE              * 03581000
*                 5  ATCTPRT BIT(1),   /* WHEN 1, TPRINT IN PROCESS   * 03582000
*                 5  ATCMTST BIT(1),   /* WHEN 1, MODIFY TEST IN   0674 03583000
*                                         PROCESS                     * 03584000
*                 5  ATCNCSD BIT(1),   /* NCS QUIESCED DURING HALT    * 03585000
*                 5  ATCVTTRC BIT(1),  /* VTAM TRACE, 1=ACTIVE        * 03586000
*                 5  ATCRSV04 BIT(3),  /* RESERVED                    * 03587000
*           3  ATCAPI PTR(31),         /* ADDR OF API ROUTINE         * 03588000
*           3  ATCDCFRR PTR(31),       /* POINTER TO FRR OF CONTROL     03589000
*                                         LAYER,INITIALIZED BY OPENDST* 03590000
*           3  ATCRDT PTR(31),         /* POINTER TO FIRST RDT        * 03591000
*           3  ATCSRT PTR(31),         /* POINTER TO SRT DIRECTORY    * 03592000
*           3  ATCASCHD PTR(31),       /* POINTER TO AP SCHEDULER     * 03593000
*           3  ATCECMOD CHAR(4),       /* ECB FOR MODIFY COMMAND PROC.* 03594000
*           3  ATCMODQ PTR(31),        /* POINTER FOR OUTPUT QUEUE    * 03595000
*                                      /* FOR MODIFY COMMAND          * 03596000
*           3  ATCECHLT CHAR(4),       /* ECB FOR HALT COMMAND        * 03597000
*           3  ATCHALTQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 03598000
*                                      /* FOR HALT COMMAND            * 03599000
*           3  ATCECVRY CHAR(4),       /* ECB FOR VARY COMMAND PROC.  * 03600000
*           3  ATCVARYQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 03601000
*                                      /* FOR VARY COMMAND            * 03602000
*           3  ATCECDSP CHAR(4),       /* ECB FOR DISPLAY COMMAND     * 03603000
*           3  ATCDSPLQ PTR(31),       /*  POINTER TO OUTPUT QUEUE    * 03604000
*                                      /* FOR DISPLAY COMMAND         * 03605000
*           3  ATCOCHA PTR(31),        /* POINTER TO OCT HEADER       * 03606000
*           3  ATCECSES CHAR(4),       /* ECB TO HALT SESSION MODE    * 03607000
*           3  ATCECVRQ CHAR(4),       /* ERP ECB FOR VARY REQ. INFO. * 03608000
*                                      /* REQUEST NOTIFICATION        * 03609000
*           3  ATCVPARM PTR(31),       /* ADDR OF VARY PARAMETERS     * 03610000
*           3  ATCECOPC CHAR(4),       /* ECB TOINDICATE OPERATOR     * 03611000
*                                      /* CONTROL PROCESSING COMPLETE * 03612000
*           3  ATCECNET CHAR(4),       /* ERP ECB FOR NETWORK         * 03613000
*                                      /* CONFIGURATION REQUEST       * 03614000
*           3  ATCECPRM PTR(31),       /* POINTER TO QAB FOR ERP'S    * 03615000
*                                      /* ECB PARAMETERS              * 03616000
*           3  ATCHLTMS PTR(31),       /* POINTER TO HALT COMMAND     * 03617000
*                                      /* OR HALT RETURN MESSAGE      * 03618000
*           3  ATCFSB PTR(31),         /* PTR TO FEEDBACK STATUS      * 03619000
*                                      /* BLOCK                       * 03620000
*           3  ATCFRSCH PTR(31),       /* POINTER TO FEEDBACK         * 03621000
*                                      /* ROUTINE SCHEDULER           * 03622000
*           3  ATCRDTH PTR(31),        /*  POINTER RDT HEADER         * 03623000
*           3  ATCACCTA PTR(31),       /* POINTER TO INSTALLATION     * 03624000
*                                      /* ACCOUNTING ROUTINE          * 03625000
*           3  ATCAUTHA PTR(31),       /* POINTER TO INSTALLATION     * 03626000
*                                      /* AUTHORISATION ROUTINE       * 03627000
*           3  ATCPTCHA PTR(31),       /* PTR TO VTAM PATCH AREA      * 03628000
*           3  ATCCONFT PTR(31),       /* POINTER TO VTAM             * 03629000
*                                      /* CONFIGURATION TABLE         * 03630000
*           3  ATCFDVT PTR(31),        /* PTR TO FIRST DVT FOR O/C    * 03631000
*           3  ATCFEPT PTR(31),        /* PTR TO FIRST EPT FOR O/C    * 03632000
*           3  ATCDVTPT PTR(31),       /* ADDR OF LOAD MOD FOR        * 03633000
*                                      /* TYPE=VTAM TRACING           * 03634000
*           3  ATCBPDA PTR(31),        /* PTR TO BUFFER POOL DIRECTORY* 03635000
*           3  ATCADD PTR(31),         /* POINTER TO ADD PROCEDURE    * 03636000
*           3  ATCREMOV PTR(31),       /* POINTER TO REMOVE PROCEDURE * 03637000
*           3  ATCIOTRC PTR(31),       /*  POINTER TO I/O TRACE       * 03638000
*                                      /* PROCEDURE                   * 03639000
*              4 ATCTHTRC PTR(31),     /* ADDR OF TH TRACE ROUTINE    * 03640000
*                5 ATCTPBUF PTR(31),   /* TPIOS BUFFER TRACE(ISTRARTP)* 03641000
*           3  ATCBFTRC PTR(31),       /* PTR TO BUFFER TRACE         * 03642000
*                                      /* PROCEDURE                   * 03643000
*           3  ATCFBRPH PTR(31),       /* ADDR OF FEEDBACK PROC RPH   * 03644000
*           3  ATCBLDLA PTR(31),       /* ADDR OF BLDL ROUTINE        * 03645000
*           3  ATCALOAD PTR(31),       /* ADDR OF ALOAD ROUTINE       * 03646000
*           3  ATCREADA PTR(31),       /* ADDR OF SOURCE READ ROUTINE * 03647000
*           3  ATCGTSTR PTR(31),       /* ADDR OF GETSTOR ROUTINE     * 03648000
*           3  ATCFRSTR PTR(31),       /* ADDR OF FREESTOR ROUTINE    * 03649000
*           3  ATCSTMA PTR(31),        /* ADDR OF SM INITIALIZATION   * 03650000
*                                      /* ROUTINE                     * 03651000
*           3  ATCACDA PTR(31),        /* ADDR OF FIRST ACDEB         * 03652000
*           3  ATCSMRQ PTR(31),        /* ADDR OF REQUEST STORAGE     * 03653000
*                                      /* ROUTINE                     * 03654000
*           3  ATCSMQU PTR(31),        /* ADDR OF QUEUE REQUEST RTNE    03655000
*                                         - DOS ONLY                  * 03656000
*           3  ATCSMRS PTR(31),        /* ADDR OF RELEASE STORAGE     * 03657000
*                                      /* ROUTINE                     * 03658000
*           3  ATCSMRC PTR(31),        /* ADDR OF RECOVER STORAGE     * 03659000
*                                      /* ROUTINE  - DOS ONLY         * 03660000
*           3  ATCSMBQ PTR(31),        /* PTR TO Q'ED REQ. SMS RTN.   * 03661000
*           3  ATCFIRA PTR(31),        /* ADDR OF FEEDBACK INITIATION * 03662000
*                                      /* RPH                         * 03663000
*           3  ATCSRTAD PTR(31),       /* PTR TO SRTADD ROUTINE       * 03664000
*           3  ATCSRTDF PTR(31),       /* PTR TO SRTDELE ROUTN        * 03665000
*           3  ATCDCC60 PTR(31),       /* PTR TO ISTDCC60 - CTL. LAYER  03666000
*                                         MOVE TO USER AREA           * 03667000
*           3  ATCDCC61 PTR(31),       /* PTR TO ISTDCC61 - CTL. LAYER  03668000
*                                         MOVE FIXED TO PAGABLE       * 03669000
*/*  BEGIN 'ANY' DVT                                                  * 03670000
*           3  ATCNERST PTR(31),       /* PTR TO ISTDCC00 - REQUEST-ST* 03671000
*           3  ATCNERCV PTR(31),       /* PTR TO ISTRCC21-RECEIVE OB  * 03672000
*           3  ATCNERNE PTR(31),      /* PTR TO ISTDCC25 - READ-ANY   * 03673000
*           3  ATCNERFN PTR(31),      /* PTR TO ISTDCC02 - REQUEST-FN * 03674000
*/*  END 'ANY' DVT                                                    * 03675000
*           3  ATCAPOST PTR(31),      /* PTR TO VTAM  POST ROUTINE    * 03676000
*           3  ATCVTMID CHAR(2),      /* HOST MAJOR NODE I.D.         * 03677000
*           3  ATCRSV11 CHAR(2),      /* RESERVED                     * 03678000
*           3 ATCRCC63 PTR(31),  /* HSKPANYQ POINTER                  * 03679000
*           3 ATCRCC26 PTR(31),  /* SEND RESPONSE POINTER             * 03680000
*           3 ATCRCC65 PTR(31),  /* SET RPL POINTER                   * 03681000
*           3  ATCNESAL PTR(31),      /* PTR TO ISTDCC24 - SOLICIT-ALL* 03682000
*           3  ATCNERAP PTR(31),       /* PTR TO ISTDCC85 - READ ANY    03683000
*                                         PURGE                       * 03684000
*           3 ATCACTRM FIXED(15),     /* COUNT OF ACTIVE TERMINALS    * 03685000
*           3 ATCCIDM BIT(16),        /* CID MASK                     * 03686000
*           3 ATCMSGSP BIT(8), /* RESERVED FOR MESAGE SURPRESSION     * 03687000
*         2 ATCMAXID PTR(8),   /* MAXIMUM NUMBER OF MAJOR NODES, 0 =    03688000
*                                 NUMBER OF ENTRIES IN THE MNT        * 03689000
*         2 ATCRSV16 CHAR(2),  /* NOT USED                            * 03690000
*         2 ATCMNT PTR(31),    /*PTR TO MAJOR NODE TABLE -SET BY SYS.   03691000
*                                DEF. REF. BY ISTSDCCB (CBDEF),    0674 03692000
*                                ISTSDCCI (CINDEXY)                   * 03693000
*         2 ATCCDADD PTR(31),  /*PTR TO CIDADD ROUTINE ISTSDCCA    0674 03694000
*                                 REF. BY CIDCTL MACRO                * 03695000
*         2 ATCCDDEL PTR(31),  /*PTR TO CIDDEL ROUTINE ISTSDCCD    0674 03696000
*                                 REF. BY CIDCTL MACRO                * 03697000
*         2 ATCCDFND PTR(31),  /*PTR TO CIDFND ROUTINE IATSDCCF    0674 03698000
*                                 REF. BY CIDCTL MACRO                * 03699000
*         2 ATCESC01 PTR(31),  /*PTR TO ESC01                         * 03700000
*         2 ATCESC02 PTR(31),  /*PTR TO ESC02                         * 03701000
*         2 ATCCSMR PTR(31),        /* PTR TO CONNECTION SERVICES     * 03702000
*                                   /*  MASTER ROUTINE                * 03703000
*           3 ATCCSMA PTR(31),      /* PTR TO CONNECTION SERVICES  0674 03704000
*                                      MASTER ROUTINE                 * 03705000
*         2 ATCOCRT PTR(31),        /* PTR TO OPEN/CLOSE ROUTINE      * 03706000
*         2 ATCUEP  PTR(31),        /* POINTER TO USER EXIT           * 03707000
*         2 ATCSHRTN CHAR(8),       /* NAME OF VTAM  SHARED RTN       * 03708000
*                                   /*  TO BE LOADED                  * 03709000
*         2 ATCSHRFG BIT(8),        /* ATTRIBUTE FLAGS                * 03710000
*           3 ATCLAST BIT(1),       /* INDICATE HTIS IS LAST MODULE   * 03711000
*         2 ATCXRANG CHAR(1),       /* NUMBER OT BITS IN X-VALUE   0674 03712000
*                                       PORTION   OF CID              * 03713000
*         2 ATCSAF   CHAR(2),       /* SUB AREA ADDRESS FIELD         * 03714000
*         2 ATCEPA PTR(31),         /* ENTRY POINT ADDR OF LOADED     * 03715000
*         2 ATCALERT PTR(31),       /* POINTER TO ALERT-ROUTINE    0674 03716000
*                                      ISTSDCAL                       * 03717000
*         2 ATCDVLOD PTR(31),       /* PTR TO ISTSDCOD                * 03718000
*         2 ATCTRCPT PTR(31),       /* POINTER TO TRACE PARM LIST     * 03719000
*         2 ATCDVT   PTR(31),       /* POINTER TO FIRST DVT ON CHAIN  * 03720000
*         2 ATCEPT   PTR(31),       /* POINTER TO FIRST EPT ON CHAIN  * 03721000
*         2 ATCMSGP PTR(31),        /* POINTER TO TPMSG PROCESSOR     * 03722000
*         2 ATCMSGM PTR(31),        /* POINTER TO TPMSG - MESSAGE  0674 03723000
*                                      CSECT                          * 03724000
*         2 ATCTRPAB  PTR(31),      /* ADDRESS OF TRACE WRITER PAB    * 03725000
*         2 ATCVTLOD PTR(31),       /* ADDR OF VTAM LOAD LIST         * 03726000
*         2 ATCECPRT CHAR(4),       /* ECB FOR TRACE FILE PRINT       * 03727000
*         2 ATCZDVTB PTR(31),       /* ADDRESS OF ISTZCFBI            * 03728000
*         2 ATCECTLP CHAR(4),       /* TOLTEP ECB                     * 03729000
*         2 ATCRVCHS CHAR(8),       /* RESERVED                       * 03730000
*         2 ATCCRME  PTR(31),       /* VARY PSS CONTROL MECHANISM     * 03731000
*         2 ATCHPGM,                /* BUFFER INFORMATION            */ 03732000
*           3 ATCHBFNO FIXED(15),   /* NUMBER OF BUFFS FOR CHANNEL   */ 03733000
*           3 ATCHBSIZ FIXED(15),   /* BUFFER SIZE IN BYTES          */ 03734000
*         2 ATCDEBCH PTR(31),       /* CLOSE DEB CHAIN PTR           */ 03735000
*         2 ATCTODVT PTR(31),       /* THE TOLTEP DVT PTR POINTED  0674 03736000
*                                      TO BY 3RD WORD OF PAB         */ 03737000
*         2 ATCADEL  PTR(31),       /* A DELETE ROUTINE ADDRESS      */ 03738000
*         2 ATCCDPTR PTR(31),       /* PTR TO ISTOCCCD - DOS ONLY    */ 03739000
*         2 ATCLDNCS PTR(31),       /* PTR TO NCSPL FOR LOAD/DUMP    */ 03740000
*         2 ATCLDECB BIT(32),       /* ECB FOR LOAD/DUMP SUBTASK     */ 03741000
*         2 ATCAPCR5 PTR(31),       /* POINTER TO ISTINCR5           */ 03742000
*         2 ATCRSV69 PTR(31),       /* RESERVED TO SYNCH WITH DOS    */ 03743000
*         2 ATCNODEL CHAR(8),       /* VSAM DATA SET NAME            */ 03744000
*         2 ATCNODDS PTR(31),       /* POINTER TO RPL                */ 03745000
*         2 ATCONFIG CHAR(8),       /* START VTAM CONFIG = PARAMETER */ 03746000
*         2 ATCRSV99 CHAR(4),       /* RESERVED FOR LATER POINTERS   */ 03747000
*         2 ATCAP33 PTR(31),        /* PTR TO ISTAPC33               */ 03748000
*         2 ATCAP35 PTR(31),        /* PTR TO ISTAPC35               */ 03749000
*         2 ATCAP36 PTR(31),        /* PTR TO ISTAPC36               */ 03750000
*         2 ATCDVTLK CHAR(LENGTH(ISTLOK)), /* LOCK WORD FOR DVT LOCK */ 03751000
*         2 ATCCDFIN PTR(31),       /* POINTER TO ISTSDCRR           */ 03752000
*         2 ATCCDFDN PTR(31),       /* POINTER TO ISTSDCCN           */ 03753000
*         2 ATCVOCLK CHAR(LENGTH(ISTLOK)), /* VOCLOCK LOCK           */ 03754000
*         2 ATCRDTLK CHAR(LENGTH(ISTLOK)), /* RDTLOCK LOCK           */ 03755000
*         2 ATCRSV97 PTR(31),              /* DWORD ALIGNMENT        */ 03756000
*         2 ATCVPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR VARY 03757000
*                                           UNDER PSS CONTROL        */ 03758000
*         2 ATCPGPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* ERP PAB FOR  03759000
*                                      PURGE                         */ 03760000
*         2 ATCDLRPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* DUMP LOAD &  03761000
*                                           RESTART PAB              */ 03762000
*         2 ATCCCLAD PTR(31),       /* ADDRESS OF VARY ERP (ISTINCCL)*/ 03763000
*         2 ATCCDLAD PTR(31),       /* ADDRESS OF VARY DUMP,LD RSTRT    03764000
*                                      (ISTINCDL)                    */ 03765000
*         2 ATCOCCOB PTR(31),       /* ADDRESS ISTOCCOB              */ 03766000
*         2 ATCOCCCB PTR(31),       /* ADDRESS ISTOCCCB              */ 03767000
*         2 ATCTIPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0674 03768000
*                                           FOR ISTOLTP              */ 03769000
*         2 ATCTCIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0674 03770000
*                                           FOR TOLTEP CLIP          */ 03771000
*         2 ATCVTIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0674 03772000
*                                           FOR TOLTEP-VTAM INTERFACE*/ 03773000
*         2 ATCTCLOM PTR(31),      /* ADDR TOLTEP CLOP PROC          */ 03774000
*         2 ATCTCLIM PTR(31),      /* ADDR TOLTEP CLIP PROC          */ 03775000
*         2 ATCVTINM PTR(31),      /* ADDR TOLTEP-VTAM INTF PROC     */ 03776000
*         2 ATCTACB  PTR(31),      /* TOLTEP ACB                     */ 03777000
*         2 ATCRSV10 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* RESERVED  */ 03778000
*         2 ATCPTR00 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB     */ 03779000
*         2 ATCCFEAD PTR(31),          /* ADDR OF ISTINCFE           */ 03780000
*         2 ATCVLCNT CHAR(4) BDY(HWORD), /* VARY DEVICE ONLINE COUNTS*/ 03781000
*           3 ATCRNCNT PTR(16),        /* 370X COUNT                 */ 03782000
*           3 ATCLCLCT PTR(16),        /* 3270 COUNT                 */ 03783000
*         2 ATCS49XI PTR(31),          /* ADDRESS OF ISTPICXI        */ 03784000
*         2 ATCS49XL PTR(31),          /* ADDRESS OF ISTPICXL        */ 03785000
*         2 ATCPODVT PTR(31),          /* PTR TO PROGRAM OPERATOR DVT*/ 03786000
*         2 ATCRNO,                                                0674 03787000
*           3 *        CHAR(1),                                    0674 03788000
*           3 ATCPOIA  PTR(24),        /* PTR TO PROGRAM OPERATOR    */ 03789000
*                                      /* INTERFACE AREA             */ 03790000
*         2 ATCSOPD CHAR(8) BDY(WORD), /* SESSION CONTROL            */ 03791000
*           3 ATCSEC01 PTR(31),        /* OUTBOUND PROCESSING        */ 03792000
*           3 ATCSEC10 PTR(31),        /* DVT                        */ 03793000
*         2 ATCSIPD CHAR(12) BDY(WORD),/* SESSION CONTROL            */ 03794000
*           3 ATCSEC21 PTR(31),        /* INBOUND PROCESSING         */ 03795000
*           3 ATCSEC30 PTR(31),        /* FEEDBACK                   */ 03796000
*           3 ATCSEC40 PTR(31),        /* DVT                        */ 03797000
*         2 ATCSECST CHAR(4) BDY(WORD),/* SESSION CONTROLSESS TERM   */ 03798000
*           3 ATCSEC51 PTR(31),        /* RECOVERY DVT               */ 03799000
*         2 ATCNMCTR FIXED(15),        /* NAME COUNTER               */ 03800000
*         2 ATCSTAT2 BIT(8),           /* TRACE FLAGS                */ 03801000
*           3 ATCTRAPI BIT(1),         /* API                        */ 03802000
*           3 ATCTRESC BIT(1),         /* ESC                        */ 03803000
*           3 ATCTRPSS BIT(1),         /* PSS                        */ 03804000
*           3 ATCTRLOK BIT(1),         /* LOCKS                      */ 03805000
*           3 ATCTRSMS BIT(1),         /* SMS                        */ 03806000
*           3 *        BIT(3),         /* RESERVED                   */ 03807000
*         2 *        BIT(8),           /* RESERVED                   */ 03808000
*         2 ATCSRTAB PTR(31),          /* SEARCH LOGON MODE TABLE    */ 03809000
*                                      /* RTN ADDRESS (ISTINCSH)     */ 03810000
*         2 ATCUSSPT PTR(31),          /* DEFAULT USS DEFINITION     */ 03811000
*                                      /* TABLE ADDRESS (ISTINCDT)   */ 03812000
*         2 ATCMODTB PTR(31),          /* DEFAULT SYSTEM LOGON MODE  */ 03813000
*                                      /* TABLE ADDRESS (ISTINCLM)   */ 03814000
*         2 ATCINCW3 PTR(31),          /* ADDRESS OF ISTINCW3        */ 03815000
*         2 ATCIOECB PTR(31),          /* ECB USED BY IOS -          */ 03816000
*                                      /* POINTED TO BY IOBECBPT     */ 03817000
* 2 ATCVDPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0674 03818000
*                                    /* SSCP COMMAND PROCESSING PAB  */ 03819000
* 2 ATCVFPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0674 03820000
*                                    /* SSCP FRONT END PAB           */ 03821000
* 2 ATCVDLOK CHAR(LENGTH(ISTLOK)),   /* SSCP SERIALIZATION LOCK      */ 03822000
*/* END OF COMMON AREA                                               */ 03823000
*/* VS1/VS2 COMMON CODE.                                             */ 03824000
*        2  ATCVTBAM CHAR(4),                                      0674 03825000
*           3  *     CHAR(3),          /* RESERVED                    * 03826000
*           3  *     CHAR(1),          /* FLAGS                       * 03827000
*              4 ATCVTMAB BIT(1) ABNL, /* ABEND IN VTAM JOBSTEP       * 03828000
*              4 *        BIT(7),      /* RESERVED                    * 03829000
*        2  ATCAOSM BDY(DWORD),                                    0674 03830000
*/*                                                                   * 03831000
*           3  ATCSRBRT PTR(31),       /* POINTER TO ROUTINE UNDER    * 03832000
*                                      /* SRB CONTROL                 * 03833000
*           3  ATCGSRBQ PTR(31),       /* READY QUEUE FOR GLOBAL SRB'S* 03834000
*              4  ATCGSRBG BIT(8),     /* READY QUEUE GATE BYTE       * 03835000
*                 5  ATCGSRBF BIT(1),  /* READY QUEUE GATE BIT        * 03836000
*           3  ATCPRPH PTR(31),        /* PTR TO PREALLOCATED RPH     * 03837000
*           3  ATCCMTCB PTR(31),       /* PTR TO COMMUNICATIONS TASK  * 03838000
*                                      /* TCB                         * 03839000
*           3  ATCAP11 PTR(31),        /* PTR TO ISTAPC11             * 03840000
*           3  ATCAP12 PTR(31),        /* PTR TO ISTAPC12             * 03841000
*           3  ATCAP31 PTR(31),        /* PTR TO ISTAPC31             * 03842000
*           3  ATCAP32 PTR(31),        /* PTR TO ISTAPC32             * 03843000
*           3  ATCAP34 PTR(31),        /* PTR TO ISTAPC34             * 03844000
*           3  ATCAP52 PTR(31),        /* PTR TO ISTAPC52             * 03845000
*           3  ATCAP53 PTR(31),        /* PTR TO ISTAPC53             * 03846000
*           3  ATCAP54 PTR(31),        /* PTR TO ISTAPC54             * 03847000
*           3  ATCAP57 PTR(31),        /* PTR TO ISTAPC57             * 03848000
*           3  ATCAP58 PTR(31),        /* PTR TO ISTAPC58             * 03849000
*           3  ATCAP61 PTR(31),        /* PTR TO ISTAPC61             * 03850000
*           3  ATCAP63 PTR(31),        /* PTR TO ISTAPC63             * 03851000
*           3  ATCAP64 PTR(31),        /* PTR TO ISTAPC64             * 03852000
*           3  ATCZFSVT PTR(31),       /* TPIOS FIXED SRVICES VCTR TAB* 03853000
*           3  ATCZPSVT PTR(31),       /* TPIOS PAGBL SRVCES VCTR TABL* 03854000
*           3  ATCICNCB PTR(31),       /* HEAD OF ICNCB QUEUE         * 03855000
*           3  ATCZDVT1 PTR(31),       /* TPIOS SLODWN RECOVRY PRCSR  * 03856000
*           3  ATCZDVT3 PTR(31),       /* 370X FEEDBACK STAT CNTRL RTR* 03857000
*           3  ATCZDVT4 PTR(31),       /* OPERATOR MESSAGE SCHEDULER  * 03858000
*           3  ATCZDVT6 PTR(31),       /* DIALOGUE SCHEDULER (INBOUND)* 03859000
*           3  ATCAP65 PTR(31),        /* PTR TO ISTAPC65            */ 03860000
*           3  ATCICAPP CHAR(20) BDY(WORD), /* 3705 APPENDAGE VECTOR  * 03861000
*              4  ATCCDRPH PTR(31),    /* ADDR CLOSE DEB RPH       0674 03862000
*                                         (DUMMY EOA APP.)           */ 03863000
*              4  ATCZSIOA PTR(31),    /* ADDR 3705 SIO APPENDAGE    */ 03864000
*              4  ATCCDTCB PTR(31),    /* VTAM TCB (DUMMY PCI APP.)  */ 03865000
*              4  ATCZCEA PTR(31),     /* ADDR 3705 CHANNEL END    0674 03866000
*                                         APPENDAGE                  */ 03867000
*              4  ATCZAEA PTR(31),     /* ADDR 3705 CHANNEL END    0674 03868000
*                                         APPENDAGE                  */ 03869000
*           3  ATCLDAPP CHAR(20) BDY(WORD), /* LOCAL 3270 APPENDAGE     03870000
*                                         VECTOR                     */ 03871000
*              4  ATCCDTID PTR(31),    /* TASK ID OF VTAM          0674 03872000
*                                         (DUMP EOE)                 */ 03873000
*              4  ATCSMFRR PTR(31),    /* ADDR OF SMS FRR          0674 03874000
*                                         (DUMMY SIOA)               */ 03875000
*              4  ATCRSV17 PTR(31),    /* RESERVED FOR ALIGNMENT     */ 03876000
*              4  ATCZLCEA PTR(31),    /* ADDR 3270 CHANNEL END    0674 03877000
*                                         APPENDAGE                  */ 03878000
*              4  ATCZLAEA PTR(31),    /* ADDR 3270 CHANNEL END    0674 03879000
*                                         APPENDAGE                  */ 03880000
*           3  ATCDAPVT CHAR(24) BDY(WORD),  /* DUMMY APPENDAGE    0674 03881000
*                                         VECTOR TABLE FOR LOAD/DVMMY*/ 03882000
*              4  ATCDEOEA PTR(31),    /* ADDRESS OF DUMMY END     0674 03883000
*                                         OF EXTENT APPENDAGE        */ 03884000
*              4  ATCDSIOA PTR(31),    /* ADDRESS OF DUMMY END     0674 03885000
*                                         OF SIO APPENDAGE           */ 03886000
*              4  ATCDPCIA PTR(31),    /* ADDRESS OF DUMMY PCI     0674 03887000
*                                         APPENDAGE                  */ 03888000
*              4  ATCDCEA PTR(31),     /* ADDRESS OF CHANNEL END   0674 03889000
*                                         APPENDAGE                  */ 03890000
*              4  ATCDXCEA PTR(31),    /* ADDRESS OF ABNORMAL      0674 03891000
*                                         END APPENDAGE              */ 03892000
*              4  ATCDAPDG CHAR(2),    /* DUMMY APPENDAGE            */ 03893000
*              4  ATCRSV56 CHAR(2),    /* RESERVED                   */ 03894000
*           3  ATCZDVT7 PTR(31),       /* ADDR OF RESET CLEANUP    0674 03895000
*                                         (PHASE 1)                   * 03896000
*           3  ATCZDVT8 PTR(31),       /* 3270 LOCAL TEST AND CTL  0674 03897000
*                                         FEEDBACK ROUTER            */ 03898000
*           3  ATCZDVT9 PTR(31),       /* ADDRESS OF ISTZDFKA        */ 03899000
*           3  ATCZDVTA PTR(31),       /* ADDRESS OF ISTZCFIA        */ 03900000
*           3  ATCZDVTX PTR(31),       /* ADDRESS OF TRUNK LINE    0674 03901000
*                                         DEACTIVATE ROUTINE         */ 03902000
*           3  ATCZLPVT PTR(31),       /* ADDRESS OF ISTZPSVA        */ 03903000
*           3  ATCZLFVT PTR(31),       /* TPIOS 3270 LOCAL FIXED   0674 03904000
*                                         SERVICES VECTOR TABLE      */ 03905000
*           3  ATCZPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR   03906000
*                                         TEST AND CTL FEEDBACK ROUTER* 03907000
*           3  ATCZPAB2 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* 370X 0674 03908000
*                                         STATUS AND FEEDBACK ROUTER    03909000
*                                         DYNAMIC PAB                */ 03910000
*           3  ATCAP51  PTR(31),       /* PTR TO ISTAPC51            */ 03911000
*           3  ATCZDFJ0 PTR(31),       /* ADDR OF ISTZDFJ0           */ 03912000
*           3  ATCAP37  PTR(31),       /* PTR TO ISTAPC37            */ 03913000
*           3  ATCAP38  PTR(31),       /* PTR TO ISTAPC38            */ 03914000
*           3  ATCDMAPP PTR(31),       /* DUMMY APPENDAGE ROUTINE    */ 03915000
*                                      /* FOR ABEND                  */ 03916000
*           3  ATCRPT12 PTR(31),       /* RESERVED                   */ 03917000
*           3  ATCRPT13 PTR(31),       /* RESERVED                   */ 03918000
*           3  ATCRPT14 PTR(31),       /* RESERVED                   */ 03919000
*           3  ATCRPT15 PTR(31),       /* RESERVED                   */ 03920000
*           3  ATCRPT16 PTR(31),       /* RESERVED                   */ 03921000
*           3  ATCRPT17 PTR(31),       /* RESERVED                   */ 03922000
*           3  ATCRPT18 PTR(31),       /* RESERVED                   */ 03923000
*           3  ATCRPT19 PTR(31),       /* RESERVED                   */ 03924000
*           3  ATCRPT20 PTR(31),       /* RESERVED                   */ 03925000
*           3  ATCRPT21 PTR(31),       /* RESERVED                   */ 03926000
*           3  ATCRPT22 PTR(31),       /* RESERVED                   */ 03927000
*           3  ATCRPT23 PTR(31),       /* RESERVED                   */ 03928000
*           3  ATCRPT24 PTR(31),       /* RESERVED                   */ 03929000
*           3  ATCRPT25 PTR(31),       /* RESERVED                   */ 03930000
*           3  ATCRPT26 PTR(31),       /* RESERVED                   */ 03931000
*           3  ATCRPT27 PTR(31),       /* RESERVED                   */ 03932000
*           3  ATCRPT28 PTR(31),       /* RESERVED                   */ 03933000
*           3  ATCRPT29 PTR(31),       /* RESERVED                   */ 03934000
*           3  ATCRPT30 PTR(31),       /* RESERVED                   */ 03935000
*           3  ATCRPT31 PTR(31),       /* RESERVED                   */ 03936000
*           3  ATCRPT32 PTR(31),       /* RESERVED                   */ 03937000
*           3  ATCRPT33 PTR(31),       /* RESERVED                   */ 03938000
*           3  ATCRPT34 PTR(31),       /* RESERVED                   */ 03939000
*           3  ATCRPT35 PTR(31),       /* RESERVED                   */ 03940000
*           3  ATCRPT36 PTR(31),       /* RESERVED                   */ 03941000
*           3  ATCRPT37 PTR(31),       /* RESERVED                   */ 03942000
*           3  ATCRPT38 PTR(31),       /* RESERVED                   */ 03943000
*           3  ATCRPT39 PTR(31),       /* RESERVED                   */ 03944000
*           3  ATCRPT40 PTR(31),       /* RESERVED                   */ 03945000
*/* END OF VS1/VS2 COMMON CODE.                                      */ 03946000
*/* START OF VS2 UNIQUE CODE.                                        */ 03947000
*           3  ATCVTFLG BIT(32),                                   0674 03948000
*              4 ATCVTACT BIT(1),      /* VTT ACTIVE                 */ 03949000
*              4 *        BIT(31),     /* RESERVED                   */ 03950000
*           3  ATCHLTCB PTR(31),       /* ECB FOR HALTING VTAM       */ 03951000
*           3  ATCATA10 PTR(31),       /* PTR TO ISTATM10            */ 03952000
*           3  ATCZLAAB PTR(31),       /* PTR TO ISTZLFAB            */ 03953000
*           3  ATCCACXA PTR(31),       /* PTR TO ISTCFCXA            */ 03954000
*           3  ATCSMARA PTR(31),       /* PTR TO ISTORFRA            */ 03955000
*           3  ATCSMAID PTR(31),       /* PTR TO ISTORFID            */ 03956000
*           3  ATCTPWQA PTR(31),       /* WAIT Q ANCHOR FOR TPIOS    */ 03957000
*           3  ATCSMAPR PTR(31),       /* PTR TO ISTORFPR            */ 03958000
*           3  ATCSMABF PTR(31),       /* PTR TO ISTORFBF            */ 03959000
*           3  ATCPSTA  PTR(31),       /* ACTIVE PST QUEUE           */ 03960000
*           3  ATCAPBE  PTR(31),       /* POINTER TO ISTAICBE        */ 03961000
*           3  ATCTRMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0674 03962000
*                                      /* PAB FOR VTAM TERM TASK     */ 03963000
*           3  ATCTPSPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0674 03964000
*                                      /* PAB FOR TPIOS              */ 03965000
*           3  ATCAP23  PTR(31),       /* PTR TO ISTAPC23            */ 03966000
*           3  ATCAPC25 PTR(31),       /* PTR TO ISTAPC25            */ 03967000
*           3  ATCAP41  PTR(31),       /* PTR TO ISTAPC41            */ 03968000
*           3  ATCRCFY0 PTR(31),       /* PTR TO ISTRCFY0            */ 03969000
*           3  ATCAP55  PTR(31),       /* PTR TO ISTAPC55            */ 03970000
*           3  ATCAP56  PTR(31),       /* PTR TO ISTAPC56            */ 03971000
*           3  ATCAPC59 PTR(31),       /* PTR TO ISTAPC59            */ 03972000
*           3  ATCAP62  PTR(31),       /* PTR TO ISTAPC62            */ 03973000
*           3  ATCAP66  PTR(31),       /* PTR TO ISTAPC66            */ 03974000
*           3  ATCAP69  PTR(31),       /* PTR TO ISTAPM69            */ 03975000
*           3  ATCAP82  PTR(31),       /* PTR TO ISTAPC82            */ 03976000
*           3  ATCAP83  PTR(31),       /* PTR TO ISTAPC83            */ 03977000
*           3  ATCAP84  PTR(31),       /* PTR TO ISTAPC84            */ 03978000
*           3  ATCAP85  PTR(31),       /* PTR TO ISTAPC85            */ 03979000
*           3  ATCAP86  PTR(31),       /* PTR TO ISTAPC86            */ 03980000
*           3  ATCASCB  PTR(31),       /* PTR TO VTAM ASCB           */ 03981000
*           3  ATCMPLTA  PTR(31),      /* PTR TO MPST LIST TABLE     */ 03982000
*           3  ATCZR01  PTR(31),       /* PTR TO ISTZRM01            */ 03983000
*           3  ATCAICTN PTR(31),       /* PTR TO ISTAICTN            */ 03984000
*           3  ATCTPCP0 PTR(31),       /* PTR TO ISTZFSAV            */ 03985000
*           3  ATCTPCP1 PTR(31),       /* PTR TO ISTZ19SV            */ 03986000
*           3  ATCZFLAG BIT(8),        /* FLAG BYTE                  */ 03987000
*              4 ATCZF001 BIT(1),      /* MDR RECORDING SUSPENDED    */ 03988000
*              4 ATCRSV66 BIT(7),      /* RESERVED                   */ 03989000
*           3  ATCRSV75 BIT(8),        /* RESERVED                   */ 03990000
*           3  ATCSRBCT FIXED(16),     /* COUNT OF PREALLOCATED SRB'S*/ 03991000
*           3  ATCCRACT FIXED(16),     /* COUNT OF PREALLOCATED CRA'S*/ 03992000
*           3  ATCRPLCT FIXED(16),     /* COUNT OF PREALLOCATED CRPL */ 03993000
*           3  ATCRSV88 PTR(31),       /* RESERVED                   */ 03994000
*           3  ATCTPMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /*TP MSG PAB 03995000
*                                                         FOR VS2    */ 03996000
*           3  ATCTPMMI PTR(31),        /* PTR TO ISTCFMMI - MSG ISSUER 03997000
*                                          FOR SRB MODE ROUTINES     */ 03998000
*           3  ATCVIOPM PTR(31),       /* PTR TO ISTVIOPM            */ 03999000
*           3  ATCPOPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0674 04000000
*                   /* POPAB FOR REPLY PROCESSING, POI TERMINATION,  */ 04001000
*                   /* AND VTAM MESSAGE PROCESSOR                    */ 04002000
*        2  ATCAOS CHAR(0) BDY(WORD);  /* VS2 ONLY FIELDS            */ 04003000
*                                                                  0675 04004000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * */        0675 04005000
* /*                                                     */        0675 04006000
* /*             V A R Y   W O R K   A R E A             */        0675 04007000
* /*                                                     */        0675 04008000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * */        0675 04009000
* DCL 1 ISTVWA BASED(NCSPLWKA),/* VARY WORK AREA         */        0675 04010000
*       2 VWANAV PTR(31),   /* NEXT AVAILABLE POINTER    */        0675 04011000
*       2 VWALTH FIXED(31), /* VARY WORK AREA LENGTH     */        0675 04012000
*       2 VWADYN CHAR(*);   /* DYNAMIC WORK AREA SPACE   */        0675 04013000
* DCL VWASSP PTR(31) BASED(VWANAV);/* SPEC SAVE AREA PTR */        0676 04014000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * */        0677 04015000
* /*                                                     */        0677 04016000
* /*         R E G I S T E R   S A V E   A R E A         */        0677 04017000
* /*                                                     */        0677 04018000
* /* * * * * * * * * * * * * * * * * * * * * * * * * * * */        0677 04019000
* DCL 1 ISTRSA BASED(R13),  /* REGISTER SAVE AREA        */        0677 04020000
*       2 * BIT(32),        /* RESERVED (UNUSED)         */        0677 04021000
*       2 RSABPT PTR(31),   /* BACK POINTER              */        0677 04022000
*       2 RSAFPT PTR(31),   /* FORWARD POINTER           */        0677 04023000
*       2 RSARSA,           /* REGISTER SAVE AREA        */        0677 04024000
*         3 RSAR14 PTR(31), /* REG 14 SAVE AREA          */        0677 04025000
*         3 RSAR15 PTR(31), /* REG 15 SAVE AREA          */        0677 04026000
*         3 RSAR00 PTR(31), /* REG 00 SAVE AREA          */        0677 04027000
*         3 RSAR01 PTR(31), /* REG 01 SAVE AREA          */        0677 04028000
*         3 RSAR02 PTR(31), /* REG 02 SAVE AREA          */        0677 04029000
*         3 RSAR03 PTR(31), /* REG 03 SAVE AREA          */        0677 04030000
*         3 RSAR04 PTR(31), /* REG 04 SAVE AREA          */        0677 04031000
*         3 RSAR05 PTR(31), /* REG 05 SAVE AREA          */        0677 04032000
*         3 RSAR06 PTR(31), /* REG 06 SAVE AREA          */        0677 04033000
*         3 RSAR07 PTR(31), /* REG 07 SAVE AREA          */        0677 04034000
*         3 RSAR08 PTR(31), /* REG 08 SAVE AREA          */        0677 04035000
*         3 RSAR09 PTR(31), /* REG 09 SAVE AREA          */        0677 04036000
*         3 RSAR10 PTR(31), /* REG 10 SAVE AREA          */        0677 04037000
*         3 RSAR11 PTR(31), /* REG 11 SAVE AREA          */        0677 04038000
*         3 RSAR12 PTR(31); /* REG 12 SAVE AREA          */        0677 04039000
*                                                                  0677 04040000
* DCL ISTINCY5 NONLOCAL ENTRY EXTERNAL;                            0678 04041000
* DCL ISTINCIO NONLOCAL ENTRY EXTERNAL;                            0679 04042000
*                                                                  0679 04043000
* DECLARE                                                          0680 04044000
*   EMCR0 PTR REG(0),                                              0680 04045000
*   EMCR1 PTR REG(1),                                              0680 04046000
*   EMCR2 PTR REG(2),                                              0680 04047000
*   EMCR3 PTR REG(3),                                              0680 04048000
*   EMCR4 PTR REG(4),                                              0680 04049000
*   EMCR5 PTR REG(5),                                              0680 04050000
*   EMCR6 PTR REG(6),                                              0680 04051000
*   EMCR7 PTR REG(7),                                              0680 04052000
*   EMCR8 PTR REG(8),                                              0680 04053000
*   EMCR9 PTR REG(9),                                              0680 04054000
*   EMCR10 PTR REG(10),                                            0680 04055000
*   EMCR11 PTR REG(11),                                            0680 04056000
*   EMCR12 PTR REG(12),                                            0680 04057000
*   EMCR13 PTR REG(13),                                            0680 04058000
*   EMCR14 PTR REG(14),                                            0680 04059000
*   EMCR15 PTR REG(15);                                            0680 04060000
*                                                                  0680 04061000
* DECLARE                                                          0681 04062000
*   ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*), /*CIDCTL ADD ROUTINE*/     04063000
*   ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*), /*CIDCTL DELETE ROUTINE*/  04064000
*   ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*), /*CIDCTL FIND ROUTINE*/    04065000
*   ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*), /*CIDCTL FIND NCB ROUTINE* 04066000
*   ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*); /*CIDCTL FINISH ROUTINE*/  04067000
*   DCL CMZCIDM FIXED(15) DEFINED(ATCCIDM); /*CIDMASK ALIAS*/      0682 04068000
* GEN (PRINT ON);                                                  0683 04069000
         PRINT ON                                                       04070000
*/* END OF TPEPILOG */                       /* INCLUDE NECESSARY CONTR 04071000
*L BLKS  */                                                        0684 04072000
* DO; /* CPEXIT  */                                                0684 04073000
* VWANAV = R11;   /* DEALLOCATE WORK AREA      */                  0685 04074000
         L     @02,NCSPLWKA(,R10)                                  0685 04075000
         ST    R11,VWANAV(,@02)                                    0685 04076000
* R13 = R13->RSABPT;        /* GET ADDR CALLER SAVE AREA */        0686 04077000
         L     R13,RSABPT(,R13)                                    0686 04078000
* RETURN;         /* RETURN TO THE CALLER      */                  0687 04079000
@EL00001 DS    0H                                                  0687 04080000
@EF00001 DS    0H                                                  0687 04081000
@ER00001 LM    @14,@12,12(@13)                                     0687 04082000
         BR    @14                                                 0687 04083000
* END; /* CPEXIT  */                         /* RETURN TO THE CALLER    04084000
*        */                                                        0688 04085000
*END;                             /* END OF PROCEDURE ISTINCY4       */ 04086000
@DATA    DS    0H                                                       04087000
@CH00117 DC    H'3'                                                     04088000
@CH00072 DC    H'7'                                                     04089000
@DATD    DSECT                                                          04090000
         DS    0F                                                       04091000
ISTINCY4 CSECT                                                          04092000
         DS    0F                                                       04093000
@CF00359 DC    F'72'                                                    04094000
@CF00073 DC    XL4'FFFFFFF8'                                            04095000
@DATD    DSECT                                                          04096000
         DS    0D                                                       04097000
LCPBPTR  DS    A                                                        04098000
RESPONSE DS    CL7                                                      04099000
         ORG   RESPONSE                                                 04100000
RESPSENS DS    CL4                                                      04101000
RESPDATA DS    CL3                                                      04102000
         ORG   RESPONSE+7                                               04103000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                04104000
@ENDDATD EQU   *                                                        04105000
ISTINCY4 CSECT                                                          04106000
         DS    0F                                                       04107000
@SIZDATD DC    AL1(0)                                                   04108000
         DC    AL3(@ENDDATD-@DATD)                                      04109000
@CV00159 DC    V(ISTINCY5)                                              04110000
@CV00180 DC    V(ISTINCIO)                                              04111000
         DS    0D                                                       04112000
@CB00645 DC    X'2006'                                                  04113000
@CB00646 DC    X'2007'                                                  04114000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       04115000
@01      EQU   01                                                       04116000
@02      EQU   02                                                       04117000
@03      EQU   03                                                       04118000
@04      EQU   04                                                       04119000
@05      EQU   05                                                       04120000
@06      EQU   06                                                       04121000
@07      EQU   07                                                       04122000
@08      EQU   08                                                       04123000
@09      EQU   09                                                       04124000
@10      EQU   10                                                       04125000
@11      EQU   11                                                       04126000
@12      EQU   12                                                       04127000
@13      EQU   13                                                       04128000
@14      EQU   14                                                       04129000
@15      EQU   15                                                       04130000
R14SAVE  EQU   @08                                                      04131000
R01      EQU   @01                                                      04132000
R13      EQU   @13                                                      04133000
R15      EQU   @15                                                      04134000
R10      EQU   @10                                                      04135000
R11      EQU   @11                                                      04136000
R00      EQU   @00                                                      04137000
R02      EQU   @02                                                      04138000
R03      EQU   @03                                                      04139000
REG15    EQU   @15                                                      04140000
R14      EQU   @14                                                      04141000
EMCR2    EQU   @02                                                      04142000
EMCR3    EQU   @03                                                      04143000
RPHPTR   EQU   @01                                                      04144000
EMCR0    EQU   @00                                                      04145000
EMCR1    EQU   @01                                                      04146000
EMCR10   EQU   @10                                                      04147000
EMCR11   EQU   @11                                                      04148000
EMCR12   EQU   @12                                                      04149000
EMCR13   EQU   @13                                                      04150000
EMCR14   EQU   @14                                                      04151000
EMCR15   EQU   @15                                                      04152000
EMCR4    EQU   @04                                                      04153000
EMCR5    EQU   @05                                                      04154000
EMCR6    EQU   @06                                                      04155000
EMCR7    EQU   @07                                                      04156000
EMCR8    EQU   @08                                                      04157000
EMCR9    EQU   @09                                                      04158000
ATCLCPTR EQU   1032                                                     04159000
ISTRPH   EQU   0                                                        04160000
RPHCNTL  EQU   ISTRPH                                                   04161000
RPHFLAGS EQU   RPHCNTL+2                                                04162000
RPHAPTYP EQU   RPHFLAGS                                                 04163000
RPHFSTLC EQU   RPHFLAGS                                                 04164000
RPHFLGB  EQU   RPHCNTL+3                                                04165000
RPHRPHA  EQU   ISTRPH+4                                                 04166000
RPHTSKID EQU   ISTRPH+8                                                 04167000
RPHRESMA EQU   ISTRPH+16                                                04168000
RPHWPFLG EQU   RPHRESMA                                                 04169000
RPHWEA   EQU   ISTRPH+24                                                04170000
RPHCSPA  EQU   RPHWEA                                                   04171000
RPHSRPRM EQU   ISTRPH+28                                                04172000
RPHCRR   EQU   ISTRPH+32                                                04173000
RPHPABQA EQU   ISTRPH+36                                                04174000
RPHWORK  EQU   ISTRPH+40                                                04175000
RPHSAVE1 EQU   RPHWORK                                                  04176000
RPHSBITS EQU   RPHSAVE1+1                                               04177000
ISTPOHD  EQU   0                                                        04178000
POHSTAT  EQU   ISTPOHD+1                                                04179000
ISTPFX   EQU   0                                                        04180000
PFXID    EQU   ISTPFX                                                   04181000
ISTNCSPL EQU   0                                                        04182000
@NM00008 EQU   ISTNCSPL                                                 04183000
NCSPFX   EQU   @NM00008                                                 04184000
NCSPLVBF EQU   ISTNCSPL+18                                              04185000
NCSPLVFL EQU   ISTNCSPL+20                                              04186000
NCSPLVF1 EQU   ISTNCSPL+21                                              04187000
NCSPLRPT EQU   ISTNCSPL+52                                              04188000
NCSPLCMD EQU   ISTNCSPL+60                                              04189000
NCSCMDA  EQU   NCSPLCMD                                                 04190000
NCSCRFLG EQU   ISTNCSPL+67                                              04191000
NCSPLRAD EQU   ISTNCSPL+144                                             04192000
NCSIOCID EQU   ISTNCSPL+148                                             04193000
NCSPLCID EQU   NCSIOCID                                                 04194000
NCSPLSAF EQU   NCSPLCID                                                 04195000
NCSPLDAF EQU   NCSPLCID+2                                               04196000
NCSPLWKA EQU   ISTNCSPL+152                                             04197000
NCSPLRPH EQU   ISTNCSPL+160                                             04198000
NCSPLFSB EQU   ISTNCSPL+168                                             04199000
NCSPLFL1 EQU   ISTNCSPL+176                                             04200000
NCSPLFL2 EQU   ISTNCSPL+177                                             04201000
NCSPLFL3 EQU   ISTNCSPL+178                                             04202000
NCSPLFL4 EQU   ISTNCSPL+179                                             04203000
NCSPLFL5 EQU   ISTNCSPL+181                                             04204000
NCSPLOLN EQU   ISTNCSPL+182                                             04205000
NCSPLRUO EQU   ISTNCSPL+208                                             04206000
NCSPLAPP EQU   ISTNCSPL+216                                             04207000
NCSSENSE EQU   ISTNCSPL+244                                             04208000
NCSPLRH  EQU   ISTNCSPL+260                                             04209000
NCSPLRTY EQU   ISTNCSPL+263                                             04210000
NCSCRMSK EQU   ISTNCSPL+268                                             04211000
NCSCHKPT EQU   NCSCRMSK                                                 04212000
NCSCRMOD EQU   NCSCRMSK+2                                               04213000
NCSPLSID EQU   ISTNCSPL+271                                             04214000
NCSPLSTA EQU   NCSPLSID                                                 04215000
NCSPLPHD EQU   NCSPLSID+1                                               04216000
NCSAPP   EQU   0                                                        04217000
NCSAPBUE EQU   NCSAPP+88                                                04218000
ISTLCCW  EQU   0                                                        04219000
LCCWOP   EQU   ISTLCCW                                                  04220000
LCCWRWOP EQU   LCCWOP                                                   04221000
LCCWCTL  EQU   LCCWRWOP                                                 04222000
LCCWFLAG EQU   ISTLCCW+1                                                04223000
LCCWLSI  EQU   LCCWFLAG                                                 04224000
ISTLCPB  EQU   0                                                        04225000
LCPREQTG EQU   ISTLCPB+2                                                04226000
LCPFLAGS EQU   LCPREQTG                                                 04227000
LCPZF001 EQU   LCPFLAGS                                                 04228000
LCPZRT02 EQU   LCPZF001                                                 04229000
LCPZF002 EQU   LCPFLAGS                                                 04230000
LCPZRT03 EQU   LCPZF002                                                 04231000
LCPZF003 EQU   LCPFLAGS                                                 04232000
LCPZRT04 EQU   LCPZF003                                                 04233000
LCPZF004 EQU   LCPFLAGS                                                 04234000
LCPZRT05 EQU   LCPZF004                                                 04235000
LCPZRT06 EQU   LCPFLAGS                                                 04236000
LCPZRT07 EQU   LCPFLAGS                                                 04237000
LCPMNRCD EQU   LCPREQTG+1                                               04238000
LCPZRT08 EQU   LCPMNRCD                                                 04239000
LCPZRT09 EQU   LCPMNRCD                                                 04240000
LCPCHAIN EQU   ISTLCPB+4                                                04241000
LCPCHAI1 EQU   LCPCHAIN                                                 04242000
LCPRUCNT EQU   ISTLCPB+8                                                04243000
LCPFLAG2 EQU   ISTLCPB+9                                                04244000
LCPTLBPI EQU   LCPFLAG2                                                 04245000
LCPFID0  EQU   LCPFLAG2                                                 04246000
LCPSEQ   EQU   ISTLCPB+10                                               04247000
LCPCID   EQU   ISTLCPB+16                                               04248000
LCPFDBA  EQU   ISTLCPB+24                                               04249000
LCPFLG1  EQU   ISTLCPB+37                                               04250000
LCPFLCCW EQU   ISTLCPB+40                                               04251000
LCPLCCW  EQU   ISTLCPB+48                                               04252000
LCPPABA  EQU   LCPLCCW+4                                                04253000
LCPRPHA  EQU   LCPPABA                                                  04254000
ISTZSAVE EQU   0                                                        04255000
ZSAZSVBC EQU   ISTZSAVE                                                 04256000
ZSAZSVMS EQU   ZSAZSVBC                                                 04257000
ISTPFCRR EQU   0                                                        04258000
PFCCRR   EQU   ISTPFCRR                                                 04259000
PFCCRRID EQU   PFCCRR                                                   04260000
PFCCRRLN EQU   PFCCRR+2                                                 04261000
PFCHDR   EQU   ISTPFCRR+4                                               04262000
PFCCRRO  EQU   PFCHDR                                                   04263000
PFCFRRO  EQU   PFCHDR+4                                                 04264000
ISTCFCRR EQU   0                                                        04265000
CFCAUDIT EQU   ISTCFCRR                                                 04266000
CFCNTRD  EQU   CFCAUDIT                                                 04267000
CFCCRT   EQU   CFCAUDIT+1                                               04268000
ISTZCRR  EQU   0                                                        04269000
ZCRCRR   EQU   ISTZCRR                                                  04270000
ZCRFLGS1 EQU   ISTZCRR+12                                               04271000
ZCRFLGS2 EQU   ISTZCRR+13                                               04272000
ZCRSWFLD EQU   ISTZCRR+14                                               04273000
ZCRENDSH EQU   ZCRSWFLD                                                 04274000
ZCRNDLCP EQU   ZCRSWFLD                                                 04275000
ZCRRESET EQU   ZCRSWFLD                                                 04276000
ZCRFLGS3 EQU   ISTZCRR+15                                               04277000
ZCRGENSW EQU   ISTZCRR+16                                               04278000
ZCRPFLGS EQU   ISTZCRR+17                                               04279000
ZCRIBPR  EQU   ISTZCRR+18                                               04280000
ZCRSCPSW EQU   ISTZCRR+19                                               04281000
ZCRPARMS EQU   ISTZCRR+24                                               04282000
ZCRFBPTR EQU   ZCRPARMS                                                 04283000
ZCRDFRDA EQU   ZCRPARMS+10                                              04284000
ZCRPCOD1 EQU   ZCRPARMS+12                                              04285000
ZCRPLSBF EQU   ZCRPCOD1                                                 04286000
ZCRPCOD2 EQU   ZCRPARMS+13                                              04287000
ZCRSVRTN EQU   ISTZCRR+56                                               04288000
ZCRWKARA EQU   ISTZCRR+156                                              04289000
ZCRCIDSV EQU   ISTZCRR+192                                              04290000
ZCRAUDIT EQU   ISTZCRR+440                                              04291000
ZCRENTER EQU   ZCRAUDIT+5                                               04292000
ZCRLCPB  EQU   ISTZCRR+480                                              04293000
ZCRRHRU  EQU   ZCRLCPB                                                  04294000
ISTASCRR EQU   0                                                        04295000
ASCFLAGS EQU   ISTASCRR+16                                              04296000
ASCFLG1  EQU   ASCFLAGS                                                 04297000
ASCFLG2  EQU   ASCFLAGS+2                                               04298000
ASCFLG3  EQU   ASCFLAGS+4                                               04299000
ASCUSRGS EQU   ISTASCRR+28                                              04300000
ISTAPCRR EQU   0                                                        04301000
APCATFLG EQU   ISTAPCRR+16                                              04302000
APCRFLG  EQU   ISTAPCRR+18                                              04303000
APCSAVE  EQU   ISTAPCRR+44                                              04304000
APCCOMF  EQU   ISTAPCRR+116                                             04305000
APCCOMF1 EQU   APCCOMF                                                  04306000
APC31FLG EQU   ISTAPCRR+132                                             04307000
APC52FLG EQU   ISTAPCRR+133                                             04308000
APC53FLG EQU   ISTAPCRR+134                                             04309000
APC54FLG EQU   ISTAPCRR+135                                             04310000
APC57FLG EQU   ISTAPCRR+136                                             04311000
ISTCRA   EQU   0                                                        04312000
CRABASIC EQU   ISTCRA                                                   04313000
CRAHDR   EQU   CRABASIC                                                 04314000
CRACRR   EQU   CRAHDR                                                   04315000
CRALKACT EQU   CRABASIC+8                                               04316000
CRASVC   EQU   ISTCRA+848                                               04317000
CRABUFA  EQU   CRASVC+68                                                04318000
ISTCNSTA EQU   0                                                        04319000
CNSTFLDA EQU   ISTCNSTA+16                                              04320000
CNSTFLDB EQU   ISTCNSTA+19                                              04321000
ISTVYCRR EQU   0                                                        04322000
VYCAUDIT EQU   ISTVYCRR+22                                              04323000
VYCNTRD  EQU   VYCAUDIT                                                 04324000
VYCCRT   EQU   VYCAUDIT+12                                              04325000
ISTRSA   EQU   0                                                        04326000
RSABPT   EQU   ISTRSA+4                                                 04327000
RSAFPT   EQU   ISTRSA+8                                                 04328000
RSARSA   EQU   ISTRSA+12                                                04329000
ISTLOK   EQU   0                                                        04330000
LOKCHN   EQU   ISTLOK+1                                                 04331000
LOKCHNG  EQU   LOKCHN                                                   04332000
@NM00027 EQU   LOKCHNG+2                                                04333000
ISTDEVCH EQU   0                                                        04334000
DEVSHCH  EQU   ISTDEVCH                                                 04335000
DEVCHAR  EQU   DEVSHCH                                                  04336000
DEVTCODE EQU   ISTDEVCH+1                                               04337000
DEVFLAGS EQU   ISTDEVCH+3                                               04338000
DEVFCCTL EQU   DEVFLAGS                                                 04339000
DEVCHAR3 EQU   DEVFLAGS                                                 04340000
ISTRPRE  EQU   0                                                        04341000
RPRCOMID EQU   ISTRPRE+8                                                04342000
RPRDAF   EQU   RPRCOMID+2                                               04343000
RPRFLAGA EQU   ISTRPRE+21                                               04344000
RPRFLAGB EQU   ISTRPRE+22                                               04345000
RPRCAUSE EQU   ISTRPRE+23                                               04346000
RPRFLAGD EQU   ISTRPRE+61                                               04347000
RPRFLAGC EQU   ISTRPRE+62                                               04348000
ISTRCPRE EQU   0                                                        04349000
RCPPMODE EQU   ISTRCPRE+91                                              04350000
RCPLGNIN EQU   ISTRCPRE+92                                              04351000
ISTRDT   EQU   0                                                        04352000
RDTPLEN  EQU   ISTRDT+72                                                04353000
RDTPRIOR EQU   RDTPLEN                                                  04354000
RDTFLAGB EQU   ISTRDT+91                                                04355000
RDTVYRPH EQU   ISTRDT+108                                               04356000
RDTSTCNT EQU   ISTRDT+112                                               04357000
ISTRAP   EQU   0                                                        04358000
RAPFLG   EQU   ISTRAP+108                                               04359000
RAPFLGB  EQU   ISTRAP+109                                               04360000
RAPFLGC  EQU   ISTRAP+110                                               04361000
ISTRLC   EQU   0                                                        04362000
RLCADR   EQU   ISTRLC+72                                                04363000
RLCFLAG  EQU   RLCADR                                                   04364000
ISTRRN   EQU   0                                                        04365000
RRNADR   EQU   ISTRRN+136                                               04366000
RRNFLAG  EQU   RRNADR                                                   04367000
RRNUCBAD EQU   RRNADR+1                                                 04368000
RRNRDF   EQU   ISTRRN+172                                               04369000
RRNRDFA  EQU   RRNRDF                                                   04370000
RRNRDFB  EQU   RRNRDF+1                                                 04371000
RRNCMF   EQU   ISTRRN+176                                               04372000
RRNCMFA  EQU   RRNCMF                                                   04373000
RRNCMFB  EQU   RRNCMF+1                                                 04374000
RRNCMFC  EQU   RRNCMF+2                                                 04375000
RRNCMFD  EQU   RRNCMF+3                                                 04376000
RRNNMDPD EQU   ISTRRN+192                                               04377000
RRNHPRE  EQU   ISTRRN+216                                               04378000
ISTRGP   EQU   0                                                        04379000
RGPFLG   EQU   ISTRGP+72                                                04380000
ISTRLN   EQU   0                                                        04381000
RLNADR   EQU   ISTRLN+72                                                04382000
RLNFLAG  EQU   RLNADR                                                   04383000
RLNUCBAD EQU   RLNADR+1                                                 04384000
RLNSTAT1 EQU   ISTRLN+86                                                04385000
RLNSTAT2 EQU   ISTRLN+87                                                04386000
RLNRDF   EQU   ISTRLN+88                                                04387000
RLNRDFA  EQU   RLNRDF                                                   04388000
RLNRACNT EQU   RLNRDFA                                                  04389000
RLNRDFB  EQU   RLNRDF+1                                                 04390000
RLNCRFLG EQU   ISTRLN+102                                               04391000
RLNLSCMD EQU   RLNCRFLG                                                 04392000
ISTRPT   EQU   0                                                        04393000
RPTLNCID EQU   ISTRPT+116                                               04394000
RPTDITT  EQU   ISTRPT+128                                               04395000
RPTFLAG1 EQU   ISTRPT+140                                               04396000
ISTRCL   EQU   0                                                        04397000
RCLADR   EQU   ISTRCL+72                                                04398000
RCLFLAG  EQU   RCLADR                                                   04399000
ISTRTR   EQU   0                                                        04400000
RTRADR   EQU   ISTRTR+124                                               04401000
RTRFLAG  EQU   RTRADR                                                   04402000
RTRRDFA  EQU   ISTRTR+136                                               04403000
RTRRAALL EQU   RTRRDFA                                                  04404000
RTRRDFB  EQU   ISTRTR+137                                               04405000
RTRRDFC  EQU   ISTRTR+138                                               04406000
RTRRDFD  EQU   ISTRTR+139                                               04407000
RTRRDFE  EQU   ISTRTR+140                                               04408000
RTRRDFF  EQU   ISTRTR+141                                               04409000
RTRCRFLG EQU   ISTRTR+143                                               04410000
RTRLSCMD EQU   RTRCRFLG                                                 04411000
RTRBSCID EQU   ISTRTR+188                                               04412000
ISTRIN   EQU   0                                                        04413000
RINDFD   EQU   ISTRIN+124                                               04414000
RINREMPO EQU   RINDFD                                                   04415000
RINNODEF EQU   RINDFD                                                   04416000
RINLDISC EQU   RINDFD                                                   04417000
RINNODID EQU   ISTRIN+125                                               04418000
RINRLDAF EQU   ISTRIN+126                                               04419000
RINREMOT EQU   ISTRIN+128                                               04420000
RINVPAB  EQU   ISTRIN+132                                               04421000
RINRPHCN EQU   ISTRIN+136                                               04422000
RINNCSPL EQU   ISTRIN+140                                               04423000
RINCNCNT EQU   ISTRIN+144                                               04424000
ISTRDS   EQU   0                                                        04425000
ISTDOT   EQU   0                                                        04426000
ISTRCC   EQU   0                                                        04427000
RCCFLAG  EQU   ISTRCC+73                                                04428000
RCCOHIMM EQU   RCCFLAG                                                  04429000
RCCFLAGB EQU   ISTRCC+74                                                04430000
RCCBRKCN EQU   RCCFLAGB                                                 04431000
RCCRTGOH EQU   RCCFLAGB                                                 04432000
RCCSTAID EQU   ISTRCC+78                                                04433000
RCCID48  EQU   RCCSTAID+2                                               04434000
RCCCRFLG EQU   ISTRCC+108                                               04435000
ISTRLU   EQU   0                                                        04436000
RLUFLAG  EQU   ISTRLU+125                                               04437000
RLUCRFLG EQU   ISTRLU+126                                               04438000
RLUPACE  EQU   ISTRLU+132                                               04439000
RLUNCPPC EQU   ISTRLU+134                                               04440000
RLUUSSTB EQU   ISTRLU+140                                               04441000
RLUMODET EQU   ISTRLU+152                                               04442000
ISTRPX   EQU   0                                                        04443000
ISTRLX   EQU   0                                                        04444000
RLXFLAGA EQU   ISTRLX+76                                                04445000
ISTRSW   EQU   0                                                        04446000
ISTRDA   EQU   0                                                        04447000
RDAADR   EQU   ISTRDA+72                                                04448000
RDAFLAG  EQU   RDAADR                                                   04449000
RDAUCBAD EQU   RDAADR+1                                                 04450000
ISTRLS   EQU   0                                                        04451000
ISTDNT   EQU   0                                                        04452000
ISTGNT   EQU   0                                                        04453000
ISTPAT   EQU   0                                                        04454000
PATFLAGA EQU   ISTPAT+7                                                 04455000
ISTRH    EQU   0                                                        04456000
RHFLAGS  EQU   ISTRH                                                    04457000
RH1      EQU   RHFLAGS                                                  04458000
RH2      EQU   RHFLAGS+1                                                04459000
RHFME    EQU   RH2                                                      04460000
RHEXCEPT EQU   RH2                                                      04461000
RHRETRY  EQU   RH2                                                      04462000
RHRSVD1  EQU   RH2                                                      04463000
RH3      EQU   RHFLAGS+2                                                04464000
ISTRU    EQU   0                                                        04465000
RUDATA   EQU   ISTRU                                                    04466000
ISTRUB   EQU   0                                                        04467000
ISTPAB   EQU   0                                                        04468000
PABWQCHN EQU   ISTPAB                                                   04469000
PABWEQA  EQU   PABWQCHN                                                 04470000
PABCHAIN EQU   PABWQCHN+4                                               04471000
PABRPHFG EQU   ISTPAB+12                                                04472000
PABFLAGS EQU   PABRPHFG                                                 04473000
PABERLCK EQU   PABFLAGS                                                 04474000
PABERRLK EQU   PABERLCK                                                 04475000
ISTDYPAB EQU   0                                                        04476000
ISTATCVT EQU   0                                                        04477000
ATCCOM   EQU   ISTATCVT                                                 04478000
ATCSTAT  EQU   ATCCOM                                                   04479000
ATCSTAT1 EQU   ATCSTAT                                                  04480000
ATCSTFLG EQU   ATCSTAT+1                                                04481000
ATCPOFLG EQU   ATCSTAT+2                                                04482000
ATCSTAT4 EQU   ATCSTAT+3                                                04483000
ATCIOTRC EQU   ATCCOM+140                                               04484000
ATCTHTRC EQU   ATCIOTRC                                                 04485000
ATCCIDM  EQU   ATCCOM+266                                               04486000
ATCCDADD EQU   ISTATCVT+276                                             04487000
ATCCDDEL EQU   ISTATCVT+280                                             04488000
ATCCDFND EQU   ISTATCVT+284                                             04489000
ATCCSMR  EQU   ISTATCVT+296                                             04490000
ATCSHRFG EQU   ISTATCVT+316                                             04491000
ATCHPGM  EQU   ISTATCVT+384                                             04492000
ATCCDFIN EQU   ISTATCVT+460                                             04493000
ATCCDFDN EQU   ISTATCVT+464                                             04494000
ATCVLCNT EQU   ISTATCVT+772                                             04495000
ATCRNO   EQU   ISTATCVT+788                                             04496000
ATCSOPD  EQU   ISTATCVT+792                                             04497000
ATCSIPD  EQU   ISTATCVT+800                                             04498000
ATCSECST EQU   ISTATCVT+812                                             04499000
ATCSTAT2 EQU   ISTATCVT+818                                             04500000
ATCVTBAM EQU   ISTATCVT+908                                             04501000
@NM00045 EQU   ATCVTBAM+3                                               04502000
ATCAOSM  EQU   ISTATCVT+912                                             04503000
ATCGSRBQ EQU   ATCAOSM+4                                                04504000
ATCGSRBG EQU   ATCGSRBQ                                                 04505000
ATCICAPP EQU   ATCAOSM+100                                              04506000
ATCLDAPP EQU   ATCAOSM+120                                              04507000
ATCDAPVT EQU   ATCAOSM+140                                              04508000
ATCVTFLG EQU   ATCAOSM+392                                              04509000
ATCZFLAG EQU   ATCAOSM+588                                              04510000
ISTSDCCF EQU   0                                                        04511000
NCSUSSRU EQU   0                                                        04512000
NSRUNA5  EQU   0                                                        04513000
ISTVWA   EQU   0                                                        04514000
VWANAV   EQU   ISTVWA                                                   04515000
ISTSDCCA EQU   0                                                        04516000
ISTSDCCD EQU   0                                                        04517000
ISTSDCCN EQU   0                                                        04518000
ISTSDCCR EQU   0                                                        04519000
VWASSP   EQU   0                                                        04520000
@NM00001 EQU   VYCNTRD                                                  04521000
NINCY4   EQU   @NM00001+1                                               04522000
@NM00003 EQU   VYCCRT                                                   04523000
CINCY4   EQU   @NM00003+1                                               04524000
LCPZTIE  EQU   LCPCID                                                   04525000
LCPZSNAM EQU   LCPZTIE+8                                                04526000
ISTSENRU EQU   RUDATA                                                   04527000
SRUSENSE EQU   ISTSENRU                                                 04528000
SRUSENS1 EQU   SRUSENSE                                                 04529000
SRUSNS1  EQU   SRUSENS1                                                 04530000
SRUSNST  EQU   SRUSENS1+1                                               04531000
SRUSENS2 EQU   SRUSENSE+2                                               04532000
SENRU    EQU   ISTSENRU+4                                               04533000
ISTSRU   EQU   ISTRUB                                                   04534000
SRUDATA  EQU   ISTSRU+1                                                 04535000
SRUTYPE  EQU   SRUDATA                                                  04536000
SRULDID  EQU   SRUDATA+1                                                04537000
SRUSPSN  EQU   SRULDID                                                  04538000
ISTNSRU  EQU   ISTRUB                                                   04539000
NSRUNETS EQU   ISTNSRU                                                  04540000
NSRUID   EQU   NSRUNETS                                                 04541000
NSRUSUB  EQU   NSRUNETS+1                                               04542000
NSRURCD  EQU   NSRUNETS+2                                               04543000
NSRUDATA EQU   ISTNSRU+3                                                04544000
NSRUHOOK EQU   NSRUDATA                                                 04545000
NSSSVRU  EQU   NSRUDATA                                                 04546000
NSSSVNOD EQU   NSSSVRU+3                                                04547000
NSSSVT3  EQU   NSSSVNOD                                                 04548000
NSSSVT3C EQU   NSSSVT3+2                                                04549000
NSSSVT3G EQU   NSSSVT3+5                                                04550000
NSSSVT4  EQU   NSSSVNOD                                                 04551000
NSSSVT5  EQU   NSSSVNOD                                                 04552000
NSRUDAT1 EQU   NSRUDATA                                                 04553000
NSRUDAT2 EQU   NSRUDAT1+2                                               04554000
ISTTRRU  EQU   NSRUDAT2                                                 04555000
ISTCTDRU EQU   NSRUDAT2                                                 04556000
ISTINORU EQU   NSRUDAT2                                                 04557000
SRUDAT1  EQU   SRUDATA                                                  04558000
SRUDAT1L EQU   SRUDAT1+1                                                04559000
SRUDAT2  EQU   SRUDATA                                                  04560000
ISTMRU   EQU   ISTRUB                                                   04561000
SRUDATA3 EQU   SRUDATA                                                  04562000
SRUDATA4 EQU   SRUDATA                                                  04563000
NSRUDAT3 EQU   NSRUDAT2                                                 04564000
NSRUDAT4 EQU   NSRUDAT2                                                 04565000
NSRUDAT5 EQU   NSRUDAT2                                                 04566000
NSRUDAT6 EQU   NSRUDAT2                                                 04567000
NSRUDAT7 EQU   NSRUDAT2                                                 04568000
NSRUDIL  EQU   NSRUDAT2                                                 04569000
NSRUDILB EQU   NSRUDIL+1                                                04570000
NSRUNA   EQU   NSRUDAT2                                                 04571000
NSRUNA2  EQU   NSRUNA+1                                                 04572000
NSRUCLSP EQU   NSRUDAT2                                                 04573000
NSRUOH1  EQU   NSRUDAT2                                                 04574000
NSRUDAT8 EQU   NSRUDATA                                                 04575000
ISTUNBRU EQU   SRUTYPE                                                  04576000
CMZCIDM  EQU   ATCCIDM                                                  04577000
RTRDNCBA EQU   ISTRTR+40                                                04578000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    04579000
UNBTYPE  EQU   ISTUNBRU                                                 04580000
NSRUDA8T EQU   NSRUDAT8                                                 04581000
NSRUOHID EQU   NSRUOH1                                                  04582000
NSRULSV  EQU   NSRUCLSP                                                 04583000
NSRUNA4  EQU   NSRUNA+2                                                 04584000
NSRUNA3  EQU   NSRUNA2                                                  04585000
NSRUNA1  EQU   NSRUNA                                                   04586000
NSRUDILF EQU   NSRUDIL+4                                                04587000
NSRUDILE EQU   NSRUDIL+3                                                04588000
NSRUDILD EQU   NSRUDIL+2                                                04589000
NSRUDILC EQU   NSRUDILB                                                 04590000
@NM00038 EQU   NSRUDILB                                                 04591000
NSRUDILA EQU   NSRUDIL                                                  04592000
NSRUDA7T EQU   NSRUDAT7                                                 04593000
NSRUDA6L EQU   NSRUDAT6+4                                               04594000
NSRUDA6S EQU   NSRUDAT6                                                 04595000
NSRUDA5E EQU   NSRUDAT5                                                 04596000
NSRUDA4T EQU   NSRUDAT4                                                 04597000
NSRUDA3S EQU   NSRUDAT3                                                 04598000
SRUDAT4D EQU   SRUDATA4                                                 04599000
SRUDAT3I EQU   SRUDATA3                                                 04600000
MRUDATA  EQU   ISTMRU+9                                                 04601000
MRURESP  EQU   ISTMRU+7                                                 04602000
MRUMODIF EQU   ISTMRU+6                                                 04603000
MRUCMND  EQU   ISTMRU+5                                                 04604000
MRUDAF   EQU   ISTMRU+3                                                 04605000
MRUREQ   EQU   ISTMRU+2                                                 04606000
MRUPREF  EQU   ISTMRU                                                   04607000
SRUDAT2N EQU   SRUDAT2+1                                                04608000
SRUDAT2T EQU   SRUDAT2                                                  04609000
SRUDAT1I EQU   SRUDAT1+2                                                04610000
SRUTSPRO EQU   SRUDAT1L                                                 04611000
SRUFMPRO EQU   SRUDAT1L                                                 04612000
SRUDAT1T EQU   SRUDAT1                                                  04613000
INORUET  EQU   ISTINORU                                                 04614000
CTDRUSTA EQU   ISTCTDRU                                                 04615000
TRRDATA  EQU   ISTTRRU+4                                                04616000
TRRSTAT  EQU   ISTTRRU+3                                                04617000
TRRPEP   EQU   ISTTRRU+2                                                04618000
TRRTIME  EQU   ISTTRRU+1                                                04619000
TRRTYPE  EQU   ISTTRRU                                                  04620000
NSRUDAF  EQU   NSRUDAT1                                                 04621000
NSSSVT5A EQU   NSSSVT5                                                  04622000
NSSSVT4D EQU   NSSSVT4+3                                                04623000
NSSSVT4C EQU   NSSSVT4+2                                                04624000
NSSSVT4B EQU   NSSSVT4+1                                                04625000
NSSSVT4A EQU   NSSSVT4                                                  04626000
NSSSVT3K EQU   NSSSVT3+8                                                04627000
NSSSVT3J EQU   NSSSVT3+7                                                04628000
NSSSVT3I EQU   NSSSVT3+6                                                04629000
@NM00037 EQU   NSSSVT3G                                                 04630000
NSSSVT3H EQU   NSSSVT3G                                                 04631000
NSSSVT3F EQU   NSSSVT3+4                                                04632000
NSSSVT3E EQU   NSSSVT3+3                                                04633000
@NM00036 EQU   NSSSVT3C                                                 04634000
NSSSVT3D EQU   NSSSVT3C                                                 04635000
NSSSVT3B EQU   NSSSVT3+1                                                04636000
NSSSVT3A EQU   NSSSVT3                                                  04637000
NSSSVT   EQU   NSSSVRU+2                                                04638000
NSSSVDAF EQU   NSSSVRU                                                  04639000
NSRUHKTY EQU   NSRUHOOK                                                 04640000
SRURSV01 EQU   SRULDID+4                                                04641000
SRUPSSN  EQU   SRULDID+2                                                04642000
SRUDFCLV EQU   SRUSPSN                                                  04643000
@NM00035 EQU   SRUTYPE                                                  04644000
SRUPSAC  EQU   SRUTYPE                                                  04645000
SRUSPAC  EQU   SRUTYPE                                                  04646000
SRUQSREQ EQU   ISTSRU                                                   04647000
SRUSNS4  EQU   SRUSENS2+1                                               04648000
SRUSNS3  EQU   SRUSENS2                                                 04649000
LCPZTRV4 EQU   LCPZSNAM+4                                               04650000
LCPZTRV1 EQU   LCPZSNAM                                                 04651000
LCPZSNA  EQU   LCPZTIE+4                                                04652000
LCPZFMCA EQU   LCPZTIE                                                  04653000
@NM00004 EQU   @NM00003                                                 04654000
@NM00002 EQU   @NM00001                                                 04655000
VWADYN   EQU   ISTVWA+8                                                 04656000
VWALTH   EQU   ISTVWA+4                                                 04657000
NSRUNA6  EQU   NSRUNA5                                                  04658000
NCSRUITS EQU   NCSUSSRU+2                                               04659000
NCSRULEN EQU   NCSUSSRU                                                 04660000
ATCAOS   EQU   ISTATCVT+1584                                            04661000
ATCPOPAB EQU   ATCAOSM+640                                              04662000
ATCVIOPM EQU   ATCAOSM+636                                              04663000
ATCTPMMI EQU   ATCAOSM+632                                              04664000
ATCTPMPB EQU   ATCAOSM+600                                              04665000
ATCRSV88 EQU   ATCAOSM+596                                              04666000
ATCRPLCT EQU   ATCAOSM+594                                              04667000
ATCCRACT EQU   ATCAOSM+592                                              04668000
ATCSRBCT EQU   ATCAOSM+590                                              04669000
ATCRSV75 EQU   ATCAOSM+589                                              04670000
ATCRSV66 EQU   ATCZFLAG                                                 04671000
ATCZF001 EQU   ATCZFLAG                                                 04672000
ATCTPCP1 EQU   ATCAOSM+584                                              04673000
ATCTPCP0 EQU   ATCAOSM+580                                              04674000
ATCAICTN EQU   ATCAOSM+576                                              04675000
ATCZR01  EQU   ATCAOSM+572                                              04676000
ATCMPLTA EQU   ATCAOSM+568                                              04677000
ATCASCB  EQU   ATCAOSM+564                                              04678000
ATCAP86  EQU   ATCAOSM+560                                              04679000
ATCAP85  EQU   ATCAOSM+556                                              04680000
ATCAP84  EQU   ATCAOSM+552                                              04681000
ATCAP83  EQU   ATCAOSM+548                                              04682000
ATCAP82  EQU   ATCAOSM+544                                              04683000
ATCAP69  EQU   ATCAOSM+540                                              04684000
ATCAP66  EQU   ATCAOSM+536                                              04685000
ATCAP62  EQU   ATCAOSM+532                                              04686000
ATCAPC59 EQU   ATCAOSM+528                                              04687000
ATCAP56  EQU   ATCAOSM+524                                              04688000
ATCAP55  EQU   ATCAOSM+520                                              04689000
ATCRCFY0 EQU   ATCAOSM+516                                              04690000
ATCAP41  EQU   ATCAOSM+512                                              04691000
ATCAPC25 EQU   ATCAOSM+508                                              04692000
ATCAP23  EQU   ATCAOSM+504                                              04693000
ATCTPSPB EQU   ATCAOSM+472                                              04694000
ATCTRMPB EQU   ATCAOSM+440                                              04695000
ATCAPBE  EQU   ATCAOSM+436                                              04696000
ATCPSTA  EQU   ATCAOSM+432                                              04697000
ATCSMABF EQU   ATCAOSM+428                                              04698000
ATCSMAPR EQU   ATCAOSM+424                                              04699000
ATCTPWQA EQU   ATCAOSM+420                                              04700000
ATCSMAID EQU   ATCAOSM+416                                              04701000
ATCSMARA EQU   ATCAOSM+412                                              04702000
ATCCACXA EQU   ATCAOSM+408                                              04703000
ATCZLAAB EQU   ATCAOSM+404                                              04704000
ATCATA10 EQU   ATCAOSM+400                                              04705000
ATCHLTCB EQU   ATCAOSM+396                                              04706000
@NM00047 EQU   ATCVTFLG                                                 04707000
ATCVTACT EQU   ATCVTFLG                                                 04708000
ATCRPT40 EQU   ATCAOSM+388                                              04709000
ATCRPT39 EQU   ATCAOSM+384                                              04710000
ATCRPT38 EQU   ATCAOSM+380                                              04711000
ATCRPT37 EQU   ATCAOSM+376                                              04712000
ATCRPT36 EQU   ATCAOSM+372                                              04713000
ATCRPT35 EQU   ATCAOSM+368                                              04714000
ATCRPT34 EQU   ATCAOSM+364                                              04715000
ATCRPT33 EQU   ATCAOSM+360                                              04716000
ATCRPT32 EQU   ATCAOSM+356                                              04717000
ATCRPT31 EQU   ATCAOSM+352                                              04718000
ATCRPT30 EQU   ATCAOSM+348                                              04719000
ATCRPT29 EQU   ATCAOSM+344                                              04720000
ATCRPT28 EQU   ATCAOSM+340                                              04721000
ATCRPT27 EQU   ATCAOSM+336                                              04722000
ATCRPT26 EQU   ATCAOSM+332                                              04723000
ATCRPT25 EQU   ATCAOSM+328                                              04724000
ATCRPT24 EQU   ATCAOSM+324                                              04725000
ATCRPT23 EQU   ATCAOSM+320                                              04726000
ATCRPT22 EQU   ATCAOSM+316                                              04727000
ATCRPT21 EQU   ATCAOSM+312                                              04728000
ATCRPT20 EQU   ATCAOSM+308                                              04729000
ATCRPT19 EQU   ATCAOSM+304                                              04730000
ATCRPT18 EQU   ATCAOSM+300                                              04731000
ATCRPT17 EQU   ATCAOSM+296                                              04732000
ATCRPT16 EQU   ATCAOSM+292                                              04733000
ATCRPT15 EQU   ATCAOSM+288                                              04734000
ATCRPT14 EQU   ATCAOSM+284                                              04735000
ATCRPT13 EQU   ATCAOSM+280                                              04736000
ATCRPT12 EQU   ATCAOSM+276                                              04737000
ATCDMAPP EQU   ATCAOSM+272                                              04738000
ATCAP38  EQU   ATCAOSM+268                                              04739000
ATCAP37  EQU   ATCAOSM+264                                              04740000
ATCZDFJ0 EQU   ATCAOSM+260                                              04741000
ATCAP51  EQU   ATCAOSM+256                                              04742000
ATCZPAB2 EQU   ATCAOSM+224                                              04743000
ATCZPAB1 EQU   ATCAOSM+192                                              04744000
ATCZLFVT EQU   ATCAOSM+188                                              04745000
ATCZLPVT EQU   ATCAOSM+184                                              04746000
ATCZDVTX EQU   ATCAOSM+180                                              04747000
ATCZDVTA EQU   ATCAOSM+176                                              04748000
ATCZDVT9 EQU   ATCAOSM+172                                              04749000
ATCZDVT8 EQU   ATCAOSM+168                                              04750000
ATCZDVT7 EQU   ATCAOSM+164                                              04751000
ATCRSV56 EQU   ATCDAPVT+22                                              04752000
ATCDAPDG EQU   ATCDAPVT+20                                              04753000
ATCDXCEA EQU   ATCDAPVT+16                                              04754000
ATCDCEA  EQU   ATCDAPVT+12                                              04755000
ATCDPCIA EQU   ATCDAPVT+8                                               04756000
ATCDSIOA EQU   ATCDAPVT+4                                               04757000
ATCDEOEA EQU   ATCDAPVT                                                 04758000
ATCZLAEA EQU   ATCLDAPP+16                                              04759000
ATCZLCEA EQU   ATCLDAPP+12                                              04760000
ATCRSV17 EQU   ATCLDAPP+8                                               04761000
ATCSMFRR EQU   ATCLDAPP+4                                               04762000
ATCCDTID EQU   ATCLDAPP                                                 04763000
ATCZAEA  EQU   ATCICAPP+16                                              04764000
ATCZCEA  EQU   ATCICAPP+12                                              04765000
ATCCDTCB EQU   ATCICAPP+8                                               04766000
ATCZSIOA EQU   ATCICAPP+4                                               04767000
ATCCDRPH EQU   ATCICAPP                                                 04768000
ATCAP65  EQU   ATCAOSM+96                                               04769000
ATCZDVT6 EQU   ATCAOSM+92                                               04770000
ATCZDVT4 EQU   ATCAOSM+88                                               04771000
ATCZDVT3 EQU   ATCAOSM+84                                               04772000
ATCZDVT1 EQU   ATCAOSM+80                                               04773000
ATCICNCB EQU   ATCAOSM+76                                               04774000
ATCZPSVT EQU   ATCAOSM+72                                               04775000
ATCZFSVT EQU   ATCAOSM+68                                               04776000
ATCAP64  EQU   ATCAOSM+64                                               04777000
ATCAP63  EQU   ATCAOSM+60                                               04778000
ATCAP61  EQU   ATCAOSM+56                                               04779000
ATCAP58  EQU   ATCAOSM+52                                               04780000
ATCAP57  EQU   ATCAOSM+48                                               04781000
ATCAP54  EQU   ATCAOSM+44                                               04782000
ATCAP53  EQU   ATCAOSM+40                                               04783000
ATCAP52  EQU   ATCAOSM+36                                               04784000
ATCAP34  EQU   ATCAOSM+32                                               04785000
ATCAP32  EQU   ATCAOSM+28                                               04786000
ATCAP31  EQU   ATCAOSM+24                                               04787000
ATCAP12  EQU   ATCAOSM+20                                               04788000
ATCAP11  EQU   ATCAOSM+16                                               04789000
ATCCMTCB EQU   ATCAOSM+12                                               04790000
ATCPRPH  EQU   ATCAOSM+8                                                04791000
ATCGSRBF EQU   ATCGSRBG                                                 04792000
ATCSRBRT EQU   ATCAOSM                                                  04793000
@NM00046 EQU   @NM00045                                                 04794000
ATCVTMAB EQU   @NM00045                                                 04795000
@NM00044 EQU   ATCVTBAM                                                 04796000
ATCVDLOK EQU   ISTATCVT+904                                             04797000
ATCVFPAB EQU   ISTATCVT+872                                             04798000
ATCVDPAB EQU   ISTATCVT+840                                             04799000
ATCIOECB EQU   ISTATCVT+836                                             04800000
ATCINCW3 EQU   ISTATCVT+832                                             04801000
ATCMODTB EQU   ISTATCVT+828                                             04802000
ATCUSSPT EQU   ISTATCVT+824                                             04803000
ATCSRTAB EQU   ISTATCVT+820                                             04804000
@NM00043 EQU   ISTATCVT+819                                             04805000
@NM00042 EQU   ATCSTAT2                                                 04806000
ATCTRSMS EQU   ATCSTAT2                                                 04807000
ATCTRLOK EQU   ATCSTAT2                                                 04808000
ATCTRPSS EQU   ATCSTAT2                                                 04809000
ATCTRESC EQU   ATCSTAT2                                                 04810000
ATCTRAPI EQU   ATCSTAT2                                                 04811000
ATCNMCTR EQU   ISTATCVT+816                                             04812000
ATCSEC51 EQU   ATCSECST                                                 04813000
ATCSEC40 EQU   ATCSIPD+8                                                04814000
ATCSEC30 EQU   ATCSIPD+4                                                04815000
ATCSEC21 EQU   ATCSIPD                                                  04816000
ATCSEC10 EQU   ATCSOPD+4                                                04817000
ATCSEC01 EQU   ATCSOPD                                                  04818000
ATCPOIA  EQU   ATCRNO+1                                                 04819000
@NM00041 EQU   ATCRNO                                                   04820000
ATCPODVT EQU   ISTATCVT+784                                             04821000
ATCS49XL EQU   ISTATCVT+780                                             04822000
ATCS49XI EQU   ISTATCVT+776                                             04823000
ATCLCLCT EQU   ATCVLCNT+2                                               04824000
ATCRNCNT EQU   ATCVLCNT                                                 04825000
ATCCFEAD EQU   ISTATCVT+768                                             04826000
ATCPTR00 EQU   ISTATCVT+736                                             04827000
ATCRSV10 EQU   ISTATCVT+704                                             04828000
ATCTACB  EQU   ISTATCVT+700                                             04829000
ATCVTINM EQU   ISTATCVT+696                                             04830000
ATCTCLIM EQU   ISTATCVT+692                                             04831000
ATCTCLOM EQU   ISTATCVT+688                                             04832000
ATCVTIPB EQU   ISTATCVT+656                                             04833000
ATCTCIPB EQU   ISTATCVT+624                                             04834000
ATCTIPAB EQU   ISTATCVT+592                                             04835000
ATCOCCCB EQU   ISTATCVT+588                                             04836000
ATCOCCOB EQU   ISTATCVT+584                                             04837000
ATCCDLAD EQU   ISTATCVT+580                                             04838000
ATCCCLAD EQU   ISTATCVT+576                                             04839000
ATCDLRPB EQU   ISTATCVT+544                                             04840000
ATCPGPAB EQU   ISTATCVT+512                                             04841000
ATCVPAB1 EQU   ISTATCVT+480                                             04842000
ATCRSV97 EQU   ISTATCVT+476                                             04843000
ATCRDTLK EQU   ISTATCVT+472                                             04844000
ATCVOCLK EQU   ISTATCVT+468                                             04845000
ATCDVTLK EQU   ISTATCVT+456                                             04846000
ATCAP36  EQU   ISTATCVT+452                                             04847000
ATCAP35  EQU   ISTATCVT+448                                             04848000
ATCAP33  EQU   ISTATCVT+444                                             04849000
ATCRSV99 EQU   ISTATCVT+440                                             04850000
ATCONFIG EQU   ISTATCVT+432                                             04851000
ATCNODDS EQU   ISTATCVT+428                                             04852000
ATCNODEL EQU   ISTATCVT+420                                             04853000
ATCRSV69 EQU   ISTATCVT+416                                             04854000
ATCAPCR5 EQU   ISTATCVT+412                                             04855000
ATCLDECB EQU   ISTATCVT+408                                             04856000
ATCLDNCS EQU   ISTATCVT+404                                             04857000
ATCCDPTR EQU   ISTATCVT+400                                             04858000
ATCADEL  EQU   ISTATCVT+396                                             04859000
ATCTODVT EQU   ISTATCVT+392                                             04860000
ATCDEBCH EQU   ISTATCVT+388                                             04861000
ATCHBSIZ EQU   ATCHPGM+2                                                04862000
ATCHBFNO EQU   ATCHPGM                                                  04863000
ATCCRME  EQU   ISTATCVT+380                                             04864000
ATCRVCHS EQU   ISTATCVT+372                                             04865000
ATCECTLP EQU   ISTATCVT+368                                             04866000
ATCZDVTB EQU   ISTATCVT+364                                             04867000
ATCECPRT EQU   ISTATCVT+360                                             04868000
ATCVTLOD EQU   ISTATCVT+356                                             04869000
ATCTRPAB EQU   ISTATCVT+352                                             04870000
ATCMSGM  EQU   ISTATCVT+348                                             04871000
ATCMSGP  EQU   ISTATCVT+344                                             04872000
ATCEPT   EQU   ISTATCVT+340                                             04873000
ATCDVT   EQU   ISTATCVT+336                                             04874000
ATCTRCPT EQU   ISTATCVT+332                                             04875000
ATCDVLOD EQU   ISTATCVT+328                                             04876000
ATCALERT EQU   ISTATCVT+324                                             04877000
ATCEPA   EQU   ISTATCVT+320                                             04878000
ATCSAF   EQU   ISTATCVT+318                                             04879000
ATCXRANG EQU   ISTATCVT+317                                             04880000
ATCLAST  EQU   ATCSHRFG                                                 04881000
ATCSHRTN EQU   ISTATCVT+308                                             04882000
ATCUEP   EQU   ISTATCVT+304                                             04883000
ATCOCRT  EQU   ISTATCVT+300                                             04884000
ATCCSMA  EQU   ATCCSMR                                                  04885000
ATCESC02 EQU   ISTATCVT+292                                             04886000
ATCESC01 EQU   ISTATCVT+288                                             04887000
ATCMNT   EQU   ISTATCVT+272                                             04888000
ATCRSV16 EQU   ISTATCVT+270                                             04889000
ATCMAXID EQU   ISTATCVT+269                                             04890000
ATCMSGSP EQU   ATCCOM+268                                               04891000
ATCACTRM EQU   ATCCOM+264                                               04892000
ATCNERAP EQU   ATCCOM+260                                               04893000
ATCNESAL EQU   ATCCOM+256                                               04894000
ATCRCC65 EQU   ATCCOM+252                                               04895000
ATCRCC26 EQU   ATCCOM+248                                               04896000
ATCRCC63 EQU   ATCCOM+244                                               04897000
ATCRSV11 EQU   ATCCOM+242                                               04898000
ATCVTMID EQU   ATCCOM+240                                               04899000
ATCAPOST EQU   ATCCOM+236                                               04900000
ATCNERFN EQU   ATCCOM+232                                               04901000
ATCNERNE EQU   ATCCOM+228                                               04902000
ATCNERCV EQU   ATCCOM+224                                               04903000
ATCNERST EQU   ATCCOM+220                                               04904000
ATCDCC61 EQU   ATCCOM+216                                               04905000
ATCDCC60 EQU   ATCCOM+212                                               04906000
ATCSRTDF EQU   ATCCOM+208                                               04907000
ATCSRTAD EQU   ATCCOM+204                                               04908000
ATCFIRA  EQU   ATCCOM+200                                               04909000
ATCSMBQ  EQU   ATCCOM+196                                               04910000
ATCSMRC  EQU   ATCCOM+192                                               04911000
ATCSMRS  EQU   ATCCOM+188                                               04912000
ATCSMQU  EQU   ATCCOM+184                                               04913000
ATCSMRQ  EQU   ATCCOM+180                                               04914000
ATCACDA  EQU   ATCCOM+176                                               04915000
ATCSTMA  EQU   ATCCOM+172                                               04916000
ATCFRSTR EQU   ATCCOM+168                                               04917000
ATCGTSTR EQU   ATCCOM+164                                               04918000
ATCREADA EQU   ATCCOM+160                                               04919000
ATCALOAD EQU   ATCCOM+156                                               04920000
ATCBLDLA EQU   ATCCOM+152                                               04921000
ATCFBRPH EQU   ATCCOM+148                                               04922000
ATCBFTRC EQU   ATCCOM+144                                               04923000
ATCTPBUF EQU   ATCTHTRC                                                 04924000
ATCREMOV EQU   ATCCOM+136                                               04925000
ATCADD   EQU   ATCCOM+132                                               04926000
ATCBPDA  EQU   ATCCOM+128                                               04927000
ATCDVTPT EQU   ATCCOM+124                                               04928000
ATCFEPT  EQU   ATCCOM+120                                               04929000
ATCFDVT  EQU   ATCCOM+116                                               04930000
ATCCONFT EQU   ATCCOM+112                                               04931000
ATCPTCHA EQU   ATCCOM+108                                               04932000
ATCAUTHA EQU   ATCCOM+104                                               04933000
ATCACCTA EQU   ATCCOM+100                                               04934000
ATCRDTH  EQU   ATCCOM+96                                                04935000
ATCFRSCH EQU   ATCCOM+92                                                04936000
ATCFSB   EQU   ATCCOM+88                                                04937000
ATCHLTMS EQU   ATCCOM+84                                                04938000
ATCECPRM EQU   ATCCOM+80                                                04939000
ATCECNET EQU   ATCCOM+76                                                04940000
ATCECOPC EQU   ATCCOM+72                                                04941000
ATCVPARM EQU   ATCCOM+68                                                04942000
ATCECVRQ EQU   ATCCOM+64                                                04943000
ATCECSES EQU   ATCCOM+60                                                04944000
ATCOCHA  EQU   ATCCOM+56                                                04945000
ATCDSPLQ EQU   ATCCOM+52                                                04946000
ATCECDSP EQU   ATCCOM+48                                                04947000
ATCVARYQ EQU   ATCCOM+44                                                04948000
ATCECVRY EQU   ATCCOM+40                                                04949000
ATCHALTQ EQU   ATCCOM+36                                                04950000
ATCECHLT EQU   ATCCOM+32                                                04951000
ATCMODQ  EQU   ATCCOM+28                                                04952000
ATCECMOD EQU   ATCCOM+24                                                04953000
ATCASCHD EQU   ATCCOM+20                                                04954000
ATCSRT   EQU   ATCCOM+16                                                04955000
ATCRDT   EQU   ATCCOM+12                                                04956000
ATCDCFRR EQU   ATCCOM+8                                                 04957000
ATCAPI   EQU   ATCCOM+4                                                 04958000
ATCRSV04 EQU   ATCSTAT4                                                 04959000
ATCVTTRC EQU   ATCSTAT4                                                 04960000
ATCNCSD  EQU   ATCSTAT4                                                 04961000
ATCMTST  EQU   ATCSTAT4                                                 04962000
ATCTPRT  EQU   ATCSTAT4                                                 04963000
ATCPRTAT EQU   ATCSTAT4                                                 04964000
@NM00040 EQU   ATCPOFLG                                                 04965000
ATCPOUNS EQU   ATCPOFLG                                                 04966000
ATCHSDMF EQU   ATCSTFLG                                                 04967000
@NM00039 EQU   ATCSTAT1                                                 04968000
ATCMDHLT EQU   ATCSTAT1                                                 04969000
ATCINHLT EQU   ATCSTAT1                                                 04970000
ATCNETSL EQU   ATCSTAT1                                                 04971000
ATCQKHLT EQU   ATCSTAT1                                                 04972000
ATCSNHLT EQU   ATCSTAT1                                                 04973000
ATCACTIV EQU   ATCSTAT1                                                 04974000
ATCSTART EQU   ATCSTAT1                                                 04975000
DYPPAB   EQU   ISTDYPAB+16                                              04976000
DYPRSV01 EQU   ISTDYPAB+12                                              04977000
DYPTSKID EQU   ISTDYPAB+8                                               04978000
DYPCHAIN EQU   ISTDYPAB+4                                               04979000
DYPFLGS  EQU   ISTDYPAB+2                                               04980000
DYPLNGTH EQU   ISTDYPAB+1                                               04981000
DYPTYPE  EQU   ISTDYPAB                                                 04982000
PABRPHA  EQU   PABRPHFG+1                                               04983000
PABNODQ  EQU   PABFLAGS                                                 04984000
PABINHBT EQU   PABFLAGS                                                 04985000
PABERLOK EQU   PABERRLK                                                 04986000
PABSSN   EQU   PABFLAGS                                                 04987000
PABDYNAM EQU   PABFLAGS                                                 04988000
PABNORPR EQU   PABFLAGS                                                 04989000
PABPRIOR EQU   PABFLAGS                                                 04990000
PABAPYP  EQU   PABFLAGS                                                 04991000
PABDVTA  EQU   ISTPAB+9                                                 04992000
PABOFFST EQU   ISTPAB+8                                                 04993000
PABCHNGP EQU   PABCHAIN+1                                               04994000
PABRSV02 EQU   PABCHAIN                                                 04995000
PABRUNNG EQU   PABCHAIN                                                 04996000
PABRESET EQU   PABCHAIN                                                 04997000
PABUNCON EQU   PABCHAIN                                                 04998000
PABCDP   EQU   PABCHAIN                                                 04999000
PABRESCH EQU   PABCHAIN                                                 05000000
PABCHNG  EQU   PABCHAIN                                                 05001000
PABWEQP  EQU   PABWEQA+1                                                05002000
PABRSV01 EQU   PABWEQA                                                  05003000
PABWEQG  EQU   PABWEQA                                                  05004000
RUBDATA  EQU   ISTRUB                                                   05005000
RHRSVD5  EQU   RH3                                                      05006000
RHRSVD4  EQU   RH3                                                      05007000
RHLOG    EQU   RH3                                                      05008000
RHRSVD3  EQU   RH3                                                      05009000
RHRCDIR  EQU   RH3                                                      05010000
RHCDIR   EQU   RH3                                                      05011000
RHEB     EQU   RH3                                                      05012000
RHBB     EQU   RH3                                                      05013000
RHPACE   EQU   RH2                                                      05014000
RHRSVD2  EQU   RH2                                                      05015000
RHINOP   EQU   RHRSVD1                                                  05016000
RHBUSY   EQU   RHRETRY                                                  05017000
RHRRN    EQU   RH2                                                      05018000
RHPE     EQU   RH2                                                      05019000
RHCHAIN  EQU   RH1                                                      05020000
RHSENSE  EQU   RH1                                                      05021000
RHFORMAT EQU   RH1                                                      05022000
RHDIRI   EQU   RH1                                                      05023000
RHSCI    EQU   RH1                                                      05024000
RHTYPE   EQU   RH1                                                      05025000
RHQS     EQU   RH1                                                      05026000
PATRSV01 EQU   PATFLAGA                                                 05027000
PATUSEFG EQU   PATFLAGA                                                 05028000
PATRDCNT EQU   ISTPAT+6                                                 05029000
PATGRPID EQU   ISTPAT+5                                                 05030000
PATPTHID EQU   ISTPAT+4                                                 05031000
PATDINDX EQU   ISTPAT+2                                                 05032000
PATGINDX EQU   ISTPAT                                                   05033000
GNTGRPNM EQU   ISTGNT                                                   05034000
DNTTELNO EQU   ISTDNT+1                                                 05035000
DNTCTDIG EQU   ISTDNT                                                   05036000
RLSRSV02 EQU   ISTRLS+140                                               05037000
RLSRSV01 EQU   ISTRLS+138                                               05038000
RLSCTELU EQU   ISTRLS+136                                               05039000
RLSPRE   EQU   ISTRLS                                                   05040000
RDARSVPT EQU   ISTRDA+84                                                05041000
RDAPUBI  EQU   ISTRDA+83                                                05042000
RDADFCUA EQU   ISTRDA+80                                                05043000
RDACTPCC EQU   ISTRDA+79                                                05044000
RDADACUA EQU   ISTRDA+76                                                05045000
RDALUBA  EQU   RDAUCBAD+1                                               05046000
RDACHQI  EQU   RDAUCBAD                                                 05047000
RDARSV01 EQU   RDAFLAG                                                  05048000
RDARBISA EQU   RDAFLAG                                                  05049000
RDAPRE   EQU   ISTRDA                                                   05050000
RSWRSV01 EQU   ISTRSW+152                                               05051000
RSWRSV02 EQU   ISTRSW+150                                               05052000
RSWCTELU EQU   ISTRSW+148                                               05053000
RSWGRUPZ EQU   ISTRSW+146                                               05054000
RSWDIALZ EQU   ISTRSW+144                                               05055000
RSWGRUPT EQU   ISTRSW+140                                               05056000
RSWDIALT EQU   ISTRSW+136                                               05057000
RSWPRE   EQU   ISTRSW                                                   05058000
RLXRSV03 EQU   ISTRLX+80                                                05059000
RLXRSV02 EQU   ISTRLX+77                                                05060000
RLXRSV01 EQU   RLXFLAGA                                                 05061000
RLXINUSE EQU   RLXFLAGA                                                 05062000
RLXNLUX  EQU   ISTRLX+72                                                05063000
RLXPRE   EQU   ISTRLX                                                   05064000
RPXRSV01 EQU   ISTRPX+80                                                05065000
RPXRSV02 EQU   ISTRPX+77                                                05066000
RPXMAXLU EQU   ISTRPX+76                                                05067000
RPXFLUX  EQU   ISTRPX+72                                                05068000
RPXPRE   EQU   ISTRPX                                                   05069000
RLURSV02 EQU   ISTRLU+172                                               05070000
RLULGMOD EQU   ISTRLU+164                                               05071000
RLUMODEP EQU   RLUMODET+8                                               05072000
RLUMODEN EQU   RLUMODET                                                 05073000
RLUUSSPT EQU   RLUUSSTB+8                                               05074000
RLUUSSNM EQU   RLUUSSTB                                                 05075000
RLURSV01 EQU   ISTRLU+137                                               05076000
RLULOCAD EQU   ISTRLU+136                                               05077000
RLUNCPPM EQU   RLUNCPPC+1                                               05078000
RLUNCPPN EQU   RLUNCPPC                                                 05079000
RLUPACEM EQU   RLUPACE+1                                                05080000
RLUPACEN EQU   RLUPACE                                                  05081000
RLUINTA  EQU   ISTRLU+128                                               05082000
RLUSSCFM EQU   ISTRLU+127                                               05083000
RLUCRRSV EQU   RLUCRFLG                                                 05084000
RLUACTLU EQU   RLUCRFLG                                                 05085000
RLURSV00 EQU   RLUFLAG                                                  05086000
RLUNDSES EQU   RLUFLAG                                                  05087000
RLUGSTAT EQU   RLUFLAG                                                  05088000
RLUBATCH EQU   RLUFLAG                                                  05089000
RLURBISA EQU   RLUFLAG                                                  05090000
RLUTYPE  EQU   ISTRLU+124                                               05091000
RLUCRPR  EQU   ISTRLU                                                   05092000
RCCRVPT2 EQU   ISTRCC+144                                               05093000
RCCXTOSW EQU   ISTRCC+140                                               05094000
RCCSWTOX EQU   ISTRCC+136                                               05095000
RCCRSPT2 EQU   ISTRCC+133                                               05096000
RCCADDR  EQU   ISTRCC+132                                               05097000
RCCPASSL EQU   ISTRCC+131                                               05098000
RCCMXOUT EQU   ISTRCC+130                                               05099000
RCCMXDAT EQU   ISTRCC+128                                               05100000
RCCINDEX EQU   ISTRCC+126                                               05101000
RCCPATHZ EQU   ISTRCC+124                                               05102000
RCCPATHT EQU   ISTRCC+120                                               05103000
RCCDPQ   EQU   ISTRCC+116                                               05104000
RCCTPAB  EQU   ISTRCC+112                                               05105000
RCCRSV02 EQU   ISTRCC+109                                               05106000
RCCCRRSV EQU   RCCCRFLG                                                 05107000
RCCCTCFL EQU   RCCCRFLG                                                 05108000
RCCACTPU EQU   RCCCRFLG                                                 05109000
RCCNCSPL EQU   ISTRCC+104                                               05110000
RCCRPHCN EQU   ISTRCC+100                                               05111000
RCCEPAB  EQU   ISTRCC+96                                                05112000
RCCDPAB  EQU   ISTRCC+92                                                05113000
RCCVPAB  EQU   ISTRCC+88                                                05114000
@NM00034 EQU   ISTRCC+87                                                05115000
RCCSESCT EQU   ISTRCC+86                                                05116000
RCCIDNUM EQU   RCCID48+3                                                05117000
RCCIDBLK EQU   RCCID48+2                                                05118000
RCCIDPA2 EQU   RCCID48+1                                                05119000
RCCIDPUT EQU   RCCID48                                                  05120000
RCCIDPA1 EQU   RCCSTAID                                                 05121000
RCCCTELU EQU   ISTRCC+76                                                05122000
RCCCNCNT EQU   ISTRCC+75                                                05123000
RCCRESET EQU   RCCFLAGB                                                 05124000
RCCFINAL EQU   RCCFLAGB                                                 05125000
RCCBNNSP EQU   RCCFLAGB                                                 05126000
RCCIRETR EQU   RCCFLAGB                                                 05127000
RCCDIALP EQU   RCCFLAGB                                                 05128000
RCCDSTCT EQU   RCCFLAGB                                                 05129000
RCCCTPGD EQU   RCCFLAG                                                  05130000
RCCPRGDN EQU   RCCFLAG                                                  05131000
RCCOUERP EQU   RCCFLAG                                                  05132000
RCCLDISC EQU   RCCFLAG                                                  05133000
RCCERPIP EQU   RCCFLAG                                                  05134000
RCCCUDIE EQU   RCCFLAG                                                  05135000
RCCRBISA EQU   RCCFLAG                                                  05136000
RCCTYPE  EQU   ISTRCC+72                                                05137000
RCCPRE   EQU   ISTRCC                                                   05138000
DOTADTRM EQU   ISTDOT                                                   05139000
RDSADDOT EQU   ISTRDS+76                                                05140000
RDSCTATR EQU   ISTRDS+74                                                05141000
RDSCTTRM EQU   ISTRDS+72                                                05142000
RDSPRE   EQU   ISTRDS                                                   05143000
RINRSV05 EQU   ISTRIN+156                                               05144000
RINRSV04 EQU   ISTRIN+152                                               05145000
RINLOCRN EQU   ISTRIN+148                                               05146000
RINRSV02 EQU   ISTRIN+145                                               05147000
RTRCNCNT EQU   RINCNCNT                                                 05148000
RTRNCSPL EQU   RINNCSPL                                                 05149000
RTRRPHCN EQU   RINRPHCN                                                 05150000
RTRVPAB  EQU   RINVPAB                                                  05151000
RTRREMOT EQU   RINREMOT                                                 05152000
RTRRLDAF EQU   RINRLDAF                                                 05153000
RTRNODID EQU   RINNODID                                                 05154000
RINRSV01 EQU   RINDFD                                                   05155000
RTRLDISC EQU   RINLDISC                                                 05156000
RTRNODEF EQU   RINNODEF                                                 05157000
RTRREMPO EQU   RINREMPO                                                 05158000
RINCRPRE EQU   ISTRIN                                                   05159000
RTRRSV04 EQU   ISTRTR+210                                               05160000
RTRLCTI  EQU   ISTRTR+209                                               05161000
RTRIDCAS EQU   RTRBSCID+1                                               05162000
RTRIDLEN EQU   RTRBSCID                                                 05163000
RTRRSVDD EQU   ISTRTR+181                                               05164000
RTRRDFG  EQU   ISTRTR+180                                               05165000
RTRDIAA  EQU   ISTRTR+176                                               05166000
RTRPOLA  EQU   ISTRTR+172                                               05167000
RTRCADDR EQU   ISTRTR+164                                               05168000
RTRCTADR EQU   ISTRTR+162                                               05169000
RTRCTPOL EQU   ISTRTR+160                                               05170000
RTRCTDIA EQU   ISTRTR+158                                               05171000
RTRRSV03 EQU   ISTRTR+156                                               05172000
RTRRVPT1 EQU   ISTRTR+152                                               05173000
RTRBHSN1 EQU   ISTRTR+144                                               05174000
RTRCRSV2 EQU   RTRCRFLG                                                 05175000
RTRDTRLM EQU   RTRLSCMD                                                 05176000
RTRCRSV1 EQU   RTRCRFLG                                                 05177000
RTRTRMAX EQU   ISTRTR+142                                               05178000
RTRRSV24 EQU   RTRRDFF                                                  05179000
RTRRFDEK EQU   RTRRDFF                                                  05180000
RTRRFANK EQU   RTRRDFF                                                  05181000
RTRRFPFK EQU   RTRRDFF                                                  05182000
RTRRFPEN EQU   RTRRDFF                                                  05183000
RTRRFXCT EQU   RTRRDFF                                                  05184000
RTRRESCT EQU   RTRRDFE                                                  05185000
RTRRESUP EQU   RTRRDFE                                                  05186000
RTRREATT EQU   RTRRDFE                                                  05187000
RTRRECHK EQU   RTRRDFE                                                  05188000
RTRREACR EQU   RTRRDFE                                                  05189000
RTRRSV0A EQU   RTRRDFE                                                  05190000
RTRREBRK EQU   RTRRDFE                                                  05191000
RTRRSV11 EQU   RTRRDFD                                                  05192000
RTRRSV10 EQU   RTRRDFD                                                  05193000
RTRRDBHI EQU   RTRRDFD                                                  05194000
RTRRDBHD EQU   RTRRDFD                                                  05195000
RTRRDBHN EQU   RTRRDFD                                                  05196000
RTRRSV23 EQU   RTRRDFC                                                  05197000
RTRRCXMS EQU   RTRRDFC                                                  05198000
RTRRCMSG EQU   RTRRDFC                                                  05199000
RTRRCBLK EQU   RTRRDFC                                                  05200000
RTRRCPT3 EQU   RTRRDFC                                                  05201000
RTRRCIT2 EQU   RTRRDFC                                                  05202000
RTRRCIT1 EQU   RTRRDFC                                                  05203000
RTRRSV32 EQU   RTRRDFB                                                  05204000
RTRRBEND EQU   RTRRDFB                                                  05205000
RTRRBECT EQU   RTRRDFB                                                  05206000
RTRRSV02 EQU   RTRRDFA                                                  05207000
RTRRACTR EQU   RTRRDFA                                                  05208000
RTRRSV60 EQU   RTRRDFA                                                  05209000
RTRRACDT EQU   RTRRDFA                                                  05210000
RTRRAPT3 EQU   RTRRAALL                                                 05211000
RTRRAPT2 EQU   RTRRAALL                                                 05212000
RTRRAPT1 EQU   RTRRAALL                                                 05213000
RTRRAATN EQU   RTRRDFA                                                  05214000
RTRRSV45 EQU   ISTRTR+132                                               05215000
RTRRSV01 EQU   ISTRTR+130                                               05216000
RTRCTECM EQU   ISTRTR+128                                               05217000
RTRADRPT EQU   RTRADR+1                                                 05218000
RTRRSV22 EQU   RTRFLAG                                                  05219000
RTRVTERM EQU   RTRFLAG                                                  05220000
RTRRSV51 EQU   RTRFLAG                                                  05221000
RTRRBISA EQU   RTRFLAG                                                  05222000
RTRRSV21 EQU   RTRFLAG                                                  05223000
RTRCRPR  EQU   ISTRTR                                                   05224000
RCLRVPT2 EQU   ISTRCL+92                                                05225000
RCLRVPT1 EQU   ISTRCL+88                                                05226000
RCLGPOLA EQU   ISTRCL+84                                                05227000
RCLCTNGP EQU   ISTRCL+82                                                05228000
RCLRSV01 EQU   ISTRCL+80                                                05229000
RCLCTECM EQU   ISTRCL+78                                                05230000
RCLCTETR EQU   ISTRCL+76                                                05231000
RCLGPADR EQU   RCLADR+1                                                 05232000
RCLRSV33 EQU   RCLFLAG                                                  05233000
RCLBATCH EQU   RCLFLAG                                                  05234000
RCLRBISA EQU   RCLFLAG                                                  05235000
RCLRSV22 EQU   RCLFLAG                                                  05236000
RCLPRE   EQU   ISTRCL                                                   05237000
RPTRSV03 EQU   ISTRPT+156                                               05238000
RPTRSV02 EQU   ISTRPT+152                                               05239000
RPTNSNSV EQU   ISTRPT+148                                               05240000
RPTPTHCT EQU   ISTRPT+146                                               05241000
RPTPEPCT EQU   ISTRPT+144                                               05242000
RPTDAFSV EQU   ISTRPT+142                                               05243000
RPTRSV01 EQU   ISTRPT+141                                               05244000
RPTISTAT EQU   RPTFLAG1                                                 05245000
RPTDYNAM EQU   RPTFLAG1                                                 05246000
RPTVYIMM EQU   RPTFLAG1                                                 05247000
RPTVIODN EQU   RPTFLAG1                                                 05248000
RPTONLIN EQU   RPTFLAG1                                                 05249000
RPTHLVPD EQU   RPTFLAG1                                                 05250000
RPTVRYPD EQU   RPTFLAG1                                                 05251000
RPTASLEP EQU   RPTFLAG1                                                 05252000
RPTUTERM EQU   ISTRPT+136                                               05253000
RPTATERM EQU   ISTRPT+132                                               05254000
RPTDIVT  EQU   RPTDITT                                                  05255000
RPTCTNM  EQU   ISTRPT+120                                               05256000
RPTLNDAF EQU   RPTLNCID+2                                               05257000
RPTLNSAF EQU   RPTLNCID                                                 05258000
RPTLN    EQU   ISTRPT                                                   05259000
RLNRVPT2 EQU   ISTRLN+112                                               05260000
RLNNCSPL EQU   ISTRLN+108                                               05261000
RLNX2SW  EQU   ISTRLN+104                                               05262000
@NM00033 EQU   ISTRLN+103                                               05263000
RLNCRRSV EQU   RLNCRFLG                                                 05264000
RLNSWEP  EQU   RLNCRFLG                                                 05265000
RLNSVSKP EQU   RLNLSCMD                                                 05266000
RLNSESLM EQU   RLNLSCMD                                                 05267000
RLNNPRLM EQU   RLNLSCMD                                                 05268000
RLNSWNCP EQU   RLNCRFLG                                                 05269000
RLNACTLN EQU   RLNCRFLG                                                 05270000
RLNPAUSE EQU   ISTRLN+101                                               05271000
RLNPOLMT EQU   ISTRLN+100                                               05272000
RLNACTSN EQU   ISTRLN+98                                                05273000
RLNRESV1 EQU   ISTRLN+97                                                05274000
RLNACTRM EQU   ISTRLN+96                                                05275000
RLNCTSES EQU   ISTRLN+95                                                05276000
RLNRDSLM EQU   ISTRLN+94                                                05277000
RLNAUTOA EQU   ISTRLN+92                                                05278000
RLNRDFD  EQU   RLNRDF+3                                                 05279000
RLNRDFC  EQU   RLNRDF+2                                                 05280000
RLNMULTP EQU   RLNRDFB                                                  05281000
RLNRATRN EQU   RLNRDFB                                                  05282000
RLNRAPOL EQU   RLNRDFB                                                  05283000
RLNTTV   EQU   RLNRDFB                                                  05284000
RLNRSV0B EQU   RLNRDFB                                                  05285000
RLNAUTOD EQU   RLNRDFB                                                  05286000
RLNANSWR EQU   RLNRDFB                                                  05287000
RLNRBUSE EQU   RLNRDFB                                                  05288000
RLNRAPEP EQU   RLNRDFA                                                  05289000
RLNRANCP EQU   RLNRDFA                                                  05290000
RLNRAEP  EQU   RLNRDFA                                                  05291000
RLNIDV   EQU   RLNRDFA                                                  05292000
RLNPORT  EQU   RLNRDFA                                                  05293000
RLNGANSW EQU   RLNRDFA                                                  05294000
RLNRACAN EQU   RLNRACNT                                                 05295000
RLNRACAT EQU   RLNRACNT                                                 05296000
RLNRSV04 EQU   RLNSTAT2                                                 05297000
RLNINUSE EQU   RLNSTAT2                                                 05298000
RLNOHIN  EQU   RLNSTAT2                                                 05299000
RLNRSV03 EQU   RLNSTAT1                                                 05300000
RLNVD    EQU   RLNSTAT1                                                 05301000
RLNINOPP EQU   RLNSTAT1                                                 05302000
RLNINOPL EQU   RLNSTAT1                                                 05303000
RLNLRST  EQU   RLNSTAT1                                                 05304000
RLNTRAP  EQU   RLNSTAT1                                                 05305000
RLNACTCT EQU   ISTRLN+84                                                05306000
RLNCTECM EQU   ISTRLN+82                                                05307000
RLNCTEIN EQU   ISTRLN+80                                                05308000
RLNCTETR EQU   ISTRLN+78                                                05309000
RLNCTECL EQU   ISTRLN+76                                                05310000
RLNCUA   EQU   RLNUCBAD                                                 05311000
RLNRSV01 EQU   RLNFLAG                                                  05312000
RLNRBISA EQU   RLNFLAG                                                  05313000
RLNEAM   EQU   RLNFLAG                                                  05314000
RLNPRE   EQU   ISTRLN                                                   05315000
RGPRVPT2 EQU   ISTRGP+88                                                05316000
RGPRVPT1 EQU   ISTRGP+84                                                05317000
RGPCTECM EQU   ISTRGP+82                                                05318000
RGPCTEIN EQU   ISTRGP+80                                                05319000
RGPCTETR EQU   ISTRGP+78                                                05320000
RGPCTECL EQU   ISTRGP+76                                                05321000
RGPCTELN EQU   ISTRGP+74                                                05322000
RGPRSV03 EQU   ISTRGP+73                                                05323000
RGPRSV02 EQU   RGPFLG                                                   05324000
RGPASDLC EQU   RGPFLG                                                   05325000
RGPABSC  EQU   RGPFLG                                                   05326000
RGPASS   EQU   RGPFLG                                                   05327000
RGPADIL  EQU   RGPFLG                                                   05328000
RGPPRE   EQU   ISTRGP                                                   05329000
RRNRINNM EQU   ISTRRN+248                                               05330000
@NM00032 EQU   ISTRRN+247                                               05331000
RRNRDCUA EQU   ISTRRN+244                                               05332000
RRNLASTE EQU   ISTRRN+240                                               05333000
RRNNCSPL EQU   ISTRRN+236                                               05334000
RRNRPLPT EQU   ISTRRN+232                                               05335000
RRNMSIZE EQU   ISTRRN+228                                               05336000
RRNNCPNM EQU   ISTRRN+221                                               05337000
RRNCTPCC EQU   ISTRRN+220                                               05338000
RRNHBUFS EQU   ISTRRN+218                                               05339000
RRNHLENT EQU   RRNHPRE+1                                                05340000
RRNHLENH EQU   RRNHPRE                                                  05341000
RRNNMNCP EQU   ISTRRN+208                                               05342000
RRNDELAY EQU   ISTRRN+206                                               05343000
RRNRSV04 EQU   ISTRRN+200                                               05344000
RRNRSV88 EQU   RRNNMDPD+7                                               05345000
RRNPUBI  EQU   RRNNMDPD+6                                               05346000
RRNDPLUB EQU   RRNNMDPD                                                 05347000
RRNEPADR EQU   ISTRRN+190                                               05348000
RRNCPLUB EQU   ISTRRN+184                                               05349000
RRNFLUX  EQU   ISTRRN+180                                               05350000
RRNRSV05 EQU   RRNCMFD                                                  05351000
RRNREMPO EQU   RRNCMFD                                                  05352000
RRNCDREC EQU   RRNCMFD                                                  05353000
RRNCDDSI EQU   RRNCMFD                                                  05354000
RRNCDBCK EQU   RRNCMFD                                                  05355000
RRNCDDTL EQU   RRNCMFD                                                  05356000
RRNCDSTD EQU   RRNCMFD                                                  05357000
RRNCDCSP EQU   RRNCMFD                                                  05358000
RRNCCCSL EQU   RRNCMFC                                                  05359000
RRNCCSIM EQU   RRNCMFC                                                  05360000
RRNCCRCM EQU   RRNCMFC                                                  05361000
RRNCCRIM EQU   RRNCMFC                                                  05362000
RRNCCCRC EQU   RRNCMFC                                                  05363000
RRNCCRST EQU   RRNCMFC                                                  05364000
RRNCCRDQ EQU   RRNCMFC                                                  05365000
RRNCCRCN EQU   RRNCMFC                                                  05366000
RRNCBALT EQU   RRNCMFB                                                  05367000
RRNCBMOD EQU   RRNCMFB                                                  05368000
RRNCBNPL EQU   RRNCMFB                                                  05369000
RRNCBRLS EQU   RRNCMFB                                                  05370000
RRNCBRDS EQU   RRNCMFB                                                  05371000
RRNCBDLR EQU   RRNCMFB                                                  05372000
RRNCBDLH EQU   RRNCMFB                                                  05373000
RRNCBDLO EQU   RRNCMFB                                                  05374000
RRNCADGO EQU   RRNCMFA                                                  05375000
RRNCADTD EQU   RRNCMFA                                                  05376000
RRNCACDT EQU   RRNCMFA                                                  05377000
RRNCAMBH EQU   RRNCMFA                                                  05378000
RRNCAATI EQU   RRNCMFA                                                  05379000
RRNCAATG EQU   RRNCMFA                                                  05380000
RRNCAATD EQU   RRNCMFA                                                  05381000
RRNCAALL EQU   RRNCMFA                                                  05382000
RRNRSV55 EQU   RRNRDF+3                                                 05383000
RRNPTASL EQU   RRNRDFB+1                                                05384000
RRNRSV01 EQU   RRNRDFB+1                                                05385000
RRNVYDON EQU   RRNRDFB+1                                                05386000
RRNRBBUP EQU   RRNRDFB+1                                                05387000
RRNRSV03 EQU   RRNRDFB                                                  05388000
RRNRBCT2 EQU   RRNRDFB                                                  05389000
RRNRBCT1 EQU   RRNRDFB                                                  05390000
RRNRBSEC EQU   RRNRDFB                                                  05391000
RRNRBCCT EQU   RRNRDFB                                                  05392000
RRNRBCCL EQU   RRNRDFB                                                  05393000
RRNRSV02 EQU   RRNRDFB                                                  05394000
RRNRBMDL EQU   RRNRDFB                                                  05395000
RRNRAPEP EQU   RRNRDFA                                                  05396000
RRNRANCP EQU   RRNRDFA                                                  05397000
RRNRBREM EQU   RRNRDFA                                                  05398000
RRNRAOLT EQU   RRNRDFA                                                  05399000
RRNRASYN EQU   RRNRDFA                                                  05400000
RRNRADMP EQU   RRNRDFA                                                  05401000
RRNRAIPL EQU   RRNRDFA                                                  05402000
RRNRASHT EQU   RRNRDFA                                                  05403000
RRNCTENT EQU   ISTRRN+170                                               05404000
RRNCTECM EQU   ISTRRN+168                                               05405000
RRNCTEIN EQU   ISTRRN+166                                               05406000
RRNCTETR EQU   ISTRRN+164                                               05407000
RRNCTECL EQU   ISTRRN+162                                               05408000
RRNCTELI EQU   ISTRRN+160                                               05409000
RRNCTEGP EQU   ISTRRN+158                                               05410000
RRNCTBHS EQU   ISTRRN+156                                               05411000
RRNBHSET EQU   ISTRRN+152                                               05412000
RRNTRENT EQU   ISTRRN+148                                               05413000
RRNRLDIP EQU   ISTRRN+147                                               05414000
RRNRNCUA EQU   ISTRRN+144                                               05415000
RRNGRPA  EQU   ISTRRN+140                                               05416000
RRNLUBA  EQU   RRNUCBAD+1                                               05417000
RRNCHQI  EQU   RRNUCBAD                                                 05418000
RRNRSV11 EQU   RRNFLAG                                                  05419000
RRNDSTCT EQU   RRNFLAG                                                  05420000
RRNERPIP EQU   RRNFLAG                                                  05421000
RRNLCDIP EQU   RRNFLAG                                                  05422000
RRNLCDIE EQU   RRNFLAG                                                  05423000
RRNLCSIP EQU   RRNFLAG                                                  05424000
RRNRBISA EQU   RRNFLAG                                                  05425000
RRNRSV89 EQU   RRNFLAG                                                  05426000
RRNPRE   EQU   ISTRRN                                                   05427000
RLCRVPT2 EQU   ISTRLC+80                                                05428000
RLCRVPT1 EQU   ISTRLC+79                                                05429000
RLCLCCUA EQU   ISTRLC+76                                                05430000
RLCUCBAD EQU   RLCADR+1                                                 05431000
RLCRSVDE EQU   RLCFLAG                                                  05432000
RLCACNT  EQU   RLCFLAG                                                  05433000
RLCRSV14 EQU   RLCFLAG                                                  05434000
RLCRBISA EQU   RLCFLAG                                                  05435000
RLCRSV22 EQU   RLCFLAG                                                  05436000
RLCPRE   EQU   ISTRLC                                                   05437000
RAPRVPT2 EQU   ISTRAP+116                                               05438000
RAPRVPT1 EQU   ISTRAP+112                                               05439000
RAPBFACT EQU   ISTRAP+111                                               05440000
RAPRSV17 EQU   RAPFLGC                                                  05441000
RAPRSV16 EQU   RAPFLGC                                                  05442000
RAPRSV15 EQU   RAPFLGC                                                  05443000
RAPRSV14 EQU   RAPFLGC                                                  05444000
RAPRSV13 EQU   RAPFLGC                                                  05445000
RAPRSV12 EQU   RAPFLGC                                                  05446000
RAPRSV11 EQU   RAPFLGC                                                  05447000
RAPRSV10 EQU   RAPFLGC                                                  05448000
RAPRSV09 EQU   RAPFLGB                                                  05449000
RAPASPO  EQU   RAPFLGB                                                  05450000
RAPAPPO  EQU   RAPFLGB                                                  05451000
RAPAACQ  EQU   RAPFLGB                                                  05452000
RAPAPRMT EQU   RAPFLGB                                                  05453000
RAPAPASS EQU   RAPFLGB                                                  05454000
RAPABLCK EQU   RAPFLGB                                                  05455000
RAPALLF  EQU   RAPFLGB                                                  05456000
RAPRSV06 EQU   RAPFLG                                                   05457000
RAPRSV05 EQU   RAPFLG                                                   05458000
RAPRSV04 EQU   RAPFLG                                                   05459000
RAPRSV03 EQU   RAPFLG                                                   05460000
RAPATLGN EQU   RAPFLG                                                   05461000
RAPASLGI EQU   RAPFLG                                                   05462000
RAPAQUI  EQU   RAPFLG                                                   05463000
RAPABLGN EQU   RAPFLG                                                   05464000
RAPACEQD EQU   ISTRAP+106                                               05465000
RAPTRPRE EQU   ISTRAP+104                                               05466000
RAPACEAP EQU   ISTRAP+100                                               05467000
RAPICEAQ EQU   ISTRAP+96                                                05468000
RAPICEAC EQU   ISTRAP+92                                                05469000
RAPICELG EQU   ISTRAP+88                                                05470000
RAPAPPWD EQU   ISTRAP+80                                                05471000
RAPACDEB EQU   ISTRAP+76                                                05472000
RAPACBA  EQU   ISTRAP+72                                                05473000
RAPPRE   EQU   ISTRAP                                                   05474000
RDTVSRPL EQU   ISTRDT+132                                               05475000
RDTCRSPW EQU   ISTRDT+124                                               05476000
RDTCRSDS EQU   ISTRDT+116                                               05477000
@NM00031 EQU   ISTRDT+113                                               05478000
RRNSTCNT EQU   RDTSTCNT                                                 05479000
RRNVYRPH EQU   RDTVYRPH                                                 05480000
RDTTPAB  EQU   ISTRDT+104                                               05481000
RDTDPAB  EQU   ISTRDT+100                                               05482000
RDTEPAB  EQU   ISTRDT+96                                                05483000
RDTVPAB  EQU   ISTRDT+92                                                05484000
RDTRSV01 EQU   RDTFLAGB                                                 05485000
RDTBHSET EQU   RDTFLAGB                                                 05486000
RDTCTCFL EQU   RDTFLAGB                                                 05487000
RDTCTPGD EQU   RDTFLAGB                                                 05488000
RDTPRGDN EQU   RDTFLAGB                                                 05489000
RDTOUERP EQU   RDTFLAGB                                                 05490000
RDTLGCT  EQU   ISTRDT+90                                                05491000
RDTNODID EQU   ISTRDT+89                                                05492000
RDTMAXID EQU   ISTRDT+88                                                05493000
RDTCTSNT EQU   ISTRDT+86                                                05494000
RDTFLAGS EQU   ISTRDT+84                                                05495000
RDTBACK  EQU   ISTRDT+80                                                05496000
RDTFORW  EQU   ISTRDT+76                                                05497000
RDTLEN   EQU   RDTPLEN+1                                                05498000
RDTPRILS EQU   RDTPRIOR                                                 05499000
RDTPRISW EQU   RDTPRIOR                                                 05500000
RDTPRIRN EQU   RDTPRIOR                                                 05501000
RDTPRILC EQU   RDTPRIOR                                                 05502000
RDTPRIAP EQU   RDTPRIOR                                                 05503000
@NM00030 EQU   RDTPRIOR                                                 05504000
RDTPRE   EQU   ISTRDT                                                   05505000
RCPRSV05 EQU   ISTRCPRE+120                                             05506000
RCPRSV04 EQU   ISTRCPRE+116                                             05507000
RCPRSV03 EQU   ISTRCPRE+112                                             05508000
RCPINTA  EQU   RCPLGNIN+16                                              05509000
RCPLGNCT EQU   RCPLGNIN+8                                               05510000
RCPLGNAP EQU   RCPLGNIN                                                 05511000
@NM00029 EQU   RCPPMODE                                                 05512000
RCPRRECD EQU   RCPPMODE                                                 05513000
RCPRBASC EQU   RCPPMODE                                                 05514000
RCPBFLIM EQU   ISTRCPRE+90                                              05515000
RCPBHSI2 EQU   ISTRCPRE+89                                              05516000
RCPBHSI1 EQU   ISTRCPRE+88                                              05517000
RCPACETR EQU   ISTRCPRE+84                                              05518000
RCPICEAQ EQU   ISTRCPRE+80                                              05519000
RCPLNAPA EQU   ISTRCPRE+76                                              05520000
RCPICELN EQU   ISTRCPRE+72                                              05521000
RCPPRE   EQU   ISTRCPRE                                                 05522000
RPRCONID EQU   ISTRPRE+63                                               05523000
RPRCLVPD EQU   RPRFLAGC                                                 05524000
RPRINIMM EQU   RPRFLAGD                                                 05525000
RPRRSV05 EQU   RPRFLAGD                                                 05526000
RPRCONP  EQU   RPRFLAGD                                                 05527000
RPRACTP  EQU   RPRFLAGD                                                 05528000
RPRRSON  EQU   RPRFLAGD                                                 05529000
RPRCONCT EQU   RPRFLAGD                                                 05530000
RPRLTASN EQU   RPRFLAGD                                                 05531000
RPRPTHCT EQU   ISTRPRE+60                                               05532000
RPRSWDAF EQU   ISTRPRE+58                                               05533000
RPRSTPCT EQU   ISTRPRE+56                                               05534000
RPRRVPT1 EQU   ISTRPRE+52                                               05535000
RPRDEVCH EQU   ISTRPRE+44                                               05536000
RPRNCBA  EQU   ISTRPRE+40                                               05537000
RPRNSNEA EQU   ISTRPRE+36                                               05538000
RPRLGONB EQU   ISTRPRE+32                                               05539000
RPRLGONF EQU   ISTRPRE+28                                               05540000
RPRHDTYP EQU   ISTRPRE+27                                               05541000
RPRTIOCT EQU   ISTRPRE+26                                               05542000
RPRPEPCT EQU   ISTRPRE+24                                               05543000
RPRRSV03 EQU   RPRCAUSE                                                 05544000
RPRRSYNC EQU   RPRCAUSE                                                 05545000
RPRCRCPT EQU   RPRCAUSE                                                 05546000
RPRNOSRT EQU   RPRCAUSE                                                 05547000
RPRINTST EQU   RPRFLAGB                                                 05548000
RPRVYIMM EQU   RPRFLAGB                                                 05549000
RPRHLVPD EQU   RPRFLAGB                                                 05550000
RPRONLIN EQU   RPRFLAGB                                                 05551000
RPRVIODN EQU   RPRFLAGB                                                 05552000
RPRAOPN  EQU   RPRFLAGB                                                 05553000
RPRENTVT EQU   RPRFLAGB                                                 05554000
RPRENTVH EQU   RPRFLAGB                                                 05555000
RPRLIVE  EQU   RPRFLAGA                                                 05556000
RPRVRYPD EQU   RPRFLAGA                                                 05557000
RPRENTED EQU   RPRFLAGA                                                 05558000
RPRENTIO EQU   RPRFLAGA                                                 05559000
RPRENTBF EQU   RPRFLAGA                                                 05560000
RPRTIED  EQU   RPRFLAGA                                                 05561000
RPRINV   EQU   RPRFLAGA                                                 05562000
RPRACT   EQU   RPRFLAGA                                                 05563000
RPRENTRY EQU   ISTRPRE+20                                               05564000
RPRPELEN EQU   ISTRPRE+18                                               05565000
RPRELEN  EQU   ISTRPRE+16                                               05566000
RPRRLOCK EQU   ISTRPRE+12                                               05567000
RPRSAF   EQU   RPRCOMID                                                 05568000
RPRNAME  EQU   ISTRPRE                                                  05569000
DEVRSV03 EQU   ISTDEVCH+5                                               05570000
DEVPHYSA EQU   ISTDEVCH+4                                               05571000
DEVCSLPN EQU   DEVCHAR3                                                 05572000
DEVCSTCL EQU   DEVCHAR3                                                 05573000
DEVCCHEK EQU   DEVCHAR3                                                 05574000
DEVCATTN EQU   DEVCHAR3                                                 05575000
DEVCSWL  EQU   DEVFCCTL                                                 05576000
DEVCRVB  EQU   DEVFCCTL                                                 05577000
DEVCSSL  EQU   DEVFCCTL                                                 05578000
DEVCBSC  EQU   DEVFCCTL                                                 05579000
DEVMCODE EQU   ISTDEVCH+2                                               05580000
DEVCHAR2 EQU   DEVTCODE                                                 05581000
DEVRSV01 EQU   DEVCHAR                                                  05582000
DEVCCTL  EQU   DEVCHAR                                                  05583000
DEVNNSPT EQU   DEVCHAR                                                  05584000
DEVSPS   EQU   DEVCHAR                                                  05585000
DEVSUBND EQU   DEVCHAR                                                  05586000
DEVCONVR EQU   DEVCHAR                                                  05587000
DEVOTPUT EQU   DEVCHAR                                                  05588000
DEVINPUT EQU   DEVCHAR                                                  05589000
LOKXCL   EQU   @NM00027                                                 05590000
LOKPRY   EQU   @NM00027                                                 05591000
@NM00028 EQU   @NM00027                                                 05592000
@NM00026 EQU   LOKCHNG                                                  05593000
LOKCT    EQU   ISTLOK                                                   05594000
RSAR12   EQU   RSARSA+56                                                05595000
RSAR11   EQU   RSARSA+52                                                05596000
RSAR10   EQU   RSARSA+48                                                05597000
RSAR09   EQU   RSARSA+44                                                05598000
RSAR08   EQU   RSARSA+40                                                05599000
RSAR07   EQU   RSARSA+36                                                05600000
RSAR06   EQU   RSARSA+32                                                05601000
RSAR05   EQU   RSARSA+28                                                05602000
RSAR04   EQU   RSARSA+24                                                05603000
RSAR03   EQU   RSARSA+20                                                05604000
RSAR02   EQU   RSARSA+16                                                05605000
RSAR01   EQU   RSARSA+12                                                05606000
RSAR00   EQU   RSARSA+8                                                 05607000
RSAR15   EQU   RSARSA+4                                                 05608000
RSAR14   EQU   RSARSA                                                   05609000
@NM00048 EQU   ISTRSA                                                   05610000
VYCRSV02 EQU   ISTVYCRR+128                                             05611000
VYCRSV04 EQU   ISTVYCRR+126                                             05612000
VYCRRCW3 EQU   ISTVYCRR+118                                             05613000
VYCRRSAV EQU   ISTVYCRR+46                                              05614000
VYCRSV03 EQU   VYCCRT+11                                                05615000
CINCFE   EQU   VYCCRT+11                                                05616000
CINCE9   EQU   VYCCRT+11                                                05617000
CINCVO   EQU   VYCCRT+11                                                05618000
CINCR5   EQU   VYCCRT+11                                                05619000
CINCR3   EQU   VYCCRT+10                                                05620000
CINCE8   EQU   VYCCRT+10                                                05621000
CINCE7   EQU   VYCCRT+10                                                05622000
CINCE6   EQU   VYCCRT+10                                                05623000
CINCE5   EQU   VYCCRT+10                                                05624000
CINCE1   EQU   VYCCRT+10                                                05625000
CINCUQ   EQU   VYCCRT+10                                                05626000
CINCUB   EQU   VYCCRT+10                                                05627000
CINCUA   EQU   VYCCRT+9                                                 05628000
CINCX9   EQU   VYCCRT+9                                                 05629000
CINCX8   EQU   VYCCRT+9                                                 05630000
CINCX7   EQU   VYCCRT+9                                                 05631000
CINCX6   EQU   VYCCRT+9                                                 05632000
CINCX3   EQU   VYCCRT+9                                                 05633000
CINCX2   EQU   VYCCRT+9                                                 05634000
CINCX1   EQU   VYCCRT+9                                                 05635000
CINCX0   EQU   VYCCRT+8                                                 05636000
CINCW9   EQU   VYCCRT+8                                                 05637000
CINCW8   EQU   VYCCRT+8                                                 05638000
CINCW7   EQU   VYCCRT+8                                                 05639000
CINCW6   EQU   VYCCRT+8                                                 05640000
CINCW5   EQU   VYCCRT+8                                                 05641000
CINCW4   EQU   VYCCRT+8                                                 05642000
CINCW2   EQU   VYCCRT+8                                                 05643000
CINCW0   EQU   VYCCRT+7                                                 05644000
CINCV9   EQU   VYCCRT+7                                                 05645000
CINCV8   EQU   VYCCRT+7                                                 05646000
CINCV7   EQU   VYCCRT+7                                                 05647000
CINCV6   EQU   VYCCRT+7                                                 05648000
CINCV5   EQU   VYCCRT+7                                                 05649000
CINCV4   EQU   VYCCRT+7                                                 05650000
CINCV3   EQU   VYCCRT+7                                                 05651000
CINCV2   EQU   VYCCRT+6                                                 05652000
CINCU8   EQU   VYCCRT+6                                                 05653000
CINCU7   EQU   VYCCRT+6                                                 05654000
CINCU6   EQU   VYCCRT+6                                                 05655000
CINCU5   EQU   VYCCRT+6                                                 05656000
CINCU4   EQU   VYCCRT+6                                                 05657000
CINCU3   EQU   VYCCRT+6                                                 05658000
CINCU2   EQU   VYCCRT+6                                                 05659000
CINCU1   EQU   VYCCRT+5                                                 05660000
CINCU0   EQU   VYCCRT+5                                                 05661000
CINCUM   EQU   VYCCRT+5                                                 05662000
CINCS1   EQU   VYCCRT+5                                                 05663000
CINCL8   EQU   VYCCRT+5                                                 05664000
CINCL7   EQU   VYCCRT+5                                                 05665000
CINCL6   EQU   VYCCRT+5                                                 05666000
CINCL5   EQU   VYCCRT+5                                                 05667000
CINCL4   EQU   VYCCRT+4                                                 05668000
CINCL3   EQU   VYCCRT+4                                                 05669000
CINCL2   EQU   VYCCRT+4                                                 05670000
CINCL1   EQU   VYCCRT+4                                                 05671000
CINCL0   EQU   VYCCRT+4                                                 05672000
CINCF4   EQU   VYCCRT+4                                                 05673000
CINCF3   EQU   VYCCRT+4                                                 05674000
CINCF1   EQU   VYCCRT+4                                                 05675000
CINCFM   EQU   VYCCRT+3                                                 05676000
CINCE4   EQU   VYCCRT+3                                                 05677000
CINCE3   EQU   VYCCRT+3                                                 05678000
CINCE2   EQU   VYCCRT+3                                                 05679000
CINCE0   EQU   VYCCRT+3                                                 05680000
CINCD9   EQU   VYCCRT+3                                                 05681000
CINCD8   EQU   VYCCRT+3                                                 05682000
CINCD7   EQU   VYCCRT+3                                                 05683000
CINCD6   EQU   VYCCRT+2                                                 05684000
CINCD5   EQU   VYCCRT+2                                                 05685000
CINCD4   EQU   VYCCRT+2                                                 05686000
CINCD3   EQU   VYCCRT+2                                                 05687000
CINCD2   EQU   VYCCRT+2                                                 05688000
CINCD1   EQU   VYCCRT+2                                                 05689000
CINCIP   EQU   VYCCRT+2                                                 05690000
CINCR2   EQU   VYCCRT+2                                                 05691000
CINCMS   EQU   VYCCRT+1                                                 05692000
CINCVN   EQU   VYCCRT+1                                                 05693000
CINCVS   EQU   VYCCRT+1                                                 05694000
CINCVP   EQU   VYCCRT+1                                                 05695000
CINCVX   EQU   VYCCRT+1                                                 05696000
CINCFS   EQU   VYCCRT+1                                                 05697000
CINCSM   EQU   VYCCRT+1                                                 05698000
CINCR1   EQU   VYCCRT+1                                                 05699000
CINCLF   EQU   VYCCRT                                                   05700000
CINCVA   EQU   VYCCRT                                                   05701000
CINCVI   EQU   VYCCRT                                                   05702000
CINCMD   EQU   VYCCRT                                                   05703000
CINCMY   EQU   VYCCRT                                                   05704000
CINCDL   EQU   VYCCRT                                                   05705000
CINCIO   EQU   VYCCRT                                                   05706000
CINCCL   EQU   VYCCRT                                                   05707000
VYCRSV01 EQU   VYCNTRD+11                                               05708000
NINCFE   EQU   VYCNTRD+11                                               05709000
NINCE9   EQU   VYCNTRD+11                                               05710000
NINCVO   EQU   VYCNTRD+11                                               05711000
NINCR5   EQU   VYCNTRD+11                                               05712000
NINCR3   EQU   VYCNTRD+10                                               05713000
NINCE8   EQU   VYCNTRD+10                                               05714000
NINCE7   EQU   VYCNTRD+10                                               05715000
NINCE6   EQU   VYCNTRD+10                                               05716000
NINCE5   EQU   VYCNTRD+10                                               05717000
NINCE1   EQU   VYCNTRD+10                                               05718000
NINCUQ   EQU   VYCNTRD+10                                               05719000
NINCUB   EQU   VYCNTRD+10                                               05720000
NINCUA   EQU   VYCNTRD+9                                                05721000
NINCX9   EQU   VYCNTRD+9                                                05722000
NINCX8   EQU   VYCNTRD+9                                                05723000
NINCX7   EQU   VYCNTRD+9                                                05724000
NINCX6   EQU   VYCNTRD+9                                                05725000
NINCX3   EQU   VYCNTRD+9                                                05726000
NINCX2   EQU   VYCNTRD+9                                                05727000
NINCX1   EQU   VYCNTRD+9                                                05728000
NINCX0   EQU   VYCNTRD+8                                                05729000
NINCW9   EQU   VYCNTRD+8                                                05730000
NINCW8   EQU   VYCNTRD+8                                                05731000
NINCW7   EQU   VYCNTRD+8                                                05732000
NINCW6   EQU   VYCNTRD+8                                                05733000
NINCW5   EQU   VYCNTRD+8                                                05734000
NINCW4   EQU   VYCNTRD+8                                                05735000
NINCW2   EQU   VYCNTRD+8                                                05736000
NINCW0   EQU   VYCNTRD+7                                                05737000
NINCV9   EQU   VYCNTRD+7                                                05738000
NINCV8   EQU   VYCNTRD+7                                                05739000
NINCV7   EQU   VYCNTRD+7                                                05740000
NINCV6   EQU   VYCNTRD+7                                                05741000
NINCV5   EQU   VYCNTRD+7                                                05742000
NINCV4   EQU   VYCNTRD+7                                                05743000
NINCV3   EQU   VYCNTRD+7                                                05744000
NINCV2   EQU   VYCNTRD+6                                                05745000
NINCU8   EQU   VYCNTRD+6                                                05746000
NINCU7   EQU   VYCNTRD+6                                                05747000
NINCU6   EQU   VYCNTRD+6                                                05748000
NINCU5   EQU   VYCNTRD+6                                                05749000
NINCU4   EQU   VYCNTRD+6                                                05750000
NINCU3   EQU   VYCNTRD+6                                                05751000
NINCU2   EQU   VYCNTRD+6                                                05752000
NINCU1   EQU   VYCNTRD+5                                                05753000
NINCU0   EQU   VYCNTRD+5                                                05754000
NINCUM   EQU   VYCNTRD+5                                                05755000
NINCS1   EQU   VYCNTRD+5                                                05756000
NINCL8   EQU   VYCNTRD+5                                                05757000
NINCL7   EQU   VYCNTRD+5                                                05758000
NINCL6   EQU   VYCNTRD+5                                                05759000
NINCL5   EQU   VYCNTRD+5                                                05760000
NINCL4   EQU   VYCNTRD+4                                                05761000
NINCL3   EQU   VYCNTRD+4                                                05762000
NINCL2   EQU   VYCNTRD+4                                                05763000
NINCL1   EQU   VYCNTRD+4                                                05764000
NINCL0   EQU   VYCNTRD+4                                                05765000
NINCF4   EQU   VYCNTRD+4                                                05766000
NINCF3   EQU   VYCNTRD+4                                                05767000
NINCF1   EQU   VYCNTRD+4                                                05768000
NINCFM   EQU   VYCNTRD+3                                                05769000
NINCE4   EQU   VYCNTRD+3                                                05770000
NINCE3   EQU   VYCNTRD+3                                                05771000
NINCE2   EQU   VYCNTRD+3                                                05772000
NINCE0   EQU   VYCNTRD+3                                                05773000
NINCD9   EQU   VYCNTRD+3                                                05774000
NINCD8   EQU   VYCNTRD+3                                                05775000
NINCD7   EQU   VYCNTRD+3                                                05776000
NINCD6   EQU   VYCNTRD+2                                                05777000
NINCD5   EQU   VYCNTRD+2                                                05778000
NINCD4   EQU   VYCNTRD+2                                                05779000
NINCD3   EQU   VYCNTRD+2                                                05780000
NINCD2   EQU   VYCNTRD+2                                                05781000
NINCD1   EQU   VYCNTRD+2                                                05782000
NINCIP   EQU   VYCNTRD+2                                                05783000
NINCR2   EQU   VYCNTRD+2                                                05784000
NINCMS   EQU   VYCNTRD+1                                                05785000
NINCVN   EQU   VYCNTRD+1                                                05786000
NINCVS   EQU   VYCNTRD+1                                                05787000
NINCVP   EQU   VYCNTRD+1                                                05788000
NINCVX   EQU   VYCNTRD+1                                                05789000
NINCFS   EQU   VYCNTRD+1                                                05790000
NINCSM   EQU   VYCNTRD+1                                                05791000
NINCR1   EQU   VYCNTRD+1                                                05792000
NINCLF   EQU   VYCNTRD                                                  05793000
NINCVA   EQU   VYCNTRD                                                  05794000
NINCVI   EQU   VYCNTRD                                                  05795000
NINCMD   EQU   VYCNTRD                                                  05796000
NINCMY   EQU   VYCNTRD                                                  05797000
NINCDL   EQU   VYCNTRD                                                  05798000
NINCIO   EQU   VYCNTRD                                                  05799000
NINCCL   EQU   VYCNTRD                                                  05800000
VYCCNS   EQU   ISTVYCRR                                                 05801000
CNSRSV05 EQU   CNSTFLDB+2                                               05802000
CNSLOG0B EQU   CNSTFLDB+2                                               05803000
CNSACCTB EQU   CNSTFLDB+2                                               05804000
CNSFREEB EQU   CNSTFLDB+2                                               05805000
CNSGETSB EQU   CNSTFLDB+2                                               05806000
CNSSEARB EQU   CNSTFLDB+2                                               05807000
CNSQUEUB EQU   CNSTFLDB+2                                               05808000
CNSACONB EQU   CNSTFLDB+2                                               05809000
CNSTCONB EQU   CNSTFLDB+1                                               05810000
CNSCLAQB EQU   CNSTFLDB+1                                               05811000
CNSCLINB EQU   CNSTFLDB+1                                               05812000
CNSGBINB EQU   CNSTFLDB+1                                               05813000
CNSLGINB EQU   CNSTFLDB+1                                               05814000
CNSACINB EQU   CNSTFLDB+1                                               05815000
CNSPSINB EQU   CNSTFLDB+1                                               05816000
CNSRQRLB EQU   CNSTFLDB+1                                               05817000
CNSTRRLB EQU   CNSTFLDB                                                 05818000
CNSDORLB EQU   CNSTFLDB                                                 05819000
CNSRLINB EQU   CNSTFLDB                                                 05820000
CNSQREQB EQU   CNSTFLDB                                                 05821000
CNSXREQB EQU   CNSTFLDB                                                 05822000
CNSAQINB EQU   CNSTFLDB                                                 05823000
CNSAUTHB EQU   CNSTFLDB                                                 05824000
CNSMRINB EQU   CNSTFLDB                                                 05825000
CNSRSV01 EQU   CNSTFLDA+2                                               05826000
CNSLOG0A EQU   CNSTFLDA+2                                               05827000
CNSACCTA EQU   CNSTFLDA+2                                               05828000
CNSFREEA EQU   CNSTFLDA+2                                               05829000
CNSGETSA EQU   CNSTFLDA+2                                               05830000
CNSSEARA EQU   CNSTFLDA+2                                               05831000
CNSQUEUA EQU   CNSTFLDA+2                                               05832000
CNSACONA EQU   CNSTFLDA+2                                               05833000
CNSTCONA EQU   CNSTFLDA+1                                               05834000
CNSCLAQA EQU   CNSTFLDA+1                                               05835000
CNSCLINA EQU   CNSTFLDA+1                                               05836000
CNSGBINA EQU   CNSTFLDA+1                                               05837000
CNSLGINA EQU   CNSTFLDA+1                                               05838000
CNSACINA EQU   CNSTFLDA+1                                               05839000
CNSPSINA EQU   CNSTFLDA+1                                               05840000
CNSRQRLA EQU   CNSTFLDA+1                                               05841000
CNSTRRLA EQU   CNSTFLDA                                                 05842000
CNSDORLA EQU   CNSTFLDA                                                 05843000
CNSRLINA EQU   CNSTFLDA                                                 05844000
CNSQREQA EQU   CNSTFLDA                                                 05845000
CNSXREQA EQU   CNSTFLDA                                                 05846000
CNSAQINA EQU   CNSTFLDA                                                 05847000
CNSAUTHA EQU   CNSTFLDA                                                 05848000
CNSMRINA EQU   CNSTFLDA                                                 05849000
CNSTPFX  EQU   ISTCNSTA                                                 05850000
CRACHAIN EQU   ISTCRA+928                                               05851000
CRARSV02 EQU   ISTCRA+924                                               05852000
CRARSV01 EQU   ISTCRA+920                                               05853000
CRABFTBA EQU   CRABUFA                                                  05854000
CRAMASK  EQU   CRASVC+64                                                05855000
CRAHSIZ  EQU   CRASVC+60                                                05856000
CRAASCRR EQU   CRASVC                                                   05857000
CRAPROCR EQU   ISTCRA+312                                               05858000
CRAPSS   EQU   ISTCRA+160                                               05859000
CRARPH   EQU   ISTCRA+52                                                05860000
CRALAPTR EQU   CRABASIC+48                                              05861000
CRAL9PTR EQU   CRABASIC+44                                              05862000
CRAL8PTR EQU   CRABASIC+40                                              05863000
CRAL7PTR EQU   CRABASIC+36                                              05864000
CRAL6PTR EQU   CRABASIC+32                                              05865000
CRAL5PTR EQU   CRABASIC+28                                              05866000
CRAL4PTR EQU   CRABASIC+24                                              05867000
CRAL3PTR EQU   CRABASIC+20                                              05868000
CRAL2PTR EQU   CRABASIC+16                                              05869000
CRAL1PTR EQU   CRABASIC+12                                              05870000
CRALEV01 EQU   CRALKACT+3                                               05871000
CRALEV02 EQU   CRALKACT+3                                               05872000
CRALEV03 EQU   CRALKACT+3                                               05873000
CRALEV04 EQU   CRALKACT+3                                               05874000
CRALEV05 EQU   CRALKACT+3                                               05875000
CRALEV06 EQU   CRALKACT+3                                               05876000
CRALEV07 EQU   CRALKACT+3                                               05877000
CRALEV08 EQU   CRALKACT+3                                               05878000
CRALEV09 EQU   CRALKACT+2                                               05879000
CRALEV10 EQU   CRALKACT+2                                               05880000
CRALEV11 EQU   CRALKACT+2                                               05881000
CRALEV12 EQU   CRALKACT+2                                               05882000
CRALEV13 EQU   CRALKACT+2                                               05883000
CRALEV14 EQU   CRALKACT+2                                               05884000
CRALEV15 EQU   CRALKACT+2                                               05885000
CRALEV16 EQU   CRALKACT+2                                               05886000
CRALEV17 EQU   CRALKACT+1                                               05887000
CRALEV18 EQU   CRALKACT+1                                               05888000
CRALEV19 EQU   CRALKACT+1                                               05889000
CRALEV20 EQU   CRALKACT+1                                               05890000
CRALEV21 EQU   CRALKACT+1                                               05891000
CRALEV22 EQU   CRALKACT+1                                               05892000
CRALEV23 EQU   CRALKACT+1                                               05893000
CRALEV24 EQU   CRALKACT+1                                               05894000
CRALEV25 EQU   CRALKACT                                                 05895000
CRALEV26 EQU   CRALKACT                                                 05896000
CRALEV27 EQU   CRALKACT                                                 05897000
CRALEV28 EQU   CRALKACT                                                 05898000
CRALEV29 EQU   CRALKACT                                                 05899000
CRALEV30 EQU   CRALKACT                                                 05900000
CRALEV31 EQU   CRALKACT                                                 05901000
CRALEV32 EQU   CRALKACT                                                 05902000
CRAFRR   EQU   CRAHDR+4                                                 05903000
@NM00025 EQU   ISTAPCRR+137                                             05904000
@NM00024 EQU   APC57FLG                                                 05905000
APCNREL  EQU   APC57FLG                                                 05906000
APCRECRA EQU   APC57FLG                                                 05907000
@NM00023 EQU   APC54FLG                                                 05908000
APCRLST  EQU   APC54FLG                                                 05909000
APCPR153 EQU   APC53FLG                                                 05910000
@NM00022 EQU   APC52FLG                                                 05911000
APCWKF   EQU   APC52FLG                                                 05912000
APCNWF   EQU   APC52FLG                                                 05913000
APCRDQ   EQU   APC52FLG                                                 05914000
APCQENQ  EQU   APC52FLG                                                 05915000
APCSMSR  EQU   APC52FLG                                                 05916000
APCCKRQ  EQU   APC52FLG                                                 05917000
@NM00021 EQU   APC31FLG                                                 05918000
APCSORT  EQU   APC31FLG                                                 05919000
APCRESCH EQU   APC31FLG                                                 05920000
APCTPXIT EQU   APC31FLG                                                 05921000
APCSWTWD EQU   ISTAPCRR+128                                             05922000
APCSAV2  EQU   ISTAPCRR+124                                             05923000
APCSAV1  EQU   ISTAPCRR+120                                             05924000
APCRETCD EQU   APCCOMF+2                                                05925000
@NM00020 EQU   APCCOMF1+1                                               05926000
APCZLBER EQU   APCCOMF1                                                 05927000
APCEXIT  EQU   APCCOMF1                                                 05928000
APCRELR  EQU   APCCOMF1                                                 05929000
APCIRB2  EQU   APCCOMF1                                                 05930000
APCIRB1  EQU   APCCOMF1                                                 05931000
APCSMCR  EQU   APCCOMF1                                                 05932000
APCUETSK EQU   APCCOMF1                                                 05933000
APCSSTSK EQU   APCCOMF1                                                 05934000
APCESTAL EQU   APCSAVE                                                  05935000
APCFRRPM EQU   ISTAPCRR+40                                              05936000
APCQWFO  EQU   ISTAPCRR+36                                              05937000
APCPABSV EQU   ISTAPCRR+32                                              05938000
APCRTRN  EQU   ISTAPCRR+28                                              05939000
APCTCBA  EQU   ISTAPCRR+24                                              05940000
APCPSTA  EQU   ISTAPCRR+20                                              05941000
@NM00019 EQU   APCRFLG+1                                                05942000
APC31R   EQU   APCRFLG                                                  05943000
APC58R   EQU   APCRFLG                                                  05944000
APC57R   EQU   APCRFLG                                                  05945000
APC56R   EQU   APCRFLG                                                  05946000
APC54R   EQU   APCRFLG                                                  05947000
APC53R   EQU   APCRFLG                                                  05948000
APC52R   EQU   APCRFLG                                                  05949000
APC51R   EQU   APCRFLG                                                  05950000
@NM00018 EQU   APCATFLG+1                                               05951000
APC31E   EQU   APCATFLG                                                 05952000
APC58E   EQU   APCATFLG                                                 05953000
APC57E   EQU   APCATFLG                                                 05954000
APC56E   EQU   APCATFLG                                                 05955000
APC54E   EQU   APCATFLG                                                 05956000
APC53E   EQU   APCATFLG                                                 05957000
APC52E   EQU   APCATFLG                                                 05958000
APC51E   EQU   APCATFLG                                                 05959000
APCHDRSV EQU   ISTAPCRR                                                 05960000
ASCPSREG EQU   ISTASCRR+44                                              05961000
ASCUSR01 EQU   ASCUSRGS+12                                              05962000
ASCUSR00 EQU   ASCUSRGS+8                                               05963000
ASCUSR15 EQU   ASCUSRGS+4                                               05964000
ASCUSR14 EQU   ASCUSRGS                                                 05965000
ASCETRYA EQU   ISTASCRR+24                                              05966000
ASCKEY   EQU   ISTASCRR+23                                              05967000
ASCAUDIT EQU   ASCFLG3                                                  05968000
ASCFBDUD EQU   ASCFLG3                                                  05969000
ASCLLKF  EQU   ASCFLG3                                                  05970000
ASCKEYF  EQU   ASCFLG3                                                  05971000
ASCFBDAL EQU   ASCFLG3                                                  05972000
ASCFSRGT EQU   ASCFLG3                                                  05973000
ASCICR   EQU   ASCFLG2                                                  05974000
ASCFSRIC EQU   ASCFLG2                                                  05975000
ASCFBDIC EQU   ASCFLG2                                                  05976000
ASCFBAIC EQU   ASCFLG2                                                  05977000
ASCPASTR EQU   ASCFLG1                                                  05978000
ASCFSR   EQU   ASCFLG1                                                  05979000
ASCFBD   EQU   ASCFLG1                                                  05980000
ASCFBA   EQU   ASCFLG1                                                  05981000
ASCPFCRR EQU   ISTASCRR                                                 05982000
ZCRRU    EQU   ZCRRHRU+3                                                05983000
ZCRRH    EQU   ZCRRHRU                                                  05984000
ZCRWORDA EQU   ISTZCRR+477                                              05985000
ZCRCMNRC EQU   ISTZCRR+476                                              05986000
ZCRRSV97 EQU   ZCRENTER+18                                              05987000
ZCREIC2B EQU   ZCRENTER+18                                              05988000
ZCREAC2B EQU   ZCRENTER+18                                              05989000
ZCRELCAB EQU   ZCRENTER+18                                              05990000
ZCREDCMF EQU   ZCRENTER+18                                              05991000
ZCREBCIF EQU   ZCRENTER+18                                              05992000
ZCREICSG EQU   ZCRENTER+18                                              05993000
ZCREDCK0 EQU   ZCRENTER+18                                              05994000
ZCRECFY0 EQU   ZCRENTER+17                                              05995000
ZCREKCCB EQU   ZCRENTER+17                                              05996000
ZCREDCNB EQU   ZCRENTER+17                                              05997000
ZCREICOE EQU   ZCRENTER+17                                              05998000
ZCREBCNB EQU   ZCRENTER+17                                              05999000
ZCREBC0L EQU   ZCRENTER+17                                              06000000
ZCREBCAL EQU   ZCRENTER+17                                              06001000
ZCREDCQR EQU   ZCRENTER+17                                              06002000
ZCREDCPR EQU   ZCRENTER+16                                              06003000
ZCREBCSB EQU   ZCRENTER+16                                              06004000
ZCREAC1R EQU   ZCRENTER+16                                              06005000
ZCRECCCI EQU   ZCRENTER+16                                              06006000
ZCRECCAI EQU   ZCRENTER+16                                              06007000
ZCRECCBI EQU   ZCRENTER+16                                              06008000
ZCREBCAR EQU   ZCRENTER+16                                              06009000
ZCREBCDR EQU   ZCRENTER+16                                              06010000
ZCREBCBR EQU   ZCRENTER+15                                              06011000
ZCREDCXR EQU   ZCRENTER+15                                              06012000
ZCREDCWB EQU   ZCRENTER+15                                              06013000
ZCREDCWR EQU   ZCRENTER+15                                              06014000
ZCREKCCN EQU   ZCRENTER+15                                              06015000
ZCREKCBN EQU   ZCRENTER+15                                              06016000
ZCREKCBB EQU   ZCRENTER+15                                              06017000
ZCREJC0B EQU   ZCRENTER+15                                              06018000
ZCREJCDB EQU   ZCRENTER+14                                              06019000
ZCREJCCB EQU   ZCRENTER+14                                              06020000
ZCREJCBB EQU   ZCRENTER+14                                              06021000
ZCREJCAB EQU   ZCRENTER+14                                              06022000
ZCREIC1B EQU   ZCRENTER+14                                              06023000
ZCREIC0B EQU   ZCRENTER+14                                              06024000
ZCREICX0 EQU   ZCRENTER+14                                              06025000
ZCREICWB EQU   ZCRENTER+14                                              06026000
ZCREICVB EQU   ZCRENTER+13                                              06027000
ZCREICUB EQU   ZCRENTER+13                                              06028000
ZCREICTB EQU   ZCRENTER+13                                              06029000
ZCREICSC EQU   ZCRENTER+13                                              06030000
ZCREICSB EQU   ZCRENTER+13                                              06031000
ZCREICRB EQU   ZCRENTER+13                                              06032000
ZCREICQB EQU   ZCRENTER+13                                              06033000
ZCREICQA EQU   ZCRENTER+13                                              06034000
ZCREICOB EQU   ZCRENTER+12                                              06035000
ZCREICOA EQU   ZCRENTER+12                                              06036000
ZCREICNB EQU   ZCRENTER+12                                              06037000
ZCREICNA EQU   ZCRENTER+12                                              06038000
ZCREICMB EQU   ZCRENTER+12                                              06039000
ZCREICLB EQU   ZCRENTER+12                                              06040000
ZCREICKG EQU   ZCRENTER+12                                              06041000
ZCREICKE EQU   ZCRENTER+12                                              06042000
ZCREICKB EQU   ZCRENTER+11                                              06043000
ZCREICJB EQU   ZCRENTER+11                                              06044000
ZCREICID EQU   ZCRENTER+11                                              06045000
ZCREICIB EQU   ZCRENTER+11                                              06046000
ZCREICHB EQU   ZCRENTER+11                                              06047000
ZCREICGB EQU   ZCRENTER+11                                              06048000
ZCREICEB EQU   ZCRENTER+11                                              06049000
ZCREICDB EQU   ZCRENTER+11                                              06050000
ZCREICCI EQU   ZCRENTER+10                                              06051000
ZCREICCB EQU   ZCRENTER+10                                              06052000
ZCREICBI EQU   ZCRENTER+10                                              06053000
ZCREICBB EQU   ZCRENTER+10                                              06054000
ZCREICAB EQU   ZCRENTER+10                                              06055000
ZCREICAA EQU   ZCRENTER+10                                              06056000
ZCREHCAN EQU   ZCRENTER+10                                              06057000
ZCREGC0B EQU   ZCRENTER+10                                              06058000
ZCREGC0A EQU   ZCRENTER+9                                               06059000
ZCREGCLA EQU   ZCRENTER+9                                               06060000
ZCREGCEB EQU   ZCRENTER+9                                               06061000
ZCREGCDB EQU   ZCRENTER+9                                               06062000
@NM00017 EQU   ZCRENTER+9                                               06063000
ZCREGCBB EQU   ZCRENTER+9                                               06064000
ZCREGCAB EQU   ZCRENTER+9                                               06065000
ZCREFCEB EQU   ZCRENTER+9                                               06066000
ZCREFCEA EQU   ZCRENTER+8                                               06067000
ZCREECTA EQU   ZCRENTER+8                                               06068000
ZCREECEA EQU   ZCRENTER+8                                               06069000
ZCREECDA EQU   ZCRENTER+8                                               06070000
ZCREECCB EQU   ZCRENTER+8                                               06071000
ZCREECCA EQU   ZCRENTER+8                                               06072000
ZCREECBB EQU   ZCRENTER+8                                               06073000
ZCREECBA EQU   ZCRENTER+8                                               06074000
ZCREDCMB EQU   ZCRENTER+7                                               06075000
ZCREDCL0 EQU   ZCRENTER+7                                               06076000
ZCREDCKB EQU   ZCRENTER+7                                               06077000
ZCREDCKA EQU   ZCRENTER+7                                               06078000
ZCREDCJ0 EQU   ZCRENTER+7                                               06079000
ZCREDCI0 EQU   ZCRENTER+7                                               06080000
ZCREDCH0 EQU   ZCRENTER+7                                               06081000
ZCREDCF0 EQU   ZCRENTER+7                                               06082000
ZCREDCE0 EQU   ZCRENTER+6                                               06083000
ZCREDCD0 EQU   ZCRENTER+6                                               06084000
ZCREDCC0 EQU   ZCRENTER+6                                               06085000
ZCREDCB0 EQU   ZCRENTER+6                                               06086000
ZCREDCA0 EQU   ZCRENTER+6                                               06087000
ZCRECC2B EQU   ZCRENTER+6                                               06088000
ZCRECC1B EQU   ZCRENTER+6                                               06089000
ZCRECC1A EQU   ZCRENTER+6                                               06090000
ZCRECC0B EQU   ZCRENTER+5                                               06091000
ZCRECC0A EQU   ZCRENTER+5                                               06092000
ZCREBC0B EQU   ZCRENTER+5                                               06093000
ZCREBC0A EQU   ZCRENTER+5                                               06094000
ZCREBCZ0 EQU   ZCRENTER+5                                               06095000
ZCREBCY0 EQU   ZCRENTER+5                                               06096000
ZCREBCX0 EQU   ZCRENTER+5                                               06097000
ZCREBCXA EQU   ZCRENTER+5                                               06098000
ZCREBCSC EQU   ZCRENTER+4                                               06099000
ZCREBCRB EQU   ZCRENTER+4                                               06100000
ZCREBCRA EQU   ZCRENTER+4                                               06101000
ZCREBCQB EQU   ZCRENTER+4                                               06102000
ZCREBCPB EQU   ZCRENTER+4                                               06103000
ZCREBCOB EQU   ZCRENTER+4                                               06104000
ZCREBCNE EQU   ZCRENTER+4                                               06105000
ZCREBCND EQU   ZCRENTER+4                                               06106000
ZCREBCMB EQU   ZCRENTER+3                                               06107000
ZCREBCLB EQU   ZCRENTER+3                                               06108000
ZCREBCLA EQU   ZCRENTER+3                                               06109000
ZCREBCKB EQU   ZCRENTER+3                                               06110000
ZCREBCKA EQU   ZCRENTER+3                                               06111000
ZCREBCJB EQU   ZCRENTER+3                                               06112000
ZCREBCJA EQU   ZCRENTER+3                                               06113000
ZCREBCID EQU   ZCRENTER+3                                               06114000
ZCREBCIB EQU   ZCRENTER+2                                               06115000
ZCREBCIA EQU   ZCRENTER+2                                               06116000
ZCREBCHB EQU   ZCRENTER+2                                               06117000
ZCREBCHA EQU   ZCRENTER+2                                               06118000
ZCREBCGB EQU   ZCRENTER+2                                               06119000
ZCREBCGA EQU   ZCRENTER+2                                               06120000
ZCREBCFB EQU   ZCRENTER+2                                               06121000
ZCREBCFA EQU   ZCRENTER+2                                               06122000
ZCREBCEB EQU   ZCRENTER+1                                               06123000
ZCREBCDI EQU   ZCRENTER+1                                               06124000
ZCREBCCB EQU   ZCRENTER+1                                               06125000
ZCREBCBI EQU   ZCRENTER+1                                               06126000
ZCREBCBB EQU   ZCRENTER+1                                               06127000
ZCREBCBA EQU   ZCRENTER+1                                               06128000
ZCREBCAM EQU   ZCRENTER+1                                               06129000
ZCREBCAI EQU   ZCRENTER+1                                               06130000
ZCREBCAG EQU   ZCRENTER                                                 06131000
ZCREBCAE EQU   ZCRENTER                                                 06132000
ZCREBCAB EQU   ZCRENTER                                                 06133000
ZCREBCAA EQU   ZCRENTER                                                 06134000
ZCREAC1B EQU   ZCRENTER                                                 06135000
ZCREAC0B EQU   ZCRENTER                                                 06136000
ZCREAC0A EQU   ZCRENTER                                                 06137000
ZCREAC1A EQU   ZCRENTER                                                 06138000
ZCRTNAME EQU   ZCRAUDIT+1                                               06139000
ZCRTID   EQU   ZCRAUDIT                                                 06140000
ZCRREMIC EQU   ISTZCRR+436                                              06141000
ZCRSAVEZ EQU   ISTZCRR+196                                              06142000
ZCRDAFSV EQU   ZCRCIDSV+2                                               06143000
ZCRSAFSV EQU   ZCRCIDSV                                                 06144000
ZCRR13SV EQU   ISTZCRR+188                                              06145000
ZCRR2SV  EQU   ISTZCRR+184                                              06146000
ZCROPCDE EQU   ISTZCRR+183                                              06147000
ZCRPRMTC EQU   ISTZCRR+182                                              06148000
ZCRRCDSV EQU   ISTZCRR+181                                              06149000
ZCRAWQSW EQU   ISTZCRR+180                                              06150000
ZCRTOPQ  EQU   ISTZCRR+180                                              06151000
ZCRLSTFB EQU   ISTZCRR+180                                              06152000
ZCRXSCHD EQU   ISTZCRR+180                                              06153000
ZCRNXTEL EQU   ISTZCRR+180                                              06154000
ZCRSCANQ EQU   ISTZCRR+180                                              06155000
ZCRMOREL EQU   ISTZCRR+180                                              06156000
ZCRFBPRC EQU   ISTZCRR+180                                              06157000
ZCRFSBSV EQU   ISTZCRR+176                                              06158000
ZCRSVWK5 EQU   ZCRWKARA+16                                              06159000
ZCRSVWK4 EQU   ZCRWKARA+12                                              06160000
ZCRSVWK3 EQU   ZCRWKARA+8                                               06161000
ZCRSVWK2 EQU   ZCRWKARA+4                                               06162000
ZCRSVWK1 EQU   ZCRWKARA                                                 06163000
ZCRSVF25 EQU   ZCRSVRTN+96                                              06164000
ZCRSVF24 EQU   ZCRSVRTN+92                                              06165000
ZCRSVF23 EQU   ZCRSVRTN+88                                              06166000
ZCRSVF22 EQU   ZCRSVRTN+84                                              06167000
ZCRSVF21 EQU   ZCRSVRTN+80                                              06168000
ZCRSVF20 EQU   ZCRSVRTN+76                                              06169000
ZCRSVF19 EQU   ZCRSVRTN+72                                              06170000
ZCRSVF18 EQU   ZCRSVRTN+68                                              06171000
ZCRSVF17 EQU   ZCRSVRTN+64                                              06172000
ZCRSVF16 EQU   ZCRSVRTN+60                                              06173000
ZCRSVF15 EQU   ZCRSVRTN+56                                              06174000
ZCRSVF14 EQU   ZCRSVRTN+52                                              06175000
ZCRSVF13 EQU   ZCRSVRTN+48                                              06176000
ZCRSVF12 EQU   ZCRSVRTN+44                                              06177000
ZCRSVF11 EQU   ZCRSVRTN+40                                              06178000
ZCRSVF10 EQU   ZCRSVRTN+36                                              06179000
ZCRSVF9  EQU   ZCRSVRTN+32                                              06180000
ZCRSVF8  EQU   ZCRSVRTN+28                                              06181000
ZCRSVF7  EQU   ZCRSVRTN+24                                              06182000
ZCRSVF6  EQU   ZCRSVRTN+20                                              06183000
ZCRSVF5  EQU   ZCRSVRTN+16                                              06184000
ZCRSVF4  EQU   ZCRSVRTN+12                                              06185000
ZCRSVF3  EQU   ZCRSVRTN+8                                               06186000
ZCRSVF2  EQU   ZCRSVRTN+4                                               06187000
ZCRSVF1  EQU   ZCRSVRTN                                                 06188000
ZCRPVZB  EQU   ISTZCRR+52                                               06189000
ZCRZLB   EQU   ISTZCRR+48                                               06190000
ZCRBFPTR EQU   ISTZCRR+44                                               06191000
ZCRCCWA  EQU   ISTZCRR+40                                               06192000
ZCRPSW   EQU   ZCRPARMS+15                                              06193000
ZCRPCHAR EQU   ZCRPARMS+14                                              06194000
ZCRPRES2 EQU   ZCRPCOD2                                                 06195000
ZCRPMFGF EQU   ZCRPCOD2                                                 06196000
ZCRPFHDR EQU   ZCRPCOD2                                                 06197000
ZCRPPG2  EQU   ZCRPCOD2                                                 06198000
ZCRPRES  EQU   ZCRPCOD1                                                 06199000
ZCRPCFTX EQU   ZCRPCOD1                                                 06200000
ZCRPBUF  EQU   ZCRPCOD1                                                 06201000
ZCRPLSCB EQU   ZCRPCOD1                                                 06202000
ZCRPLSBQ EQU   ZCRPLSBF                                                 06203000
ZCRPFSB  EQU   ZCRPCOD1                                                 06204000
ZCRPLNG  EQU   ZCRPCOD1                                                 06205000
ZCRPPG   EQU   ZCRPCOD1                                                 06206000
ZCRDTODA EQU   ZCRDFRDA                                                 06207000
ZCRMLNG  EQU   ZCRPARMS+8                                               06208000
ZCRTBPTR EQU   ZCRPARMS+4                                               06209000
ZCRCBPTR EQU   ZCRFBPTR                                                 06210000
ZCRCRLCP EQU   ISTZCRR+20                                               06211000
@NM00016 EQU   ZCRSCPSW                                                 06212000
ZCRSKIPT EQU   ZCRSCPSW                                                 06213000
ZCRFSBWE EQU   ZCRSCPSW                                                 06214000
ZCRPRCMP EQU   ZCRSCPSW                                                 06215000
ZCRLREQ  EQU   ZCRSCPSW                                                 06216000
ZCRRJLCP EQU   ZCRSCPSW                                                 06217000
ZCRTPINV EQU   ZCRSCPSW                                                 06218000
ZCRTPEX  EQU   ZCRSCPSW                                                 06219000
@NM00015 EQU   ZCRIBPR                                                  06220000
ZCR3270R EQU   ZCRIBPR                                                  06221000
ZCR3270  EQU   ZCRIBPR                                                  06222000
ZCRLCPFD EQU   ZCRIBPR                                                  06223000
ZCRLCPFR EQU   ZCRIBPR                                                  06224000
ZCRRELK  EQU   ZCRIBPR                                                  06225000
ZCRERR   EQU   ZCRIBPR                                                  06226000
ZCRNOBUF EQU   ZCRIBPR                                                  06227000
@NM00014 EQU   ZCRPFLGS                                                 06228000
ZCRQAHED EQU   ZCRPFLGS                                                 06229000
ZCRF1RES EQU   ZCRGENSW                                                 06230000
ZCRBRIS  EQU   ZCRGENSW                                                 06231000
ZCRCLRBD EQU   ZCRGENSW                                                 06232000
ZCREXRES EQU   ZCRGENSW                                                 06233000
ZCRLCSYN EQU   ZCRGENSW                                                 06234000
ZCRRT06  EQU   ZCRGENSW                                                 06235000
ZCRTSW2  EQU   ZCRGENSW                                                 06236000
ZCRTSW1  EQU   ZCRGENSW                                                 06237000
ZCRINLCP EQU   ZCRFLGS3                                                 06238000
ZCRWRPTR EQU   ZCRFLGS3                                                 06239000
ZCRNOFRE EQU   ZCRFLGS3                                                 06240000
ZCREDRIV EQU   ZCRFLGS3                                                 06241000
ZCRDISC  EQU   ZCRFLGS3                                                 06242000
ZCRTPDIS EQU   ZCRFLGS3                                                 06243000
ZCRTPCON EQU   ZCRFLGS3                                                 06244000
ZCRTIC   EQU   ZCRFLGS3                                                 06245000
ZCRCNLXL EQU   ZCRRESET                                                 06246000
ZCRENDAN EQU   ZCRSWFLD                                                 06247000
ZCRENDXL EQU   ZCRSWFLD                                                 06248000
ZCRENDX  EQU   ZCRSWFLD                                                 06249000
ZCROB1   EQU   ZCRNDLCP                                                 06250000
ZCRENDPR EQU   ZCRSWFLD                                                 06251000
ZCREXTYP EQU   ZCRSWFLD                                                 06252000
ZCRSLCP  EQU   ZCRENDSH                                                 06253000
ZCRIF0E3 EQU   ZCRFLGS2                                                 06254000
ZCRIF0E2 EQU   ZCRFLGS2                                                 06255000
ZCRIF0E1 EQU   ZCRFLGS2                                                 06256000
ZCROB    EQU   ZCRFLGS2                                                 06257000
ZCRFMSED EQU   ZCRFLGS2                                                 06258000
ZCRSHEDI EQU   ZCRFLGS2                                                 06259000
ZCRLOCAL EQU   ZCRFLGS2                                                 06260000
ZCRFEXIT EQU   ZCRFLGS1                                                 06261000
ZCRUNSOL EQU   ZCRFLGS1                                                 06262000
ZCRENDLP EQU   ZCRFLGS1                                                 06263000
ZCRNRMEX EQU   ZCRFLGS1                                                 06264000
ZCRWAIT  EQU   ZCRFLGS1                                                 06265000
ZCRDEQSW EQU   ZCRFLGS1                                                 06266000
ZCRQUESW EQU   ZCRFLGS1                                                 06267000
ZCREXSW  EQU   ZCRFLGS1                                                 06268000
ZCRFRRA  EQU   ISTZCRR+8                                                06269000
ZCRCHAIN EQU   ISTZCRR+4                                                06270000
ZCRFLAG  EQU   ZCRCRR+3                                                 06271000
ZCRLEN   EQU   ZCRCRR+1                                                 06272000
ZCRID    EQU   ZCRCRR                                                   06273000
CCFRSVD1 EQU   CFCCRT                                                   06274000
CCFCR2   EQU   CFCCRT                                                   06275000
CCFCRP   EQU   CFCCRT                                                   06276000
CCFCR1   EQU   CFCCRT                                                   06277000
CCFCS2   EQU   CFCCRT                                                   06278000
CCFCS1   EQU   CFCCRT                                                   06279000
NCFRSVD  EQU   CFCNTRD                                                  06280000
NCFCR2   EQU   CFCNTRD                                                  06281000
NCFCRP   EQU   CFCNTRD                                                  06282000
NCFCR1   EQU   CFCNTRD                                                  06283000
NCFCS2   EQU   CFCNTRD                                                  06284000
NCFCS1   EQU   CFCNTRD                                                  06285000
PFCRSV01 EQU   ISTPFCRR+13                                              06286000
PFCFTA   EQU   ISTPFCRR+12                                              06287000
CRRFRR   EQU   PFCFRRO                                                  06288000
CRRCHAIN EQU   PFCCRRO                                                  06289000
CRRLEN   EQU   PFCCRRLN                                                 06290000
PFCRSV10 EQU   PFCCRR+1                                                 06291000
CRRID    EQU   PFCCRRID                                                 06292000
ZSAZTRAC EQU   ISTZSAVE+36                                              06293000
ZSAZSVVR EQU   ISTZSAVE+12                                              06294000
ZSAZSVRR EQU   ISTZSAVE+8                                               06295000
ZSAZSVFC EQU   ISTZSAVE+4                                               06296000
ZSAZACTV EQU   ZSAZSVMS                                                 06297000
LCPFTYPE EQU   LCPRPHA                                                  06298000
LCPRSTQH EQU   LCPLCCW                                                  06299000
LCPCLREP EQU   ISTLCPB+44                                               06300000
LCPUBFSB EQU   LCPFLCCW                                                 06301000
LCPRSV77 EQU   ISTLCPB+39                                               06302000
LCPLCCWC EQU   ISTLCPB+38                                               06303000
LCPRSV78 EQU   LCPFLG1                                                  06304000
LCPTRANS EQU   LCPFLG1                                                  06305000
LCPSTLB  EQU   LCPFLG1                                                  06306000
LCPREDRV EQU   LCPFLG1                                                  06307000
LCPDIRPT EQU   LCPFLG1                                                  06308000
LCPINTER EQU   LCPFLG1                                                  06309000
LCPRESET EQU   LCPFLG1                                                  06310000
LCPSTYPE EQU   ISTLCPB+36                                               06311000
LCPFSNCH EQU   ISTLCPB+34                                               06312000
LCPFOSN  EQU   ISTLCPB+32                                               06313000
LCPTLBAD EQU   ISTLCPB+28                                               06314000
LCPFDB2  EQU   LCPFDBA+1                                                06315000
LCPFDB1  EQU   LCPFDBA                                                  06316000
LCPNXLCW EQU   ISTLCPB+20                                               06317000
LCPDAF   EQU   LCPCID+2                                                 06318000
LCPSAF   EQU   LCPCID                                                   06319000
LCPLCCW1 EQU   ISTLCPB+12                                               06320000
LCPRRCNT EQU   LCPSEQ+1                                                 06321000
LCPRRCCT EQU   LCPSEQ                                                   06322000
LCPATOP  EQU   LCPFLAG2                                                 06323000
LCPFREE  EQU   LCPFLAG2                                                 06324000
LCPDSTAT EQU   LCPFLAG2                                                 06325000
LCPEXRES EQU   LCPFID0                                                  06326000
LCPZRIMM EQU   LCPTLBPI                                                 06327000
LCPRSTRT EQU   LCPFLAG2                                                 06328000
LCPASYN  EQU   LCPFLAG2                                                 06329000
LCPPRFLG EQU   LCPFLAG2                                                 06330000
LCPZMIRC EQU   LCPRUCNT                                                 06331000
LCPCHAI2 EQU   LCPCHAIN+1                                               06332000
LCPCHNG  EQU   LCPCHAI1                                                 06333000
LCPZRT0B EQU   LCPMNRCD                                                 06334000
LCPZRT0A EQU   LCPMNRCD                                                 06335000
LCPZRTL9 EQU   LCPZRT09                                                 06336000
LCPZRTL8 EQU   LCPZRT08                                                 06337000
LCPZRTL7 EQU   LCPZRT07                                                 06338000
LCPZRTL6 EQU   LCPZRT06                                                 06339000
LCPZRTL5 EQU   LCPZRT05                                                 06340000
LCPZRTL4 EQU   LCPZRT04                                                 06341000
LCPZRTL3 EQU   LCPZRT03                                                 06342000
LCPZRTL2 EQU   LCPZRT02                                                 06343000
LCPZRT01 EQU   LCPFLAGS                                                 06344000
LCPZRT00 EQU   LCPFLAGS                                                 06345000
LCPLNGTH EQU   ISTLCPB+1                                                06346000
LCPTYPE  EQU   ISTLCPB                                                  06347000
LCCWDATA EQU   ISTLCCW+4                                                06348000
LCCWCNT  EQU   ISTLCCW+2                                                06349000
LCCWACI  EQU   LCCWFLAG                                                 06350000
LCCWRFI  EQU   LCCWFLAG                                                 06351000
LCCWPER  EQU   LCCWLSI                                                  06352000
LCCWIDAT EQU   LCCWFLAG                                                 06353000
LCCWNTVC EQU   LCCWFLAG                                                 06354000
LCCWCKPT EQU   LCCWFLAG                                                 06355000
LCCWCC   EQU   LCCWFLAG                                                 06356000
LCCWCD   EQU   LCCWFLAG                                                 06357000
LCCWTYPE EQU   LCCWCTL                                                  06358000
LCCWMODE EQU   LCCWCTL                                                  06359000
LCCWSOP  EQU   LCCWRWOP                                                 06360000
@NM00013 EQU   LCCWRWOP                                                 06361000
LCCWSD   EQU   LCCWOP                                                   06362000
LCCWSI   EQU   LCCWOP                                                   06363000
NCSAPPAB EQU   NCSAPP+608                                               06364000
NCSAPDAT EQU   NCSAPBUE+8                                               06365000
NCSAPRU  EQU   NCSAPBUE+3                                               06366000
NCSRSV04 EQU   NCSAPBUE                                                 06367000
NCSAPEND EQU   NCSAPP+84                                                06368000
NCSAPTXT EQU   NCSAPP+76                                                06369000
NCSAPECB EQU   NCSAPP+72                                                06370000
NCSAPSA  EQU   NCSAPP                                                   06371000
NCSPLPDB EQU   NCSPLSID+5                                               06372000
NCSPLNID EQU   NCSPLPHD                                                 06373000
NCSPLPO  EQU   NCSPLSTA                                                 06374000
NCSRSVD4 EQU   NCSPLSTA                                                 06375000
NCSRSVD2 EQU   NCSCRMOD                                                 06376000
NCSPTMOD EQU   NCSCRMOD                                                 06377000
NCSAIMOD EQU   NCSCRMOD                                                 06378000
NCSRSVD1 EQU   NCSCHKPT+1                                               06379000
NCSPTUSE EQU   NCSCHKPT+1                                               06380000
NCSRNME  EQU   NCSCHKPT+1                                               06381000
NCSCUA   EQU   NCSCHKPT+1                                               06382000
NCSANSMD EQU   NCSCHKPT+1                                               06383000
NCSLGMOD EQU   NCSCHKPT                                                 06384000
NCSLGAPL EQU   NCSCHKPT                                                 06385000
NCSDTRLM EQU   NCSCHKPT                                                 06386000
NCSESLM  EQU   NCSCHKPT                                                 06387000
NCSNRPL  EQU   NCSCHKPT                                                 06388000
NCSPOLD  EQU   NCSCHKPT                                                 06389000
NCSPACTV EQU   NCSCHKPT                                                 06390000
NCSACTV  EQU   NCSCHKPT                                                 06391000
NCSCRDTE EQU   ISTNCSPL+264                                             06392000
NCSUFMCB EQU   ISTNCSPL+256                                             06393000
NCSMGLPT EQU   ISTNCSPL+252                                             06394000
NCSCPWPT EQU   ISTNCSPL+248                                             06395000
NCSSENS2 EQU   NCSSENSE+2                                               06396000
NCSSNS2  EQU   NCSSENSE+1                                               06397000
NCSSNS1  EQU   NCSSENSE                                                 06398000
NCSPLNSN EQU   ISTNCSPL+240                                             06399000
NCSPLMID EQU   ISTNCSPL+232                                             06400000
NCSPLPID EQU   ISTNCSPL+231                                             06401000
NCSPLGID EQU   ISTNCSPL+230                                             06402000
NCSPLSQN EQU   ISTNCSPL+228                                             06403000
NCSRNAME EQU   ISTNCSPL+220                                             06404000
NCSPLRUI EQU   ISTNCSPL+212                                             06405000
NCSPLRRP EQU   ISTNCSPL+204                                             06406000
NCSPLWEL EQU   ISTNCSPL+200                                             06407000
NCSPLSPL EQU   ISTNCSPL+196                                             06408000
NCSPLP3  EQU   ISTNCSPL+192                                             06409000
NCSPLP2  EQU   ISTNCSPL+188                                             06410000
NCSPLP1  EQU   ISTNCSPL+184                                             06411000
@NM00012 EQU   NCSPLFL5                                                 06412000
NCSFORCE EQU   NCSPLFL5                                                 06413000
NCSSDLK  EQU   NCSPLFL5                                                 06414000
NCSSCPPS EQU   NCSPLFL5                                                 06415000
NCSDLRSN EQU   ISTNCSPL+180                                             06416000
NCSPL2AP EQU   NCSPLFL4                                                 06417000
NCSDSPN  EQU   NCSPLFL4                                                 06418000
NCSDSPI  EQU   NCSPLFL4                                                 06419000
NCSDSPA  EQU   NCSPLFL4                                                 06420000
NCSDSPE  EQU   NCSPLFL4                                                 06421000
NCSPLVID EQU   NCSPLFL4                                                 06422000
NCSPLRSO EQU   NCSPLFL4                                                 06423000
NCSDLNID EQU   NCSPLFL4                                                 06424000
NCSEND   EQU   NCSPLFL3                                                 06425000
NCSFINAL EQU   NCSPLFL3                                                 06426000
NCSANS   EQU   NCSPLFL3                                                 06427000
NCSPID   EQU   NCSPLFL3                                                 06428000
NCSGID   EQU   NCSPLFL3                                                 06429000
NCSPLANS EQU   NCSPLFL3                                                 06430000
NCSEPP   EQU   NCSPLFL3                                                 06431000
NCSPLMOM EQU   NCSPLFL3                                                 06432000
NCSPLVIT EQU   NCSPLFL2                                                 06433000
NCSPLVIS EQU   NCSPLFL2                                                 06434000
NCSREMPO EQU   NCSPLFL2                                                 06435000
NCSPLDS  EQU   NCSPLFL2                                                 06436000
NCSOUFMC EQU   NCSPLFL2                                                 06437000
NCSPLRIO EQU   NCSPLFL2                                                 06438000
NCSPLRSF EQU   NCSPLFL2                                                 06439000
NCSPLVDP EQU   NCSPLFL2                                                 06440000
NCSPLPOS EQU   NCSPLFL1                                                 06441000
NCSPL2CN EQU   NCSPLFL1                                                 06442000
NCSPLAPU EQU   NCSPLFL1                                                 06443000
NCSPLNON EQU   NCSPLFL1                                                 06444000
NCSPLREQ EQU   NCSPLFL1                                                 06445000
NCSPLEBN EQU   NCSPLFL1                                                 06446000
NCSPLSOM EQU   NCSPLFL1                                                 06447000
NCSPL2IN EQU   NCSPLFL1                                                 06448000
NCSPLRCR EQU   ISTNCSPL+172                                             06449000
NCSPLECB EQU   ISTNCSPL+164                                             06450000
NCSPLCVT EQU   ISTNCSPL+156                                             06451000
NCSPLRCD EQU   NCSPLRAD+1                                               06452000
NCSLSCMD EQU   NCSPLRAD                                                 06453000
NCSPLWRF EQU   ISTNCSPL+72                                              06454000
NCSPLWRE EQU   ISTNCSPL+68                                              06455000
NCSSTCMD EQU   NCSCRFLG                                                 06456000
NCSUSRNF EQU   NCSCRFLG                                                 06457000
NCSOPRQU EQU   NCSCRFLG                                                 06458000
NCSCRDSE EQU   NCSCRFLG                                                 06459000
NCSFMERP EQU   NCSCRFLG                                                 06460000
NCSFMCLD EQU   NCSCRFLG                                                 06461000
NCSPLCLD EQU   NCSCRFLG                                                 06462000
NCSPLWRM EQU   NCSCRFLG                                                 06463000
NCSPLUAD EQU   ISTNCSPL+64                                              06464000
NCSMSGSP EQU   ISTNCSPL+63                                              06465000
NCSNCPEP EQU   ISTNCSPL+62                                              06466000
NCSCMDB  EQU   NCSPLCMD+1                                               06467000
@NM00011 EQU   NCSCMDA                                                  06468000
NCSPLUFM EQU   NCSCMDA                                                  06469000
NCSPLFLO EQU   NCSCMDA                                                  06470000
NCSPLSYN EQU   NCSCMDA                                                  06471000
NCSPLCTL EQU   NCSCMDA                                                  06472000
NCSPLSYS EQU   NCSCMDA                                                  06473000
NCSPLLPT EQU   ISTNCSPL+56                                              06474000
NCSCRPID EQU   ISTNCSPL+51                                              06475000
NCSCRCMD EQU   ISTNCSPL+50                                              06476000
NCSDLID  EQU   ISTNCSPL+44                                              06477000
NCSPLLID EQU   ISTNCSPL+36                                              06478000
NCSPLRID EQU   ISTNCSPL+28                                              06479000
NCSRRNPT EQU   ISTNCSPL+24                                              06480000
NCSIORC  EQU   ISTNCSPL+23                                              06481000
NCSPRMRC EQU   ISTNCSPL+22                                              06482000
NCSOVFMC EQU   NCSPLVF1                                                 06483000
NCSRSV02 EQU   NCSPLVFL                                                 06484000
NCSDACLK EQU   NCSPLVFL                                                 06485000
NCSABCON EQU   NCSPLVFL                                                 06486000
NCSDCONT EQU   NCSPLVFL                                                 06487000
NCSVSTAT EQU   NCSPLVFL                                                 06488000
NCSVDEL  EQU   NCSPLVFL                                                 06489000
NCSVNCSA EQU   NCSPLVFL                                                 06490000
NCSVBF16 EQU   NCSPLVBF+1                                               06491000
NCSVBF15 EQU   NCSPLVBF+1                                               06492000
NCSVBF14 EQU   NCSPLVBF+1                                               06493000
NCSVBF13 EQU   NCSPLVBF+1                                               06494000
NCSVBF12 EQU   NCSPLVBF+1                                               06495000
NCSVBF11 EQU   NCSPLVBF+1                                               06496000
NCSVBF10 EQU   NCSPLVBF+1                                               06497000
NCSVBF09 EQU   NCSPLVBF+1                                               06498000
NCSVBF08 EQU   NCSPLVBF                                                 06499000
NCSVBF07 EQU   NCSPLVBF                                                 06500000
NCSVBF06 EQU   NCSPLVBF                                                 06501000
NCSVBF05 EQU   NCSPLVBF                                                 06502000
NCSVBF04 EQU   NCSPLVBF                                                 06503000
NCSVBF03 EQU   NCSPLVBF                                                 06504000
NCSVBF02 EQU   NCSPLVBF                                                 06505000
NCSVBF01 EQU   NCSPLVBF                                                 06506000
NCSPLVCD EQU   ISTNCSPL+17                                              06507000
@NM00010 EQU   ISTNCSPL+16                                              06508000
NCSCRWKA EQU   NCSPFX+12                                                06509000
@NM00009 EQU   NCSPFX                                                   06510000
PFXBCK   EQU   ISTPFX+12                                                06511000
PFXFWD   EQU   ISTPFX+8                                                 06512000
PFXLNG   EQU   ISTPFX+5                                                 06513000
PFXPRTY  EQU   ISTPFX+4                                                 06514000
PFXCBID  EQU   PFXID                                                    06515000
POHID    EQU   ISTPOHD+2                                                06516000
POHGEN   EQU   POHSTAT                                                  06517000
POHRREQ  EQU   POHSTAT                                                  06518000
POHRSVD2 EQU   POHSTAT                                                  06519000
POHCNTRL EQU   POHSTAT                                                  06520000
POHLBL   EQU   POHSTAT                                                  06521000
POHDATA  EQU   POHSTAT                                                  06522000
POHEND   EQU   POHSTAT                                                  06523000
POHRSVD1 EQU   ISTPOHD                                                  06524000
RPHNEXPO EQU   ISTRPH+104                                               06525000
RPHSAV16 EQU   RPHWORK+60                                               06526000
RPHSAV15 EQU   RPHWORK+56                                               06527000
RPHSAV14 EQU   RPHWORK+52                                               06528000
RPHSAV13 EQU   RPHWORK+48                                               06529000
RPHSAV12 EQU   RPHWORK+44                                               06530000
RPHSAV11 EQU   RPHWORK+40                                               06531000
RPHSAV10 EQU   RPHWORK+36                                               06532000
RPHSAVE9 EQU   RPHWORK+32                                               06533000
RPHSAVE8 EQU   RPHWORK+28                                               06534000
RPHSAVE7 EQU   RPHWORK+24                                               06535000
RPHSAVE6 EQU   RPHWORK+20                                               06536000
RPHSAVE5 EQU   RPHWORK+16                                               06537000
RPHSAVE4 EQU   RPHWORK+12                                               06538000
RPHSAVE3 EQU   RPHWORK+8                                                06539000
RPHSAVE2 EQU   RPHWORK+4                                                06540000
RPHSHALF EQU   RPHSAVE1+2                                               06541000
RPHSBIT8 EQU   RPHSBITS                                                 06542000
RPHSBIT7 EQU   RPHSBITS                                                 06543000
RPHSBIT6 EQU   RPHSBITS                                                 06544000
RPHSBIT5 EQU   RPHSBITS                                                 06545000
RPHSBIT4 EQU   RPHSBITS                                                 06546000
RPHSBIT3 EQU   RPHSBITS                                                 06547000
RPHSBIT2 EQU   RPHSBITS                                                 06548000
RPHSBIT1 EQU   RPHSBITS                                                 06549000
RPHSBYTE EQU   RPHSAVE1                                                 06550000
RPHPABQP EQU   RPHPABQA+1                                               06551000
RPHPABFG EQU   RPHPABQA                                                 06552000
RPHSRP34 EQU   RPHSRPRM+2                                               06553000
RPHSRP12 EQU   RPHSRPRM                                                 06554000
RPHWEGT  EQU   RPHCSPA                                                  06555000
RPHMAJCB EQU   ISTRPH+21                                                06556000
RPHPABOF EQU   ISTRPH+20                                                06557000
RPHRESUM EQU   RPHRESMA+1                                               06558000
RPHRSV01 EQU   RPHWPFLG                                                 06559000
RPHPURGE EQU   RPHWPFLG                                                 06560000
RPHPT    EQU   RPHWPFLG                                                 06561000
RPHWT    EQU   RPHWPFLG                                                 06562000
RPHRSKEY EQU   RPHWPFLG                                                 06563000
RPHDVTA  EQU   ISTRPH+12                                                06564000
RPHTIK   EQU   RPHTSKID+3                                               06565000
@NM00007 EQU   RPHTSKID                                                 06566000
RPHRPHAP EQU   RPHRPHA+1                                                06567000
@NM00006 EQU   RPHRPHA                                                  06568000
RPHGATE  EQU   RPHRPHA                                                  06569000
@NM00005 EQU   RPHFLGB                                                  06570000
RPHRLCRA EQU   RPHFLGB                                                  06571000
RPHNRSAV EQU   RPHFLGB                                                  06572000
RPHPGCMP EQU   RPHFLGB                                                  06573000
RPHFBAPS EQU   RPHFLGB                                                  06574000
RPHBSSP  EQU   RPHFLGB                                                  06575000
RPHLOCK  EQU   RPHFLGB                                                  06576000
RPHFNFLG EQU   RPHFSTLC                                                 06577000
RPHMLTCP EQU   RPHFLAGS                                                 06578000
RPHSMCLR EQU   RPHFLAGS                                                 06579000
RPHSMTYP EQU   RPHFLAGS                                                 06580000
RPHSMQ   EQU   RPHFLAGS                                                 06581000
RPHAUTEX EQU   RPHAPTYP                                                 06582000
RPHSPGIN EQU   RPHFLAGS                                                 06583000
RPHOGIND EQU   RPHFLAGS                                                 06584000
RPHLNGTH EQU   RPHCNTL+1                                                06585000
RPHTYPE  EQU   RPHCNTL                                                  06586000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      06587000
@RC00069 EQU   @RC00067                                                 06588000
@RF00101 EQU   @PB00002                                                 06589000
@RC00082 EQU   @PB00002                                                 06590000
@ENDDATA EQU   *                                                        06591000
         END   ISTINCY4,(C'PLS1832',0603,75307)                         06592000
