SVTM     TITLE 'ISTINCSM - SESSION MONITOR                             *00001000
                        '                                               00002000
ISTINCSM CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTINCSM  78.109'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
*                                                                  0535 00014000
*/********************************************************************/ 00015000
*/* SAVE INPUT PARAMETER - REGISTER 1 = ADDR OF NCSPL.               */ 00016000
*/* INITIALIZE  THE VARY CRR                                         */ 00017000
*/********************************************************************/ 00018000
*                                                                  0535 00019000
*   NCSPLPTR=GPR01P;                /* SAVE PTR TO NCSPL             */ 00020000
         LR    NCSPLPTR,GPR01P                                     0535 00021000
*   DO;                                                            0536 00022000
*                                                                  0536 00023000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(SUB)RPHADD((NCSPLRPH))  * 00024000
*                                                                    */ 00025000
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTVYCRR)                        */ 00026000
*                                                                  0537 00027000
*/* LOGICAL CHANNEL COMMAND WORD                                      * 00028000
*/* ADD A DECLARE                                      003 10/18/74   * 00029000
*DCL  1  ISTLCCW BDY(WORD) BASED,                                  0537 00030000
*        2  LCCWOP    CHAR(1),         /* OPERATION CODE -CONTROL     * 00031000
*           3  LCCWSI BIT(1),          /* SESS INIT / START DIALOG FLG* 00032000
*           3  LCCWSD BIT(1),          /* SESS DISCON/END DIALOG FLG  * 00033000
*           3  LCCWRWOP BIT(6),        /* READ/WRITE OPERATION CODE   * 00034000
*              4  * BIT(1),            /* RESERVED                    * 00035000
*              4  LCCWSOP BIT(1),      /* SPECIAL OPERATION LIKE   0537 00036000
*                                         ERASE OR READ CONT          * 00037000
*              4  LCCWCTL BIT(4),      /* CONTROL TYPE                * 00038000
*                 5  LCCWMODE BIT(2),  /* MODE TYPE                   * 00039000
*                 5  LCCWTYPE BIT(2),  /* OPERATION TYPE              * 00040000
*        2  LCCWFLAG  CHAR(1),         /* FLAG BYTE                   * 00041000
*           3  LCCWCD BIT(1),          /* CHAIN DATA                  * 00042000
*           3  LCCWCC BIT(1),          /* CHAIN COMMAND               * 00043000
*           3  LCCWCKPT BIT(1),        /* SUPPRESS 3705 CHECK POINT     00044000
*                                         RECORD                      * 00045000
*           3  LCCWNTVC BIT(1),        /* DO NOT PERFORM VALCHEK      * 00046000
*           3  LCCWIDAT BIT(1),        /* LCCWDATA CONTAINS DATA      * 00047000
*           3  LCCWLSI BIT(1),         /* LCCW SYNCH INDICATOR        * 00048000
*              4  LCCWPER BIT(1),      /* POST=RESP                   * 00049000
*           3  LCCWRFI BIT(1),         /* REQUEST FEEDBACK INDICATOR  * 00050000
*           3  LCCWACI BIT(1),         /* ADDITION COMMAND INDICATOR  * 00051000
*        2  LCCWCNT FIXED(16),         /* DATA COUNT                  * 00052000
*        2  LCCWDATA PTR(31);          /* DATA ADDRESS OR IMMED. DATA * 00053000
*/* LOGICAL COMMAND CODES */                                       0538 00054000
*DCL  LXDQ     BIT(8) CONSTANT('3B'X), /* RESET DEVICE QUEUE          * 00055000
*     LXEC     BIT(8) CONSTANT('4B'X), /* RESET AT END OF COMMAND     * 00056000
*     LXO      BIT(8) CONSTANT('5B'X), /* RESET ORDERLY               * 00057000
*     LCCWPRGE BIT(8) CONSTANT('6B'X), /* PURGE                       * 00058000
*     LWH      BIT(8) CONSTANT('0F'X), /* WRITE HEADER INDI. 1ST BLOCK* 00059000
*     LWRVI    BIT(8) CONSTANT('1F'X), /* WRITE RVI                   * 00060000
*     LWNA     BIT(8) CONSTANT('2F'X), /* WRITE NEGATIVE ACK          * 00061000
*     LWAA     BIT(8) CONSTANT('3F'X), /* WRITE ALTERNATE ACK         * 00062000
*     LWPLG    BIT(8) CONSTANT('5F'X), /* WRITE ACK LEADING GRAPHICS  * 00063000
*     LWNLG    BIT(8) CONSTANT('6F'X), /* WRITE NACK LEADING GRAPHICS * 00064000
*     LSMDE    BIT(8) CONSTANT('4F'X), /* SET MODE                    * 00065000
*     LIFBM    BIT(8) CONSTANT('7F'X), /* INDIC 1ST BLOCK OF MESSAGE  * 00066000
*     LTEST    BIT(8) CONSTANT('FE'X), /* TEST LCCW                   * 00067000
*     LPRMPT   BIT(8) CONSTANT('13'X), /* PREEMPT LCCW                * 00068000
*     LRSTR    BIT(8) CONSTANT('43'X), /* RESTORE LCCW                * 00069000
*     LEXEC    BIT(8) CONSTANT('FF'X), /* SPECIAL CONTROL OPERATION   * 00070000
*     LREAD    BIT(2) CONSTANT('10'B),  /* READ TYPE LCCW             * 00071000
*     LWRITE   BIT(2) CONSTANT('01'B),  /* WRITE TYPE LCCW            * 00072000
*     LCNTRL   BIT(2) CONSTANT('11'B),  /* CONTROL TYPE LCCW          * 00073000
*     LRESET   BIT(4) CONSTANT('1011'B),/* RESET COMMANDS             * 00074000
*     LTIC     BIT(8) CONSTANT('08'X),  /* LOGICAL TIC                * 00075000
*     LWR      BIT(6) CONSTANT('000001'B),  /* WRITE CONVERSATIONAL   * 00076000
*     LWB      BIT(6) CONSTANT('000101'B),  /* WRITE BLOCK            * 00077000
*     LWM      BIT(6) CONSTANT('001001'B),  /* WRITE MESSAGE          * 00078000
*     LWT      BIT(6) CONSTANT('001101'B),  /* WRITE TRANSMISSION     * 00079000
*     LEWM     BIT(6) CONSTANT('011001'B),  /* ERASE/WRITE MESSAGE    * 00080000
*     LEWT     BIT(6) CONSTANT('011101'B),  /* ERASE/WRITE TRNSMSSN   * 00081000
*     LEAU     BIT(6) CONSTANT('010001'B),  /* ERASE ALL UNPROTECTED  * 00082000
*     LRB      BIT(6) CONSTANT('000110'B),  /* READ BLOCK             * 00083000
*     LRM      BIT(6) CONSTANT('001010'B),  /* READ MESSAGE           * 00084000
*     LRT      BIT(6) CONSTANT('001110'B),  /* READ TRANSMISSION      * 00085000
*     LRMOD    BIT(6) CONSTANT('010010'B),  /* READ MODIFIED          * 00086000
*     LRBUF    BIT(6) CONSTANT('010110'B),  /* READ BUFFER            * 00087000
*     LRCONT   BIT(6) CONSTANT('011010'B),  /* READ CONTINUOUS        * 00088000
*     LRPEP    BIT(6) CONSTANT('011110'B),  /* READ PERPETUAL         * 00089000
*     LCPYM    BIT(6) CONSTANT('101001'B),  /* COPY MESSAGE           * 00090000
*     LCPYT    BIT(6) CONSTANT('101101'B),  /* COPY TRANSMISSION      * 00091000
*     LD       BIT(8) CONSTANT('23'X),  /* DISCONNECT                 * 00092000
*     LDEC     BIT(8) CONSTANT('33'X),  /* DISCONNECT WITH END OF CALL* 00093000
*     LEOC     BIT(8) CONSTANT('53'X),  /* END OF CALL COMMAND        * 00094000
*     LXEL     BIT(8) CONSTANT('0B'X),  /* RESET ERROR LOCK           * 00095000
*     LXC      BIT(8) CONSTANT('1B'X),  /* RESET CONDITIONAL          * 00096000
*     LXI      BIT(8) CONSTANT('2B'X),  /* RESET IMMEDIATE            * 00097000
*     LC       BIT(8) CONSTANT('03'X),  /* CONTACT                    * 00098000
*     LWPA     BIT(8) CONSTANT('FD'X); /* WRITE POSITIVE ACK          * 00099000
*DCL  LMT      BIT(2) CONSTANT('11'B), /* TRANSMISSION MODE           * 00100000
*     LMS      BIT(2) CONSTANT('00'B), /* SPECIAL MODE LIKE CONV, EAU * 00101000
*     LMB      BIT(2) CONSTANT('01'B), /* BLOCK MODE                  * 00102000
*     LMM      BIT(2) CONSTANT('10'B); /* MSG OR CONTINUOUS MODE      * 00103000
*/* FOLLOWING EQUATES FOR  - PORT SOLICITOR (DIAL)                    * 00104000
*/* PORT SOLICITOR COMMAND CODES                                      * 00105000
*DCL PSOL    BIT(8) CONSTANT('FE'X), /* SPECIAL PORT SOLICITOR     0540 00106000
*                                       COMMAND                       * 00107000
*    STCTL    BIT(8) CONSTANT('01'X), /* START CONTROL                * 00108000
*    RESTCTL  BIT(8) CONSTANT('02'X), /* RESET & CONTROL - REDRIVE    * 00109000
*    STIPUT   BIT(8) CONSTANT('03'X); /* START INPUT                  * 00110000
*/*   FOLLOWING EQUATES FOR SDLC SUPPORT                              * 00111000
*DCL  LCCHOLD  BIT(8) CONSTANT('01'X),  /* HOLD                       * 00112000
*     LCCRHOLD BIT(8) CONSTANT('02'X),  /* RELEASE HOLD               * 00113000
*     LSEND    BIT(8) CONSTANT ('F1'X), /* SEND                       * 00114000
*     LCLEAR   BIT(8) CONSTANT ('F2'X), /* CLEAR                      * 00115000
*     LCRUD    BIT(8) CONSTANT ('F3'X), /* CLEAR, UNBIND              * 00116000
*     LCRUDNFY BIT(8) CONSTANT ('F4'X), /* CLEAR, UNBIND, NOTIFY      * 00117000
*     LNFY     BIT(8) CONSTANT ('F5'X), /* NOTIFY                     * 00118000
*     LRELCB   BIT(8) CONSTANT ('F6'X), /* RELEASE CB                 * 00119000
*     LRESTSR  BIT(8) CONSTANT ('F7'X), /* RESETSR                    * 00120000
*     LCLRNFY  BIT(8) CONSTANT('F8'X),  /* CLEAR/NOTIFY               * 00121000
*     LCHPUR   BIT(8) CONSTANT('F9'X);  /* PURGE                      * 00122000
*DCL  LCCWSIZE FIXED(8) CONSTANT(8);    /* LCCW SIZE                  * 00123000
*DCL  LRDS     BIT(8) CONSTANT('FF'X);  /* RECORD DEV STATS COMMAND   * 00124000
*DCL  LQUIS    BIT(8) CONSTANT('FE'X);  /* QUIESCE COMMAND            * 00125000
*/*              LOGICAL CHANNEL PROGRAM BLOCK                       */ 00126000
*/*                                                                  */ 00127000
*/*  REVISIONS                                         007 05/19/75  */ 00128000
*/*                                                                  */ 00129000
*DCL  1  ISTLCPB BDY(WORD) BASED(LCPBPTR),                         0545 00130000
*        2 LCPTYPE CHAR(1),            /* TYPE CODE                  */ 00131000
*        2 LCPLNGTH  PTR(8),           /* LENGTH IN BYTES            */ 00132000
*        2 LCPREQTG CHAR(2),           /* LCPB REQ. TAG FIELD        */ 00133000
*          3 LCPFLAGS BIT(8),          /* FLAG BYTE                  */ 00134000
*            4 LCPZRT00 BIT(1),        /* LOGICAL ERROR FLAG         */ 00135000
*            4 LCPZRT01 BIT(1),        /* CONTROL BLOCK ERROR        */ 00136000
*            4 LCPZF001 BIT(1),        /* LCP START PROCESS FLAG     */ 00137000
*              5 LCPZRT02 BIT(1),      /* I/O INITIATION DISABLED    */ 00138000
*                6 LCPZRTL2 BIT(1),    /* END OF SCHEDULABLE BLOCK   */ 00139000
*            4 LCPZF002 BIT(1),        /* LCP IN PROCESSING FLAG     */ 00140000
*              5 LCPZRT03 BIT(1),      /* GO LOOK AT FMCB LINE STATE */ 00141000
*                                      /* FIELD (REQ. TAG OVERLAY)   */ 00142000
*                6 LCPZRTL3 BIT(1),    /* WRITE/READ REQUEST         */ 00143000
*            4 LCPZF003 BIT(1),        /* LCP PROCESSING COMPLETE FLAG* 00144000
*              5 LCPZRT04 BIT(1),      /* STPR SET IN BDU FLAG       */ 00145000
*                                      /* (REQ. TAG OVERLAY)         */ 00146000
*                6 LCPZRTL4 BIT(1),    /* FEEDBACK REQUESTED         */ 00147000
*            4 LCPZF004 BIT(1),        /* SINGLE LCCW/LCP FLAG       */ 00148000
*              5 LCPZRT05 BIT(1),      /* FEEDBACK TO BE ROUTED TO   */ 00149000
*                                      /* ICNCB FMCB (REQ. TAG       */ 00150000
*                                      /* OVERLAY)                   */ 00151000
*                6 LCPZRTL5 BIT(1),    /* DECREMENT SCHED COUNT ON DEQ* 00152000
*            4 LCPZRT06 BIT(1),        /* CRITICAL TEXT BLOCK        */ 00153000
*                                      /* FLAG (REQ. TAG OVERLAY)    */ 00154000
*              5 LCPZRTL6 BIT(1),      /* WRITE REQUEST              */ 00155000
*            4 LCPZRT07 BIT(1),        /* BUFFER TRACE ACTIVE        */ 00156000
*                                      /* FLAG (REQ. TAG OVERLAY)    */ 00157000
*              5 LCPZRTL7 BIT(1),      /* SCHEDULING FLAG            */ 00158000
*          3 LCPMNRCD CHAR(1),         /* LCP MINOR REJECTION CODE   */ 00159000
*            4 LCPZRT08 BIT(1),        /* I/O TRACE ACTIVE FLAG      */ 00160000
*                                      /* (REQ. TAG OVERLAY)         */ 00161000
*              5 LCPZRTL8 BIT(1),      /* DEVICE END NOTIFICATION    */ 00162000
*            4 LCPZRT09 BIT(1),        /* DIALOGUE SCHED DISABLED    */ 00163000
*              5 LCPZRTL9 BIT(1),      /* CRITICAL TEXT FLAG         */ 00164000
*            4 LCPZRT0A BIT(1),        /* SIMULATED CONTACT FLAG     */ 00165000
*            4 LCPZRT0B BIT(1),        /* SIMULATED DISCONNECT FLAG  */ 00166000
*        2 LCPCHAIN PTR(31),           /* APS CHAIN                  */ 00167000
*          3 LCPCHAI1 PTR(8),                                      0545 00168000
*            4 LCPCHNG BIT(1),         /* GATE BIT                   */ 00169000
*          3 LCPCHAI2 PTR(24),         /* ADDRESS FIELD              */ 00170000
*        2 LCPRUCNT PTR(8),            /* NUMBER OF RU FOR THIS LCPB */ 00171000
*          3 LCPZMIRC CHAR(1),         /* MINOR RETURN CODE          */ 00172000
*        2 LCPFLAG2 CHAR(1),           /* SECOND FLAG BYTE           */ 00173000
*          3 LCPPRFLG BIT(1),          /* PACING REQUIRED            */ 00174000
*          3 LCPASYN  BIT(1),          /* ASYNCHRONOUS LCPB          */ 00175000
*          3 LCPRSTRT BIT(1),          /* RESTART LCPB               */ 00176000
*          3 LCPTLBPI BIT(1),          /* TPIOS BLOCK LCCW           */ 00177000
*            4 LCPZRIMM BIT(1),        /* RESET IMMED REQUIRED ON ERR*/ 00178000
*          3 LCPFID0  BIT(1),          /* FID0 TH INDICATOR FOR RECORD* 00179000
*            4 LCPEXRES BIT(1),        /* EXCEP. RESPONSE SPEC. 3270R*/ 00180000
*          3 LCPDSTAT BIT(1),          /* DIALOGUE STATE BIT, 3270R  */ 00181000
*                                      /* 0=REQ. REJECT,1=STATE ERROR*/ 00182000
*          3 LCPFREE  BIT(1),          /* DEALLOCATE LCPB 3270R      */ 00183000
*          3 LCPATOP  BIT(1),          /* ATOP LCPB  3270R           */ 00184000
*        2 LCPSEQ   FIXED(16),         /* OUTBOUND SEQUENCE NUMBER   */ 00185000
*          3 LCPRRCCT PTR(8),          /* COUNT OF RESPONSES RECEIVED*/ 00186000
*          3 LCPRRCNT PTR(8),          /* COUNT OF RESPONSES REQUESTED* 00187000
*        2 LCPLCCW1 PTR(31),           /* ADDR FIRST LCCW FOR FID1   */ 00188000
*        2 LCPCID CHAR(4) BDY(WORD),   /* COMMUNICATION ID           */ 00189000
*          3 LCPSAF BIT(16),           /* SOURCE IDENTIFICATION      */ 00190000
*          3 LCPDAF BIT(16),           /* DESTINATION IDENTIFICATION */ 00191000
*        2 LCPNXLCW PTR(31),           /* ADDR NEXT LCCW             */ 00192000
*        2 LCPFDBA PTR(31),            /* BTU ADDRESS                */ 00193000
*          3 LCPFDB1 PTR(8),                                       0545 00194000
*          3 LCPFDB2 PTR(24),          /* ADDRESS FIELD              */ 00195000
*        2 LCPTLBAD PTR(31),           /* ADDRESS OF TLB             */ 00196000
*        2 LCPFOSN  BIT(16),           /* SEQUENCE NUMBER FIRST RU   */ 00197000
*        2 LCPFSNCH FIXED(16),         /* 1ST SEQ NUMBER IN RU CHAIN */ 00198000
*        2 LCPSTYPE FIXED(8),          /* LCPB SUB-TYPE X'FF' = RESET,* 00199000
*                                      /* X'00' = NON-RESET          */ 00200000
*        2 LCPFLG1 CHAR(1),            /* FLAGS                      */ 00201000
*          3 LCPRESET BIT(1),          /* A TPQUE WITH RESET QUEUED  */ 00202000
*                                      /* THIS ELEMENT               */ 00203000
*          3 LCPINTER BIT(1),          /* INTERNAL LCPB              */ 00204000
*          3 LCPDIRPT BIT(1),          /* NOT SEND W/POST=SCHED=0    */ 00205000
*          3 LCPREDRV BIT(1),          /* LCPB IS FOR REDRIVE        */ 00206000
*          3 LCPSTLB  BIT(1),          /* TLB NOT TO BE FREED        */ 00207000
*          3 LCPTRANS BIT(1),          /* DATA INCLUDES CONTROL CHARS*/ 00208000
*          3 LCPRSV78 BIT(2),          /* RESERVED                   */ 00209000
*        2 LCPLCCWC BIT(8),            /* COUNT OF LCCWS             */ 00210000
*        2 LCPRSV77 CHAR(1),           /* RESERVED                   */ 00211000
*        2 LCPFLCCW PTR(31),           /* ADDR OF FIRST LCCW         */ 00212000
*          3 LCPUBFSB PTR(31),         /* UNBIND FSB ADDRESS         */ 00213000
*        2 LCPCLREP PTR(31),           /* PTR TO CLEAR LCPB IN UCB   */ 00214000
*/*  NOTE:  THE FOLLOWING FIELD - LCPLCCW MUST BE THE LAST FIELD     */ 00215000
*/*         IN THIS CONTROL BLOCK.  THE CONTROL BLOCK ISTDCLCP HAS   */ 00216000
*/*         FIELDS IN IT WHICH MUST BE CONTIGUOUS WITH LCPLCCW       */ 00217000
*        2 LCPLCCW  CHAR(LENGTH(ISTLCCW)) BDY(WORD), /* FIRST LCCW   */ 00218000
*          3 LCPRSTQH PTR(31),         /* RESET LCPB QUEUE HEADER    */ 00219000
*          3 LCPPABA  PTR(31),         /* PAB POINTER                */ 00220000
*            4 LCPRPHA  PTR(31),       /* RPH POINTER                */ 00221000
*              5 LCPFTYPE BIT(1);      /* FEEDBACK TYPE              */ 00222000
*/*     CONSTANTS FOR LCPTYPE                                         * 00223000
*DCL  LCRPHFT  BIT(1) CONSTANT('1'B);                              0546 00224000
*DCL  LCPABFT  BIT(1) CONSTANT('0'B);                              0547 00225000
*DCL LCPBFIRM BIT(8) CONSTANT('10'X);  /* LU FAILED, CLSDST, SCHED LOST 00226000
*                                         TERM, OPNDST MAY BE TRIED   * 00227000
*DCL LCPBTERM BIT(8) CONSTANT('11'X);  /* TERM RECEIVED,CLSDST,    0549 00228000
*                                         SCHED LOST TERM             * 00229000
*/*                                                                   * 00230000
*                                                                  0550 00231000
*DCL 1 LCPZTIE BDY(WORD) DEFINED(LCPCID), /* TOLTEP INTERFACE      0550 00232000
*                                         ELEMENT OVERLAY            */ 00233000
*       2  LCPZFMCA PTR(31),           /* ACTIVE FMCB ADDRESS        */ 00234000
*       2  LCPZSNA PTR(31),            /* SYMBOLIC NAME ADDRESS      */ 00235000
*       2  LCPZSNAM CHAR(8) BDY(WORD), /* SYMBOLIC NAME              */ 00236000
*          3  LCPZTRV1 PTR(31),        /* RESERVED FOR RESTORE LCP   */ 00237000
*          3  LCPZTRV4 PTR(31);        /* RESERVED FOR RESTORE LCP   */ 00238000
*DCL LCTYPE BIT(8) CONSTANT('04'X);                                0551 00239000
*DCL PLCPTYPE BIT(8) CONSTANT('28'X);  /* PURGE LCPB TYPE ID         */ 00240000
*DCL LCPCLACB BIT(8) CONSTANT('04'X);  /* LCPB FROM CLOSE ACB        */ 00241000
*DCL LSRSTYPE BIT(8) CONSTANT('FF'X);  /* RESET SUBTYPE              */ 00242000
*DCL LCPETYPE BIT(8) CONSTANT('40'X);  /* EXTENDED LCPB TYPE ID      */ 00243000
*/*                                                                  */ 00244000
*/*  MINOR RETURN CODES                                              */ 00245000
*/*                                                                  */ 00246000
*DCL LCMCRSTR BIT(8) CONSTANT('F7'X),  /* MINOR RC FOR RESETSR       */ 00247000
*    LCPMNEW  BIT(8) CONSTANT('02'X),  /* EARLY WARNING,             */ 00248000
*                                      /* RECOVERY IN PROGRESS       */ 00249000
*    LCPMNPF  BIT(8) CONSTANT('03'X),  /* PERM. I/O FAILURE          */ 00250000
*    LCPMNAS  BIT(8) CONSTANT('04'X),  /* AUTO NETWORK SHUTDOWN      */ 00251000
*    LCPMNCL  BIT(8) CONSTANT('06'X),  /* CLOSE/CLSDST OCCURED       */ 00252000
*    LCPMNVD  BIT(8) CONSTANT('07'X),  /* VARY DEACTIVATE            */ 00253000
*    LCPMNTF  BIT(8) CONSTANT('10'X),  /* TEMP RECORD DEVICE FAILURE */ 00254000
*    LCPMNSF  BIT(8) CONSTANT('01'X),  /* TEMP BASIC FAILURE /       */ 00255000
*    LCPMNTS  BIT(8) CONSTANT('11'X),  /* TERMINATE SELF             */ 00256000
*    LCPMNAP  BIT(8) CONSTANT('0A'X),  /* APPL. ISSUED CLEAR         */ 00257000
*    LCPMNPR  BIT(8) CONSTANT('0B'X),  /* PREEMPT                    */ 00258000
*    LCPMNRE  BIT(8) CONSTANT('0C'X);  /* RESTORE                    */ 00259000
*/* VS1, VS2 TPIOS SAVEAREA FORMAT */                              0557 00260000
*DCL  1  ISTZSAVE BDY(WORD) BASED,                                 0557 00261000
*        2   ZSAZSVBC PTR(31),         /* SAVEAREA BACK CHAIN        */ 00262000
*            3   ZSAZSVMS CHAR(1),     /* MODULE TRACE CODE          */ 00263000
*                4 ZSAZACTV BIT(1),    /* ACTIVE SAVE AREA FLAG      */ 00264000
*        2   ZSAZSVFC PTR(31),         /* SAVEAREA FORWARD CHAIN     */ 00265000
*        2   ZSAZSVRR PTR(31),         /* RETURN REGISTER            */ 00266000
*        2   ZSAZSVVR (6) PTR(31),    /* VARIABLE REGS (7-12) SVEAREA*/ 00267000
*        2   ZSAZTRAC CHAR(4);        /* EBCDIC NAME OF OWNER        */ 00268000
*/*                                                                0558 00269000
*THE FOLLOWING EQUATES SHOULD READ ''FIXED(8) CONSTANT(LENGTH(X))'',    00270000
*WHERE X IS THE NAME OF THE VARIABLE CONTROL BLOCK OR FIELD OF WHICH    00271000
*LENGTH IS THE VALUE BEING EQUATED, SHOULD THE PLS COMPILER BE     0558 00272000
*BE ABLE TO TAKE IT.                                               0558 00273000
*                                                                    */ 00274000
*DCL ZSAZSVVA FIXED(8) CONSTANT(8);  /* DISPLACEMENT TO VARIABLE REGS*/ 00275000
*DCL ZSAZSVSZ FIXED(8) CONSTANT(40); /* LENGTH OF ISTZSAVE           */ 00276000
*/* PREFIX FOR CRR                                                   */ 00277000
*/*                                                                  */ 00278000
*/* RELEASE 1 - JUNE 28, 1973                                        */ 00279000
*/*                                                                  */ 00280000
*DCL 1 ISTPFCRR BASED BDY(WORD),        /* PREFIX FOR CRR            */ 00281000
*     2  PFCCRR   CHAR(4),              /* CRR HEADER                */ 00282000
*        3  PFCCRRID CHAR(1),           /* CRR ID FIELD              */ 00283000
*           4  CRRID CHAR(1),           /* BASIC CTL LAYER DEFINITION*/ 00284000
*        3  PFCRSV10 CHAR(1),           /* RESERVED FOR ALIGNMENT    */ 00285000
*        3  PFCCRRLN CHAR(2),           /* CRR LENGTH                */ 00286000
*           4  CRRLEN CHAR(2),          /* BASIC CTL LAYER DEF       */ 00287000
*     2  PFCHDR CHAR(8) BDY(WORD),      /* SAVE AREA FOR OLD CRR FRR */ 00288000
*        3  PFCCRRO  PTR(31),           /* PTR TO OLD CRR            */ 00289000
*           4  CRRCHAIN PTR(31),        /* BASIC CTL LAYER DEFINITION   00290000
*                                          FOR OLD CRR PTR           */ 00291000
*        3  PFCFRRO  PTR(31),           /* PTR TO OLD FRR            */ 00292000
*           4  CRRFRR   PTR(31),        /* BASIC CTL LAYER         0560 00293000
*                                          DEFINITION OF OLD FRR PTR */ 00294000
*     2  PFCFTA BIT(8),                 /* ID OF LAST FUNCTION TRACED*/ 00295000
*     2  PFCRSV01 CHAR(3);              /* ALIGNMENT                 */ 00296000
*DCL PFIDPIE BIT(8) CONSTANT('80'X);    /* DOS/VS TPIOS              */ 00297000
*DCL PFIDORE BIT(8) CONSTANT('81'X);    /* DOS/VS BMS                */ 00298000
*DCL PFIDAPE BIT(8) CONSTANT('82'X);    /* DOS/VS PSS                */ 00299000
*DCL PFCIDPSV BIT(8) CONSTANT('38'X); /* COMPONENT ID              0564 00300000
*                                          PSS - VS1 AND 2           */ 00301000
*DCL PFCIDTPV BIT(8) CONSTANT('3C'X); /* COMPONENT ID              0565 00302000
*                                          TPIOS VS1 AND 2           */ 00303000
*DCL PFCIDSME BIT(8) CONSTANT('3D'X); /* COMPONENT ID              0566 00304000
*                                          STORAGE MANAGEMENT DOS    */ 00305000
*DCL PFCIDOC BIT(8) CONSTANT('31'X);    /* COMPONENT ID OPEN/CLOSE   */ 00306000
*DCL PFCIDPS BIT(8) CONSTANT('32'X);    /* PORT SOLICITOR            */ 00307000
*DCL PFCIDCS BIT(8) CONSTANT('34'X);    /* CLUSTER SOLICITOR         */ 00308000
*DCL PFCIDIT BIT(8) CONSTANT('35'X);    /* INIT/TERM                 */ 00309000
*DCL PFCIDVY BIT(8) CONSTANT('36'X);    /* VARY                      */ 00310000
*DCL PFCIDNS  BIT(8) CONSTANT('37'X);   /* NET. STAT.SRV.            */ 00311000
*DCL PFCIDTPE BIT(8) CONSTANT('38'X);   /* COMPONENT ID            0573 00312000
*                                          TPIOS - DOS               */ 00313000
*DCL PFCIDCL BIT(8) CONSTANT('39'X);    /* COMPONENT ID            0574 00314000
*                                          CONTROL LAYER             */ 00315000
*DCL PFCIDPSE BIT(8) CONSTANT('3A'X);   /* COMPONENT ID            0575 00316000
*                                          PSS - DOS                 */ 00317000
*DCL PFCIDSMV BIT(8) CONSTANT('3F'X);   /* COMPONENT ID            0576 00318000
*                                          STORAGE MANAGEMENT        */ 00319000
*DCL PFCIDTIO BIT(8) CONSTANT('40'X);   /* COMPONENT ID TIIO       0577 00320000
*                                          PROCESSING (VS2)          */ 00321000
*DCL PFCIDRS  BIT(8) CONSTANT('41'X);   /* ID FOR REMOTE SOLICITOR   */ 00322000
*/* CRR FOR COMMAND FACILITIES                                      */  00323000
*/*  REVISIONS                                         001 06/02/75 */  00324000
*DCL  1  ISTCFCRR BDY(WORD) BASED, /* CRR FOR COMMAND FACILITIES    */  00325000
*        2 CFCAUDIT,               /* AUDIT TRAIL FOR CMD FACILITIES*/  00326000
*          3 CFCNTRD  CHAR(1),     /* LIST OF MODULES IN COMMAND    */  00327000
*                                  /* FACILITIES ENTERED            */  00328000
*            4 NCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 ENTERED   */  00329000
*            4 NCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 ENTERED   */  00330000
*            4 NCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 ENTERED   */  00331000
*            4 NCFCRP   BIT(1),    /* IND MODULE ISTCFCRP ENTERED   */  00332000
*            4 NCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 ENTERED   */  00333000
*            4 NCFRSVD  BIT(3),    /* RESERVED                      */  00334000
*          3 CFCCRT   CHAR(1),     /* LIST OF MODULES IN COMMAND    */  00335000
*                                  /* FACILITIES RUNNING            */  00336000
*            4 CCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 RUNNING   */  00337000
*            4 CCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 RUNNING   */  00338000
*            4 CCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 RUNNING   */  00339000
*            4 CCFCRP   BIT(1),    /* IND MODULE ISTCFCRP RUNNING   */  00340000
*            4 CCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 RUNNING   */  00341000
*            4 CCFRSVD1 BIT(3);    /* RESERVED                      */  00342000
*DCL TIDCFCS1 BIT(8) CONSTANT('00'X); /* THREAD ID FOR ISTCFCS1     */  00343000
*DCL TIDCFCR1 BIT(8) CONSTANT('01'X); /* THREAD ID FOR ISTCFCR1     */  00344000
*DCL TIDCFCR2 BIT(8) CONSTANT('02'X); /* THREAD ID FOR ISTCFCR2     */  00345000
*/* COMPONENT RECOVERY RECORD FOR TPIOS */                         0583 00346000
*/*  DELTA                                             006 02/10/75  */ 00347000
*DCL                                                               0583 00348000
*1  ISTZCRR BDY(WORD) BASED,     /* CONTROL WORD                     */ 00349000
*   2  ZCRCRR CHAR(4),           /* CONTROL WORD                     */ 00350000
*      3  ZCRID CHAR(1),         /* CONTROL BLOCK ID                 */ 00351000
*      3  ZCRLEN CHAR(2),        /* LENGTH OF ZCR                    */ 00352000
*      3  ZCRFLAG CHAR(1),       /* FLAGS                            */ 00353000
*   2  ZCRCHAIN PTR(31),         /* POINTER TO PREVIOUS ZCR          */ 00354000
*   2  ZCRFRRA PTR(31),          /* PTR TO FRR                       */ 00355000
*   2  ZCRFLGS1 CHAR(1),         /* FLGS USED BY REQUEST COMPLETION  */ 00356000
*      3  ZCREXSW BIT(1),        /* EXIT SWITCH                      */ 00357000
*      3  ZCRQUESW BIT(1),       /* QUEUE SWITCH                     */ 00358000
*      3  ZCRDEQSW BIT(1),       /* DEQUEUE SWITCH                   */ 00359000
*      3  ZCRWAIT BIT(1),        /* WAIT Q ANALYSIS COMPLETE         */ 00360000
*      3  ZCRNRMEX BIT(1),       /* NORMAL EXIT TO BE TAKEN          */ 00361000
*      3  ZCRENDLP BIT(1),       /* END OF LOOP SWITCH               */ 00362000
*      3  ZCRUNSOL BIT(1),       /* UNSOLICITED DATA                 */ 00363000
*      3  ZCRFEXIT BIT(1),       /* FORCE EXIT SWITCH                */ 00364000
*   2  ZCRFLGS2 CHAR(1),         /* FLAGS USED WITHIN TPIOS          */ 00365000
*      3  ZCRLOCAL BIT(1),       /* LOCAL SUPPORT                    */ 00366000
*      3  ZCRSHEDI BIT(1),       /* IMMEDIATE SCHEDULE               */ 00367000
*      3  ZCRFMSED BIT(1),       /* FMCB SEARCH ENDED                */ 00368000
*      3  ZCROB    BIT(1),       /* OUTBOUND PROC IN PROGRESS        */ 00369000
*      3  ZCRIF0E1 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   00370000
*                                   INBOUND PROCESSING               */ 00371000
*      3  ZCRIF0E2 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   00372000
*                                   INBOUND PROCESSING               */ 00373000
*      3  ZCRIF0E3 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   00374000
*                                   INBOUND PROCESSING               */ 00375000
*   2  ZCRSWFLD CHAR(1),         /* SWITCHES FOR TPIOS OUTBOUND      */ 00376000
*      3  ZCRENDSH BIT(1),       /* EXIT FROM REMOTE DEV SCHEDULER   */ 00377000
*         4  ZCRSLCP BIT(1),     /* SCHEDULE LCPB                    */ 00378000
*      3  ZCREXTYP BIT(1),       /* TPEXIT TYPE                      */ 00379000
*      3  ZCRENDPR BIT(1),       /* EXIT FROM INNER PROCESS          */ 00380000
*      3  ZCRNDLCP BIT(1),       /* EXIT FROM LCPB PROCESSING        */ 00381000
*         4  ZCROB1 BIT(1),      /* REMOTE DEV SCHED 1ST TIME SWITCH */ 00382000
*      3  ZCRENDX BIT(1),        /* EXIT FROM LCCW/BTU XLATION       */ 00383000
*      3  ZCRENDXL BIT(1),       /* EXIT FROM LCCW PROC              */ 00384000
*      3  ZCRENDAN BIT(1),       /* EXIT FROM LCPB ANALYSIS          */ 00385000
*      3  ZCRRESET BIT(1),                                         0583 00386000
*         4  ZCRCNLXL BIT(1),    /* CANCEL FURTHER XLATE             */ 00387000
*   2  ZCRFLGS3 CHAR(1),         /* FLAGS FOR OUTBOUND PROCESSING    */ 00388000
*      3  ZCRTIC BIT(1),         /* SELECT NOT TO BE SENT            */ 00389000
*      3  ZCRTPCON BIT(1),       /* TPIOS CONTACT SENT               */ 00390000
*      3  ZCRTPDIS BIT(1),       /* TPIOS DISCONNECT TO BE SENT      */ 00391000
*      3  ZCRDISC  BIT(1),       /* DISCONNECT IN PROCESS            */ 00392000
*      3  ZCREDRIV BIT(1),       /* DO DERIVE                        */ 00393000
*      3  ZCRNOFRE BIT(1),       /* NO FREEING OF SIO QUEUE          */ 00394000
*      3  ZCRWRPTR BIT(1),       /* WRITE TO PRINTER REQUEST         */ 00395000
*      3  ZCRINLCP BIT(1),       /* ERROR OCCURED DURING OUTBND PROC */ 00396000
*   2  ZCRGENSW CHAR(1),         /* GENERAL SWITCHES                 */ 00397000
*      3  ZCRTSW1  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 00398000
*      3  ZCRTSW2  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 00399000
*      3  ZCRRT06  BIT(1),       /* CRITICAL TEXT OPTION             */ 00400000
*      3  ZCRLCSYN BIT(1),       /* LCCW SYNC SPECIFIED              */ 00401000
*      3  ZCREXRES BIT(1),       /* EXCEPTION RESPONSE SPECIFIED     */ 00402000
*      3  ZCRCLRBD BIT(1),       /* FLAG INDICATING BIND WAS CLEARED */ 00403000
*      3  ZCRBRIS  BIT(1),       /* BRACKET REJECTED DUE TO IN BRAC. */ 00404000
*      3  ZCRF1RES BIT(1),       /* FID1 RESPONSE TO BE GENERATED    */ 00405000
*   2  ZCRPFLGS CHAR(1),         /* UTILITIES PROC OPTION FLAGS      */ 00406000
*      3  ZCRQAHED BIT(1),      /* QXFR RTN TO USE INSERT OPT'N ON TPQ* 00407000
*      3  *        BIT(7),      /* RESERVED                          */ 00408000
*   2  ZCRIBPR CHAR(1),          /* INBOUND PROCESSING FLAGS         */ 00409000
*         3  ZCRNOBUF BIT(1),    /* FSB WITH NO BUFFER               */ 00410000
*         3  ZCRERR   BIT(1),    /* ERROR INDICATOR                  */ 00411000
*         3  ZCRRELK  BIT(1),    /* RESET ERROR LOCK FUNCTION REQ.   */ 00412000
*         3  ZCRLCPFR BIT(1),    /* FLAG IND. DEALLOCATE ATOP LCPB   */ 00413000
*         3  ZCRLCPFD BIT(1),    /* FLAG IND. LCPB FOUND ON WAITQ    */ 00414000
*         3  ZCR3270  BIT(1),    /* 3270 DEVICE                      */ 00415000
*         3  ZCR3270R BIT(1),    /* 3270 DEVICE IN RECORD MODE       */ 00416000
*         3  *        BIT(1),    /* RESERVED                         */ 00417000
*   2  ZCRSCPSW CHAR(1),         /* SESSION CONTROL FLAGS            */ 00418000
*         3  ZCRTPEX BIT(1),     /* TP EXIT                          */ 00419000
*         3  ZCRTPINV BIT(1),    /* INVOKE TPIOS                     */ 00420000
*         3  ZCRRJLCP BIT(1),    /* LCPB REJECTED                    */ 00421000
*         3  ZCRLREQ BIT(1),     /* REQUEST                          */ 00422000
*         3  ZCRPRCMP BIT(1),    /* PROCESSING COMPLETE              */ 00423000
*         3  ZCRFSBWE BIT(1),    /* FSB IS WORK ELEMENT              */ 00424000
*         3  ZCRSKIPT BIT(1),    /* SKIP TRACE FLAG                  */ 00425000
*         3  *       BIT(1),     /* RESERVED                         */ 00426000
*   2  ZCRCRLCP PTR(31),         /* CURRENT LCPB PTR                 */ 00427000
*   2  ZCRPARMS BDY(WORD),       /* PARAMETERS PASSED TO UTILITIES */   00428000
*      3  ZCRFBPTR PTR(31),      /* PTR TO FROM BUFFER               */ 00429000
*         4  ZCRCBPTR PTR(31),   /* PTR TO CURRENT BUFFER            */ 00430000
*      3  ZCRTBPTR PTR(31),      /* PTR TO TO-OR-TRANSLATE BUFFER    */ 00431000
*      3  ZCRMLNG FIXED(15),     /* LENGTH TO MOVE                   */ 00432000
*      3  ZCRDFRDA FIXED(15),    /* OFFSET FROM DATA ADDR IN FROM BUF*/ 00433000
*         4  ZCRDTODA FIXED(15), /* OFFSET FROM DATA ADDR XLATE BUF  */ 00434000
*      3  ZCRPCOD1 CHAR(1),      /* CODE BYTE FOR ALLOC/DISALLOC     */ 00435000
*         4  ZCRPPG BIT(1),      /* GET PAGEABLE BUFF                */ 00436000
*         4  ZCRPLNG BIT(1),     /* LENGTH OF BUFFER SPECIFIED       */ 00437000
*         4  ZCRPFSB BIT(1),     /* GET FSB                          */ 00438000
*         4  ZCRPLSBF BIT(1),    /* GET LSCB AND BUFFER              */ 00439000
*            5 ZCRPLSBQ BIT(1),  /* PURGE LSCB QUEUE                 */ 00440000
*         4  ZCRPLSCB BIT(1),    /* GET OR RELEASE LSCB              */ 00441000
*         4  ZCRPBUF BIT(1),     /* GET OR RELEASE BUFFER            */ 00442000
*         4  ZCRPCFTX BIT(1),    /* CONFIDENTIAL TEXT                */ 00443000
*         4  ZCRPRES BIT(1),     /* RESERVED                         */ 00444000
*      3  ZCRPCOD2 CHAR(1),      /* CODE BYTE FOR MOVE               */ 00445000
*         4  ZCRPPG2 BIT(1),     /* GET PAGEABLE BUFFER              */ 00446000
*         4  ZCRPFHDR BIT(1),    /* FROM BUFFER FDB TO BE USED       */ 00447000
*         4  ZCRPMFGF BIT(1),    /* MOVE STARTS WIHT 1ST BUFF IN BLOCK* 00448000
*         4  ZCRPRES2 BIT(5),    /* RESERVED                         */ 00449000
*      3  ZCRPCHAR CHAR(1),      /* TRANSLATE & TEST SEARCH CHARACTER*/ 00450000
*      3  ZCRPSW   CHAR(1),      /* SWITCH FIELD                     */ 00451000
*   2  ZCRCCWA PTR(31),          /* PTR TO CURRENT CCW (CCW 1 OR 2)  */ 00452000
*   2  ZCRBFPTR PTR(31),         /* SAVE 1ST BUFF PTR IN TO-BUFF CHN    00453000
*                                   OR LAST BUFFER IN CHANNEL PGM    */ 00454000
*   2  ZCRZLB PTR(31),           /* PTR TO CURR BUFF IN CHANNEL PGM  */ 00455000
*   2  ZCRPVZB PTR(31),          /* PTR TO PREVIOUS BUFF IN CHAN PGM */ 00456000
*   2  ZCRSVRTN BDY(WORD),       /* REG 14 SAVE AREAS                */ 00457000
*      3  ZCRSVF1 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00458000
*      3  ZCRSVF2 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00459000
*      3  ZCRSVF3 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00460000
*      3  ZCRSVF4 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00461000
*      3  ZCRSVF5 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00462000
*      3  ZCRSVF6 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00463000
*      3  ZCRSVF7 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00464000
*      3  ZCRSVF8 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00465000
*      3  ZCRSVF9 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00466000
*      3  ZCRSVF10 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00467000
*      3  ZCRSVF11 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00468000
*      3  ZCRSVF12 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00469000
*      3  ZCRSVF13 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00470000
*      3  ZCRSVF14 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00471000
*      3  ZCRSVF15 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00472000
*      3  ZCRSVF16 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00473000
*      3  ZCRSVF17 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00474000
*      3  ZCRSVF18 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00475000
*      3  ZCRSVF19 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00476000
*      3  ZCRSVF20 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00477000
*      3  ZCRSVF21 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00478000
*      3  ZCRSVF22 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00479000
*      3  ZCRSVF23 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00480000
*      3  ZCRSVF24 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00481000
*      3  ZCRSVF25 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00482000
*   2  ZCRWKARA BDY(WORD),       /* TEMPORARY REG SAVE AREA          */ 00483000
*      3  ZCRSVWK1 PTR(31),      /* SAVE REQUIRED REG                */ 00484000
*      3  ZCRSVWK2 PTR(31),      /* SAVE REQUIRED REG                */ 00485000
*      3  ZCRSVWK3 PTR(31),      /* SAVE REQUIRED REG                */ 00486000
*      3  ZCRSVWK4 PTR(31),      /* SAVE REQUIRED REG                */ 00487000
*      3  ZCRSVWK5 PTR(31),      /* SAVE REQUIRED REG                */ 00488000
*   2  ZCRFSBSV PTR(31),         /* FSB CHAIN PTR SAVEAREA           */ 00489000
*   2  ZCRFBPRC BIT(1),          /* FSB PROCESS SW                   */ 00490000
*   2  ZCRMOREL BIT(1),          /* MORE ELEMENTS SW                 */ 00491000
*   2  ZCRSCANQ BIT(1),          /* SCAN QUEUE SW                    */ 00492000
*   2  ZCRNXTEL BIT(1),          /* NEXT ELEMENT SW                  */ 00493000
*   2  ZCRXSCHD BIT(1),          /* EXIT SCHEDULE SW                 */ 00494000
*   2  ZCRLSTFB BIT(1),          /* INBOUND PROC LAST FSB FOR ELEM SW*/ 00495000
*   2  ZCRTOPQ  BIT(1),          /* QUEUE ELEMENT TO TOP SW          */ 00496000
*   2  ZCRAWQSW BIT(1),          /* CHECK AWAITQ FOR MORE WORK =1    */ 00497000
*                                /* CHECK WAITQ =0                   */ 00498000
*   2  ZCRRCDSV CHAR(1),         /* RETURN CODE SAVEAREA             */ 00499000
*   2  ZCRPRMTC CHAR(1),         /* PREEMPT COMPLETION PARAMETER BYTE*/ 00500000
*   2  ZCROPCDE CHAR(1),         /* OP CODE TO BE TRANSFORMED         * 00501000
*   2  ZCRR2SV PTR(31),          /* ISTZBFDI REG 2 SAVE EREA         */ 00502000
*   2  ZCRR13SV PTR(31),         /* ISTSBFDI REG 13 SAVE EREA        */ 00503000
*   2  ZCRCIDSV BDY(WORD),       /* ISTZBFDI CID SAVE AREA           */ 00504000
*      3  ZCRSAFSV CHAR(2),      /* ISTZBFDI SAF SAVE AREA           */ 00505000
*      3  ZCRDAFSV CHAR(2),      /* ISTZBFDI DAF SAVE AREA           */ 00506000
*   2  ZCRSAVEZ (6) BDY(WORD) CHAR(LENGTH(ISTZSAVE)),              0583 00507000
*                                /* SAVE/TRACE AREAS FOR TPIOS MODS  */ 00508000
*   2  ZCRREMIC PTR(31),        /* POINTER TO REMOTE RN ICNCB        */ 00509000
*   2  ZCRAUDIT CHAR(36),        /* TPIOS AUDIT TRAIL AREA           */ 00510000
*      3  ZCRTID CHAR(1),        /* THREAD I.D.                      */ 00511000
*      3  ZCRTNAME CHAR(4),      /* LAST 4 CHARS OF THREAD NAME      */ 00512000
*      3  ZCRENTER BIT(248),     /* BIT ARRAY FOR MODULES ENTERED    */ 00513000
*         4  ZCREAC1A BIT(1),    /* ISTZAC1A ENTERED                 */ 00514000
*         4  ZCREAC0A BIT(1),    /* ISTZAC0A ENTERED                 */ 00515000
*         4  ZCREAC0B BIT(1),    /* ISTZAC0B ENTERED                 */ 00516000
*         4  ZCREAC1B BIT(1),    /* ISTZAC1B ENTERED                 */ 00517000
*         4  ZCREBCAA BIT(1),    /* ISTZBCAA ENTERED                 */ 00518000
*         4  ZCREBCAB BIT(1),    /* ISTZBCAB ENTERED                 */ 00519000
*         4  ZCREBCAE BIT(1),    /* ISTZBCAE ENTERED                 */ 00520000
*         4  ZCREBCAG BIT(1),    /* ISTZBCAG ENTERED                 */ 00521000
*         4  ZCREBCAI BIT(1),    /* ISTZBCAI ENTERED                 */ 00522000
*         4  ZCREBCAM BIT(1),    /* ISTZBCAM ENTERED                 */ 00523000
*         4  ZCREBCBA BIT(1),    /* ISTZBCBA ENTERED                 */ 00524000
*         4  ZCREBCBB BIT(1),    /* ISTZBCBB ENTERED                 */ 00525000
*         4  ZCREBCBI BIT(1),    /* ISTZBCBI ENTERED                 */ 00526000
*         4  ZCREBCCB BIT(1),    /* ISTZBCCB ENTERED                 */ 00527000
*         4  ZCREBCDI BIT(1),    /* ISTZBCDI ENTERED                 */ 00528000
*         4  ZCREBCEB BIT(1),    /* ISTZBCEB ENTERED                 */ 00529000
*         4  ZCREBCFA BIT(1),    /* ISTZBCFA ENTERED                 */ 00530000
*         4  ZCREBCFB BIT(1),    /* ISTZBCFB ENTERED                 */ 00531000
*         4  ZCREBCGA BIT(1),    /* ISTZBCGA ENTERED                 */ 00532000
*         4  ZCREBCGB BIT(1),    /* ISTZBCGB ENTERED                 */ 00533000
*         4  ZCREBCHA BIT(1),    /* ISTZBCHA ENTERED                 */ 00534000
*         4  ZCREBCHB BIT(1),    /* ISTZBCHB ENTERED                 */ 00535000
*         4  ZCREBCIA BIT(1),    /* ISTZBCIA ENTERED                 */ 00536000
*         4  ZCREBCIB BIT(1),    /* ISTZBCIB ENTERED                 */ 00537000
*         4  ZCREBCID BIT(1),    /* ISTZBCID ENTERED                 */ 00538000
*         4  ZCREBCJA BIT(1),    /* ISTZBCJA ENTERED                 */ 00539000
*         4  ZCREBCJB BIT(1),    /* ISTZBCJB ENTERED                 */ 00540000
*         4  ZCREBCKA BIT(1),    /* ISTZBCKA ENTERED                 */ 00541000
*         4  ZCREBCKB BIT(1),    /* ISTZBCKB ENTERED                 */ 00542000
*         4  ZCREBCLA BIT(1),    /* ISTZBCLA ENTERED                 */ 00543000
*         4  ZCREBCLB BIT(1),    /* ISTZBCLB ENTERED                 */ 00544000
*         4  ZCREBCMB BIT(1),    /* ISTZBCMB ENTERED                 */ 00545000
*         4  ZCREBCND BIT(1),    /* ISTZBCND ENTERED                 */ 00546000
*         4  ZCREBCNE BIT(1),    /* ISTZBCNE ENTERED                 */ 00547000
*         4  ZCREBCOB BIT(1),    /* ISTZBCOB ENTERED                 */ 00548000
*         4  ZCREBCPB BIT(1),    /* ISTZBCPB ENTERED                 */ 00549000
*         4  ZCREBCQB BIT(1),    /* ISTZBCQB ENTERED                 */ 00550000
*         4  ZCREBCRA BIT(1),    /* ISTZBCRA ENTERED                 */ 00551000
*         4  ZCREBCRB BIT(1),    /* ISTZBCRB ENTERED                 */ 00552000
*         4  ZCREBCSC BIT(1),    /* ISTZBCSC ENTERED                 */ 00553000
*         4  ZCREBCXA BIT(1),    /* ISTZBCXA ENTERED                 */ 00554000
*         4  ZCREBCX0 BIT(1),    /* ISTZBCX0 ENTERED                 */ 00555000
*         4  ZCREBCY0 BIT(1),    /* ISTZBCY0 ENTERED                 */ 00556000
*         4  ZCREBCZ0 BIT(1),    /* ISTZBCZ0 ENTERED                 */ 00557000
*         4  ZCREBC0A BIT(1),    /* ISTZBC0A ENTERED                 */ 00558000
*         4  ZCREBC0B BIT(1),    /* ISTZBC0B ENTERED                 */ 00559000
*         4  ZCRECC0A BIT(1),    /* ISTZCC0A ENTERED                 */ 00560000
*         4  ZCRECC0B BIT(1),    /* ISTZCC0B ENTERED                 */ 00561000
*         4  ZCRECC1A BIT(1),    /* ISTZCC1A ENTERED                 */ 00562000
*         4  ZCRECC1B BIT(1),    /* ISTZCC1B ENTERED                 */ 00563000
*         4  ZCRECC2B BIT(1),    /* ISTZCC2B ENTERED                 */ 00564000
*         4  ZCREDCA0 BIT(1),    /* ISTZDCA0 ENTERED                 */ 00565000
*         4  ZCREDCB0 BIT(1),    /* ISTZDCB0 ENTERED                 */ 00566000
*         4  ZCREDCC0 BIT(1),    /* ISTZDCC0 ENTERED                 */ 00567000
*         4  ZCREDCD0 BIT(1),    /* ISTZDCD0 ENTERED                 */ 00568000
*         4  ZCREDCE0 BIT(1),    /* ISTZDCE0 ENTERED                 */ 00569000
*         4  ZCREDCF0 BIT(1),    /* ISTZDCF0 ENTERED                 */ 00570000
*         4  ZCREDCH0 BIT(1),    /* ISTZDCH0 ENTERED                 */ 00571000
*         4  ZCREDCI0 BIT(1),    /* ISTZDCI0 ENTERED                 */ 00572000
*         4  ZCREDCJ0 BIT(1),    /* ISTZDCJ0 ENTERED                 */ 00573000
*         4  ZCREDCKA BIT(1),    /* ISTZDCKA ENTERED                 */ 00574000
*         4  ZCREDCKB BIT(1),    /* ISTZDCKB ENTERED                 */ 00575000
*         4  ZCREDCL0 BIT(1),    /* ISTZDCL0 ENTERED                 */ 00576000
*         4  ZCREDCMB BIT(1),    /* ISTZDCMB ENTERED                 */ 00577000
*         4  ZCREECBA BIT(1),    /* ISTZECBA ENTERED                 */ 00578000
*         4  ZCREECBB BIT(1),    /* ISTZECBB ENTERED                 */ 00579000
*         4  ZCREECCA BIT(1),    /* ISTZECCA ENTERED                 */ 00580000
*         4  ZCREECCB BIT(1),    /* ISTZECCB ENTERED                 */ 00581000
*         4  ZCREECDA BIT(1),    /* ISTZECDA ENTERED                 */ 00582000
*         4  ZCREECEA BIT(1),    /* ISTZECEA ENTERED                 */ 00583000
*         4  ZCREECTA BIT(1),    /* ISTZECTA ENTERED                 */ 00584000
*         4  ZCREFCEA BIT(1),    /* ISTZFCEA ENTERED                 */ 00585000
*         4  ZCREFCEB BIT(1),    /* ISTZFCEB ENTERED                 */ 00586000
*         4  ZCREGCAB BIT(1),    /* ISTZGCAB ENTERED                 */ 00587000
*         4  ZCREGCBB BIT(1),    /* ISTZGCBB ENTERED                 */ 00588000
*         4  *        BIT(1),    /* NOT USED                         */ 00589000
*         4  ZCREGCDB BIT(1),    /* ISTZGCDB ENTERED                 */ 00590000
*         4  ZCREGCEB BIT(1),    /* ISTZGCEB ENTERED                 */ 00591000
*         4  ZCREGCLA BIT(1),    /* ISTZGCLA ENTERED                 */ 00592000
*         4  ZCREGC0A BIT(1),    /* ISTZGC0A ENTERED                 */ 00593000
*         4  ZCREGC0B BIT(1),    /* ISTZGC0B ENTERED                 */ 00594000
*         4  ZCREHCAN BIT(1),    /* ISTZHCAN ENTERED                 */ 00595000
*         4  ZCREICAA BIT(1),    /* ISTZICAA ENTERED                 */ 00596000
*         4  ZCREICAB BIT(1),    /* ISTZICAB ENTERED                 */ 00597000
*         4  ZCREICBB BIT(1),    /* ISTZICBB ENTERED                 */ 00598000
*         4  ZCREICBI BIT(1),    /* ISTZICBI ENTERED                 */ 00599000
*         4  ZCREICCB BIT(1),    /* ISTZICCB ENTERED                 */ 00600000
*         4  ZCREICCI BIT(1),    /* ISTZICCI ENTERED                 */ 00601000
*         4  ZCREICDB BIT(1),    /* ISTZICDB ENTERED                 */ 00602000
*         4  ZCREICEB BIT(1),    /* ISTZICEB ENTERED                 */ 00603000
*         4  ZCREICGB BIT(1),    /* ISTZICGB ENTERED                 */ 00604000
*         4  ZCREICHB BIT(1),    /* ISTZICHB ENTERED                 */ 00605000
*         4  ZCREICIB BIT(1),    /* ISTZICIB ENTERED                 */ 00606000
*         4  ZCREICID BIT(1),    /* ISTZICID ENTERED                 */ 00607000
*         4  ZCREICJB BIT(1),    /* ISTZICJB ENTERED                 */ 00608000
*         4  ZCREICKB BIT(1),    /* ISTZICKB ENTERED                 */ 00609000
*         4  ZCREICKE BIT(1),    /* ISTZICKE ENTERED                 */ 00610000
*         4  ZCREICKG BIT(1),    /* ISTZICKG ENTERED                 */ 00611000
*         4  ZCREICLB BIT(1),    /* ISTZICLB ENTERED                 */ 00612000
*         4  ZCREICMB BIT(1),    /* ISTZICMB ENTERED                 */ 00613000
*         4  ZCREICNA BIT(1),    /* ISTZICNA ENTERED                 */ 00614000
*         4  ZCREICNB BIT(1),    /* ISTZICNB ENTERED                 */ 00615000
*         4  ZCREICOA BIT(1),    /* ISTZICOA ENTERED                 */ 00616000
*         4  ZCREICOB BIT(1),    /* ISTZICOB ENTERED                 */ 00617000
*         4  ZCREICQA BIT(1),    /* ISTZICQA ENTERED                 */ 00618000
*         4  ZCREICQB BIT(1),    /* ISTZICQB ENTERED                 */ 00619000
*         4  ZCREICRB BIT(1),    /* ISTZICRB ENTERED                 */ 00620000
*         4  ZCREICSB BIT(1),    /* ISTZICSB ENTERED                 */ 00621000
*         4  ZCREICSC BIT(1),    /* ISTZICSC ENTERED                 */ 00622000
*         4  ZCREICTB BIT(1),    /* ISTZICTB ENTERED                 */ 00623000
*         4  ZCREICUB BIT(1),    /* ISTZICUB ENTERED                 */ 00624000
*         4  ZCREICVB BIT(1),    /* ISTZICVB ENTERED                 */ 00625000
*         4  ZCREICWB BIT(1),    /* ISTZICWB ENTERED                 */ 00626000
*         4  ZCREICX0 BIT(1),    /* ISTZICX0 ENTERED                 */ 00627000
*         4  ZCREIC0B BIT(1),    /* ISTZIC0B ENTERED                 */ 00628000
*         4  ZCREIC1B BIT(1),    /* ISTZIC1B ENTERED                 */ 00629000
*         4  ZCREJCAB BIT(1),    /* ISTZJCAB ENTERED                 */ 00630000
*         4  ZCREJCBB BIT(1),    /* ISTZJCBB ENTERED                 */ 00631000
*         4  ZCREJCCB BIT(1),    /* ISTZJCCB ENTERED                 */ 00632000
*         4  ZCREJCDB BIT(1),    /* ISTZJCDB ENTERED                 */ 00633000
*         4  ZCREJC0B BIT(1),    /* ISTZJC0B ENTERED                 */ 00634000
*         4  ZCREKCBB BIT(1),    /* ISTZKCBB ENTERED                 */ 00635000
*         4  ZCREKCBN BIT(1),    /* ISTZKCBN ENTERED                 */ 00636000
*         4  ZCREKCCN BIT(1),    /* ISTZKCCN ENTERED                 */ 00637000
*         4  ZCREDCWR BIT(1),    /* ISTZDCWR ENTERED                 */ 00638000
*         4  ZCREDCWB BIT(1),    /* ISTZDCWB ENTERED                 */ 00639000
*         4  ZCREDCXR BIT(1),    /* ISTZDCXR ENTERED                 */ 00640000
*         4  ZCREBCBR BIT(1),    /* ISTZBCBR ENTERED                 */ 00641000
*         4  ZCREBCDR BIT(1),    /* ISTZBCDR ENTERED                 */ 00642000
*         4  ZCREBCAR BIT(1),    /* ISTZBCAR ENTERED                 */ 00643000
*         4  ZCRECCBI BIT(1),    /* ISTZCCBI ENTERED                 */ 00644000
*         4  ZCRECCAI BIT(1),    /* ISTZCCAI ENTERED                 */ 00645000
*         4  ZCRECCCI BIT(1),    /* ISTZCCCI ENTERED                 */ 00646000
*         4  ZCREAC1R BIT(1),    /* ISTZAC1R ENTERED                 */ 00647000
*         4  ZCREBCSB BIT(1),    /* ISTZBCSB ENTERED                 */ 00648000
*         4  ZCREDCPR BIT(1),    /* ISTZDCPR ENTERED                 */ 00649000
*         4  ZCREDCQR BIT(1),    /* ISTZDCQR ENTERED                 */ 00650000
*         4  ZCREBCAL BIT(1),    /* ISTZBCAL ENTERED                 */ 00651000
*         4  ZCREBC0L BIT(1),    /* ISTZBC0L ENTERED                 */ 00652000
*         4  ZCREBCNB BIT(1),    /* ISTZBCNB ENTERED                 */ 00653000
*         4  ZCREICOE BIT(1),    /* ISTZICOE ENTERED                 */ 00654000
*         4  ZCREDCNB BIT(1),    /* ISTZDCNB ENTERED                 */ 00655000
*         4  ZCREKCCB BIT(1),    /* ISTZKCCB ENTERED                 */ 00656000
*         4  ZCRECFY0 BIT(1),    /* ISTZCFY0 ENTERED                 */ 00657000
*         4  ZCREDCK0 BIT(1),    /* ISTZDFK0 ENTERED                 */ 00658000
*         4  ZCREICSG BIT(1),    /* ISTZICSG ENTERED                 */ 00659000
*         4  ZCREBCIF BIT(1),    /* ISTZBCIF ENTERED                 */ 00660000
*         4  ZCREDCMF BIT(1),    /* ISTZDCMF ENTERED                 */ 00661000
*         4  ZCRELCAB BIT(1),    /* ISTZLCAB ENTERED                 */ 00662000
*         4  ZCREAC2B BIT(1),    /* ISTZAC2B ENTERED                 */ 00663000
*         4  ZCREIC2B BIT(1),    /* ISTZIC2B ENTERED                 */ 00664000
*         4  ZCRRSV97 BIT(97),   /* RESERVED                         */ 00665000
*   2  ZCRCMNRC CHAR(1),                /* PURGE MWOR RETURN CODE    */ 00666000
*   2  ZCRWORDA CHAR(3),                /* RESERVED FOR LATER USE    */ 00667000
*   2  ZCRLCPB  CHAR(LENGTH(ISTLCPB)),  /* 3270 S/R LCPB             */ 00668000
*      3 ZCRRHRU,                       /* SAVEAREA FOR RH AND RU    */ 00669000
*        4 ZCRRH    CHAR(3),            /* RH                        */ 00670000
*        4 ZCRRU    CHAR(*);            /* RU                        */ 00671000
*DCL ZCTYPE BIT(8) CONSTANT('00'X);   /* ZCR TYPE                   */  00672000
*DCL ZCLNG FIXED(15) CONSTANT(172);   /* ZCRR LENGTH                */  00673000
*DCL ZCRSAVNO BIT(8) CONSTANT('06'X); /* NUMBER OF SAVEAREAS IN ZCRR */ 00674000
*DCL ZCRLSVNO BIT(8) CONSTANT('04'X); /* NUMBER OF SAVE AREAS IN   0587 00675000
*                                         LOCAL SUPPORT              */ 00676000
*/* *** EQUATES FOR ZCRRCDSV *** */                                0588 00677000
*                                                                  0588 00678000
*DCL ZCRMRFSB BIT(8) CONSTANT('0C'X);  /* REQUEST COMPLETION MOVE FSB   00679000
*                                         TO PROCESS                 */ 00680000
*DCL ZCRSRCHQ BIT(8) CONSTANT('10'X);  /* REQUEST COMPLETION SEARCH     00681000
*                                         REQUEST QUEUE              */ 00682000
*DCL ZCREXIT  BIT(8) CONSTANT('14'X);  /* REQUEST COMPLETION EXIT    */ 00683000
*DCL ZCRSFSB  BIT(8) CONSTANT('18'X);  /* REQUEST COMPLETION SINGLE     00684000
*                                         FSB                        */ 00685000
*DCL ZCRDLFSB BIT(8) CONSTANT('1C'X);  /* REQUEST COMPLETION DUAL FSB * 00686000
*DCL ZCRNOSCH BIT (8) CONSTANT('20'X); /* REQUEST COMPLETION, EXIT WITH 00687000
*                                         SCHED NONE                 */ 00688000
*DCL ZCRNRSCH BIT (8) CONSTANT('24'X); /* REQUEST COMPLETION, EXIT WITH 00689000
*                                         SCHED NORM                 */ 00690000
*DCL ZCRLGERR FIXED(8) CONSTANT(8);    /* LOGICAL ERROR              */ 00691000
*DCL ZCPLSCB BIT(8) CONSTANT('08'X);   /* GET A RELEASE LSCB         */ 00692000
*DCL ZCPBUF  BIT(8) CONSTANT('04'X);   /* GET A RELEASE BUFFER       */ 00693000
*DCL ZCRTAC0A FIXED(8) CONSTANT(01);   /* LOCAL DEVICE SCHEDULER(OUT)*/ 00694000
*DCL ZCRTAC0B FIXED(8) CONSTANT(02);   /* REMOTE DEVICE SCHEDLER(OUT)*/ 00695000
*DCL ZCRTCC1A FIXED(8) CONSTANT(03);   /* LOCAL DIALOG SCHEDLER(IN)  */ 00696000
*DCL ZCRTCC1B FIXED(8) CONSTANT(04);   /* REMOTE DIALOG SCHEDLER(IN) */ 00697000
*DCL ZCRTDCE0 FIXED(8) CONSTANT(05);   /* NCP SLOWDOWN RECOVERY      */ 00698000
*DCL ZCRTDCKA FIXED(8) CONSTANT(06);   /* LOCAL GENERAL FUNCTIONS    */ 00699000
*DCL ZCRTDCKB FIXED(8) CONSTANT(07);   /* REMOTE GENERAL FUNCTIONS   */ 00700000
*DCL ZCRTFCEB FIXED(8) CONSTANT(08);   /* REMOTE READ BUFFER ALLOC.  */ 00701000
*DCL ZCRTGCLA FIXED(8) CONSTANT(09);   /* LCAL CTL & TEST FEEDBACK(IN)* 00702000
*DCL ZCRTGC0A FIXED(8) CONSTANT(10);   /* LOCAL REQ. COMPLETION(IN)  */ 00703000
*DCL ZCRTGC0B FIXED(8) CONSTANT(11);   /* REMOTE REQ. COMPLETION(IN) */ 00704000
*DCL ZCRTICWB FIXED(8) CONSTANT(12);   /* RESET CLEANUP (PHASE 5)    */ 00705000
*DCL ZCRTIC0B FIXED(8) CONSTANT(13);   /* REMOTE REQ COMPLTION CTL(IN)* 00706000
*DCL ZCRTAC1B FIXED(8) CONSTANT(14);   /* ISTZAC1B THREAD ID         */ 00707000
*DCL ZCRTIC1B FIXED(8) CONSTANT(15);   /* ISTZIC1B THREAD ID         */ 00708000
*DCL ZCRTCCBI FIXED(8) CONSTANT(16);   /* ISTZCCBI THREAD ID         */ 00709000
*DCL ZCRTAC1R FIXED(8) CONSTANT(17);   /* ISTZAC1R THREAD ID         */ 00710000
*DCL ZCRTAC1A FIXED(8) CONSTANT(18);   /* ISTZAC1A THREAD ID         */ 00711000
*DCL ZCRTLCAB FIXED(8) CONSTANT(19);   /* ISTZLCAB THREAD ID         */ 00712000
*/* COMPONENT RECOVERY                                               */ 00713000
*/*                                                                  */ 00714000
*DCL 1 ISTASCRR BDY(WORD) BASED,        /* CRR FOR SMS               */ 00715000
*     2  ASCPFCRR CHAR(LENGTH(ISTPFCRR)),                          0617 00716000
*     2  ASCFLAGS CHAR(7),              /* FLAGS                     */ 00717000
*        3  ASCFLG1 CHAR(2),            /* MODULE TRACE FLAGS        */ 00718000
*           4  ASCFBA BIT(1),           /* ALLOCATION IN PATH        */ 00719000
*           4  ASCFBD BIT(1),           /* DE-ALLOCATION IN PATH     */ 00720000
*           4  ASCFSR BIT(1),           /* FSR IN PATH               */ 00721000
*           4  ASCPASTR BIT(13),        /* RESERVED PATH FLAGS       */ 00722000
*        3  ASCFLG2 CHAR(2),            /* MODULE IN CONTROL FLAGS   */ 00723000
*           4  ASCFBAIC BIT(1),         /* ALLOCATION IN CONTROL     */ 00724000
*           4  ASCFBDIC BIT(1),         /* DE-ALLOCATION IN CONTROL  */ 00725000
*           4  ASCFSRIC BIT(1),         /* FSR IN CONTROL            */ 00726000
*           4  ASCICR BIT(13),          /* RESERVED IN CONTROL FLAGS */ 00727000
*        3  ASCFLG3 CHAR(3),            /* AUDIT FLAGS               */ 00728000
*           4  ASCFSRGT BIT(1),         /* FSR DOING GET PROCESSING  */ 00729000
*           4  ASCFBDAL BIT(1),         /* FBD DOING ALLOCATION      */ 00730000
*           4  ASCKEYF BIT(1),          /* KEY HAS BEEN ALTERED      */ 00731000
*           4  ASCLLKF BIT(1),          /* LOCAL LOCK HELD           */ 00732000
*           4  ASCFBDUD BIT(1),         /* FBD USING USER DATA       */ 00733000
*           4  ASCAUDIT BIT(19),        /* RESERVED AUDIT BITS       */ 00734000
*     2  ASCKEY CHAR(1),                /* ORIGINAL KEY              */ 00735000
*     2  ASCETRYA PTR(31),              /* RETRY ADRS FOR CONTINUE 0617 00736000
*                                          OPTION                    */ 00737000
*     2  ASCUSRGS CHAR(16),             /* SAVE AREA FOR USER REGS 0617 00738000
*                                          14 - 1                    */ 00739000
*        3  ASCUSR14 CHAR(4),           /* REGISTER 14               */ 00740000
*        3  ASCUSR15 CHAR(4),           /* REGISTER 15               */ 00741000
*        3  ASCUSR00 CHAR(4),           /* REGISTER 0                */ 00742000
*        3  ASCUSR01 CHAR(4),           /* REGISTER 1                */ 00743000
*     2  ASCPSREG CHAR(16);             /* SAVE AREA FOR PSS       0617 00744000
*                                          REGS 1 - 4                */ 00745000
*/*  INITIAL LEVEL                                      001 04/09/75 */ 00746000
*DCL 1 ISTAPCRR BDY(WORD) BASED,                                   0618 00747000
*     2 APCHDRSV CHAR(LENGTH(ISTPFCRR)),  /* HEADER                  */ 00748000
*     2  APCATFLG CHAR(2),              /* AUDIT TRACE FLAGS         */ 00749000
*        3  APC51E BIT(1),              /* ISTAPC51 WAS ENTERED      */ 00750000
*        3  APC52E BIT(1),              /* ISTAPC52  '     '         */ 00751000
*        3  APC53E BIT(1),              /* ISTAPC53                  */ 00752000
*        3  APC54E BIT(1),                                         0618 00753000
*        3  APC56E BIT(1),                                         0618 00754000
*        3  APC57E BIT(1),                                         0618 00755000
*        3  APC58E BIT(1),                                         0618 00756000
*        3  APC31E BIT(1),                                         0618 00757000
*        3 * BIT(8),                    /* RESERVED                  */ 00758000
*     2  APCRFLG CHAR(2),               /* AUDIT TRACE FLAGS         */ 00759000
*        3  APC51R BIT(1),              /* ISTAPCR1 IS RUNNING       */ 00760000
*        3  APC52R BIT(1),              /* ISTAPC52 IS RUNNING       */ 00761000
*        3  APC53R BIT(1),                                         0618 00762000
*        3  APC54R BIT(1),                                         0618 00763000
*        3  APC56R BIT(1),                                         0618 00764000
*        3  APC57R BIT(1),                                         0618 00765000
*        3  APC58R BIT(1),                                         0618 00766000
*        3  APC31R BIT(1),                                         0618 00767000
*        3  *      BIT(8),              /* RESERVED                  */ 00768000
*     2  APCPSTA PTR(31),               /* PST@                      */ 00769000
*     2  APCTCBA PTR(31),               /* TCB@                      */ 00770000
*     2  APCRTRN PTR(31),               /*@ TO BR14 TO RTN TO SYSTEM */ 00771000
*     2  APCPABSV PTR(31),              /*SAVED PAB@ TO REDISPATCH   */ 00772000
*     2  APCQWFO PTR(31),               /* Q@ IN PST WORK AREA ON    */ 00773000
*     2  APCFRRPM PTR(31),              /* WORKAREA@ RTN'D FROM SETFR*/ 00774000
*     2  APCSAVE CHAR(72),                                         0618 00775000
*        3  APCESTAL CHAR(72),          /* ESTAE PARAMETER LIST AREA */ 00776000
*     2  APCCOMF CHAR(4) BDY(HWORD),    /* FLAGS USED BY ALL PSS RTN */ 00777000
*        3  APCCOMF1 CHAR(2),                                      0618 00778000
*           4  APCSSTSK BIT(1),         /* IRB TYPE WORK             */ 00779000
*           4  APCUETSK BIT(1),         /* USER EXIT RUNNING UNDER IRB* 00780000
*           4  APCSMCR BIT(1),          /* SMA CRA BEING USED        */ 00781000
*           4  APCIRB1 BIT(1),          /* IRB1 BEING USED           */ 00782000
*           4  APCIRB2 BIT(1),          /* IRB2 BEING USED           */ 00783000
*           4  APCRELR BIT(1),          /*CALL ISTAPC58 TO RLEASE CRA*/ 00784000
*           4  APCEXIT BIT(1),          /* TELLS ISTAPC58 TO EXIT SYS*/ 00785000
*           4  APCZLBER BIT(1),         /* ERR WHILE RUNNING ZLFAB PAB* 00786000
*           4  * BIT(8),                /* RESERVED                  */ 00787000
*        3  APCRETCD FIXED(15),         /* RTN CODE FOR R15 FOR SYS  */ 00788000
*     2  APCSAV1 PTR(31),               /* 1ST SAVE WORD             */ 00789000
*     2  APCSAV2 PTR(31),               /* 2ND SAVE WORD             */ 00790000
*     2  APCSWTWD CHAR(4),              /* SWITCH AREA FOR PSS RTN   */ 00791000
*     2  APC31FLG CHAR(1),              /* ISTAPC31 FLAGS            */ 00792000
*        3  APCTPXIT BIT(1),            /* TPEXIT IN PROGRESS        */ 00793000
*        3  APCRESCH BIT(1),            /*PAB TPEXIT OCCURED  RESCHED*/ 00794000
*        3  APCSORT BIT(1),       /* PAB SORTED TO PROPER PST/MPST   */ 00795000
*        3  *       BIT(5),       /* RESERVED                        */ 00796000
*     2  APC52FLG CHAR(1),        /* ISTAPC52 FLAGS                  */ 00797000
*        3  APCCKRQ BIT(1),       /* CHECK RDY Q FOR WORK            */ 00798000
*        3  APCSMSR BIT(1),       /* RETURNING SMS RPH               */ 00799000
*        3  APCQENQ BIT(1),       /* ENQUEUEING PAB'S ON PST Q'S     */ 00800000
*        3  APCRDQ BIT(1),        /* DEQUEING PAB'S FROM PST RDY Q   */ 00801000
*        3  APCNWF BIT(1),        /* NO WORK FOUND                   */ 00802000
*        3  APCWKF   BIT(1),      /* WORK FOUND                      */ 00803000
*        3    *      BIT(2),      /* RESERVED                        */ 00804000
*     2  APC53FLG CHAR(1),        /* ISTAPC53 FLAGS                  */ 00805000
*        3  APCPR153 BIT(1),      /* USED PREALLOCATED CRA           */ 00806000
*     2  APC54FLG CHAR(1),        /* ISTAPC54 FLAGS                  */ 00807000
*        3  APCRLST BIT(1),       /* SMS BEING CALLED TO RELEASE UECB*/ 00808000
*        3  * BIT(7),             /* RESERVED                        */ 00809000
*     2  APC57FLG CHAR(1),        /* ISTAPC57 FLAGS                  */ 00810000
*        3  APCRECRA BIT(1),      /* RELEASE CRA BEING DONE          */ 00811000
*        3  APCNREL BIT(1),       /* DID NOT RELEASE CRA             */ 00812000
*        3  *   BIT(6),           /* RESERVED                        */ 00813000
*     2  * CHAR(15);              /* RESERVED                        */ 00814000
*/*               COMPONENT RECOVERY AREA                            */ 00815000
*/*  REVISIONS                                         005 04/09/75  */ 00816000
*DCL 1  ISTCRA BASED BDY(DWORD),        /* COMPONENT RECOVERY AREA   */ 00817000
*     2  CRABASIC BDY(WORD),            /* CRA WITHOUT PROCESS CRR   */ 00818000
*      3 CRAHDR CHAR(8) BDY(WORD),      /* CRA HEADER                */ 00819000
*        4  CRACRR PTR(31),             /* PTR TO ACTIVE CRR         */ 00820000
*        4  CRAFRR PTR(31),             /* PTR TO ACTIVE FRR         */ 00821000
*      3 CRALKACT BIT(32),              /* LOCK LEVEL AND          0619 00822000
*                                          OWNERSHIP FLAGS           */ 00823000
*        4  CRALEV32 BIT(1),            /* 1 = LEVEL 32 LOCK HELD    */ 00824000
*        4  CRALEV31 BIT(1),            /* 1 = LEVEL 31 LOCK HELD    */ 00825000
*        4  CRALEV30 BIT(1),            /* 1 = LEVEL 30 LOCK HELD    */ 00826000
*        4  CRALEV29 BIT(1),            /* 1 = LEVEL 29 LOCK HELD    */ 00827000
*        4  CRALEV28 BIT(1),            /* 1 = LEVEL 28 LOCK HELD    */ 00828000
*        4  CRALEV27 BIT(1),            /* 1 = LEVEL 27 LOCK HELD    */ 00829000
*        4  CRALEV26 BIT(1),            /* 1 = LEVEL 26 LOCK HELD    */ 00830000
*        4  CRALEV25 BIT(1),            /* 1 = LEVEL 25 LOCK HELD    */ 00831000
*        4  CRALEV24 BIT(1),            /* 1 = LEVEL 24 LOCK HELD    */ 00832000
*        4  CRALEV23 BIT(1),            /* 1 = LEVEL 23 LOCK HELD    */ 00833000
*        4  CRALEV22 BIT(1),            /* 1 = LEVEL 22 LOCK HELD    */ 00834000
*        4  CRALEV21 BIT(1),            /* 1 = LEVEL 21 LOCK HELD    */ 00835000
*        4  CRALEV20 BIT(1),            /* 1 = LEVEL 20 LOCK HELD    */ 00836000
*        4  CRALEV19 BIT(1),            /* 1 = LEVEL 19 LOCK HELD    */ 00837000
*        4  CRALEV18 BIT(1),            /* 1 = LEVEL 18 LOCK HELD    */ 00838000
*        4  CRALEV17 BIT(1),            /* 1 = LEVEL 17 LOCK HELD    */ 00839000
*        4  CRALEV16 BIT(1),            /* 1 = LEVEL 16 LOCK HELD    */ 00840000
*        4  CRALEV15 BIT(1),            /* 1 = LEVEL 15 LOCK HELD    */ 00841000
*        4  CRALEV14 BIT(1),            /* 1 = LEVEL 14 LOCK HELD    */ 00842000
*        4  CRALEV13 BIT(1),            /* 1 = LEVEL 13 LOCK HELD    */ 00843000
*        4  CRALEV12 BIT(1),            /* 1 = LEVEL 12 LOCK HELD    */ 00844000
*        4  CRALEV11 BIT(1),            /* 1 = LEVEL 11 LOCK HELD    */ 00845000
*        4  CRALEV10 BIT(1),            /* 1 = LEVEL 10 LOCK HELD    */ 00846000
*        4  CRALEV09 BIT(1),            /* 1 = LEVEL 9 LOCK HELD     */ 00847000
*        4  CRALEV08 BIT(1),            /* 1 = LEVEL 8 LOCK HELD     */ 00848000
*        4  CRALEV07 BIT(1),            /* 1 = LEVEL 7 LOCK HELD     */ 00849000
*        4  CRALEV06 BIT(1),            /* 1 = LEVEL 6 LOCK HELD     */ 00850000
*        4  CRALEV05 BIT(1),            /* 1 = LEVEL 5 LOCK HELD     */ 00851000
*        4  CRALEV04 BIT(1),            /* 1 = LEVEL 4 LOCK HELD     */ 00852000
*        4  CRALEV03 BIT(1),            /* 1 = LEVEL 3 LOCK HELD     */ 00853000
*        4  CRALEV02 BIT(1),            /* 1 = LEVEL 2 LOCK HELD     */ 00854000
*        4  CRALEV01 BIT(1),            /* 1 = LEVEL 1 LOCK HELD     */ 00855000
*      3 CRAL1PTR PTR(31),              /* PTR TO LEVEL 1 LOCK       */ 00856000
*      3 CRAL2PTR PTR(31),              /* PTR TO LEVEL 2 LOCK       */ 00857000
*      3 CRAL3PTR PTR(31),              /* PTR TO LEVEL 3 LOCK       */ 00858000
*      3 CRAL4PTR PTR(31),              /* PTR TO LEVEL 4 LOCK       */ 00859000
*      3 CRAL5PTR PTR(31),              /* PTR TO LEVEL 5 LOCK       */ 00860000
*      3 CRAL6PTR PTR(31),              /* PTR TO LEVEL 6 LOCK       */ 00861000
*      3 CRAL7PTR PTR(31),              /* PTR TO LEVEL 7 LOCK       */ 00862000
*      3 CRAL8PTR PTR(31),              /* PTR TO LEVEL 8 LOCK       */ 00863000
*      3 CRAL9PTR PTR(31),              /* PTR TO LEVEL 9 LOCK       */ 00864000
*      3 CRALAPTR PTR(31),              /* RESERVED                  */ 00865000
*/*                                                                  */ 00866000
*/*   VS1/VS2 EXTENSION                                              */ 00867000
*/*                                                                  */ 00868000
*     2  CRARPH CHAR(LENGTH(ISTRPH)),   /* RPH ASSOCIATED WITH     0619 00869000
*                                          THIS CRH                  */ 00870000
*     2  CRAPSS CHAR(LENGTH(ISTAPCRR)), /* PSS CRR                   */ 00871000
*     2  CRAPROCR CHAR(LENGTH(ISTZCRR)) BDY(DWORD), /* PROCESS CRR   */ 00872000
*     2  CRASVC CHAR(72) BDY(WORD),     /* SERVICE RTN CRA           */ 00873000
*        3  CRAASCRR CHAR(LENGTH(ISTASCRR)), /* CRR FOR SMS          */ 00874000
*        3  CRAHSIZ  PTR(31),           /* HEADER SIZE QUED SMS REQ  */ 00875000
*        3  CRAMASK  PTR(31),           /* PREFIX MASK QUED SMS REQ  */ 00876000
*        3  CRABUFA  FIXED(31),         /* BUFF QUE FOR FBQ ALLOCATION* 00877000
*           4 CRABFTBA BIT(1),          /* NO BUFFERS ALLOCATED YET   * 00878000
*     2  CRARSV01 PTR(31),              /* RESERVED                  */ 00879000
*     2  CRARSV02 PTR(31),              /* RESERVED                  */ 00880000
*     2  CRACHAIN PTR(31);              /* CHAIN FIELD USED TO QUEUE    00881000
*                                          CRA TO PREALLOCATE QUEUE     00882000
*                                          WHEN NOT IN USE           */ 00883000
*DCL CRALMS32 BIT(32) CONSTANT('80000000'X); /* 32ND LEVEL LOCK MASK */ 00884000
*DCL CRALMS31 BIT(32) CONSTANT('40000000'X); /* 31ST LEVEL LOCK MASK */ 00885000
*DCL CRALMS30 BIT(32) CONSTANT('20000000'X); /* 30TH LEVEL LOCK MASK */ 00886000
*DCL CRALMS29 BIT(32) CONSTANT('10000000'X); /* 29TH LEVEL LOCK MASK */ 00887000
*DCL CRALMS28 BIT(32) CONSTANT('08000000'X); /* 28TH LEVEL LOCK MASK */ 00888000
*DCL CRALMS27 BIT(32) CONSTANT('04000000'X); /* 27TH LEVEL LOCK MASK */ 00889000
*DCL CRALMS26 BIT(32) CONSTANT('02000000'X); /* 26TH LEVEL LOCK MASK */ 00890000
*DCL CRALMS25 BIT(32) CONSTANT('01000000'X); /* 25TH LEVEL LOCK MASK */ 00891000
*DCL CRALMS24 BIT(32) CONSTANT('00800000'X); /* 24TH LEVEL LOCK MASK */ 00892000
*DCL CRALMS23 BIT(32) CONSTANT('00400000'X); /* 23RD LEVEL LOCK MASK */ 00893000
*DCL CRALMS22 BIT(32) CONSTANT('00200000'X); /* 22ND LEVEL LOCK MASK */ 00894000
*DCL CRALMS21 BIT(32) CONSTANT('00100000'X); /* 21ST LEVEL LOCK MASK */ 00895000
*DCL CRALMS20 BIT(32) CONSTANT('00080000'X); /* 20TH LEVEL LOCK MASK */ 00896000
*DCL CRALMS19 BIT(32) CONSTANT('00040000'X); /* 19TH LEVEL LOCK MASK */ 00897000
*DCL CRALMS18 BIT(32) CONSTANT('00020000'X); /* 18TH LEVEL LOCK MASK */ 00898000
*DCL CRALMS17 BIT(32) CONSTANT('00010000'X); /* 17TH LEVEL LOCK MASK */ 00899000
*DCL CRALMS16 BIT(32) CONSTANT('00008000'X); /* 16TH LEVEL LOCK MASK */ 00900000
*DCL CRALMS15 BIT(32) CONSTANT('00004000'X); /* 15TH LEVEL LOCK MASK */ 00901000
*DCL CRALMS14 BIT(32) CONSTANT('00002000'X); /* 14TH LEVEL LOCK MASK */ 00902000
*DCL CRALMS13 BIT(32) CONSTANT('00001000'X); /* 13TH LEVEL LOCK MASK */ 00903000
*DCL CRALMS12 BIT(32) CONSTANT('00000800'X); /* 12TH LEVEL LOCK MASK */ 00904000
*DCL CRALMS11 BIT(32) CONSTANT('00000400'X); /* 11TH LEVEL LOCK MASK */ 00905000
*DCL CRALMS10 BIT(32) CONSTANT('00000200'X); /* 10TH LEVEL LOCK MASK */ 00906000
*DCL CRALMS09 BIT(32) CONSTANT('00000100'X); /* 9TH LEVEL LOCK MASK  */ 00907000
*DCL CRALMS08 BIT(32) CONSTANT('00000080'X); /* 8TH LEVEL LOCK MASK  */ 00908000
*DCL CRALMS07 BIT(32) CONSTANT('00000040'X); /* 7TH LEVEL LOCK MASK  */ 00909000
*DCL CRALMS06 BIT(32) CONSTANT('00000020'X); /* 6TH LEVEL LOCK MASK  */ 00910000
*DCL CRALMS05 BIT(32) CONSTANT('00000010'X); /* 5TH LEVEL LOCK MASK  */ 00911000
*DCL CRALMS04 BIT(32) CONSTANT('00000008'X); /* 4TH LEVEL LOCK MASK  */ 00912000
*DCL CRALMS03 BIT(32) CONSTANT('00000004'X); /* 3RD LEVEL LOCK MASK  */ 00913000
*DCL CRALMS02 BIT(32) CONSTANT('00000002'X); /* 2ND LEVEL LOCK MASK  */ 00914000
*DCL CRALMS01 BIT(32) CONSTANT('00000001'X); /* 1ST LEVEL LOCK MASK  */ 00915000
*DCL CRACRA   CHAR(4) CONSTANT('CRA ');      /* CHARACTER C.B. ID    */ 00916000
* /*  CONNECTION SERVICES COMPONENT RECOVERY RECORD                  */ 00917000
* /* COMPLETED DCR SOLUTIONS                                         */ 00918000
* /* 1H0540 APRIL 28, 1973 MB                                        */ 00919000
*/* ZTR4417 JUNE 20, 73 DNM */                                     0653 00920000
* DCL 1 ISTCNSTA BDY(WORD) BASED,       /* CONNECTION SERVICES     0653 00921000
*                                          COMPONENT RECOVERY RECORD */ 00922000
*     2  CNSTPFX CHAR(LENGTH(ISTPFCRR)), /* STANDARD PREFIX        0653 00923000
*                                          FOR CRR                   */ 00924000
*     2  CNSTFLDA CHAR(3),              /* TRACE FIELD A - HISTORY   */ 00925000
*        3  CNSMRINA BIT(1),            /* MASTER ENTERED            */ 00926000
*        3  CNSAUTHA BIT(1),            /* ABOUT TO CALL AUTHORI-  0653 00927000
*                                          SATION EXIT       ZTR4417 */ 00928000
*        3  CNSAQINA BIT(1),            /* ACQUIRE ENTERED           */ 00929000
*        3  CNSXREQA BIT(1),            /* ACQUIRE SATISFIED         */ 00930000
*        3  CNSQREQA BIT(1),            /* ACQUIRE QUEUED            */ 00931000
*        3  CNSRLINA BIT(1),            /* RELEASE ENTERED           */ 00932000
*        3  CNSDORLA BIT(1),            /* DOREL REALLOCATION      0653 00933000
*                                          ENTERED                   */ 00934000
*        3  CNSTRRLA BIT(1),            /* RELEASE OF ACTIVE       0653 00935000
*                                          CONNECTION                */ 00936000
*        3  CNSRQRLA BIT(1),            /* RELEASE QUEUED REQUEST    */ 00937000
*        3  CNSPSINA BIT(1),            /* PASS ENTERED              */ 00938000
*        3  CNSACINA BIT(1),            /* ACCEPT ENTERED            */ 00939000
*        3  CNSLGINA BIT(1),            /* LOGON ENTERED             */ 00940000
*        3  CNSGBINA BIT(1),            /* PREEMPT ENTERED           */ 00941000
*        3  CNSCLINA BIT(1),            /* CANCEL ENTERED            */ 00942000
*        3  CNSCLAQA BIT(1),            /* CANCEL ACQUIRES           */ 00943000
*        3  CNSTCONA BIT(1),            /* TCONNECT                  */ 00944000
*        3  CNSACONA BIT(1),            /* ACONNECT                  */ 00945000
*        3  CNSQUEUA BIT(1),            /* QUEUE                     */ 00946000
*        3  CNSSEARA BIT(1),            /* SEARCH Q                  */ 00947000
*        3  CNSGETSA BIT(1),            /* CONNECTION SERVICES     0653 00948000
*                                          GETSTORE                  */ 00949000
*        3  CNSFREEA BIT(1),            /* CONNECTION SERVICES     0653 00950000
*                                          FREESTORE                 */ 00951000
*        3  CNSACCTA BIT(1),            /* ABOUT TO CALL           0653 00952000
*                                          ACCOUNTING EXIT           */ 00953000
*        3  CNSLOG0A BIT(1),            /* LOGON 0                   */ 00954000
*        3  CNSRSV01 BIT(1),            /* RESERVED                  */ 00955000
*     2  CNSTFLDB CHAR(3),              /* TRACE FIELD B -         0653 00956000
*                                          CURRENT ACTIVITY          */ 00957000
*        3  CNSMRINB BIT(1),                                       0653 00958000
*        3  CNSAUTHB BIT(1),                                       0653 00959000
*        3  CNSAQINB BIT(1),                                       0653 00960000
*        3  CNSXREQB BIT(1),                                       0653 00961000
*        3  CNSQREQB BIT(1),                                       0653 00962000
*        3  CNSRLINB BIT(1),                                       0653 00963000
*        3  CNSDORLB BIT(1),                                       0653 00964000
*        3  CNSTRRLB BIT(1),                                       0653 00965000
*        3  CNSRQRLB BIT(1),                                       0653 00966000
*        3  CNSPSINB BIT(1),                                       0653 00967000
*        3  CNSACINB BIT(1),                                       0653 00968000
*        3  CNSLGINB BIT(1),                                       0653 00969000
*        3  CNSGBINB BIT(1),                                       0653 00970000
*        3  CNSCLINB BIT(1),                                       0653 00971000
*        3  CNSCLAQB BIT(1),                                       0653 00972000
*        3  CNSTCONB BIT(1),                                       0653 00973000
*        3  CNSACONB BIT(1),                                       0653 00974000
*        3  CNSQUEUB BIT(1),                                       0653 00975000
*        3  CNSSEARB BIT(1),                                       0653 00976000
*        3  CNSGETSB BIT(1),                                       0653 00977000
*        3  CNSFREEB BIT(1),                                       0653 00978000
*        3  CNSACCTB BIT(1),                                       0653 00979000
*        3  CNSLOG0B BIT(1),                                       0653 00980000
*        3  CNSRSV05 BIT(1);                                       0653 00981000
*/*    CRR FOR VARY                                                  */ 00982000
*/*  REVISIONS                                         009 03/24/75  */ 00983000
*/*                                                                  */ 00984000
* DCL 1 ISTVYCRR BDY(WORD) BASED,       /* CRR FOR SSCP              */ 00985000
*     2  VYCCNS   CHAR(LENGTH(ISTCNSTA)), /* RESERVE SPACE FOR     0654 00986000
*                                          CONN. SVCS. AUDIT         */ 00987000
*     2  VYCAUDIT,                      /* AUDIT TRAIL FOR SSCP      */ 00988000
*        3  VYCNTRD CHAR(12),           /* LIST OF MODULES IN SSCP   */ 00989000
*                                       /* 1 = ENTERED               */ 00990000
*           4  NINCCL BIT(1),           /* MODULE = ISTINCCL         */ 00991000
*           4  NINCIO BIT(1),           /* MODULE = ISTINCIO         */ 00992000
*           4  NINCDL BIT(1),           /* MODULE = ISTINCDL         */ 00993000
*           4  NINCMY BIT(1),           /* MODULE = ISTINCMY         */ 00994000
*           4  NINCMD BIT(1),           /* MODULE = ISTINCMD         */ 00995000
*           4  NINCVI BIT(1),           /* MODULE = ISTINCVI         */ 00996000
*           4  NINCVA BIT(1),           /* MODULE = ISTINCVA         */ 00997000
*           4  NINCLF BIT(1),           /* MODULE = ISTINCLF         */ 00998000
*           4  NINCR1 BIT(1),           /* MODULE = ISTINCR1         */ 00999000
*           4  NINCSM BIT(1),           /* MODULE = ISTINCSM         */ 01000000
*           4  NINCFS BIT(1),           /* MODULE = ISTINCFS         */ 01001000
*           4  NINCVX BIT(1),           /* MODULE = ISTINCVX         */ 01002000
*           4  NINCVP BIT(1),           /* MODULE = ISTINCVP         */ 01003000
*           4  NINCVS BIT(1),           /* MODULE = ISTINCVS         */ 01004000
*           4  NINCVN BIT(1),           /* MODULE = ISTINCVO         */ 01005000
*           4  NINCMS BIT(1),           /* MODULE = ISTINCMS         */ 01006000
*           4  NINCR2 BIT(1),           /* MODULE = ISTINCR2         */ 01007000
*           4  NINCIP BIT(1),           /* MODULE = ISTINCIP         */ 01008000
*           4  NINCD1 BIT(1),           /* MODULE = ISTINCD1         */ 01009000
*           4  NINCD2 BIT(1),           /* MODULE = ISTINCD2         */ 01010000
*           4  NINCD3 BIT(1),           /* MODULE = ISTINCD3         */ 01011000
*           4  NINCD4 BIT(1),           /* MODULE = ISTINCD4         */ 01012000
*           4  NINCD5 BIT(1),           /* MODULE = ISTINCD5         */ 01013000
*           4  NINCD6 BIT(1),           /* MODULE = ISTINCD6         */ 01014000
*           4  NINCD7 BIT(1),           /* MODULE = ISTINCD7         */ 01015000
*           4  NINCD8 BIT(1),           /* MODULE = ISTINCD8         */ 01016000
*           4  NINCD9 BIT(1),           /* MODULE = ISTINCD9         */ 01017000
*           4  NINCE0 BIT(1),           /* MODULE = ISTINCE0         */ 01018000
*           4  NINCE2 BIT(1),           /* MODULE = ISTINCE2         */ 01019000
*           4  NINCE3 BIT(1),           /* MODULE = ISTINCE3         */ 01020000
*           4  NINCE4 BIT(1),           /* MODULE = ISTINCE4         */ 01021000
*           4  NINCFM BIT(1),           /* MODULE = ISTINCFM         */ 01022000
*           4  NINCF1 BIT(1),           /* MODULE = ISTINCF1         */ 01023000
*           4  NINCF3 BIT(1),           /* MODULE = ISTINCF3         */ 01024000
*           4  NINCF4 BIT(1),           /* MODULE = ISTINCF4         */ 01025000
*           4  NINCL0 BIT(1),           /* MODULE = ISTINCL0         */ 01026000
*           4  NINCL1 BIT(1),           /* MODULE = ISTINCL1         */ 01027000
*           4  NINCL2 BIT(1),           /* MODULE = ISTINCL2         */ 01028000
*           4  NINCL3 BIT(1),           /* MODULE = ISTINCL3         */ 01029000
*           4  NINCL4 BIT(1),           /* MODULE = ISTINCL4         */ 01030000
*           4  NINCL5 BIT(1),           /* MODULE = ISTINCL5         */ 01031000
*           4  NINCL6 BIT(1),           /* MODULE = ISTINCL6         */ 01032000
*           4  NINCL7 BIT(1),           /* MODULE = ISTINCL7         */ 01033000
*           4  NINCL8 BIT(1),           /* MODULE = ISTINCL8         */ 01034000
*           4  NINCS1 BIT(1),           /* MODULE = ISTINCS1         */ 01035000
*           4  NINCUM BIT(1),           /* MODULE = ISTINCUM         */ 01036000
*           4  NINCU0 BIT(1),           /* MODULE = ISTINCU0          * 01037000
*           4  NINCU1 BIT(1),           /* MODULE = ISTINCU1         */ 01038000
*           4  NINCU2 BIT(1),           /* MODULE = ISTINCU2         */ 01039000
*           4  NINCU3 BIT(1),           /* MODULE = ISTINCU3         */ 01040000
*           4  NINCU4 BIT(1),           /* MODULE = ISTINCU4         */ 01041000
*           4  NINCU5 BIT(1),           /* MODULE = ISTINCU5         */ 01042000
*           4  NINCU6 BIT(1),           /* MODULE = ISTINCU6         */ 01043000
*           4  NINCU7 BIT(1),           /* MODULE = ISTINCU7         */ 01044000
*           4  NINCU8 BIT(1),           /* MODULE = ISTINCU8         */ 01045000
*           4  NINCV2 BIT(1),           /* MODULE = ISTINCV2         */ 01046000
*           4  NINCV3 BIT(1),           /* MODULE = ISTINCV3         */ 01047000
*           4  NINCV4 BIT(1),           /* MODULE = ISTINCV4         */ 01048000
*           4  NINCV5 BIT(1),           /* MODULE = ISTINCV5         */ 01049000
*           4  NINCV6 BIT(1),           /* MODULE = ISTINCV6         */ 01050000
*           4  NINCV7 BIT(1),           /* MODULE = ISTINCV7         */ 01051000
*           4  NINCV8 BIT(1),           /* MODULE = ISTINCV8         */ 01052000
*           4  NINCV9 BIT(1),           /* MODULE = ISTINCV9         */ 01053000
*           4  NINCW0 BIT(1),           /* MODULE = ISTINCW0         */ 01054000
*           4  NINCW2 BIT(1),           /* MODULE = ISTINCW2         */ 01055000
*           4  NINCW4 BIT(1),           /* MODULE = ISTINCW4         */ 01056000
*           4  NINCW5 BIT(1),           /* MODULE = ISTINCW5         */ 01057000
*           4  NINCW6 BIT(1),           /* MODULE = ISTINCW6         */ 01058000
*           4  NINCW7 BIT(1),           /* MODULE = ISTINCW7         */ 01059000
*           4  NINCW8 BIT(1),           /* MODULE = ISTINCW8         */ 01060000
*           4  NINCW9 BIT(1),           /* MODULE = ISTINCW9         */ 01061000
*           4  NINCX0 BIT(1),           /* MODULE = ISTINCX0         */ 01062000
*           4  NINCX1 BIT(1),           /* MODULE = ISTINCX1         */ 01063000
*           4  NINCX2 BIT(1),           /* MODULE = ISTINCX2         */ 01064000
*           4  NINCX3 BIT(1),           /* MODULE = ISTINCX3         */ 01065000
*           4  NINCX6 BIT(1),           /* MODULE = ISTINCX6         */ 01066000
*           4  NINCX7 BIT(1),           /* MODULE = ISTINCX7         */ 01067000
*           4  NINCX8 BIT(1),           /* MODULE = ISTINCX8         */ 01068000
*           4  NINCX9 BIT(1),           /* MODULE = ISTINCX9         */ 01069000
*           4  NINCUA BIT(1),           /* MODULE = ISTINCUA         */ 01070000
*           4  NINCUB BIT(1),           /* MODULE = ISTINCUB         */ 01071000
*           4  NINCUQ BIT(1),           /* MODULE = ISTINCUQ         */ 01072000
*           4  NINCE1 BIT(1),           /* MODULE = ISTINCE1         */ 01073000
*           4  NINCE5 BIT(1),           /* MODULE = ISTINCE5         */ 01074000
*           4  NINCE6 BIT(1),           /* MODULE = ISTINCE6         */ 01075000
*           4  NINCE7 BIT(1),           /* MODULE = ISTINCE7         */ 01076000
*           4  NINCE8 BIT(1),           /* MODULE = ISTINCE8         */ 01077000
*           4  NINCR3 BIT(1),           /* MODULE = ISTINCR3         */ 01078000
*           4  NINCR5 BIT(1),           /* MODULE = ISTINCR5         */ 01079000
*           4  NINCVO BIT(1),           /* MODULE = ISTINCVO         */ 01080000
*           4  NINCE9 BIT(1),           /* MODULE = ISTINCE9         */ 01081000
*           4  NINCFE BIT(1),           /* MODULE = ISTINCFE         */ 01082000
*           4  VYCRSV01 BIT(4),         /* RESERVED                  */ 01083000
*        3  VYCCRT CHAR(12),            /* LIST OF SSCP MODULES      */ 01084000
*                                       /* 2 =  RUNNING              */ 01085000
*           4  CINCCL BIT(1),           /* MODULE = ISTINCCL         */ 01086000
*           4  CINCIO BIT(1),           /* MODULE = ISTINCIO         */ 01087000
*           4  CINCDL BIT(1),           /* MODULE = ISTINCDL         */ 01088000
*           4  CINCMY BIT(1),           /* MODULE = ISTINCMY         */ 01089000
*           4  CINCMD BIT(1),           /* MODULE = ISTINCMD         */ 01090000
*           4  CINCVI BIT(1),           /* MODULE = ISTINCVI         */ 01091000
*           4  CINCVA BIT(1),           /* MODULE = ISTINCVA         */ 01092000
*           4  CINCLF BIT(1),           /* MODULE = ISTINCLF         */ 01093000
*           4  CINCR1 BIT(1),           /* MODULE = ISTINCR1         */ 01094000
*           4  CINCSM BIT(1),           /* MODULE = ISTINCSM         */ 01095000
*           4  CINCFS BIT(1),           /* MODULE = ISTINCFS         */ 01096000
*           4  CINCVX BIT(1),           /* MODULE = ISTINCVX         */ 01097000
*           4  CINCVP BIT(1),           /* MODULE = ISTINCVP         */ 01098000
*           4  CINCVS BIT(1),           /* MODULE = ISTINCVS         */ 01099000
*           4  CINCVN BIT(1),           /* MODULE = ISTINCVO         */ 01100000
*           4  CINCMS BIT(1),           /* MODULE = ISTINCMS         */ 01101000
*           4  CINCR2 BIT(1),           /* MODULE = ISTINCR2         */ 01102000
*           4  CINCIP BIT(1),           /* MODULE = ISTINCIP         */ 01103000
*           4  CINCD1 BIT(1),           /* MODULE = ISTINCD1         */ 01104000
*           4  CINCD2 BIT(1),           /* MODULE = ISTINCD2         */ 01105000
*           4  CINCD3 BIT(1),           /* MODULE = ISTINCD3         */ 01106000
*           4  CINCD4 BIT(1),           /* MODULE = ISTINCD4         */ 01107000
*           4  CINCD5 BIT(1),           /* MODULE = ISTINCD5         */ 01108000
*           4  CINCD6 BIT(1),           /* MODULE = ISTINCD6         */ 01109000
*           4  CINCD7 BIT(1),           /* MODULE = ISTINCD7         */ 01110000
*           4  CINCD8 BIT(1),           /* MODULE = ISTINCD8         */ 01111000
*           4  CINCD9 BIT(1),           /* MODULE = ISTINCD9         */ 01112000
*           4  CINCE0 BIT(1),           /* MODULE = ISTINCE0         */ 01113000
*           4  CINCE2 BIT(1),           /* MODULE = ISTINCE2         */ 01114000
*           4  CINCE3 BIT(1),           /* MODULE = ISTINCE3         */ 01115000
*           4  CINCE4 BIT(1),           /* MODULE = ISTINCE4         */ 01116000
*           4  CINCFM BIT(1),           /* MODULE = ISTINCFM         */ 01117000
*           4  CINCF1 BIT(1),           /* MODULE = ISTINCF1         */ 01118000
*           4  CINCF3 BIT(1),           /* MODULE = ISTINCF3         */ 01119000
*           4  CINCF4 BIT(1),           /* MODULE = ISTINCF4         */ 01120000
*           4  CINCL0 BIT(1),           /* MODULE = ISTINCL0         */ 01121000
*           4  CINCL1 BIT(1),           /* MODULE = ISTINCL1         */ 01122000
*           4  CINCL2 BIT(1),           /* MODULE = ISTINCL2         */ 01123000
*           4  CINCL3 BIT(1),           /* MODULE = ISTINCL3         */ 01124000
*           4  CINCL4 BIT(1),           /* MODULE = ISTINCL4         */ 01125000
*           4  CINCL5 BIT(1),           /* MODULE = ISTINCL5         */ 01126000
*           4  CINCL6 BIT(1),           /* MODULE = ISTINCL6         */ 01127000
*           4  CINCL7 BIT(1),           /* MODULE = ISTINCL7         */ 01128000
*           4  CINCL8 BIT(1),           /* MODULE = ISTINCL8         */ 01129000
*           4  CINCS1 BIT(1),           /* MODULE = ISTINCS1         */ 01130000
*           4  CINCUM BIT(1),           /* MODULE = ISTINCUM         */ 01131000
*           4  CINCU0 BIT(1),           /* MODULE = ISTINCU0          * 01132000
*           4  CINCU1 BIT(1),           /* MODULE = ISTINCU1         */ 01133000
*           4  CINCU2 BIT(1),           /* MODULE = ISTINCU2         */ 01134000
*           4  CINCU3 BIT(1),           /* MODULE = ISTINCU3         */ 01135000
*           4  CINCU4 BIT(1),           /* MODULE = ISTINCU4         */ 01136000
*           4  CINCU5 BIT(1),           /* MODULE = ISTINCU5         */ 01137000
*           4  CINCU6 BIT(1),           /* MODULE = ISTINCU6         */ 01138000
*           4  CINCU7 BIT(1),           /* MODULE = ISTINCU7         */ 01139000
*           4  CINCU8 BIT(1),           /* MODULE = ISTINCU8         */ 01140000
*           4  CINCV2 BIT(1),           /* MODULE = ISTINCV2         */ 01141000
*           4  CINCV3 BIT(1),           /* MODULE = ISTINCV3         */ 01142000
*           4  CINCV4 BIT(1),           /* MODULE = ISTINCV4         */ 01143000
*           4  CINCV5 BIT(1),           /* MODULE = ISTINCV5         */ 01144000
*           4  CINCV6 BIT(1),           /* MODULE = ISTINCV6         */ 01145000
*           4  CINCV7 BIT(1),           /* MODULE = ISTINCV7         */ 01146000
*           4  CINCV8 BIT(1),           /* MODULE = ISTINCV8         */ 01147000
*           4  CINCV9 BIT(1),           /* MODULE = ISTINCV9         */ 01148000
*           4  CINCW0 BIT(1),           /* MODULE = ISTINCW0         */ 01149000
*           4  CINCW2 BIT(1),           /* MODULE = ISTINCW2         */ 01150000
*           4  CINCW4 BIT(1),           /* MODULE = ISTINCW4         */ 01151000
*           4  CINCW5 BIT(1),           /* MODULE = ISTINCW5         */ 01152000
*           4  CINCW6 BIT(1),           /* MODULE = ISTINCW6         */ 01153000
*           4  CINCW7 BIT(1),           /* MODULE = ISTINCW7         */ 01154000
*           4  CINCW8 BIT(1),           /* MODULE = ISTINCW8         */ 01155000
*           4  CINCW9 BIT(1),           /* MODULE = ISTINCW9         */ 01156000
*           4  CINCX0 BIT(1),           /* MODULE = ISTINCX0         */ 01157000
*           4  CINCX1 BIT(1),           /* MODULE = ISTINCX1         */ 01158000
*           4  CINCX2 BIT(1),           /* MODULE = ISTINCX2         */ 01159000
*           4  CINCX3 BIT(1),           /* MODULE = ISTINCX3         */ 01160000
*           4  CINCX6 BIT(1),           /* MODULE = ISTINCX6         */ 01161000
*           4  CINCX7 BIT(1),           /* MODULE = ISTINCX7         */ 01162000
*           4  CINCX8 BIT(1),           /* MODULE = ISTINCX8         */ 01163000
*           4  CINCX9 BIT(1),           /* MODULE = ISTINCX9         */ 01164000
*           4  CINCUA BIT(1),           /* MODULE = ISTINCUA         */ 01165000
*           4  CINCUB BIT(1),           /* MODULE = ISTINCUB         */ 01166000
*           4  CINCUQ BIT(1),           /* MODULE = ISTINCUQ         */ 01167000
*           4  CINCE1 BIT(1),           /* MODULE = ISTINCE1         */ 01168000
*           4  CINCE5 BIT(1),           /* MODULE = ISTINCE5         */ 01169000
*           4  CINCE6 BIT(1),           /* MODULE = ISTINCE6         */ 01170000
*           4  CINCE7 BIT(1),           /* MODULE = ISTINCE7         */ 01171000
*           4  CINCE8 BIT(1),           /* MODULE = ISTINCE8         */ 01172000
*           4  CINCR3 BIT(1),           /* MODULE = ISTINCR3         */ 01173000
*           4  CINCR5 BIT(1),           /* MODULE = ISTINCR5         */ 01174000
*           4  CINCVO BIT(1),           /* MODULE = ISTINCVO         */ 01175000
*           4  CINCE9 BIT(1),           /* MODULE = ISTINCE9         */ 01176000
*           4  CINCFE BIT(1),           /* MODULE = ISTINCFE         */ 01177000
*           4  VYCRSV03 BIT(4),         /* RESERVED                  */ 01178000
*     2  VYCRRSAV CHAR(72),             /* SAVE AREA USED BY ISTINCIP*/ 01179000
*                                       /* TO CALL ISTINCW3          */ 01180000
*     2  VYCRRCW3 CHAR(8),              /* PARAM LIST USED BY        */ 01181000
*                                       /* ISTINCIP TO CALL ISTINCW3 */ 01182000
*     2  VYCRSV04 CHAR(2),              /* RESERVED                  */ 01183000
*     2  VYCRSV02 PTR(31);              /* RESERVED                  */ 01184000
*DCL TIDINCDL BIT(8) CONSTANT('00'X);   /* THREAD ID FOR ISTINCDL    */ 01185000
*DCL TIDINCMY BIT(8) CONSTANT('01'X);   /* THREAD ID FOR ISTINCMY    */ 01186000
*DCL TIDINCCL BIT(8) CONSTANT('02'X);   /* THREAD ID FOR ISTINCCL    */ 01187000
*DCL TIDINCFE BIT(8) CONSTANT('04'X);   /* THREAD ID FOR ISTINCFE    */ 01188000
*                                                                  0659 01189000
*/* END OF ATBUILD                                                   */ 01190000
*/*  ** SET ENTERED BIT FOR THIS PROCEDURE **                        */ 01191000
*                                                                  0659 01192000
*     NCSPLRPH->RPHCRR->CRACRR->NINCSM='1'B;                       0659 01193000
*                                                                  0659 01194000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0659 01195000
         L     @10,RPHCRR(,@10)                                    0659 01196000
         L     @10,CRACRR(,@10)                                    0659 01197000
         OI    NINCSM(@10),B'01000000'                             0659 01198000
*/*  ** CLEAR AND SET CURRENT PROCEDURE BIT **                       */ 01199000
*                                                                  0660 01200000
*     NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;                       0660 01201000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0660 01202000
         MVI   VYCCRT(@10),B'00000000'                             0660 01203000
*     NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;                       0661 01204000
         OI    CINCSM(@10),B'01000000'                             0661 01205000
*   END;                                                           0662 01206000
*                                                                  0662 01207000
*/********************************************************************/ 01208000
*/* SET SAVE AREA POINTER TO NEXT AVAILABLE SAVE AREA IN VARYS WORK  */ 01209000
*/* STORAGE                                                          */ 01210000
*/********************************************************************/ 01211000
*                                                                  0663 01212000
*   RESPECIFY                                                      0663 01213000
*    (GPR00P,                                                      0663 01214000
*     GPR13P) RESTRICTED;                                          0663 01215000
*   GPR00P=GPR13P;                  /* TEMP SAVE R13                 */ 01216000
         LR    GPR00P,GPR13P                                       0664 01217000
*   GPR13P=GPR13P-SEVENTWO;         /* SET POINTER TO NEXT SAVE AREA    01218000
*                                      IN VARYS WORK AREA            */ 01219000
         SL    GPR13P,@CF00130                                     0665 01220000
*   CALLER13=GPR00P;                /* SAVE CALLERS SAVEAREA ADDR    */ 01221000
         ST    GPR00P,CALLER13(,GPR13P)                            0666 01222000
*   CALLED13=ZEROES;                /* CLEAR MY FORWARD PTR          */ 01223000
         SLR   @10,@10                                             0667 01224000
         ST    @10,CALLED13(,GPR13P)                               0667 01225000
*   GPR00P->CALLED13=GPR13P;        /* PT TO MY SAVE AREA            */ 01226000
         LR    @10,GPR00P                                          0668 01227000
         ST    GPR13P,CALLED13(,@10)                               0668 01228000
*   RESPECIFY                                                      0669 01229000
*     GPR00P UNRESTRICTED;                                         0669 01230000
*                                                                  0669 01231000
*/********************************************************************/ 01232000
*/* ESTABLISH THE ADDRESS OF CSMS WORK AREA                          */ 01233000
*/********************************************************************/ 01234000
*                                                                  0670 01235000
*   DATABASE=NXTAVPTR;              /* PT TO FREE WORKAREA           */ 01236000
         L     @09,NCSPLWKA(,NCSPLPTR)                             0670 01237000
         L     DATABASE,NXTAVPTR(,@09)                             0670 01238000
*   DATABASE=(DATABASE+SEVEN)&MINUS8;/* SET ON DBWD ALIGNMENT      0671 01239000
*                                                            @D32CKXK*/ 01240000
         LA    @10,7                                               0671 01241000
         ALR   @10,DATABASE                                        0671 01242000
         N     @10,@CF03200                                        0671 01243000
         LR    DATABASE,@10                                        0671 01244000
*   GENERATE NOSETS REFS(DATABASE)(USING @DATD,DATABASE);          0672 01245000
         USING @DATD,DATABASE                                           01246000
*   NXTAVPTR=NXTAVPTR+@SIZDATD;     /* ADJUST NEXT AVAIL PAST      0673 01247000
*                                      DATADSECT                     */ 01248000
         L     @10,NCSPLWKA(,NCSPLPTR)                             0673 01249000
         L     @09,NXTAVPTR(,@10)                                  0673 01250000
         AL    @09,@SIZDATD                                        0673 01251000
         ST    @09,NXTAVPTR(,@10)                                  0673 01252000
*   NXTAVPTR=(NXTAVPTR+SEVEN)&MINUS8;/* INSURE DBWD ALIGNMENT        */ 01253000
         L     @15,@CF03200                                        0674 01254000
         LA    @14,7                                               0674 01255000
         ALR   @09,@14                                             0674 01256000
         NR    @09,@15                                             0674 01257000
         ST    @09,NXTAVPTR(,@10)                                  0674 01258000
*   NCSMGLPT=NXTAVPTR;              /* ALLOCATE MGL                  */ 01259000
         ST    @09,NCSMGLPT(,NCSPLPTR)                             0675 01260000
*   NXTAVPTR=NXTAVPTR+LENGTH(ISTMGL);/* ADJUST NEXT AVIL             */ 01261000
         LA    @00,19                                              0676 01262000
         ALR   @00,@09                                             0676 01263000
         ST    @00,NXTAVPTR(,@10)                                  0676 01264000
*   ISTMGL=ISTMGL&&ISTMGL;          /* CLEAR ISTMGL                  */ 01265000
         XC    ISTMGL(19,@09),ISTMGL(@09)                          0677 01266000
*   NXTAVPTR=(NXTAVPTR+SEVEN)&MINUS8;/* INSURE DBWD ALIGNMENT        */ 01267000
         ALR   @00,@14                                             0678 01268000
         NR    @00,@15                                             0678 01269000
         ST    @00,NXTAVPTR(,@10)                                  0678 01270000
*   RPHPTR=NCSPLRPH;                /* GET ADDR OF RPH               */ 01271000
         L     RPHPTR,NCSPLRPH(,NCSPLPTR)                          0679 01272000
*/********************************************************************/ 01273000
*/* DETERMINE WHAT VERB CODE IN NCSPL INDICATES AND GO TO THAT       */ 01274000
*/* PROCESSOR                                                        */ 01275000
*/********************************************************************/ 01276000
*                                                                  0680 01277000
*   IF NCSPLVCD^=NCSPLVC7           /* TEST FOR INIT/TERM            */ 01278000
*     THEN                                                         0680 01279000
         CLI   NCSPLVCD(NCSPLPTR),X'07'                            0680 01280000
         BE    @RF00680                                            0680 01281000
*     DO;                           /* NOT INIT TERM                 */ 01282000
*       IF NCSPLVBF=NCSES           /* END SESSION                   */ 01283000
*         THEN                      /* YES END SESSION               */ 01284000
*                                                                  0682 01285000
         CLC   NCSPLVBF(2,NCSPLPTR),@CB00290                       0682 01286000
         BNE   @RF00682                                            0682 01287000
*         /***********************************************************/ 01288000
*         /*                                                         */ 01289000
*         /* SEGMENT(ENDSESS)REQUEST                                 */ 01290000
*         /*                                                         */ 01291000
*         /***********************************************************/ 01292000
*                                                                  0683 01293000
*         DO;                                                      0683 01294000
*           GOTO ENDSESS;                                          0684 01295000
         B     ENDSESS                                             0684 01296000
*ENDSESS#:                                                         0685 01297000
*         END;                      /* CALL END SESSION ROUTINE      */ 01298000
*       ELSE                        /* NO MUST BE BIND FAILED        */ 01299000
*                                                                  0686 01300000
*         /***********************************************************/ 01301000
*         /*                                                         */ 01302000
*         /* SEGMENT(BNDFAIL)REQUEST                                 */ 01303000
*         /*                                                         */ 01304000
*         /***********************************************************/ 01305000
*                                                                  0686 01306000
*         DO;                                                      0686 01307000
         B     @RC00682                                            0686 01308000
@RF00682 DS    0H                                                  0687 01309000
*           GOTO BNDFAIL;                                          0687 01310000
         B     BNDFAIL                                             0687 01311000
*BNDFAIL#:                                                         0688 01312000
*         END;                      /* CALL BIND FAIL ROUTINE        */ 01313000
*     END;                          /* END NOT INIT TERM             */ 01314000
*   ELSE                                                           0690 01315000
*     DO;                           /* INIT TERM                     */ 01316000
         B     @RC00680                                            0690 01317000
@RF00680 DS    0H                                                  0691 01318000
*/* ******************************************************************/ 01319000
*/*       ERP IN PROCESS CHECK                                       */ 01320000
*/* ******************************************************************/ 01321000
*                                                                  0691 01322000
*       CSMSAF=ATCVTMID;            /* GET SOURCE ADDR       @XM10138*/ 01323000
         L     @10,NCSPLCVT(,NCSPLPTR)                             0691 01324000
         MVC   CSMSAF(2),ATCVTMID(@10)                             0691 01325000
*       CSMDAF=RPRNSNEA->RPRDAF;    /* GET DESTINATION @     @XM10138*/ 01326000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0692 01327000
         L     @10,RPRNSNEA(,@10)                                  0692 01328000
         MVC   CSMDAF(2),RPRDAF(@10)                               0692 01329000
*       RFY                                                        0693 01330000
*         CIDREG RSTD;              /*                       @XM10138*/ 01331000
*       CIDREG=CSMCOMID;            /* SET COMM ID           @XM10138*/ 01332000
         L     CIDREG,CSMCOMID                                     0694 01333000
*       RPHPTR=NCSPLRPH;            /* SET RPH @             @XM10138*/ 01334000
         L     RPHPTR,NCSPLRPH(,NCSPLPTR)                          0695 01335000
*       DO;                         /* CIDCTL(FIND) LOCK(XCLUSIVE)   */ 01336000
*         RFY                                                      0697 01337000
*          (EMCR2,                                                 0697 01338000
*           EMCR3) RSTD;                                           0697 01339000
*         GEN SETS(RPHWORK)                                        0698 01340000
*             (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH); 0698 01341000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              01342000
*         EMCR3='00'X;              /* CLEAR EXTRA BITS              */ 01343000
         SLR   EMCR3,EMCR3                                         0699 01344000
*         EMCR3='02'X;              /* INDICATE EXCLUSIVE LOCK       */ 01345000
         LA    EMCR3,2                                             0700 01346000
*         CALL ATCLCPTR->ATCCDFND->ISTSDCCF;/* PROCESS REQUEST       */ 01347000
         L     @10,ATCLCPTR                                        0701 01348000
         L     @15,ATCCDFND(,@10)                                  0701 01349000
         BALR  @14,@15                                             0701 01350000
*         RFY                                                      0702 01351000
*          (EMCR2,                                                 0702 01352000
*           EMCR3) UNRSTD;                                         0702 01353000
*       END;                        /* CIDCTL FIND SSCP-PU FMCB    0703 01354000
*                                                            @XM10138*/ 01355000
*       RFY                                                        0704 01356000
*         RET15 RSTD;               /*                       @XM10138*/ 01357000
*       IF RET15=ZEROES             /* FIND GOOD ?           @XM10138*/ 01358000
*         THEN                                                     0705 01359000
         LTR   RET15,RET15                                         0705 01360000
         BNZ   @RF00705                                            0705 01361000
*         DO;                       /* YES                   @XM10138*/ 01362000
*           FMCBPTR=CIDREG;         /* GET FMCB ADDR         @XM10138*/ 01363000
         LR    FMCBPTR,CIDREG                                      0707 01364000
*           RFY                                                    0708 01365000
*            (CIDREG,                                              0708 01366000
*             RET15) UNRSTD;        /*                       @XM10138*/ 01367000
*           IF RPRNSNEA->RCCERPIP=ON|/* IS ERP IN PROCESS    @XM10138*/ 01368000
*               RPRNSNEA->RCCPRGDN=ON/* PURGE IS DONE        @XM10138*/ 01369000
*             THEN                                                 0709 01370000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0709 01371000
         L     @10,RPRNSNEA(,@10)                                  0709 01372000
         TM    RCCERPIP(@10),B'00100010'                           0709 01373000
         BZ    @RF00709                                            0709 01374000
*             DO;                   /* YES                   @XM10138*/ 01375000
*               FMCBPTR->FMCVWT=NCSPLRPH;/* RPH @ FOR VARY         0711 01376000
*                                      WAIT@XM10138                  */ 01377000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0711 01378000
         ST    @10,FMCVWT(,FMCBPTR)                                0711 01379000
*               RFY                                                0712 01380000
*                 CIDREG RSTD;      /*                       @XM10138*/ 01381000
*               CIDREG=CSMCOMID;    /* GET COMM ID           @XM10138*/ 01382000
         L     CIDREG,CSMCOMID                                     0713 01383000
*               DO;                 /* CIDCTL(FINISH)                */ 01384000
*                 RFY                                              0715 01385000
*                  (EMCR2,                                         0715 01386000
*                   EMCR3) RSTD;                                   0715 01387000
*                 GEN SETS(RPHWORK)                                0716 01388000
*(STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);              0716 01389000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              01390000
*                 EMCR3='00'X;      /* CLEAR EXTRA BITS              */ 01391000
         SLR   EMCR3,EMCR3                                         0717 01392000
*                 CALL ATCLCPTR->ATCCDFIN->ISTSDCCR;/* PROCESS     0718 01393000
*                                      REQUEST                       */ 01394000
         L     @10,ATCLCPTR                                        0718 01395000
         L     @15,ATCCDFIN(,@10)                                  0718 01396000
         BALR  @14,@15                                             0718 01397000
*                 RFY                                              0719 01398000
*                  (EMCR2,                                         0719 01399000
*                   EMCR3) UNRSTD;                                 0719 01400000
*               END;                /* CIDCTL RELEASE DAF LOCK     0720 01401000
*                                                            @XM10138*/ 01402000
*               RFY                                                0721 01403000
*                 CIDREG UNRSTD;    /*                       @XM10138*/ 01404000
*/*  TPWAIT                                                          */ 01405000
*                                                                  0722 01406000
*               DO;                 /* BEGIN TPWAIT GENERATION       */ 01407000
*                 RFY                                              0723 01408000
*                  (GPR01P,                                        0723 01409000
*                   GPR14P,                                        0723 01410000
*                   GPR15P) RSTD;                                  0723 01411000
*                 RFY                                              0724 01412000
*                  (GPR00P) RSTD;                                  0724 01413000
*                 GEN(STM   GPR00P,GPR15P,RPHWORK(GPR01P))         0725 01414000
*                 REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);        0725 01415000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            01416000
*                 RFY                                              0726 01417000
*                  (GPR00P) UNRSTD;                                0726 01418000
*                 GPR15P=ADDR(LHAA0019);                           0727 01419000
         LA    GPR15P,LHAA0019                                     0727 01420000
*                 GPR14P=0;                                        0728 01421000
         SLR   GPR14P,GPR14P                                       0728 01422000
*                 GPR15P=GPR15P&'00FFFFFF'X;                       0729 01423000
         N     GPR15P,@CF04371                                     0729 01424000
*                 GPR15P=GPR15P|RPHWT1;                            0730 01425000
         O     GPR15P,@CF02023                                     0730 01426000
*                 CS(GPR14P,GPR15P,GPR01P->RPHRESMA);              0731 01427000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         0731 01428000
*                 BC(7,LHAB0019);                                  0732 01429000
*                                                                  0732 01430000
         BC    7,LHAB0019                                          0732 01431000
*/* TPEXIT  NONE                                                     */ 01432000
*                                                                  0733 01433000
*                 DO;                                              0733 01434000
*                   RESPECIFY                                      0734 01435000
*                     GPR15P RSTD;                                 0734 01436000
*                                                                  0734 01437000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */ 01438000
*/* END OF ATBUILD                                                   */ 01439000
*                                                                  0735 01440000
*                   DO;             /* LISATCVT                    0735 01441000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01442000
*                     GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER        */ 01443000
         L     GPR15P,ATCLCPTR                                     0736 01444000
*                   END;            /* LISATCVT                      */ 01445000
*                   RESPECIFY                                      0738 01446000
*                     GPR00F RSTD;                                 0738 01447000
*                   GPR00F=0;       /* SET PARAMETER REGISTER TO 0   */ 01448000
         SLR   GPR00F,GPR00F                                       0739 01449000
*                   GPR15P=GPR15P->ATCAP31;                        0740 01450000
         L     GPR15P,ATCAP31(,GPR15P)                             0740 01451000
*                   DCL                                            0741 01452000
*                     FMZL0024 BASED(GPR15P) LABEL VALUERANGE(*);  0741 01453000
*                   CALL FMZL0024;                                 0742 01454000
         BALR  @14,@15                                             0742 01455000
*                   RESPECIFY                                      0743 01456000
*                    (GPR00F,                                      0743 01457000
*                     GPR15P) UNRSTD;                              0743 01458000
*                 END;              /* **** END OF TPEXIT            */ 01459000
*LHAB0019:                                                         0745 01460000
*                 ;                                                0745 01461000
LHAB0019 DS    0H                                                  0746 01462000
*                 GPR01P->RPHRESMA=0;                              0746 01463000
         SLR   @15,@15                                             0746 01464000
         ST    @15,RPHRESMA(,GPR01P)                               0746 01465000
*                 RFY                                              0747 01466000
*                  (GPR00P) RSTD;                                  0747 01467000
*LHAA0019:                                                         0748 01468000
*                 ;                                                0748 01469000
LHAA0019 DS    0H                                                  0749 01470000
*                 GEN(LM    GPR00P,GPR15P,RPHWORK(GPR01P))         0749 01471000
*                 REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);        0749 01472000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            01473000
*                 RFY                                              0750 01474000
*                  (GPR00P,                                        0750 01475000
*                   GPR01P,                                        0750 01476000
*                   GPR14P,                                        0750 01477000
*                   GPR15P) UNRSTD;                                0750 01478000
*               END;                /* ****END OF TPWAIT WAIT ERP  0751 01479000
*                                      COMPLETE              @XM10138*/ 01480000
*             END;                  /* END ERP IN PROCESS    @XM10138*/ 01481000
*           ELSE                                                   0753 01482000
*             DO;                   /* ERP NOT IN PROCESS    @XM10138*/ 01483000
         B     @RC00709                                            0753 01484000
@RF00709 DS    0H                                                  0754 01485000
*               RFY                                                0754 01486000
*                 CIDREG RSTD;      /*                       @XM10138*/ 01487000
*               CIDREG=CSMCOMID;    /* GET COMM ID           @XM10138*/ 01488000
         L     CIDREG,CSMCOMID                                     0755 01489000
*               DO;                 /* CIDCTL(FINISH)                */ 01490000
*                 RFY                                              0757 01491000
*                  (EMCR2,                                         0757 01492000
*                   EMCR3) RSTD;                                   0757 01493000
*                 GEN SETS(RPHWORK)                                0758 01494000
*(STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);              0758 01495000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              01496000
*                 EMCR3='00'X;      /* CLEAR EXTRA BITS              */ 01497000
         SLR   EMCR3,EMCR3                                         0759 01498000
*                 CALL ATCLCPTR->ATCCDFIN->ISTSDCCR;/* PROCESS     0760 01499000
*                                      REQUEST                       */ 01500000
         L     @10,ATCLCPTR                                        0760 01501000
         L     @15,ATCCDFIN(,@10)                                  0760 01502000
         BALR  @14,@15                                             0760 01503000
*                 RFY                                              0761 01504000
*                  (EMCR2,                                         0761 01505000
*                   EMCR3) UNRSTD;                                 0761 01506000
*               END;                /* CIDCTL RELEASE DAF LOCK     0762 01507000
*                                                            @XM10138*/ 01508000
*               RFY                                                0763 01509000
*                 CIDREG UNRSTD;    /*                       @XM10138*/ 01510000
*             END;                  /* END ERP NOT IN PROCESS      0764 01511000
*                                                            @XM10138*/ 01512000
*           CALL CIDFMCB;           /* CALL CID RTN TO FIND FMCB     */ 01513000
@RC00709 BAL   @14,CIDFMCB                                         0765 01514000
*           RFY                                                    0766 01515000
*             RET15 RSTD;                                          0766 01516000
*           IF RET15=ZEROES         /* FIND GOOD                     */ 01517000
*             THEN                                                 0767 01518000
         LTR   RET15,RET15                                         0767 01519000
         BNZ   @RF00767                                            0767 01520000
*             DO;                   /* YES                           */ 01521000
*               RFY                                                0769 01522000
*                 RET15 UNRSTD;                                    0769 01523000
*               MGLSEQNO=NCSPLSQN;  /* SET SEQ NO IN MGL     @XA12386*/ 01524000
         L     @10,NCSMGLPT(,NCSPLPTR)                             0770 01525000
         LH    @09,NCSPLSQN(,NCSPLPTR)                             0770 01526000
         STH   @09,MGLSEQNO(,@10)                                  0770 01527000
*               MGLRH=NCSPLRH;      /* SET RH                @XA12386*/ 01528000
         MVC   MGLRH(3,@10),NCSPLRH(NCSPLPTR)                      0771 01529000
*               MGLORGRU=(NCSPLFSB+2)->NSRUNETS;/* FIRST 3 BYTES OF     01530000
*                                      RU IS MOVED           @XA12386*/ 01531000
*                                                                  0772 01532000
         L     @09,NCSPLFSB(,NCSPLPTR)                             0772 01533000
         MVC   MGLORGRU(3,@10),NSRUNETS+2(@09)                     0772 01534000
*               /*****************************************************/ 01535000
*               /*                                                   */ 01536000
*               /* SEGMENT(INVKFM)REQUEST                            */ 01537000
*               /*                                                   */ 01538000
*               /*****************************************************/ 01539000
*                                                                  0773 01540000
*               DO;                                                0773 01541000
*                 GOTO INVKFM;                                     0774 01542000
         B     INVKFM                                              0774 01543000
*INVKFM#:                                                          0775 01544000
*               END;                /* GO TO FUNC MNG RTR            */ 01545000
INVKFM#  DS    0H                                                  0776 01546000
*             END;                  /* END FIND GOOD                 */ 01547000
*           ELSE                    /* FIND FAILED                   */ 01548000
*             CALL CSMREL;          /* FREE FSB                      */ 01549000
         B     @RC00767                                            0777 01550000
@RF00767 BAL   @14,CSMREL                                          0777 01551000
*         END;                      /* END FIND SSCP-PU FMCB @ GOOD     01552000
*                                                            @XM10138*/ 01553000
*       ELSE                        /* FIND SSCP-PU FMCB @ FAILS   0779 01554000
*                                                            @XM10138*/ 01555000
*         CALL CSMREL;              /* FREE FSB AND RU       @XM10138*/ 01556000
         B     @RC00705                                            0779 01557000
@RF00705 BAL   @14,CSMREL                                          0779 01558000
*     END;                          /* END INIT/TERM CODE            */ 01559000
@RC00705 DS    0H                                                  0781 01560000
*   NXTAVPTR=DATABASE;              /* RESET WORK SPACE PTR          */ 01561000
@RC00680 L     @10,NCSPLWKA(,NCSPLPTR)                             0781 01562000
         ST    DATABASE,NXTAVPTR(,@10)                             0781 01563000
*   GPR13P=CALLER13;                /* RESTORE MY SAVE AREA PTR      */ 01564000
         L     GPR13P,CALLER13(,GPR13P)                            0782 01565000
*   RETURN;                         /* EXIT                          */ 01566000
@EL00001 DS    0H                                                  0783 01567000
@EF00001 DS    0H                                                  0783 01568000
@ER00001 LM    @14,@12,12(@13)                                     0783 01569000
         BR    @14                                                 0783 01570000
*                                                                  0784 01571000
*/* SEGMENT(ENDSESS)START                                            */ 01572000
*                                                                  0784 01573000
*   DO;                                                            0784 01574000
*     GOTO ENDSESS@;                                               0785 01575000
*ENDSESS:                                                          0786 01576000
*   END;                                                           0786 01577000
ENDSESS  DS    0H                                                  0787 01578000
*   IF(RPRENTRY=RPRENTLU            /* IS THIS A LU                  */ 01579000
*       &NCSPLRPT->RLUNDSES=OFF)    /* NO SESS. CLNUP PNDING @VS41705*/ 01580000
*     THEN                                                         0787 01581000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0787 01582000
         CLI   RPRENTRY(@10),X'81'                                 0787 01583000
         BNE   @RF00787                                            0787 01584000
         TM    RLUNDSES(@10),B'00010000'                           0787 01585000
         BNZ   @RF00787                                            0787 01586000
*     DO;                           /* YES A LOGICAL UNIT            */ 01587000
*       NCSPLSAF=ATCVTMID;          /* GET SAF                       */ 01588000
         L     @09,NCSPLCVT(,NCSPLPTR)                             0789 01589000
         MVC   NCSPLSAF(2,NCSPLPTR),ATCVTMID(@09)                  0789 01590000
*       NCSPLDAF=RPRDAF;            /* GET DAF                       */ 01591000
         MVC   NCSPLDAF(2,NCSPLPTR),RPRDAF(@10)                    0790 01592000
*       CALL CIDFMCB;               /* GET FMCB                      */ 01593000
         BAL   @14,CIDFMCB                                         0791 01594000
*       RFY                                                        0792 01595000
*         RET15 RSTD;                                              0792 01596000
*       IF RET15=ZEROES             /* FIND GOOD                     */ 01597000
*         THEN                                                     0793 01598000
         LTR   RET15,RET15                                         0793 01599000
         BNZ   @RF00793                                            0793 01600000
*         DO;                       /* YES                           */ 01601000
*           RFY                                                    0795 01602000
*             RET15 UNRSTD;                                        0795 01603000
*                                                                  0795 01604000
*/*   FOLLOWING LINE REMOVED BY OZ30737                      @ZA30737*/ 01605000
*/*        FMCCMDR=OFF;               TURN OFF INIT SELF BIT         */ 01606000
*                                                                  0796 01607000
*           IF RPRVRYPD=ON          /* VARY PENDING THIS NODE      0796 01608000
*                                                            @XM0697K*/ 01609000
*             THEN                                                 0796 01610000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0796 01611000
         TM    RPRVRYPD(@10),B'00000010'                           0796 01612000
         BNO   @RF00796                                            0796 01613000
*             DO;                                                  0797 01614000
*               GPR01P=NCSPLPTR;    /* PT TO NCSPL           @DM13781*/ 01615000
         LR    GPR01P,NCSPLPTR                                     0798 01616000
*               CALL ISTINCVP;      /* CALL DEACTIVATE       @DM13781*/ 01617000
         L     @15,@CV04385                                        0799 01618000
         BALR  @14,@15                                             0799 01619000
*               DO;                                                0800 01620000
*                                                                  0800 01621000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  * 01622000
*                                                                    */ 01623000
*                                                                  0801 01624000
*                 /***************************************************/ 01625000
*                 /*                                                 */ 01626000
*                 /* ** CLEAR AND SET CURRENT PROCEDURE BIT          */ 01627000
*                 /*                                                 */ 01628000
*                 /***************************************************/ 01629000
*                                                                  0801 01630000
*                 NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;           0801 01631000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0801 01632000
         L     @10,RPHCRR(,@10)                                    0801 01633000
         L     @10,CRACRR(,@10)                                    0801 01634000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0801 01635000
         MVI   VYCCRT(@10),B'00000000'                             0801 01636000
*                 NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;           0802 01637000
         OI    CINCSM(@10),B'01000000'                             0802 01638000
*               END;                /*                       @DM13781*/ 01639000
*               NCSVDEL=OFF;        /* TURN OFF NCSPL DELETE BIT   0804 01640000
*                                                            @DM13781*/ 01641000
         NI    NCSVDEL(NCSPLPTR),B'10111111'                       0804 01642000
*               NCSPLEBN=ON;        /* TURN ON BIT OF ENTRY FROM BNN    01643000
*                                      SSCP                  @DM13781*/ 01644000
         OI    NCSPLEBN(NCSPLPTR),B'00100000'                      0805 01645000
*               RFY                                                0806 01646000
*                 SAVERPT RSTD;     /*                       @DM13781*/ 01647000
*               SAVERPT=NCSPLRPT;   /* SAVE LU RDTE ADDRESS  @DM13781*/ 01648000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0807 01649000
         LR    SAVERPT,@10                                         0807 01650000
*               NCSPLRPT=RPRNSNEA;  /* GET PU RDTE ADDRESS   @DM13781*/ 01651000
         L     @10,RPRNSNEA(,@10)                                  0808 01652000
         ST    @10,NCSPLRPT(,NCSPLPTR)                             0808 01653000
*               GPR01P=NCSPLPTR;    /* POINT TO NCSPL        @DM13781*/ 01654000
         LR    GPR01P,NCSPLPTR                                     0809 01655000
*               CALL ISTINCY5;      /* CALL TERMINATOR       @DM13781*/ 01656000
         L     @15,@CV04386                                        0810 01657000
         BALR  @14,@15                                             0810 01658000
*               NCSPLRPT=SAVERPT;   /* RESTORE LU RDTE ADDRESS IN  0811 01659000
*                                      NCSPL                 @DM13781*/ 01660000
         ST    SAVERPT,NCSPLRPT(,NCSPLPTR)                         0811 01661000
*               RFY                                                0812 01662000
*                 SAVERPT UNRSTD;   /*                       @DM13781*/ 01663000
*             END;                  /*                       @DM13781*/ 01664000
*           ELSE                                                   0814 01665000
*             IF RPRHLVPD=ON        /* HIGHER NODE VARY PENDING    0814 01666000
*                                                            @DM13781*/ 01667000
*               THEN                                               0814 01668000
         B     @RC00796                                            0814 01669000
@RF00796 L     @10,NCSPLRPT(,NCSPLPTR)                             0814 01670000
         TM    RPRHLVPD(@10),B'00000100'                           0814 01671000
         BNO   @RF00814                                            0814 01672000
*               DO;                 /* YES VARY PENDING      @DM13781*/ 01673000
*                 GPR01P=NCSPLPTR;  /* PT TO NCSPL           @D32CKXK*/ 01674000
         LR    GPR01P,NCSPLPTR                                     0816 01675000
*                 CALL ISTINCVP;    /* CALL DEACTIVATE       @D32CKXK*/ 01676000
         L     @15,@CV04385                                        0817 01677000
         BALR  @14,@15                                             0817 01678000
*               END;                /*                       @D32CKXK*/ 01679000
*             ELSE                                                 0819 01680000
*               DO;                 /*                       @DM13781*/ 01681000
         B     @RC00814                                            0819 01682000
@RF00814 DS    0H                                                  0820 01683000
*                 NCSPLEBN=ON;      /* TURN ON BIT OF ENTRY FROM BNN    01684000
*                                      SSCP                  @D32CKXK*/ 01685000
         OI    NCSPLEBN(NCSPLPTR),B'00100000'                      0820 01686000
*                 RFY                                              0821 01687000
*                   SAVERPT RSTD;   /*                       @D32CKXK*/ 01688000
*                 SAVERPT=NCSPLRPT; /* SAVE LU RDTE ADDRESS  @D32CKXK*/ 01689000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0822 01690000
         LR    SAVERPT,@10                                         0822 01691000
*                 NCSPLRPT=RPRNSNEA;/* GET PU RDTE ADDRESS   @D32CKXK*/ 01692000
         L     @10,RPRNSNEA(,@10)                                  0823 01693000
         ST    @10,NCSPLRPT(,NCSPLPTR)                             0823 01694000
*                 GPR01P=NCSPLPTR;  /* POINT TO NCSPL        @D32CKXK*/ 01695000
         LR    GPR01P,NCSPLPTR                                     0824 01696000
*                 CALL ISTINCY5;    /* CALL TERMINATOR       @D32CKXK*/ 01697000
         L     @15,@CV04386                                        0825 01698000
         BALR  @14,@15                                             0825 01699000
*                 NCSPLRPT=SAVERPT; /* RESTORE LU RDTE ADDRESS IN  0826 01700000
*                                      NCSPL                 @D32CKXK*/ 01701000
         ST    SAVERPT,NCSPLRPT(,NCSPLPTR)                         0826 01702000
*                 RFY                                              0827 01703000
*                   SAVERPT UNRSTD; /*                       @D32CKXK*/ 01704000
*               END;                /*                       @D32CKXK*/ 01705000
*           DO;                                                    0829 01706000
*                                                                  0829 01707000
@RC00814 DS    0H                                                  0829 01708000
@RC00796 DS    0H                                                  0830 01709000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  * 01710000
*                                                                    */ 01711000
*                                                                  0830 01712000
*             /*******************************************************/ 01713000
*             /*                                                     */ 01714000
*             /* ** CLEAR AND SET CURRENT PROCEDURE BIT              */ 01715000
*             /*                                                     */ 01716000
*             /*******************************************************/ 01717000
*                                                                  0830 01718000
*             NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;               0830 01719000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0830 01720000
         L     @10,RPHCRR(,@10)                                    0830 01721000
         L     @10,CRACRR(,@10)                                    0830 01722000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0830 01723000
         MVI   VYCCRT(@10),B'00000000'                             0830 01724000
*             NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;               0831 01725000
         OI    CINCSM(@10),B'01000000'                             0831 01726000
*           END;                    /*                       @D32CKXK*/ 01727000
*         END;                      /* END FIND GOOD         @D32CKXK*/ 01728000
*       ELSE                                                       0834 01729000
*         DO;                       /* FIND FAILED                   */ 01730000
         B     @RC00793                                            0834 01731000
@RF00793 DS    0H                                                  0835 01732000
*           RFY                                                    0835 01733000
*             RET15 RSTD;           /*                       @DM13786*/ 01734000
*           IF RET15=TWELVE         /* RETURN CODE EQUAL TWELVE    0836 01735000
*                                                            @DM13786*/ 01736000
*             THEN                                                 0836 01737000
         C     RET15,@CF00064                                      0836 01738000
         BNE   @RF00836                                            0836 01739000
*             DO;                   /* YES                   @DM13786*/ 01740000
*               RFY                                                0838 01741000
*                 SAVERPT RSTD;     /*                       @DM13786*/ 01742000
*               SAVERPT=NCSPLRPT;   /* SAVE LU RDTE ADDRESS  @DM13786*/ 01743000
         L     @14,NCSPLRPT(,NCSPLPTR)                             0839 01744000
         LR    SAVERPT,@14                                         0839 01745000
*               NCSPLRPT=RPRNSNEA;  /* SET PU RDTE ADDR IN NCSPL   0840 01746000
*                                                            @DM13786*/ 01747000
         L     @14,RPRNSNEA(,@14)                                  0840 01748000
         ST    @14,NCSPLRPT(,NCSPLPTR)                             0840 01749000
*               RFY                                                0841 01750000
*                 RET15 UNRSTD;     /*                       @DM13786*/ 01751000
*               IF RPRVRYPD=ON      /* PU VARY PENDING       @DM13786*/ 01752000
*                 THEN                                             0842 01753000
         TM    RPRVRYPD(@14),B'00000010'                           0842 01754000
         BNO   @RF00842                                            0842 01755000
*                 DO;               /* VARY PENDING          @DM13786*/ 01756000
*                   NCSPLRPT=SAVERPT;/* RESTORE LU RDTE ADDR @DM13786*/ 01757000
         ST    SAVERPT,NCSPLRPT(,NCSPLPTR)                         0844 01758000
*                 END;              /* END PU VARY PENDING   @DM13786*/ 01759000
*               ELSE                                               0846 01760000
*                 DO;               /* PU NOT VARY PENDING   @DM13786*/ 01761000
         B     @RC00842                                            0846 01762000
@RF00842 DS    0H                                                  0847 01763000
*                   NCSPLEBN=ON;    /* TURN ON BIT OF ENTRY FROM BNN    01764000
*                                      SSCP                  @DM13786*/ 01765000
         OI    NCSPLEBN(NCSPLPTR),B'00100000'                      0847 01766000
*                   GPR01P=NCSPLPTR;/* POINT TO NCSPL        @DM13786*/ 01767000
         LR    GPR01P,NCSPLPTR                                     0848 01768000
*                   CALL ISTINCY5;  /* CALL TERMINATOR       @DM13786*/ 01769000
         L     @15,@CV04386                                        0849 01770000
         BALR  @14,@15                                             0849 01771000
*                   NCSPLRPT=SAVERPT;/* RESTORE LU RDTE ADDRESS IN 0850 01772000
*                                      NCSPL                 @DM13786*/ 01773000
         ST    SAVERPT,NCSPLRPT(,NCSPLPTR)                         0850 01774000
*                   RFY                                            0851 01775000
*                     SAVERPT UNRSTD;/*                      @DM13786*/ 01776000
*                   DO;                                            0852 01777000
*                                                                  0852 01778000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  * 01779000
*                                                                    */ 01780000
*                                                                  0853 01781000
*                     /***********************************************/ 01782000
*                     /*                                             */ 01783000
*                     /* ** CLEAR AND SET CURRENT PROCEDURE BIT      */ 01784000
*                     /*                                             */ 01785000
*                     /***********************************************/ 01786000
*                                                                  0853 01787000
*                     NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;       0853 01788000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0853 01789000
         L     @10,RPHCRR(,@10)                                    0853 01790000
         L     @10,CRACRR(,@10)                                    0853 01791000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0853 01792000
         MVI   VYCCRT(@10),B'00000000'                             0853 01793000
*                     NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;       0854 01794000
         OI    CINCSM(@10),B'01000000'                             0854 01795000
*                   END;            /*                       @DM13786*/ 01796000
*                 END;              /* END PU NOT VARY PENDING     0856 01797000
*                                                            @DM13786*/ 01798000
*             END;                  /* END RETURN CODE TWELVE      0857 01799000
*                                                            @DM13786*/ 01800000
*           ELSE                                                   0858 01801000
*             ;                     /* RETURN CODE NOT TWELVE      0858 01802000
*                                                            @DM13786*/ 01803000
@RF00836 DS    0H                                                  0859 01804000
*         END;                      /* END OF FIND FAIL      @DM13786*/ 01805000
*     END;                          /* END PT TO LU                  */ 01806000
*   ELSE                                                           0861 01807000
*     DO;                           /* NOT A LU                      */ 01808000
         B     @RC00787                                            0861 01809000
@RF00787 DS    0H                                                  0862 01810000
*       GPR01P=NCSPLPTR;            /* PT TO NCSPL                   */ 01811000
         LR    GPR01P,NCSPLPTR                                     0862 01812000
*       CALL ISTINCVP;              /* CALL DEACTIVATE               */ 01813000
         L     @15,@CV04385                                        0863 01814000
         BALR  @14,@15                                             0863 01815000
*       DO;                                                        0864 01816000
*                                                                  0864 01817000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  * 01818000
*                                                                    */ 01819000
*                                                                  0865 01820000
*         /***********************************************************/ 01821000
*         /*                                                         */ 01822000
*         /* ** CLEAR AND SET CURRENT PROCEDURE BIT                  */ 01823000
*         /*                                                         */ 01824000
*         /***********************************************************/ 01825000
*                                                                  0865 01826000
*         NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;                   0865 01827000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0865 01828000
         L     @10,RPHCRR(,@10)                                    0865 01829000
         L     @10,CRACRR(,@10)                                    0865 01830000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0865 01831000
         MVI   VYCCRT(@10),B'00000000'                             0865 01832000
*         NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;                   0866 01833000
         OI    CINCSM(@10),B'01000000'                             0866 01834000
*       END;                                                       0867 01835000
*     END;                          /* END NOT LU                    */ 01836000
*/* SEGMENT(ENDSESS)FINISH                                           */ 01837000
*                                                                  0869 01838000
*   DO;                                                            0869 01839000
@RC00787 DS    0H                                                  0870 01840000
*     GOTO ENDSESS#;                                               0870 01841000
         B     ENDSESS#                                            0870 01842000
*ENDSESS@:                                                         0871 01843000
*   END;                                                           0871 01844000
ENDSESS@ DS    0H                                                  0872 01845000
*                                                                  0872 01846000
*/* SEGMENT(BNDFAIL)START                                            */ 01847000
*                                                                  0872 01848000
*   DO;                                                            0872 01849000
*     GOTO BNDFAIL@;                                               0873 01850000
         B     BNDFAIL@                                            0873 01851000
*BNDFAIL:                                                          0874 01852000
*   END;                                                           0874 01853000
BNDFAIL  DS    0H                                                  0875 01854000
*   NCSPLSAF=ATCVTMID;              /* GET SAF                       */ 01855000
         L     @10,NCSPLCVT(,NCSPLPTR)                             0875 01856000
         MVC   NCSPLSAF(2,NCSPLPTR),ATCVTMID(@10)                  0875 01857000
*   NCSPLDAF=RPRDAF;                /* GET DAF                       */ 01858000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0876 01859000
         MVC   NCSPLDAF(2,NCSPLPTR),RPRDAF(@10)                    0876 01860000
*   CALL CIDFMCB;                   /* GET FMCB                      */ 01861000
         BAL   @14,CIDFMCB                                         0877 01862000
*   RFY                                                            0878 01863000
*     RET15 RSTD;                                                  0878 01864000
*   IF RET15=ZEROES                 /* FIND GOOD                     */ 01865000
*     THEN                                                         0879 01866000
         SLR   @14,@14                                             0879 01867000
         CR    RET15,@14                                           0879 01868000
         BNE   @RF00879                                            0879 01869000
*     DO;                           /* YES                           */ 01870000
*       RFY                                                        0881 01871000
*         RET15 UNRSTD;                                            0881 01872000
*       IF FMCCMDR=ON               /* INIT SELF                     */ 01873000
*         THEN                                                     0882 01874000
         L     @10,NCSUFMCB(,NCSPLPTR)                             0882 01875000
         TM    FMCCMDR(@10),B'10000000'                            0882 01876000
         BNO   @RF00882                                            0882 01877000
*         DO;                       /* YES                           */ 01878000
*                                                                  0883 01879000
*           /*********************************************************/ 01880000
*           /*                                                       */ 01881000
*           /* ALLOCATE,BUILD NS PROCEDURE ERROR RU IN WORK AREA AND */ 01882000
*           /* SEND. CRRMAINT - REINITIALIZE THE VARY CRR.           */ 01883000
*           /*                                                       */ 01884000
*           /*********************************************************/ 01885000
*                                                                  0884 01886000
*           MGLRUPTR=NXTAVPTR;      /* ALLOCATE SPACE FOR RU         */ 01887000
         L     @09,NCSMGLPT(,NCSPLPTR)                             0884 01888000
         L     @15,NCSPLWKA(,NCSPLPTR)                             0884 01889000
         L     @07,NXTAVPTR(,@15)                                  0884 01890000
         ST    @07,MGLRUPTR(,@09)                                  0884 01891000
*           NXTAVPTR=NXTAVPTR+LENGTH(CSMNSPE);/* ADJUST WORKAREA     */ 01892000
         LA    @00,4                                               0885 01893000
         ALR   @00,@07                                             0885 01894000
         ST    @00,NXTAVPTR(,@15)                                  0885 01895000
*           RESPECIFY                                              0886 01896000
*             ISTRUB BASED(ADDR(NSPE));                            0886 01897000
*           NSPELNG=FOUR;           /* SET LENGTH OF RU              */ 01898000
         MVI   NSPELNG(@07),X'04'                                  0887 01899000
*           NSRUID=NSRUNS;          /* FORMATTED SYSTEM SERVICES TYPE*/ 01900000
         AL    @07,@CF00034                                        0888 01901000
         MVI   NSRUID(@07),X'01'                                   0888 01902000
*           NSRUSUB=NSRUDSS;        /* NS SUBCATEGORY                */ 01903000
         MVI   NSRUSUB(@07),X'06'                                  0889 01904000
*           NSRURCD=NSRUNSPE;       /* REQUEST CODE                  */ 01905000
         MVI   NSRURCD(@07),X'04'                                  0890 01906000
*           NSRUDATA(ONE:ONE)=HEX20;/* DATA                          */ 01907000
         MVI   NSRUDATA(@07),X'20'                                 0891 01908000
*           GPR01P=NCSPLPTR;        /* ADDR OF NCSPL FOR CS1         */ 01909000
         LR    GPR01P,NCSPLPTR                                     0892 01910000
*           RESPECIFY                                              0893 01911000
*             GPR02P RESTRICTED;                                   0893 01912000
*           GPR02P=FMCDNCBA;        /* NCB ADDR FOR SSCP/LU          */ 01913000
         L     GPR02P,FMCDNCBA(,@10)                               0894 01914000
*           MGLREQ=ON;              /* INDICATE REQUEST              */ 01915000
         OI    MGLREQ(@09),B'10000000'                             0895 01916000
*           MGLMSGAD=ADDR(MSGLST);  /* PT TO MSG ID                  */ 01917000
         LA    @10,MSGLST                                          0896 01918000
         ST    @10,MGLMSGAD(,@09)                                  0896 01919000
*           MSGLST=MSG7;            /* SET UP ID                     */ 01920000
         MVC   MSGLST(4),@CB03205                                  0897 01921000
*           MGLVDATA=ZEROES;        /* INDIACTE NO VARIABLE DATA     */ 01922000
         ST    @14,MGLVDATA(,@09)                                  0898 01923000
*           CALL ISTINCS1;          /* CALL STATUS FEEDBACK          */ 01924000
         L     @15,@CV04392                                        0899 01925000
         BALR  @14,@15                                             0899 01926000
*           DO;                                                    0900 01927000
*                                                                  0900 01928000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  * 01929000
*                                                                    */ 01930000
*                                                                  0901 01931000
*             /*******************************************************/ 01932000
*             /*                                                     */ 01933000
*             /* ** CLEAR AND SET CURRENT PROCEDURE BIT              */ 01934000
*             /*                                                     */ 01935000
*             /*******************************************************/ 01936000
*                                                                  0901 01937000
*             NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;               0901 01938000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0901 01939000
         L     @10,RPHCRR(,@10)                                    0901 01940000
         L     @10,CRACRR(,@10)                                    0901 01941000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0901 01942000
         MVI   VYCCRT(@10),B'00000000'                             0901 01943000
*             NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;               0902 01944000
         OI    CINCSM(@10),B'01000000'                             0902 01945000
*           END;                                                   0903 01946000
*           NXTAVPTR=MGLRUPTR;      /* RESTORE WORKAREA              */ 01947000
         L     @10,NCSPLWKA(,NCSPLPTR)                             0904 01948000
         L     @09,NCSMGLPT(,NCSPLPTR)                             0904 01949000
         L     @09,MGLRUPTR(,@09)                                  0904 01950000
         ST    @09,NXTAVPTR(,@10)                                  0904 01951000
*           RFY                                                    0905 01952000
*             GPR02P UNRSTD;                                       0905 01953000
*           FMCCMDR=OFF;            /* TURN OFF INIT SELF BIT        */ 01954000
         L     @10,NCSUFMCB(,NCSPLPTR)                             0906 01955000
         NI    FMCCMDR(@10),B'01111111'                            0906 01956000
*         END;                      /* END INIT SELF                 */ 01957000
*       ELSE                                                       0908 01958000
*         ;                         /* DID NOT INIT SELF             */ 01959000
@RF00882 DS    0H                                                  0909 01960000
*       IF RPRVRYPD=ON              /* VARY PENDING THIS NODE      0909 01961000
*                                                            @XM0697K*/ 01962000
*         THEN                                                     0909 01963000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0909 01964000
         TM    RPRVRYPD(@10),B'00000010'                           0909 01965000
         BNO   @RF00909                                            0909 01966000
*         DO;                                                      0910 01967000
*           GPR01P=NCSPLPTR;        /* PT TO NCSPL           @DM13781*/ 01968000
         LR    GPR01P,NCSPLPTR                                     0911 01969000
*           CALL ISTINCVP;          /* CALL DEACTIVATE       @DM13781*/ 01970000
         L     @15,@CV04385                                        0912 01971000
         BALR  @14,@15                                             0912 01972000
*           DO;                                                    0913 01973000
*                                                                  0913 01974000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  * 01975000
*                                                                    */ 01976000
*                                                                  0914 01977000
*             /*******************************************************/ 01978000
*             /*                                                     */ 01979000
*             /* ** CLEAR AND SET CURRENT PROCEDURE BIT              */ 01980000
*             /*                                                     */ 01981000
*             /*******************************************************/ 01982000
*                                                                  0914 01983000
*             NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;               0914 01984000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0914 01985000
         L     @10,RPHCRR(,@10)                                    0914 01986000
         L     @10,CRACRR(,@10)                                    0914 01987000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0914 01988000
         MVI   VYCCRT(@10),B'00000000'                             0914 01989000
*             NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;               0915 01990000
         OI    CINCSM(@10),B'01000000'                             0915 01991000
*           END;                    /*                       @DM13781*/ 01992000
*           NCSVDEL=OFF;            /* TURN OFF NCSPL DELETE BIT   0917 01993000
*                                                            @DM13781*/ 01994000
         NI    NCSVDEL(NCSPLPTR),B'10111111'                       0917 01995000
*           NCSPLEBN=ON;            /* TURN ON BIT OF ENTRY FROM BNN    01996000
*                                      SSCP                  @DM13781*/ 01997000
         OI    NCSPLEBN(NCSPLPTR),B'00100000'                      0918 01998000
*           RFY                                                    0919 01999000
*             SAVERPT RSTD;         /*                       @DM13781*/ 02000000
*           SAVERPT=NCSPLRPT;       /* SAVE LU RDTE ADDRESS  @DM13781*/ 02001000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0920 02002000
         LR    SAVERPT,@10                                         0920 02003000
*           NCSPLRPT=RPRNSNEA;      /* GET PU RDTE ADDRESS   @DM13781*/ 02004000
         L     @10,RPRNSNEA(,@10)                                  0921 02005000
         ST    @10,NCSPLRPT(,NCSPLPTR)                             0921 02006000
*           GPR01P=NCSPLPTR;        /* POINT TO NCSPL        @DM13781*/ 02007000
         LR    GPR01P,NCSPLPTR                                     0922 02008000
*           CALL ISTINCY5;          /* CALL TERMINATOR       @DM13781*/ 02009000
         L     @15,@CV04386                                        0923 02010000
         BALR  @14,@15                                             0923 02011000
*           NCSPLRPT=SAVERPT;       /* RESTORE LU RDTE ADDRESS IN  0924 02012000
*                                      NCSPL                 @DM13781*/ 02013000
         ST    SAVERPT,NCSPLRPT(,NCSPLPTR)                         0924 02014000
*           RFY                                                    0925 02015000
*             SAVERPT UNRSTD;       /*                       @DM13781*/ 02016000
*         END;                      /*                       @DM13781*/ 02017000
*       ELSE                                                       0927 02018000
*         IF RPRHLVPD=ON            /* HIGHER NODE VARY PENDING    0927 02019000
*                                                            @DM13781*/ 02020000
*           THEN                                                   0927 02021000
         B     @RC00909                                            0927 02022000
@RF00909 L     @10,NCSPLRPT(,NCSPLPTR)                             0927 02023000
         TM    RPRHLVPD(@10),B'00000100'                           0927 02024000
         BNO   @RF00927                                            0927 02025000
*           DO;                     /* YES VARY PENDING      @DM13781*/ 02026000
*             GPR01P=NCSPLPTR;      /* PT TO NCSPL           @D32CKXK*/ 02027000
         LR    GPR01P,NCSPLPTR                                     0929 02028000
*             CALL ISTINCVP;        /* CALL DEACTIVATE       @D32CKXK*/ 02029000
         L     @15,@CV04385                                        0930 02030000
         BALR  @14,@15                                             0930 02031000
*           END;                    /*                       @D32CKXK*/ 02032000
*         ELSE                                                     0932 02033000
*           DO;                     /*                       @DM13781*/ 02034000
         B     @RC00927                                            0932 02035000
@RF00927 DS    0H                                                  0933 02036000
*             NCSPLEBN=ON;          /* TURN ON BIT OF ENTRY FROM BNN    02037000
*                                      SSCP                  @D32CKXK*/ 02038000
         OI    NCSPLEBN(NCSPLPTR),B'00100000'                      0933 02039000
*             RFY                                                  0934 02040000
*               SAVERPT RSTD;       /*                       @D32CKXK*/ 02041000
*             SAVERPT=NCSPLRPT;     /* SAVE LU RDTE ADDRESS  @D32CKXK*/ 02042000
         L     @10,NCSPLRPT(,NCSPLPTR)                             0935 02043000
         LR    SAVERPT,@10                                         0935 02044000
*             NCSPLRPT=RPRNSNEA;    /* GET PU RDTE ADDRESS   @D32CKXK*/ 02045000
         L     @10,RPRNSNEA(,@10)                                  0936 02046000
         ST    @10,NCSPLRPT(,NCSPLPTR)                             0936 02047000
*             GPR01P=NCSPLPTR;      /* POINT TO NCSPL        @D32CKXK*/ 02048000
         LR    GPR01P,NCSPLPTR                                     0937 02049000
*             CALL ISTINCY5;        /* CALL TERMINATOR       @D32CKXK*/ 02050000
         L     @15,@CV04386                                        0938 02051000
         BALR  @14,@15                                             0938 02052000
*             NCSPLRPT=SAVERPT;     /* RESTORE LU RDTE ADDRESS IN  0939 02053000
*                                      NCSPL                 @D32CKXK*/ 02054000
         ST    SAVERPT,NCSPLRPT(,NCSPLPTR)                         0939 02055000
*             RFY                                                  0940 02056000
*               SAVERPT UNRSTD;     /*                       @D32CKXK*/ 02057000
*           END;                    /*                       @D32CKXK*/ 02058000
*       DO;                                                        0942 02059000
*                                                                  0942 02060000
@RC00927 DS    0H                                                  0942 02061000
@RC00909 DS    0H                                                  0943 02062000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  * 02063000
*                                                                    */ 02064000
*                                                                  0943 02065000
*         /***********************************************************/ 02066000
*         /*                                                         */ 02067000
*         /* ** CLEAR AND SET CURRENT PROCEDURE BIT                  */ 02068000
*         /*                                                         */ 02069000
*         /***********************************************************/ 02070000
*                                                                  0943 02071000
*         NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;                   0943 02072000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0943 02073000
         L     @10,RPHCRR(,@10)                                    0943 02074000
         L     @10,CRACRR(,@10)                                    0943 02075000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0943 02076000
         MVI   VYCCRT(@10),B'00000000'                             0943 02077000
*         NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;                   0944 02078000
         OI    CINCSM(@10),B'01000000'                             0944 02079000
*       END;                        /*                       @D32CKXK*/ 02080000
*     END;                          /* END FIND GOOD                 */ 02081000
*   ELSE                                                           0947 02082000
*     DO;                           /* FIND FAILED                   */ 02083000
         B     @RC00879                                            0947 02084000
@RF00879 DS    0H                                                  0948 02085000
*       RFY                                                        0948 02086000
*         RET15 RSTD;               /*                       @DM13786*/ 02087000
*       IF RET15=TWELVE             /* RETURN CODE EQUAL TWELVE    0949 02088000
*                                                            @DM13786*/ 02089000
*         THEN                                                     0949 02090000
         C     RET15,@CF00064                                      0949 02091000
         BNE   @RF00949                                            0949 02092000
*         DO;                       /* YES                   @DM13786*/ 02093000
*           RFY                                                    0951 02094000
*             SAVERPT RSTD;         /*                       @DM13786*/ 02095000
*           SAVERPT=NCSPLRPT;       /* SAVE LU RDTE ADDRESS  @DM13786*/ 02096000
         L     @14,NCSPLRPT(,NCSPLPTR)                             0952 02097000
         LR    SAVERPT,@14                                         0952 02098000
*           NCSPLRPT=RPRNSNEA;      /* SET PU RDTE ADDR IN         0953 02099000
*                                      NCSPL@DM13786                 */ 02100000
         L     @14,RPRNSNEA(,@14)                                  0953 02101000
         ST    @14,NCSPLRPT(,NCSPLPTR)                             0953 02102000
*           RFY                                                    0954 02103000
*             RET15 UNRSTD;         /*                       @DM13786*/ 02104000
*           IF RPRVRYPD=ON          /* PU VARY PENDING       @DM13786*/ 02105000
*             THEN                                                 0955 02106000
         TM    RPRVRYPD(@14),B'00000010'                           0955 02107000
         BNO   @RF00955                                            0955 02108000
*             DO;                   /* VARY PENDING          @DM13786*/ 02109000
*               NCSPLRPT=SAVERPT;   /* RESTORE LU RDTE ADDR  @DM13786*/ 02110000
         ST    SAVERPT,NCSPLRPT(,NCSPLPTR)                         0957 02111000
*             END;                  /* END PU VARY PENDING   @DM13786*/ 02112000
*           ELSE                                                   0959 02113000
*             DO;                   /* PU NOT VARY PENDING   @DM13786*/ 02114000
         B     @RC00955                                            0959 02115000
@RF00955 DS    0H                                                  0960 02116000
*               NCSPLEBN=ON;        /* TURN ON BIT OF ENTRY FROM BNN    02117000
*                                      SSCP                  @DM13786*/ 02118000
         OI    NCSPLEBN(NCSPLPTR),B'00100000'                      0960 02119000
*               GPR01P=NCSPLPTR;    /* POINT TO NCSPL        @DM13786*/ 02120000
         LR    GPR01P,NCSPLPTR                                     0961 02121000
*               CALL ISTINCY5;      /* CALL TERMINATOR       @DM13786*/ 02122000
         L     @15,@CV04386                                        0962 02123000
         BALR  @14,@15                                             0962 02124000
*               NCSPLRPT=SAVERPT;   /* RESTORE LU RDTE ADDRESS IN  0963 02125000
*                                      NCSPL                 @DM13786*/ 02126000
         ST    SAVERPT,NCSPLRPT(,NCSPLPTR)                         0963 02127000
*               RFY                                                0964 02128000
*                 SAVERPT UNRSTD;   /*                       @DM13786*/ 02129000
*               DO;                                                0965 02130000
*                                                                  0965 02131000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  * 02132000
*                                                                    */ 02133000
*                                                                  0966 02134000
*                 /***************************************************/ 02135000
*                 /*                                                 */ 02136000
*                 /* ** CLEAR AND SET CURRENT PROCEDURE BIT          */ 02137000
*                 /*                                                 */ 02138000
*                 /***************************************************/ 02139000
*                                                                  0966 02140000
*                 NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;           0966 02141000
         L     @10,NCSPLRPH(,NCSPLPTR)                             0966 02142000
         L     @10,RPHCRR(,@10)                                    0966 02143000
         L     @10,CRACRR(,@10)                                    0966 02144000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      0966 02145000
         MVI   VYCCRT(@10),B'00000000'                             0966 02146000
*                 NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;           0967 02147000
         OI    CINCSM(@10),B'01000000'                             0967 02148000
*               END;                /*                       @DM13786*/ 02149000
*             END;                  /* END PU NOT VARY PENDING     0969 02150000
*                                                            @DM13786*/ 02151000
*         END;                      /* END RETURN CODE TWELVE      0970 02152000
*                                                            @DM13786*/ 02153000
*       ELSE                                                       0971 02154000
*         ;                         /* RETURN CODE NOT TWELVE      0971 02155000
*                                                            @DM13786*/ 02156000
@RF00949 DS    0H                                                  0972 02157000
*     END;                          /* END OF FIND FAIL      @DM13786*/ 02158000
@RC00949 DS    0H                                                  0973 02159000
*/* SEGMENT(BNDFAIL)FINISH                                           */ 02160000
*                                                                  0973 02161000
*   DO;                                                            0973 02162000
@RC00879 DS    0H                                                  0974 02163000
*     GOTO BNDFAIL#;                                               0974 02164000
         B     BNDFAIL#                                            0974 02165000
*BNDFAIL@:                                                         0975 02166000
*   END;                                                           0975 02167000
*CIDFMCB:                                                          0976 02168000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0976 02169000
         B     @PB00002                                            0976 02170000
CIDFMCB  DS    0H                                                  0977 02171000
*   RFY                                                            0977 02172000
*    (GPR09P,                                                      0977 02173000
*     GPR14P) RSTD;                                                0977 02174000
*   GPR09P=GPR14P;                  /* SAVE RETURN ADDR              */ 02175000
         LR    GPR09P,GPR14P                                       0978 02176000
*   RFY                                                            0979 02177000
*     GPR14P UNRSTD;                                               0979 02178000
*   RFY                                                            0980 02179000
*     CIDREG RSTD;                                                 0980 02180000
*   GPR01P=NCSPLRPH;                /* PT TO RPH                     */ 02181000
         L     GPR01P,NCSPLRPH(,NCSPLPTR)                          0981 02182000
*   CIDREG=NCSPLCID;                /* GET CID                       */ 02183000
         L     CIDREG,NCSPLCID(,NCSPLPTR)                          0982 02184000
*   DO;                             /* CIDCTL(FIND)                  */ 02185000
*     RFY                                                          0984 02186000
*      (EMCR2,                                                     0984 02187000
*       EMCR3) RSTD;                                               0984 02188000
*     GEN SETS(RPHWORK)                                            0985 02189000
*         (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);     0985 02190000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              02191000
*     EMCR3='00'X;                  /* CLEAR EXTRA BITS              */ 02192000
         SLR   EMCR3,EMCR3                                         0986 02193000
*     EMCR3='01'X;                  /* INDICATE SHARED LOCK          */ 02194000
         LA    EMCR3,1                                             0987 02195000
*     CALL ATCLCPTR->ATCCDFND->ISTSDCCF;/* PROCESS REQUEST           */ 02196000
         L     @10,ATCLCPTR                                        0988 02197000
         L     @15,ATCCDFND(,@10)                                  0988 02198000
         BALR  @14,@15                                             0988 02199000
*     RFY                                                          0989 02200000
*      (EMCR2,                                                     0989 02201000
*       EMCR3) UNRSTD;                                             0989 02202000
*   END;                            /* CIDCTL                        */ 02203000
*   RFY                                                            0991 02204000
*    (GPR02P,                                                      0991 02205000
*     RET15) RSTD;                                                 0991 02206000
*   IF RET15=ZEROES                 /* FIND GOOD                     */ 02207000
*     THEN                                                         0992 02208000
         LTR   RET15,RET15                                         0992 02209000
         BNZ   @RF00992                                            0992 02210000
*     DO;                           /* YES                           */ 02211000
*       RFY                                                        0994 02212000
*         RET15 UNRSTD;                                            0994 02213000
*       NCSUFMCB=GPR02P;            /* PUT FMCB ADDR IN NCSPL        */ 02214000
         ST    GPR02P,NCSUFMCB(,NCSPLPTR)                          0995 02215000
*       RFY                                                        0996 02216000
*         GPR02P UNRSTD;                                           0996 02217000
*       CIDREG=NCSPLCID;            /* GET CID                       */ 02218000
         L     CIDREG,NCSPLCID(,NCSPLPTR)                          0997 02219000
*       DO;                         /* CIDCTL(FINISH)                */ 02220000
*         RFY                                                      0999 02221000
*          (EMCR2,                                                 0999 02222000
*           EMCR3) RSTD;                                           0999 02223000
*         GEN SETS(RPHWORK)                                        1000 02224000
*             (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH); 1000 02225000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              02226000
*         EMCR3='00'X;              /* CLEAR EXTRA BITS              */ 02227000
         SLR   EMCR3,EMCR3                                         1001 02228000
*         CALL ATCLCPTR->ATCCDFIN->ISTSDCCR;/* PROCESS REQUEST       */ 02229000
         L     @10,ATCLCPTR                                        1002 02230000
         L     @15,ATCCDFIN(,@10)                                  1002 02231000
         BALR  @14,@15                                             1002 02232000
*         RFY                                                      1003 02233000
*          (EMCR2,                                                 1003 02234000
*           EMCR3) UNRSTD;                                         1003 02235000
*       END;                        /* CIDCTL RELEASE LOCK           */ 02236000
*       RFY                                                        1005 02237000
*         CIDREG UNRSTD;                                           1005 02238000
*     END;                          /* END FIND GOOD                 */ 02239000
*   ELSE                                                           1007 02240000
*     ;                             /* FIND FAILED                   */ 02241000
@RF00992 DS    0H                                                  1008 02242000
*   RFY                                                            1008 02243000
*     GPR14P RSTD;                                                 1008 02244000
*   GPR14P=GPR09P;                  /* RESTORE RETURN ADDR           */ 02245000
         LR    GPR14P,GPR09P                                       1009 02246000
*   RFY                                                            1010 02247000
*    (GPR09P,                                                      1010 02248000
*     GPR14P) UNRSTD;                                              1010 02249000
*   END CIDFMCB;                                                   1011 02250000
@EL00002 DS    0H                                                  1011 02251000
@EF00002 DS    0H                                                  1011 02252000
@ER00002 BR    @14                                                 1011 02253000
@PB00002 DS    0H                                                  1012 02254000
*                                                                  1012 02255000
*/* SEGMENT(INVKFM)START                                             */ 02256000
*                                                                  1012 02257000
*   DO;                                                            1012 02258000
*     GOTO INVKFM@;                                                1013 02259000
         B     INVKFM@                                             1013 02260000
*INVKFM:                                                           1014 02261000
*   END;                                                           1014 02262000
INVKFM   DS    0H                                                  1015 02263000
*   RFY                                                            1015 02264000
*     ISTRH BASED(ADDR(NCSPLRH));   /*                       @XA12386*/ 02265000
*   GPR01P=NCSPLPTR;                /* PT TO NCSPL                   */ 02266000
         LR    GPR01P,NCSPLPTR                                     1016 02267000
*   IF RHFORMAT=ON                  /* IS THIS A FORMATTED REQUEST   */ 02268000
*     THEN                          /* YES A FORMATTED REQUEST       */ 02269000
         TM    RHFORMAT+260(NCSPLPTR),B'00001000'                  1017 02270000
         BNO   @RF01017                                            1017 02271000
*     CALL ISTINCFM;                /* CALL FSS FUNCTION MANAGER     */ 02272000
         L     @15,@CV04401                                        1018 02273000
         BALR  @14,@15                                             1018 02274000
*   ELSE                            /* NOT FORMATTED                 */ 02275000
*     CALL ISTINCUM;                /* CALL USS FUNCTION MANAGER     */ 02276000
         B     @RC01017                                            1019 02277000
@RF01017 L     @15,@CV04402                                        1019 02278000
         BALR  @14,@15                                             1019 02279000
*   DO;                                                            1020 02280000
*                                                                  1020 02281000
@RC01017 DS    0H                                                  1021 02282000
*/***  CRRMAINT  PROCNM(ISTINCSM)COMP(VY)FUNC(RET)RPHADD((NCSPLRPH))  * 02283000
*                                                                    */ 02284000
*                                                                  1021 02285000
*     /***************************************************************/ 02286000
*     /*                                                             */ 02287000
*     /* ** CLEAR AND SET CURRENT PROCEDURE BIT                      */ 02288000
*     /*                                                             */ 02289000
*     /***************************************************************/ 02290000
*                                                                  1021 02291000
*     NCSPLRPH->RPHCRR->CRACRR->VYCCRT='0'B;                       1021 02292000
         L     @10,NCSPLRPH(,NCSPLPTR)                             1021 02293000
         L     @10,RPHCRR(,@10)                                    1021 02294000
         L     @10,CRACRR(,@10)                                    1021 02295000
         XC    VYCCRT+1(11,@10),VYCCRT+1(@10)                      1021 02296000
         MVI   VYCCRT(@10),B'00000000'                             1021 02297000
*     NCSPLRPH->RPHCRR->CRACRR->CINCSM='1'B;                       1022 02298000
         OI    CINCSM(@10),B'01000000'                             1022 02299000
*   END;                                                           1023 02300000
*   IF NCSPLFSB=ZEROES              /* IS THERE A RU AREA TO BE FREED*/ 02301000
*     THEN                                                         1024 02302000
         L     @10,NCSPLFSB(,NCSPLPTR)                             1024 02303000
         LTR   @10,@10                                             1024 02304000
         BZ    @RT01024                                            1024 02305000
*     ;                             /* NO AREA                       */ 02306000
*   ELSE                            /* YES FREE IT                   */ 02307000
*     CALL CSMREL;                  /*                       @XA12386*/ 02308000
         BAL   @14,CSMREL                                          1026 02309000
*/* SEGMENT(INVKFM)FINISH                                            */ 02310000
*                                                                  1027 02311000
*   DO;                                                            1027 02312000
@RT01024 DS    0H                                                  1028 02313000
*     GOTO INVKFM#;                                                1028 02314000
         B     INVKFM#                                             1028 02315000
*INVKFM@:                                                          1029 02316000
*   END;                                                           1029 02317000
*CSMREL:                                                           1030 02318000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               1030 02319000
         B     @PB00003                                            1030 02320000
CSMREL   DS    0H                                                  1031 02321000
*   RFY                                                            1031 02322000
*    (GPR00F,                                                      1031 02323000
*     GPR04P,                                                      1031 02324000
*     GPR05P,                                                      1031 02325000
*     GPR14P) RSTD;                                                1031 02326000
*   GPR05P=GPR14P;                  /* SAVE RETURN ADDR              */ 02327000
         LR    GPR05P,GPR14P                                       1032 02328000
*   GPR00F=NCSRULEN+2;              /* LENGTH OF GOTTEN AREA         */ 02329000
         L     @15,NCSPLFSB(,NCSPLPTR)                             1033 02330000
         LA    GPR00F,2                                            1033 02331000
         AH    GPR00F,NCSRULEN(,@15)                               1033 02332000
*   GPR04P=NCSPLFSB;                /* ADDR OF GOTTEN AREA           */ 02333000
         LR    GPR04P,@15                                          1034 02334000
*   GPR01P=NCSPLRPH;                /* PT TO RPH                     */ 02335000
*                                                                  1035 02336000
         L     GPR01P,NCSPLRPH(,NCSPLPTR)                          1035 02337000
*   /*****************************************************************/ 02338000
*   /*                                                               */ 02339000
*   /* FREESTOR                                                      */ 02340000
*   /* AREA(GPR04P)SIZE(GPR00F)TYPE(PAGEABLE)FETCHP(NO)SAVE(YES)     */ 02341000
*   /*                                                               */ 02342000
*   /*****************************************************************/ 02343000
*                                                                  1036 02344000
*   DO;                                                            1036 02345000
*                                                                  1036 02346000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */ 02347000
*/* END OF ATBUILD                                                   */ 02348000
*                                                                  1037 02349000
*     RFY                                                          1037 02350000
*      (GPR00P,                                                    1037 02351000
*       GPR01P,                                                    1037 02352000
*       GPR02P,                                                    1037 02353000
*       GPR03P) RSTD;                                              1037 02354000
*     RFY                                                          1038 02355000
*       ISTRPH BASED(GPR01P);                                      1038 02356000
*     GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 02357000
*         GPR10P,GPR11P,GPR12P,GPR13P) SETS(RPHWORK);              1039 02358000
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS      02359000
*     GPR00F=GPR00F;                /* SIZE IN REG0                  */ 02360000
*     DCL                                                          1041 02361000
*       1 CMZA0062 FIXED(31) STATIC LOCAL,                         1041 02362000
*        2 * FIXED(8) INIT(64),     /* OPTION FLAGS                  */ 02363000
*        2 * FIXED(8) INIT(96),     /* STORAGE KEY                   */ 02364000
*        2 * FIXED(8) INIT(241),    /* SUBPOOL NUMBER                */ 02365000
*        2 * FIXED(8) INIT('01'X);  /* REQUEST TYPE                  */ 02366000
*     GPR03F=CMZA0062;                                             1042 02367000
         L     GPR03F,CMZA0062                                     1042 02368000
*     RFY                                                          1043 02369000
*      (GPR04P) RSTD;                                              1043 02370000
*     GPR04P=GPR04P;                /* PUT FREEMAIN ADDR IN REG4     */ 02371000
*     DO;                           /* LISATCVT                    1045 02372000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 02373000
*       GPR02P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 02374000
         L     GPR02P,ATCLCPTR                                     1046 02375000
*     END;                          /* LISATCVT                      */ 02376000
*     CALL GPR02P->ATCGTSTR;        /* CALL ISTORFSR                 */ 02377000
         L     @15,ATCGTSTR(,GPR02P)                               1048 02378000
         BALR  @14,@15                                             1048 02379000
*     RFY                                                          1049 02380000
*      (GPR00P,                                                    1049 02381000
*       GPR01P,                                                    1049 02382000
*       GPR02P,                                                    1049 02383000
*       GPR03P,                                                    1049 02384000
*       GPR04P) UNRSTD;                                            1049 02385000
*   END;                            /* END OF FREESTOR               */ 02386000
*   GPR14P=GPR05P;                  /* RESTORE RETURN ADDR           */ 02387000
         LR    GPR14P,GPR05P                                       1051 02388000
*   RFY                                                            1052 02389000
*    (GPR00F,                                                      1052 02390000
*     GPR04P,                                                      1052 02391000
*     GPR05P,                                                      1052 02392000
*     GPR14P) UNRSTD;                                              1052 02393000
*   END CSMREL;                                                    1053 02394000
*                                                                  1053 02395000
@EL00003 DS    0H                                                  1053 02396000
@EF00003 DS    0H                                                  1053 02397000
@ER00003 BR    @14                                                 1053 02398000
@PB00003 DS    0H                                                  1054 02399000
*/* TPEPILOG                                                         */ 02400000
*                                                                  1054 02401000
*   GEN(PRINT OFF);                                                1054 02402000
         PRINT OFF                                                      02403000
*   DECLARE                                                        1055 02404000
*     EMCR0 PTR REG(0),                                            1055 02405000
*     EMCR1 PTR REG(1),                                            1055 02406000
*     EMCR2 PTR REG(2),                                            1055 02407000
*     EMCR3 PTR REG(3),                                            1055 02408000
*     EMCR4 PTR REG(4),                                            1055 02409000
*     EMCR5 PTR REG(5),                                            1055 02410000
*     EMCR6 PTR REG(6),                                            1055 02411000
*     EMCR7 PTR REG(7),                                            1055 02412000
*     EMCR8 PTR REG(8),                                            1055 02413000
*     EMCR9 PTR REG(9),                                            1055 02414000
*     EMCR10 PTR REG(10),                                          1055 02415000
*     EMCR11 PTR REG(11),                                          1055 02416000
*     EMCR12 PTR REG(12),                                          1055 02417000
*     EMCR13 PTR REG(13),                                          1055 02418000
*     EMCR14 PTR REG(14),                                          1055 02419000
*     EMCR15 PTR REG(15);                                          1055 02420000
*   DECLARE                                                        1056 02421000
*     ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*),/* CIDCTL ADD ROUTINE  */ 02422000
*     ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*),/* CIDCTL DELETE     1056 02423000
*                                      ROUTINE                       */ 02424000
*     ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*),/* CIDCTL FIND ROUTINE */ 02425000
*     ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*),/* CIDCTL FIND NCB   1056 02426000
*                                      ROUTINE                       */ 02427000
*     ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*);/* CIDCTL FINISH     1056 02428000
*                                      ROUTINE                       */ 02429000
*   DCL                                                            1057 02430000
*     CMZCIDM FIXED(15) DEFINED(ATCCIDM);/* CIDMASK ALIAS            */ 02431000
*   GEN(PRINT ON);                                                 1058 02432000
*                                                                  1058 02433000
         PRINT ON                                                       02434000
*/* END OF TPEPILOG                                                  */ 02435000
*                                                                  1059 02436000
*   END ISTINCSM;                                                  1059 02437000
         B     @EL00001                                            1059 02438000
@DATA    DS    0H                                                       02439000
@DATD    DSECT                                                          02440000
         DS    0F                                                       02441000
ISTINCSM CSECT                                                          02442000
         DS    0F                                                       02443000
@CF00034 DC    F'1'                                                     02444000
@CF00064 DC    F'12'                                                    02445000
@CF00130 DC    F'72'                                                    02446000
@CF03200 DC    F'-8'                                                    02447000
@CF02023 DC    XL4'08000000'                                            02448000
@CF04371 DC    XL4'00FFFFFF'                                            02449000
@DATD    DSECT                                                          02450000
         DS    0D                                                       02451000
FSBPTR   DS    A                                                        02452000
CSMCOMID DS    FL4                                                      02453000
         ORG   CSMCOMID                                                 02454000
CSMSAF   DS    CL2                                                      02455000
CSMDAF   DS    CL2                                                      02456000
         ORG   CSMCOMID+4                                               02457000
LCPBPTR  DS    A                                                        02458000
MSGLST   DS    BL4                                                      02459000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02460000
@ENDDATD EQU   *                                                        02461000
ISTINCSM CSECT                                                          02462000
         DS    0F                                                       02463000
@SIZDATD DC    AL1(0)                                                   02464000
         DC    AL3(@ENDDATD-@DATD)                                      02465000
@CV04385 DC    V(ISTINCVP)                                              02466000
@CV04386 DC    V(ISTINCY5)                                              02467000
@CV04392 DC    V(ISTINCS1)                                              02468000
@CV04401 DC    V(ISTINCFM)                                              02469000
@CV04402 DC    V(ISTINCUM)                                              02470000
         DS    0D                                                       02471000
CMZA0062 DS    FL4                                                      02472000
         ORG   CMZA0062                                                 02473000
@NM00062 DC    AL1(64)                                                  02474000
@NM00063 DC    AL1(96)                                                  02475000
@NM00064 DC    AL1(241)                                                 02476000
@NM00065 DC    XL1'01'                                                  02477000
         ORG   CMZA0062+4                                               02478000
@CB03205 DC    X'03F0F0F7'                                              02479000
@CB00290 DC    X'0001'                                                  02480000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02481000
@01      EQU   01                                                       02482000
@02      EQU   02                                                       02483000
@03      EQU   03                                                       02484000
@04      EQU   04                                                       02485000
@05      EQU   05                                                       02486000
@06      EQU   06                                                       02487000
@07      EQU   07                                                       02488000
@08      EQU   08                                                       02489000
@09      EQU   09                                                       02490000
@10      EQU   10                                                       02491000
@11      EQU   11                                                       02492000
@12      EQU   12                                                       02493000
@13      EQU   13                                                       02494000
@14      EQU   14                                                       02495000
@15      EQU   15                                                       02496000
FMCBPTR  EQU   @03                                                      02497000
RPHPTR   EQU   @01                                                      02498000
GPR00F   EQU   @00                                                      02499000
GPR00P   EQU   @00                                                      02500000
GPR01P   EQU   @01                                                      02501000
GPR02P   EQU   @02                                                      02502000
GPR03F   EQU   @03                                                      02503000
GPR03P   EQU   @03                                                      02504000
GPR04P   EQU   @04                                                      02505000
GPR05P   EQU   @05                                                      02506000
GPR06P   EQU   @06                                                      02507000
GPR07P   EQU   @07                                                      02508000
GPR08P   EQU   @08                                                      02509000
GPR09P   EQU   @09                                                      02510000
GPR10P   EQU   @10                                                      02511000
GPR11P   EQU   @11                                                      02512000
GPR12P   EQU   @12                                                      02513000
GPR13P   EQU   @13                                                      02514000
GPR14P   EQU   @14                                                      02515000
GPR15P   EQU   @15                                                      02516000
CIDREG   EQU   @02                                                      02517000
SAVERPT  EQU   @03                                                      02518000
NCSPLPTR EQU   @08                                                      02519000
DATABASE EQU   @11                                                      02520000
RET15    EQU   @15                                                      02521000
EMCR2    EQU   @02                                                      02522000
EMCR3    EQU   @03                                                      02523000
EMCR0    EQU   @00                                                      02524000
EMCR1    EQU   @01                                                      02525000
EMCR10   EQU   @10                                                      02526000
EMCR11   EQU   @11                                                      02527000
EMCR12   EQU   @12                                                      02528000
EMCR13   EQU   @13                                                      02529000
EMCR14   EQU   @14                                                      02530000
EMCR15   EQU   @15                                                      02531000
EMCR4    EQU   @04                                                      02532000
EMCR5    EQU   @05                                                      02533000
EMCR6    EQU   @06                                                      02534000
EMCR7    EQU   @07                                                      02535000
EMCR8    EQU   @08                                                      02536000
EMCR9    EQU   @09                                                      02537000
GPR01F   EQU   @01                                                      02538000
GPR02F   EQU   @02                                                      02539000
GPR04F   EQU   @04                                                      02540000
GPR05F   EQU   @05                                                      02541000
GPR06F   EQU   @06                                                      02542000
GPR07F   EQU   @07                                                      02543000
GPR08F   EQU   @08                                                      02544000
GPR09F   EQU   @09                                                      02545000
GPR10F   EQU   @10                                                      02546000
GPR11F   EQU   @11                                                      02547000
GPR12F   EQU   @12                                                      02548000
GPR13F   EQU   @13                                                      02549000
GPR14F   EQU   @14                                                      02550000
GPR15F   EQU   @15                                                      02551000
ATCLCPTR EQU   1032                                                     02552000
ISTPOHD  EQU   0                                                        02553000
POHSTAT  EQU   ISTPOHD+1                                                02554000
ISTPFX   EQU   0                                                        02555000
PFXID    EQU   ISTPFX                                                   02556000
ISTNCSPL EQU   0                                                        02557000
@NM00001 EQU   ISTNCSPL                                                 02558000
NCSPFX   EQU   @NM00001                                                 02559000
NCSPLVCD EQU   ISTNCSPL+17                                              02560000
NCSPLVBF EQU   ISTNCSPL+18                                              02561000
NCSPLVFL EQU   ISTNCSPL+20                                              02562000
NCSVDEL  EQU   NCSPLVFL                                                 02563000
NCSPLVF1 EQU   ISTNCSPL+21                                              02564000
NCSPLRPT EQU   ISTNCSPL+52                                              02565000
NCSPLCMD EQU   ISTNCSPL+60                                              02566000
NCSCMDA  EQU   NCSPLCMD                                                 02567000
NCSCRFLG EQU   ISTNCSPL+67                                              02568000
NCSPLRAD EQU   ISTNCSPL+144                                             02569000
NCSIOCID EQU   ISTNCSPL+148                                             02570000
NCSPLCID EQU   NCSIOCID                                                 02571000
NCSPLSAF EQU   NCSPLCID                                                 02572000
NCSPLDAF EQU   NCSPLCID+2                                               02573000
NCSPLWKA EQU   ISTNCSPL+152                                             02574000
NCSPLCVT EQU   ISTNCSPL+156                                             02575000
NCSPLRPH EQU   ISTNCSPL+160                                             02576000
NCSPLFSB EQU   ISTNCSPL+168                                             02577000
NCSPLFL1 EQU   ISTNCSPL+176                                             02578000
NCSPLEBN EQU   NCSPLFL1                                                 02579000
NCSPLFL2 EQU   ISTNCSPL+177                                             02580000
NCSPLFL3 EQU   ISTNCSPL+178                                             02581000
NCSPLFL4 EQU   ISTNCSPL+179                                             02582000
NCSPLFL5 EQU   ISTNCSPL+181                                             02583000
NCSPLAPP EQU   ISTNCSPL+216                                             02584000
NCSPLSQN EQU   ISTNCSPL+228                                             02585000
NCSSENSE EQU   ISTNCSPL+244                                             02586000
NCSMGLPT EQU   ISTNCSPL+252                                             02587000
NCSUFMCB EQU   ISTNCSPL+256                                             02588000
NCSPLRH  EQU   ISTNCSPL+260                                             02589000
NCSCRMSK EQU   ISTNCSPL+268                                             02590000
NCSCHKPT EQU   NCSCRMSK                                                 02591000
NCSCRMOD EQU   NCSCRMSK+2                                               02592000
NCSPLSID EQU   ISTNCSPL+271                                             02593000
NCSPLSTA EQU   NCSPLSID                                                 02594000
NCSPLPHD EQU   NCSPLSID+1                                               02595000
NCSAPP   EQU   0                                                        02596000
NCSAPBUE EQU   NCSAPP+88                                                02597000
NCSUSSRU EQU   0                                                        02598000
NCSRULEN EQU   NCSUSSRU                                                 02599000
ISTRH    EQU   0                                                        02600000
RHFLAGS  EQU   ISTRH                                                    02601000
RH1      EQU   RHFLAGS                                                  02602000
RHFORMAT EQU   RH1                                                      02603000
RH2      EQU   RHFLAGS+1                                                02604000
RHRETRY  EQU   RH2                                                      02605000
RHRSVD1  EQU   RH2                                                      02606000
RH3      EQU   RHFLAGS+2                                                02607000
ISTFDB   EQU   0                                                        02608000
ISTFSB   EQU   0                                                        02609000
FSBFSB   EQU   ISTFSB                                                   02610000
FSBMNRCD EQU   FSBFSB+2                                                 02611000
FSBSFLGS EQU   FSBFSB+3                                                 02612000
FSBFSBA  EQU   FSBFSB+4                                                 02613000
FSBBTH   EQU   FSBFSB+8                                                 02614000
FSBCID   EQU   FSBBTH                                                   02615000
FSBRQTAG EQU   FSBBTH+4                                                 02616000
FSBSEQID EQU   FSBRQTAG                                                 02617000
FSBFLAGS EQU   FSBSEQID                                                 02618000
FSBSEQ   EQU   FSBSEQID+1                                               02619000
FSBCSWST EQU   FSBBTH+6                                                 02620000
FSBTHFLD EQU   FSBCSWST                                                 02621000
FSBTH1   EQU   FSBTHFLD                                                 02622000
FSBSYSRS EQU   FSBTH1                                                   02623000
FSBTH2   EQU   FSBTHFLD+1                                               02624000
FSBEXTRS EQU   FSBTH2                                                   02625000
FSBXFSTS EQU   FSBEXTRS                                                 02626000
FSBXCODE EQU   FSBEXTRS                                                 02627000
FSBNETRS EQU   FSBFSB+16                                                02628000
FSBSRCAT EQU   FSBNETRS                                                 02629000
FSBERC   EQU   FSBNETRS+1                                               02630000
FSBFBMI  EQU   FSBERC                                                   02631000
FSBDMGRS EQU   FSBFSB+18                                                02632000
FSBSS1   EQU   FSBDMGRS                                                 02633000
FSBSS2   EQU   FSBDMGRS+1                                               02634000
FSBLCPB  EQU   FSBFSB+20                                                02635000
FSBMSGID EQU   FSBLCPB                                                  02636000
FSBLCCWA EQU   FSBFSB+24                                                02637000
FSBRLSTS EQU   FSBLCCWA                                                 02638000
ISTMGL   EQU   0                                                        02639000
MGLRH    EQU   ISTMGL                                                   02640000
MGLUSSFL EQU   ISTMGL+3                                                 02641000
MGLREQ   EQU   MGLUSSFL                                                 02642000
MGLRUPTR EQU   ISTMGL+4                                                 02643000
MGLSEQNO EQU   MGLRUPTR                                                 02644000
MGLSENSE EQU   MGLRUPTR+2                                               02645000
MGLMSGAD EQU   ISTMGL+8                                                 02646000
MGLVDATA EQU   ISTMGL+12                                                02647000
MGLORGRU EQU   ISTMGL+16                                                02648000
MGLUSSMG EQU   0                                                        02649000
MGLUSSTX EQU   0                                                        02650000
MGLRUFLD EQU   0                                                        02651000
ISTLOK   EQU   0                                                        02652000
LOKCHN   EQU   ISTLOK+1                                                 02653000
LOKCHNG  EQU   LOKCHN                                                   02654000
@NM00012 EQU   LOKCHNG+2                                                02655000
ISTDEVCH EQU   0                                                        02656000
DEVSHCH  EQU   ISTDEVCH                                                 02657000
DEVCHAR  EQU   DEVSHCH                                                  02658000
DEVTCODE EQU   ISTDEVCH+1                                               02659000
DEVFLAGS EQU   ISTDEVCH+3                                               02660000
DEVFCCTL EQU   DEVFLAGS                                                 02661000
DEVCHAR3 EQU   DEVFLAGS                                                 02662000
ISTRPRE  EQU   0                                                        02663000
RPRCOMID EQU   ISTRPRE+8                                                02664000
RPRDAF   EQU   RPRCOMID+2                                               02665000
RPRENTRY EQU   ISTRPRE+20                                               02666000
RPRFLAGA EQU   ISTRPRE+21                                               02667000
RPRVRYPD EQU   RPRFLAGA                                                 02668000
RPRFLAGB EQU   ISTRPRE+22                                               02669000
RPRHLVPD EQU   RPRFLAGB                                                 02670000
RPRCAUSE EQU   ISTRPRE+23                                               02671000
RPRNSNEA EQU   ISTRPRE+36                                               02672000
RPRFLAGD EQU   ISTRPRE+61                                               02673000
RPRFLAGC EQU   ISTRPRE+62                                               02674000
ISTRCPRE EQU   0                                                        02675000
RCPPMODE EQU   ISTRCPRE+91                                              02676000
RCPLGNIN EQU   ISTRCPRE+92                                              02677000
ISTRDT   EQU   0                                                        02678000
RDTPLEN  EQU   ISTRDT+72                                                02679000
RDTPRIOR EQU   RDTPLEN                                                  02680000
RDTFLAGB EQU   ISTRDT+91                                                02681000
RDTVYRPH EQU   ISTRDT+108                                               02682000
RDTSTCNT EQU   ISTRDT+112                                               02683000
ISTRAP   EQU   0                                                        02684000
RAPFLG   EQU   ISTRAP+108                                               02685000
RAPFLGB  EQU   ISTRAP+109                                               02686000
RAPFLGC  EQU   ISTRAP+110                                               02687000
ISTRLC   EQU   0                                                        02688000
RLCADR   EQU   ISTRLC+72                                                02689000
RLCFLAG  EQU   RLCADR                                                   02690000
ISTRRN   EQU   0                                                        02691000
RRNADR   EQU   ISTRRN+136                                               02692000
RRNFLAG  EQU   RRNADR                                                   02693000
RRNUCBAD EQU   RRNADR+1                                                 02694000
RRNRDF   EQU   ISTRRN+172                                               02695000
RRNRDFA  EQU   RRNRDF                                                   02696000
RRNRDFB  EQU   RRNRDF+1                                                 02697000
RRNCMF   EQU   ISTRRN+176                                               02698000
RRNCMFA  EQU   RRNCMF                                                   02699000
RRNCMFB  EQU   RRNCMF+1                                                 02700000
RRNCMFC  EQU   RRNCMF+2                                                 02701000
RRNCMFD  EQU   RRNCMF+3                                                 02702000
RRNNMDPD EQU   ISTRRN+192                                               02703000
RRNHPRE  EQU   ISTRRN+216                                               02704000
ISTRGP   EQU   0                                                        02705000
RGPFLG   EQU   ISTRGP+72                                                02706000
ISTRLN   EQU   0                                                        02707000
RLNADR   EQU   ISTRLN+72                                                02708000
RLNFLAG  EQU   RLNADR                                                   02709000
RLNUCBAD EQU   RLNADR+1                                                 02710000
RLNSTAT1 EQU   ISTRLN+86                                                02711000
RLNSTAT2 EQU   ISTRLN+87                                                02712000
RLNRDF   EQU   ISTRLN+88                                                02713000
RLNRDFA  EQU   RLNRDF                                                   02714000
RLNRACNT EQU   RLNRDFA                                                  02715000
RLNRDFB  EQU   RLNRDF+1                                                 02716000
RLNCRFLG EQU   ISTRLN+102                                               02717000
RLNLSCMD EQU   RLNCRFLG                                                 02718000
ISTRPT   EQU   0                                                        02719000
RPTLNCID EQU   ISTRPT+116                                               02720000
RPTDITT  EQU   ISTRPT+128                                               02721000
RPTFLAG1 EQU   ISTRPT+140                                               02722000
ISTRCL   EQU   0                                                        02723000
RCLADR   EQU   ISTRCL+72                                                02724000
RCLFLAG  EQU   RCLADR                                                   02725000
ISTRTR   EQU   0                                                        02726000
RTRADR   EQU   ISTRTR+124                                               02727000
RTRFLAG  EQU   RTRADR                                                   02728000
RTRRDFA  EQU   ISTRTR+136                                               02729000
RTRRAALL EQU   RTRRDFA                                                  02730000
RTRRDFB  EQU   ISTRTR+137                                               02731000
RTRRDFC  EQU   ISTRTR+138                                               02732000
RTRRDFD  EQU   ISTRTR+139                                               02733000
RTRRDFE  EQU   ISTRTR+140                                               02734000
RTRRDFF  EQU   ISTRTR+141                                               02735000
RTRCRFLG EQU   ISTRTR+143                                               02736000
RTRLSCMD EQU   RTRCRFLG                                                 02737000
RTRBSCID EQU   ISTRTR+188                                               02738000
ISTRIN   EQU   0                                                        02739000
RINDFD   EQU   ISTRIN+124                                               02740000
RINREMPO EQU   RINDFD                                                   02741000
RINNODEF EQU   RINDFD                                                   02742000
RINLDISC EQU   RINDFD                                                   02743000
RINNODID EQU   ISTRIN+125                                               02744000
RINRLDAF EQU   ISTRIN+126                                               02745000
RINREMOT EQU   ISTRIN+128                                               02746000
RINVPAB  EQU   ISTRIN+132                                               02747000
RINRPHCN EQU   ISTRIN+136                                               02748000
RINNCSPL EQU   ISTRIN+140                                               02749000
RINCNCNT EQU   ISTRIN+144                                               02750000
ISTRDS   EQU   0                                                        02751000
ISTDOT   EQU   0                                                        02752000
ISTRCC   EQU   0                                                        02753000
RCCFLAG  EQU   ISTRCC+73                                                02754000
RCCERPIP EQU   RCCFLAG                                                  02755000
RCCPRGDN EQU   RCCFLAG                                                  02756000
RCCFLAGB EQU   ISTRCC+74                                                02757000
RCCSTAID EQU   ISTRCC+78                                                02758000
RCCID48  EQU   RCCSTAID+2                                               02759000
RCCCRFLG EQU   ISTRCC+108                                               02760000
ISTRLU   EQU   0                                                        02761000
RLUFLAG  EQU   ISTRLU+125                                               02762000
RLUNDSES EQU   RLUFLAG                                                  02763000
RLUCRFLG EQU   ISTRLU+126                                               02764000
RLUPACE  EQU   ISTRLU+132                                               02765000
RLUNCPPC EQU   ISTRLU+134                                               02766000
RLUUSSTB EQU   ISTRLU+140                                               02767000
RLUMODET EQU   ISTRLU+152                                               02768000
ISTRPX   EQU   0                                                        02769000
ISTRLX   EQU   0                                                        02770000
RLXFLAGA EQU   ISTRLX+76                                                02771000
ISTRSW   EQU   0                                                        02772000
ISTRDA   EQU   0                                                        02773000
RDAADR   EQU   ISTRDA+72                                                02774000
RDAFLAG  EQU   RDAADR                                                   02775000
RDAUCBAD EQU   RDAADR+1                                                 02776000
ISTRLS   EQU   0                                                        02777000
ISTDNT   EQU   0                                                        02778000
ISTGNT   EQU   0                                                        02779000
ISTPAT   EQU   0                                                        02780000
PATFLAGA EQU   ISTPAT+7                                                 02781000
ISTPAB   EQU   0                                                        02782000
PABWQCHN EQU   ISTPAB                                                   02783000
PABWEQA  EQU   PABWQCHN                                                 02784000
PABCHAIN EQU   PABWQCHN+4                                               02785000
PABRPHFG EQU   ISTPAB+12                                                02786000
PABFLAGS EQU   PABRPHFG                                                 02787000
PABERLCK EQU   PABFLAGS                                                 02788000
PABERRLK EQU   PABERLCK                                                 02789000
ISTPROCD EQU   0                                                        02790000
PROPROC  EQU   ISTPROCD                                                 02791000
PROPROC1 EQU   PROPROC                                                  02792000
PROPROC2 EQU   PROPROC+1                                                02793000
PROPROC3 EQU   PROPROC+2                                                02794000
PROPROC4 EQU   PROPROC+3                                                02795000
PROPROCS EQU   0                                                        02796000
PROSETMS EQU   PROPROCS+1                                               02797000
PROSETM2 EQU   PROSETMS                                                 02798000
PROSETM3 EQU   PROSETMS+1                                               02799000
PROSETM4 EQU   PROSETMS+2                                               02800000
ISTFMCB  EQU   0                                                        02801000
FMCDNCBA EQU   ISTFMCB+16                                               02802000
FMCSTAT  EQU   ISTFMCB+28                                               02803000
FMCSTAT1 EQU   ISTFMCB+29                                               02804000
FMCCMDFL EQU   ISTFMCB+31                                               02805000
FMCCMDR  EQU   FMCCMDFL                                                 02806000
FMCCMPS1 EQU   ISTFMCB+36                                               02807000
FMCVWT   EQU   ISTFMCB+44                                               02808000
FMCSIPA  EQU   ISTFMCB+148                                              02809000
FMCNXOSQ EQU   ISTFMCB+152                                              02810000
FMCNXCFM EQU   FMCNXOSQ                                                 02811000
FMCNXOSC EQU   FMCNXOSQ+2                                               02812000
FMCSSTAT EQU   ISTFMCB+159                                              02813000
FMCPACE  EQU   ISTFMCB+160                                              02814000
FMCPACEN EQU   FMCPACE                                                  02815000
FMCPACEM EQU   FMCPACE+1                                                02816000
FMCPACPC EQU   FMCPACE+2                                                02817000
FMCCVAL  EQU   FMCPACE+3                                                02818000
FMCOBCE  EQU   FMCCVAL                                                  02819000
FMCCLEXT EQU   ISTFMCB+164                                              02820000
FMCRPLA  EQU   FMCCLEXT                                                 02821000
FMCFBA   EQU   FMCCLEXT+4                                               02822000
FMCCMPS2 EQU   FMCCLEXT+16                                              02823000
FMCFLGA  EQU   FMCCMPS2                                                 02824000
FMCFLGCL EQU   FMCCMPS2+1                                               02825000
FMCPSCMD EQU   FMCCMPS2+2                                               02826000
FMCPSTAT EQU   FMCCMPS2+3                                               02827000
FMCSTAT2 EQU   ISTFMCB+186                                              02828000
FMCMODEB EQU   ISTFMCB+189                                              02829000
FMCCLSEQ EQU   ISTFMCB+190                                              02830000
FMCRRESP EQU   ISTFMCB+195                                              02831000
FMCSSEGQ EQU   ISTFMCB+200                                              02832000
FMCFBAS  EQU   ISTFMCB+216                                              02833000
FMCZV002 EQU   FMCFBAS                                                  02834000
FMCSNCTL EQU   ISTFMCB+224                                              02835000
FMCSCFLG EQU   FMCSNCTL                                                 02836000
FMCVS1   EQU   ISTFMCB+232                                              02837000
FMCZFLAG EQU   FMCVS1                                                   02838000
FMCZF006 EQU   FMCZFLAG                                                 02839000
FMCLBXM  EQU   FMCVS1+12                                                02840000
FMCSHEAQ EQU   FMCLBXM                                                  02841000
FMCLCPBQ EQU   FMCVS1+16                                                02842000
FMCLCPAQ EQU   FMCVS1+20                                                02843000
FMCSEQ1  EQU   FMCVS1+34                                                02844000
FMCZFLG2 EQU   FMCVS1+35                                                02845000
FMCCVFLG EQU   FMCVS1+44                                                02846000
FMCFLAG  EQU   0                                                        02847000
FMCFLGB  EQU   FMCFLAG                                                  02848000
ISTRU    EQU   0                                                        02849000
RUDATA   EQU   ISTRU                                                    02850000
ISTRUB   EQU   0                                                        02851000
NSRUNA5  EQU   0                                                        02852000
ISTDYPAB EQU   0                                                        02853000
ISTRPH   EQU   0                                                        02854000
RPHCNTL  EQU   ISTRPH                                                   02855000
RPHFLAGS EQU   RPHCNTL+2                                                02856000
RPHAPTYP EQU   RPHFLAGS                                                 02857000
RPHFSTLC EQU   RPHFLAGS                                                 02858000
RPHFLGB  EQU   RPHCNTL+3                                                02859000
RPHRPHA  EQU   ISTRPH+4                                                 02860000
RPHTSKID EQU   ISTRPH+8                                                 02861000
RPHRESMA EQU   ISTRPH+16                                                02862000
RPHWPFLG EQU   RPHRESMA                                                 02863000
RPHWEA   EQU   ISTRPH+24                                                02864000
RPHCSPA  EQU   RPHWEA                                                   02865000
RPHSRPRM EQU   ISTRPH+28                                                02866000
RPHCRR   EQU   ISTRPH+32                                                02867000
RPHPABQA EQU   ISTRPH+36                                                02868000
RPHWORK  EQU   ISTRPH+40                                                02869000
RPHSAVE1 EQU   RPHWORK                                                  02870000
RPHSBITS EQU   RPHSAVE1+1                                               02871000
ISTATCVT EQU   0                                                        02872000
ATCCOM   EQU   ISTATCVT                                                 02873000
ATCSTAT  EQU   ATCCOM                                                   02874000
ATCSTAT1 EQU   ATCSTAT                                                  02875000
ATCSTFLG EQU   ATCSTAT+1                                                02876000
ATCPOFLG EQU   ATCSTAT+2                                                02877000
ATCSTAT4 EQU   ATCSTAT+3                                                02878000
ATCIOTRC EQU   ATCCOM+140                                               02879000
ATCTHTRC EQU   ATCIOTRC                                                 02880000
ATCGTSTR EQU   ATCCOM+164                                               02881000
ATCVTMID EQU   ATCCOM+240                                               02882000
ATCCIDM  EQU   ATCCOM+266                                               02883000
ATCCDADD EQU   ISTATCVT+276                                             02884000
ATCCDDEL EQU   ISTATCVT+280                                             02885000
ATCCDFND EQU   ISTATCVT+284                                             02886000
ATCCSMR  EQU   ISTATCVT+296                                             02887000
ATCSHRFG EQU   ISTATCVT+316                                             02888000
ATCHPGM  EQU   ISTATCVT+384                                             02889000
ATCCDFIN EQU   ISTATCVT+460                                             02890000
ATCCDFDN EQU   ISTATCVT+464                                             02891000
ATCVLCNT EQU   ISTATCVT+772                                             02892000
ATCRNO   EQU   ISTATCVT+788                                             02893000
ATCSOPD  EQU   ISTATCVT+792                                             02894000
ATCSIPD  EQU   ISTATCVT+800                                             02895000
ATCSECST EQU   ISTATCVT+812                                             02896000
ATCSTAT2 EQU   ISTATCVT+818                                             02897000
ATCVTBAM EQU   ISTATCVT+908                                             02898000
@NM00042 EQU   ATCVTBAM+3                                               02899000
ATCAOSM  EQU   ISTATCVT+912                                             02900000
ATCGSRBQ EQU   ATCAOSM+4                                                02901000
ATCGSRBG EQU   ATCGSRBQ                                                 02902000
ATCAP31  EQU   ATCAOSM+24                                               02903000
ATCICAPP EQU   ATCAOSM+100                                              02904000
ATCLDAPP EQU   ATCAOSM+120                                              02905000
ATCDAPVT EQU   ATCAOSM+140                                              02906000
ATCCRA   EQU   ATCAOSM+280                                              02907000
ATCCRACN EQU   ATCCRA+4                                                 02908000
ATCSRB   EQU   ATCAOSM+288                                              02909000
ATCSRBCN EQU   ATCSRB+4                                                 02910000
ATCCRPL  EQU   ATCAOSM+296                                              02911000
ATCRPLCN EQU   ATCCRPL+4                                                02912000
ATCSQAFR EQU   ATCAOSM+304                                              02913000
ATCORTBC EQU   ATCSQAFR+4                                               02914000
ATCORSRB EQU   ATCORTBC                                                 02915000
@NM00044 EQU   ATCAOSM+332                                              02916000
ATCVTFLG EQU   ATCAOSM+392                                              02917000
ATCZFLAG EQU   ATCAOSM+588                                              02918000
NXTAVPTR EQU   0                                                        02919000
CSMSAVE  EQU   0                                                        02920000
CALLER13 EQU   CSMSAVE+4                                                02921000
CALLED13 EQU   CSMSAVE+8                                                02922000
CSMNSPE  EQU   0                                                        02923000
NSPELNG  EQU   CSMNSPE                                                  02924000
NSPE     EQU   CSMNSPE+1                                                02925000
ISTLCCW  EQU   0                                                        02926000
LCCWOP   EQU   ISTLCCW                                                  02927000
LCCWRWOP EQU   LCCWOP                                                   02928000
LCCWCTL  EQU   LCCWRWOP                                                 02929000
LCCWFLAG EQU   ISTLCCW+1                                                02930000
LCCWLSI  EQU   LCCWFLAG                                                 02931000
ISTLCPB  EQU   0                                                        02932000
LCPREQTG EQU   ISTLCPB+2                                                02933000
LCPFLAGS EQU   LCPREQTG                                                 02934000
LCPZF001 EQU   LCPFLAGS                                                 02935000
LCPZRT02 EQU   LCPZF001                                                 02936000
LCPZF002 EQU   LCPFLAGS                                                 02937000
LCPZRT03 EQU   LCPZF002                                                 02938000
LCPZF003 EQU   LCPFLAGS                                                 02939000
LCPZRT04 EQU   LCPZF003                                                 02940000
LCPZF004 EQU   LCPFLAGS                                                 02941000
LCPZRT05 EQU   LCPZF004                                                 02942000
LCPZRT06 EQU   LCPFLAGS                                                 02943000
LCPZRT07 EQU   LCPFLAGS                                                 02944000
LCPMNRCD EQU   LCPREQTG+1                                               02945000
LCPZRT08 EQU   LCPMNRCD                                                 02946000
LCPZRT09 EQU   LCPMNRCD                                                 02947000
LCPCHAIN EQU   ISTLCPB+4                                                02948000
LCPCHAI1 EQU   LCPCHAIN                                                 02949000
LCPRUCNT EQU   ISTLCPB+8                                                02950000
LCPFLAG2 EQU   ISTLCPB+9                                                02951000
LCPTLBPI EQU   LCPFLAG2                                                 02952000
LCPFID0  EQU   LCPFLAG2                                                 02953000
LCPSEQ   EQU   ISTLCPB+10                                               02954000
LCPCID   EQU   ISTLCPB+16                                               02955000
LCPFDBA  EQU   ISTLCPB+24                                               02956000
LCPFLG1  EQU   ISTLCPB+37                                               02957000
LCPFLCCW EQU   ISTLCPB+40                                               02958000
LCPLCCW  EQU   ISTLCPB+48                                               02959000
LCPPABA  EQU   LCPLCCW+4                                                02960000
LCPRPHA  EQU   LCPPABA                                                  02961000
ISTZSAVE EQU   0                                                        02962000
ZSAZSVBC EQU   ISTZSAVE                                                 02963000
ZSAZSVMS EQU   ZSAZSVBC                                                 02964000
ISTPFCRR EQU   0                                                        02965000
PFCCRR   EQU   ISTPFCRR                                                 02966000
PFCCRRID EQU   PFCCRR                                                   02967000
PFCCRRLN EQU   PFCCRR+2                                                 02968000
PFCHDR   EQU   ISTPFCRR+4                                               02969000
PFCCRRO  EQU   PFCHDR                                                   02970000
PFCFRRO  EQU   PFCHDR+4                                                 02971000
ISTCFCRR EQU   0                                                        02972000
CFCAUDIT EQU   ISTCFCRR                                                 02973000
CFCNTRD  EQU   CFCAUDIT                                                 02974000
CFCCRT   EQU   CFCAUDIT+1                                               02975000
ISTZCRR  EQU   0                                                        02976000
ZCRCRR   EQU   ISTZCRR                                                  02977000
ZCRFLGS1 EQU   ISTZCRR+12                                               02978000
ZCRFLGS2 EQU   ISTZCRR+13                                               02979000
ZCRSWFLD EQU   ISTZCRR+14                                               02980000
ZCRENDSH EQU   ZCRSWFLD                                                 02981000
ZCRNDLCP EQU   ZCRSWFLD                                                 02982000
ZCRRESET EQU   ZCRSWFLD                                                 02983000
ZCRFLGS3 EQU   ISTZCRR+15                                               02984000
ZCRGENSW EQU   ISTZCRR+16                                               02985000
ZCRPFLGS EQU   ISTZCRR+17                                               02986000
ZCRIBPR  EQU   ISTZCRR+18                                               02987000
ZCRSCPSW EQU   ISTZCRR+19                                               02988000
ZCRPARMS EQU   ISTZCRR+24                                               02989000
ZCRFBPTR EQU   ZCRPARMS                                                 02990000
ZCRDFRDA EQU   ZCRPARMS+10                                              02991000
ZCRPCOD1 EQU   ZCRPARMS+12                                              02992000
ZCRPLSBF EQU   ZCRPCOD1                                                 02993000
ZCRPCOD2 EQU   ZCRPARMS+13                                              02994000
ZCRSVRTN EQU   ISTZCRR+56                                               02995000
ZCRWKARA EQU   ISTZCRR+156                                              02996000
ZCRCIDSV EQU   ISTZCRR+192                                              02997000
ZCRAUDIT EQU   ISTZCRR+440                                              02998000
ZCRENTER EQU   ZCRAUDIT+5                                               02999000
ZCRLCPB  EQU   ISTZCRR+480                                              03000000
ZCRRHRU  EQU   ZCRLCPB                                                  03001000
ISTASCRR EQU   0                                                        03002000
ASCFLAGS EQU   ISTASCRR+16                                              03003000
ASCFLG1  EQU   ASCFLAGS                                                 03004000
ASCFLG2  EQU   ASCFLAGS+2                                               03005000
ASCFLG3  EQU   ASCFLAGS+4                                               03006000
ASCUSRGS EQU   ISTASCRR+28                                              03007000
ISTAPCRR EQU   0                                                        03008000
APCATFLG EQU   ISTAPCRR+16                                              03009000
APCRFLG  EQU   ISTAPCRR+18                                              03010000
APCSAVE  EQU   ISTAPCRR+44                                              03011000
APCCOMF  EQU   ISTAPCRR+116                                             03012000
APCCOMF1 EQU   APCCOMF                                                  03013000
APC31FLG EQU   ISTAPCRR+132                                             03014000
APC52FLG EQU   ISTAPCRR+133                                             03015000
APC53FLG EQU   ISTAPCRR+134                                             03016000
APC54FLG EQU   ISTAPCRR+135                                             03017000
APC57FLG EQU   ISTAPCRR+136                                             03018000
ISTCRA   EQU   0                                                        03019000
CRABASIC EQU   ISTCRA                                                   03020000
CRAHDR   EQU   CRABASIC                                                 03021000
CRACRR   EQU   CRAHDR                                                   03022000
CRALKACT EQU   CRABASIC+8                                               03023000
CRASVC   EQU   ISTCRA+848                                               03024000
CRABUFA  EQU   CRASVC+68                                                03025000
ISTCNSTA EQU   0                                                        03026000
CNSTFLDA EQU   ISTCNSTA+16                                              03027000
CNSTFLDB EQU   ISTCNSTA+19                                              03028000
ISTVYCRR EQU   0                                                        03029000
VYCAUDIT EQU   ISTVYCRR+22                                              03030000
VYCNTRD  EQU   VYCAUDIT                                                 03031000
NINCSM   EQU   VYCNTRD+1                                                03032000
VYCCRT   EQU   VYCAUDIT+12                                              03033000
CINCSM   EQU   VYCCRT+1                                                 03034000
ISTSDCCF EQU   0                                                        03035000
ISTSDCCR EQU   0                                                        03036000
FMZL0024 EQU   0                                                        03037000
ISTSDCCA EQU   0                                                        03038000
ISTSDCCD EQU   0                                                        03039000
ISTSDCCN EQU   0                                                        03040000
FSBCOMBN EQU   FSBNETRS                                                 03041000
FSBRHFLD EQU   FSBCOMBN+1                                               03042000
FSBRH3   EQU   FSBRHFLD+2                                               03043000
FSBLDFLG EQU   FSBRH3                                                   03044000
@NM00009 EQU   FSBRQTAG                                                 03045000
ISTSENRU EQU   RUDATA                                                   03046000
SRUSENSE EQU   ISTSENRU                                                 03047000
SRUSENS1 EQU   SRUSENSE                                                 03048000
SRUSENS2 EQU   SRUSENSE+2                                               03049000
ISTSRU   EQU   ISTRUB                                                   03050000
SRUDATA  EQU   ISTSRU+1                                                 03051000
SRUTYPE  EQU   SRUDATA                                                  03052000
SRULDID  EQU   SRUDATA+1                                                03053000
SRUSPSN  EQU   SRULDID                                                  03054000
ISTNSRU  EQU   ISTRUB                                                   03055000
NSRUNETS EQU   ISTNSRU                                                  03056000
NSRUID   EQU   NSRUNETS                                                 03057000
NSRUSUB  EQU   NSRUNETS+1                                               03058000
NSRURCD  EQU   NSRUNETS+2                                               03059000
NSRUDATA EQU   ISTNSRU+3                                                03060000
NSRUHOOK EQU   NSRUDATA                                                 03061000
NSSSVRU  EQU   NSRUDATA                                                 03062000
NSSSVNOD EQU   NSSSVRU+3                                                03063000
NSSSVT3  EQU   NSSSVNOD                                                 03064000
NSSSVT3C EQU   NSSSVT3+2                                                03065000
NSSSVT3G EQU   NSSSVT3+5                                                03066000
NSSSVT4  EQU   NSSSVNOD                                                 03067000
NSSSVT5  EQU   NSSSVNOD                                                 03068000
NSRUDAT1 EQU   NSRUDATA                                                 03069000
NSRUDAT2 EQU   NSRUDAT1+2                                               03070000
ISTTRRU  EQU   NSRUDAT2                                                 03071000
TRRTYPE  EQU   ISTTRRU                                                  03072000
ISTCTDRU EQU   NSRUDAT2                                                 03073000
ISTINORU EQU   NSRUDAT2                                                 03074000
SRUDAT1  EQU   SRUDATA                                                  03075000
SRUDAT1L EQU   SRUDAT1+1                                                03076000
SRUDAT2  EQU   SRUDATA                                                  03077000
ISTMRU   EQU   ISTRUB                                                   03078000
SRUDATA3 EQU   SRUDATA                                                  03079000
SRUDATA4 EQU   SRUDATA                                                  03080000
NSRUDAT3 EQU   NSRUDAT2                                                 03081000
NSRUDAT4 EQU   NSRUDAT2                                                 03082000
NSRUDAT5 EQU   NSRUDAT2                                                 03083000
NSRUDAT6 EQU   NSRUDAT2                                                 03084000
NSRUDAT7 EQU   NSRUDAT2                                                 03085000
NSRUDIL  EQU   NSRUDAT2                                                 03086000
NSRUDILB EQU   NSRUDIL+1                                                03087000
NSRUNA   EQU   NSRUDAT2                                                 03088000
NSRUNA2  EQU   NSRUNA+1                                                 03089000
NSRUCLSP EQU   NSRUDAT2                                                 03090000
NSRUOH1  EQU   NSRUDAT2                                                 03091000
NSRUDAT8 EQU   NSRUDATA                                                 03092000
ISTUNBRU EQU   SRUTYPE                                                  03093000
LCPZTIE  EQU   LCPCID                                                   03094000
LCPZSNAM EQU   LCPZTIE+8                                                03095000
CMZCIDM  EQU   ATCCIDM                                                  03096000
RTRDNCBA EQU   ISTRTR+40                                                03097000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03098000
LCPZTRV4 EQU   LCPZSNAM+4                                               03099000
LCPZTRV1 EQU   LCPZSNAM                                                 03100000
LCPZSNA  EQU   LCPZTIE+4                                                03101000
LCPZFMCA EQU   LCPZTIE                                                  03102000
UNBTYPE  EQU   ISTUNBRU                                                 03103000
NSRUDA8T EQU   NSRUDAT8                                                 03104000
NSRUOHID EQU   NSRUOH1                                                  03105000
NSRULSV  EQU   NSRUCLSP                                                 03106000
NSRUNA4  EQU   NSRUNA+2                                                 03107000
NSRUNA3  EQU   NSRUNA2                                                  03108000
NSRUNA1  EQU   NSRUNA                                                   03109000
NSRUDILF EQU   NSRUDIL+4                                                03110000
NSRUDILE EQU   NSRUDIL+3                                                03111000
NSRUDILD EQU   NSRUDIL+2                                                03112000
NSRUDILC EQU   NSRUDILB                                                 03113000
@NM00032 EQU   NSRUDILB                                                 03114000
NSRUDILA EQU   NSRUDIL                                                  03115000
NSRUDA7T EQU   NSRUDAT7                                                 03116000
NSRUDA6L EQU   NSRUDAT6+4                                               03117000
NSRUDA6S EQU   NSRUDAT6                                                 03118000
NSRUDA5E EQU   NSRUDAT5                                                 03119000
NSRUDA4T EQU   NSRUDAT4                                                 03120000
NSRUDA3S EQU   NSRUDAT3                                                 03121000
SRUDAT4D EQU   SRUDATA4                                                 03122000
SRUDAT3I EQU   SRUDATA3                                                 03123000
MRUDATA  EQU   ISTMRU+9                                                 03124000
MRURESP  EQU   ISTMRU+7                                                 03125000
MRUMODIF EQU   ISTMRU+6                                                 03126000
MRUCMND  EQU   ISTMRU+5                                                 03127000
MRUDAF   EQU   ISTMRU+3                                                 03128000
MRUREQ   EQU   ISTMRU+2                                                 03129000
MRUPREF  EQU   ISTMRU                                                   03130000
SRUDAT2N EQU   SRUDAT2+1                                                03131000
SRUDAT2T EQU   SRUDAT2                                                  03132000
SRUDAT1I EQU   SRUDAT1+2                                                03133000
SRUTSPRO EQU   SRUDAT1L                                                 03134000
SRUFMPRO EQU   SRUDAT1L                                                 03135000
SRUDAT1T EQU   SRUDAT1                                                  03136000
INORUET  EQU   ISTINORU                                                 03137000
CTDRUSTA EQU   ISTCTDRU                                                 03138000
TRRDATA  EQU   ISTTRRU+4                                                03139000
TRRSTAT  EQU   ISTTRRU+3                                                03140000
TRRPEP   EQU   ISTTRRU+2                                                03141000
TRRTIME  EQU   ISTTRRU+1                                                03142000
@NM00031 EQU   TRRTYPE                                                  03143000
TRRFMT2  EQU   TRRTYPE                                                  03144000
@NM00030 EQU   TRRTYPE                                                  03145000
NSRUDAF  EQU   NSRUDAT1                                                 03146000
NSSSVT5A EQU   NSSSVT5                                                  03147000
NSSSVT4D EQU   NSSSVT4+3                                                03148000
NSSSVT4C EQU   NSSSVT4+2                                                03149000
NSSSVT4B EQU   NSSSVT4+1                                                03150000
NSSSVT4A EQU   NSSSVT4                                                  03151000
NSSSVT3K EQU   NSSSVT3+8                                                03152000
NSSSVT3J EQU   NSSSVT3+7                                                03153000
NSSSVT3I EQU   NSSSVT3+6                                                03154000
@NM00029 EQU   NSSSVT3G                                                 03155000
NSSSVT3H EQU   NSSSVT3G                                                 03156000
NSSSVT3F EQU   NSSSVT3+4                                                03157000
NSSSVT3E EQU   NSSSVT3+3                                                03158000
@NM00028 EQU   NSSSVT3C                                                 03159000
NSSSVT3D EQU   NSSSVT3C                                                 03160000
NSSSVT3B EQU   NSSSVT3+1                                                03161000
NSSSVT3A EQU   NSSSVT3                                                  03162000
NSSSVT   EQU   NSSSVRU+2                                                03163000
NSSSVDAF EQU   NSSSVRU                                                  03164000
NSRUHKTY EQU   NSRUHOOK                                                 03165000
SRURSV01 EQU   SRULDID+4                                                03166000
SRUPSSN  EQU   SRULDID+2                                                03167000
SRUDFCLV EQU   SRUSPSN                                                  03168000
@NM00027 EQU   SRUTYPE                                                  03169000
SRUPSAC  EQU   SRUTYPE                                                  03170000
SRUSPAC  EQU   SRUTYPE                                                  03171000
SRUQSREQ EQU   ISTSRU                                                   03172000
SENRU    EQU   ISTSENRU+4                                               03173000
SRUSNS4  EQU   SRUSENS2+1                                               03174000
SRUSNS3  EQU   SRUSENS2                                                 03175000
SRUSNST  EQU   SRUSENS1+1                                               03176000
SRUSNS1  EQU   SRUSENS1                                                 03177000
FSBRT0B  EQU   @NM00009+1                                               03178000
FSBRT0A  EQU   @NM00009+1                                               03179000
FSBRT09  EQU   @NM00009+1                                               03180000
FSBRT08  EQU   @NM00009+1                                               03181000
FSBRT07  EQU   @NM00009                                                 03182000
FSBRT06  EQU   @NM00009                                                 03183000
FSBRT05  EQU   @NM00009                                                 03184000
FSBRT04  EQU   @NM00009                                                 03185000
FSBRT03  EQU   @NM00009                                                 03186000
FSBRT02  EQU   @NM00009                                                 03187000
FSBRT01  EQU   @NM00009                                                 03188000
FSBRT00  EQU   @NM00009                                                 03189000
FSBLDCUF EQU   FSBLDFLG                                                 03190000
FSBLDSIF EQU   FSBLDFLG                                                 03191000
FSBLDSOF EQU   FSBLDFLG                                                 03192000
FSBLDEBF EQU   FSBLDFLG                                                 03193000
FSBLDBBF EQU   FSBLDFLG                                                 03194000
FSBLDFME EQU   FSBLDFLG                                                 03195000
FSBLDSCF EQU   FSBLDFLG                                                 03196000
FSBLDRMF EQU   FSBLDFLG                                                 03197000
FSBRH2   EQU   FSBRHFLD+1                                               03198000
FSBRH1   EQU   FSBRHFLD                                                 03199000
FSBALIGN EQU   FSBCOMBN                                                 03200000
VYCRSV02 EQU   ISTVYCRR+128                                             03201000
VYCRSV04 EQU   ISTVYCRR+126                                             03202000
VYCRRCW3 EQU   ISTVYCRR+118                                             03203000
VYCRRSAV EQU   ISTVYCRR+46                                              03204000
VYCRSV03 EQU   VYCCRT+11                                                03205000
CINCFE   EQU   VYCCRT+11                                                03206000
CINCE9   EQU   VYCCRT+11                                                03207000
CINCVO   EQU   VYCCRT+11                                                03208000
CINCR5   EQU   VYCCRT+11                                                03209000
CINCR3   EQU   VYCCRT+10                                                03210000
CINCE8   EQU   VYCCRT+10                                                03211000
CINCE7   EQU   VYCCRT+10                                                03212000
CINCE6   EQU   VYCCRT+10                                                03213000
CINCE5   EQU   VYCCRT+10                                                03214000
CINCE1   EQU   VYCCRT+10                                                03215000
CINCUQ   EQU   VYCCRT+10                                                03216000
CINCUB   EQU   VYCCRT+10                                                03217000
CINCUA   EQU   VYCCRT+9                                                 03218000
CINCX9   EQU   VYCCRT+9                                                 03219000
CINCX8   EQU   VYCCRT+9                                                 03220000
CINCX7   EQU   VYCCRT+9                                                 03221000
CINCX6   EQU   VYCCRT+9                                                 03222000
CINCX3   EQU   VYCCRT+9                                                 03223000
CINCX2   EQU   VYCCRT+9                                                 03224000
CINCX1   EQU   VYCCRT+9                                                 03225000
CINCX0   EQU   VYCCRT+8                                                 03226000
CINCW9   EQU   VYCCRT+8                                                 03227000
CINCW8   EQU   VYCCRT+8                                                 03228000
CINCW7   EQU   VYCCRT+8                                                 03229000
CINCW6   EQU   VYCCRT+8                                                 03230000
CINCW5   EQU   VYCCRT+8                                                 03231000
CINCW4   EQU   VYCCRT+8                                                 03232000
CINCW2   EQU   VYCCRT+8                                                 03233000
CINCW0   EQU   VYCCRT+7                                                 03234000
CINCV9   EQU   VYCCRT+7                                                 03235000
CINCV8   EQU   VYCCRT+7                                                 03236000
CINCV7   EQU   VYCCRT+7                                                 03237000
CINCV6   EQU   VYCCRT+7                                                 03238000
CINCV5   EQU   VYCCRT+7                                                 03239000
CINCV4   EQU   VYCCRT+7                                                 03240000
CINCV3   EQU   VYCCRT+7                                                 03241000
CINCV2   EQU   VYCCRT+6                                                 03242000
CINCU8   EQU   VYCCRT+6                                                 03243000
CINCU7   EQU   VYCCRT+6                                                 03244000
CINCU6   EQU   VYCCRT+6                                                 03245000
CINCU5   EQU   VYCCRT+6                                                 03246000
CINCU4   EQU   VYCCRT+6                                                 03247000
CINCU3   EQU   VYCCRT+6                                                 03248000
CINCU2   EQU   VYCCRT+6                                                 03249000
CINCU1   EQU   VYCCRT+5                                                 03250000
CINCU0   EQU   VYCCRT+5                                                 03251000
CINCUM   EQU   VYCCRT+5                                                 03252000
CINCS1   EQU   VYCCRT+5                                                 03253000
CINCL8   EQU   VYCCRT+5                                                 03254000
CINCL7   EQU   VYCCRT+5                                                 03255000
CINCL6   EQU   VYCCRT+5                                                 03256000
CINCL5   EQU   VYCCRT+5                                                 03257000
CINCL4   EQU   VYCCRT+4                                                 03258000
CINCL3   EQU   VYCCRT+4                                                 03259000
CINCL2   EQU   VYCCRT+4                                                 03260000
CINCL1   EQU   VYCCRT+4                                                 03261000
CINCL0   EQU   VYCCRT+4                                                 03262000
CINCF4   EQU   VYCCRT+4                                                 03263000
CINCF3   EQU   VYCCRT+4                                                 03264000
CINCF1   EQU   VYCCRT+4                                                 03265000
CINCFM   EQU   VYCCRT+3                                                 03266000
CINCE4   EQU   VYCCRT+3                                                 03267000
CINCE3   EQU   VYCCRT+3                                                 03268000
CINCE2   EQU   VYCCRT+3                                                 03269000
CINCE0   EQU   VYCCRT+3                                                 03270000
CINCD9   EQU   VYCCRT+3                                                 03271000
CINCD8   EQU   VYCCRT+3                                                 03272000
CINCD7   EQU   VYCCRT+3                                                 03273000
CINCD6   EQU   VYCCRT+2                                                 03274000
CINCD5   EQU   VYCCRT+2                                                 03275000
CINCD4   EQU   VYCCRT+2                                                 03276000
CINCD3   EQU   VYCCRT+2                                                 03277000
CINCD2   EQU   VYCCRT+2                                                 03278000
CINCD1   EQU   VYCCRT+2                                                 03279000
CINCIP   EQU   VYCCRT+2                                                 03280000
CINCR2   EQU   VYCCRT+2                                                 03281000
CINCMS   EQU   VYCCRT+1                                                 03282000
CINCVN   EQU   VYCCRT+1                                                 03283000
CINCVS   EQU   VYCCRT+1                                                 03284000
CINCVP   EQU   VYCCRT+1                                                 03285000
CINCVX   EQU   VYCCRT+1                                                 03286000
CINCFS   EQU   VYCCRT+1                                                 03287000
CINCR1   EQU   VYCCRT+1                                                 03288000
CINCLF   EQU   VYCCRT                                                   03289000
CINCVA   EQU   VYCCRT                                                   03290000
CINCVI   EQU   VYCCRT                                                   03291000
CINCMD   EQU   VYCCRT                                                   03292000
CINCMY   EQU   VYCCRT                                                   03293000
CINCDL   EQU   VYCCRT                                                   03294000
CINCIO   EQU   VYCCRT                                                   03295000
CINCCL   EQU   VYCCRT                                                   03296000
VYCRSV01 EQU   VYCNTRD+11                                               03297000
NINCFE   EQU   VYCNTRD+11                                               03298000
NINCE9   EQU   VYCNTRD+11                                               03299000
NINCVO   EQU   VYCNTRD+11                                               03300000
NINCR5   EQU   VYCNTRD+11                                               03301000
NINCR3   EQU   VYCNTRD+10                                               03302000
NINCE8   EQU   VYCNTRD+10                                               03303000
NINCE7   EQU   VYCNTRD+10                                               03304000
NINCE6   EQU   VYCNTRD+10                                               03305000
NINCE5   EQU   VYCNTRD+10                                               03306000
NINCE1   EQU   VYCNTRD+10                                               03307000
NINCUQ   EQU   VYCNTRD+10                                               03308000
NINCUB   EQU   VYCNTRD+10                                               03309000
NINCUA   EQU   VYCNTRD+9                                                03310000
NINCX9   EQU   VYCNTRD+9                                                03311000
NINCX8   EQU   VYCNTRD+9                                                03312000
NINCX7   EQU   VYCNTRD+9                                                03313000
NINCX6   EQU   VYCNTRD+9                                                03314000
NINCX3   EQU   VYCNTRD+9                                                03315000
NINCX2   EQU   VYCNTRD+9                                                03316000
NINCX1   EQU   VYCNTRD+9                                                03317000
NINCX0   EQU   VYCNTRD+8                                                03318000
NINCW9   EQU   VYCNTRD+8                                                03319000
NINCW8   EQU   VYCNTRD+8                                                03320000
NINCW7   EQU   VYCNTRD+8                                                03321000
NINCW6   EQU   VYCNTRD+8                                                03322000
NINCW5   EQU   VYCNTRD+8                                                03323000
NINCW4   EQU   VYCNTRD+8                                                03324000
NINCW2   EQU   VYCNTRD+8                                                03325000
NINCW0   EQU   VYCNTRD+7                                                03326000
NINCV9   EQU   VYCNTRD+7                                                03327000
NINCV8   EQU   VYCNTRD+7                                                03328000
NINCV7   EQU   VYCNTRD+7                                                03329000
NINCV6   EQU   VYCNTRD+7                                                03330000
NINCV5   EQU   VYCNTRD+7                                                03331000
NINCV4   EQU   VYCNTRD+7                                                03332000
NINCV3   EQU   VYCNTRD+7                                                03333000
NINCV2   EQU   VYCNTRD+6                                                03334000
NINCU8   EQU   VYCNTRD+6                                                03335000
NINCU7   EQU   VYCNTRD+6                                                03336000
NINCU6   EQU   VYCNTRD+6                                                03337000
NINCU5   EQU   VYCNTRD+6                                                03338000
NINCU4   EQU   VYCNTRD+6                                                03339000
NINCU3   EQU   VYCNTRD+6                                                03340000
NINCU2   EQU   VYCNTRD+6                                                03341000
NINCU1   EQU   VYCNTRD+5                                                03342000
NINCU0   EQU   VYCNTRD+5                                                03343000
NINCUM   EQU   VYCNTRD+5                                                03344000
NINCS1   EQU   VYCNTRD+5                                                03345000
NINCL8   EQU   VYCNTRD+5                                                03346000
NINCL7   EQU   VYCNTRD+5                                                03347000
NINCL6   EQU   VYCNTRD+5                                                03348000
NINCL5   EQU   VYCNTRD+5                                                03349000
NINCL4   EQU   VYCNTRD+4                                                03350000
NINCL3   EQU   VYCNTRD+4                                                03351000
NINCL2   EQU   VYCNTRD+4                                                03352000
NINCL1   EQU   VYCNTRD+4                                                03353000
NINCL0   EQU   VYCNTRD+4                                                03354000
NINCF4   EQU   VYCNTRD+4                                                03355000
NINCF3   EQU   VYCNTRD+4                                                03356000
NINCF1   EQU   VYCNTRD+4                                                03357000
NINCFM   EQU   VYCNTRD+3                                                03358000
NINCE4   EQU   VYCNTRD+3                                                03359000
NINCE3   EQU   VYCNTRD+3                                                03360000
NINCE2   EQU   VYCNTRD+3                                                03361000
NINCE0   EQU   VYCNTRD+3                                                03362000
NINCD9   EQU   VYCNTRD+3                                                03363000
NINCD8   EQU   VYCNTRD+3                                                03364000
NINCD7   EQU   VYCNTRD+3                                                03365000
NINCD6   EQU   VYCNTRD+2                                                03366000
NINCD5   EQU   VYCNTRD+2                                                03367000
NINCD4   EQU   VYCNTRD+2                                                03368000
NINCD3   EQU   VYCNTRD+2                                                03369000
NINCD2   EQU   VYCNTRD+2                                                03370000
NINCD1   EQU   VYCNTRD+2                                                03371000
NINCIP   EQU   VYCNTRD+2                                                03372000
NINCR2   EQU   VYCNTRD+2                                                03373000
NINCMS   EQU   VYCNTRD+1                                                03374000
NINCVN   EQU   VYCNTRD+1                                                03375000
NINCVS   EQU   VYCNTRD+1                                                03376000
NINCVP   EQU   VYCNTRD+1                                                03377000
NINCVX   EQU   VYCNTRD+1                                                03378000
NINCFS   EQU   VYCNTRD+1                                                03379000
NINCR1   EQU   VYCNTRD+1                                                03380000
NINCLF   EQU   VYCNTRD                                                  03381000
NINCVA   EQU   VYCNTRD                                                  03382000
NINCVI   EQU   VYCNTRD                                                  03383000
NINCMD   EQU   VYCNTRD                                                  03384000
NINCMY   EQU   VYCNTRD                                                  03385000
NINCDL   EQU   VYCNTRD                                                  03386000
NINCIO   EQU   VYCNTRD                                                  03387000
NINCCL   EQU   VYCNTRD                                                  03388000
VYCCNS   EQU   ISTVYCRR                                                 03389000
CNSRSV05 EQU   CNSTFLDB+2                                               03390000
CNSLOG0B EQU   CNSTFLDB+2                                               03391000
CNSACCTB EQU   CNSTFLDB+2                                               03392000
CNSFREEB EQU   CNSTFLDB+2                                               03393000
CNSGETSB EQU   CNSTFLDB+2                                               03394000
CNSSEARB EQU   CNSTFLDB+2                                               03395000
CNSQUEUB EQU   CNSTFLDB+2                                               03396000
CNSACONB EQU   CNSTFLDB+2                                               03397000
CNSTCONB EQU   CNSTFLDB+1                                               03398000
CNSCLAQB EQU   CNSTFLDB+1                                               03399000
CNSCLINB EQU   CNSTFLDB+1                                               03400000
CNSGBINB EQU   CNSTFLDB+1                                               03401000
CNSLGINB EQU   CNSTFLDB+1                                               03402000
CNSACINB EQU   CNSTFLDB+1                                               03403000
CNSPSINB EQU   CNSTFLDB+1                                               03404000
CNSRQRLB EQU   CNSTFLDB+1                                               03405000
CNSTRRLB EQU   CNSTFLDB                                                 03406000
CNSDORLB EQU   CNSTFLDB                                                 03407000
CNSRLINB EQU   CNSTFLDB                                                 03408000
CNSQREQB EQU   CNSTFLDB                                                 03409000
CNSXREQB EQU   CNSTFLDB                                                 03410000
CNSAQINB EQU   CNSTFLDB                                                 03411000
CNSAUTHB EQU   CNSTFLDB                                                 03412000
CNSMRINB EQU   CNSTFLDB                                                 03413000
CNSRSV01 EQU   CNSTFLDA+2                                               03414000
CNSLOG0A EQU   CNSTFLDA+2                                               03415000
CNSACCTA EQU   CNSTFLDA+2                                               03416000
CNSFREEA EQU   CNSTFLDA+2                                               03417000
CNSGETSA EQU   CNSTFLDA+2                                               03418000
CNSSEARA EQU   CNSTFLDA+2                                               03419000
CNSQUEUA EQU   CNSTFLDA+2                                               03420000
CNSACONA EQU   CNSTFLDA+2                                               03421000
CNSTCONA EQU   CNSTFLDA+1                                               03422000
CNSCLAQA EQU   CNSTFLDA+1                                               03423000
CNSCLINA EQU   CNSTFLDA+1                                               03424000
CNSGBINA EQU   CNSTFLDA+1                                               03425000
CNSLGINA EQU   CNSTFLDA+1                                               03426000
CNSACINA EQU   CNSTFLDA+1                                               03427000
CNSPSINA EQU   CNSTFLDA+1                                               03428000
CNSRQRLA EQU   CNSTFLDA+1                                               03429000
CNSTRRLA EQU   CNSTFLDA                                                 03430000
CNSDORLA EQU   CNSTFLDA                                                 03431000
CNSRLINA EQU   CNSTFLDA                                                 03432000
CNSQREQA EQU   CNSTFLDA                                                 03433000
CNSXREQA EQU   CNSTFLDA                                                 03434000
CNSAQINA EQU   CNSTFLDA                                                 03435000
CNSAUTHA EQU   CNSTFLDA                                                 03436000
CNSMRINA EQU   CNSTFLDA                                                 03437000
CNSTPFX  EQU   ISTCNSTA                                                 03438000
CRACHAIN EQU   ISTCRA+928                                               03439000
CRARSV02 EQU   ISTCRA+924                                               03440000
CRARSV01 EQU   ISTCRA+920                                               03441000
CRABFTBA EQU   CRABUFA                                                  03442000
CRAMASK  EQU   CRASVC+64                                                03443000
CRAHSIZ  EQU   CRASVC+60                                                03444000
CRAASCRR EQU   CRASVC                                                   03445000
CRAPROCR EQU   ISTCRA+312                                               03446000
CRAPSS   EQU   ISTCRA+160                                               03447000
CRARPH   EQU   ISTCRA+52                                                03448000
CRALAPTR EQU   CRABASIC+48                                              03449000
CRAL9PTR EQU   CRABASIC+44                                              03450000
CRAL8PTR EQU   CRABASIC+40                                              03451000
CRAL7PTR EQU   CRABASIC+36                                              03452000
CRAL6PTR EQU   CRABASIC+32                                              03453000
CRAL5PTR EQU   CRABASIC+28                                              03454000
CRAL4PTR EQU   CRABASIC+24                                              03455000
CRAL3PTR EQU   CRABASIC+20                                              03456000
CRAL2PTR EQU   CRABASIC+16                                              03457000
CRAL1PTR EQU   CRABASIC+12                                              03458000
CRALEV01 EQU   CRALKACT+3                                               03459000
CRALEV02 EQU   CRALKACT+3                                               03460000
CRALEV03 EQU   CRALKACT+3                                               03461000
CRALEV04 EQU   CRALKACT+3                                               03462000
CRALEV05 EQU   CRALKACT+3                                               03463000
CRALEV06 EQU   CRALKACT+3                                               03464000
CRALEV07 EQU   CRALKACT+3                                               03465000
CRALEV08 EQU   CRALKACT+3                                               03466000
CRALEV09 EQU   CRALKACT+2                                               03467000
CRALEV10 EQU   CRALKACT+2                                               03468000
CRALEV11 EQU   CRALKACT+2                                               03469000
CRALEV12 EQU   CRALKACT+2                                               03470000
CRALEV13 EQU   CRALKACT+2                                               03471000
CRALEV14 EQU   CRALKACT+2                                               03472000
CRALEV15 EQU   CRALKACT+2                                               03473000
CRALEV16 EQU   CRALKACT+2                                               03474000
CRALEV17 EQU   CRALKACT+1                                               03475000
CRALEV18 EQU   CRALKACT+1                                               03476000
CRALEV19 EQU   CRALKACT+1                                               03477000
CRALEV20 EQU   CRALKACT+1                                               03478000
CRALEV21 EQU   CRALKACT+1                                               03479000
CRALEV22 EQU   CRALKACT+1                                               03480000
CRALEV23 EQU   CRALKACT+1                                               03481000
CRALEV24 EQU   CRALKACT+1                                               03482000
CRALEV25 EQU   CRALKACT                                                 03483000
CRALEV26 EQU   CRALKACT                                                 03484000
CRALEV27 EQU   CRALKACT                                                 03485000
CRALEV28 EQU   CRALKACT                                                 03486000
CRALEV29 EQU   CRALKACT                                                 03487000
CRALEV30 EQU   CRALKACT                                                 03488000
CRALEV31 EQU   CRALKACT                                                 03489000
CRALEV32 EQU   CRALKACT                                                 03490000
CRAFRR   EQU   CRAHDR+4                                                 03491000
@NM00061 EQU   ISTAPCRR+137                                             03492000
@NM00060 EQU   APC57FLG                                                 03493000
APCNREL  EQU   APC57FLG                                                 03494000
APCRECRA EQU   APC57FLG                                                 03495000
@NM00059 EQU   APC54FLG                                                 03496000
APCRLST  EQU   APC54FLG                                                 03497000
APCPR153 EQU   APC53FLG                                                 03498000
@NM00058 EQU   APC52FLG                                                 03499000
APCWKF   EQU   APC52FLG                                                 03500000
APCNWF   EQU   APC52FLG                                                 03501000
APCRDQ   EQU   APC52FLG                                                 03502000
APCQENQ  EQU   APC52FLG                                                 03503000
APCSMSR  EQU   APC52FLG                                                 03504000
APCCKRQ  EQU   APC52FLG                                                 03505000
@NM00057 EQU   APC31FLG                                                 03506000
APCSORT  EQU   APC31FLG                                                 03507000
APCRESCH EQU   APC31FLG                                                 03508000
APCTPXIT EQU   APC31FLG                                                 03509000
APCSWTWD EQU   ISTAPCRR+128                                             03510000
APCSAV2  EQU   ISTAPCRR+124                                             03511000
APCSAV1  EQU   ISTAPCRR+120                                             03512000
APCRETCD EQU   APCCOMF+2                                                03513000
@NM00056 EQU   APCCOMF1+1                                               03514000
APCZLBER EQU   APCCOMF1                                                 03515000
APCEXIT  EQU   APCCOMF1                                                 03516000
APCRELR  EQU   APCCOMF1                                                 03517000
APCIRB2  EQU   APCCOMF1                                                 03518000
APCIRB1  EQU   APCCOMF1                                                 03519000
APCSMCR  EQU   APCCOMF1                                                 03520000
APCUETSK EQU   APCCOMF1                                                 03521000
APCSSTSK EQU   APCCOMF1                                                 03522000
APCESTAL EQU   APCSAVE                                                  03523000
APCFRRPM EQU   ISTAPCRR+40                                              03524000
APCQWFO  EQU   ISTAPCRR+36                                              03525000
APCPABSV EQU   ISTAPCRR+32                                              03526000
APCRTRN  EQU   ISTAPCRR+28                                              03527000
APCTCBA  EQU   ISTAPCRR+24                                              03528000
APCPSTA  EQU   ISTAPCRR+20                                              03529000
@NM00055 EQU   APCRFLG+1                                                03530000
APC31R   EQU   APCRFLG                                                  03531000
APC58R   EQU   APCRFLG                                                  03532000
APC57R   EQU   APCRFLG                                                  03533000
APC56R   EQU   APCRFLG                                                  03534000
APC54R   EQU   APCRFLG                                                  03535000
APC53R   EQU   APCRFLG                                                  03536000
APC52R   EQU   APCRFLG                                                  03537000
APC51R   EQU   APCRFLG                                                  03538000
@NM00054 EQU   APCATFLG+1                                               03539000
APC31E   EQU   APCATFLG                                                 03540000
APC58E   EQU   APCATFLG                                                 03541000
APC57E   EQU   APCATFLG                                                 03542000
APC56E   EQU   APCATFLG                                                 03543000
APC54E   EQU   APCATFLG                                                 03544000
APC53E   EQU   APCATFLG                                                 03545000
APC52E   EQU   APCATFLG                                                 03546000
APC51E   EQU   APCATFLG                                                 03547000
APCHDRSV EQU   ISTAPCRR                                                 03548000
ASCPSREG EQU   ISTASCRR+44                                              03549000
ASCUSR01 EQU   ASCUSRGS+12                                              03550000
ASCUSR00 EQU   ASCUSRGS+8                                               03551000
ASCUSR15 EQU   ASCUSRGS+4                                               03552000
ASCUSR14 EQU   ASCUSRGS                                                 03553000
ASCETRYA EQU   ISTASCRR+24                                              03554000
ASCKEY   EQU   ISTASCRR+23                                              03555000
ASCAUDIT EQU   ASCFLG3                                                  03556000
ASCFBDUD EQU   ASCFLG3                                                  03557000
ASCLLKF  EQU   ASCFLG3                                                  03558000
ASCKEYF  EQU   ASCFLG3                                                  03559000
ASCFBDAL EQU   ASCFLG3                                                  03560000
ASCFSRGT EQU   ASCFLG3                                                  03561000
ASCICR   EQU   ASCFLG2                                                  03562000
ASCFSRIC EQU   ASCFLG2                                                  03563000
ASCFBDIC EQU   ASCFLG2                                                  03564000
ASCFBAIC EQU   ASCFLG2                                                  03565000
ASCPASTR EQU   ASCFLG1                                                  03566000
ASCFSR   EQU   ASCFLG1                                                  03567000
ASCFBD   EQU   ASCFLG1                                                  03568000
ASCFBA   EQU   ASCFLG1                                                  03569000
ASCPFCRR EQU   ISTASCRR                                                 03570000
ZCRRU    EQU   ZCRRHRU+3                                                03571000
ZCRRH    EQU   ZCRRHRU                                                  03572000
ZCRWORDA EQU   ISTZCRR+477                                              03573000
ZCRCMNRC EQU   ISTZCRR+476                                              03574000
ZCRRSV97 EQU   ZCRENTER+18                                              03575000
ZCREIC2B EQU   ZCRENTER+18                                              03576000
ZCREAC2B EQU   ZCRENTER+18                                              03577000
ZCRELCAB EQU   ZCRENTER+18                                              03578000
ZCREDCMF EQU   ZCRENTER+18                                              03579000
ZCREBCIF EQU   ZCRENTER+18                                              03580000
ZCREICSG EQU   ZCRENTER+18                                              03581000
ZCREDCK0 EQU   ZCRENTER+18                                              03582000
ZCRECFY0 EQU   ZCRENTER+17                                              03583000
ZCREKCCB EQU   ZCRENTER+17                                              03584000
ZCREDCNB EQU   ZCRENTER+17                                              03585000
ZCREICOE EQU   ZCRENTER+17                                              03586000
ZCREBCNB EQU   ZCRENTER+17                                              03587000
ZCREBC0L EQU   ZCRENTER+17                                              03588000
ZCREBCAL EQU   ZCRENTER+17                                              03589000
ZCREDCQR EQU   ZCRENTER+17                                              03590000
ZCREDCPR EQU   ZCRENTER+16                                              03591000
ZCREBCSB EQU   ZCRENTER+16                                              03592000
ZCREAC1R EQU   ZCRENTER+16                                              03593000
ZCRECCCI EQU   ZCRENTER+16                                              03594000
ZCRECCAI EQU   ZCRENTER+16                                              03595000
ZCRECCBI EQU   ZCRENTER+16                                              03596000
ZCREBCAR EQU   ZCRENTER+16                                              03597000
ZCREBCDR EQU   ZCRENTER+16                                              03598000
ZCREBCBR EQU   ZCRENTER+15                                              03599000
ZCREDCXR EQU   ZCRENTER+15                                              03600000
ZCREDCWB EQU   ZCRENTER+15                                              03601000
ZCREDCWR EQU   ZCRENTER+15                                              03602000
ZCREKCCN EQU   ZCRENTER+15                                              03603000
ZCREKCBN EQU   ZCRENTER+15                                              03604000
ZCREKCBB EQU   ZCRENTER+15                                              03605000
ZCREJC0B EQU   ZCRENTER+15                                              03606000
ZCREJCDB EQU   ZCRENTER+14                                              03607000
ZCREJCCB EQU   ZCRENTER+14                                              03608000
ZCREJCBB EQU   ZCRENTER+14                                              03609000
ZCREJCAB EQU   ZCRENTER+14                                              03610000
ZCREIC1B EQU   ZCRENTER+14                                              03611000
ZCREIC0B EQU   ZCRENTER+14                                              03612000
ZCREICX0 EQU   ZCRENTER+14                                              03613000
ZCREICWB EQU   ZCRENTER+14                                              03614000
ZCREICVB EQU   ZCRENTER+13                                              03615000
ZCREICUB EQU   ZCRENTER+13                                              03616000
ZCREICTB EQU   ZCRENTER+13                                              03617000
ZCREICSC EQU   ZCRENTER+13                                              03618000
ZCREICSB EQU   ZCRENTER+13                                              03619000
ZCREICRB EQU   ZCRENTER+13                                              03620000
ZCREICQB EQU   ZCRENTER+13                                              03621000
ZCREICQA EQU   ZCRENTER+13                                              03622000
ZCREICOB EQU   ZCRENTER+12                                              03623000
ZCREICOA EQU   ZCRENTER+12                                              03624000
ZCREICNB EQU   ZCRENTER+12                                              03625000
ZCREICNA EQU   ZCRENTER+12                                              03626000
ZCREICMB EQU   ZCRENTER+12                                              03627000
ZCREICLB EQU   ZCRENTER+12                                              03628000
ZCREICKG EQU   ZCRENTER+12                                              03629000
ZCREICKE EQU   ZCRENTER+12                                              03630000
ZCREICKB EQU   ZCRENTER+11                                              03631000
ZCREICJB EQU   ZCRENTER+11                                              03632000
ZCREICID EQU   ZCRENTER+11                                              03633000
ZCREICIB EQU   ZCRENTER+11                                              03634000
ZCREICHB EQU   ZCRENTER+11                                              03635000
ZCREICGB EQU   ZCRENTER+11                                              03636000
ZCREICEB EQU   ZCRENTER+11                                              03637000
ZCREICDB EQU   ZCRENTER+11                                              03638000
ZCREICCI EQU   ZCRENTER+10                                              03639000
ZCREICCB EQU   ZCRENTER+10                                              03640000
ZCREICBI EQU   ZCRENTER+10                                              03641000
ZCREICBB EQU   ZCRENTER+10                                              03642000
ZCREICAB EQU   ZCRENTER+10                                              03643000
ZCREICAA EQU   ZCRENTER+10                                              03644000
ZCREHCAN EQU   ZCRENTER+10                                              03645000
ZCREGC0B EQU   ZCRENTER+10                                              03646000
ZCREGC0A EQU   ZCRENTER+9                                               03647000
ZCREGCLA EQU   ZCRENTER+9                                               03648000
ZCREGCEB EQU   ZCRENTER+9                                               03649000
ZCREGCDB EQU   ZCRENTER+9                                               03650000
@NM00053 EQU   ZCRENTER+9                                               03651000
ZCREGCBB EQU   ZCRENTER+9                                               03652000
ZCREGCAB EQU   ZCRENTER+9                                               03653000
ZCREFCEB EQU   ZCRENTER+9                                               03654000
ZCREFCEA EQU   ZCRENTER+8                                               03655000
ZCREECTA EQU   ZCRENTER+8                                               03656000
ZCREECEA EQU   ZCRENTER+8                                               03657000
ZCREECDA EQU   ZCRENTER+8                                               03658000
ZCREECCB EQU   ZCRENTER+8                                               03659000
ZCREECCA EQU   ZCRENTER+8                                               03660000
ZCREECBB EQU   ZCRENTER+8                                               03661000
ZCREECBA EQU   ZCRENTER+8                                               03662000
ZCREDCMB EQU   ZCRENTER+7                                               03663000
ZCREDCL0 EQU   ZCRENTER+7                                               03664000
ZCREDCKB EQU   ZCRENTER+7                                               03665000
ZCREDCKA EQU   ZCRENTER+7                                               03666000
ZCREDCJ0 EQU   ZCRENTER+7                                               03667000
ZCREDCI0 EQU   ZCRENTER+7                                               03668000
ZCREDCH0 EQU   ZCRENTER+7                                               03669000
ZCREDCF0 EQU   ZCRENTER+7                                               03670000
ZCREDCE0 EQU   ZCRENTER+6                                               03671000
ZCREDCD0 EQU   ZCRENTER+6                                               03672000
ZCREDCC0 EQU   ZCRENTER+6                                               03673000
ZCREDCB0 EQU   ZCRENTER+6                                               03674000
ZCREDCA0 EQU   ZCRENTER+6                                               03675000
ZCRECC2B EQU   ZCRENTER+6                                               03676000
ZCRECC1B EQU   ZCRENTER+6                                               03677000
ZCRECC1A EQU   ZCRENTER+6                                               03678000
ZCRECC0B EQU   ZCRENTER+5                                               03679000
ZCRECC0A EQU   ZCRENTER+5                                               03680000
ZCREBC0B EQU   ZCRENTER+5                                               03681000
ZCREBC0A EQU   ZCRENTER+5                                               03682000
ZCREBCZ0 EQU   ZCRENTER+5                                               03683000
ZCREBCY0 EQU   ZCRENTER+5                                               03684000
ZCREBCX0 EQU   ZCRENTER+5                                               03685000
ZCREBCXA EQU   ZCRENTER+5                                               03686000
ZCREBCSC EQU   ZCRENTER+4                                               03687000
ZCREBCRB EQU   ZCRENTER+4                                               03688000
ZCREBCRA EQU   ZCRENTER+4                                               03689000
ZCREBCQB EQU   ZCRENTER+4                                               03690000
ZCREBCPB EQU   ZCRENTER+4                                               03691000
ZCREBCOB EQU   ZCRENTER+4                                               03692000
ZCREBCNE EQU   ZCRENTER+4                                               03693000
ZCREBCND EQU   ZCRENTER+4                                               03694000
ZCREBCMB EQU   ZCRENTER+3                                               03695000
ZCREBCLB EQU   ZCRENTER+3                                               03696000
ZCREBCLA EQU   ZCRENTER+3                                               03697000
ZCREBCKB EQU   ZCRENTER+3                                               03698000
ZCREBCKA EQU   ZCRENTER+3                                               03699000
ZCREBCJB EQU   ZCRENTER+3                                               03700000
ZCREBCJA EQU   ZCRENTER+3                                               03701000
ZCREBCID EQU   ZCRENTER+3                                               03702000
ZCREBCIB EQU   ZCRENTER+2                                               03703000
ZCREBCIA EQU   ZCRENTER+2                                               03704000
ZCREBCHB EQU   ZCRENTER+2                                               03705000
ZCREBCHA EQU   ZCRENTER+2                                               03706000
ZCREBCGB EQU   ZCRENTER+2                                               03707000
ZCREBCGA EQU   ZCRENTER+2                                               03708000
ZCREBCFB EQU   ZCRENTER+2                                               03709000
ZCREBCFA EQU   ZCRENTER+2                                               03710000
ZCREBCEB EQU   ZCRENTER+1                                               03711000
ZCREBCDI EQU   ZCRENTER+1                                               03712000
ZCREBCCB EQU   ZCRENTER+1                                               03713000
ZCREBCBI EQU   ZCRENTER+1                                               03714000
ZCREBCBB EQU   ZCRENTER+1                                               03715000
ZCREBCBA EQU   ZCRENTER+1                                               03716000
ZCREBCAM EQU   ZCRENTER+1                                               03717000
ZCREBCAI EQU   ZCRENTER+1                                               03718000
ZCREBCAG EQU   ZCRENTER                                                 03719000
ZCREBCAE EQU   ZCRENTER                                                 03720000
ZCREBCAB EQU   ZCRENTER                                                 03721000
ZCREBCAA EQU   ZCRENTER                                                 03722000
ZCREAC1B EQU   ZCRENTER                                                 03723000
ZCREAC0B EQU   ZCRENTER                                                 03724000
ZCREAC0A EQU   ZCRENTER                                                 03725000
ZCREAC1A EQU   ZCRENTER                                                 03726000
ZCRTNAME EQU   ZCRAUDIT+1                                               03727000
ZCRTID   EQU   ZCRAUDIT                                                 03728000
ZCRREMIC EQU   ISTZCRR+436                                              03729000
ZCRSAVEZ EQU   ISTZCRR+196                                              03730000
ZCRDAFSV EQU   ZCRCIDSV+2                                               03731000
ZCRSAFSV EQU   ZCRCIDSV                                                 03732000
ZCRR13SV EQU   ISTZCRR+188                                              03733000
ZCRR2SV  EQU   ISTZCRR+184                                              03734000
ZCROPCDE EQU   ISTZCRR+183                                              03735000
ZCRPRMTC EQU   ISTZCRR+182                                              03736000
ZCRRCDSV EQU   ISTZCRR+181                                              03737000
ZCRAWQSW EQU   ISTZCRR+180                                              03738000
ZCRTOPQ  EQU   ISTZCRR+180                                              03739000
ZCRLSTFB EQU   ISTZCRR+180                                              03740000
ZCRXSCHD EQU   ISTZCRR+180                                              03741000
ZCRNXTEL EQU   ISTZCRR+180                                              03742000
ZCRSCANQ EQU   ISTZCRR+180                                              03743000
ZCRMOREL EQU   ISTZCRR+180                                              03744000
ZCRFBPRC EQU   ISTZCRR+180                                              03745000
ZCRFSBSV EQU   ISTZCRR+176                                              03746000
ZCRSVWK5 EQU   ZCRWKARA+16                                              03747000
ZCRSVWK4 EQU   ZCRWKARA+12                                              03748000
ZCRSVWK3 EQU   ZCRWKARA+8                                               03749000
ZCRSVWK2 EQU   ZCRWKARA+4                                               03750000
ZCRSVWK1 EQU   ZCRWKARA                                                 03751000
ZCRSVF25 EQU   ZCRSVRTN+96                                              03752000
ZCRSVF24 EQU   ZCRSVRTN+92                                              03753000
ZCRSVF23 EQU   ZCRSVRTN+88                                              03754000
ZCRSVF22 EQU   ZCRSVRTN+84                                              03755000
ZCRSVF21 EQU   ZCRSVRTN+80                                              03756000
ZCRSVF20 EQU   ZCRSVRTN+76                                              03757000
ZCRSVF19 EQU   ZCRSVRTN+72                                              03758000
ZCRSVF18 EQU   ZCRSVRTN+68                                              03759000
ZCRSVF17 EQU   ZCRSVRTN+64                                              03760000
ZCRSVF16 EQU   ZCRSVRTN+60                                              03761000
ZCRSVF15 EQU   ZCRSVRTN+56                                              03762000
ZCRSVF14 EQU   ZCRSVRTN+52                                              03763000
ZCRSVF13 EQU   ZCRSVRTN+48                                              03764000
ZCRSVF12 EQU   ZCRSVRTN+44                                              03765000
ZCRSVF11 EQU   ZCRSVRTN+40                                              03766000
ZCRSVF10 EQU   ZCRSVRTN+36                                              03767000
ZCRSVF9  EQU   ZCRSVRTN+32                                              03768000
ZCRSVF8  EQU   ZCRSVRTN+28                                              03769000
ZCRSVF7  EQU   ZCRSVRTN+24                                              03770000
ZCRSVF6  EQU   ZCRSVRTN+20                                              03771000
ZCRSVF5  EQU   ZCRSVRTN+16                                              03772000
ZCRSVF4  EQU   ZCRSVRTN+12                                              03773000
ZCRSVF3  EQU   ZCRSVRTN+8                                               03774000
ZCRSVF2  EQU   ZCRSVRTN+4                                               03775000
ZCRSVF1  EQU   ZCRSVRTN                                                 03776000
ZCRPVZB  EQU   ISTZCRR+52                                               03777000
ZCRZLB   EQU   ISTZCRR+48                                               03778000
ZCRBFPTR EQU   ISTZCRR+44                                               03779000
ZCRCCWA  EQU   ISTZCRR+40                                               03780000
ZCRPSW   EQU   ZCRPARMS+15                                              03781000
ZCRPCHAR EQU   ZCRPARMS+14                                              03782000
ZCRPRES2 EQU   ZCRPCOD2                                                 03783000
ZCRPMFGF EQU   ZCRPCOD2                                                 03784000
ZCRPFHDR EQU   ZCRPCOD2                                                 03785000
ZCRPPG2  EQU   ZCRPCOD2                                                 03786000
ZCRPRES  EQU   ZCRPCOD1                                                 03787000
ZCRPCFTX EQU   ZCRPCOD1                                                 03788000
ZCRPBUF  EQU   ZCRPCOD1                                                 03789000
ZCRPLSCB EQU   ZCRPCOD1                                                 03790000
ZCRPLSBQ EQU   ZCRPLSBF                                                 03791000
ZCRPFSB  EQU   ZCRPCOD1                                                 03792000
ZCRPLNG  EQU   ZCRPCOD1                                                 03793000
ZCRPPG   EQU   ZCRPCOD1                                                 03794000
ZCRDTODA EQU   ZCRDFRDA                                                 03795000
ZCRMLNG  EQU   ZCRPARMS+8                                               03796000
ZCRTBPTR EQU   ZCRPARMS+4                                               03797000
ZCRCBPTR EQU   ZCRFBPTR                                                 03798000
ZCRCRLCP EQU   ISTZCRR+20                                               03799000
@NM00052 EQU   ZCRSCPSW                                                 03800000
ZCRSKIPT EQU   ZCRSCPSW                                                 03801000
ZCRFSBWE EQU   ZCRSCPSW                                                 03802000
ZCRPRCMP EQU   ZCRSCPSW                                                 03803000
ZCRLREQ  EQU   ZCRSCPSW                                                 03804000
ZCRRJLCP EQU   ZCRSCPSW                                                 03805000
ZCRTPINV EQU   ZCRSCPSW                                                 03806000
ZCRTPEX  EQU   ZCRSCPSW                                                 03807000
@NM00051 EQU   ZCRIBPR                                                  03808000
ZCR3270R EQU   ZCRIBPR                                                  03809000
ZCR3270  EQU   ZCRIBPR                                                  03810000
ZCRLCPFD EQU   ZCRIBPR                                                  03811000
ZCRLCPFR EQU   ZCRIBPR                                                  03812000
ZCRRELK  EQU   ZCRIBPR                                                  03813000
ZCRERR   EQU   ZCRIBPR                                                  03814000
ZCRNOBUF EQU   ZCRIBPR                                                  03815000
@NM00050 EQU   ZCRPFLGS                                                 03816000
ZCRQAHED EQU   ZCRPFLGS                                                 03817000
ZCRF1RES EQU   ZCRGENSW                                                 03818000
ZCRBRIS  EQU   ZCRGENSW                                                 03819000
ZCRCLRBD EQU   ZCRGENSW                                                 03820000
ZCREXRES EQU   ZCRGENSW                                                 03821000
ZCRLCSYN EQU   ZCRGENSW                                                 03822000
ZCRRT06  EQU   ZCRGENSW                                                 03823000
ZCRTSW2  EQU   ZCRGENSW                                                 03824000
ZCRTSW1  EQU   ZCRGENSW                                                 03825000
ZCRINLCP EQU   ZCRFLGS3                                                 03826000
ZCRWRPTR EQU   ZCRFLGS3                                                 03827000
ZCRNOFRE EQU   ZCRFLGS3                                                 03828000
ZCREDRIV EQU   ZCRFLGS3                                                 03829000
ZCRDISC  EQU   ZCRFLGS3                                                 03830000
ZCRTPDIS EQU   ZCRFLGS3                                                 03831000
ZCRTPCON EQU   ZCRFLGS3                                                 03832000
ZCRTIC   EQU   ZCRFLGS3                                                 03833000
ZCRCNLXL EQU   ZCRRESET                                                 03834000
ZCRENDAN EQU   ZCRSWFLD                                                 03835000
ZCRENDXL EQU   ZCRSWFLD                                                 03836000
ZCRENDX  EQU   ZCRSWFLD                                                 03837000
ZCROB1   EQU   ZCRNDLCP                                                 03838000
ZCRENDPR EQU   ZCRSWFLD                                                 03839000
ZCREXTYP EQU   ZCRSWFLD                                                 03840000
ZCRSLCP  EQU   ZCRENDSH                                                 03841000
ZCRIF0E3 EQU   ZCRFLGS2                                                 03842000
ZCRIF0E2 EQU   ZCRFLGS2                                                 03843000
ZCRIF0E1 EQU   ZCRFLGS2                                                 03844000
ZCROB    EQU   ZCRFLGS2                                                 03845000
ZCRFMSED EQU   ZCRFLGS2                                                 03846000
ZCRSHEDI EQU   ZCRFLGS2                                                 03847000
ZCRLOCAL EQU   ZCRFLGS2                                                 03848000
ZCRFEXIT EQU   ZCRFLGS1                                                 03849000
ZCRUNSOL EQU   ZCRFLGS1                                                 03850000
ZCRENDLP EQU   ZCRFLGS1                                                 03851000
ZCRNRMEX EQU   ZCRFLGS1                                                 03852000
ZCRWAIT  EQU   ZCRFLGS1                                                 03853000
ZCRDEQSW EQU   ZCRFLGS1                                                 03854000
ZCRQUESW EQU   ZCRFLGS1                                                 03855000
ZCREXSW  EQU   ZCRFLGS1                                                 03856000
ZCRFRRA  EQU   ISTZCRR+8                                                03857000
ZCRCHAIN EQU   ISTZCRR+4                                                03858000
ZCRFLAG  EQU   ZCRCRR+3                                                 03859000
ZCRLEN   EQU   ZCRCRR+1                                                 03860000
ZCRID    EQU   ZCRCRR                                                   03861000
CCFRSVD1 EQU   CFCCRT                                                   03862000
CCFCR2   EQU   CFCCRT                                                   03863000
CCFCRP   EQU   CFCCRT                                                   03864000
CCFCR1   EQU   CFCCRT                                                   03865000
CCFCS2   EQU   CFCCRT                                                   03866000
CCFCS1   EQU   CFCCRT                                                   03867000
NCFRSVD  EQU   CFCNTRD                                                  03868000
NCFCR2   EQU   CFCNTRD                                                  03869000
NCFCRP   EQU   CFCNTRD                                                  03870000
NCFCR1   EQU   CFCNTRD                                                  03871000
NCFCS2   EQU   CFCNTRD                                                  03872000
NCFCS1   EQU   CFCNTRD                                                  03873000
PFCRSV01 EQU   ISTPFCRR+13                                              03874000
PFCFTA   EQU   ISTPFCRR+12                                              03875000
CRRFRR   EQU   PFCFRRO                                                  03876000
CRRCHAIN EQU   PFCCRRO                                                  03877000
CRRLEN   EQU   PFCCRRLN                                                 03878000
PFCRSV10 EQU   PFCCRR+1                                                 03879000
CRRID    EQU   PFCCRRID                                                 03880000
ZSAZTRAC EQU   ISTZSAVE+36                                              03881000
ZSAZSVVR EQU   ISTZSAVE+12                                              03882000
ZSAZSVRR EQU   ISTZSAVE+8                                               03883000
ZSAZSVFC EQU   ISTZSAVE+4                                               03884000
ZSAZACTV EQU   ZSAZSVMS                                                 03885000
LCPFTYPE EQU   LCPRPHA                                                  03886000
LCPRSTQH EQU   LCPLCCW                                                  03887000
LCPCLREP EQU   ISTLCPB+44                                               03888000
LCPUBFSB EQU   LCPFLCCW                                                 03889000
LCPRSV77 EQU   ISTLCPB+39                                               03890000
LCPLCCWC EQU   ISTLCPB+38                                               03891000
LCPRSV78 EQU   LCPFLG1                                                  03892000
LCPTRANS EQU   LCPFLG1                                                  03893000
LCPSTLB  EQU   LCPFLG1                                                  03894000
LCPREDRV EQU   LCPFLG1                                                  03895000
LCPDIRPT EQU   LCPFLG1                                                  03896000
LCPINTER EQU   LCPFLG1                                                  03897000
LCPRESET EQU   LCPFLG1                                                  03898000
LCPSTYPE EQU   ISTLCPB+36                                               03899000
LCPFSNCH EQU   ISTLCPB+34                                               03900000
LCPFOSN  EQU   ISTLCPB+32                                               03901000
LCPTLBAD EQU   ISTLCPB+28                                               03902000
LCPFDB2  EQU   LCPFDBA+1                                                03903000
LCPFDB1  EQU   LCPFDBA                                                  03904000
LCPNXLCW EQU   ISTLCPB+20                                               03905000
LCPDAF   EQU   LCPCID+2                                                 03906000
LCPSAF   EQU   LCPCID                                                   03907000
LCPLCCW1 EQU   ISTLCPB+12                                               03908000
LCPRRCNT EQU   LCPSEQ+1                                                 03909000
LCPRRCCT EQU   LCPSEQ                                                   03910000
LCPATOP  EQU   LCPFLAG2                                                 03911000
LCPFREE  EQU   LCPFLAG2                                                 03912000
LCPDSTAT EQU   LCPFLAG2                                                 03913000
LCPEXRES EQU   LCPFID0                                                  03914000
LCPZRIMM EQU   LCPTLBPI                                                 03915000
LCPRSTRT EQU   LCPFLAG2                                                 03916000
LCPASYN  EQU   LCPFLAG2                                                 03917000
LCPPRFLG EQU   LCPFLAG2                                                 03918000
LCPZMIRC EQU   LCPRUCNT                                                 03919000
LCPCHAI2 EQU   LCPCHAIN+1                                               03920000
LCPCHNG  EQU   LCPCHAI1                                                 03921000
LCPZRT0B EQU   LCPMNRCD                                                 03922000
LCPZRT0A EQU   LCPMNRCD                                                 03923000
LCPZRTL9 EQU   LCPZRT09                                                 03924000
LCPZRTL8 EQU   LCPZRT08                                                 03925000
LCPZRTL7 EQU   LCPZRT07                                                 03926000
LCPZRTL6 EQU   LCPZRT06                                                 03927000
LCPZRTL5 EQU   LCPZRT05                                                 03928000
LCPZRTL4 EQU   LCPZRT04                                                 03929000
LCPZRTL3 EQU   LCPZRT03                                                 03930000
LCPZRTL2 EQU   LCPZRT02                                                 03931000
LCPZRT01 EQU   LCPFLAGS                                                 03932000
LCPZRT00 EQU   LCPFLAGS                                                 03933000
LCPLNGTH EQU   ISTLCPB+1                                                03934000
LCPTYPE  EQU   ISTLCPB                                                  03935000
LCCWDATA EQU   ISTLCCW+4                                                03936000
LCCWCNT  EQU   ISTLCCW+2                                                03937000
LCCWACI  EQU   LCCWFLAG                                                 03938000
LCCWRFI  EQU   LCCWFLAG                                                 03939000
LCCWPER  EQU   LCCWLSI                                                  03940000
LCCWIDAT EQU   LCCWFLAG                                                 03941000
LCCWNTVC EQU   LCCWFLAG                                                 03942000
LCCWCKPT EQU   LCCWFLAG                                                 03943000
LCCWCC   EQU   LCCWFLAG                                                 03944000
LCCWCD   EQU   LCCWFLAG                                                 03945000
LCCWTYPE EQU   LCCWCTL                                                  03946000
LCCWMODE EQU   LCCWCTL                                                  03947000
LCCWSOP  EQU   LCCWRWOP                                                 03948000
@NM00049 EQU   LCCWRWOP                                                 03949000
LCCWSD   EQU   LCCWOP                                                   03950000
LCCWSI   EQU   LCCWOP                                                   03951000
SAVEREGS EQU   CSMSAVE+12                                               03952000
@NM00048 EQU   CSMSAVE                                                  03953000
ATCAOS   EQU   ISTATCVT+1584                                            03954000
ATCPOPAB EQU   ATCAOSM+640                                              03955000
ATCVIOPM EQU   ATCAOSM+636                                              03956000
ATCTPMMI EQU   ATCAOSM+632                                              03957000
ATCTPMPB EQU   ATCAOSM+600                                              03958000
ATCRSV88 EQU   ATCAOSM+596                                              03959000
ATCRPLCT EQU   ATCAOSM+594                                              03960000
ATCCRACT EQU   ATCAOSM+592                                              03961000
ATCSRBCT EQU   ATCAOSM+590                                              03962000
ATCRSV75 EQU   ATCAOSM+589                                              03963000
ATCRSV66 EQU   ATCZFLAG                                                 03964000
ATCZF001 EQU   ATCZFLAG                                                 03965000
ATCTPCP1 EQU   ATCAOSM+584                                              03966000
ATCTPCP0 EQU   ATCAOSM+580                                              03967000
ATCAICTN EQU   ATCAOSM+576                                              03968000
ATCZR01  EQU   ATCAOSM+572                                              03969000
ATCMPLTA EQU   ATCAOSM+568                                              03970000
ATCASCB  EQU   ATCAOSM+564                                              03971000
ATCAP86  EQU   ATCAOSM+560                                              03972000
ATCAP85  EQU   ATCAOSM+556                                              03973000
ATCAP84  EQU   ATCAOSM+552                                              03974000
ATCAP83  EQU   ATCAOSM+548                                              03975000
ATCAP82  EQU   ATCAOSM+544                                              03976000
ATCAP69  EQU   ATCAOSM+540                                              03977000
ATCAP66  EQU   ATCAOSM+536                                              03978000
ATCAP62  EQU   ATCAOSM+532                                              03979000
ATCAPC59 EQU   ATCAOSM+528                                              03980000
ATCAP56  EQU   ATCAOSM+524                                              03981000
ATCAP55  EQU   ATCAOSM+520                                              03982000
ATCRCFY0 EQU   ATCAOSM+516                                              03983000
ATCAP41  EQU   ATCAOSM+512                                              03984000
ATCAPC25 EQU   ATCAOSM+508                                              03985000
ATCAP23  EQU   ATCAOSM+504                                              03986000
ATCTPSPB EQU   ATCAOSM+472                                              03987000
ATCTRMPB EQU   ATCAOSM+440                                              03988000
ATCAPBE  EQU   ATCAOSM+436                                              03989000
ATCPSTA  EQU   ATCAOSM+432                                              03990000
ATCSMABF EQU   ATCAOSM+428                                              03991000
ATCSMAPR EQU   ATCAOSM+424                                              03992000
ATCTPWQA EQU   ATCAOSM+420                                              03993000
ATCSMAID EQU   ATCAOSM+416                                              03994000
ATCSMARA EQU   ATCAOSM+412                                              03995000
ATCCACXA EQU   ATCAOSM+408                                              03996000
ATCZLAAB EQU   ATCAOSM+404                                              03997000
ATCATA10 EQU   ATCAOSM+400                                              03998000
ATCHLTCB EQU   ATCAOSM+396                                              03999000
@NM00047 EQU   ATCVTFLG                                                 04000000
ATCVTACT EQU   ATCVTFLG                                                 04001000
ATCRPT40 EQU   ATCAOSM+388                                              04002000
ATCRPT39 EQU   ATCAOSM+384                                              04003000
ATCRPT38 EQU   ATCAOSM+380                                              04004000
ATCRPT37 EQU   ATCAOSM+376                                              04005000
ATCRPT36 EQU   ATCAOSM+372                                              04006000
ATCRPT35 EQU   ATCAOSM+368                                              04007000
ATCRPT34 EQU   ATCAOSM+364                                              04008000
ATCRPT33 EQU   ATCAOSM+360                                              04009000
ATCRPT32 EQU   ATCAOSM+356                                              04010000
ATCRPT31 EQU   ATCAOSM+352                                              04011000
ATCRPT30 EQU   ATCAOSM+348                                              04012000
ATCRPT29 EQU   ATCAOSM+344                                              04013000
ATCRPT28 EQU   ATCAOSM+340                                              04014000
ATCRPT27 EQU   ATCAOSM+336                                              04015000
@NM00046 EQU   ATCAOSM+333                                              04016000
@NM00045 EQU   @NM00044                                                 04017000
ATCSNUF  EQU   @NM00044                                                 04018000
ATCOPKL  EQU   @NM00044                                                 04019000
ATCABEN  EQU   @NM00044                                                 04020000
ATCAIWT  EQU   ATCAOSM+328                                              04021000
ATCINFDD EQU   ATCAOSM+324                                              04022000
ATCORFMG EQU   ATCAOSM+320                                              04023000
ATCORFRL EQU   ATCAOSM+316                                              04024000
ATCOROBT EQU   ATCAOSM+312                                              04025000
ATCORQG  EQU   ATCORSRB                                                 04026000
ATCORTBF EQU   ATCSQAFR                                                 04027000
ATCRPLAC EQU   ATCRPLCN+2                                               04028000
ATCRPLRC EQU   ATCRPLCN                                                 04029000
ATCCRPLQ EQU   ATCCRPL                                                  04030000
ATCSRBAC EQU   ATCSRBCN+2                                               04031000
ATCSRBRC EQU   ATCSRBCN                                                 04032000
ATCSRBQ  EQU   ATCSRB                                                   04033000
ATCCRAAC EQU   ATCCRACN+2                                               04034000
ATCCRARC EQU   ATCCRACN                                                 04035000
ATCCRAQ  EQU   ATCCRA                                                   04036000
ATCRPT12 EQU   ATCAOSM+276                                              04037000
ATCDMAPP EQU   ATCAOSM+272                                              04038000
ATCAP38  EQU   ATCAOSM+268                                              04039000
ATCAP37  EQU   ATCAOSM+264                                              04040000
ATCZDFJ0 EQU   ATCAOSM+260                                              04041000
ATCAP51  EQU   ATCAOSM+256                                              04042000
ATCZPAB2 EQU   ATCAOSM+224                                              04043000
ATCZPAB1 EQU   ATCAOSM+192                                              04044000
ATCZLFVT EQU   ATCAOSM+188                                              04045000
ATCZLPVT EQU   ATCAOSM+184                                              04046000
ATCZDVTX EQU   ATCAOSM+180                                              04047000
ATCZDVTA EQU   ATCAOSM+176                                              04048000
ATCZDVT9 EQU   ATCAOSM+172                                              04049000
ATCZDVT8 EQU   ATCAOSM+168                                              04050000
ATCZDVT7 EQU   ATCAOSM+164                                              04051000
ATCRSV56 EQU   ATCDAPVT+22                                              04052000
ATCDAPDG EQU   ATCDAPVT+20                                              04053000
ATCDXCEA EQU   ATCDAPVT+16                                              04054000
ATCDCEA  EQU   ATCDAPVT+12                                              04055000
ATCDPCIA EQU   ATCDAPVT+8                                               04056000
ATCDSIOA EQU   ATCDAPVT+4                                               04057000
ATCDEOEA EQU   ATCDAPVT                                                 04058000
ATCZLAEA EQU   ATCLDAPP+16                                              04059000
ATCZLCEA EQU   ATCLDAPP+12                                              04060000
ATCRSV17 EQU   ATCLDAPP+8                                               04061000
ATCSMFRR EQU   ATCLDAPP+4                                               04062000
ATCCDTID EQU   ATCLDAPP                                                 04063000
ATCZAEA  EQU   ATCICAPP+16                                              04064000
ATCZCEA  EQU   ATCICAPP+12                                              04065000
ATCCDTCB EQU   ATCICAPP+8                                               04066000
ATCZSIOA EQU   ATCICAPP+4                                               04067000
ATCCDRPH EQU   ATCICAPP                                                 04068000
ATCAP65  EQU   ATCAOSM+96                                               04069000
ATCZDVT6 EQU   ATCAOSM+92                                               04070000
ATCZDVT4 EQU   ATCAOSM+88                                               04071000
ATCZDVT3 EQU   ATCAOSM+84                                               04072000
ATCZDVT1 EQU   ATCAOSM+80                                               04073000
ATCICNCB EQU   ATCAOSM+76                                               04074000
ATCZPSVT EQU   ATCAOSM+72                                               04075000
ATCZFSVT EQU   ATCAOSM+68                                               04076000
ATCAP64  EQU   ATCAOSM+64                                               04077000
ATCAP63  EQU   ATCAOSM+60                                               04078000
ATCAP61  EQU   ATCAOSM+56                                               04079000
ATCAP58  EQU   ATCAOSM+52                                               04080000
ATCAP57  EQU   ATCAOSM+48                                               04081000
ATCAP54  EQU   ATCAOSM+44                                               04082000
ATCAP53  EQU   ATCAOSM+40                                               04083000
ATCAP52  EQU   ATCAOSM+36                                               04084000
ATCAP34  EQU   ATCAOSM+32                                               04085000
ATCAP32  EQU   ATCAOSM+28                                               04086000
ATCAP12  EQU   ATCAOSM+20                                               04087000
ATCAP11  EQU   ATCAOSM+16                                               04088000
ATCCMTCB EQU   ATCAOSM+12                                               04089000
ATCPRPH  EQU   ATCAOSM+8                                                04090000
ATCGSRBF EQU   ATCGSRBG                                                 04091000
ATCSRBRT EQU   ATCAOSM                                                  04092000
@NM00043 EQU   @NM00042                                                 04093000
ATCVTMAB EQU   @NM00042                                                 04094000
@NM00041 EQU   ATCVTBAM                                                 04095000
ATCVDLOK EQU   ISTATCVT+904                                             04096000
ATCVFPAB EQU   ISTATCVT+872                                             04097000
ATCVDPAB EQU   ISTATCVT+840                                             04098000
ATCIOECB EQU   ISTATCVT+836                                             04099000
ATCINCW3 EQU   ISTATCVT+832                                             04100000
ATCMODTB EQU   ISTATCVT+828                                             04101000
ATCUSSPT EQU   ISTATCVT+824                                             04102000
ATCSRTAB EQU   ISTATCVT+820                                             04103000
@NM00040 EQU   ISTATCVT+819                                             04104000
@NM00039 EQU   ATCSTAT2                                                 04105000
ATCTRSMS EQU   ATCSTAT2                                                 04106000
ATCTRLOK EQU   ATCSTAT2                                                 04107000
ATCTRPSS EQU   ATCSTAT2                                                 04108000
ATCTRESC EQU   ATCSTAT2                                                 04109000
ATCTRAPI EQU   ATCSTAT2                                                 04110000
ATCNMCTR EQU   ISTATCVT+816                                             04111000
ATCSEC51 EQU   ATCSECST                                                 04112000
ATCSEC40 EQU   ATCSIPD+8                                                04113000
ATCSEC30 EQU   ATCSIPD+4                                                04114000
ATCSEC21 EQU   ATCSIPD                                                  04115000
ATCSEC10 EQU   ATCSOPD+4                                                04116000
ATCSEC01 EQU   ATCSOPD                                                  04117000
ATCPOIA  EQU   ATCRNO+1                                                 04118000
@NM00038 EQU   ATCRNO                                                   04119000
ATCPODVT EQU   ISTATCVT+784                                             04120000
ATCS49XL EQU   ISTATCVT+780                                             04121000
ATCS49XI EQU   ISTATCVT+776                                             04122000
ATCLCLCT EQU   ATCVLCNT+2                                               04123000
ATCRNCNT EQU   ATCVLCNT                                                 04124000
ATCCFEAD EQU   ISTATCVT+768                                             04125000
ATCPTR00 EQU   ISTATCVT+736                                             04126000
ATCRSV10 EQU   ISTATCVT+704                                             04127000
ATCTACB  EQU   ISTATCVT+700                                             04128000
ATCVTINM EQU   ISTATCVT+696                                             04129000
ATCTCLIM EQU   ISTATCVT+692                                             04130000
ATCTCLOM EQU   ISTATCVT+688                                             04131000
ATCVTIPB EQU   ISTATCVT+656                                             04132000
ATCTCIPB EQU   ISTATCVT+624                                             04133000
ATCTIPAB EQU   ISTATCVT+592                                             04134000
ATCOCCCB EQU   ISTATCVT+588                                             04135000
ATCOCCOB EQU   ISTATCVT+584                                             04136000
ATCCDLAD EQU   ISTATCVT+580                                             04137000
ATCCCLAD EQU   ISTATCVT+576                                             04138000
ATCDLRPB EQU   ISTATCVT+544                                             04139000
ATCPGPAB EQU   ISTATCVT+512                                             04140000
ATCVPAB1 EQU   ISTATCVT+480                                             04141000
ATCRSV97 EQU   ISTATCVT+476                                             04142000
ATCRDTLK EQU   ISTATCVT+472                                             04143000
ATCVOCLK EQU   ISTATCVT+468                                             04144000
ATCDVTLK EQU   ISTATCVT+456                                             04145000
ATCAP36  EQU   ISTATCVT+452                                             04146000
ATCAP35  EQU   ISTATCVT+448                                             04147000
ATCAP33  EQU   ISTATCVT+444                                             04148000
ATCRSV99 EQU   ISTATCVT+440                                             04149000
ATCONFIG EQU   ISTATCVT+432                                             04150000
ATCNODDS EQU   ISTATCVT+428                                             04151000
ATCNODEL EQU   ISTATCVT+420                                             04152000
ATCRSV69 EQU   ISTATCVT+416                                             04153000
ATCAPCR5 EQU   ISTATCVT+412                                             04154000
ATCLDECB EQU   ISTATCVT+408                                             04155000
ATCLDNCS EQU   ISTATCVT+404                                             04156000
ATCCDPTR EQU   ISTATCVT+400                                             04157000
ATCADEL  EQU   ISTATCVT+396                                             04158000
ATCTODVT EQU   ISTATCVT+392                                             04159000
ATCDEBCH EQU   ISTATCVT+388                                             04160000
ATCHBSIZ EQU   ATCHPGM+2                                                04161000
ATCHBFNO EQU   ATCHPGM                                                  04162000
ATCCRME  EQU   ISTATCVT+380                                             04163000
ATCRVCHS EQU   ISTATCVT+372                                             04164000
ATCECTLP EQU   ISTATCVT+368                                             04165000
ATCZDVTB EQU   ISTATCVT+364                                             04166000
ATCECPRT EQU   ISTATCVT+360                                             04167000
ATCVTLOD EQU   ISTATCVT+356                                             04168000
ATCTRPAB EQU   ISTATCVT+352                                             04169000
ATCMSGM  EQU   ISTATCVT+348                                             04170000
ATCMSGP  EQU   ISTATCVT+344                                             04171000
ATCEPT   EQU   ISTATCVT+340                                             04172000
ATCDVT   EQU   ISTATCVT+336                                             04173000
ATCTRCPT EQU   ISTATCVT+332                                             04174000
ATCDVLOD EQU   ISTATCVT+328                                             04175000
ATCALERT EQU   ISTATCVT+324                                             04176000
ATCEPA   EQU   ISTATCVT+320                                             04177000
ATCSAF   EQU   ISTATCVT+318                                             04178000
ATCXRANG EQU   ISTATCVT+317                                             04179000
ATCLAST  EQU   ATCSHRFG                                                 04180000
ATCSHRTN EQU   ISTATCVT+308                                             04181000
ATCUEP   EQU   ISTATCVT+304                                             04182000
ATCOCRT  EQU   ISTATCVT+300                                             04183000
ATCCSMA  EQU   ATCCSMR                                                  04184000
ATCESC02 EQU   ISTATCVT+292                                             04185000
ATCESC01 EQU   ISTATCVT+288                                             04186000
ATCMNT   EQU   ISTATCVT+272                                             04187000
ATCRSV16 EQU   ISTATCVT+270                                             04188000
ATCMAXID EQU   ISTATCVT+269                                             04189000
ATCMSGSP EQU   ATCCOM+268                                               04190000
ATCACTRM EQU   ATCCOM+264                                               04191000
ATCNERAP EQU   ATCCOM+260                                               04192000
ATCNESAL EQU   ATCCOM+256                                               04193000
ATCRCC65 EQU   ATCCOM+252                                               04194000
ATCRCC26 EQU   ATCCOM+248                                               04195000
ATCRCC63 EQU   ATCCOM+244                                               04196000
ATCRSV11 EQU   ATCCOM+242                                               04197000
ATCAPOST EQU   ATCCOM+236                                               04198000
ATCNERFN EQU   ATCCOM+232                                               04199000
ATCNERNE EQU   ATCCOM+228                                               04200000
ATCNERCV EQU   ATCCOM+224                                               04201000
ATCNERST EQU   ATCCOM+220                                               04202000
ATCDCC61 EQU   ATCCOM+216                                               04203000
ATCDCC60 EQU   ATCCOM+212                                               04204000
ATCSRTDF EQU   ATCCOM+208                                               04205000
ATCSRTAD EQU   ATCCOM+204                                               04206000
ATCFIRA  EQU   ATCCOM+200                                               04207000
ATCSMBQ  EQU   ATCCOM+196                                               04208000
ATCSMRC  EQU   ATCCOM+192                                               04209000
ATCSMRS  EQU   ATCCOM+188                                               04210000
ATCSMQU  EQU   ATCCOM+184                                               04211000
ATCSMRQ  EQU   ATCCOM+180                                               04212000
ATCACDA  EQU   ATCCOM+176                                               04213000
ATCSTMA  EQU   ATCCOM+172                                               04214000
ATCFRSTR EQU   ATCCOM+168                                               04215000
ATCREADA EQU   ATCCOM+160                                               04216000
ATCALOAD EQU   ATCCOM+156                                               04217000
ATCBLDLA EQU   ATCCOM+152                                               04218000
ATCFBRPH EQU   ATCCOM+148                                               04219000
ATCBFTRC EQU   ATCCOM+144                                               04220000
ATCTPBUF EQU   ATCTHTRC                                                 04221000
ATCREMOV EQU   ATCCOM+136                                               04222000
ATCADD   EQU   ATCCOM+132                                               04223000
ATCBPDA  EQU   ATCCOM+128                                               04224000
ATCDVTPT EQU   ATCCOM+124                                               04225000
ATCFEPT  EQU   ATCCOM+120                                               04226000
ATCFDVT  EQU   ATCCOM+116                                               04227000
ATCCONFT EQU   ATCCOM+112                                               04228000
ATCPTCHA EQU   ATCCOM+108                                               04229000
ATCAUTHA EQU   ATCCOM+104                                               04230000
ATCACCTA EQU   ATCCOM+100                                               04231000
ATCRDTH  EQU   ATCCOM+96                                                04232000
ATCFRSCH EQU   ATCCOM+92                                                04233000
ATCFSB   EQU   ATCCOM+88                                                04234000
ATCHLTMS EQU   ATCCOM+84                                                04235000
ATCECPRM EQU   ATCCOM+80                                                04236000
ATCECNET EQU   ATCCOM+76                                                04237000
ATCECOPC EQU   ATCCOM+72                                                04238000
ATCVPARM EQU   ATCCOM+68                                                04239000
ATCECVRQ EQU   ATCCOM+64                                                04240000
ATCECSES EQU   ATCCOM+60                                                04241000
ATCOCHA  EQU   ATCCOM+56                                                04242000
ATCDSPLQ EQU   ATCCOM+52                                                04243000
ATCECDSP EQU   ATCCOM+48                                                04244000
ATCVARYQ EQU   ATCCOM+44                                                04245000
ATCECVRY EQU   ATCCOM+40                                                04246000
ATCHALTQ EQU   ATCCOM+36                                                04247000
ATCECHLT EQU   ATCCOM+32                                                04248000
ATCMODQ  EQU   ATCCOM+28                                                04249000
ATCECMOD EQU   ATCCOM+24                                                04250000
ATCASCHD EQU   ATCCOM+20                                                04251000
ATCSRT   EQU   ATCCOM+16                                                04252000
ATCRDT   EQU   ATCCOM+12                                                04253000
ATCDCFRR EQU   ATCCOM+8                                                 04254000
ATCAPI   EQU   ATCCOM+4                                                 04255000
ATCRSV04 EQU   ATCSTAT4                                                 04256000
ATCVTTRC EQU   ATCSTAT4                                                 04257000
ATCNCSD  EQU   ATCSTAT4                                                 04258000
ATCMTST  EQU   ATCSTAT4                                                 04259000
ATCTPRT  EQU   ATCSTAT4                                                 04260000
ATCPRTAT EQU   ATCSTAT4                                                 04261000
@NM00037 EQU   ATCPOFLG                                                 04262000
ATCPOUNS EQU   ATCPOFLG                                                 04263000
ATCHSDMF EQU   ATCSTFLG                                                 04264000
@NM00036 EQU   ATCSTAT1                                                 04265000
ATCMDHLT EQU   ATCSTAT1                                                 04266000
ATCINHLT EQU   ATCSTAT1                                                 04267000
ATCNETSL EQU   ATCSTAT1                                                 04268000
ATCQKHLT EQU   ATCSTAT1                                                 04269000
ATCSNHLT EQU   ATCSTAT1                                                 04270000
ATCACTIV EQU   ATCSTAT1                                                 04271000
ATCSTART EQU   ATCSTAT1                                                 04272000
RPHNEXPO EQU   ISTRPH+104                                               04273000
RPHSAV16 EQU   RPHWORK+60                                               04274000
RPHSAV15 EQU   RPHWORK+56                                               04275000
RPHSAV14 EQU   RPHWORK+52                                               04276000
RPHSAV13 EQU   RPHWORK+48                                               04277000
RPHSAV12 EQU   RPHWORK+44                                               04278000
RPHSAV11 EQU   RPHWORK+40                                               04279000
RPHSAV10 EQU   RPHWORK+36                                               04280000
RPHSAVE9 EQU   RPHWORK+32                                               04281000
RPHSAVE8 EQU   RPHWORK+28                                               04282000
RPHSAVE7 EQU   RPHWORK+24                                               04283000
RPHSAVE6 EQU   RPHWORK+20                                               04284000
RPHSAVE5 EQU   RPHWORK+16                                               04285000
RPHSAVE4 EQU   RPHWORK+12                                               04286000
RPHSAVE3 EQU   RPHWORK+8                                                04287000
RPHSAVE2 EQU   RPHWORK+4                                                04288000
RPHSHALF EQU   RPHSAVE1+2                                               04289000
RPHSBIT8 EQU   RPHSBITS                                                 04290000
RPHSBIT7 EQU   RPHSBITS                                                 04291000
RPHSBIT6 EQU   RPHSBITS                                                 04292000
RPHSBIT5 EQU   RPHSBITS                                                 04293000
RPHSBIT4 EQU   RPHSBITS                                                 04294000
RPHSBIT3 EQU   RPHSBITS                                                 04295000
RPHSBIT2 EQU   RPHSBITS                                                 04296000
RPHSBIT1 EQU   RPHSBITS                                                 04297000
RPHSBYTE EQU   RPHSAVE1                                                 04298000
RPHPABQP EQU   RPHPABQA+1                                               04299000
RPHPABFG EQU   RPHPABQA                                                 04300000
RPHSRP34 EQU   RPHSRPRM+2                                               04301000
RPHSRP12 EQU   RPHSRPRM                                                 04302000
RPHWEGT  EQU   RPHCSPA                                                  04303000
RPHMAJCB EQU   ISTRPH+21                                                04304000
RPHPABOF EQU   ISTRPH+20                                                04305000
RPHRESUM EQU   RPHRESMA+1                                               04306000
RPHRSV01 EQU   RPHWPFLG                                                 04307000
RPHPURGE EQU   RPHWPFLG                                                 04308000
RPHPT    EQU   RPHWPFLG                                                 04309000
RPHWT    EQU   RPHWPFLG                                                 04310000
RPHRSKEY EQU   RPHWPFLG                                                 04311000
RPHDVTA  EQU   ISTRPH+12                                                04312000
RPHTIK   EQU   RPHTSKID+3                                               04313000
@NM00035 EQU   RPHTSKID                                                 04314000
RPHRPHAP EQU   RPHRPHA+1                                                04315000
@NM00034 EQU   RPHRPHA                                                  04316000
RPHGATE  EQU   RPHRPHA                                                  04317000
@NM00033 EQU   RPHFLGB                                                  04318000
RPHRLCRA EQU   RPHFLGB                                                  04319000
RPHNRSAV EQU   RPHFLGB                                                  04320000
RPHPGCMP EQU   RPHFLGB                                                  04321000
RPHFBAPS EQU   RPHFLGB                                                  04322000
RPHBSSP  EQU   RPHFLGB                                                  04323000
RPHLOCK  EQU   RPHFLGB                                                  04324000
RPHFNFLG EQU   RPHFSTLC                                                 04325000
RPHMLTCP EQU   RPHFLAGS                                                 04326000
RPHSMCLR EQU   RPHFLAGS                                                 04327000
RPHSMTYP EQU   RPHFLAGS                                                 04328000
RPHSMQ   EQU   RPHFLAGS                                                 04329000
RPHAUTEX EQU   RPHAPTYP                                                 04330000
RPHSPGIN EQU   RPHFLAGS                                                 04331000
RPHOGIND EQU   RPHFLAGS                                                 04332000
RPHLNGTH EQU   RPHCNTL+1                                                04333000
RPHTYPE  EQU   RPHCNTL                                                  04334000
DYPPAB   EQU   ISTDYPAB+16                                              04335000
DYPRSV01 EQU   ISTDYPAB+12                                              04336000
DYPTSKID EQU   ISTDYPAB+8                                               04337000
DYPCHAIN EQU   ISTDYPAB+4                                               04338000
DYPFLGS  EQU   ISTDYPAB+2                                               04339000
DYPLNGTH EQU   ISTDYPAB+1                                               04340000
DYPTYPE  EQU   ISTDYPAB                                                 04341000
NSRUNA6  EQU   NSRUNA5                                                  04342000
RUBDATA  EQU   ISTRUB                                                   04343000
FMCFLRSV EQU   FMCFLGB                                                  04344000
FMCFLGA8 EQU   FMCFLGB                                                  04345000
FMCCLRPH EQU   FMCVS1+45                                                04346000
FMCRSV0X EQU   FMCCVFLG                                                 04347000
FMCVYRPH EQU   FMCCVFLG                                                 04348000
FMCZV004 EQU   FMCVS1+40                                                04349000
FMCLOCK2 EQU   FMCVS1+36                                                04350000
@NM00026 EQU   FMCZFLG2                                                 04351000
FMCZF027 EQU   FMCZFLG2                                                 04352000
FMCZF026 EQU   FMCZFLG2                                                 04353000
FMCSEQ1B EQU   FMCSEQ1                                                  04354000
FMCSEQ1T EQU   FMCSEQ1                                                  04355000
FMCZX006 EQU   FMCVS1+33                                                04356000
FMCZX005 EQU   FMCVS1+32                                                04357000
FMCZX004 EQU   FMCVS1+31                                                04358000
FMCZX003 EQU   FMCVS1+30                                                04359000
FMCZX002 EQU   FMCVS1+29                                                04360000
FMCZX001 EQU   FMCVS1+28                                                04361000
FMCZV001 EQU   FMCVS1+24                                                04362000
FMCAWATQ EQU   FMCLCPAQ+1                                               04363000
@NM00025 EQU   FMCLCPAQ                                                 04364000
FMCLCPB2 EQU   FMCLCPBQ+1                                               04365000
FMCLCPB1 EQU   FMCLCPBQ                                                 04366000
FMCASCDQ EQU   FMCSHEAQ+1                                               04367000
@NM00024 EQU   FMCSHEAQ                                                 04368000
FMCSHEDQ EQU   FMCVS1+8                                                 04369000
FMCZFCSQ EQU   FMCVS1+6                                                 04370000
FMCZH001 EQU   FMCVS1+4                                                 04371000
FMCZF025 EQU   FMCZFLAG+3                                               04372000
FMCZF024 EQU   FMCZFLAG+3                                               04373000
FMCZF023 EQU   FMCZFLAG+3                                               04374000
FMCZF022 EQU   FMCZFLAG+3                                               04375000
FMCZF021 EQU   FMCZFLAG+3                                               04376000
FMCZF020 EQU   FMCZFLAG+3                                               04377000
FMCZF019 EQU   FMCZFLAG+3                                               04378000
FMCZF018 EQU   FMCZFLAG+3                                               04379000
FMCZF017 EQU   FMCZFLAG+2                                               04380000
FMCZF016 EQU   FMCZFLAG+2                                               04381000
FMCZF015 EQU   FMCZFLAG+2                                               04382000
FMCZF014 EQU   FMCZFLAG+2                                               04383000
FMCZF013 EQU   FMCZFLAG+2                                               04384000
FMCZF012 EQU   FMCZFLAG+2                                               04385000
FMCZF011 EQU   FMCZFLAG+2                                               04386000
FMCZF010 EQU   FMCZFLAG+2                                               04387000
FMCZF00F EQU   FMCZFLAG+1                                               04388000
FMCZF00E EQU   FMCZFLAG+1                                               04389000
FMCZF00D EQU   FMCZFLAG+1                                               04390000
FMCZF00C EQU   FMCZFLAG+1                                               04391000
FMCZF00B EQU   FMCZFLAG+1                                               04392000
FMCRSV10 EQU   FMCZFLAG+1                                               04393000
FMCZF009 EQU   FMCZFLAG+1                                               04394000
FMCZFD06 EQU   FMCZF006+1                                               04395000
FMCZFC06 EQU   FMCZF006                                                 04396000
FMCZFB06 EQU   FMCZF006                                                 04397000
FMCZFA06 EQU   FMCZF006                                                 04398000
FMCZF005 EQU   FMCZFLAG                                                 04399000
FMCZF004 EQU   FMCZFLAG                                                 04400000
FMCZF003 EQU   FMCZFLAG                                                 04401000
FMCZF002 EQU   FMCZFLAG                                                 04402000
FMCZF001 EQU   FMCZFLAG                                                 04403000
FMCFRESA EQU   ISTFMCB+228                                              04404000
FMCSCSQN EQU   FMCSNCTL+2                                               04405000
FMCSCCTL EQU   FMCSNCTL+1                                               04406000
FMCSTCTL EQU   FMCSCFLG                                                 04407000
FMCSCCLO EQU   FMCSCFLG                                                 04408000
FMCAPRO  EQU   FMCSCFLG                                                 04409000
FMCLURO  EQU   FMCSCFLG                                                 04410000
FMCOBSAC EQU   FMCSCFLG                                                 04411000
FMCIBSAC EQU   FMCSCFLG                                                 04412000
FMCFBRE  EQU   ISTFMCB+220                                              04413000
FMCFBXM  EQU   FMCZV002                                                 04414000
FMCASEGQ EQU   ISTFMCB+212                                              04415000
FMCRDTPT EQU   ISTFMCB+208                                              04416000
FMCLOCK  EQU   ISTFMCB+204                                              04417000
FMCSEGD  EQU   FMCSSEGQ                                                 04418000
FMCRSPLM EQU   ISTFMCB+198                                              04419000
FMCPSTRS EQU   ISTFMCB+196                                              04420000
@NM00023 EQU   FMCRRESP                                                 04421000
FMCTSLHA EQU   FMCRRESP                                                 04422000
FMCFRRN  EQU   FMCRRESP                                                 04423000
FMCFME   EQU   FMCRRESP                                                 04424000
FMCFEX   EQU   FMCRRESP                                                 04425000
FMCFPE   EQU   FMCRRESP                                                 04426000
FMCCTLB  EQU   ISTFMCB+194                                              04427000
FMCBSQNO EQU   FMCCLSEQ+2                                               04428000
FMCTSQNO EQU   FMCCLSEQ                                                 04429000
FMCOBPRG EQU   FMCMODEB                                                 04430000
FMCIBPRG EQU   FMCMODEB                                                 04431000
FMCRESOT EQU   FMCMODEB                                                 04432000
FMCRSTSR EQU   FMCMODEB                                                 04433000
FMCLUQ   EQU   FMCMODEB                                                 04434000
FMCAPQ   EQU   FMCMODEB                                                 04435000
FMCCLEAR EQU   FMCMODEB                                                 04436000
FMCHOLD  EQU   FMCMODEB                                                 04437000
FMCIPSEQ EQU   ISTFMCB+188                                              04438000
FMCLUSTR EQU   ISTFMCB+187                                              04439000
FMCRSV87 EQU   FMCSTAT2                                                 04440000
FMCSEQI  EQU   FMCSTAT2                                                 04441000
FMCCPIP  EQU   FMCSTAT2                                                 04442000
FMCALIPR EQU   FMCSTAT2                                                 04443000
FMCIAIO  EQU   FMCSTAT2                                                 04444000
FMCZF00A EQU   FMCSTAT2                                                 04445000
FMCVPIP  EQU   FMCSTAT2                                                 04446000
FMCBHSET EQU   ISTFMCB+185                                              04447000
FMCPRMRC EQU   FMCCLEXT+20                                              04448000
FMCRSV89 EQU   FMCPSTAT                                                 04449000
FMCPCLSD EQU   FMCPSTAT                                                 04450000
FMCDDOCD EQU   FMCPSTAT                                                 04451000
FMCIDVFD EQU   FMCPSTAT                                                 04452000
FMCELKST EQU   FMCPSTAT                                                 04453000
FMCRSV88 EQU   FMCPSCMD                                                 04454000
FMCRDBLK EQU   FMCPSCMD                                                 04455000
FMCDSEOC EQU   FMCPSCMD                                                 04456000
FMCPURGE EQU   FMCPSCMD                                                 04457000
FMCRESTI EQU   FMCPSCMD                                                 04458000
FMCCNTCT EQU   FMCPSCMD                                                 04459000
FMCINVT  EQU   FMCPSCMD                                                 04460000
FMCFLGB7 EQU   FMCFLGCL                                                 04461000
FMCFLGB6 EQU   FMCFLGCL                                                 04462000
FMCFLGB5 EQU   FMCFLGCL                                                 04463000
FMCFLGB4 EQU   FMCFLGCL                                                 04464000
FMCFLGB3 EQU   FMCFLGCL                                                 04465000
FMCFLGB2 EQU   FMCFLGCL                                                 04466000
FMCFLGB1 EQU   FMCFLGCL                                                 04467000
FMCFLGB0 EQU   FMCFLGCL                                                 04468000
FMCFLGA7 EQU   FMCFLGA                                                  04469000
FMCFLGA6 EQU   FMCFLGA                                                  04470000
FMCFLGA5 EQU   FMCFLGA                                                  04471000
FMCFLGA4 EQU   FMCFLGA                                                  04472000
FMCFLGA3 EQU   FMCFLGA                                                  04473000
FMCFLGA2 EQU   FMCFLGA                                                  04474000
FMCFLGA1 EQU   FMCFLGA                                                  04475000
FMCFLGA0 EQU   FMCFLGA                                                  04476000
FMCDCLOK EQU   FMCCLEXT+12                                              04477000
FMCRAFM  EQU   FMCCLEXT+8                                               04478000
FMCFBPTR EQU   FMCFBA+1                                                 04479000
FMCFBRSV EQU   FMCFBA                                                   04480000
FMCRPLPT EQU   FMCRPLA+1                                                04481000
FMCRPLRS EQU   FMCRPLA                                                  04482000
FMCPRCLS EQU   FMCCVAL                                                  04483000
FMCIBCE  EQU   FMCCVAL                                                  04484000
FMCONLY  EQU   FMCOBCE                                                  04485000
FMCLAST  EQU   FMCOBCE                                                  04486000
FMCMIDLE EQU   FMCOBCE                                                  04487000
FMCFIRST EQU   FMCOBCE                                                  04488000
FMCCPCNT EQU   FMCPACPC                                                 04489000
FMCMPCNT EQU   FMCPACEM                                                 04490000
FMCNPCNT EQU   FMCPACEN                                                 04491000
FMCCONF  EQU   FMCSSTAT                                                 04492000
FMCPURCH EQU   FMCSSTAT                                                 04493000
FMCNSALU EQU   FMCSSTAT                                                 04494000
FMCBIP   EQU   FMCSSTAT                                                 04495000
FMCSDTR  EQU   FMCSSTAT                                                 04496000
FMCUIPI  EQU   FMCSSTAT                                                 04497000
FMCCIPI  EQU   FMCSSTAT                                                 04498000
FMCSNBI  EQU   FMCSSTAT                                                 04499000
FMCRVD01 EQU   ISTFMCB+158                                              04500000
FMCISSN  EQU   ISTFMCB+156                                              04501000
FMCOASN  EQU   FMCNXOSC                                                 04502000
FMCOSSN  EQU   FMCNXCFM                                                 04503000
FMCSIP   EQU   FMCSIPA                                                  04504000
FMCEXLST EQU   ISTFMCB+144                                              04505000
FMCPAB5  EQU   ISTFMCB+128                                              04506000
FMCPAB4  EQU   ISTFMCB+112                                              04507000
FMCPAB3  EQU   ISTFMCB+96                                               04508000
FMCPAB2  EQU   ISTFMCB+80                                               04509000
FMCPAB1  EQU   ISTFMCB+64                                               04510000
FMCFASYA EQU   ISTFMCB+60                                               04511000
FMCMODE  EQU   ISTFMCB+52                                               04512000
FMCPROCD EQU   ISTFMCB+48                                               04513000
FMCRPLH  EQU   ISTFMCB+40                                               04514000
FMCBUFNB EQU   FMCCMPS1+2                                               04515000
FMCBUFLM EQU   FMCCMPS1                                                 04516000
FMCDEBA  EQU   ISTFMCB+32                                               04517000
@NM00022 EQU   FMCCMDFL                                                 04518000
FMCSNA   EQU   FMCCMDFL                                                 04519000
FMCVSNA  EQU   FMCCMDFL                                                 04520000
@NM00021 EQU   ISTFMCB+30                                               04521000
@NM00020 EQU   FMCSTAT1                                                 04522000
FMCLTCLS EQU   FMCSTAT1                                                 04523000
FMCHPURG EQU   FMCSTAT1                                                 04524000
FMCVSP2  EQU   FMCSTAT1                                                 04525000
FMCVSP1  EQU   FMCSTAT                                                  04526000
FMCLTEAS EQU   FMCSTAT                                                  04527000
FMCZF007 EQU   FMCSTAT                                                  04528000
FMCDEDSC EQU   FMCSTAT                                                  04529000
FMCDEVOF EQU   FMCSTAT                                                  04530000
FMCDAPT  EQU   FMCSTAT                                                  04531000
FMCPRMTE EQU   FMCSTAT                                                  04532000
FMCPRMTR EQU   FMCSTAT                                                  04533000
FMCUSFLD EQU   ISTFMCB+24                                               04534000
FMCFMCBA EQU   ISTFMCB+20                                               04535000
FMCDVTA  EQU   ISTFMCB+12                                               04536000
FMCTSKID EQU   ISTFMCB+8                                                04537000
FMCNXTCB EQU   ISTFMCB+4                                                04538000
FMCSAF   EQU   ISTFMCB+2                                                04539000
FMCLNGTH EQU   ISTFMCB+1                                                04540000
FMCTYPE  EQU   ISTFMCB                                                  04541000
PROSRDEF EQU   PROSETM4                                                 04542000
PRORSV47 EQU   PROSETM4                                                 04543000
PROSCON  EQU   PROSETM4                                                 04544000
PRORSV46 EQU   PROSETM3                                                 04545000
PROSMONT EQU   PROSETM3                                                 04546000
PRORSV45 EQU   PROSETM3                                                 04547000
PROSNTO  EQU   PROSETM3                                                 04548000
PRORSV44 EQU   PROSETM3                                                 04549000
PRORSV43 EQU   PROSETM2                                                 04550000
PROSNTFL EQU   PROSETM2                                                 04551000
PRORSV42 EQU   PROSETM2                                                 04552000
PRORSV41 EQU   PROPROCS                                                 04553000
PROMODC  EQU   PROPROC4                                                 04554000
PROMODT  EQU   PROPROC4                                                 04555000
PROMODM  EQU   PROPROC4                                                 04556000
PROMODB  EQU   PROPROC4                                                 04557000
PRORSV14 EQU   PROPROC4                                                 04558000
PRORSV13 EQU   PROPROC4                                                 04559000
PRORSV12 EQU   PROPROC4                                                 04560000
PROEIB   EQU   PROPROC4                                                 04561000
PROMONT3 EQU   PROPROC3                                                 04562000
PROMONT2 EQU   PROPROC3                                                 04563000
PROMONIT EQU   PROPROC3                                                 04564000
PROSUBLK EQU   PROPROC3                                                 04565000
PRONTO   EQU   PROPROC3                                                 04566000
PROLGIN  EQU   PROPROC3                                                 04567000
PROERPI  EQU   PROPROC3                                                 04568000
PRORSV07 EQU   PROPROC3                                                 04569000
PROCFTX  EQU   PROPROC2                                                 04570000
PROEMLC  EQU   PROPROC2                                                 04571000
PRONTFL  EQU   PROPROC2                                                 04572000
PRORSV05 EQU   PROPROC2                                                 04573000
PRORSV04 EQU   PROPROC2                                                 04574000
PROLGOT  EQU   PROPROC2                                                 04575000
PROERPO  EQU   PROPROC2                                                 04576000
PRORSV03 EQU   PROPROC2                                                 04577000
PRORPLC  EQU   PROPROC1                                                 04578000
PROCS    EQU   PROPROC1                                                 04579000
PROCA    EQU   PROPROC1                                                 04580000
PRORESPX EQU   PROPROC1                                                 04581000
PRODFASY EQU   PROPROC1                                                 04582000
PROXPOPT EQU   PROPROC1                                                 04583000
PROTRUNC EQU   PROPROC1                                                 04584000
PROASYIP EQU   PROPROC1                                                 04585000
PABRPHA  EQU   PABRPHFG+1                                               04586000
PABNODQ  EQU   PABFLAGS                                                 04587000
PABINHBT EQU   PABFLAGS                                                 04588000
PABERLOK EQU   PABERRLK                                                 04589000
PABSSN   EQU   PABFLAGS                                                 04590000
PABDYNAM EQU   PABFLAGS                                                 04591000
PABNORPR EQU   PABFLAGS                                                 04592000
PABPRIOR EQU   PABFLAGS                                                 04593000
PABAPYP  EQU   PABFLAGS                                                 04594000
PABDVTA  EQU   ISTPAB+9                                                 04595000
PABOFFST EQU   ISTPAB+8                                                 04596000
PABCHNGP EQU   PABCHAIN+1                                               04597000
PABRSV02 EQU   PABCHAIN                                                 04598000
PABDELAY EQU   PABCHAIN                                                 04599000
PABRUNNG EQU   PABCHAIN                                                 04600000
PABRESET EQU   PABCHAIN                                                 04601000
PABUNCON EQU   PABCHAIN                                                 04602000
PABCDP   EQU   PABCHAIN                                                 04603000
PABRESCH EQU   PABCHAIN                                                 04604000
PABCHNG  EQU   PABCHAIN                                                 04605000
PABWEQP  EQU   PABWEQA+1                                                04606000
PABRSV01 EQU   PABWEQA                                                  04607000
PABWEQG  EQU   PABWEQA                                                  04608000
PATRSV01 EQU   PATFLAGA                                                 04609000
PATUSEFG EQU   PATFLAGA                                                 04610000
PATRDCNT EQU   ISTPAT+6                                                 04611000
PATGRPID EQU   ISTPAT+5                                                 04612000
PATPTHID EQU   ISTPAT+4                                                 04613000
PATDINDX EQU   ISTPAT+2                                                 04614000
PATGINDX EQU   ISTPAT                                                   04615000
GNTGRPNM EQU   ISTGNT                                                   04616000
DNTTELNO EQU   ISTDNT+1                                                 04617000
DNTCTDIG EQU   ISTDNT                                                   04618000
RLSRSV02 EQU   ISTRLS+140                                               04619000
RLSRSV01 EQU   ISTRLS+138                                               04620000
RLSCTELU EQU   ISTRLS+136                                               04621000
RLSPRE   EQU   ISTRLS                                                   04622000
RDARSVPT EQU   ISTRDA+84                                                04623000
RDAPUBI  EQU   ISTRDA+83                                                04624000
RDADFCUA EQU   ISTRDA+80                                                04625000
RDACTPCC EQU   ISTRDA+79                                                04626000
RDADACUA EQU   ISTRDA+76                                                04627000
RDALUBA  EQU   RDAUCBAD+1                                               04628000
RDACHQI  EQU   RDAUCBAD                                                 04629000
RDARSV01 EQU   RDAFLAG                                                  04630000
RDARBISA EQU   RDAFLAG                                                  04631000
RDAPRE   EQU   ISTRDA                                                   04632000
RSWRSV01 EQU   ISTRSW+152                                               04633000
RSWRSV02 EQU   ISTRSW+150                                               04634000
RSWCTELU EQU   ISTRSW+148                                               04635000
RSWGRUPZ EQU   ISTRSW+146                                               04636000
RSWDIALZ EQU   ISTRSW+144                                               04637000
RSWGRUPT EQU   ISTRSW+140                                               04638000
RSWDIALT EQU   ISTRSW+136                                               04639000
RSWPRE   EQU   ISTRSW                                                   04640000
RLXRSV03 EQU   ISTRLX+80                                                04641000
RLXRSV02 EQU   ISTRLX+77                                                04642000
RLXRSV01 EQU   RLXFLAGA                                                 04643000
RLXINUSE EQU   RLXFLAGA                                                 04644000
RLXNLUX  EQU   ISTRLX+72                                                04645000
RLXPRE   EQU   ISTRLX                                                   04646000
RPXRSV01 EQU   ISTRPX+80                                                04647000
RPXRSV02 EQU   ISTRPX+77                                                04648000
RPXMAXLU EQU   ISTRPX+76                                                04649000
RPXFLUX  EQU   ISTRPX+72                                                04650000
RPXPRE   EQU   ISTRPX                                                   04651000
RLURSV02 EQU   ISTRLU+172                                               04652000
RLULGMOD EQU   ISTRLU+164                                               04653000
RLUMODEP EQU   RLUMODET+8                                               04654000
RLUMODEN EQU   RLUMODET                                                 04655000
RLUUSSPT EQU   RLUUSSTB+8                                               04656000
RLUUSSNM EQU   RLUUSSTB                                                 04657000
RLURSV01 EQU   ISTRLU+137                                               04658000
RLULOCAD EQU   ISTRLU+136                                               04659000
RLUNCPPM EQU   RLUNCPPC+1                                               04660000
RLUNCPPN EQU   RLUNCPPC                                                 04661000
RLUPACEM EQU   RLUPACE+1                                                04662000
RLUPACEN EQU   RLUPACE                                                  04663000
RLUINTA  EQU   ISTRLU+128                                               04664000
RLUSSCFM EQU   ISTRLU+127                                               04665000
RLUCRRSV EQU   RLUCRFLG                                                 04666000
RLUACTLU EQU   RLUCRFLG                                                 04667000
RLURSV00 EQU   RLUFLAG                                                  04668000
RLUGSTAT EQU   RLUFLAG                                                  04669000
RLUBATCH EQU   RLUFLAG                                                  04670000
RLURBISA EQU   RLUFLAG                                                  04671000
RLUTYPE  EQU   ISTRLU+124                                               04672000
RLUCRPR  EQU   ISTRLU                                                   04673000
RCCRVPT2 EQU   ISTRCC+144                                               04674000
RCCXTOSW EQU   ISTRCC+140                                               04675000
RCCSWTOX EQU   ISTRCC+136                                               04676000
RCCRSPT2 EQU   ISTRCC+133                                               04677000
RCCADDR  EQU   ISTRCC+132                                               04678000
RCCPASSL EQU   ISTRCC+131                                               04679000
RCCMXOUT EQU   ISTRCC+130                                               04680000
RCCMXDAT EQU   ISTRCC+128                                               04681000
RCCINDEX EQU   ISTRCC+126                                               04682000
RCCPATHZ EQU   ISTRCC+124                                               04683000
RCCPATHT EQU   ISTRCC+120                                               04684000
RCCDPQ   EQU   ISTRCC+116                                               04685000
RCCTPAB  EQU   ISTRCC+112                                               04686000
RCCRSV02 EQU   ISTRCC+109                                               04687000
RCCCRRSV EQU   RCCCRFLG                                                 04688000
RCCCTCFL EQU   RCCCRFLG                                                 04689000
RCCACTPU EQU   RCCCRFLG                                                 04690000
RCCNCSPL EQU   ISTRCC+104                                               04691000
RCCRPHCN EQU   ISTRCC+100                                               04692000
RCCEPAB  EQU   ISTRCC+96                                                04693000
RCCDPAB  EQU   ISTRCC+92                                                04694000
RCCVPAB  EQU   ISTRCC+88                                                04695000
@NM00019 EQU   ISTRCC+87                                                04696000
RCCSESCT EQU   ISTRCC+86                                                04697000
RCCIDNUM EQU   RCCID48+3                                                04698000
RCCIDBLK EQU   RCCID48+2                                                04699000
RCCIDPA2 EQU   RCCID48+1                                                04700000
RCCIDPUT EQU   RCCID48                                                  04701000
RCCIDPA1 EQU   RCCSTAID                                                 04702000
RCCCTELU EQU   ISTRCC+76                                                04703000
RCCCNCNT EQU   ISTRCC+75                                                04704000
RCCRTGOH EQU   RCCFLAGB                                                 04705000
RCCBRKCN EQU   RCCFLAGB                                                 04706000
RCCRESET EQU   RCCFLAGB                                                 04707000
RCCFINAL EQU   RCCFLAGB                                                 04708000
RCCBNNSP EQU   RCCFLAGB                                                 04709000
RCCIRETR EQU   RCCFLAGB                                                 04710000
RCCDIALP EQU   RCCFLAGB                                                 04711000
RCCDSTCT EQU   RCCFLAGB                                                 04712000
RCCCTPGD EQU   RCCFLAG                                                  04713000
RCCOUERP EQU   RCCFLAG                                                  04714000
RCCOHIMM EQU   RCCFLAG                                                  04715000
RCCLDISC EQU   RCCFLAG                                                  04716000
RCCCUDIE EQU   RCCFLAG                                                  04717000
RCCRBISA EQU   RCCFLAG                                                  04718000
RCCTYPE  EQU   ISTRCC+72                                                04719000
RCCPRE   EQU   ISTRCC                                                   04720000
DOTADTRM EQU   ISTDOT                                                   04721000
RDSADDOT EQU   ISTRDS+76                                                04722000
RDSCTATR EQU   ISTRDS+74                                                04723000
RDSCTTRM EQU   ISTRDS+72                                                04724000
RDSPRE   EQU   ISTRDS                                                   04725000
RINRSV05 EQU   ISTRIN+156                                               04726000
RINRSV04 EQU   ISTRIN+152                                               04727000
RINLOCRN EQU   ISTRIN+148                                               04728000
RINRSV02 EQU   ISTRIN+145                                               04729000
RTRCNCNT EQU   RINCNCNT                                                 04730000
RTRNCSPL EQU   RINNCSPL                                                 04731000
RTRRPHCN EQU   RINRPHCN                                                 04732000
RTRVPAB  EQU   RINVPAB                                                  04733000
RTRREMOT EQU   RINREMOT                                                 04734000
RTRRLDAF EQU   RINRLDAF                                                 04735000
RTRNODID EQU   RINNODID                                                 04736000
RINRSV01 EQU   RINDFD                                                   04737000
RTRLDISC EQU   RINLDISC                                                 04738000
RTRNODEF EQU   RINNODEF                                                 04739000
RTRREMPO EQU   RINREMPO                                                 04740000
RINCRPRE EQU   ISTRIN                                                   04741000
RTRRSV04 EQU   ISTRTR+210                                               04742000
RTRLCTI  EQU   ISTRTR+209                                               04743000
RTRIDCAS EQU   RTRBSCID+1                                               04744000
RTRIDLEN EQU   RTRBSCID                                                 04745000
RTRRSVDD EQU   ISTRTR+181                                               04746000
RTRRDFG  EQU   ISTRTR+180                                               04747000
RTRDIAA  EQU   ISTRTR+176                                               04748000
RTRPOLA  EQU   ISTRTR+172                                               04749000
RTRCADDR EQU   ISTRTR+164                                               04750000
RTRCTADR EQU   ISTRTR+162                                               04751000
RTRCTPOL EQU   ISTRTR+160                                               04752000
RTRCTDIA EQU   ISTRTR+158                                               04753000
RTRRSV03 EQU   ISTRTR+156                                               04754000
RTRRVPT1 EQU   ISTRTR+152                                               04755000
RTRBHSN1 EQU   ISTRTR+144                                               04756000
RTRCRSV2 EQU   RTRCRFLG                                                 04757000
RTRDTRLM EQU   RTRLSCMD                                                 04758000
RTRCRSV1 EQU   RTRCRFLG                                                 04759000
RTRTRMAX EQU   ISTRTR+142                                               04760000
RTRRSV24 EQU   RTRRDFF                                                  04761000
RTRRFDEK EQU   RTRRDFF                                                  04762000
RTRRFANK EQU   RTRRDFF                                                  04763000
RTRRFPFK EQU   RTRRDFF                                                  04764000
RTRRFPEN EQU   RTRRDFF                                                  04765000
RTRRFXCT EQU   RTRRDFF                                                  04766000
RTRRESCT EQU   RTRRDFE                                                  04767000
RTRRESUP EQU   RTRRDFE                                                  04768000
RTRREATT EQU   RTRRDFE                                                  04769000
RTRRECHK EQU   RTRRDFE                                                  04770000
RTRREACR EQU   RTRRDFE                                                  04771000
RTRRSV0A EQU   RTRRDFE                                                  04772000
RTRREBRK EQU   RTRRDFE                                                  04773000
RTRRSV11 EQU   RTRRDFD                                                  04774000
RTRRSV10 EQU   RTRRDFD                                                  04775000
RTRRDBHI EQU   RTRRDFD                                                  04776000
RTRRDBHD EQU   RTRRDFD                                                  04777000
RTRRDBHN EQU   RTRRDFD                                                  04778000
RTRRSV23 EQU   RTRRDFC                                                  04779000
RTRRCXMS EQU   RTRRDFC                                                  04780000
RTRRCMSG EQU   RTRRDFC                                                  04781000
RTRRCBLK EQU   RTRRDFC                                                  04782000
RTRRCPT3 EQU   RTRRDFC                                                  04783000
RTRRCIT2 EQU   RTRRDFC                                                  04784000
RTRRCIT1 EQU   RTRRDFC                                                  04785000
RTRRSV32 EQU   RTRRDFB                                                  04786000
RTRRBEND EQU   RTRRDFB                                                  04787000
RTRRBECT EQU   RTRRDFB                                                  04788000
RTRRSV02 EQU   RTRRDFA                                                  04789000
RTRRACTR EQU   RTRRDFA                                                  04790000
RTRRSV60 EQU   RTRRDFA                                                  04791000
RTRRACDT EQU   RTRRDFA                                                  04792000
RTRRAPT3 EQU   RTRRAALL                                                 04793000
RTRRAPT2 EQU   RTRRAALL                                                 04794000
RTRRAPT1 EQU   RTRRAALL                                                 04795000
RTRRAATN EQU   RTRRDFA                                                  04796000
RTRRSV45 EQU   ISTRTR+132                                               04797000
RTRRSV01 EQU   ISTRTR+130                                               04798000
RTRCTECM EQU   ISTRTR+128                                               04799000
RTRADRPT EQU   RTRADR+1                                                 04800000
RTRRSV22 EQU   RTRFLAG                                                  04801000
RTRVTERM EQU   RTRFLAG                                                  04802000
RTRRSV51 EQU   RTRFLAG                                                  04803000
RTRRBISA EQU   RTRFLAG                                                  04804000
RTRRSV21 EQU   RTRFLAG                                                  04805000
RTRCRPR  EQU   ISTRTR                                                   04806000
RCLRVPT2 EQU   ISTRCL+92                                                04807000
RCLRVPT1 EQU   ISTRCL+88                                                04808000
RCLGPOLA EQU   ISTRCL+84                                                04809000
RCLCTNGP EQU   ISTRCL+82                                                04810000
RCLRSV01 EQU   ISTRCL+80                                                04811000
RCLCTECM EQU   ISTRCL+78                                                04812000
RCLCTETR EQU   ISTRCL+76                                                04813000
RCLGPADR EQU   RCLADR+1                                                 04814000
RCLRSV33 EQU   RCLFLAG                                                  04815000
RCLBATCH EQU   RCLFLAG                                                  04816000
RCLRBISA EQU   RCLFLAG                                                  04817000
RCLRSV22 EQU   RCLFLAG                                                  04818000
RCLPRE   EQU   ISTRCL                                                   04819000
RPTRSV03 EQU   ISTRPT+156                                               04820000
RPTRSV02 EQU   ISTRPT+152                                               04821000
RPTNSNSV EQU   ISTRPT+148                                               04822000
RPTPTHCT EQU   ISTRPT+146                                               04823000
RPTPEPCT EQU   ISTRPT+144                                               04824000
RPTDAFSV EQU   ISTRPT+142                                               04825000
RPTRSV01 EQU   ISTRPT+141                                               04826000
RPTISTAT EQU   RPTFLAG1                                                 04827000
RPTDYNAM EQU   RPTFLAG1                                                 04828000
RPTVYIMM EQU   RPTFLAG1                                                 04829000
RPTVIODN EQU   RPTFLAG1                                                 04830000
RPTONLIN EQU   RPTFLAG1                                                 04831000
RPTHLVPD EQU   RPTFLAG1                                                 04832000
RPTVRYPD EQU   RPTFLAG1                                                 04833000
RPTASLEP EQU   RPTFLAG1                                                 04834000
RPTUTERM EQU   ISTRPT+136                                               04835000
RPTATERM EQU   ISTRPT+132                                               04836000
RPTDIVT  EQU   RPTDITT                                                  04837000
RPTCTNM  EQU   ISTRPT+120                                               04838000
RPTLNDAF EQU   RPTLNCID+2                                               04839000
RPTLNSAF EQU   RPTLNCID                                                 04840000
RPTLN    EQU   ISTRPT                                                   04841000
RLNRVPT2 EQU   ISTRLN+112                                               04842000
RLNNCSPL EQU   ISTRLN+108                                               04843000
RLNX2SW  EQU   ISTRLN+104                                               04844000
@NM00018 EQU   ISTRLN+103                                               04845000
RLNCRRSV EQU   RLNCRFLG                                                 04846000
RLNSWEP  EQU   RLNCRFLG                                                 04847000
RLNSVSKP EQU   RLNLSCMD                                                 04848000
RLNSESLM EQU   RLNLSCMD                                                 04849000
RLNNPRLM EQU   RLNLSCMD                                                 04850000
RLNSWNCP EQU   RLNCRFLG                                                 04851000
RLNACTLN EQU   RLNCRFLG                                                 04852000
RLNPAUSE EQU   ISTRLN+101                                               04853000
RLNPOLMT EQU   ISTRLN+100                                               04854000
RLNACTSN EQU   ISTRLN+98                                                04855000
RLNRESV1 EQU   ISTRLN+97                                                04856000
RLNACTRM EQU   ISTRLN+96                                                04857000
RLNCTSES EQU   ISTRLN+95                                                04858000
RLNRDSLM EQU   ISTRLN+94                                                04859000
RLNAUTOA EQU   ISTRLN+92                                                04860000
RLNRDFD  EQU   RLNRDF+3                                                 04861000
RLNRDFC  EQU   RLNRDF+2                                                 04862000
RLNMULTP EQU   RLNRDFB                                                  04863000
RLNRATRN EQU   RLNRDFB                                                  04864000
RLNRAPOL EQU   RLNRDFB                                                  04865000
RLNTTV   EQU   RLNRDFB                                                  04866000
RLNRSV0B EQU   RLNRDFB                                                  04867000
RLNAUTOD EQU   RLNRDFB                                                  04868000
RLNANSWR EQU   RLNRDFB                                                  04869000
RLNRBUSE EQU   RLNRDFB                                                  04870000
RLNRAPEP EQU   RLNRDFA                                                  04871000
RLNRANCP EQU   RLNRDFA                                                  04872000
RLNRAEP  EQU   RLNRDFA                                                  04873000
RLNIDV   EQU   RLNRDFA                                                  04874000
RLNPORT  EQU   RLNRDFA                                                  04875000
RLNGANSW EQU   RLNRDFA                                                  04876000
RLNRACAN EQU   RLNRACNT                                                 04877000
RLNRACAT EQU   RLNRACNT                                                 04878000
RLNRSV04 EQU   RLNSTAT2                                                 04879000
RLNINUSE EQU   RLNSTAT2                                                 04880000
RLNOHIN  EQU   RLNSTAT2                                                 04881000
RLNRSV03 EQU   RLNSTAT1                                                 04882000
RLNVD    EQU   RLNSTAT1                                                 04883000
RLNINOPP EQU   RLNSTAT1                                                 04884000
RLNINOPL EQU   RLNSTAT1                                                 04885000
RLNLRST  EQU   RLNSTAT1                                                 04886000
RLNTRAP  EQU   RLNSTAT1                                                 04887000
RLNACTCT EQU   ISTRLN+84                                                04888000
RLNCTECM EQU   ISTRLN+82                                                04889000
RLNCTEIN EQU   ISTRLN+80                                                04890000
RLNCTETR EQU   ISTRLN+78                                                04891000
RLNCTECL EQU   ISTRLN+76                                                04892000
RLNCUA   EQU   RLNUCBAD                                                 04893000
RLNRSV01 EQU   RLNFLAG                                                  04894000
RLNRBISA EQU   RLNFLAG                                                  04895000
RLNEAM   EQU   RLNFLAG                                                  04896000
RLNPRE   EQU   ISTRLN                                                   04897000
RGPRVPT2 EQU   ISTRGP+88                                                04898000
RGPRVPT1 EQU   ISTRGP+84                                                04899000
RGPCTECM EQU   ISTRGP+82                                                04900000
RGPCTEIN EQU   ISTRGP+80                                                04901000
RGPCTETR EQU   ISTRGP+78                                                04902000
RGPCTECL EQU   ISTRGP+76                                                04903000
RGPCTELN EQU   ISTRGP+74                                                04904000
RGPRSV03 EQU   ISTRGP+73                                                04905000
RGPRSV02 EQU   RGPFLG                                                   04906000
RGPASDLC EQU   RGPFLG                                                   04907000
RGPABSC  EQU   RGPFLG                                                   04908000
RGPASS   EQU   RGPFLG                                                   04909000
RGPADIL  EQU   RGPFLG                                                   04910000
RGPPRE   EQU   ISTRGP                                                   04911000
RRNRINNM EQU   ISTRRN+248                                               04912000
@NM00017 EQU   ISTRRN+247                                               04913000
RRNRDCUA EQU   ISTRRN+244                                               04914000
RRNLASTE EQU   ISTRRN+240                                               04915000
RRNNCSPL EQU   ISTRRN+236                                               04916000
RRNRPLPT EQU   ISTRRN+232                                               04917000
RRNMSIZE EQU   ISTRRN+228                                               04918000
RRNNCPNM EQU   ISTRRN+221                                               04919000
RRNCTPCC EQU   ISTRRN+220                                               04920000
RRNHBUFS EQU   ISTRRN+218                                               04921000
RRNHLENT EQU   RRNHPRE+1                                                04922000
RRNHLENH EQU   RRNHPRE                                                  04923000
RRNNMNCP EQU   ISTRRN+208                                               04924000
RRNDELAY EQU   ISTRRN+206                                               04925000
RRNRSV04 EQU   ISTRRN+200                                               04926000
RRNRSV88 EQU   RRNNMDPD+7                                               04927000
RRNPUBI  EQU   RRNNMDPD+6                                               04928000
RRNDPLUB EQU   RRNNMDPD                                                 04929000
RRNEPADR EQU   ISTRRN+190                                               04930000
RRNCPLUB EQU   ISTRRN+184                                               04931000
RRNFLUX  EQU   ISTRRN+180                                               04932000
RRNRSV05 EQU   RRNCMFD                                                  04933000
RRNREMPO EQU   RRNCMFD                                                  04934000
RRNCDREC EQU   RRNCMFD                                                  04935000
RRNCDDSI EQU   RRNCMFD                                                  04936000
RRNCDBCK EQU   RRNCMFD                                                  04937000
RRNCDDTL EQU   RRNCMFD                                                  04938000
RRNCDSTD EQU   RRNCMFD                                                  04939000
RRNCDCSP EQU   RRNCMFD                                                  04940000
RRNCCCSL EQU   RRNCMFC                                                  04941000
RRNCCSIM EQU   RRNCMFC                                                  04942000
RRNCCRCM EQU   RRNCMFC                                                  04943000
RRNCCRIM EQU   RRNCMFC                                                  04944000
RRNCCCRC EQU   RRNCMFC                                                  04945000
RRNCCRST EQU   RRNCMFC                                                  04946000
RRNCCRDQ EQU   RRNCMFC                                                  04947000
RRNCCRCN EQU   RRNCMFC                                                  04948000
RRNCBALT EQU   RRNCMFB                                                  04949000
RRNCBMOD EQU   RRNCMFB                                                  04950000
RRNCBNPL EQU   RRNCMFB                                                  04951000
RRNCBRLS EQU   RRNCMFB                                                  04952000
RRNCBRDS EQU   RRNCMFB                                                  04953000
RRNCBDLR EQU   RRNCMFB                                                  04954000
RRNCBDLH EQU   RRNCMFB                                                  04955000
RRNCBDLO EQU   RRNCMFB                                                  04956000
RRNCADGO EQU   RRNCMFA                                                  04957000
RRNCADTD EQU   RRNCMFA                                                  04958000
RRNCACDT EQU   RRNCMFA                                                  04959000
RRNCAMBH EQU   RRNCMFA                                                  04960000
RRNCAATI EQU   RRNCMFA                                                  04961000
RRNCAATG EQU   RRNCMFA                                                  04962000
RRNCAATD EQU   RRNCMFA                                                  04963000
RRNCAALL EQU   RRNCMFA                                                  04964000
RRNRSV55 EQU   RRNRDF+3                                                 04965000
RRNPTASL EQU   RRNRDFB+1                                                04966000
RRNRSV01 EQU   RRNRDFB+1                                                04967000
RRNVYDON EQU   RRNRDFB+1                                                04968000
RRNRBBUP EQU   RRNRDFB+1                                                04969000
RRNRSV03 EQU   RRNRDFB                                                  04970000
RRNRBCT2 EQU   RRNRDFB                                                  04971000
RRNRBCT1 EQU   RRNRDFB                                                  04972000
RRNRBSEC EQU   RRNRDFB                                                  04973000
RRNRBCCT EQU   RRNRDFB                                                  04974000
RRNRBCCL EQU   RRNRDFB                                                  04975000
RRNRSV02 EQU   RRNRDFB                                                  04976000
RRNRBMDL EQU   RRNRDFB                                                  04977000
RRNRAPEP EQU   RRNRDFA                                                  04978000
RRNRANCP EQU   RRNRDFA                                                  04979000
RRNRBREM EQU   RRNRDFA                                                  04980000
RRNRAOLT EQU   RRNRDFA                                                  04981000
RRNRASYN EQU   RRNRDFA                                                  04982000
RRNRADMP EQU   RRNRDFA                                                  04983000
RRNRAIPL EQU   RRNRDFA                                                  04984000
RRNRASHT EQU   RRNRDFA                                                  04985000
RRNCTENT EQU   ISTRRN+170                                               04986000
RRNCTECM EQU   ISTRRN+168                                               04987000
RRNCTEIN EQU   ISTRRN+166                                               04988000
RRNCTETR EQU   ISTRRN+164                                               04989000
RRNCTECL EQU   ISTRRN+162                                               04990000
RRNCTELI EQU   ISTRRN+160                                               04991000
RRNCTEGP EQU   ISTRRN+158                                               04992000
RRNCTBHS EQU   ISTRRN+156                                               04993000
RRNBHSET EQU   ISTRRN+152                                               04994000
RRNTRENT EQU   ISTRRN+148                                               04995000
RRNRLDIP EQU   ISTRRN+147                                               04996000
RRNRNCUA EQU   ISTRRN+144                                               04997000
RRNGRPA  EQU   ISTRRN+140                                               04998000
RRNLUBA  EQU   RRNUCBAD+1                                               04999000
RRNCHQI  EQU   RRNUCBAD                                                 05000000
RRNRSV11 EQU   RRNFLAG                                                  05001000
RRNDSTCT EQU   RRNFLAG                                                  05002000
RRNERPIP EQU   RRNFLAG                                                  05003000
RRNLCDIP EQU   RRNFLAG                                                  05004000
RRNLCDIE EQU   RRNFLAG                                                  05005000
RRNLCSIP EQU   RRNFLAG                                                  05006000
RRNRBISA EQU   RRNFLAG                                                  05007000
RRNRSV89 EQU   RRNFLAG                                                  05008000
RRNPRE   EQU   ISTRRN                                                   05009000
RLCRVPT2 EQU   ISTRLC+80                                                05010000
RLCRVPT1 EQU   ISTRLC+79                                                05011000
RLCLCCUA EQU   ISTRLC+76                                                05012000
RLCUCBAD EQU   RLCADR+1                                                 05013000
RLCRSVDE EQU   RLCFLAG                                                  05014000
RLCACNT  EQU   RLCFLAG                                                  05015000
RLCRSV14 EQU   RLCFLAG                                                  05016000
RLCRBISA EQU   RLCFLAG                                                  05017000
RLCRSV22 EQU   RLCFLAG                                                  05018000
RLCPRE   EQU   ISTRLC                                                   05019000
RAPRVPT2 EQU   ISTRAP+116                                               05020000
RAPRVPT1 EQU   ISTRAP+112                                               05021000
RAPBFACT EQU   ISTRAP+111                                               05022000
RAPRSV17 EQU   RAPFLGC                                                  05023000
RAPRSV16 EQU   RAPFLGC                                                  05024000
RAPRSV15 EQU   RAPFLGC                                                  05025000
RAPRSV14 EQU   RAPFLGC                                                  05026000
RAPRSV13 EQU   RAPFLGC                                                  05027000
RAPRSV12 EQU   RAPFLGC                                                  05028000
RAPRSV11 EQU   RAPFLGC                                                  05029000
RAPRSV10 EQU   RAPFLGC                                                  05030000
RAPANVPC EQU   RAPFLGB                                                  05031000
RAPASPO  EQU   RAPFLGB                                                  05032000
RAPAPPO  EQU   RAPFLGB                                                  05033000
RAPAACQ  EQU   RAPFLGB                                                  05034000
RAPAPRMT EQU   RAPFLGB                                                  05035000
RAPAPASS EQU   RAPFLGB                                                  05036000
RAPABLCK EQU   RAPFLGB                                                  05037000
RAPALLF  EQU   RAPFLGB                                                  05038000
RAPRSV06 EQU   RAPFLG                                                   05039000
RAPRSV05 EQU   RAPFLG                                                   05040000
RAPRSV04 EQU   RAPFLG                                                   05041000
RAPRSV03 EQU   RAPFLG                                                   05042000
RAPATLGN EQU   RAPFLG                                                   05043000
RAPASLGI EQU   RAPFLG                                                   05044000
RAPAQUI  EQU   RAPFLG                                                   05045000
RAPABLGN EQU   RAPFLG                                                   05046000
RAPACEQD EQU   ISTRAP+106                                               05047000
RAPTRPRE EQU   ISTRAP+104                                               05048000
RAPACEAP EQU   ISTRAP+100                                               05049000
RAPICEAQ EQU   ISTRAP+96                                                05050000
RAPICEAC EQU   ISTRAP+92                                                05051000
RAPICELG EQU   ISTRAP+88                                                05052000
RAPAPPWD EQU   ISTRAP+80                                                05053000
RAPACDEB EQU   ISTRAP+76                                                05054000
RAPACBA  EQU   ISTRAP+72                                                05055000
RAPPRE   EQU   ISTRAP                                                   05056000
RDTVSRPL EQU   ISTRDT+132                                               05057000
RDTCRSPW EQU   ISTRDT+124                                               05058000
RDTCRSDS EQU   ISTRDT+116                                               05059000
@NM00016 EQU   ISTRDT+113                                               05060000
RRNSTCNT EQU   RDTSTCNT                                                 05061000
RRNVYRPH EQU   RDTVYRPH                                                 05062000
RDTTPAB  EQU   ISTRDT+104                                               05063000
RDTDPAB  EQU   ISTRDT+100                                               05064000
RDTEPAB  EQU   ISTRDT+96                                                05065000
RDTVPAB  EQU   ISTRDT+92                                                05066000
RDTRSV01 EQU   RDTFLAGB                                                 05067000
RDTBHSET EQU   RDTFLAGB                                                 05068000
RDTCTCFL EQU   RDTFLAGB                                                 05069000
RDTCTPGD EQU   RDTFLAGB                                                 05070000
RDTPRGDN EQU   RDTFLAGB                                                 05071000
RDTOUERP EQU   RDTFLAGB                                                 05072000
RDTLGCT  EQU   ISTRDT+90                                                05073000
RDTNODID EQU   ISTRDT+89                                                05074000
RDTMAXID EQU   ISTRDT+88                                                05075000
RDTCTSNT EQU   ISTRDT+86                                                05076000
RDTFLAGS EQU   ISTRDT+84                                                05077000
RDTBACK  EQU   ISTRDT+80                                                05078000
RDTFORW  EQU   ISTRDT+76                                                05079000
RDTLEN   EQU   RDTPLEN+1                                                05080000
RDTPRILS EQU   RDTPRIOR                                                 05081000
RDTPRISW EQU   RDTPRIOR                                                 05082000
RDTPRIRN EQU   RDTPRIOR                                                 05083000
RDTPRILC EQU   RDTPRIOR                                                 05084000
RDTPRIAP EQU   RDTPRIOR                                                 05085000
@NM00015 EQU   RDTPRIOR                                                 05086000
RDTPRE   EQU   ISTRDT                                                   05087000
RCPRSV05 EQU   ISTRCPRE+120                                             05088000
RCPRSV04 EQU   ISTRCPRE+116                                             05089000
RCPRSV03 EQU   ISTRCPRE+112                                             05090000
RCPINTA  EQU   RCPLGNIN+16                                              05091000
RCPLGNCT EQU   RCPLGNIN+8                                               05092000
RCPLGNAP EQU   RCPLGNIN                                                 05093000
@NM00014 EQU   RCPPMODE                                                 05094000
RCPRRECD EQU   RCPPMODE                                                 05095000
RCPRBASC EQU   RCPPMODE                                                 05096000
RCPBFLIM EQU   ISTRCPRE+90                                              05097000
RCPBHSI2 EQU   ISTRCPRE+89                                              05098000
RCPBHSI1 EQU   ISTRCPRE+88                                              05099000
RCPACETR EQU   ISTRCPRE+84                                              05100000
RCPICEAQ EQU   ISTRCPRE+80                                              05101000
RCPLNAPA EQU   ISTRCPRE+76                                              05102000
RCPICELN EQU   ISTRCPRE+72                                              05103000
RCPPRE   EQU   ISTRCPRE                                                 05104000
RPRCONID EQU   ISTRPRE+63                                               05105000
RPRCLVPD EQU   RPRFLAGC                                                 05106000
RPRINIMM EQU   RPRFLAGD                                                 05107000
RPRRSV05 EQU   RPRFLAGD                                                 05108000
RPRCONP  EQU   RPRFLAGD                                                 05109000
RPRACTP  EQU   RPRFLAGD                                                 05110000
RPRRSON  EQU   RPRFLAGD                                                 05111000
RPRCONCT EQU   RPRFLAGD                                                 05112000
RPRLTASN EQU   RPRFLAGD                                                 05113000
RPRPTHCT EQU   ISTRPRE+60                                               05114000
RPRSWDAF EQU   ISTRPRE+58                                               05115000
RPRSTPCT EQU   ISTRPRE+56                                               05116000
RPRRVPT1 EQU   ISTRPRE+52                                               05117000
RPRDEVCH EQU   ISTRPRE+44                                               05118000
RPRNCBA  EQU   ISTRPRE+40                                               05119000
RPRLGONB EQU   ISTRPRE+32                                               05120000
RPRLGONF EQU   ISTRPRE+28                                               05121000
RPRHDTYP EQU   ISTRPRE+27                                               05122000
RPRTIOCT EQU   ISTRPRE+26                                               05123000
RPRPEPCT EQU   ISTRPRE+24                                               05124000
RPRRSV03 EQU   RPRCAUSE                                                 05125000
RPRRSYNC EQU   RPRCAUSE                                                 05126000
RPRCRCPT EQU   RPRCAUSE                                                 05127000
RPRNOSRT EQU   RPRCAUSE                                                 05128000
RPRINTST EQU   RPRFLAGB                                                 05129000
RPRVYIMM EQU   RPRFLAGB                                                 05130000
RPRONLIN EQU   RPRFLAGB                                                 05131000
RPRVIODN EQU   RPRFLAGB                                                 05132000
RPRAOPN  EQU   RPRFLAGB                                                 05133000
RPRENTVT EQU   RPRFLAGB                                                 05134000
RPRENTVH EQU   RPRFLAGB                                                 05135000
RPRLIVE  EQU   RPRFLAGA                                                 05136000
RPRENTED EQU   RPRFLAGA                                                 05137000
RPRENTIO EQU   RPRFLAGA                                                 05138000
RPRENTBF EQU   RPRFLAGA                                                 05139000
RPRTIED  EQU   RPRFLAGA                                                 05140000
RPRINV   EQU   RPRFLAGA                                                 05141000
RPRACT   EQU   RPRFLAGA                                                 05142000
RPRPELEN EQU   ISTRPRE+18                                               05143000
RPRELEN  EQU   ISTRPRE+16                                               05144000
RPRRLOCK EQU   ISTRPRE+12                                               05145000
RPRSAF   EQU   RPRCOMID                                                 05146000
RPRNAME  EQU   ISTRPRE                                                  05147000
DEVRSV03 EQU   ISTDEVCH+5                                               05148000
DEVPHYSA EQU   ISTDEVCH+4                                               05149000
DEVCSLPN EQU   DEVCHAR3                                                 05150000
DEVCSTCL EQU   DEVCHAR3                                                 05151000
DEVCCHEK EQU   DEVCHAR3                                                 05152000
DEVCATTN EQU   DEVCHAR3                                                 05153000
DEVCSWL  EQU   DEVFCCTL                                                 05154000
DEVCRVB  EQU   DEVFCCTL                                                 05155000
DEVCSSL  EQU   DEVFCCTL                                                 05156000
DEVCBSC  EQU   DEVFCCTL                                                 05157000
DEVMCODE EQU   ISTDEVCH+2                                               05158000
DEVCHAR2 EQU   DEVTCODE                                                 05159000
DEVRSV01 EQU   DEVCHAR                                                  05160000
DEVCCTL  EQU   DEVCHAR                                                  05161000
DEVNNSPT EQU   DEVCHAR                                                  05162000
DEVSPS   EQU   DEVCHAR                                                  05163000
DEVSUBND EQU   DEVCHAR                                                  05164000
DEVCONVR EQU   DEVCHAR                                                  05165000
DEVOTPUT EQU   DEVCHAR                                                  05166000
DEVINPUT EQU   DEVCHAR                                                  05167000
LOKXCL   EQU   @NM00012                                                 05168000
LOKPRY   EQU   @NM00012                                                 05169000
@NM00013 EQU   @NM00012                                                 05170000
@NM00011 EQU   LOKCHNG                                                  05171000
LOKCT    EQU   ISTLOK                                                   05172000
MGLRU    EQU   MGLRUFLD+1                                               05173000
MGLRUL   EQU   MGLRUFLD                                                 05174000
MGLVDTXT EQU   MGLUSSTX+1                                               05175000
MGLTXTL  EQU   MGLUSSTX                                                 05176000
MGLMSGID EQU   MGLUSSMG+1                                               05177000
MGLMSGL  EQU   MGLUSSMG                                                 05178000
MGLNS2   EQU   MGLSENSE+1                                               05179000
MGLNS1   EQU   MGLSENSE                                                 05180000
@NM00010 EQU   MGLUSSFL                                                 05181000
MGLCMPAT EQU   MGLUSSFL                                                 05182000
FSBFDB   EQU   ISTFSB+32                                                05183000
FSBRSV01 EQU   FSBFSB+30                                                05184000
FSBTHCNT EQU   FSBFSB+28                                                05185000
FSBRLRSV EQU   FSBRLSTS                                                 05186000
FSBCFTX  EQU   FSBRLSTS                                                 05187000
FSBICNCB EQU   FSBMSGID                                                 05188000
FSBSSOC  EQU   FSBSS2                                                   05189000
FSBSSCC  EQU   FSBSS2                                                   05190000
FSBSSDC  EQU   FSBSS2                                                   05191000
FSBSSEC  EQU   FSBSS2                                                   05192000
FSBSSIR  EQU   FSBSS2                                                   05193000
FSBSSCR  EQU   FSBSS2                                                   05194000
@NM00008 EQU   FSBSS2                                                   05195000
@NM00007 EQU   FSBSS1                                                   05196000
FSBSSDE  EQU   FSBSS1                                                   05197000
FSBSSUS  EQU   FSBSS1                                                   05198000
@NM00006 EQU   FSBSS1                                                   05199000
FSBSOHI  EQU   FSBERC                                                   05200000
FSBLGI   EQU   FSBERC                                                   05201000
FSBLMRI  EQU   FSBFBMI                                                  05202000
FSBETI   EQU   FSBERC                                                   05203000
FSBEMI   EQU   FSBERC                                                   05204000
FSBEBI   EQU   FSBERC                                                   05205000
FSBECI   EQU   FSBERC                                                   05206000
FSBELI   EQU   FSBERC                                                   05207000
FSBMJRCD EQU   FSBSRCAT                                                 05208000
FSBXLCI  EQU   FSBXCODE                                                 05209000
FSBXFINS EQU   FSBXCODE                                                 05210000
FSBXNORM EQU   FSBXFSTS                                                 05211000
FSBSCODE EQU   FSBSYSRS                                                 05212000
FSBSPHSE EQU   FSBSYSRS                                                 05213000
FSBSERR  EQU   FSBSYSRS                                                 05214000
FSBCMD   EQU   FSBSEQ                                                   05215000
FSBDTRCE EQU   FSBFLAGS                                                 05216000
FSBASBTU EQU   FSBFLAGS                                                 05217000
FSBINPET EQU   FSBFLAGS                                                 05218000
FSBNONCB EQU   FSBFLAGS                                                 05219000
FSBLBIND EQU   FSBFLAGS                                                 05220000
FSBFFIND EQU   FSBFLAGS                                                 05221000
FSBACIND EQU   FSBFLAGS                                                 05222000
FSBRFIND EQU   FSBFLAGS                                                 05223000
FSBDAF   EQU   FSBCID+2                                                 05224000
FSBSAF   EQU   FSBCID                                                   05225000
FSBGATE  EQU   FSBFSBA                                                  05226000
FSBLATOP EQU   FSBSFLGS                                                 05227000
FSBRSV02 EQU   FSBSFLGS                                                 05228000
FSBPGBUF EQU   FSBSFLGS                                                 05229000
FSBMNSDA EQU   FSBMNRCD                                                 05230000
FSBMNOA  EQU   FSBMNRCD                                                 05231000
FSBMNDIF EQU   FSBMNRCD                                                 05232000
FSBMNEOP EQU   FSBMNRCD                                                 05233000
FSBMNDNU EQU   FSBMNRCD                                                 05234000
FSBMNATN EQU   FSBMNRCD                                                 05235000
FSBMNRVI EQU   FSBMNRCD                                                 05236000
FSBMNELI EQU   FSBMNRCD                                                 05237000
FSBLNGTH EQU   FSBFSB+1                                                 05238000
FSBTYPE  EQU   FSBFSB                                                   05239000
FDBOFSET EQU   ISTFDB+10                                                05240000
FDBDATCT EQU   ISTFDB+8                                                 05241000
FDBDATAA EQU   ISTFDB+4                                                 05242000
FDBFDBA  EQU   ISTFDB                                                   05243000
RHRSVD5  EQU   RH3                                                      05244000
RHRSVD4  EQU   RH3                                                      05245000
RHLOG    EQU   RH3                                                      05246000
RHRSVD3  EQU   RH3                                                      05247000
RHRCDIR  EQU   RH3                                                      05248000
RHCDIR   EQU   RH3                                                      05249000
RHEB     EQU   RH3                                                      05250000
RHBB     EQU   RH3                                                      05251000
RHPACE   EQU   RH2                                                      05252000
RHRSVD2  EQU   RH2                                                      05253000
RHINOP   EQU   RHRSVD1                                                  05254000
RHBUSY   EQU   RHRETRY                                                  05255000
RHEXCEPT EQU   RH2                                                      05256000
RHRRN    EQU   RH2                                                      05257000
RHPE     EQU   RH2                                                      05258000
RHFME    EQU   RH2                                                      05259000
RHCHAIN  EQU   RH1                                                      05260000
RHSENSE  EQU   RH1                                                      05261000
RHDIRI   EQU   RH1                                                      05262000
RHSCI    EQU   RH1                                                      05263000
RHTYPE   EQU   RH1                                                      05264000
RHQS     EQU   RH1                                                      05265000
NCSRUITS EQU   NCSUSSRU+2                                               05266000
NCSAPPAB EQU   NCSAPP+608                                               05267000
NCSAPDAT EQU   NCSAPBUE+8                                               05268000
NCSAPRU  EQU   NCSAPBUE+3                                               05269000
NCSRSV04 EQU   NCSAPBUE                                                 05270000
NCSAPEND EQU   NCSAPP+84                                                05271000
NCSAPTXT EQU   NCSAPP+76                                                05272000
NCSAPECB EQU   NCSAPP+72                                                05273000
NCSAPSA  EQU   NCSAPP                                                   05274000
NCSPLPDB EQU   NCSPLSID+5                                               05275000
NCSPLNID EQU   NCSPLPHD                                                 05276000
NCSPLPO  EQU   NCSPLSTA                                                 05277000
NCSRSVD4 EQU   NCSPLSTA                                                 05278000
NCSRSVD2 EQU   NCSCRMOD                                                 05279000
NCSPTMOD EQU   NCSCRMOD                                                 05280000
NCSAIMOD EQU   NCSCRMOD                                                 05281000
NCSRSVD1 EQU   NCSCHKPT+1                                               05282000
NCSPTUSE EQU   NCSCHKPT+1                                               05283000
NCSRNME  EQU   NCSCHKPT+1                                               05284000
NCSCUA   EQU   NCSCHKPT+1                                               05285000
NCSANSMD EQU   NCSCHKPT+1                                               05286000
NCSLGMOD EQU   NCSCHKPT                                                 05287000
NCSLGAPL EQU   NCSCHKPT                                                 05288000
NCSDTRLM EQU   NCSCHKPT                                                 05289000
NCSESLM  EQU   NCSCHKPT                                                 05290000
NCSNRPL  EQU   NCSCHKPT                                                 05291000
NCSPOLD  EQU   NCSCHKPT                                                 05292000
NCSPACTV EQU   NCSCHKPT                                                 05293000
NCSACTV  EQU   NCSCHKPT                                                 05294000
NCSCRDTE EQU   ISTNCSPL+264                                             05295000
NCSPLRTY EQU   ISTNCSPL+263                                             05296000
NCSCPWPT EQU   ISTNCSPL+248                                             05297000
NCSSENS2 EQU   NCSSENSE+2                                               05298000
NCSSNS2  EQU   NCSSENSE+1                                               05299000
NCSSNS1  EQU   NCSSENSE                                                 05300000
NCSPLNSN EQU   ISTNCSPL+240                                             05301000
NCSPLMID EQU   ISTNCSPL+232                                             05302000
NCSPLPID EQU   ISTNCSPL+231                                             05303000
NCSPLGID EQU   ISTNCSPL+230                                             05304000
NCSRNAME EQU   ISTNCSPL+220                                             05305000
NCSPLRUI EQU   ISTNCSPL+212                                             05306000
NCSPLRUO EQU   ISTNCSPL+208                                             05307000
NCSPLRRP EQU   ISTNCSPL+204                                             05308000
NCSPLWEL EQU   ISTNCSPL+200                                             05309000
NCSPLSPL EQU   ISTNCSPL+196                                             05310000
NCSPLP3  EQU   ISTNCSPL+192                                             05311000
NCSPLP2  EQU   ISTNCSPL+188                                             05312000
NCSPLP1  EQU   ISTNCSPL+184                                             05313000
NCSPLOLN EQU   ISTNCSPL+182                                             05314000
@NM00005 EQU   NCSPLFL5                                                 05315000
NCSFORCE EQU   NCSPLFL5                                                 05316000
NCSSDLK  EQU   NCSPLFL5                                                 05317000
NCSSCPPS EQU   NCSPLFL5                                                 05318000
NCSDLRSN EQU   ISTNCSPL+180                                             05319000
NCSPL2AP EQU   NCSPLFL4                                                 05320000
NCSDSPN  EQU   NCSPLFL4                                                 05321000
NCSDSPI  EQU   NCSPLFL4                                                 05322000
NCSDSPA  EQU   NCSPLFL4                                                 05323000
NCSDSPE  EQU   NCSPLFL4                                                 05324000
NCSPLVID EQU   NCSPLFL4                                                 05325000
NCSPLRSO EQU   NCSPLFL4                                                 05326000
NCSDLNID EQU   NCSPLFL4                                                 05327000
NCSEND   EQU   NCSPLFL3                                                 05328000
NCSFINAL EQU   NCSPLFL3                                                 05329000
NCSANS   EQU   NCSPLFL3                                                 05330000
NCSPID   EQU   NCSPLFL3                                                 05331000
NCSGID   EQU   NCSPLFL3                                                 05332000
NCSPLANS EQU   NCSPLFL3                                                 05333000
NCSEPP   EQU   NCSPLFL3                                                 05334000
NCSPLMOM EQU   NCSPLFL3                                                 05335000
NCSPLVIT EQU   NCSPLFL2                                                 05336000
NCSPLVIS EQU   NCSPLFL2                                                 05337000
NCSREMPO EQU   NCSPLFL2                                                 05338000
NCSPLDS  EQU   NCSPLFL2                                                 05339000
NCSOUFMC EQU   NCSPLFL2                                                 05340000
NCSPLRIO EQU   NCSPLFL2                                                 05341000
NCSPLRSF EQU   NCSPLFL2                                                 05342000
NCSPLVDP EQU   NCSPLFL2                                                 05343000
NCSPLPOS EQU   NCSPLFL1                                                 05344000
NCSPL2CN EQU   NCSPLFL1                                                 05345000
NCSPLAPU EQU   NCSPLFL1                                                 05346000
NCSPLNON EQU   NCSPLFL1                                                 05347000
NCSPLREQ EQU   NCSPLFL1                                                 05348000
NCSPLSOM EQU   NCSPLFL1                                                 05349000
NCSPL2IN EQU   NCSPLFL1                                                 05350000
NCSPLRCR EQU   ISTNCSPL+172                                             05351000
NCSPLECB EQU   ISTNCSPL+164                                             05352000
NCSPLRCD EQU   NCSPLRAD+1                                               05353000
NCSLSCMD EQU   NCSPLRAD                                                 05354000
NCSPLWRF EQU   ISTNCSPL+72                                              05355000
NCSPLWRE EQU   ISTNCSPL+68                                              05356000
NCSSTCMD EQU   NCSCRFLG                                                 05357000
NCSUSRNF EQU   NCSCRFLG                                                 05358000
NCSOPRQU EQU   NCSCRFLG                                                 05359000
NCSCRDSE EQU   NCSCRFLG                                                 05360000
NCSFMERP EQU   NCSCRFLG                                                 05361000
NCSFMCLD EQU   NCSCRFLG                                                 05362000
NCSPLCLD EQU   NCSCRFLG                                                 05363000
NCSPLWRM EQU   NCSCRFLG                                                 05364000
NCSPLUAD EQU   ISTNCSPL+64                                              05365000
NCSMSGSP EQU   ISTNCSPL+63                                              05366000
NCSNCPEP EQU   ISTNCSPL+62                                              05367000
NCSCMDB  EQU   NCSPLCMD+1                                               05368000
@NM00004 EQU   NCSCMDA                                                  05369000
NCSPLUFM EQU   NCSCMDA                                                  05370000
NCSPLFLO EQU   NCSCMDA                                                  05371000
NCSPLSYN EQU   NCSCMDA                                                  05372000
NCSPLCTL EQU   NCSCMDA                                                  05373000
NCSPLSYS EQU   NCSCMDA                                                  05374000
NCSPLLPT EQU   ISTNCSPL+56                                              05375000
NCSCRPID EQU   ISTNCSPL+51                                              05376000
NCSCRCMD EQU   ISTNCSPL+50                                              05377000
NCSDLID  EQU   ISTNCSPL+44                                              05378000
NCSPLLID EQU   ISTNCSPL+36                                              05379000
NCSPLRID EQU   ISTNCSPL+28                                              05380000
NCSRRNPT EQU   ISTNCSPL+24                                              05381000
NCSIORC  EQU   ISTNCSPL+23                                              05382000
NCSPRMRC EQU   ISTNCSPL+22                                              05383000
NCSOVFMC EQU   NCSPLVF1                                                 05384000
NCSRSV02 EQU   NCSPLVFL                                                 05385000
NCSDACLK EQU   NCSPLVFL                                                 05386000
NCSABCON EQU   NCSPLVFL                                                 05387000
NCSDCONT EQU   NCSPLVFL                                                 05388000
NCSVSTAT EQU   NCSPLVFL                                                 05389000
NCSVNCSA EQU   NCSPLVFL                                                 05390000
NCSVBF16 EQU   NCSPLVBF+1                                               05391000
NCSVBF15 EQU   NCSPLVBF+1                                               05392000
NCSVBF14 EQU   NCSPLVBF+1                                               05393000
NCSVBF13 EQU   NCSPLVBF+1                                               05394000
NCSVBF12 EQU   NCSPLVBF+1                                               05395000
NCSVBF11 EQU   NCSPLVBF+1                                               05396000
NCSVBF10 EQU   NCSPLVBF+1                                               05397000
NCSVBF09 EQU   NCSPLVBF+1                                               05398000
NCSVBF08 EQU   NCSPLVBF                                                 05399000
NCSVBF07 EQU   NCSPLVBF                                                 05400000
NCSVBF06 EQU   NCSPLVBF                                                 05401000
NCSVBF05 EQU   NCSPLVBF                                                 05402000
NCSVBF04 EQU   NCSPLVBF                                                 05403000
NCSVBF03 EQU   NCSPLVBF                                                 05404000
NCSVBF02 EQU   NCSPLVBF                                                 05405000
NCSVBF01 EQU   NCSPLVBF                                                 05406000
@NM00003 EQU   ISTNCSPL+16                                              05407000
NCSCRWKA EQU   NCSPFX+12                                                05408000
@NM00002 EQU   NCSPFX                                                   05409000
PFXBCK   EQU   ISTPFX+12                                                05410000
PFXFWD   EQU   ISTPFX+8                                                 05411000
PFXLNG   EQU   ISTPFX+5                                                 05412000
PFXPRTY  EQU   ISTPFX+4                                                 05413000
PFXCBID  EQU   PFXID                                                    05414000
POHID    EQU   ISTPOHD+2                                                05415000
POHGEN   EQU   POHSTAT                                                  05416000
POHRREQ  EQU   POHSTAT                                                  05417000
POHRSVD2 EQU   POHSTAT                                                  05418000
POHCNTRL EQU   POHSTAT                                                  05419000
POHLBL   EQU   POHSTAT                                                  05420000
POHDATA  EQU   POHSTAT                                                  05421000
POHEND   EQU   POHSTAT                                                  05422000
POHRSVD1 EQU   ISTPOHD                                                  05423000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      05424000
@RC00682 EQU   @RC00680                                                 05425000
BNDFAIL# EQU   @RC00680                                                 05426000
@RC00767 EQU   @RC00705                                                 05427000
@RC00793 EQU   @RC00787                                                 05428000
@RC00836 EQU   @RC00787                                                 05429000
@RC00955 EQU   @RC00949                                                 05430000
BNDFAIL@ EQU   @PB00002                                                 05431000
INVKFM@  EQU   @PB00003                                                 05432000
ENDSESS# EQU   @RC00682                                                 05433000
@RC00842 EQU   @RC00836                                                 05434000
@ENDDATA EQU   *                                                        05435000
         END   ISTINCSM,(C'PLS1823',0603,78109)                         05436000
