         TITLE 'ISTINCBL/ABL-VS1/MBL-VS2 BLDL FOR ALOAD PARAM          *00001000
                        '                                               00002000
ISTINCBL CSECT ,                                                   0001 00003000
ISTINFBL DS    0H                                                  0001 00004000
         ENTRY ISTINFBL                                                 00005000
@MAINENT DS    0H                                                  0001 00006000
         USING *,@15                                               0001 00007000
         B     @PROLOG                                             0001 00008000
         DC    AL2(@EP00001-@MAINENT)                                   00009000
         DC    AL1(16)                                             0001 00010000
         DC    C'ISTINCBL  76.236'                                 0001 00011000
         DROP  @15                                                      00012000
@PROLOG  ST    @14,12(,@13)                                        0001 00013000
         STM   @00,@12,20(@13)                                     0001 00014000
         BALR  @12,0                                               0001 00015000
@PSTART  DS    0H                                                  0001 00016000
         USING @PSTART,@12                                         0001 00017000
         AH    @15,4(,@15)                                         0001 00018000
         BR    @15                                                 0001 00019000
@EP00001 DS    0H                                                  0002 00020000
          LM  2,5,28(13)                                                00021000
          L   1,@SIZDATD                                                00022000
          ST  1,28(13)                                                  00023000
          LA  1,40(13)                                                  00024000
          ST  1,32(13)                                                  00025000
          LA  1,0                                                       00026000
          ST  1,36(13)                                                  00027000
          MVI 36(13),X'20'                                              00028000
          LA  1,28(13)                                                  00029000
          SVC 4                                                         00030000
*        IF R15^=0                                                 0021 00031000
*              THEN DO;                                            0021 00032000
         LTR   R15,R15                                             0021 00033000
         BZ    @RF00021                                            0021 00034000
*                   GEN;                                           0023 00035000
                      STM  2,5,28(13)                                   00036000
                      L   14,12(13)                                     00037000
                      LM  0,12,20(13)                                   00038000
                      BR   14                                           00039000
*             END;                                                 0024 00040000
*        GEN;                                                      0025 00041000
*                                                                  0025 00042000
@RF00021 DS    0H                                                  0025 00043000
          L  11,40(13)                                                  00044000
          STM  2,5,28(13)                                               00045000
          USING @DATD,11                                                00046000
          LM 0,1,20(13)                                                 00047000
          ST 11,8(13)                                                   00048000
          ST 13,@SA00001+4                                              00049000
          LR 13,11                                                      00050000
*    R4 = R1;                          /* INIT REG FOR TPMSG RTN     */ 00051000
         LR    R4,R1                                               0026 00052000
*   /*                                                               */ 00053000
*   /*   ISSUE BLDL MACRO ON PARM LIST IN REG0  REG1 IS DCB          */ 00054000
*   /*                                                               */ 00055000
*   R1 = LDPDCBA;                      /* INIT DCB ADDR              */ 00056000
         L     R1,LDPDCBA(,R4)                                     0027 00057000
*   GEN;                                                           0028 00058000
         BLDL  (R1),(R0)                                                00059000
*   /*                                                               */ 00060000
*   /*   TEST BLDL RETURN CODE IN REG15  ZERO=GOOD NOTZERO=FAILED    */ 00061000
*   /*                                                               */ 00062000
*   IF R15 ^= 0                        /* IS REGISTER 15 NON ZERO    */ 00063000
*     THEN                             /* YES THEN ERROR CONDITION   */ 00064000
         SLR   @14,@14                                             0029 00065000
         CR    R15,@14                                             0029 00066000
         BE    @RF00029                                            0029 00067000
*     DO;                              /* EXISTS                     */ 00068000
*     /*                                                             */ 00069000
*     /*  DETERMINE IF I/O ERROR OR MEMBER WAS NOT FOUND             */ 00070000
*     /*                                                             */ 00071000
*     IF LDPDCBA ^= 0                  /*  IS THERE A DCB ADDR       */ 00072000
*       THEN                           /* YES CONTINUE               */ 00073000
         C     @14,LDPDCBA(,R4)                                    0031 00074000
         BE    @RF00031                                            0031 00075000
*       DO;                            /* CHECK ERROR MESSAGE        */ 00076000
*     IF R15 = 4                       /* RTN CODE OF 04  IS NOT     */ 00077000
*       THEN                           /* FOUND CONDITION            */ 00078000
         C     R15,@CF00043                                        0033 00079000
         BNE   @RF00033                                            0033 00080000
*       DO;                            /* WRITE ERROR MESSAGE        */ 00081000
*     /*        ISSUE MESSAGE                                        */ 00082000
*                                                                  0035 00083000
*/*TPMSG MSGID('025I')MSG((R4))*/                                  0035 00084000
*                                                                  0035 00085000
*        DO;                                                       0035 00086000
*          DCL REG1004  REG(1)  PTR;                               0036 00087000
*          RFY (REG1004) RSTD;                                     0037 00088000
*                                                                  0037 00089000
*        RFY (EMCR13) RSTD;                                        0038 00090000
*          DCL 1 * BASED(REG1004),                                 0039 00091000
*              2 CMZID004 PTR(31),                                 0039 00092000
*              2 *,                                                0039 00093000
*                3 CMZRL004 PTR(8),                                0039 00094000
*                3 CMZRA004 PTR(24) BDY(BYTE),                     0039 00095000
*              2 CMZEA004 PTR(31),                                 0039 00096000
*              2 CMZVP004 PTR(31);                                 0039 00097000
*          DCL CMZPL004(4) FIXED INIT((4)0);                       0040 00098000
*          REG1004 = ADDR(CMZPL004);                               0041 00099000
         LA    REG1004,CMZPL004                                    0041 00100000
*          DCL CMZAA004 CHAR(4) INIT('025I');                      0042 00101000
*          CMZID004 = ADDR(CMZAA004);                              0043 00102000
         LA    @14,CMZAA004                                        0043 00103000
         ST    @14,CMZID004(,REG1004)                              0043 00104000
*          CMZVP004 = R4;                                          0044 00105000
         ST    R4,CMZVP004(,REG1004)                               0044 00106000
*          DCL CMZSA004 (18) PTR(31) BASED(EMCR13);                0045 00107000
*          DCL CMZZO004 (1) FIXED(31) INIT(0);                     0046 00108000
*          CMZSA004(5) = CMZZO004;                                 0047 00109000
*                                                                  0047 00110000
         L     @14,CMZZO004                                        0047 00111000
         ST    @14,CMZSA004+16(,EMCR13)                            0047 00112000
*          DCL REG15004 REG(15) PTR;                               0048 00113000
*          RFY REG15004 RSTD;                                      0049 00114000
*                                                                  0049 00115000
*        DO; /* LISATCVT CVTBASE(PAGEABLE,(REG15004)) */           0050 00116000
*                                                                  0050 00117000
*        RFY ISTLOK  ;                                             0051 00118000
*        RFY ISTRPH  ;                                             0052 00119000
*        RFY ISTATCVT;                                             0053 00120000
*          REG15004 = ATCLCPTR; /*SET UP ATCVT POINTER*/           0054 00121000
         L     REG15004,ATCLCPTR                                   0054 00122000
*        END; /*LISATCVT*/                                         0055 00123000
*          DCL CMTA004 BASED(REG15004) ENTRY VALUERANGE(*);        0056 00124000
*          REG15004 = REG15004->ATCMSGP;                           0057 00125000
         L     REG15004,ATCMSGP(,REG15004)                         0057 00126000
*          CALL CMTA004;                                           0058 00127000
         BALR  @14,@15                                             0058 00128000
*          RESPECIFY (REG1004,REG15004)  UNRESTRICTED;             0059 00129000
*                                                                  0059 00130000
*        RFY (EMCR13) UNRSTD;                                      0060 00131000
*        END;                                                      0061 00132000
*       END;                                                       0062 00133000
*       ELSE                                                       0063 00134000
*       /*                                                           */ 00135000
*       /* NOT RTN CODE 04 THEN ITS A PERMANENT I/O ERROR            */ 00136000
*       /*                                                           */ 00137000
*       DO;                                                        0063 00138000
         B     @RC00033                                            0063 00139000
@RF00033 DS    0H                                                  0064 00140000
*     /*       ISSUE MESSAGE                                         */ 00141000
*                                                                  0064 00142000
*/*TPMSG MSGID('013I')MSG((R4))*/                                  0064 00143000
*                                                                  0064 00144000
*         DO;                                                      0064 00145000
*           DCL REG1012  REG(1)  PTR;                              0065 00146000
*           RFY (REG1012) RSTD;                                    0066 00147000
*                                                                  0066 00148000
*         RFY (EMCR13) RSTD;                                       0067 00149000
*           DCL 1 * BASED(REG1012),                                0068 00150000
*               2 CMZID012 PTR(31),                                0068 00151000
*               2 *,                                               0068 00152000
*                 3 CMZRL012 PTR(8),                               0068 00153000
*                 3 CMZRA012 PTR(24) BDY(BYTE),                    0068 00154000
*               2 CMZEA012 PTR(31),                                0068 00155000
*               2 CMZVP012 PTR(31);                                0068 00156000
*           DCL CMZPL012(4) FIXED INIT((4)0);                      0069 00157000
*           REG1012 = ADDR(CMZPL012);                              0070 00158000
         LA    REG1012,CMZPL012                                    0070 00159000
*           DCL CMZAA012 CHAR(4) INIT('013I');                     0071 00160000
*           CMZID012 = ADDR(CMZAA012);                             0072 00161000
         LA    @14,CMZAA012                                        0072 00162000
         ST    @14,CMZID012(,REG1012)                              0072 00163000
*           CMZVP012 = R4;                                         0073 00164000
         ST    R4,CMZVP012(,REG1012)                               0073 00165000
*           DCL CMZSA012 (18) PTR(31) BASED(EMCR13);               0074 00166000
*           DCL CMZZO012 (1) FIXED(31) INIT(0);                    0075 00167000
*           CMZSA012(5) = CMZZO012;                                0076 00168000
*                                                                  0076 00169000
         L     @14,CMZZO012                                        0076 00170000
         ST    @14,CMZSA012+16(,EMCR13)                            0076 00171000
*           DCL REG15012 REG(15) PTR;                              0077 00172000
*           RFY REG15012 RSTD;                                     0078 00173000
*                                                                  0078 00174000
*         DO; /* LISATCVT CVTBASE(PAGEABLE,(REG15012)) */          0079 00175000
*           REG15012 = ATCLCPTR; /*SET UP ATCVT POINTER*/          0080 00176000
         L     REG15012,ATCLCPTR                                   0080 00177000
*         END; /*LISATCVT*/                                        0081 00178000
*           DCL CMTA012 BASED(REG15012) ENTRY VALUERANGE(*);       0082 00179000
*           REG15012 = REG15012->ATCMSGP;                          0083 00180000
         L     REG15012,ATCMSGP(,REG15012)                         0083 00181000
*           CALL CMTA012;                                          0084 00182000
         BALR  @14,@15                                             0084 00183000
*           RESPECIFY (REG1012,REG15012)  UNRESTRICTED;            0085 00184000
*                                                                  0085 00185000
*         RFY (EMCR13) UNRSTD;                                     0086 00186000
*         END;                                                     0087 00187000
*       END;                                                       0088 00188000
*       END;                                                       0089 00189000
@RC00033 DS    0H                                                  0090 00190000
*     R15 = 4;                         /* SET RETURN CODE BLDL FAILED*/ 00191000
@RF00031 LA    R15,4                                               0090 00192000
*     END;                             /* END THE NOT ZERO FUNTION   */ 00193000
*   /*                                                               */ 00194000
*   /*   EXIT ROUTINE RETURN TO CALLER REG15 HAS RTN CODE            */ 00195000
*   /*                                                               */ 00196000
*        GEN;                                                      0092 00197000
@RF00029 DS    0H                                                  0092 00198000
         L    13,4(13)                                                  00199000
         L    0,@SIZDATD                                                00200000
         LR   1,11                                                      00201000
         ST   15,16(13)     SAVE RETURN CODE                    OZ12763 00202000
         FREEMAIN  R,LV=(0),A=(1)                                       00203000
         LM   14,12,12(13)  RESTORE REGS                        OZ12763 00204000
         BR   14                                                        00205000
*   RETURN;                                                        0093 00206000
*                                                                  0093 00207000
@EL00001 L     @13,4(,@13)                                         0093 00208000
@EF00001 DS    0H                                                  0093 00209000
@ER00001 L     @14,12(,@13)                                        0093 00210000
         LM    @00,@12,20(@13)                                     0093 00211000
         BR    @14                                                 0093 00212000
*/* TPEPILOG   */                                                  0094 00213000
*  GEN (PRINT OFF);                                                0094 00214000
*                                                                  0094 00215000
         PRINT OFF                                                      00216000
*/* LOCKWORD FORMAT DSECT                                            */ 00217000
*/*  INITIAL LEVEL                                     001 05/24/74  */ 00218000
*DCL 1 ISTLOK BDY(WORD) BASED,                                     0095 00219000
*     2  LOKCT CHAR(1) BDY(WORD),       /* COUNT OF LOCK OWNERS      */ 00220000
*     2  LOKCHN PTR(24),                /* ADDR OF NEXT RPH WAITING     00221000
*                                          ON LOCK                   */ 00222000
*        3  LOKCHNG CHAR(3),            /* CHAIN/FLAGS               */ 00223000
*           4 *        CHAR(2),                                    0095 00224000
*           4 *        BIT(8),                                     0095 00225000
*             5 *        BIT(6),                                   0095 00226000
*             5  LOKPRY BIT(1),         /* PRIORITY FLAG, 1 = ON     */ 00227000
*             5  LOKXCL BIT(1);         /* EXCLUSIVE FLAG, 1 = ON    */ 00228000
*DCL LOKXCL1  BIT(32) CONSTANT('00000001'X); /* CONSTANT TO TURN LOKXCL 00229000
*                                          ON                        */ 00230000
*DCL LOKPRY1  BIT(32) CONSTANT('00000002'X); /* CONSTANT TO TURN LOKPRY 00231000
*                                          ON                        */ 00232000
*DCL LOKCHN1  BIT(32) CONSTANT('00FFFFFC'X); /* CONSTANT TO TURN LOKXCL 00233000
*                                          AND LOKPRY OFF            */ 00234000
*DCL LOKCT1   BIT(32) CONSTANT('01000000'X); /* CONSTANT TO MAKE LOKCT  00235000
*                                          = 1                       */ 00236000
*DCL LOKCT255 BIT(32) CONSTANT('FF000000'X); /* CONSTANT TO CHECK FOR   00237000
*                                          MAX LOKCT (255)           */ 00238000
*/* RPL HEADER                                                        * 00239000
*/*  REVISIONS                                         006 04/09/75   * 00240000
*DCL RPHPTR PTR(31) REGISTER(1) RESTRICTED;                        0101 00241000
*DCL  1  ISTRPH BDY(WORD) BASED(RPHPTR),                           0102 00242000
*       2  RPHCNTL FIXED(32),          /* CONTROL INFORMATION         * 00243000
*       3  RPHTYPE CHAR(1),            /* CONTROL BLOCK TYPE          * 00244000
*       3  RPHLNGTH PTR(8),            /* LENGTH IN BYTES             * 00245000
*       3  RPHFLAGS BIT(8),            /* SYSTEM DEPENDENT FLAGS      * 00246000
*         4  RPHOGIND BIT(1),          /* OPEN GATE INDICATOR         * 00247000
*         4  RPHSPGIN BIT(1),          /* SPECIAL GATE OPEN IND.      * 00248000
*         4  RPHAPTYP BIT(1),          /* APS IS A USER EXIT          * 00249000
*            5  RPHAUTEX BIT(1),        /*EXIT TO AUTHORIZED USER VS2 * 00250000
*         4  RPHSMQ BIT(1),            /* INDICATOR IF RPH IS TO BE   * 00251000
*                                      /* QUEUED                      * 00252000
*         4  RPHSMTYP BIT(1),          /* REQUEST TYPE IS BUFFER OR   * 00253000
*                                      /* DOUBLE-WORD                 * 00254000
*         4  RPHSMCLR BIT(1),          /* INDICATOR IF BUFFER TO BE   * 00255000
*                                      /* CLEARED                     * 00256000
*           4  RPHMLTCP BIT(1),        /* USED BY LOCAL 3270  SUPPORT * 00257000
*                                      /* WHEN BUILDING MULTIPLE CHAN * 00258000
*                                      /* PROGRAM                     * 00259000
*           4  RPHFSTLC BIT(1),        /* USED BY LOCAL 3270 SUPPORT  * 00260000
*                                      /* TO INDICATE FIRST LCCW      * 00261000
*              5  RPHFNFLG BIT(1),     /* LCCW SET FUNCTION FLAGS     * 00262000
*        3  RPHFLGB BIT(8),            /* SECOND FLAG BYTE            * 00263000
*           4  RPHLOCK BIT(1),         /* LOCKING OPTION              * 00264000
*           4  RPHBSSP BIT(1),         /* SYSTEM SERVICES PROGRESS    * 00265000
*           4  RPHFBAPS BIT(1),        /* STG. OBTAINED BY APS        * 00266000
*           4  RPHPGCMP BIT(1),        /* BIT ON INDICATES RESOURCE   * 00267000
*                                      /* MGR HAS COMPLETED UNLOCK    * 00268000
*           4  RPHNRSAV BIT(1),        /* DO NOT SAVE ON ACTIVATE     * 00269000
*           4  RPHRLCRA BIT(1),        /* RPH CAN BE RELEASED         * 00270000
*                                      /* WHEN PURGE COMPLETE         * 00271000
*           4  *        BIT(2),        /* RESERVED                    * 00272000
*       2  RPHRPHA PTR(31),            /* ADDR.OF NEXT RPL HEADER     * 00273000
*         3  RPHGATE BIT(1),           /* GATING FLAG                 * 00274000
*         3  *       BIT(7),           /* RESERVED                    * 00275000
*         3  RPHRPHAP PTR(24),                                     0102 00276000
*       2  RPHTSKID PTR(31),           /* TASK IDENTIFICATION         * 00277000
*                                      /* OR ADDR.OF APS TABLE        * 00278000
*          3  *     CHAR(3),           /* RPH TSK ID                  * 00279000
*          3  RPHTIK PTR(8),           /* TIK                         * 00280000
*       2  RPHDVTA PTR(31),            /* ADDR.OF  CURRENT DVT        * 00281000
*       2  RPHRESMA PTR(31) BDY(WORD), /* TPWAIT-POST INFO */      0102 00282000
*         3 RPHWPFLG CHAR(1),          /* WAIT-POST FLAGS */       0102 00283000
*           4 RPHRSKEY BIT(4),         /* STORAGE PROTECT KEY TO RESUME 00284000
*                                         PROCESSING                  * 00285000
*           4 RPHWT BIT(1),            /* WAIT BIT */              0102 00286000
*           4 RPHPT BIT(1),            /* POST BIT */              0102 00287000
*           4 RPHPURGE BIT(1),         /* RPH FLAGGED BY RECOVERY    */ 00288000
*                                      /* TO BE PURGED BY PSS        */ 00289000
*                                      /* VS/2 ONLY                  */ 00290000
*           4 RPHRSV01 BIT(1),        /* RESERVED                    */ 00291000
*         3 RPHRESUM PTR(24),          /* RESUME ADDRESS */        0102 00292000
*       2  RPHPABOF PTR(8),            /* OFFSET OF PAB IN CONTROL BLK* 00293000
*       2  RPHMAJCB PTR(24),           /* ADDR.OF MAJOR CONTROL BLOCK * 00294000
*       2  RPHWEA PTR(31),             /* ADDR.OF WORK ELEMENT        * 00295000
*         3  RPHCSPA PTR(31),          /* ADDR OF ISTCSP              * 00296000
*           4  RPHWEGT BIT(1),         /* GATE FOR WORK ELEMENT PROC. * 00297000
*       2  RPHSRPRM PTR(31),           /* SERVICE ROUTINE PARM.FIELD  * 00298000
*         3 RPHSRP12 FIXED(15),        /* COUNT OF Q'ED SMS REQUESTS  * 00299000
*         3 RPHSRP34 FIXED(15),        /* SIZE OF Q'ED SMS REQUESTS   * 00300000
*       2  RPHCRR PTR(31),             /* ADDR.OF COMPONENT RECOVERY  * 00301000
*                                      /* RECORD                      * 00302000
*       2  RPHPABQA PTR(31),           /* PAB QUEUE ADDRESS           * 00303000
*          3 RPHPABFG CHAR(1),         /* FLAG BYTE CARRIED FROM PAB  * 00304000
*          3 RPHPABQP PTR(24),         /* POINTER TO QUEUE OF PAB'S   * 00305000
*       2  RPHWORK CHAR(64) BDY(WORD), /* 16 WORD WORK AREA           * 00306000
*         3  RPHSAVE1 FIXED(31),       /*                             * 00307000
*           4  RPHSBYTE CHAR(1),       /* 1-BYTE SAVE FIELD           * 00308000
*           4  RPHSBITS BIT(8),        /* SAVE FIELD FOR FLAG BYTE    * 00309000
*              5  RPHSBIT1 BIT(1),     /* 1ST SAVE FIELD              * 00310000
*              5  RPHSBIT2 BIT(1),     /* 2ND SAVE FIELD              * 00311000
*              5  RPHSBIT3 BIT(1),     /* 3RD SAVE FIELD              * 00312000
*              5  RPHSBIT4 BIT(1),     /* 4TH SAVE FIELD              * 00313000
*              5  RPHSBIT5 BIT(1),     /* 5TH SAVE FIELD              * 00314000
*              5  RPHSBIT6 BIT(1),     /* 6TH SAVE FIELD              * 00315000
*              5  RPHSBIT7 BIT(1),     /* 7TH SAVE FIELD              * 00316000
*              5  RPHSBIT8 BIT(1),     /* 8TH SAVE FIELD              * 00317000
*           4  RPHSHALF FIXED(15),     /* HALF WORD SAVE AREA         * 00318000
*         3  RPHSAVE2 FIXED(31),       /*                             * 00319000
*         3  RPHSAVE3 FIXED(31),       /*                             * 00320000
*         3  RPHSAVE4 FIXED(31),       /*                             * 00321000
*         3  RPHSAVE5 FIXED(31),       /*                             * 00322000
*         3  RPHSAVE6 FIXED(31),       /*                             * 00323000
*         3  RPHSAVE7 FIXED(31),       /*                             * 00324000
*         3  RPHSAVE8 FIXED(31),       /*                             * 00325000
*         3  RPHSAVE9 FIXED(31),       /*                             * 00326000
*         3  RPHSAV10 FIXED(31),       /*                             * 00327000
*         3  RPHSAV11 FIXED(31),       /*                             * 00328000
*         3  RPHSAV12 FIXED(31),       /*                             * 00329000
*         3  RPHSAV13 FIXED(31),       /*                             * 00330000
*         3  RPHSAV14 FIXED(31),       /*                             * 00331000
*         3  RPHSAV15 FIXED(31),       /*                             * 00332000
*         3  RPHSAV16 FIXED(31),       /*                             * 00333000
*       2  RPHNEXPO PTR(31);           /* ADDR.NEXT RPH TO BE POSTED  * 00334000
* DCL RPTYPE BIT(8) CONSTANT('01'X);   /* TYPE CODE FOR RPH           * 00335000
* DCL RPHWT0 BIT(32) CONSTANT('F7FFFFFF'X);   /* TURN RPHWT OFF */ 0104 00336000
* DCL RPHWT1 BIT(32) CONSTANT('08000000'X);   /* TURN RPHWT ON */  0105 00337000
* DCL RPHPT0 BIT(32) CONSTANT('FBFFFFFF'X);   /* TURN RPHPT OFF */ 0106 00338000
* DCL RPHPT1 BIT(32) CONSTANT('04000000'X);   /* TURN RPHPT ON */  0107 00339000
* DCL RPHPABQ1 BIT(24) CONSTANT('000000'X); /* TURN RPHPBQ GATE */ 0108 00340000
*/*  REVISIONS                                         015 11/16/75   * 00341000
*DCL ATCLCPTR PTR LOCATION(1032);      /* POINTER TO ATCVT            * 00342000
*DCL  1  ISTATCVT BDY(DWORD) BASED,                                0110 00343000
*        2  ATCCOM BDY(WORD),          /* SYSTEM INDEPENDENT FIELDS   * 00344000
*           3  ATCSTAT CHAR(4),        /* VTAM  STATUS INDICATORS     * 00345000
*              4  ATCSTAT1 CHAR(1),    /* VTAM  STATUS BYTE 1         * 00346000
*                 5  ATCSTART BIT(1),  /* VTAM  IS STARTING           * 00347000
*                 5  ATCACTIV BIT(1),  /* VTAM  IS ACTIVE             * 00348000
*                 5  ATCSNHLT BIT(1),  /* VTAM  SESSION HALT          * 00349000
*                 5  ATCQKHLT BIT(1),  /* VTAM  QUICK HALT            * 00350000
*                 5  ATCNETSL BIT(1),  /* NETSOL=YES SPECIFIED ON CMD * 00351000
*                 5  ATCINHLT BIT(1),  /* INTERNAL VTAM HALT QUICK    * 00352000
*                 5  ATCMDHLT BIT(1),  /* VTAM CMD PROC HALTED        * 00353000
*                 5 * BIT(1),          /* RESERVED                    * 00354000
*              4  ATCSTFLG BIT(8),     /* STORAGE MANAGEMENT FLAGS    * 00355000
*                 5  ATCHSDMF BIT(1),  /* SYSTEM SLOW DOWN FLAG       * 00356000
*              4  ATCPOFLG BIT(8),     /* PROGRAM OPERATOR            * 00357000
*                                      /* INTERFACE FLAGS             * 00358000
*                 5 ATCPOUNS BIT(1),   /* APPLICATION AUTHORIZED TO   * 00359000
*                                      /* RECEIVE UNSOLICITED MESSAGES* 00360000
*                                      /* 1 = YES                     * 00361000
*                 5 *        BIT(7),   /* RESERVED                    * 00362000
*              4  ATCSTAT4 CHAR(1),    /* VTAM  STATUS BYTE 4         * 00363000
*                 5  ATCPRTAT BIT(1),  /* 1 = TRACE PRINT ACTIVE,  0110 00364000
*                                         0 = NOT ACTIVE              * 00365000
*                 5  ATCTPRT BIT(1),   /* WHEN 1, TPRINT IN PROCESS   * 00366000
*                 5  ATCMTST BIT(1),   /* WHEN 1, MODIFY TEST IN   0110 00367000
*                                         PROCESS                     * 00368000
*                 5  ATCNCSD BIT(1),   /* NCS QUIESCED DURING HALT    * 00369000
*                 5  ATCVTTRC BIT(1),  /* VTAM TRACE, 1=ACTIVE        * 00370000
*                 5  ATCRSV04 BIT(3),  /* RESERVED                    * 00371000
*           3  ATCAPI PTR(31),         /* ADDR OF API ROUTINE         * 00372000
*           3  ATCDCFRR PTR(31),       /* POINTER TO FRR OF CONTROL     00373000
*                                         LAYER,INITIALIZED BY OPENDST* 00374000
*           3  ATCRDT PTR(31),         /* POINTER TO FIRST RDT        * 00375000
*           3  ATCSRT PTR(31),         /* POINTER TO SRT DIRECTORY    * 00376000
*           3  ATCASCHD PTR(31),       /* POINTER TO AP SCHEDULER     * 00377000
*           3  ATCECMOD CHAR(4),       /* ECB FOR MODIFY COMMAND PROC.* 00378000
*           3  ATCMODQ PTR(31),        /* POINTER FOR OUTPUT QUEUE    * 00379000
*                                      /* FOR MODIFY COMMAND          * 00380000
*           3  ATCECHLT CHAR(4),       /* ECB FOR HALT COMMAND        * 00381000
*           3  ATCHALTQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 00382000
*                                      /* FOR HALT COMMAND            * 00383000
*           3  ATCECVRY CHAR(4),       /* ECB FOR VARY COMMAND PROC.  * 00384000
*           3  ATCVARYQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 00385000
*                                      /* FOR VARY COMMAND            * 00386000
*           3  ATCECDSP CHAR(4),       /* ECB FOR DISPLAY COMMAND     * 00387000
*           3  ATCDSPLQ PTR(31),       /*  POINTER TO OUTPUT QUEUE    * 00388000
*                                      /* FOR DISPLAY COMMAND         * 00389000
*           3  ATCOCHA PTR(31),        /* POINTER TO OCT HEADER       * 00390000
*           3  ATCECSES CHAR(4),       /* ECB TO HALT SESSION MODE    * 00391000
*           3  ATCECVRQ CHAR(4),       /* ERP ECB FOR VARY REQ. INFO. * 00392000
*                                      /* REQUEST NOTIFICATION        * 00393000
*           3  ATCVPARM PTR(31),       /* ADDR OF VARY PARAMETERS     * 00394000
*           3  ATCECOPC CHAR(4),       /* ECB TOINDICATE OPERATOR     * 00395000
*                                      /* CONTROL PROCESSING COMPLETE * 00396000
*           3  ATCECNET CHAR(4),       /* ERP ECB FOR NETWORK         * 00397000
*                                      /* CONFIGURATION REQUEST       * 00398000
*           3  ATCECPRM PTR(31),       /* POINTER TO QAB FOR ERP'S    * 00399000
*                                      /* ECB PARAMETERS              * 00400000
*           3  ATCHLTMS PTR(31),       /* POINTER TO HALT COMMAND     * 00401000
*                                      /* OR HALT RETURN MESSAGE      * 00402000
*           3  ATCFSB PTR(31),         /* PTR TO FEEDBACK STATUS      * 00403000
*                                      /* BLOCK                       * 00404000
*           3  ATCFRSCH PTR(31),       /* POINTER TO FEEDBACK         * 00405000
*                                      /* ROUTINE SCHEDULER           * 00406000
*           3  ATCRDTH PTR(31),        /*  POINTER RDT HEADER         * 00407000
*           3  ATCACCTA PTR(31),       /* POINTER TO INSTALLATION     * 00408000
*                                      /* ACCOUNTING ROUTINE          * 00409000
*           3  ATCAUTHA PTR(31),       /* POINTER TO INSTALLATION     * 00410000
*                                      /* AUTHORISATION ROUTINE       * 00411000
*           3  ATCPTCHA PTR(31),       /* PTR TO VTAM PATCH AREA      * 00412000
*           3  ATCCONFT PTR(31),       /* POINTER TO VTAM             * 00413000
*                                      /* CONFIGURATION TABLE         * 00414000
*           3  ATCFDVT PTR(31),        /* PTR TO FIRST DVT FOR O/C    * 00415000
*           3  ATCFEPT PTR(31),        /* PTR TO FIRST EPT FOR O/C    * 00416000
*           3  ATCDVTPT PTR(31),       /* ADDR OF LOAD MOD FOR        * 00417000
*                                      /* TYPE=VTAM TRACING           * 00418000
*           3  ATCBPDA PTR(31),        /* PTR TO BUFFER POOL DIRECTORY* 00419000
*           3  ATCADD PTR(31),         /* POINTER TO ADD PROCEDURE    * 00420000
*           3  ATCREMOV PTR(31),       /* POINTER TO REMOVE PROCEDURE * 00421000
*           3  ATCIOTRC PTR(31),       /*  POINTER TO I/O TRACE       * 00422000
*                                      /* PROCEDURE                   * 00423000
*              4 ATCTHTRC PTR(31),     /* ADDR OF TH TRACE ROUTINE    * 00424000
*                5 ATCTPBUF PTR(31),   /* TPIOS BUFFER TRACE(ISTRARTP)* 00425000
*           3  ATCBFTRC PTR(31),       /* PTR TO BUFFER TRACE         * 00426000
*                                      /* PROCEDURE                   * 00427000
*           3  ATCFBRPH PTR(31),       /* ADDR OF FEEDBACK PROC RPH   * 00428000
*           3  ATCBLDLA PTR(31),       /* ADDR OF BLDL ROUTINE        * 00429000
*           3  ATCALOAD PTR(31),       /* ADDR OF ALOAD ROUTINE       * 00430000
*           3  ATCREADA PTR(31),       /* ADDR OF SOURCE READ ROUTINE * 00431000
*           3  ATCGTSTR PTR(31),       /* ADDR OF GETSTOR ROUTINE     * 00432000
*           3  ATCFRSTR PTR(31),       /* ADDR OF FREESTOR ROUTINE    * 00433000
*           3  ATCSTMA PTR(31),        /* ADDR OF SM INITIALIZATION   * 00434000
*                                      /* ROUTINE                     * 00435000
*           3  ATCACDA PTR(31),        /* ADDR OF FIRST ACDEB         * 00436000
*           3  ATCSMRQ PTR(31),        /* ADDR OF REQUEST STORAGE     * 00437000
*                                      /* ROUTINE                     * 00438000
*           3  ATCSMQU PTR(31),        /* ADDR OF QUEUE REQUEST RTNE    00439000
*                                         - DOS ONLY                  * 00440000
*           3  ATCSMRS PTR(31),        /* ADDR OF RELEASE STORAGE     * 00441000
*                                      /* ROUTINE                     * 00442000
*           3  ATCSMRC PTR(31),        /* ADDR OF RECOVER STORAGE     * 00443000
*                                      /* ROUTINE  - DOS ONLY         * 00444000
*           3  ATCSMBQ PTR(31),        /* PTR TO Q'ED REQ. SMS RTN.   * 00445000
*           3  ATCFIRA PTR(31),        /* ADDR OF FEEDBACK INITIATION * 00446000
*                                      /* RPH                         * 00447000
*           3  ATCSRTAD PTR(31),       /* PTR TO SRTADD ROUTINE       * 00448000
*           3  ATCSRTDF PTR(31),       /* PTR TO SRTDELE ROUTN        * 00449000
*           3  ATCDCC60 PTR(31),       /* PTR TO ISTDCC60 - CTL. LAYER  00450000
*                                         MOVE TO USER AREA           * 00451000
*           3  ATCDCC61 PTR(31),       /* PTR TO ISTDCC61 - CTL. LAYER  00452000
*                                         MOVE FIXED TO PAGABLE       * 00453000
*/*  BEGIN 'ANY' DVT                                                  * 00454000
*           3  ATCNERST PTR(31),       /* PTR TO ISTDCC00 - REQUEST-ST* 00455000
*           3  ATCNERCV PTR(31),       /* PTR TO ISTRCC21-RECEIVE OB  * 00456000
*           3  ATCNERNE PTR(31),      /* PTR TO ISTDCC25 - READ-ANY   * 00457000
*           3  ATCNERFN PTR(31),      /* PTR TO ISTDCC02 - REQUEST-FN * 00458000
*/*  END 'ANY' DVT                                                    * 00459000
*           3  ATCAPOST PTR(31),      /* PTR TO VTAM  POST ROUTINE    * 00460000
*           3  ATCVTMID CHAR(2),      /* HOST MAJOR NODE I.D.         * 00461000
*           3  ATCRSV11 CHAR(2),      /* RESERVED                     * 00462000
*           3 ATCRCC63 PTR(31),  /* HSKPANYQ POINTER                  * 00463000
*           3 ATCRCC26 PTR(31),  /* SEND RESPONSE POINTER             * 00464000
*           3 ATCRCC65 PTR(31),  /* SET RPL POINTER                   * 00465000
*           3  ATCNESAL PTR(31),      /* PTR TO ISTDCC24 - SOLICIT-ALL* 00466000
*           3  ATCNERAP PTR(31),       /* PTR TO ISTDCC85 - READ ANY    00467000
*                                         PURGE                       * 00468000
*           3 ATCACTRM FIXED(15),     /* COUNT OF ACTIVE TERMINALS    * 00469000
*           3 ATCCIDM BIT(16),        /* CID MASK                     * 00470000
*           3 ATCMSGSP BIT(8), /* RESERVED FOR MESAGE SURPRESSION     * 00471000
*         2 ATCMAXID PTR(8),   /* MAXIMUM NUMBER OF MAJOR NODES, 0 =    00472000
*                                 NUMBER OF ENTRIES IN THE MNT        * 00473000
*         2 ATCRSV16 CHAR(2),  /* NOT USED                            * 00474000
*         2 ATCMNT PTR(31),    /*PTR TO MAJOR NODE TABLE -SET BY SYS.   00475000
*                                DEF. REF. BY ISTSDCCB (CBDEF),    0110 00476000
*                                ISTSDCCI (CINDEXY)                   * 00477000
*         2 ATCCDADD PTR(31),  /*PTR TO CIDADD ROUTINE ISTSDCCA    0110 00478000
*                                 REF. BY CIDCTL MACRO                * 00479000
*         2 ATCCDDEL PTR(31),  /*PTR TO CIDDEL ROUTINE ISTSDCCD    0110 00480000
*                                 REF. BY CIDCTL MACRO                * 00481000
*         2 ATCCDFND PTR(31),  /*PTR TO CIDFND ROUTINE IATSDCCF    0110 00482000
*                                 REF. BY CIDCTL MACRO                * 00483000
*         2 ATCESC01 PTR(31),  /*PTR TO ESC01                         * 00484000
*         2 ATCESC02 PTR(31),  /*PTR TO ESC02                         * 00485000
*         2 ATCCSMR PTR(31),        /* PTR TO CONNECTION SERVICES     * 00486000
*                                   /*  MASTER ROUTINE                * 00487000
*           3 ATCCSMA PTR(31),      /* PTR TO CONNECTION SERVICES  0110 00488000
*                                      MASTER ROUTINE                 * 00489000
*         2 ATCOCRT PTR(31),        /* PTR TO OPEN/CLOSE ROUTINE      * 00490000
*         2 ATCUEP  PTR(31),        /* POINTER TO USER EXIT           * 00491000
*         2 ATCSHRTN CHAR(8),       /* NAME OF VTAM  SHARED RTN       * 00492000
*                                   /*  TO BE LOADED                  * 00493000
*         2 ATCSHRFG BIT(8),        /* ATTRIBUTE FLAGS                * 00494000
*           3 ATCLAST BIT(1),       /* INDICATE HTIS IS LAST MODULE   * 00495000
*         2 ATCXRANG CHAR(1),       /* NUMBER OT BITS IN X-VALUE   0110 00496000
*                                       PORTION   OF CID              * 00497000
*         2 ATCSAF   CHAR(2),       /* SUB AREA ADDRESS FIELD         * 00498000
*         2 ATCEPA PTR(31),         /* ENTRY POINT ADDR OF LOADED     * 00499000
*         2 ATCALERT PTR(31),       /* POINTER TO ALERT-ROUTINE    0110 00500000
*                                      ISTSDCAL                       * 00501000
*         2 ATCDVLOD PTR(31),       /* PTR TO ISTSDCOD                * 00502000
*         2 ATCTRCPT PTR(31),       /* POINTER TO TRACE PARM LIST     * 00503000
*         2 ATCDVT   PTR(31),       /* POINTER TO FIRST DVT ON CHAIN  * 00504000
*         2 ATCEPT   PTR(31),       /* POINTER TO FIRST EPT ON CHAIN  * 00505000
*         2 ATCMSGP PTR(31),        /* POINTER TO TPMSG PROCESSOR     * 00506000
*         2 ATCMSGM PTR(31),        /* POINTER TO TPMSG - MESSAGE  0110 00507000
*                                      CSECT                          * 00508000
*         2 ATCTRPAB  PTR(31),      /* ADDRESS OF TRACE WRITER PAB    * 00509000
*         2 ATCVTLOD PTR(31),       /* ADDR OF VTAM LOAD LIST         * 00510000
*         2 ATCECPRT CHAR(4),       /* ECB FOR TRACE FILE PRINT       * 00511000
*         2 ATCZDVTB PTR(31),       /* ADDRESS OF ISTZCFBI            * 00512000
*         2 ATCECTLP CHAR(4),       /* TOLTEP ECB                     * 00513000
*         2 ATCRVCHS CHAR(8),       /* RESERVED                       * 00514000
*         2 ATCCRME  PTR(31),       /* VARY PSS CONTROL MECHANISM     * 00515000
*         2 ATCHPGM,                /* BUFFER INFORMATION            */ 00516000
*           3 ATCHBFNO FIXED(15),   /* NUMBER OF BUFFS FOR CHANNEL   */ 00517000
*           3 ATCHBSIZ FIXED(15),   /* BUFFER SIZE IN BYTES          */ 00518000
*         2 ATCDEBCH PTR(31),       /* CLOSE DEB CHAIN PTR           */ 00519000
*         2 ATCTODVT PTR(31),       /* THE TOLTEP DVT PTR POINTED  0110 00520000
*                                      TO BY 3RD WORD OF PAB         */ 00521000
*         2 ATCADEL  PTR(31),       /* A DELETE ROUTINE ADDRESS      */ 00522000
*         2 ATCCDPTR PTR(31),       /* PTR TO ISTOCCCD - DOS ONLY    */ 00523000
*         2 ATCLDNCS PTR(31),       /* PTR TO NCSPL FOR LOAD/DUMP    */ 00524000
*         2 ATCLDECB BIT(32),       /* ECB FOR LOAD/DUMP SUBTASK     */ 00525000
*         2 ATCAPCR5 PTR(31),       /* POINTER TO ISTINCR5           */ 00526000
*         2 ATCRSV69 PTR(31),       /* RESERVED TO SYNCH WITH DOS    */ 00527000
*         2 ATCNODEL CHAR(8),       /* VSAM DATA SET NAME            */ 00528000
*         2 ATCNODDS PTR(31),       /* POINTER TO RPL                */ 00529000
*         2 ATCONFIG CHAR(8),       /* START VTAM CONFIG = PARAMETER */ 00530000
*         2 ATCRSV99 CHAR(4),       /* RESERVED FOR LATER POINTERS   */ 00531000
*         2 ATCAP33 PTR(31),        /* PTR TO ISTAPC33               */ 00532000
*         2 ATCAP35 PTR(31),        /* PTR TO ISTAPC35               */ 00533000
*         2 ATCAP36 PTR(31),        /* PTR TO ISTAPC36               */ 00534000
*         2 ATCDVTLK CHAR(LENGTH(ISTLOK)), /* LOCK WORD FOR DVT LOCK */ 00535000
*         2 ATCCDFIN PTR(31),       /* POINTER TO ISTSDCRR           */ 00536000
*         2 ATCCDFDN PTR(31),       /* POINTER TO ISTSDCCN           */ 00537000
*         2 ATCVOCLK CHAR(LENGTH(ISTLOK)), /* VOCLOCK LOCK           */ 00538000
*         2 ATCRDTLK CHAR(LENGTH(ISTLOK)), /* RDTLOCK LOCK           */ 00539000
*         2 ATCRSV97 PTR(31),              /* DWORD ALIGNMENT        */ 00540000
*         2 ATCVPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR VARY 00541000
*                                           UNDER PSS CONTROL        */ 00542000
*         2 ATCPGPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* ERP PAB FOR  00543000
*                                      PURGE                         */ 00544000
*         2 ATCDLRPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* DUMP LOAD &  00545000
*                                           RESTART PAB              */ 00546000
*         2 ATCCCLAD PTR(31),       /* ADDRESS OF VARY ERP (ISTINCCL)*/ 00547000
*         2 ATCCDLAD PTR(31),       /* ADDRESS OF VARY DUMP,LD RSTRT    00548000
*                                      (ISTINCDL)                    */ 00549000
*         2 ATCOCCOB PTR(31),       /* ADDRESS ISTOCCOB              */ 00550000
*         2 ATCOCCCB PTR(31),       /* ADDRESS ISTOCCCB              */ 00551000
*         2 ATCTIPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0110 00552000
*                                           FOR ISTOLTP              */ 00553000
*         2 ATCTCIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0110 00554000
*                                           FOR TOLTEP CLIP          */ 00555000
*         2 ATCVTIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0110 00556000
*                                           FOR TOLTEP-VTAM INTERFACE*/ 00557000
*         2 ATCTCLOM PTR(31),      /* ADDR TOLTEP CLOP PROC          */ 00558000
*         2 ATCTCLIM PTR(31),      /* ADDR TOLTEP CLIP PROC          */ 00559000
*         2 ATCVTINM PTR(31),      /* ADDR TOLTEP-VTAM INTF PROC     */ 00560000
*         2 ATCTACB  PTR(31),      /* TOLTEP ACB                     */ 00561000
*         2 ATCRSV10 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* RESERVED  */ 00562000
*         2 ATCPTR00 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB     */ 00563000
*         2 ATCCFEAD PTR(31),          /* ADDR OF ISTINCFE           */ 00564000
*         2 ATCVLCNT CHAR(4) BDY(HWORD), /* VARY DEVICE ONLINE COUNTS*/ 00565000
*           3 ATCRNCNT PTR(16),        /* 370X COUNT                 */ 00566000
*           3 ATCLCLCT PTR(16),        /* 3270 COUNT                 */ 00567000
*         2 ATCS49XI PTR(31),          /* ADDRESS OF ISTPICXI        */ 00568000
*         2 ATCS49XL PTR(31),          /* ADDRESS OF ISTPICXL        */ 00569000
*         2 ATCPODVT PTR(31),          /* PTR TO PROGRAM OPERATOR DVT*/ 00570000
*         2 ATCRNO,                                                0110 00571000
*           3 *        CHAR(1),                                    0110 00572000
*           3 ATCPOIA  PTR(24),        /* PTR TO PROGRAM OPERATOR    */ 00573000
*                                      /* INTERFACE AREA             */ 00574000
*         2 ATCSOPD CHAR(8) BDY(WORD), /* SESSION CONTROL            */ 00575000
*           3 ATCSEC01 PTR(31),        /* OUTBOUND PROCESSING        */ 00576000
*           3 ATCSEC10 PTR(31),        /* DVT                        */ 00577000
*         2 ATCSIPD CHAR(12) BDY(WORD),/* SESSION CONTROL            */ 00578000
*           3 ATCSEC21 PTR(31),        /* INBOUND PROCESSING         */ 00579000
*           3 ATCSEC30 PTR(31),        /* FEEDBACK                   */ 00580000
*           3 ATCSEC40 PTR(31),        /* DVT                        */ 00581000
*         2 ATCSECST CHAR(4) BDY(WORD),/* SESSION CONTROLSESS TERM   */ 00582000
*           3 ATCSEC51 PTR(31),        /* RECOVERY DVT               */ 00583000
*         2 ATCNMCTR FIXED(15),        /* NAME COUNTER               */ 00584000
*         2 ATCSTAT2 BIT(8),           /* TRACE FLAGS                */ 00585000
*           3 ATCTRAPI BIT(1),         /* API                        */ 00586000
*           3 ATCTRESC BIT(1),         /* ESC                        */ 00587000
*           3 ATCTRPSS BIT(1),         /* PSS                        */ 00588000
*           3 ATCTRLOK BIT(1),         /* LOCKS                      */ 00589000
*           3 ATCTRSMS BIT(1),         /* SMS                        */ 00590000
*           3 *        BIT(3),         /* RESERVED                   */ 00591000
*         2 *        BIT(8),           /* RESERVED                   */ 00592000
*         2 ATCSRTAB PTR(31),          /* SEARCH LOGON MODE TABLE    */ 00593000
*                                      /* RTN ADDRESS (ISTINCSH)     */ 00594000
*         2 ATCUSSPT PTR(31),          /* DEFAULT USS DEFINITION     */ 00595000
*                                      /* TABLE ADDRESS (ISTINCDT)   */ 00596000
*         2 ATCMODTB PTR(31),          /* DEFAULT SYSTEM LOGON MODE  */ 00597000
*                                      /* TABLE ADDRESS (ISTINCLM)   */ 00598000
*         2 ATCINCW3 PTR(31),          /* ADDRESS OF ISTINCW3        */ 00599000
*         2 ATCIOECB PTR(31),          /* ECB USED BY IOS -          */ 00600000
*                                      /* POINTED TO BY IOBECBPT     */ 00601000
* 2 ATCVDPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0110 00602000
*                                    /* SSCP COMMAND PROCESSING PAB  */ 00603000
* 2 ATCVFPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0110 00604000
*                                    /* SSCP FRONT END PAB           */ 00605000
* 2 ATCVDLOK CHAR(LENGTH(ISTLOK)),   /* SSCP SERIALIZATION LOCK      */ 00606000
*/* END OF COMMON AREA                                               */ 00607000
*/* VS1/VS2 COMMON CODE.                                             */ 00608000
*        2  ATCVTBAM CHAR(4),                                      0110 00609000
*           3  *     CHAR(3),          /* RESERVED                    * 00610000
*           3  *     CHAR(1),          /* FLAGS                       * 00611000
*              4 ATCVTMAB BIT(1) ABNL, /* ABEND IN VTAM JOBSTEP       * 00612000
*              4 *        BIT(7),      /* RESERVED                    * 00613000
*        2  ATCAOSM BDY(DWORD),                                    0110 00614000
*/*                                                                   * 00615000
*           3  ATCSRBRT PTR(31),       /* POINTER TO ROUTINE UNDER    * 00616000
*                                      /* SRB CONTROL                 * 00617000
*           3  ATCGSRBQ PTR(31),       /* READY QUEUE FOR GLOBAL SRB'S* 00618000
*              4  ATCGSRBG BIT(8),     /* READY QUEUE GATE BYTE       * 00619000
*                 5  ATCGSRBF BIT(1),  /* READY QUEUE GATE BIT        * 00620000
*           3  ATCPRPH PTR(31),        /* PTR TO PREALLOCATED RPH     * 00621000
*           3  ATCCMTCB PTR(31),       /* PTR TO COMMUNICATIONS TASK  * 00622000
*                                      /* TCB                         * 00623000
*           3  ATCAP11 PTR(31),        /* PTR TO ISTAPC11             * 00624000
*           3  ATCAP12 PTR(31),        /* PTR TO ISTAPC12             * 00625000
*           3  ATCAP31 PTR(31),        /* PTR TO ISTAPC31             * 00626000
*           3  ATCAP32 PTR(31),        /* PTR TO ISTAPC32             * 00627000
*           3  ATCAP34 PTR(31),        /* PTR TO ISTAPC34             * 00628000
*           3  ATCAP52 PTR(31),        /* PTR TO ISTAPC52             * 00629000
*           3  ATCAP53 PTR(31),        /* PTR TO ISTAPC53             * 00630000
*           3  ATCAP54 PTR(31),        /* PTR TO ISTAPC54             * 00631000
*           3  ATCAP57 PTR(31),        /* PTR TO ISTAPC57             * 00632000
*           3  ATCAP58 PTR(31),        /* PTR TO ISTAPC58             * 00633000
*           3  ATCAP61 PTR(31),        /* PTR TO ISTAPC61             * 00634000
*           3  ATCAP63 PTR(31),        /* PTR TO ISTAPC63             * 00635000
*           3  ATCAP64 PTR(31),        /* PTR TO ISTAPC64             * 00636000
*           3  ATCZFSVT PTR(31),       /* TPIOS FIXED SRVICES VCTR TAB* 00637000
*           3  ATCZPSVT PTR(31),       /* TPIOS PAGBL SRVCES VCTR TABL* 00638000
*           3  ATCICNCB PTR(31),       /* HEAD OF ICNCB QUEUE         * 00639000
*           3  ATCZDVT1 PTR(31),       /* TPIOS SLODWN RECOVRY PRCSR  * 00640000
*           3  ATCZDVT3 PTR(31),       /* 370X FEEDBACK STAT CNTRL RTR* 00641000
*           3  ATCZDVT4 PTR(31),       /* OPERATOR MESSAGE SCHEDULER  * 00642000
*           3  ATCZDVT6 PTR(31),       /* DIALOGUE SCHEDULER (INBOUND)* 00643000
*           3  ATCAP65 PTR(31),        /* PTR TO ISTAPC65            */ 00644000
*           3  ATCICAPP CHAR(20) BDY(WORD), /* 3705 APPENDAGE VECTOR  * 00645000
*              4  ATCCDRPH PTR(31),    /* ADDR CLOSE DEB RPH       0110 00646000
*                                         (DUMMY EOA APP.)           */ 00647000
*              4  ATCZSIOA PTR(31),    /* ADDR 3705 SIO APPENDAGE    */ 00648000
*              4  ATCCDTCB PTR(31),    /* VTAM TCB (DUMMY PCI APP.)  */ 00649000
*              4  ATCZCEA PTR(31),     /* ADDR 3705 CHANNEL END    0110 00650000
*                                         APPENDAGE                  */ 00651000
*              4  ATCZAEA PTR(31),     /* ADDR 3705 CHANNEL END    0110 00652000
*                                         APPENDAGE                  */ 00653000
*           3  ATCLDAPP CHAR(20) BDY(WORD), /* LOCAL 3270 APPENDAGE     00654000
*                                         VECTOR                     */ 00655000
*              4  ATCCDTID PTR(31),    /* TASK ID OF VTAM          0110 00656000
*                                         (DUMP EOE)                 */ 00657000
*              4  ATCSMFRR PTR(31),    /* ADDR OF SMS FRR          0110 00658000
*                                         (DUMMY SIOA)               */ 00659000
*              4  ATCRSV17 PTR(31),    /* RESERVED FOR ALIGNMENT     */ 00660000
*              4  ATCZLCEA PTR(31),    /* ADDR 3270 CHANNEL END    0110 00661000
*                                         APPENDAGE                  */ 00662000
*              4  ATCZLAEA PTR(31),    /* ADDR 3270 CHANNEL END    0110 00663000
*                                         APPENDAGE                  */ 00664000
*           3  ATCDAPVT CHAR(24) BDY(WORD),  /* DUMMY APPENDAGE    0110 00665000
*                                         VECTOR TABLE FOR LOAD/DVMMY*/ 00666000
*              4  ATCDEOEA PTR(31),    /* ADDRESS OF DUMMY END     0110 00667000
*                                         OF EXTENT APPENDAGE        */ 00668000
*              4  ATCDSIOA PTR(31),    /* ADDRESS OF DUMMY END     0110 00669000
*                                         OF SIO APPENDAGE           */ 00670000
*              4  ATCDPCIA PTR(31),    /* ADDRESS OF DUMMY PCI     0110 00671000
*                                         APPENDAGE                  */ 00672000
*              4  ATCDCEA PTR(31),     /* ADDRESS OF CHANNEL END   0110 00673000
*                                         APPENDAGE                  */ 00674000
*              4  ATCDXCEA PTR(31),    /* ADDRESS OF ABNORMAL      0110 00675000
*                                         END APPENDAGE              */ 00676000
*              4  ATCDAPDG CHAR(2),    /* DUMMY APPENDAGE            */ 00677000
*              4  ATCRSV56 CHAR(2),    /* RESERVED                   */ 00678000
*           3  ATCZDVT7 PTR(31),       /* ADDR OF RESET CLEANUP    0110 00679000
*                                         (PHASE 1)                   * 00680000
*           3  ATCZDVT8 PTR(31),       /* 3270 LOCAL TEST AND CTL  0110 00681000
*                                         FEEDBACK ROUTER            */ 00682000
*           3  ATCZDVT9 PTR(31),       /* ADDRESS OF ISTZDFKA        */ 00683000
*           3  ATCZDVTA PTR(31),       /* ADDRESS OF ISTZCFIA        */ 00684000
*           3  ATCZDVTX PTR(31),       /* ADDRESS OF TRUNK LINE    0110 00685000
*                                         DEACTIVATE ROUTINE         */ 00686000
*           3  ATCZLPVT PTR(31),       /* ADDRESS OF ISTZPSVA        */ 00687000
*           3  ATCZLFVT PTR(31),       /* TPIOS 3270 LOCAL FIXED   0110 00688000
*                                         SERVICES VECTOR TABLE      */ 00689000
*           3  ATCZPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR   00690000
*                                         TEST AND CTL FEEDBACK ROUTER* 00691000
*           3  ATCZPAB2 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* 370X 0110 00692000
*                                         STATUS AND FEEDBACK ROUTER    00693000
*                                         DYNAMIC PAB                */ 00694000
*           3  ATCAP51  PTR(31),       /* PTR TO ISTAPC51            */ 00695000
*           3  ATCZDFJ0 PTR(31),       /* ADDR OF ISTZDFJ0           */ 00696000
*           3  ATCAP37  PTR(31),       /* PTR TO ISTAPC37            */ 00697000
*           3  ATCAP38  PTR(31),       /* PTR TO ISTAPC38            */ 00698000
*           3  ATCDMAPP PTR(31),       /* DUMMY APPENDAGE ROUTINE    */ 00699000
*                                      /* FOR ABEND                  */ 00700000
*           3  ATCRPT12 PTR(31),       /* RESERVED                   */ 00701000
*        3  ATCCRA   CHAR(8) BDY(DWORD), /* AVAILABLE CRA             * 00702000
*           4 ATCCRAQ  PTR(31),          /* QUEUE OF AVAILABLE CRAS   * 00703000
*           4 ATCCRACN FIXED(31),        /* COUNTS                    * 00704000
*             5 ATCCRARC FIXED(16),      /* ENQUEUE COUNT TO ALLOW    * 00705000
*                                        /* MULTIPLE SIMUALTANIOUS    * 00706000
*                                        /* ENQUEUES AND DEQUEUES     * 00707000
*             5 ATCCRAAC FIXED(16),      /* COUNT OF CRAS ON AVAIL Q  * 00708000
*        3  ATCSRB   CHAR(8) BDY(DWORD), /* AVAILABLE SRBS            * 00709000
*             4 ATCSRBQ  PTR(31),        /* QUE OF AVAILABLE SRBS     * 00710000
*             4 ATCSRBCN FIXED(31),      /* COUNTS                    * 00711000
*               5 ATCSRBRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    * 00712000
*                                        /* MULTIPLE SIMUALTANIOUS    * 00713000
*                                        /* ENQUEUES AND DEQUEUES     * 00714000
*               5 ATCSRBAC FIXED(16),    /* COUNT OF SRBS ON AVAIL Q  * 00715000
*        3  ATCCRPL  CHAR(8) BDY(DWORD), /* AVAILABLE CRPLS           * 00716000
*             4 ATCCRPLQ PTR(31),        /* QUE OF AVAILABLE CRPLS    * 00717000
*             4 ATCRPLCN FIXED(31),      /* COUNTS                    * 00718000
*               5 ATCRPLRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    * 00719000
*                                        /* MULTIPLE SIMUALTANIOUS    * 00720000
*                                        /* ENQUEUES AND DEQUEUES     * 00721000
*               5 ATCRPLAC FIXED(16),    /* COUNT OF CRPLS ON AVAIL Q * 00722000
*           3  ATCRPT19 PTR(31),       /* RESERVED                   */ 00723000
*           3  ATCRPT20 PTR(31),       /* RESERVED                   */ 00724000
*           3  ATCRPT21 PTR(31),       /* RESERVED                   */ 00725000
*           3  ATCRPT22 PTR(31),       /* RESERVED                   */ 00726000
*           3  ATCRPT23 PTR(31),       /* RESERVED                   */ 00727000
*           3  ATCRPT24 PTR(31),       /* RESERVED                   */ 00728000
*           3  ATCRPT25 PTR(31),       /* RESERVED                   */ 00729000
*           3  ATCRPT26 PTR(31),       /* RESERVED                   */ 00730000
*           3  ATCRPT27 PTR(31),       /* RESERVED                   */ 00731000
*           3  ATCRPT28 PTR(31),       /* RESERVED                   */ 00732000
*           3  ATCRPT29 PTR(31),       /* RESERVED                   */ 00733000
*           3  ATCRPT30 PTR(31),       /* RESERVED                   */ 00734000
*           3  ATCRPT31 PTR(31),       /* RESERVED                   */ 00735000
*           3  ATCRPT32 PTR(31),       /* RESERVED                   */ 00736000
*           3  ATCRPT33 PTR(31),       /* RESERVED                   */ 00737000
*           3  ATCRPT34 PTR(31),       /* RESERVED                   */ 00738000
*           3  ATCRPT35 PTR(31),       /* RESERVED                   */ 00739000
*           3  ATCRPT36 PTR(31),       /* RESERVED                   */ 00740000
*           3  ATCRPT37 PTR(31),       /* RESERVED                   */ 00741000
*           3  ATCRPT38 PTR(31),       /* RESERVED                   */ 00742000
*           3  ATCRPT39 PTR(31),       /* RESERVED                   */ 00743000
*           3  ATCRPT40 PTR(31),       /* RESERVED                   */ 00744000
*/* END OF VS1/VS2 COMMON CODE.                                      */ 00745000
*/* START OF VS2 UNIQUE CODE.                                        */ 00746000
*           3  ATCVTFLG BIT(32),                                   0110 00747000
*              4 ATCVTACT BIT(1),      /* VTT ACTIVE                 */ 00748000
*              4 *        BIT(31),     /* RESERVED                   */ 00749000
*           3  ATCHLTCB PTR(31),       /* ECB FOR HALTING VTAM       */ 00750000
*           3  ATCATA10 PTR(31),       /* PTR TO ISTATM10            */ 00751000
*           3  ATCZLAAB PTR(31),       /* PTR TO ISTZLFAB            */ 00752000
*           3  ATCCACXA PTR(31),       /* PTR TO ISTCFCXA            */ 00753000
*           3  ATCSMARA PTR(31),       /* PTR TO ISTORFRA            */ 00754000
*           3  ATCSMAID PTR(31),       /* PTR TO ISTORFID            */ 00755000
*           3  ATCTPWQA PTR(31),       /* WAIT Q ANCHOR FOR TPIOS    */ 00756000
*           3  ATCSMAPR PTR(31),       /* PTR TO ISTORFPR            */ 00757000
*           3  ATCSMABF PTR(31),       /* PTR TO ISTORFBF            */ 00758000
*           3  ATCPSTA  PTR(31),       /* ACTIVE PST QUEUE           */ 00759000
*           3  ATCAPBE  PTR(31),       /* POINTER TO ISTAICBE        */ 00760000
*           3  ATCTRMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0110 00761000
*                                      /* PAB FOR VTAM TERM TASK     */ 00762000
*           3  ATCTPSPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0110 00763000
*                                      /* PAB FOR TPIOS              */ 00764000
*           3  ATCAP23  PTR(31),       /* PTR TO ISTAPC23            */ 00765000
*           3  ATCAPC25 PTR(31),       /* PTR TO ISTAPC25            */ 00766000
*           3  ATCAP41  PTR(31),       /* PTR TO ISTAPC41            */ 00767000
*           3  ATCRCFY0 PTR(31),       /* PTR TO ISTRCFY0            */ 00768000
*           3  ATCAP55  PTR(31),       /* PTR TO ISTAPC55            */ 00769000
*           3  ATCAP56  PTR(31),       /* PTR TO ISTAPC56            */ 00770000
*           3  ATCAPC59 PTR(31),       /* PTR TO ISTAPC59            */ 00771000
*           3  ATCAP62  PTR(31),       /* PTR TO ISTAPC62            */ 00772000
*           3  ATCAP66  PTR(31),       /* PTR TO ISTAPC66            */ 00773000
*           3  ATCAP69  PTR(31),       /* PTR TO ISTAPM69            */ 00774000
*           3  ATCAP82  PTR(31),       /* PTR TO ISTAPC82            */ 00775000
*           3  ATCAP83  PTR(31),       /* PTR TO ISTAPC83            */ 00776000
*           3  ATCAP84  PTR(31),       /* PTR TO ISTAPC84            */ 00777000
*           3  ATCAP85  PTR(31),       /* PTR TO ISTAPC85            */ 00778000
*           3  ATCAP86  PTR(31),       /* PTR TO ISTAPC86            */ 00779000
*           3  ATCASCB  PTR(31),       /* PTR TO VTAM ASCB           */ 00780000
*           3  ATCMPLTA  PTR(31),      /* PTR TO MPST LIST TABLE     */ 00781000
*           3  ATCZR01  PTR(31),       /* PTR TO ISTZRM01            */ 00782000
*           3  ATCAICTN PTR(31),       /* PTR TO ISTAICTN            */ 00783000
*           3  ATCTPCP0 PTR(31),       /* PTR TO ISTZFSAV            */ 00784000
*           3  ATCTPCP1 PTR(31),       /* PTR TO ISTZ19SV            */ 00785000
*           3  ATCZFLAG BIT(8),        /* FLAG BYTE                  */ 00786000
*              4 ATCZF001 BIT(1),      /* MDR RECORDING SUSPENDED    */ 00787000
*              4 ATCRSV66 BIT(7),      /* RESERVED                   */ 00788000
*           3  ATCRSV75 BIT(8),        /* RESERVED                   */ 00789000
*           3  ATCSRBCT FIXED(16),     /* COUNT OF PREALLOCATED SRB'S*/ 00790000
*           3  ATCCRACT FIXED(16),     /* COUNT OF PREALLOCATED CRA'S*/ 00791000
*           3  ATCRPLCT FIXED(16),     /* COUNT OF PREALLOCATED CRPL */ 00792000
*           3  ATCRSV88 PTR(31),       /* RESERVED                   */ 00793000
*           3  ATCTPMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /*TP MSG PAB 00794000
*                                                         FOR VS2    */ 00795000
*           3  ATCTPMMI PTR(31),        /* PTR TO ISTCFMMI - MSG ISSUER 00796000
*                                          FOR SRB MODE ROUTINES     */ 00797000
*           3  ATCVIOPM PTR(31),       /* PTR TO ISTVIOPM            */ 00798000
*           3  ATCPOPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0110 00799000
*                   /* POPAB FOR REPLY PROCESSING, POI TERMINATION,  */ 00800000
*                   /* AND VTAM MESSAGE PROCESSOR                    */ 00801000
*        2  ATCAOS CHAR(0) BDY(WORD);  /* VS2 ONLY FIELDS            */ 00802000
*                                                                  0111 00803000
*  DECLARE                                                         0111 00804000
*    EMCR0 PTR REG(0),                                             0111 00805000
*    EMCR1 PTR REG(1),                                             0111 00806000
*    EMCR2 PTR REG(2),                                             0111 00807000
*    EMCR3 PTR REG(3),                                             0111 00808000
*    EMCR4 PTR REG(4),                                             0111 00809000
*    EMCR5 PTR REG(5),                                             0111 00810000
*    EMCR6 PTR REG(6),                                             0111 00811000
*    EMCR7 PTR REG(7),                                             0111 00812000
*    EMCR8 PTR REG(8),                                             0111 00813000
*    EMCR9 PTR REG(9),                                             0111 00814000
*    EMCR10 PTR REG(10),                                           0111 00815000
*    EMCR11 PTR REG(11),                                           0111 00816000
*    EMCR12 PTR REG(12),                                           0111 00817000
*    EMCR13 PTR REG(13),                                           0111 00818000
*    EMCR14 PTR REG(14),                                           0111 00819000
*    EMCR15 PTR REG(15);                                           0111 00820000
*  GEN (PRINT ON);                                                 0112 00821000
         PRINT ON                                                       00822000
*/* END OF TPEPILOG */                                             0113 00823000
*   END ISTINFBL                                                   0113 00824000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00825000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00826000
*;                                                                 0113 00827000
         B     @EL00001                                            0113 00828000
@DATA    DS    0H                                                       00829000
@DATD    DSECT                                                          00830000
         DS    0F                                                       00831000
@SA00001 DS    18F                                                      00832000
ISTINCBL CSECT                                                          00833000
         DS    0F                                                       00834000
@CF00043 DC    F'4'                                                     00835000
@DATD    DSECT                                                          00836000
         DS    0D                                                       00837000
CVTPTR   DS    A                                                        00838000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00839000
@ENDDATD EQU   *                                                        00840000
ISTINCBL CSECT                                                          00841000
         DS    0F                                                       00842000
@SIZDATD DC    AL1(0)                                                   00843000
         DC    AL3(@ENDDATD-@DATD)                                      00844000
         DS    0D                                                       00845000
GETAD    DC    AL4(0)                                                   00846000
CMZAA004 DC    CL4'025I'                                                00847000
CMZAA012 DC    CL4'013I'                                                00848000
CMZPL004 DC    4F'0'                                                    00849000
CMZZO004 DC    F'0'                                                     00850000
CMZPL012 DC    4F'0'                                                    00851000
CMZZO012 DC    F'0'                                                     00852000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00853000
@01      EQU   01                                                       00854000
@02      EQU   02                                                       00855000
@03      EQU   03                                                       00856000
@04      EQU   04                                                       00857000
@05      EQU   05                                                       00858000
@06      EQU   06                                                       00859000
@07      EQU   07                                                       00860000
@08      EQU   08                                                       00861000
@09      EQU   09                                                       00862000
@10      EQU   10                                                       00863000
@11      EQU   11                                                       00864000
@12      EQU   12                                                       00865000
@13      EQU   13                                                       00866000
@14      EQU   14                                                       00867000
@15      EQU   15                                                       00868000
R15      EQU   @15                                                      00869000
R0       EQU   @00                                                      00870000
R1       EQU   @01                                                      00871000
R4       EQU   @04                                                      00872000
R11      EQU   @11                                                      00873000
LDPRMPTR EQU   @01                                                      00874000
REG1004  EQU   @01                                                      00875000
EMCR13   EQU   @13                                                      00876000
REG15004 EQU   @15                                                      00877000
REG1012  EQU   @01                                                      00878000
REG15012 EQU   @15                                                      00879000
RPHPTR   EQU   @01                                                      00880000
EMCR0    EQU   @00                                                      00881000
EMCR1    EQU   @01                                                      00882000
EMCR10   EQU   @10                                                      00883000
EMCR11   EQU   @11                                                      00884000
EMCR12   EQU   @12                                                      00885000
EMCR14   EQU   @14                                                      00886000
EMCR15   EQU   @15                                                      00887000
EMCR2    EQU   @02                                                      00888000
EMCR3    EQU   @03                                                      00889000
EMCR4    EQU   @04                                                      00890000
EMCR5    EQU   @05                                                      00891000
EMCR6    EQU   @06                                                      00892000
EMCR7    EQU   @07                                                      00893000
EMCR8    EQU   @08                                                      00894000
EMCR9    EQU   @09                                                      00895000
ATCLCPTR EQU   1032                                                     00896000
CVTMAP   EQU   0                                                        00897000
CVTDAR   EQU   CVTMAP+72                                                00898000
CVTFLGS1 EQU   CVTDAR                                                   00899000
CVTDCB   EQU   CVTMAP+116                                               00900000
CVTIERLC EQU   CVTMAP+144                                               00901000
CVTOPTA  EQU   CVTMAP+182                                               00902000
CVTOPTB  EQU   CVTMAP+183                                               00903000
CVTGTF   EQU   CVTMAP+236                                               00904000
CVTGTFST EQU   CVTGTF                                                   00905000
CVTGTFS  EQU   CVTGTFST                                                 00906000
CVTSTATE EQU   CVTGTFST                                                 00907000
CVTTMODE EQU   CVTGTFST                                                 00908000
CVTFORM  EQU   CVTGTFST                                                 00909000
CVTAQAVT EQU   CVTMAP+240                                               00910000
CVTTCMFG EQU   CVTAQAVT                                                 00911000
CVTVOLM2 EQU   CVTMAP+244                                               00912000
CVTTATA  EQU   CVTVOLM2                                                 00913000
CVTTSKS  EQU   CVTTATA                                                  00914000
CVTVOLF2 EQU   CVTTSKS                                                  00915000
CVTTAT   EQU   CVTTATA+1                                                00916000
CVTATER  EQU   CVTMAP+248                                               00917000
CVTEXT1  EQU   CVTMAP+252                                               00918000
CVTPURG  EQU   CVTMAP+260                                               00919000
CVTQMSG  EQU   CVTMAP+268                                               00920000
CVTDMSR  EQU   CVTMAP+272                                               00921000
CVTRSV37 EQU   CVTDMSR                                                  00922000
CVTDMSRF EQU   CVTRSV37                                                 00923000
CVTERPV  EQU   CVTMAP+316                                               00924000
CVTINTLA EQU   CVTMAP+320                                               00925000
CVTAPF   EQU   CVTMAP+324                                               00926000
CVTEXT2  EQU   CVTMAP+328                                               00927000
CVTHJES  EQU   CVTMAP+332                                               00928000
CVTPGSIA EQU   CVTMAP+348                                               00929000
CVTA1F1  EQU   CVTMAP+356                                               00930000
CVTSYSK  EQU   CVTMAP+357                                               00931000
CVTVOLM1 EQU   CVTMAP+380                                               00932000
CVTVOLF1 EQU   CVTVOLM1                                                 00933000
CVTATMCT EQU   CVTMAP+388                                               00934000
CVTXTNT1 EQU   0                                                        00935000
CVTXTNT2 EQU   0                                                        00936000
CVTDSSV  EQU   CVTXTNT2                                                 00937000
CVTFLGBT EQU   CVTXTNT2+5                                               00938000
CVTQID   EQU   CVTXTNT2+24                                              00939000
CVTSHS   EQU   CVTXTNT2+40                                              00940000
CVTRV400 EQU   CVTXTNT2+52                                              00941000
CVTRV409 EQU   CVTXTNT2+53                                              00942000
CVTATCVT EQU   CVTXTNT2+64                                              00943000
CVTRV429 EQU   CVTXTNT2+84                                              00944000
CVTRV438 EQU   CVTXTNT2+85                                              00945000
CVTRV457 EQU   CVTXTNT2+112                                             00946000
CVTRV466 EQU   CVTXTNT2+113                                             00947000
CVTFIX   EQU   0                                                        00948000
CVTRELNO EQU   CVTFIX+252                                               00949000
ISTPAB   EQU   0                                                        00950000
PABWQCHN EQU   ISTPAB                                                   00951000
PABWEQA  EQU   PABWQCHN                                                 00952000
PABCHAIN EQU   PABWQCHN+4                                               00953000
PABRPHFG EQU   ISTPAB+12                                                00954000
PABFLAGS EQU   PABRPHFG                                                 00955000
PABERLCK EQU   PABFLAGS                                                 00956000
PABERRLK EQU   PABERLCK                                                 00957000
ISTDYPAB EQU   0                                                        00958000
ISTLDPRM EQU   0                                                        00959000
LDPDCBA  EQU   ISTLDPRM+16                                              00960000
LDPFG    EQU   ISTLDPRM+20                                              00961000
LDPFB2   EQU   ISTLDPRM+21                                              00962000
@NM00003 EQU   0                                                        00963000
CMZID004 EQU   @NM00003                                                 00964000
@NM00004 EQU   @NM00003+4                                               00965000
CMZVP004 EQU   @NM00003+12                                              00966000
CMZSA004 EQU   0                                                        00967000
ISTLOK   EQU   0                                                        00968000
LOKCHN   EQU   ISTLOK+1                                                 00969000
LOKCHNG  EQU   LOKCHN                                                   00970000
@NM00008 EQU   LOKCHNG+2                                                00971000
ISTRPH   EQU   0                                                        00972000
RPHCNTL  EQU   ISTRPH                                                   00973000
RPHFLAGS EQU   RPHCNTL+2                                                00974000
RPHAPTYP EQU   RPHFLAGS                                                 00975000
RPHFSTLC EQU   RPHFLAGS                                                 00976000
RPHFLGB  EQU   RPHCNTL+3                                                00977000
RPHRPHA  EQU   ISTRPH+4                                                 00978000
RPHTSKID EQU   ISTRPH+8                                                 00979000
RPHRESMA EQU   ISTRPH+16                                                00980000
RPHWPFLG EQU   RPHRESMA                                                 00981000
RPHWEA   EQU   ISTRPH+24                                                00982000
RPHCSPA  EQU   RPHWEA                                                   00983000
RPHSRPRM EQU   ISTRPH+28                                                00984000
RPHPABQA EQU   ISTRPH+36                                                00985000
RPHWORK  EQU   ISTRPH+40                                                00986000
RPHSAVE1 EQU   RPHWORK                                                  00987000
RPHSBITS EQU   RPHSAVE1+1                                               00988000
ISTATCVT EQU   0                                                        00989000
ATCCOM   EQU   ISTATCVT                                                 00990000
ATCSTAT  EQU   ATCCOM                                                   00991000
ATCSTAT1 EQU   ATCSTAT                                                  00992000
ATCSTFLG EQU   ATCSTAT+1                                                00993000
ATCPOFLG EQU   ATCSTAT+2                                                00994000
ATCSTAT4 EQU   ATCSTAT+3                                                00995000
ATCIOTRC EQU   ATCCOM+140                                               00996000
ATCTHTRC EQU   ATCIOTRC                                                 00997000
ATCCSMR  EQU   ISTATCVT+296                                             00998000
ATCSHRFG EQU   ISTATCVT+316                                             00999000
ATCMSGP  EQU   ISTATCVT+344                                             01000000
ATCHPGM  EQU   ISTATCVT+384                                             01001000
ATCVLCNT EQU   ISTATCVT+772                                             01002000
ATCRNO   EQU   ISTATCVT+788                                             01003000
ATCSOPD  EQU   ISTATCVT+792                                             01004000
ATCSIPD  EQU   ISTATCVT+800                                             01005000
ATCSECST EQU   ISTATCVT+812                                             01006000
ATCSTAT2 EQU   ISTATCVT+818                                             01007000
ATCVTBAM EQU   ISTATCVT+908                                             01008000
@NM00019 EQU   ATCVTBAM+3                                               01009000
ATCAOSM  EQU   ISTATCVT+912                                             01010000
ATCGSRBQ EQU   ATCAOSM+4                                                01011000
ATCGSRBG EQU   ATCGSRBQ                                                 01012000
ATCICAPP EQU   ATCAOSM+100                                              01013000
ATCLDAPP EQU   ATCAOSM+120                                              01014000
ATCDAPVT EQU   ATCAOSM+140                                              01015000
ATCCRA   EQU   ATCAOSM+280                                              01016000
ATCCRACN EQU   ATCCRA+4                                                 01017000
ATCSRB   EQU   ATCAOSM+288                                              01018000
ATCSRBCN EQU   ATCSRB+4                                                 01019000
ATCCRPL  EQU   ATCAOSM+296                                              01020000
ATCRPLCN EQU   ATCCRPL+4                                                01021000
ATCVTFLG EQU   ATCAOSM+392                                              01022000
ATCZFLAG EQU   ATCAOSM+588                                              01023000
CMTA004  EQU   0                                                        01024000
@NM00005 EQU   0                                                        01025000
CMZID012 EQU   @NM00005                                                 01026000
@NM00006 EQU   @NM00005+4                                               01027000
CMZVP012 EQU   @NM00005+12                                              01028000
CMZSA012 EQU   0                                                        01029000
CMTA012  EQU   0                                                        01030000
CVTS01   EQU   CVTPGSIA                                                 01031000
CVTLPDIA EQU   CVTS01+12                                                01032000
CVTDIRST EQU   CVTLPDIA                                                 01033000
CVTSLIDA EQU   CVTS01+24                                                01034000
CVTCTLFG EQU   CVTS01+50                                                01035000
CVTRV210 EQU   CVTS01+424                                               01036000
CVTRV219 EQU   CVTS01+425                                               01037000
CVTRV228 EQU   CVTS01+426                                               01038000
CVTRV237 EQU   CVTS01+427                                               01039000
CVTMFRTR EQU   CVTS01+452                                               01040000
CVTRV262 EQU   CVTS01+468                                               01041000
CVTRV271 EQU   CVTS01+469                                               01042000
CVTRV280 EQU   CVTS01+470                                               01043000
CVTRV289 EQU   CVTS01+471                                               01044000
CVTGSDA  EQU   CVTS01+600                                               01045000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01046000
CVTRV628 EQU   CVTS01+728                                               01047000
CVTRV627 EQU   CVTS01+724                                               01048000
CVTRV626 EQU   CVTS01+720                                               01049000
CVTRV625 EQU   CVTS01+716                                               01050000
CVTRV624 EQU   CVTS01+712                                               01051000
CVTRV623 EQU   CVTS01+708                                               01052000
CVTRV622 EQU   CVTS01+704                                               01053000
CVTRV621 EQU   CVTS01+700                                               01054000
CVTRV620 EQU   CVTS01+696                                               01055000
CVTRV619 EQU   CVTS01+692                                               01056000
CVTRV618 EQU   CVTS01+688                                               01057000
CVTRV617 EQU   CVTS01+684                                               01058000
CVTRV616 EQU   CVTS01+680                                               01059000
CVTRV615 EQU   CVTS01+676                                               01060000
CVTRV614 EQU   CVTS01+672                                               01061000
CVTRV613 EQU   CVTS01+668                                               01062000
CVTTCASP EQU   CVTS01+664                                               01063000
CVT0PT03 EQU   CVTS01+660                                               01064000
CVT0PT0E EQU   CVTS01+656                                               01065000
CVTIRM   EQU   CVTS01+652                                               01066000
CVTCGK   EQU   CVTS01+648                                               01067000
CVTRV607 EQU   CVTS01+644                                               01068000
CVTRV606 EQU   CVTS01+640                                               01069000
CVTRV605 EQU   CVTS01+636                                               01070000
CVTRV604 EQU   CVTS01+632                                               01071000
CVTEFF02 EQU   CVTS01+628                                               01072000
CVTCBBR  EQU   CVTS01+624                                               01073000
CVTSSCR  EQU   CVTS01+620                                               01074000
CVTEVENT EQU   CVTS01+616                                               01075000
CVTCRCA  EQU   CVTS01+612                                               01076000
CVTTPIO  EQU   CVTS01+608                                               01077000
CVTADV   EQU   CVTS01+604                                               01078000
CVTGSDAB EQU   CVTGSDA                                                  01079000
CVTQV3   EQU   CVTS01+596                                               01080000
CVTQV2   EQU   CVTS01+592                                               01081000
CVTQV1   EQU   CVTS01+588                                               01082000
CVTRPT   EQU   CVTS01+584                                               01083000
CVTSSRB  EQU   CVTS01+580                                               01084000
CVTCSDRL EQU   CVTS01+576                                               01085000
CVTEXP1  EQU   CVTS01+572                                               01086000
CVTRMPMT EQU   CVTS01+568                                               01087000
CVTRMPTT EQU   CVTS01+564                                               01088000
CVTVPSA  EQU   CVTS01+560                                               01089000
CVTVSTOP EQU   CVTS01+556                                               01090000
CVTGTFR8 EQU   CVTS01+552                                               01091000
CVTQUIT  EQU   CVTS01+548                                               01092000
CVTVACR  EQU   CVTS01+544                                               01093000
CVTWTCB  EQU   CVTS01+540                                               01094000
CVTSTPRS EQU   CVTS01+536                                               01095000
CVT0PT02 EQU   CVTS01+532                                               01096000
CVTDARCM EQU   CVTS01+528                                               01097000
CVTIRECM EQU   CVTS01+524                                               01098000
CVTJRECM EQU   CVTS01+520                                               01099000
CVTVEMS0 EQU   CVTS01+516                                               01100000
CVTSPFRR EQU   CVTS01+512                                               01101000
CVTRLSTG EQU   CVTS01+508                                               01102000
CVT0TC0A EQU   CVTS01+504                                               01103000
CVTGMBR  EQU   CVTS01+500                                               01104000
CVTLFRM  EQU   CVTS01+496                                               01105000
CVTRMBR  EQU   CVTS01+492                                               01106000
CVTVIOP  EQU   CVTS01+488                                               01107000
CVTRV307 EQU   CVTS01+486                                               01108000
CVTRV306 EQU   CVTS01+484                                               01109000
CVTRV305 EQU   CVTS01+482                                               01110000
CVTRV304 EQU   CVTS01+480                                               01111000
CVTRV303 EQU   CVTS01+478                                               01112000
CVTRV302 EQU   CVTS01+476                                               01113000
CVTTRCA  EQU   CVTS01+472                                               01114000
CVTRV297 EQU   CVTRV289                                                 01115000
CVTRV296 EQU   CVTRV289                                                 01116000
CVTRV295 EQU   CVTRV289                                                 01117000
CVTRV294 EQU   CVTRV289                                                 01118000
CVTRV293 EQU   CVTRV289                                                 01119000
CVTRV292 EQU   CVTRV289                                                 01120000
CVTRV291 EQU   CVTRV289                                                 01121000
CVTRV290 EQU   CVTRV289                                                 01122000
CVTRV288 EQU   CVTRV280                                                 01123000
CVTRV287 EQU   CVTRV280                                                 01124000
CVTRV286 EQU   CVTRV280                                                 01125000
CVTRV285 EQU   CVTRV280                                                 01126000
CVTRV284 EQU   CVTRV280                                                 01127000
CVTRV283 EQU   CVTRV280                                                 01128000
CVTRV282 EQU   CVTRV280                                                 01129000
CVTRV281 EQU   CVTRV280                                                 01130000
CVTRV279 EQU   CVTRV271                                                 01131000
CVTRV278 EQU   CVTRV271                                                 01132000
CVTRV277 EQU   CVTRV271                                                 01133000
CVTRV276 EQU   CVTRV271                                                 01134000
CVTRV275 EQU   CVTRV271                                                 01135000
CVTRV274 EQU   CVTRV271                                                 01136000
CVTRV273 EQU   CVTRV271                                                 01137000
CVTRV272 EQU   CVTRV271                                                 01138000
CVTRV270 EQU   CVTRV262                                                 01139000
CVTRV269 EQU   CVTRV262                                                 01140000
CVTRV268 EQU   CVTRV262                                                 01141000
CVTRV267 EQU   CVTRV262                                                 01142000
CVTRV266 EQU   CVTRV262                                                 01143000
CVTRV265 EQU   CVTRV262                                                 01144000
CVTRV264 EQU   CVTRV262                                                 01145000
CVTRV263 EQU   CVTRV262                                                 01146000
CVTVFP   EQU   CVTS01+464                                               01147000
CVTVSI   EQU   CVTS01+460                                               01148000
CVTVPSIB EQU   CVTS01+456                                               01149000
CVTMFACT EQU   CVTMFRTR                                                 01150000
CVTMFCTL EQU   CVTS01+448                                               01151000
CVTPVBP  EQU   CVTS01+444                                               01152000
CVTPWI   EQU   CVTS01+440                                               01153000
CVTRV254 EQU   CVTS01+438                                               01154000
CVTRV253 EQU   CVTS01+436                                               01155000
CVTRV252 EQU   CVTS01+434                                               01156000
CVTRV251 EQU   CVTS01+433                                               01157000
CVTRV250 EQU   CVTS01+432                                               01158000
CVTRV249 EQU   CVTS01+431                                               01159000
CVTRV248 EQU   CVTS01+430                                               01160000
CVTRV247 EQU   CVTS01+429                                               01161000
CVTRV246 EQU   CVTS01+428                                               01162000
CVTRV245 EQU   CVTRV237                                                 01163000
CVTRV244 EQU   CVTRV237                                                 01164000
CVTRV243 EQU   CVTRV237                                                 01165000
CVTRV242 EQU   CVTRV237                                                 01166000
CVTRV241 EQU   CVTRV237                                                 01167000
CVTRV240 EQU   CVTRV237                                                 01168000
CVTRV239 EQU   CVTRV237                                                 01169000
CVTRV238 EQU   CVTRV237                                                 01170000
CVTRV236 EQU   CVTRV228                                                 01171000
CVTRV235 EQU   CVTRV228                                                 01172000
CVTRV234 EQU   CVTRV228                                                 01173000
CVTRV233 EQU   CVTRV228                                                 01174000
CVTRV232 EQU   CVTRV228                                                 01175000
CVTRV231 EQU   CVTRV228                                                 01176000
CVTRV230 EQU   CVTRV228                                                 01177000
CVTRV229 EQU   CVTRV228                                                 01178000
CVTRV227 EQU   CVTRV219                                                 01179000
CVTRV226 EQU   CVTRV219                                                 01180000
CVTRV225 EQU   CVTRV219                                                 01181000
CVTRV224 EQU   CVTRV219                                                 01182000
CVTRV223 EQU   CVTRV219                                                 01183000
CVTRV222 EQU   CVTRV219                                                 01184000
CVTRV221 EQU   CVTRV219                                                 01185000
CVTRV220 EQU   CVTRV219                                                 01186000
CVTRV218 EQU   CVTRV210                                                 01187000
CVTRV217 EQU   CVTRV210                                                 01188000
CVTRV216 EQU   CVTRV210                                                 01189000
CVTRV215 EQU   CVTRV210                                                 01190000
CVTRV214 EQU   CVTRV210                                                 01191000
CVTRV213 EQU   CVTRV210                                                 01192000
CVTRV212 EQU   CVTRV210                                                 01193000
CVTRV211 EQU   CVTRV210                                                 01194000
CVTLCCAT EQU   CVTS01+420                                               01195000
CVTPCCAT EQU   CVTS01+416                                               01196000
CVTIPCRP EQU   CVTS01+412                                               01197000
CVTIPCRI EQU   CVTS01+408                                               01198000
CVTIPCDS EQU   CVTS01+404                                               01199000
CVTAIDVT EQU   CVTS01+400                                               01200000
CVTSSAP  EQU   CVTS01+396                                               01201000
CVTEHCIR EQU   CVTS01+392                                               01202000
CVTEHDEF EQU   CVTS01+388                                               01203000
CVTDAIR  EQU   CVTS01+384                                               01204000
CVTPERFM EQU   CVTS01+380                                               01205000
CVT044R2 EQU   CVTS01+376                                               01206000
CVTFETCH EQU   CVTS01+372                                               01207000
CVTRSTWD EQU   CVTS01+368                                               01208000
CVTSPOST EQU   CVTS01+364                                               01209000
CVTIOBP  EQU   CVTS01+360                                               01210000
CVTASMVT EQU   CVTS01+356                                               01211000
CVTRECRQ EQU   CVTS01+352                                               01212000
CVTWSAC  EQU   CVTS01+348                                               01213000
CVTRV149 EQU   CVTS01+344                                               01214000
CVTWSAL  EQU   CVTS01+340                                               01215000
CVTSPSA  EQU   CVTS01+336                                               01216000
CVTGLMN  EQU   CVTS01+332                                               01217000
CVTVEAC0 EQU   CVTS01+328                                               01218000
CVT062R1 EQU   CVTS01+324                                               01219000
CVTRPOST EQU   CVTS01+320                                               01220000
CVTDQIQE EQU   CVTS01+316                                               01221000
CVTCSD   EQU   CVTS01+312                                               01222000
CVTLKRMA EQU   CVTS01+308                                               01223000
CVTRSPIE EQU   CVTS01+304                                               01224000
CVTRENQ  EQU   CVTS01+300                                               01225000
CVTLQCB  EQU   CVTS01+296                                               01226000
CVTFQCB  EQU   CVTS01+292                                               01227000
CVTQCS01 EQU   CVTS01+288                                               01228000
CVTAPFT  EQU   CVTS01+284                                               01229000
CVTPARRL EQU   CVTS01+280                                               01230000
CVTVWAIT EQU   CVTS01+276                                               01231000
CVTGSPL  EQU   CVTS01+272                                               01232000
CVTLSMQ  EQU   CVTS01+268                                               01233000
CVTGSMQ  EQU   CVTS01+264                                               01234000
CVTEXPRO EQU   CVTS01+260                                               01235000
CVTOPCTP EQU   CVTS01+256                                               01236000
CVTSIC   EQU   CVTS01+252                                               01237000
CVTTPIOS EQU   CVTS01+248                                               01238000
CVTRTMS  EQU   CVTS01+244                                               01239000
CVTSDBF  EQU   CVTS01+240                                               01240000
CVTSCBP  EQU   CVTS01+236                                               01241000
CVTSDMP  EQU   CVTS01+232                                               01242000
CVTSV60  EQU   CVTS01+228                                               01243000
CVTRTMCT EQU   CVTS01+224                                               01244000
CVTASCBL EQU   CVTS01+220                                               01245000
CVTASCBH EQU   CVTS01+216                                               01246000
CVTGDA   EQU   CVTS01+212                                               01247000
CVTASVT  EQU   CVTS01+208                                               01248000
CVTVVMDI EQU   CVTS01+204                                               01249000
CVTAQTOP EQU   CVTS01+200                                               01250000
CVTIOSCS EQU   CVTS01+196                                               01251000
CVTSDRM  EQU   CVTS01+192                                               01252000
CVTOPTE  EQU   CVTS01+188                                               01253000
CVTSTXU  EQU   CVTS01+184                                               01254000
CVTQUIS  EQU   CVTS01+180                                               01255000
CVTPARS  EQU   CVTS01+176                                               01256000
CVTS1EE  EQU   CVTS01+172                                               01257000
CVTFRAS  EQU   CVTS01+168                                               01258000
CVTQSAS  EQU   CVTS01+164                                               01259000
CVTCRAS  EQU   CVTS01+160                                               01260000
CVTCRMN  EQU   CVTS01+156                                               01261000
CVTDELCP EQU   CVTS01+152                                               01262000
CVTFRECL EQU   CVTS01+148                                               01263000
CVTGETCL EQU   CVTS01+144                                               01264000
CVTBLDCP EQU   CVTS01+140                                               01265000
CVTAUTHL EQU   CVTS01+136                                               01266000
CVTSCAN  EQU   CVTS01+132                                               01267000
CVTRV144 EQU   CVTS01+130                                               01268000
CVTMAXMP EQU   CVTS01+128                                               01269000
CVTSTCK  EQU   CVTS01+124                                               01270000
CVTRV139 EQU   CVTS01+123                                               01271000
CVTDSSAC EQU   CVTS01+122                                               01272000
CVTRV513 EQU   CVTS01+121                                               01273000
CVTIOSPL EQU   CVTS01+120                                               01274000
CVTPTGT  EQU   CVTS01+116                                               01275000
CVTCSPIE EQU   CVTS01+112                                               01276000
CVTSMFEX EQU   CVTS01+108                                               01277000
CVTOLT0A EQU   CVTS01+104                                               01278000
CVTSRBRT EQU   CVTS01+100                                               01279000
CVTPUTL  EQU   CVTS01+96                                                01280000
CVTASCRL EQU   CVTS01+92                                                01281000
CVTASCRF EQU   CVTS01+88                                                01282000
CVTRV326 EQU   CVTS01+84                                                01283000
CVTRV325 EQU   CVTS01+80                                                01284000
CVTRV324 EQU   CVTS01+76                                                01285000
CVT0VL01 EQU   CVTS01+72                                                01286000
CVTSHRVM EQU   CVTS01+68                                                01287000
CVTRV332 EQU   CVTS01+64                                                01288000
CVTTAS   EQU   CVTS01+60                                                01289000
CVTRSCN  EQU   CVTS01+56                                                01290000
CVTTRAC2 EQU   CVTS01+54                                                01291000
CVTTRACE EQU   CVTS01+52                                                01292000
CVTAPG   EQU   CVTS01+51                                                01293000
CVTSDTRC EQU   CVTCTLFG                                                 01294000
CVTGTRCE EQU   CVTCTLFG                                                 01295000
CVTNOMP  EQU   CVTCTLFG                                                 01296000
CVTRSV79 EQU   CVTCTLFG                                                 01297000
CVTDSTAT EQU   CVTCTLFG                                                 01298000
CVTRSV78 EQU   CVTCTLFG                                                 01299000
CVTRV333 EQU   CVTCTLFG                                                 01300000
CVTRV323 EQU   CVTCTLFG                                                 01301000
CVTSPVLK EQU   CVTS01+49                                                01302000
CVTRSV77 EQU   CVTS01+48                                                01303000
CVTRV331 EQU   CVTS01+44                                                01304000
CVTRV330 EQU   CVTS01+40                                                01305000
CVTRV329 EQU   CVTS01+36                                                01306000
CVTRV328 EQU   CVTS01+32                                                01307000
CVTRV322 EQU   CVTS01+28                                                01308000
CVTSLID  EQU   CVTSLIDA+1                                               01309000
CVTSYLK  EQU   CVTSLIDA                                                 01310000
CVTRV321 EQU   CVTS01+20                                                01311000
CVTRV320 EQU   CVTS01+16                                                01312000
CVTLPDIR EQU   CVTLPDIA+1                                               01313000
CVTRSV69 EQU   CVTDIRST                                                 01314000
CVTRSV68 EQU   CVTDIRST                                                 01315000
CVTRSV67 EQU   CVTDIRST                                                 01316000
CVTRSV66 EQU   CVTDIRST                                                 01317000
CVTRSV65 EQU   CVTDIRST                                                 01318000
CVTRSV64 EQU   CVTDIRST                                                 01319000
CVTRSV63 EQU   CVTDIRST                                                 01320000
CVTDICOM EQU   CVTDIRST                                                 01321000
CVTPVTP  EQU   CVTS01+8                                                 01322000
CVTLPDSR EQU   CVTS01+4                                                 01323000
CVTGETL  EQU   CVTS01                                                   01324000
CMZEA012 EQU   @NM00005+8                                               01325000
CMZRA012 EQU   @NM00006+1                                               01326000
CMZRL012 EQU   @NM00006                                                 01327000
ATCAOS   EQU   ISTATCVT+1584                                            01328000
ATCPOPAB EQU   ATCAOSM+640                                              01329000
ATCVIOPM EQU   ATCAOSM+636                                              01330000
ATCTPMMI EQU   ATCAOSM+632                                              01331000
ATCTPMPB EQU   ATCAOSM+600                                              01332000
ATCRSV88 EQU   ATCAOSM+596                                              01333000
ATCRPLCT EQU   ATCAOSM+594                                              01334000
ATCCRACT EQU   ATCAOSM+592                                              01335000
ATCSRBCT EQU   ATCAOSM+590                                              01336000
ATCRSV75 EQU   ATCAOSM+589                                              01337000
ATCRSV66 EQU   ATCZFLAG                                                 01338000
ATCZF001 EQU   ATCZFLAG                                                 01339000
ATCTPCP1 EQU   ATCAOSM+584                                              01340000
ATCTPCP0 EQU   ATCAOSM+580                                              01341000
ATCAICTN EQU   ATCAOSM+576                                              01342000
ATCZR01  EQU   ATCAOSM+572                                              01343000
ATCMPLTA EQU   ATCAOSM+568                                              01344000
ATCASCB  EQU   ATCAOSM+564                                              01345000
ATCAP86  EQU   ATCAOSM+560                                              01346000
ATCAP85  EQU   ATCAOSM+556                                              01347000
ATCAP84  EQU   ATCAOSM+552                                              01348000
ATCAP83  EQU   ATCAOSM+548                                              01349000
ATCAP82  EQU   ATCAOSM+544                                              01350000
ATCAP69  EQU   ATCAOSM+540                                              01351000
ATCAP66  EQU   ATCAOSM+536                                              01352000
ATCAP62  EQU   ATCAOSM+532                                              01353000
ATCAPC59 EQU   ATCAOSM+528                                              01354000
ATCAP56  EQU   ATCAOSM+524                                              01355000
ATCAP55  EQU   ATCAOSM+520                                              01356000
ATCRCFY0 EQU   ATCAOSM+516                                              01357000
ATCAP41  EQU   ATCAOSM+512                                              01358000
ATCAPC25 EQU   ATCAOSM+508                                              01359000
ATCAP23  EQU   ATCAOSM+504                                              01360000
ATCTPSPB EQU   ATCAOSM+472                                              01361000
ATCTRMPB EQU   ATCAOSM+440                                              01362000
ATCAPBE  EQU   ATCAOSM+436                                              01363000
ATCPSTA  EQU   ATCAOSM+432                                              01364000
ATCSMABF EQU   ATCAOSM+428                                              01365000
ATCSMAPR EQU   ATCAOSM+424                                              01366000
ATCTPWQA EQU   ATCAOSM+420                                              01367000
ATCSMAID EQU   ATCAOSM+416                                              01368000
ATCSMARA EQU   ATCAOSM+412                                              01369000
ATCCACXA EQU   ATCAOSM+408                                              01370000
ATCZLAAB EQU   ATCAOSM+404                                              01371000
ATCATA10 EQU   ATCAOSM+400                                              01372000
ATCHLTCB EQU   ATCAOSM+396                                              01373000
@NM00021 EQU   ATCVTFLG                                                 01374000
ATCVTACT EQU   ATCVTFLG                                                 01375000
ATCRPT40 EQU   ATCAOSM+388                                              01376000
ATCRPT39 EQU   ATCAOSM+384                                              01377000
ATCRPT38 EQU   ATCAOSM+380                                              01378000
ATCRPT37 EQU   ATCAOSM+376                                              01379000
ATCRPT36 EQU   ATCAOSM+372                                              01380000
ATCRPT35 EQU   ATCAOSM+368                                              01381000
ATCRPT34 EQU   ATCAOSM+364                                              01382000
ATCRPT33 EQU   ATCAOSM+360                                              01383000
ATCRPT32 EQU   ATCAOSM+356                                              01384000
ATCRPT31 EQU   ATCAOSM+352                                              01385000
ATCRPT30 EQU   ATCAOSM+348                                              01386000
ATCRPT29 EQU   ATCAOSM+344                                              01387000
ATCRPT28 EQU   ATCAOSM+340                                              01388000
ATCRPT27 EQU   ATCAOSM+336                                              01389000
ATCRPT26 EQU   ATCAOSM+332                                              01390000
ATCRPT25 EQU   ATCAOSM+328                                              01391000
ATCRPT24 EQU   ATCAOSM+324                                              01392000
ATCRPT23 EQU   ATCAOSM+320                                              01393000
ATCRPT22 EQU   ATCAOSM+316                                              01394000
ATCRPT21 EQU   ATCAOSM+312                                              01395000
ATCRPT20 EQU   ATCAOSM+308                                              01396000
ATCRPT19 EQU   ATCAOSM+304                                              01397000
ATCRPLAC EQU   ATCRPLCN+2                                               01398000
ATCRPLRC EQU   ATCRPLCN                                                 01399000
ATCCRPLQ EQU   ATCCRPL                                                  01400000
ATCSRBAC EQU   ATCSRBCN+2                                               01401000
ATCSRBRC EQU   ATCSRBCN                                                 01402000
ATCSRBQ  EQU   ATCSRB                                                   01403000
ATCCRAAC EQU   ATCCRACN+2                                               01404000
ATCCRARC EQU   ATCCRACN                                                 01405000
ATCCRAQ  EQU   ATCCRA                                                   01406000
ATCRPT12 EQU   ATCAOSM+276                                              01407000
ATCDMAPP EQU   ATCAOSM+272                                              01408000
ATCAP38  EQU   ATCAOSM+268                                              01409000
ATCAP37  EQU   ATCAOSM+264                                              01410000
ATCZDFJ0 EQU   ATCAOSM+260                                              01411000
ATCAP51  EQU   ATCAOSM+256                                              01412000
ATCZPAB2 EQU   ATCAOSM+224                                              01413000
ATCZPAB1 EQU   ATCAOSM+192                                              01414000
ATCZLFVT EQU   ATCAOSM+188                                              01415000
ATCZLPVT EQU   ATCAOSM+184                                              01416000
ATCZDVTX EQU   ATCAOSM+180                                              01417000
ATCZDVTA EQU   ATCAOSM+176                                              01418000
ATCZDVT9 EQU   ATCAOSM+172                                              01419000
ATCZDVT8 EQU   ATCAOSM+168                                              01420000
ATCZDVT7 EQU   ATCAOSM+164                                              01421000
ATCRSV56 EQU   ATCDAPVT+22                                              01422000
ATCDAPDG EQU   ATCDAPVT+20                                              01423000
ATCDXCEA EQU   ATCDAPVT+16                                              01424000
ATCDCEA  EQU   ATCDAPVT+12                                              01425000
ATCDPCIA EQU   ATCDAPVT+8                                               01426000
ATCDSIOA EQU   ATCDAPVT+4                                               01427000
ATCDEOEA EQU   ATCDAPVT                                                 01428000
ATCZLAEA EQU   ATCLDAPP+16                                              01429000
ATCZLCEA EQU   ATCLDAPP+12                                              01430000
ATCRSV17 EQU   ATCLDAPP+8                                               01431000
ATCSMFRR EQU   ATCLDAPP+4                                               01432000
ATCCDTID EQU   ATCLDAPP                                                 01433000
ATCZAEA  EQU   ATCICAPP+16                                              01434000
ATCZCEA  EQU   ATCICAPP+12                                              01435000
ATCCDTCB EQU   ATCICAPP+8                                               01436000
ATCZSIOA EQU   ATCICAPP+4                                               01437000
ATCCDRPH EQU   ATCICAPP                                                 01438000
ATCAP65  EQU   ATCAOSM+96                                               01439000
ATCZDVT6 EQU   ATCAOSM+92                                               01440000
ATCZDVT4 EQU   ATCAOSM+88                                               01441000
ATCZDVT3 EQU   ATCAOSM+84                                               01442000
ATCZDVT1 EQU   ATCAOSM+80                                               01443000
ATCICNCB EQU   ATCAOSM+76                                               01444000
ATCZPSVT EQU   ATCAOSM+72                                               01445000
ATCZFSVT EQU   ATCAOSM+68                                               01446000
ATCAP64  EQU   ATCAOSM+64                                               01447000
ATCAP63  EQU   ATCAOSM+60                                               01448000
ATCAP61  EQU   ATCAOSM+56                                               01449000
ATCAP58  EQU   ATCAOSM+52                                               01450000
ATCAP57  EQU   ATCAOSM+48                                               01451000
ATCAP54  EQU   ATCAOSM+44                                               01452000
ATCAP53  EQU   ATCAOSM+40                                               01453000
ATCAP52  EQU   ATCAOSM+36                                               01454000
ATCAP34  EQU   ATCAOSM+32                                               01455000
ATCAP32  EQU   ATCAOSM+28                                               01456000
ATCAP31  EQU   ATCAOSM+24                                               01457000
ATCAP12  EQU   ATCAOSM+20                                               01458000
ATCAP11  EQU   ATCAOSM+16                                               01459000
ATCCMTCB EQU   ATCAOSM+12                                               01460000
ATCPRPH  EQU   ATCAOSM+8                                                01461000
ATCGSRBF EQU   ATCGSRBG                                                 01462000
ATCSRBRT EQU   ATCAOSM                                                  01463000
@NM00020 EQU   @NM00019                                                 01464000
ATCVTMAB EQU   @NM00019                                                 01465000
@NM00018 EQU   ATCVTBAM                                                 01466000
ATCVDLOK EQU   ISTATCVT+904                                             01467000
ATCVFPAB EQU   ISTATCVT+872                                             01468000
ATCVDPAB EQU   ISTATCVT+840                                             01469000
ATCIOECB EQU   ISTATCVT+836                                             01470000
ATCINCW3 EQU   ISTATCVT+832                                             01471000
ATCMODTB EQU   ISTATCVT+828                                             01472000
ATCUSSPT EQU   ISTATCVT+824                                             01473000
ATCSRTAB EQU   ISTATCVT+820                                             01474000
@NM00017 EQU   ISTATCVT+819                                             01475000
@NM00016 EQU   ATCSTAT2                                                 01476000
ATCTRSMS EQU   ATCSTAT2                                                 01477000
ATCTRLOK EQU   ATCSTAT2                                                 01478000
ATCTRPSS EQU   ATCSTAT2                                                 01479000
ATCTRESC EQU   ATCSTAT2                                                 01480000
ATCTRAPI EQU   ATCSTAT2                                                 01481000
ATCNMCTR EQU   ISTATCVT+816                                             01482000
ATCSEC51 EQU   ATCSECST                                                 01483000
ATCSEC40 EQU   ATCSIPD+8                                                01484000
ATCSEC30 EQU   ATCSIPD+4                                                01485000
ATCSEC21 EQU   ATCSIPD                                                  01486000
ATCSEC10 EQU   ATCSOPD+4                                                01487000
ATCSEC01 EQU   ATCSOPD                                                  01488000
ATCPOIA  EQU   ATCRNO+1                                                 01489000
@NM00015 EQU   ATCRNO                                                   01490000
ATCPODVT EQU   ISTATCVT+784                                             01491000
ATCS49XL EQU   ISTATCVT+780                                             01492000
ATCS49XI EQU   ISTATCVT+776                                             01493000
ATCLCLCT EQU   ATCVLCNT+2                                               01494000
ATCRNCNT EQU   ATCVLCNT                                                 01495000
ATCCFEAD EQU   ISTATCVT+768                                             01496000
ATCPTR00 EQU   ISTATCVT+736                                             01497000
ATCRSV10 EQU   ISTATCVT+704                                             01498000
ATCTACB  EQU   ISTATCVT+700                                             01499000
ATCVTINM EQU   ISTATCVT+696                                             01500000
ATCTCLIM EQU   ISTATCVT+692                                             01501000
ATCTCLOM EQU   ISTATCVT+688                                             01502000
ATCVTIPB EQU   ISTATCVT+656                                             01503000
ATCTCIPB EQU   ISTATCVT+624                                             01504000
ATCTIPAB EQU   ISTATCVT+592                                             01505000
ATCOCCCB EQU   ISTATCVT+588                                             01506000
ATCOCCOB EQU   ISTATCVT+584                                             01507000
ATCCDLAD EQU   ISTATCVT+580                                             01508000
ATCCCLAD EQU   ISTATCVT+576                                             01509000
ATCDLRPB EQU   ISTATCVT+544                                             01510000
ATCPGPAB EQU   ISTATCVT+512                                             01511000
ATCVPAB1 EQU   ISTATCVT+480                                             01512000
ATCRSV97 EQU   ISTATCVT+476                                             01513000
ATCRDTLK EQU   ISTATCVT+472                                             01514000
ATCVOCLK EQU   ISTATCVT+468                                             01515000
ATCCDFDN EQU   ISTATCVT+464                                             01516000
ATCCDFIN EQU   ISTATCVT+460                                             01517000
ATCDVTLK EQU   ISTATCVT+456                                             01518000
ATCAP36  EQU   ISTATCVT+452                                             01519000
ATCAP35  EQU   ISTATCVT+448                                             01520000
ATCAP33  EQU   ISTATCVT+444                                             01521000
ATCRSV99 EQU   ISTATCVT+440                                             01522000
ATCONFIG EQU   ISTATCVT+432                                             01523000
ATCNODDS EQU   ISTATCVT+428                                             01524000
ATCNODEL EQU   ISTATCVT+420                                             01525000
ATCRSV69 EQU   ISTATCVT+416                                             01526000
ATCAPCR5 EQU   ISTATCVT+412                                             01527000
ATCLDECB EQU   ISTATCVT+408                                             01528000
ATCLDNCS EQU   ISTATCVT+404                                             01529000
ATCCDPTR EQU   ISTATCVT+400                                             01530000
ATCADEL  EQU   ISTATCVT+396                                             01531000
ATCTODVT EQU   ISTATCVT+392                                             01532000
ATCDEBCH EQU   ISTATCVT+388                                             01533000
ATCHBSIZ EQU   ATCHPGM+2                                                01534000
ATCHBFNO EQU   ATCHPGM                                                  01535000
ATCCRME  EQU   ISTATCVT+380                                             01536000
ATCRVCHS EQU   ISTATCVT+372                                             01537000
ATCECTLP EQU   ISTATCVT+368                                             01538000
ATCZDVTB EQU   ISTATCVT+364                                             01539000
ATCECPRT EQU   ISTATCVT+360                                             01540000
ATCVTLOD EQU   ISTATCVT+356                                             01541000
ATCTRPAB EQU   ISTATCVT+352                                             01542000
ATCMSGM  EQU   ISTATCVT+348                                             01543000
ATCEPT   EQU   ISTATCVT+340                                             01544000
ATCDVT   EQU   ISTATCVT+336                                             01545000
ATCTRCPT EQU   ISTATCVT+332                                             01546000
ATCDVLOD EQU   ISTATCVT+328                                             01547000
ATCALERT EQU   ISTATCVT+324                                             01548000
ATCEPA   EQU   ISTATCVT+320                                             01549000
ATCSAF   EQU   ISTATCVT+318                                             01550000
ATCXRANG EQU   ISTATCVT+317                                             01551000
ATCLAST  EQU   ATCSHRFG                                                 01552000
ATCSHRTN EQU   ISTATCVT+308                                             01553000
ATCUEP   EQU   ISTATCVT+304                                             01554000
ATCOCRT  EQU   ISTATCVT+300                                             01555000
ATCCSMA  EQU   ATCCSMR                                                  01556000
ATCESC02 EQU   ISTATCVT+292                                             01557000
ATCESC01 EQU   ISTATCVT+288                                             01558000
ATCCDFND EQU   ISTATCVT+284                                             01559000
ATCCDDEL EQU   ISTATCVT+280                                             01560000
ATCCDADD EQU   ISTATCVT+276                                             01561000
ATCMNT   EQU   ISTATCVT+272                                             01562000
ATCRSV16 EQU   ISTATCVT+270                                             01563000
ATCMAXID EQU   ISTATCVT+269                                             01564000
ATCMSGSP EQU   ATCCOM+268                                               01565000
ATCCIDM  EQU   ATCCOM+266                                               01566000
ATCACTRM EQU   ATCCOM+264                                               01567000
ATCNERAP EQU   ATCCOM+260                                               01568000
ATCNESAL EQU   ATCCOM+256                                               01569000
ATCRCC65 EQU   ATCCOM+252                                               01570000
ATCRCC26 EQU   ATCCOM+248                                               01571000
ATCRCC63 EQU   ATCCOM+244                                               01572000
ATCRSV11 EQU   ATCCOM+242                                               01573000
ATCVTMID EQU   ATCCOM+240                                               01574000
ATCAPOST EQU   ATCCOM+236                                               01575000
ATCNERFN EQU   ATCCOM+232                                               01576000
ATCNERNE EQU   ATCCOM+228                                               01577000
ATCNERCV EQU   ATCCOM+224                                               01578000
ATCNERST EQU   ATCCOM+220                                               01579000
ATCDCC61 EQU   ATCCOM+216                                               01580000
ATCDCC60 EQU   ATCCOM+212                                               01581000
ATCSRTDF EQU   ATCCOM+208                                               01582000
ATCSRTAD EQU   ATCCOM+204                                               01583000
ATCFIRA  EQU   ATCCOM+200                                               01584000
ATCSMBQ  EQU   ATCCOM+196                                               01585000
ATCSMRC  EQU   ATCCOM+192                                               01586000
ATCSMRS  EQU   ATCCOM+188                                               01587000
ATCSMQU  EQU   ATCCOM+184                                               01588000
ATCSMRQ  EQU   ATCCOM+180                                               01589000
ATCACDA  EQU   ATCCOM+176                                               01590000
ATCSTMA  EQU   ATCCOM+172                                               01591000
ATCFRSTR EQU   ATCCOM+168                                               01592000
ATCGTSTR EQU   ATCCOM+164                                               01593000
ATCREADA EQU   ATCCOM+160                                               01594000
ATCALOAD EQU   ATCCOM+156                                               01595000
ATCBLDLA EQU   ATCCOM+152                                               01596000
ATCFBRPH EQU   ATCCOM+148                                               01597000
ATCBFTRC EQU   ATCCOM+144                                               01598000
ATCTPBUF EQU   ATCTHTRC                                                 01599000
ATCREMOV EQU   ATCCOM+136                                               01600000
ATCADD   EQU   ATCCOM+132                                               01601000
ATCBPDA  EQU   ATCCOM+128                                               01602000
ATCDVTPT EQU   ATCCOM+124                                               01603000
ATCFEPT  EQU   ATCCOM+120                                               01604000
ATCFDVT  EQU   ATCCOM+116                                               01605000
ATCCONFT EQU   ATCCOM+112                                               01606000
ATCPTCHA EQU   ATCCOM+108                                               01607000
ATCAUTHA EQU   ATCCOM+104                                               01608000
ATCACCTA EQU   ATCCOM+100                                               01609000
ATCRDTH  EQU   ATCCOM+96                                                01610000
ATCFRSCH EQU   ATCCOM+92                                                01611000
ATCFSB   EQU   ATCCOM+88                                                01612000
ATCHLTMS EQU   ATCCOM+84                                                01613000
ATCECPRM EQU   ATCCOM+80                                                01614000
ATCECNET EQU   ATCCOM+76                                                01615000
ATCECOPC EQU   ATCCOM+72                                                01616000
ATCVPARM EQU   ATCCOM+68                                                01617000
ATCECVRQ EQU   ATCCOM+64                                                01618000
ATCECSES EQU   ATCCOM+60                                                01619000
ATCOCHA  EQU   ATCCOM+56                                                01620000
ATCDSPLQ EQU   ATCCOM+52                                                01621000
ATCECDSP EQU   ATCCOM+48                                                01622000
ATCVARYQ EQU   ATCCOM+44                                                01623000
ATCECVRY EQU   ATCCOM+40                                                01624000
ATCHALTQ EQU   ATCCOM+36                                                01625000
ATCECHLT EQU   ATCCOM+32                                                01626000
ATCMODQ  EQU   ATCCOM+28                                                01627000
ATCECMOD EQU   ATCCOM+24                                                01628000
ATCASCHD EQU   ATCCOM+20                                                01629000
ATCSRT   EQU   ATCCOM+16                                                01630000
ATCRDT   EQU   ATCCOM+12                                                01631000
ATCDCFRR EQU   ATCCOM+8                                                 01632000
ATCAPI   EQU   ATCCOM+4                                                 01633000
ATCRSV04 EQU   ATCSTAT4                                                 01634000
ATCVTTRC EQU   ATCSTAT4                                                 01635000
ATCNCSD  EQU   ATCSTAT4                                                 01636000
ATCMTST  EQU   ATCSTAT4                                                 01637000
ATCTPRT  EQU   ATCSTAT4                                                 01638000
ATCPRTAT EQU   ATCSTAT4                                                 01639000
@NM00014 EQU   ATCPOFLG                                                 01640000
ATCPOUNS EQU   ATCPOFLG                                                 01641000
ATCHSDMF EQU   ATCSTFLG                                                 01642000
@NM00013 EQU   ATCSTAT1                                                 01643000
ATCMDHLT EQU   ATCSTAT1                                                 01644000
ATCINHLT EQU   ATCSTAT1                                                 01645000
ATCNETSL EQU   ATCSTAT1                                                 01646000
ATCQKHLT EQU   ATCSTAT1                                                 01647000
ATCSNHLT EQU   ATCSTAT1                                                 01648000
ATCACTIV EQU   ATCSTAT1                                                 01649000
ATCSTART EQU   ATCSTAT1                                                 01650000
RPHNEXPO EQU   ISTRPH+104                                               01651000
RPHSAV16 EQU   RPHWORK+60                                               01652000
RPHSAV15 EQU   RPHWORK+56                                               01653000
RPHSAV14 EQU   RPHWORK+52                                               01654000
RPHSAV13 EQU   RPHWORK+48                                               01655000
RPHSAV12 EQU   RPHWORK+44                                               01656000
RPHSAV11 EQU   RPHWORK+40                                               01657000
RPHSAV10 EQU   RPHWORK+36                                               01658000
RPHSAVE9 EQU   RPHWORK+32                                               01659000
RPHSAVE8 EQU   RPHWORK+28                                               01660000
RPHSAVE7 EQU   RPHWORK+24                                               01661000
RPHSAVE6 EQU   RPHWORK+20                                               01662000
RPHSAVE5 EQU   RPHWORK+16                                               01663000
RPHSAVE4 EQU   RPHWORK+12                                               01664000
RPHSAVE3 EQU   RPHWORK+8                                                01665000
RPHSAVE2 EQU   RPHWORK+4                                                01666000
RPHSHALF EQU   RPHSAVE1+2                                               01667000
RPHSBIT8 EQU   RPHSBITS                                                 01668000
RPHSBIT7 EQU   RPHSBITS                                                 01669000
RPHSBIT6 EQU   RPHSBITS                                                 01670000
RPHSBIT5 EQU   RPHSBITS                                                 01671000
RPHSBIT4 EQU   RPHSBITS                                                 01672000
RPHSBIT3 EQU   RPHSBITS                                                 01673000
RPHSBIT2 EQU   RPHSBITS                                                 01674000
RPHSBIT1 EQU   RPHSBITS                                                 01675000
RPHSBYTE EQU   RPHSAVE1                                                 01676000
RPHPABQP EQU   RPHPABQA+1                                               01677000
RPHPABFG EQU   RPHPABQA                                                 01678000
RPHCRR   EQU   ISTRPH+32                                                01679000
RPHSRP34 EQU   RPHSRPRM+2                                               01680000
RPHSRP12 EQU   RPHSRPRM                                                 01681000
RPHWEGT  EQU   RPHCSPA                                                  01682000
RPHMAJCB EQU   ISTRPH+21                                                01683000
RPHPABOF EQU   ISTRPH+20                                                01684000
RPHRESUM EQU   RPHRESMA+1                                               01685000
RPHRSV01 EQU   RPHWPFLG                                                 01686000
RPHPURGE EQU   RPHWPFLG                                                 01687000
RPHPT    EQU   RPHWPFLG                                                 01688000
RPHWT    EQU   RPHWPFLG                                                 01689000
RPHRSKEY EQU   RPHWPFLG                                                 01690000
RPHDVTA  EQU   ISTRPH+12                                                01691000
RPHTIK   EQU   RPHTSKID+3                                               01692000
@NM00012 EQU   RPHTSKID                                                 01693000
RPHRPHAP EQU   RPHRPHA+1                                                01694000
@NM00011 EQU   RPHRPHA                                                  01695000
RPHGATE  EQU   RPHRPHA                                                  01696000
@NM00010 EQU   RPHFLGB                                                  01697000
RPHRLCRA EQU   RPHFLGB                                                  01698000
RPHNRSAV EQU   RPHFLGB                                                  01699000
RPHPGCMP EQU   RPHFLGB                                                  01700000
RPHFBAPS EQU   RPHFLGB                                                  01701000
RPHBSSP  EQU   RPHFLGB                                                  01702000
RPHLOCK  EQU   RPHFLGB                                                  01703000
RPHFNFLG EQU   RPHFSTLC                                                 01704000
RPHMLTCP EQU   RPHFLAGS                                                 01705000
RPHSMCLR EQU   RPHFLAGS                                                 01706000
RPHSMTYP EQU   RPHFLAGS                                                 01707000
RPHSMQ   EQU   RPHFLAGS                                                 01708000
RPHAUTEX EQU   RPHAPTYP                                                 01709000
RPHSPGIN EQU   RPHFLAGS                                                 01710000
RPHOGIND EQU   RPHFLAGS                                                 01711000
RPHLNGTH EQU   RPHCNTL+1                                                01712000
RPHTYPE  EQU   RPHCNTL                                                  01713000
LOKXCL   EQU   @NM00008                                                 01714000
LOKPRY   EQU   @NM00008                                                 01715000
@NM00009 EQU   @NM00008                                                 01716000
@NM00007 EQU   LOKCHNG                                                  01717000
LOKCT    EQU   ISTLOK                                                   01718000
CMZEA004 EQU   @NM00003+8                                               01719000
CMZRA004 EQU   @NM00004+1                                               01720000
CMZRL004 EQU   @NM00004                                                 01721000
LDPTCEP  EQU   ISTLDPRM+24                                              01722000
LDPRSV02 EQU   ISTLDPRM+22                                              01723000
LDPRSV01 EQU   LDPFB2                                                   01724000
LDPACTIF EQU   LDPFB2                                                   01725000
LDPATACH EQU   LDPFB2                                                   01726000
LDPFLAST EQU   LDPFB2                                                   01727000
LDPRSV03 EQU   LDPFG                                                    01728000
LDPPB    EQU   LDPFG                                                    01729000
LDPFX    EQU   LDPFG                                                    01730000
LDPPDS   EQU   ISTLDPRM+8                                               01731000
LDPMBR   EQU   ISTLDPRM                                                 01732000
DYPPAB   EQU   ISTDYPAB+16                                              01733000
DYPRSV01 EQU   ISTDYPAB+12                                              01734000
DYPTSKID EQU   ISTDYPAB+8                                               01735000
DYPCHAIN EQU   ISTDYPAB+4                                               01736000
DYPFLGS  EQU   ISTDYPAB+2                                               01737000
DYPLNGTH EQU   ISTDYPAB+1                                               01738000
DYPTYPE  EQU   ISTDYPAB                                                 01739000
PABRPHA  EQU   PABRPHFG+1                                               01740000
PABNODQ  EQU   PABFLAGS                                                 01741000
PABINHBT EQU   PABFLAGS                                                 01742000
PABERLOK EQU   PABERRLK                                                 01743000
PABSSN   EQU   PABFLAGS                                                 01744000
PABDYNAM EQU   PABFLAGS                                                 01745000
PABNORPR EQU   PABFLAGS                                                 01746000
PABPRIOR EQU   PABFLAGS                                                 01747000
PABAPYP  EQU   PABFLAGS                                                 01748000
PABDVTA  EQU   ISTPAB+9                                                 01749000
PABOFFST EQU   ISTPAB+8                                                 01750000
PABCHNGP EQU   PABCHAIN+1                                               01751000
PABRSV02 EQU   PABCHAIN                                                 01752000
PABDELAY EQU   PABCHAIN                                                 01753000
PABRUNNG EQU   PABCHAIN                                                 01754000
PABRESET EQU   PABCHAIN                                                 01755000
PABUNCON EQU   PABCHAIN                                                 01756000
PABCDP   EQU   PABCHAIN                                                 01757000
PABRESCH EQU   PABCHAIN                                                 01758000
PABCHNG  EQU   PABCHAIN                                                 01759000
PABWEQP  EQU   PABWEQA+1                                                01760000
PABRSV01 EQU   PABWEQA                                                  01761000
PABWEQG  EQU   PABWEQA                                                  01762000
CVTLEVL  EQU   CVTRELNO+2                                               01763000
CVTNUMB  EQU   CVTRELNO                                                 01764000
CVTMDL   EQU   CVTFIX+250                                               01765000
@NM00002 EQU   CVTFIX+248                                               01766000
@NM00001 EQU   CVTFIX                                                   01767000
CVTRV482 EQU   CVTXTNT2+128                                             01768000
CVTRV481 EQU   CVTXTNT2+124                                             01769000
CVTRV480 EQU   CVTXTNT2+120                                             01770000
CVTRV479 EQU   CVTXTNT2+118                                             01771000
CVTRV478 EQU   CVTXTNT2+117                                             01772000
CVTRV477 EQU   CVTXTNT2+116                                             01773000
CVTRV476 EQU   CVTXTNT2+115                                             01774000
CVTRV475 EQU   CVTXTNT2+114                                             01775000
CVTRV474 EQU   CVTRV466                                                 01776000
CVTRV473 EQU   CVTRV466                                                 01777000
CVTRV472 EQU   CVTRV466                                                 01778000
CVTRV471 EQU   CVTRV466                                                 01779000
CVTRV470 EQU   CVTRV466                                                 01780000
CVTRV469 EQU   CVTRV466                                                 01781000
CVTRV468 EQU   CVTRV466                                                 01782000
CVTRV467 EQU   CVTRV466                                                 01783000
CVTRV465 EQU   CVTRV457                                                 01784000
CVTRV464 EQU   CVTRV457                                                 01785000
CVTRV463 EQU   CVTRV457                                                 01786000
CVTRV462 EQU   CVTRV457                                                 01787000
CVTRV461 EQU   CVTRV457                                                 01788000
CVTRV460 EQU   CVTRV457                                                 01789000
CVTRV459 EQU   CVTRV457                                                 01790000
CVTRV458 EQU   CVTRV457                                                 01791000
CVTRV456 EQU   CVTXTNT2+108                                             01792000
CVTRV455 EQU   CVTXTNT2+104                                             01793000
CVTRV454 EQU   CVTXTNT2+100                                             01794000
CVTRV453 EQU   CVTXTNT2+96                                              01795000
CVTRV452 EQU   CVTXTNT2+94                                              01796000
CVTRV451 EQU   CVTXTNT2+92                                              01797000
CVTRV450 EQU   CVTXTNT2+90                                              01798000
CVTRV449 EQU   CVTXTNT2+88                                              01799000
CVTRV448 EQU   CVTXTNT2+87                                              01800000
CVTRV447 EQU   CVTXTNT2+86                                              01801000
CVTRV446 EQU   CVTRV438                                                 01802000
CVTRV445 EQU   CVTRV438                                                 01803000
CVTRV444 EQU   CVTRV438                                                 01804000
CVTRV443 EQU   CVTRV438                                                 01805000
CVTRV442 EQU   CVTRV438                                                 01806000
CVTRV441 EQU   CVTRV438                                                 01807000
CVTRV440 EQU   CVTRV438                                                 01808000
CVTRV439 EQU   CVTRV438                                                 01809000
CVTRV437 EQU   CVTRV429                                                 01810000
CVTRV436 EQU   CVTRV429                                                 01811000
CVTRV435 EQU   CVTRV429                                                 01812000
CVTRV434 EQU   CVTRV429                                                 01813000
CVTRV433 EQU   CVTRV429                                                 01814000
CVTRV432 EQU   CVTRV429                                                 01815000
CVTRV431 EQU   CVTRV429                                                 01816000
CVTRV430 EQU   CVTRV429                                                 01817000
CVTRV428 EQU   CVTXTNT2+80                                              01818000
CVTRV427 EQU   CVTXTNT2+76                                              01819000
CVTRV426 EQU   CVTXTNT2+72                                              01820000
CVTRV425 EQU   CVTXTNT2+68                                              01821000
CVTATACT EQU   CVTATCVT                                                 01822000
CVTRV423 EQU   CVTXTNT2+62                                              01823000
CVTRV422 EQU   CVTXTNT2+60                                              01824000
CVTRV421 EQU   CVTXTNT2+58                                              01825000
CVTRV420 EQU   CVTXTNT2+56                                              01826000
CVTRV419 EQU   CVTXTNT2+55                                              01827000
CVTRV418 EQU   CVTXTNT2+54                                              01828000
CVTRV417 EQU   CVTRV409                                                 01829000
CVTRV416 EQU   CVTRV409                                                 01830000
CVTRV415 EQU   CVTRV409                                                 01831000
CVTRV414 EQU   CVTRV409                                                 01832000
CVTRV413 EQU   CVTRV409                                                 01833000
CVTRV412 EQU   CVTRV409                                                 01834000
CVTRV411 EQU   CVTRV409                                                 01835000
CVTRV410 EQU   CVTRV409                                                 01836000
CVTRV408 EQU   CVTRV400                                                 01837000
CVTRV407 EQU   CVTRV400                                                 01838000
CVTRV406 EQU   CVTRV400                                                 01839000
CVTRV405 EQU   CVTRV400                                                 01840000
CVTRV404 EQU   CVTRV400                                                 01841000
CVTRV403 EQU   CVTRV400                                                 01842000
CVTRV402 EQU   CVTRV400                                                 01843000
CVTRV401 EQU   CVTRV400                                                 01844000
CVTICB   EQU   CVTXTNT2+48                                              01845000
CVTSKTA  EQU   CVTXTNT2+44                                              01846000
CVTSHSB  EQU   CVTSHS                                                   01847000
CVTRSV98 EQU   CVTXTNT2+36                                              01848000
CVTRSV97 EQU   CVTXTNT2+34                                              01849000
CVTRSV96 EQU   CVTXTNT2+32                                              01850000
CVTOLTEP EQU   CVTXTNT2+28                                              01851000
CVTQIDA  EQU   CVTQID+1                                                 01852000
CVTRSV95 EQU   CVTQID                                                   01853000
CVTRSV94 EQU   CVTXTNT2+20                                              01854000
CVTRSV93 EQU   CVTXTNT2+16                                              01855000
CVTRSV92 EQU   CVTXTNT2+12                                              01856000
CVTDEBVR EQU   CVTXTNT2+8                                               01857000
CVTRSV91 EQU   CVTXTNT2+6                                               01858000
CVTRSV9H EQU   CVTFLGBT                                                 01859000
CVTRSV9G EQU   CVTFLGBT                                                 01860000
CVTRSV9F EQU   CVTFLGBT                                                 01861000
CVTRSV9E EQU   CVTFLGBT                                                 01862000
CVTRSV9D EQU   CVTFLGBT                                                 01863000
CVTRSV9C EQU   CVTFLGBT                                                 01864000
CVTVME   EQU   CVTFLGBT                                                 01865000
CVTNPE   EQU   CVTFLGBT                                                 01866000
CVTNUCLS EQU   CVTXTNT2+4                                               01867000
CVTDSSVA EQU   CVTDSSV+1                                                01868000
CVTRSV89 EQU   CVTDSSV                                                  01869000
CVTRSV88 EQU   CVTXTNT1+8                                               01870000
CVTRSV87 EQU   CVTXTNT1+4                                               01871000
CVTFACHN EQU   CVTXTNT1                                                 01872000
CVTRV488 EQU   CVTMAP+412                                               01873000
CVTRV487 EQU   CVTMAP+408                                               01874000
CVTRV486 EQU   CVTMAP+404                                               01875000
CVTRV485 EQU   CVTMAP+400                                               01876000
CVTACTAP EQU   CVTMAP+396                                               01877000
CVTAUTH  EQU   CVTMAP+392                                               01878000
CVTATMCA EQU   CVTATMCT+1                                               01879000
CVTATMST EQU   CVTATMCT                                                 01880000
CVTRSV61 EQU   CVTMAP+384                                               01881000
CVTVOLT1 EQU   CVTVOLM1+1                                               01882000
CVTVOLI1 EQU   CVTVOLF1                                                 01883000
CVTSTOA  EQU   CVTMAP+376                                               01884000
CVTRSV58 EQU   CVTMAP+374                                               01885000
CVTRSV57 EQU   CVTMAP+372                                               01886000
CVTDDCE  EQU   CVTMAP+368                                               01887000
CVTPNWFR EQU   CVTMAP+364                                               01888000
CVTSMF   EQU   CVTMAP+360                                               01889000
CVTSULK  EQU   CVTMAP+358                                               01890000
CVTSLKO  EQU   CVTSYSK                                                  01891000
CVTSLKP  EQU   CVTSYSK                                                  01892000
CVTSLKQ  EQU   CVTSYSK                                                  01893000
CVTSLKR  EQU   CVTSYSK                                                  01894000
CVTRSV56 EQU   CVTSYSK                                                  01895000
CVTRSV55 EQU   CVTSYSK                                                  01896000
CVTRSV54 EQU   CVTSYSK                                                  01897000
CVTRSV53 EQU   CVTSYSK                                                  01898000
CVTRSV52 EQU   CVTA1F1                                                  01899000
CVTRSV51 EQU   CVTA1F1                                                  01900000
CVTRSV50 EQU   CVTA1F1                                                  01901000
CVTRSV49 EQU   CVTA1F1                                                  01902000
CVTRSV48 EQU   CVTA1F1                                                  01903000
CVTRSV47 EQU   CVTA1F1                                                  01904000
CVTSRSW  EQU   CVTA1F1                                                  01905000
CVTPFSW  EQU   CVTA1F1                                                  01906000
CVTPCVT  EQU   CVTMAP+352                                               01907000
CVTRSV46 EQU   CVTMAP+344                                               01908000
CVTRSV45 EQU   CVTMAP+340                                               01909000
CVTRSV44 EQU   CVTMAP+338                                               01910000
CVTRSV43 EQU   CVTMAP+336                                               01911000
CVTHJESA EQU   CVTHJES+1                                                01912000
CVTRSV42 EQU   CVTHJES                                                  01913000
CVTEXT2A EQU   CVTEXT2+1                                                01914000
CVTRSV41 EQU   CVTEXT2                                                  01915000
CVTAPFA  EQU   CVTAPF+1                                                 01916000
CVTRSV40 EQU   CVTAPF                                                   01917000
CVTRV518 EQU   CVTINTLA                                                 01918000
CVTRV517 EQU   CVTERPV                                                  01919000
CVTEORM  EQU   CVTMAP+312                                               01920000
CVTMCHPR EQU   CVTMAP+308                                               01921000
CVTTZ    EQU   CVTMAP+304                                               01922000
CVTJEPS  EQU   CVTMAP+300                                               01923000
CVTJESCT EQU   CVTMAP+296                                               01924000
CVTMODE  EQU   CVTMAP+292                                               01925000
CVTPTRV  EQU   CVTMAP+288                                               01926000
CVTREAL  EQU   CVTMAP+284                                               01927000
CVTRSV39 EQU   CVTMAP+280                                               01928000
CVTRSV38 EQU   CVTMAP+276                                               01929000
CVTDMSRA EQU   CVTDMSR+1                                                01930000
CVTRV634 EQU   CVTDMSRF                                                 01931000
CVTRV633 EQU   CVTDMSRF                                                 01932000
CVTRV632 EQU   CVTDMSRF                                                 01933000
CVTRV631 EQU   CVTDMSRF                                                 01934000
CVTRV630 EQU   CVTDMSRF                                                 01935000
CVTRV629 EQU   CVTDMSRF                                                 01936000
CVTUDUMP EQU   CVTDMSRF                                                 01937000
CVTSDUMP EQU   CVTDMSRF                                                 01938000
CVTQMSGA EQU   CVTQMSG+1                                                01939000
CVTRSV36 EQU   CVTQMSG                                                  01940000
CVTAMFF  EQU   CVTMAP+264                                               01941000
CVTPURGA EQU   CVTPURG+1                                                01942000
CVTRSV35 EQU   CVTPURG                                                  01943000
CVTCBSP  EQU   CVTMAP+256                                               01944000
CVTATERA EQU   CVTATER+1                                                01945000
CVTSYST  EQU   CVTATER                                                  01946000
CVTVOLT2 EQU   CVTTAT                                                   01947000
CVTVOLI2 EQU   CVTVOLF2                                                 01948000
CVTAQAVB EQU   CVTAQAVT+1                                               01949000
CVTRSV34 EQU   CVTTCMFG                                                 01950000
CVTRSV33 EQU   CVTTCMFG                                                 01951000
CVTRSV32 EQU   CVTTCMFG                                                 01952000
CVTRSV31 EQU   CVTTCMFG                                                 01953000
CVTRSV30 EQU   CVTTCMFG                                                 01954000
CVTRSV29 EQU   CVTTCMFG                                                 01955000
CVTRSV28 EQU   CVTTCMFG                                                 01956000
CVTTCRDY EQU   CVTTCMFG                                                 01957000
CVTGTFA  EQU   CVTGTF+1                                                 01958000
CVTRSV27 EQU   CVTGTFST                                                 01959000
CVTRNIO  EQU   CVTGTFST                                                 01960000
CVTUSR   EQU   CVTGTFST                                                 01961000
CVTRV318 EQU   CVTFORM                                                  01962000
CVTRV317 EQU   CVTTMODE                                                 01963000
CVTRV316 EQU   CVTSTATE                                                 01964000
CVTRV315 EQU   CVTGTFS                                                  01965000
CVTGTFAV EQU   CVTGTFS                                                  01966000
CVT0SCR1 EQU   CVTMAP+232                                               01967000
CVTRV515 EQU   CVTMAP+228                                               01968000
CVTRMS   EQU   CVTMAP+224                                               01969000
CVTPATCH EQU   CVTMAP+220                                               01970000
CVTTSCE  EQU   CVTMAP+216                                               01971000
CVTLNKSC EQU   CVTMAP+214                                               01972000
CVTQABST EQU   CVTMAP+212                                               01973000
CVTMDLDS EQU   CVTMAP+208                                               01974000
CVTUSER  EQU   CVTMAP+204                                               01975000
CVTABEND EQU   CVTMAP+200                                               01976000
CVTSMCA  EQU   CVTMAP+196                                               01977000
CVTRSV18 EQU   CVTMAP+192                                               01978000
CVTQLPAQ EQU   CVTMAP+188                                               01979000
CVTQCDSR EQU   CVTMAP+184                                               01980000
CVTRSV17 EQU   CVTOPTB                                                  01981000
CVTRSV16 EQU   CVTOPTB                                                  01982000
CVTFP    EQU   CVTOPTB                                                  01983000
CVTAPTHR EQU   CVTOPTB                                                  01984000
CVTNLOG  EQU   CVTOPTB                                                  01985000
CVTTOD   EQU   CVTOPTB                                                  01986000
CVTCTIMS EQU   CVTOPTB                                                  01987000
CVTPROT  EQU   CVTOPTB                                                  01988000
CVTXPFP  EQU   CVTOPTA                                                  01989000
CVTASCII EQU   CVTOPTA                                                  01990000
CVTRSV13 EQU   CVTOPTA                                                  01991000
CVTRSV12 EQU   CVTOPTA                                                  01992000
CVTNIP   EQU   CVTOPTA                                                  01993000
CVTDDR   EQU   CVTOPTA                                                  01994000
CVTAPR   EQU   CVTOPTA                                                  01995000
CVTCCH   EQU   CVTOPTA                                                  01996000
CVTSNCTR EQU   CVTMAP+180                                               01997000
CVTQMWR  EQU   CVTMAP+176                                               01998000
CVTQOCR  EQU   CVTMAP+172                                               01999000
CVT1EF00 EQU   CVTMAP+168                                               02000000
CVTMZ00  EQU   CVTMAP+164                                               02001000
CVTHEAD  EQU   CVTMAP+160                                               02002000
CVTRSV11 EQU   CVTMAP+156                                               02003000
CVT0PT01 EQU   CVTMAP+152                                               02004000
CVTMSER  EQU   CVTMAP+148                                               02005000
CVTRV516 EQU   CVTIERLC                                                 02006000
CVTILCH  EQU   CVTMAP+140                                               02007000
CVT0DS   EQU   CVTMAP+136                                               02008000
CVTFBOSV EQU   CVTMAP+132                                               02009000
CVTNUCB  EQU   CVTMAP+128                                               02010000
CVTIXAVL EQU   CVTMAP+124                                               02011000
CVTIOQET EQU   CVTMAP+120                                               02012000
CVTDCBA  EQU   CVTMAP+117                                               02013000
CVTMVS2  EQU   CVTDCB                                                   02014000
CVT6DAT  EQU   CVTDCB                                                   02015000
CVT4MPS  EQU   CVTDCB                                                   02016000
CVTRSV09 EQU   CVTDCB                                                   02017000
CVT4MS1  EQU   CVTDCB                                                   02018000
CVT2SPS  EQU   CVTDCB                                                   02019000
CVT1SSS  EQU   CVTDCB                                                   02020000
CVTRSV08 EQU   CVTDCB                                                   02021000
CVTSTB   EQU   CVTMAP+112                                               02022000
CVTQTD00 EQU   CVTMAP+108                                               02023000
CVTQTE00 EQU   CVTMAP+104                                               02024000
CVTCUCB  EQU   CVTMAP+100                                               02025000
CVTSJQ   EQU   CVTMAP+96                                                02026000
CVTPBLDL EQU   CVTMAP+92                                                02027000
CVTTPC   EQU   CVTMAP+88                                                02028000
CVTSVDCB EQU   CVTMAP+84                                                02029000
CVTBRET  EQU   CVTMAP+82                                                02030000
CVTEXIT  EQU   CVTMAP+80                                                02031000
CVT0FN00 EQU   CVTMAP+76                                                02032000
CVTDARA  EQU   CVTDAR+1                                                 02033000
CVTRSV07 EQU   CVTFLGS1                                                 02034000
CVTRSV06 EQU   CVTFLGS1                                                 02035000
CVTRSV05 EQU   CVTFLGS1                                                 02036000
CVTRSV04 EQU   CVTFLGS1                                                 02037000
CVTRSV03 EQU   CVTFLGS1                                                 02038000
CVTRSV02 EQU   CVTFLGS1                                                 02039000
CVTRSV01 EQU   CVTFLGS1                                                 02040000
CVTDMPLK EQU   CVTFLGS1                                                 02041000
CVTXITP  EQU   CVTMAP+68                                                02042000
CVTZDTAB EQU   CVTMAP+64                                                02043000
CVTMSLT  EQU   CVTMAP+60                                                02044000
CVTDATE  EQU   CVTMAP+56                                                02045000
CVTBTERM EQU   CVTMAP+52                                                02046000
CVTSYSAD EQU   CVTMAP+48                                                02047000
CVTXTLER EQU   CVTMAP+44                                                02048000
CVTILK2  EQU   CVTMAP+40                                                02049000
CVTILK1  EQU   CVTMAP+36                                                02050000
CVTPRLTV EQU   CVTMAP+32                                                02051000
CVTPCNVT EQU   CVTMAP+28                                                02052000
CVT0VL00 EQU   CVTMAP+24                                                02053000
CVTXAPG  EQU   CVTMAP+20                                                02054000
CVTBUF   EQU   CVTMAP+16                                                02055000
CVTJOB   EQU   CVTMAP+12                                                02056000
CVTLINK  EQU   CVTMAP+8                                                 02057000
CVT0EF00 EQU   CVTMAP+4                                                 02058000
CVTTCBP  EQU   CVTMAP                                                   02059000
CVT      EQU   CVTMAP                                                   02060000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02061000
@ENDDATA EQU   *                                                        02062000
         END   ISTINCBL,(C'PLS1910',0603,76236)                         02063000
