SVTM     TITLE 'SSCP - ISTINCVN - RN ATTACHMENT PROCESSING             *00001000
                        '                                               00002000
ISTINCVN CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTINCVN  76.339'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
*/* END OF ATBUILD */                                              0006 00014000
*                                                                  0006 00015000
*            DO;                                                   0006 00016000
*/***  CRRMAINT  RPHADD((R01->NCSPLRPH))PROCNM(ISTINCVN)COMP(VY)FUNC(SU 00017000
*)  ***/                                                           0007 00018000
*                                                                  0007 00019000
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTVYCRR)  */                  0007 00020000
*            RFY ISTLCCW ;                                         0007 00021000
*            RFY ISTLCPB ;                                         0008 00022000
*            RFY ISTZSAVE;                                         0009 00023000
*            RFY ISTPFCRR;                                         0010 00024000
*            RFY ISTCFCRR;                                         0011 00025000
*            RFY ISTZCRR ;                                         0012 00026000
*            RFY ISTASCRR;                                         0013 00027000
*            RFY ISTAPCRR;                                         0014 00028000
*            RFY ISTCRA  ;                                         0015 00029000
*            RFY ISTCNSTA;                                         0016 00030000
*            RFY ISTVYCRR;                                         0017 00031000
*/* END OF ATBUILD */                                              0018 00032000
*            /*** SET ENTERED BIT FOR THIS PROCEDURE ***/          0018 00033000
*R01->NCSPLRPH->RPHCRR->CRACRR->NINCVN = '1'B;                     0018 00034000
         L     @14,NCSPLRPH(,R01)                                  0018 00035000
         L     @14,RPHCRR(,@14)                                    0018 00036000
         L     @14,CRACRR(,@14)                                    0018 00037000
         OI    NINCVN(@14),B'00000010'                             0018 00038000
*            /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/         0019 00039000
*R01->NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                     0019 00040000
         XC    VYCCRT+1(11,@14),VYCCRT+1(@14)                      0019 00041000
         MVI   VYCCRT(@14),B'00000000'                             0019 00042000
*R01->NCSPLRPH->RPHCRR->CRACRR->CINCVN = '1'B;                     0020 00043000
         OI    CINCVN(@14),B'00000010'                             0020 00044000
*            END;                                                  0021 00045000
*            DCL R01 PTR(31) REG(01) RSTD;/* INPUT PARAMETER REG    */  00046000
*            DCL R13 PTR(31) REG(13) RSTD;/* SAVE AREA PTR REGISTER */  00047000
*            DCL R15 PTR(31) REG(15) RSTD;/* WORK REGISTER          */  00048000
*            DCL R10 PTR(31) REG(10) RSTD;/* BASE REG FOR NCSPL     */  00049000
*            DCL R11 PTR(31) REG(11) RSTD;/* DATA AREA PTR REGISTER */  00050000
*            DCL @SIZDATD FIXED(31) GEND;/* size of DATA area       */  00051000
*            R10 = R01;                /* INIT NCSPL BASE REGISTER  */  00052000
         LR    R10,R01                                             0028 00053000
*            RFY ISTNCSPL BASED(R10);  /* ADDRESSABILITY FOR NCSPL  */  00054000
*            RFY ISTRPH BASED(NCSPLRPH);/* ADDRESSABILITY FOR RPH   */  00055000
*            R15 = R13;                /* SAVE CALLER SAVE AREA ADR */  00056000
         LR    R15,R13                                             0031 00057000
*            R13 = R13 - LENGTH(ISTRSA);/* SET SAVE AREA PTR REG    */  00058000
         SL    R13,@CF00446                                        0032 00059000
*            R15->RSAFPT = R13;        /* SET CALLERS FORWARD PTR   */  00060000
         ST    R13,RSAFPT(,R15)                                    0033 00061000
*            R13->RSABPT = R15;        /* SET MY BACK PTR           */  00062000
         ST    R15,RSABPT(,R13)                                    0034 00063000
*            R13->RSAFPT = 0;          /* SET MY FORWARD PTR        */  00064000
         SLR   @14,@14                                             0035 00065000
         ST    @14,RSAFPT(,R13)                                    0035 00066000
*            R11= VWANAV + 7 & 'FFFFFFF8'X;/* DATAREG = DWORD BDY   */  00067000
         L     @14,NCSPLWKA(,R10)                                  0036 00068000
         LA    R11,7                                               0036 00069000
         AL    R11,VWANAV(,@14)                                    0036 00070000
         N     R11,@CF00073                                        0036 00071000
*            VWANAV = R11 + @SIZDATD;  /* ALLOCATE DATA AREA        */  00072000
         LR    @00,R11                                             0037 00073000
         AL    @00,@SIZDATD                                        0037 00074000
         ST    @00,VWANAV(,@14)                                    0037 00075000
*          GEN (USING @DATD,R11);    /* ESTAB BASE REG FOR DATA   */    00076000
         USING @DATD,R11                                                00077000
*/* END OF CPPROC EXPANSION */                                     0039 00078000
*                                                                  0039 00079000
*/* ATBUILD  DEFER(ALL) */                                         0039 00080000
*/* END OF ATBUILD */                                              0039 00081000
*                                                                  0039 00082000
*/* ATBUILD (ISTRDT,ISTATCVT,ISTNCSPL)  */                         0039 00083000
* RFY ISTLOK  ;                                                    0039 00084000
* RFY ISTDEVCH;                                                    0040 00085000
* RFY (ISTRPRE,ISTRCPRE,ISTRDT,ISTRAP,ISTRLC,ISTRRN,ISTRGP,ISTRLN,ISTRP 00086000
*,ISTRCL,ISTRTR,ISTRIN,ISTRDS,ISTDOT,ISTRCC,ISTRLU,ISTRPX,ISTRLX,ISTRSW 00087000
*ISTRDA,ISTRLS,ISTDNT,ISTGNT,ISTPAT);                              0041 00088000
* RFY ISTPAB  ;                                                    0042 00089000
* RFY ISTDYPAB;                                                    0043 00090000
* RFY ISTATCVT;                                                    0044 00091000
*/* END OF ATBUILD */                                              0045 00092000
* DCL GPR00F FIXED(31) REG(00);                                    0045 00093000
* DCL GPR00P PTR(31)   REG(00);                                    0046 00094000
* DCL GPR01F FIXED(31) REG(01);                                    0047 00095000
* DCL GPR01P PTR(31)   REG(01);                                    0048 00096000
* DCL GPR02F FIXED(31) REG(02);                                    0049 00097000
* DCL GPR02P PTR(31)   REG(02);                                    0050 00098000
* DCL GPR03F FIXED(31) REG(03);                                    0051 00099000
* DCL GPR03P PTR(31)   REG(03);                                    0052 00100000
* DCL GPR04F FIXED(31) REG(04);                                    0053 00101000
* DCL GPR04P PTR(31)   REG(04);                                    0054 00102000
* DCL GPR05F FIXED(31) REG(05);                                    0055 00103000
* DCL GPR05P PTR(31)   REG(05);                                    0056 00104000
* DCL GPR06F FIXED(31) REG(06);                                    0057 00105000
* DCL GPR06P PTR(31)   REG(06);                                    0058 00106000
* DCL GPR07F FIXED(31) REG(07);                                    0059 00107000
* DCL GPR07P PTR(31)   REG(07);                                    0060 00108000
* DCL GPR08F FIXED(31) REG(08);                                    0061 00109000
* DCL GPR08P PTR(31)   REG(08);                                    0062 00110000
* DCL GPR09F FIXED(31) REG(09);                                    0063 00111000
* DCL GPR09P PTR(31)   REG(09);                                    0064 00112000
* DCL GPR10F FIXED(31) REG(10);                                    0065 00113000
* DCL GPR10P PTR(31)   REG(10);                                    0066 00114000
* DCL GPR11F FIXED(31) REG(11);                                    0067 00115000
* DCL GPR11P PTR(31)   REG(11);                                    0068 00116000
* DCL GPR12F FIXED(31) REG(12);                                    0069 00117000
* DCL GPR12P PTR(31)   REG(12);                                    0070 00118000
* DCL GPR13F FIXED(31) REG(13);                                    0071 00119000
* DCL GPR13P PTR(31)   REG(13);                                    0072 00120000
* DCL GPR14F FIXED(31) REG(14);                                    0073 00121000
* DCL GPR14P PTR(31)   REG(14);                                    0074 00122000
* DCL GPR15F FIXED(31) REG(15);                                    0075 00123000
* DCL GPR15P PTR(31)   REG(15);                                    0076 00124000
*DCL 1 CVNWKMAP AUTOMATIC,                                         0077 00125000
*       2 CVNSAV14 FIXED (31),                                     0077 00126000
*       2 RETCODE FIXED (31),                                      0077 00127000
*       2 CVNMSGID CHAR (4),                                       0077 00128000
*       2 MSGTXT CHAR (24),                                /*@DM14906*/ 00129000
*          3 CVNVARY CHAR (8),                             /*@DM14906*/ 00130000
*          3 MSGRES CHAR (16),                             /*@DM14906*/ 00131000
*             4 RESRCA CHAR (8),                                   0077 00132000
*             4 RESRCB CHAR (8),                                   0077 00133000
*               5 INSERT CHAR(1),                                  0077 00134000
*       2 CVNPAREA CHAR (16);                                      0077 00135000
*DCL CMDRNPTR REG (9) POINTER(31),        /* PTR TO COMMAND RN RDTE   * 00136000
*    LCLRNPTR REG (8) POINTER(31),        /* PTR TO LCL RN RDTE       * 00137000
*    INNODPTR REG (7) POINTER(31);        /* PTR TO INNODE RDTE       * 00138000
*DCL SRTDELFD ENTRY BASED (GPR15P);       /* ISTOCCDF LOCATE RIN ENTRY* 00139000
*DCL OFF BIT (1) CONSTANT ('0'B),                                  0080 00140000
*    ON  BIT (1) CONSTANT ('1'B),                                  0080 00141000
*    CVNZERO FIXED (31) CONSTANT (0),                              0080 00142000
*    SRTFDFLG BIT (32) CONSTANT ('80000000'X),                     0080 00143000
*    CVNNULL  BIT  (8) CONSTANT ('00'X),                           0080 00144000
*    CVNLCLFL CHAR (4) CONSTANT ('660I'),                          0080 00145000
*    CVNREMFL CHAR (4) CONSTANT ('661I'),                          0080 00146000
*    CVNINACT CHAR (4) CONSTANT ('602I'),                          0080 00147000
*    CVNLNOFF CHAR (4) CONSTANT ('608I'),                          0080 00148000
*             /******************************************************** 00149000
*             /* MESSAGES -                                           * 00150000
*             /* 602I - VVVVVVVV FAILED FOR ID=XXXXXXXX HIGHER NODE   * 00151000
*             /*        HAS BECOME INACTIVE.                          * 00152000
*             /* 608I - VARY FAILED FOR ID=XXXXXXXX, YYYYYYYY NOT     * 00153000
*             /*        ACTIVE                                        * 00154000
*             /* 660I - ACTIVATION OF LOCAL 370X CONFIG XXXXXXXX      * 00155000
*             /*        FAILED. CODE Z                                * 00156000
*             /* 661I - ACTIVATION OF REMOTE 370X CONFIG XXXXXXXX     * 00157000
*             /*        FAILED. CODE Z                                * 00158000
*             /******************************************************** 00159000
*    CVNINS1 CHAR (1) CONSTANT ('1'),                              0080 00160000
*    CVNINS2 CHAR (1) CONSTANT ('2'),                              0080 00161000
*    CVNINS3 CHAR (1) CONSTANT ('3'),                              0080 00162000
*    CVNINS4 CHAR (1) CONSTANT ('4'),                              0080 00163000
*    CVNINS5 CHAR (1) CONSTANT ('5'),                              0080 00164000
*    CVNINS6 CHAR (1) CONSTANT ('6'),                              0080 00165000
*    CVNINS7 CHAR (1) CONSTANT ('7');                              0080 00166000
*CVNVARY = 'VARY    ';                                     /*@DM14906*/ 00167000
         MVC   CVNVARY(8),@CC00185                                 0081 00168000
*CVNMSGID = CVNNULL;                   /* INDICATE NO ERRORS*/     0082 00169000
         XC    CVNMSGID+1(3),CVNMSGID+1                            0082 00170000
         MVI   CVNMSGID,X'00'                                      0082 00171000
*RETCODE = CVNZERO;                                                0083 00172000
         SLR   @14,@14                                             0083 00173000
         ST    @14,RETCODE                                         0083 00174000
*RFY (ISTRPRE,ISTRDT,ISTRRN) BASED (CMDRNPTR);                     0084 00175000
*RFY (ISTATCVT) BASED (NCSPLCVT);      /* ESTABLISH ADDRESSABILITY   */ 00176000
*RFY (CMDRNPTR) RSTD;                  /* FOR THE CONTROL BLOCKS     */ 00177000
*CMDRNPTR = NCSPLRPT;                                              0087 00178000
         L     CMDRNPTR,NCSPLRPT(,R10)                             0087 00179000
*IF RRNRBREM = OFF                                                 0088 00180000
*  THEN                                /* VALIDATE LOCAL PARAMETERS  */ 00181000
         TM    RRNRBREM(CMDRNPTR),B'00000100'                      0088 00182000
         BNZ   @RF00088                                            0088 00183000
*    IF NCSRNAME(1:1) ^= CVNNULL                                   0089 00184000
*      THEN DO;                        /* RNAME = INVALID FOR LOCAL  */ 00185000
         CLI   NCSRNAME(R10),X'00'                                 0089 00186000
         BE    @RF00089                                            0089 00187000
*           CVNMSGID = CVNLCLFL;                                   0091 00188000
         MVC   CVNMSGID(4),@CC00164                                0091 00189000
*           INSERT = CVNINS1;                                      0092 00190000
         MVI   INSERT,C'1'                                         0092 00191000
*           END;                                                   0093 00192000
*      ELSE                                                        0094 00193000
*        IF NCSPLUAD(1:1) ^= CVNNULL                               0094 00194000
*          THEN DO;                    /* USE CUA FROM COMMAND       */ 00195000
         B     @RC00089                                            0094 00196000
@RF00089 CLI   NCSPLUAD(R10),X'00'                                 0094 00197000
         BE    @RF00094                                            0094 00198000
*               RRNRNCUA = NCSPLUAD;                               0096 00199000
         MVC   RRNRNCUA(3,CMDRNPTR),NCSPLUAD(R10)                  0096 00200000
*               NCSCUA = ON;                                       0097 00201000
         OI    NCSCUA(R10),B'01000000'                             0097 00202000
*               END;                                               0098 00203000
*          ELSE                                                    0099 00204000
*            IF RRNRDCUA(1:1) ^= CVNNULL                           0099 00205000
*                                      /* USE DEFAULT IF PTRESENT    */ 00206000
*              THEN RRNRNCUA = RRNRDCUA;                           0099 00207000
         B     @RC00094                                            0099 00208000
@RF00094 CLI   RRNRDCUA(CMDRNPTR),X'00'                            0099 00209000
         BE    @RF00099                                            0099 00210000
         MVC   RRNRNCUA(3,CMDRNPTR),RRNRDCUA(CMDRNPTR)             0100 00211000
*              ELSE DO;                /* ERROR - NO CUA TO USE      */ 00212000
         B     @RC00099                                            0101 00213000
@RF00099 DS    0H                                                  0102 00214000
*                   CVNMSGID = CVNLCLFL;                           0102 00215000
         MVC   CVNMSGID(4),@CC00164                                0102 00216000
*                   INSERT = CVNINS2;                              0103 00217000
         MVI   INSERT,C'2'                                         0103 00218000
*                   END;                                           0104 00219000
*     ELSE                             /* VALIDATE REMOTE RN PARMS   */ 00220000
*       IF NCSPLUAD(1:1) ^= CVNNULL                                0105 00221000
*         THEN DO;                     /* U = INVALID FOR REMOTE RN  */ 00222000
         B     @RC00088                                            0105 00223000
@RF00088 CLI   NCSPLUAD(R10),X'00'                                 0105 00224000
         BE    @RF00105                                            0105 00225000
*              CVNMSGID = CVNREMFL;                                0107 00226000
         MVC   CVNMSGID(4),@CC00166                                0107 00227000
*              INSERT = CVNINS1;                                   0108 00228000
         MVI   INSERT,C'1'                                         0108 00229000
*              END;                                                0109 00230000
*         ELSE                                                     0110 00231000
*           IF NCSRNAME(1:1) ^= CVNNULL                            0110 00232000
*             THEN DO;                 /* USE RNAME FROM COMMAND     */ 00233000
         B     @RC00105                                            0110 00234000
@RF00105 CLI   NCSRNAME(R10),X'00'                                 0110 00235000
         BE    @RF00110                                            0110 00236000
*                  RRNRINNM = NCSRNAME;                            0112 00237000
         MVC   RRNRINNM(8,CMDRNPTR),NCSRNAME(R10)                  0112 00238000
*                  NCSRNME = ON;                                   0113 00239000
         OI    NCSRNME(R10),B'00100000'                            0113 00240000
*                  CALL CVNATTCH;                                  0114 00241000
         BAL   @14,CVNATTCH                                        0114 00242000
*                  END;                                            0115 00243000
*             ELSE                                                 0116 00244000
*               IF RRNRINNM(1:1) ^= CVNNULL                        0116 00245000
*                 THEN CALL CVNATTCH;                              0116 00246000
         B     @RC00110                                            0116 00247000
@RF00110 CLI   RRNRINNM(CMDRNPTR),X'00'                            0116 00248000
         BE    @RF00116                                            0116 00249000
         BAL   @14,CVNATTCH                                        0117 00250000
*                 ELSE DO;                                         0118 00251000
         B     @RC00116                                            0118 00252000
@RF00116 DS    0H                                                  0119 00253000
*                      CVNMSGID = CVNREMFL;                        0119 00254000
         MVC   CVNMSGID(4),@CC00166                                0119 00255000
*                      INSERT = CVNINS2;                           0120 00256000
         MVI   INSERT,C'2'                                         0120 00257000
*                      END;                                        0121 00258000
*    IF CVNMSGID(1:1) = CVNNULL             /* ANY ERRORS ?          */ 00259000
*      THEN                                                        0122 00260000
@RC00116 DS    0H                                                  0122 00261000
@RC00110 DS    0H                                                  0122 00262000
@RC00105 DS    0H                                                  0122 00263000
@RC00088 CLI   CVNMSGID,X'00'                                      0122 00264000
         BNE   @RF00122                                            0122 00265000
*        IF NCSCUA = ON  |  NCSRNME = ON                           0123 00266000
*          THEN                                                    0123 00267000
*                                                                  0123 00268000
         TM    NCSCUA(R10),B'01100000'                             0123 00269000
         BZ    @RF00123                                            0123 00270000
*/*CRIO  FUNC(UPDATE)PROCNM(ISTINCVN)RDT((CMDRNPTR))*/             0124 00271000
*             DO;                                                  0124 00272000
*             RFY (GPR01P,GPR15P) RSTD;                            0125 00273000
*             GPR15P = 0;                                          0126 00274000
         SLR   GPR15P,GPR15P                                       0126 00275000
*             IF CMDRNPTR->RPRCRCPT = '1'B                         0127 00276000
*             THEN DO;                                             0127 00277000
         TM    RPRCRCPT(CMDRNPTR),B'01000000'                      0127 00278000
         BNO   @RF00127                                            0127 00279000
*             NCSCRDTE = CMDRNPTR;                                 0129 00280000
         ST    CMDRNPTR,NCSCRDTE(,R10)                             0129 00281000
*             NCSCRCMD = NCSCRWR;                                  0130 00282000
         MVI   NCSCRCMD(R10),X'00'                                 0130 00283000
*             GPR01P = ADDR(ISTNCSPL);                             0131 00284000
         LR    GPR01P,R10                                          0131 00285000
*             CALL ISTINCR5;                                       0132 00286000
*                                                                  0132 00287000
         L     @15,@CV00206                                        0132 00288000
         BALR  @14,@15                                             0132 00289000
*             DO;                                                  0133 00290000
*/***  CRRMAINT  RPHADD((NCSPLRPH))PROCNM(ISTINCVN)COMP(VY)FUNC(RET)  * 00291000
**/                                                                0134 00292000
*             /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/        0134 00293000
*NCSPLRPH->RPHCRR->CRACRR->VYCCRT = '0'B;                          0134 00294000
         L     @14,NCSPLRPH(,R10)                                  0134 00295000
         L     @14,RPHCRR(,@14)                                    0134 00296000
         L     @14,CRACRR(,@14)                                    0134 00297000
         XC    VYCCRT+1(11,@14),VYCCRT+1(@14)                      0134 00298000
         MVI   VYCCRT(@14),B'00000000'                             0134 00299000
*NCSPLRPH->RPHCRR->CRACRR->CINCVN = '1'B;                          0135 00300000
         OI    CINCVN(@14),B'00000010'                             0135 00301000
*             END;                                                 0136 00302000
*             RFY (GPR01P,GPR15P) UNRSTD;                          0137 00303000
*             END;                                                 0138 00304000
*             END;                                                 0139 00305000
*             /* END OF CRIO EXPANSION */                          0140 00306000
*          ELSE;                                                   0140 00307000
@RF00123 DS    0H                                                  0141 00308000
*      ELSE DO;                        /* ISSUE THE ERROR MSG.       */ 00309000
*                                                                  0141 00310000
         B     @RC00122                                            0141 00311000
@RF00122 DS    0H                                                  0142 00312000
*            RFY (EMCR2,EMCR3) RSTD;                               0142 00313000
*           GPR02P = ADDR(CVNMSGID);                               0143 00314000
         LA    GPR02P,CVNMSGID                                     0143 00315000
*           IF CVNMSGID = CVNINACT                         /*@DM14906*/ 00316000
*              THEN                                        /*@DM14906*/ 00317000
         CLC   CVNMSGID(4),@CC00168                                0144 00318000
         BNE   @RF00144                                            0144 00319000
*                GPR03P = ADDR(MSGTXT);                    /*@DM14906*/ 00320000
         LA    GPR03P,MSGTXT                                       0145 00321000
*              ELSE                                        /*@DM14906*/ 00322000
*                GPR03P = ADDR(MSGRES);                    /*@DM14906*/ 00323000
         B     @RC00144                                            0146 00324000
@RF00144 LA    GPR03P,MSGRES                                       0146 00325000
*           RESRCA = RPRNAME;                                      0147 00326000
*                                                                  0147 00327000
@RC00144 MVC   RESRCA(8),RPRNAME(CMDRNPTR)                         0147 00328000
*/*TPMSG MSGID((GPR02P))MSG((GPR03P))OPTIONS(NCSPLSID)PLAREA(CVNPAREA)* 00329000
*                                                                  0148 00330000
*                                                                  0148 00331000
*            DO;                                                   0148 00332000
*              DCL REG1016  REG(1)  PTR;                           0149 00333000
*              RFY (REG1016) RSTD;                                 0150 00334000
*                                                                  0150 00335000
*            RFY (EMCR13) RSTD;                                    0151 00336000
*              DCL 1 * BASED(REG1016),                             0152 00337000
*                  2 CMZID016 PTR(31),                             0152 00338000
*                  2 *,                                            0152 00339000
*                    3 CMZRL016 PTR(8),                            0152 00340000
*                    3 CMZRA016 PTR(24) BDY(BYTE),                 0152 00341000
*                  2 CMZEA016 PTR(31),                             0152 00342000
*                  2 CMZVP016 PTR(31);                             0152 00343000
*                                                                  0152 00344000
*/*XREGSET  PID('PLAREA')PPARM(CVNPAREA)RREG(,REG1016)*/           0153 00345000
*            DO;                                                   0153 00346000
*              REG1016=ADDR(CVNPAREA);   /*SET RREG SYMBOL TO ADDRESS*/ 00347000
         LA    REG1016,CVNPAREA                                    0154 00348000
*                                        /*OF PPARM OPERAND          */ 00349000
*            END;  /* XREGSET */                                   0155 00350000
*              CMZID016 = 0;                                       0156 00351000
         SLR   @14,@14                                             0156 00352000
         ST    @14,CMZID016(,REG1016)                              0156 00353000
*              CMZRL016 = 0;                                       0157 00354000
         MVI   CMZRL016(REG1016),X'00'                             0157 00355000
*              CMZRA016 = 0;                                       0158 00356000
         STCM  @14,7,CMZRA016(REG1016)                             0158 00357000
*              CMZEA016 = 0;                                       0159 00358000
         ST    @14,CMZEA016(,REG1016)                              0159 00359000
*              CMZVP016 = 0;                                       0160 00360000
         ST    @14,CMZVP016(,REG1016)                              0160 00361000
*              CMZID016=GPR02P;                                    0161 00362000
         ST    GPR02P,CMZID016(,REG1016)                           0161 00363000
*              CMZVP016 = GPR03P;                                  0162 00364000
         ST    GPR03P,CMZVP016(,REG1016)                           0162 00365000
*              DCL CMZSA016 (18) PTR(31) BASED(EMCR13);            0163 00366000
*              CMZSA016(5) = ADDR(NCSPLSID);                       0164 00367000
*                                                                  0164 00368000
         LA    @14,NCSPLSID(,R10)                                  0164 00369000
         ST    @14,CMZSA016+16(,EMCR13)                            0164 00370000
*              DCL REG15016 REG(15) PTR;                           0165 00371000
*              RFY REG15016 RSTD;                                  0166 00372000
*                                                                  0166 00373000
*            DO; /* LISATCVT CVTBASE(PAGEABLE,(REG15016)) */       0167 00374000
*              REG15016 = ATCLCPTR; /*SET UP ATCVT POINTER*/       0168 00375000
         L     REG15016,ATCLCPTR                                   0168 00376000
*            END; /*LISATCVT*/                                     0169 00377000
*              DCL CMTA016 BASED(REG15016) ENTRY VALUERANGE(*);    0170 00378000
*              REG15016 = REG15016->ATCMSGP;                       0171 00379000
         L     REG15016,ATCMSGP(,REG15016)                         0171 00380000
*              CALL CMTA016;                                       0172 00381000
         BALR  @14,@15                                             0172 00382000
*              RESPECIFY (REG1016,REG15016)  UNRESTRICTED;         0173 00383000
*                                                                  0173 00384000
*            RFY (EMCR13) UNRSTD;                                  0174 00385000
*            END;                                                  0175 00386000
*                                                                  0175 00387000
*            RFY (EMCR2,EMCR3) UNRSTD;                             0176 00388000
*           NCSCUA = OFF;                                          0177 00389000
*           NCSRNME = OFF;                                         0178 00390000
         NI    NCSCUA(R10),B'10011111'                             0178 00391000
*           NCSPLSOM = ON;             /* DO NOT ISSUE A SECOND MSG. */ 00392000
         OI    NCSPLSOM(R10),B'01000000'                           0179 00393000
*           RETCODE = 4;                                           0180 00394000
         MVC   RETCODE(4),@CF00139                                 0180 00395000
*           END;                                                   0181 00396000
*     DO; /* CPEXIT CODE(RETCODE) */                               0182 00397000
@RC00122 DS    0H                                                  0183 00398000
*     VWANAV = R11;   /* DEALLOCATE WORK AREA      */              0183 00399000
         L     @14,NCSPLWKA(,R10)                                  0183 00400000
         ST    R11,VWANAV(,@14)                                    0183 00401000
*     R13 = R13->RSABPT;        /* GET ADDR CALLER SAVE AREA */    0184 00402000
         L     R13,RSABPT(,R13)                                    0184 00403000
*     RETURN CODE(RETCODE);         /* RETURN TO THE CALLER      */     00404000
         L     @15,RETCODE                                         0185 00405000
         L     @14,12(,@13)                                        0185 00406000
         LM    @00,@12,20(@13)                                     0185 00407000
         BR    @14                                                 0185 00408000
*     END; /* CPEXIT CODE(RETCODE) */                              0186 00409000
*CVNATTCH: PROC OPTIONS(NOSAVE, NOSAVEAREA);                       0187 00410000
*                                                                  0187 00411000
CVNATTCH DS    0H                                                  0188 00412000
*     RFY (EMCR14) RSTD;                                           0188 00413000
*    CVNSAV14 = GPR14P;                /* SAVE THE RETURN ADDRESS    */ 00414000
*                                                                  0189 00415000
         ST    GPR14P,CVNSAV14                                     0189 00416000
*     RFY (EMCR14) UNRSTD;                                         0190 00417000
*    GPR01P = NCSPLRPH;                /* OBTAIN THE VOCLOCK         */ 00418000
*                                                                  0191 00419000
         L     GPR01P,NCSPLRPH(,R10)                               0191 00420000
*/*** START -TPLOCK (VOCLOCK)- ***/                                0192 00421000
*     DO;                                                          0192 00422000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;        0193 00423000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);    00424000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              00425000
*         GPR15P = ATCAP35;             /*ADDRESS OF LOCK ROUTINE*/     00426000
         L     @08,NCSPLCVT(,R10)                                  0195 00427000
         L     GPR15P,ATCAP35(,@08)                                0195 00428000
*         GPR02P = ADDR(ATCVOCLK);      /*SET PARAM - LOCKWORD PTR*/    00429000
         LA    GPR02P,ATCVOCLK(,@08)                               0196 00430000
*         GPR04P = GPR01P->RPHCRR;      /*SET PARAM - ISTCRA PTR*/ 0197 00431000
         L     GPR04P,RPHCRR(,GPR01P)                              0197 00432000
*         GPR00P = CRALMS02;            /*SET PARAM - LOCK LEVEL FLAG*/ 00433000
         LA    GPR00P,2                                            0198 00434000
*         GPR03P = ADDR(GPR04P->CRAL2PTR);                         0199 00435000
         LA    GPR03P,CRAL2PTR(,GPR04P)                            0199 00436000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  00437000
*         DCL FMZL0029 BASED(GPR15P) LABEL VALUERANGE(*);          0200 00438000
*         CALL FMZL0029;                                           0201 00439000
         BALR  @14,@15                                             0201 00440000
*         GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01 00441000
*,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P 00442000
*GPR12P,GPR13P,GPR14P,GPR15P);                                     0202 00443000
*                                                                  0202 00444000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               00445000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;      0203 00446000
*         END;                                                     0204 00447000
*/*** END -TPLOCK (VOCLOCK)- ***/                                    /* 00448000
*ZA15136*/                                                         0205 00449000
*                                                                  0205 00450000
*     RFY (EMCR0,EMCR1,EMCR2,EMCR15) RSTD;                         0205 00451000
*    GPR01P = CVNZERO;                                             0206 00452000
         SLR   GPR01P,GPR01P                                       0206 00453000
*    GPR02P = CVNZERO;                                             0207 00454000
         SLR   GPR02P,GPR02P                                       0207 00455000
*    GPR15P = ATCSRTDF;                                            0208 00456000
         L     @08,NCSPLCVT(,R10)                                  0208 00457000
         L     GPR15P,ATCSRTDF(,@08)                               0208 00458000
*    GPR00P = ADDR(RRNRINNM);                                      0209 00459000
         LA    GPR00P,RRNRINNM(,CMDRNPTR)                          0209 00460000
*    GPR00P = GPR00P  |  SRTFDFLG;                                 0210 00461000
         O     GPR00P,@CF00160                                     0210 00462000
*    CALL SRTDELFD;                    /* CALL ISTOCCDF TO FIND ENTRY * 00463000
         BALR  @14,@15                                             0211 00464000
*    GPR01P = NCSPLRPH;                                            0212 00465000
         L     GPR01P,NCSPLRPH(,R10)                               0212 00466000
*    IF GPR15P ^= CVNZERO                                          0213 00467000
*      THEN DO;                                                    0213 00468000
         LTR   GPR15P,GPR15P                                       0213 00469000
         BZ    @RF00213                                            0213 00470000
*           CVNMSGID = CVNREMFL;                                   0215 00471000
         MVC   CVNMSGID(4),@CC00166                                0215 00472000
*           INSERT = CVNINS3;                                      0216 00473000
         MVI   INSERT,C'3'                                         0216 00474000
*           END;                                                   0217 00475000
*      ELSE DO;                                                    0218 00476000
         B     @RC00213                                            0218 00477000
@RF00213 DS    0H                                                  0219 00478000
*           RFY (INNODPTR,LCLRNPTR) RSTD;                          0219 00479000
*           INNODPTR = GPR00P;         /* ESTABLISH ADDRESSABILITY   */ 00480000
         LR    INNODPTR,GPR00P                                     0220 00481000
*                                      /* TO THE INNODE ENTRY        */ 00482000
*                                      /* (RIN ENTRY IN LOCAL RDT)   */ 00483000
*                                                                  0221 00484000
*            RFY (EMCR0,EMCR2,EMCR15) UNRSTD;                      0221 00485000
*           RFY (ISTRIN) BASED (INNODPTR);                         0222 00486000
*           IF INNODPTR -> RPRENTRY ^= RPRENTIN                    0223 00487000
*             THEN DO;                 /* NOT AN INNODE ENTRY        */ 00488000
         CLI   RPRENTRY(INNODPTR),X'82'                            0223 00489000
         BE    @RF00223                                            0223 00490000
*                  CVNMSGID = CVNREMFL;                            0225 00491000
         MVC   CVNMSGID(4),@CC00166                                0225 00492000
*                  INSERT = CVNINS4;                               0226 00493000
         MVI   INSERT,C'4'                                         0226 00494000
*                  END;                                            0227 00495000
*             ELSE                                                 0228 00496000
*               IF RINREMOT ^= CVNZERO                             0228 00497000
*                 THEN DO;             /* A REMOTE IS ALREADY        */ 00498000
         B     @RC00223                                            0228 00499000
@RF00223 L     @14,RINREMOT(,INNODPTR)                             0228 00500000
         LTR   @14,@14                                             0228 00501000
         BZ    @RF00228                                            0228 00502000
*                                      /* ANCHORED TO THIS INNODE    */ 00503000
*                      CVNMSGID = CVNREMFL;                        0230 00504000
         MVC   CVNMSGID(4),@CC00166                                0230 00505000
*                      INSERT = CVNINS5;                           0231 00506000
         MVI   INSERT,C'5'                                         0231 00507000
*                      END;                                        0232 00508000
*                 ELSE                                             0233 00509000
*                   IF (RINNODID ^= CVNZERO  &  RINNODID ^= RDTNODID)   00510000
*                     THEN DO;         /* THE NODE IDS DO NOT MATCH  */ 00511000
         B     @RC00228                                            0233 00512000
@RF00228 CLI   RINNODID(INNODPTR),0                                0233 00513000
         BE    @RF00233                                            0233 00514000
         CLC   RINNODID(1,INNODPTR),RDTNODID(CMDRNPTR)             0233 00515000
         BE    @RF00233                                            0233 00516000
*                          CVNMSGID = CVNREMFL;                    0235 00517000
         MVC   CVNMSGID(4),@CC00166                                0235 00518000
*                          INSERT = CVNINS6;                       0236 00519000
         MVI   INSERT,C'6'                                         0236 00520000
*                          END;                                    0237 00521000
*                     ELSE                                         0238 00522000
*                       IF RINNODEF = ON                           0238 00523000
*                         THEN DO;     /* DEACTIVATE IN PROGRESS     */ 00524000
         B     @RC00233                                            0238 00525000
@RF00233 TM    RINNODEF(INNODPTR),B'01000000'                      0238 00526000
         BNO   @RF00238                                            0238 00527000
*                                      /* FOR THE LOCAL RN           */ 00528000
*                              CVNMSGID = CVNREMFL;                0240 00529000
         MVC   CVNMSGID(4),@CC00166                                0240 00530000
*                              INSERT = CVNINS7;                   0241 00531000
         MVI   INSERT,C'7'                                         0241 00532000
*                              END;                                0242 00533000
*                         ELSE;        /* VALIDATION WAS SUCCESSFUL  */ 00534000
@RF00238 DS    0H                                                  0244 00535000
*                                      /* ATTACHMENT CAN PROCEED     */ 00536000
*           END;                                                   0244 00537000
@RC00233 DS    0H                                                  0244 00538000
@RC00228 DS    0H                                                  0244 00539000
@RC00223 DS    0H                                                  0245 00540000
*    IF CVNMSGID(1:1) = CVNNULL                                    0245 00541000
*      THEN DO;                        /* CHAIN THE RN SEGMENTS      */ 00542000
@RC00213 CLI   CVNMSGID,X'00'                                      0245 00543000
         BNE   @RF00245                                            0245 00544000
*           RINREMOT = CMDRNPTR;       /* TOGETHER                   */ 00545000
         ST    CMDRNPTR,RINREMOT(,INNODPTR)                        0247 00546000
*           RRNTRENT = INNODPTR;                                   0248 00547000
         ST    INNODPTR,RRNTRENT(,CMDRNPTR)                        0248 00548000
*           NCSPLRRP = INNODPTR;                                   0249 00549000
         ST    INNODPTR,NCSPLRRP(,R10)                             0249 00550000
*           NCSRNAME = INNODPTR -> RPRNAME;                        0250 00551000
         MVC   NCSRNAME(8,R10),RPRNAME(INNODPTR)                   0250 00552000
*           CMDRNPTR -> RPRNSNEA = RINLOCRN;                       0251 00553000
         L     @14,RINLOCRN(,INNODPTR)                             0251 00554000
         ST    @14,RPRNSNEA(,CMDRNPTR)                             0251 00555000
*           LCLRNPTR = RPRNSNEA;       /* GET ADDRESS OF LOCAL RN    */ 00556000
         LR    LCLRNPTR,@14                                        0252 00557000
*           IF LCLRNPTR -> RRNLCSIP = ON                           0253 00558000
*             THEN DO;                 /* WAIT FOR LOCAL START TO    */ 00559000
         TM    RRNLCSIP(LCLRNPTR),B'00100000'                      0253 00560000
         BNO   @RF00253                                            0253 00561000
*                  RRNRPLPT = NCSPLRPH;/* COMPLETE                   */ 00562000
*                                                                  0255 00563000
         L     @14,NCSPLRPH(,R10)                                  0255 00564000
         ST    @14,RRNRPLPT(,CMDRNPTR)                             0255 00565000
*/*** START -TPUNLOCK (VOCLOCK)- ***/                              0256 00566000
*                   DO;                                            0256 00567000
*                                                                  0256 00568000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             0257 00569000
*/* END OF ATBUILD */                                              0257 00570000
*                   RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RST 00571000
*;        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);    00572000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              00573000
*         GPR02P = ADDR(ATCVOCLK);      /*SET PARAM - LOCKWORD PTR*/    00574000
         L     GPR02P,NCSPLCVT(,R10)                               0259 00575000
         LA    GPR02P,ATCVOCLK(,GPR02P)                            0259 00576000
*         GPR04P = GPR01P->RPHCRR;      /*SET PARAM - ISTCRA PTR*/ 0260 00577000
         L     GPR04P,RPHCRR(,GPR01P)                              0260 00578000
*         GPR00P = CRALMS02;            /*SET PARAM - LOCK LEVEL FLAG*/ 00579000
         LA    GPR00P,2                                            0261 00580000
*         GPR03P = ADDR(GPR04P->CRAL2PTR);                         0262 00581000
         LA    GPR03P,CRAL2PTR(,GPR04P)                            0262 00582000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  00583000
*                                                                  0263 00584000
*                   DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */  0263 00585000
*                     GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/  0264 00586000
         L     GPR15P,ATCLCPTR                                     0264 00587000
*                   END; /*LISATCVT*/                              0265 00588000
*         GPR15P=GPR15P->ATCAP33;                                  0266 00589000
         L     GPR15P,ATCAP33(,GPR15P)                             0266 00590000
*         DCL FMZL0036 BASED(GPR15P) LABEL VALUERANGE(*);          0267 00591000
*         CALL FMZL0036;                                           0268 00592000
         BALR  @14,@15                                             0268 00593000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01 00594000
*,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P 00595000
*GPR12P,GPR13P,GPR14P,GPR15P);                                     0269 00596000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               00597000
*                   RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNR 00598000
*TD;      END;                                                     0270 00599000
*/*** END -TPUNLOCK (VOCLOCK)- ***/                                0272 00600000
*                                                                  0272 00601000
*/*  TPWAIT   */                                                   0272 00602000
*                   DO; /* BEGIN TPWAIT GENERATION*/               0272 00603000
*                   RFY (GPR01P,GPR14P,GPR15P) RSTD;               0273 00604000
*                   RFY (GPR00P) RSTD;                             0274 00605000
*                   GEN (STM   GPR00P,GPR15P,RPHWORK(GPR01P))      0275 00606000
*                   REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);      0275 00607000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            00608000
*                   RFY (GPR00P) UNRSTD;                           0276 00609000
*                   GPR15P=ADDR(LHAA0046);                         0277 00610000
         LA    GPR15P,LHAA0046                                     0277 00611000
*                   GPR14P=0;                                      0278 00612000
         SLR   GPR14P,GPR14P                                       0278 00613000
*                   GPR15P=GPR15P & '00FFFFFF'X;                   0279 00614000
         N     GPR15P,@CF00258                                     0279 00615000
*                   GPR15P=GPR15P | RPHWT1;                        0280 00616000
         O     GPR15P,@CF00357                                     0280 00617000
*                   CS (GPR14P,GPR15P,GPR01P->RPHRESMA);           0281 00618000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         0281 00619000
*                   BC (7,LHAB0046);                               0282 00620000
*                                                                  0282 00621000
         BC    7,LHAB0046                                          0282 00622000
*/* TPEXIT  NONE */                                                0283 00623000
*                   DO;                                            0283 00624000
*                     RESPECIFY GPR15P RSTD;                       0284 00625000
*                                                                  0284 00626000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         0285 00627000
*/* END OF ATBUILD */                                              0285 00628000
*                   DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */  0285 00629000
*                     GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/  0286 00630000
         L     GPR15P,ATCLCPTR                                     0286 00631000
*                   END; /*LISATCVT*/                              0287 00632000
*                     RESPECIFY GPR00F RSTD;                       0288 00633000
*                     GPR00F=0;     /*SET PARAMETER REGISTER TO 0*/     00634000
         SLR   GPR00F,GPR00F                                       0289 00635000
*                     GPR15P=GPR15P->ATCAP31;                      0290 00636000
         L     GPR15P,ATCAP31(,GPR15P)                             0290 00637000
*                     DCL FMZL0051 BASED(GPR15P) LABEL VALUERANGE(*);   00638000
*                     CALL FMZL0051;                               0292 00639000
         BALR  @14,@15                                             0292 00640000
*                     RESPECIFY (GPR00F,GPR15P) UNRSTD;            0293 00641000
*                   END; /***** END OF TPEXIT  *****/              0294 00642000
*LHAB0046:;         GPR01P->RPHRESMA = 0;                          0295 00643000
LHAB0046 DS    0H                                                  0296 00644000
         SLR   @06,@06                                             0296 00645000
         ST    @06,RPHRESMA(,GPR01P)                               0296 00646000
*                   RFY (GPR00P) RSTD;                             0297 00647000
*LHAA0046:;         GEN (LM    GPR00P,GPR15P,RPHWORK(GPR01P))      0298 00648000
LHAA0046 DS    0H                                                  0299 00649000
*                   REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);      0299 00650000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            00651000
*                   RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;      0300 00652000
*                   END; /*****END OF TPWAIT *****/                0301 00653000
*                                                                  0301 00654000
*/*** START -TPLOCK (VOCLOCK)- ***/                                0302 00655000
*                   DO;                                            0302 00656000
*                   RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RST 00657000
*;        GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);    00658000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              00659000
*         GPR15P = ATCAP35;             /*ADDRESS OF LOCK ROUTINE*/     00660000
         L     @06,NCSPLCVT(,R10)                                  0305 00661000
         L     GPR15P,ATCAP35(,@06)                                0305 00662000
*         GPR02P = ADDR(ATCVOCLK);      /*SET PARAM - LOCKWORD PTR*/    00663000
         LA    GPR02P,ATCVOCLK(,@06)                               0306 00664000
*         GPR04P = GPR01P->RPHCRR;      /*SET PARAM - ISTCRA PTR*/ 0307 00665000
         L     GPR04P,RPHCRR(,GPR01P)                              0307 00666000
*         GPR00P = CRALMS02;            /*SET PARAM - LOCK LEVEL FLAG*/ 00667000
         LA    GPR00P,2                                            0308 00668000
*         GPR03P = ADDR(GPR04P->CRAL2PTR);                         0309 00669000
         LA    GPR03P,CRAL2PTR(,GPR04P)                            0309 00670000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  00671000
*         DCL FMZL0061 BASED(GPR15P) LABEL VALUERANGE(*);          0310 00672000
*         CALL FMZL0061;                                           0311 00673000
         BALR  @14,@15                                             0311 00674000
*         GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01 00675000
*,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P 00676000
*GPR12P,GPR13P,GPR14P,GPR15P);                                     0312 00677000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               00678000
*                   RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNR 00679000
*TD;      END;                                                     0313 00680000
*/*** END -TPLOCK (VOCLOCK)- ***/                      /*@ZA15136*/     00681000
*                  END;                                            0315 00682000
*             ELSE;                    /* PROCEED                    */ 00683000
@RF00253 DS    0H                                                  0317 00684000
*           IF RRNLCDIE = ON                                       0317 00685000
*             THEN CVNMSGID = CVNINACT; /* LOCAL RN BECAME INACTIVE   * 00686000
         TM    RRNLCDIE(CMDRNPTR),B'00010000'                      0317 00687000
         BNO   @RF00317                                            0317 00688000
         MVC   CVNMSGID(4),@CC00168                                0318 00689000
*             ELSE                                                 0319 00690000
*               IF INNODPTR -> RPRNSNEA -> RPRONLIN = OFF   /*@X50BHH2* 00691000
*                 THEN DO;   /* ASSOCIATED LINK IS OFFLINE    @X50BHH2* 00692000
         B     @RC00317                                            0319 00693000
@RF00317 L     @14,RPRNSNEA(,INNODPTR)                             0319 00694000
         TM    RPRONLIN(@14),B'00001000'                           0319 00695000
         BNZ   @RF00319                                            0319 00696000
*                      CVNMSGID = CVNLNOFF;                 /*@X50BHH2* 00697000
         MVC   CVNMSGID(4),@CC00170                                0321 00698000
*                      RESRCB = INNODPTR -> RPRNSNEA -> RPRNAME;   0322 00699000
         MVC   RESRCB(8),RPRNAME(@14)                              0322 00700000
*                                /* UNHOOK REMOTE FROM RIN    @X50BHH2* 00701000
*                      RINREMOT = CVNZERO;                  /*@X50BHH2* 00702000
         SLR   @14,@14                                             0323 00703000
         ST    @14,RINREMOT(,INNODPTR)                             0323 00704000
*                      NCSPLRRP = CVNZERO;                  /*@X50BHH2* 00705000
         ST    @14,NCSPLRRP(,R10)                                  0324 00706000
*                      NCSRNAME = CVNNULL;                  /*@X50BHH2* 00707000
         XC    NCSRNAME+1(7,R10),NCSRNAME+1(R10)                   0325 00708000
         MVI   NCSRNAME(R10),X'00'                                 0325 00709000
*                      END;                                 /*@X50BHH2* 00710000
*                 ELSE;                                     /*@X50BHH2* 00711000
@RF00319 DS    0H                                                  0328 00712000
*          END;                                                    0328 00713000
*     ELSE;                            /* UNSUCCESSFUL VALIDATION    */ 00714000
@RF00245 DS    0H                                                  0330 00715000
*                                      /* RELEASE LOCK AND RETURN    */ 00716000
*                                                                  0330 00717000
*/*** START -TPUNLOCK (VOCLOCK)- ***/                              0330 00718000
*    DO;                                                           0330 00719000
@RC00245 DS    0H                                                  0331 00720000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)  */                             0331 00721000
*/* END OF ATBUILD */                                              0331 00722000
*                                                                  0331 00723000
*    RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) RSTD;         0331 00724000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);    00725000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              00726000
*         GPR02P = ADDR(ATCVOCLK);      /*SET PARAM - LOCKWORD PTR*/    00727000
         L     GPR02P,NCSPLCVT(,R10)                               0333 00728000
         LA    GPR02P,ATCVOCLK(,GPR02P)                            0333 00729000
*         GPR04P = GPR01P->RPHCRR;      /*SET PARAM - ISTCRA PTR*/ 0334 00730000
         L     GPR04P,RPHCRR(,GPR01P)                              0334 00731000
*         GPR00P = CRALMS02;            /*SET PARAM - LOCK LEVEL FLAG*/ 00732000
         LA    GPR00P,2                                            0335 00733000
*         GPR03P = ADDR(GPR04P->CRAL2PTR);                         0336 00734000
         LA    GPR03P,CRAL2PTR(,GPR04P)                            0336 00735000
*                                       /*SET PARAM - LOCK LEVEL PTR*/  00736000
*                                                                  0337 00737000
*    DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                 0337 00738000
*      GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                 0338 00739000
         L     GPR15P,ATCLCPTR                                     0338 00740000
*    END; /*LISATCVT*/                                             0339 00741000
*         GPR15P=GPR15P->ATCAP33;                                  0340 00742000
         L     GPR15P,ATCAP33(,GPR15P)                             0340 00743000
*         DCL FMZL0066 BASED(GPR15P) LABEL VALUERANGE(*);          0341 00744000
*         CALL FMZL0066;                                           0342 00745000
         BALR  @14,@15                                             0342 00746000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P,GPR01 00747000
*,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P,GPR10P,GPR11P 00748000
*GPR12P,GPR13P,GPR14P,GPR15P);                                     0343 00749000
*                                                                  0343 00750000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               00751000
*    RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;       0344 00752000
*         END;                                                     0345 00753000
*/*** END -TPUNLOCK (VOCLOCK)- ***/                                  /* 00754000
*ZA15136*/                                                         0346 00755000
*                                                                  0346 00756000
*    RFY (EMCR14) RSTD;                                            0346 00757000
*   GPR14P = CVNSAV14;                                             0347 00758000
         L     GPR14P,CVNSAV14                                     0347 00759000
*   RETURN;                                                        0348 00760000
*                                                                  0348 00761000
@EL00002 DS    0H                                                  0348 00762000
@EF00002 DS    0H                                                  0348 00763000
@ER00002 BR    @14                                                 0348 00764000
*    RFY (EMCR14) UNRSTD;                                          0349 00765000
*   END CVNATTCH;                                                  0350 00766000
*                                                                  0351 00767000
*/* TPEPILOG   */                                                  0351 00768000
*    GEN (PRINT OFF);                                              0351 00769000
*                                                                  0351 00770000
         PRINT OFF                                                      00771000
*/* RPL HEADER                                                        * 00772000
*/*  REVISIONS                                         006 04/09/75   * 00773000
*DCL RPHPTR PTR(31) REGISTER(1) RESTRICTED;                        0352 00774000
*DCL  1  ISTRPH BDY(WORD) BASED(RPHPTR),                           0353 00775000
*       2  RPHCNTL FIXED(32),          /* CONTROL INFORMATION         * 00776000
*       3  RPHTYPE CHAR(1),            /* CONTROL BLOCK TYPE          * 00777000
*       3  RPHLNGTH PTR(8),            /* LENGTH IN BYTES             * 00778000
*       3  RPHFLAGS BIT(8),            /* SYSTEM DEPENDENT FLAGS      * 00779000
*         4  RPHOGIND BIT(1),          /* OPEN GATE INDICATOR         * 00780000
*         4  RPHSPGIN BIT(1),          /* SPECIAL GATE OPEN IND.      * 00781000
*         4  RPHAPTYP BIT(1),          /* APS IS A USER EXIT          * 00782000
*            5  RPHAUTEX BIT(1),        /*EXIT TO AUTHORIZED USER VS2 * 00783000
*         4  RPHSMQ BIT(1),            /* INDICATOR IF RPH IS TO BE   * 00784000
*                                      /* QUEUED                      * 00785000
*         4  RPHSMTYP BIT(1),          /* REQUEST TYPE IS BUFFER OR   * 00786000
*                                      /* DOUBLE-WORD                 * 00787000
*         4  RPHSMCLR BIT(1),          /* INDICATOR IF BUFFER TO BE   * 00788000
*                                      /* CLEARED                     * 00789000
*           4  RPHMLTCP BIT(1),        /* USED BY LOCAL 3270  SUPPORT * 00790000
*                                      /* WHEN BUILDING MULTIPLE CHAN * 00791000
*                                      /* PROGRAM                     * 00792000
*           4  RPHFSTLC BIT(1),        /* USED BY LOCAL 3270 SUPPORT  * 00793000
*                                      /* TO INDICATE FIRST LCCW      * 00794000
*              5  RPHFNFLG BIT(1),     /* LCCW SET FUNCTION FLAGS     * 00795000
*        3  RPHFLGB BIT(8),            /* SECOND FLAG BYTE            * 00796000
*           4  RPHLOCK BIT(1),         /* LOCKING OPTION              * 00797000
*           4  RPHBSSP BIT(1),         /* SYSTEM SERVICES PROGRESS    * 00798000
*           4  RPHFBAPS BIT(1),        /* STG. OBTAINED BY APS        * 00799000
*           4  RPHPGCMP BIT(1),        /* BIT ON INDICATES RESOURCE   * 00800000
*                                      /* MGR HAS COMPLETED UNLOCK    * 00801000
*           4  RPHNRSAV BIT(1),        /* DO NOT SAVE ON ACTIVATE     * 00802000
*           4  RPHRLCRA BIT(1),        /* RPH CAN BE RELEASED         * 00803000
*                                      /* WHEN PURGE COMPLETE         * 00804000
*           4  *        BIT(2),        /* RESERVED                    * 00805000
*       2  RPHRPHA PTR(31),            /* ADDR.OF NEXT RPL HEADER     * 00806000
*         3  RPHGATE BIT(1),           /* GATING FLAG                 * 00807000
*         3  *       BIT(7),           /* RESERVED                    * 00808000
*         3  RPHRPHAP PTR(24),                                     0353 00809000
*       2  RPHTSKID PTR(31),           /* TASK IDENTIFICATION         * 00810000
*                                      /* OR ADDR.OF APS TABLE        * 00811000
*          3  *     CHAR(3),           /* RPH TSK ID                  * 00812000
*          3  RPHTIK PTR(8),           /* TIK                         * 00813000
*       2  RPHDVTA PTR(31),            /* ADDR.OF  CURRENT DVT        * 00814000
*       2  RPHRESMA PTR(31) BDY(WORD), /* TPWAIT-POST INFO */      0353 00815000
*         3 RPHWPFLG CHAR(1),          /* WAIT-POST FLAGS */       0353 00816000
*           4 RPHRSKEY BIT(4),         /* STORAGE PROTECT KEY TO RESUME 00817000
*                                         PROCESSING                  * 00818000
*           4 RPHWT BIT(1),            /* WAIT BIT */              0353 00819000
*           4 RPHPT BIT(1),            /* POST BIT */              0353 00820000
*           4 RPHPURGE BIT(1),         /* RPH FLAGGED BY RECOVERY    */ 00821000
*                                      /* TO BE PURGED BY PSS        */ 00822000
*                                      /* VS/2 ONLY                  */ 00823000
*           4 RPHRSV01 BIT(1),        /* RESERVED                    */ 00824000
*         3 RPHRESUM PTR(24),          /* RESUME ADDRESS */        0353 00825000
*       2  RPHPABOF PTR(8),            /* OFFSET OF PAB IN CONTROL BLK* 00826000
*       2  RPHMAJCB PTR(24),           /* ADDR.OF MAJOR CONTROL BLOCK * 00827000
*       2  RPHWEA PTR(31),             /* ADDR.OF WORK ELEMENT        * 00828000
*         3  RPHCSPA PTR(31),          /* ADDR OF ISTCSP              * 00829000
*           4  RPHWEGT BIT(1),         /* GATE FOR WORK ELEMENT PROC. * 00830000
*       2  RPHSRPRM PTR(31),           /* SERVICE ROUTINE PARM.FIELD  * 00831000
*         3 RPHSRP12 FIXED(15),        /* COUNT OF Q'ED SMS REQUESTS  * 00832000
*         3 RPHSRP34 FIXED(15),        /* SIZE OF Q'ED SMS REQUESTS   * 00833000
*       2  RPHCRR PTR(31),             /* ADDR.OF COMPONENT RECOVERY  * 00834000
*                                      /* RECORD                      * 00835000
*       2  RPHPABQA PTR(31),           /* PAB QUEUE ADDRESS           * 00836000
*          3 RPHPABFG CHAR(1),         /* FLAG BYTE CARRIED FROM PAB  * 00837000
*          3 RPHPABQP PTR(24),         /* POINTER TO QUEUE OF PAB'S   * 00838000
*       2  RPHWORK CHAR(64) BDY(WORD), /* 16 WORD WORK AREA           * 00839000
*         3  RPHSAVE1 FIXED(31),       /*                             * 00840000
*           4  RPHSBYTE CHAR(1),       /* 1-BYTE SAVE FIELD           * 00841000
*           4  RPHSBITS BIT(8),        /* SAVE FIELD FOR FLAG BYTE    * 00842000
*              5  RPHSBIT1 BIT(1),     /* 1ST SAVE FIELD              * 00843000
*              5  RPHSBIT2 BIT(1),     /* 2ND SAVE FIELD              * 00844000
*              5  RPHSBIT3 BIT(1),     /* 3RD SAVE FIELD              * 00845000
*              5  RPHSBIT4 BIT(1),     /* 4TH SAVE FIELD              * 00846000
*              5  RPHSBIT5 BIT(1),     /* 5TH SAVE FIELD              * 00847000
*              5  RPHSBIT6 BIT(1),     /* 6TH SAVE FIELD              * 00848000
*              5  RPHSBIT7 BIT(1),     /* 7TH SAVE FIELD              * 00849000
*              5  RPHSBIT8 BIT(1),     /* 8TH SAVE FIELD              * 00850000
*           4  RPHSHALF FIXED(15),     /* HALF WORD SAVE AREA         * 00851000
*         3  RPHSAVE2 FIXED(31),       /*                             * 00852000
*         3  RPHSAVE3 FIXED(31),       /*                             * 00853000
*         3  RPHSAVE4 FIXED(31),       /*                             * 00854000
*         3  RPHSAVE5 FIXED(31),       /*                             * 00855000
*         3  RPHSAVE6 FIXED(31),       /*                             * 00856000
*         3  RPHSAVE7 FIXED(31),       /*                             * 00857000
*         3  RPHSAVE8 FIXED(31),       /*                             * 00858000
*         3  RPHSAVE9 FIXED(31),       /*                             * 00859000
*         3  RPHSAV10 FIXED(31),       /*                             * 00860000
*         3  RPHSAV11 FIXED(31),       /*                             * 00861000
*         3  RPHSAV12 FIXED(31),       /*                             * 00862000
*         3  RPHSAV13 FIXED(31),       /*                             * 00863000
*         3  RPHSAV14 FIXED(31),       /*                             * 00864000
*         3  RPHSAV15 FIXED(31),       /*                             * 00865000
*         3  RPHSAV16 FIXED(31),       /*                             * 00866000
*       2  RPHNEXPO PTR(31);           /* ADDR.NEXT RPH TO BE POSTED  * 00867000
* DCL RPTYPE BIT(8) CONSTANT('01'X);   /* TYPE CODE FOR RPH           * 00868000
* DCL RPHWT0 BIT(32) CONSTANT('F7FFFFFF'X);   /* TURN RPHWT OFF */ 0355 00869000
* DCL RPHWT1 BIT(32) CONSTANT('08000000'X);   /* TURN RPHWT ON */  0356 00870000
* DCL RPHPT0 BIT(32) CONSTANT('FBFFFFFF'X);   /* TURN RPHPT OFF */ 0357 00871000
* DCL RPHPT1 BIT(32) CONSTANT('04000000'X);   /* TURN RPHPT ON */  0358 00872000
* DCL RPHPABQ1 BIT(24) CONSTANT('000000'X); /* TURN RPHPBQ GATE */ 0359 00873000
*/*   PROGRAM OPERATOR MESSAGE HEADER                                */ 00874000
*DCL  1  ISTPOHD  BDY(WORD) BASED,                                 0360 00875000
*        2 POHRSVD1 CHAR(1),       /* RESERVED                       */ 00876000
*        2 POHSTAT,                /* HEADER STATUS BITS             */ 00877000
*          3 POHEND   BIT(1),      /* END LINE 1=YES                 */ 00878000
*          3 POHDATA  BIT(1),      /* DATA LINE 1=YES                */ 00879000
*          3 POHLBL   BIT(1),      /* LABEL LINE 1=YES               */ 00880000
*          3 POHCNTRL BIT(1),      /* CONTROL LINE 1=YES             */ 00881000
*          3 POHRSVD2 BIT(2),      /* RESERVED                       */ 00882000
*          3 POHRREQ  BIT(1),      /* REPLY REQUESTED 1=YES          */ 00883000
*          3 POHGEN   BIT(1),      /* ID ORIGIN  0=GENERATED BY VTAM */ 00884000
*                                  /*            1=GENERATED BY POA  */ 00885000
*        2 POHID    FIXED(16);     /* MESSAGE IDENTIFIER             */ 00886000
*/*            VTAM PREFIX FOR QUEUE ELEMENTS                         * 00887000
*/*  INITIAL LEVEL                                     001 03/04/75  */ 00888000
*DECLARE                                                           0361 00889000
*  1 ISTPFX  BDY(WORD)  BASED,                                     0361 00890000
*   2 PFXID        CHAR(4),             /* QUEUE ACRONYM (SAME AS  0361 00891000
*                                          QABID)                     * 00892000
*     3 PFXCBID    BIT(8),              /* CONTROL BLOCK ID           * 00893000
*   2 PFXPRTY      CHAR(1),             /* PRIORITY OF ELEMENT        * 00894000
*   2 PFXLNG       CHAR(3),             /* ELEMENT LENGTH,         0361 00895000
*                                          INCLUDING PREFIX           * 00896000
*   2 PFXFWD       PTR(31),   /* POINTER TO NEXT QUEUE             0361 00897000
*                                          ELEMENT (IF LAST        0361 00898000
*                                          POINTER TO QAB)            * 00899000
*   2 PFXBCK       PTR(31) ;   /* POINTER TO PREVIOUS              0361 00900000
*                                          QUEUE ELEMENT (IF       0361 00901000
*                                          FIRST, POINTER TO QAB)     * 00902000
*DCL NCSPLTYP BIT(8) CONSTANT('60'X);   /* NCSPL CONTROL BLOCK ID     * 00903000
*   /* NETWORK CONFIGURATION SERVICES CONTROL BLOCK  */            0363 00904000
*/*  REVISIONS                                         14 07/01/75  */  00905000
*DECLARE                                                           0363 00906000
*  1 ISTNCSPL BASED BDY(DWORD),                                    0363 00907000
*   2 *      CHAR(16) BDY(WORD),                                   0363 00908000
*     3 NCSPFX CHAR(LENGTH(ISTPFX)), /* QUE ELEMENT PREFIX           */ 00909000
*       4 *        CHAR(12),                                       0363 00910000
*       4 NCSCRWKA PTR(31),       /* PTR TO WORK AREA FOR C/R I/O    */ 00911000
*   2 *           BIT(8),         /*RESERVED                         */ 00912000
*   2 NCSPLVCD    BIT(8),         /*VERB CODE                        */ 00913000
*   2 NCSPLVBF    CHAR(2),        /*VERB MODIFIER FLAGS              */ 00914000
*      3 NCSVBF01 BIT(1),         /* UNUSED                          */ 00915000
*      3 NCSVBF02 BIT(1),         /* UNUSED                          */ 00916000
*      3 NCSVBF03 BIT(1),         /* MODIFY MSG SUP                  */ 00917000
*      3 NCSVBF04 BIT(1),         /* TYPE=VTAM                       */ 00918000
*      3 NCSVBF05 BIT(1),         /* LINETRACE=1                     */ 00919000
*      3 NCSVBF06 BIT(1),         /* I/O TRACE=1                     */ 00920000
*      3 NCSVBF07 BIT(1),         /* BUFFER TRACE=1                  */ 00921000
*      3 NCSVBF08 BIT(1),         /* MODIFY TPRINT                   */ 00922000
*      3 NCSVBF09 BIT(1),         /* MODIFY TEST                     */ 00923000
*      3 NCSVBF10 BIT(1),         /* MODIFY TRACE=NO                 */ 00924000
*      3 NCSVBF11 BIT(1),         /* VARY INTERNAL ONLY & MODIFY     */ 00925000
*                                 /*  TRACE = YES                    */ 00926000
*      3 NCSVBF12 BIT(1),         /* VARY IMMEDIATE  & MODIFY        */ 00927000
*                                 /*  NETSOL=NO                      */ 00928000
*      3 NCSVBF13 BIT(1),         /* MODIFY NETSOL=YES               */ 00929000
*      3 NCSVBF14 BIT(1),         /* VARY LOGON & MODIFY             */ 00930000
*                                 /*  CHANGE                         */ 00931000
*      3 NCSVBF15 BIT(1),         /* VARY DEACTIVATE & VARY NORMAL   */ 00932000
*                                 /*  CLOSE(ERP)                     */ 00933000
*      3 NCSVBF16 BIT(1),         /* VARY ACTIVATE & ERP REQUEST     */ 00934000
*                                 /*   & MODIFY DUMP                 */ 00935000
*   2 NCSPLVFL    CHAR(1),        /*COMMAND FLAGS                    */ 00936000
*    3 NCSVNCSA   BIT(1),         /*NCSPL IS ACTIVE                  */ 00937000
*    3 NCSVDEL    BIT(1),         /*DELETE NCSPL                     */ 00938000
*    3 NCSVSTAT   BIT(1),         /*INDICATE NCSPL WAS NOT GETMAINED */ 00939000
*    3 NCSDCONT   BIT(1),         /* DO DISCONACT                    */ 00940000
*    3 NCSABCON   BIT(1),         /* DO ABANDON CONNECTION           */ 00941000
*    3 NCSDACLK   BIT(1),         /* DO ACTIVATE LINE                */ 00942000
*    3 NCSRSV02   BIT(2),         /* RESERVED                        */ 00943000
*   2 NCSPLVF1    CHAR(1),        /* SPECIAL PROC FLAGS              */ 00944000
*    3 NCSOVFMC   BIT(1),         /* PURGE ONLY VARY'S FMCB          */ 00945000
*   2 NCSPRMRC    CHAR(1),        /* PURGE MINOR RETURN CODE FIELD   */ 00946000
*   2 NCSIORC     CHAR(1),        /* I/O OR RESTART RETURN CODE      */ 00947000
*   2 NCSRRNPT    CHAR(4),        /* ADDR RN ENTRY FOR LINE TRACE    */ 00948000
*   2 NCSPLRID    CHAR(8),        /*ID = 'NODENAME'                  */ 00949000
*   2 NCSPLLID    CHAR(8),        /*LOGON = 'NODENAME'               */ 00950000
*   2 NCSDLID     CHAR(6),        /* OFFHOOK ID                      */ 00951000
*   2 NCSCRCMD    FIXED(8),       /* C/R I/O COMMAND CODE            */ 00952000
*   2 NCSCRPID    PTR(8),         /* C/R PATH ID (PID)               */ 00953000
*   2 NCSPLRPT    PTR(31),        /*ID='NODENAME' RDTE ADDRESS       */ 00954000
*   2 NCSPLLPT    PTR(31),        /*LOGON/LOGOFF='NODENAME' RDTE ADDR*/ 00955000
*   2 NCSPLCMD    CHAR(2),        /*3705 CONTROL COMMAND CODES       */ 00956000
*     3 NCSCMDA  BIT(8),          /*RH FLAGS                         */ 00957000
*       4 NCSPLSYS BIT(1),        /*ON-SYSTEM OFF-FM                 */ 00958000
*       4 NCSPLCTL BIT(1),        /*ON-CONTROL OFF-DATA              */ 00959000
*       4 NCSPLSYN BIT(1),        /*ON=SYNCHR OFF-ASYNCHR            */ 00960000
*       4 NCSPLFLO BIT(1),        /*ON-WITH FLOW  OFF-AGAINST FLOW   */ 00961000
*       4 NCSPLUFM BIT(1),        /*ON=UNFORMATTED RU,OFF=FORMATTED  */ 00962000
*       4 *        BIT(3),        /*RESERVED                         */ 00963000
*     3 NCSCMDB  BIT(8),          /*COMMAND FIELD                    */ 00964000
*   2 NCSNCPEP    BIT(8),         /* EP SUBCHANNEL ADDR              */ 00965000
*   2 NCSMSGSP    CHAR(1),        /* RESERVED FOR MESSAGE SURPRESSION*/ 00966000
*   2 NCSPLUAD    CHAR(3),        /*U = 'UNIT ADDRESS'               */ 00967000
*   2 NCSCRFLG    CHAR(1),        /* MISCELLANEOUS C/R FLAGS         */ 00968000
*     3 NCSPLWRM    BIT(1),       /* COMMAND SPECIFIED WARM PARAM,   */ 00969000
*                                 /* 1 = YES                         */ 00970000
*     3 NCSPLCLD    BIT(1),       /* COMMAND SPECIFIED COLD PARAM,   */ 00971000
*                                 /* 1 = YES                         */ 00972000
*     3 NCSFMCLD    BIT(1),       /* 370X RESPONDED COLD TO ACTPU    */ 00973000
*                                 /* (ERP), 1 = YES                  */ 00974000
*     3 NCSFMERP    BIT(1),       /* 370X RESPONDED ERP TO ACTPU     */ 00975000
*                                 /* (ERP), 1 = YES                  */ 00976000
*     3 NCSCRDSE    BIT(1),       /* 0=C/R DATA SET DOES NOT EXIST   */ 00977000
*                                 /* OR IS NULL                      */ 00978000
*                                 /* 1=C/R DATA SET EXISTS           */ 00979000
*                                 /* AND IS NOT NULL                 */ 00980000
*     3 NCSOPRQU    BIT(1),       /* OPERATOR REQUESTS REIPL, 1 = YES*/ 00981000
*     3 NCSUSRNF    BIT(1),       /* EARLY WARNING PURGE HAS ALREADY */ 00982000
*                                 /* OCCURED, 1 = YES                */ 00983000
*     3 NCSSTCMD    BIT(1),       /* ACTIVATE IS A RESULT OF         */ 00984000
*                                 /* START VTAM COMMAND, 1 = YES     */ 00985000
*   2 NCSPLWRE    BIT(32),        /* WTOR ECB                        */ 00986000
*   2 NCSPLWRF    CHAR(72),       /* WTOR REPLY AREA                 */ 00987000
*   2 NCSPLRAD    PTR(31),        /* RDTE PTR FOR ALLOCATE/DEALLOCATE*/ 00988000
*     3 NCSLSCMD BIT(8),          /* LINE SCHED COMMAND TYPE         */ 00989000
*     3 NCSPLRCD BIT(8),          /* HEX VALUE FOR LINE SCHED PARAM  */ 00990000
*   2 NCSIOCID    CHAR(4),        /* CURRENT CID FOR DAF LOCK HELD   */ 00991000
*     3  NCSPLCID CHAR(4),        /* ALIAS FOR ABOVE                 */ 00992000
*        4  NCSPLSAF  CHAR(2),    /* SOURCE ADDRESS                  */ 00993000
*        4  NCSPLDAF  CHAR(2),    /* DESTINATION ADDRESS             */ 00994000
*   2 NCSPLWKA    PTR(31),        /* NCS WORK AREA ADDRESS           */ 00995000
*   2 NCSPLCVT    PTR(31),        /* POINTER TO VTAM CVT             */ 00996000
*   2 NCSPLRPH    PTR(31),        /* POINTER TO RPH                  */ 00997000
*   2 NCSPLECB    BIT(32),        /* ECB FOR VARY PGS                */ 00998000
*   2 NCSPLFSB    PTR(31),        /* ADDRESS OF USS-FSS FSB OR RU    */ 00999000
*   2 NCSPLRCR    PTR(31),        /* ADDRESS RDTE FOR CR             */ 01000000
*   2 NCSPLFL1    CHAR(1),        /* VARY FLAGS                      */ 01001000
*     3 NCSPL2IN  BIT(1),         /* SECOND ENTRY                    */ 01002000
*     3 NCSPLSOM  BIT(1),         /* SUPRESS OP. MESSAGE             */ 01003000
*     3 NCSPLEBN  BIT(1),         /* ENTRY FROM BNN SSCP             */ 01004000
*     3 NCSPLREQ  BIT(1),         /* NCSPL FROM RESTORE              */ 01005000
*     3 NCSPLNON  BIT(1),         /* DO NOT ADDR RDT SEGMENT         */ 01006000
*     3 NCSPLAPU  BIT(1),         /* ACTIVATE PHYSICAL DONE BY LOAD  */ 01007000
*     3 NCSPL2CN  BIT(1),         /* SECOND CONTACT REQUEST          */ 01008000
*     3 NCSPLPOS  BIT(1),         /* BNN POSTED                      */ 01009000
*   2 NCSPLFL2    CHAR(1),        /* VARY FLAGS                      */ 01010000
*     3 NCSPLVDP  BIT(1),         /* NCSPL ON VARDEF PAB             */ 01011000
*     3 NCSPLRSF  BIT(1),         /* NO SICK CLEAR BEFORE I/O        */ 01012000
*     3 NCSPLRIO  BIT(1),         /* I/O = RESTART I/O               */ 01013000
*     3 NCSOUFMC  BIT(1),         /* PURGE ONLY USER FMCB            */ 01014000
*     3 NCSPLDS   BIT(1),         /* 1=CIO SAVED RESPONSE DATA       */ 01015000
*     3 NCSREMPO  BIT(1),         /* REMOTE POWER OFF SPEC BY OPER   */ 01016000
*     3 NCSPLVIS  BIT(1),         /* VARY IMM START CALLER OF CVP    */ 01017000
*     3 NCSPLVIT  BIT(1),         /* VARY IMM TERM CALLER OF CVP     */ 01018000
*   2 NCSPLFL3    CHAR(1),        /* FLAG BYTE                       */ 01019000
*     3 NCSPLMOM  BIT(1),         /* ERP CAUSED BY FAILURE OF      0363 01020000
*                                    HIGHER NODE                     */ 01021000
*     3 NCSEPP    BIT(1),         /* 1=EP SUBCHANNEL PRESENT         */ 01022000
*     3 NCSPLANS  BIT(1),         /* ON FOR ACT IN ANSWER MODE       */ 01023000
*                                 /* OFF FOR ACT IN NON-ANSWER MODE  */ 01024000
*     3 NCSGID    BIT(1),         /* ON FOR PATH WITH GID PARM       */ 01025000
*     3 NCSPID    BIT(1),         /* ON FOR PATH WITH PID PARM       */ 01026000
*     3 NCSANS    BIT(1),         /* ON FOR ACTIVATE WITH ANS PARM   */ 01027000
*     3 NCSFINAL  BIT(1),         /* FINAL PARM EXISTS               */ 01028000
*     3 NCSEND    BIT(1),         /* END PARM EXISTS                 */ 01029000
*   2 NCSPLFL4    CHAR(1),        /* FLAG BYTE                       */ 01030000
*     3 NCSDLNID  BIT(1),         /* ID PRESENT IN NCSPL - OFF       */ 01031000
*     3 NCSPLRSO  BIT(1),         /* RESET ONLY                      */ 01032000
*     3 NCSPLVID  BIT(1),         /* ORIG CMD WAS MODIFY DUMP        */ 01033000
*     3 NCSDSPE   BIT(1),         /* DISPLAY EVERY                   */ 01034000
*     3 NCSDSPA   BIT(1),         /* DISPLAY ACT                     */ 01035000
*     3 NCSDSPI   BIT(1),         /* DISPLAY INACT                   */ 01036000
*     3 NCSDSPN   BIT(1),         /* DISPLAY NONE                    */ 01037000
*     3 NCSPL2AP  BIT(1),         /* SECOND ACTPU TO 320X            */ 01038000
*   2 NCSDLRSN    CHAR(1),        /* DIAL REASON CODES               */ 01039000
*   2 NCSPLFL5    CHAR(1),        /* FLAG BYTE                       */ 01040000
*     3 NCSSCPPS  BIT(1),         /* SSCP WORK AREA IN PVT STORAGE   */ 01041000
*     3 NCSSDLK   BIT(1),         /* ON-SDLC LINK PROCESSED          */ 01042000
*     3 NCSFORCE  BIT(1),         /* FORCED DEACT IN PROGRESS        */ 01043000
*     3 *         BIT(5),         /* RESERVED                        */ 01044000
*   2 NCSPLOLN    FIXED(15),      /* LENGTH O/B RU                   */ 01045000
*   2 NCSPLP1     PTR(31),        /* ADDR VARY PAB                   */ 01046000
*   2 NCSPLP2     PTR(31),        /* ADDR D/L/R PAB                  */ 01047000
*   2 NCSPLP3     PTR(31),        /* ADDR ERP PAB                    */ 01048000
*   2 NCSPLSPL    PTR(31),        /* ADDR ASSOC. NCSPL               */ 01049000
*   2 NCSPLWEL    PTR(31),        /* ADDR POST RPH                   */ 01050000
*   2 NCSPLRRP    PTR(31),        /* ADDR REMOTE RN RDTE IN LOCAL RDT*/ 01051000
*   2 NCSPLRUO    PTR(31),        /* ADDR O/B RU                     */ 01052000
*   2 NCSPLRUI    PTR(31),        /* ADDR BUFFER FOR I/B RU          */ 01053000
*   2 NCSPLAPP    PTR(31),        /* ADDR NCSPL APPENDAGE            */ 01054000
*   2 NCSRNAME    CHAR(8),        /* RNAME=FROM VARY ACTIVATE        */ 01055000
*   2 NCSPLSQN    FIXED(15),      /* SEQUENCE=NR. FOR RESPONSE       */ 01056000
*   2 NCSPLGID    BIT(8),         /* BINARY REP OF GID VALUE         */ 01057000
*   2 NCSPLPID    BIT(8),         /* BINARY REP OF PID VALUE         */ 01058000
*   2 NCSPLMID    CHAR(8),        /* LOGMODE = 'MODENAME'            */ 01059000
*   2 NCSPLNSN    PTR(31),        /* RDTE NSNEA AT CLSDST            */ 01060000
*   2 NCSSENSE    CHAR(4),        /* SENSE                           */ 01061000
*     3 NCSSNS1  CHAR(1),         /* SENSE DATA MAJOR CODE           */ 01062000
*     3 NCSSNS2  CHAR(1),         /* SENSE MODIFIER BYTE             */ 01063000
*     3 NCSSENS2 CHAR(2),         /* USER SENSE DATA                 */ 01064000
*   2 NCSCPWPT    PTR(31),        /* ADDRESS OF CPWA                 */ 01065000
*   2 NCSMGLPT    PTR(31),        /* PTR TO USS/FSS MSG PARAM LIST   */ 01066000
*   2 NCSUFMCB    PTR(31),        /* POINTER TO SSCP-LU FMCB         */ 01067000
*   2 NCSPLRH     CHAR(3),        /* REQUEST RH                      */ 01068000
*   2 NCSPLRTY    CHAR(1),        /* TYPE FROM RTGOH RU              */ 01069000
*   2 NCSCRDTE    PTR(31),        /* PTR TO RDTE BEING PROCESSED     */ 01070000
*                                 /* FOR C/R I/O                     */ 01071000
*   2 NCSCRMSK,                   /* FLAGS FOR C/R CHECK POINTING    */ 01072000
*     3 NCSCHKPT    CHAR(2),      /* FLAGS FOR ITEMS CHECK POINTED   */ 01073000
*       4 NCSACTV     BIT(1),     /* ACTICE/INACTIVE STATUS CHANGED  */ 01074000
*                                 /* 1 = YES                         */ 01075000
*       4 NCSPACTV    BIT(1),     /* PORT ACT/INACTIVE STATUS CHANGED*/ 01076000
*                                 /* 1 = YES                         */ 01077000
*       4 NCSPOLD     BIT(1),     /* POLL DELAY VALUE CHANGED, 1=YES */ 01078000
*       4 NCSNRPL     BIT(1),     /* NEGATIVE RESPONSE TO POLL       */ 01079000
*                                 /* LIMIT VALUE CHANGED, 1 = YES    */ 01080000
*       4 NCSESLM     BIT(1),     /* SESSION LIMIT VALUE CHANGED,1=YES* 01081000
*       4 NCSDTRLM    BIT(1),     /* DEVICE TRANSMISSION LIMIT       */ 01082000
*                                 /* VALUE CHANGED, 1 = YES          */ 01083000
*       4 NCSLGAPL    BIT(1),     /* APPLICATION CONTROLLER NAME     */ 01084000
*                                 /* (LOGAPPL) CHANGED, 1 = YES      */ 01085000
*       4 NCSLGMOD    BIT(1),     /* LOGON MODE (LOGMODE)            */ 01086000
*                                 /* CHANGED, 1 = YES                */ 01087000
*       4 NCSANSMD    BIT(1),     /* ANSWER MODE STATUS CHANGED,1=YES*/ 01088000
*       4 NCSCUA      BIT(1),     /* CUA VALUE CHANGED, 1 = YES      */ 01089000
*       4 NCSRNME     BIT(1),     /* RNAME VALUE CHANGED, 1 = YES    */ 01090000
*       4 NCSPTUSE    BIT(1),     /* PATH USE/NOUSE STATUS CHANGED   */ 01091000
*                                 /* 1 = YES                         */ 01092000
*       4 NCSRSVD1    BIT(4),     /* RESERVED                        */ 01093000
*     3 NCSCRMOD    CHAR(1),      /* NEW VALUES FOR ITEMS CHECKPOINTED* 01094000
*                                 /* NOT OBTAINED FROM RDTE          */ 01095000
*       4 NCSAIMOD    BIT(1),     /* ACTIVE/INACTIVE STATUS, 1=ACTIVE*/ 01096000
*       4 NCSPTMOD    BIT(1),     /* PORT ACT/INACT STATUS, 1=ACTIVE */ 01097000
*       4 NCSRSVD2    BIT(6),     /* RESERVED                        */ 01098000
*   2 NCSPLSID BDY(BYTE),         /* MESSAGE ROUTING INFORMATION     */ 01099000
*     3 NCSPLSTA    CHAR(1),      /* STATUS FLAG BYTE                */ 01100000
*       4 NCSRSVD4    BIT(7),     /* RESERVED                        */ 01101000
*       4 NCSPLPO     BIT(1),     /* 0 = CONSOLE ID FOLLOWS, 1 =     */ 01102000
*                                 /* PROGRAM OPERATOR HEADER FOLLOWS */ 01103000
*     3 NCSPLPHD CHAR(LENGTH(ISTPOHD)), /* PO HEADER IF NCSPLPO = 01 */ 01104000
*       4 NCSPLNID    FIXED(8),   /* CONSOLE ID IF NCSPLPO = 0       */ 01105000
*     3 NCSPLPDB    PTR(31);      /* PTR TO PO ACDEB PREFIX          */ 01106000
*/*   COMMAND VALUES FOR C/R FIELD NCSCRCMD                          */ 01107000
*DCL NCSCRWR  FIXED(8) CONSTANT(0);  /* WRITE TO C/R DATA SET        */ 01108000
*DCL NCSCROPN FIXED(8) CONSTANT(1);  /* OPEN C/R DATA SET            */ 01109000
*DCL NCSCRCLS FIXED(8) CONSTANT(2);  /* CLOSE C/R DATA SET           */ 01110000
*DCL NCSCRDEL FIXED(8) CONSTANT(3);  /* DELETE C/R DATA SET RECORD   */ 01111000
*DCL NCSCROPQ FIXED(8) CONSTANT(4);  /* OPERATOR QUERY               */ 01112000
*DCL NCSDCID  FIXED(8) CONSTANT(1);  /* CONSOLE ID INDICATOR         */ 01113000
*DCL NCSCRIO  BIT(16) CONSTANT('0800'X); /* INDICATES REQUESTS       */ 01114000
*                                        /* FOR VSAM I/O FOR C/R     */ 01115000
*DCL NCSCRVIO BIT(16) CONSTANT('0C00'X); /* VSAM I/O OPERATION       */ 01116000
*/* NCSPL APPENDAGE DEFINATION                                       */ 01117000
*DCL  1  NCSAPP BASED(NCSPLAPP),                                   0372 01118000
*        2 NCSAPSA  CHAR(72),     /* SAVE AREA                       */ 01119000
*        2 NCSAPECB CHAR(4),      /* ECB                             */ 01120000
*        2 NCSAPTXT CHAR(8),      /* DUMP DATA                       */ 01121000
*        2 NCSAPEND PTR(31),      /* HIGH STORAGE ADDRESS            */ 01122000
*        2 NCSAPBUE CHAR(520),                                     0372 01123000
*          3 NCSRSV04 CHAR(3),    /* RESERVED                        */ 01124000
*          3 NCSAPRU  CHAR(5),    /* IPL CMD RU PREFIX               */ 01125000
*          3 NCSAPDAT CHAR(512),  /* RESP FOR DUMP, O/B LOAD         */ 01126000
*        2 NCSAPPAB PTR(31);      /* BNN VARY PAB ADDR               */ 01127000
*/*    USS/FSS RU AREA MAP                                           */ 01128000
*DCL  1  NCSUSSRU BASED(NCSPLFSB),                                 0373 01129000
*        2 NCSRULEN FIXED(15),    /* LENGTH OF RU                    */ 01130000
*        2 NCSRUITS CHAR(*);      /* START OF RU                     */ 01131000
*/*    GENERAL CONSTANTS                                             */ 01132000
*DCL NCSWASZ  FIXED(15) CONSTANT(2032);   /* NCSPL WORK AREA SIZE    */ 01133000
*DCL NCSRTGOH BIT(16) CONSTANT('1000'X);  /* VBF VALUE FOR INTERNAL  */ 01134000
*                                         /* COMMAND-RTGOH RECVD.    */ 01135000
*/*    CONSTANTS FOR VERB CODES                                      */ 01136000
*DCL NCSPLVC0 BIT(08) CONSTANT('00'X);    /* ERROR                   */ 01137000
*DCL NCSPLVC1 BIT(08) CONSTANT('01'X);    /* VARY                    */ 01138000
*DCL NCSPLVC2 BIT(08) CONSTANT('02'X);    /* MODIFY                  */ 01139000
*DCL NCSPLVC3 BIT(08) CONSTANT('03'X);    /* ERP                     */ 01140000
*DCL NCSPLVC4 BIT(08) CONSTANT('04'X);    /* DISPLAY                 */ 01141000
*DCL NCSPLVC5 BIT(08) CONSTANT('05'X);    /* STATUS TO SM            */ 01142000
*DCL NCSPLVC6 BIT(08) CONSTANT('06'X);    /* INTERNAL CMD            */ 01143000
*DCL NCSPLVC7 BIT(08) CONSTANT('07'X);    /* INIT/TERM TUSM          */ 01144000
*DCL NCSPLVC8 BIT(08) CONSTANT('08'X);    /* DIAL                    */ 01145000
*/*    CONSTANTS FOR VARY COMMAND MODIFIERS                          */ 01146000
*DCL NCSVACT BIT(16) CONSTANT('0001'X);   /*ACTIVATE                 */ 01147000
*DCL NCSVDEA BIT(16) CONSTANT('0002'X);   /* DEACTIVATE              */ 01148000
*DCL NCSVLON BIT(16) CONSTANT('0004'X);   /* LOGON                   */ 01149000
*DCL NCSVVPP BIT(16) CONSTANT('0080'X);   /* VARY NORMAL CLEANUP REQST* 01150000
*DCL NCSVIMM BIT(16) CONSTANT('0010'X);   /* IMMEDIATE               */ 01151000
*DCL NCSVINT BIT(16) CONSTANT('0020'X);   /* INTERNAL ONLY           */ 01152000
*DCL NCSVALO BIT(16) CONSTANT('0005'X);   /* ACTIVATE WITH LOGON     */ 01153000
*DCL NCSVDEI BIT(16) CONSTANT('0012'X);   /* DEACTIVATE IMMEDIATE    */ 01154000
*DCL NCSVDII BIT(16) CONSTANT('0032'X);   /* DEACTIV. IMMEDIATE INTERNA 01155000
*                                            ONLY*/                0393 01156000
*DCL NCSCNOTF BIT(16) CONSTANT('FFF8'X);  /* NOTIFY REQUEST          */ 01157000
*DCL NCSVANON BIT(16) CONSTANT('0008'X);  /* ANSWER = ON             */ 01158000
*DCL NCSVANOF BIT(16) CONSTANT('0040'X);  /* ANSWER = OFF            */ 01159000
*DCL NCSVPUSE BIT(16) CONSTANT('0100'X);  /* PATH = USABLE           */ 01160000
*DCL NCSVPNUS BIT(16) CONSTANT('0200'X);  /* PATH = NOT USABLE       */ 01161000
*DCL NCSVINOP BIT(16) CONSTANT('0400'X);  /* INOPERATIVE             */ 01162000
*/*    CONSTANTS FOR MODIFY COMMAND MODIFIERS                        */ 01163000
*DCL NCSMDUM BIT(16) CONSTANT('0001'X);   /* DUMP 3705               */ 01164000
*DCL NCSMCHA BIT(16) CONSTANT('0004'X);   /* CHANGE                  */ 01165000
*DCL NCSMNSY BIT(16) CONSTANT('0008'X);   /* NETSOL = YES            */ 01166000
*DCL NCSMNSN BIT(16) CONSTANT('0010'X);   /* NETSOL = NO             */ 01167000
*DCL NCSMTRY BIT(16) CONSTANT('0020'X);   /* TRACE = YES             */ 01168000
*DCL NCSMVTRY BIT(16) CONSTANT('1020'X);                           0405 01169000
*DCL NCSMVTRN BIT(16) CONSTANT('1040'X);                           0406 01170000
*DCL NCSMTRN BIT(16) CONSTANT('0040'X);   /* TRACE = NO              */ 01171000
*DCL NCSMTPR BIT(16) CONSTANT('0100'X);   /* TRACE PRINT             */ 01172000
*DCL NCSMTST BIT(16) CONSTANT('0080'X);   /* MODIFY TEST             */ 01173000
*DCL NCSDPF   BIT(16) CONSTANT('0000'X);  /* POTENTIAL FAIL          */ 01174000
*DCL NCSDSTRT BIT(16) CONSTANT('0001'X);  /* DIAL START              */ 01175000
*DCL NCSDOH1  BIT(16) CONSTANT('0002'X);  /* OFFHOOK 1               */ 01176000
*DCL NCSDOH2  BIT(16) CONSTANT('0004'X);  /* OFFHOOK 2               */ 01177000
*DCL NCSDDF   BIT(16) CONSTANT('0010'X);  /* DIAL FAILED             */ 01178000
*DCL NCSDLKS  BIT(16) CONSTANT('0008'X);  /* LINK START              */ 01179000
*DCL NCSDLKC  BIT(16) CONSTANT('0020'X);  /* LINK COMPLETION         */ 01180000
*DCL NCSDHU   BIT(16) CONSTANT('0040'X);  /* HANGUP                  */ 01181000
*DCL NCSDLK   BIT(16) CONSTANT('0080'X);  /* DEALLOCATE              */ 01182000
*DCL NCSDGIVE BIT(16) CONSTANT('0100'X);  /* GIVE                    */ 01183000
*DCL NCSDINOP BIT(16) CONSTANT('0200'X);  /* INOP                    */ 01184000
*DCL NCSDLRST BIT(16) CONSTANT('0400'X);  /* RECOVERY SW LINKS       */ 01185000
*                                         /* AFTER RN FAILURE        */ 01186000
*/*    CONSTANTS FOR ERP COMMAND MODIFIERS                           */ 01187000
*DCL NCSEERRA BIT(16) CONSTANT('0001'X);  /* ERP REQUEST          */    01188000
*DCL NCSECLOR BIT(16) CONSTANT('0002'X);  /* VARY NORMAL CLOSE REQUEST* 01189000
*DCL NCSEDACT BIT(16) CONSTANT('0004'X);  /* ERP DEACTIVATE REQUEST   * 01190000
*DCL NCSERSTR BIT(16) CONSTANT('0008'X);/* RSTRT ENTRY FROM DLR PROC */ 01191000
*DCL NCSVFORC BIT(16) CONSTANT('0802'X);/* FORCED DEACT              */ 01192000
*DCL NCSVRACT BIT(16) CONSTANT('1002'X);/* DEACT AND REACT           */ 01193000
*/*   PURGE MINOR RETURN CODES CONSTANTS                             */ 01194000
*DCL NCSAPABN BIT(8) CONSTANT('05'X),    /* APPLICATION ABEND        */ 01195000
*    NCSCLDST BIT(8) CONSTANT('06'X),    /* CLOSE DEST OCCURED       */ 01196000
*    NCSDDISC BIT(8) CONSTANT('08'X),    /* DIAL DISCONNECT OCCURED     01197000
*                                           - CONN NO LONGER AVAILABL*/ 01198000
*    NCSBTHEX BIT(8) CONSTANT('09'X);    /* BUFFER THRESHOLD EXCEEDED*/ 01199000
*/*   I/O OR RESTART RETURN CODES CONSTANTS                          */ 01200000
*DCL NCSIOSUC BIT(8) CONSTANT('00'X),    /* I/O SUCCESSFUL           */ 01201000
*    NCSIOERR BIT(8) CONSTANT('04'X),    /* I/O ERROR                */ 01202000
*    NCSIOPRG BIT(8) CONSTANT('08'X),    /* I/O PURGED               */ 01203000
*    NCSRSSUC BIT(8) CONSTANT('00'X),    /* RESTART SUCCESSFUL       */ 01204000
*    NCSRSERR BIT(8) CONSTANT('04'X),    /* RESTART ERROR            */ 01205000
*    NCSVAIPL BIT(8) CONSTANT('00'X),  /* IPL NO RESTART ON VARY ACTV*/ 01206000
*    NCSVANRA BIT(8) CONSTANT('10'X),    /* IPL SUCCESSFUL, NO RESTART  01207000
*                                           AVAILABLE ON VARY ACTIVE  * 01208000
*    NCSVAWMF BIT(8) CONSTANT('08'X),    /* WARM START FAILURE FOR 0429 01209000
*                                           VARY ACTIVATE            */ 01210000
*    NCSVAIPF BIT(8) CONSTANT('0C'X),   /* IPL FAILED ON VARY ACTIVATE* 01211000
*    NCSDSIA  BIT(8) CONSTANT('14'X),   /* INVALID ADDRESS SPECIFIED    01212000
*                                          ON DISPLAY STORAGE CMND    * 01213000
*    NCSVAISZ BIT(8) CONSTANT('08'X),   /* NCP SIZE TOO LARGE         * 01214000
*    NCSIPLSC BIT(8) CONSTANT('00'X),   /* IPL SUCCESSFUL             * 01215000
*    NCSIOER  BIT(8) CONSTANT('0C'X),   /* I/O ERROR ON REMOTE IPL    * 01216000
*    NCSNCPAC BIT(8) CONSTANT('04'X),   /* REMOTE NCP ALREADY ACTIVE  * 01217000
*    NCSNCRPF BIT(8) CONSTANT('70'X),   /* REMOTE POWER OFF           * 01218000
*    NCSCRIOS BIT(8) CONSTANT('30'X),   /* SUCCESSFUL I/O             * 01219000
*    NCSCRION BIT(8) CONSTANT('34'X),   /* NULL D.S. OPENED           * 01220000
*    NCSCRIOF BIT(8) CONSTANT('38'X);   /* FAILURE ON I/O             * 01221000
*/*           CONSTANTS FOR LIBERTY SUPPORT                           * 01222000
*DCL  NCSES   BIT(16) CONSTANT('0001'X),/* END SESSION                * 01223000
*     NCSBF   BIT(16) CONSTANT('0002'X),/* BIND FAILURE               * 01224000
*     NCSUF   BIT(16) CONSTANT('0004'X),/* UNBIND FAILURE             * 01225000
*     NCSINIT BIT(16) CONSTANT('0001'X),                           0430 01226000
*     NCSTERM BIT(16) CONSTANT('0002'X);                           0430 01227000
*DCL NCSTPPST BIT(16) CONSTANT('0001'X);/* TPPST COMMAND              * 01228000
*DCL NCSII    BIT(16) CONSTANT('0002'X);/* IPL INIT COMMAND           * 01229000
*DCL NCSIT    BIT(16) CONSTANT('0004'X);/* IPL COMMAND                * 01230000
*DCL NCSIF    BIT(16) CONSTANT('0008'X);/* IPL FINAL COMMAND          * 01231000
*DCL NCSDI    BIT(16) CONSTANT('0010'X);/* DUMP INIT COMMAND          * 01232000
*DCL NCSDT    BIT(16) CONSTANT('0020'X);/* DUMP TEXT COMMAND          * 01233000
*DCL NCSDF    BIT(16) CONSTANT('0040'X);/* DUMP FINAL COMMAND         * 01234000
*DCL NCSCON   BIT(16) CONSTANT('0080'X);/* CONTACT COMMAND            * 01235000
*DCL NCSDICON BIT(16) CONSTANT('0100'X);/* DISCONTACT COMMAND         * 01236000
*DCL NCSMSFMD BIT(16) CONSTANT('0200'X);/* SEND FMD                   * 01237000
*DCL NCSSEND  BIT(16) CONSTANT('0400'X);/* SEND                       * 01238000
*DCL NCSPURGE BIT(16) CONSTANT('0800'X);/* PAB PURGE                  * 01239000
*DCL NCSMSSUP BIT(16) CONSTANT('2000'X);/* CONSTANT FOR MSG SUP       * 01240000
*DCL NCSCRDS  BIT(16) CONSTANT('3023'X);/* RECORD DEV STATS COMMAND   * 01241000
*DCL NCSCQUIS BIT(16) CONSTANT('F01A'X);/* QUIESCE COMMAND            * 01242000
*DCL NCSSNUSS BIT(16) CONSTANT('381F'X);/* SEND USS MESSAGE           * 01243000
*/*                                                                   * 01244000
*DCL NCSNC    BIT(8)  CONSTANT('04'X);  /* NOT CONTACTED              * 01245000
*DCL NCSLD    BIT(8)  CONSTANT('00'X);  /* CONTACTED LOADED           * 01246000
*DCL NCSNLD   BIT(8)  CONSTANT('0C'X);  /* CONTACTED NEEDS LOAD       * 01247000
*DCL NCSNCD   BIT(8)  CONSTANT('08'X);  /* NOT CONTACTED DUE TO DEACT * 01248000
*DCL NCSNCE   BIT(8)  CONSTANT('10'X);  /* NOT CONTACTED DUE TO ERP   * 01249000
*DCL NCSNFME  BIT(8)  CONSTANT('24'X);  /* NEGATIVE FME               * 01250000
*/*  CONSTANTS FOR IORC FOR DISPLAY STORAGE                          */ 01251000
*DCL NCSDSDEA BIT(8)  CONSTANT('0C'X);  /* PRIOR DEACT                * 01252000
*DCL NCSDSFAL BIT(8)  CONSTANT('04'X);  /* FAIL OTHER THAN PRIOR DEACT* 01253000
*/* TYPE CODES FOR CONFIGURATION RESTART                              * 01254000
*DCL NCSCTRLM BIT(8) CONSTANT('01'X);   /* CHANGE DEV TRANS LIMIT     * 01255000
*DCL NCSCNPOL BIT(8) CONSTANT('02'X);   /* CHANGE NEG POLL RESP LIMIT * 01256000
*DCL NCSCSESS BIT(8) CONSTANT('03'X);   /* CHANGE SESSION LIMIT       * 01257000
*DCL NCSCPOLL BIT(8) CONSTANT('04'X);   /* CHANGE LINE SERV SEEK PAUSE* 01258000
*/*  FM DATA COMMAND CODES                                            * 01259000
*DCL NCSCAPU  BIT(16) CONSTANT('D001'X);   /* ACT PHYS                * 01260000
*DCL NCSCDPU  BIT(16) CONSTANT('D002'X);   /* DEACT PHYS              * 01261000
*DCL NCSCALU  BIT(16) CONSTANT('D003'X);   /* ACT LOG                 * 01262000
*DCL NCSCDLU  BIT(16) CONSTANT('D004'X);   /* DEACT LOG               * 01263000
*DCL NCSCSDT  BIT(16) CONSTANT('D005'X);   /* SDT                     * 01264000
*DCL NCSCFME  BIT(16) CONSTANT('2006'X);   /* SEND POS RESP           * 01265000
*DCL NCSCEXCP BIT(16) CONSTANT('2007'X);   /* SEND NEG RESP           * 01266000
*DCL NCSCCON  BIT(16) CONSTANT('3008'X);   /* CONTACT                 * 01267000
*DCL NCSCDCON BIT(16) CONSTANT('3009'X);   /* DISCONTACT              * 01268000
*DCL NCSCIPLI BIT(16) CONSTANT('300A'X);   /* IPL INIT                * 01269000
*DCL NCSCIPLT BIT(16) CONSTANT('300B'X);   /* IPL                     * 01270000
*DCL NCSCIPLF BIT(16) CONSTANT('300C'X);   /* IPL FINAL               * 01271000
*DCL NCSCDUMI BIT(16) CONSTANT('300D'X);   /* DUMP INIT               * 01272000
*DCL NCSCDUMP BIT(16) CONSTANT('300E'X);   /* DUMP                    * 01273000
*DCL NCSCDUMF BIT(16) CONSTANT('300F'X);   /* DUMP FINAL              * 01274000
*DCL NCSCACTL BIT(16) CONSTANT('3010'X);   /* ACT LINK                * 01275000
*DCL NCSCDACL BIT(16) CONSTANT('3011'X);   /* DEACT LINK              * 01276000
*DCL NCSCSSV  BIT(16) CONSTANT('3012'X);   /* SET STATE VECTOR        * 01277000
*DCL NCSCNSP  BIT(16) CONSTANT('3013'X);   /* NS PROC ERROR           * 01278000
*DCL NCSCSTD  BIT(16) CONSTANT('3019'X);   /* SET TIME & DATE         * 01279000
*DCL NCSCSEP  BIT(16) CONSTANT('9014'X);   /* SWITCH TO EP            * 01280000
*DCL NCSCSNC  BIT(16) CONSTANT('9015'X);   /* SWITCH TO NCP           * 01281000
*DCL NCSCLSD  BIT(16) CONSTANT('3016'X);   /* LINE SCHED PARM         * 01282000
*DCL NCSCDS   BIT(16) CONSTANT('3017'X);   /* DISPLAY STORAGE         * 01283000
*DCL NCSCPWO  BIT(16) CONSTANT('3018'X);   /* REMOTE POWER OFF        * 01284000
*DCL NCSSNFMD BIT(16) CONSTANT('301C'X);   /* SEND FMD                * 01285000
*DCL NCSCDIAL BIT(16) CONSTANT('301A'X);   /* DIAL                    * 01286000
*DCL NCSCADIL BIT(16) CONSTANT('301B'X);   /* ABANDON DIAL            * 01287000
*DCL NCSCEANS BIT(16) CONSTANT('301D'X);   /* ENABLE ANS MODE         * 01288000
*DCL NCSCAANS BIT(16) CONSTANT('301E'X);   /* ABANDON ANS MODE        * 01289000
*DCL NCSCANA  BIT(16) CONSTANT('301F'X);   /* ASSIGN NET ADDRESS      * 01290000
*DCL NCSCFNA  BIT(16) CONSTANT('3020'X);   /* FREE NET ADDRESS        * 01291000
*DCL NCSCACON BIT(16) CONSTANT('3021'X);   /* ABANDON CONNECTION      * 01292000
*DCL NCSCSCV  BIT(16) CONSTANT('3022'X);   /* SET CONTROL VECTOR      * 01293000
*DCL NCSNCPPG BIT(16) CONSTANT('FFFF'X);   /* PURGE                   * 01294000
*/* NEW VALUES FOR NCSPLCMD   */                                   0494 01295000
*DCL NCSCLCND BIT(16) CONSTANT('0041'X);  /* LOAD CONDITIONALLY  */     01296000
*DCL NCSCUCND BIT(16) CONSTANT('0042'X); /* LOAD UNCONDITIONALLY */     01297000
*DCL NCSCRSRT BIT(16) CONSTANT('0043'X); /* RESTART 370X OR CLUS  */    01298000
*DCL NCSDUCMD BIT(16) CONSTANT('0044'X); /* DUMP 370X  */          0497 01299000
*DCL NCSCERPP BIT(16) CONSTANT('0045'X); /* PERFORM ERP DUMP AND   0498 01300000
*                                           RELOAD OF 370X  */     0498 01301000
*DCL NCSDOUT  BIT(16) CONSTANT('0046'X); /* DIAL OUT                 */ 01302000
*DCL NCSDCNT  BIT(16) CONSTANT('0047'X); /* DIAL CONTACT             */ 01303000
*DCL NCSDABDN BIT(16) CONSTANT('0048'X); /* DIAL ABANDON             */ 01304000
*DCL NCSDENAS BIT(16) CONSTANT('0049'X); /* DIAL ENABLE ANSWER       */ 01305000
*/*  VALUES FOR NCSCMDB                                              */ 01306000
*DCL NCSBFME BIT(8) CONSTANT('06'X);     /* SEND POS RESP COMMAND    */ 01307000
*DCL NCSBEXC BIT(8) CONSTANT('07'X);     /* SEND NEG RESP COMMAND    */ 01308000
*/*  CONSTANTS FOR DIAL REASON CODES                                 */ 01309000
*DCL NCSDLRRD BIT(8) CONSTANT('01'X);    /* REDIAL                   */ 01310000
*DCL NCSDLRQT BIT(8) CONSTANT('02'X);    /* QUIT                     */ 01311000
*/* NEW VALUES FOR NCSIORC   */                                    0507 01312000
*DCL NCSLDAOK BIT(8) CONSTANT('00'X);  /* COMMAND PROCESSED SUCESS */   01313000
*DCL NCSLDACT BIT(8) CONSTANT('04'X);  /* NCP ACTIVE-LOAD NOT PERF */   01314000
*DCL NCSLDCAN BIT(8) CONSTANT('04'X);  /* RELOAD DECLINED BY OPER  */   01315000
*DCL NCSLDIOP BIT(8) CONSTANT('08'X);  /* I/O PURGED               */   01316000
*DCL NCSLDNOG BIT(8) CONSTANT('0C'X);  /* COMMAND FAILED           */   01317000
*DCL NCSDUCOM BIT(8) CONSTANT('14'X);  /* DUMP COMPLETE            */   01318000
*DCL NCSHALTD BIT(8) CONSTANT('18'X);  /* CMD REJECTED,HALT IN PROG*/   01319000
*DCL NCSUNREC BIT(8) CONSTANT('1C'X);  /* COMMAND UNRECOGNIZED     */   01320000
*DCL NCSNOSTG BIT(8) CONSTANT('20'X);  /* CMD REJ,INSUFF STORAGE   */   01321000
*DCL NCSDOS   BIT(8) CONSTANT('00'X);  /* DIAL-OUT SUCCESSFUL      */   01322000
*DCL NCSDOF   BIT(8) CONSTANT('04'X);  /* DIAL-OUT UNSUCCESSFUL    */   01323000
*DCL NCSDOP   BIT(8) CONSTANT('08'X);  /* DIAL-OUT PENDING         */   01324000
*DCL NCSDCS   BIT(8) CONSTANT('00'X);  /* DIAL-CONTACT LOADED      */   01325000
*DCL NCSDCF   BIT(8) CONSTANT('0C'X);  /* DIAL-CONTACT FAILED      */   01326000
*DCL NCSDAS   BIT(8) CONSTANT('00'X);  /* DIAL-ABANDON CONN COMPLETE*/  01327000
*DCL NCSDENSO BIT(8) CONSTANT('00'X);  /* ENABLE ANSWER SUCCESSFUL  */  01328000
*DCL NCSDOFHR BIT(8) CONSTANT('04'X);  /* OFFHOOK REQUIRED          */  01329000
*DCL NCSDENSF BIT(8) CONSTANT('08'X);  /* ENABLE ANSWER FAIL        */  01330000
*/*  NEW VALUES FOR NCSPRMRC    */                                 0525 01331000
*DCL NCSFIRM  BIT(8) CONSTANT('10'X);  /* RESTART SUCC,OPENDST REQ */   01332000
*DCL NCSEWRN  BIT(8) CONSTANT('11'X);  /* CON LOST,RECOV IN  PROG  */   01333000
*/* CONSTANTS FOR TRACE                                            */   01334000
*DCL NCSACTLT BIT(16) CONSTANT('0820'X); /* ACTIVATE LINE TRACE    */   01335000
*DCL NCSDACLT BIT(16) CONSTANT('0840'X); /* DEACTIVATE LINE TRACE  */   01336000
*DCL NCSCACLT BIT(16) CONSTANT('301D'X); /* SSCP ACT LINE TRACE    */   01337000
*DCL NCSCDCLT BIT(16) CONSTANT('301E'X); /* SSCP DEACT LINE TRACE  */   01338000
*/* DISPLAY COMMAND MODIFIER CONSTANTS                             */   01339000
*DCL NCSDPATH BIT(16) CONSTANT('0001'X); /* PATHS                  */   01340000
*/* LOGICAL CHANNEL COMMAND WORD                                      * 01341000
*/* ADD A DECLARE                                      003 10/18/74   * 01342000
*DCL  1  ISTLCCW BDY(WORD) BASED,                                  0532 01343000
*        2  LCCWOP    CHAR(1),         /* OPERATION CODE -CONTROL     * 01344000
*           3  LCCWSI BIT(1),          /* SESS INIT / START DIALOG FLG* 01345000
*           3  LCCWSD BIT(1),          /* SESS DISCON/END DIALOG FLG  * 01346000
*           3  LCCWRWOP BIT(6),        /* READ/WRITE OPERATION CODE   * 01347000
*              4  * BIT(1),            /* RESERVED                    * 01348000
*              4  LCCWSOP BIT(1),      /* SPECIAL OPERATION LIKE   0532 01349000
*                                         ERASE OR READ CONT          * 01350000
*              4  LCCWCTL BIT(4),      /* CONTROL TYPE                * 01351000
*                 5  LCCWMODE BIT(2),  /* MODE TYPE                   * 01352000
*                 5  LCCWTYPE BIT(2),  /* OPERATION TYPE              * 01353000
*        2  LCCWFLAG  CHAR(1),         /* FLAG BYTE                   * 01354000
*           3  LCCWCD BIT(1),          /* CHAIN DATA                  * 01355000
*           3  LCCWCC BIT(1),          /* CHAIN COMMAND               * 01356000
*           3  LCCWCKPT BIT(1),        /* SUPPRESS 3705 CHECK POINT     01357000
*                                         RECORD                      * 01358000
*           3  LCCWNTVC BIT(1),        /* DO NOT PERFORM VALCHEK      * 01359000
*           3  LCCWIDAT BIT(1),        /* LCCWDATA CONTAINS DATA      * 01360000
*           3  LCCWLSI BIT(1),         /* LCCW SYNCH INDICATOR        * 01361000
*              4  LCCWPER BIT(1),      /* POST=RESP                   * 01362000
*           3  LCCWRFI BIT(1),         /* REQUEST FEEDBACK INDICATOR  * 01363000
*           3  LCCWACI BIT(1),         /* ADDITION COMMAND INDICATOR  * 01364000
*        2  LCCWCNT FIXED(16),         /* DATA COUNT                  * 01365000
*        2  LCCWDATA PTR(31);          /* DATA ADDRESS OR IMMED. DATA * 01366000
*/* LOGICAL COMMAND CODES */                                       0533 01367000
*DCL  LXDQ     BIT(8) CONSTANT('3B'X), /* RESET DEVICE QUEUE          * 01368000
*     LXEC     BIT(8) CONSTANT('4B'X), /* RESET AT END OF COMMAND     * 01369000
*     LXO      BIT(8) CONSTANT('5B'X), /* RESET ORDERLY               * 01370000
*     LCCWPRGE BIT(8) CONSTANT('6B'X), /* PURGE                       * 01371000
*     LWH      BIT(8) CONSTANT('0F'X), /* WRITE HEADER INDI. 1ST BLOCK* 01372000
*     LWRVI    BIT(8) CONSTANT('1F'X), /* WRITE RVI                   * 01373000
*     LWNA     BIT(8) CONSTANT('2F'X), /* WRITE NEGATIVE ACK          * 01374000
*     LWAA     BIT(8) CONSTANT('3F'X), /* WRITE ALTERNATE ACK         * 01375000
*     LWPLG    BIT(8) CONSTANT('5F'X), /* WRITE ACK LEADING GRAPHICS  * 01376000
*     LWNLG    BIT(8) CONSTANT('6F'X), /* WRITE NACK LEADING GRAPHICS * 01377000
*     LSMDE    BIT(8) CONSTANT('4F'X), /* SET MODE                    * 01378000
*     LIFBM    BIT(8) CONSTANT('7F'X), /* INDIC 1ST BLOCK OF MESSAGE  * 01379000
*     LTEST    BIT(8) CONSTANT('FE'X), /* TEST LCCW                   * 01380000
*     LPRMPT   BIT(8) CONSTANT('13'X), /* PREEMPT LCCW                * 01381000
*     LRSTR    BIT(8) CONSTANT('43'X), /* RESTORE LCCW                * 01382000
*     LEXEC    BIT(8) CONSTANT('FF'X), /* SPECIAL CONTROL OPERATION   * 01383000
*     LREAD    BIT(2) CONSTANT('10'B),  /* READ TYPE LCCW             * 01384000
*     LWRITE   BIT(2) CONSTANT('01'B),  /* WRITE TYPE LCCW            * 01385000
*     LCNTRL   BIT(2) CONSTANT('11'B),  /* CONTROL TYPE LCCW          * 01386000
*     LRESET   BIT(4) CONSTANT('1011'B),/* RESET COMMANDS             * 01387000
*     LTIC     BIT(8) CONSTANT('08'X),  /* LOGICAL TIC                * 01388000
*     LWR      BIT(6) CONSTANT('000001'B),  /* WRITE CONVERSATIONAL   * 01389000
*     LWB      BIT(6) CONSTANT('000101'B),  /* WRITE BLOCK            * 01390000
*     LWM      BIT(6) CONSTANT('001001'B),  /* WRITE MESSAGE          * 01391000
*     LWT      BIT(6) CONSTANT('001101'B),  /* WRITE TRANSMISSION     * 01392000
*     LEWM     BIT(6) CONSTANT('011001'B),  /* ERASE/WRITE MESSAGE    * 01393000
*     LEWT     BIT(6) CONSTANT('011101'B),  /* ERASE/WRITE TRNSMSSN   * 01394000
*     LEAU     BIT(6) CONSTANT('010001'B),  /* ERASE ALL UNPROTECTED  * 01395000
*     LRB      BIT(6) CONSTANT('000110'B),  /* READ BLOCK             * 01396000
*     LRM      BIT(6) CONSTANT('001010'B),  /* READ MESSAGE           * 01397000
*     LRT      BIT(6) CONSTANT('001110'B),  /* READ TRANSMISSION      * 01398000
*     LRMOD    BIT(6) CONSTANT('010010'B),  /* READ MODIFIED          * 01399000
*     LRBUF    BIT(6) CONSTANT('010110'B),  /* READ BUFFER            * 01400000
*     LRCONT   BIT(6) CONSTANT('011010'B),  /* READ CONTINUOUS        * 01401000
*     LRPEP    BIT(6) CONSTANT('011110'B),  /* READ PERPETUAL         * 01402000
*     LCPYM    BIT(6) CONSTANT('101001'B),  /* COPY MESSAGE           * 01403000
*     LCPYT    BIT(6) CONSTANT('101101'B),  /* COPY TRANSMISSION      * 01404000
*     LD       BIT(8) CONSTANT('23'X),  /* DISCONNECT                 * 01405000
*     LDEC     BIT(8) CONSTANT('33'X),  /* DISCONNECT WITH END OF CALL* 01406000
*     LEOC     BIT(8) CONSTANT('53'X),  /* END OF CALL COMMAND        * 01407000
*     LXEL     BIT(8) CONSTANT('0B'X),  /* RESET ERROR LOCK           * 01408000
*     LXC      BIT(8) CONSTANT('1B'X),  /* RESET CONDITIONAL          * 01409000
*     LXI      BIT(8) CONSTANT('2B'X),  /* RESET IMMEDIATE            * 01410000
*     LC       BIT(8) CONSTANT('03'X),  /* CONTACT                    * 01411000
*     LWPA     BIT(8) CONSTANT('FD'X); /* WRITE POSITIVE ACK          * 01412000
*DCL  LMT      BIT(2) CONSTANT('11'B), /* TRANSMISSION MODE           * 01413000
*     LMS      BIT(2) CONSTANT('00'B), /* SPECIAL MODE LIKE CONV, EAU * 01414000
*     LMB      BIT(2) CONSTANT('01'B), /* BLOCK MODE                  * 01415000
*     LMM      BIT(2) CONSTANT('10'B); /* MSG OR CONTINUOUS MODE      * 01416000
*/* FOLLOWING EQUATES FOR  - PORT SOLICITOR (DIAL)                    * 01417000
*/* PORT SOLICITOR COMMAND CODES                                      * 01418000
*DCL PSOL    BIT(8) CONSTANT('FE'X), /* SPECIAL PORT SOLICITOR     0535 01419000
*                                       COMMAND                       * 01420000
*    STCTL    BIT(8) CONSTANT('01'X), /* START CONTROL                * 01421000
*    RESTCTL  BIT(8) CONSTANT('02'X), /* RESET & CONTROL - REDRIVE    * 01422000
*    STIPUT   BIT(8) CONSTANT('03'X); /* START INPUT                  * 01423000
*/*   FOLLOWING EQUATES FOR SDLC SUPPORT                              * 01424000
*DCL  LCCHOLD  BIT(8) CONSTANT('01'X),  /* HOLD                       * 01425000
*     LCCRHOLD BIT(8) CONSTANT('02'X),  /* RELEASE HOLD               * 01426000
*     LSEND    BIT(8) CONSTANT ('F1'X), /* SEND                       * 01427000
*     LCLEAR   BIT(8) CONSTANT ('F2'X), /* CLEAR                      * 01428000
*     LCRUD    BIT(8) CONSTANT ('F3'X), /* CLEAR, UNBIND              * 01429000
*     LCRUDNFY BIT(8) CONSTANT ('F4'X), /* CLEAR, UNBIND, NOTIFY      * 01430000
*     LNFY     BIT(8) CONSTANT ('F5'X), /* NOTIFY                     * 01431000
*     LRELCB   BIT(8) CONSTANT ('F6'X), /* RELEASE CB                 * 01432000
*     LRESTSR  BIT(8) CONSTANT ('F7'X), /* RESETSR                    * 01433000
*     LCLRNFY  BIT(8) CONSTANT('F8'X),  /* CLEAR/NOTIFY               * 01434000
*     LCHPUR   BIT(8) CONSTANT('F9'X);  /* PURGE                      * 01435000
*DCL  LCCWSIZE FIXED(8) CONSTANT(8);    /* LCCW SIZE                  * 01436000
*DCL  LRDS     BIT(8) CONSTANT('FF'X);  /* RECORD DEV STATS COMMAND   * 01437000
*DCL  LQUIS    BIT(8) CONSTANT('FE'X);  /* QUIESCE COMMAND            * 01438000
*/*              LOGICAL CHANNEL PROGRAM BLOCK                       */ 01439000
*/*                                                                  */ 01440000
*/*  REVISIONS                                         007 05/19/75  */ 01441000
*/*                                                                  */ 01442000
*DCL  1  ISTLCPB BDY(WORD) BASED(LCPBPTR),                         0540 01443000
*        2 LCPTYPE CHAR(1),            /* TYPE CODE                  */ 01444000
*        2 LCPLNGTH  PTR(8),           /* LENGTH IN BYTES            */ 01445000
*        2 LCPREQTG CHAR(2),           /* LCPB REQ. TAG FIELD        */ 01446000
*          3 LCPFLAGS BIT(8),          /* FLAG BYTE                  */ 01447000
*            4 LCPZRT00 BIT(1),        /* LOGICAL ERROR FLAG         */ 01448000
*            4 LCPZRT01 BIT(1),        /* CONTROL BLOCK ERROR        */ 01449000
*            4 LCPZF001 BIT(1),        /* LCP START PROCESS FLAG     */ 01450000
*              5 LCPZRT02 BIT(1),      /* I/O INITIATION DISABLED    */ 01451000
*                6 LCPZRTL2 BIT(1),    /* END OF SCHEDULABLE BLOCK   */ 01452000
*            4 LCPZF002 BIT(1),        /* LCP IN PROCESSING FLAG     */ 01453000
*              5 LCPZRT03 BIT(1),      /* GO LOOK AT FMCB LINE STATE */ 01454000
*                                      /* FIELD (REQ. TAG OVERLAY)   */ 01455000
*                6 LCPZRTL3 BIT(1),    /* WRITE/READ REQUEST         */ 01456000
*            4 LCPZF003 BIT(1),        /* LCP PROCESSING COMPLETE FLAG* 01457000
*              5 LCPZRT04 BIT(1),      /* STPR SET IN BDU FLAG       */ 01458000
*                                      /* (REQ. TAG OVERLAY)         */ 01459000
*                6 LCPZRTL4 BIT(1),    /* FEEDBACK REQUESTED         */ 01460000
*            4 LCPZF004 BIT(1),        /* SINGLE LCCW/LCP FLAG       */ 01461000
*              5 LCPZRT05 BIT(1),      /* FEEDBACK TO BE ROUTED TO   */ 01462000
*                                      /* ICNCB FMCB (REQ. TAG       */ 01463000
*                                      /* OVERLAY)                   */ 01464000
*                6 LCPZRTL5 BIT(1),    /* DECREMENT SCHED COUNT ON DEQ* 01465000
*            4 LCPZRT06 BIT(1),        /* CRITICAL TEXT BLOCK        */ 01466000
*                                      /* FLAG (REQ. TAG OVERLAY)    */ 01467000
*              5 LCPZRTL6 BIT(1),      /* WRITE REQUEST              */ 01468000
*            4 LCPZRT07 BIT(1),        /* BUFFER TRACE ACTIVE        */ 01469000
*                                      /* FLAG (REQ. TAG OVERLAY)    */ 01470000
*              5 LCPZRTL7 BIT(1),      /* SCHEDULING FLAG            */ 01471000
*          3 LCPMNRCD CHAR(1),         /* LCP MINOR REJECTION CODE   */ 01472000
*            4 LCPZRT08 BIT(1),        /* I/O TRACE ACTIVE FLAG      */ 01473000
*                                      /* (REQ. TAG OVERLAY)         */ 01474000
*              5 LCPZRTL8 BIT(1),      /* DEVICE END NOTIFICATION    */ 01475000
*            4 LCPZRT09 BIT(1),        /* DIALOGUE SCHED DISABLED    */ 01476000
*              5 LCPZRTL9 BIT(1),      /* CRITICAL TEXT FLAG         */ 01477000
*            4 LCPZRT0A BIT(1),        /* SIMULATED CONTACT FLAG     */ 01478000
*            4 LCPZRT0B BIT(1),        /* SIMULATED DISCONNECT FLAG  */ 01479000
*        2 LCPCHAIN PTR(31),           /* APS CHAIN                  */ 01480000
*          3 LCPCHAI1 PTR(8),                                      0540 01481000
*            4 LCPCHNG BIT(1),         /* GATE BIT                   */ 01482000
*          3 LCPCHAI2 PTR(24),         /* ADDRESS FIELD              */ 01483000
*        2 LCPRUCNT PTR(8),            /* NUMBER OF RU FOR THIS LCPB */ 01484000
*          3 LCPZMIRC CHAR(1),         /* MINOR RETURN CODE          */ 01485000
*        2 LCPFLAG2 CHAR(1),           /* SECOND FLAG BYTE           */ 01486000
*          3 LCPPRFLG BIT(1),          /* PACING REQUIRED            */ 01487000
*          3 LCPASYN  BIT(1),          /* ASYNCHRONOUS LCPB          */ 01488000
*          3 LCPRSTRT BIT(1),          /* RESTART LCPB               */ 01489000
*          3 LCPTLBPI BIT(1),          /* TPIOS BLOCK LCCW           */ 01490000
*            4 LCPZRIMM BIT(1),        /* RESET IMMED REQUIRED ON ERR*/ 01491000
*          3 LCPFID0  BIT(1),          /* FID0 TH INDICATOR FOR RECORD* 01492000
*            4 LCPEXRES BIT(1),        /* EXCEP. RESPONSE SPEC. 3270R*/ 01493000
*          3 LCPDSTAT BIT(1),          /* DIALOGUE STATE BIT, 3270R  */ 01494000
*                                      /* 0=REQ. REJECT,1=STATE ERROR*/ 01495000
*          3 LCPFREE  BIT(1),          /* DEALLOCATE LCPB 3270R      */ 01496000
*          3 LCPATOP  BIT(1),          /* ATOP LCPB  3270R           */ 01497000
*        2 LCPSEQ   FIXED(16),         /* OUTBOUND SEQUENCE NUMBER   */ 01498000
*          3 LCPRRCCT PTR(8),          /* COUNT OF RESPONSES RECEIVED*/ 01499000
*          3 LCPRRCNT PTR(8),          /* COUNT OF RESPONSES REQUESTED* 01500000
*        2 LCPLCCW1 PTR(31),           /* ADDR FIRST LCCW FOR FID1   */ 01501000
*        2 LCPCID CHAR(4) BDY(WORD),   /* COMMUNICATION ID           */ 01502000
*          3 LCPSAF BIT(16),           /* SOURCE IDENTIFICATION      */ 01503000
*          3 LCPDAF BIT(16),           /* DESTINATION IDENTIFICATION */ 01504000
*        2 LCPNXLCW PTR(31),           /* ADDR NEXT LCCW             */ 01505000
*        2 LCPFDBA PTR(31),            /* BTU ADDRESS                */ 01506000
*          3 LCPFDB1 PTR(8),                                       0540 01507000
*          3 LCPFDB2 PTR(24),          /* ADDRESS FIELD              */ 01508000
*        2 LCPTLBAD PTR(31),           /* ADDRESS OF TLB             */ 01509000
*        2 LCPFOSN  BIT(16),           /* SEQUENCE NUMBER FIRST RU   */ 01510000
*        2 LCPFSNCH FIXED(16),         /* 1ST SEQ NUMBER IN RU CHAIN */ 01511000
*        2 LCPSTYPE FIXED(8),          /* LCPB SUB-TYPE X'FF' = RESET,* 01512000
*                                      /* X'00' = NON-RESET          */ 01513000
*        2 LCPFLG1 CHAR(1),            /* FLAGS                      */ 01514000
*          3 LCPRESET BIT(1),          /* A TPQUE WITH RESET QUEUED  */ 01515000
*                                      /* THIS ELEMENT               */ 01516000
*          3 LCPINTER BIT(1),          /* INTERNAL LCPB              */ 01517000
*          3 LCPDIRPT BIT(1),          /* NOT SEND W/POST=SCHED=0    */ 01518000
*          3 LCPREDRV BIT(1),          /* LCPB IS FOR REDRIVE        */ 01519000
*          3 LCPSTLB  BIT(1),          /* TLB NOT TO BE FREED        */ 01520000
*          3 LCPTRANS BIT(1),          /* DATA INCLUDES CONTROL CHARS*/ 01521000
*          3 LCPRSV78 BIT(2),          /* RESERVED                   */ 01522000
*        2 LCPLCCWC BIT(8),            /* COUNT OF LCCWS             */ 01523000
*        2 LCPRSV77 CHAR(1),           /* RESERVED                   */ 01524000
*        2 LCPFLCCW PTR(31),           /* ADDR OF FIRST LCCW         */ 01525000
*          3 LCPUBFSB PTR(31),         /* UNBIND FSB ADDRESS         */ 01526000
*        2 LCPCLREP PTR(31),           /* PTR TO CLEAR LCPB IN UCB   */ 01527000
*/*  NOTE:  THE FOLLOWING FIELD - LCPLCCW MUST BE THE LAST FIELD     */ 01528000
*/*         IN THIS CONTROL BLOCK.  THE CONTROL BLOCK ISTDCLCP HAS   */ 01529000
*/*         FIELDS IN IT WHICH MUST BE CONTIGUOUS WITH LCPLCCW       */ 01530000
*        2 LCPLCCW  CHAR(LENGTH(ISTLCCW)) BDY(WORD), /* FIRST LCCW   */ 01531000
*          3 LCPRSTQH PTR(31),         /* RESET LCPB QUEUE HEADER    */ 01532000
*          3 LCPPABA  PTR(31),         /* PAB POINTER                */ 01533000
*            4 LCPRPHA  PTR(31),       /* RPH POINTER                */ 01534000
*              5 LCPFTYPE BIT(1);      /* FEEDBACK TYPE              */ 01535000
*/*     CONSTANTS FOR LCPTYPE                                         * 01536000
*DCL  LCRPHFT  BIT(1) CONSTANT('1'B);                              0541 01537000
*DCL  LCPABFT  BIT(1) CONSTANT('0'B);                              0542 01538000
*DCL LCPBFIRM BIT(8) CONSTANT('10'X);  /* LU FAILED, CLSDST, SCHED LOST 01539000
*                                         TERM, OPNDST MAY BE TRIED   * 01540000
*DCL LCPBTERM BIT(8) CONSTANT('11'X);  /* TERM RECEIVED,CLSDST,    0544 01541000
*                                         SCHED LOST TERM             * 01542000
*/*                                                                   * 01543000
*                                                                  0545 01544000
*DCL 1 LCPZTIE BDY(WORD) DEFINED(LCPCID), /* TOLTEP INTERFACE      0545 01545000
*                                         ELEMENT OVERLAY            */ 01546000
*       2  LCPZFMCA PTR(31),           /* ACTIVE FMCB ADDRESS        */ 01547000
*       2  LCPZSNA PTR(31),            /* SYMBOLIC NAME ADDRESS      */ 01548000
*       2  LCPZSNAM CHAR(8) BDY(WORD), /* SYMBOLIC NAME              */ 01549000
*          3  LCPZTRV1 PTR(31),        /* RESERVED FOR RESTORE LCP   */ 01550000
*          3  LCPZTRV4 PTR(31);        /* RESERVED FOR RESTORE LCP   */ 01551000
*DCL LCTYPE BIT(8) CONSTANT('04'X);                                0546 01552000
*DCL PLCPTYPE BIT(8) CONSTANT('28'X);  /* PURGE LCPB TYPE ID         */ 01553000
*DCL LCPCLACB BIT(8) CONSTANT('04'X);  /* LCPB FROM CLOSE ACB        */ 01554000
*DCL LSRSTYPE BIT(8) CONSTANT('FF'X);  /* RESET SUBTYPE              */ 01555000
*DCL LCPETYPE BIT(8) CONSTANT('40'X);  /* EXTENDED LCPB TYPE ID      */ 01556000
*/*                                                                  */ 01557000
*/*  MINOR RETURN CODES                                              */ 01558000
*/*                                                                  */ 01559000
*DCL LCMCRSTR BIT(8) CONSTANT('F7'X),  /* MINOR RC FOR RESETSR       */ 01560000
*    LCPMNEW  BIT(8) CONSTANT('02'X),  /* EARLY WARNING,             */ 01561000
*                                      /* RECOVERY IN PROGRESS       */ 01562000
*    LCPMNPF  BIT(8) CONSTANT('03'X),  /* PERM. I/O FAILURE          */ 01563000
*    LCPMNAS  BIT(8) CONSTANT('04'X),  /* AUTO NETWORK SHUTDOWN      */ 01564000
*    LCPMNCL  BIT(8) CONSTANT('06'X),  /* CLOSE/CLSDST OCCURED       */ 01565000
*    LCPMNVD  BIT(8) CONSTANT('07'X),  /* VARY DEACTIVATE            */ 01566000
*    LCPMNTF  BIT(8) CONSTANT('10'X),  /* TEMP RECORD DEVICE FAILURE */ 01567000
*    LCPMNSF  BIT(8) CONSTANT('01'X),  /* TEMP BASIC FAILURE /       */ 01568000
*    LCPMNTS  BIT(8) CONSTANT('11'X),  /* TERMINATE SELF             */ 01569000
*    LCPMNAP  BIT(8) CONSTANT('0A'X),  /* APPL. ISSUED CLEAR         */ 01570000
*    LCPMNPR  BIT(8) CONSTANT('0B'X),  /* PREEMPT                    */ 01571000
*    LCPMNRE  BIT(8) CONSTANT('0C'X);  /* RESTORE                    */ 01572000
*/* VS1, VS2 TPIOS SAVEAREA FORMAT */                              0552 01573000
*DCL  1  ISTZSAVE BDY(WORD) BASED,                                 0552 01574000
*        2   ZSAZSVBC PTR(31),         /* SAVEAREA BACK CHAIN        */ 01575000
*            3   ZSAZSVMS CHAR(1),     /* MODULE TRACE CODE          */ 01576000
*                4 ZSAZACTV BIT(1),    /* ACTIVE SAVE AREA FLAG      */ 01577000
*        2   ZSAZSVFC PTR(31),         /* SAVEAREA FORWARD CHAIN     */ 01578000
*        2   ZSAZSVRR PTR(31),         /* RETURN REGISTER            */ 01579000
*        2   ZSAZSVVR (6) PTR(31),    /* VARIABLE REGS (7-12) SVEAREA*/ 01580000
*        2   ZSAZTRAC CHAR(4);        /* EBCDIC NAME OF OWNER        */ 01581000
*/*                                                                0553 01582000
*THE FOLLOWING EQUATES SHOULD READ ''FIXED(8) CONSTANT(LENGTH(X))'',    01583000
*WHERE X IS THE NAME OF THE VARIABLE CONTROL BLOCK OR FIELD OF WHICH    01584000
*LENGTH IS THE VALUE BEING EQUATED, SHOULD THE PLS COMPILER BE     0553 01585000
*BE ABLE TO TAKE IT.                                               0553 01586000
*                                                                    */ 01587000
*DCL ZSAZSVVA FIXED(8) CONSTANT(8);  /* DISPLACEMENT TO VARIABLE REGS*/ 01588000
*DCL ZSAZSVSZ FIXED(8) CONSTANT(40); /* LENGTH OF ISTZSAVE           */ 01589000
*/* PREFIX FOR CRR                                                   */ 01590000
*/*                                                                  */ 01591000
*/* RELEASE 1 - JUNE 28, 1973                                        */ 01592000
*/*                                                                  */ 01593000
*DCL 1 ISTPFCRR BASED BDY(WORD),        /* PREFIX FOR CRR            */ 01594000
*     2  PFCCRR   CHAR(4),              /* CRR HEADER                */ 01595000
*        3  PFCCRRID CHAR(1),           /* CRR ID FIELD              */ 01596000
*           4  CRRID CHAR(1),           /* BASIC CTL LAYER DEFINITION*/ 01597000
*        3  PFCRSV10 CHAR(1),           /* RESERVED FOR ALIGNMENT    */ 01598000
*        3  PFCCRRLN CHAR(2),           /* CRR LENGTH                */ 01599000
*           4  CRRLEN CHAR(2),          /* BASIC CTL LAYER DEF       */ 01600000
*     2  PFCHDR CHAR(8) BDY(WORD),      /* SAVE AREA FOR OLD CRR FRR */ 01601000
*        3  PFCCRRO  PTR(31),           /* PTR TO OLD CRR            */ 01602000
*           4  CRRCHAIN PTR(31),        /* BASIC CTL LAYER DEFINITION   01603000
*                                          FOR OLD CRR PTR           */ 01604000
*        3  PFCFRRO  PTR(31),           /* PTR TO OLD FRR            */ 01605000
*           4  CRRFRR   PTR(31),        /* BASIC CTL LAYER         0555 01606000
*                                          DEFINITION OF OLD FRR PTR */ 01607000
*     2  PFCFTA BIT(8),                 /* ID OF LAST FUNCTION TRACED*/ 01608000
*     2  PFCRSV01 CHAR(3);              /* ALIGNMENT                 */ 01609000
*DCL PFIDPIE BIT(8) CONSTANT('80'X);    /* DOS/VS TPIOS              */ 01610000
*DCL PFIDORE BIT(8) CONSTANT('81'X);    /* DOS/VS BMS                */ 01611000
*DCL PFIDAPE BIT(8) CONSTANT('82'X);    /* DOS/VS PSS                */ 01612000
*DCL PFCIDPSV BIT(8) CONSTANT('38'X); /* COMPONENT ID              0559 01613000
*                                          PSS - VS1 AND 2           */ 01614000
*DCL PFCIDTPV BIT(8) CONSTANT('3C'X); /* COMPONENT ID              0560 01615000
*                                          TPIOS VS1 AND 2           */ 01616000
*DCL PFCIDSME BIT(8) CONSTANT('3D'X); /* COMPONENT ID              0561 01617000
*                                          STORAGE MANAGEMENT DOS    */ 01618000
*DCL PFCIDOC BIT(8) CONSTANT('31'X);    /* COMPONENT ID OPEN/CLOSE   */ 01619000
*DCL PFCIDPS BIT(8) CONSTANT('32'X);    /* PORT SOLICITOR            */ 01620000
*DCL PFCIDCS BIT(8) CONSTANT('34'X);    /* CLUSTER SOLICITOR         */ 01621000
*DCL PFCIDIT BIT(8) CONSTANT('35'X);    /* INIT/TERM                 */ 01622000
*DCL PFCIDVY BIT(8) CONSTANT('36'X);    /* VARY                      */ 01623000
*DCL PFCIDNS  BIT(8) CONSTANT('37'X);   /* NET. STAT.SRV.            */ 01624000
*DCL PFCIDTPE BIT(8) CONSTANT('38'X);   /* COMPONENT ID            0568 01625000
*                                          TPIOS - DOS               */ 01626000
*DCL PFCIDCL BIT(8) CONSTANT('39'X);    /* COMPONENT ID            0569 01627000
*                                          CONTROL LAYER             */ 01628000
*DCL PFCIDPSE BIT(8) CONSTANT('3A'X);   /* COMPONENT ID            0570 01629000
*                                          PSS - DOS                 */ 01630000
*DCL PFCIDSMV BIT(8) CONSTANT('3F'X);   /* COMPONENT ID            0571 01631000
*                                          STORAGE MANAGEMENT        */ 01632000
*DCL PFCIDTIO BIT(8) CONSTANT('40'X);   /* COMPONENT ID TIIO       0572 01633000
*                                          PROCESSING (VS2)          */ 01634000
*DCL PFCIDRS  BIT(8) CONSTANT('41'X);   /* ID FOR REMOTE SOLICITOR   */ 01635000
*/* CRR FOR COMMAND FACILITIES                                      */  01636000
*/*  REVISIONS                                         001 06/02/75 */  01637000
*DCL  1  ISTCFCRR BDY(WORD) BASED, /* CRR FOR COMMAND FACILITIES    */  01638000
*        2 CFCAUDIT,               /* AUDIT TRAIL FOR CMD FACILITIES*/  01639000
*          3 CFCNTRD  CHAR(1),     /* LIST OF MODULES IN COMMAND    */  01640000
*                                  /* FACILITIES ENTERED            */  01641000
*            4 NCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 ENTERED   */  01642000
*            4 NCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 ENTERED   */  01643000
*            4 NCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 ENTERED   */  01644000
*            4 NCFCRP   BIT(1),    /* IND MODULE ISTCFCRP ENTERED   */  01645000
*            4 NCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 ENTERED   */  01646000
*            4 NCFRSVD  BIT(3),    /* RESERVED                      */  01647000
*          3 CFCCRT   CHAR(1),     /* LIST OF MODULES IN COMMAND    */  01648000
*                                  /* FACILITIES RUNNING            */  01649000
*            4 CCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 RUNNING   */  01650000
*            4 CCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 RUNNING   */  01651000
*            4 CCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 RUNNING   */  01652000
*            4 CCFCRP   BIT(1),    /* IND MODULE ISTCFCRP RUNNING   */  01653000
*            4 CCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 RUNNING   */  01654000
*            4 CCFRSVD1 BIT(3);    /* RESERVED                      */  01655000
*DCL TIDCFCS1 BIT(8) CONSTANT('00'X); /* THREAD ID FOR ISTCFCS1     */  01656000
*DCL TIDCFCR1 BIT(8) CONSTANT('01'X); /* THREAD ID FOR ISTCFCR1     */  01657000
*DCL TIDCFCR2 BIT(8) CONSTANT('02'X); /* THREAD ID FOR ISTCFCR2     */  01658000
*/* COMPONENT RECOVERY RECORD FOR TPIOS */                         0578 01659000
*/*  DELTA                                             006 02/10/75  */ 01660000
*DCL                                                               0578 01661000
*1  ISTZCRR BDY(WORD) BASED,     /* CONTROL WORD                     */ 01662000
*   2  ZCRCRR CHAR(4),           /* CONTROL WORD                     */ 01663000
*      3  ZCRID CHAR(1),         /* CONTROL BLOCK ID                 */ 01664000
*      3  ZCRLEN CHAR(2),        /* LENGTH OF ZCR                    */ 01665000
*      3  ZCRFLAG CHAR(1),       /* FLAGS                            */ 01666000
*   2  ZCRCHAIN PTR(31),         /* POINTER TO PREVIOUS ZCR          */ 01667000
*   2  ZCRFRRA PTR(31),          /* PTR TO FRR                       */ 01668000
*   2  ZCRFLGS1 CHAR(1),         /* FLGS USED BY REQUEST COMPLETION  */ 01669000
*      3  ZCREXSW BIT(1),        /* EXIT SWITCH                      */ 01670000
*      3  ZCRQUESW BIT(1),       /* QUEUE SWITCH                     */ 01671000
*      3  ZCRDEQSW BIT(1),       /* DEQUEUE SWITCH                   */ 01672000
*      3  ZCRWAIT BIT(1),        /* WAIT Q ANALYSIS COMPLETE         */ 01673000
*      3  ZCRNRMEX BIT(1),       /* NORMAL EXIT TO BE TAKEN          */ 01674000
*      3  ZCRENDLP BIT(1),       /* END OF LOOP SWITCH               */ 01675000
*      3  ZCRUNSOL BIT(1),       /* UNSOLICITED DATA                 */ 01676000
*      3  ZCRFEXIT BIT(1),       /* FORCE EXIT SWITCH                */ 01677000
*   2  ZCRFLGS2 CHAR(1),         /* FLAGS USED WITHIN TPIOS          */ 01678000
*      3  ZCRLOCAL BIT(1),       /* LOCAL SUPPORT                    */ 01679000
*      3  ZCRSHEDI BIT(1),       /* IMMEDIATE SCHEDULE               */ 01680000
*      3  ZCRFMSED BIT(1),       /* FMCB SEARCH ENDED                */ 01681000
*      3  ZCROB    BIT(1),       /* OUTBOUND PROC IN PROGRESS        */ 01682000
*      3  ZCRIF0E1 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   01683000
*                                   INBOUND PROCESSING               */ 01684000
*      3  ZCRIF0E2 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   01685000
*                                   INBOUND PROCESSING               */ 01686000
*      3  ZCRIF0E3 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   01687000
*                                   INBOUND PROCESSING               */ 01688000
*   2  ZCRSWFLD CHAR(1),         /* SWITCHES FOR TPIOS OUTBOUND      */ 01689000
*      3  ZCRENDSH BIT(1),       /* EXIT FROM REMOTE DEV SCHEDULER   */ 01690000
*         4  ZCRSLCP BIT(1),     /* SCHEDULE LCPB                    */ 01691000
*      3  ZCREXTYP BIT(1),       /* TPEXIT TYPE                      */ 01692000
*      3  ZCRENDPR BIT(1),       /* EXIT FROM INNER PROCESS          */ 01693000
*      3  ZCRNDLCP BIT(1),       /* EXIT FROM LCPB PROCESSING        */ 01694000
*         4  ZCROB1 BIT(1),      /* REMOTE DEV SCHED 1ST TIME SWITCH */ 01695000
*      3  ZCRENDX BIT(1),        /* EXIT FROM LCCW/BTU XLATION       */ 01696000
*      3  ZCRENDXL BIT(1),       /* EXIT FROM LCCW PROC              */ 01697000
*      3  ZCRENDAN BIT(1),       /* EXIT FROM LCPB ANALYSIS          */ 01698000
*      3  ZCRRESET BIT(1),                                         0578 01699000
*         4  ZCRCNLXL BIT(1),    /* CANCEL FURTHER XLATE             */ 01700000
*   2  ZCRFLGS3 CHAR(1),         /* FLAGS FOR OUTBOUND PROCESSING    */ 01701000
*      3  ZCRTIC BIT(1),         /* SELECT NOT TO BE SENT            */ 01702000
*      3  ZCRTPCON BIT(1),       /* TPIOS CONTACT SENT               */ 01703000
*      3  ZCRTPDIS BIT(1),       /* TPIOS DISCONNECT TO BE SENT      */ 01704000
*      3  ZCRDISC  BIT(1),       /* DISCONNECT IN PROCESS            */ 01705000
*      3  ZCREDRIV BIT(1),       /* DO DERIVE                        */ 01706000
*      3  ZCRNOFRE BIT(1),       /* NO FREEING OF SIO QUEUE          */ 01707000
*      3  ZCRWRPTR BIT(1),       /* WRITE TO PRINTER REQUEST         */ 01708000
*      3  ZCRINLCP BIT(1),       /* ERROR OCCURED DURING OUTBND PROC */ 01709000
*   2  ZCRGENSW CHAR(1),         /* GENERAL SWITCHES                 */ 01710000
*      3  ZCRTSW1  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 01711000
*      3  ZCRTSW2  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 01712000
*      3  ZCRRT06  BIT(1),       /* CRITICAL TEXT OPTION             */ 01713000
*      3  ZCRLCSYN BIT(1),       /* LCCW SYNC SPECIFIED              */ 01714000
*      3  ZCREXRES BIT(1),       /* EXCEPTION RESPONSE SPECIFIED     */ 01715000
*      3  ZCRCLRBD BIT(1),       /* FLAG INDICATING BIND WAS CLEARED */ 01716000
*      3  ZCRBRIS  BIT(1),       /* BRACKET REJECTED DUE TO IN BRAC. */ 01717000
*      3  ZCRF1RES BIT(1),       /* FID1 RESPONSE TO BE GENERATED    */ 01718000
*   2  ZCRPFLGS CHAR(1),         /* UTILITIES PROC OPTION FLAGS      */ 01719000
*      3  ZCRQAHED BIT(1),      /* QXFR RTN TO USE INSERT OPT'N ON TPQ* 01720000
*      3  *        BIT(7),      /* RESERVED                          */ 01721000
*   2  ZCRIBPR CHAR(1),          /* INBOUND PROCESSING FLAGS         */ 01722000
*         3  ZCRNOBUF BIT(1),    /* FSB WITH NO BUFFER               */ 01723000
*         3  ZCRERR   BIT(1),    /* ERROR INDICATOR                  */ 01724000
*         3  ZCRRELK  BIT(1),    /* RESET ERROR LOCK FUNCTION REQ.   */ 01725000
*         3  ZCRLCPFR BIT(1),    /* FLAG IND. DEALLOCATE ATOP LCPB   */ 01726000
*         3  ZCRLCPFD BIT(1),    /* FLAG IND. LCPB FOUND ON WAITQ    */ 01727000
*         3  ZCR3270  BIT(1),    /* 3270 DEVICE                      */ 01728000
*         3  ZCR3270R BIT(1),    /* 3270 DEVICE IN RECORD MODE       */ 01729000
*         3  *        BIT(1),    /* RESERVED                         */ 01730000
*   2  ZCRSCPSW CHAR(1),         /* SESSION CONTROL FLAGS            */ 01731000
*         3  ZCRTPEX BIT(1),     /* TP EXIT                          */ 01732000
*         3  ZCRTPINV BIT(1),    /* INVOKE TPIOS                     */ 01733000
*         3  ZCRRJLCP BIT(1),    /* LCPB REJECTED                    */ 01734000
*         3  ZCRLREQ BIT(1),     /* REQUEST                          */ 01735000
*         3  ZCRPRCMP BIT(1),    /* PROCESSING COMPLETE              */ 01736000
*         3  ZCRFSBWE BIT(1),    /* FSB IS WORK ELEMENT              */ 01737000
*         3  ZCRSKIPT BIT(1),    /* SKIP TRACE FLAG                  */ 01738000
*         3  *       BIT(1),     /* RESERVED                         */ 01739000
*   2  ZCRCRLCP PTR(31),         /* CURRENT LCPB PTR                 */ 01740000
*   2  ZCRPARMS BDY(WORD),       /* PARAMETERS PASSED TO UTILITIES */   01741000
*      3  ZCRFBPTR PTR(31),      /* PTR TO FROM BUFFER               */ 01742000
*         4  ZCRCBPTR PTR(31),   /* PTR TO CURRENT BUFFER            */ 01743000
*      3  ZCRTBPTR PTR(31),      /* PTR TO TO-OR-TRANSLATE BUFFER    */ 01744000
*      3  ZCRMLNG FIXED(15),     /* LENGTH TO MOVE                   */ 01745000
*      3  ZCRDFRDA FIXED(15),    /* OFFSET FROM DATA ADDR IN FROM BUF*/ 01746000
*         4  ZCRDTODA FIXED(15), /* OFFSET FROM DATA ADDR XLATE BUF  */ 01747000
*      3  ZCRPCOD1 CHAR(1),      /* CODE BYTE FOR ALLOC/DISALLOC     */ 01748000
*         4  ZCRPPG BIT(1),      /* GET PAGEABLE BUFF                */ 01749000
*         4  ZCRPLNG BIT(1),     /* LENGTH OF BUFFER SPECIFIED       */ 01750000
*         4  ZCRPFSB BIT(1),     /* GET FSB                          */ 01751000
*         4  ZCRPLSBF BIT(1),    /* GET LSCB AND BUFFER              */ 01752000
*            5 ZCRPLSBQ BIT(1),  /* PURGE LSCB QUEUE                 */ 01753000
*         4  ZCRPLSCB BIT(1),    /* GET OR RELEASE LSCB              */ 01754000
*         4  ZCRPBUF BIT(1),     /* GET OR RELEASE BUFFER            */ 01755000
*         4  ZCRPCFTX BIT(1),    /* CONFIDENTIAL TEXT                */ 01756000
*         4  ZCRPRES BIT(1),     /* RESERVED                         */ 01757000
*      3  ZCRPCOD2 CHAR(1),      /* CODE BYTE FOR MOVE               */ 01758000
*         4  ZCRPPG2 BIT(1),     /* GET PAGEABLE BUFFER              */ 01759000
*         4  ZCRPFHDR BIT(1),    /* FROM BUFFER FDB TO BE USED       */ 01760000
*         4  ZCRPMFGF BIT(1),    /* MOVE STARTS WIHT 1ST BUFF IN BLOCK* 01761000
*         4  ZCRPRES2 BIT(5),    /* RESERVED                         */ 01762000
*      3  ZCRPCHAR CHAR(1),      /* TRANSLATE & TEST SEARCH CHARACTER*/ 01763000
*      3  ZCRPSW   CHAR(1),      /* SWITCH FIELD                     */ 01764000
*   2  ZCRCCWA PTR(31),          /* PTR TO CURRENT CCW (CCW 1 OR 2)  */ 01765000
*   2  ZCRBFPTR PTR(31),         /* SAVE 1ST BUFF PTR IN TO-BUFF CHN    01766000
*                                   OR LAST BUFFER IN CHANNEL PGM    */ 01767000
*   2  ZCRZLB PTR(31),           /* PTR TO CURR BUFF IN CHANNEL PGM  */ 01768000
*   2  ZCRPVZB PTR(31),          /* PTR TO PREVIOUS BUFF IN CHAN PGM */ 01769000
*   2  ZCRSVRTN BDY(WORD),       /* REG 14 SAVE AREAS                */ 01770000
*      3  ZCRSVF1 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01771000
*      3  ZCRSVF2 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01772000
*      3  ZCRSVF3 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01773000
*      3  ZCRSVF4 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01774000
*      3  ZCRSVF5 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01775000
*      3  ZCRSVF6 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01776000
*      3  ZCRSVF7 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01777000
*      3  ZCRSVF8 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01778000
*      3  ZCRSVF9 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01779000
*      3  ZCRSVF10 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01780000
*      3  ZCRSVF11 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01781000
*      3  ZCRSVF12 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01782000
*      3  ZCRSVF13 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01783000
*      3  ZCRSVF14 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01784000
*      3  ZCRSVF15 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01785000
*      3  ZCRSVF16 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01786000
*      3  ZCRSVF17 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01787000
*      3  ZCRSVF18 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01788000
*      3  ZCRSVF19 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01789000
*      3  ZCRSVF20 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01790000
*      3  ZCRSVF21 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01791000
*      3  ZCRSVF22 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01792000
*      3  ZCRSVF23 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01793000
*      3  ZCRSVF24 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01794000
*      3  ZCRSVF25 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01795000
*   2  ZCRWKARA BDY(WORD),       /* TEMPORARY REG SAVE AREA          */ 01796000
*      3  ZCRSVWK1 PTR(31),      /* SAVE REQUIRED REG                */ 01797000
*      3  ZCRSVWK2 PTR(31),      /* SAVE REQUIRED REG                */ 01798000
*      3  ZCRSVWK3 PTR(31),      /* SAVE REQUIRED REG                */ 01799000
*      3  ZCRSVWK4 PTR(31),      /* SAVE REQUIRED REG                */ 01800000
*      3  ZCRSVWK5 PTR(31),      /* SAVE REQUIRED REG                */ 01801000
*   2  ZCRFSBSV PTR(31),         /* FSB CHAIN PTR SAVEAREA           */ 01802000
*   2  ZCRFBPRC BIT(1),          /* FSB PROCESS SW                   */ 01803000
*   2  ZCRMOREL BIT(1),          /* MORE ELEMENTS SW                 */ 01804000
*   2  ZCRSCANQ BIT(1),          /* SCAN QUEUE SW                    */ 01805000
*   2  ZCRNXTEL BIT(1),          /* NEXT ELEMENT SW                  */ 01806000
*   2  ZCRXSCHD BIT(1),          /* EXIT SCHEDULE SW                 */ 01807000
*   2  ZCRLSTFB BIT(1),          /* INBOUND PROC LAST FSB FOR ELEM SW*/ 01808000
*   2  ZCRTOPQ  BIT(1),          /* QUEUE ELEMENT TO TOP SW          */ 01809000
*   2  ZCRAWQSW BIT(1),          /* CHECK AWAITQ FOR MORE WORK =1    */ 01810000
*                                /* CHECK WAITQ =0                   */ 01811000
*   2  ZCRRCDSV CHAR(1),         /* RETURN CODE SAVEAREA             */ 01812000
*   2  ZCRPRMTC CHAR(1),         /* PREEMPT COMPLETION PARAMETER BYTE*/ 01813000
*   2  ZCROPCDE CHAR(1),         /* OP CODE TO BE TRANSFORMED         * 01814000
*   2  ZCRR2SV PTR(31),          /* ISTZBFDI REG 2 SAVE EREA         */ 01815000
*   2  ZCRR13SV PTR(31),         /* ISTSBFDI REG 13 SAVE EREA        */ 01816000
*   2  ZCRCIDSV BDY(WORD),       /* ISTZBFDI CID SAVE AREA           */ 01817000
*      3  ZCRSAFSV CHAR(2),      /* ISTZBFDI SAF SAVE AREA           */ 01818000
*      3  ZCRDAFSV CHAR(2),      /* ISTZBFDI DAF SAVE AREA           */ 01819000
*   2  ZCRSAVEZ (6) BDY(WORD) CHAR(LENGTH(ISTZSAVE)),              0578 01820000
*                                /* SAVE/TRACE AREAS FOR TPIOS MODS  */ 01821000
*   2  ZCRREMIC PTR(31),        /* POINTER TO REMOTE RN ICNCB        */ 01822000
*   2  ZCRAUDIT CHAR(36),        /* TPIOS AUDIT TRAIL AREA           */ 01823000
*      3  ZCRTID CHAR(1),        /* THREAD I.D.                      */ 01824000
*      3  ZCRTNAME CHAR(4),      /* LAST 4 CHARS OF THREAD NAME      */ 01825000
*      3  ZCRENTER BIT(248),     /* BIT ARRAY FOR MODULES ENTERED    */ 01826000
*         4  ZCREAC1A BIT(1),    /* ISTZAC1A ENTERED                 */ 01827000
*         4  ZCREAC0A BIT(1),    /* ISTZAC0A ENTERED                 */ 01828000
*         4  ZCREAC0B BIT(1),    /* ISTZAC0B ENTERED                 */ 01829000
*         4  ZCREAC1B BIT(1),    /* ISTZAC1B ENTERED                 */ 01830000
*         4  ZCREBCAA BIT(1),    /* ISTZBCAA ENTERED                 */ 01831000
*         4  ZCREBCAB BIT(1),    /* ISTZBCAB ENTERED                 */ 01832000
*         4  ZCREBCAE BIT(1),    /* ISTZBCAE ENTERED                 */ 01833000
*         4  ZCREBCAG BIT(1),    /* ISTZBCAG ENTERED                 */ 01834000
*         4  ZCREBCAI BIT(1),    /* ISTZBCAI ENTERED                 */ 01835000
*         4  ZCREBCAM BIT(1),    /* ISTZBCAM ENTERED                 */ 01836000
*         4  ZCREBCBA BIT(1),    /* ISTZBCBA ENTERED                 */ 01837000
*         4  ZCREBCBB BIT(1),    /* ISTZBCBB ENTERED                 */ 01838000
*         4  ZCREBCBI BIT(1),    /* ISTZBCBI ENTERED                 */ 01839000
*         4  ZCREBCCB BIT(1),    /* ISTZBCCB ENTERED                 */ 01840000
*         4  ZCREBCDI BIT(1),    /* ISTZBCDI ENTERED                 */ 01841000
*         4  ZCREBCEB BIT(1),    /* ISTZBCEB ENTERED                 */ 01842000
*         4  ZCREBCFA BIT(1),    /* ISTZBCFA ENTERED                 */ 01843000
*         4  ZCREBCFB BIT(1),    /* ISTZBCFB ENTERED                 */ 01844000
*         4  ZCREBCGA BIT(1),    /* ISTZBCGA ENTERED                 */ 01845000
*         4  ZCREBCGB BIT(1),    /* ISTZBCGB ENTERED                 */ 01846000
*         4  ZCREBCHA BIT(1),    /* ISTZBCHA ENTERED                 */ 01847000
*         4  ZCREBCHB BIT(1),    /* ISTZBCHB ENTERED                 */ 01848000
*         4  ZCREBCIA BIT(1),    /* ISTZBCIA ENTERED                 */ 01849000
*         4  ZCREBCIB BIT(1),    /* ISTZBCIB ENTERED                 */ 01850000
*         4  ZCREBCID BIT(1),    /* ISTZBCID ENTERED                 */ 01851000
*         4  ZCREBCJA BIT(1),    /* ISTZBCJA ENTERED                 */ 01852000
*         4  ZCREBCJB BIT(1),    /* ISTZBCJB ENTERED                 */ 01853000
*         4  ZCREBCKA BIT(1),    /* ISTZBCKA ENTERED                 */ 01854000
*         4  ZCREBCKB BIT(1),    /* ISTZBCKB ENTERED                 */ 01855000
*         4  ZCREBCLA BIT(1),    /* ISTZBCLA ENTERED                 */ 01856000
*         4  ZCREBCLB BIT(1),    /* ISTZBCLB ENTERED                 */ 01857000
*         4  ZCREBCMB BIT(1),    /* ISTZBCMB ENTERED                 */ 01858000
*         4  ZCREBCND BIT(1),    /* ISTZBCND ENTERED                 */ 01859000
*         4  ZCREBCNE BIT(1),    /* ISTZBCNE ENTERED                 */ 01860000
*         4  ZCREBCOB BIT(1),    /* ISTZBCOB ENTERED                 */ 01861000
*         4  ZCREBCPB BIT(1),    /* ISTZBCPB ENTERED                 */ 01862000
*         4  ZCREBCQB BIT(1),    /* ISTZBCQB ENTERED                 */ 01863000
*         4  ZCREBCRA BIT(1),    /* ISTZBCRA ENTERED                 */ 01864000
*         4  ZCREBCRB BIT(1),    /* ISTZBCRB ENTERED                 */ 01865000
*         4  ZCREBCSC BIT(1),    /* ISTZBCSC ENTERED                 */ 01866000
*         4  ZCREBCXA BIT(1),    /* ISTZBCXA ENTERED                 */ 01867000
*         4  ZCREBCX0 BIT(1),    /* ISTZBCX0 ENTERED                 */ 01868000
*         4  ZCREBCY0 BIT(1),    /* ISTZBCY0 ENTERED                 */ 01869000
*         4  ZCREBCZ0 BIT(1),    /* ISTZBCZ0 ENTERED                 */ 01870000
*         4  ZCREBC0A BIT(1),    /* ISTZBC0A ENTERED                 */ 01871000
*         4  ZCREBC0B BIT(1),    /* ISTZBC0B ENTERED                 */ 01872000
*         4  ZCRECC0A BIT(1),    /* ISTZCC0A ENTERED                 */ 01873000
*         4  ZCRECC0B BIT(1),    /* ISTZCC0B ENTERED                 */ 01874000
*         4  ZCRECC1A BIT(1),    /* ISTZCC1A ENTERED                 */ 01875000
*         4  ZCRECC1B BIT(1),    /* ISTZCC1B ENTERED                 */ 01876000
*         4  ZCRECC2B BIT(1),    /* ISTZCC2B ENTERED                 */ 01877000
*         4  ZCREDCA0 BIT(1),    /* ISTZDCA0 ENTERED                 */ 01878000
*         4  ZCREDCB0 BIT(1),    /* ISTZDCB0 ENTERED                 */ 01879000
*         4  ZCREDCC0 BIT(1),    /* ISTZDCC0 ENTERED                 */ 01880000
*         4  ZCREDCD0 BIT(1),    /* ISTZDCD0 ENTERED                 */ 01881000
*         4  ZCREDCE0 BIT(1),    /* ISTZDCE0 ENTERED                 */ 01882000
*         4  ZCREDCF0 BIT(1),    /* ISTZDCF0 ENTERED                 */ 01883000
*         4  ZCREDCH0 BIT(1),    /* ISTZDCH0 ENTERED                 */ 01884000
*         4  ZCREDCI0 BIT(1),    /* ISTZDCI0 ENTERED                 */ 01885000
*         4  ZCREDCJ0 BIT(1),    /* ISTZDCJ0 ENTERED                 */ 01886000
*         4  ZCREDCKA BIT(1),    /* ISTZDCKA ENTERED                 */ 01887000
*         4  ZCREDCKB BIT(1),    /* ISTZDCKB ENTERED                 */ 01888000
*         4  ZCREDCL0 BIT(1),    /* ISTZDCL0 ENTERED                 */ 01889000
*         4  ZCREDCMB BIT(1),    /* ISTZDCMB ENTERED                 */ 01890000
*         4  ZCREECBA BIT(1),    /* ISTZECBA ENTERED                 */ 01891000
*         4  ZCREECBB BIT(1),    /* ISTZECBB ENTERED                 */ 01892000
*         4  ZCREECCA BIT(1),    /* ISTZECCA ENTERED                 */ 01893000
*         4  ZCREECCB BIT(1),    /* ISTZECCB ENTERED                 */ 01894000
*         4  ZCREECDA BIT(1),    /* ISTZECDA ENTERED                 */ 01895000
*         4  ZCREECEA BIT(1),    /* ISTZECEA ENTERED                 */ 01896000
*         4  ZCREECTA BIT(1),    /* ISTZECTA ENTERED                 */ 01897000
*         4  ZCREFCEA BIT(1),    /* ISTZFCEA ENTERED                 */ 01898000
*         4  ZCREFCEB BIT(1),    /* ISTZFCEB ENTERED                 */ 01899000
*         4  ZCREGCAB BIT(1),    /* ISTZGCAB ENTERED                 */ 01900000
*         4  ZCREGCBB BIT(1),    /* ISTZGCBB ENTERED                 */ 01901000
*         4  *        BIT(1),    /* NOT USED                         */ 01902000
*         4  ZCREGCDB BIT(1),    /* ISTZGCDB ENTERED                 */ 01903000
*         4  ZCREGCEB BIT(1),    /* ISTZGCEB ENTERED                 */ 01904000
*         4  ZCREGCLA BIT(1),    /* ISTZGCLA ENTERED                 */ 01905000
*         4  ZCREGC0A BIT(1),    /* ISTZGC0A ENTERED                 */ 01906000
*         4  ZCREGC0B BIT(1),    /* ISTZGC0B ENTERED                 */ 01907000
*         4  ZCREHCAN BIT(1),    /* ISTZHCAN ENTERED                 */ 01908000
*         4  ZCREICAA BIT(1),    /* ISTZICAA ENTERED                 */ 01909000
*         4  ZCREICAB BIT(1),    /* ISTZICAB ENTERED                 */ 01910000
*         4  ZCREICBB BIT(1),    /* ISTZICBB ENTERED                 */ 01911000
*         4  ZCREICBI BIT(1),    /* ISTZICBI ENTERED                 */ 01912000
*         4  ZCREICCB BIT(1),    /* ISTZICCB ENTERED                 */ 01913000
*         4  ZCREICCI BIT(1),    /* ISTZICCI ENTERED                 */ 01914000
*         4  ZCREICDB BIT(1),    /* ISTZICDB ENTERED                 */ 01915000
*         4  ZCREICEB BIT(1),    /* ISTZICEB ENTERED                 */ 01916000
*         4  ZCREICGB BIT(1),    /* ISTZICGB ENTERED                 */ 01917000
*         4  ZCREICHB BIT(1),    /* ISTZICHB ENTERED                 */ 01918000
*         4  ZCREICIB BIT(1),    /* ISTZICIB ENTERED                 */ 01919000
*         4  ZCREICID BIT(1),    /* ISTZICID ENTERED                 */ 01920000
*         4  ZCREICJB BIT(1),    /* ISTZICJB ENTERED                 */ 01921000
*         4  ZCREICKB BIT(1),    /* ISTZICKB ENTERED                 */ 01922000
*         4  ZCREICKE BIT(1),    /* ISTZICKE ENTERED                 */ 01923000
*         4  ZCREICKG BIT(1),    /* ISTZICKG ENTERED                 */ 01924000
*         4  ZCREICLB BIT(1),    /* ISTZICLB ENTERED                 */ 01925000
*         4  ZCREICMB BIT(1),    /* ISTZICMB ENTERED                 */ 01926000
*         4  ZCREICNA BIT(1),    /* ISTZICNA ENTERED                 */ 01927000
*         4  ZCREICNB BIT(1),    /* ISTZICNB ENTERED                 */ 01928000
*         4  ZCREICOA BIT(1),    /* ISTZICOA ENTERED                 */ 01929000
*         4  ZCREICOB BIT(1),    /* ISTZICOB ENTERED                 */ 01930000
*         4  ZCREICQA BIT(1),    /* ISTZICQA ENTERED                 */ 01931000
*         4  ZCREICQB BIT(1),    /* ISTZICQB ENTERED                 */ 01932000
*         4  ZCREICRB BIT(1),    /* ISTZICRB ENTERED                 */ 01933000
*         4  ZCREICSB BIT(1),    /* ISTZICSB ENTERED                 */ 01934000
*         4  ZCREICSC BIT(1),    /* ISTZICSC ENTERED                 */ 01935000
*         4  ZCREICTB BIT(1),    /* ISTZICTB ENTERED                 */ 01936000
*         4  ZCREICUB BIT(1),    /* ISTZICUB ENTERED                 */ 01937000
*         4  ZCREICVB BIT(1),    /* ISTZICVB ENTERED                 */ 01938000
*         4  ZCREICWB BIT(1),    /* ISTZICWB ENTERED                 */ 01939000
*         4  ZCREICX0 BIT(1),    /* ISTZICX0 ENTERED                 */ 01940000
*         4  ZCREIC0B BIT(1),    /* ISTZIC0B ENTERED                 */ 01941000
*         4  ZCREIC1B BIT(1),    /* ISTZIC1B ENTERED                 */ 01942000
*         4  ZCREJCAB BIT(1),    /* ISTZJCAB ENTERED                 */ 01943000
*         4  ZCREJCBB BIT(1),    /* ISTZJCBB ENTERED                 */ 01944000
*         4  ZCREJCCB BIT(1),    /* ISTZJCCB ENTERED                 */ 01945000
*         4  ZCREJCDB BIT(1),    /* ISTZJCDB ENTERED                 */ 01946000
*         4  ZCREJC0B BIT(1),    /* ISTZJC0B ENTERED                 */ 01947000
*         4  ZCREKCBB BIT(1),    /* ISTZKCBB ENTERED                 */ 01948000
*         4  ZCREKCBN BIT(1),    /* ISTZKCBN ENTERED                 */ 01949000
*         4  ZCREKCCN BIT(1),    /* ISTZKCCN ENTERED                 */ 01950000
*         4  ZCREDCWR BIT(1),    /* ISTZDCWR ENTERED                 */ 01951000
*         4  ZCREDCWB BIT(1),    /* ISTZDCWB ENTERED                 */ 01952000
*         4  ZCREDCXR BIT(1),    /* ISTZDCXR ENTERED                 */ 01953000
*         4  ZCREBCBR BIT(1),    /* ISTZBCBR ENTERED                 */ 01954000
*         4  ZCREBCDR BIT(1),    /* ISTZBCDR ENTERED                 */ 01955000
*         4  ZCREBCAR BIT(1),    /* ISTZBCAR ENTERED                 */ 01956000
*         4  ZCRECCBI BIT(1),    /* ISTZCCBI ENTERED                 */ 01957000
*         4  ZCRECCAI BIT(1),    /* ISTZCCAI ENTERED                 */ 01958000
*         4  ZCRECCCI BIT(1),    /* ISTZCCCI ENTERED                 */ 01959000
*         4  ZCREAC1R BIT(1),    /* ISTZAC1R ENTERED                 */ 01960000
*         4  ZCREBCSB BIT(1),    /* ISTZBCSB ENTERED                 */ 01961000
*         4  ZCREDCPR BIT(1),    /* ISTZDCPR ENTERED                 */ 01962000
*         4  ZCREDCQR BIT(1),    /* ISTZDCQR ENTERED                 */ 01963000
*         4  ZCREBCAL BIT(1),    /* ISTZBCAL ENTERED                 */ 01964000
*         4  ZCREBC0L BIT(1),    /* ISTZBC0L ENTERED                 */ 01965000
*         4  ZCREBCNB BIT(1),    /* ISTZBCNB ENTERED                 */ 01966000
*         4  ZCREICOE BIT(1),    /* ISTZICOE ENTERED                 */ 01967000
*         4  ZCREDCNB BIT(1),    /* ISTZDCNB ENTERED                 */ 01968000
*         4  ZCREKCCB BIT(1),    /* ISTZKCCB ENTERED                 */ 01969000
*         4  ZCRECFY0 BIT(1),    /* ISTZCFY0 ENTERED                 */ 01970000
*         4  ZCREDCK0 BIT(1),    /* ISTZDFK0 ENTERED                 */ 01971000
*         4  ZCREICSG BIT(1),    /* ISTZICSG ENTERED                 */ 01972000
*         4  ZCREBCIF BIT(1),    /* ISTZBCIF ENTERED                 */ 01973000
*         4  ZCREDCMF BIT(1),    /* ISTZDCMF ENTERED                 */ 01974000
*         4  ZCRELCAB BIT(1),    /* ISTZLCAB ENTERED                 */ 01975000
*         4  ZCREAC2B BIT(1),    /* ISTZAC2B ENTERED                 */ 01976000
*         4  ZCREIC2B BIT(1),    /* ISTZIC2B ENTERED                 */ 01977000
*         4  ZCRRSV97 BIT(97),   /* RESERVED                         */ 01978000
*   2  ZCRCMNRC CHAR(1),                /* PURGE MWOR RETURN CODE    */ 01979000
*   2  ZCRWORDA CHAR(3),                /* RESERVED FOR LATER USE    */ 01980000
*   2  ZCRLCPB  CHAR(LENGTH(ISTLCPB)),  /* 3270 S/R LCPB             */ 01981000
*      3 ZCRRHRU,                       /* SAVEAREA FOR RH AND RU    */ 01982000
*        4 ZCRRH    CHAR(3),            /* RH                        */ 01983000
*        4 ZCRRU    CHAR(*);            /* RU                        */ 01984000
*DCL ZCTYPE BIT(8) CONSTANT('00'X);   /* ZCR TYPE                   */  01985000
*DCL ZCLNG FIXED(15) CONSTANT(172);   /* ZCRR LENGTH                */  01986000
*DCL ZCRSAVNO BIT(8) CONSTANT('06'X); /* NUMBER OF SAVEAREAS IN ZCRR */ 01987000
*DCL ZCRLSVNO BIT(8) CONSTANT('04'X); /* NUMBER OF SAVE AREAS IN   0582 01988000
*                                         LOCAL SUPPORT              */ 01989000
*/* *** EQUATES FOR ZCRRCDSV *** */                                0583 01990000
*                                                                  0583 01991000
*DCL ZCRMRFSB BIT(8) CONSTANT('0C'X);  /* REQUEST COMPLETION MOVE FSB   01992000
*                                         TO PROCESS                 */ 01993000
*DCL ZCRSRCHQ BIT(8) CONSTANT('10'X);  /* REQUEST COMPLETION SEARCH     01994000
*                                         REQUEST QUEUE              */ 01995000
*DCL ZCREXIT  BIT(8) CONSTANT('14'X);  /* REQUEST COMPLETION EXIT    */ 01996000
*DCL ZCRSFSB  BIT(8) CONSTANT('18'X);  /* REQUEST COMPLETION SINGLE     01997000
*                                         FSB                        */ 01998000
*DCL ZCRDLFSB BIT(8) CONSTANT('1C'X);  /* REQUEST COMPLETION DUAL FSB * 01999000
*DCL ZCRNOSCH BIT (8) CONSTANT('20'X); /* REQUEST COMPLETION, EXIT WITH 02000000
*                                         SCHED NONE                 */ 02001000
*DCL ZCRNRSCH BIT (8) CONSTANT('24'X); /* REQUEST COMPLETION, EXIT WITH 02002000
*                                         SCHED NORM                 */ 02003000
*DCL ZCRLGERR FIXED(8) CONSTANT(8);    /* LOGICAL ERROR              */ 02004000
*DCL ZCPLSCB BIT(8) CONSTANT('08'X);   /* GET A RELEASE LSCB         */ 02005000
*DCL ZCPBUF  BIT(8) CONSTANT('04'X);   /* GET A RELEASE BUFFER       */ 02006000
*DCL ZCRTAC0A FIXED(8) CONSTANT(01);   /* LOCAL DEVICE SCHEDULER(OUT)*/ 02007000
*DCL ZCRTAC0B FIXED(8) CONSTANT(02);   /* REMOTE DEVICE SCHEDLER(OUT)*/ 02008000
*DCL ZCRTCC1A FIXED(8) CONSTANT(03);   /* LOCAL DIALOG SCHEDLER(IN)  */ 02009000
*DCL ZCRTCC1B FIXED(8) CONSTANT(04);   /* REMOTE DIALOG SCHEDLER(IN) */ 02010000
*DCL ZCRTDCE0 FIXED(8) CONSTANT(05);   /* NCP SLOWDOWN RECOVERY      */ 02011000
*DCL ZCRTDCKA FIXED(8) CONSTANT(06);   /* LOCAL GENERAL FUNCTIONS    */ 02012000
*DCL ZCRTDCKB FIXED(8) CONSTANT(07);   /* REMOTE GENERAL FUNCTIONS   */ 02013000
*DCL ZCRTFCEB FIXED(8) CONSTANT(08);   /* REMOTE READ BUFFER ALLOC.  */ 02014000
*DCL ZCRTGCLA FIXED(8) CONSTANT(09);   /* LCAL CTL & TEST FEEDBACK(IN)* 02015000
*DCL ZCRTGC0A FIXED(8) CONSTANT(10);   /* LOCAL REQ. COMPLETION(IN)  */ 02016000
*DCL ZCRTGC0B FIXED(8) CONSTANT(11);   /* REMOTE REQ. COMPLETION(IN) */ 02017000
*DCL ZCRTICWB FIXED(8) CONSTANT(12);   /* RESET CLEANUP (PHASE 5)    */ 02018000
*DCL ZCRTIC0B FIXED(8) CONSTANT(13);   /* REMOTE REQ COMPLTION CTL(IN)* 02019000
*DCL ZCRTAC1B FIXED(8) CONSTANT(14);   /* ISTZAC1B THREAD ID         */ 02020000
*DCL ZCRTIC1B FIXED(8) CONSTANT(15);   /* ISTZIC1B THREAD ID         */ 02021000
*DCL ZCRTCCBI FIXED(8) CONSTANT(16);   /* ISTZCCBI THREAD ID         */ 02022000
*DCL ZCRTAC1R FIXED(8) CONSTANT(17);   /* ISTZAC1R THREAD ID         */ 02023000
*DCL ZCRTAC1A FIXED(8) CONSTANT(18);   /* ISTZAC1A THREAD ID         */ 02024000
*DCL ZCRTLCAB FIXED(8) CONSTANT(19);   /* ISTZLCAB THREAD ID         */ 02025000
*/* COMPONENT RECOVERY                                               */ 02026000
*/*                                                                  */ 02027000
*DCL 1 ISTASCRR BDY(WORD) BASED,        /* CRR FOR SMS               */ 02028000
*     2  ASCPFCRR CHAR(LENGTH(ISTPFCRR)),                          0612 02029000
*     2  ASCFLAGS CHAR(7),              /* FLAGS                     */ 02030000
*        3  ASCFLG1 CHAR(2),            /* MODULE TRACE FLAGS        */ 02031000
*           4  ASCFBA BIT(1),           /* ALLOCATION IN PATH        */ 02032000
*           4  ASCFBD BIT(1),           /* DE-ALLOCATION IN PATH     */ 02033000
*           4  ASCFSR BIT(1),           /* FSR IN PATH               */ 02034000
*           4  ASCPASTR BIT(13),        /* RESERVED PATH FLAGS       */ 02035000
*        3  ASCFLG2 CHAR(2),            /* MODULE IN CONTROL FLAGS   */ 02036000
*           4  ASCFBAIC BIT(1),         /* ALLOCATION IN CONTROL     */ 02037000
*           4  ASCFBDIC BIT(1),         /* DE-ALLOCATION IN CONTROL  */ 02038000
*           4  ASCFSRIC BIT(1),         /* FSR IN CONTROL            */ 02039000
*           4  ASCICR BIT(13),          /* RESERVED IN CONTROL FLAGS */ 02040000
*        3  ASCFLG3 CHAR(3),            /* AUDIT FLAGS               */ 02041000
*           4  ASCFSRGT BIT(1),         /* FSR DOING GET PROCESSING  */ 02042000
*           4  ASCFBDAL BIT(1),         /* FBD DOING ALLOCATION      */ 02043000
*           4  ASCKEYF BIT(1),          /* KEY HAS BEEN ALTERED      */ 02044000
*           4  ASCLLKF BIT(1),          /* LOCAL LOCK HELD           */ 02045000
*           4  ASCFBDUD BIT(1),         /* FBD USING USER DATA       */ 02046000
*           4  ASCAUDIT BIT(19),        /* RESERVED AUDIT BITS       */ 02047000
*     2  ASCKEY CHAR(1),                /* ORIGINAL KEY              */ 02048000
*     2  ASCETRYA PTR(31),              /* RETRY ADRS FOR CONTINUE 0612 02049000
*                                          OPTION                    */ 02050000
*     2  ASCUSRGS CHAR(16),             /* SAVE AREA FOR USER REGS 0612 02051000
*                                          14 - 1                    */ 02052000
*        3  ASCUSR14 CHAR(4),           /* REGISTER 14               */ 02053000
*        3  ASCUSR15 CHAR(4),           /* REGISTER 15               */ 02054000
*        3  ASCUSR00 CHAR(4),           /* REGISTER 0                */ 02055000
*        3  ASCUSR01 CHAR(4),           /* REGISTER 1                */ 02056000
*     2  ASCPSREG CHAR(16);             /* SAVE AREA FOR PSS       0612 02057000
*                                          REGS 1 - 4                */ 02058000
*/*  INITIAL LEVEL                                      001 04/09/75 */ 02059000
*DCL 1 ISTAPCRR BDY(WORD) BASED,                                   0613 02060000
*     2 APCHDRSV CHAR(LENGTH(ISTPFCRR)),  /* HEADER                  */ 02061000
*     2  APCATFLG CHAR(2),              /* AUDIT TRACE FLAGS         */ 02062000
*        3  APC51E BIT(1),              /* ISTAPC51 WAS ENTERED      */ 02063000
*        3  APC52E BIT(1),              /* ISTAPC52  '     '         */ 02064000
*        3  APC53E BIT(1),              /* ISTAPC53                  */ 02065000
*        3  APC54E BIT(1),                                         0613 02066000
*        3  APC56E BIT(1),                                         0613 02067000
*        3  APC57E BIT(1),                                         0613 02068000
*        3  APC58E BIT(1),                                         0613 02069000
*        3  APC31E BIT(1),                                         0613 02070000
*        3 * BIT(8),                    /* RESERVED                  */ 02071000
*     2  APCRFLG CHAR(2),               /* AUDIT TRACE FLAGS         */ 02072000
*        3  APC51R BIT(1),              /* ISTAPCR1 IS RUNNING       */ 02073000
*        3  APC52R BIT(1),              /* ISTAPC52 IS RUNNING       */ 02074000
*        3  APC53R BIT(1),                                         0613 02075000
*        3  APC54R BIT(1),                                         0613 02076000
*        3  APC56R BIT(1),                                         0613 02077000
*        3  APC57R BIT(1),                                         0613 02078000
*        3  APC58R BIT(1),                                         0613 02079000
*        3  APC31R BIT(1),                                         0613 02080000
*        3  *      BIT(8),              /* RESERVED                  */ 02081000
*     2  APCPSTA PTR(31),               /* PST@                      */ 02082000
*     2  APCTCBA PTR(31),               /* TCB@                      */ 02083000
*     2  APCRTRN PTR(31),               /*@ TO BR14 TO RTN TO SYSTEM */ 02084000
*     2  APCPABSV PTR(31),              /*SAVED PAB@ TO REDISPATCH   */ 02085000
*     2  APCQWFO PTR(31),               /* Q@ IN PST WORK AREA ON    */ 02086000
*     2  APCFRRPM PTR(31),              /* WORKAREA@ RTN'D FROM SETFR*/ 02087000
*     2  APCSAVE CHAR(72),                                         0613 02088000
*        3  APCESTAL CHAR(72),          /* ESTAE PARAMETER LIST AREA */ 02089000
*     2  APCCOMF CHAR(4) BDY(HWORD),    /* FLAGS USED BY ALL PSS RTN */ 02090000
*        3  APCCOMF1 CHAR(2),                                      0613 02091000
*           4  APCSSTSK BIT(1),         /* IRB TYPE WORK             */ 02092000
*           4  APCUETSK BIT(1),         /* USER EXIT RUNNING UNDER IRB* 02093000
*           4  APCSMCR BIT(1),          /* SMA CRA BEING USED        */ 02094000
*           4  APCIRB1 BIT(1),          /* IRB1 BEING USED           */ 02095000
*           4  APCIRB2 BIT(1),          /* IRB2 BEING USED           */ 02096000
*           4  APCRELR BIT(1),          /*CALL ISTAPC58 TO RLEASE CRA*/ 02097000
*           4  APCEXIT BIT(1),          /* TELLS ISTAPC58 TO EXIT SYS*/ 02098000
*           4  APCZLBER BIT(1),         /* ERR WHILE RUNNING ZLFAB PAB* 02099000
*           4  * BIT(8),                /* RESERVED                  */ 02100000
*        3  APCRETCD FIXED(15),         /* RTN CODE FOR R15 FOR SYS  */ 02101000
*     2  APCSAV1 PTR(31),               /* 1ST SAVE WORD             */ 02102000
*     2  APCSAV2 PTR(31),               /* 2ND SAVE WORD             */ 02103000
*     2  APCSWTWD CHAR(4),              /* SWITCH AREA FOR PSS RTN   */ 02104000
*     2  APC31FLG CHAR(1),              /* ISTAPC31 FLAGS            */ 02105000
*        3  APCTPXIT BIT(1),            /* TPEXIT IN PROGRESS        */ 02106000
*        3  APCRESCH BIT(1),            /*PAB TPEXIT OCCURED  RESCHED*/ 02107000
*        3  APCSORT BIT(1),       /* PAB SORTED TO PROPER PST/MPST   */ 02108000
*        3  *       BIT(5),       /* RESERVED                        */ 02109000
*     2  APC52FLG CHAR(1),        /* ISTAPC52 FLAGS                  */ 02110000
*        3  APCCKRQ BIT(1),       /* CHECK RDY Q FOR WORK            */ 02111000
*        3  APCSMSR BIT(1),       /* RETURNING SMS RPH               */ 02112000
*        3  APCQENQ BIT(1),       /* ENQUEUEING PAB'S ON PST Q'S     */ 02113000
*        3  APCRDQ BIT(1),        /* DEQUEING PAB'S FROM PST RDY Q   */ 02114000
*        3  APCNWF BIT(1),        /* NO WORK FOUND                   */ 02115000
*        3  APCWKF   BIT(1),      /* WORK FOUND                      */ 02116000
*        3    *      BIT(2),      /* RESERVED                        */ 02117000
*     2  APC53FLG CHAR(1),        /* ISTAPC53 FLAGS                  */ 02118000
*        3  APCPR153 BIT(1),      /* USED PREALLOCATED CRA           */ 02119000
*     2  APC54FLG CHAR(1),        /* ISTAPC54 FLAGS                  */ 02120000
*        3  APCRLST BIT(1),       /* SMS BEING CALLED TO RELEASE UECB*/ 02121000
*        3  * BIT(7),             /* RESERVED                        */ 02122000
*     2  APC57FLG CHAR(1),        /* ISTAPC57 FLAGS                  */ 02123000
*        3  APCRECRA BIT(1),      /* RELEASE CRA BEING DONE          */ 02124000
*        3  APCNREL BIT(1),       /* DID NOT RELEASE CRA             */ 02125000
*        3  *   BIT(6),           /* RESERVED                        */ 02126000
*     2  * CHAR(15);              /* RESERVED                        */ 02127000
*/*               COMPONENT RECOVERY AREA                            */ 02128000
*/*  REVISIONS                                         005 04/09/75  */ 02129000
*DCL 1  ISTCRA BASED BDY(DWORD),        /* COMPONENT RECOVERY AREA   */ 02130000
*     2  CRABASIC BDY(WORD),            /* CRA WITHOUT PROCESS CRR   */ 02131000
*      3 CRAHDR CHAR(8) BDY(WORD),      /* CRA HEADER                */ 02132000
*        4  CRACRR PTR(31),             /* PTR TO ACTIVE CRR         */ 02133000
*        4  CRAFRR PTR(31),             /* PTR TO ACTIVE FRR         */ 02134000
*      3 CRALKACT BIT(32),              /* LOCK LEVEL AND          0614 02135000
*                                          OWNERSHIP FLAGS           */ 02136000
*        4  CRALEV32 BIT(1),            /* 1 = LEVEL 32 LOCK HELD    */ 02137000
*        4  CRALEV31 BIT(1),            /* 1 = LEVEL 31 LOCK HELD    */ 02138000
*        4  CRALEV30 BIT(1),            /* 1 = LEVEL 30 LOCK HELD    */ 02139000
*        4  CRALEV29 BIT(1),            /* 1 = LEVEL 29 LOCK HELD    */ 02140000
*        4  CRALEV28 BIT(1),            /* 1 = LEVEL 28 LOCK HELD    */ 02141000
*        4  CRALEV27 BIT(1),            /* 1 = LEVEL 27 LOCK HELD    */ 02142000
*        4  CRALEV26 BIT(1),            /* 1 = LEVEL 26 LOCK HELD    */ 02143000
*        4  CRALEV25 BIT(1),            /* 1 = LEVEL 25 LOCK HELD    */ 02144000
*        4  CRALEV24 BIT(1),            /* 1 = LEVEL 24 LOCK HELD    */ 02145000
*        4  CRALEV23 BIT(1),            /* 1 = LEVEL 23 LOCK HELD    */ 02146000
*        4  CRALEV22 BIT(1),            /* 1 = LEVEL 22 LOCK HELD    */ 02147000
*        4  CRALEV21 BIT(1),            /* 1 = LEVEL 21 LOCK HELD    */ 02148000
*        4  CRALEV20 BIT(1),            /* 1 = LEVEL 20 LOCK HELD    */ 02149000
*        4  CRALEV19 BIT(1),            /* 1 = LEVEL 19 LOCK HELD    */ 02150000
*        4  CRALEV18 BIT(1),            /* 1 = LEVEL 18 LOCK HELD    */ 02151000
*        4  CRALEV17 BIT(1),            /* 1 = LEVEL 17 LOCK HELD    */ 02152000
*        4  CRALEV16 BIT(1),            /* 1 = LEVEL 16 LOCK HELD    */ 02153000
*        4  CRALEV15 BIT(1),            /* 1 = LEVEL 15 LOCK HELD    */ 02154000
*        4  CRALEV14 BIT(1),            /* 1 = LEVEL 14 LOCK HELD    */ 02155000
*        4  CRALEV13 BIT(1),            /* 1 = LEVEL 13 LOCK HELD    */ 02156000
*        4  CRALEV12 BIT(1),            /* 1 = LEVEL 12 LOCK HELD    */ 02157000
*        4  CRALEV11 BIT(1),            /* 1 = LEVEL 11 LOCK HELD    */ 02158000
*        4  CRALEV10 BIT(1),            /* 1 = LEVEL 10 LOCK HELD    */ 02159000
*        4  CRALEV09 BIT(1),            /* 1 = LEVEL 9 LOCK HELD     */ 02160000
*        4  CRALEV08 BIT(1),            /* 1 = LEVEL 8 LOCK HELD     */ 02161000
*        4  CRALEV07 BIT(1),            /* 1 = LEVEL 7 LOCK HELD     */ 02162000
*        4  CRALEV06 BIT(1),            /* 1 = LEVEL 6 LOCK HELD     */ 02163000
*        4  CRALEV05 BIT(1),            /* 1 = LEVEL 5 LOCK HELD     */ 02164000
*        4  CRALEV04 BIT(1),            /* 1 = LEVEL 4 LOCK HELD     */ 02165000
*        4  CRALEV03 BIT(1),            /* 1 = LEVEL 3 LOCK HELD     */ 02166000
*        4  CRALEV02 BIT(1),            /* 1 = LEVEL 2 LOCK HELD     */ 02167000
*        4  CRALEV01 BIT(1),            /* 1 = LEVEL 1 LOCK HELD     */ 02168000
*      3 CRAL1PTR PTR(31),              /* PTR TO LEVEL 1 LOCK       */ 02169000
*      3 CRAL2PTR PTR(31),              /* PTR TO LEVEL 2 LOCK       */ 02170000
*      3 CRAL3PTR PTR(31),              /* PTR TO LEVEL 3 LOCK       */ 02171000
*      3 CRAL4PTR PTR(31),              /* PTR TO LEVEL 4 LOCK       */ 02172000
*      3 CRAL5PTR PTR(31),              /* PTR TO LEVEL 5 LOCK       */ 02173000
*      3 CRAL6PTR PTR(31),              /* PTR TO LEVEL 6 LOCK       */ 02174000
*      3 CRAL7PTR PTR(31),              /* PTR TO LEVEL 7 LOCK       */ 02175000
*      3 CRAL8PTR PTR(31),              /* PTR TO LEVEL 8 LOCK       */ 02176000
*      3 CRAL9PTR PTR(31),              /* PTR TO LEVEL 9 LOCK       */ 02177000
*      3 CRALAPTR PTR(31),              /* RESERVED                  */ 02178000
*/*                                                                  */ 02179000
*/*   VS1/VS2 EXTENSION                                              */ 02180000
*/*                                                                  */ 02181000
*     2  CRARPH CHAR(LENGTH(ISTRPH)),   /* RPH ASSOCIATED WITH     0614 02182000
*                                          THIS CRH                  */ 02183000
*     2  CRAPSS CHAR(LENGTH(ISTAPCRR)), /* PSS CRR                   */ 02184000
*     2  CRAPROCR CHAR(LENGTH(ISTZCRR)) BDY(DWORD), /* PROCESS CRR   */ 02185000
*     2  CRASVC CHAR(72) BDY(WORD),     /* SERVICE RTN CRA           */ 02186000
*        3  CRAASCRR CHAR(LENGTH(ISTASCRR)), /* CRR FOR SMS          */ 02187000
*        3  CRAHSIZ  PTR(31),           /* HEADER SIZE QUED SMS REQ  */ 02188000
*        3  CRAMASK  PTR(31),           /* PREFIX MASK QUED SMS REQ  */ 02189000
*        3  CRABUFA  FIXED(31),         /* BUFF QUE FOR FBQ ALLOCATION* 02190000
*           4 CRABFTBA BIT(1),          /* NO BUFFERS ALLOCATED YET   * 02191000
*     2  CRARSV01 PTR(31),              /* RESERVED                  */ 02192000
*     2  CRARSV02 PTR(31),              /* RESERVED                  */ 02193000
*     2  CRACHAIN PTR(31);              /* CHAIN FIELD USED TO QUEUE    02194000
*                                          CRA TO PREALLOCATE QUEUE     02195000
*                                          WHEN NOT IN USE           */ 02196000
*DCL CRALMS32 BIT(32) CONSTANT('80000000'X); /* 32ND LEVEL LOCK MASK */ 02197000
*DCL CRALMS31 BIT(32) CONSTANT('40000000'X); /* 31ST LEVEL LOCK MASK */ 02198000
*DCL CRALMS30 BIT(32) CONSTANT('20000000'X); /* 30TH LEVEL LOCK MASK */ 02199000
*DCL CRALMS29 BIT(32) CONSTANT('10000000'X); /* 29TH LEVEL LOCK MASK */ 02200000
*DCL CRALMS28 BIT(32) CONSTANT('08000000'X); /* 28TH LEVEL LOCK MASK */ 02201000
*DCL CRALMS27 BIT(32) CONSTANT('04000000'X); /* 27TH LEVEL LOCK MASK */ 02202000
*DCL CRALMS26 BIT(32) CONSTANT('02000000'X); /* 26TH LEVEL LOCK MASK */ 02203000
*DCL CRALMS25 BIT(32) CONSTANT('01000000'X); /* 25TH LEVEL LOCK MASK */ 02204000
*DCL CRALMS24 BIT(32) CONSTANT('00800000'X); /* 24TH LEVEL LOCK MASK */ 02205000
*DCL CRALMS23 BIT(32) CONSTANT('00400000'X); /* 23RD LEVEL LOCK MASK */ 02206000
*DCL CRALMS22 BIT(32) CONSTANT('00200000'X); /* 22ND LEVEL LOCK MASK */ 02207000
*DCL CRALMS21 BIT(32) CONSTANT('00100000'X); /* 21ST LEVEL LOCK MASK */ 02208000
*DCL CRALMS20 BIT(32) CONSTANT('00080000'X); /* 20TH LEVEL LOCK MASK */ 02209000
*DCL CRALMS19 BIT(32) CONSTANT('00040000'X); /* 19TH LEVEL LOCK MASK */ 02210000
*DCL CRALMS18 BIT(32) CONSTANT('00020000'X); /* 18TH LEVEL LOCK MASK */ 02211000
*DCL CRALMS17 BIT(32) CONSTANT('00010000'X); /* 17TH LEVEL LOCK MASK */ 02212000
*DCL CRALMS16 BIT(32) CONSTANT('00008000'X); /* 16TH LEVEL LOCK MASK */ 02213000
*DCL CRALMS15 BIT(32) CONSTANT('00004000'X); /* 15TH LEVEL LOCK MASK */ 02214000
*DCL CRALMS14 BIT(32) CONSTANT('00002000'X); /* 14TH LEVEL LOCK MASK */ 02215000
*DCL CRALMS13 BIT(32) CONSTANT('00001000'X); /* 13TH LEVEL LOCK MASK */ 02216000
*DCL CRALMS12 BIT(32) CONSTANT('00000800'X); /* 12TH LEVEL LOCK MASK */ 02217000
*DCL CRALMS11 BIT(32) CONSTANT('00000400'X); /* 11TH LEVEL LOCK MASK */ 02218000
*DCL CRALMS10 BIT(32) CONSTANT('00000200'X); /* 10TH LEVEL LOCK MASK */ 02219000
*DCL CRALMS09 BIT(32) CONSTANT('00000100'X); /* 9TH LEVEL LOCK MASK  */ 02220000
*DCL CRALMS08 BIT(32) CONSTANT('00000080'X); /* 8TH LEVEL LOCK MASK  */ 02221000
*DCL CRALMS07 BIT(32) CONSTANT('00000040'X); /* 7TH LEVEL LOCK MASK  */ 02222000
*DCL CRALMS06 BIT(32) CONSTANT('00000020'X); /* 6TH LEVEL LOCK MASK  */ 02223000
*DCL CRALMS05 BIT(32) CONSTANT('00000010'X); /* 5TH LEVEL LOCK MASK  */ 02224000
*DCL CRALMS04 BIT(32) CONSTANT('00000008'X); /* 4TH LEVEL LOCK MASK  */ 02225000
*DCL CRALMS03 BIT(32) CONSTANT('00000004'X); /* 3RD LEVEL LOCK MASK  */ 02226000
*DCL CRALMS02 BIT(32) CONSTANT('00000002'X); /* 2ND LEVEL LOCK MASK  */ 02227000
*DCL CRALMS01 BIT(32) CONSTANT('00000001'X); /* 1ST LEVEL LOCK MASK  */ 02228000
*DCL CRACRA   CHAR(4) CONSTANT('CRA ');      /* CHARACTER C.B. ID    */ 02229000
* /*  CONNECTION SERVICES COMPONENT RECOVERY RECORD                  */ 02230000
* /* COMPLETED DCR SOLUTIONS                                         */ 02231000
* /* 1H0540 APRIL 28, 1973 MB                                        */ 02232000
*/* ZTR4417 JUNE 20, 73 DNM */                                     0648 02233000
* DCL 1 ISTCNSTA BDY(WORD) BASED,       /* CONNECTION SERVICES     0648 02234000
*                                          COMPONENT RECOVERY RECORD */ 02235000
*     2  CNSTPFX CHAR(LENGTH(ISTPFCRR)), /* STANDARD PREFIX        0648 02236000
*                                          FOR CRR                   */ 02237000
*     2  CNSTFLDA CHAR(3),              /* TRACE FIELD A - HISTORY   */ 02238000
*        3  CNSMRINA BIT(1),            /* MASTER ENTERED            */ 02239000
*        3  CNSAUTHA BIT(1),            /* ABOUT TO CALL AUTHORI-  0648 02240000
*                                          SATION EXIT       ZTR4417 */ 02241000
*        3  CNSAQINA BIT(1),            /* ACQUIRE ENTERED           */ 02242000
*        3  CNSXREQA BIT(1),            /* ACQUIRE SATISFIED         */ 02243000
*        3  CNSQREQA BIT(1),            /* ACQUIRE QUEUED            */ 02244000
*        3  CNSRLINA BIT(1),            /* RELEASE ENTERED           */ 02245000
*        3  CNSDORLA BIT(1),            /* DOREL REALLOCATION      0648 02246000
*                                          ENTERED                   */ 02247000
*        3  CNSTRRLA BIT(1),            /* RELEASE OF ACTIVE       0648 02248000
*                                          CONNECTION                */ 02249000
*        3  CNSRQRLA BIT(1),            /* RELEASE QUEUED REQUEST    */ 02250000
*        3  CNSPSINA BIT(1),            /* PASS ENTERED              */ 02251000
*        3  CNSACINA BIT(1),            /* ACCEPT ENTERED            */ 02252000
*        3  CNSLGINA BIT(1),            /* LOGON ENTERED             */ 02253000
*        3  CNSGBINA BIT(1),            /* PREEMPT ENTERED           */ 02254000
*        3  CNSCLINA BIT(1),            /* CANCEL ENTERED            */ 02255000
*        3  CNSCLAQA BIT(1),            /* CANCEL ACQUIRES           */ 02256000
*        3  CNSTCONA BIT(1),            /* TCONNECT                  */ 02257000
*        3  CNSACONA BIT(1),            /* ACONNECT                  */ 02258000
*        3  CNSQUEUA BIT(1),            /* QUEUE                     */ 02259000
*        3  CNSSEARA BIT(1),            /* SEARCH Q                  */ 02260000
*        3  CNSGETSA BIT(1),            /* CONNECTION SERVICES     0648 02261000
*                                          GETSTORE                  */ 02262000
*        3  CNSFREEA BIT(1),            /* CONNECTION SERVICES     0648 02263000
*                                          FREESTORE                 */ 02264000
*        3  CNSACCTA BIT(1),            /* ABOUT TO CALL           0648 02265000
*                                          ACCOUNTING EXIT           */ 02266000
*        3  CNSLOG0A BIT(1),            /* LOGON 0                   */ 02267000
*        3  CNSRSV01 BIT(1),            /* RESERVED                  */ 02268000
*     2  CNSTFLDB CHAR(3),              /* TRACE FIELD B -         0648 02269000
*                                          CURRENT ACTIVITY          */ 02270000
*        3  CNSMRINB BIT(1),                                       0648 02271000
*        3  CNSAUTHB BIT(1),                                       0648 02272000
*        3  CNSAQINB BIT(1),                                       0648 02273000
*        3  CNSXREQB BIT(1),                                       0648 02274000
*        3  CNSQREQB BIT(1),                                       0648 02275000
*        3  CNSRLINB BIT(1),                                       0648 02276000
*        3  CNSDORLB BIT(1),                                       0648 02277000
*        3  CNSTRRLB BIT(1),                                       0648 02278000
*        3  CNSRQRLB BIT(1),                                       0648 02279000
*        3  CNSPSINB BIT(1),                                       0648 02280000
*        3  CNSACINB BIT(1),                                       0648 02281000
*        3  CNSLGINB BIT(1),                                       0648 02282000
*        3  CNSGBINB BIT(1),                                       0648 02283000
*        3  CNSCLINB BIT(1),                                       0648 02284000
*        3  CNSCLAQB BIT(1),                                       0648 02285000
*        3  CNSTCONB BIT(1),                                       0648 02286000
*        3  CNSACONB BIT(1),                                       0648 02287000
*        3  CNSQUEUB BIT(1),                                       0648 02288000
*        3  CNSSEARB BIT(1),                                       0648 02289000
*        3  CNSGETSB BIT(1),                                       0648 02290000
*        3  CNSFREEB BIT(1),                                       0648 02291000
*        3  CNSACCTB BIT(1),                                       0648 02292000
*        3  CNSLOG0B BIT(1),                                       0648 02293000
*        3  CNSRSV05 BIT(1);                                       0648 02294000
*/*    CRR FOR VARY                                                  */ 02295000
*/*  REVISIONS                                         009 03/24/75  */ 02296000
*/*                                                                  */ 02297000
* DCL 1 ISTVYCRR BDY(WORD) BASED,       /* CRR FOR SSCP              */ 02298000
*     2  VYCCNS   CHAR(LENGTH(ISTCNSTA)), /* RESERVE SPACE FOR     0649 02299000
*                                          CONN. SVCS. AUDIT         */ 02300000
*     2  VYCAUDIT,                      /* AUDIT TRAIL FOR SSCP      */ 02301000
*        3  VYCNTRD CHAR(12),           /* LIST OF MODULES IN SSCP   */ 02302000
*                                       /* 1 = ENTERED               */ 02303000
*           4  NINCCL BIT(1),           /* MODULE = ISTINCCL         */ 02304000
*           4  NINCIO BIT(1),           /* MODULE = ISTINCIO         */ 02305000
*           4  NINCDL BIT(1),           /* MODULE = ISTINCDL         */ 02306000
*           4  NINCMY BIT(1),           /* MODULE = ISTINCMY         */ 02307000
*           4  NINCMD BIT(1),           /* MODULE = ISTINCMD         */ 02308000
*           4  NINCVI BIT(1),           /* MODULE = ISTINCVI         */ 02309000
*           4  NINCVA BIT(1),           /* MODULE = ISTINCVA         */ 02310000
*           4  NINCLF BIT(1),           /* MODULE = ISTINCLF         */ 02311000
*           4  NINCR1 BIT(1),           /* MODULE = ISTINCR1         */ 02312000
*           4  NINCSM BIT(1),           /* MODULE = ISTINCSM         */ 02313000
*           4  NINCFS BIT(1),           /* MODULE = ISTINCFS         */ 02314000
*           4  NINCVX BIT(1),           /* MODULE = ISTINCVX         */ 02315000
*           4  NINCVP BIT(1),           /* MODULE = ISTINCVP         */ 02316000
*           4  NINCVS BIT(1),           /* MODULE = ISTINCVS         */ 02317000
*           4  NINCVN BIT(1),           /* MODULE = ISTINCVO         */ 02318000
*           4  NINCMS BIT(1),           /* MODULE = ISTINCMS         */ 02319000
*           4  NINCR2 BIT(1),           /* MODULE = ISTINCR2         */ 02320000
*           4  NINCIP BIT(1),           /* MODULE = ISTINCIP         */ 02321000
*           4  NINCD1 BIT(1),           /* MODULE = ISTINCD1         */ 02322000
*           4  NINCD2 BIT(1),           /* MODULE = ISTINCD2         */ 02323000
*           4  NINCD3 BIT(1),           /* MODULE = ISTINCD3         */ 02324000
*           4  NINCD4 BIT(1),           /* MODULE = ISTINCD4         */ 02325000
*           4  NINCD5 BIT(1),           /* MODULE = ISTINCD5         */ 02326000
*           4  NINCD6 BIT(1),           /* MODULE = ISTINCD6         */ 02327000
*           4  NINCD7 BIT(1),           /* MODULE = ISTINCD7         */ 02328000
*           4  NINCD8 BIT(1),           /* MODULE = ISTINCD8         */ 02329000
*           4  NINCD9 BIT(1),           /* MODULE = ISTINCD9         */ 02330000
*           4  NINCE0 BIT(1),           /* MODULE = ISTINCE0         */ 02331000
*           4  NINCE2 BIT(1),           /* MODULE = ISTINCE2         */ 02332000
*           4  NINCE3 BIT(1),           /* MODULE = ISTINCE3         */ 02333000
*           4  NINCE4 BIT(1),           /* MODULE = ISTINCE4         */ 02334000
*           4  NINCFM BIT(1),           /* MODULE = ISTINCFM         */ 02335000
*           4  NINCF1 BIT(1),           /* MODULE = ISTINCF1         */ 02336000
*           4  NINCF3 BIT(1),           /* MODULE = ISTINCF3         */ 02337000
*           4  NINCF4 BIT(1),           /* MODULE = ISTINCF4         */ 02338000
*           4  NINCL0 BIT(1),           /* MODULE = ISTINCL0         */ 02339000
*           4  NINCL1 BIT(1),           /* MODULE = ISTINCL1         */ 02340000
*           4  NINCL2 BIT(1),           /* MODULE = ISTINCL2         */ 02341000
*           4  NINCL3 BIT(1),           /* MODULE = ISTINCL3         */ 02342000
*           4  NINCL4 BIT(1),           /* MODULE = ISTINCL4         */ 02343000
*           4  NINCL5 BIT(1),           /* MODULE = ISTINCL5         */ 02344000
*           4  NINCL6 BIT(1),           /* MODULE = ISTINCL6         */ 02345000
*           4  NINCL7 BIT(1),           /* MODULE = ISTINCL7         */ 02346000
*           4  NINCL8 BIT(1),           /* MODULE = ISTINCL8         */ 02347000
*           4  NINCS1 BIT(1),           /* MODULE = ISTINCS1         */ 02348000
*           4  NINCUM BIT(1),           /* MODULE = ISTINCUM         */ 02349000
*           4  NINCU0 BIT(1),           /* MODULE = ISTINCU0          * 02350000
*           4  NINCU1 BIT(1),           /* MODULE = ISTINCU1         */ 02351000
*           4  NINCU2 BIT(1),           /* MODULE = ISTINCU2         */ 02352000
*           4  NINCU3 BIT(1),           /* MODULE = ISTINCU3         */ 02353000
*           4  NINCU4 BIT(1),           /* MODULE = ISTINCU4         */ 02354000
*           4  NINCU5 BIT(1),           /* MODULE = ISTINCU5         */ 02355000
*           4  NINCU6 BIT(1),           /* MODULE = ISTINCU6         */ 02356000
*           4  NINCU7 BIT(1),           /* MODULE = ISTINCU7         */ 02357000
*           4  NINCU8 BIT(1),           /* MODULE = ISTINCU8         */ 02358000
*           4  NINCV2 BIT(1),           /* MODULE = ISTINCV2         */ 02359000
*           4  NINCV3 BIT(1),           /* MODULE = ISTINCV3         */ 02360000
*           4  NINCV4 BIT(1),           /* MODULE = ISTINCV4         */ 02361000
*           4  NINCV5 BIT(1),           /* MODULE = ISTINCV5         */ 02362000
*           4  NINCV6 BIT(1),           /* MODULE = ISTINCV6         */ 02363000
*           4  NINCV7 BIT(1),           /* MODULE = ISTINCV7         */ 02364000
*           4  NINCV8 BIT(1),           /* MODULE = ISTINCV8         */ 02365000
*           4  NINCV9 BIT(1),           /* MODULE = ISTINCV9         */ 02366000
*           4  NINCW0 BIT(1),           /* MODULE = ISTINCW0         */ 02367000
*           4  NINCW2 BIT(1),           /* MODULE = ISTINCW2         */ 02368000
*           4  NINCW4 BIT(1),           /* MODULE = ISTINCW4         */ 02369000
*           4  NINCW5 BIT(1),           /* MODULE = ISTINCW5         */ 02370000
*           4  NINCW6 BIT(1),           /* MODULE = ISTINCW6         */ 02371000
*           4  NINCW7 BIT(1),           /* MODULE = ISTINCW7         */ 02372000
*           4  NINCW8 BIT(1),           /* MODULE = ISTINCW8         */ 02373000
*           4  NINCW9 BIT(1),           /* MODULE = ISTINCW9         */ 02374000
*           4  NINCX0 BIT(1),           /* MODULE = ISTINCX0         */ 02375000
*           4  NINCX1 BIT(1),           /* MODULE = ISTINCX1         */ 02376000
*           4  NINCX2 BIT(1),           /* MODULE = ISTINCX2         */ 02377000
*           4  NINCX3 BIT(1),           /* MODULE = ISTINCX3         */ 02378000
*           4  NINCX6 BIT(1),           /* MODULE = ISTINCX6         */ 02379000
*           4  NINCX7 BIT(1),           /* MODULE = ISTINCX7         */ 02380000
*           4  NINCX8 BIT(1),           /* MODULE = ISTINCX8         */ 02381000
*           4  NINCX9 BIT(1),           /* MODULE = ISTINCX9         */ 02382000
*           4  NINCUA BIT(1),           /* MODULE = ISTINCUA         */ 02383000
*           4  NINCUB BIT(1),           /* MODULE = ISTINCUB         */ 02384000
*           4  NINCUQ BIT(1),           /* MODULE = ISTINCUQ         */ 02385000
*           4  NINCE1 BIT(1),           /* MODULE = ISTINCE1         */ 02386000
*           4  NINCE5 BIT(1),           /* MODULE = ISTINCE5         */ 02387000
*           4  NINCE6 BIT(1),           /* MODULE = ISTINCE6         */ 02388000
*           4  NINCE7 BIT(1),           /* MODULE = ISTINCE7         */ 02389000
*           4  NINCE8 BIT(1),           /* MODULE = ISTINCE8         */ 02390000
*           4  NINCR3 BIT(1),           /* MODULE = ISTINCR3         */ 02391000
*           4  NINCR5 BIT(1),           /* MODULE = ISTINCR5         */ 02392000
*           4  NINCVO BIT(1),           /* MODULE = ISTINCVO         */ 02393000
*           4  NINCE9 BIT(1),           /* MODULE = ISTINCE9         */ 02394000
*           4  NINCFE BIT(1),           /* MODULE = ISTINCFE         */ 02395000
*           4  VYCRSV01 BIT(4),         /* RESERVED                  */ 02396000
*        3  VYCCRT CHAR(12),            /* LIST OF SSCP MODULES      */ 02397000
*                                       /* 2 =  RUNNING              */ 02398000
*           4  CINCCL BIT(1),           /* MODULE = ISTINCCL         */ 02399000
*           4  CINCIO BIT(1),           /* MODULE = ISTINCIO         */ 02400000
*           4  CINCDL BIT(1),           /* MODULE = ISTINCDL         */ 02401000
*           4  CINCMY BIT(1),           /* MODULE = ISTINCMY         */ 02402000
*           4  CINCMD BIT(1),           /* MODULE = ISTINCMD         */ 02403000
*           4  CINCVI BIT(1),           /* MODULE = ISTINCVI         */ 02404000
*           4  CINCVA BIT(1),           /* MODULE = ISTINCVA         */ 02405000
*           4  CINCLF BIT(1),           /* MODULE = ISTINCLF         */ 02406000
*           4  CINCR1 BIT(1),           /* MODULE = ISTINCR1         */ 02407000
*           4  CINCSM BIT(1),           /* MODULE = ISTINCSM         */ 02408000
*           4  CINCFS BIT(1),           /* MODULE = ISTINCFS         */ 02409000
*           4  CINCVX BIT(1),           /* MODULE = ISTINCVX         */ 02410000
*           4  CINCVP BIT(1),           /* MODULE = ISTINCVP         */ 02411000
*           4  CINCVS BIT(1),           /* MODULE = ISTINCVS         */ 02412000
*           4  CINCVN BIT(1),           /* MODULE = ISTINCVO         */ 02413000
*           4  CINCMS BIT(1),           /* MODULE = ISTINCMS         */ 02414000
*           4  CINCR2 BIT(1),           /* MODULE = ISTINCR2         */ 02415000
*           4  CINCIP BIT(1),           /* MODULE = ISTINCIP         */ 02416000
*           4  CINCD1 BIT(1),           /* MODULE = ISTINCD1         */ 02417000
*           4  CINCD2 BIT(1),           /* MODULE = ISTINCD2         */ 02418000
*           4  CINCD3 BIT(1),           /* MODULE = ISTINCD3         */ 02419000
*           4  CINCD4 BIT(1),           /* MODULE = ISTINCD4         */ 02420000
*           4  CINCD5 BIT(1),           /* MODULE = ISTINCD5         */ 02421000
*           4  CINCD6 BIT(1),           /* MODULE = ISTINCD6         */ 02422000
*           4  CINCD7 BIT(1),           /* MODULE = ISTINCD7         */ 02423000
*           4  CINCD8 BIT(1),           /* MODULE = ISTINCD8         */ 02424000
*           4  CINCD9 BIT(1),           /* MODULE = ISTINCD9         */ 02425000
*           4  CINCE0 BIT(1),           /* MODULE = ISTINCE0         */ 02426000
*           4  CINCE2 BIT(1),           /* MODULE = ISTINCE2         */ 02427000
*           4  CINCE3 BIT(1),           /* MODULE = ISTINCE3         */ 02428000
*           4  CINCE4 BIT(1),           /* MODULE = ISTINCE4         */ 02429000
*           4  CINCFM BIT(1),           /* MODULE = ISTINCFM         */ 02430000
*           4  CINCF1 BIT(1),           /* MODULE = ISTINCF1         */ 02431000
*           4  CINCF3 BIT(1),           /* MODULE = ISTINCF3         */ 02432000
*           4  CINCF4 BIT(1),           /* MODULE = ISTINCF4         */ 02433000
*           4  CINCL0 BIT(1),           /* MODULE = ISTINCL0         */ 02434000
*           4  CINCL1 BIT(1),           /* MODULE = ISTINCL1         */ 02435000
*           4  CINCL2 BIT(1),           /* MODULE = ISTINCL2         */ 02436000
*           4  CINCL3 BIT(1),           /* MODULE = ISTINCL3         */ 02437000
*           4  CINCL4 BIT(1),           /* MODULE = ISTINCL4         */ 02438000
*           4  CINCL5 BIT(1),           /* MODULE = ISTINCL5         */ 02439000
*           4  CINCL6 BIT(1),           /* MODULE = ISTINCL6         */ 02440000
*           4  CINCL7 BIT(1),           /* MODULE = ISTINCL7         */ 02441000
*           4  CINCL8 BIT(1),           /* MODULE = ISTINCL8         */ 02442000
*           4  CINCS1 BIT(1),           /* MODULE = ISTINCS1         */ 02443000
*           4  CINCUM BIT(1),           /* MODULE = ISTINCUM         */ 02444000
*           4  CINCU0 BIT(1),           /* MODULE = ISTINCU0          * 02445000
*           4  CINCU1 BIT(1),           /* MODULE = ISTINCU1         */ 02446000
*           4  CINCU2 BIT(1),           /* MODULE = ISTINCU2         */ 02447000
*           4  CINCU3 BIT(1),           /* MODULE = ISTINCU3         */ 02448000
*           4  CINCU4 BIT(1),           /* MODULE = ISTINCU4         */ 02449000
*           4  CINCU5 BIT(1),           /* MODULE = ISTINCU5         */ 02450000
*           4  CINCU6 BIT(1),           /* MODULE = ISTINCU6         */ 02451000
*           4  CINCU7 BIT(1),           /* MODULE = ISTINCU7         */ 02452000
*           4  CINCU8 BIT(1),           /* MODULE = ISTINCU8         */ 02453000
*           4  CINCV2 BIT(1),           /* MODULE = ISTINCV2         */ 02454000
*           4  CINCV3 BIT(1),           /* MODULE = ISTINCV3         */ 02455000
*           4  CINCV4 BIT(1),           /* MODULE = ISTINCV4         */ 02456000
*           4  CINCV5 BIT(1),           /* MODULE = ISTINCV5         */ 02457000
*           4  CINCV6 BIT(1),           /* MODULE = ISTINCV6         */ 02458000
*           4  CINCV7 BIT(1),           /* MODULE = ISTINCV7         */ 02459000
*           4  CINCV8 BIT(1),           /* MODULE = ISTINCV8         */ 02460000
*           4  CINCV9 BIT(1),           /* MODULE = ISTINCV9         */ 02461000
*           4  CINCW0 BIT(1),           /* MODULE = ISTINCW0         */ 02462000
*           4  CINCW2 BIT(1),           /* MODULE = ISTINCW2         */ 02463000
*           4  CINCW4 BIT(1),           /* MODULE = ISTINCW4         */ 02464000
*           4  CINCW5 BIT(1),           /* MODULE = ISTINCW5         */ 02465000
*           4  CINCW6 BIT(1),           /* MODULE = ISTINCW6         */ 02466000
*           4  CINCW7 BIT(1),           /* MODULE = ISTINCW7         */ 02467000
*           4  CINCW8 BIT(1),           /* MODULE = ISTINCW8         */ 02468000
*           4  CINCW9 BIT(1),           /* MODULE = ISTINCW9         */ 02469000
*           4  CINCX0 BIT(1),           /* MODULE = ISTINCX0         */ 02470000
*           4  CINCX1 BIT(1),           /* MODULE = ISTINCX1         */ 02471000
*           4  CINCX2 BIT(1),           /* MODULE = ISTINCX2         */ 02472000
*           4  CINCX3 BIT(1),           /* MODULE = ISTINCX3         */ 02473000
*           4  CINCX6 BIT(1),           /* MODULE = ISTINCX6         */ 02474000
*           4  CINCX7 BIT(1),           /* MODULE = ISTINCX7         */ 02475000
*           4  CINCX8 BIT(1),           /* MODULE = ISTINCX8         */ 02476000
*           4  CINCX9 BIT(1),           /* MODULE = ISTINCX9         */ 02477000
*           4  CINCUA BIT(1),           /* MODULE = ISTINCUA         */ 02478000
*           4  CINCUB BIT(1),           /* MODULE = ISTINCUB         */ 02479000
*           4  CINCUQ BIT(1),           /* MODULE = ISTINCUQ         */ 02480000
*           4  CINCE1 BIT(1),           /* MODULE = ISTINCE1         */ 02481000
*           4  CINCE5 BIT(1),           /* MODULE = ISTINCE5         */ 02482000
*           4  CINCE6 BIT(1),           /* MODULE = ISTINCE6         */ 02483000
*           4  CINCE7 BIT(1),           /* MODULE = ISTINCE7         */ 02484000
*           4  CINCE8 BIT(1),           /* MODULE = ISTINCE8         */ 02485000
*           4  CINCR3 BIT(1),           /* MODULE = ISTINCR3         */ 02486000
*           4  CINCR5 BIT(1),           /* MODULE = ISTINCR5         */ 02487000
*           4  CINCVO BIT(1),           /* MODULE = ISTINCVO         */ 02488000
*           4  CINCE9 BIT(1),           /* MODULE = ISTINCE9         */ 02489000
*           4  CINCFE BIT(1),           /* MODULE = ISTINCFE         */ 02490000
*           4  VYCRSV03 BIT(4),         /* RESERVED                  */ 02491000
*     2  VYCRRSAV CHAR(72),             /* SAVE AREA USED BY ISTINCIP*/ 02492000
*                                       /* TO CALL ISTINCW3          */ 02493000
*     2  VYCRRCW3 CHAR(8),              /* PARAM LIST USED BY        */ 02494000
*                                       /* ISTINCIP TO CALL ISTINCW3 */ 02495000
*     2  VYCRSV04 CHAR(2),              /* RESERVED                  */ 02496000
*     2  VYCRSV02 PTR(31);              /* RESERVED                  */ 02497000
*DCL TIDINCDL BIT(8) CONSTANT('00'X);   /* THREAD ID FOR ISTINCDL    */ 02498000
*DCL TIDINCMY BIT(8) CONSTANT('01'X);   /* THREAD ID FOR ISTINCMY    */ 02499000
*DCL TIDINCCL BIT(8) CONSTANT('02'X);   /* THREAD ID FOR ISTINCCL    */ 02500000
*DCL TIDINCFE BIT(8) CONSTANT('04'X);   /* THREAD ID FOR ISTINCFE    */ 02501000
*/* LOCKWORD FORMAT DSECT                                            */ 02502000
*/*  INITIAL LEVEL                                     001 05/24/74  */ 02503000
*DCL 1 ISTLOK BDY(WORD) BASED,                                     0654 02504000
*     2  LOKCT CHAR(1) BDY(WORD),       /* COUNT OF LOCK OWNERS      */ 02505000
*     2  LOKCHN PTR(24),                /* ADDR OF NEXT RPH WAITING     02506000
*                                          ON LOCK                   */ 02507000
*        3  LOKCHNG CHAR(3),            /* CHAIN/FLAGS               */ 02508000
*           4 *        CHAR(2),                                    0654 02509000
*           4 *        BIT(8),                                     0654 02510000
*             5 *        BIT(6),                                   0654 02511000
*             5  LOKPRY BIT(1),         /* PRIORITY FLAG, 1 = ON     */ 02512000
*             5  LOKXCL BIT(1);         /* EXCLUSIVE FLAG, 1 = ON    */ 02513000
*DCL LOKXCL1  BIT(32) CONSTANT('00000001'X); /* CONSTANT TO TURN LOKXCL 02514000
*                                          ON                        */ 02515000
*DCL LOKPRY1  BIT(32) CONSTANT('00000002'X); /* CONSTANT TO TURN LOKPRY 02516000
*                                          ON                        */ 02517000
*DCL LOKCHN1  BIT(32) CONSTANT('00FFFFFC'X); /* CONSTANT TO TURN LOKXCL 02518000
*                                          AND LOKPRY OFF            */ 02519000
*DCL LOKCT1   BIT(32) CONSTANT('01000000'X); /* CONSTANT TO MAKE LOKCT  02520000
*                                          = 1                       */ 02521000
*DCL LOKCT255 BIT(32) CONSTANT('FF000000'X); /* CONSTANT TO CHECK FOR   02522000
*                                          MAX LOKCT (255)           */ 02523000
*/*   DEVICE CHARACTERISTICS TABLE - ORIGINATES IN RDT USED TO DEFINE   02524000
*    DEVICE CHARACTERISTICS IN DNCB,FMCB AND NIB  */               0660 02525000
*/*  INITIAL LEVEL                                     001 08/07/74  */ 02526000
*DCL  1  ISTDEVCH  BDY(WORD)BASED,                                 0660 02527000
*        2  DEVSHCH BIT(8),            /* DEV SCHED CHARACTERISTICS  */ 02528000
*           3  DEVCHAR  BIT(8),        /* COMPATIBILITY EXISTING CODE*/ 02529000
*              4  DEVINPUT  BIT(1),    /* DEVICE IS FOR INPUT        */ 02530000
*              4  DEVOTPUT  BIT(1),    /* DEVICE IS FOR OUTPUT       */ 02531000
*              4  DEVCONVR  BIT(1),    /* DEVICE IS CONVERSATION     */ 02532000
*                                      /* RN DEFINITION              */ 02533000
*              4  DEVSUBND  BIT(1),    /* DEVICE HAS SCHEDULABLE     */ 02534000
*                                      /*   SUB-NODES                */ 02535000
*              4  DEVSPS BIT(1),       /* DEV IS START PRINT SENSITIVE* 02536000
*              4  DEVNNSPT BIT(1),     /* NODE HAS NETWRK MNGMNT SPRT*/ 02537000
*              4  DEVCCTL BIT(1),      /* NODE HAS CONN CNTRL DEPENDCS* 02538000
*              4  DEVRSV01  BIT(1),    /* RESERVED                   */ 02539000
*        2  DEVTCODE BIT(8),           /* DEVICE TYPE CODES          */ 02540000
*           3  DEVCHAR2  BIT(8),       /* COMPATIBILITY EXISTING CODE*/ 02541000
*        2  DEVMCODE BIT(8),           /* DEVICE MODEL CODE           * 02542000
*        2  DEVFLAGS BIT(8),           /*USE DEPENDS ON DEVSHCH VALUES* 02543000
*           3  DEVFCCTL BIT(4),        /* USED IF DEVICE REQ CONN CTRL* 02544000
*              4  DEVCBSC BIT(1),      /* RESET ORDERLY, BI-SYNCH  0660 02545000
*                                         TERMINALS EXCEPT 3270'S    */ 02546000
*              4  DEVCSSL BIT(1),      /*RESET AT END OF COMMAND. 3270' 02547000
*                                         AND START/STOP EXCEPT TERMS   02548000
*                                         WITH REVERSE BREAK FEATURE */ 02549000
*                                                                  0660 02550000
*              4  DEVCRVB BIT(1),      /* RESET IMMEDIATE. START/STOP   02551000
*                                         TERMS WITH REVERSE BREAK 0660 02552000
*                                         FEATURE                    */ 02553000
*              4  DEVCSWL BIT(1),      /* 1=HIGHER NODE IS SWITCH CON-  02554000
*                                         NECTION, 0=LEASED CONNECTION* 02555000
*           3  DEVCHAR3 BIT(4),        /* COMPATIBILITY EXISTING CODE*/ 02556000
*              4  DEVCATTN BIT(1),     /* TERMINAL CAN INTERRUPT WITH   02557000
*                                         ATTENTION                  */ 02558000
*              4  DEVCCHEK BIT(1),     /* TERMINAL HAS CHECKING      */ 02559000
*              4  DEVCSTCL BIT(1),     /* TERMINAL HAS STATION     0660 02560000
*                                         CONTROL                    */ 02561000
*              4  DEVCSLPN BIT(1),     /* TERMINAL HAS SELECTOR PEN  */ 02562000
*        2  DEVPHYSA CHAR(1),          /* PHYSICAL DEVICE ADDRESS    */ 02563000
*        2  DEVRSV03 CHAR(3);          /* RESERVED                   */ 02564000
*/* DEVICE TYPE CODES */                                           0661 02565000
*DCL DEV2740 BIT(8) CONSTANT ('01'X);  /* DEVICE IS A 2740           */ 02566000
*DCL DEV2741 BIT(8) CONSTANT ('02'X);  /* DEVICE IS A 2741           */ 02567000
*DCL DEV1050 BIT(8) CONSTANT ('03'X);  /* DEVICE IS A 1050           */ 02568000
*DCL DEVTWX  BIT(8) CONSTANT ('04'X);  /* DEVICE IS A TWX            */ 02569000
*DCL DEVWTTY BIT(8) CONSTANT ('05'X);  /* DEVICE IS A WTTY           */ 02570000
*DCL DEV115A BIT(8) CONSTANT ('06'X);  /* DEVICE IS A 115A           */ 02571000
*DCL DEV83B3 BIT(8) CONSTANT ('07'X);  /* DEVICE IS AN 83B3          */ 02572000
*DCL DEV2715 BIT(8) CONSTANT ('08'X);  /* DEVICE IS A 2715           */ 02573000
*DCL DEV2770 BIT(8) CONSTANT ('09'X);  /* DEVICE IS A 2770           */ 02574000
*DCL DEV2780 BIT(8) CONSTANT ('0A'X);  /* DEVICE IS A 2780           */ 02575000
*DCL DEV3735 BIT(8) CONSTANT ('0B'X);  /* DEVICE IS A 3735           */ 02576000
*DCL DEV3780 BIT(8) CONSTANT ('0C'X);  /* DEVICE IS A 3780           */ 02577000
*DCL DEV1130 BIT(8) CONSTANT ('0D'X);  /* DEVICE IS AN 1130          */ 02578000
*DCL DEV1800 BIT(8) CONSTANT ('0E'X);  /* DEVICE IS AN 1800          */ 02579000
*DCL DEV3125 BIT(8) CONSTANT ('11'X);  /* DEVICE IS A 3125           */ 02580000
*DCL DEV3135 BIT(8) CONSTANT ('12'X);  /* DEVICE IS A 3135           */ 02581000
*DCL DEVSYS3 BIT(8) CONSTANT ('13'X);  /* DEVICE IS SYS 3            */ 02582000
*DCL DEV2701 BIT(8) CONSTANT ('14'X);  /* DEVICE IS A 2701 OZ05270   */ 02583000
*DCL DEV2703 BIT(8) CONSTANT ('15'X);  /* DEVICE IS A 2703 OZ05270   */ 02584000
*DCL DEV3704 BIT(8) CONSTANT ('16'X);  /* DEVICE IS A 3704           */ 02585000
*DCL DEV3705 BIT(8) CONSTANT ('17'X);  /* DEVICE IS A 3705           */ 02586000
*DCL DEV2980 BIT(8) CONSTANT ('18'X);  /* DEVICE IS A 2980           */ 02587000
*DCL DEV3277 BIT(8) CONSTANT ('19'X);  /* DEVICE IS A 3277           */ 02588000
*DCL DEV3284 BIT(8) CONSTANT ('1A'X);  /* DEVICE IS A 3284           */ 02589000
*DCL DEV3286 BIT(8) CONSTANT ('1B'X);  /* DEVICE IS A 3286           */ 02590000
*DCL DEV3275 BIT(8) CONSTANT ('1C'X);  /* DEVICE IS A 3275           */ 02591000
*DCL DEV3741 BIT(8) CONSTANT ('1D'X);  /* DEVICE IS A 3741           */ 02592000
*DCL DEV3747 BIT(8) CONSTANT ('1E'X);  /* DEVICE IS A 3747           */ 02593000
*DCL DEVMTA  BIT(8) CONSTANT ('28'X);  /* DEVICE IS AN MTA           */ 02594000
*DCL DEV2972 BIT(8) CONSTANT ('33'X);  /* DEVICE IS A 2972           */ 02595000
*DCL DEV3271 BIT(8) CONSTANT ('34'X);  /* DEVICE IS A 3271           */ 02596000
*DCL DEV3272 BIT(8) CONSTANT ('36'X);  /* DEVICE IS A 3272           */ 02597000
*DCL DEVCC   BIT(8) CONSTANT ('35'X);  /* DEVICE IS A PHYSICAL UNIT  */ 02598000
*DCL DEV1052 BIT(8) CONSTANT ('64'X);  /* DEVICE IS A 1052           */ 02599000
*DCL DEV1053 BIT(8) CONSTANT ('65'X);  /* DEVICE IS A 1053           */ 02600000
*DCL DEV1054 BIT(8) CONSTANT ('66'X);  /* DEVICE IS A 1054           */ 02601000
*DCL DEV1055 BIT(8) CONSTANT ('67'X);  /* DEVICE IS A 1055           */ 02602000
*DCL DEV1056 BIT(8) CONSTANT ('68'X);  /* DEVICE IS A 1056           */ 02603000
*DCL DEV1057 BIT(8) CONSTANT ('69'X);  /* DEVICE IS A 1057           */ 02604000
*DCL DEV1058 BIT(8) CONSTANT ('6A'X);  /* DEVICE IS A 1058           */ 02605000
*DCL DEV1092 BIT(8) CONSTANT ('6B'X);  /* DEVICE IS A 1092           */ 02606000
*DCL DEV1093 BIT(8) CONSTANT ('6C'X);  /* DEVICE IS A 1093           */ 02607000
*DCL DEVLU   BIT(8) CONSTANT ('6D'X);  /* DEVICE IS A LOGICAL UNIT   */ 02608000
*DCL DEV545  BIT(8) CONSTANT ('78'X);  /* DEVICE IS A 545            */ 02609000
*DCL DEV1017 BIT(8) CONSTANT ('79'X);  /* DEVICE IS A 1017           */ 02610000
*DCL DEV1018 BIT(8) CONSTANT ('7A'X);  /* DEVICE IS A 1018           */ 02611000
*DCL DEV2203 BIT(8) CONSTANT ('7B'X);  /* DEVICE IS A 2203           */ 02612000
*DCL DEV2213 BIT(8) CONSTANT ('7C'X);  /* DEVICE IS A 2213           */ 02613000
*DCL DEV2265 BIT(8) CONSTANT ('7D'X);  /* DEVICE IS A 2265           */ 02614000
*DCL DEV2502 BIT(8) CONSTANT ('7E'X);  /* DEVICE IS A 2502           */ 02615000
*DCL DEV50   BIT(8) CONSTANT ('7F'X);  /* DEVICE IS A 50             */ 02616000
*DCL DEV1255 BIT(8) CONSTANT ('80'X);  /* DEVICE IS A 1255           */ 02617000
*DCL DEV5496 BIT(8) CONSTANT ('81'X);  /* DEVICE IS A 5496           */ 02618000
*/* MODEL CODES */                                                 0714 02619000
*DCL DEVMOD1 BIT(8) CONSTANT ('00'X);  /* MODEL 1                    */ 02620000
*DCL DEVMOD2 BIT(8) CONSTANT ('01'X);  /* MODEL 2                    */ 02621000
*/*              RESOURCE DEFINITION TABLE                           */ 02622000
*/*  REVISIONS                                         013 07/01/75  */ 02623000
*DCL                                                               0716 02624000
*1  ISTRPRE BDY(WORD) BASED,     /* COMMON PREFIX                    */ 02625000
*   2  RPRNAME  CHAR(8),         /* RESOURCE NAME                    */ 02626000
*   2  RPRCOMID FIXED(31),       /* COMMUNICATION ID                 */ 02627000
*      3  RPRSAF BIT(16),        /* SOURCE ADDRESS FIELD             */ 02628000
*      3  RPRDAF BIT(16),        /* DESTINATION ADDRESS FIELD-       */ 02629000
*                             /* CONTAINS DAF OF CTERM IN PORT ENTRY */ 02630000
*   2  RPRRLOCK CHAR(LENGTH(ISTLOK)),  /* RESOURCE LOCK              */ 02631000
*   2  RPRELEN  FIXED(15),       /* CURRENT ENTRY LENGTH             */ 02632000
*   2  RPRPELEN FIXED(15),       /* PREVIOUS ENTRY LENGTH            */ 02633000
*   2  RPRENTRY BIT(8),          /* FLAG FIELD 1 (ENTRY TYPE)        */ 02634000
*   2  RPRFLAGA BIT(8),                                            0716 02635000
*      3  RPRACT BIT(1),         /* ACTIVE                           */ 02636000
*      3  RPRINV BIT(1),         /* INVALID                          */ 02637000
*      3  RPRTIED BIT(1),        /* TIED                             */ 02638000
*      3  RPRENTBF BIT(1),       /* BUFFER TRACE THIS NODE           */ 02639000
*      3  RPRENTIO BIT(1),       /* RESERVED                         */ 02640000
*      3  RPRENTED BIT(1),       /* LAST ENTRY IN RDT SEGMENT        */ 02641000
*      3  RPRVRYPD BIT(1),       /* VARY PENDING ON ENTRY            */ 02642000
*      3  RPRLIVE  BIT(1),       /* RESOURCE IS LIVE                 */ 02643000
*   2  RPRFLAGB BIT(8),          /* FLAG FIELD                       */ 02644000
*      3  RPRENTVH BIT(1),       /* WHEN 1, ENTRY IS A VTAM HEADER   */ 02645000
*      3  RPRENTVT BIT(1),       /* WHEN 1, ENTRY IS VTAM            */ 02646000
*      3  RPRAOPN BIT(1),        /* NODE OPENABLE BY APPLICATION     */ 02647000
*      3  RPRVIODN BIT(1),       /* VARY I/O HAS BEEN DONE           */ 02648000
*      3  RPRONLIN BIT(1),       /* NODE VARIED ONLINE               */ 02649000
*      3  RPRHLVPD BIT(1),       /* VARY PENDING IN HIGHEST        0716 02650000
*                                   LEVEL NODE                       */ 02651000
*      3  RPRVYIMM BIT(1),       /* VARY IMMEDAITE ISSUED FOR NODE   */ 02652000
*      3  RPRINTST BIT(1),       /* DEVICE IN TEST MODE              */ 02653000
*   2  RPRCAUSE BIT(8),          /* FLAGS INDICATING CAUSE OF ENTRY     02654000
*                                                      INVALIDATION  */ 02655000
*      3  RPRNOSRT BIT(1),       /* RPRINV SET BECAUSE NO SRTE BUILT */ 02656000
*      3  RPRCRCPT BIT(1),       /* C/R CHECKPOINT ACTIVE 1=ACTIVE   */ 02657000
*      3  RPRRSYNC BIT(1),       /* C/R RE-SYNC ON FIRST I/O         */ 02658000
*                                /* REQUIRED: 1=YES                  */ 02659000
*      3  RPRRSV03 BIT(5),       /* RESERVED                         */ 02660000
*   2  RPRPEPCT FIXED(15),       /* VARY PENDING COUNTER             */ 02661000
*   2  RPRTIOCT FIXED(8),        /* I/O TRACE COUNT                  */ 02662000
*   2  RPRHDTYP BIT(8),          /* HEADER TYPE                      */ 02663000
*   2  RPRLGONF PTR(31),         /* SIM. LOGON CHAIN FORWARD PTR     */ 02664000
*   2  RPRLGONB PTR(31),         /* SIM. LOGON CHAIN BACKWARD PTR    */ 02665000
*   2  RPRNSNEA PTR(31),         /* NEXT SCHEDULABLE NODE ENTRY ADDR */ 02666000
*   2  RPRNCBA PTR(31),          /* ADDR OF ASSOCIATED NCB FOR     0716 02667000
*                                    OPENED NODES                    */ 02668000
*   2  RPRDEVCH CHAR(LENGTH(ISTDEVCH)),  /* DEVICE CHARACTERISTICS   */ 02669000
*   2  RPRRVPT1 PTR(31),         /* RESERVED                         */ 02670000
*   2  RPRSTPCT FIXED(15),       /* COUNT OF SHOULDER TAPS           */ 02671000
*   2  RPRSWDAF BIT(16),         /* SWITCHED DAF                     */ 02672000
*   2  RPRPTHCT FIXED(8),        /* COUNT OF AVAILABLE PATHS       0716 02673000
*                                   TO THIS DEVICE                   */ 02674000
*   2  RPRFLAGD CHAR(1),         /* FLAG BYTE                        */ 02675000
*      3 RPRLTASN BIT(1),        /* LINE TRACE ACTIVE = 1            */ 02676000
*      3 RPRCONCT BIT(1),        /* PHYSICAL CONNECTION EXISTS       */ 02677000
*      3 RPRRSON  BIT(1),        /* RESET ONLINE                     */ 02678000
*      3 RPRACTP  BIT(1),        /* ACTIVATE IN PROGRESS             */ 02679000
*      3 RPRCONP  BIT(1),        /* CONTACT IN PROGRESS              */ 02680000
*      3 RPRRSV05 BIT(2),        /* RESERVED                         */ 02681000
*      3 RPRINIMM BIT(1),        /* ON=INACTIVATE IMMED. IN PROGRESS */ 02682000
*   2  RPRFLAGC BIT(8),          /* FLAG FIELD                       */ 02683000
*      3  RPRCLVPD BIT(1),       /* THIS ENTRY HAS BEEN CLOSED       */ 02684000
*   2  RPRCONID CHAR(9);         /* CONTROL BLOCK ID                 */ 02685000
*                                                                  0716 02686000
*                                                                  0716 02687000
*/* RPRENTRY - FOLLOWING EQUATES ARE FOR THE VARIOUS ENTRY TYPES     */ 02688000
*DCL RPRENTCM BIT(8) CONSTANT('90'X);  /* ENTRY IS A COMPONENT       */ 02689000
*DCL RPRENTIN BIT(8) CONSTANT('82'X);  /* ENTRY IS INTERMEDIATE NODE */ 02690000
*DCL RPRENTTR BIT(8) CONSTANT('80'X);  /* ENTRY IS A TERMINAL        */ 02691000
*DCL RPRENTUT BIT(8) CONSTANT('75'X);  /* ENTRY IS UTERM             */ 02692000
*DCL RPRENTCL BIT(8) CONSTANT('70'X);  /* ENTRY IS A CLUSTER         */ 02693000
*DCL RPRENTLN BIT(8) CONSTANT('50'X);  /* ENTRY IS A LINE            */ 02694000
*DCL RPRENTLH BIT(8) CONSTANT('03'X);  /* ENTRY IS A LOCAL HEADER    */ 02695000
*DCL RPRENTGP BIT(8) CONSTANT('30'X);  /* ENTRY IS A GROUP           */ 02696000
*DCL RPRENTLC BIT(8) CONSTANT('45'X);  /* ENTRY IS A LOCAL DEVICE    */ 02697000
*DCL RPRENTAH BIT(8) CONSTANT('02'X);  /* ENTRY IS APPLICATION HEADER*/ 02698000
*DCL RPRENTAP BIT(8) CONSTANT('55'X);  /* ENTRY IS APPLICATION       */ 02699000
*DCL RPRENTDS BIT(8) CONSTANT('20'X);  /* ENTRY IS LCDO            0728 02700000
*                                         (DIALSET)                  */ 02701000
*DCL RPRENTRN BIT(8) CONSTANT('01'X);  /* ENTRY IS THE RN            */ 02702000
*DCL RPRENTCC BIT(8) CONSTANT('71'X);  /* ENTRY IS A PU              */ 02703000
*DCL RPRENTLU BIT(8) CONSTANT('81'X);  /* ENTRY IS LOGICAL UNIT      */ 02704000
*DCL RPRENTSW BIT(8) CONSTANT('04'X);  /* ENTRY IS SWITCHED          */ 02705000
*                                      /* SUBAREA HEADER             */ 02706000
*DCL RPRENTLS BIT(8) CONSTANT('05'X);  /* ENTRY IS LOCAL             */ 02707000
*                                      /* SUBAREA HEADER             */ 02708000
*DCL RPRENTPX BIT(8) CONSTANT('72'X);  /* ENTRY IS A PUX             */ 02709000
*DCL RPRENTLX BIT(8) CONSTANT('10'X);  /* ENTRY IS A LUX             */ 02710000
*DCL RPRENTDA BIT(8) CONSTANT('51'X);  /* ENTRY IS A DAN             */ 02711000
*                                                                  0736 02712000
*                                                                  0736 02713000
*/* THE FOLLOWING IS A PREFIX FOR ALOCATION ENTRIES                  */ 02714000
*/*   ISTRCL-CLUSTER,ISTRTR-TERMINAL,ISTRCM-COMPONENT                */ 02715000
*                                                                  0737 02716000
*DCL                                                               0737 02717000
*1  ISTRCPRE BDY(WORD) BASED,    /* LEVEL 1 DECLARE                  */ 02718000
*   2  RCPPRE  CHAR(LENGTH(ISTRPRE)),      /* COMMON PREFIX          */ 02719000
*   2  RCPICELN PTR(31),         /* PTR LOGON ICE QUEUE              */ 02720000
*   2  RCPLNAPA PTR(31),         /* PTR APLICATION ENTRY FOR SIMLOGON*/ 02721000
*   2  RCPICEAQ PTR(31),         /* PTR ACQUIRE ICE QUEUE            */ 02722000
*   2  RCPACETR PTR(31),         /* PTR ACE QUEUE                    */ 02723000
*   2  RCPBHSI1 CHAR(1),         /* GEN'D BHSET ID                   */ 02724000
*   2  RCPBHSI2 CHAR(1),         /* OVERRIDING BHSET ID SPECIFIED  0737 02725000
*                                   BY USER                          */ 02726000
*   2  RCPBFLIM PTR(8),          /* BUFFER LIMIT                     */ 02727000
*   2  RCPPMODE CHAR(1),         /* PERMISSABLE MODES                */ 02728000
*      3 RCPRBASC BIT(1),        /* 1= BASIC OK                      */ 02729000
*      3 RCPRRECD BIT(1),        /* 1= RECORD OK                     */ 02730000
*      3 *        BIT(6),        /* RESERVED                         */ 02731000
*   2  RCPLGNIN CHAR(20) BDY(WORD), /* INIT LOGON DATA               */ 02732000
*      3 RCPLGNAP CHAR(8),       /* APPL FOR VTAM SIMLOGON           */ 02733000
*      3 RCPLGNCT CHAR(8),       /* NAME OF LOGON CHAR TABLE         */ 02734000
*      3 RCPINTA  PTR(31),       /* ADDR OF INTERPRET TABLE          */ 02735000
*   2  RCPRSV03 PTR(31),         /* RESERVED FOR C/R                 */ 02736000
*   2  RCPRSV04 PTR(31),         /* RESERVED FOR C/R                 */ 02737000
*   2  RCPRSV05 PTR(31);         /* RESERVED FOR C/R                 */ 02738000
*                                                                  0737 02739000
*                                                                  0737 02740000
*DCL                                                               0738 02741000
*1  ISTRDT BDY(WORD) BASED,      /* LEVEL 1 DECLARE                  */ 02742000
*   2  RDTPRE CHAR(LENGTH(ISTRPRE)), /* ENTRY PREFIX                 */ 02743000
*   2  RDTPLEN CHAR(4)BDY(WORD), /* PRIORITY AND LENGTH FIELD        */ 02744000
*      3  RDTPRIOR,              /* DETERMINES SEGMENT TYPE          */ 02745000
*         4  * BIT(3),           /*    NOT USED                      */ 02746000
*         4  RDTPRIAP BIT(1),    /*    APPLICATION SEGMENT           */ 02747000
*         4  RDTPRILC BIT(1),    /*    LOCAL SEGMENT                 */ 02748000
*         4  RDTPRIRN BIT(1),    /*    RN SEGMENT                    */ 02749000
*         4  RDTPRISW BIT(1),    /*    SWITCHED SEGMENT              */ 02750000
*         4  RDTPRILS BIT(1),    /*    LOCAL SUBAREA SEGMENT         */ 02751000
*      3  RDTLEN FIXED(24),      /* LENGTH OF RDT                    */ 02752000
*   2  RDTFORW PTR(31),          /* FOREWARD POINTER                 */ 02753000
*   2  RDTBACK PTR(31),          /* BACKWARD POINTER                 */ 02754000
*   2  RDTFLAGS BIT(16),         /* SEGMENT FLAGS,UNUSED/REUSED      */ 02755000
*   2  RDTCTSNT FIXED(15),       /* COUNT OF SNT ENTRIES FOR       0738 02756000
*                                   SEGMENT                          */ 02757000
*   2  RDTMAXID PTR(8),          /* MAXIMUM NODE ID FOR            0738 02758000
*                                   NETWORK                          */ 02759000
*   2  RDTNODID PTR(8),          /* NODE ID FOR THIS SEGMENT         */ 02760000
*   2  RDTLGCT  PTR(8),          /* COUNT OF LOGONS OUTSTANDING      */ 02761000
*   2  RDTFLAGB BIT(8),          /* FLAG BYTE                        */ 02762000
*      3 RDTOUERP BIT(1),        /* 1 = REPEAT ERP                   */ 02763000
*      3 RDTPRGDN BIT(1),        /* 1 = PURGE ISSUED                 */ 02764000
*      3 RDTCTPGD BIT(1),        /* 1 = CONTACT PURGED               */ 02765000
*      3 RDTCTCFL BIT(1),        /* HIGHER FAILURE-CONTACT FLUSHED   */ 02766000
*      3 RDTBHSET BIT(1),        /* BHSET REQUIRED                   */ 02767000
*      3 RDTRSV01 BIT(3),        /* RESERVED                         */ 02768000
*   2  RDTVPAB  PTR(31),         /* ADDR OF VARY PAB                 */ 02769000
*   2  RDTEPAB  PTR(31),         /* ADDR OF ERP PAB                  */ 02770000
*   2  RDTDPAB  PTR(31),         /* ADDR OF DUMP/LOAD/RESTART PAB    */ 02771000
*   2  RDTTPAB  PTR(31),         /* TOLTEP SSCP PAB                  */ 02772000
*   2  RDTVYRPH PTR(31),         /* @ OF VARY RPH WAITING            */ 02773000
*                                /* FOR RESTART COMPLETION           */ 02774000
*      3 RRNVYRPH PTR(31),       /* DELETE ALIAS IN NEXT             */ 02775000
*                                /* FIRST SNA/2 BUILD                */ 02776000
*   2  RDTSTCNT PTR(8),          /* ACTIVE SUBNODE COUNT             */ 02777000
*      3 RRNSTCNT PTR(8),        /* DELETE ALIAS IN NEXT             */ 02778000
*                                /* FIRST SNA/2 BUILD                */ 02779000
*   2  *        CHAR(3),         /* RESERVED                         */ 02780000
*   2  RDTCRSDS CHAR(8),         /* C/R DATA SET IDENTIFIER          */ 02781000
*                                /* BLANK IMPLIES NOT SPECIFIED      */ 02782000
*   2  RDTCRSPW CHAR(8),         /* C/R DATASET PASSWORD             */ 02783000
*                                /* BLANK IMPLIES NOT SPECIFIED      */ 02784000
*   2  RDTVSRPL PTR(31);         /* C/R PTR TO VSAM RPL              */ 02785000
*                                                                  0738 02786000
*                                                                  0738 02787000
*DCL                                                               0739 02788000
*1  ISTRAP BDY(WORD) BASED,      /* APPLICATION ENTRY                */ 02789000
*   2  RAPPRE CHAR(LENGTH(ISTRPRE)), /*  USE ISTRPRE DSECT           */ 02790000
*   2  RAPACBA PTR(31),          /*   POINTER TO ACB                 */ 02791000
*   2  RAPACDEB PTR(31),         /*  POINTER TO ACBDEB               */ 02792000
*   2  RAPAPPWD CHAR(8),         /* APPLICATION PASSWORD             */ 02793000
*   2  RAPICELG PTR(31),         /* ANCHOR FOR LOGON ICE TO APLICATION* 02794000
*   2  RAPICEAC PTR(31),         /* ANCHOR ACEPT ICE FOR APPLICATION */ 02795000
*   2  RAPICEAQ PTR(31),         /*  ANCHOR ACQUIRE ICE BY APPLI     */ 02796000
*   2  RAPACEAP PTR(31),         /* ANCHOR FOR APPLICATION ACES      */ 02797000
*   2  RAPTRPRE FIXED(15),       /* COUNT OF PREMPTED TERMINALS      */ 02798000
*   2  RAPACEQD FIXED(15),       /* COUNT OF ACES QUEUED             */ 02799000
*   2  RAPFLG BIT(8),            /*  FLAG FIELD                      */ 02800000
*      3 RAPABLGN BIT(1),        /*  PERMANENTLY BLOCK LOGONS BIT    */ 02801000
*      3 RAPAQUI BIT(1),         /* QUIESCE IN PROCESS               */ 02802000
*      3 RAPASLGI BIT(1),        /*  APPLICATION FIRST TIME LOGON  0739 02803000
*                                    ISSUED FLAG                     */ 02804000
*      3 RAPATLGN BIT(1),        /*  TEMPORARILY BLOCK LOGONS BIT    */ 02805000
*      3 RAPRSV03 BIT(1),        /*  RESERVED                        */ 02806000
*      3 RAPRSV04 BIT(1),        /*  RESERVED                        */ 02807000
*      3 RAPRSV05 BIT(1),        /*  RESERVED                        */ 02808000
*      3 RAPRSV06 BIT(1),        /*  RESERVED                        */ 02809000
*   2  RAPFLGB BIT(8),           /* AUTHORIZATION FLAGS              */ 02810000
*      3 RAPALLF BIT(1),         /* ALL FUNCTIONS AUTH.              */ 02811000
*      3 RAPABLCK BIT(1),        /* BLOCK I/O AUTH.                  */ 02812000
*      3 RAPAPASS BIT(1),        /* PASS AUTH.                       */ 02813000
*      3 RAPAPRMT BIT(1),        /* PREEMPT AUTH.                    */ 02814000
*      3 RAPAACQ BIT(1),         /* ACQUIRE AUTH.                    */ 02815000
*      3 RAPAPPO  BIT(1),        /* RNO PPO (PRIMARY PROGRAM AUTH    */ 02816000
*      3 RAPASPO  BIT(1),        /* RNO SPO (SECONDARY PROGRAM AUTH  */ 02817000
*      3 RAPANVPC BIT(1),        /* NO VSPACE AUTHORIZED             */ 02818000
*   2  RAPFLGC BIT(8),           /* AUTHORIZATION FLAGS RESERVED     */ 02819000
*      3 RAPRSV10 BIT(1),        /*  RESERVED                        */ 02820000
*      3 RAPRSV11 BIT(1),        /*  RESERVED                        */ 02821000
*      3 RAPRSV12 BIT(1),        /*  RESERVED                        */ 02822000
*      3 RAPRSV13 BIT(1),        /*  RESERVED                        */ 02823000
*      3 RAPRSV14 BIT(1),        /*  RESERVED                        */ 02824000
*      3 RAPRSV15 BIT(1),        /*  RESERVED                        */ 02825000
*      3 RAPRSV16 BIT(1),        /*  RESERVED                        */ 02826000
*      3 RAPRSV17 BIT(1),        /*  RESERVED                        */ 02827000
*   2  RAPBFACT PTR(8),          /* BUFFER LIMIT FACTOR              */ 02828000
*   2  RAPRVPT1 PTR(31),         /*  RESERVED                        */ 02829000
*   2  RAPRVPT2 PTR(31);         /*  RESERVED                        */ 02830000
*                                                                  0739 02831000
*                                                                  0739 02832000
*DCL                                                               0740 02833000
*1  ISTRLC BDY(WORD) BASED,      /* LOCAL ENTRY                      */ 02834000
*   2  RLCPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX               */ 02835000
*   2  RLCADR PTR(31),                                             0740 02836000
*      3  RLCFLAG BIT(8),        /* FLAG BYTE                        */ 02837000
*         4  RLCRSV22 BIT(1),    /* RESERVED                         */ 02838000
*         4  RLCRBISA BIT(1),    /* INITIAL STATUS - 1 = ACTIVE      */ 02839000
*         4  RLCRSV14 BIT(3),    /* UNUSED/RESERVED                  */ 02840000
*         4  RLCACNT BIT(1),     /* MESSAGE BLOCK ACCEPTED           */ 02841000
*         4  RLCRSVDE BIT(2),    /* RESERVED                         */ 02842000
*      3  RLCUCBAD PTR(24),      /* UCB /PUB ADDRESS                 */ 02843000
*   2 RLCLCCUA CHAR(3),          /* DEVICE CHANNEL UNIT ADDR         */ 02844000
*   2 RLCRVPT1 CHAR(1),          /* RESERVED                         */ 02845000
*   2 RLCRVPT2 PTR(31);          /* RESERVED                         */ 02846000
*                                                                  0740 02847000
*                                                                  0740 02848000
*DCL                                                               0741 02849000
*1  ISTRRN BDY(WORD) BASED,      /* RN ENTRY                         */ 02850000
*   2  RRNPRE CHAR(LENGTH(ISTRDT)),  /*  USE ISTRDT DSECT            */ 02851000
*   2  RRNADR PTR(31),                                             0741 02852000
*      3  RRNFLAG BIT(8),                                          0741 02853000
*         4  RRNRSV89 BIT(1),    /* RESERVED                         */ 02854000
*         4  RRNRBISA BIT(1),    /* INITIAL STATUS 1 = ACTIVE        */ 02855000
*         4  RRNLCSIP BIT(1),    /* NODE BEING ACTIVATED             */ 02856000
*         4  RRNLCDIE BIT(1),    /* HIGHER NODE NOT SUCCESFULLY      */ 02857000
*                                /*             ACTIVATED            */ 02858000
*         4  RRNLCDIP BIT(1),    /* NODE BEING DEACTIVATED           */ 02859000
*         4  RRNERPIP BIT(1),    /* ERP IN PROCESS                   */ 02860000
*         4  RRNDSTCT BIT(1),    /* DEACT TO DECREMENT STCNT         */ 02861000
*         4  RRNRSV11 BIT(1),    /* UNUSED/RESERVED                  */ 02862000
*      3  RRNUCBAD PTR(24),      /* UCB/PUB ADDR                     */ 02863000
*         4 RRNCHQI  BIT(8),     /* CHANNEL QUEUE INDEX              */ 02864000
*         4 RRNLUBA  PTR(16),    /* DESCRIBE ENTRY IN PUB            */ 02865000
*                                /* OWNERSHIP TABLE                  */ 02866000
*   2  RRNGRPA PTR(31),          /* POINTER TO FIRST GROUP ENTRY     */ 02867000
*   2  RRNRNCUA CHAR(3),         /* CHANNEL UNIT ADDR                */ 02868000
*   2  RRNRLDIP FIXED(8),        /* REMOTE LOAD/DUMP IN PROG. COUNT  */ 02869000
*   2  RRNTRENT PTR(31),         /* ADDR TERM ENTRY IN LOCAL         */ 02870000
*   2  RRNBHSET PTR(31),         /* POINTER TO TABLE OF BHSET NAMES  */ 02871000
*   2  RRNCTBHS FIXED(15),       /* COUNT OF BHSET NAMES IN RRNBHSET */ 02872000
*   2  RRNCTEGP FIXED(15),       /* COUNT OF GROUP ENTRIES FOR RN    */ 02873000
*   2  RRNCTELI FIXED(15),       /* COUNT OF LINE ENTRIES FOR RN     */ 02874000
*   2  RRNCTECL FIXED(15),       /* COUNT OF CLUSTER ENTRIES FOR RN  */ 02875000
*   2  RRNCTETR FIXED(15),       /* COUNT OF TERMINAL ENTRIES FOR RN */ 02876000
*   2  RRNCTEIN FIXED(15),       /* COUNT OF INT. NODE ENTRIES FOR RN*/ 02877000
*   2  RRNCTECM FIXED(15),       /* CNT OF COMPONENT ENTRIES FOR RN  */ 02878000
*   2  RRNCTENT FIXED(15),       /* # ALL ENTRIES IN 370X RDT SEGMENT*/ 02879000
*   2  RRNRDF CHAR(4),           /*  RESOURCE DEFINITION FLAG        */ 02880000
*      3  RRNRDFA  BIT(8),       /* FLAGS (WORD 1 BYTE 1)            */ 02881000
*         4  RRNRASHT BIT(1),    /* AUTO NETWORK SHUTDOWN            */ 02882000
*         4  RRNRAIPL BIT(1),    /* AUTO IPL ON RN FAILURE           */ 02883000
*         4  RRNRADMP BIT(1),    /* AUTO DUMP ON RN FAILURE          */ 02884000
*         4  RRNRASYN BIT(1),    /* C/R AUTOMATICALLY RESYNCHRONIZED */ 02885000
*                                /* IF ALREADY LOADED NCP            */ 02886000
*                                /* 0=NO, 1=YES                      */ 02887000
*         4  RRNRAOLT BIT(1),    /* ON-LINE TERMINAL TEST            */ 02888000
*         4  RRNRBREM  BIT(1),   /* REMOTE RN FLAG                   */ 02889000
*         4  RRNRANCP BIT(1),    /* GENERATION TYPE NCP              */ 02890000
*         4  RRNRAPEP BIT(1),    /* GENERATION TYPE PEP              */ 02891000
*      3  RRNRDFB BIT(16),       /* FLAG FIELD B (RDF)               */ 02892000
*         4  RRNRBMDL BIT(1),    /* (=1 IF 3705) ELSE 3704           */ 02893000
*         4  RRNRSV02 BIT(1),    /* RESERVED                         */ 02894000
*         4  RRNRBCCL BIT(1),    /* LOOSELY COUPLED CHANNEL          */ 02895000
*         4  RRNRBCCT BIT(1),    /* TIGHTLY COUPLED CHANNEL          */ 02896000
*         4  RRNRBSEC BIT(1),    /* SECONDARY CHANNEL EXIST          */ 02897000
*         4  RRNRBCT1 BIT(1),    /* PRIM CHAN TYPE (0=TYPE1,1=TYPE2) */ 02898000
*         4  RRNRBCT2 BIT(1),    /* SEC CHAN TYPE (0=TYPE1,1=TYPE2)  */ 02899000
*         4  RRNRSV03 BIT(1),    /* RESERVED                         */ 02900000
*         4  RRNRBBUP BIT(1),    /* BRINGUP IS TO BE EXERCISED     0741 02901000
*                                         FOR THIS RN DURING IPL     */ 02902000
*         4  RRNVYDON BIT(1),    /* RDT SEG IS BEING FREED           */ 02903000
*         4  RRNRSV01 BIT(5),    /* RESERVED                         */ 02904000
*         4  RRNPTASL BIT(1),    /* SOME PORT SOLICITOR IS WAITING 0741 02905000
*                                   TO BE REDRIVEN BY CLSDST         */ 02906000
*      3  RRNRSV55 CHAR(1),      /*  RESERVED                        */ 02907000
*   2  RRNCMF CHAR(4),           /*  FLAG FIELDS FOR COMMANDS        */ 02908000
*      3  RRNCMFA  BIT(8),       /* FLAG FIELD A -COMMANDS           */ 02909000
*         4  RRNCAALL BIT(1),    /* PHYSICAL DISCONNECT              */ 02910000
*         4  RRNCAATD BIT(1),    /* ACTIVATE DEVICE                  */ 02911000
*         4  RRNCAATG BIT(1),    /* ACTIVATE GROUP                   */ 02912000
*         4  RRNCAATI BIT(1),    /* ACTIVATE INVITES                 */ 02913000
*         4  RRNCAMBH BIT(1),    /* MODIFY BLOCK HANDLER SET         */ 02914000
*         4  RRNCACDT BIT(1),    /* CHANGE DATE AND TIME             */ 02915000
*         4  RRNCADTD BIT(1),    /* DEACTIVATE DEVICE                */ 02916000
*         4  RRNCADGO BIT(1),    /* DEACTIVATE GROUP ORDERLY         */ 02917000
*      3  RRNCMFB  BIT(8),       /* FLAG FIELD B - COMMANDS          */ 02918000
*         4  RRNCBDLO BIT(1),    /* DEACTIVATE LINE ORDERLY          */ 02919000
*         4  RRNCBDLH BIT(1),    /* DEACTIVATE LINE HALT             */ 02920000
*         4  RRNCBDLR BIT(1),    /* DISPLAY LINE RESOURCE ID         */ 02921000
*         4  RRNCBRDS BIT(1),    /* REQUEST DEVICE STATUS            */ 02922000
*         4  RRNCBRLS BIT(1),    /* REQUEST LINE STATUS              */ 02923000
*         4  RRNCBNPL BIT(1),    /* CHANGE LINE NEG POLL RESPONSE LIM*/ 02924000
*         4  RRNCBMOD BIT(1),    /* COPY/SET DESTINATION NODE        */ 02925000
*         4  RRNCBALT BIT(1),    /*  ACTIVATE LINE TRACE             */ 02926000
*      3  RRNCMFC  BIT(8),       /* FLAG FIELD C - COMMANDS          */ 02927000
*         4  RRNCCRCN BIT(1),    /* RESET CONDITIONAL                */ 02928000
*         4  RRNCCRDQ BIT(1),    /* RESET DEVICE QUEUE               */ 02929000
*         4  RRNCCRST BIT(1),    /* REQUEST DEVICE STATISTICS        */ 02930000
*         4  RRNCCCRC BIT(1),    /* CHANGE RETRY COUNTS              */ 02931000
*         4  RRNCCRIM BIT(1),    /* RESET IMMEDIATE                  */ 02932000
*         4  RRNCCRCM BIT(1),    /* RESET CONTROL MODE               */ 02933000
*         4  RRNCCSIM BIT(1),    /* COPY/REPLACE SESSION INIT INFO   */ 02934000
*         4  RRNCCCSL BIT(1),    /* CHANGE SESSION LIMIT             */ 02935000
*      3  RRNCMFD  BIT(8),       /* FLAG FIELD D - COMMANDS          */ 02936000
*         4  RRNCDCSP BIT(1),    /* CHANGE SERIVCE PAUSE             */ 02937000
*         4  RRNCDSTD BIT(1),    /* DISPLAY STORAGE                  */ 02938000
*         4  RRNCDDTL BIT(1),    /* CHANGE DEVICE TRANSMIT LIMIT     */ 02939000
*         4  RRNCDBCK BIT(1),    /* SWITCHED NETWORK BACKUP          */ 02940000
*         4  RRNCDDSI BIT(1),    /* COPY/REPLACE DEV SESSION INIT INFO* 02941000
*         4  RRNCDREC BIT(1),    /* RESET AT END OF COMMAND          */ 02942000
*         4  RRNREMPO BIT(1),    /* REMOTE POWER OFF                 */ 02943000
*         4 RRNRSV05  BIT(1),    /*       NOT  USED                  */ 02944000
*   2  RRNFLUX  PTR(31),         /* POINTER TO FIRST LUX             */ 02945000
*   2  RRNCPLUB CHAR(6),         /* SYMBOLIC UNIT NAME OF NCP DATASET*/ 02946000
*   2  RRNEPADR PTR(15),         /* EP SUBCHANNEL ADDRESS            */ 02947000
*   2  RRNNMDPD  CHAR(8),        /* FILENAME FOR DUMP DATA SET       */ 02948000
*      3  RRNDPLUB CHAR(6),      /* LUB NAME FOR DUMP DATASET        */ 02949000
*      3  RRNPUBI  BIT(8),       /* PUB INDEX                        */ 02950000
*      3  RRNRSV88 CHAR(1),      /* RESERVED-DOS ONLY                */ 02951000
*   2  RRNRSV04  CHAR(6),        /* RESERVED                         */ 02952000
*   2  RRNDELAY  CHAR(2),        /* INITIAL VALUE FROM DELAY         */ 02953000
*   2  RRNNMNCP  CHAR(8),        /* DSNAME FOR NCP LOAD MODULE       */ 02954000
*   2  RRNHPRE PTR(16),          /* HOST PREFIX INFORMATION          */ 02955000
*      3  RRNHLENH PTR(8),       /* LENGTH OF HOST HEADER PREFIX     */ 02956000
*      3  RRNHLENT PTR(8),       /* LENGTH OF HOST TEXT PREFIX       */ 02957000
*   2  RRNHBUFS FIXED(15),       /* SIZE OF BUFFER UNITS FOR HOST    */ 02958000
*   2  RRNCTPCC PTR(8),          /* CNT OF BUFFERS RECEIVING PCCU DATA* 02959000
*   2  RRNNCPNM CHAR(7),         /* NAME OF NCP LOAD MOD 7 CHAR MAX  */ 02960000
*   2  RRNMSIZE PTR(31),         /* MAX SIZE OF SEND                 */ 02961000
*   2  RRNRPLPT PTR(31),         /* C/R POINTER TO RPL               */ 02962000
*   2  RRNNCSPL PTR(31),         /* POINTER TO NCSPL                 */ 02963000
*   2  RRNLASTE PTR(31),         /* PTR TO LAST ENTRY IN RN SEGMENT  */ 02964000
*   2  RRNRDCUA CHAR(3),         /* DEFAULT CUA                      */ 02965000
*   2  *        PTR(8),          /* RESERVED                         */ 02966000
*   2  RRNRINNM CHAR(8);         /* DEFAULT INNODE NAME IN LOCAL   0741 02967000
*                                   RDT TO CONNECT REMOTE RN         */ 02968000
*                                                                  0741 02969000
*DCL                                                               0742 02970000
*1  ISTRGP BDY(WORD) BASED,      /* GROUP ENTRY                      */ 02971000
*   2  RGPPRE CHAR(LENGTH(ISTRPRE)),        /*  USE ISTRPRE DSECT    */ 02972000
*   2  RGPFLG BIT(8),            /*  FLAG FIELD                      */ 02973000
*      3  RGPADIL BIT(1),        /* =1 SWITCHED, =0 NON-SWIT         */ 02974000
*      3  RGPASS  BIT(1),        /* START/STOP                       */ 02975000
*      3  RGPABSC  BIT(1),       /* BINARY SYNCHRONOUS               */ 02976000
*      3  RGPASDLC BIT(1),       /* DATA LINK CONTROL                */ 02977000
*      3 RGPRSV02  BIT(4),       /*     NOT USED                     */ 02978000
*   2  RGPRSV03 FIXED(8),        /* USED TO FORCE ALINEMENT          */ 02979000
*   2  RGPCTELN FIXED(15),       /* COUNT OF LINE ENTRIES FOR GROUP  */ 02980000
*   2  RGPCTECL FIXED(15),       /* CNT OF CLUSTER ENTRIES FOR GROUP */ 02981000
*   2  RGPCTETR FIXED(15),       /* CNT TERMINAL ENTRIES FOR GROUP   */ 02982000
*   2  RGPCTEIN FIXED(15),       /* COUNT OF INNODE ENTRIES FOR GROUP*/ 02983000
*   2  RGPCTECM FIXED(15),       /* CNT COMPONENT ENTRIES FOR GROUP  */ 02984000
*   2  RGPRVPT1 PTR(31),         /* RESERVED                         */ 02985000
*   2  RGPRVPT2 PTR(31);         /* RESERVED                         */ 02986000
*                                                                  0742 02987000
*                                                                  0742 02988000
*DCL                                                               0743 02989000
*1  ISTRLN BDY(WORD) BASED,      /* LINE ENTRY                       */ 02990000
*   2  RLNPRE CHAR(LENGTH(ISTRPRE)), /* USE COMMON PREFIX            */ 02991000
*   2  RLNADR PTR(31),                                             0743 02992000
*      3  RLNFLAG BIT(8),                                          0743 02993000
*         4  RLNEAM   BIT(1),    /* ENABLE ANSWER MODE DONE          */ 02994000
*         4  RLNRBISA BIT(1),    /* INITIAL STATUS 1=ACTIVE          */ 02995000
*         4  RLNRSV01 BIT(6),    /* RESERVED                         */ 02996000
*      3  RLNUCBAD PTR(24),      /* UCB/PUB ADDRESS                  */ 02997000
*         4  RLNCUA CHAR(3),     /* NOT USED                         */ 02998000
*   2  RLNCTECL FIXED(15),       /* CNT OF CLUSTER ENTRIES FOR LINE  */ 02999000
*   2  RLNCTETR FIXED(15),       /* CNT OF TERMINAL ENTRIES FOR LINE */ 03000000
*   2  RLNCTEIN FIXED(15),       /* COUNT OF INNODE ENTRIES FOR LINE */ 03001000
*   2  RLNCTECM FIXED(15),       /* CNT OF COMPONENT ENTRIES FOR LINE*/ 03002000
*   2  RLNACTCT FIXED(15),       /* COUNT OF COMPONENTS, CLUSTERS  0743 03003000
*                                             AND TERMINALS ON LINE  */ 03004000
*   2  RLNSTAT1 BIT(8),          /* LINK TRAP STATUS                 */ 03005000
*      3 RLNTRAP  BIT(1),        /* INTERCEPT NEXT LINK OPERATION    */ 03006000
*      3 RLNLRST  BIT(1),        /* LINK RESTART COND CAUSED TRAP    */ 03007000
*      3 RLNINOPL BIT(1),        /* LINK INOP CONDITION CAUSED TRAP  */ 03008000
*      3 RLNINOPP BIT(1),        /* PU INOP CONDITION CAUSED TRAP    */ 03009000
*      3 RLNVD    BIT(1),        /* VARY INACT CONDITION CAUSED TRAP */ 03010000
*      3 RLNRSV03 BIT(3),        /* RESERVED                         */ 03011000
*    2 RLNSTAT2 BIT(8),          /* LINK NORMAL STATUS               */ 03012000
*      3 RLNOHIN  BIT(1),        /* OFFHOOK REPORTED TO SW SUBAREA-  */ 03013000
*                                /* REPLY DUE                        */ 03014000
*      3 RLNINUSE BIT(1),        /* LINK RESOURCES ALLOCATED TO PU   */ 03015000
*      3 RLNRSV04 BIT(6),        /* RESERVED                         */ 03016000
*   2  RLNRDF CHAR(4),           /*  RESOURCE DEFINITION FLAG        */ 03017000
*      3  RLNRDFA  BIT(8),       /* FLAGS FIELD A                    */ 03018000
*         4  RLNRACNT BIT(2),    /*  NEXT TWO FIELDS                 */ 03019000
*            5  RLNRACAT BIT(1), /* CALL INITIATOR-TERMINAL          */ 03020000
*            5  RLNRACAN BIT(1), /* CALL INITIATOR-NCP               */ 03021000
*         4  RLNGANSW BIT(1),    /* C/R GENNED IN ANSWER MODE, 1=YES */ 03022000
*         4  RLNPORT  BIT(1),    /* THIS IS A PORT ENTRY             */ 03023000
*         4  RLNIDV   BIT(1),    /* THIS IS AN ID VERIFIED PORT      */ 03024000
*         4  RLNRAEP  BIT(1),    /* TYPE IS EP                       */ 03025000
*         4  RLNRANCP BIT(1),    /* TYPE IS NCP                      */ 03026000
*         4  RLNRAPEP BIT(1),    /* TYPE IS PEP                      */ 03027000
*      3  RLNRDFB  BIT(8),       /* FLAGS FIELD B                    */ 03028000
*         4  RLNRBUSE BIT(1),    /* EP/NCP USE  1=NCP                */ 03029000
*         4  RLNANSWR BIT(1),    /* ON = SEND ENABLE ANSWER          */ 03030000
*                                /* AT ACTIVATE                      */ 03031000
*         4  RLNAUTOD BIT(1),    /* ON=AUTODIAL, OFF=MANUAL          */ 03032000
*         4  RLNRSV0B BIT(1),    /* RESERVED                         */ 03033000
*         4  RLNTTV   BIT(1),    /* THIS IS TERM TYPE VERIFICATION 0743 03034000
*                                   PORT                             */ 03035000
*         4  RLNRAPOL BIT(1),    /* POLLED LINE                      */ 03036000
*         4  RLNRATRN BIT(1),    /* SDLC LINE                        */ 03037000
*         4  RLNMULTP BIT(1),    /* 0 = POINT TO POINT,            0743 03038000
*                                   1 = MULTI POINT                  */ 03039000
*      3  RLNRDFC  BIT(8),       /* FLAGS FIELD C - LINE CODES       */ 03040000
*                                /* SEE CONSTANTS FOR DEFINITION     */ 03041000
*      3  RLNRDFD  BIT(8),       /* FLAGS FIELD D - RESERVED         */ 03042000
*   2  RLNAUTOA FIXED(15),       /* AUTOCALL ADDRESS                 */ 03043000
*   2  RLNRDSLM FIXED(8),        /* SCHED. LIM BASED ON LINE SPEED 2-4* 03044000
*   2  RLNCTSES FIXED(8),        /* COUNT OF CONCURRENT SESSIONS     */ 03045000
*   2  RLNACTRM PTR(8),          /* COUNT OF ACTIVE REMOTES FOR THIS    03046000
*                                   TRUNK                            */ 03047000
*   2  RLNRESV1 BIT(8),          /* RESERVED/UNUSED                  */ 03048000
*   2  RLNACTSN FIXED(15),       /* COUNT ACTIVE NODES ON LINK       */ 03049000
*   2  RLNPOLMT FIXED(8),        /* NEG POLL RESPONSE LIMIT          */ 03050000
*   2  RLNPAUSE FIXED(8),        /* POLL DELAY/PAUSE                 */ 03051000
*   2  RLNCRFLG BIT(8),          /* FLAG-CONFIGURATION RESTART       */ 03052000
*      3 RLNACTLN BIT(1),        /* ACTIVATE LINK OK                 */ 03053000
*      3 RLNSWNCP BIT(1),        /* SWITCH PEP LINE TO NCP OK        */ 03054000
*      3 RLNLSCMD BIT(3),        /* LINE SCHEDULING COMMANDS       0743 03055000
*                                   ISSUED OK                        */ 03056000
*        4 RLNNPRLM BIT(1),      /* CHNG NEG POLL RESP LIMIT OK      */ 03057000
*        4 RLNSESLM BIT(1),      /* CHNG SESSION LIMIT OK            */ 03058000
*        4 RLNSVSKP BIT(1),      /* CHNG SERVICE SEEK PAUSE OK       */ 03059000
*      3 RLNSWEP  BIT(1),        /* SWITCH TO EP                     */ 03060000
*      3 RLNCRRSV BIT(2),        /* RESERVED FOR CONFIG RESTART      */ 03061000
*   2  *        CHAR(1),         /* RESERVED                         */ 03062000
*   2  RLNX2SW  PTR(31),         /* ADDRESS OF 370X TO SWITCH        */ 03063000
*                                /* COMMUNICATION NCSPL              */ 03064000
*   2  RLNNCSPL PTR(31),         /* ADDRESS OF SPIN-OFF NCSPL        */ 03065000
*                                /* FOR VARY DEACTIVATE              */ 03066000
*   2  RLNRVPT2 PTR(31);         /* RESERVED                         */ 03067000
*                                                                  0743 03068000
*                                                                  0743 03069000
*DCL RLNRCEDC BIT(8) CONSTANT('01'X);  /* EBCDIC (CONSTANTS)         */ 03070000
*DCL RLNRCUSA BIT(8) CONSTANT('02'X);  /* USASCII                    */ 03071000
*DCL RLNRCBCD BIT(8) CONSTANT('03'X);  /* BCD                        */ 03072000
*DCL RLNRCEBC BIT(8) CONSTANT('04'X);  /* EBCD                       */ 03073000
*DCL RLNRCCOR BIT(8) CONSTANT('05'X);  /* COR                        */ 03074000
*DCL RLNRCKAT BIT(8) CONSTANT('06'X);  /* KATAKANA                   */ 03075000
*DCL RLNRCIT2 BIT(8) CONSTANT('08'X);  /* ITA2                       */ 03076000
*DCL RLNRCZS3 BIT(8) CONSTANT('09'X);  /* ZSC3                       */ 03077000
*                                                                  0751 03078000
*                                                                  0751 03079000
*DCL                                                               0752 03080000
*1  ISTRPT BDY(WORD) BASED,        /* PORT ENTRY                     */ 03081000
*   2 RPTLN CHAR(LENGTH(ISTRLN)),  /* INCLUDE LINE ENTRY             */ 03082000
*   2 RPTLNCID BDY(WORD) CHAR(4),  /* COMM ID OF LINE                */ 03083000
*     3 RPTLNSAF CHAR(2),          /* SAF                            */ 03084000
*     3 RPTLNDAF CHAR(2),          /* DAF                            */ 03085000
*   2 RPTCTNM CHAR(8),             /* CTERM NAME                     */ 03086000
*   2 RPTDITT PTR(31),             /* POINTER TO DITT TABLE          */ 03087000
*     3 RPTDIVT PTR(31),           /* POINTER TO DIVT TABLE          */ 03088000
*   2 RPTATERM PTR(31),            /* POINTER TO ASSOCIATED ENTRY    */ 03089000
*   2 RPTUTERM PTR(31),            /* POINTER TO UTERM ENTRY         */ 03090000
*   2 RPTFLAG1 CHAR(1),            /* PORT SOLICITOR FLAGS           */ 03091000
*     3  RPTASLEP BIT(1),          /* THIS PORT SOLICITOR IS WAITING    03092000
*                                     TO BE REDRIVEN BY CLSDST       */ 03093000
*     3 RPTVRYPD BIT(1),           /* VARY PENDING IN THIS CTERM     */ 03094000
*     3 RPTHLVPD BIT(1),           /* VARY PENDING IN HIGHER LEVEL 0752 03095000
*                                     NODE                           */ 03096000
*     3 RPTONLIN BIT(1),           /* ONLINE/OFFLINE(VARY)           */ 03097000
*     3 RPTVIODN BIT(1),           /* I/O DONE FOR THIS NODE         */ 03098000
*     3 RPTVYIMM BIT(1),           /* VARY IMM ISSUED FOR PORT       */ 03099000
*     3 RPTDYNAM BIT(1),           /* BHSET = DYNAMIC                */ 03100000
*     3 RPTISTAT BIT(1),           /* CTERM(PORT) IS INITIALLY ACTIVE*/ 03101000
*                                  /* 1 = YES                        */ 03102000
*   2 RPTRSV01 CHAR(1),            /* RESERVED                       */ 03103000
*   2 RPTDAFSV BIT(16),            /* SAVE TERMINAL DAF              */ 03104000
*   2 RPTPEPCT FIXED(15),          /* PEP COUNT FOR CTERM            */ 03105000
*   2 RPTPTHCT FIXED(15),          /* PATH COUNT FOR CTERM           */ 03106000
*   2 RPTNSNSV PTR(31),            /* SAVE TERMINAL NEXT SCHED NODE     03107000
*                                     POINTER                        */ 03108000
*   2  RPTRSV02 PTR(31),           /* RESERVED                       */ 03109000
*   2  RPTRSV03 PTR(31);           /* RESERVED                       */ 03110000
*                                                                  0752 03111000
*                                                                  0752 03112000
*DCL                                                               0753 03113000
*1  ISTRCL BDY(WORD) BASED,      /* CLUSTER ENTRY                    */ 03114000
*   2  RCLPRE CHAR(LENGTH(ISTRPRE)),    /* USE COMMON PREFIX         */ 03115000
*   2  RCLADR PTR(31),                                             0753 03116000
*      3  RCLFLAG BIT(8),                                          0753 03117000
*         4  RCLRSV22 BIT(1),    /* RESERVED                         */ 03118000
*         4  RCLRBISA BIT(1),    /* INITIAL STATUS 1=ACTIVE          */ 03119000
*         4  RCLBATCH BIT(1),    /* BATCHED MESSAGE INPUT          0753 03120000
*                                   FEATURE                          */ 03121000
*         4  RCLRSV33 BIT(5),    /* RESERVED                         */ 03122000
*      3  RCLGPADR PTR(24),      /* ADDRESSING INFORMATION POINTER 0753 03123000
*                                                  (ADDR RCLCNGP)    */ 03124000
*   2  RCLCTETR FIXED(15),       /* CNT TERMINAL ENTRIES FOR CLUSTER */ 03125000
*   2  RCLCTECM FIXED(15),       /* CNT COMPONENT ENTRIES FOR CLUSTER*/ 03126000
*   2  RCLRSV01 FIXED(15),       /* FILLER TO FORCE ALIGNMENT        */ 03127000
*   2  RCLCTNGP FIXED(15),       /* GPOLL CHARACTER COUNT            */ 03128000
*   2  RCLGPOLA PTR(31),         /* GPOLL CHARACTER STRING POINTER   */ 03129000
*   2  RCLRVPT1 PTR(31),         /* RESERVED                         */ 03130000
*   2  RCLRVPT2 PTR(31);         /* RESERVED                         */ 03131000
*                                                                  0753 03132000
*                                                                  0753 03133000
*DCL                                                               0754 03134000
*1  ISTRTR BDY(WORD) BASED,      /* TERMINAL AND/OR COMPONENT ENTRY  */ 03135000
*   2  RTRCRPR CHAR(LENGTH(ISTRCPRE)),     /* USE ISTRCPRE DSECT     */ 03136000
*   2  RTRADR PTR(31),                                             0754 03137000
*      3  RTRFLAG BIT(8),                                          0754 03138000
*         4  RTRRSV21 BIT (1),   /* RESERVED */                    0754 03139000
*         4  RTRRBISA BIT(1),    /* INITIAL STATUS 1 = ACITVE        */ 03140000
*         4  RTRRSV51 BIT(3),    /* RESERVED                         */ 03141000
*         4  RTRVTERM BIT(1),    /* VTERM TERMINAL ENTRY             */ 03142000
*         4 RTRRSV22 BIT(2),     /* UNUSED                           */ 03143000
*      3  RTRADRPT PTR(24),      /* TO BE USED FOR POINTER TO      0754 03144000
*                                            ADDRESSING INFORMATION  */ 03145000
*   2  RTRCTECM FIXED(15),       /* COUNT OF COMPONENT             0754 03146000
*                                               ENTRIES FOR TERMINAL */ 03147000
*   2  RTRRSV01 FIXED(15),       /*  FILLER TO FORCE ALINEMENT       */ 03148000
*   2  RTRRSV45 CHAR(4),         /* RESERVED                         */ 03149000
*   2  RTRRDFA  BIT(8),          /* FLAG FIELD A                     */ 03150000
*      3  RTRRAATN BIT(1),       /* TERMINAL CAN INTERRUPT PCCU      */ 03151000
*      3  RTRRAALL BIT(3),       /* 3 FLAG FIELD                     */ 03152000
*         4  RTRRAPT1 BIT(1),    /* PT1 BLOCK HANDLER FLAGS          */ 03153000
*         4  RTRRAPT2 BIT(1),    /* PT2                              */ 03154000
*         4  RTRRAPT3 BIT(1),    /* PT3                              */ 03155000
*      3  RTRRACDT BIT(1),       /* CRITICAL DATA FLAG               */ 03156000
*      3  RTRRSV60 BIT(1),       /* RESERVED                         */ 03157000
*      3  RTRRACTR BIT(1),       /* LOGICAL DEVICE FLAG              */ 03158000
*      3  RTRRSV02 BIT(1),       /* UNUSED                           */ 03159000
*   2  RTRRDFB  BIT(8),          /* FLAG FIELD B - RESOURCE DEF      */ 03160000
*      3  RTRRBECT BIT(1),       /* EMBEDDED LINE CONTROL            */ 03161000
*      3  RTRRBEND BIT(1),       /* EOT/EOB                          */ 03162000
*      3  RTRRSV32 BIT(6),       /* RESERVED                         */ 03163000
*   2  RTRRDFC  BIT(8),          /* FLAG FIELD C - RESOURCE DEF      */ 03164000
*      3  RTRRCIT1 BIT(1),       /* EIB CHAR AFTER ITB ON RECV       */ 03165000
*      3  RTRRCIT2 BIT(1),       /* EIB CHAR AFTER ITB ON SEND       */ 03166000
*      3  RTRRCPT3 BIT(1),       /* DEVICE HAS PT3 BHSET             */ 03167000
*      3  RTRRCBLK BIT(1),       /* RECORD DATA - BLOCK              */ 03168000
*      3  RTRRCMSG BIT(1),       /* RECORD DATA - MESSAGE            */ 03169000
*      3  RTRRCXMS BIT(1),       /* RECORD DATA - XMISSION           */ 03170000
*      3  RTRRSV23 BIT(2),       /* RESERVED/UNUSED                  */ 03171000
*   2  RTRRDFD  BIT(8),          /* FLAG FIELD D - RESERVED          */ 03172000
*      3  RTRRDBHN  BIT(1),      /* BHSET = NONE                     */ 03173000
*      3  RTRRDBHD  BIT(1),      /* BHSET = DYNAMIC                  */ 03174000
*      3  RTRRDBHI  BIT(1),      /* BHSET = SETNAME AND EXECUTR      */ 03175000
*      3  RTRRSV10 BIT(2),       /* RESERVED                         */ 03176000
*      3  RTRRSV11 BIT(3),       /* RESERVED                         */ 03177000
*   2  RTRRDFE  BIT(8),          /* FLAG FIELD E - RESOURCE DEF      */ 03178000
*/*                RTRREFT1  FEATURE FLAGS  (9 BITS)                 */ 03179000
*      3  RTRREBRK BIT(1),       /* TRANSMIT INTERRUPT               */ 03180000
*      3  RTRRSV0A BIT(1),       /* RESERVED                         */ 03181000
*      3  RTRREACR BIT(1),       /* ACCELERATED CARRIAGE RETURN      */ 03182000
*      3  RTRRECHK BIT(1),       /* CHECKING FEATURE                 */ 03183000
*      3  RTRREATT BIT(1),       /*  TERMINAL INTERRUPT              */ 03184000
*      3  RTRRESUP BIT(1),       /*  TIMEOUT SUPPRESSION             */ 03185000
*      3  RTRRESCT BIT(1),       /*  STATION CONTROL                 */ 03186000
*   2  RTRRDFF  BIT(8),          /* FLAG FIELD F - RESOURCE DEF      */ 03187000
*      3  RTRRFXCT BIT(1),       /* TRANSMIT CONTROL                 */ 03188000
*/*                      RTRRFFT2 FEATURE 2 FLAGS (NEXT 5 BITS)      */ 03189000
*      3  RTRRFPEN BIT(1),       /* SELECTOR PEN                     */ 03190000
*      3  RTRRFPFK BIT(1),       /* PROGRAM FUNCTION DEYBOARD        */ 03191000
*      3  RTRRFANK BIT(1),       /* STANDARD ALPHA-NUMERIC KEYBOARD  */ 03192000
*      3  RTRRFDEK BIT(1),       /* DATA ENTRY KEYBOARD              */ 03193000
*      3  RTRRSV24 BIT(3),       /* UNUSED/RESERVED                  */ 03194000
*   2  RTRTRMAX CHAR(1),         /* MAX # TRANSMISSIONS TERM TO PCCU */ 03195000
*   2  RTRCRFLG PTR(8),          /* FLAG-CONFIGURATION RESTART       */ 03196000
*      3 RTRCRSV1 BIT(2),        /* RESERVED FOR CONFIG RESTART      */ 03197000
*      3 RTRLSCMD BIT(1),        /* LINE SCHEDULING CMD ISSUED OK    */ 03198000
*        4 RTRDTRLM BIT(1),      /* CHNG DEV TRANSMISSION LIMIT OK   */ 03199000
*      3 RTRCRSV2 BIT(5),        /* RESERVED FOR CONFIG. RESTART     */ 03200000
*   2  RTRBHSN1 CHAR(8),         /* DEFAULT BHSET NAME IS BHF IS ON  */ 03201000
*   2  RTRRVPT1 PTR(31),         /* RESERVED                         */ 03202000
*   2  RTRRSV03 FIXED(15),       /* FILLER TO FORCE ALIGNMENT        */ 03203000
*   2  RTRCTDIA FIXED(15),       /* CNT OF CHARS. IN TERM DIAL NUMBER*/ 03204000
*   2  RTRCTPOL FIXED(15),       /* # CHARS. IN TERM POLL STRING     */ 03205000
*   2  RTRCTADR FIXED(15),       /* COUNT OF ADDRESSING CHARACTERS   */ 03206000
*   2  RTRCADDR  CHAR(8),        /* COMPONENT ADDRESSING CHARS       */ 03207000
*   2  RTRPOLA PTR(31),          /* POINTER TO POLLING CHARACTERS    */ 03208000
*   2  RTRDIAA PTR(31),          /* POINTING TO DIAL CHARACTERS      */ 03209000
*   2  RTRRDFG  BIT(8),          /* CORRESPONDENCE CODE USED BY THIS    03210000
*                                   TERM LINE. SEE CONSTANTS.        */ 03211000
*   2  RTRRSVDD CHAR(7),         /* RESERVED                         */ 03212000
*   2  RTRBSCID CHAR(21),        /* BSC ID FIELD                     */ 03213000
*      3  RTRIDLEN FIXED(8),     /* LENGTH OF ID                     */ 03214000
*      3  RTRIDCAS CHAR(20),     /* ID CHARACTER                     */ 03215000
*   2  RTRLCTI BIT(8),           /* LINE CONTROL TYPE ID             */ 03216000
*   2  RTRRSV04 CHAR(2);         /* RESERVED                         */ 03217000
*                                                                  0754 03218000
* DCL RTRDNCBA PTR(31) DEF(ISTRTR) POS(41);  /* SCAFFOLDING          */ 03219000
*/* CONSTANTS FOR FIELD RTRRDFG                                      */ 03220000
*DCL RTRRCBCD BIT(8) CONSTANT('03'X); /* BCD                         */ 03221000
*DCL RTRRCEBC BIT(8) CONSTANT('04'X); /* EBCD                        */ 03222000
*DCL RTRRCCOR BIT(8) CONSTANT('05'X); /* COR                         */ 03223000
*                                                                  0758 03224000
*/*     CONSTANTS FOR FIELD RTRLCTI                                  */ 03225000
*DCL RTR2741  BIT(8) CONSTANT('00'X);  /* 2741                       */ 03226000
*DCL RTR2740A BIT(8) CONSTANT('02'X);  /* 2740-1 A (BASIC)           */ 03227000
*DCL RTR2740D BIT(8) CONSTANT('06'X);  /* 2740-1 D (TRANS CONTROL)   */ 03228000
*DCL RTR2740E BIT(8) CONSTANT('0A'X);  /* 2740-1 E (TRANS          0762 03229000
*                                   CONTROL WITH CHECKING            */ 03230000
*DCL RTR2740F BIT(8) CONSTANT('0C'X);  /* 2740-1 F (CHECKING)        */ 03231000
*DCL RTR1050  BIT(8) CONSTANT('1C'X);  /* 1050                       */ 03232000
*DCL RTRTWX   BIT(8) CONSTANT('22'X);  /* TWX                        */ 03233000
*/*                                                                  */ 03234000
*/*   ENTRY IN LOCAL RN FOR REMOTE SEGMENT                           */ 03235000
*/*                                                                  */ 03236000
*DCL  1  ISTRIN   BDY(WORD) BASED,   /* INNODE REMOTE ENT IN LOCAL RN*/ 03237000
*        2 RINCRPRE CHAR(LENGTH(ISTRCPRE)),  /* PREFIX               */ 03238000
*        2 RINDFD   BIT(8),          /* FLAG FIELD                   */ 03239000
*          3 RINREMPO BIT(1),        /* REMOTE POWER OFF             */ 03240000
*            4 RTRREMPO BIT(1),      /* ALIAS                        */ 03241000
*          3 RINNODEF BIT(1),        /* REMOTE TERM ENTRY INV AS ENT */ 03242000
*            4 RTRNODEF BIT(1),      /* ALIAS                        */ 03243000
*          3 RINLDISC BIT(1),        /* DISCONNECT REMOTE REQUIRED   */ 03244000
*            4 RTRLDISC BIT(1),      /* ALIAS                        */ 03245000
*          3 RINRSV01 BIT(5),        /* RESERVED                     */ 03246000
*        2 RINNODID PTR(8),          /* NODE ID OF REMOTE            */ 03247000
*          3 RTRNODID PTR(8),        /* ALIAS                        */ 03248000
*        2 RINRLDAF CHAR(2),         /* DAF OF REMOTE WHEN ACTIVE    */ 03249000
*          3 RTRRLDAF CHAR(2),       /* ALIAS                        */ 03250000
*        2 RINREMOT PTR(31),         /* PTR TO RN ENTRY FOR REMOTE   */ 03251000
*          3 RTRREMOT PTR(31),       /* ALIAS                        */ 03252000
*        2 RINVPAB  PTR(31),         /* ADDR VARY PAB FOR REMOTE     */ 03253000
*          3 RTRVPAB  PTR(31),       /* ALIAS                        */ 03254000
*        2 RINRPHCN PTR(31),         /* ADDR RPH WAITING FOR CONTACT */ 03255000
*          3 RTRRPHCN PTR(31),       /* ALIAS                        */ 03256000
*        2 RINNCSPL PTR(31),         /* ADDR FOR NCSPL FOR DEACTIVATE*/ 03257000
*          3 RTRNCSPL PTR(31),       /* ALIAS                        */ 03258000
*        2 RINCNCNT PTR(8),          /* CONTACT COUNT FOR REMOTE     */ 03259000
*          3 RTRCNCNT PTR(8),        /* ALIAS                        */ 03260000
*        2 RINRSV02 CHAR(3),         /* RESERVED                     */ 03261000
*        2 RINLOCRN PTR(31),         /* PTR TO RN ENTRY OF LOCAL     */ 03262000
*        2 RINRSV04 CHAR(4),         /* RESERVED                     */ 03263000
*        2 RINRSV05 CHAR(4);         /* RESERVED                     */ 03264000
*/*                                                                  */ 03265000
*DCL                                                               0767 03266000
*1   ISTRDS BDY(WORD) BASED,       /* LCDO ENTRY                     */ 03267000
*           2  RDSPRE CHAR(LENGTH(ISTRPRE)), /* ENTRY PREFIX         */ 03268000
*           2  RDSCTTRM FIXED(15), /* COUNT OF ENTRY POINTERS      0767 03269000
*                                     IN DIAL OUT TABLE              */ 03270000
*           2  RDSCTATR FIXED(15), /*                                */ 03271000
*           2  RDSADDOT PTR(31);   /* ADDRESS OF DIAL OUT TABLE      */ 03272000
*/*                                                                  */ 03273000
*DCL                                                               0768 03274000
*1   ISTDOT BDY(WORD) BASED,       /* DIAL OUT TABLE                 */ 03275000
*           2  DOTADTRM PTR(31);   /* PTR TO DIAL OUT OR DIAL IN/  0768 03276000
*                                     OUT TERMINAL RDTE              */ 03277000
*/*                                                                  */ 03278000
*DCL                                                               0769 03279000
*1 ISTRCC BDY(WORD) BASED,             /* PU ENTRY                   */ 03280000
*  2 RCCPRE   CHAR(LENGTH(ISTRPRE)),   /* COMMON PREFIX              */ 03281000
*  2 RCCTYPE  CHAR(1),                 /* PU TYPE                    */ 03282000
*  2 RCCFLAG  BIT(8),                  /* FLAG FIELD                 */ 03283000
*    3 RCCRBISA BIT(1),                /* I STATUS 1=ACTIVE          */ 03284000
*    3 RCCCUDIE BIT(1),                /* CLUSTER DEACTIVATING       */ 03285000
*    3 RCCERPIP BIT(1),                /* ERP IN PROCESS             */ 03286000
*    3 RCCLDISC BIT(1),                /* DISCONNECT REQUEST         */ 03287000
*    3 RCCOHIMM BIT(1),                /* RTGOH RECEIVED AND WAS     */ 03288000
*                                      /* AN IMMEDIATE TYPE          */ 03289000
*    3 RCCOUERP BIT(1),                /* REPEAT ERP                 */ 03290000
*    3 RCCPRGDN BIT(1),                /* PURGE ISSUED               */ 03291000
*    3 RCCCTPGD BIT(1),                /* CONTACT PURGED             */ 03292000
*  2 RCCFLAGB BIT(8),                  /* FLAG FIELD                 */ 03293000
*    3 RCCDSTCT BIT(1),                /* DEACT TO DECR STCNT IN HDR */ 03294000
*    3 RCCDIALP BIT(1),                /* DIAL IN PROGRESS           */ 03295000
*    3 RCCIRETR BIT(1),                /* IRETRY 1 = YES             */ 03296000
*    3 RCCBNNSP BIT(1),                /* BNNSUP FOR 3270            */ 03297000
*    3 RCCFINAL BIT(1),                /* ON = DEACT PU FINAL REQD   */ 03298000
*    3 RCCRESET BIT(1),                /* ON = RESET DEACT IN PROCESS*/ 03299000
*    3 RCCBRKCN BIT(1),                /* ON-DISCOUNT=YES SPECIFIED  */ 03300000
*                                      /* OFF-DISCOUNT=NO SPECIFIED  */ 03301000
*    3 RCCRTGOH BIT(1),                /* ON=RTGOH RECEIVED          */ 03302000
*  2 RCCCNCNT  PTR(8),                 /* CONTACT COUNT              */ 03303000
*  2 RCCCTELU FIXED(15),               /* COUNT OF PU LU ENTRIES     */ 03304000
*  2 RCCSTAID CHAR(8),                 /* 64 BIT PU STATION ID       */ 03305000
*    3 RCCIDPA1 BIT(16),               /* FILLER OF 2 BYTES OF 0     */ 03306000
*    3 RCCID48,                                                    0769 03307000
*      4 RCCIDPUT BIT(8),              /* PU TYPE                    */ 03308000
*      4 RCCIDPA2 BIT(8),              /* FILLER OF 1 BYTE OF 0      */ 03309000
*      4 RCCIDBLK BIT(12),             /* IDBLK VALUE                */ 03310000
*      4 RCCIDNUM BIT(20),             /* IDNUM VALUE                */ 03311000
*  2 RCCSESCT PTR(8),                  /* SESSION COUNT              */ 03312000
*  2 *        CHAR(1),                 /* RESERVED                   */ 03313000
*  2  RCCVPAB PTR(31),                 /* ADDRESS OF VARY PAB        */ 03314000
*  2 RCCDPAB  PTR(31),                 /* ADDR RESTART PAB           */ 03315000
*  2 RCCEPAB  PTR(31),                 /* ADDR OF ERP PAB            */ 03316000
*  2 RCCRPHCN PTR(31),                 /* ADDR RPH WAIT FOR CONTACT  */ 03317000
*  2 RCCNCSPL PTR(31),                 /* ADDR NCSPL FOR DEACTIVATE  */ 03318000
*  2 RCCCRFLG BIT(8),                  /* FLAG-CONFIGURATION RESTART */ 03319000
*    3 RCCACTPU BIT(1),                /* ACTIVATE PHYSICAL          */ 03320000
*    3 RCCCTCFL BIT(1),          /* HIGHER FAILURE-CONTACT FLUSHED   */ 03321000
*    3 RCCCRRSV BIT(6),                /* RES. FOR CONFIG. RESTART   */ 03322000
*  2 RCCRSV02 PTR(24),                 /* RESERVED                   */ 03323000
*  2 RCCTPAB  PTR(31),                 /* TOLTEP SSCP PAB            */ 03324000
*  2 RCCDPQ   PTR(31),                 /* DIAL PENDING NCSPL QUE PTR */ 03325000
*  2 RCCPATHT PTR(31),                 /* PTR TO PATH TABLE          */ 03326000
*  2 RCCPATHZ FIXED(15),               /* # ENTRIES IN PATH TABLE    */ 03327000
*  2 RCCINDEX FIXED(15),               /* INDEX TO PATH TABLE        */ 03328000
*  2 RCCMXDAT FIXED(15),               /* MAXDATA SIZE               */ 03329000
*  2 RCCMXOUT FIXED(8),                /* MAXOUT VALUE               */ 03330000
*  2 RCCPASSL FIXED(8),                /* PASSLIM VALUE              */ 03331000
*  2 RCCADDR  FIXED(8),                /* STATION ADDRESS            */ 03332000
*  2 RCCRSPT2 PTR(24),                 /* RESERVED                   */ 03333000
*  2 RCCSWTOX PTR(31),                 /* SWITCHED TO 370X           */ 03334000
*                                      /* COMMUNICATIONS NCSPL       */ 03335000
*  2 RCCXTOSW PTR(31),                 /* 370X TO SWITCHED           */ 03336000
*                                      /* COMMUNICATIONS NCSPL       */ 03337000
*  2 RCCRVPT2 PTR(31);                 /* RESERVED                   */ 03338000
*/* RCCTYPE - PU TYPE CODES                                          */ 03339000
*DCL RCCPU01  BIT(8) CONSTANT('01'X);  /* PU TYPE 1                  */ 03340000
*DCL RCCPU02  BIT(8) CONSTANT('02'X);  /* PU TYPE 2                  */ 03341000
*DCL RCCPU03  BIT(8) CONSTANT('03'X);  /* PU TYPE 3                  */ 03342000
*DCL RCCPU04  BIT(8) CONSTANT('04'X);  /* PU TYPE 4                  */ 03343000
*/*                                                                  */ 03344000
*DCL                                                               0774 03345000
*1 ISTRLU BDY(WORD) BASED,             /* LU ENTRY                   */ 03346000
*  2 RLUCRPR CHAR(LENGTH(ISTRCPRE)),   /* COMMON PREFIX              */ 03347000
*  2 RLUTYPE  CHAR(1),                 /* LU TYPE                    */ 03348000
*  2 RLUFLAG  CHAR(1),                 /* RLU FLAGS                  */ 03349000
*    3 RLURBISA BIT(1),                /* I STATUS 1=ACTIVE          */ 03350000
*    3 RLUBATCH BIT(1),                /* 1 IF BATCH = YES           */ 03351000
*    3 RLUGSTAT BIT(1),                /* C/R GENNED ISTATUS VALUE   */ 03352000
*                                      /* 1 = ACTIVE                 */ 03353000
*    3 RLUNDSES BIT(1),                /* SPECIAL END SESSION        */ 03354000
*    3 RLURSV00 BIT(4),                /* RESERVED                   */ 03355000
*  2 RLUCRFLG BIT(8),                  /* FLAG-CONFIGURATION RESTART */ 03356000
*    3 RLUACTLU BIT(1),                /* ACTIVATE LOGICAL UNIT OK   */ 03357000
*    3 RLUCRRSV BIT(7),                /* RESERVED FOR CONFIG RESTART*/ 03358000
*  2 RLUSSCFM BIT(8),                  /* FUNCTION MANAGER TYPE      */ 03359000
*  2 RLUINTA PTR(31),                  /* RESERVED                   */ 03360000
*  2 RLUPACE CHAR(2),                  /* VPACING COUNTS             */ 03361000
*    3 RLUPACEN CHAR(1),               /* N COUNT                    */ 03362000
*    3 RLUPACEM CHAR(1),               /* M COUNT                    */ 03363000
*  2 RLUNCPPC CHAR(2),                 /* NCP PACING COUNTS          */ 03364000
*    3 RLUNCPPN CHAR(1),               /* N COUNT                    */ 03365000
*    3 RLUNCPPM CHAR(1),               /* M COUNT                    */ 03366000
*  2 RLULOCAD CHAR(1),                 /* LOCAL ADDRESS OF LU        */ 03367000
*  2 RLURSV01 CHAR(3),                 /* RESERVED                   */ 03368000
*  2 RLUUSSTB CHAR(12) BDY(WORD),      /* USSTAB                     */ 03369000
*    3 RLUUSSNM CHAR(8),               /* USSTAB NAME                */ 03370000
*    3 RLUUSSPT PTR(31),               /* USSTAB ADDRESS             */ 03371000
*  2 RLUMODET CHAR(12) BDY(WORD),      /* MODETAB                    */ 03372000
*    3 RLUMODEN CHAR(8),               /* MODETAB NAME               */ 03373000
*    3 RLUMODEP PTR(31),               /* MODETAB ADDRESS            */ 03374000
*  2 RLULGMOD CHAR(8),                 /* LOGMODE                    */ 03375000
*  2 RLURSV02 PTR(31);                 /* RESERVED                   */ 03376000
*/*  RLUSSCFM - FOLLOWING EQUATES ARE FOR THE VARIOUS                */ 03377000
*/*             FUNCTION MANAGER TYPES                               */ 03378000
*DCL RLUFSS   BIT(8) CONSTANT('01'X);  /* FORMATTED SYS SERVICES     */ 03379000
*DCL RLUUSS   BIT(8) CONSTANT('02'X);  /* UNFORMATTED SYS SERVICES   */ 03380000
*DCL RLUU3270 BIT(8) CONSTANT('04'X);  /* UNFORMATTED SYS SVCS 3270  */ 03381000
*/*  RLUTYPE - EQUATES FOR LU TYPE                                   */ 03382000
*DCL RLUTYP04 BIT(8) CONSTANT('04'X);  /* LU TYPE IS 4               */ 03383000
*/*                                                                  */ 03384000
*DCL 1 ISTRPX BDY(WORD) BASED,     /* SKELETON PUX ENTRY             */ 03385000
*      2 RPXPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX             */ 03386000
*      2 RPXFLUX  PTR(31),         /* PTR TO FIRST LUX IN CHAIN      */ 03387000
*      2 RPXMAXLU PTR(8),          /* MAX NUMBER OF LU'S             */ 03388000
*                                  /* FOR THIS LINK                  */ 03389000
*      2 RPXRSV02 PTR(24),         /* RESERVED                       */ 03390000
*      2 RPXRSV01 PTR(31);         /* RESERVED                       */ 03391000
*/*                                                                  */ 03392000
*DCL 1 ISTRLX BDY(WORD) BASED,     /* SKELETON LUX ENTRY             */ 03393000
*      2 RLXPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX             */ 03394000
*      2 RLXNLUX  PTR(31),         /* PTR TO NEXT LUX IN CHAIN       */ 03395000
*      2 RLXFLAGA CHAR(1),         /* FLAG BYTE                      */ 03396000
*        3 RLXINUSE BIT(1),        /* ON = LUX IS IN USE             */ 03397000
*        3 RLXRSV01 BIT(7),        /* RESERVED                       */ 03398000
*      2 RLXRSV02 CHAR(3),         /* RESERVED                       */ 03399000
*      2 RLXRSV03 PTR(31);         /* RESERVED                       */ 03400000
*/*                                                                  */ 03401000
*DCL 1 ISTRSW BDY(WORD) BASED,     /* SWITCHED SUBAREA HDR ENTRY     */ 03402000
*      2 RSWPRE CHAR(LENGTH(ISTRDT)),   /* USE ISTRDT DSECT          */ 03403000
*      2 RSWDIALT PTR(31),         /* PTR TO DIAL #'S TABLE          */ 03404000
*      2 RSWGRUPT PTR(31),         /* PTR TO GROUP NAMES TABLE       */ 03405000
*      2 RSWDIALZ FIXED(15),       /* # ENTRIES IN DIAL NO. TABLE    */ 03406000
*      2 RSWGRUPZ FIXED(15),       /* # ENTRIES IN GRP NAME TABLE    */ 03407000
*      2 RSWCTELU FIXED(15),       /* COUNT OF LU ENTRIES IN THIS SEG*/ 03408000
*      2 RSWRSV02 CHAR(2),         /* RESERVED                       */ 03409000
*      2 RSWRSV01 PTR(31);         /* RESERVED                       */ 03410000
*/*                                                                  */ 03411000
*DCL 1 ISTRDA BDY(WORD) BASED,     /* DAN ENTRY                      */ 03412000
*      2 RDAPRE CHAR(LENGTH(ISTRPRE)),  /* COMMON PREFIX             */ 03413000
*      2 RDAADR   PTR(31),                                         0782 03414000
*        3 RDAFLAG  BIT(8),        /* FLAG BYTE                      */ 03415000
*          4 RDARBISA BIT(1),      /* INITIAL STATUS, 1 = ACTIVE     */ 03416000
*          4 RDARSV01 BIT(7),      /* RESERVED                       */ 03417000
*        3 RDAUCBAD PTR(24),       /* UCB.PUB ADDRESS                */ 03418000
*          4 RDACHQI  BIT(8),      /* CHANNEL QUEUE INDEX            */ 03419000
*          4 RDALUBA  BIT(16),     /* @ OF LOGICAL UNIT BLOCK        */ 03420000
*      2 RDADACUA CHAR(3),         /* CHANNEL UNIT ADDRESS           */ 03421000
*      2 RDACTPCC PTR(8),          /* CNT OF BUFFERS RECEIVING DATA  */ 03422000
*      2 RDADFCUA CHAR(3),         /* DEFAULT CUA                    */ 03423000
*      2 RDAPUBI  BIT(8),          /* PUB INDEX                      */ 03424000
*      2 RDARSVPT PTR(31);         /* RESERVED                       */ 03425000
*/*                                                                  */ 03426000
*DCL 1 ISTRLS BDY(WORD) BASED,     /* LOCAL SUBAREA HEADER ENTRY     */ 03427000
*      2 RLSPRE CHAR(LENGTH(ISTRDT)),   /* USE ISTRDT DSECT          */ 03428000
*      2 RLSCTELU FIXED(15),       /* COUNT OF LU ENTRIES IN THIS SEG*/ 03429000
*      2 RLSRSV01 FIXED(15),       /* RESERVED                       */ 03430000
*      2 RLSRSV02 PTR(31);         /* RESERVED                       */ 03431000
*/*                                                                  */ 03432000
*DCL  1  ISTDNT BDY(WORD) BASED,  /* DIAL NUMBER TABLE               */ 03433000
*        2 DNTCTDIG FIXED(8),     /* NUMBER OF DIGITS IN TEL. NUM.   */ 03434000
*        2 DNTTELNO CHAR(32);     /* TELEPHONE NUMBER                */ 03435000
*/*                                                                  */ 03436000
* DCL  1  ISTGNT BDY(WORD) BASED, /* GROUP NAMES TABLE               */ 03437000
*         2 GNTGRPNM CHAR(8);     /* GROUP NAME ENTRY                */ 03438000
*/*                                                                  */ 03439000
*DCL  1  ISTPAT BDY(WORD) BASED,  /* PATH TABLE                      */ 03440000
*        2 PATGINDX FIXED(15),    /* INDEX TO GROUP NAME TABLE       */ 03441000
*        2 PATDINDX FIXED(15),    /* INDEX TO DIAL NUMBER TABLE      */ 03442000
*        2 PATPTHID PTR(8),       /* PATH ID                         */ 03443000
*        2 PATGRPID PTR(8),       /* GROUP PATH ID                   */ 03444000
*        2 PATRDCNT PTR(8),       /* REDIAL COUNT                    */ 03445000
*        2 PATFLAGA BIT(8),       /* FLAG BYTE                       */ 03446000
*          3 PATUSEFG BIT(1),     /* ON = PATH INITIALLY USABLE      */ 03447000
*          3 PATRSV01 BIT(7);     /* RESERVED                        */ 03448000
*/* PROCESS ANCHOR BLOCK                                              * 03449000
*/*  REVISIONS                                         002 11/16/75  */ 03450000
*DCL  1  ISTPAB BDY(DWORD) BASED,                                  0787 03451000
*       2  PABWQCHN CHAR(8) BDY(DWORD), /* CPS SWAP FIELD FOR NEQ&CHN * 03452000
*        3  PABWEQA PTR(31) BDY(WORD), /* WORK ELEMENT QUEUE ADDRESS  * 03453000
*           4  PABWEQG BIT(1),         /* GATING BIT                  * 03454000
*           4  PABRSV01 BIT(7),        /* RESERVED                    * 03455000
*           4  PABWEQP PTR(24),        /* WKEL PTR                    * 03456000
*        3  PABCHAIN PTR(31) BDY(WORD), /* APS CHAIN                  * 03457000
*           4  PABCHNG BIT(1),         /* GATING BIT                  * 03458000
*           4  PABRESCH BIT(1),        /* RESCHEDULE PAB AT        0787 03459000
*                                         TPEXIT                      * 03460000
*           4  PABCDP BIT(1),          /* CLOSE DST/CHANGE IN PROGRESS* 03461000
*           4  PABUNCON BIT(1),        /* UNCONDITIONALLY RESCHEDULE    03462000
*                                         PAB AT TPEXIT               * 03463000
*           4  PABRESET BIT(1),        /* RESET ISSUED ON THIS PAB    * 03464000
*           4  PABRUNNG BIT(1),        /* PAB RUNNING                 * 03465000
*           4  PABDELAY BIT(1),        /* DELAY OPTION USED           * 03466000
*           4  PABRSV02 BIT(1),        /* RESERVED                    * 03467000
*           4  PABCHNGP PTR(24),       /* PSS CHAIN PTR               * 03468000
*        2  PABOFFST PTR(8),           /* OFFSET FROM CONTROL BLOCK   * 03469000
*        2  PABDVTA PTR(24),           /* DVT ADDRESS                 * 03470000
*        2  PABRPHFG PTR(31),          /* SCHED FLAGS AND RPH         * 03471000
*           3  PABFLAGS BIT(8),        /* SCHEDULING FLAGS            * 03472000
*              4  PABAPYP BIT(1),      /* APPLICATION IS A USER EXIT  * 03473000
*              4  PABPRIOR BIT(1),     /* IMMEDIATE PRIORITY          * 03474000
*              4  PABNORPR BIT(1),     /* NORMAL PRIORITY -           * 03475000
*                                      /* RESCHEDUALABLE              * 03476000
*              4  PABDYNAM BIT(1),     /* DYNAMIC                     * 03477000
*              4  PABSSN BIT(1),       /* SYSTEM SERVICES             * 03478000
*              4  PABERLCK BIT(1),     /* PAB ERROR LOCK FLAG         * 03479000
*                 5  PABERRLK BIT(1),  /* ERROR LOCK                  * 03480000
*                    6  PABERLOK BIT(1), /* ERROR LOCK                * 03481000
*/*    ABNORMAL TO ALLOW VARY COMPARE AND SWAP                        * 03482000
*              4  PABINHBT BIT(1) ABNL,/* 1=INHIBIT TRAFFIC,0=NO      * 03483000
*              4  PABNODQ BIT(1),      /* DO NOT DEQ WORK ELEMENT     * 03484000
*           3  PABRPHA PTR(24);        /* RPL HEADER ADDRESS          * 03485000
*DCL PABWEQG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABWEQG OFF     * 03486000
*    PABWEQG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABWEQG ON      * 03487000
*    PABCHNG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABCHNG OFF     * 03488000
*    PABCHNG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABCHNG ON      * 03489000
*    PABRESC0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PABRESCH OFF    * 03490000
*    PABRESC1 BIT(32) CONSTANT('40000000'X),  /* TURN PABRESCH ON     * 03491000
*    PABCDP0  BIT(32) CONSTANT ('DFFFFFFF'X), /* TURN PABCDP OFF      * 03492000
*    PABCDP1  BIT(32) CONSTANT ('20000000'X), /* TURN PABCDP ON       * 03493000
*    PABERLK0 BIT(32) CONSTANT('FBFFFFFF'X),  /* TURN PABERRLK ON     * 03494000
*    PABERLK1 BIT(32) CONSTANT('04000000'X),  /* TURN PABERRLK OFF    * 03495000
*    PABUNCO0 BIT(32) CONSTANT('EFFFFFFF'X),  /* TURN PABUNCON OFF    * 03496000
*    PABUNCO1 BIT(32) CONSTANT('10000000'X),  /* TURN PABUNCON ON     * 03497000
*    PABPRIR0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PAB PRIOR OFF   * 03498000
*    PABPRIR1 BIT(32) CONSTANT('40000000'X),  /* TURN PAB PRIOR ON    * 03499000
*    PABRST0  BIT(32) CONSTANT('F7FFFFFF'X),  /* TURN PABRESET OFF    * 03500000
*    PABRST1  BIT(32) CONSTANT('08000000'X),  /* TURN PABRESET ON     * 03501000
*    PABDLAY0 BIT(32) CONSTANT('FDFFFFFF'X),  /* TURN PAB DELAY OFF   * 03502000
*    PABDLAY1 BIT(32) CONSTANT('02000000'X);  /* TURN PAB DELAY ON    * 03503000
*              /* DYNAMIC PAB 1K633 */                             0789 03504000
* /* 1K0997 JAN 20, 1973  MB   */                                  0789 03505000
* /* 1K1142 MAR 03, 1973  MB   */                                  0789 03506000
* DCL 1 ISTDYPAB BDY(DWORD) BASED, /* LEVEL 1 DECLARE 1K633 */     0789 03507000
*       2  DYPTYPE CHAR(1), /* CONTROL BLOCK TYPE CODE 1K633 */    0789 03508000
*       2  DYPLNGTH PTR(8), /* CONTROL BLOCK LENGTH (BYTES)  1K633 */   03509000
*       2 DYPFLGS CHAR(2),     /* FLAGS 1K633 */                   0789 03510000
*       2 DYPCHAIN PTR(31),    /* CHAIN POINTER 1K633 */           0789 03511000
*       2 DYPTSKID PTR(31),    /* TASKID OR PTR TO PSS TABLES 1K633 */  03512000
*       2  DYPRSV01 PTR(31),   /* RESERVED TO PRESERVE ALIGNMENT   0789 03513000
*                                                             1K0997 */ 03514000
*       2 DYPPAB CHAR(LENGTH(ISTPAB)) BDY(DWORD); /* LENGTH OF 1K0997   03515000
*                                                    PAB         */     03516000
*DCL DYTYP   BIT(8) CONSTANT ('11'X);   /* TYPE           1K1142 */     03517000
*/*  REVISIONS                                         015 11/16/75   * 03518000
*DCL ATCLCPTR PTR LOCATION(1032);      /* POINTER TO ATCVT            * 03519000
*DCL  1  ISTATCVT BDY(DWORD) BASED,                                0792 03520000
*        2  ATCCOM BDY(WORD),          /* SYSTEM INDEPENDENT FIELDS   * 03521000
*           3  ATCSTAT CHAR(4),        /* VTAM  STATUS INDICATORS     * 03522000
*              4  ATCSTAT1 CHAR(1),    /* VTAM  STATUS BYTE 1         * 03523000
*                 5  ATCSTART BIT(1),  /* VTAM  IS STARTING           * 03524000
*                 5  ATCACTIV BIT(1),  /* VTAM  IS ACTIVE             * 03525000
*                 5  ATCSNHLT BIT(1),  /* VTAM  SESSION HALT          * 03526000
*                 5  ATCQKHLT BIT(1),  /* VTAM  QUICK HALT            * 03527000
*                 5  ATCNETSL BIT(1),  /* NETSOL=YES SPECIFIED ON CMD * 03528000
*                 5  ATCINHLT BIT(1),  /* INTERNAL VTAM HALT QUICK    * 03529000
*                 5  ATCMDHLT BIT(1),  /* VTAM CMD PROC HALTED        * 03530000
*                 5 * BIT(1),          /* RESERVED                    * 03531000
*              4  ATCSTFLG BIT(8),     /* STORAGE MANAGEMENT FLAGS    * 03532000
*                 5  ATCHSDMF BIT(1),  /* SYSTEM SLOW DOWN FLAG       * 03533000
*              4  ATCPOFLG BIT(8),     /* PROGRAM OPERATOR            * 03534000
*                                      /* INTERFACE FLAGS             * 03535000
*                 5 ATCPOUNS BIT(1),   /* APPLICATION AUTHORIZED TO   * 03536000
*                                      /* RECEIVE UNSOLICITED MESSAGES* 03537000
*                                      /* 1 = YES                     * 03538000
*                 5 *        BIT(7),   /* RESERVED                    * 03539000
*              4  ATCSTAT4 CHAR(1),    /* VTAM  STATUS BYTE 4         * 03540000
*                 5  ATCPRTAT BIT(1),  /* 1 = TRACE PRINT ACTIVE,  0792 03541000
*                                         0 = NOT ACTIVE              * 03542000
*                 5  ATCTPRT BIT(1),   /* WHEN 1, TPRINT IN PROCESS   * 03543000
*                 5  ATCMTST BIT(1),   /* WHEN 1, MODIFY TEST IN   0792 03544000
*                                         PROCESS                     * 03545000
*                 5  ATCNCSD BIT(1),   /* NCS QUIESCED DURING HALT    * 03546000
*                 5  ATCVTTRC BIT(1),  /* VTAM TRACE, 1=ACTIVE        * 03547000
*                 5  ATCRSV04 BIT(3),  /* RESERVED                    * 03548000
*           3  ATCAPI PTR(31),         /* ADDR OF API ROUTINE         * 03549000
*           3  ATCDCFRR PTR(31),       /* POINTER TO FRR OF CONTROL     03550000
*                                         LAYER,INITIALIZED BY OPENDST* 03551000
*           3  ATCRDT PTR(31),         /* POINTER TO FIRST RDT        * 03552000
*           3  ATCSRT PTR(31),         /* POINTER TO SRT DIRECTORY    * 03553000
*           3  ATCASCHD PTR(31),       /* POINTER TO AP SCHEDULER     * 03554000
*           3  ATCECMOD CHAR(4),       /* ECB FOR MODIFY COMMAND PROC.* 03555000
*           3  ATCMODQ PTR(31),        /* POINTER FOR OUTPUT QUEUE    * 03556000
*                                      /* FOR MODIFY COMMAND          * 03557000
*           3  ATCECHLT CHAR(4),       /* ECB FOR HALT COMMAND        * 03558000
*           3  ATCHALTQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 03559000
*                                      /* FOR HALT COMMAND            * 03560000
*           3  ATCECVRY CHAR(4),       /* ECB FOR VARY COMMAND PROC.  * 03561000
*           3  ATCVARYQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 03562000
*                                      /* FOR VARY COMMAND            * 03563000
*           3  ATCECDSP CHAR(4),       /* ECB FOR DISPLAY COMMAND     * 03564000
*           3  ATCDSPLQ PTR(31),       /*  POINTER TO OUTPUT QUEUE    * 03565000
*                                      /* FOR DISPLAY COMMAND         * 03566000
*           3  ATCOCHA PTR(31),        /* POINTER TO OCT HEADER       * 03567000
*           3  ATCECSES CHAR(4),       /* ECB TO HALT SESSION MODE    * 03568000
*           3  ATCECVRQ CHAR(4),       /* ERP ECB FOR VARY REQ. INFO. * 03569000
*                                      /* REQUEST NOTIFICATION        * 03570000
*           3  ATCVPARM PTR(31),       /* ADDR OF VARY PARAMETERS     * 03571000
*           3  ATCECOPC CHAR(4),       /* ECB TOINDICATE OPERATOR     * 03572000
*                                      /* CONTROL PROCESSING COMPLETE * 03573000
*           3  ATCECNET CHAR(4),       /* ERP ECB FOR NETWORK         * 03574000
*                                      /* CONFIGURATION REQUEST       * 03575000
*           3  ATCECPRM PTR(31),       /* POINTER TO QAB FOR ERP'S    * 03576000
*                                      /* ECB PARAMETERS              * 03577000
*           3  ATCHLTMS PTR(31),       /* POINTER TO HALT COMMAND     * 03578000
*                                      /* OR HALT RETURN MESSAGE      * 03579000
*           3  ATCFSB PTR(31),         /* PTR TO FEEDBACK STATUS      * 03580000
*                                      /* BLOCK                       * 03581000
*           3  ATCFRSCH PTR(31),       /* POINTER TO FEEDBACK         * 03582000
*                                      /* ROUTINE SCHEDULER           * 03583000
*           3  ATCRDTH PTR(31),        /*  POINTER RDT HEADER         * 03584000
*           3  ATCACCTA PTR(31),       /* POINTER TO INSTALLATION     * 03585000
*                                      /* ACCOUNTING ROUTINE          * 03586000
*           3  ATCAUTHA PTR(31),       /* POINTER TO INSTALLATION     * 03587000
*                                      /* AUTHORISATION ROUTINE       * 03588000
*           3  ATCPTCHA PTR(31),       /* PTR TO VTAM PATCH AREA      * 03589000
*           3  ATCCONFT PTR(31),       /* POINTER TO VTAM             * 03590000
*                                      /* CONFIGURATION TABLE         * 03591000
*           3  ATCFDVT PTR(31),        /* PTR TO FIRST DVT FOR O/C    * 03592000
*           3  ATCFEPT PTR(31),        /* PTR TO FIRST EPT FOR O/C    * 03593000
*           3  ATCDVTPT PTR(31),       /* ADDR OF LOAD MOD FOR        * 03594000
*                                      /* TYPE=VTAM TRACING           * 03595000
*           3  ATCBPDA PTR(31),        /* PTR TO BUFFER POOL DIRECTORY* 03596000
*           3  ATCADD PTR(31),         /* POINTER TO ADD PROCEDURE    * 03597000
*           3  ATCREMOV PTR(31),       /* POINTER TO REMOVE PROCEDURE * 03598000
*           3  ATCIOTRC PTR(31),       /*  POINTER TO I/O TRACE       * 03599000
*                                      /* PROCEDURE                   * 03600000
*              4 ATCTHTRC PTR(31),     /* ADDR OF TH TRACE ROUTINE    * 03601000
*                5 ATCTPBUF PTR(31),   /* TPIOS BUFFER TRACE(ISTRARTP)* 03602000
*           3  ATCBFTRC PTR(31),       /* PTR TO BUFFER TRACE         * 03603000
*                                      /* PROCEDURE                   * 03604000
*           3  ATCFBRPH PTR(31),       /* ADDR OF FEEDBACK PROC RPH   * 03605000
*           3  ATCBLDLA PTR(31),       /* ADDR OF BLDL ROUTINE        * 03606000
*           3  ATCALOAD PTR(31),       /* ADDR OF ALOAD ROUTINE       * 03607000
*           3  ATCREADA PTR(31),       /* ADDR OF SOURCE READ ROUTINE * 03608000
*           3  ATCGTSTR PTR(31),       /* ADDR OF GETSTOR ROUTINE     * 03609000
*           3  ATCFRSTR PTR(31),       /* ADDR OF FREESTOR ROUTINE    * 03610000
*           3  ATCSTMA PTR(31),        /* ADDR OF SM INITIALIZATION   * 03611000
*                                      /* ROUTINE                     * 03612000
*           3  ATCACDA PTR(31),        /* ADDR OF FIRST ACDEB         * 03613000
*           3  ATCSMRQ PTR(31),        /* ADDR OF REQUEST STORAGE     * 03614000
*                                      /* ROUTINE                     * 03615000
*           3  ATCSMQU PTR(31),        /* ADDR OF QUEUE REQUEST RTNE    03616000
*                                         - DOS ONLY                  * 03617000
*           3  ATCSMRS PTR(31),        /* ADDR OF RELEASE STORAGE     * 03618000
*                                      /* ROUTINE                     * 03619000
*           3  ATCSMRC PTR(31),        /* ADDR OF RECOVER STORAGE     * 03620000
*                                      /* ROUTINE  - DOS ONLY         * 03621000
*           3  ATCSMBQ PTR(31),        /* PTR TO Q'ED REQ. SMS RTN.   * 03622000
*           3  ATCFIRA PTR(31),        /* ADDR OF FEEDBACK INITIATION * 03623000
*                                      /* RPH                         * 03624000
*           3  ATCSRTAD PTR(31),       /* PTR TO SRTADD ROUTINE       * 03625000
*           3  ATCSRTDF PTR(31),       /* PTR TO SRTDELE ROUTN        * 03626000
*           3  ATCDCC60 PTR(31),       /* PTR TO ISTDCC60 - CTL. LAYER  03627000
*                                         MOVE TO USER AREA           * 03628000
*           3  ATCDCC61 PTR(31),       /* PTR TO ISTDCC61 - CTL. LAYER  03629000
*                                         MOVE FIXED TO PAGABLE       * 03630000
*/*  BEGIN 'ANY' DVT                                                  * 03631000
*           3  ATCNERST PTR(31),       /* PTR TO ISTDCC00 - REQUEST-ST* 03632000
*           3  ATCNERCV PTR(31),       /* PTR TO ISTRCC21-RECEIVE OB  * 03633000
*           3  ATCNERNE PTR(31),      /* PTR TO ISTDCC25 - READ-ANY   * 03634000
*           3  ATCNERFN PTR(31),      /* PTR TO ISTDCC02 - REQUEST-FN * 03635000
*/*  END 'ANY' DVT                                                    * 03636000
*           3  ATCAPOST PTR(31),      /* PTR TO VTAM  POST ROUTINE    * 03637000
*           3  ATCVTMID CHAR(2),      /* HOST MAJOR NODE I.D.         * 03638000
*           3  ATCRSV11 CHAR(2),      /* RESERVED                     * 03639000
*           3 ATCRCC63 PTR(31),  /* HSKPANYQ POINTER                  * 03640000
*           3 ATCRCC26 PTR(31),  /* SEND RESPONSE POINTER             * 03641000
*           3 ATCRCC65 PTR(31),  /* SET RPL POINTER                   * 03642000
*           3  ATCNESAL PTR(31),      /* PTR TO ISTDCC24 - SOLICIT-ALL* 03643000
*           3  ATCNERAP PTR(31),       /* PTR TO ISTDCC85 - READ ANY    03644000
*                                         PURGE                       * 03645000
*           3 ATCACTRM FIXED(15),     /* COUNT OF ACTIVE TERMINALS    * 03646000
*           3 ATCCIDM BIT(16),        /* CID MASK                     * 03647000
*           3 ATCMSGSP BIT(8), /* RESERVED FOR MESAGE SURPRESSION     * 03648000
*         2 ATCMAXID PTR(8),   /* MAXIMUM NUMBER OF MAJOR NODES, 0 =    03649000
*                                 NUMBER OF ENTRIES IN THE MNT        * 03650000
*         2 ATCRSV16 CHAR(2),  /* NOT USED                            * 03651000
*         2 ATCMNT PTR(31),    /*PTR TO MAJOR NODE TABLE -SET BY SYS.   03652000
*                                DEF. REF. BY ISTSDCCB (CBDEF),    0792 03653000
*                                ISTSDCCI (CINDEXY)                   * 03654000
*         2 ATCCDADD PTR(31),  /*PTR TO CIDADD ROUTINE ISTSDCCA    0792 03655000
*                                 REF. BY CIDCTL MACRO                * 03656000
*         2 ATCCDDEL PTR(31),  /*PTR TO CIDDEL ROUTINE ISTSDCCD    0792 03657000
*                                 REF. BY CIDCTL MACRO                * 03658000
*         2 ATCCDFND PTR(31),  /*PTR TO CIDFND ROUTINE IATSDCCF    0792 03659000
*                                 REF. BY CIDCTL MACRO                * 03660000
*         2 ATCESC01 PTR(31),  /*PTR TO ESC01                         * 03661000
*         2 ATCESC02 PTR(31),  /*PTR TO ESC02                         * 03662000
*         2 ATCCSMR PTR(31),        /* PTR TO CONNECTION SERVICES     * 03663000
*                                   /*  MASTER ROUTINE                * 03664000
*           3 ATCCSMA PTR(31),      /* PTR TO CONNECTION SERVICES  0792 03665000
*                                      MASTER ROUTINE                 * 03666000
*         2 ATCOCRT PTR(31),        /* PTR TO OPEN/CLOSE ROUTINE      * 03667000
*         2 ATCUEP  PTR(31),        /* POINTER TO USER EXIT           * 03668000
*         2 ATCSHRTN CHAR(8),       /* NAME OF VTAM  SHARED RTN       * 03669000
*                                   /*  TO BE LOADED                  * 03670000
*         2 ATCSHRFG BIT(8),        /* ATTRIBUTE FLAGS                * 03671000
*           3 ATCLAST BIT(1),       /* INDICATE HTIS IS LAST MODULE   * 03672000
*         2 ATCXRANG CHAR(1),       /* NUMBER OT BITS IN X-VALUE   0792 03673000
*                                       PORTION   OF CID              * 03674000
*         2 ATCSAF   CHAR(2),       /* SUB AREA ADDRESS FIELD         * 03675000
*         2 ATCEPA PTR(31),         /* ENTRY POINT ADDR OF LOADED     * 03676000
*         2 ATCALERT PTR(31),       /* POINTER TO ALERT-ROUTINE    0792 03677000
*                                      ISTSDCAL                       * 03678000
*         2 ATCDVLOD PTR(31),       /* PTR TO ISTSDCOD                * 03679000
*         2 ATCTRCPT PTR(31),       /* POINTER TO TRACE PARM LIST     * 03680000
*         2 ATCDVT   PTR(31),       /* POINTER TO FIRST DVT ON CHAIN  * 03681000
*         2 ATCEPT   PTR(31),       /* POINTER TO FIRST EPT ON CHAIN  * 03682000
*         2 ATCMSGP PTR(31),        /* POINTER TO TPMSG PROCESSOR     * 03683000
*         2 ATCMSGM PTR(31),        /* POINTER TO TPMSG - MESSAGE  0792 03684000
*                                      CSECT                          * 03685000
*         2 ATCTRPAB  PTR(31),      /* ADDRESS OF TRACE WRITER PAB    * 03686000
*         2 ATCVTLOD PTR(31),       /* ADDR OF VTAM LOAD LIST         * 03687000
*         2 ATCECPRT CHAR(4),       /* ECB FOR TRACE FILE PRINT       * 03688000
*         2 ATCZDVTB PTR(31),       /* ADDRESS OF ISTZCFBI            * 03689000
*         2 ATCECTLP CHAR(4),       /* TOLTEP ECB                     * 03690000
*         2 ATCRVCHS CHAR(8),       /* RESERVED                       * 03691000
*         2 ATCCRME  PTR(31),       /* VARY PSS CONTROL MECHANISM     * 03692000
*         2 ATCHPGM,                /* BUFFER INFORMATION            */ 03693000
*           3 ATCHBFNO FIXED(15),   /* NUMBER OF BUFFS FOR CHANNEL   */ 03694000
*           3 ATCHBSIZ FIXED(15),   /* BUFFER SIZE IN BYTES          */ 03695000
*         2 ATCDEBCH PTR(31),       /* CLOSE DEB CHAIN PTR           */ 03696000
*         2 ATCTODVT PTR(31),       /* THE TOLTEP DVT PTR POINTED  0792 03697000
*                                      TO BY 3RD WORD OF PAB         */ 03698000
*         2 ATCADEL  PTR(31),       /* A DELETE ROUTINE ADDRESS      */ 03699000
*         2 ATCCDPTR PTR(31),       /* PTR TO ISTOCCCD - DOS ONLY    */ 03700000
*         2 ATCLDNCS PTR(31),       /* PTR TO NCSPL FOR LOAD/DUMP    */ 03701000
*         2 ATCLDECB BIT(32),       /* ECB FOR LOAD/DUMP SUBTASK     */ 03702000
*         2 ATCAPCR5 PTR(31),       /* POINTER TO ISTINCR5           */ 03703000
*         2 ATCRSV69 PTR(31),       /* RESERVED TO SYNCH WITH DOS    */ 03704000
*         2 ATCNODEL CHAR(8),       /* VSAM DATA SET NAME            */ 03705000
*         2 ATCNODDS PTR(31),       /* POINTER TO RPL                */ 03706000
*         2 ATCONFIG CHAR(8),       /* START VTAM CONFIG = PARAMETER */ 03707000
*         2 ATCRSV99 CHAR(4),       /* RESERVED FOR LATER POINTERS   */ 03708000
*         2 ATCAP33 PTR(31),        /* PTR TO ISTAPC33               */ 03709000
*         2 ATCAP35 PTR(31),        /* PTR TO ISTAPC35               */ 03710000
*         2 ATCAP36 PTR(31),        /* PTR TO ISTAPC36               */ 03711000
*         2 ATCDVTLK CHAR(LENGTH(ISTLOK)), /* LOCK WORD FOR DVT LOCK */ 03712000
*         2 ATCCDFIN PTR(31),       /* POINTER TO ISTSDCRR           */ 03713000
*         2 ATCCDFDN PTR(31),       /* POINTER TO ISTSDCCN           */ 03714000
*         2 ATCVOCLK CHAR(LENGTH(ISTLOK)), /* VOCLOCK LOCK           */ 03715000
*         2 ATCRDTLK CHAR(LENGTH(ISTLOK)), /* RDTLOCK LOCK           */ 03716000
*         2 ATCRSV97 PTR(31),              /* DWORD ALIGNMENT        */ 03717000
*         2 ATCVPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR VARY 03718000
*                                           UNDER PSS CONTROL        */ 03719000
*         2 ATCPGPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* ERP PAB FOR  03720000
*                                      PURGE                         */ 03721000
*         2 ATCDLRPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* DUMP LOAD &  03722000
*                                           RESTART PAB              */ 03723000
*         2 ATCCCLAD PTR(31),       /* ADDRESS OF VARY ERP (ISTINCCL)*/ 03724000
*         2 ATCCDLAD PTR(31),       /* ADDRESS OF VARY DUMP,LD RSTRT    03725000
*                                      (ISTINCDL)                    */ 03726000
*         2 ATCOCCOB PTR(31),       /* ADDRESS ISTOCCOB              */ 03727000
*         2 ATCOCCCB PTR(31),       /* ADDRESS ISTOCCCB              */ 03728000
*         2 ATCTIPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0792 03729000
*                                           FOR ISTOLTP              */ 03730000
*         2 ATCTCIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0792 03731000
*                                           FOR TOLTEP CLIP          */ 03732000
*         2 ATCVTIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0792 03733000
*                                           FOR TOLTEP-VTAM INTERFACE*/ 03734000
*         2 ATCTCLOM PTR(31),      /* ADDR TOLTEP CLOP PROC          */ 03735000
*         2 ATCTCLIM PTR(31),      /* ADDR TOLTEP CLIP PROC          */ 03736000
*         2 ATCVTINM PTR(31),      /* ADDR TOLTEP-VTAM INTF PROC     */ 03737000
*         2 ATCTACB  PTR(31),      /* TOLTEP ACB                     */ 03738000
*         2 ATCRSV10 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* RESERVED  */ 03739000
*         2 ATCPTR00 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB     */ 03740000
*         2 ATCCFEAD PTR(31),          /* ADDR OF ISTINCFE           */ 03741000
*         2 ATCVLCNT CHAR(4) BDY(HWORD), /* VARY DEVICE ONLINE COUNTS*/ 03742000
*           3 ATCRNCNT PTR(16),        /* 370X COUNT                 */ 03743000
*           3 ATCLCLCT PTR(16),        /* 3270 COUNT                 */ 03744000
*         2 ATCS49XI PTR(31),          /* ADDRESS OF ISTPICXI        */ 03745000
*         2 ATCS49XL PTR(31),          /* ADDRESS OF ISTPICXL        */ 03746000
*         2 ATCPODVT PTR(31),          /* PTR TO PROGRAM OPERATOR DVT*/ 03747000
*         2 ATCRNO,                                                0792 03748000
*           3 *        CHAR(1),                                    0792 03749000
*           3 ATCPOIA  PTR(24),        /* PTR TO PROGRAM OPERATOR    */ 03750000
*                                      /* INTERFACE AREA             */ 03751000
*         2 ATCSOPD CHAR(8) BDY(WORD), /* SESSION CONTROL            */ 03752000
*           3 ATCSEC01 PTR(31),        /* OUTBOUND PROCESSING        */ 03753000
*           3 ATCSEC10 PTR(31),        /* DVT                        */ 03754000
*         2 ATCSIPD CHAR(12) BDY(WORD),/* SESSION CONTROL            */ 03755000
*           3 ATCSEC21 PTR(31),        /* INBOUND PROCESSING         */ 03756000
*           3 ATCSEC30 PTR(31),        /* FEEDBACK                   */ 03757000
*           3 ATCSEC40 PTR(31),        /* DVT                        */ 03758000
*         2 ATCSECST CHAR(4) BDY(WORD),/* SESSION CONTROLSESS TERM   */ 03759000
*           3 ATCSEC51 PTR(31),        /* RECOVERY DVT               */ 03760000
*         2 ATCNMCTR FIXED(15),        /* NAME COUNTER               */ 03761000
*         2 ATCSTAT2 BIT(8),           /* TRACE FLAGS                */ 03762000
*           3 ATCTRAPI BIT(1),         /* API                        */ 03763000
*           3 ATCTRESC BIT(1),         /* ESC                        */ 03764000
*           3 ATCTRPSS BIT(1),         /* PSS                        */ 03765000
*           3 ATCTRLOK BIT(1),         /* LOCKS                      */ 03766000
*           3 ATCTRSMS BIT(1),         /* SMS                        */ 03767000
*           3 *        BIT(3),         /* RESERVED                   */ 03768000
*         2 *        BIT(8),           /* RESERVED                   */ 03769000
*         2 ATCSRTAB PTR(31),          /* SEARCH LOGON MODE TABLE    */ 03770000
*                                      /* RTN ADDRESS (ISTINCSH)     */ 03771000
*         2 ATCUSSPT PTR(31),          /* DEFAULT USS DEFINITION     */ 03772000
*                                      /* TABLE ADDRESS (ISTINCDT)   */ 03773000
*         2 ATCMODTB PTR(31),          /* DEFAULT SYSTEM LOGON MODE  */ 03774000
*                                      /* TABLE ADDRESS (ISTINCLM)   */ 03775000
*         2 ATCINCW3 PTR(31),          /* ADDRESS OF ISTINCW3        */ 03776000
*         2 ATCIOECB PTR(31),          /* ECB USED BY IOS -          */ 03777000
*                                      /* POINTED TO BY IOBECBPT     */ 03778000
* 2 ATCVDPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0792 03779000
*                                    /* SSCP COMMAND PROCESSING PAB  */ 03780000
* 2 ATCVFPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0792 03781000
*                                    /* SSCP FRONT END PAB           */ 03782000
* 2 ATCVDLOK CHAR(LENGTH(ISTLOK)),   /* SSCP SERIALIZATION LOCK      */ 03783000
*/* END OF COMMON AREA                                               */ 03784000
*/* VS1/VS2 COMMON CODE.                                             */ 03785000
*        2  ATCVTBAM CHAR(4),                                      0792 03786000
*           3  *     CHAR(3),          /* RESERVED                    * 03787000
*           3  *     CHAR(1),          /* FLAGS                       * 03788000
*              4 ATCVTMAB BIT(1) ABNL, /* ABEND IN VTAM JOBSTEP       * 03789000
*              4 *        BIT(7),      /* RESERVED                    * 03790000
*        2  ATCAOSM BDY(DWORD),                                    0792 03791000
*/*                                                                   * 03792000
*           3  ATCSRBRT PTR(31),       /* POINTER TO ROUTINE UNDER    * 03793000
*                                      /* SRB CONTROL                 * 03794000
*           3  ATCGSRBQ PTR(31),       /* READY QUEUE FOR GLOBAL SRB'S* 03795000
*              4  ATCGSRBG BIT(8),     /* READY QUEUE GATE BYTE       * 03796000
*                 5  ATCGSRBF BIT(1),  /* READY QUEUE GATE BIT        * 03797000
*           3  ATCPRPH PTR(31),        /* PTR TO PREALLOCATED RPH     * 03798000
*           3  ATCCMTCB PTR(31),       /* PTR TO COMMUNICATIONS TASK  * 03799000
*                                      /* TCB                         * 03800000
*           3  ATCAP11 PTR(31),        /* PTR TO ISTAPC11             * 03801000
*           3  ATCAP12 PTR(31),        /* PTR TO ISTAPC12             * 03802000
*           3  ATCAP31 PTR(31),        /* PTR TO ISTAPC31             * 03803000
*           3  ATCAP32 PTR(31),        /* PTR TO ISTAPC32             * 03804000
*           3  ATCAP34 PTR(31),        /* PTR TO ISTAPC34             * 03805000
*           3  ATCAP52 PTR(31),        /* PTR TO ISTAPC52             * 03806000
*           3  ATCAP53 PTR(31),        /* PTR TO ISTAPC53             * 03807000
*           3  ATCAP54 PTR(31),        /* PTR TO ISTAPC54             * 03808000
*           3  ATCAP57 PTR(31),        /* PTR TO ISTAPC57             * 03809000
*           3  ATCAP58 PTR(31),        /* PTR TO ISTAPC58             * 03810000
*           3  ATCAP61 PTR(31),        /* PTR TO ISTAPC61             * 03811000
*           3  ATCAP63 PTR(31),        /* PTR TO ISTAPC63             * 03812000
*           3  ATCAP64 PTR(31),        /* PTR TO ISTAPC64             * 03813000
*           3  ATCZFSVT PTR(31),       /* TPIOS FIXED SRVICES VCTR TAB* 03814000
*           3  ATCZPSVT PTR(31),       /* TPIOS PAGBL SRVCES VCTR TABL* 03815000
*           3  ATCICNCB PTR(31),       /* HEAD OF ICNCB QUEUE         * 03816000
*           3  ATCZDVT1 PTR(31),       /* TPIOS SLODWN RECOVRY PRCSR  * 03817000
*           3  ATCZDVT3 PTR(31),       /* 370X FEEDBACK STAT CNTRL RTR* 03818000
*           3  ATCZDVT4 PTR(31),       /* OPERATOR MESSAGE SCHEDULER  * 03819000
*           3  ATCZDVT6 PTR(31),       /* DIALOGUE SCHEDULER (INBOUND)* 03820000
*           3  ATCAP65 PTR(31),        /* PTR TO ISTAPC65            */ 03821000
*           3  ATCICAPP CHAR(20) BDY(WORD), /* 3705 APPENDAGE VECTOR  * 03822000
*              4  ATCCDRPH PTR(31),    /* ADDR CLOSE DEB RPH       0792 03823000
*                                         (DUMMY EOA APP.)           */ 03824000
*              4  ATCZSIOA PTR(31),    /* ADDR 3705 SIO APPENDAGE    */ 03825000
*              4  ATCCDTCB PTR(31),    /* VTAM TCB (DUMMY PCI APP.)  */ 03826000
*              4  ATCZCEA PTR(31),     /* ADDR 3705 CHANNEL END    0792 03827000
*                                         APPENDAGE                  */ 03828000
*              4  ATCZAEA PTR(31),     /* ADDR 3705 CHANNEL END    0792 03829000
*                                         APPENDAGE                  */ 03830000
*           3  ATCLDAPP CHAR(20) BDY(WORD), /* LOCAL 3270 APPENDAGE     03831000
*                                         VECTOR                     */ 03832000
*              4  ATCCDTID PTR(31),    /* TASK ID OF VTAM          0792 03833000
*                                         (DUMP EOE)                 */ 03834000
*              4  ATCSMFRR PTR(31),    /* ADDR OF SMS FRR          0792 03835000
*                                         (DUMMY SIOA)               */ 03836000
*              4  ATCRSV17 PTR(31),    /* RESERVED FOR ALIGNMENT     */ 03837000
*              4  ATCZLCEA PTR(31),    /* ADDR 3270 CHANNEL END    0792 03838000
*                                         APPENDAGE                  */ 03839000
*              4  ATCZLAEA PTR(31),    /* ADDR 3270 CHANNEL END    0792 03840000
*                                         APPENDAGE                  */ 03841000
*           3  ATCDAPVT CHAR(24) BDY(WORD),  /* DUMMY APPENDAGE    0792 03842000
*                                         VECTOR TABLE FOR LOAD/DVMMY*/ 03843000
*              4  ATCDEOEA PTR(31),    /* ADDRESS OF DUMMY END     0792 03844000
*                                         OF EXTENT APPENDAGE        */ 03845000
*              4  ATCDSIOA PTR(31),    /* ADDRESS OF DUMMY END     0792 03846000
*                                         OF SIO APPENDAGE           */ 03847000
*              4  ATCDPCIA PTR(31),    /* ADDRESS OF DUMMY PCI     0792 03848000
*                                         APPENDAGE                  */ 03849000
*              4  ATCDCEA PTR(31),     /* ADDRESS OF CHANNEL END   0792 03850000
*                                         APPENDAGE                  */ 03851000
*              4  ATCDXCEA PTR(31),    /* ADDRESS OF ABNORMAL      0792 03852000
*                                         END APPENDAGE              */ 03853000
*              4  ATCDAPDG CHAR(2),    /* DUMMY APPENDAGE            */ 03854000
*              4  ATCRSV56 CHAR(2),    /* RESERVED                   */ 03855000
*           3  ATCZDVT7 PTR(31),       /* ADDR OF RESET CLEANUP    0792 03856000
*                                         (PHASE 1)                   * 03857000
*           3  ATCZDVT8 PTR(31),       /* 3270 LOCAL TEST AND CTL  0792 03858000
*                                         FEEDBACK ROUTER            */ 03859000
*           3  ATCZDVT9 PTR(31),       /* ADDRESS OF ISTZDFKA        */ 03860000
*           3  ATCZDVTA PTR(31),       /* ADDRESS OF ISTZCFIA        */ 03861000
*           3  ATCZDVTX PTR(31),       /* ADDRESS OF TRUNK LINE    0792 03862000
*                                         DEACTIVATE ROUTINE         */ 03863000
*           3  ATCZLPVT PTR(31),       /* ADDRESS OF ISTZPSVA        */ 03864000
*           3  ATCZLFVT PTR(31),       /* TPIOS 3270 LOCAL FIXED   0792 03865000
*                                         SERVICES VECTOR TABLE      */ 03866000
*           3  ATCZPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR   03867000
*                                         TEST AND CTL FEEDBACK ROUTER* 03868000
*           3  ATCZPAB2 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* 370X 0792 03869000
*                                         STATUS AND FEEDBACK ROUTER    03870000
*                                         DYNAMIC PAB                */ 03871000
*           3  ATCAP51  PTR(31),       /* PTR TO ISTAPC51            */ 03872000
*           3  ATCZDFJ0 PTR(31),       /* ADDR OF ISTZDFJ0           */ 03873000
*           3  ATCAP37  PTR(31),       /* PTR TO ISTAPC37            */ 03874000
*           3  ATCAP38  PTR(31),       /* PTR TO ISTAPC38            */ 03875000
*           3  ATCDMAPP PTR(31),       /* DUMMY APPENDAGE ROUTINE    */ 03876000
*                                      /* FOR ABEND                  */ 03877000
*           3  ATCRPT12 PTR(31),       /* RESERVED                   */ 03878000
*        3  ATCCRA   CHAR(8) BDY(DWORD), /* AVAILABLE CRA             * 03879000
*           4 ATCCRAQ  PTR(31),          /* QUEUE OF AVAILABLE CRAS   * 03880000
*           4 ATCCRACN FIXED(31),        /* COUNTS                    * 03881000
*             5 ATCCRARC FIXED(16),      /* ENQUEUE COUNT TO ALLOW    * 03882000
*                                        /* MULTIPLE SIMUALTANIOUS    * 03883000
*                                        /* ENQUEUES AND DEQUEUES     * 03884000
*             5 ATCCRAAC FIXED(16),      /* COUNT OF CRAS ON AVAIL Q  * 03885000
*        3  ATCSRB   CHAR(8) BDY(DWORD), /* AVAILABLE SRBS            * 03886000
*             4 ATCSRBQ  PTR(31),        /* QUE OF AVAILABLE SRBS     * 03887000
*             4 ATCSRBCN FIXED(31),      /* COUNTS                    * 03888000
*               5 ATCSRBRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    * 03889000
*                                        /* MULTIPLE SIMUALTANIOUS    * 03890000
*                                        /* ENQUEUES AND DEQUEUES     * 03891000
*               5 ATCSRBAC FIXED(16),    /* COUNT OF SRBS ON AVAIL Q  * 03892000
*        3  ATCCRPL  CHAR(8) BDY(DWORD), /* AVAILABLE CRPLS           * 03893000
*             4 ATCCRPLQ PTR(31),        /* QUE OF AVAILABLE CRPLS    * 03894000
*             4 ATCRPLCN FIXED(31),      /* COUNTS                    * 03895000
*               5 ATCRPLRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    * 03896000
*                                        /* MULTIPLE SIMUALTANIOUS    * 03897000
*                                        /* ENQUEUES AND DEQUEUES     * 03898000
*               5 ATCRPLAC FIXED(16),    /* COUNT OF CRPLS ON AVAIL Q * 03899000
*           3  ATCRPT19 PTR(31),       /* RESERVED                   */ 03900000
*           3  ATCRPT20 PTR(31),       /* RESERVED                   */ 03901000
*           3  ATCRPT21 PTR(31),       /* RESERVED                   */ 03902000
*           3  ATCRPT22 PTR(31),       /* RESERVED                   */ 03903000
*           3  ATCRPT23 PTR(31),       /* RESERVED                   */ 03904000
*           3  ATCRPT24 PTR(31),       /* RESERVED                   */ 03905000
*           3  ATCRPT25 PTR(31),       /* RESERVED                   */ 03906000
*           3  ATCRPT26 PTR(31),       /* RESERVED                   */ 03907000
*           3  ATCRPT27 PTR(31),       /* RESERVED                   */ 03908000
*           3  ATCRPT28 PTR(31),       /* RESERVED                   */ 03909000
*           3  ATCRPT29 PTR(31),       /* RESERVED                   */ 03910000
*           3  ATCRPT30 PTR(31),       /* RESERVED                   */ 03911000
*           3  ATCRPT31 PTR(31),       /* RESERVED                   */ 03912000
*           3  ATCRPT32 PTR(31),       /* RESERVED                   */ 03913000
*           3  ATCRPT33 PTR(31),       /* RESERVED                   */ 03914000
*           3  ATCRPT34 PTR(31),       /* RESERVED                   */ 03915000
*           3  ATCRPT35 PTR(31),       /* RESERVED                   */ 03916000
*           3  ATCRPT36 PTR(31),       /* RESERVED                   */ 03917000
*           3  ATCRPT37 PTR(31),       /* RESERVED                   */ 03918000
*           3  ATCRPT38 PTR(31),       /* RESERVED                   */ 03919000
*           3  ATCRPT39 PTR(31),       /* RESERVED                   */ 03920000
*           3  ATCRPT40 PTR(31),       /* RESERVED                   */ 03921000
*/* END OF VS1/VS2 COMMON CODE.                                      */ 03922000
*/* START OF VS2 UNIQUE CODE.                                        */ 03923000
*           3  ATCVTFLG BIT(32),                                   0792 03924000
*              4 ATCVTACT BIT(1),      /* VTT ACTIVE                 */ 03925000
*              4 *        BIT(31),     /* RESERVED                   */ 03926000
*           3  ATCHLTCB PTR(31),       /* ECB FOR HALTING VTAM       */ 03927000
*           3  ATCATA10 PTR(31),       /* PTR TO ISTATM10            */ 03928000
*           3  ATCZLAAB PTR(31),       /* PTR TO ISTZLFAB            */ 03929000
*           3  ATCCACXA PTR(31),       /* PTR TO ISTCFCXA            */ 03930000
*           3  ATCSMARA PTR(31),       /* PTR TO ISTORFRA            */ 03931000
*           3  ATCSMAID PTR(31),       /* PTR TO ISTORFID            */ 03932000
*           3  ATCTPWQA PTR(31),       /* WAIT Q ANCHOR FOR TPIOS    */ 03933000
*           3  ATCSMAPR PTR(31),       /* PTR TO ISTORFPR            */ 03934000
*           3  ATCSMABF PTR(31),       /* PTR TO ISTORFBF            */ 03935000
*           3  ATCPSTA  PTR(31),       /* ACTIVE PST QUEUE           */ 03936000
*           3  ATCAPBE  PTR(31),       /* POINTER TO ISTAICBE        */ 03937000
*           3  ATCTRMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0792 03938000
*                                      /* PAB FOR VTAM TERM TASK     */ 03939000
*           3  ATCTPSPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0792 03940000
*                                      /* PAB FOR TPIOS              */ 03941000
*           3  ATCAP23  PTR(31),       /* PTR TO ISTAPC23            */ 03942000
*           3  ATCAPC25 PTR(31),       /* PTR TO ISTAPC25            */ 03943000
*           3  ATCAP41  PTR(31),       /* PTR TO ISTAPC41            */ 03944000
*           3  ATCRCFY0 PTR(31),       /* PTR TO ISTRCFY0            */ 03945000
*           3  ATCAP55  PTR(31),       /* PTR TO ISTAPC55            */ 03946000
*           3  ATCAP56  PTR(31),       /* PTR TO ISTAPC56            */ 03947000
*           3  ATCAPC59 PTR(31),       /* PTR TO ISTAPC59            */ 03948000
*           3  ATCAP62  PTR(31),       /* PTR TO ISTAPC62            */ 03949000
*           3  ATCAP66  PTR(31),       /* PTR TO ISTAPC66            */ 03950000
*           3  ATCAP69  PTR(31),       /* PTR TO ISTAPM69            */ 03951000
*           3  ATCAP82  PTR(31),       /* PTR TO ISTAPC82            */ 03952000
*           3  ATCAP83  PTR(31),       /* PTR TO ISTAPC83            */ 03953000
*           3  ATCAP84  PTR(31),       /* PTR TO ISTAPC84            */ 03954000
*           3  ATCAP85  PTR(31),       /* PTR TO ISTAPC85            */ 03955000
*           3  ATCAP86  PTR(31),       /* PTR TO ISTAPC86            */ 03956000
*           3  ATCASCB  PTR(31),       /* PTR TO VTAM ASCB           */ 03957000
*           3  ATCMPLTA  PTR(31),      /* PTR TO MPST LIST TABLE     */ 03958000
*           3  ATCZR01  PTR(31),       /* PTR TO ISTZRM01            */ 03959000
*           3  ATCAICTN PTR(31),       /* PTR TO ISTAICTN            */ 03960000
*           3  ATCTPCP0 PTR(31),       /* PTR TO ISTZFSAV            */ 03961000
*           3  ATCTPCP1 PTR(31),       /* PTR TO ISTZ19SV            */ 03962000
*           3  ATCZFLAG BIT(8),        /* FLAG BYTE                  */ 03963000
*              4 ATCZF001 BIT(1),      /* MDR RECORDING SUSPENDED    */ 03964000
*              4 ATCRSV66 BIT(7),      /* RESERVED                   */ 03965000
*           3  ATCRSV75 BIT(8),        /* RESERVED                   */ 03966000
*           3  ATCSRBCT FIXED(16),     /* COUNT OF PREALLOCATED SRB'S*/ 03967000
*           3  ATCCRACT FIXED(16),     /* COUNT OF PREALLOCATED CRA'S*/ 03968000
*           3  ATCRPLCT FIXED(16),     /* COUNT OF PREALLOCATED CRPL */ 03969000
*           3  ATCRSV88 PTR(31),       /* RESERVED                   */ 03970000
*           3  ATCTPMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /*TP MSG PAB 03971000
*                                                         FOR VS2    */ 03972000
*           3  ATCTPMMI PTR(31),        /* PTR TO ISTCFMMI - MSG ISSUER 03973000
*                                          FOR SRB MODE ROUTINES     */ 03974000
*           3  ATCVIOPM PTR(31),       /* PTR TO ISTVIOPM            */ 03975000
*           3  ATCPOPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0792 03976000
*                   /* POPAB FOR REPLY PROCESSING, POI TERMINATION,  */ 03977000
*                   /* AND VTAM MESSAGE PROCESSOR                    */ 03978000
*        2  ATCAOS CHAR(0) BDY(WORD);  /* VS2 ONLY FIELDS            */ 03979000
*                                                                  0793 03980000
*    /* * * * * * * * * * * * * * * * * * * * * * * * * * * */     0793 03981000
*    /*                                                     */     0793 03982000
*    /*             V A R Y   W O R K   A R E A             */     0793 03983000
*    /*                                                     */     0793 03984000
*    /* * * * * * * * * * * * * * * * * * * * * * * * * * * */     0793 03985000
*    DCL 1 ISTVWA BASED(NCSPLWKA),/* VARY WORK AREA         */     0793 03986000
*          2 VWANAV PTR(31),   /* NEXT AVAILABLE POINTER    */     0793 03987000
*          2 VWALTH FIXED(31), /* VARY WORK AREA LENGTH     */     0793 03988000
*          2 VWADYN CHAR(*);   /* DYNAMIC WORK AREA SPACE   */     0793 03989000
*    DCL VWASSP PTR(31) BASED(VWANAV);/* SPEC SAVE AREA PTR */     0794 03990000
*    /* * * * * * * * * * * * * * * * * * * * * * * * * * * */     0795 03991000
*    /*                                                     */     0795 03992000
*    /*         R E G I S T E R   S A V E   A R E A         */     0795 03993000
*    /*                                                     */     0795 03994000
*    /* * * * * * * * * * * * * * * * * * * * * * * * * * * */     0795 03995000
*    DCL 1 ISTRSA BASED(R13),  /* REGISTER SAVE AREA        */     0795 03996000
*          2 * BIT(32),        /* RESERVED (UNUSED)         */     0795 03997000
*          2 RSABPT PTR(31),   /* BACK POINTER              */     0795 03998000
*          2 RSAFPT PTR(31),   /* FORWARD POINTER           */     0795 03999000
*          2 RSARSA,           /* REGISTER SAVE AREA        */     0795 04000000
*            3 RSAR14 PTR(31), /* REG 14 SAVE AREA          */     0795 04001000
*            3 RSAR15 PTR(31), /* REG 15 SAVE AREA          */     0795 04002000
*            3 RSAR00 PTR(31), /* REG 00 SAVE AREA          */     0795 04003000
*            3 RSAR01 PTR(31), /* REG 01 SAVE AREA          */     0795 04004000
*            3 RSAR02 PTR(31), /* REG 02 SAVE AREA          */     0795 04005000
*            3 RSAR03 PTR(31), /* REG 03 SAVE AREA          */     0795 04006000
*            3 RSAR04 PTR(31), /* REG 04 SAVE AREA          */     0795 04007000
*            3 RSAR05 PTR(31), /* REG 05 SAVE AREA          */     0795 04008000
*            3 RSAR06 PTR(31), /* REG 06 SAVE AREA          */     0795 04009000
*            3 RSAR07 PTR(31), /* REG 07 SAVE AREA          */     0795 04010000
*            3 RSAR08 PTR(31), /* REG 08 SAVE AREA          */     0795 04011000
*            3 RSAR09 PTR(31), /* REG 09 SAVE AREA          */     0795 04012000
*            3 RSAR10 PTR(31), /* REG 10 SAVE AREA          */     0795 04013000
*            3 RSAR11 PTR(31), /* REG 11 SAVE AREA          */     0795 04014000
*            3 RSAR12 PTR(31); /* REG 12 SAVE AREA          */     0795 04015000
*    DCL ISTINCR5 ENTRY NONLOCAL EXT;                              0796 04016000
*                                                                  0796 04017000
*    DECLARE                                                       0797 04018000
*      EMCR0 PTR REG(0),                                           0797 04019000
*      EMCR1 PTR REG(1),                                           0797 04020000
*      EMCR2 PTR REG(2),                                           0797 04021000
*      EMCR3 PTR REG(3),                                           0797 04022000
*      EMCR4 PTR REG(4),                                           0797 04023000
*      EMCR5 PTR REG(5),                                           0797 04024000
*      EMCR6 PTR REG(6),                                           0797 04025000
*      EMCR7 PTR REG(7),                                           0797 04026000
*      EMCR8 PTR REG(8),                                           0797 04027000
*      EMCR9 PTR REG(9),                                           0797 04028000
*      EMCR10 PTR REG(10),                                         0797 04029000
*      EMCR11 PTR REG(11),                                         0797 04030000
*      EMCR12 PTR REG(12),                                         0797 04031000
*      EMCR13 PTR REG(13),                                         0797 04032000
*      EMCR14 PTR REG(14),                                         0797 04033000
*      EMCR15 PTR REG(15);                                         0797 04034000
*    GEN (PRINT ON);                                               0798 04035000
         PRINT ON                                                       04036000
*/* END OF TPEPILOG */                                             0799 04037000
*   END ISTINCVN;                                                  0799 04038000
@EL00001 DS    0H                                                  0799 04039000
@EF00001 DS    0H                                                  0799 04040000
@ER00001 LM    @14,@12,12(@13)                                     0799 04041000
         BR    @14                                                 0799 04042000
@DATA    DS    0H                                                       04043000
@DATD    DSECT                                                          04044000
         DS    0F                                                       04045000
ISTINCVN CSECT                                                          04046000
         DS    0F                                                       04047000
@CF00139 DC    F'4'                                                     04048000
@CF00446 DC    F'72'                                                    04049000
@CF00073 DC    XL4'FFFFFFF8'                                            04050000
@CF00160 DC    XL4'80000000'                                            04051000
@CF00258 DC    XL4'00FFFFFF'                                            04052000
@CF00357 DC    XL4'08000000'                                            04053000
@DATD    DSECT                                                          04054000
         DS    0D                                                       04055000
LCPBPTR  DS    A                                                        04056000
CVNWKMAP DS    CL52                                                     04057000
         ORG   CVNWKMAP                                                 04058000
CVNSAV14 DS    FL4                                                      04059000
RETCODE  DS    FL4                                                      04060000
CVNMSGID DS    CL4                                                      04061000
MSGTXT   DS    CL24                                                     04062000
         ORG   MSGTXT                                                   04063000
CVNVARY  DS    CL8                                                      04064000
MSGRES   DS    CL16                                                     04065000
         ORG   MSGRES                                                   04066000
RESRCA   DS    CL8                                                      04067000
RESRCB   DS    CL8                                                      04068000
         ORG   RESRCB                                                   04069000
INSERT   DS    CL1                                                      04070000
         ORG   CVNWKMAP+36                                              04071000
CVNPAREA DS    CL16                                                     04072000
         ORG   CVNWKMAP+52                                              04073000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                04074000
@ENDDATD EQU   *                                                        04075000
ISTINCVN CSECT                                                          04076000
         DS    0F                                                       04077000
@SIZDATD DC    AL1(0)                                                   04078000
         DC    AL3(@ENDDATD-@DATD)                                      04079000
@CV00206 DC    V(ISTINCR5)                                              04080000
         DS    0D                                                       04081000
@CC00185 DC    C'VARY    '                                              04082000
@CC00164 DC    C'660I'                                                  04083000
@CC00166 DC    C'661I'                                                  04084000
@CC00168 DC    C'602I'                                                  04085000
@CC00170 DC    C'608I'                                                  04086000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       04087000
@01      EQU   01                                                       04088000
@02      EQU   02                                                       04089000
@03      EQU   03                                                       04090000
@04      EQU   04                                                       04091000
@05      EQU   05                                                       04092000
@06      EQU   06                                                       04093000
@07      EQU   07                                                       04094000
@08      EQU   08                                                       04095000
@09      EQU   09                                                       04096000
@10      EQU   10                                                       04097000
@11      EQU   11                                                       04098000
@12      EQU   12                                                       04099000
@13      EQU   13                                                       04100000
@14      EQU   14                                                       04101000
@15      EQU   15                                                       04102000
R01      EQU   @01                                                      04103000
R13      EQU   @13                                                      04104000
R15      EQU   @15                                                      04105000
R10      EQU   @10                                                      04106000
R11      EQU   @11                                                      04107000
GPR00F   EQU   @00                                                      04108000
GPR00P   EQU   @00                                                      04109000
GPR01P   EQU   @01                                                      04110000
GPR02P   EQU   @02                                                      04111000
GPR03P   EQU   @03                                                      04112000
GPR04P   EQU   @04                                                      04113000
GPR05P   EQU   @05                                                      04114000
GPR06P   EQU   @06                                                      04115000
GPR07P   EQU   @07                                                      04116000
GPR08P   EQU   @08                                                      04117000
GPR09P   EQU   @09                                                      04118000
GPR10P   EQU   @10                                                      04119000
GPR11P   EQU   @11                                                      04120000
GPR12P   EQU   @12                                                      04121000
GPR13P   EQU   @13                                                      04122000
GPR14P   EQU   @14                                                      04123000
GPR15P   EQU   @15                                                      04124000
CMDRNPTR EQU   @09                                                      04125000
LCLRNPTR EQU   @08                                                      04126000
INNODPTR EQU   @07                                                      04127000
EMCR2    EQU   @02                                                      04128000
EMCR3    EQU   @03                                                      04129000
REG1016  EQU   @01                                                      04130000
EMCR13   EQU   @13                                                      04131000
REG15016 EQU   @15                                                      04132000
EMCR14   EQU   @14                                                      04133000
EMCR0    EQU   @00                                                      04134000
EMCR1    EQU   @01                                                      04135000
EMCR15   EQU   @15                                                      04136000
RPHPTR   EQU   @01                                                      04137000
EMCR10   EQU   @10                                                      04138000
EMCR11   EQU   @11                                                      04139000
EMCR12   EQU   @12                                                      04140000
EMCR4    EQU   @04                                                      04141000
EMCR5    EQU   @05                                                      04142000
EMCR6    EQU   @06                                                      04143000
EMCR7    EQU   @07                                                      04144000
EMCR8    EQU   @08                                                      04145000
EMCR9    EQU   @09                                                      04146000
GPR01F   EQU   @01                                                      04147000
GPR02F   EQU   @02                                                      04148000
GPR03F   EQU   @03                                                      04149000
GPR04F   EQU   @04                                                      04150000
GPR05F   EQU   @05                                                      04151000
GPR06F   EQU   @06                                                      04152000
GPR07F   EQU   @07                                                      04153000
GPR08F   EQU   @08                                                      04154000
GPR09F   EQU   @09                                                      04155000
GPR10F   EQU   @10                                                      04156000
GPR11F   EQU   @11                                                      04157000
GPR12F   EQU   @12                                                      04158000
GPR13F   EQU   @13                                                      04159000
GPR14F   EQU   @14                                                      04160000
GPR15F   EQU   @15                                                      04161000
ATCLCPTR EQU   1032                                                     04162000
ISTRPH   EQU   0                                                        04163000
RPHCNTL  EQU   ISTRPH                                                   04164000
RPHFLAGS EQU   RPHCNTL+2                                                04165000
RPHAPTYP EQU   RPHFLAGS                                                 04166000
RPHFSTLC EQU   RPHFLAGS                                                 04167000
RPHFLGB  EQU   RPHCNTL+3                                                04168000
RPHRPHA  EQU   ISTRPH+4                                                 04169000
RPHTSKID EQU   ISTRPH+8                                                 04170000
RPHRESMA EQU   ISTRPH+16                                                04171000
RPHWPFLG EQU   RPHRESMA                                                 04172000
RPHWEA   EQU   ISTRPH+24                                                04173000
RPHCSPA  EQU   RPHWEA                                                   04174000
RPHSRPRM EQU   ISTRPH+28                                                04175000
RPHCRR   EQU   ISTRPH+32                                                04176000
RPHPABQA EQU   ISTRPH+36                                                04177000
RPHWORK  EQU   ISTRPH+40                                                04178000
RPHSAVE1 EQU   RPHWORK                                                  04179000
RPHSBITS EQU   RPHSAVE1+1                                               04180000
ISTPOHD  EQU   0                                                        04181000
POHSTAT  EQU   ISTPOHD+1                                                04182000
ISTPFX   EQU   0                                                        04183000
PFXID    EQU   ISTPFX                                                   04184000
ISTNCSPL EQU   0                                                        04185000
@NM00006 EQU   ISTNCSPL                                                 04186000
NCSPFX   EQU   @NM00006                                                 04187000
NCSPLVBF EQU   ISTNCSPL+18                                              04188000
NCSPLVFL EQU   ISTNCSPL+20                                              04189000
NCSPLVF1 EQU   ISTNCSPL+21                                              04190000
NCSCRCMD EQU   ISTNCSPL+50                                              04191000
NCSPLRPT EQU   ISTNCSPL+52                                              04192000
NCSPLCMD EQU   ISTNCSPL+60                                              04193000
NCSCMDA  EQU   NCSPLCMD                                                 04194000
NCSPLUAD EQU   ISTNCSPL+64                                              04195000
NCSCRFLG EQU   ISTNCSPL+67                                              04196000
NCSPLRAD EQU   ISTNCSPL+144                                             04197000
NCSIOCID EQU   ISTNCSPL+148                                             04198000
NCSPLCID EQU   NCSIOCID                                                 04199000
NCSPLWKA EQU   ISTNCSPL+152                                             04200000
NCSPLCVT EQU   ISTNCSPL+156                                             04201000
NCSPLRPH EQU   ISTNCSPL+160                                             04202000
NCSPLFSB EQU   ISTNCSPL+168                                             04203000
NCSPLFL1 EQU   ISTNCSPL+176                                             04204000
NCSPLSOM EQU   NCSPLFL1                                                 04205000
NCSPLFL2 EQU   ISTNCSPL+177                                             04206000
NCSPLFL3 EQU   ISTNCSPL+178                                             04207000
NCSPLFL4 EQU   ISTNCSPL+179                                             04208000
NCSPLFL5 EQU   ISTNCSPL+181                                             04209000
NCSPLRRP EQU   ISTNCSPL+204                                             04210000
NCSPLAPP EQU   ISTNCSPL+216                                             04211000
NCSRNAME EQU   ISTNCSPL+220                                             04212000
NCSSENSE EQU   ISTNCSPL+244                                             04213000
NCSCRDTE EQU   ISTNCSPL+264                                             04214000
NCSCRMSK EQU   ISTNCSPL+268                                             04215000
NCSCHKPT EQU   NCSCRMSK                                                 04216000
NCSCUA   EQU   NCSCHKPT+1                                               04217000
NCSRNME  EQU   NCSCHKPT+1                                               04218000
NCSCRMOD EQU   NCSCRMSK+2                                               04219000
NCSPLSID EQU   ISTNCSPL+271                                             04220000
NCSPLSTA EQU   NCSPLSID                                                 04221000
NCSPLPHD EQU   NCSPLSID+1                                               04222000
NCSAPP   EQU   0                                                        04223000
NCSAPBUE EQU   NCSAPP+88                                                04224000
ISTLCCW  EQU   0                                                        04225000
LCCWOP   EQU   ISTLCCW                                                  04226000
LCCWRWOP EQU   LCCWOP                                                   04227000
LCCWCTL  EQU   LCCWRWOP                                                 04228000
LCCWFLAG EQU   ISTLCCW+1                                                04229000
LCCWLSI  EQU   LCCWFLAG                                                 04230000
ISTLCPB  EQU   0                                                        04231000
LCPREQTG EQU   ISTLCPB+2                                                04232000
LCPFLAGS EQU   LCPREQTG                                                 04233000
LCPZF001 EQU   LCPFLAGS                                                 04234000
LCPZRT02 EQU   LCPZF001                                                 04235000
LCPZF002 EQU   LCPFLAGS                                                 04236000
LCPZRT03 EQU   LCPZF002                                                 04237000
LCPZF003 EQU   LCPFLAGS                                                 04238000
LCPZRT04 EQU   LCPZF003                                                 04239000
LCPZF004 EQU   LCPFLAGS                                                 04240000
LCPZRT05 EQU   LCPZF004                                                 04241000
LCPZRT06 EQU   LCPFLAGS                                                 04242000
LCPZRT07 EQU   LCPFLAGS                                                 04243000
LCPMNRCD EQU   LCPREQTG+1                                               04244000
LCPZRT08 EQU   LCPMNRCD                                                 04245000
LCPZRT09 EQU   LCPMNRCD                                                 04246000
LCPCHAIN EQU   ISTLCPB+4                                                04247000
LCPCHAI1 EQU   LCPCHAIN                                                 04248000
LCPRUCNT EQU   ISTLCPB+8                                                04249000
LCPFLAG2 EQU   ISTLCPB+9                                                04250000
LCPTLBPI EQU   LCPFLAG2                                                 04251000
LCPFID0  EQU   LCPFLAG2                                                 04252000
LCPSEQ   EQU   ISTLCPB+10                                               04253000
LCPCID   EQU   ISTLCPB+16                                               04254000
LCPFDBA  EQU   ISTLCPB+24                                               04255000
LCPFLG1  EQU   ISTLCPB+37                                               04256000
LCPFLCCW EQU   ISTLCPB+40                                               04257000
LCPLCCW  EQU   ISTLCPB+48                                               04258000
LCPPABA  EQU   LCPLCCW+4                                                04259000
LCPRPHA  EQU   LCPPABA                                                  04260000
ISTZSAVE EQU   0                                                        04261000
ZSAZSVBC EQU   ISTZSAVE                                                 04262000
ZSAZSVMS EQU   ZSAZSVBC                                                 04263000
ISTPFCRR EQU   0                                                        04264000
PFCCRR   EQU   ISTPFCRR                                                 04265000
PFCCRRID EQU   PFCCRR                                                   04266000
PFCCRRLN EQU   PFCCRR+2                                                 04267000
PFCHDR   EQU   ISTPFCRR+4                                               04268000
PFCCRRO  EQU   PFCHDR                                                   04269000
PFCFRRO  EQU   PFCHDR+4                                                 04270000
ISTCFCRR EQU   0                                                        04271000
CFCAUDIT EQU   ISTCFCRR                                                 04272000
CFCNTRD  EQU   CFCAUDIT                                                 04273000
CFCCRT   EQU   CFCAUDIT+1                                               04274000
ISTZCRR  EQU   0                                                        04275000
ZCRCRR   EQU   ISTZCRR                                                  04276000
ZCRFLGS1 EQU   ISTZCRR+12                                               04277000
ZCRFLGS2 EQU   ISTZCRR+13                                               04278000
ZCRSWFLD EQU   ISTZCRR+14                                               04279000
ZCRENDSH EQU   ZCRSWFLD                                                 04280000
ZCRNDLCP EQU   ZCRSWFLD                                                 04281000
ZCRRESET EQU   ZCRSWFLD                                                 04282000
ZCRFLGS3 EQU   ISTZCRR+15                                               04283000
ZCRGENSW EQU   ISTZCRR+16                                               04284000
ZCRPFLGS EQU   ISTZCRR+17                                               04285000
ZCRIBPR  EQU   ISTZCRR+18                                               04286000
ZCRSCPSW EQU   ISTZCRR+19                                               04287000
ZCRPARMS EQU   ISTZCRR+24                                               04288000
ZCRFBPTR EQU   ZCRPARMS                                                 04289000
ZCRDFRDA EQU   ZCRPARMS+10                                              04290000
ZCRPCOD1 EQU   ZCRPARMS+12                                              04291000
ZCRPLSBF EQU   ZCRPCOD1                                                 04292000
ZCRPCOD2 EQU   ZCRPARMS+13                                              04293000
ZCRSVRTN EQU   ISTZCRR+56                                               04294000
ZCRWKARA EQU   ISTZCRR+156                                              04295000
ZCRCIDSV EQU   ISTZCRR+192                                              04296000
ZCRAUDIT EQU   ISTZCRR+440                                              04297000
ZCRENTER EQU   ZCRAUDIT+5                                               04298000
ZCRLCPB  EQU   ISTZCRR+480                                              04299000
ZCRRHRU  EQU   ZCRLCPB                                                  04300000
ISTASCRR EQU   0                                                        04301000
ASCFLAGS EQU   ISTASCRR+16                                              04302000
ASCFLG1  EQU   ASCFLAGS                                                 04303000
ASCFLG2  EQU   ASCFLAGS+2                                               04304000
ASCFLG3  EQU   ASCFLAGS+4                                               04305000
ASCUSRGS EQU   ISTASCRR+28                                              04306000
ISTAPCRR EQU   0                                                        04307000
APCATFLG EQU   ISTAPCRR+16                                              04308000
APCRFLG  EQU   ISTAPCRR+18                                              04309000
APCSAVE  EQU   ISTAPCRR+44                                              04310000
APCCOMF  EQU   ISTAPCRR+116                                             04311000
APCCOMF1 EQU   APCCOMF                                                  04312000
APC31FLG EQU   ISTAPCRR+132                                             04313000
APC52FLG EQU   ISTAPCRR+133                                             04314000
APC53FLG EQU   ISTAPCRR+134                                             04315000
APC54FLG EQU   ISTAPCRR+135                                             04316000
APC57FLG EQU   ISTAPCRR+136                                             04317000
ISTCRA   EQU   0                                                        04318000
CRABASIC EQU   ISTCRA                                                   04319000
CRAHDR   EQU   CRABASIC                                                 04320000
CRACRR   EQU   CRAHDR                                                   04321000
CRALKACT EQU   CRABASIC+8                                               04322000
CRAL2PTR EQU   CRABASIC+16                                              04323000
CRASVC   EQU   ISTCRA+848                                               04324000
CRABUFA  EQU   CRASVC+68                                                04325000
ISTCNSTA EQU   0                                                        04326000
CNSTFLDA EQU   ISTCNSTA+16                                              04327000
CNSTFLDB EQU   ISTCNSTA+19                                              04328000
ISTVYCRR EQU   0                                                        04329000
VYCAUDIT EQU   ISTVYCRR+22                                              04330000
VYCNTRD  EQU   VYCAUDIT                                                 04331000
NINCVN   EQU   VYCNTRD+1                                                04332000
VYCCRT   EQU   VYCAUDIT+12                                              04333000
CINCVN   EQU   VYCCRT+1                                                 04334000
ISTRSA   EQU   0                                                        04335000
RSABPT   EQU   ISTRSA+4                                                 04336000
RSAFPT   EQU   ISTRSA+8                                                 04337000
RSARSA   EQU   ISTRSA+12                                                04338000
ISTLOK   EQU   0                                                        04339000
LOKCHN   EQU   ISTLOK+1                                                 04340000
LOKCHNG  EQU   LOKCHN                                                   04341000
@NM00025 EQU   LOKCHNG+2                                                04342000
ISTDEVCH EQU   0                                                        04343000
DEVSHCH  EQU   ISTDEVCH                                                 04344000
DEVCHAR  EQU   DEVSHCH                                                  04345000
DEVTCODE EQU   ISTDEVCH+1                                               04346000
DEVFLAGS EQU   ISTDEVCH+3                                               04347000
DEVFCCTL EQU   DEVFLAGS                                                 04348000
DEVCHAR3 EQU   DEVFLAGS                                                 04349000
ISTRPRE  EQU   0                                                        04350000
RPRNAME  EQU   ISTRPRE                                                  04351000
RPRCOMID EQU   ISTRPRE+8                                                04352000
RPRENTRY EQU   ISTRPRE+20                                               04353000
RPRFLAGA EQU   ISTRPRE+21                                               04354000
RPRFLAGB EQU   ISTRPRE+22                                               04355000
RPRONLIN EQU   RPRFLAGB                                                 04356000
RPRCAUSE EQU   ISTRPRE+23                                               04357000
RPRCRCPT EQU   RPRCAUSE                                                 04358000
RPRNSNEA EQU   ISTRPRE+36                                               04359000
RPRFLAGD EQU   ISTRPRE+61                                               04360000
RPRFLAGC EQU   ISTRPRE+62                                               04361000
ISTRCPRE EQU   0                                                        04362000
RCPPMODE EQU   ISTRCPRE+91                                              04363000
RCPLGNIN EQU   ISTRCPRE+92                                              04364000
ISTRDT   EQU   0                                                        04365000
RDTPLEN  EQU   ISTRDT+72                                                04366000
RDTPRIOR EQU   RDTPLEN                                                  04367000
RDTNODID EQU   ISTRDT+89                                                04368000
RDTFLAGB EQU   ISTRDT+91                                                04369000
RDTVYRPH EQU   ISTRDT+108                                               04370000
RDTSTCNT EQU   ISTRDT+112                                               04371000
ISTRAP   EQU   0                                                        04372000
RAPFLG   EQU   ISTRAP+108                                               04373000
RAPFLGB  EQU   ISTRAP+109                                               04374000
RAPFLGC  EQU   ISTRAP+110                                               04375000
ISTRLC   EQU   0                                                        04376000
RLCADR   EQU   ISTRLC+72                                                04377000
RLCFLAG  EQU   RLCADR                                                   04378000
ISTRRN   EQU   0                                                        04379000
RRNADR   EQU   ISTRRN+136                                               04380000
RRNFLAG  EQU   RRNADR                                                   04381000
RRNLCSIP EQU   RRNFLAG                                                  04382000
RRNLCDIE EQU   RRNFLAG                                                  04383000
RRNUCBAD EQU   RRNADR+1                                                 04384000
RRNRNCUA EQU   ISTRRN+144                                               04385000
RRNTRENT EQU   ISTRRN+148                                               04386000
RRNRDF   EQU   ISTRRN+172                                               04387000
RRNRDFA  EQU   RRNRDF                                                   04388000
RRNRBREM EQU   RRNRDFA                                                  04389000
RRNRDFB  EQU   RRNRDF+1                                                 04390000
RRNCMF   EQU   ISTRRN+176                                               04391000
RRNCMFA  EQU   RRNCMF                                                   04392000
RRNCMFB  EQU   RRNCMF+1                                                 04393000
RRNCMFC  EQU   RRNCMF+2                                                 04394000
RRNCMFD  EQU   RRNCMF+3                                                 04395000
RRNNMDPD EQU   ISTRRN+192                                               04396000
RRNHPRE  EQU   ISTRRN+216                                               04397000
RRNRPLPT EQU   ISTRRN+232                                               04398000
RRNRDCUA EQU   ISTRRN+244                                               04399000
RRNRINNM EQU   ISTRRN+248                                               04400000
ISTRGP   EQU   0                                                        04401000
RGPFLG   EQU   ISTRGP+72                                                04402000
ISTRLN   EQU   0                                                        04403000
RLNADR   EQU   ISTRLN+72                                                04404000
RLNFLAG  EQU   RLNADR                                                   04405000
RLNUCBAD EQU   RLNADR+1                                                 04406000
RLNSTAT1 EQU   ISTRLN+86                                                04407000
RLNSTAT2 EQU   ISTRLN+87                                                04408000
RLNRDF   EQU   ISTRLN+88                                                04409000
RLNRDFA  EQU   RLNRDF                                                   04410000
RLNRACNT EQU   RLNRDFA                                                  04411000
RLNRDFB  EQU   RLNRDF+1                                                 04412000
RLNCRFLG EQU   ISTRLN+102                                               04413000
RLNLSCMD EQU   RLNCRFLG                                                 04414000
ISTRPT   EQU   0                                                        04415000
RPTLNCID EQU   ISTRPT+116                                               04416000
RPTDITT  EQU   ISTRPT+128                                               04417000
RPTFLAG1 EQU   ISTRPT+140                                               04418000
ISTRCL   EQU   0                                                        04419000
RCLADR   EQU   ISTRCL+72                                                04420000
RCLFLAG  EQU   RCLADR                                                   04421000
ISTRTR   EQU   0                                                        04422000
RTRADR   EQU   ISTRTR+124                                               04423000
RTRFLAG  EQU   RTRADR                                                   04424000
RTRRDFA  EQU   ISTRTR+136                                               04425000
RTRRAALL EQU   RTRRDFA                                                  04426000
RTRRDFB  EQU   ISTRTR+137                                               04427000
RTRRDFC  EQU   ISTRTR+138                                               04428000
RTRRDFD  EQU   ISTRTR+139                                               04429000
RTRRDFE  EQU   ISTRTR+140                                               04430000
RTRRDFF  EQU   ISTRTR+141                                               04431000
RTRCRFLG EQU   ISTRTR+143                                               04432000
RTRLSCMD EQU   RTRCRFLG                                                 04433000
RTRBSCID EQU   ISTRTR+188                                               04434000
ISTRIN   EQU   0                                                        04435000
RINDFD   EQU   ISTRIN+124                                               04436000
RINREMPO EQU   RINDFD                                                   04437000
RINNODEF EQU   RINDFD                                                   04438000
RINLDISC EQU   RINDFD                                                   04439000
RINNODID EQU   ISTRIN+125                                               04440000
RINRLDAF EQU   ISTRIN+126                                               04441000
RINREMOT EQU   ISTRIN+128                                               04442000
RINVPAB  EQU   ISTRIN+132                                               04443000
RINRPHCN EQU   ISTRIN+136                                               04444000
RINNCSPL EQU   ISTRIN+140                                               04445000
RINCNCNT EQU   ISTRIN+144                                               04446000
RINLOCRN EQU   ISTRIN+148                                               04447000
ISTRDS   EQU   0                                                        04448000
ISTDOT   EQU   0                                                        04449000
ISTRCC   EQU   0                                                        04450000
RCCFLAG  EQU   ISTRCC+73                                                04451000
RCCFLAGB EQU   ISTRCC+74                                                04452000
RCCSTAID EQU   ISTRCC+78                                                04453000
RCCID48  EQU   RCCSTAID+2                                               04454000
RCCCRFLG EQU   ISTRCC+108                                               04455000
ISTRLU   EQU   0                                                        04456000
RLUFLAG  EQU   ISTRLU+125                                               04457000
RLUCRFLG EQU   ISTRLU+126                                               04458000
RLUPACE  EQU   ISTRLU+132                                               04459000
RLUNCPPC EQU   ISTRLU+134                                               04460000
RLUUSSTB EQU   ISTRLU+140                                               04461000
RLUMODET EQU   ISTRLU+152                                               04462000
ISTRPX   EQU   0                                                        04463000
ISTRLX   EQU   0                                                        04464000
RLXFLAGA EQU   ISTRLX+76                                                04465000
ISTRSW   EQU   0                                                        04466000
ISTRDA   EQU   0                                                        04467000
RDAADR   EQU   ISTRDA+72                                                04468000
RDAFLAG  EQU   RDAADR                                                   04469000
RDAUCBAD EQU   RDAADR+1                                                 04470000
ISTRLS   EQU   0                                                        04471000
ISTDNT   EQU   0                                                        04472000
ISTGNT   EQU   0                                                        04473000
ISTPAT   EQU   0                                                        04474000
PATFLAGA EQU   ISTPAT+7                                                 04475000
ISTPAB   EQU   0                                                        04476000
PABWQCHN EQU   ISTPAB                                                   04477000
PABWEQA  EQU   PABWQCHN                                                 04478000
PABCHAIN EQU   PABWQCHN+4                                               04479000
PABRPHFG EQU   ISTPAB+12                                                04480000
PABFLAGS EQU   PABRPHFG                                                 04481000
PABERLCK EQU   PABFLAGS                                                 04482000
PABERRLK EQU   PABERLCK                                                 04483000
ISTDYPAB EQU   0                                                        04484000
ISTATCVT EQU   0                                                        04485000
ATCCOM   EQU   ISTATCVT                                                 04486000
ATCSTAT  EQU   ATCCOM                                                   04487000
ATCSTAT1 EQU   ATCSTAT                                                  04488000
ATCSTFLG EQU   ATCSTAT+1                                                04489000
ATCPOFLG EQU   ATCSTAT+2                                                04490000
ATCSTAT4 EQU   ATCSTAT+3                                                04491000
ATCIOTRC EQU   ATCCOM+140                                               04492000
ATCTHTRC EQU   ATCIOTRC                                                 04493000
ATCSRTDF EQU   ATCCOM+208                                               04494000
ATCCSMR  EQU   ISTATCVT+296                                             04495000
ATCSHRFG EQU   ISTATCVT+316                                             04496000
ATCMSGP  EQU   ISTATCVT+344                                             04497000
ATCHPGM  EQU   ISTATCVT+384                                             04498000
ATCAP33  EQU   ISTATCVT+444                                             04499000
ATCAP35  EQU   ISTATCVT+448                                             04500000
ATCVOCLK EQU   ISTATCVT+468                                             04501000
ATCVLCNT EQU   ISTATCVT+772                                             04502000
ATCRNO   EQU   ISTATCVT+788                                             04503000
ATCSOPD  EQU   ISTATCVT+792                                             04504000
ATCSIPD  EQU   ISTATCVT+800                                             04505000
ATCSECST EQU   ISTATCVT+812                                             04506000
ATCSTAT2 EQU   ISTATCVT+818                                             04507000
ATCVTBAM EQU   ISTATCVT+908                                             04508000
@NM00039 EQU   ATCVTBAM+3                                               04509000
ATCAOSM  EQU   ISTATCVT+912                                             04510000
ATCGSRBQ EQU   ATCAOSM+4                                                04511000
ATCGSRBG EQU   ATCGSRBQ                                                 04512000
ATCAP31  EQU   ATCAOSM+24                                               04513000
ATCICAPP EQU   ATCAOSM+100                                              04514000
ATCLDAPP EQU   ATCAOSM+120                                              04515000
ATCDAPVT EQU   ATCAOSM+140                                              04516000
ATCCRA   EQU   ATCAOSM+280                                              04517000
ATCCRACN EQU   ATCCRA+4                                                 04518000
ATCSRB   EQU   ATCAOSM+288                                              04519000
ATCSRBCN EQU   ATCSRB+4                                                 04520000
ATCCRPL  EQU   ATCAOSM+296                                              04521000
ATCRPLCN EQU   ATCCRPL+4                                                04522000
ATCVTFLG EQU   ATCAOSM+392                                              04523000
ATCZFLAG EQU   ATCAOSM+588                                              04524000
SRTDELFD EQU   0                                                        04525000
@NM00001 EQU   0                                                        04526000
CMZID016 EQU   @NM00001                                                 04527000
@NM00002 EQU   @NM00001+4                                               04528000
CMZRL016 EQU   @NM00002                                                 04529000
CMZRA016 EQU   @NM00002+1                                               04530000
CMZEA016 EQU   @NM00001+8                                               04531000
CMZVP016 EQU   @NM00001+12                                              04532000
CMZSA016 EQU   0                                                        04533000
CMTA016  EQU   0                                                        04534000
FMZL0029 EQU   0                                                        04535000
FMZL0036 EQU   0                                                        04536000
FMZL0051 EQU   0                                                        04537000
FMZL0061 EQU   0                                                        04538000
FMZL0066 EQU   0                                                        04539000
NCSUSSRU EQU   0                                                        04540000
ISTVWA   EQU   0                                                        04541000
VWANAV   EQU   ISTVWA                                                   04542000
VWASSP   EQU   0                                                        04543000
LCPZTIE  EQU   LCPCID                                                   04544000
LCPZSNAM EQU   LCPZTIE+8                                                04545000
RTRDNCBA EQU   ISTRTR+40                                                04546000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    04547000
LCPZTRV4 EQU   LCPZSNAM+4                                               04548000
LCPZTRV1 EQU   LCPZSNAM                                                 04549000
LCPZSNA  EQU   LCPZTIE+4                                                04550000
LCPZFMCA EQU   LCPZTIE                                                  04551000
VWADYN   EQU   ISTVWA+8                                                 04552000
VWALTH   EQU   ISTVWA+4                                                 04553000
NCSRUITS EQU   NCSUSSRU+2                                               04554000
NCSRULEN EQU   NCSUSSRU                                                 04555000
ATCAOS   EQU   ISTATCVT+1584                                            04556000
ATCPOPAB EQU   ATCAOSM+640                                              04557000
ATCVIOPM EQU   ATCAOSM+636                                              04558000
ATCTPMMI EQU   ATCAOSM+632                                              04559000
ATCTPMPB EQU   ATCAOSM+600                                              04560000
ATCRSV88 EQU   ATCAOSM+596                                              04561000
ATCRPLCT EQU   ATCAOSM+594                                              04562000
ATCCRACT EQU   ATCAOSM+592                                              04563000
ATCSRBCT EQU   ATCAOSM+590                                              04564000
ATCRSV75 EQU   ATCAOSM+589                                              04565000
ATCRSV66 EQU   ATCZFLAG                                                 04566000
ATCZF001 EQU   ATCZFLAG                                                 04567000
ATCTPCP1 EQU   ATCAOSM+584                                              04568000
ATCTPCP0 EQU   ATCAOSM+580                                              04569000
ATCAICTN EQU   ATCAOSM+576                                              04570000
ATCZR01  EQU   ATCAOSM+572                                              04571000
ATCMPLTA EQU   ATCAOSM+568                                              04572000
ATCASCB  EQU   ATCAOSM+564                                              04573000
ATCAP86  EQU   ATCAOSM+560                                              04574000
ATCAP85  EQU   ATCAOSM+556                                              04575000
ATCAP84  EQU   ATCAOSM+552                                              04576000
ATCAP83  EQU   ATCAOSM+548                                              04577000
ATCAP82  EQU   ATCAOSM+544                                              04578000
ATCAP69  EQU   ATCAOSM+540                                              04579000
ATCAP66  EQU   ATCAOSM+536                                              04580000
ATCAP62  EQU   ATCAOSM+532                                              04581000
ATCAPC59 EQU   ATCAOSM+528                                              04582000
ATCAP56  EQU   ATCAOSM+524                                              04583000
ATCAP55  EQU   ATCAOSM+520                                              04584000
ATCRCFY0 EQU   ATCAOSM+516                                              04585000
ATCAP41  EQU   ATCAOSM+512                                              04586000
ATCAPC25 EQU   ATCAOSM+508                                              04587000
ATCAP23  EQU   ATCAOSM+504                                              04588000
ATCTPSPB EQU   ATCAOSM+472                                              04589000
ATCTRMPB EQU   ATCAOSM+440                                              04590000
ATCAPBE  EQU   ATCAOSM+436                                              04591000
ATCPSTA  EQU   ATCAOSM+432                                              04592000
ATCSMABF EQU   ATCAOSM+428                                              04593000
ATCSMAPR EQU   ATCAOSM+424                                              04594000
ATCTPWQA EQU   ATCAOSM+420                                              04595000
ATCSMAID EQU   ATCAOSM+416                                              04596000
ATCSMARA EQU   ATCAOSM+412                                              04597000
ATCCACXA EQU   ATCAOSM+408                                              04598000
ATCZLAAB EQU   ATCAOSM+404                                              04599000
ATCATA10 EQU   ATCAOSM+400                                              04600000
ATCHLTCB EQU   ATCAOSM+396                                              04601000
@NM00041 EQU   ATCVTFLG                                                 04602000
ATCVTACT EQU   ATCVTFLG                                                 04603000
ATCRPT40 EQU   ATCAOSM+388                                              04604000
ATCRPT39 EQU   ATCAOSM+384                                              04605000
ATCRPT38 EQU   ATCAOSM+380                                              04606000
ATCRPT37 EQU   ATCAOSM+376                                              04607000
ATCRPT36 EQU   ATCAOSM+372                                              04608000
ATCRPT35 EQU   ATCAOSM+368                                              04609000
ATCRPT34 EQU   ATCAOSM+364                                              04610000
ATCRPT33 EQU   ATCAOSM+360                                              04611000
ATCRPT32 EQU   ATCAOSM+356                                              04612000
ATCRPT31 EQU   ATCAOSM+352                                              04613000
ATCRPT30 EQU   ATCAOSM+348                                              04614000
ATCRPT29 EQU   ATCAOSM+344                                              04615000
ATCRPT28 EQU   ATCAOSM+340                                              04616000
ATCRPT27 EQU   ATCAOSM+336                                              04617000
ATCRPT26 EQU   ATCAOSM+332                                              04618000
ATCRPT25 EQU   ATCAOSM+328                                              04619000
ATCRPT24 EQU   ATCAOSM+324                                              04620000
ATCRPT23 EQU   ATCAOSM+320                                              04621000
ATCRPT22 EQU   ATCAOSM+316                                              04622000
ATCRPT21 EQU   ATCAOSM+312                                              04623000
ATCRPT20 EQU   ATCAOSM+308                                              04624000
ATCRPT19 EQU   ATCAOSM+304                                              04625000
ATCRPLAC EQU   ATCRPLCN+2                                               04626000
ATCRPLRC EQU   ATCRPLCN                                                 04627000
ATCCRPLQ EQU   ATCCRPL                                                  04628000
ATCSRBAC EQU   ATCSRBCN+2                                               04629000
ATCSRBRC EQU   ATCSRBCN                                                 04630000
ATCSRBQ  EQU   ATCSRB                                                   04631000
ATCCRAAC EQU   ATCCRACN+2                                               04632000
ATCCRARC EQU   ATCCRACN                                                 04633000
ATCCRAQ  EQU   ATCCRA                                                   04634000
ATCRPT12 EQU   ATCAOSM+276                                              04635000
ATCDMAPP EQU   ATCAOSM+272                                              04636000
ATCAP38  EQU   ATCAOSM+268                                              04637000
ATCAP37  EQU   ATCAOSM+264                                              04638000
ATCZDFJ0 EQU   ATCAOSM+260                                              04639000
ATCAP51  EQU   ATCAOSM+256                                              04640000
ATCZPAB2 EQU   ATCAOSM+224                                              04641000
ATCZPAB1 EQU   ATCAOSM+192                                              04642000
ATCZLFVT EQU   ATCAOSM+188                                              04643000
ATCZLPVT EQU   ATCAOSM+184                                              04644000
ATCZDVTX EQU   ATCAOSM+180                                              04645000
ATCZDVTA EQU   ATCAOSM+176                                              04646000
ATCZDVT9 EQU   ATCAOSM+172                                              04647000
ATCZDVT8 EQU   ATCAOSM+168                                              04648000
ATCZDVT7 EQU   ATCAOSM+164                                              04649000
ATCRSV56 EQU   ATCDAPVT+22                                              04650000
ATCDAPDG EQU   ATCDAPVT+20                                              04651000
ATCDXCEA EQU   ATCDAPVT+16                                              04652000
ATCDCEA  EQU   ATCDAPVT+12                                              04653000
ATCDPCIA EQU   ATCDAPVT+8                                               04654000
ATCDSIOA EQU   ATCDAPVT+4                                               04655000
ATCDEOEA EQU   ATCDAPVT                                                 04656000
ATCZLAEA EQU   ATCLDAPP+16                                              04657000
ATCZLCEA EQU   ATCLDAPP+12                                              04658000
ATCRSV17 EQU   ATCLDAPP+8                                               04659000
ATCSMFRR EQU   ATCLDAPP+4                                               04660000
ATCCDTID EQU   ATCLDAPP                                                 04661000
ATCZAEA  EQU   ATCICAPP+16                                              04662000
ATCZCEA  EQU   ATCICAPP+12                                              04663000
ATCCDTCB EQU   ATCICAPP+8                                               04664000
ATCZSIOA EQU   ATCICAPP+4                                               04665000
ATCCDRPH EQU   ATCICAPP                                                 04666000
ATCAP65  EQU   ATCAOSM+96                                               04667000
ATCZDVT6 EQU   ATCAOSM+92                                               04668000
ATCZDVT4 EQU   ATCAOSM+88                                               04669000
ATCZDVT3 EQU   ATCAOSM+84                                               04670000
ATCZDVT1 EQU   ATCAOSM+80                                               04671000
ATCICNCB EQU   ATCAOSM+76                                               04672000
ATCZPSVT EQU   ATCAOSM+72                                               04673000
ATCZFSVT EQU   ATCAOSM+68                                               04674000
ATCAP64  EQU   ATCAOSM+64                                               04675000
ATCAP63  EQU   ATCAOSM+60                                               04676000
ATCAP61  EQU   ATCAOSM+56                                               04677000
ATCAP58  EQU   ATCAOSM+52                                               04678000
ATCAP57  EQU   ATCAOSM+48                                               04679000
ATCAP54  EQU   ATCAOSM+44                                               04680000
ATCAP53  EQU   ATCAOSM+40                                               04681000
ATCAP52  EQU   ATCAOSM+36                                               04682000
ATCAP34  EQU   ATCAOSM+32                                               04683000
ATCAP32  EQU   ATCAOSM+28                                               04684000
ATCAP12  EQU   ATCAOSM+20                                               04685000
ATCAP11  EQU   ATCAOSM+16                                               04686000
ATCCMTCB EQU   ATCAOSM+12                                               04687000
ATCPRPH  EQU   ATCAOSM+8                                                04688000
ATCGSRBF EQU   ATCGSRBG                                                 04689000
ATCSRBRT EQU   ATCAOSM                                                  04690000
@NM00040 EQU   @NM00039                                                 04691000
ATCVTMAB EQU   @NM00039                                                 04692000
@NM00038 EQU   ATCVTBAM                                                 04693000
ATCVDLOK EQU   ISTATCVT+904                                             04694000
ATCVFPAB EQU   ISTATCVT+872                                             04695000
ATCVDPAB EQU   ISTATCVT+840                                             04696000
ATCIOECB EQU   ISTATCVT+836                                             04697000
ATCINCW3 EQU   ISTATCVT+832                                             04698000
ATCMODTB EQU   ISTATCVT+828                                             04699000
ATCUSSPT EQU   ISTATCVT+824                                             04700000
ATCSRTAB EQU   ISTATCVT+820                                             04701000
@NM00037 EQU   ISTATCVT+819                                             04702000
@NM00036 EQU   ATCSTAT2                                                 04703000
ATCTRSMS EQU   ATCSTAT2                                                 04704000
ATCTRLOK EQU   ATCSTAT2                                                 04705000
ATCTRPSS EQU   ATCSTAT2                                                 04706000
ATCTRESC EQU   ATCSTAT2                                                 04707000
ATCTRAPI EQU   ATCSTAT2                                                 04708000
ATCNMCTR EQU   ISTATCVT+816                                             04709000
ATCSEC51 EQU   ATCSECST                                                 04710000
ATCSEC40 EQU   ATCSIPD+8                                                04711000
ATCSEC30 EQU   ATCSIPD+4                                                04712000
ATCSEC21 EQU   ATCSIPD                                                  04713000
ATCSEC10 EQU   ATCSOPD+4                                                04714000
ATCSEC01 EQU   ATCSOPD                                                  04715000
ATCPOIA  EQU   ATCRNO+1                                                 04716000
@NM00035 EQU   ATCRNO                                                   04717000
ATCPODVT EQU   ISTATCVT+784                                             04718000
ATCS49XL EQU   ISTATCVT+780                                             04719000
ATCS49XI EQU   ISTATCVT+776                                             04720000
ATCLCLCT EQU   ATCVLCNT+2                                               04721000
ATCRNCNT EQU   ATCVLCNT                                                 04722000
ATCCFEAD EQU   ISTATCVT+768                                             04723000
ATCPTR00 EQU   ISTATCVT+736                                             04724000
ATCRSV10 EQU   ISTATCVT+704                                             04725000
ATCTACB  EQU   ISTATCVT+700                                             04726000
ATCVTINM EQU   ISTATCVT+696                                             04727000
ATCTCLIM EQU   ISTATCVT+692                                             04728000
ATCTCLOM EQU   ISTATCVT+688                                             04729000
ATCVTIPB EQU   ISTATCVT+656                                             04730000
ATCTCIPB EQU   ISTATCVT+624                                             04731000
ATCTIPAB EQU   ISTATCVT+592                                             04732000
ATCOCCCB EQU   ISTATCVT+588                                             04733000
ATCOCCOB EQU   ISTATCVT+584                                             04734000
ATCCDLAD EQU   ISTATCVT+580                                             04735000
ATCCCLAD EQU   ISTATCVT+576                                             04736000
ATCDLRPB EQU   ISTATCVT+544                                             04737000
ATCPGPAB EQU   ISTATCVT+512                                             04738000
ATCVPAB1 EQU   ISTATCVT+480                                             04739000
ATCRSV97 EQU   ISTATCVT+476                                             04740000
ATCRDTLK EQU   ISTATCVT+472                                             04741000
ATCCDFDN EQU   ISTATCVT+464                                             04742000
ATCCDFIN EQU   ISTATCVT+460                                             04743000
ATCDVTLK EQU   ISTATCVT+456                                             04744000
ATCAP36  EQU   ISTATCVT+452                                             04745000
ATCRSV99 EQU   ISTATCVT+440                                             04746000
ATCONFIG EQU   ISTATCVT+432                                             04747000
ATCNODDS EQU   ISTATCVT+428                                             04748000
ATCNODEL EQU   ISTATCVT+420                                             04749000
ATCRSV69 EQU   ISTATCVT+416                                             04750000
ATCAPCR5 EQU   ISTATCVT+412                                             04751000
ATCLDECB EQU   ISTATCVT+408                                             04752000
ATCLDNCS EQU   ISTATCVT+404                                             04753000
ATCCDPTR EQU   ISTATCVT+400                                             04754000
ATCADEL  EQU   ISTATCVT+396                                             04755000
ATCTODVT EQU   ISTATCVT+392                                             04756000
ATCDEBCH EQU   ISTATCVT+388                                             04757000
ATCHBSIZ EQU   ATCHPGM+2                                                04758000
ATCHBFNO EQU   ATCHPGM                                                  04759000
ATCCRME  EQU   ISTATCVT+380                                             04760000
ATCRVCHS EQU   ISTATCVT+372                                             04761000
ATCECTLP EQU   ISTATCVT+368                                             04762000
ATCZDVTB EQU   ISTATCVT+364                                             04763000
ATCECPRT EQU   ISTATCVT+360                                             04764000
ATCVTLOD EQU   ISTATCVT+356                                             04765000
ATCTRPAB EQU   ISTATCVT+352                                             04766000
ATCMSGM  EQU   ISTATCVT+348                                             04767000
ATCEPT   EQU   ISTATCVT+340                                             04768000
ATCDVT   EQU   ISTATCVT+336                                             04769000
ATCTRCPT EQU   ISTATCVT+332                                             04770000
ATCDVLOD EQU   ISTATCVT+328                                             04771000
ATCALERT EQU   ISTATCVT+324                                             04772000
ATCEPA   EQU   ISTATCVT+320                                             04773000
ATCSAF   EQU   ISTATCVT+318                                             04774000
ATCXRANG EQU   ISTATCVT+317                                             04775000
ATCLAST  EQU   ATCSHRFG                                                 04776000
ATCSHRTN EQU   ISTATCVT+308                                             04777000
ATCUEP   EQU   ISTATCVT+304                                             04778000
ATCOCRT  EQU   ISTATCVT+300                                             04779000
ATCCSMA  EQU   ATCCSMR                                                  04780000
ATCESC02 EQU   ISTATCVT+292                                             04781000
ATCESC01 EQU   ISTATCVT+288                                             04782000
ATCCDFND EQU   ISTATCVT+284                                             04783000
ATCCDDEL EQU   ISTATCVT+280                                             04784000
ATCCDADD EQU   ISTATCVT+276                                             04785000
ATCMNT   EQU   ISTATCVT+272                                             04786000
ATCRSV16 EQU   ISTATCVT+270                                             04787000
ATCMAXID EQU   ISTATCVT+269                                             04788000
ATCMSGSP EQU   ATCCOM+268                                               04789000
ATCCIDM  EQU   ATCCOM+266                                               04790000
ATCACTRM EQU   ATCCOM+264                                               04791000
ATCNERAP EQU   ATCCOM+260                                               04792000
ATCNESAL EQU   ATCCOM+256                                               04793000
ATCRCC65 EQU   ATCCOM+252                                               04794000
ATCRCC26 EQU   ATCCOM+248                                               04795000
ATCRCC63 EQU   ATCCOM+244                                               04796000
ATCRSV11 EQU   ATCCOM+242                                               04797000
ATCVTMID EQU   ATCCOM+240                                               04798000
ATCAPOST EQU   ATCCOM+236                                               04799000
ATCNERFN EQU   ATCCOM+232                                               04800000
ATCNERNE EQU   ATCCOM+228                                               04801000
ATCNERCV EQU   ATCCOM+224                                               04802000
ATCNERST EQU   ATCCOM+220                                               04803000
ATCDCC61 EQU   ATCCOM+216                                               04804000
ATCDCC60 EQU   ATCCOM+212                                               04805000
ATCSRTAD EQU   ATCCOM+204                                               04806000
ATCFIRA  EQU   ATCCOM+200                                               04807000
ATCSMBQ  EQU   ATCCOM+196                                               04808000
ATCSMRC  EQU   ATCCOM+192                                               04809000
ATCSMRS  EQU   ATCCOM+188                                               04810000
ATCSMQU  EQU   ATCCOM+184                                               04811000
ATCSMRQ  EQU   ATCCOM+180                                               04812000
ATCACDA  EQU   ATCCOM+176                                               04813000
ATCSTMA  EQU   ATCCOM+172                                               04814000
ATCFRSTR EQU   ATCCOM+168                                               04815000
ATCGTSTR EQU   ATCCOM+164                                               04816000
ATCREADA EQU   ATCCOM+160                                               04817000
ATCALOAD EQU   ATCCOM+156                                               04818000
ATCBLDLA EQU   ATCCOM+152                                               04819000
ATCFBRPH EQU   ATCCOM+148                                               04820000
ATCBFTRC EQU   ATCCOM+144                                               04821000
ATCTPBUF EQU   ATCTHTRC                                                 04822000
ATCREMOV EQU   ATCCOM+136                                               04823000
ATCADD   EQU   ATCCOM+132                                               04824000
ATCBPDA  EQU   ATCCOM+128                                               04825000
ATCDVTPT EQU   ATCCOM+124                                               04826000
ATCFEPT  EQU   ATCCOM+120                                               04827000
ATCFDVT  EQU   ATCCOM+116                                               04828000
ATCCONFT EQU   ATCCOM+112                                               04829000
ATCPTCHA EQU   ATCCOM+108                                               04830000
ATCAUTHA EQU   ATCCOM+104                                               04831000
ATCACCTA EQU   ATCCOM+100                                               04832000
ATCRDTH  EQU   ATCCOM+96                                                04833000
ATCFRSCH EQU   ATCCOM+92                                                04834000
ATCFSB   EQU   ATCCOM+88                                                04835000
ATCHLTMS EQU   ATCCOM+84                                                04836000
ATCECPRM EQU   ATCCOM+80                                                04837000
ATCECNET EQU   ATCCOM+76                                                04838000
ATCECOPC EQU   ATCCOM+72                                                04839000
ATCVPARM EQU   ATCCOM+68                                                04840000
ATCECVRQ EQU   ATCCOM+64                                                04841000
ATCECSES EQU   ATCCOM+60                                                04842000
ATCOCHA  EQU   ATCCOM+56                                                04843000
ATCDSPLQ EQU   ATCCOM+52                                                04844000
ATCECDSP EQU   ATCCOM+48                                                04845000
ATCVARYQ EQU   ATCCOM+44                                                04846000
ATCECVRY EQU   ATCCOM+40                                                04847000
ATCHALTQ EQU   ATCCOM+36                                                04848000
ATCECHLT EQU   ATCCOM+32                                                04849000
ATCMODQ  EQU   ATCCOM+28                                                04850000
ATCECMOD EQU   ATCCOM+24                                                04851000
ATCASCHD EQU   ATCCOM+20                                                04852000
ATCSRT   EQU   ATCCOM+16                                                04853000
ATCRDT   EQU   ATCCOM+12                                                04854000
ATCDCFRR EQU   ATCCOM+8                                                 04855000
ATCAPI   EQU   ATCCOM+4                                                 04856000
ATCRSV04 EQU   ATCSTAT4                                                 04857000
ATCVTTRC EQU   ATCSTAT4                                                 04858000
ATCNCSD  EQU   ATCSTAT4                                                 04859000
ATCMTST  EQU   ATCSTAT4                                                 04860000
ATCTPRT  EQU   ATCSTAT4                                                 04861000
ATCPRTAT EQU   ATCSTAT4                                                 04862000
@NM00034 EQU   ATCPOFLG                                                 04863000
ATCPOUNS EQU   ATCPOFLG                                                 04864000
ATCHSDMF EQU   ATCSTFLG                                                 04865000
@NM00033 EQU   ATCSTAT1                                                 04866000
ATCMDHLT EQU   ATCSTAT1                                                 04867000
ATCINHLT EQU   ATCSTAT1                                                 04868000
ATCNETSL EQU   ATCSTAT1                                                 04869000
ATCQKHLT EQU   ATCSTAT1                                                 04870000
ATCSNHLT EQU   ATCSTAT1                                                 04871000
ATCACTIV EQU   ATCSTAT1                                                 04872000
ATCSTART EQU   ATCSTAT1                                                 04873000
DYPPAB   EQU   ISTDYPAB+16                                              04874000
DYPRSV01 EQU   ISTDYPAB+12                                              04875000
DYPTSKID EQU   ISTDYPAB+8                                               04876000
DYPCHAIN EQU   ISTDYPAB+4                                               04877000
DYPFLGS  EQU   ISTDYPAB+2                                               04878000
DYPLNGTH EQU   ISTDYPAB+1                                               04879000
DYPTYPE  EQU   ISTDYPAB                                                 04880000
PABRPHA  EQU   PABRPHFG+1                                               04881000
PABNODQ  EQU   PABFLAGS                                                 04882000
PABINHBT EQU   PABFLAGS                                                 04883000
PABERLOK EQU   PABERRLK                                                 04884000
PABSSN   EQU   PABFLAGS                                                 04885000
PABDYNAM EQU   PABFLAGS                                                 04886000
PABNORPR EQU   PABFLAGS                                                 04887000
PABPRIOR EQU   PABFLAGS                                                 04888000
PABAPYP  EQU   PABFLAGS                                                 04889000
PABDVTA  EQU   ISTPAB+9                                                 04890000
PABOFFST EQU   ISTPAB+8                                                 04891000
PABCHNGP EQU   PABCHAIN+1                                               04892000
PABRSV02 EQU   PABCHAIN                                                 04893000
PABDELAY EQU   PABCHAIN                                                 04894000
PABRUNNG EQU   PABCHAIN                                                 04895000
PABRESET EQU   PABCHAIN                                                 04896000
PABUNCON EQU   PABCHAIN                                                 04897000
PABCDP   EQU   PABCHAIN                                                 04898000
PABRESCH EQU   PABCHAIN                                                 04899000
PABCHNG  EQU   PABCHAIN                                                 04900000
PABWEQP  EQU   PABWEQA+1                                                04901000
PABRSV01 EQU   PABWEQA                                                  04902000
PABWEQG  EQU   PABWEQA                                                  04903000
PATRSV01 EQU   PATFLAGA                                                 04904000
PATUSEFG EQU   PATFLAGA                                                 04905000
PATRDCNT EQU   ISTPAT+6                                                 04906000
PATGRPID EQU   ISTPAT+5                                                 04907000
PATPTHID EQU   ISTPAT+4                                                 04908000
PATDINDX EQU   ISTPAT+2                                                 04909000
PATGINDX EQU   ISTPAT                                                   04910000
GNTGRPNM EQU   ISTGNT                                                   04911000
DNTTELNO EQU   ISTDNT+1                                                 04912000
DNTCTDIG EQU   ISTDNT                                                   04913000
RLSRSV02 EQU   ISTRLS+140                                               04914000
RLSRSV01 EQU   ISTRLS+138                                               04915000
RLSCTELU EQU   ISTRLS+136                                               04916000
RLSPRE   EQU   ISTRLS                                                   04917000
RDARSVPT EQU   ISTRDA+84                                                04918000
RDAPUBI  EQU   ISTRDA+83                                                04919000
RDADFCUA EQU   ISTRDA+80                                                04920000
RDACTPCC EQU   ISTRDA+79                                                04921000
RDADACUA EQU   ISTRDA+76                                                04922000
RDALUBA  EQU   RDAUCBAD+1                                               04923000
RDACHQI  EQU   RDAUCBAD                                                 04924000
RDARSV01 EQU   RDAFLAG                                                  04925000
RDARBISA EQU   RDAFLAG                                                  04926000
RDAPRE   EQU   ISTRDA                                                   04927000
RSWRSV01 EQU   ISTRSW+152                                               04928000
RSWRSV02 EQU   ISTRSW+150                                               04929000
RSWCTELU EQU   ISTRSW+148                                               04930000
RSWGRUPZ EQU   ISTRSW+146                                               04931000
RSWDIALZ EQU   ISTRSW+144                                               04932000
RSWGRUPT EQU   ISTRSW+140                                               04933000
RSWDIALT EQU   ISTRSW+136                                               04934000
RSWPRE   EQU   ISTRSW                                                   04935000
RLXRSV03 EQU   ISTRLX+80                                                04936000
RLXRSV02 EQU   ISTRLX+77                                                04937000
RLXRSV01 EQU   RLXFLAGA                                                 04938000
RLXINUSE EQU   RLXFLAGA                                                 04939000
RLXNLUX  EQU   ISTRLX+72                                                04940000
RLXPRE   EQU   ISTRLX                                                   04941000
RPXRSV01 EQU   ISTRPX+80                                                04942000
RPXRSV02 EQU   ISTRPX+77                                                04943000
RPXMAXLU EQU   ISTRPX+76                                                04944000
RPXFLUX  EQU   ISTRPX+72                                                04945000
RPXPRE   EQU   ISTRPX                                                   04946000
RLURSV02 EQU   ISTRLU+172                                               04947000
RLULGMOD EQU   ISTRLU+164                                               04948000
RLUMODEP EQU   RLUMODET+8                                               04949000
RLUMODEN EQU   RLUMODET                                                 04950000
RLUUSSPT EQU   RLUUSSTB+8                                               04951000
RLUUSSNM EQU   RLUUSSTB                                                 04952000
RLURSV01 EQU   ISTRLU+137                                               04953000
RLULOCAD EQU   ISTRLU+136                                               04954000
RLUNCPPM EQU   RLUNCPPC+1                                               04955000
RLUNCPPN EQU   RLUNCPPC                                                 04956000
RLUPACEM EQU   RLUPACE+1                                                04957000
RLUPACEN EQU   RLUPACE                                                  04958000
RLUINTA  EQU   ISTRLU+128                                               04959000
RLUSSCFM EQU   ISTRLU+127                                               04960000
RLUCRRSV EQU   RLUCRFLG                                                 04961000
RLUACTLU EQU   RLUCRFLG                                                 04962000
RLURSV00 EQU   RLUFLAG                                                  04963000
RLUNDSES EQU   RLUFLAG                                                  04964000
RLUGSTAT EQU   RLUFLAG                                                  04965000
RLUBATCH EQU   RLUFLAG                                                  04966000
RLURBISA EQU   RLUFLAG                                                  04967000
RLUTYPE  EQU   ISTRLU+124                                               04968000
RLUCRPR  EQU   ISTRLU                                                   04969000
RCCRVPT2 EQU   ISTRCC+144                                               04970000
RCCXTOSW EQU   ISTRCC+140                                               04971000
RCCSWTOX EQU   ISTRCC+136                                               04972000
RCCRSPT2 EQU   ISTRCC+133                                               04973000
RCCADDR  EQU   ISTRCC+132                                               04974000
RCCPASSL EQU   ISTRCC+131                                               04975000
RCCMXOUT EQU   ISTRCC+130                                               04976000
RCCMXDAT EQU   ISTRCC+128                                               04977000
RCCINDEX EQU   ISTRCC+126                                               04978000
RCCPATHZ EQU   ISTRCC+124                                               04979000
RCCPATHT EQU   ISTRCC+120                                               04980000
RCCDPQ   EQU   ISTRCC+116                                               04981000
RCCTPAB  EQU   ISTRCC+112                                               04982000
RCCRSV02 EQU   ISTRCC+109                                               04983000
RCCCRRSV EQU   RCCCRFLG                                                 04984000
RCCCTCFL EQU   RCCCRFLG                                                 04985000
RCCACTPU EQU   RCCCRFLG                                                 04986000
RCCNCSPL EQU   ISTRCC+104                                               04987000
RCCRPHCN EQU   ISTRCC+100                                               04988000
RCCEPAB  EQU   ISTRCC+96                                                04989000
RCCDPAB  EQU   ISTRCC+92                                                04990000
RCCVPAB  EQU   ISTRCC+88                                                04991000
@NM00032 EQU   ISTRCC+87                                                04992000
RCCSESCT EQU   ISTRCC+86                                                04993000
RCCIDNUM EQU   RCCID48+3                                                04994000
RCCIDBLK EQU   RCCID48+2                                                04995000
RCCIDPA2 EQU   RCCID48+1                                                04996000
RCCIDPUT EQU   RCCID48                                                  04997000
RCCIDPA1 EQU   RCCSTAID                                                 04998000
RCCCTELU EQU   ISTRCC+76                                                04999000
RCCCNCNT EQU   ISTRCC+75                                                05000000
RCCRTGOH EQU   RCCFLAGB                                                 05001000
RCCBRKCN EQU   RCCFLAGB                                                 05002000
RCCRESET EQU   RCCFLAGB                                                 05003000
RCCFINAL EQU   RCCFLAGB                                                 05004000
RCCBNNSP EQU   RCCFLAGB                                                 05005000
RCCIRETR EQU   RCCFLAGB                                                 05006000
RCCDIALP EQU   RCCFLAGB                                                 05007000
RCCDSTCT EQU   RCCFLAGB                                                 05008000
RCCCTPGD EQU   RCCFLAG                                                  05009000
RCCPRGDN EQU   RCCFLAG                                                  05010000
RCCOUERP EQU   RCCFLAG                                                  05011000
RCCOHIMM EQU   RCCFLAG                                                  05012000
RCCLDISC EQU   RCCFLAG                                                  05013000
RCCERPIP EQU   RCCFLAG                                                  05014000
RCCCUDIE EQU   RCCFLAG                                                  05015000
RCCRBISA EQU   RCCFLAG                                                  05016000
RCCTYPE  EQU   ISTRCC+72                                                05017000
RCCPRE   EQU   ISTRCC                                                   05018000
DOTADTRM EQU   ISTDOT                                                   05019000
RDSADDOT EQU   ISTRDS+76                                                05020000
RDSCTATR EQU   ISTRDS+74                                                05021000
RDSCTTRM EQU   ISTRDS+72                                                05022000
RDSPRE   EQU   ISTRDS                                                   05023000
RINRSV05 EQU   ISTRIN+156                                               05024000
RINRSV04 EQU   ISTRIN+152                                               05025000
RINRSV02 EQU   ISTRIN+145                                               05026000
RTRCNCNT EQU   RINCNCNT                                                 05027000
RTRNCSPL EQU   RINNCSPL                                                 05028000
RTRRPHCN EQU   RINRPHCN                                                 05029000
RTRVPAB  EQU   RINVPAB                                                  05030000
RTRREMOT EQU   RINREMOT                                                 05031000
RTRRLDAF EQU   RINRLDAF                                                 05032000
RTRNODID EQU   RINNODID                                                 05033000
RINRSV01 EQU   RINDFD                                                   05034000
RTRLDISC EQU   RINLDISC                                                 05035000
RTRNODEF EQU   RINNODEF                                                 05036000
RTRREMPO EQU   RINREMPO                                                 05037000
RINCRPRE EQU   ISTRIN                                                   05038000
RTRRSV04 EQU   ISTRTR+210                                               05039000
RTRLCTI  EQU   ISTRTR+209                                               05040000
RTRIDCAS EQU   RTRBSCID+1                                               05041000
RTRIDLEN EQU   RTRBSCID                                                 05042000
RTRRSVDD EQU   ISTRTR+181                                               05043000
RTRRDFG  EQU   ISTRTR+180                                               05044000
RTRDIAA  EQU   ISTRTR+176                                               05045000
RTRPOLA  EQU   ISTRTR+172                                               05046000
RTRCADDR EQU   ISTRTR+164                                               05047000
RTRCTADR EQU   ISTRTR+162                                               05048000
RTRCTPOL EQU   ISTRTR+160                                               05049000
RTRCTDIA EQU   ISTRTR+158                                               05050000
RTRRSV03 EQU   ISTRTR+156                                               05051000
RTRRVPT1 EQU   ISTRTR+152                                               05052000
RTRBHSN1 EQU   ISTRTR+144                                               05053000
RTRCRSV2 EQU   RTRCRFLG                                                 05054000
RTRDTRLM EQU   RTRLSCMD                                                 05055000
RTRCRSV1 EQU   RTRCRFLG                                                 05056000
RTRTRMAX EQU   ISTRTR+142                                               05057000
RTRRSV24 EQU   RTRRDFF                                                  05058000
RTRRFDEK EQU   RTRRDFF                                                  05059000
RTRRFANK EQU   RTRRDFF                                                  05060000
RTRRFPFK EQU   RTRRDFF                                                  05061000
RTRRFPEN EQU   RTRRDFF                                                  05062000
RTRRFXCT EQU   RTRRDFF                                                  05063000
RTRRESCT EQU   RTRRDFE                                                  05064000
RTRRESUP EQU   RTRRDFE                                                  05065000
RTRREATT EQU   RTRRDFE                                                  05066000
RTRRECHK EQU   RTRRDFE                                                  05067000
RTRREACR EQU   RTRRDFE                                                  05068000
RTRRSV0A EQU   RTRRDFE                                                  05069000
RTRREBRK EQU   RTRRDFE                                                  05070000
RTRRSV11 EQU   RTRRDFD                                                  05071000
RTRRSV10 EQU   RTRRDFD                                                  05072000
RTRRDBHI EQU   RTRRDFD                                                  05073000
RTRRDBHD EQU   RTRRDFD                                                  05074000
RTRRDBHN EQU   RTRRDFD                                                  05075000
RTRRSV23 EQU   RTRRDFC                                                  05076000
RTRRCXMS EQU   RTRRDFC                                                  05077000
RTRRCMSG EQU   RTRRDFC                                                  05078000
RTRRCBLK EQU   RTRRDFC                                                  05079000
RTRRCPT3 EQU   RTRRDFC                                                  05080000
RTRRCIT2 EQU   RTRRDFC                                                  05081000
RTRRCIT1 EQU   RTRRDFC                                                  05082000
RTRRSV32 EQU   RTRRDFB                                                  05083000
RTRRBEND EQU   RTRRDFB                                                  05084000
RTRRBECT EQU   RTRRDFB                                                  05085000
RTRRSV02 EQU   RTRRDFA                                                  05086000
RTRRACTR EQU   RTRRDFA                                                  05087000
RTRRSV60 EQU   RTRRDFA                                                  05088000
RTRRACDT EQU   RTRRDFA                                                  05089000
RTRRAPT3 EQU   RTRRAALL                                                 05090000
RTRRAPT2 EQU   RTRRAALL                                                 05091000
RTRRAPT1 EQU   RTRRAALL                                                 05092000
RTRRAATN EQU   RTRRDFA                                                  05093000
RTRRSV45 EQU   ISTRTR+132                                               05094000
RTRRSV01 EQU   ISTRTR+130                                               05095000
RTRCTECM EQU   ISTRTR+128                                               05096000
RTRADRPT EQU   RTRADR+1                                                 05097000
RTRRSV22 EQU   RTRFLAG                                                  05098000
RTRVTERM EQU   RTRFLAG                                                  05099000
RTRRSV51 EQU   RTRFLAG                                                  05100000
RTRRBISA EQU   RTRFLAG                                                  05101000
RTRRSV21 EQU   RTRFLAG                                                  05102000
RTRCRPR  EQU   ISTRTR                                                   05103000
RCLRVPT2 EQU   ISTRCL+92                                                05104000
RCLRVPT1 EQU   ISTRCL+88                                                05105000
RCLGPOLA EQU   ISTRCL+84                                                05106000
RCLCTNGP EQU   ISTRCL+82                                                05107000
RCLRSV01 EQU   ISTRCL+80                                                05108000
RCLCTECM EQU   ISTRCL+78                                                05109000
RCLCTETR EQU   ISTRCL+76                                                05110000
RCLGPADR EQU   RCLADR+1                                                 05111000
RCLRSV33 EQU   RCLFLAG                                                  05112000
RCLBATCH EQU   RCLFLAG                                                  05113000
RCLRBISA EQU   RCLFLAG                                                  05114000
RCLRSV22 EQU   RCLFLAG                                                  05115000
RCLPRE   EQU   ISTRCL                                                   05116000
RPTRSV03 EQU   ISTRPT+156                                               05117000
RPTRSV02 EQU   ISTRPT+152                                               05118000
RPTNSNSV EQU   ISTRPT+148                                               05119000
RPTPTHCT EQU   ISTRPT+146                                               05120000
RPTPEPCT EQU   ISTRPT+144                                               05121000
RPTDAFSV EQU   ISTRPT+142                                               05122000
RPTRSV01 EQU   ISTRPT+141                                               05123000
RPTISTAT EQU   RPTFLAG1                                                 05124000
RPTDYNAM EQU   RPTFLAG1                                                 05125000
RPTVYIMM EQU   RPTFLAG1                                                 05126000
RPTVIODN EQU   RPTFLAG1                                                 05127000
RPTONLIN EQU   RPTFLAG1                                                 05128000
RPTHLVPD EQU   RPTFLAG1                                                 05129000
RPTVRYPD EQU   RPTFLAG1                                                 05130000
RPTASLEP EQU   RPTFLAG1                                                 05131000
RPTUTERM EQU   ISTRPT+136                                               05132000
RPTATERM EQU   ISTRPT+132                                               05133000
RPTDIVT  EQU   RPTDITT                                                  05134000
RPTCTNM  EQU   ISTRPT+120                                               05135000
RPTLNDAF EQU   RPTLNCID+2                                               05136000
RPTLNSAF EQU   RPTLNCID                                                 05137000
RPTLN    EQU   ISTRPT                                                   05138000
RLNRVPT2 EQU   ISTRLN+112                                               05139000
RLNNCSPL EQU   ISTRLN+108                                               05140000
RLNX2SW  EQU   ISTRLN+104                                               05141000
@NM00031 EQU   ISTRLN+103                                               05142000
RLNCRRSV EQU   RLNCRFLG                                                 05143000
RLNSWEP  EQU   RLNCRFLG                                                 05144000
RLNSVSKP EQU   RLNLSCMD                                                 05145000
RLNSESLM EQU   RLNLSCMD                                                 05146000
RLNNPRLM EQU   RLNLSCMD                                                 05147000
RLNSWNCP EQU   RLNCRFLG                                                 05148000
RLNACTLN EQU   RLNCRFLG                                                 05149000
RLNPAUSE EQU   ISTRLN+101                                               05150000
RLNPOLMT EQU   ISTRLN+100                                               05151000
RLNACTSN EQU   ISTRLN+98                                                05152000
RLNRESV1 EQU   ISTRLN+97                                                05153000
RLNACTRM EQU   ISTRLN+96                                                05154000
RLNCTSES EQU   ISTRLN+95                                                05155000
RLNRDSLM EQU   ISTRLN+94                                                05156000
RLNAUTOA EQU   ISTRLN+92                                                05157000
RLNRDFD  EQU   RLNRDF+3                                                 05158000
RLNRDFC  EQU   RLNRDF+2                                                 05159000
RLNMULTP EQU   RLNRDFB                                                  05160000
RLNRATRN EQU   RLNRDFB                                                  05161000
RLNRAPOL EQU   RLNRDFB                                                  05162000
RLNTTV   EQU   RLNRDFB                                                  05163000
RLNRSV0B EQU   RLNRDFB                                                  05164000
RLNAUTOD EQU   RLNRDFB                                                  05165000
RLNANSWR EQU   RLNRDFB                                                  05166000
RLNRBUSE EQU   RLNRDFB                                                  05167000
RLNRAPEP EQU   RLNRDFA                                                  05168000
RLNRANCP EQU   RLNRDFA                                                  05169000
RLNRAEP  EQU   RLNRDFA                                                  05170000
RLNIDV   EQU   RLNRDFA                                                  05171000
RLNPORT  EQU   RLNRDFA                                                  05172000
RLNGANSW EQU   RLNRDFA                                                  05173000
RLNRACAN EQU   RLNRACNT                                                 05174000
RLNRACAT EQU   RLNRACNT                                                 05175000
RLNRSV04 EQU   RLNSTAT2                                                 05176000
RLNINUSE EQU   RLNSTAT2                                                 05177000
RLNOHIN  EQU   RLNSTAT2                                                 05178000
RLNRSV03 EQU   RLNSTAT1                                                 05179000
RLNVD    EQU   RLNSTAT1                                                 05180000
RLNINOPP EQU   RLNSTAT1                                                 05181000
RLNINOPL EQU   RLNSTAT1                                                 05182000
RLNLRST  EQU   RLNSTAT1                                                 05183000
RLNTRAP  EQU   RLNSTAT1                                                 05184000
RLNACTCT EQU   ISTRLN+84                                                05185000
RLNCTECM EQU   ISTRLN+82                                                05186000
RLNCTEIN EQU   ISTRLN+80                                                05187000
RLNCTETR EQU   ISTRLN+78                                                05188000
RLNCTECL EQU   ISTRLN+76                                                05189000
RLNCUA   EQU   RLNUCBAD                                                 05190000
RLNRSV01 EQU   RLNFLAG                                                  05191000
RLNRBISA EQU   RLNFLAG                                                  05192000
RLNEAM   EQU   RLNFLAG                                                  05193000
RLNPRE   EQU   ISTRLN                                                   05194000
RGPRVPT2 EQU   ISTRGP+88                                                05195000
RGPRVPT1 EQU   ISTRGP+84                                                05196000
RGPCTECM EQU   ISTRGP+82                                                05197000
RGPCTEIN EQU   ISTRGP+80                                                05198000
RGPCTETR EQU   ISTRGP+78                                                05199000
RGPCTECL EQU   ISTRGP+76                                                05200000
RGPCTELN EQU   ISTRGP+74                                                05201000
RGPRSV03 EQU   ISTRGP+73                                                05202000
RGPRSV02 EQU   RGPFLG                                                   05203000
RGPASDLC EQU   RGPFLG                                                   05204000
RGPABSC  EQU   RGPFLG                                                   05205000
RGPASS   EQU   RGPFLG                                                   05206000
RGPADIL  EQU   RGPFLG                                                   05207000
RGPPRE   EQU   ISTRGP                                                   05208000
@NM00030 EQU   ISTRRN+247                                               05209000
RRNLASTE EQU   ISTRRN+240                                               05210000
RRNNCSPL EQU   ISTRRN+236                                               05211000
RRNMSIZE EQU   ISTRRN+228                                               05212000
RRNNCPNM EQU   ISTRRN+221                                               05213000
RRNCTPCC EQU   ISTRRN+220                                               05214000
RRNHBUFS EQU   ISTRRN+218                                               05215000
RRNHLENT EQU   RRNHPRE+1                                                05216000
RRNHLENH EQU   RRNHPRE                                                  05217000
RRNNMNCP EQU   ISTRRN+208                                               05218000
RRNDELAY EQU   ISTRRN+206                                               05219000
RRNRSV04 EQU   ISTRRN+200                                               05220000
RRNRSV88 EQU   RRNNMDPD+7                                               05221000
RRNPUBI  EQU   RRNNMDPD+6                                               05222000
RRNDPLUB EQU   RRNNMDPD                                                 05223000
RRNEPADR EQU   ISTRRN+190                                               05224000
RRNCPLUB EQU   ISTRRN+184                                               05225000
RRNFLUX  EQU   ISTRRN+180                                               05226000
RRNRSV05 EQU   RRNCMFD                                                  05227000
RRNREMPO EQU   RRNCMFD                                                  05228000
RRNCDREC EQU   RRNCMFD                                                  05229000
RRNCDDSI EQU   RRNCMFD                                                  05230000
RRNCDBCK EQU   RRNCMFD                                                  05231000
RRNCDDTL EQU   RRNCMFD                                                  05232000
RRNCDSTD EQU   RRNCMFD                                                  05233000
RRNCDCSP EQU   RRNCMFD                                                  05234000
RRNCCCSL EQU   RRNCMFC                                                  05235000
RRNCCSIM EQU   RRNCMFC                                                  05236000
RRNCCRCM EQU   RRNCMFC                                                  05237000
RRNCCRIM EQU   RRNCMFC                                                  05238000
RRNCCCRC EQU   RRNCMFC                                                  05239000
RRNCCRST EQU   RRNCMFC                                                  05240000
RRNCCRDQ EQU   RRNCMFC                                                  05241000
RRNCCRCN EQU   RRNCMFC                                                  05242000
RRNCBALT EQU   RRNCMFB                                                  05243000
RRNCBMOD EQU   RRNCMFB                                                  05244000
RRNCBNPL EQU   RRNCMFB                                                  05245000
RRNCBRLS EQU   RRNCMFB                                                  05246000
RRNCBRDS EQU   RRNCMFB                                                  05247000
RRNCBDLR EQU   RRNCMFB                                                  05248000
RRNCBDLH EQU   RRNCMFB                                                  05249000
RRNCBDLO EQU   RRNCMFB                                                  05250000
RRNCADGO EQU   RRNCMFA                                                  05251000
RRNCADTD EQU   RRNCMFA                                                  05252000
RRNCACDT EQU   RRNCMFA                                                  05253000
RRNCAMBH EQU   RRNCMFA                                                  05254000
RRNCAATI EQU   RRNCMFA                                                  05255000
RRNCAATG EQU   RRNCMFA                                                  05256000
RRNCAATD EQU   RRNCMFA                                                  05257000
RRNCAALL EQU   RRNCMFA                                                  05258000
RRNRSV55 EQU   RRNRDF+3                                                 05259000
RRNPTASL EQU   RRNRDFB+1                                                05260000
RRNRSV01 EQU   RRNRDFB+1                                                05261000
RRNVYDON EQU   RRNRDFB+1                                                05262000
RRNRBBUP EQU   RRNRDFB+1                                                05263000
RRNRSV03 EQU   RRNRDFB                                                  05264000
RRNRBCT2 EQU   RRNRDFB                                                  05265000
RRNRBCT1 EQU   RRNRDFB                                                  05266000
RRNRBSEC EQU   RRNRDFB                                                  05267000
RRNRBCCT EQU   RRNRDFB                                                  05268000
RRNRBCCL EQU   RRNRDFB                                                  05269000
RRNRSV02 EQU   RRNRDFB                                                  05270000
RRNRBMDL EQU   RRNRDFB                                                  05271000
RRNRAPEP EQU   RRNRDFA                                                  05272000
RRNRANCP EQU   RRNRDFA                                                  05273000
RRNRAOLT EQU   RRNRDFA                                                  05274000
RRNRASYN EQU   RRNRDFA                                                  05275000
RRNRADMP EQU   RRNRDFA                                                  05276000
RRNRAIPL EQU   RRNRDFA                                                  05277000
RRNRASHT EQU   RRNRDFA                                                  05278000
RRNCTENT EQU   ISTRRN+170                                               05279000
RRNCTECM EQU   ISTRRN+168                                               05280000
RRNCTEIN EQU   ISTRRN+166                                               05281000
RRNCTETR EQU   ISTRRN+164                                               05282000
RRNCTECL EQU   ISTRRN+162                                               05283000
RRNCTELI EQU   ISTRRN+160                                               05284000
RRNCTEGP EQU   ISTRRN+158                                               05285000
RRNCTBHS EQU   ISTRRN+156                                               05286000
RRNBHSET EQU   ISTRRN+152                                               05287000
RRNRLDIP EQU   ISTRRN+147                                               05288000
RRNGRPA  EQU   ISTRRN+140                                               05289000
RRNLUBA  EQU   RRNUCBAD+1                                               05290000
RRNCHQI  EQU   RRNUCBAD                                                 05291000
RRNRSV11 EQU   RRNFLAG                                                  05292000
RRNDSTCT EQU   RRNFLAG                                                  05293000
RRNERPIP EQU   RRNFLAG                                                  05294000
RRNLCDIP EQU   RRNFLAG                                                  05295000
RRNRBISA EQU   RRNFLAG                                                  05296000
RRNRSV89 EQU   RRNFLAG                                                  05297000
RRNPRE   EQU   ISTRRN                                                   05298000
RLCRVPT2 EQU   ISTRLC+80                                                05299000
RLCRVPT1 EQU   ISTRLC+79                                                05300000
RLCLCCUA EQU   ISTRLC+76                                                05301000
RLCUCBAD EQU   RLCADR+1                                                 05302000
RLCRSVDE EQU   RLCFLAG                                                  05303000
RLCACNT  EQU   RLCFLAG                                                  05304000
RLCRSV14 EQU   RLCFLAG                                                  05305000
RLCRBISA EQU   RLCFLAG                                                  05306000
RLCRSV22 EQU   RLCFLAG                                                  05307000
RLCPRE   EQU   ISTRLC                                                   05308000
RAPRVPT2 EQU   ISTRAP+116                                               05309000
RAPRVPT1 EQU   ISTRAP+112                                               05310000
RAPBFACT EQU   ISTRAP+111                                               05311000
RAPRSV17 EQU   RAPFLGC                                                  05312000
RAPRSV16 EQU   RAPFLGC                                                  05313000
RAPRSV15 EQU   RAPFLGC                                                  05314000
RAPRSV14 EQU   RAPFLGC                                                  05315000
RAPRSV13 EQU   RAPFLGC                                                  05316000
RAPRSV12 EQU   RAPFLGC                                                  05317000
RAPRSV11 EQU   RAPFLGC                                                  05318000
RAPRSV10 EQU   RAPFLGC                                                  05319000
RAPANVPC EQU   RAPFLGB                                                  05320000
RAPASPO  EQU   RAPFLGB                                                  05321000
RAPAPPO  EQU   RAPFLGB                                                  05322000
RAPAACQ  EQU   RAPFLGB                                                  05323000
RAPAPRMT EQU   RAPFLGB                                                  05324000
RAPAPASS EQU   RAPFLGB                                                  05325000
RAPABLCK EQU   RAPFLGB                                                  05326000
RAPALLF  EQU   RAPFLGB                                                  05327000
RAPRSV06 EQU   RAPFLG                                                   05328000
RAPRSV05 EQU   RAPFLG                                                   05329000
RAPRSV04 EQU   RAPFLG                                                   05330000
RAPRSV03 EQU   RAPFLG                                                   05331000
RAPATLGN EQU   RAPFLG                                                   05332000
RAPASLGI EQU   RAPFLG                                                   05333000
RAPAQUI  EQU   RAPFLG                                                   05334000
RAPABLGN EQU   RAPFLG                                                   05335000
RAPACEQD EQU   ISTRAP+106                                               05336000
RAPTRPRE EQU   ISTRAP+104                                               05337000
RAPACEAP EQU   ISTRAP+100                                               05338000
RAPICEAQ EQU   ISTRAP+96                                                05339000
RAPICEAC EQU   ISTRAP+92                                                05340000
RAPICELG EQU   ISTRAP+88                                                05341000
RAPAPPWD EQU   ISTRAP+80                                                05342000
RAPACDEB EQU   ISTRAP+76                                                05343000
RAPACBA  EQU   ISTRAP+72                                                05344000
RAPPRE   EQU   ISTRAP                                                   05345000
RDTVSRPL EQU   ISTRDT+132                                               05346000
RDTCRSPW EQU   ISTRDT+124                                               05347000
RDTCRSDS EQU   ISTRDT+116                                               05348000
@NM00029 EQU   ISTRDT+113                                               05349000
RRNSTCNT EQU   RDTSTCNT                                                 05350000
RRNVYRPH EQU   RDTVYRPH                                                 05351000
RDTTPAB  EQU   ISTRDT+104                                               05352000
RDTDPAB  EQU   ISTRDT+100                                               05353000
RDTEPAB  EQU   ISTRDT+96                                                05354000
RDTVPAB  EQU   ISTRDT+92                                                05355000
RDTRSV01 EQU   RDTFLAGB                                                 05356000
RDTBHSET EQU   RDTFLAGB                                                 05357000
RDTCTCFL EQU   RDTFLAGB                                                 05358000
RDTCTPGD EQU   RDTFLAGB                                                 05359000
RDTPRGDN EQU   RDTFLAGB                                                 05360000
RDTOUERP EQU   RDTFLAGB                                                 05361000
RDTLGCT  EQU   ISTRDT+90                                                05362000
RDTMAXID EQU   ISTRDT+88                                                05363000
RDTCTSNT EQU   ISTRDT+86                                                05364000
RDTFLAGS EQU   ISTRDT+84                                                05365000
RDTBACK  EQU   ISTRDT+80                                                05366000
RDTFORW  EQU   ISTRDT+76                                                05367000
RDTLEN   EQU   RDTPLEN+1                                                05368000
RDTPRILS EQU   RDTPRIOR                                                 05369000
RDTPRISW EQU   RDTPRIOR                                                 05370000
RDTPRIRN EQU   RDTPRIOR                                                 05371000
RDTPRILC EQU   RDTPRIOR                                                 05372000
RDTPRIAP EQU   RDTPRIOR                                                 05373000
@NM00028 EQU   RDTPRIOR                                                 05374000
RDTPRE   EQU   ISTRDT                                                   05375000
RCPRSV05 EQU   ISTRCPRE+120                                             05376000
RCPRSV04 EQU   ISTRCPRE+116                                             05377000
RCPRSV03 EQU   ISTRCPRE+112                                             05378000
RCPINTA  EQU   RCPLGNIN+16                                              05379000
RCPLGNCT EQU   RCPLGNIN+8                                               05380000
RCPLGNAP EQU   RCPLGNIN                                                 05381000
@NM00027 EQU   RCPPMODE                                                 05382000
RCPRRECD EQU   RCPPMODE                                                 05383000
RCPRBASC EQU   RCPPMODE                                                 05384000
RCPBFLIM EQU   ISTRCPRE+90                                              05385000
RCPBHSI2 EQU   ISTRCPRE+89                                              05386000
RCPBHSI1 EQU   ISTRCPRE+88                                              05387000
RCPACETR EQU   ISTRCPRE+84                                              05388000
RCPICEAQ EQU   ISTRCPRE+80                                              05389000
RCPLNAPA EQU   ISTRCPRE+76                                              05390000
RCPICELN EQU   ISTRCPRE+72                                              05391000
RCPPRE   EQU   ISTRCPRE                                                 05392000
RPRCONID EQU   ISTRPRE+63                                               05393000
RPRCLVPD EQU   RPRFLAGC                                                 05394000
RPRINIMM EQU   RPRFLAGD                                                 05395000
RPRRSV05 EQU   RPRFLAGD                                                 05396000
RPRCONP  EQU   RPRFLAGD                                                 05397000
RPRACTP  EQU   RPRFLAGD                                                 05398000
RPRRSON  EQU   RPRFLAGD                                                 05399000
RPRCONCT EQU   RPRFLAGD                                                 05400000
RPRLTASN EQU   RPRFLAGD                                                 05401000
RPRPTHCT EQU   ISTRPRE+60                                               05402000
RPRSWDAF EQU   ISTRPRE+58                                               05403000
RPRSTPCT EQU   ISTRPRE+56                                               05404000
RPRRVPT1 EQU   ISTRPRE+52                                               05405000
RPRDEVCH EQU   ISTRPRE+44                                               05406000
RPRNCBA  EQU   ISTRPRE+40                                               05407000
RPRLGONB EQU   ISTRPRE+32                                               05408000
RPRLGONF EQU   ISTRPRE+28                                               05409000
RPRHDTYP EQU   ISTRPRE+27                                               05410000
RPRTIOCT EQU   ISTRPRE+26                                               05411000
RPRPEPCT EQU   ISTRPRE+24                                               05412000
RPRRSV03 EQU   RPRCAUSE                                                 05413000
RPRRSYNC EQU   RPRCAUSE                                                 05414000
RPRNOSRT EQU   RPRCAUSE                                                 05415000
RPRINTST EQU   RPRFLAGB                                                 05416000
RPRVYIMM EQU   RPRFLAGB                                                 05417000
RPRHLVPD EQU   RPRFLAGB                                                 05418000
RPRVIODN EQU   RPRFLAGB                                                 05419000
RPRAOPN  EQU   RPRFLAGB                                                 05420000
RPRENTVT EQU   RPRFLAGB                                                 05421000
RPRENTVH EQU   RPRFLAGB                                                 05422000
RPRLIVE  EQU   RPRFLAGA                                                 05423000
RPRVRYPD EQU   RPRFLAGA                                                 05424000
RPRENTED EQU   RPRFLAGA                                                 05425000
RPRENTIO EQU   RPRFLAGA                                                 05426000
RPRENTBF EQU   RPRFLAGA                                                 05427000
RPRTIED  EQU   RPRFLAGA                                                 05428000
RPRINV   EQU   RPRFLAGA                                                 05429000
RPRACT   EQU   RPRFLAGA                                                 05430000
RPRPELEN EQU   ISTRPRE+18                                               05431000
RPRELEN  EQU   ISTRPRE+16                                               05432000
RPRRLOCK EQU   ISTRPRE+12                                               05433000
RPRDAF   EQU   RPRCOMID+2                                               05434000
RPRSAF   EQU   RPRCOMID                                                 05435000
DEVRSV03 EQU   ISTDEVCH+5                                               05436000
DEVPHYSA EQU   ISTDEVCH+4                                               05437000
DEVCSLPN EQU   DEVCHAR3                                                 05438000
DEVCSTCL EQU   DEVCHAR3                                                 05439000
DEVCCHEK EQU   DEVCHAR3                                                 05440000
DEVCATTN EQU   DEVCHAR3                                                 05441000
DEVCSWL  EQU   DEVFCCTL                                                 05442000
DEVCRVB  EQU   DEVFCCTL                                                 05443000
DEVCSSL  EQU   DEVFCCTL                                                 05444000
DEVCBSC  EQU   DEVFCCTL                                                 05445000
DEVMCODE EQU   ISTDEVCH+2                                               05446000
DEVCHAR2 EQU   DEVTCODE                                                 05447000
DEVRSV01 EQU   DEVCHAR                                                  05448000
DEVCCTL  EQU   DEVCHAR                                                  05449000
DEVNNSPT EQU   DEVCHAR                                                  05450000
DEVSPS   EQU   DEVCHAR                                                  05451000
DEVSUBND EQU   DEVCHAR                                                  05452000
DEVCONVR EQU   DEVCHAR                                                  05453000
DEVOTPUT EQU   DEVCHAR                                                  05454000
DEVINPUT EQU   DEVCHAR                                                  05455000
LOKXCL   EQU   @NM00025                                                 05456000
LOKPRY   EQU   @NM00025                                                 05457000
@NM00026 EQU   @NM00025                                                 05458000
@NM00024 EQU   LOKCHNG                                                  05459000
LOKCT    EQU   ISTLOK                                                   05460000
RSAR12   EQU   RSARSA+56                                                05461000
RSAR11   EQU   RSARSA+52                                                05462000
RSAR10   EQU   RSARSA+48                                                05463000
RSAR09   EQU   RSARSA+44                                                05464000
RSAR08   EQU   RSARSA+40                                                05465000
RSAR07   EQU   RSARSA+36                                                05466000
RSAR06   EQU   RSARSA+32                                                05467000
RSAR05   EQU   RSARSA+28                                                05468000
RSAR04   EQU   RSARSA+24                                                05469000
RSAR03   EQU   RSARSA+20                                                05470000
RSAR02   EQU   RSARSA+16                                                05471000
RSAR01   EQU   RSARSA+12                                                05472000
RSAR00   EQU   RSARSA+8                                                 05473000
RSAR15   EQU   RSARSA+4                                                 05474000
RSAR14   EQU   RSARSA                                                   05475000
@NM00042 EQU   ISTRSA                                                   05476000
VYCRSV02 EQU   ISTVYCRR+128                                             05477000
VYCRSV04 EQU   ISTVYCRR+126                                             05478000
VYCRRCW3 EQU   ISTVYCRR+118                                             05479000
VYCRRSAV EQU   ISTVYCRR+46                                              05480000
VYCRSV03 EQU   VYCCRT+11                                                05481000
CINCFE   EQU   VYCCRT+11                                                05482000
CINCE9   EQU   VYCCRT+11                                                05483000
CINCVO   EQU   VYCCRT+11                                                05484000
CINCR5   EQU   VYCCRT+11                                                05485000
CINCR3   EQU   VYCCRT+10                                                05486000
CINCE8   EQU   VYCCRT+10                                                05487000
CINCE7   EQU   VYCCRT+10                                                05488000
CINCE6   EQU   VYCCRT+10                                                05489000
CINCE5   EQU   VYCCRT+10                                                05490000
CINCE1   EQU   VYCCRT+10                                                05491000
CINCUQ   EQU   VYCCRT+10                                                05492000
CINCUB   EQU   VYCCRT+10                                                05493000
CINCUA   EQU   VYCCRT+9                                                 05494000
CINCX9   EQU   VYCCRT+9                                                 05495000
CINCX8   EQU   VYCCRT+9                                                 05496000
CINCX7   EQU   VYCCRT+9                                                 05497000
CINCX6   EQU   VYCCRT+9                                                 05498000
CINCX3   EQU   VYCCRT+9                                                 05499000
CINCX2   EQU   VYCCRT+9                                                 05500000
CINCX1   EQU   VYCCRT+9                                                 05501000
CINCX0   EQU   VYCCRT+8                                                 05502000
CINCW9   EQU   VYCCRT+8                                                 05503000
CINCW8   EQU   VYCCRT+8                                                 05504000
CINCW7   EQU   VYCCRT+8                                                 05505000
CINCW6   EQU   VYCCRT+8                                                 05506000
CINCW5   EQU   VYCCRT+8                                                 05507000
CINCW4   EQU   VYCCRT+8                                                 05508000
CINCW2   EQU   VYCCRT+8                                                 05509000
CINCW0   EQU   VYCCRT+7                                                 05510000
CINCV9   EQU   VYCCRT+7                                                 05511000
CINCV8   EQU   VYCCRT+7                                                 05512000
CINCV7   EQU   VYCCRT+7                                                 05513000
CINCV6   EQU   VYCCRT+7                                                 05514000
CINCV5   EQU   VYCCRT+7                                                 05515000
CINCV4   EQU   VYCCRT+7                                                 05516000
CINCV3   EQU   VYCCRT+7                                                 05517000
CINCV2   EQU   VYCCRT+6                                                 05518000
CINCU8   EQU   VYCCRT+6                                                 05519000
CINCU7   EQU   VYCCRT+6                                                 05520000
CINCU6   EQU   VYCCRT+6                                                 05521000
CINCU5   EQU   VYCCRT+6                                                 05522000
CINCU4   EQU   VYCCRT+6                                                 05523000
CINCU3   EQU   VYCCRT+6                                                 05524000
CINCU2   EQU   VYCCRT+6                                                 05525000
CINCU1   EQU   VYCCRT+5                                                 05526000
CINCU0   EQU   VYCCRT+5                                                 05527000
CINCUM   EQU   VYCCRT+5                                                 05528000
CINCS1   EQU   VYCCRT+5                                                 05529000
CINCL8   EQU   VYCCRT+5                                                 05530000
CINCL7   EQU   VYCCRT+5                                                 05531000
CINCL6   EQU   VYCCRT+5                                                 05532000
CINCL5   EQU   VYCCRT+5                                                 05533000
CINCL4   EQU   VYCCRT+4                                                 05534000
CINCL3   EQU   VYCCRT+4                                                 05535000
CINCL2   EQU   VYCCRT+4                                                 05536000
CINCL1   EQU   VYCCRT+4                                                 05537000
CINCL0   EQU   VYCCRT+4                                                 05538000
CINCF4   EQU   VYCCRT+4                                                 05539000
CINCF3   EQU   VYCCRT+4                                                 05540000
CINCF1   EQU   VYCCRT+4                                                 05541000
CINCFM   EQU   VYCCRT+3                                                 05542000
CINCE4   EQU   VYCCRT+3                                                 05543000
CINCE3   EQU   VYCCRT+3                                                 05544000
CINCE2   EQU   VYCCRT+3                                                 05545000
CINCE0   EQU   VYCCRT+3                                                 05546000
CINCD9   EQU   VYCCRT+3                                                 05547000
CINCD8   EQU   VYCCRT+3                                                 05548000
CINCD7   EQU   VYCCRT+3                                                 05549000
CINCD6   EQU   VYCCRT+2                                                 05550000
CINCD5   EQU   VYCCRT+2                                                 05551000
CINCD4   EQU   VYCCRT+2                                                 05552000
CINCD3   EQU   VYCCRT+2                                                 05553000
CINCD2   EQU   VYCCRT+2                                                 05554000
CINCD1   EQU   VYCCRT+2                                                 05555000
CINCIP   EQU   VYCCRT+2                                                 05556000
CINCR2   EQU   VYCCRT+2                                                 05557000
CINCMS   EQU   VYCCRT+1                                                 05558000
CINCVS   EQU   VYCCRT+1                                                 05559000
CINCVP   EQU   VYCCRT+1                                                 05560000
CINCVX   EQU   VYCCRT+1                                                 05561000
CINCFS   EQU   VYCCRT+1                                                 05562000
CINCSM   EQU   VYCCRT+1                                                 05563000
CINCR1   EQU   VYCCRT+1                                                 05564000
CINCLF   EQU   VYCCRT                                                   05565000
CINCVA   EQU   VYCCRT                                                   05566000
CINCVI   EQU   VYCCRT                                                   05567000
CINCMD   EQU   VYCCRT                                                   05568000
CINCMY   EQU   VYCCRT                                                   05569000
CINCDL   EQU   VYCCRT                                                   05570000
CINCIO   EQU   VYCCRT                                                   05571000
CINCCL   EQU   VYCCRT                                                   05572000
VYCRSV01 EQU   VYCNTRD+11                                               05573000
NINCFE   EQU   VYCNTRD+11                                               05574000
NINCE9   EQU   VYCNTRD+11                                               05575000
NINCVO   EQU   VYCNTRD+11                                               05576000
NINCR5   EQU   VYCNTRD+11                                               05577000
NINCR3   EQU   VYCNTRD+10                                               05578000
NINCE8   EQU   VYCNTRD+10                                               05579000
NINCE7   EQU   VYCNTRD+10                                               05580000
NINCE6   EQU   VYCNTRD+10                                               05581000
NINCE5   EQU   VYCNTRD+10                                               05582000
NINCE1   EQU   VYCNTRD+10                                               05583000
NINCUQ   EQU   VYCNTRD+10                                               05584000
NINCUB   EQU   VYCNTRD+10                                               05585000
NINCUA   EQU   VYCNTRD+9                                                05586000
NINCX9   EQU   VYCNTRD+9                                                05587000
NINCX8   EQU   VYCNTRD+9                                                05588000
NINCX7   EQU   VYCNTRD+9                                                05589000
NINCX6   EQU   VYCNTRD+9                                                05590000
NINCX3   EQU   VYCNTRD+9                                                05591000
NINCX2   EQU   VYCNTRD+9                                                05592000
NINCX1   EQU   VYCNTRD+9                                                05593000
NINCX0   EQU   VYCNTRD+8                                                05594000
NINCW9   EQU   VYCNTRD+8                                                05595000
NINCW8   EQU   VYCNTRD+8                                                05596000
NINCW7   EQU   VYCNTRD+8                                                05597000
NINCW6   EQU   VYCNTRD+8                                                05598000
NINCW5   EQU   VYCNTRD+8                                                05599000
NINCW4   EQU   VYCNTRD+8                                                05600000
NINCW2   EQU   VYCNTRD+8                                                05601000
NINCW0   EQU   VYCNTRD+7                                                05602000
NINCV9   EQU   VYCNTRD+7                                                05603000
NINCV8   EQU   VYCNTRD+7                                                05604000
NINCV7   EQU   VYCNTRD+7                                                05605000
NINCV6   EQU   VYCNTRD+7                                                05606000
NINCV5   EQU   VYCNTRD+7                                                05607000
NINCV4   EQU   VYCNTRD+7                                                05608000
NINCV3   EQU   VYCNTRD+7                                                05609000
NINCV2   EQU   VYCNTRD+6                                                05610000
NINCU8   EQU   VYCNTRD+6                                                05611000
NINCU7   EQU   VYCNTRD+6                                                05612000
NINCU6   EQU   VYCNTRD+6                                                05613000
NINCU5   EQU   VYCNTRD+6                                                05614000
NINCU4   EQU   VYCNTRD+6                                                05615000
NINCU3   EQU   VYCNTRD+6                                                05616000
NINCU2   EQU   VYCNTRD+6                                                05617000
NINCU1   EQU   VYCNTRD+5                                                05618000
NINCU0   EQU   VYCNTRD+5                                                05619000
NINCUM   EQU   VYCNTRD+5                                                05620000
NINCS1   EQU   VYCNTRD+5                                                05621000
NINCL8   EQU   VYCNTRD+5                                                05622000
NINCL7   EQU   VYCNTRD+5                                                05623000
NINCL6   EQU   VYCNTRD+5                                                05624000
NINCL5   EQU   VYCNTRD+5                                                05625000
NINCL4   EQU   VYCNTRD+4                                                05626000
NINCL3   EQU   VYCNTRD+4                                                05627000
NINCL2   EQU   VYCNTRD+4                                                05628000
NINCL1   EQU   VYCNTRD+4                                                05629000
NINCL0   EQU   VYCNTRD+4                                                05630000
NINCF4   EQU   VYCNTRD+4                                                05631000
NINCF3   EQU   VYCNTRD+4                                                05632000
NINCF1   EQU   VYCNTRD+4                                                05633000
NINCFM   EQU   VYCNTRD+3                                                05634000
NINCE4   EQU   VYCNTRD+3                                                05635000
NINCE3   EQU   VYCNTRD+3                                                05636000
NINCE2   EQU   VYCNTRD+3                                                05637000
NINCE0   EQU   VYCNTRD+3                                                05638000
NINCD9   EQU   VYCNTRD+3                                                05639000
NINCD8   EQU   VYCNTRD+3                                                05640000
NINCD7   EQU   VYCNTRD+3                                                05641000
NINCD6   EQU   VYCNTRD+2                                                05642000
NINCD5   EQU   VYCNTRD+2                                                05643000
NINCD4   EQU   VYCNTRD+2                                                05644000
NINCD3   EQU   VYCNTRD+2                                                05645000
NINCD2   EQU   VYCNTRD+2                                                05646000
NINCD1   EQU   VYCNTRD+2                                                05647000
NINCIP   EQU   VYCNTRD+2                                                05648000
NINCR2   EQU   VYCNTRD+2                                                05649000
NINCMS   EQU   VYCNTRD+1                                                05650000
NINCVS   EQU   VYCNTRD+1                                                05651000
NINCVP   EQU   VYCNTRD+1                                                05652000
NINCVX   EQU   VYCNTRD+1                                                05653000
NINCFS   EQU   VYCNTRD+1                                                05654000
NINCSM   EQU   VYCNTRD+1                                                05655000
NINCR1   EQU   VYCNTRD+1                                                05656000
NINCLF   EQU   VYCNTRD                                                  05657000
NINCVA   EQU   VYCNTRD                                                  05658000
NINCVI   EQU   VYCNTRD                                                  05659000
NINCMD   EQU   VYCNTRD                                                  05660000
NINCMY   EQU   VYCNTRD                                                  05661000
NINCDL   EQU   VYCNTRD                                                  05662000
NINCIO   EQU   VYCNTRD                                                  05663000
NINCCL   EQU   VYCNTRD                                                  05664000
VYCCNS   EQU   ISTVYCRR                                                 05665000
CNSRSV05 EQU   CNSTFLDB+2                                               05666000
CNSLOG0B EQU   CNSTFLDB+2                                               05667000
CNSACCTB EQU   CNSTFLDB+2                                               05668000
CNSFREEB EQU   CNSTFLDB+2                                               05669000
CNSGETSB EQU   CNSTFLDB+2                                               05670000
CNSSEARB EQU   CNSTFLDB+2                                               05671000
CNSQUEUB EQU   CNSTFLDB+2                                               05672000
CNSACONB EQU   CNSTFLDB+2                                               05673000
CNSTCONB EQU   CNSTFLDB+1                                               05674000
CNSCLAQB EQU   CNSTFLDB+1                                               05675000
CNSCLINB EQU   CNSTFLDB+1                                               05676000
CNSGBINB EQU   CNSTFLDB+1                                               05677000
CNSLGINB EQU   CNSTFLDB+1                                               05678000
CNSACINB EQU   CNSTFLDB+1                                               05679000
CNSPSINB EQU   CNSTFLDB+1                                               05680000
CNSRQRLB EQU   CNSTFLDB+1                                               05681000
CNSTRRLB EQU   CNSTFLDB                                                 05682000
CNSDORLB EQU   CNSTFLDB                                                 05683000
CNSRLINB EQU   CNSTFLDB                                                 05684000
CNSQREQB EQU   CNSTFLDB                                                 05685000
CNSXREQB EQU   CNSTFLDB                                                 05686000
CNSAQINB EQU   CNSTFLDB                                                 05687000
CNSAUTHB EQU   CNSTFLDB                                                 05688000
CNSMRINB EQU   CNSTFLDB                                                 05689000
CNSRSV01 EQU   CNSTFLDA+2                                               05690000
CNSLOG0A EQU   CNSTFLDA+2                                               05691000
CNSACCTA EQU   CNSTFLDA+2                                               05692000
CNSFREEA EQU   CNSTFLDA+2                                               05693000
CNSGETSA EQU   CNSTFLDA+2                                               05694000
CNSSEARA EQU   CNSTFLDA+2                                               05695000
CNSQUEUA EQU   CNSTFLDA+2                                               05696000
CNSACONA EQU   CNSTFLDA+2                                               05697000
CNSTCONA EQU   CNSTFLDA+1                                               05698000
CNSCLAQA EQU   CNSTFLDA+1                                               05699000
CNSCLINA EQU   CNSTFLDA+1                                               05700000
CNSGBINA EQU   CNSTFLDA+1                                               05701000
CNSLGINA EQU   CNSTFLDA+1                                               05702000
CNSACINA EQU   CNSTFLDA+1                                               05703000
CNSPSINA EQU   CNSTFLDA+1                                               05704000
CNSRQRLA EQU   CNSTFLDA+1                                               05705000
CNSTRRLA EQU   CNSTFLDA                                                 05706000
CNSDORLA EQU   CNSTFLDA                                                 05707000
CNSRLINA EQU   CNSTFLDA                                                 05708000
CNSQREQA EQU   CNSTFLDA                                                 05709000
CNSXREQA EQU   CNSTFLDA                                                 05710000
CNSAQINA EQU   CNSTFLDA                                                 05711000
CNSAUTHA EQU   CNSTFLDA                                                 05712000
CNSMRINA EQU   CNSTFLDA                                                 05713000
CNSTPFX  EQU   ISTCNSTA                                                 05714000
CRACHAIN EQU   ISTCRA+928                                               05715000
CRARSV02 EQU   ISTCRA+924                                               05716000
CRARSV01 EQU   ISTCRA+920                                               05717000
CRABFTBA EQU   CRABUFA                                                  05718000
CRAMASK  EQU   CRASVC+64                                                05719000
CRAHSIZ  EQU   CRASVC+60                                                05720000
CRAASCRR EQU   CRASVC                                                   05721000
CRAPROCR EQU   ISTCRA+312                                               05722000
CRAPSS   EQU   ISTCRA+160                                               05723000
CRARPH   EQU   ISTCRA+52                                                05724000
CRALAPTR EQU   CRABASIC+48                                              05725000
CRAL9PTR EQU   CRABASIC+44                                              05726000
CRAL8PTR EQU   CRABASIC+40                                              05727000
CRAL7PTR EQU   CRABASIC+36                                              05728000
CRAL6PTR EQU   CRABASIC+32                                              05729000
CRAL5PTR EQU   CRABASIC+28                                              05730000
CRAL4PTR EQU   CRABASIC+24                                              05731000
CRAL3PTR EQU   CRABASIC+20                                              05732000
CRAL1PTR EQU   CRABASIC+12                                              05733000
CRALEV01 EQU   CRALKACT+3                                               05734000
CRALEV02 EQU   CRALKACT+3                                               05735000
CRALEV03 EQU   CRALKACT+3                                               05736000
CRALEV04 EQU   CRALKACT+3                                               05737000
CRALEV05 EQU   CRALKACT+3                                               05738000
CRALEV06 EQU   CRALKACT+3                                               05739000
CRALEV07 EQU   CRALKACT+3                                               05740000
CRALEV08 EQU   CRALKACT+3                                               05741000
CRALEV09 EQU   CRALKACT+2                                               05742000
CRALEV10 EQU   CRALKACT+2                                               05743000
CRALEV11 EQU   CRALKACT+2                                               05744000
CRALEV12 EQU   CRALKACT+2                                               05745000
CRALEV13 EQU   CRALKACT+2                                               05746000
CRALEV14 EQU   CRALKACT+2                                               05747000
CRALEV15 EQU   CRALKACT+2                                               05748000
CRALEV16 EQU   CRALKACT+2                                               05749000
CRALEV17 EQU   CRALKACT+1                                               05750000
CRALEV18 EQU   CRALKACT+1                                               05751000
CRALEV19 EQU   CRALKACT+1                                               05752000
CRALEV20 EQU   CRALKACT+1                                               05753000
CRALEV21 EQU   CRALKACT+1                                               05754000
CRALEV22 EQU   CRALKACT+1                                               05755000
CRALEV23 EQU   CRALKACT+1                                               05756000
CRALEV24 EQU   CRALKACT+1                                               05757000
CRALEV25 EQU   CRALKACT                                                 05758000
CRALEV26 EQU   CRALKACT                                                 05759000
CRALEV27 EQU   CRALKACT                                                 05760000
CRALEV28 EQU   CRALKACT                                                 05761000
CRALEV29 EQU   CRALKACT                                                 05762000
CRALEV30 EQU   CRALKACT                                                 05763000
CRALEV31 EQU   CRALKACT                                                 05764000
CRALEV32 EQU   CRALKACT                                                 05765000
CRAFRR   EQU   CRAHDR+4                                                 05766000
@NM00023 EQU   ISTAPCRR+137                                             05767000
@NM00022 EQU   APC57FLG                                                 05768000
APCNREL  EQU   APC57FLG                                                 05769000
APCRECRA EQU   APC57FLG                                                 05770000
@NM00021 EQU   APC54FLG                                                 05771000
APCRLST  EQU   APC54FLG                                                 05772000
APCPR153 EQU   APC53FLG                                                 05773000
@NM00020 EQU   APC52FLG                                                 05774000
APCWKF   EQU   APC52FLG                                                 05775000
APCNWF   EQU   APC52FLG                                                 05776000
APCRDQ   EQU   APC52FLG                                                 05777000
APCQENQ  EQU   APC52FLG                                                 05778000
APCSMSR  EQU   APC52FLG                                                 05779000
APCCKRQ  EQU   APC52FLG                                                 05780000
@NM00019 EQU   APC31FLG                                                 05781000
APCSORT  EQU   APC31FLG                                                 05782000
APCRESCH EQU   APC31FLG                                                 05783000
APCTPXIT EQU   APC31FLG                                                 05784000
APCSWTWD EQU   ISTAPCRR+128                                             05785000
APCSAV2  EQU   ISTAPCRR+124                                             05786000
APCSAV1  EQU   ISTAPCRR+120                                             05787000
APCRETCD EQU   APCCOMF+2                                                05788000
@NM00018 EQU   APCCOMF1+1                                               05789000
APCZLBER EQU   APCCOMF1                                                 05790000
APCEXIT  EQU   APCCOMF1                                                 05791000
APCRELR  EQU   APCCOMF1                                                 05792000
APCIRB2  EQU   APCCOMF1                                                 05793000
APCIRB1  EQU   APCCOMF1                                                 05794000
APCSMCR  EQU   APCCOMF1                                                 05795000
APCUETSK EQU   APCCOMF1                                                 05796000
APCSSTSK EQU   APCCOMF1                                                 05797000
APCESTAL EQU   APCSAVE                                                  05798000
APCFRRPM EQU   ISTAPCRR+40                                              05799000
APCQWFO  EQU   ISTAPCRR+36                                              05800000
APCPABSV EQU   ISTAPCRR+32                                              05801000
APCRTRN  EQU   ISTAPCRR+28                                              05802000
APCTCBA  EQU   ISTAPCRR+24                                              05803000
APCPSTA  EQU   ISTAPCRR+20                                              05804000
@NM00017 EQU   APCRFLG+1                                                05805000
APC31R   EQU   APCRFLG                                                  05806000
APC58R   EQU   APCRFLG                                                  05807000
APC57R   EQU   APCRFLG                                                  05808000
APC56R   EQU   APCRFLG                                                  05809000
APC54R   EQU   APCRFLG                                                  05810000
APC53R   EQU   APCRFLG                                                  05811000
APC52R   EQU   APCRFLG                                                  05812000
APC51R   EQU   APCRFLG                                                  05813000
@NM00016 EQU   APCATFLG+1                                               05814000
APC31E   EQU   APCATFLG                                                 05815000
APC58E   EQU   APCATFLG                                                 05816000
APC57E   EQU   APCATFLG                                                 05817000
APC56E   EQU   APCATFLG                                                 05818000
APC54E   EQU   APCATFLG                                                 05819000
APC53E   EQU   APCATFLG                                                 05820000
APC52E   EQU   APCATFLG                                                 05821000
APC51E   EQU   APCATFLG                                                 05822000
APCHDRSV EQU   ISTAPCRR                                                 05823000
ASCPSREG EQU   ISTASCRR+44                                              05824000
ASCUSR01 EQU   ASCUSRGS+12                                              05825000
ASCUSR00 EQU   ASCUSRGS+8                                               05826000
ASCUSR15 EQU   ASCUSRGS+4                                               05827000
ASCUSR14 EQU   ASCUSRGS                                                 05828000
ASCETRYA EQU   ISTASCRR+24                                              05829000
ASCKEY   EQU   ISTASCRR+23                                              05830000
ASCAUDIT EQU   ASCFLG3                                                  05831000
ASCFBDUD EQU   ASCFLG3                                                  05832000
ASCLLKF  EQU   ASCFLG3                                                  05833000
ASCKEYF  EQU   ASCFLG3                                                  05834000
ASCFBDAL EQU   ASCFLG3                                                  05835000
ASCFSRGT EQU   ASCFLG3                                                  05836000
ASCICR   EQU   ASCFLG2                                                  05837000
ASCFSRIC EQU   ASCFLG2                                                  05838000
ASCFBDIC EQU   ASCFLG2                                                  05839000
ASCFBAIC EQU   ASCFLG2                                                  05840000
ASCPASTR EQU   ASCFLG1                                                  05841000
ASCFSR   EQU   ASCFLG1                                                  05842000
ASCFBD   EQU   ASCFLG1                                                  05843000
ASCFBA   EQU   ASCFLG1                                                  05844000
ASCPFCRR EQU   ISTASCRR                                                 05845000
ZCRRU    EQU   ZCRRHRU+3                                                05846000
ZCRRH    EQU   ZCRRHRU                                                  05847000
ZCRWORDA EQU   ISTZCRR+477                                              05848000
ZCRCMNRC EQU   ISTZCRR+476                                              05849000
ZCRRSV97 EQU   ZCRENTER+18                                              05850000
ZCREIC2B EQU   ZCRENTER+18                                              05851000
ZCREAC2B EQU   ZCRENTER+18                                              05852000
ZCRELCAB EQU   ZCRENTER+18                                              05853000
ZCREDCMF EQU   ZCRENTER+18                                              05854000
ZCREBCIF EQU   ZCRENTER+18                                              05855000
ZCREICSG EQU   ZCRENTER+18                                              05856000
ZCREDCK0 EQU   ZCRENTER+18                                              05857000
ZCRECFY0 EQU   ZCRENTER+17                                              05858000
ZCREKCCB EQU   ZCRENTER+17                                              05859000
ZCREDCNB EQU   ZCRENTER+17                                              05860000
ZCREICOE EQU   ZCRENTER+17                                              05861000
ZCREBCNB EQU   ZCRENTER+17                                              05862000
ZCREBC0L EQU   ZCRENTER+17                                              05863000
ZCREBCAL EQU   ZCRENTER+17                                              05864000
ZCREDCQR EQU   ZCRENTER+17                                              05865000
ZCREDCPR EQU   ZCRENTER+16                                              05866000
ZCREBCSB EQU   ZCRENTER+16                                              05867000
ZCREAC1R EQU   ZCRENTER+16                                              05868000
ZCRECCCI EQU   ZCRENTER+16                                              05869000
ZCRECCAI EQU   ZCRENTER+16                                              05870000
ZCRECCBI EQU   ZCRENTER+16                                              05871000
ZCREBCAR EQU   ZCRENTER+16                                              05872000
ZCREBCDR EQU   ZCRENTER+16                                              05873000
ZCREBCBR EQU   ZCRENTER+15                                              05874000
ZCREDCXR EQU   ZCRENTER+15                                              05875000
ZCREDCWB EQU   ZCRENTER+15                                              05876000
ZCREDCWR EQU   ZCRENTER+15                                              05877000
ZCREKCCN EQU   ZCRENTER+15                                              05878000
ZCREKCBN EQU   ZCRENTER+15                                              05879000
ZCREKCBB EQU   ZCRENTER+15                                              05880000
ZCREJC0B EQU   ZCRENTER+15                                              05881000
ZCREJCDB EQU   ZCRENTER+14                                              05882000
ZCREJCCB EQU   ZCRENTER+14                                              05883000
ZCREJCBB EQU   ZCRENTER+14                                              05884000
ZCREJCAB EQU   ZCRENTER+14                                              05885000
ZCREIC1B EQU   ZCRENTER+14                                              05886000
ZCREIC0B EQU   ZCRENTER+14                                              05887000
ZCREICX0 EQU   ZCRENTER+14                                              05888000
ZCREICWB EQU   ZCRENTER+14                                              05889000
ZCREICVB EQU   ZCRENTER+13                                              05890000
ZCREICUB EQU   ZCRENTER+13                                              05891000
ZCREICTB EQU   ZCRENTER+13                                              05892000
ZCREICSC EQU   ZCRENTER+13                                              05893000
ZCREICSB EQU   ZCRENTER+13                                              05894000
ZCREICRB EQU   ZCRENTER+13                                              05895000
ZCREICQB EQU   ZCRENTER+13                                              05896000
ZCREICQA EQU   ZCRENTER+13                                              05897000
ZCREICOB EQU   ZCRENTER+12                                              05898000
ZCREICOA EQU   ZCRENTER+12                                              05899000
ZCREICNB EQU   ZCRENTER+12                                              05900000
ZCREICNA EQU   ZCRENTER+12                                              05901000
ZCREICMB EQU   ZCRENTER+12                                              05902000
ZCREICLB EQU   ZCRENTER+12                                              05903000
ZCREICKG EQU   ZCRENTER+12                                              05904000
ZCREICKE EQU   ZCRENTER+12                                              05905000
ZCREICKB EQU   ZCRENTER+11                                              05906000
ZCREICJB EQU   ZCRENTER+11                                              05907000
ZCREICID EQU   ZCRENTER+11                                              05908000
ZCREICIB EQU   ZCRENTER+11                                              05909000
ZCREICHB EQU   ZCRENTER+11                                              05910000
ZCREICGB EQU   ZCRENTER+11                                              05911000
ZCREICEB EQU   ZCRENTER+11                                              05912000
ZCREICDB EQU   ZCRENTER+11                                              05913000
ZCREICCI EQU   ZCRENTER+10                                              05914000
ZCREICCB EQU   ZCRENTER+10                                              05915000
ZCREICBI EQU   ZCRENTER+10                                              05916000
ZCREICBB EQU   ZCRENTER+10                                              05917000
ZCREICAB EQU   ZCRENTER+10                                              05918000
ZCREICAA EQU   ZCRENTER+10                                              05919000
ZCREHCAN EQU   ZCRENTER+10                                              05920000
ZCREGC0B EQU   ZCRENTER+10                                              05921000
ZCREGC0A EQU   ZCRENTER+9                                               05922000
ZCREGCLA EQU   ZCRENTER+9                                               05923000
ZCREGCEB EQU   ZCRENTER+9                                               05924000
ZCREGCDB EQU   ZCRENTER+9                                               05925000
@NM00015 EQU   ZCRENTER+9                                               05926000
ZCREGCBB EQU   ZCRENTER+9                                               05927000
ZCREGCAB EQU   ZCRENTER+9                                               05928000
ZCREFCEB EQU   ZCRENTER+9                                               05929000
ZCREFCEA EQU   ZCRENTER+8                                               05930000
ZCREECTA EQU   ZCRENTER+8                                               05931000
ZCREECEA EQU   ZCRENTER+8                                               05932000
ZCREECDA EQU   ZCRENTER+8                                               05933000
ZCREECCB EQU   ZCRENTER+8                                               05934000
ZCREECCA EQU   ZCRENTER+8                                               05935000
ZCREECBB EQU   ZCRENTER+8                                               05936000
ZCREECBA EQU   ZCRENTER+8                                               05937000
ZCREDCMB EQU   ZCRENTER+7                                               05938000
ZCREDCL0 EQU   ZCRENTER+7                                               05939000
ZCREDCKB EQU   ZCRENTER+7                                               05940000
ZCREDCKA EQU   ZCRENTER+7                                               05941000
ZCREDCJ0 EQU   ZCRENTER+7                                               05942000
ZCREDCI0 EQU   ZCRENTER+7                                               05943000
ZCREDCH0 EQU   ZCRENTER+7                                               05944000
ZCREDCF0 EQU   ZCRENTER+7                                               05945000
ZCREDCE0 EQU   ZCRENTER+6                                               05946000
ZCREDCD0 EQU   ZCRENTER+6                                               05947000
ZCREDCC0 EQU   ZCRENTER+6                                               05948000
ZCREDCB0 EQU   ZCRENTER+6                                               05949000
ZCREDCA0 EQU   ZCRENTER+6                                               05950000
ZCRECC2B EQU   ZCRENTER+6                                               05951000
ZCRECC1B EQU   ZCRENTER+6                                               05952000
ZCRECC1A EQU   ZCRENTER+6                                               05953000
ZCRECC0B EQU   ZCRENTER+5                                               05954000
ZCRECC0A EQU   ZCRENTER+5                                               05955000
ZCREBC0B EQU   ZCRENTER+5                                               05956000
ZCREBC0A EQU   ZCRENTER+5                                               05957000
ZCREBCZ0 EQU   ZCRENTER+5                                               05958000
ZCREBCY0 EQU   ZCRENTER+5                                               05959000
ZCREBCX0 EQU   ZCRENTER+5                                               05960000
ZCREBCXA EQU   ZCRENTER+5                                               05961000
ZCREBCSC EQU   ZCRENTER+4                                               05962000
ZCREBCRB EQU   ZCRENTER+4                                               05963000
ZCREBCRA EQU   ZCRENTER+4                                               05964000
ZCREBCQB EQU   ZCRENTER+4                                               05965000
ZCREBCPB EQU   ZCRENTER+4                                               05966000
ZCREBCOB EQU   ZCRENTER+4                                               05967000
ZCREBCNE EQU   ZCRENTER+4                                               05968000
ZCREBCND EQU   ZCRENTER+4                                               05969000
ZCREBCMB EQU   ZCRENTER+3                                               05970000
ZCREBCLB EQU   ZCRENTER+3                                               05971000
ZCREBCLA EQU   ZCRENTER+3                                               05972000
ZCREBCKB EQU   ZCRENTER+3                                               05973000
ZCREBCKA EQU   ZCRENTER+3                                               05974000
ZCREBCJB EQU   ZCRENTER+3                                               05975000
ZCREBCJA EQU   ZCRENTER+3                                               05976000
ZCREBCID EQU   ZCRENTER+3                                               05977000
ZCREBCIB EQU   ZCRENTER+2                                               05978000
ZCREBCIA EQU   ZCRENTER+2                                               05979000
ZCREBCHB EQU   ZCRENTER+2                                               05980000
ZCREBCHA EQU   ZCRENTER+2                                               05981000
ZCREBCGB EQU   ZCRENTER+2                                               05982000
ZCREBCGA EQU   ZCRENTER+2                                               05983000
ZCREBCFB EQU   ZCRENTER+2                                               05984000
ZCREBCFA EQU   ZCRENTER+2                                               05985000
ZCREBCEB EQU   ZCRENTER+1                                               05986000
ZCREBCDI EQU   ZCRENTER+1                                               05987000
ZCREBCCB EQU   ZCRENTER+1                                               05988000
ZCREBCBI EQU   ZCRENTER+1                                               05989000
ZCREBCBB EQU   ZCRENTER+1                                               05990000
ZCREBCBA EQU   ZCRENTER+1                                               05991000
ZCREBCAM EQU   ZCRENTER+1                                               05992000
ZCREBCAI EQU   ZCRENTER+1                                               05993000
ZCREBCAG EQU   ZCRENTER                                                 05994000
ZCREBCAE EQU   ZCRENTER                                                 05995000
ZCREBCAB EQU   ZCRENTER                                                 05996000
ZCREBCAA EQU   ZCRENTER                                                 05997000
ZCREAC1B EQU   ZCRENTER                                                 05998000
ZCREAC0B EQU   ZCRENTER                                                 05999000
ZCREAC0A EQU   ZCRENTER                                                 06000000
ZCREAC1A EQU   ZCRENTER                                                 06001000
ZCRTNAME EQU   ZCRAUDIT+1                                               06002000
ZCRTID   EQU   ZCRAUDIT                                                 06003000
ZCRREMIC EQU   ISTZCRR+436                                              06004000
ZCRSAVEZ EQU   ISTZCRR+196                                              06005000
ZCRDAFSV EQU   ZCRCIDSV+2                                               06006000
ZCRSAFSV EQU   ZCRCIDSV                                                 06007000
ZCRR13SV EQU   ISTZCRR+188                                              06008000
ZCRR2SV  EQU   ISTZCRR+184                                              06009000
ZCROPCDE EQU   ISTZCRR+183                                              06010000
ZCRPRMTC EQU   ISTZCRR+182                                              06011000
ZCRRCDSV EQU   ISTZCRR+181                                              06012000
ZCRAWQSW EQU   ISTZCRR+180                                              06013000
ZCRTOPQ  EQU   ISTZCRR+180                                              06014000
ZCRLSTFB EQU   ISTZCRR+180                                              06015000
ZCRXSCHD EQU   ISTZCRR+180                                              06016000
ZCRNXTEL EQU   ISTZCRR+180                                              06017000
ZCRSCANQ EQU   ISTZCRR+180                                              06018000
ZCRMOREL EQU   ISTZCRR+180                                              06019000
ZCRFBPRC EQU   ISTZCRR+180                                              06020000
ZCRFSBSV EQU   ISTZCRR+176                                              06021000
ZCRSVWK5 EQU   ZCRWKARA+16                                              06022000
ZCRSVWK4 EQU   ZCRWKARA+12                                              06023000
ZCRSVWK3 EQU   ZCRWKARA+8                                               06024000
ZCRSVWK2 EQU   ZCRWKARA+4                                               06025000
ZCRSVWK1 EQU   ZCRWKARA                                                 06026000
ZCRSVF25 EQU   ZCRSVRTN+96                                              06027000
ZCRSVF24 EQU   ZCRSVRTN+92                                              06028000
ZCRSVF23 EQU   ZCRSVRTN+88                                              06029000
ZCRSVF22 EQU   ZCRSVRTN+84                                              06030000
ZCRSVF21 EQU   ZCRSVRTN+80                                              06031000
ZCRSVF20 EQU   ZCRSVRTN+76                                              06032000
ZCRSVF19 EQU   ZCRSVRTN+72                                              06033000
ZCRSVF18 EQU   ZCRSVRTN+68                                              06034000
ZCRSVF17 EQU   ZCRSVRTN+64                                              06035000
ZCRSVF16 EQU   ZCRSVRTN+60                                              06036000
ZCRSVF15 EQU   ZCRSVRTN+56                                              06037000
ZCRSVF14 EQU   ZCRSVRTN+52                                              06038000
ZCRSVF13 EQU   ZCRSVRTN+48                                              06039000
ZCRSVF12 EQU   ZCRSVRTN+44                                              06040000
ZCRSVF11 EQU   ZCRSVRTN+40                                              06041000
ZCRSVF10 EQU   ZCRSVRTN+36                                              06042000
ZCRSVF9  EQU   ZCRSVRTN+32                                              06043000
ZCRSVF8  EQU   ZCRSVRTN+28                                              06044000
ZCRSVF7  EQU   ZCRSVRTN+24                                              06045000
ZCRSVF6  EQU   ZCRSVRTN+20                                              06046000
ZCRSVF5  EQU   ZCRSVRTN+16                                              06047000
ZCRSVF4  EQU   ZCRSVRTN+12                                              06048000
ZCRSVF3  EQU   ZCRSVRTN+8                                               06049000
ZCRSVF2  EQU   ZCRSVRTN+4                                               06050000
ZCRSVF1  EQU   ZCRSVRTN                                                 06051000
ZCRPVZB  EQU   ISTZCRR+52                                               06052000
ZCRZLB   EQU   ISTZCRR+48                                               06053000
ZCRBFPTR EQU   ISTZCRR+44                                               06054000
ZCRCCWA  EQU   ISTZCRR+40                                               06055000
ZCRPSW   EQU   ZCRPARMS+15                                              06056000
ZCRPCHAR EQU   ZCRPARMS+14                                              06057000
ZCRPRES2 EQU   ZCRPCOD2                                                 06058000
ZCRPMFGF EQU   ZCRPCOD2                                                 06059000
ZCRPFHDR EQU   ZCRPCOD2                                                 06060000
ZCRPPG2  EQU   ZCRPCOD2                                                 06061000
ZCRPRES  EQU   ZCRPCOD1                                                 06062000
ZCRPCFTX EQU   ZCRPCOD1                                                 06063000
ZCRPBUF  EQU   ZCRPCOD1                                                 06064000
ZCRPLSCB EQU   ZCRPCOD1                                                 06065000
ZCRPLSBQ EQU   ZCRPLSBF                                                 06066000
ZCRPFSB  EQU   ZCRPCOD1                                                 06067000
ZCRPLNG  EQU   ZCRPCOD1                                                 06068000
ZCRPPG   EQU   ZCRPCOD1                                                 06069000
ZCRDTODA EQU   ZCRDFRDA                                                 06070000
ZCRMLNG  EQU   ZCRPARMS+8                                               06071000
ZCRTBPTR EQU   ZCRPARMS+4                                               06072000
ZCRCBPTR EQU   ZCRFBPTR                                                 06073000
ZCRCRLCP EQU   ISTZCRR+20                                               06074000
@NM00014 EQU   ZCRSCPSW                                                 06075000
ZCRSKIPT EQU   ZCRSCPSW                                                 06076000
ZCRFSBWE EQU   ZCRSCPSW                                                 06077000
ZCRPRCMP EQU   ZCRSCPSW                                                 06078000
ZCRLREQ  EQU   ZCRSCPSW                                                 06079000
ZCRRJLCP EQU   ZCRSCPSW                                                 06080000
ZCRTPINV EQU   ZCRSCPSW                                                 06081000
ZCRTPEX  EQU   ZCRSCPSW                                                 06082000
@NM00013 EQU   ZCRIBPR                                                  06083000
ZCR3270R EQU   ZCRIBPR                                                  06084000
ZCR3270  EQU   ZCRIBPR                                                  06085000
ZCRLCPFD EQU   ZCRIBPR                                                  06086000
ZCRLCPFR EQU   ZCRIBPR                                                  06087000
ZCRRELK  EQU   ZCRIBPR                                                  06088000
ZCRERR   EQU   ZCRIBPR                                                  06089000
ZCRNOBUF EQU   ZCRIBPR                                                  06090000
@NM00012 EQU   ZCRPFLGS                                                 06091000
ZCRQAHED EQU   ZCRPFLGS                                                 06092000
ZCRF1RES EQU   ZCRGENSW                                                 06093000
ZCRBRIS  EQU   ZCRGENSW                                                 06094000
ZCRCLRBD EQU   ZCRGENSW                                                 06095000
ZCREXRES EQU   ZCRGENSW                                                 06096000
ZCRLCSYN EQU   ZCRGENSW                                                 06097000
ZCRRT06  EQU   ZCRGENSW                                                 06098000
ZCRTSW2  EQU   ZCRGENSW                                                 06099000
ZCRTSW1  EQU   ZCRGENSW                                                 06100000
ZCRINLCP EQU   ZCRFLGS3                                                 06101000
ZCRWRPTR EQU   ZCRFLGS3                                                 06102000
ZCRNOFRE EQU   ZCRFLGS3                                                 06103000
ZCREDRIV EQU   ZCRFLGS3                                                 06104000
ZCRDISC  EQU   ZCRFLGS3                                                 06105000
ZCRTPDIS EQU   ZCRFLGS3                                                 06106000
ZCRTPCON EQU   ZCRFLGS3                                                 06107000
ZCRTIC   EQU   ZCRFLGS3                                                 06108000
ZCRCNLXL EQU   ZCRRESET                                                 06109000
ZCRENDAN EQU   ZCRSWFLD                                                 06110000
ZCRENDXL EQU   ZCRSWFLD                                                 06111000
ZCRENDX  EQU   ZCRSWFLD                                                 06112000
ZCROB1   EQU   ZCRNDLCP                                                 06113000
ZCRENDPR EQU   ZCRSWFLD                                                 06114000
ZCREXTYP EQU   ZCRSWFLD                                                 06115000
ZCRSLCP  EQU   ZCRENDSH                                                 06116000
ZCRIF0E3 EQU   ZCRFLGS2                                                 06117000
ZCRIF0E2 EQU   ZCRFLGS2                                                 06118000
ZCRIF0E1 EQU   ZCRFLGS2                                                 06119000
ZCROB    EQU   ZCRFLGS2                                                 06120000
ZCRFMSED EQU   ZCRFLGS2                                                 06121000
ZCRSHEDI EQU   ZCRFLGS2                                                 06122000
ZCRLOCAL EQU   ZCRFLGS2                                                 06123000
ZCRFEXIT EQU   ZCRFLGS1                                                 06124000
ZCRUNSOL EQU   ZCRFLGS1                                                 06125000
ZCRENDLP EQU   ZCRFLGS1                                                 06126000
ZCRNRMEX EQU   ZCRFLGS1                                                 06127000
ZCRWAIT  EQU   ZCRFLGS1                                                 06128000
ZCRDEQSW EQU   ZCRFLGS1                                                 06129000
ZCRQUESW EQU   ZCRFLGS1                                                 06130000
ZCREXSW  EQU   ZCRFLGS1                                                 06131000
ZCRFRRA  EQU   ISTZCRR+8                                                06132000
ZCRCHAIN EQU   ISTZCRR+4                                                06133000
ZCRFLAG  EQU   ZCRCRR+3                                                 06134000
ZCRLEN   EQU   ZCRCRR+1                                                 06135000
ZCRID    EQU   ZCRCRR                                                   06136000
CCFRSVD1 EQU   CFCCRT                                                   06137000
CCFCR2   EQU   CFCCRT                                                   06138000
CCFCRP   EQU   CFCCRT                                                   06139000
CCFCR1   EQU   CFCCRT                                                   06140000
CCFCS2   EQU   CFCCRT                                                   06141000
CCFCS1   EQU   CFCCRT                                                   06142000
NCFRSVD  EQU   CFCNTRD                                                  06143000
NCFCR2   EQU   CFCNTRD                                                  06144000
NCFCRP   EQU   CFCNTRD                                                  06145000
NCFCR1   EQU   CFCNTRD                                                  06146000
NCFCS2   EQU   CFCNTRD                                                  06147000
NCFCS1   EQU   CFCNTRD                                                  06148000
PFCRSV01 EQU   ISTPFCRR+13                                              06149000
PFCFTA   EQU   ISTPFCRR+12                                              06150000
CRRFRR   EQU   PFCFRRO                                                  06151000
CRRCHAIN EQU   PFCCRRO                                                  06152000
CRRLEN   EQU   PFCCRRLN                                                 06153000
PFCRSV10 EQU   PFCCRR+1                                                 06154000
CRRID    EQU   PFCCRRID                                                 06155000
ZSAZTRAC EQU   ISTZSAVE+36                                              06156000
ZSAZSVVR EQU   ISTZSAVE+12                                              06157000
ZSAZSVRR EQU   ISTZSAVE+8                                               06158000
ZSAZSVFC EQU   ISTZSAVE+4                                               06159000
ZSAZACTV EQU   ZSAZSVMS                                                 06160000
LCPFTYPE EQU   LCPRPHA                                                  06161000
LCPRSTQH EQU   LCPLCCW                                                  06162000
LCPCLREP EQU   ISTLCPB+44                                               06163000
LCPUBFSB EQU   LCPFLCCW                                                 06164000
LCPRSV77 EQU   ISTLCPB+39                                               06165000
LCPLCCWC EQU   ISTLCPB+38                                               06166000
LCPRSV78 EQU   LCPFLG1                                                  06167000
LCPTRANS EQU   LCPFLG1                                                  06168000
LCPSTLB  EQU   LCPFLG1                                                  06169000
LCPREDRV EQU   LCPFLG1                                                  06170000
LCPDIRPT EQU   LCPFLG1                                                  06171000
LCPINTER EQU   LCPFLG1                                                  06172000
LCPRESET EQU   LCPFLG1                                                  06173000
LCPSTYPE EQU   ISTLCPB+36                                               06174000
LCPFSNCH EQU   ISTLCPB+34                                               06175000
LCPFOSN  EQU   ISTLCPB+32                                               06176000
LCPTLBAD EQU   ISTLCPB+28                                               06177000
LCPFDB2  EQU   LCPFDBA+1                                                06178000
LCPFDB1  EQU   LCPFDBA                                                  06179000
LCPNXLCW EQU   ISTLCPB+20                                               06180000
LCPDAF   EQU   LCPCID+2                                                 06181000
LCPSAF   EQU   LCPCID                                                   06182000
LCPLCCW1 EQU   ISTLCPB+12                                               06183000
LCPRRCNT EQU   LCPSEQ+1                                                 06184000
LCPRRCCT EQU   LCPSEQ                                                   06185000
LCPATOP  EQU   LCPFLAG2                                                 06186000
LCPFREE  EQU   LCPFLAG2                                                 06187000
LCPDSTAT EQU   LCPFLAG2                                                 06188000
LCPEXRES EQU   LCPFID0                                                  06189000
LCPZRIMM EQU   LCPTLBPI                                                 06190000
LCPRSTRT EQU   LCPFLAG2                                                 06191000
LCPASYN  EQU   LCPFLAG2                                                 06192000
LCPPRFLG EQU   LCPFLAG2                                                 06193000
LCPZMIRC EQU   LCPRUCNT                                                 06194000
LCPCHAI2 EQU   LCPCHAIN+1                                               06195000
LCPCHNG  EQU   LCPCHAI1                                                 06196000
LCPZRT0B EQU   LCPMNRCD                                                 06197000
LCPZRT0A EQU   LCPMNRCD                                                 06198000
LCPZRTL9 EQU   LCPZRT09                                                 06199000
LCPZRTL8 EQU   LCPZRT08                                                 06200000
LCPZRTL7 EQU   LCPZRT07                                                 06201000
LCPZRTL6 EQU   LCPZRT06                                                 06202000
LCPZRTL5 EQU   LCPZRT05                                                 06203000
LCPZRTL4 EQU   LCPZRT04                                                 06204000
LCPZRTL3 EQU   LCPZRT03                                                 06205000
LCPZRTL2 EQU   LCPZRT02                                                 06206000
LCPZRT01 EQU   LCPFLAGS                                                 06207000
LCPZRT00 EQU   LCPFLAGS                                                 06208000
LCPLNGTH EQU   ISTLCPB+1                                                06209000
LCPTYPE  EQU   ISTLCPB                                                  06210000
LCCWDATA EQU   ISTLCCW+4                                                06211000
LCCWCNT  EQU   ISTLCCW+2                                                06212000
LCCWACI  EQU   LCCWFLAG                                                 06213000
LCCWRFI  EQU   LCCWFLAG                                                 06214000
LCCWPER  EQU   LCCWLSI                                                  06215000
LCCWIDAT EQU   LCCWFLAG                                                 06216000
LCCWNTVC EQU   LCCWFLAG                                                 06217000
LCCWCKPT EQU   LCCWFLAG                                                 06218000
LCCWCC   EQU   LCCWFLAG                                                 06219000
LCCWCD   EQU   LCCWFLAG                                                 06220000
LCCWTYPE EQU   LCCWCTL                                                  06221000
LCCWMODE EQU   LCCWCTL                                                  06222000
LCCWSOP  EQU   LCCWRWOP                                                 06223000
@NM00011 EQU   LCCWRWOP                                                 06224000
LCCWSD   EQU   LCCWOP                                                   06225000
LCCWSI   EQU   LCCWOP                                                   06226000
NCSAPPAB EQU   NCSAPP+608                                               06227000
NCSAPDAT EQU   NCSAPBUE+8                                               06228000
NCSAPRU  EQU   NCSAPBUE+3                                               06229000
NCSRSV04 EQU   NCSAPBUE                                                 06230000
NCSAPEND EQU   NCSAPP+84                                                06231000
NCSAPTXT EQU   NCSAPP+76                                                06232000
NCSAPECB EQU   NCSAPP+72                                                06233000
NCSAPSA  EQU   NCSAPP                                                   06234000
NCSPLPDB EQU   NCSPLSID+5                                               06235000
NCSPLNID EQU   NCSPLPHD                                                 06236000
NCSPLPO  EQU   NCSPLSTA                                                 06237000
NCSRSVD4 EQU   NCSPLSTA                                                 06238000
NCSRSVD2 EQU   NCSCRMOD                                                 06239000
NCSPTMOD EQU   NCSCRMOD                                                 06240000
NCSAIMOD EQU   NCSCRMOD                                                 06241000
NCSRSVD1 EQU   NCSCHKPT+1                                               06242000
NCSPTUSE EQU   NCSCHKPT+1                                               06243000
NCSANSMD EQU   NCSCHKPT+1                                               06244000
NCSLGMOD EQU   NCSCHKPT                                                 06245000
NCSLGAPL EQU   NCSCHKPT                                                 06246000
NCSDTRLM EQU   NCSCHKPT                                                 06247000
NCSESLM  EQU   NCSCHKPT                                                 06248000
NCSNRPL  EQU   NCSCHKPT                                                 06249000
NCSPOLD  EQU   NCSCHKPT                                                 06250000
NCSPACTV EQU   NCSCHKPT                                                 06251000
NCSACTV  EQU   NCSCHKPT                                                 06252000
NCSPLRTY EQU   ISTNCSPL+263                                             06253000
NCSPLRH  EQU   ISTNCSPL+260                                             06254000
NCSUFMCB EQU   ISTNCSPL+256                                             06255000
NCSMGLPT EQU   ISTNCSPL+252                                             06256000
NCSCPWPT EQU   ISTNCSPL+248                                             06257000
NCSSENS2 EQU   NCSSENSE+2                                               06258000
NCSSNS2  EQU   NCSSENSE+1                                               06259000
NCSSNS1  EQU   NCSSENSE                                                 06260000
NCSPLNSN EQU   ISTNCSPL+240                                             06261000
NCSPLMID EQU   ISTNCSPL+232                                             06262000
NCSPLPID EQU   ISTNCSPL+231                                             06263000
NCSPLGID EQU   ISTNCSPL+230                                             06264000
NCSPLSQN EQU   ISTNCSPL+228                                             06265000
NCSPLRUI EQU   ISTNCSPL+212                                             06266000
NCSPLRUO EQU   ISTNCSPL+208                                             06267000
NCSPLWEL EQU   ISTNCSPL+200                                             06268000
NCSPLSPL EQU   ISTNCSPL+196                                             06269000
NCSPLP3  EQU   ISTNCSPL+192                                             06270000
NCSPLP2  EQU   ISTNCSPL+188                                             06271000
NCSPLP1  EQU   ISTNCSPL+184                                             06272000
NCSPLOLN EQU   ISTNCSPL+182                                             06273000
@NM00010 EQU   NCSPLFL5                                                 06274000
NCSFORCE EQU   NCSPLFL5                                                 06275000
NCSSDLK  EQU   NCSPLFL5                                                 06276000
NCSSCPPS EQU   NCSPLFL5                                                 06277000
NCSDLRSN EQU   ISTNCSPL+180                                             06278000
NCSPL2AP EQU   NCSPLFL4                                                 06279000
NCSDSPN  EQU   NCSPLFL4                                                 06280000
NCSDSPI  EQU   NCSPLFL4                                                 06281000
NCSDSPA  EQU   NCSPLFL4                                                 06282000
NCSDSPE  EQU   NCSPLFL4                                                 06283000
NCSPLVID EQU   NCSPLFL4                                                 06284000
NCSPLRSO EQU   NCSPLFL4                                                 06285000
NCSDLNID EQU   NCSPLFL4                                                 06286000
NCSEND   EQU   NCSPLFL3                                                 06287000
NCSFINAL EQU   NCSPLFL3                                                 06288000
NCSANS   EQU   NCSPLFL3                                                 06289000
NCSPID   EQU   NCSPLFL3                                                 06290000
NCSGID   EQU   NCSPLFL3                                                 06291000
NCSPLANS EQU   NCSPLFL3                                                 06292000
NCSEPP   EQU   NCSPLFL3                                                 06293000
NCSPLMOM EQU   NCSPLFL3                                                 06294000
NCSPLVIT EQU   NCSPLFL2                                                 06295000
NCSPLVIS EQU   NCSPLFL2                                                 06296000
NCSREMPO EQU   NCSPLFL2                                                 06297000
NCSPLDS  EQU   NCSPLFL2                                                 06298000
NCSOUFMC EQU   NCSPLFL2                                                 06299000
NCSPLRIO EQU   NCSPLFL2                                                 06300000
NCSPLRSF EQU   NCSPLFL2                                                 06301000
NCSPLVDP EQU   NCSPLFL2                                                 06302000
NCSPLPOS EQU   NCSPLFL1                                                 06303000
NCSPL2CN EQU   NCSPLFL1                                                 06304000
NCSPLAPU EQU   NCSPLFL1                                                 06305000
NCSPLNON EQU   NCSPLFL1                                                 06306000
NCSPLREQ EQU   NCSPLFL1                                                 06307000
NCSPLEBN EQU   NCSPLFL1                                                 06308000
NCSPL2IN EQU   NCSPLFL1                                                 06309000
NCSPLRCR EQU   ISTNCSPL+172                                             06310000
NCSPLECB EQU   ISTNCSPL+164                                             06311000
NCSPLDAF EQU   NCSPLCID+2                                               06312000
NCSPLSAF EQU   NCSPLCID                                                 06313000
NCSPLRCD EQU   NCSPLRAD+1                                               06314000
NCSLSCMD EQU   NCSPLRAD                                                 06315000
NCSPLWRF EQU   ISTNCSPL+72                                              06316000
NCSPLWRE EQU   ISTNCSPL+68                                              06317000
NCSSTCMD EQU   NCSCRFLG                                                 06318000
NCSUSRNF EQU   NCSCRFLG                                                 06319000
NCSOPRQU EQU   NCSCRFLG                                                 06320000
NCSCRDSE EQU   NCSCRFLG                                                 06321000
NCSFMERP EQU   NCSCRFLG                                                 06322000
NCSFMCLD EQU   NCSCRFLG                                                 06323000
NCSPLCLD EQU   NCSCRFLG                                                 06324000
NCSPLWRM EQU   NCSCRFLG                                                 06325000
NCSMSGSP EQU   ISTNCSPL+63                                              06326000
NCSNCPEP EQU   ISTNCSPL+62                                              06327000
NCSCMDB  EQU   NCSPLCMD+1                                               06328000
@NM00009 EQU   NCSCMDA                                                  06329000
NCSPLUFM EQU   NCSCMDA                                                  06330000
NCSPLFLO EQU   NCSCMDA                                                  06331000
NCSPLSYN EQU   NCSCMDA                                                  06332000
NCSPLCTL EQU   NCSCMDA                                                  06333000
NCSPLSYS EQU   NCSCMDA                                                  06334000
NCSPLLPT EQU   ISTNCSPL+56                                              06335000
NCSCRPID EQU   ISTNCSPL+51                                              06336000
NCSDLID  EQU   ISTNCSPL+44                                              06337000
NCSPLLID EQU   ISTNCSPL+36                                              06338000
NCSPLRID EQU   ISTNCSPL+28                                              06339000
NCSRRNPT EQU   ISTNCSPL+24                                              06340000
NCSIORC  EQU   ISTNCSPL+23                                              06341000
NCSPRMRC EQU   ISTNCSPL+22                                              06342000
NCSOVFMC EQU   NCSPLVF1                                                 06343000
NCSRSV02 EQU   NCSPLVFL                                                 06344000
NCSDACLK EQU   NCSPLVFL                                                 06345000
NCSABCON EQU   NCSPLVFL                                                 06346000
NCSDCONT EQU   NCSPLVFL                                                 06347000
NCSVSTAT EQU   NCSPLVFL                                                 06348000
NCSVDEL  EQU   NCSPLVFL                                                 06349000
NCSVNCSA EQU   NCSPLVFL                                                 06350000
NCSVBF16 EQU   NCSPLVBF+1                                               06351000
NCSVBF15 EQU   NCSPLVBF+1                                               06352000
NCSVBF14 EQU   NCSPLVBF+1                                               06353000
NCSVBF13 EQU   NCSPLVBF+1                                               06354000
NCSVBF12 EQU   NCSPLVBF+1                                               06355000
NCSVBF11 EQU   NCSPLVBF+1                                               06356000
NCSVBF10 EQU   NCSPLVBF+1                                               06357000
NCSVBF09 EQU   NCSPLVBF+1                                               06358000
NCSVBF08 EQU   NCSPLVBF                                                 06359000
NCSVBF07 EQU   NCSPLVBF                                                 06360000
NCSVBF06 EQU   NCSPLVBF                                                 06361000
NCSVBF05 EQU   NCSPLVBF                                                 06362000
NCSVBF04 EQU   NCSPLVBF                                                 06363000
NCSVBF03 EQU   NCSPLVBF                                                 06364000
NCSVBF02 EQU   NCSPLVBF                                                 06365000
NCSVBF01 EQU   NCSPLVBF                                                 06366000
NCSPLVCD EQU   ISTNCSPL+17                                              06367000
@NM00008 EQU   ISTNCSPL+16                                              06368000
NCSCRWKA EQU   NCSPFX+12                                                06369000
@NM00007 EQU   NCSPFX                                                   06370000
PFXBCK   EQU   ISTPFX+12                                                06371000
PFXFWD   EQU   ISTPFX+8                                                 06372000
PFXLNG   EQU   ISTPFX+5                                                 06373000
PFXPRTY  EQU   ISTPFX+4                                                 06374000
PFXCBID  EQU   PFXID                                                    06375000
POHID    EQU   ISTPOHD+2                                                06376000
POHGEN   EQU   POHSTAT                                                  06377000
POHRREQ  EQU   POHSTAT                                                  06378000
POHRSVD2 EQU   POHSTAT                                                  06379000
POHCNTRL EQU   POHSTAT                                                  06380000
POHLBL   EQU   POHSTAT                                                  06381000
POHDATA  EQU   POHSTAT                                                  06382000
POHEND   EQU   POHSTAT                                                  06383000
POHRSVD1 EQU   ISTPOHD                                                  06384000
RPHNEXPO EQU   ISTRPH+104                                               06385000
RPHSAV16 EQU   RPHWORK+60                                               06386000
RPHSAV15 EQU   RPHWORK+56                                               06387000
RPHSAV14 EQU   RPHWORK+52                                               06388000
RPHSAV13 EQU   RPHWORK+48                                               06389000
RPHSAV12 EQU   RPHWORK+44                                               06390000
RPHSAV11 EQU   RPHWORK+40                                               06391000
RPHSAV10 EQU   RPHWORK+36                                               06392000
RPHSAVE9 EQU   RPHWORK+32                                               06393000
RPHSAVE8 EQU   RPHWORK+28                                               06394000
RPHSAVE7 EQU   RPHWORK+24                                               06395000
RPHSAVE6 EQU   RPHWORK+20                                               06396000
RPHSAVE5 EQU   RPHWORK+16                                               06397000
RPHSAVE4 EQU   RPHWORK+12                                               06398000
RPHSAVE3 EQU   RPHWORK+8                                                06399000
RPHSAVE2 EQU   RPHWORK+4                                                06400000
RPHSHALF EQU   RPHSAVE1+2                                               06401000
RPHSBIT8 EQU   RPHSBITS                                                 06402000
RPHSBIT7 EQU   RPHSBITS                                                 06403000
RPHSBIT6 EQU   RPHSBITS                                                 06404000
RPHSBIT5 EQU   RPHSBITS                                                 06405000
RPHSBIT4 EQU   RPHSBITS                                                 06406000
RPHSBIT3 EQU   RPHSBITS                                                 06407000
RPHSBIT2 EQU   RPHSBITS                                                 06408000
RPHSBIT1 EQU   RPHSBITS                                                 06409000
RPHSBYTE EQU   RPHSAVE1                                                 06410000
RPHPABQP EQU   RPHPABQA+1                                               06411000
RPHPABFG EQU   RPHPABQA                                                 06412000
RPHSRP34 EQU   RPHSRPRM+2                                               06413000
RPHSRP12 EQU   RPHSRPRM                                                 06414000
RPHWEGT  EQU   RPHCSPA                                                  06415000
RPHMAJCB EQU   ISTRPH+21                                                06416000
RPHPABOF EQU   ISTRPH+20                                                06417000
RPHRESUM EQU   RPHRESMA+1                                               06418000
RPHRSV01 EQU   RPHWPFLG                                                 06419000
RPHPURGE EQU   RPHWPFLG                                                 06420000
RPHPT    EQU   RPHWPFLG                                                 06421000
RPHWT    EQU   RPHWPFLG                                                 06422000
RPHRSKEY EQU   RPHWPFLG                                                 06423000
RPHDVTA  EQU   ISTRPH+12                                                06424000
RPHTIK   EQU   RPHTSKID+3                                               06425000
@NM00005 EQU   RPHTSKID                                                 06426000
RPHRPHAP EQU   RPHRPHA+1                                                06427000
@NM00004 EQU   RPHRPHA                                                  06428000
RPHGATE  EQU   RPHRPHA                                                  06429000
@NM00003 EQU   RPHFLGB                                                  06430000
RPHRLCRA EQU   RPHFLGB                                                  06431000
RPHNRSAV EQU   RPHFLGB                                                  06432000
RPHPGCMP EQU   RPHFLGB                                                  06433000
RPHFBAPS EQU   RPHFLGB                                                  06434000
RPHBSSP  EQU   RPHFLGB                                                  06435000
RPHLOCK  EQU   RPHFLGB                                                  06436000
RPHFNFLG EQU   RPHFSTLC                                                 06437000
RPHMLTCP EQU   RPHFLAGS                                                 06438000
RPHSMCLR EQU   RPHFLAGS                                                 06439000
RPHSMTYP EQU   RPHFLAGS                                                 06440000
RPHSMQ   EQU   RPHFLAGS                                                 06441000
RPHAUTEX EQU   RPHAPTYP                                                 06442000
RPHSPGIN EQU   RPHFLAGS                                                 06443000
RPHOGIND EQU   RPHFLAGS                                                 06444000
RPHLNGTH EQU   RPHCNTL+1                                                06445000
RPHTYPE  EQU   RPHCNTL                                                  06446000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      06447000
@RC00099 EQU   @RC00088                                                 06448000
@RC00094 EQU   @RC00088                                                 06449000
@RC00089 EQU   @RC00088                                                 06450000
@RC00123 EQU   @RC00122                                                 06451000
@RC00317 EQU   @RC00245                                                 06452000
@RF00127 EQU   @RC00123                                                 06453000
@ENDDATA EQU   *                                                        06454000
         END   ISTINCVN,(C'PLS0127',0701,76339)                         06455000
