         TITLE 'ISTIC008,ADD - ADDS A NEW CDS TO LIBRARY               *00001000
                        '                                               00002000
ISTIC008 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTIC008  76.244'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @11,0                                               0001 00012000
@PSTART  DS    0H                                                  0001 00013000
         USING @PSTART,@11                                         0001 00014000
         ST    @13,@SA00001+4                                      0001 00015000
         LA    @12,@SA00001                                        0001 00016000
         ST    @12,8(,@13)                                         0001 00017000
         LR    @13,@12                                             0001 00018000
         EJECT                                                          00019000
OPENFLAG EQU  48                                                        00020000
GOODOPEN EQU  16                                                        00021000
         EJECT                                                          00022000
I008C01  DS    0H                                                  0069 00023000
*   I008CWK=$LOWADDR;               /* SET UP BASE FOR WK AREA       */ 00024000
         L     @15,$LOWADDR(,WAPTR)                                0069 00025000
         ST    @15,I008CWK                                         0069 00026000
*   CDSWKPTR=I008CWK+80;            /* SET UP BASE FOR CDS WK AREA   */ 00027000
         AH    @15,@CH00078                                        0070 00028000
         ST    @15,CDSWKPTR                                        0070 00029000
*   IF $REMSW='1'B                  /* IF THIS IS A REMOTE REQ       */ 00030000
*     THEN                                                         0071 00031000
         TM    $REMSW(WAPTR),B'01000000'                           0071 00032000
         BNO   @RF00071                                            0071 00033000
*     DO;                                                          0072 00034000
*       CDSSYMB='1'B;               /* TURN ON SYMBOLIC NAME BIT     */ 00035000
*       CDSREMSY='1'B;              /* TURN ON REMOTE FLAG           */ 00036000
         OI    CDSSYMB(@15),B'00001010'                            0074 00037000
*     END;                                                         0075 00038000
*   ELSE                                                           0076 00039000
*     DO;                                                          0076 00040000
         B     @RC00071                                            0076 00041000
@RF00071 DS    0H                                                  0077 00042000
*       CDSSYMBN(1:8)='';           /* BLANK OUT SYMBOLIC NME AREA   */ 00043000
         L     @15,CDSWKPTR                                        0077 00044000
         MVI   CDSSYMBN(@15),C' '                                  0077 00045000
         MVC   CDSSYMBN+1(7,@15),CDSSYMBN(@15)                     0077 00046000
*     END;                                                         0078 00047000
*I008C01A:                                                         0079 00048000
*   DCL                                                            0079 00049000
*     1 ZZZGTPRM BDY(WORD),         /* GETCONFG PARAMETER LIST       */ 00050000
*      2 * CHAR(4) INIT('0102F1F6'X),                              0079 00051000
*      2 ZZZGTCD PTR,               /* POINTER TO BASIC CDS INFO     */ 00052000
*      2 ZZZGTAD PTR,               /* POINTER TO RECEIVING BUFFER   */ 00053000
*      2 ZZZGTCT FIXED(8);          /* NUMBER OF CDS BYTES NEEDED    */ 00054000
@RC00071 DS    0H                                                  0079 00055000
I008C01A DS    0H                                                  0080 00056000
*   ZZZGTAD=ADDR(CDSUA);            /* POINTER TO RECEIVING BUFFER   */ 00057000
         L     @15,CDSWKPTR                                        0080 00058000
         ST    @15,ZZZGTAD                                         0080 00059000
*   ZZZGTCD=ADDR(CDSUA);            /* POINTER TO BASIC CDS INFO     */ 00060000
         ST    @15,ZZZGTCD                                         0081 00061000
*   ZZZGTCT=20;                     /* NUMBER OF BYTES NEEDED        */ 00062000
         MVI   ZZZGTCT,X'14'                                       0082 00063000
*   R1=ADDR(ZZZGTPRM);              /* POINT TO THE PARM LIST        */ 00064000
         LA    R1,ZZZGTPRM                                         0083 00065000
*   CALL ISTSC029;                  /* CALL THE GETCONFG FUNCTION    */ 00066000
         L     @15,@CV00788                                        0084 00067000
         BALR  @14,@15                                             0084 00068000
*   IF R15=12 THEN                  /* IF NAME DOES NOT EXIST        */ 00069000
         CH    R15,@CH00236                                        0085 00070000
         BE    @RT00085                                            0085 00071000
*     GOTO I008C01B;                /* THEN ADD T                    */ 00072000
*                                                                  0086 00073000
*   /*****************************************************************/ 00074000
*   /*                                                               */ 00075000
*   /* TCEC MSGN(576)MSGMSK('80000000'X) INVOKED                     */ 00076000
*   /*                                                               */ 00077000
*   /*****************************************************************/ 00078000
*                                                                  0087 00079000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00080000
         OI    $TCECM(WAPTR),B'00000001'                           0087 00081000
*   R1=ADDR($TCA10);                /* SET UP PARM LIST $TR          */ 00082000
         LA    R1,$TCA10                                           0088 00083000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00084000
         L     @15,@CV00791                                        0089 00085000
         BALR  @14,@15                                             0089 00086000
*   DCL                                                            0090 00087000
*     1 $TCA10,                     /* TCEC PARM LIST                */ 00088000
*      2 $TCB10 FIXED(32) INIT(576),/* MSG NUMBER                    */ 00089000
*      2 $TCC10 FIXED(32) INIT(0),  /* INCT LEN                      */ 00090000
*      2 $TCD10 BIT(8) INIT('00000000'B),/* FLAG                     */ 00091000
*      2 $TCE10 CHAR(4) INIT('80000000'X);/* MSSAGE MASK CDS ALREADY    00092000
*                                      EXISTS                        */ 00093000
*   GOTO I008CRET;                  /* RETURN TO CONTROL MODULE      */ 00094000
         B     I008CRET                                            0091 00095000
*I008C01B:                                                         0092 00096000
*   R1=ADDR(CDSEXARA);              /* PTR TO EXTRA CDS AREA         */ 00097000
I008C01B L     @15,CDSWKPTR                                        0092 00098000
         LA    R1,CDSEXARA(,@15)                                   0092 00099000
*   R5=ADDR(CDSMODEL);              /* PTR TO MODEL FLD              */ 00100000
         LA    R5,CDSMODEL(,@15)                                   0093 00101000
*   GEN;                                                           0094 00102000
*                                       /*                              00103000
         XC    0(8,R5),0(R5)              ZERO M,F,C,T,BC, + FLG FLD    00104000
         XC    0(235,R1),0(R1)            ZERO OUT CDS AREA          */ 00105000
*I008C02:                                                          0095 00106000
*   CALL ISTIC00A;                  /* GO CONFIGURE DATA SET         */ 00107000
I008C02  L     @15,@CV00802                                        0095 00108000
         BALR  @14,@15                                             0095 00109000
*   IF $REMSW='1'B                  /* IF THIS IS A REMOTE REQUEST   */ 00110000
*     THEN                                                         0096 00111000
         TM    $REMSW(WAPTR),B'01000000'                           0096 00112000
         BNO   @RF00096                                            0096 00113000
*     DO;                           /* IF THE SYMBOLIC BIT ANDTHE    */ 00114000
*       IF CDSSYMB='1'B&CDSREMSY='1'B&CDSSYMBN(1:1)^=BLANK THEN    0098 00115000
         L     @15,CDSWKPTR                                        0098 00116000
         TM    CDSSYMB(@15),B'00001010'                            0098 00117000
         BNO   @RF00098                                            0098 00118000
         CLC   CDSSYMBN(1,@15),BLANK                               0098 00119000
         BNE   @RT00098                                            0098 00120000
*         GOTO I008C03;             /* REMOTE BIT ARE ON ITS OK AND     00121000
*                                      THERE IS A SYMBOLIC NME       */ 00122000
*       GOTO I008C02A;              /* OTHERWISE ITS AN ERROR        */ 00123000
         B     I008C02A                                            0100 00124000
*     END;                                                         0101 00125000
*   ELSE                            /* IF ITS NOT A REMOTE REQUEST   */ 00126000
*     DO;                           /* AND THE SYMBOLIC BIT IS ON    */ 00127000
@RF00096 DS    0H                                                  0103 00128000
*       IF CDSSYMB='1'B             /* AND THERE IS A SYMBOLIC NME   */ 00129000
*         THEN                                                     0103 00130000
         L     @15,CDSWKPTR                                        0103 00131000
         TM    CDSSYMB(@15),B'00001000'                            0103 00132000
         BNO   @RF00103                                            0103 00133000
*         DO;                                                      0104 00134000
*           IF CDSSYMBN^=BLANK THEN                                0105 00135000
         CLC   CDSSYMBN(1,@15),BLANK                               0105 00136000
         BNE   @RT00105                                            0105 00137000
*             GOTO I008C03;         /* IT OK-CONTINUE                */ 00138000
*           GOTO I008C02A;          /* INVALID SYM NME OF FLAG       */ 00139000
         B     I008C02A                                            0107 00140000
*         END;                                                     0108 00141000
*       ELSE                        /* IF SYMBOLIC BIT IS OFF        */ 00142000
*         GOTO I008C03;             /* OK-CONTINUE ON                */ 00143000
*     END;                                                         0110 00144000
*I008C02A:                                                         0111 00145000
*                                                                  0111 00146000
*   /*****************************************************************/ 00147000
*   /*                                                               */ 00148000
*   /* TCEC MSGN(581)MSGMSK('00400000'X) INVOKED                     */ 00149000
*   /*                                                               */ 00150000
*   /*****************************************************************/ 00151000
*                                                                  0111 00152000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00153000
I008C02A OI    $TCECM(WAPTR),B'00000001'                           0111 00154000
*   R1=ADDR($TCA11);                /* SET UP PARM LIST $TR          */ 00155000
         LA    R1,$TCA11                                           0112 00156000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00157000
         L     @15,@CV00791                                        0113 00158000
         BALR  @14,@15                                             0113 00159000
*   DCL                                                            0114 00160000
*     1 $TCA11,                     /* TCEC PARM LIST                */ 00161000
*      2 $TCB11 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00162000
*      2 $TCC11 FIXED(32) INIT(0),  /* INCT LEN                      */ 00163000
*      2 $TCD11 BIT(8) INIT('00000000'B),/* FLAG                     */ 00164000
*      2 $TCE11 CHAR(4) INIT('00400000'X);/* MSSAGE MASK INV SYM NME    00165000
*                                      OR FLAG                       */ 00166000
*   GOTO I008C02;                   /* GO RE-CONFIGURE               */ 00167000
         B     I008C02                                             0115 00168000
*I008C03:                                                          0116 00169000
*   IF $REMSW^='1'B THEN            /* IF THIS IS NOT A REMOTE REQ   */ 00170000
I008C03  TM    $REMSW(WAPTR),B'01000000'                           0116 00171000
         BO    @RF00116                                            0116 00172000
*     UASW='1'B;                    /* THEN TURN ON UNIT ADDR SW     */ 00173000
         L     @15,I008CWK                                         0117 00174000
         OI    UASW(@15),B'00001000'                               0117 00175000
*   IF CLASSSW='1'B&TYPESW='1'B&FLAGSW='1'B&UASW='1'B THEN/* IF ALL     00176000
*                                      THE REQ SW ARE                */ 00177000
@RF00116 L     @15,I008CWK                                         0118 00178000
         TM    CLASSSW(@15),B'01111000'                            0118 00179000
         BNO   @RF00118                                            0118 00180000
*     DO;                           /* SET THEN DO THE FOLLOWING     */ 00181000
*       CLASSSW='0'B;               /* RESET CLASS REQUIRED SW       */ 00182000
*       TYPESW='0'B;                /* RESET TYPE REQUIRED SW        */ 00183000
*       FLAGSW='0'B;                /* RESET FLAG REQUIRED SW        */ 00184000
*       UASW='0'B;                  /* RESET UNIT ADR REQUIRED SW    */ 00185000
         NI    CLASSSW(@15),B'10000111'                            0123 00186000
*     END;                                                         0124 00187000
*   ELSE                            /* OTHERWISE PRINT               */ 00188000
*     DO;                           /* ERROR MSG                     */ 00189000
*                                                                  0125 00190000
         B     @RC00118                                            0125 00191000
@RF00118 DS    0H                                                  0126 00192000
*       /*************************************************************/ 00193000
*       /*                                                           */ 00194000
*       /* TCEC MSGN(581)MSGMSK('00200000'X) INVOKED                 */ 00195000
*       /*                                                           */ 00196000
*       /*************************************************************/ 00197000
*                                                                  0126 00198000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00199000
         OI    $TCECM(WAPTR),B'00000001'                           0126 00200000
*       R1=ADDR($TCA12);            /* SET UP PARM LIST $TR          */ 00201000
         LA    R1,$TCA12                                           0127 00202000
*       CALL S20CEC03;              /* CALL TCEC-MULTIPLE LN         */ 00203000
         L     @15,@CV00791                                        0128 00204000
         BALR  @14,@15                                             0128 00205000
*       DCL                                                        0129 00206000
*         1 $TCA12,                 /* TCEC PARM LIST                */ 00207000
*          2 $TCB12 FIXED(32) INIT(581),/* MSG NUMBER                */ 00208000
*          2 $TCC12 FIXED(32) INIT(0),/* INCT LEN                    */ 00209000
*          2 $TCD12 BIT(8) INIT('00000000'B),/* FLAG                 */ 00210000
*          2 $TCE12 CHAR(4) INIT('00200000'X);/* MSSAGE MASK INVALID    00211000
*                                      REQ FLD                       */ 00212000
*       GOTO I008C02;               /* RE-CONFIGURE REQ FLD ONLY     */ 00213000
         B     I008C02                                             0130 00214000
*     END;                                                         0131 00215000
*   IF $REMSW='1'B THEN             /* IF REMOTE REQUEST THEN GO     */ 00216000
@RC00118 TM    $REMSW(WAPTR),B'01000000'                           0132 00217000
         BO    @RT00132                                            0132 00218000
*     GOTO I008CADR;                /* ADD REMOTE DATA SET TO PDS    */ 00219000
*   GOTO I008CADL;                  /* OTHERWISE ADD LOCAL TO PDS    */ 00220000
         B     I008CADL                                            0134 00221000
*   GEN(EJECT);                                                    0135 00222000
*                                                                  0135 00223000
         EJECT                                                          00224000
*/********************************************************************/ 00225000
*/*                                                                  */ 00226000
*/* A D D  R E M O T E  C D S  T O  P D S                            */ 00227000
*/*                                                                  */ 00228000
*/********************************************************************/ 00229000
*                                                                  0136 00230000
*I008CADR:                                                         0136 00231000
*   GEN;                                                           0136 00232000
I008CADR DS    0H                                                  0136 00233000
*                                       /*                              00234000
         OPEN  (REMCDS,(OUTPUT))          OPEN REMOTE DATA SET          00235000
         LA    WKREG1,REMCDS              SET UP BASE                   00236000
         TM    OPENFLAG(WKREG1),GOODOPEN  WAS OPEN OK                   00237000
         BZ    I008CER1                   NO-BR + PRT OPEN ERROR     */ 00238000
*   ESDNME1=CDSSYMBN;               /* MOVE NAME TO CDS ESD REC      */ 00239000
         L     @15,CDSWKPTR                                        0137 00240000
         MVC   ESDNME1(8),CDSSYMBN(@15)                            0137 00241000
*   DCBPTR=ADDR(REMCDS);            /* SET UP DCB POINTER            */ 00242000
         LA    DCBPTR,REMCDS                                       0138 00243000
*   GEN(BAL LINKR,I008CWRT);        /* GO WRITE MEMBER               */ 00244000
         BAL LINKR,I008CWRT                                             00245000
*   STOWNAME=CDSSYMBN;              /* MOVE NAME TO DIRECTY ENTRY    */ 00246000
         L     @15,CDSWKPTR                                        0140 00247000
         MVC   STOWNAME(8),CDSSYMBN(@15)                           0140 00248000
*   STOWTTR=TTRZSAVE(1:3);          /* PUT TTR OF MEMBER IN DIRCTY   */ 00249000
         MVC   STOWTTR(3),TTRZSAVE                                 0141 00250000
*   GEN;                                                           0142 00251000
*                                       /*                              00252000
         STOW  REMCDS,STOWCON,R           WRITE DIRECTORY ENTRY      */ 00253000
*   GOTO I008CKRC;                  /* GO CHECK RETURN CODES         */ 00254000
         B     I008CKRC                                            0143 00255000
*   GEN(EJECT);                                                    0144 00256000
         EJECT                                                          00257000
*                                                                  0145 00258000
*/********************************************************************/ 00259000
*/*                                                                  */ 00260000
*/* A D D  L O C A L  C D S  T O  P D S                              */ 00261000
*/*                                                                  */ 00262000
*/********************************************************************/ 00263000
*                                                                  0145 00264000
*I008CADL:                                                         0145 00265000
*   GEN;                                                           0145 00266000
I008CADL DS    0H                                                  0145 00267000
*                                       /*                              00268000
         OPEN  (LOCCDS,(OUTPUT))          OPEN LOCAL DATA SET           00269000
         LA    WKREG1,LOCCDS              SET UP BASE                   00270000
         TM    OPENFLAG(WKREG1),GOODOPEN  WAS OPEN OK                   00271000
         BZ    I008CE1A                   NO-BR + PRT OPEN ERROR     */ 00272000
*   DCBPTR=ADDR(LOCCDS);            /* SET UP PTR TO DCB CONVERT UNIT   00273000
*                                      ADDR TO EBCDIC                */ 00274000
*                                                                  0146 00275000
         LA    DCBPTR,LOCCDS                                       0146 00276000
*   /*****************************************************************/ 00277000
*   /*                                                               */ 00278000
*   /* ITACONV FROM(CDSUA)TO(WKAREA)COUNT(4)TYPE(HE) INVOKED         */ 00279000
*   /*                                                               */ 00280000
*   /*****************************************************************/ 00281000
*                                                                  0147 00282000
*   DCL                                                            0147 00283000
*     1 ITATCPRM BDY(WORD),         /* CONVERT PARAMETER LIST        */ 00284000
*      2 * CHAR(4) INIT('0102F4F1'X),                              0147 00285000
*      2 ITATCFR PTR,               /* ADDRESS OF FROM FIELD         */ 00286000
*      2 ITATCTO PTR,               /* ADDRESS OF TO FIELD           */ 00287000
*      2 * BIT(8) INIT(0),          /* FLAGS FOR CONVERT MODULE      */ 00288000
*       3 ITATCTP BIT(1),           /* TYPE OF CONVERT REQUIRED      */ 00289000
*      2 ITATCNT FIXED(8);          /* NUMBER OF BYTES TO CONVERT    */ 00290000
*   ITATCFR=ADDR(CDSUA);            /* SET THE FROM ADDRESS          */ 00291000
         MVC   ITATCFR(4),CDSWKPTR                                 0148 00292000
*   ITATCTO=ADDR(WKAREA);           /* SET THE TO ADDRESS            */ 00293000
         LA    @15,WKAREA                                          0149 00294000
         ST    @15,ITATCTO                                         0149 00295000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00296000
         OI    ITATCTP,B'10000000'                                 0150 00297000
*   ITATCNT=4;                      /* GIVE THE CONVERT BYTE COUNT   */ 00298000
         MVI   ITATCNT,X'04'                                       0151 00299000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00300000
         LA    R1,ITATCPRM                                         0152 00301000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00302000
         L     @15,@CV00835                                        0153 00303000
         BALR  @14,@15                                             0153 00304000
*   GEN(MVC   WKAREA(1),UANAME);    /* BUILD UNIT ADDR NAME          */ 00305000
         MVC   WKAREA(1),UANAME                                         00306000
*   ESDNME1=WKAREA;                 /* SET UP ESD NAME               */ 00307000
         MVC   ESDNME1(8),WKAREA                                   0155 00308000
*   GEN(BAL LINKR,I008CWRT);        /* GO WRT MEMBER                 */ 00309000
         BAL LINKR,I008CWRT                                             00310000
*   STOWNAME=WKAREA;                /* MOVE NAME TO DIRCTY ENTRY     */ 00311000
         MVC   STOWNAME(8),WKAREA                                  0157 00312000
*   STOWTTR=TTRZSAVE(1:3);          /* PUT TTR OF MEMBER IN DIRCTY   */ 00313000
         MVC   STOWTTR(3),TTRZSAVE                                 0158 00314000
*   GEN;                                                           0159 00315000
*                                       /*                              00316000
         STOW  LOCCDS,STOWCON,R           WRITE DIRECTORY ENTRY      */ 00317000
*   GOTO I008CKRC;                  /* GO CHECK RETURN CODES         */ 00318000
         B     I008CKRC                                            0160 00319000
*   GEN(EJECT);                                                    0161 00320000
         EJECT                                                          00321000
*I008CKRC:                                                         0162 00322000
*   IF R15=12 THEN                  /* IF RET CODE EQUAL 12 THEN     */ 00323000
I008CKRC LA    @12,12                                              0162 00324000
         CR    R15,@12                                             0162 00325000
         BE    @RT00162                                            0162 00326000
*     GOTO I008CER2;                /* GO PRINT ERROR -NO SPACE      */ 00327000
*   IF R15>12 THEN                  /* IF RET CODE IS GREATER 12     */ 00328000
         CR    R15,@12                                             0164 00329000
         BH    @RT00164                                            0164 00330000
*     GOTO I008CER3;                /* THEN GO PRT I/O ERROR         */ 00331000
*                                                                  0165 00332000
*   /*****************************************************************/ 00333000
*   /*                                                               */ 00334000
*   /* TCEC MSGN(562) INVOKED                                        */ 00335000
*   /*                                                               */ 00336000
*   /*****************************************************************/ 00337000
*                                                                  0166 00338000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00339000
         OI    $TCECM(WAPTR),B'00000001'                           0166 00340000
*   R1=ADDR($TCA14);                /* SET UP PARM LIST $TR          */ 00341000
         LA    R1,$TCA14                                           0167 00342000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00343000
         L     @15,#EXITA(,WAPTR)                                  0168 00344000
         BALR  @14,@15                                             0168 00345000
*   DCL                                                            0169 00346000
*     1 $TCA14,                     /* TCEC PARM LIST                */ 00347000
*      2 $TCB14 FIXED(32) INIT(562),/* MSG NUMBER                    */ 00348000
*      2 $TCC14 FIXED(32) INIT(0),  /* INCT LEN                      */ 00349000
*      2 $TCD14 BIT(8) INIT('00000000'B),/* FLAG                     */ 00350000
*      2 $TCE14 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK CDS ADDED TO   00351000
*                                      LIBRARY                       */ 00352000
*   GOTO I008CRET;                  /* RETURN TO CONTROL MODULE      */ 00353000
         B     I008CRET                                            0170 00354000
*   GEN(EJECT);                                                    0171 00355000
         EJECT                                                          00356000
*I008CER1:                                                         0172 00357000
*   $INBUFR=CDSSYMBN;               /* SET UP SYMBOLIC NAME          */ 00358000
I008CER1 MVI   $INBUFR+8(WAPTR),C' '                               0172 00359000
         MVC   $INBUFR+9(71,WAPTR),$INBUFR+8(WAPTR)                0172 00360000
         L     @15,CDSWKPTR                                        0172 00361000
         MVC   $INBUFR(8,WAPTR),CDSSYMBN(@15)                      0172 00362000
*   GOTO I008CE1B;                                                 0173 00363000
         B     I008CE1B                                            0173 00364000
*I008CE1A:                                                         0174 00365000
*   $INBUFR=CDSLOCDD;               /* SET UP LOC DCB NAME           */ 00366000
I008CE1A MVI   $INBUFR+8(WAPTR),C' '                               0174 00367000
         MVC   $INBUFR+9(71,WAPTR),$INBUFR+8(WAPTR)                0174 00368000
         MVC   $INBUFR(8,WAPTR),CDSLOCDD                           0174 00369000
*I008CE1B:                                                         0175 00370000
*                                                                  0175 00371000
*   /*****************************************************************/ 00372000
*   /*                                                               */ 00373000
*   /* TCEC MSGN(901)SUB(YES) INVOKED                                */ 00374000
*   /*                                                               */ 00375000
*   /*****************************************************************/ 00376000
*                                                                  0175 00377000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00378000
I008CE1B OI    $TCECM(WAPTR),B'00000001'                           0175 00379000
*   R1=ADDR($TCA15);                /* SET UP PARM LIST $TR          */ 00380000
         LA    R1,$TCA15                                           0176 00381000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00382000
         L     @15,#EXITA(,WAPTR)                                  0177 00383000
         BALR  @14,@15                                             0177 00384000
*   DCL                                                            0178 00385000
*     1 $TCA15,                     /* TCEC PARM LIST                */ 00386000
*      2 $TCB15 FIXED(32) INIT(901),/* MSG NUMBER                    */ 00387000
*      2 $TCC15 FIXED(32) INIT(0),  /* INCT LEN                      */ 00388000
*      2 $TCD15 BIT(8) INIT('10000000'B),/* FLAG                     */ 00389000
*      2 $TCE15 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK XXXXX DD  0178 00390000
*                                      FAILED TO OPEN                */ 00391000
*   GOTO I008CRET;                  /* RETURN TO CALLER              */ 00392000
         B     I008CRET                                            0179 00393000
*I008CER2:                                                         0180 00394000
*                                                                  0180 00395000
*   /*****************************************************************/ 00396000
*   /*                                                               */ 00397000
*   /* TCEC MSGN(571) INVOKED                                        */ 00398000
*   /*                                                               */ 00399000
*   /*****************************************************************/ 00400000
*                                                                  0180 00401000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00402000
I008CER2 OI    $TCECM(WAPTR),B'00000001'                           0180 00403000
*   R1=ADDR($TCA16);                /* SET UP PARM LIST $TR          */ 00404000
         LA    R1,$TCA16                                           0181 00405000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00406000
         L     @15,#EXITA(,WAPTR)                                  0182 00407000
         BALR  @14,@15                                             0182 00408000
*   DCL                                                            0183 00409000
*     1 $TCA16,                     /* TCEC PARM LIST                */ 00410000
*      2 $TCB16 FIXED(32) INIT(571),/* MSG NUMBER                    */ 00411000
*      2 $TCC16 FIXED(32) INIT(0),  /* INCT LEN                      */ 00412000
*      2 $TCD16 BIT(8) INIT('00000000'B),/* FLAG                     */ 00413000
*      2 $TCE16 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK LIBRARY FULL*/ 00414000
*   GOTO I008CRET;                                                 0184 00415000
         B     I008CRET                                            0184 00416000
*I008CER3:                                                         0185 00417000
*                                                                  0185 00418000
*   /*****************************************************************/ 00419000
*   /*                                                               */ 00420000
*   /* TCEC MSGN(570) INVOKED                                        */ 00421000
*   /*                                                               */ 00422000
*   /*****************************************************************/ 00423000
*                                                                  0185 00424000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00425000
I008CER3 OI    $TCECM(WAPTR),B'00000001'                           0185 00426000
*   R1=ADDR($TCA17);                /* SET UP PARM LIST $TR          */ 00427000
         LA    R1,$TCA17                                           0186 00428000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00429000
         L     @15,#EXITA(,WAPTR)                                  0187 00430000
         BALR  @14,@15                                             0187 00431000
*   DCL                                                            0188 00432000
*     1 $TCA17,                     /* TCEC PARM LIST                */ 00433000
*      2 $TCB17 FIXED(32) INIT(570),/* MSG NUMBER                    */ 00434000
*      2 $TCC17 FIXED(32) INIT(0),  /* INCT LEN                      */ 00435000
*      2 $TCD17 BIT(8) INIT('00000000'B),/* FLAG                     */ 00436000
*      2 $TCE17 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK I/O ERROR   */ 00437000
*   GOTO I008CRET;                  /* GO RETURN TO CALLER           */ 00438000
         B     I008CRET                                            0189 00439000
*   GEN(EJECT);                                                    0190 00440000
         EJECT                                                          00441000
*I008CRET:                                                         0191 00442000
*   GEN;                                                           0191 00443000
I008CRET DS    0H                                                  0191 00444000
*                                       /*                              00445000
         CLOSE REMCDS                     CLOSE REMOTE CDS              00446000
         CLOSE LOCCDS                     CLOSE LOCAL CDS            */ 00447000
*   I008CSW='0'X;                   /* ZERO OUT INTERNAL SW          */ 00448000
         L     @15,I008CWK                                         0192 00449000
         MVI   I008CSW(@15),X'00'                                  0192 00450000
*   $REMSW='0'B;                    /* RESET REMOTE SWITCH           */ 00451000
         NI    $REMSW(WAPTR),B'10111111'                           0193 00452000
*   RETURN;                         /* RETURN TO CONTROL MODULE      */ 00453000
@EL00001 L     @13,4(,@13)                                         0194 00454000
@EF00001 DS    0H                                                  0194 00455000
@ER00001 L     @14,12(,@13)                                        0194 00456000
         LM    @00,@12,20(@13)                                     0194 00457000
         BR    @14                                                 0194 00458000
*   GEN(EJECT);                                                    0195 00459000
*                                                                  0195 00460000
         EJECT                                                          00461000
*/********************************************************************/ 00462000
*/*                      W R I T E  R O U T I N E                    */ 00463000
*/*                                                                  */ 00464000
*/*  THIS ROUTINE WILL WRITE THE ESD RECORD, TXTHDR RECORD, CDS      */ 00465000
*/*   RECORD AND THE END RECORD                                      */ 00466000
*/*                                                                  */ 00467000
*/********************************************************************/ 00468000
*                                                                  0196 00469000
*I008CWRT:                                                         0196 00470000
*   RETSAV=LINKR;                   /* SAVE RETURN ADDR PTR          */ 00471000
I008CWRT ST    LINKR,RETSAV                                        0196 00472000
*   ESDSIZE=CDSBYTCT;               /* PUT CDS BYTE COUNT IN ESD     */ 00473000
         L     @15,CDSWKPTR                                        0197 00474000
         SLR   @12,@12                                             0197 00475000
         IC    @12,CDSBYTCT(,@15)                                  0197 00476000
         STC   @12,ESDSIZE                                         0197 00477000
*   TXTHCNT(3:3)=CDSBYTCT;          /* PUT CDS BYTE CNT IN TXTHDR    */ 00478000
         STC   @12,TXTHCNT+2                                       0198 00479000
*   CDSRECL=CDSBYTCT;               /* SET UP CDSREC LEN FOR WRITE   */ 00480000
         STH   @12,CDSRECL                                         0199 00481000
*   IF $REMSW='1'B                  /* IF THIS A REMOTE ADD          */ 00482000
*     THEN                          /* THEN SET UP REMOTE ID         */ 00483000
         TM    $REMSW(WAPTR),B'01000000'                           0200 00484000
         BNO   @RF00200                                            0200 00485000
*     DO;                           /* IN THE #CTL ID                */ 00486000
*       ESDNME3(5:5)=REMOTEID;                                     0202 00487000
         MVC   ESDNME3+4(1),REMOTEID                               0202 00488000
*     END;                                                         0203 00489000
*   ELSE                            /* OTHERWISE SET UP A LOCAL      */ 00490000
*     DO;                           /* ID IN #CTL ID                 */ 00491000
         B     @RC00200                                            0204 00492000
@RF00200 DS    0H                                                  0205 00493000
*       ESDNME3(5:5)=LOCALID;                                      0205 00494000
         MVC   ESDNME3+4(1),LOCALID                                0205 00495000
*     END;                                                         0206 00496000
*   GEN;                                                           0207 00497000
@RC00200 DS    0H                                                  0207 00498000
*                                       /*                              00499000
         WRITE CDSDECB,SF,(DCBPTR),ESDREC,80,MF=E  WRITE ESD RECORD     00500000
         CHECK CDSDECB                    WAIT FOR I/O COMPLETION       00501000
         NOTE  (DCBPTR)                   SAVE BEGINNING ADDRESS IN     00502000
         ST    PARMREG1,TTRZSAVE          CASE OF AN ERROR              00503000
         WRITE CDSDECB,SF,(DCBPTR),TXTHDR,80,MF=E  WRITE TXTHDR RECORD  00504000
         CHECK CDSDECB                    WAIT FOR I/O COMPLETION       00505000
*   CDSRPTR=ADDR(CDSUA);            /* GET ADDR IF CDS               */ 00506000
         L     CDSRPTR,CDSWKPTR                                    0208 00507000
*   GEN;                                                           0209 00508000
*                                       /*                              00509000
         LH CDSRLREG,CDSRECL              PUT CDS REC LN IN REG         00510000
         WRITE CDSDECB,SF,(DCBPTR),(CDSRPTR),(CDSRLREG),MF=E WRT CDSREC 00511000
         CHECK CDSDECB                    WAIT FOR I/O COMPLETION       00512000
         WRITE CDSDECB,SF,(DCBPTR),ENDREC,80,MF=E  WRITE END RECORD     00513000
         CHECK CDSDECB                    WAIT FOR I/O COMPLETION       00514000
         L     LINKR,RETSAV               RETURN TO                     00515000
         BR    LINKR                        CALLER                   */ 00516000
         EJECT                                                          00517000
*                                                                  0210 00518000
*/********************************************************************/ 00519000
*/*       D A T A  C O N T R O L  B L O C K S                        */ 00520000
*/********************************************************************/ 00521000
*                                                                  0210 00522000
*   GEN;                                                           0210 00523000
*                                                                  0210 00524000
REMCDS   DS    0F                                                       00525000
         DCB   DDNAME=SYMSYM,DSORG=PO,RECFM=UT,MACRF=(R,W),            X00526000
               LRECL=80,BLKSIZE=3600,SYNAD=I008CER3                     00527000
          SPACE                                                         00528000
LOCCDS   DS    0F                                                       00529000
         DCB   DDNAME=OLTCDSDD,DSORG=PO,RECFM=UT,MACRF=(R,W),          X00530000
               LRECL=80,BLKSIZE=3600,SYNAD=I008CER3                     00531000
          SPACE                                                         00532000
         WRITE CDSDECB,SF,MF=L                                          00533000
*/* ATDSPLY   INVOKED.                                               */ 00534000
*/********************************************************************/ 00535000
*/* THERE HAVE BEEN NO ATBUILD INCLUSIONS IN THIS COMPILATION.       */ 00536000
*/********************************************************************/ 00537000
*/* END OF ATDSPLY.                                                  */ 00538000
*                                                                  0211 00539000
*   END ISTIC008;                                                  0211 00540000
         B     @EL00001                                            0211 00541000
@DATA    DS    0H                                                       00542000
@CH00236 DC    H'12'                                                    00543000
@CH00078 DC    H'80'                                                    00544000
         DS    0F                                                       00545000
@SA00001 DS    18F                                                      00546000
         DS    0F                                                       00547000
@CV00788 DC    V(ISTSC029)                                              00548000
@CV00791 DC    V(S20CEC03)                                              00549000
@CV00802 DC    V(ISTIC00A)                                              00550000
@CV00835 DC    V(ISTSC021)                                              00551000
         DS    0D                                                       00552000
CDSWKPTR DS    A                                                        00553000
I008CWK  DS    A                                                        00554000
RCAPTR   DS    A                                                        00555000
CECMAP   DS    A                                                        00556000
RETSAV   DS    CL4                                                      00557000
BLANK    DC    CL1' '                                                   00558000
REMOTEID DC    CL1'D'                                                   00559000
LOCALID  DC    CL1'C'                                                   00560000
CDSLOCDD DC    CL8'OLTCDSDD'                                            00561000
         DS    CL1                                                      00562000
TTRZSAVE DS    CL4                                                      00563000
CDSRECL  DS    CL2                                                      00564000
WKAREA   DS    CL8                                                      00565000
UANAME   DC    CL1'G'                                                   00566000
STOWCON  DS    CL32                                                     00567000
         ORG   STOWCON                                                  00568000
STOWNAME DS    CL8                                                      00569000
STOWTTR  DS    CL3                                                      00570000
STOWUSSZ DC    X'0A'                                                    00571000
STOWUSRI DC    20X'00'                                                  00572000
         ORG   STOWCON+32                                               00573000
ESDREC   DS    CL80                                                     00574000
         ORG   ESDREC                                                   00575000
@NM00002 DC    X'02'                                                    00576000
@NM00003 DC    CL3'ESD'                                                 00577000
@NM00004 DC    CL6' '                                                   00578000
@NM00005 DC    X'0030'                                                  00579000
@NM00006 DC    CL2'  '                                                  00580000
@NM00007 DC    X'0001'                                                  00581000
ESDNME1  DS    CL8                                                      00582000
@NM00008 DC    X'00'                                                    00583000
         DC    XL3'0'                                                   00584000
@NM00009 DC    CL1' '                                                   00585000
@NM00010 DC    X'00'                                                    00586000
         DC    XL1'0'                                                   00587000
ESDSIZE  DS    CL1                                                      00588000
ESDNME2  DC    CL8'#OLT00  '                                            00589000
@NM00011 DC    X'02'                                                    00590000
@NM00012 DC    X'00'                                                    00591000
         DC    XL2'0'                                                   00592000
@NM00013 DC    CL4'    '                                                00593000
ESDNME3  DC    CL8'#CTLXXXX'                                            00594000
@NM00014 DC    X'02'                                                    00595000
@NM00015 DC    X'00'                                                    00596000
         DC    XL2'0'                                                   00597000
@NM00016 DC    CL16' '                                                  00598000
@NM00017 DC    CL4'0001'                                                00599000
         ORG   ESDREC+80                                                00600000
TXTHDR   DS    CL80                                                     00601000
         ORG   TXTHDR                                                   00602000
@NM00018 DC    X'02'                                                    00603000
@NM00019 DC    CL6'TXTHDR'                                              00604000
@NM00020 DC    CL9'VS TOLTEP'                                           00605000
TXTHCCW  DS    CL8                                                      00606000
         ORG   TXTHCCW                                                  00607000
@NM00021 DC    X'02'                                                    00608000
TXTHRADR DC    X'000000'                                                00609000
@NM00022 DC    X'20'                                                    00610000
TXTHCNT  DC    X'000000'                                                00611000
         ORG   TXTHDR+24                                                00612000
@NM00023 DC    CL56' '                                                  00613000
         ORG   TXTHDR+80                                                00614000
ENDREC   DS    CL80                                                     00615000
         ORG   ENDREC                                                   00616000
@NM00024 DC    X'02'                                                    00617000
@NM00025 DC    CL3'END'                                                 00618000
@NM00026 DC    X'00'                                                    00619000
         DC    XL75'0'                                                  00620000
         ORG   ENDREC+80                                                00621000
         DS    CL1                                                      00622000
ZZZGTPRM DS    CL13                                                     00623000
         ORG   ZZZGTPRM                                                 00624000
@NM00079 DC    X'0102F1F6'                                              00625000
ZZZGTCD  DS    AL4                                                      00626000
ZZZGTAD  DS    AL4                                                      00627000
ZZZGTCT  DS    FL1                                                      00628000
         ORG   ZZZGTPRM+13                                              00629000
         DS    CL3                                                      00630000
$TCA10   DS    CL13                                                     00631000
         ORG   $TCA10                                                   00632000
$TCB10   DC    A(576)                                                   00633000
$TCC10   DC    A(0)                                                     00634000
$TCD10   DC    B'00000000'                                              00635000
$TCE10   DC    X'80000000'                                              00636000
         ORG   $TCA10+13                                                00637000
         DS    CL3                                                      00638000
$TCA11   DS    CL13                                                     00639000
         ORG   $TCA11                                                   00640000
$TCB11   DC    A(581)                                                   00641000
$TCC11   DC    A(0)                                                     00642000
$TCD11   DC    B'00000000'                                              00643000
$TCE11   DC    X'00400000'                                              00644000
         ORG   $TCA11+13                                                00645000
         DS    CL3                                                      00646000
$TCA12   DS    CL13                                                     00647000
         ORG   $TCA12                                                   00648000
$TCB12   DC    A(581)                                                   00649000
$TCC12   DC    A(0)                                                     00650000
$TCD12   DC    B'00000000'                                              00651000
$TCE12   DC    X'00200000'                                              00652000
         ORG   $TCA12+13                                                00653000
         DS    CL3                                                      00654000
ITATCPRM DS    CL14                                                     00655000
         ORG   ITATCPRM                                                 00656000
@NM00080 DC    X'0102F4F1'                                              00657000
ITATCFR  DS    AL4                                                      00658000
ITATCTO  DS    AL4                                                      00659000
@NM00081 DC    AL1(0)                                                   00660000
         ORG   @NM00081                                                 00661000
ITATCTP  DS    BL1                                                      00662000
         ORG   ITATCPRM+13                                              00663000
ITATCNT  DS    FL1                                                      00664000
         ORG   ITATCPRM+14                                              00665000
         DS    CL2                                                      00666000
$TCA14   DS    CL13                                                     00667000
         ORG   $TCA14                                                   00668000
$TCB14   DC    A(562)                                                   00669000
$TCC14   DC    A(0)                                                     00670000
$TCD14   DC    B'00000000'                                              00671000
$TCE14   DC    X'FFFFFFFF'                                              00672000
         ORG   $TCA14+13                                                00673000
         DS    CL3                                                      00674000
$TCA15   DS    CL13                                                     00675000
         ORG   $TCA15                                                   00676000
$TCB15   DC    A(901)                                                   00677000
$TCC15   DC    A(0)                                                     00678000
$TCD15   DC    B'10000000'                                              00679000
$TCE15   DC    X'FFFFFFFF'                                              00680000
         ORG   $TCA15+13                                                00681000
         DS    CL3                                                      00682000
$TCA16   DS    CL13                                                     00683000
         ORG   $TCA16                                                   00684000
$TCB16   DC    A(571)                                                   00685000
$TCC16   DC    A(0)                                                     00686000
$TCD16   DC    B'00000000'                                              00687000
$TCE16   DC    X'FFFFFFFF'                                              00688000
         ORG   $TCA16+13                                                00689000
         DS    CL3                                                      00690000
$TCA17   DS    CL13                                                     00691000
         ORG   $TCA17                                                   00692000
$TCB17   DC    A(570)                                                   00693000
$TCC17   DC    A(0)                                                     00694000
$TCD17   DC    B'00000000'                                              00695000
$TCE17   DC    X'FFFFFFFF'                                              00696000
         ORG   $TCA17+13                                                00697000
         DS    CL3                                                      00698000
PATCH    DC    40F'0'                                                   00699000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00700000
@01      EQU   01                                                       00701000
@02      EQU   02                                                       00702000
@03      EQU   03                                                       00703000
@04      EQU   04                                                       00704000
@05      EQU   05                                                       00705000
@06      EQU   06                                                       00706000
@07      EQU   07                                                       00707000
@08      EQU   08                                                       00708000
@09      EQU   09                                                       00709000
@10      EQU   10                                                       00710000
@11      EQU   11                                                       00711000
@12      EQU   12                                                       00712000
@13      EQU   13                                                       00713000
@14      EQU   14                                                       00714000
@15      EQU   15                                                       00715000
WKREG1   EQU   @04                                                      00716000
CDSRPTR  EQU   @04                                                      00717000
DCBPTR   EQU   @05                                                      00718000
CDSRLREG EQU   @06                                                      00719000
LINKR    EQU   @14                                                      00720000
WAPTR    EQU   @02                                                      00721000
R1       EQU   @01                                                      00722000
R5       EQU   @05                                                      00723000
R15      EQU   @15                                                      00724000
PARMREG1 EQU   @01                                                      00725000
R0       EQU   @00                                                      00726000
R10      EQU   @10                                                      00727000
R11      EQU   @11                                                      00728000
R12      EQU   @12                                                      00729000
R13      EQU   @13                                                      00730000
R14      EQU   @14                                                      00731000
R2       EQU   @02                                                      00732000
R3       EQU   @03                                                      00733000
R4       EQU   @04                                                      00734000
R6       EQU   @06                                                      00735000
R7       EQU   @07                                                      00736000
R8       EQU   @08                                                      00737000
R9       EQU   @09                                                      00738000
@NM00001 EQU   0                                                        00739000
I008CSW  EQU   @NM00001                                                 00740000
CLASSSW  EQU   I008CSW                                                  00741000
TYPESW   EQU   I008CSW                                                  00742000
FLAGSW   EQU   I008CSW                                                  00743000
UASW     EQU   I008CSW                                                  00744000
$RCAAREA EQU   0                                                        00745000
$POINTER EQU   $RCAAREA+100                                             00746000
$TRTBLA  EQU   $POINTER+124                                             00747000
$CONSTNT EQU   $RCAAREA+244                                             00748000
$RCAFLG  EQU   $RCAAREA+604                                             00749000
TOLTEPWA EQU   0                                                        00750000
$SCTTBLE EQU   TOLTEPWA                                                 00751000
$TESTOPT EQU   $SCTTBLE+2                                               00752000
$ERROPT  EQU   $SCTTBLE+3                                               00753000
$PDEVFLG EQU   $SCTTBLE+10                                              00754000
$CDSFLGS EQU   $SCTTBLE+11                                              00755000
$CDS8T19 EQU   $SCTTBLE+20                                              00756000
$EXECFLG EQU   $SCTTBLE+33                                              00757000
$OLTFLGS EQU   $SCTTBLE+36                                              00758000
$OLTFLG2 EQU   $SCTTBLE+37                                              00759000
$TOTFLG1 EQU   $SCTTBLE+38                                              00760000
$ROUTMSK EQU   $SCTTBLE+40                                              00761000
$CDA     EQU   TOLTEPWA+100                                             00762000
$RCA     EQU   $CDA+44                                                  00763000
$OLTPTR  EQU   $CDA+52                                                  00764000
$LOWADDR EQU   $OLTPTR                                                  00765000
$HIMOREC EQU   $CDA+60                                                  00766000
$COMMFLG EQU   TOLTEPWA+224                                             00767000
$FLAG1   EQU   $COMMFLG                                                 00768000
$FLAG2   EQU   $COMMFLG+1                                               00769000
$FLAG3   EQU   $COMMFLG+2                                               00770000
$FLAG4   EQU   $COMMFLG+3                                               00771000
$FLAG5   EQU   $COMMFLG+4                                               00772000
$EOJ     EQU   $FLAG5                                                   00773000
$CANCEL  EQU   $EOJ                                                     00774000
$FLAG6   EQU   $COMMFLG+5                                               00775000
$ABNDBIT EQU   $FLAG6                                                   00776000
$FLAG7   EQU   $COMMFLG+6                                               00777000
$FLAG8   EQU   $COMMFLG+7                                               00778000
$TCECM   EQU   $FLAG8                                                   00779000
$FLAG9   EQU   $COMMFLG+8                                               00780000
$REMSW   EQU   $FLAG9                                                   00781000
$FLAG10  EQU   $COMMFLG+9                                               00782000
$FLAG11  EQU   $COMMFLG+10                                              00783000
$FLAG12  EQU   $COMMFLG+11                                              00784000
$FLAG13  EQU   $COMMFLG+12                                              00785000
$DEVTBLE EQU   TOLTEPWA+240                                             00786000
$DEVCDS  EQU   $DEVTBLE                                                 00787000
$DEVUNAD EQU   $DEVCDS                                                  00788000
@NM00065 EQU   $DEVUNAD+2                                               00789000
$DEVFEAT EQU   $DEVCDS+4                                                00790000
$DEVCDSF EQU   $DEVCDS+9                                                00791000
$DEVSDCF EQU   $DEVCDS+10                                               00792000
$$SYMNME EQU   $DEVCDS+12                                               00793000
$DEVFLG1 EQU   $DEVTBLE+20                                              00794000
$EVNCPLT EQU   $DEVFLG1                                                 00795000
$ATTNEXP EQU   $DEVFLG1                                                 00796000
$INTOCC  EQU   $DEVFLG1                                                 00797000
$DEVFLG2 EQU   $DEVTBLE+21                                              00798000
$DEVTECB EQU   $DEVTBLE+22                                              00799000
$OPIS    EQU   $DEVTECB                                                 00800000
$OPND    EQU   $DEVTECB+2                                               00801000
$DEVFLG3 EQU   $DEVTBLE+27                                              00802000
$SIOFLG  EQU   $DEVFLG3                                                 00803000
$IFTOUT  EQU   $DEVTBLE+36                                              00804000
$DEVSESP EQU   $IFTOUT                                                  00805000
$SSCPDAF EQU   $IFTOUT+6                                                00806000
$LDNCBPT EQU   $DEVTBLE+48                                              00807000
$RNINFO  EQU   $DEVTBLE+56                                              00808000
$DEVFLG5 EQU   $RNINFO+8                                                00809000
$DEVFLG4 EQU   $DEVTBLE+65                                              00810000
$SLTBL   EQU   TOLTEPWA+1468                                            00811000
$RUNTEST EQU   $SLTBL+13                                                00812000
$TESTFLG EQU   $SLTBL+21                                                00813000
$SECLST  EQU   $SLTBL+22                                                00814000
$INBUFR  EQU   TOLTEPWA+2104                                            00815000
#EXITA   EQU   TOLTEPWA+2632                                            00816000
$CCOMDAT EQU   TOLTEPWA+2644                                            00817000
$CFLGS   EQU   $CCOMDAT+16                                              00818000
$24FEMSG EQU   TOLTEPWA+2681                                            00819000
$24CATMG EQU   $24FEMSG+11                                              00820000
@NM00074 EQU   TOLTEPWA+2776                                            00821000
$OUNTPTR EQU   @NM00074+4                                               00822000
$NSPTR   EQU   $OUNTPTR                                                 00823000
$NSCNT   EQU   @NM00074+10                                              00824000
$ENXX    EQU   @NM00074+15                                              00825000
$IMITX   EQU   $ENXX                                                    00826000
SVESC033 EQU   TOLTEPWA+3160                                            00827000
SVECC013 EQU   TOLTEPWA+3232                                            00828000
SVEIC003 EQU   TOLTEPWA+3592                                            00829000
SVESC022 EQU   TOLTEPWA+3736                                            00830000
SVECC011 EQU   TOLTEPWA+4024                                            00831000
#EXIT    EQU   0                                                        00832000
CECOMMAP EQU   0                                                        00833000
CDSMAP   EQU   0                                                        00834000
CDSUA    EQU   CDSMAP                                                   00835000
CDSMFCT  EQU   CDSMAP+4                                                 00836000
CDSMODEL EQU   CDSMFCT                                                  00837000
CDSFEAT  EQU   CDSMFCT+1                                                00838000
CDSBYTCT EQU   CDSMAP+8                                                 00839000
CDSFLAG  EQU   CDSMAP+9                                                 00840000
CDSSYMB  EQU   CDSFLAG                                                  00841000
CDSREMSY EQU   CDSFLAG                                                  00842000
CDSSYMBN EQU   CDSMAP+12                                                00843000
CDSEXARA EQU   CDSMAP+20                                                00844000
$TRTBL   EQU   0                                                        00845000
SVECC012 EQU   SVESC022                                                 00846000
SVEIC00A EQU   SVEIC003                                                 00847000
SVEIC004 EQU   SVEIC003                                                 00848000
SVEIC005 EQU   SVEIC003                                                 00849000
SVESC02A EQU   SVESC022                                                 00850000
SVESC02B EQU   SVESC022                                                 00851000
SVESC02D EQU   SVESC022                                                 00852000
SVESC02E EQU   SVESC022                                                 00853000
SVESC02F EQU   SVECC013                                                 00854000
SVESC024 EQU   SVESC022                                                 00855000
SVESC027 EQU   SVESC022                                                 00856000
SVESC029 EQU   SVESC033                                                 00857000
SVESC031 EQU   SVECC013                                                 00858000
SVESC032 EQU   SVECC011                                                 00859000
SVETC037 EQU   SVEIC003                                                 00860000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00861000
CDSEXTM  EQU   CDSFLAG+2                                                00862000
CDSEXTB  EQU   CDSFLAG+2                                                00863000
CDSTMERB EQU   CDSFLAG+2                                                00864000
@NM00078 EQU   CDSFLAG+1                                                00865000
CDSDVPRO EQU   CDSFLAG+1                                                00866000
CDSNTPRI EQU   CDSFLAG+1                                                00867000
CDSLINCN EQU   CDSFLAG                                                  00868000
CDS2CHAN EQU   CDSFLAG                                                  00869000
CDSEXTPR EQU   CDSFLAG                                                  00870000
CDSFEVOL EQU   CDSFLAG                                                  00871000
CDSSHAR  EQU   CDSFLAG                                                  00872000
CDSFPMD  EQU   CDSFLAG                                                  00873000
CDSTYPE  EQU   CDSMFCT+3                                                00874000
CDSCLASS EQU   CDSMFCT+2                                                00875000
@NM00077 EQU   CDSFEAT                                                  00876000
CDSDEVM  EQU   CDSFEAT                                                  00877000
CDSDEVT  EQU   CDSFEAT                                                  00878000
CDSASCII EQU   CDSFEAT                                                  00879000
$CECFLAG EQU   CECOMMAP+20                                              00880000
$CEINCT  EQU   CECOMMAP+16                                              00881000
$CEINADR EQU   CECOMMAP+12                                              00882000
$CEOUTCT EQU   CECOMMAP+8                                               00883000
$CEOUTAD EQU   CECOMMAP+4                                               00884000
$CECIDNT EQU   CECOMMAP+2                                               00885000
$CECLEVL EQU   CECOMMAP+1                                               00886000
$CECTRMG EQU   CECOMMAP                                                 00887000
SVECC010 EQU   TOLTEPWA+3952                                            00888000
SVETC035 EQU   TOLTEPWA+3880                                            00889000
SVESC030 EQU   TOLTEPWA+3808                                            00890000
SVESC020 EQU   TOLTEPWA+3664                                            00891000
SVEIC002 EQU   TOLTEPWA+3520                                            00892000
SVECC014 EQU   TOLTEPWA+3376                                            00893000
SVESC120 EQU   TOLTEPWA+3304                                            00894000
SVESC025 EQU   TOLTEPWA+3088                                            00895000
@NM00076 EQU   TOLTEPWA+2980                                            00896000
$RPLERR  EQU   TOLTEPWA+2977                                            00897000
@NM00075 EQU   TOLTEPWA+2976                                            00898000
$R13PR3  EQU   TOLTEPWA+2972                                            00899000
$CEINT2  EQU   TOLTEPWA+2968                                            00900000
$CEINT1  EQU   TOLTEPWA+2964                                            00901000
$MSGGET  EQU   TOLTEPWA+2960                                            00902000
$ACQLIST EQU   TOLTEPWA+2956                                            00903000
$R4SAVE1 EQU   TOLTEPWA+2952                                            00904000
$CLSISS  EQU   TOLTEPWA+2950                                            00905000
$CLSCNT  EQU   TOLTEPWA+2948                                            00906000
$CUTABLE EQU   TOLTEPWA+2868                                            00907000
$BUFSZ2  EQU   TOLTEPWA+2864                                            00908000
$RESID2  EQU   TOLTEPWA+2860                                            00909000
$OLTCCW2 EQU   TOLTEPWA+2856                                            00910000
$ENDBFR2 EQU   TOLTEPWA+2852                                            00911000
$1STBFR2 EQU   TOLTEPWA+2848                                            00912000
$TECB2   EQU   TOLTEPWA+2844                                            00913000
$BUFSZ1  EQU   TOLTEPWA+2840                                            00914000
$RESID1  EQU   TOLTEPWA+2836                                            00915000
$OLTCCW1 EQU   TOLTEPWA+2832                                            00916000
$ENDBFR1 EQU   TOLTEPWA+2828                                            00917000
$1STBFR1 EQU   TOLTEPWA+2824                                            00918000
$TECB1   EQU   TOLTEPWA+2820                                            00919000
$WAITIME EQU   TOLTEPWA+2816                                            00920000
$TRTN#   EQU   TOLTEPWA+2815                                            00921000
$WIODEV  EQU   TOLTEPWA+2814                                            00922000
$RQSTSZE EQU   TOLTEPWA+2812                                            00923000
$RQSTPTR EQU   TOLTEPWA+2808                                            00924000
$R4SAVE  EQU   TOLTEPWA+2804                                            00925000
$PARTADR EQU   TOLTEPWA+2800                                            00926000
$TBSDATA EQU   TOLTEPWA+2796                                            00927000
$CTWIDTH EQU   TOLTEPWA+2795                                            00928000
$CTLINE  EQU   TOLTEPWA+2794                                            00929000
$APWIDTH EQU   TOLTEPWA+2793                                            00930000
$APLINE  EQU   TOLTEPWA+2792                                            00931000
$INDEX   EQU   $IMITX                                                   00932000
$UMXX    EQU   @NM00074+14                                              00933000
$NSXX    EQU   @NM00074+12                                              00934000
$ATACNT  EQU   $NSCNT                                                   00935000
$CTR     EQU   @NM00074+8                                               00936000
$ATAPTR  EQU   $NSPTR                                                   00937000
$DDRPTR  EQU   @NM00074                                                 00938000
$DTORESP EQU   TOLTEPWA+2712                                            00939000
$APNAME  EQU   TOLTEPWA+2704                                            00940000
$24SYMNE EQU   $24CATMG+4                                               00941000
$24DEVAD EQU   $24CATMG                                                 00942000
$24RTN#  EQU   $24FEMSG+8                                               00943000
$ESECTID EQU   $24FEMSG                                                 00944000
$24FLGS  EQU   TOLTEPWA+2680                                            00945000
$24SAVE2 EQU   TOLTEPWA+2676                                            00946000
$24SAVE1 EQU   TOLTEPWA+2672                                            00947000
$24UNADR EQU   TOLTEPWA+2668                                            00948000
$24SAV13 EQU   TOLTEPWA+2664                                            00949000
$24RETCD EQU   TOLTEPWA+2663                                            00950000
$MACID   EQU   TOLTEPWA+2661                                            00951000
$CSPARE  EQU   $CFLGS                                                   00952000
$C2WAY   EQU   $CFLGS                                                   00953000
$CINCT   EQU   $CCOMDAT+12                                              00954000
$CINADR  EQU   $CCOMDAT+8                                               00955000
$COUTCT  EQU   $CCOMDAT+4                                               00956000
$COUTAD  EQU   $CCOMDAT                                                 00957000
ROOTLOC  EQU   TOLTEPWA+2640                                            00958000
$RETREG  EQU   TOLTEPWA+2636                                            00959000
$WORK    EQU   TOLTEPWA+2376                                            00960000
$EXTA    EQU   TOLTEPWA+2320                                            00961000
$PASSONA EQU   TOLTEPWA+2264                                            00962000
$TRMINPT EQU   TOLTEPWA+2184                                            00963000
$BUFFER  EQU   TOLTEPWA+1976                                            00964000
$TLTRPL3 EQU   TOLTEPWA+1856                                            00965000
$TLTRPL2 EQU   TOLTEPWA+1736                                            00966000
$TLTRPL1 EQU   TOLTEPWA+1616                                            00967000
@NM00073 EQU   $SLTBL+135                                               00968000
$HIGHRTN EQU   $SLTBL+134                                               00969000
$PRIMADR EQU   $SLTBL+130                                               00970000
$CTSTPT  EQU   $SLTBL+128                                               00971000
$TSTCNT  EQU   $SLTBL+126                                               00972000
$SECFLGS EQU   $SECLST+3                                                00973000
$SECTION EQU   $SECLST                                                  00974000
$SECACT  EQU   $TESTFLG                                                 00975000
$CANTRUN EQU   $TESTFLG                                                 00976000
$FINAL   EQU   $TESTFLG                                                 00977000
$TESTSUF EQU   $RUNTEST+5                                               00978000
$TESTNUM EQU   $RUNTEST+1                                               00979000
$LETPRF  EQU   $RUNTEST                                                 00980000
$SYMBOLC EQU   $SLTBL+5                                                 00981000
$FAMILY  EQU   $SLTBL                                                   00982000
$CDEVPT  EQU   TOLTEPWA+1466                                            00983000
$DEVCNTS EQU   TOLTEPWA+1464                                            00984000
$FEEDBCK EQU   $DEVTBLE+66                                              00985000
$WTISUED EQU   $DEVFLG4                                                 00986000
$EXIOISD EQU   $DEVFLG4                                                 00987000
$REMWRIT EQU   $DEVFLG4                                                 00988000
$REMDONE EQU   $DEVFLG4                                                 00989000
$2NDUSED EQU   $DEVFLG4                                                 00990000
$1STUSED EQU   $DEVFLG4                                                 00991000
$IGLXIFB EQU   $DEVFLG4                                                 00992000
$EXIOLV3 EQU   $DEVFLG4                                                 00993000
@NM00072 EQU   $DEVFLG5                                                 00994000
$ASCII   EQU   $DEVFLG5                                                 00995000
$DEVLU   EQU   $DEVFLG5                                                 00996000
$OPNDFAL EQU   $DEVFLG5                                                 00997000
$ACQNCB  EQU   $DEVFLG5                                                 00998000
$REMOTE  EQU   $DEVFLG5                                                 00999000
$ENDNODE EQU   $DEVFLG5                                                 01000000
$LINENME EQU   $RNINFO                                                  01001000
$CID     EQU   $DEVTBLE+52                                              01002000
$DVCOL   EQU   $LDNCBPT+2                                               01003000
$DVROW   EQU   $LDNCBPT                                                 01004000
$NCSPLP  EQU   $DEVTBLE+44                                              01005000
$DVLN    EQU   $SSCPDAF                                                 01006000
$DAF     EQU   $DEVSESP+4                                               01007000
$VARYPAB EQU   $DEVSESP                                                 01008000
$SYSMN   EQU   $DEVTBLE+28                                              01009000
@NM00071 EQU   $DEVFLG3                                                 01010000
$CLRSNT  EQU   $DEVFLG3                                                 01011000
$OLTERR  EQU   $DEVFLG3                                                 01012000
$SRTEST  EQU   $DEVFLG3                                                 01013000
$DVSNDOK EQU   $SIOFLG                                                  01014000
$POLLREQ EQU   $DEVFLG3                                                 01015000
$ACQRED  EQU   $DEVFLG3                                                 01016000
$NOTDEV  EQU   $DEVFLG3                                                 01017000
$DVINCT  EQU   $DEVTBLE+26                                              01018000
$DVBRKST EQU   $OPND+1                                                  01019000
$DVBRKSN EQU   $OPND                                                    01020000
$DVSEQNO EQU   $OPIS                                                    01021000
$CEINTRP EQU   $DEVFLG2                                                 01022000
$TESTMDE EQU   $DEVFLG2                                                 01023000
$DEVALOC EQU   $DEVFLG2                                                 01024000
$ALLDATA EQU   $DEVFLG2                                                 01025000
$ENDCNTL EQU   $DEVFLG2                                                 01026000
$CTLDEV  EQU   $DEVFLG2                                                 01027000
$NOCDS   EQU   $DEVFLG2                                                 01028000
$DATAIN  EQU   $DEVFLG2                                                 01029000
$PRIMARY EQU   $DEVFLG1                                                 01030000
$DVCTBYT EQU   $INTOCC                                                  01031000
$DEVACT  EQU   $DEVFLG1                                                 01032000
$DVLGMDE EQU   $ATTNEXP                                                 01033000
$DVSPRM  EQU   $EVNCPLT                                                 01034000
$GRABBED EQU   $DEVFLG1                                                 01035000
$CATASTR EQU   $DEVFLG1                                                 01036000
$LETGO   EQU   $DEVFLG1                                                 01037000
$CURELEM EQU   $$SYMNME+4                                               01038000
$MSGOTSD EQU   $$SYMNME                                                 01039000
$EXTDEV  EQU   $DEVCDS+11                                               01040000
@NM00070 EQU   $DEVSDCF                                                 01041000
$NOTPRIM EQU   $DEVSDCF                                                 01042000
@NM00069 EQU   $DEVCDSF                                                 01043000
@NM00068 EQU   $DEVCDSF                                                 01044000
@NM00067 EQU   $DEVCDSF                                                 01045000
$CDSNAME EQU   $DEVCDSF                                                 01046000
$EXTRN   EQU   $DEVCDSF                                                 01047000
$CEVOLUM EQU   $DEVCDSF                                                 01048000
$SHARD   EQU   $DEVCDSF                                                 01049000
$DEVFPM  EQU   $DEVCDSF                                                 01050000
$DEVCNT  EQU   $DEVCDS+8                                                01051000
$DEVTYPE EQU   $DEVFEAT+3                                               01052000
$DEVCLAS EQU   $DEVFEAT+2                                               01053000
$DEVFRRS EQU   $DEVFEAT+1                                               01054000
$DEVMOD  EQU   $DEVFEAT                                                 01055000
$DEVRDGT EQU   @NM00065+1                                               01056000
$DEVCTLU EQU   @NM00065+1                                               01057000
$DEVCHAN EQU   @NM00065                                                 01058000
@NM00066 EQU   @NM00065                                                 01059000
$CTINDX  EQU   $DEVUNAD                                                 01060000
$FLAG16  EQU   $COMMFLG+15                                              01061000
$FLAG15  EQU   $COMMFLG+14                                              01062000
$FLAG14  EQU   $COMMFLG+13                                              01063000
$TEP2ND  EQU   $FLAG13                                                  01064000
$TEP1ST  EQU   $FLAG13                                                  01065000
$CATMSG  EQU   $FLAG13                                                  01066000
$PRMPTSW EQU   $FLAG13                                                  01067000
$DEVENT  EQU   $FLAG13                                                  01068000
$OLTMACC EQU   $FLAG13                                                  01069000
$LGON    EQU   $FLAG13                                                  01070000
$CTLOGON EQU   $FLAG13                                                  01071000
@NM00064 EQU   $FLAG12                                                  01072000
$VARYINP EQU   $FLAG12                                                  01073000
$ENDTEST EQU   $FLAG12                                                  01074000
$VRYHRD  EQU   $FLAG12                                                  01075000
$VRYSFT  EQU   $FLAG12                                                  01076000
$POSTFLG EQU   $FLAG12                                                  01077000
$OPTMSG  EQU   $FLAG12                                                  01078000
$FEORCAT EQU   $FLAG11                                                  01079000
@NM00063 EQU   $FLAG11                                                  01080000
@NM00062 EQU   $FLAG10                                                  01081000
$INBND   EQU   $FLAG10                                                  01082000
$WAITFLG EQU   $FLAG10                                                  01083000
$DPRINT  EQU   $FLAG10                                                  01084000
$HOLD    EQU   $FLAG9                                                   01085000
$NOTRRCH EQU   $FLAG9                                                   01086000
@NM00061 EQU   $FLAG9                                                   01087000
$COPY    EQU   $FLAG9                                                   01088000
$LSTLNSW EQU   $FLAG9                                                   01089000
$MULLNSW EQU   $FLAG9                                                   01090000
$IGRES   EQU   $FLAG9                                                   01091000
$VS2     EQU   $FLAG8                                                   01092000
$VS1     EQU   $FLAG8                                                   01093000
$EDOS    EQU   $FLAG8                                                   01094000
@NM00060 EQU   $FLAG8                                                   01095000
$TWOWAY  EQU   $FLAG8                                                   01096000
@NM00059 EQU   $FLAG8                                                   01097000
$RCVMSG  EQU   $FLAG7                                                   01098000
$RCVRFLG EQU   $FLAG7                                                   01099000
$SNDRFLG EQU   $FLAG7                                                   01100000
$LDOIS   EQU   $FLAG7                                                   01101000
$DCONTCT EQU   $FLAG7                                                   01102000
$EXIOWAT EQU   $FLAG7                                                   01103000
$2NDDATA EQU   $FLAG7                                                   01104000
$1STDATA EQU   $FLAG7                                                   01105000
$CIREQ   EQU   $FLAG6                                                   01106000
$ABTERM  EQU   $ABNDBIT                                                 01107000
$FSTMCIS EQU   $FLAG6                                                   01108000
$DISCREQ EQU   $FLAG6                                                   01109000
$DISCISS EQU   $FLAG6                                                   01110000
$CHANGE  EQU   $FLAG6                                                   01111000
$CTERROR EQU   $FLAG6                                                   01112000
$RECAL11 EQU   $FLAG6                                                   01113000
@NM00058 EQU   $FLAG5                                                   01114000
$PROGCK  EQU   $CANCEL                                                  01115000
$PRINTAP EQU   $FLAG5                                                   01116000
@NM00057 EQU   $FLAG5                                                   01117000
$MSG922  EQU   $FLAG5                                                   01118000
$CT924   EQU   $FLAG5                                                   01119000
$FSTCAT  EQU   $FLAG5                                                   01120000
$FSTFE   EQU   $FLAG5                                                   01121000
$ACTOPND EQU   $FLAG4                                                   01122000
$ACQCUTT EQU   $FLAG4                                                   01123000
$CLSSACT EQU   $FLAG4                                                   01124000
$BACKINT EQU   $FLAG4                                                   01125000
$DMSGSW  EQU   $FLAG4                                                   01126000
$TSTDEVP EQU   $FLAG4                                                   01127000
$APRQPER EQU   $FLAG4                                                   01128000
$OPCOM   EQU   $FLAG4                                                   01129000
$NEWAP   EQU   $FLAG3                                                   01130000
$ALTPRTR EQU   $FLAG3                                                   01131000
$OPTERR  EQU   $FLAG3                                                   01132000
$PRTONLY EQU   $FLAG3                                                   01133000
$REQSTOR EQU   $FLAG3                                                   01134000
$LOGOFFE EQU   $FLAG3                                                   01135000
$TSTERR  EQU   $FLAG3                                                   01136000
$DEVERR  EQU   $FLAG3                                                   01137000
$PARTIAL EQU   $FLAG2                                                   01138000
$NRMTERM EQU   $FLAG2                                                   01139000
$VALDTST EQU   $FLAG2                                                   01140000
$VALDDEV EQU   $FLAG2                                                   01141000
$DBLSLSH EQU   $FLAG2                                                   01142000
$NDR     EQU   $FLAG2                                                   01143000
@NM00056 EQU   $FLAG2                                                   01144000
$OLTACT  EQU   $FLAG1                                                   01145000
$NORELDV EQU   $FLAG1                                                   01146000
@NM00055 EQU   $FLAG1                                                   01147000
$OPTCHNG EQU   $FLAG1                                                   01148000
$DEVCHNG EQU   $FLAG1                                                   01149000
$TESTCNG EQU   $FLAG1                                                   01150000
$CNSLFG  EQU   $FLAG1                                                   01151000
$TEP3RD  EQU   $FLAG1                                                   01152000
@NM00054 EQU   $CDA+120                                                 01153000
$CUCNT   EQU   $CDA+118                                                 01154000
@NM00053 EQU   $CDA+117                                                 01155000
$PRTFORM EQU   $CDA+116                                                 01156000
$OPISCNT EQU   $CDA+114                                                 01157000
$OPNDCNT EQU   $CDA+112                                                 01158000
$GETMSZE EQU   $CDA+110                                                 01159000
$GRCNTS  EQU   $CDA+108                                                 01160000
$CTLCNT  EQU   $CDA+106                                                 01161000
$ACTLVL  EQU   $CDA+105                                                 01162000
$PRNTLVL EQU   $CDA+104                                                 01163000
$ERRCNTA EQU   $CDA+102                                                 01164000
$TLCNT   EQU   $CDA+100                                                 01165000
$TIMEALW EQU   $CDA+96                                                  01166000
$PTRAREA EQU   $CDA+92                                                  01167000
$GETMPTR EQU   $CDA+88                                                  01168000
$R13PTRT EQU   $CDA+84                                                  01169000
$R13PTR  EQU   $CDA+80                                                  01170000
$TEPEND  EQU   $CDA+76                                                  01171000
$PLINKDL EQU   $CDA+72                                                  01172000
$TEPBEGN EQU   $CDA+68                                                  01173000
$FRELPTR EQU   $CDA+64                                                  01174000
$HIGHADR EQU   $HIMOREC                                                 01175000
$LOMOREC EQU   $CDA+56                                                  01176000
$ENDCOMM EQU   $CDA+48                                                  01177000
$COMMON  EQU   $RCA                                                     01178000
$SLASHAD EQU   $CDA+32                                                  01179000
$PASSON  EQU   $CDA+28                                                  01180000
$TOLBRTB EQU   $CDA+24                                                  01181000
$SCTPTR8 EQU   $CDA+20                                                  01182000
$SCTPTR  EQU   $CDA+16                                                  01183000
$TBWDPTR EQU   $CDA+12                                                  01184000
$TFWDPTR EQU   $CDA+8                                                   01185000
@NM00052 EQU   $CDA                                                     01186000
@NM00051 EQU   $SCTTBLE+98                                              01187000
$SCTLWTC EQU   $SCTTBLE+96                                              01188000
$SCTLWTA EQU   $SCTTBLE+92                                              01189000
#EXT     EQU   $SCTTBLE+88                                              01190000
#PASS    EQU   $SCTTBLE+84                                              01191000
#TABLE   EQU   $SCTTBLE+80                                              01192000
#MSGIDAC EQU   $SCTTBLE+78                                              01193000
@NM00050 EQU   $SCTTBLE+71                                              01194000
$RETMASK EQU   $SCTTBLE+70                                              01195000
$R249255 EQU   $ROUTMSK+29                                              01196000
$R241248 EQU   $ROUTMSK+28                                              01197000
$R233240 EQU   $ROUTMSK+27                                              01198000
$R225232 EQU   $ROUTMSK+26                                              01199000
$R217224 EQU   $ROUTMSK+25                                              01200000
$R209216 EQU   $ROUTMSK+24                                              01201000
$R201208 EQU   $ROUTMSK+23                                              01202000
$R193200 EQU   $ROUTMSK+22                                              01203000
$R185192 EQU   $ROUTMSK+21                                              01204000
$R177184 EQU   $ROUTMSK+20                                              01205000
$R169176 EQU   $ROUTMSK+19                                              01206000
$R161168 EQU   $ROUTMSK+18                                              01207000
$R153160 EQU   $ROUTMSK+17                                              01208000
$R145152 EQU   $ROUTMSK+16                                              01209000
$R137144 EQU   $ROUTMSK+15                                              01210000
$R129136 EQU   $ROUTMSK+14                                              01211000
$R121128 EQU   $ROUTMSK+13                                              01212000
$R113120 EQU   $ROUTMSK+12                                              01213000
$R105112 EQU   $ROUTMSK+11                                              01214000
$R097104 EQU   $ROUTMSK+10                                              01215000
$R089096 EQU   $ROUTMSK+9                                               01216000
$R081088 EQU   $ROUTMSK+8                                               01217000
$R073080 EQU   $ROUTMSK+7                                               01218000
$R065072 EQU   $ROUTMSK+6                                               01219000
$R057064 EQU   $ROUTMSK+5                                               01220000
$R049056 EQU   $ROUTMSK+4                                               01221000
$R041048 EQU   $ROUTMSK+3                                               01222000
$R033040 EQU   $ROUTMSK+2                                               01223000
$R025032 EQU   $ROUTMSK+1                                               01224000
$R017024 EQU   $ROUTMSK                                                 01225000
$TOTFLG2 EQU   $SCTTBLE+39                                              01226000
@NM00049 EQU   $TOTFLG1                                                 01227000
@NM00048 EQU   $TOTFLG1                                                 01228000
@NM00047 EQU   $TOTFLG1                                                 01229000
$CURELOD EQU   $TOTFLG1                                                 01230000
$CTEQTT  EQU   $TOTFLG1                                                 01231000
@NM00046 EQU   $TOTFLG1                                                 01232000
@NM00045 EQU   $TOTFLG1                                                 01233000
$LINESHR EQU   $TOTFLG1                                                 01234000
@NM00044 EQU   $OLTFLG2                                                 01235000
@NM00043 EQU   $OLTFLG2                                                 01236000
@NM00042 EQU   $OLTFLG2                                                 01237000
@NM00041 EQU   $OLTFLG2                                                 01238000
@NM00040 EQU   $OLTFLG2                                                 01239000
@NM00039 EQU   $OLTFLG2                                                 01240000
@NM00038 EQU   $OLTFLG2                                                 01241000
$TALK    EQU   $OLTFLG2                                                 01242000
$DYCOM   EQU   $OLTFLGS                                                 01243000
@NM00037 EQU   $OLTFLGS                                                 01244000
$TRACE   EQU   $OLTFLGS                                                 01245000
$RETCODE EQU   $OLTFLGS                                                 01246000
$CONTCB  EQU   $OLTFLGS                                                 01247000
$RETAIN  EQU   $OLTFLGS                                                 01248000
$CLEANRT EQU   $OLTFLGS                                                 01249000
$MANINTV EQU   $OLTFLGS                                                 01250000
$OLTSIZE EQU   $SCTTBLE+34                                              01251000
$QSCTMOD EQU   $EXECFLG                                                 01252000
$CTRLMOD EQU   $EXECFLG                                                 01253000
$CLEANUP EQU   $EXECFLG                                                 01254000
$LSTPDEV EQU   $EXECFLG                                                 01255000
$ERRCNT  EQU   $EXECFLG                                                 01256000
$RTNSLCT EQU   $EXECFLG                                                 01257000
$MULTDEV EQU   $EXECFLG                                                 01258000
@NM00036 EQU   $EXECFLG                                                 01259000
$RMSKCNT EQU   $SCTTBLE+32                                              01260000
$SYNAME  EQU   $CDS8T19+4                                               01261000
$EXTSIG  EQU   $CDS8T19+3                                               01262000
$CDFLGS  EQU   $CDS8T19+1                                               01263000
$CDSCNT  EQU   $CDS8T19                                                 01264000
$PDEVDSC EQU   $SCTTBLE+16                                              01265000
$PDEVADR EQU   $SCTTBLE+12                                              01266000
$COMMCN  EQU   $CDSFLGS                                                 01267000
$CUSTSYM EQU   $CDSFLGS                                                 01268000
$TWOCHSW EQU   $CDSFLGS                                                 01269000
$SYMNAME EQU   $CDSFLGS                                                 01270000
$EXTINTC EQU   $CDSFLGS                                                 01271000
$CEVOL   EQU   $CDSFLGS                                                 01272000
$SHARED  EQU   $CDSFLGS                                                 01273000
$FPM     EQU   $CDSFLGS                                                 01274000
$LASTSUB EQU   $PDEVFLG                                                 01275000
@NM00035 EQU   $PDEVFLG                                                 01276000
@NM00034 EQU   $PDEVFLG                                                 01277000
@NM00033 EQU   $PDEVFLG                                                 01278000
$LASTDEV EQU   $PDEVFLG                                                 01279000
@NM00032 EQU   $PDEVFLG                                                 01280000
$EXFILPT EQU   $PDEVFLG                                                 01281000
$FPMOLD  EQU   $PDEVFLG                                                 01282000
$TSSSYM  EQU   $SCTTBLE+8                                               01283000
$SCTLEVL EQU   $SCTTBLE+7                                               01284000
$DRIVER  EQU   $SCTTBLE+6                                               01285000
$RT0916  EQU   $SCTTBLE+5                                               01286000
$RT0108  EQU   $SCTTBLE+4                                               01287000
$LOOPTST EQU   $ERROPT                                                  01288000
$LOOPERR EQU   $ERROPT                                                  01289000
$NERRPRT EQU   $ERROPT                                                  01290000
$NOCNTRL EQU   $ERROPT                                                  01291000
$ALTPRNT EQU   $ERROPT                                                  01292000
$CATERR  EQU   $ERROPT                                                  01293000
$ASTERIK EQU   $ERROPT                                                  01294000
$TESTERR EQU   $ERROPT                                                  01295000
$FSTCOMM EQU   $TESTOPT                                                 01296000
$INDEFLP EQU   $TESTOPT                                                 01297000
$NOPRT   EQU   $TESTOPT                                                 01298000
$PARAPRT EQU   $TESTOPT                                                 01299000
@NM00031 EQU   $TESTOPT                                                 01300000
$ERRLPCT EQU   $SCTTBLE                                                 01301000
$TLTEND  EQU   $RCAAREA+936                                             01302000
$EXITSAV EQU   $RCAAREA+864                                             01303000
$TRASCII EQU   $RCAAREA+608                                             01304000
@NM00030 EQU   $RCAAREA+605                                             01305000
$VTAMEND EQU   $RCAFLG                                                  01306000
$TPPOSTD EQU   $RCAFLG                                                  01307000
$NEWCT   EQU   $RCAFLG                                                  01308000
$ABNDALL EQU   $RCAFLG                                                  01309000
$CUTESTB EQU   $RCAFLG                                                  01310000
$CONSOLE EQU   $RCAFLG                                                  01311000
$TPLOGON EQU   $RCAFLG                                                  01312000
$UPDATE  EQU   $RCAFLG                                                  01313000
$DEVAREA EQU   $RCAAREA+600                                             01314000
$CTDVAR  EQU   $RCAAREA+596                                             01315000
$BUFFS   EQU   $RCAAREA+464                                             01316000
$TLTNIB  EQU   $CONSTNT+140                                             01317000
$TLTPRPL EQU   $CONSTNT+20                                              01318000
@NM00029 EQU   $CONSTNT+4                                               01319000
@NM00028 EQU   $CONSTNT+2                                               01320000
$USECNT  EQU   $CONSTNT                                                 01321000
$CURRTWA EQU   $POINTER+140                                             01322000
$CTNAME  EQU   $POINTER+132                                             01323000
$CTARGX  EQU   $POINTER+128                                             01324000
$COMINT  EQU   $POINTER+120                                             01325000
$QUEHNDL EQU   $POINTER+116                                             01326000
@NM00027 EQU   $POINTER+36                                              01327000
$RTNPTR  EQU   $POINTER+32                                              01328000
$TLTECB2 EQU   $POINTER+28                                              01329000
$TLTECB1 EQU   $POINTER+24                                              01330000
$CLEANP  EQU   $POINTER+20                                              01331000
$ABEND   EQU   $POINTER+16                                              01332000
$LSTAREA EQU   $POINTER+12                                              01333000
$FSTAREA EQU   $POINTER+8                                               01334000
$CVTSAVE EQU   $POINTER+4                                               01335000
$TOLTEP  EQU   $POINTER                                                 01336000
$TLTACB  EQU   $RCAAREA                                                 01337000
DATASW   EQU   I008CSW                                                  01338000
DBSW     EQU   I008CSW                                                  01339000
EBCDICSW EQU   I008CSW                                                  01340000
CONTSCAN EQU   I008CSW                                                  01341000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01342000
@RT00085 EQU   I008C01B                                                 01343000
@RT00098 EQU   I008C03                                                  01344000
@RF00098 EQU   I008C02A                                                 01345000
@RT00105 EQU   I008C03                                                  01346000
@RF00103 EQU   I008C03                                                  01347000
@RT00132 EQU   I008CADR                                                 01348000
@RT00162 EQU   I008CER2                                                 01349000
@RT00164 EQU   I008CER3                                                 01350000
@ENDDATA EQU   *                                                        01351000
         END   ISTIC008,(C'PLS0912',0701,76244)                         01352000
