         TITLE 'ISTINCOE/AOE-VS1/MOE-VS2-OPERATOR TERMINATION MODULE   *00001000
                        '                                               00002000
ISTINCOE CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTINCOE  75.129'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         LA    @11,@DATA                                           0001 00014000
         USING @DATA,@11                                           0001 00015000
         ST    @13,@SA00001+4                                      0001 00016000
         LA    @14,@SA00001                                        0001 00017000
         ST    @14,8(,@13)                                         0001 00018000
         LR    @13,@14                                             0001 00019000
*                                                                  0006 00020000
* /*                   END OF CVT MACRO                              */ 00021000
*                                                                  0007 00022000
*/*TPMSG MSGID('102I')*/                                           0007 00023000
*                                                                  0007 00024000
* DO;                                                              0007 00025000
*   DCL REG1003  REG(1)  PTR;                                      0008 00026000
*   RFY (REG1003) RSTD;                                            0009 00027000
*                                                                  0009 00028000
* RFY (EMCR13) RSTD;                                               0010 00029000
*   DCL 1 * BASED(REG1003),                                        0011 00030000
*       2 CMZID003 PTR(31),                                        0011 00031000
*       2 *,                                                       0011 00032000
*         3 CMZRL003 PTR(8),                                       0011 00033000
*         3 CMZRA003 PTR(24) BDY(BYTE),                            0011 00034000
*       2 CMZEA003 PTR(31),                                        0011 00035000
*       2 CMZVP003 PTR(31);                                        0011 00036000
*   DCL CMZPL003(4) FIXED INIT((4)0);                              0012 00037000
*   REG1003 = ADDR(CMZPL003);                                      0013 00038000
         LA    REG1003,CMZPL003                                    0013 00039000
*   DCL CMZAA003 CHAR(4) INIT('102I');                             0014 00040000
*   CMZID003 = ADDR(CMZAA003);                                     0015 00041000
         LA    @10,CMZAA003                                        0015 00042000
         ST    @10,CMZID003(,REG1003)                              0015 00043000
*   DCL CMZSA003 (18) PTR(31) BASED(EMCR13);                       0016 00044000
*   DCL CMZZO003 (1) FIXED(31) INIT(0);                            0017 00045000
*   CMZSA003(5) = CMZZO003;                                        0018 00046000
*                                                                  0018 00047000
         L     @10,CMZZO003                                        0018 00048000
         ST    @10,CMZSA003+16(,EMCR13)                            0018 00049000
*   DCL REG15003 REG(15) PTR;                                      0019 00050000
*   RFY REG15003 RSTD;                                             0020 00051000
*                                                                  0020 00052000
* DO; /* LISATCVT CVTBASE(PAGEABLE,(REG15003)) */                  0021 00053000
*                                                                  0021 00054000
* RFY ISTPAB  ;                                                    0022 00055000
* RFY ISTLOK  ;                                                    0023 00056000
* RFY ISTDYPAB;                                                    0024 00057000
* RFY ISTRPH  ;                                                    0025 00058000
* RFY ISTATCVT;                                                    0026 00059000
*   REG15003 = ATCLCPTR; /*SET UP ATCVT POINTER*/                  0027 00060000
         L     REG15003,ATCLCPTR                                   0027 00061000
* END; /*LISATCVT*/                                                0028 00062000
*   DCL CMTA003 BASED(REG15003) ENTRY VALUERANGE(*);               0029 00063000
*   REG15003 = REG15003->ATCMSGP;                                  0030 00064000
         L     REG15003,ATCMSGP(,REG15003)                         0030 00065000
*   CALL CMTA003;                                                  0031 00066000
         BALR  @14,@15                                             0031 00067000
*   RESPECIFY (REG1003,REG15003)  UNRESTRICTED;                    0032 00068000
*                                                                  0032 00069000
* RFY (EMCR13) UNRSTD;                                             0033 00070000
* END;                /* ISSUE 'VTAM INACTIVE' MSG  */             0034 00071000
*                                                                  0034 00072000
*/* TPEPILOG   */                                                  0035 00073000
*  GEN (PRINT OFF);                                                0035 00074000
*                                                                  0035 00075000
         PRINT OFF                                                      00076000
*/* PROCESS ANCHOR BLOCK                                              * 00077000
*/*  INITIAL LEVEL                                     001 01/16/75  */ 00078000
*DCL  1  ISTPAB BDY(DWORD) BASED,                                  0036 00079000
*       2  PABWQCHN CHAR(8) BDY(DWORD), /* CPS SWAP FIELD FOR NEQ&CHN * 00080000
*        3  PABWEQA PTR(31) BDY(WORD), /* WORK ELEMENT QUEUE ADDRESS  * 00081000
*           4  PABWEQG BIT(1),         /* GATING BIT                  * 00082000
*           4  PABRSV01 BIT(7),        /* RESERVED                    * 00083000
*           4  PABWEQP PTR(24),        /* WKEL PTR                    * 00084000
*        3  PABCHAIN PTR(31) BDY(WORD), /* APS CHAIN                  * 00085000
*           4  PABCHNG BIT(1),         /* GATING BIT                  * 00086000
*           4  PABRESCH BIT(1),        /* RESCHEDULE PAB AT        0036 00087000
*                                         TPEXIT                      * 00088000
*           4  PABCDP BIT(1),          /* CLOSE DST/CHANGE IN PROGRESS* 00089000
*           4  PABUNCON BIT(1),        /* UNCONDITIONALLY RESCHEDULE    00090000
*                                         PAB AT TPEXIT               * 00091000
*           4  PABRESET BIT(1),        /* RESET ISSUED ON THIS PAB    * 00092000
*           4  PABRUNNG BIT(1),        /* PAB RUNNING                 * 00093000
*           4  PABRSV02 BIT(2),        /* RESERVED                    * 00094000
*           4  PABCHNGP PTR(24),       /* PSS CHAIN PTR               * 00095000
*        2  PABOFFST PTR(8),           /* OFFSET FROM CONTROL BLOCK   * 00096000
*        2  PABDVTA PTR(24),           /* DVT ADDRESS                 * 00097000
*        2  PABRPHFG PTR(31),          /* SCHED FLAGS AND RPH         * 00098000
*           3  PABFLAGS BIT(8),        /* SCHEDULING FLAGS            * 00099000
*              4  PABAPYP BIT(1),      /* APPLICATION IS A USER EXIT  * 00100000
*              4  PABPRIOR BIT(1),     /* IMMEDIATE PRIORITY          * 00101000
*              4  PABNORPR BIT(1),     /* NORMAL PRIORITY -           * 00102000
*                                      /* RESCHEDUALABLE              * 00103000
*              4  PABDYNAM BIT(1),     /* DYNAMIC                     * 00104000
*              4  PABSSN BIT(1),       /* SYSTEM SERVICES             * 00105000
*              4  PABERLCK BIT(1),     /* PAB ERROR LOCK FLAG         * 00106000
*                 5  PABERRLK BIT(1),  /* ERROR LOCK                  * 00107000
*                    6  PABERLOK BIT(1), /* ERROR LOCK                * 00108000
*/*    ABNORMAL TO ALLOW VARY COMPARE AND SWAP                        * 00109000
*              4  PABINHBT BIT(1) ABNL,/* 1=INHIBIT TRAFFIC,0=NO      * 00110000
*              4  PABNODQ BIT(1),      /* DO NOT DEQ WORK ELEMENT     * 00111000
*           3  PABRPHA PTR(24);        /* RPL HEADER ADDRESS          * 00112000
*DCL PABWEQG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABWEQG OFF     * 00113000
*    PABWEQG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABWEQG ON      * 00114000
*    PABCHNG0 BIT(32) CONSTANT('7FFFFFFF'X),  /* TURN PABCHNG OFF     * 00115000
*    PABCHNG1 BIT(32) CONSTANT('80000000'X),  /* TURN PABCHNG ON      * 00116000
*    PABRESC0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PABRESCH OFF    * 00117000
*    PABRESC1 BIT(32) CONSTANT('40000000'X),  /* TURN PABRESCH ON     * 00118000
*    PABCDP0  BIT(32) CONSTANT ('DFFFFFFF'X), /* TURN PABCDP OFF      * 00119000
*    PABCDP1  BIT(32) CONSTANT ('20000000'X), /* TURN PABCDP ON       * 00120000
*    PABERLK0 BIT(32) CONSTANT('FBFFFFFF'X),  /* TURN PABERRLK ON     * 00121000
*    PABERLK1 BIT(32) CONSTANT('04000000'X),  /* TURN PABERRLK OFF    * 00122000
*    PABUNCO0 BIT(32) CONSTANT('EFFFFFFF'X),  /* TURN PABUNCON OFF    * 00123000
*    PABUNCO1 BIT(32) CONSTANT('10000000'X),  /* TURN PABUNCON ON     * 00124000
*    PABPRIR0 BIT(32) CONSTANT('BFFFFFFF'X),  /* TURN PAB PRIOR OFF   * 00125000
*    PABPRIR1 BIT(32) CONSTANT('40000000'X),  /* TURN PAB PRIOR ON    * 00126000
*    PABRST0  BIT(32) CONSTANT('F7FFFFFF'X),  /* TURN PABRESET OFF    * 00127000
*    PABRST1  BIT(32) CONSTANT('08000000'X);  /* TURN PABRESET ON     * 00128000
*/* LOCKWORD FORMAT DSECT                                            */ 00129000
*/*  INITIAL LEVEL                                     001 05/24/74  */ 00130000
*DCL 1 ISTLOK BDY(WORD) BASED,                                     0038 00131000
*     2  LOKCT CHAR(1) BDY(WORD),       /* COUNT OF LOCK OWNERS      */ 00132000
*     2  LOKCHN PTR(24),                /* ADDR OF NEXT RPH WAITING     00133000
*                                          ON LOCK                   */ 00134000
*        3  LOKCHNG CHAR(3),            /* CHAIN/FLAGS               */ 00135000
*           4 *        CHAR(2),                                    0038 00136000
*           4 *        BIT(8),                                     0038 00137000
*             5 *        BIT(6),                                   0038 00138000
*             5  LOKPRY BIT(1),         /* PRIORITY FLAG, 1 = ON     */ 00139000
*             5  LOKXCL BIT(1);         /* EXCLUSIVE FLAG, 1 = ON    */ 00140000
*DCL LOKXCL1  BIT(32) CONSTANT('00000001'X); /* CONSTANT TO TURN LOKXCL 00141000
*                                          ON                        */ 00142000
*DCL LOKPRY1  BIT(32) CONSTANT('00000002'X); /* CONSTANT TO TURN LOKPRY 00143000
*                                          ON                        */ 00144000
*DCL LOKCHN1  BIT(32) CONSTANT('00FFFFFC'X); /* CONSTANT TO TURN LOKXCL 00145000
*                                          AND LOKPRY OFF            */ 00146000
*DCL LOKCT1   BIT(32) CONSTANT('01000000'X); /* CONSTANT TO MAKE LOKCT  00147000
*                                          = 1                       */ 00148000
*DCL LOKCT255 BIT(32) CONSTANT('FF000000'X); /* CONSTANT TO CHECK FOR   00149000
*                                          MAX LOKCT (255)           */ 00150000
*              /* DYNAMIC PAB 1K633 */                             0044 00151000
* /* 1K0997 JAN 20, 1973  MB   */                                  0044 00152000
* /* 1K1142 MAR 03, 1973  MB   */                                  0044 00153000
* DCL 1 ISTDYPAB BDY(DWORD) BASED, /* LEVEL 1 DECLARE 1K633 */     0044 00154000
*       2  DYPTYPE CHAR(1), /* CONTROL BLOCK TYPE CODE 1K633 */    0044 00155000
*       2  DYPLNGTH PTR(8), /* CONTROL BLOCK LENGTH (BYTES)  1K633 */   00156000
*       2 DYPFLGS CHAR(2),     /* FLAGS 1K633 */                   0044 00157000
*       2 DYPCHAIN PTR(31),    /* CHAIN POINTER 1K633 */           0044 00158000
*       2 DYPTSKID PTR(31),    /* TASKID OR PTR TO PSS TABLES 1K633 */  00159000
*       2  DYPRSV01 PTR(31),   /* RESERVED TO PRESERVE ALIGNMENT   0044 00160000
*                                                             1K0997 */ 00161000
*       2 DYPPAB CHAR(LENGTH(ISTPAB)) BDY(DWORD); /* LENGTH OF 1K0997   00162000
*                                                    PAB         */     00163000
*DCL DYTYP   BIT(8) CONSTANT ('11'X);   /* TYPE           1K1142 */     00164000
*/* RPL HEADER                                                        * 00165000
*/*  REVISIONS                                         006 04/09/75   * 00166000
*DCL RPHPTR PTR(31) REGISTER(1) RESTRICTED;                        0046 00167000
*DCL  1  ISTRPH BDY(WORD) BASED(RPHPTR),                           0047 00168000
*       2  RPHTYPE CHAR(1),            /* CONTROL BLOCK TYPE          * 00169000
*       2  RPHLNGTH PTR(8),            /* LENGTH IN BYTES             * 00170000
*       2  RPHFLAGS BIT(8),            /* SYSTEM DEPENDENT FLAGS      * 00171000
*         3  RPHOGIND BIT(1),          /* OPEN GATE INDICATOR         * 00172000
*         3  RPHSPGIN BIT(1),          /* SPECIAL GATE OPEN IND.      * 00173000
*         3  RPHAPTYP BIT(1),          /* APS IS A USER EXIT          * 00174000
*            4  RPHAUTEX BIT(1),        /*EXIT TO AUTHORIZED USER VS2 * 00175000
*         3  RPHSMQ BIT(1),            /* INDICATOR IF RPH IS TO BE   * 00176000
*                                      /* QUEUED                      * 00177000
*         3  RPHSMTYP BIT(1),          /* REQUEST TYPE IS BUFFER OR   * 00178000
*                                      /* DOUBLE-WORD                 * 00179000
*         3  RPHSMCLR BIT(1),          /* INDICATOR IF BUFFER TO BE   * 00180000
*                                      /* CLEARED                     * 00181000
*           3  RPHMLTCP BIT(1),        /* USED BY LOCAL 3270  SUPPORT * 00182000
*                                      /* WHEN BUILDING MULTIPLE CHAN * 00183000
*                                      /* PROGRAM                     * 00184000
*           3  RPHFSTLC BIT(1),        /* USED BY LOCAL 3270 SUPPORT  * 00185000
*                                      /* TO INDICATE FIRST LCCW      * 00186000
*              4  RPHFNFLG BIT(1),     /* LCCW SET FUNCTION FLAGS     * 00187000
*        2  RPHFLGB BIT(8),            /* SECOND FLAG BYTE            * 00188000
*           3  RPHLOCK BIT(1),         /* LOCKING OPTION              * 00189000
*           3  RPHBSSP BIT(1),         /* SYSTEM SERVICES PROGRESS    * 00190000
*           3  RPHFBAPS BIT(1),        /* STG. OBTAINED BY APS        * 00191000
*           3  RPHPGCMP BIT(1),        /* BIT ON INDICATES RESOURCE   * 00192000
*                                      /* MGR HAS COMPLETED UNLOCK    * 00193000
*           3  RPHNRSAV BIT(1),        /* DO NOT SAVE ON ACTIVATE     * 00194000
*           3  RPHRLCRA BIT(1),        /* RPH CAN BE RELEASED         * 00195000
*                                      /* WHEN PURGE COMPLETE         * 00196000
*           3  *        BIT(2),        /* RESERVED                    * 00197000
*       2  RPHRPHA PTR(31),            /* ADDR.OF NEXT RPL HEADER     * 00198000
*         3  RPHGATE BIT(1),           /* GATING FLAG                 * 00199000
*         3  *       BIT(7),           /* RESERVED                    * 00200000
*         3  RPHRPHAP PTR(24),                                     0047 00201000
*       2  RPHTSKID PTR(31),           /* TASK IDENTIFICATION         * 00202000
*                                      /* OR ADDR.OF APS TABLE        * 00203000
*          3  *     CHAR(3),           /* RPH TSK ID                  * 00204000
*          3  RPHTIK PTR(8),           /* TIK                         * 00205000
*       2  RPHDVTA PTR(31),            /* ADDR.OF  CURRENT DVT        * 00206000
*       2  RPHRESMA PTR(31) BDY(WORD), /* TPWAIT-POST INFO */      0047 00207000
*         3 RPHWPFLG CHAR(1),          /* WAIT-POST FLAGS */       0047 00208000
*           4 RPHRSKEY BIT(4),         /* STORAGE PROTECT KEY TO RESUME 00209000
*                                         PROCESSING                  * 00210000
*           4 RPHWT BIT(1),            /* WAIT BIT */              0047 00211000
*           4 RPHPT BIT(1),            /* POST BIT */              0047 00212000
*           4 RPHPURGE BIT(1),         /* RPH FLAGGED BY RECOVERY    */ 00213000
*                                      /* TO BE PURGED BY PSS        */ 00214000
*                                      /* VS/2 ONLY                  */ 00215000
*           4 RPHRSV01 BIT(1),        /* RESERVED                    */ 00216000
*         3 RPHRESUM PTR(24),          /* RESUME ADDRESS */        0047 00217000
*       2  RPHPABOF PTR(8),            /* OFFSET OF PAB IN CONTROL BLK* 00218000
*       2  RPHMAJCB PTR(24),           /* ADDR.OF MAJOR CONTROL BLOCK * 00219000
*       2  RPHWEA PTR(31),             /* ADDR.OF WORK ELEMENT        * 00220000
*         3  RPHCSPA PTR(31),          /* ADDR OF ISTCSP              * 00221000
*           4  RPHWEGT BIT(1),         /* GATE FOR WORK ELEMENT PROC. * 00222000
*       2  RPHSRPRM PTR(31),           /* SERVICE ROUTINE PARM.FIELD  * 00223000
*         3 RPHSRP12 FIXED(15),        /* COUNT OF Q'ED SMS REQUESTS  * 00224000
*         3 RPHSRP34 FIXED(15),        /* SIZE OF Q'ED SMS REQUESTS   * 00225000
*       2  RPHCRR PTR(31),             /* ADDR.OF COMPONENT RECOVERY  * 00226000
*                                      /* RECORD                      * 00227000
*       2  RPHPABQA PTR(31),           /* PAB QUEUE ADDRESS           * 00228000
*          3 RPHPABFG CHAR(1),         /* FLAG BYTE CARRIED FROM PAB  * 00229000
*          3 RPHPABQP PTR(24),         /* POINTER TO QUEUE OF PAB'S   * 00230000
*       2  RPHWORK CHAR(64) BDY(WORD), /* 16 WORD WORK AREA           * 00231000
*         3  RPHSAVE1 FIXED(31),       /*                             * 00232000
*           4  RPHSBYTE CHAR(1),       /* 1-BYTE SAVE FIELD           * 00233000
*           4  RPHSBITS BIT(8),        /* SAVE FIELD FOR FLAG BYTE    * 00234000
*              5  RPHSBIT1 BIT(1),     /* 1ST SAVE FIELD              * 00235000
*              5  RPHSBIT2 BIT(1),     /* 2ND SAVE FIELD              * 00236000
*              5  RPHSBIT3 BIT(1),     /* 3RD SAVE FIELD              * 00237000
*              5  RPHSBIT4 BIT(1),     /* 4TH SAVE FIELD              * 00238000
*              5  RPHSBIT5 BIT(1),     /* 5TH SAVE FIELD              * 00239000
*              5  RPHSBIT6 BIT(1),     /* 6TH SAVE FIELD              * 00240000
*              5  RPHSBIT7 BIT(1),     /* 7TH SAVE FIELD              * 00241000
*              5  RPHSBIT8 BIT(1),     /* 8TH SAVE FIELD              * 00242000
*           4  RPHSHALF FIXED(15),     /* HALF WORD SAVE AREA         * 00243000
*         3  RPHSAVE2 FIXED(31),       /*                             * 00244000
*         3  RPHSAVE3 FIXED(31),       /*                             * 00245000
*         3  RPHSAVE4 FIXED(31),       /*                             * 00246000
*         3  RPHSAVE5 FIXED(31),       /*                             * 00247000
*         3  RPHSAVE6 FIXED(31),       /*                             * 00248000
*         3  RPHSAVE7 FIXED(31),       /*                             * 00249000
*         3  RPHSAVE8 FIXED(31),       /*                             * 00250000
*         3  RPHSAVE9 FIXED(31),       /*                             * 00251000
*         3  RPHSAV10 FIXED(31),       /*                             * 00252000
*         3  RPHSAV11 FIXED(31),       /*                             * 00253000
*         3  RPHSAV12 FIXED(31),       /*                             * 00254000
*         3  RPHSAV13 FIXED(31),       /*                             * 00255000
*         3  RPHSAV14 FIXED(31),       /*                             * 00256000
*         3  RPHSAV15 FIXED(31),       /*                             * 00257000
*         3  RPHSAV16 FIXED(31),       /*                             * 00258000
*       2  RPHNEXPO PTR(31);           /* ADDR.NEXT RPH TO BE POSTED  * 00259000
* DCL RPTYPE BIT(8) CONSTANT('01'X);   /* TYPE CODE FOR RPH           * 00260000
* DCL RPHWT0 BIT(32) CONSTANT('F7FFFFFF'X);   /* TURN RPHWT OFF */ 0049 00261000
* DCL RPHWT1 BIT(32) CONSTANT('08000000'X);   /* TURN RPHWT ON */  0050 00262000
* DCL RPHPT0 BIT(32) CONSTANT('FBFFFFFF'X);   /* TURN RPHPT OFF */ 0051 00263000
* DCL RPHPT1 BIT(32) CONSTANT('04000000'X);   /* TURN RPHPT ON */  0052 00264000
* DCL RPHPABQ1 BIT(24) CONSTANT('000000'X); /* TURN RPHPBQ GATE */ 0053 00265000
*/*  REVISIONS                                         011 04/25/75   * 00266000
*DCL ATCLCPTR PTR LOCATION(1032);      /* POINTER TO ATCVT            * 00267000
*DCL  1  ISTATCVT BDY(DWORD) BASED,                                0055 00268000
*        2  ATCCOM BDY(WORD),          /* SYSTEM INDEPENDENT FIELDS   * 00269000
*           3  ATCSTAT CHAR(4),        /* VTAM  STATUS INDICATORS     * 00270000
*              4  ATCSTAT1 CHAR(1),    /* VTAM  STATUS BYTE 1         * 00271000
*                 5  ATCSTART BIT(1),  /* VTAM  IS STARTING           * 00272000
*                 5  ATCACTIV BIT(1),  /* VTAM  IS ACTIVE             * 00273000
*                 5  ATCSNHLT BIT(1),  /* VTAM  SESSION HALT          * 00274000
*                 5  ATCQKHLT BIT(1),  /* VTAM  QUICK HALT            * 00275000
*                 5  ATCNETSL BIT(1),  /* NETSOL=YES SPECIFIED ON CMD * 00276000
*                 5  ATCINHLT BIT(1),  /* INTERNAL VTAM HALT QUICK    * 00277000
*                 5 * BIT(2),          /* RESERVED                    * 00278000
*              4  ATCSTFLG BIT(8),     /* STORAGE MANAGEMENT FLAGS    * 00279000
*                 5  ATCHSDMF BIT(1),  /* SYSTEM SLOW DOWN FLAG       * 00280000
*              4  ATCPOFLG BIT(8),     /* PROGRAM OPERATOR            * 00281000
*                                      /* INTERFACE FLAGS             * 00282000
*                 5 ATCPOUNS BIT(1),   /* APPLICATION AUTHORIZED TO   * 00283000
*                                      /* RECEIVE UNSOLICITED MESSAGES* 00284000
*                                      /* 1 = YES                     * 00285000
*                 5 *        BIT(7),   /* RESERVED                    * 00286000
*              4  ATCSTAT4 CHAR(1),    /* VTAM  STATUS BYTE 4         * 00287000
*                 5  ATCPRTAT BIT(1),  /* 1 = TRACE PRINT ACTIVE,  0055 00288000
*                                         0 = NOT ACTIVE              * 00289000
*                 5  ATCTPRT BIT(1),   /* WHEN 1, TPRINT IN PROCESS   * 00290000
*                 5  ATCMTST BIT(1),   /* WHEN 1, MODIFY TEST IN   0055 00291000
*                                         PROCESS                     * 00292000
*                 5  ATCNCSD BIT(1),   /* NCS QUIESCED DURING HALT    * 00293000
*                 5  ATCRSV04 BIT(4),  /* RESERVED                    * 00294000
*           3  ATCAPI PTR(31),         /* ADDR OF API ROUTINE         * 00295000
*           3  ATCDCFRR PTR(31),       /* POINTER TO FRR OF CONTROL     00296000
*                                         LAYER,INITIALIZED BY OPENDST* 00297000
*           3  ATCRDT PTR(31),         /* POINTER TO FIRST RDT        * 00298000
*           3  ATCSRT PTR(31),         /* POINTER TO SRT DIRECTORY    * 00299000
*           3  ATCASCHD PTR(31),       /* POINTER TO AP SCHEDULER     * 00300000
*           3  ATCECMOD CHAR(4),       /* ECB FOR MODIFY COMMAND PROC.* 00301000
*           3  ATCMODQ PTR(31),        /* POINTER FOR OUTPUT QUEUE    * 00302000
*                                      /* FOR MODIFY COMMAND          * 00303000
*           3  ATCECHLT CHAR(4),       /* ECB FOR HALT COMMAND        * 00304000
*           3  ATCHALTQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 00305000
*                                      /* FOR HALT COMMAND            * 00306000
*           3  ATCECVRY CHAR(4),       /* ECB FOR VARY COMMAND PROC.  * 00307000
*           3  ATCVARYQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 00308000
*                                      /* FOR VARY COMMAND            * 00309000
*           3  ATCECDSP CHAR(4),       /* ECB FOR DISPLAY COMMAND     * 00310000
*           3  ATCDSPLQ PTR(31),       /*  POINTER TO OUTPUT QUEUE    * 00311000
*                                      /* FOR DISPLAY COMMAND         * 00312000
*           3  ATCOCHA PTR(31),        /* POINTER TO OCT HEADER       * 00313000
*           3  ATCECSES CHAR(4),       /* ECB TO HALT SESSION MODE    * 00314000
*           3  ATCECVRQ CHAR(4),       /* ERP ECB FOR VARY REQ. INFO. * 00315000
*                                      /* REQUEST NOTIFICATION        * 00316000
*           3  ATCVPARM PTR(31),       /* ADDR OF VARY PARAMETERS     * 00317000
*           3  ATCECOPC CHAR(4),       /* ECB TOINDICATE OPERATOR     * 00318000
*                                      /* CONTROL PROCESSING COMPLETE * 00319000
*           3  ATCECNET CHAR(4),       /* ERP ECB FOR NETWORK         * 00320000
*                                      /* CONFIGURATION REQUEST       * 00321000
*           3  ATCECPRM PTR(31),       /* POINTER TO QAB FOR ERP'S    * 00322000
*                                      /* ECB PARAMETERS              * 00323000
*           3  ATCHLTMS PTR(31),       /* POINTER TO HALT COMMAND     * 00324000
*                                      /* OR HALT RETURN MESSAGE      * 00325000
*           3  ATCFSB PTR(31),         /* PTR TO FEEDBACK STATUS      * 00326000
*                                      /* BLOCK                       * 00327000
*           3  ATCFRSCH PTR(31),       /* POINTER TO FEEDBACK         * 00328000
*                                      /* ROUTINE SCHEDULER           * 00329000
*           3  ATCRDTH PTR(31),        /*  POINTER RDT HEADER         * 00330000
*           3  ATCACCTA PTR(31),       /* POINTER TO INSTALLATION     * 00331000
*                                      /* ACCOUNTING ROUTINE          * 00332000
*           3  ATCAUTHA PTR(31),       /* POINTER TO INSTALLATION     * 00333000
*                                      /* AUTHORISATION ROUTINE       * 00334000
*           3  ATCPTCHA PTR(31),       /* PTR TO VTAM PATCH AREA      * 00335000
*           3  ATCCONFT PTR(31),       /* POINTER TO VTAM             * 00336000
*                                      /* CONFIGURATION TABLE         * 00337000
*           3  ATCFDVT PTR(31),        /* PTR TO FIRST DVT FOR O/C    * 00338000
*           3  ATCFEPT PTR(31),        /* PTR TO FIRST EPT FOR O/C    * 00339000
*           3  ATCDVTPT PTR(31),       /* ADDR OF LOAD MOD FOR        * 00340000
*                                      /* TYPE=VTAM TRACING           * 00341000
*           3  ATCBPDA PTR(31),        /* PTR TO BUFFER POOL DIRECTORY* 00342000
*           3  ATCADD PTR(31),         /* POINTER TO ADD PROCEDURE    * 00343000
*           3  ATCREMOV PTR(31),       /* POINTER TO REMOVE PROCEDURE * 00344000
*           3  ATCIOTRC PTR(31),       /*  POINTER TO I/O TRACE       * 00345000
*                                      /* PROCEDURE                   * 00346000
*              4 ATCTHTRC PTR(31),     /* ADDR OF TH TRACE ROUTINE    * 00347000
*                5 ATCTPBUF PTR(31),   /* TPIOS BUFFER TRACE(ISTRARTP)* 00348000
*           3  ATCBFTRC PTR(31),       /* PTR TO BUFFER TRACE         * 00349000
*                                      /* PROCEDURE                   * 00350000
*           3  ATCFBRPH PTR(31),       /* ADDR OF FEEDBACK PROC RPH   * 00351000
*           3  ATCBLDLA PTR(31),       /* ADDR OF BLDL ROUTINE        * 00352000
*           3  ATCALOAD PTR(31),       /* ADDR OF ALOAD ROUTINE       * 00353000
*           3  ATCREADA PTR(31),       /* ADDR OF SOURCE READ ROUTINE * 00354000
*           3  ATCGTSTR PTR(31),       /* ADDR OF GETSTOR ROUTINE     * 00355000
*           3  ATCFRSTR PTR(31),       /* ADDR OF FREESTOR ROUTINE    * 00356000
*           3  ATCSTMA PTR(31),        /* ADDR OF SM INITIALIZATION   * 00357000
*                                      /* ROUTINE                     * 00358000
*           3  ATCACDA PTR(31),        /* ADDR OF FIRST ACDEB         * 00359000
*           3  ATCSMRQ PTR(31),        /* ADDR OF REQUEST STORAGE     * 00360000
*                                      /* ROUTINE                     * 00361000
*           3  ATCSMQU PTR(31),        /* ADDR OF QUEUE REQUEST RTNE    00362000
*                                         - DOS ONLY                  * 00363000
*           3  ATCSMRS PTR(31),        /* ADDR OF RELEASE STORAGE     * 00364000
*                                      /* ROUTINE                     * 00365000
*           3  ATCSMRC PTR(31),        /* ADDR OF RECOVER STORAGE     * 00366000
*                                      /* ROUTINE  - DOS ONLY         * 00367000
*           3  ATCSMBQ PTR(31),        /* PTR TO Q'ED REQ. SMS RTN.   * 00368000
*           3  ATCFIRA PTR(31),        /* ADDR OF FEEDBACK INITIATION * 00369000
*                                      /* RPH                         * 00370000
*           3  ATCSRTAD PTR(31),       /* PTR TO SRTADD ROUTINE       * 00371000
*           3  ATCSRTDF PTR(31),       /* PTR TO SRTDELE ROUTN        * 00372000
*           3  ATCDCC60 PTR(31),       /* PTR TO ISTDCC60 - CTL. LAYER  00373000
*                                         MOVE TO USER AREA           * 00374000
*           3  ATCDCC61 PTR(31),       /* PTR TO ISTDCC61 - CTL. LAYER  00375000
*                                         MOVE FIXED TO PAGABLE       * 00376000
*/*  BEGIN 'ANY' DVT                                                  * 00377000
*           3  ATCNERST PTR(31),       /* PTR TO ISTDCC00 - REQUEST-ST* 00378000
*           3  ATCNERCV PTR(31),       /* PTR TO ISTRCC21-RECEIVE OB  * 00379000
*           3  ATCNERNE PTR(31),      /* PTR TO ISTDCC25 - READ-ANY   * 00380000
*           3  ATCNERFN PTR(31),      /* PTR TO ISTDCC02 - REQUEST-FN * 00381000
*/*  END 'ANY' DVT                                                    * 00382000
*           3  ATCAPOST PTR(31),      /* PTR TO VTAM  POST ROUTINE    * 00383000
*           3  ATCVTMID CHAR(2),      /* HOST MAJOR NODE I.D.         * 00384000
*           3  ATCRSV11 CHAR(2),      /* RESERVED                     * 00385000
*           3 ATCRCC63 PTR(31),  /* HSKPANYQ POINTER                  * 00386000
*           3 ATCRCC26 PTR(31),  /* SEND RESPONSE POINTER             * 00387000
*           3 ATCRCC65 PTR(31),  /* SET RPL POINTER                   * 00388000
*           3  ATCNESAL PTR(31),      /* PTR TO ISTDCC24 - SOLICIT-ALL* 00389000
*           3  ATCNERAP PTR(31),       /* PTR TO ISTDCC85 - READ ANY    00390000
*                                         PURGE                       * 00391000
*           3 ATCACTRM FIXED(15),     /* COUNT OF ACTIVE TERMINALS    * 00392000
*           3 ATCCIDM BIT(16),        /* CID MASK                     * 00393000
*           3 ATCMSGSP BIT(8), /* RESERVED FOR MESAGE SURPRESSION     * 00394000
*         2 ATCMAXID PTR(8),   /* MAXIMUM NUMBER OF MAJOR NODES, 0 =    00395000
*                                 NUMBER OF ENTRIES IN THE MNT        * 00396000
*         2 ATCRSV16 CHAR(2),  /* NOT USED                            * 00397000
*         2 ATCMNT PTR(31),    /*PTR TO MAJOR NODE TABLE -SET BY SYS.   00398000
*                                DEF. REF. BY ISTSDCCB (CBDEF),    0055 00399000
*                                ISTSDCCI (CINDEXY)                   * 00400000
*         2 ATCCDADD PTR(31),  /*PTR TO CIDADD ROUTINE ISTSDCCA    0055 00401000
*                                 REF. BY CIDCTL MACRO                * 00402000
*         2 ATCCDDEL PTR(31),  /*PTR TO CIDDEL ROUTINE ISTSDCCD    0055 00403000
*                                 REF. BY CIDCTL MACRO                * 00404000
*         2 ATCCDFND PTR(31),  /*PTR TO CIDFND ROUTINE IATSDCCF    0055 00405000
*                                 REF. BY CIDCTL MACRO                * 00406000
*         2 ATCESC01 PTR(31),  /*PTR TO ESC01                         * 00407000
*         2 ATCESC02 PTR(31),  /*PTR TO ESC02                         * 00408000
*         2 ATCCSMR PTR(31),        /* PTR TO CONNECTION SERVICES     * 00409000
*                                   /*  MASTER ROUTINE                * 00410000
*           3 ATCCSMA PTR(31),      /* PTR TO CONNECTION SERVICES  0055 00411000
*                                      MASTER ROUTINE                 * 00412000
*         2 ATCOCRT PTR(31),        /* PTR TO OPEN/CLOSE ROUTINE      * 00413000
*         2 ATCUEP  PTR(31),        /* POINTER TO USER EXIT           * 00414000
*         2 ATCSHRTN CHAR(8),       /* NAME OF VTAM  SHARED RTN       * 00415000
*                                   /*  TO BE LOADED                  * 00416000
*         2 ATCSHRFG BIT(8),        /* ATTRIBUTE FLAGS                * 00417000
*           3 ATCLAST BIT(1),       /* INDICATE HTIS IS LAST MODULE   * 00418000
*         2 ATCXRANG CHAR(1),       /* NUMBER OT BITS IN X-VALUE   0055 00419000
*                                       PORTION   OF CID              * 00420000
*         2 ATCSAF   CHAR(2),       /* SUB AREA ADDRESS FIELD         * 00421000
*         2 ATCEPA PTR(31),         /* ENTRY POINT ADDR OF LOADED     * 00422000
*         2 ATCALERT PTR(31),       /* POINTER TO ALERT-ROUTINE    0055 00423000
*                                      ISTSDCAL                       * 00424000
*         2 ATCDVLOD PTR(31),       /* PTR TO ISTSDCOD                * 00425000
*         2 ATCTRCPT PTR(31),       /* POINTER TO TRACE PARM LIST     * 00426000
*         2 ATCDVT   PTR(31),       /* POINTER TO FIRST DVT ON CHAIN  * 00427000
*         2 ATCEPT   PTR(31),       /* POINTER TO FIRST EPT ON CHAIN  * 00428000
*         2 ATCMSGP PTR(31),        /* POINTER TO TPMSG PROCESSOR     * 00429000
*         2 ATCMSGM PTR(31),        /* POINTER TO TPMSG - MESSAGE  0055 00430000
*                                      CSECT                          * 00431000
*         2 ATCTRPAB  PTR(31),      /* ADDRESS OF TRACE WRITER PAB    * 00432000
*         2 ATCVTLOD PTR(31),       /* ADDR OF VTAM LOAD LIST         * 00433000
*         2 ATCECPRT CHAR(4),       /* ECB FOR TRACE FILE PRINT       * 00434000
*         2 ATCZDVTB PTR(31),       /* ADDRESS OF ISTZCFBI            * 00435000
*         2 ATCECTLP CHAR(4),       /* TOLTEP ECB                     * 00436000
*         2 ATCRVCHS CHAR(8),       /* RESERVED                       * 00437000
*         2 ATCCRME  PTR(31),       /* VARY PSS CONTROL MECHANISM     * 00438000
*         2 ATCHPGM,                /* BUFFER INFORMATION            */ 00439000
*           3 ATCHBFNO FIXED(15),   /* NUMBER OF BUFFS FOR CHANNEL   */ 00440000
*           3 ATCHBSIZ FIXED(15),   /* BUFFER SIZE IN BYTES          */ 00441000
*         2 ATCDEBCH PTR(31),       /* CLOSE DEB CHAIN PTR           */ 00442000
*         2 ATCTODVT PTR(31),       /* THE TOLTEP DVT PTR POINTED  0055 00443000
*                                      TO BY 3RD WORD OF PAB         */ 00444000
*         2 ATCADEL  PTR(31),       /* A DELETE ROUTINE ADDRESS      */ 00445000
*         2 ATCCDPTR PTR(31),       /* PTR TO ISTOCCCD - DOS ONLY    */ 00446000
*         2 ATCLDNCS PTR(31),       /* PTR TO NCSPL FOR LOAD/DUMP    */ 00447000
*         2 ATCLDECB BIT(32),       /* ECB FOR LOAD/DUMP SUBTASK     */ 00448000
*         2 ATCRSV99 CHAR(32),      /* RESERVED FOR LATER POINTERS   */ 00449000
*         2 ATCAP33 PTR(31),        /* PTR TO ISTAPC33               */ 00450000
*         2 ATCAP35 PTR(31),        /* PTR TO ISTAPC35               */ 00451000
*         2 ATCAP36 PTR(31),        /* PTR TO ISTAPC36               */ 00452000
*         2 ATCDVTLK CHAR(LENGTH(ISTLOK)), /* LOCK WORD FOR DVT LOCK */ 00453000
*         2 ATCCDFIN PTR(31),       /* POINTER TO ISTSDCRR           */ 00454000
*         2 ATCCDFDN PTR(31),       /* POINTER TO ISTSDCCN           */ 00455000
*         2 ATCVOCLK CHAR(LENGTH(ISTLOK)), /* VOCLOCK LOCK           */ 00456000
*         2 ATCRDTLK CHAR(LENGTH(ISTLOK)), /* RDTLOCK LOCK           */ 00457000
*         2 ATCRSV97 PTR(31),              /* DWORD ALIGNMENT        */ 00458000
*         2 ATCVPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR VARY 00459000
*                                           UNDER PSS CONTROL        */ 00460000
*         2 ATCPGPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* ERP PAB FOR  00461000
*                                      PURGE                         */ 00462000
*         2 ATCDLRPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* DUMP LOAD &  00463000
*                                           RESTART PAB              */ 00464000
*         2 ATCCCLAD PTR(31),       /* ADDRESS OF VARY ERP (ISTINCCL)*/ 00465000
*         2 ATCCDLAD PTR(31),       /* ADDRESS OF VARY DUMP,LD RSTRT    00466000
*                                      (ISTINCDL)                    */ 00467000
*         2 ATCOCCOB PTR(31),       /* ADDRESS ISTOCCOB              */ 00468000
*         2 ATCOCCCB PTR(31),       /* ADDRESS ISTOCCCB              */ 00469000
*         2 ATCTIPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0055 00470000
*                                           FOR ISTOLTP              */ 00471000
*         2 ATCTCIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0055 00472000
*                                           FOR TOLTEP CLIP          */ 00473000
*         2 ATCVTIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0055 00474000
*                                           FOR TOLTEP-VTAM INTERFACE*/ 00475000
*         2 ATCTCLOM PTR(31),      /* ADDR TOLTEP CLOP PROC          */ 00476000
*         2 ATCTCLIM PTR(31),      /* ADDR TOLTEP CLIP PROC          */ 00477000
*         2 ATCVTINM PTR(31),      /* ADDR TOLTEP-VTAM INTF PROC     */ 00478000
*         2 ATCTACB  PTR(31),      /* TOLTEP ACB                     */ 00479000
*         2 ATCRSV10 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* RESERVED  */ 00480000
*         2 ATCPTR00 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB     */ 00481000
*         2 ATCCFEAD PTR(31),          /* ADDR OF ISTINCFE           */ 00482000
*         2 ATCVLCNT CHAR(4) BDY(HWORD), /* VARY DEVICE ONLINE COUNTS*/ 00483000
*           3 ATCRNCNT PTR(16),        /* 370X COUNT                 */ 00484000
*           3 ATCLCLCT PTR(16),        /* 3270 COUNT                 */ 00485000
*         2 ATCS49XI PTR(31),          /* ADDRESS OF ISTPICXI        */ 00486000
*         2 ATCS49XL PTR(31),          /* ADDRESS OF ISTPICXL        */ 00487000
*         2 ATCPODVT PTR(31),          /* PTR TO PROGRAM OPERATOR DVT*/ 00488000
*         2 ATCPOIA  PTR(31),          /* PTR TO PROGRAM OPERATOR    */ 00489000
*                                      /* INTERFACE AREA             */ 00490000
*         2 ATCSOPD CHAR(8) BDY(WORD), /* SESSION CONTROL            */ 00491000
*           3 ATCSEC01 PTR(31),        /* OUTBOUND PROCESSING        */ 00492000
*           3 ATCSEC10 PTR(31),        /* DVT                        */ 00493000
*         2 ATCSIPD CHAR(12) BDY(WORD),/* SESSION CONTROL            */ 00494000
*           3 ATCSEC21 PTR(31),        /* INBOUND PROCESSING         */ 00495000
*           3 ATCSEC30 PTR(31),        /* FEEDBACK                   */ 00496000
*           3 ATCSEC40 PTR(31),        /* DVT                        */ 00497000
*         2 ATCSECST CHAR(4) BDY(WORD),/* SESSION CONTROLSESS TERM   */ 00498000
*           3 ATCSEC51 PTR(31),        /* RECOVERY DVT               */ 00499000
*         2 ATCNMCTR FIXED(15),        /* NAME COUNTER               */ 00500000
*         2 *        FIXED(15),        /* RESERVED                   */ 00501000
*         2 ATCSRTAB PTR(31),          /* SEARCH LOGON MODE TABLE    */ 00502000
*                                      /* RTN ADDRESS (ISTINCSH)     */ 00503000
*         2 ATCUSSPT PTR(31),          /* DEFAULT USS DEFINITION     */ 00504000
*                                      /* TABLE ADDRESS (ISTINCDT)   */ 00505000
*         2 ATCMODTB PTR(31),          /* DEFAULT SYSTEM LOGON MODE  */ 00506000
*                                      /* TABLE ADDRESS (ISTINCLM)   */ 00507000
*         2 ATCINCW3 PTR(31),          /* ADDRESS OF ISTINCW3        */ 00508000
*         2 ATCIOECB PTR(31),          /* ECB USED BY IOS -          */ 00509000
*                                      /* POINTED TO BY IOBECBPT     */ 00510000
* 2 ATCVDPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0055 00511000
*                                    /* SSCP COMMAND PROCESSING PAB  */ 00512000
* 2 ATCVFPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0055 00513000
*                                    /* SSCP FRONT END PAB           */ 00514000
* 2 ATCVDLOK CHAR(LENGTH(ISTLOK)),   /* SSCP SERIALIZATION LOCK      */ 00515000
*/* END OF COMMON AREA                                               */ 00516000
*/* VS1/VS2 COMMON CODE.                                             */ 00517000
*        2  ATCRSVBB PTR(31),          /* RESERVED                    * 00518000
*        2  ATCAOSM BDY(DWORD),                                    0055 00519000
*/*                                                                   * 00520000
*           3  ATCSRBRT PTR(31),       /* POINTER TO ROUTINE UNDER    * 00521000
*                                      /* SRB CONTROL                 * 00522000
*           3  ATCGSRBQ PTR(31),       /* READY QUEUE FOR GLOBAL SRB'S* 00523000
*              4  ATCGSRBG BIT(8),     /* READY QUEUE GATE BYTE       * 00524000
*                 5  ATCGSRBF BIT(1),  /* READY QUEUE GATE BIT        * 00525000
*           3  ATCPRPH PTR(31),        /* PTR TO PREALLOCATED RPH     * 00526000
*           3  ATCCMTCB PTR(31),       /* PTR TO COMMUNICATIONS TASK  * 00527000
*                                      /* TCB                         * 00528000
*           3  ATCAP11 PTR(31),        /* PTR TO ISTAPC11             * 00529000
*           3  ATCAP12 PTR(31),        /* PTR TO ISTAPC12             * 00530000
*           3  ATCAP31 PTR(31),        /* PTR TO ISTAPC31             * 00531000
*           3  ATCAP32 PTR(31),        /* PTR TO ISTAPC32             * 00532000
*           3  ATCAP34 PTR(31),        /* PTR TO ISTAPC34             * 00533000
*           3  ATCAP52 PTR(31),        /* PTR TO ISTAPC52             * 00534000
*           3  ATCAP53 PTR(31),        /* PTR TO ISTAPC53             * 00535000
*           3  ATCAP54 PTR(31),        /* PTR TO ISTAPC54             * 00536000
*           3  ATCAP57 PTR(31),        /* PTR TO ISTAPC57             * 00537000
*           3  ATCAP58 PTR(31),        /* PTR TO ISTAPC58             * 00538000
*           3  ATCAP61 PTR(31),        /* PTR TO ISTAPC61             * 00539000
*           3  ATCAP63 PTR(31),        /* PTR TO ISTAPC63             * 00540000
*           3  ATCAP64 PTR(31),        /* PTR TO ISTAPC64             * 00541000
*           3  ATCZFSVT PTR(31),       /* TPIOS FIXED SRVICES VCTR TAB* 00542000
*           3  ATCZPSVT PTR(31),       /* TPIOS PAGBL SRVCES VCTR TABL* 00543000
*           3  ATCICNCB PTR(31),       /* HEAD OF ICNCB QUEUE         * 00544000
*           3  ATCZDVT1 PTR(31),       /* TPIOS SLODWN RECOVRY PRCSR  * 00545000
*           3  ATCZDVT3 PTR(31),       /* 370X FEEDBACK STAT CNTRL RTR* 00546000
*           3  ATCZDVT4 PTR(31),       /* OPERATOR MESSAGE SCHEDULER  * 00547000
*           3  ATCZDVT6 PTR(31),       /* DIALOGUE SCHEDULER (INBOUND)* 00548000
*           3  ATCAP65 PTR(31),        /* PTR TO ISTAPC65            */ 00549000
*           3  ATCICAPP CHAR(20) BDY(WORD), /* 3705 APPENDAGE VECTOR  * 00550000
*              4  ATCCDRPH PTR(31),    /* ADDR CLOSE DEB RPH       0055 00551000
*                                         (DUMMY EOA APP.)           */ 00552000
*              4  ATCZSIOA PTR(31),    /* ADDR 3705 SIO APPENDAGE    */ 00553000
*              4  ATCCDTCB PTR(31),    /* VTAM TCB (DUMMY PCI APP.)  */ 00554000
*              4  ATCZCEA PTR(31),     /* ADDR 3705 CHANNEL END    0055 00555000
*                                         APPENDAGE                  */ 00556000
*              4  ATCZAEA PTR(31),     /* ADDR 3705 CHANNEL END    0055 00557000
*                                         APPENDAGE                  */ 00558000
*           3  ATCLDAPP CHAR(20) BDY(WORD), /* LOCAL 3270 APPENDAGE     00559000
*                                         VECTOR                     */ 00560000
*              4  ATCCDTID PTR(31),    /* TASK ID OF VTAM          0055 00561000
*                                         (DUMP EOE)                 */ 00562000
*              4  ATCSMFRR PTR(31),    /* ADDR OF SMS FRR          0055 00563000
*                                         (DUMMY SIOA)               */ 00564000
*              4  ATCRSV17 PTR(31),    /* RESERVED FOR ALIGNMENT     */ 00565000
*              4  ATCZLCEA PTR(31),    /* ADDR 3270 CHANNEL END    0055 00566000
*                                         APPENDAGE                  */ 00567000
*              4  ATCZLAEA PTR(31),    /* ADDR 3270 CHANNEL END    0055 00568000
*                                         APPENDAGE                  */ 00569000
*           3  ATCDAPVT CHAR(24) BDY(WORD),  /* DUMMY APPENDAGE    0055 00570000
*                                         VECTOR TABLE FOR LOAD/DVMMY*/ 00571000
*              4  ATCDEOEA PTR(31),    /* ADDRESS OF DUMMY END     0055 00572000
*                                         OF EXTENT APPENDAGE        */ 00573000
*              4  ATCDSIOA PTR(31),    /* ADDRESS OF DUMMY END     0055 00574000
*                                         OF SIO APPENDAGE           */ 00575000
*              4  ATCDPCIA PTR(31),    /* ADDRESS OF DUMMY PCI     0055 00576000
*                                         APPENDAGE                  */ 00577000
*              4  ATCDCEA PTR(31),     /* ADDRESS OF CHANNEL END   0055 00578000
*                                         APPENDAGE                  */ 00579000
*              4  ATCDXCEA PTR(31),    /* ADDRESS OF ABNORMAL      0055 00580000
*                                         END APPENDAGE              */ 00581000
*              4  ATCDAPDG CHAR(2),    /* DUMMY APPENDAGE            */ 00582000
*              4  ATCRSV56 CHAR(2),    /* RESERVED                   */ 00583000
*           3  ATCZDVT7 PTR(31),       /* ADDR OF RESET CLEANUP    0055 00584000
*                                         (PHASE 1)                   * 00585000
*           3  ATCZDVT8 PTR(31),       /* 3270 LOCAL TEST AND CTL  0055 00586000
*                                         FEEDBACK ROUTER            */ 00587000
*           3  ATCZDVT9 PTR(31),       /* ADDRESS OF ISTZDFKA        */ 00588000
*           3  ATCZDVTA PTR(31),       /* ADDRESS OF ISTZCFIA        */ 00589000
*           3  ATCZDVTX PTR(31),       /* ADDRESS OF TRUNK LINE    0055 00590000
*                                         DEACTIVATE ROUTINE         */ 00591000
*           3  ATCZLPVT PTR(31),       /* ADDRESS OF ISTZPSVA        */ 00592000
*           3  ATCZLFVT PTR(31),       /* TPIOS 3270 LOCAL FIXED   0055 00593000
*                                         SERVICES VECTOR TABLE      */ 00594000
*           3  ATCZPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR   00595000
*                                         TEST AND CTL FEEDBACK ROUTER* 00596000
*           3  ATCZPAB2 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* 370X 0055 00597000
*                                         STATUS AND FEEDBACK ROUTER    00598000
*                                         DYNAMIC PAB                */ 00599000
*           3  ATCAP51  PTR(31),       /* PTR TO ISTAPC51            */ 00600000
*           3  ATCZDFJ0 PTR(31),       /* ADDR OF ISTZDFJ0           */ 00601000
*           3  ATCAP37  PTR(31),       /* PTR TO ISTAPC37            */ 00602000
*           3  ATCAP38  PTR(31),       /* PTR TO ISTAPC38            */ 00603000
*           3  ATCRPT11 PTR(31),       /* RESERVED                   */ 00604000
*           3  ATCRPT12 PTR(31),       /* RESERVED                   */ 00605000
*           3  ATCRPT13 PTR(31),       /* RESERVED                   */ 00606000
*           3  ATCRPT14 PTR(31),       /* RESERVED                   */ 00607000
*           3  ATCRPT15 PTR(31),       /* RESERVED                   */ 00608000
*           3  ATCRPT16 PTR(31),       /* RESERVED                   */ 00609000
*           3  ATCRPT17 PTR(31),       /* RESERVED                   */ 00610000
*           3  ATCRPT18 PTR(31),       /* RESERVED                   */ 00611000
*           3  ATCRPT19 PTR(31),       /* RESERVED                   */ 00612000
*           3  ATCRPT20 PTR(31),       /* RESERVED                   */ 00613000
*           3  ATCRPT21 PTR(31),       /* RESERVED                   */ 00614000
*           3  ATCRPT22 PTR(31),       /* RESERVED                   */ 00615000
*           3  ATCRPT23 PTR(31),       /* RESERVED                   */ 00616000
*           3  ATCRPT24 PTR(31),       /* RESERVED                   */ 00617000
*           3  ATCRPT25 PTR(31),       /* RESERVED                   */ 00618000
*           3  ATCRPT26 PTR(31),       /* RESERVED                   */ 00619000
*           3  ATCRPT27 PTR(31),       /* RESERVED                   */ 00620000
*           3  ATCRPT28 PTR(31),       /* RESERVED                   */ 00621000
*           3  ATCRPT29 PTR(31),       /* RESERVED                   */ 00622000
*           3  ATCRPT30 PTR(31),       /* RESERVED                   */ 00623000
*           3  ATCRPT31 PTR(31),       /* RESERVED                   */ 00624000
*           3  ATCRPT32 PTR(31),       /* RESERVED                   */ 00625000
*           3  ATCRPT33 PTR(31),       /* RESERVED                   */ 00626000
*           3  ATCRPT34 PTR(31),       /* RESERVED                   */ 00627000
*           3  ATCRPT35 PTR(31),       /* RESERVED                   */ 00628000
*           3  ATCRPT36 PTR(31),       /* RESERVED                   */ 00629000
*           3  ATCRPT37 PTR(31),       /* RESERVED                   */ 00630000
*           3  ATCRPT38 PTR(31),       /* RESERVED                   */ 00631000
*           3  ATCRPT39 PTR(31),       /* RESERVED                   */ 00632000
*           3  ATCRPT40 PTR(31),       /* RESERVED                   */ 00633000
*/* END OF VS1/VS2 COMMON CODE.                                      */ 00634000
*/* START OF VS2 UNIQUE CODE.                                        */ 00635000
*           3  ATCVTFLG BIT(32),                                   0055 00636000
*              4 ATCVTACT BIT(1),      /* VTT ACTIVE                 */ 00637000
*              4 *        BIT(31),     /* RESERVED                   */ 00638000
*           3  ATCHLTCB PTR(31),       /* ECB FOR HALTING VTAM       */ 00639000
*           3  ATCATA10 PTR(31),       /* PTR TO ISTATM10            */ 00640000
*           3  ATCZLAAB PTR(31),       /* PTR TO ISTZLFAB            */ 00641000
*           3  ATCCACXA PTR(31),       /* PTR TO ISTCFCXA            */ 00642000
*           3  ATCSMARA PTR(31),       /* PTR TO ISTORFRA            */ 00643000
*           3  ATCSMAID PTR(31),       /* PTR TO ISTORFID            */ 00644000
*           3  ATCTPWQA PTR(31),       /* WAIT Q ANCHOR FOR TPIOS    */ 00645000
*           3  ATCSMAPR PTR(31),       /* PTR TO ISTORFPR            */ 00646000
*           3  ATCSMABF PTR(31),       /* PTR TO ISTORFBF            */ 00647000
*           3  ATCPSTA  PTR(31),       /* ACTIVE PST QUEUE           */ 00648000
*           3  ATCTRMBP CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0055 00649000
*                                      /* PAB FOR VTAM TERM TASK     */ 00650000
*           3  ATCTPSPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0055 00651000
*                                      /* PAB FOR TPIOS              */ 00652000
*           3  ATCAP23  PTR(31),       /* PTR TO ISTAPC23            */ 00653000
*           3  ATCAPC25 PTR(31),       /* PTR TO ISTAPC25            */ 00654000
*           3  ATCAP41  PTR(31),       /* PTR TO ISTAPC41            */ 00655000
*           3  ATCRCFY0 PTR(31),       /* PTR TO ISTRCFY0            */ 00656000
*           3  ATCAP55  PTR(31),       /* PTR TO ISTAPC55            */ 00657000
*           3  ATCAP56  PTR(31),       /* PTR TO ISTAPC56            */ 00658000
*           3  ATCAPC59 PTR(31),       /* PTR TO ISTAPC59            */ 00659000
*           3  ATCAP62  PTR(31),       /* PTR TO ISTAPC62            */ 00660000
*           3  ATCAP66  PTR(31),       /* PTR TO ISTAPC66            */ 00661000
*           3  ATCAP69  PTR(31),       /* PTR TO ISTAPM69            */ 00662000
*           3  ATCAP82  PTR(31),       /* PTR TO ISTAPC82            */ 00663000
*           3  ATCAP83  PTR(31),       /* PTR TO ISTAPC83            */ 00664000
*           3  ATCAP84  PTR(31),       /* PTR TO ISTAPC84            */ 00665000
*           3  ATCAP85  PTR(31),       /* PTR TO ISTAPC85            */ 00666000
*           3  ATCAP86  PTR(31),       /* PTR TO ISTAPC86            */ 00667000
*           3  ATCASCB  PTR(31),       /* PTR TO VTAM ASCB           */ 00668000
*           3  ATCMPLTA  PTR(31),      /* PTR TO MPST LIST TABLE     */ 00669000
*           3  ATCZR01  PTR(31),       /* PTR TO ISTZRM01            */ 00670000
*           3  ATCAICTN PTR(31),       /* PTR TO ISTAICTN            */ 00671000
*           3  ATCTPCP0 PTR(31),       /* PTR TO ISTZFSAV            */ 00672000
*           3  ATCTPCP1 PTR(31),       /* PTR TO ISTZ19SV            */ 00673000
*           3  ATCZFLAG BIT(8),        /* FLAG BYTE                  */ 00674000
*              4 ATCZF001 BIT(1),      /* MDR RECORDING SUSPENDED    */ 00675000
*              4 ATCRSV66 BIT(7),      /* RESERVED                   */ 00676000
*           3  ATCRSV75 BIT(8),        /* RESERVED                   */ 00677000
*           3  ATCSRBCT FIXED(16),     /* COUNT OF PREALLOCATED SRB'S*/ 00678000
*           3  ATCCRACT FIXED(16),     /* COUNT OF PREALLOCATED CRA'S*/ 00679000
*           3  ATCRPLCT FIXED(16),     /* COUNT OF PREALLOCATED CRPL */ 00680000
*           3  ATCTPMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /*TP MSG PAB 00681000
*                                                         FOR VS2    */ 00682000
*           3  ATCTPMMI PTR(31),        /* PTR TO ISTCFMMI - MSG ISSUER 00683000
*                                          FOR SRB MODE ROUTINES     */ 00684000
*           3  ATCVIOPM PTR(31),       /* PTR TO ISTVIOPM            */ 00685000
*        2  ATCAOS CHAR(0) BDY(WORD);  /* VS2 ONLY FIELDS            */ 00686000
*                                                                  0056 00687000
*  DECLARE                                                         0056 00688000
*    EMCR0 PTR REG(0),                                             0056 00689000
*    EMCR1 PTR REG(1),                                             0056 00690000
*    EMCR2 PTR REG(2),                                             0056 00691000
*    EMCR3 PTR REG(3),                                             0056 00692000
*    EMCR4 PTR REG(4),                                             0056 00693000
*    EMCR5 PTR REG(5),                                             0056 00694000
*    EMCR6 PTR REG(6),                                             0056 00695000
*    EMCR7 PTR REG(7),                                             0056 00696000
*    EMCR8 PTR REG(8),                                             0056 00697000
*    EMCR9 PTR REG(9),                                             0056 00698000
*    EMCR10 PTR REG(10),                                           0056 00699000
*    EMCR11 PTR REG(11),                                           0056 00700000
*    EMCR12 PTR REG(12),                                           0056 00701000
*    EMCR13 PTR REG(13),                                           0056 00702000
*    EMCR14 PTR REG(14),                                           0056 00703000
*    EMCR15 PTR REG(15);                                           0056 00704000
*  GEN (PRINT ON);                                                 0057 00705000
         PRINT ON                                                       00706000
*/* END OF TPEPILOG */                                             0058 00707000
*END ISTINCOE                                                      0058 00708000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00709000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00710000
*;                                                                 0058 00711000
@EL00001 L     @13,4(,@13)                                         0058 00712000
@EF00001 DS    0H                                                  0058 00713000
@ER00001 LM    @14,@12,12(@13)                                     0058 00714000
         BR    @14                                                 0058 00715000
@DATA    DS    0H                                                       00716000
         DS    0F                                                       00717000
@SA00001 DS    18F                                                      00718000
         DS    0F                                                       00719000
         DS    0D                                                       00720000
CVTPTR   DS    A                                                        00721000
CMZAA003 DC    CL4'102I'                                                00722000
CMZPL003 DC    4F'0'                                                    00723000
CMZZO003 DC    F'0'                                                     00724000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00725000
@01      EQU   01                                                       00726000
@02      EQU   02                                                       00727000
@03      EQU   03                                                       00728000
@04      EQU   04                                                       00729000
@05      EQU   05                                                       00730000
@06      EQU   06                                                       00731000
@07      EQU   07                                                       00732000
@08      EQU   08                                                       00733000
@09      EQU   09                                                       00734000
@10      EQU   10                                                       00735000
@11      EQU   11                                                       00736000
@12      EQU   12                                                       00737000
@13      EQU   13                                                       00738000
@14      EQU   14                                                       00739000
@15      EQU   15                                                       00740000
REG1003  EQU   @01                                                      00741000
EMCR13   EQU   @13                                                      00742000
REG15003 EQU   @15                                                      00743000
RPHPTR   EQU   @01                                                      00744000
EMCR0    EQU   @00                                                      00745000
EMCR1    EQU   @01                                                      00746000
EMCR10   EQU   @10                                                      00747000
EMCR11   EQU   @11                                                      00748000
EMCR12   EQU   @12                                                      00749000
EMCR14   EQU   @14                                                      00750000
EMCR15   EQU   @15                                                      00751000
EMCR2    EQU   @02                                                      00752000
EMCR3    EQU   @03                                                      00753000
EMCR4    EQU   @04                                                      00754000
EMCR5    EQU   @05                                                      00755000
EMCR6    EQU   @06                                                      00756000
EMCR7    EQU   @07                                                      00757000
EMCR8    EQU   @08                                                      00758000
EMCR9    EQU   @09                                                      00759000
ATCLCPTR EQU   1032                                                     00760000
CVTMAP   EQU   0                                                        00761000
CVTDAR   EQU   CVTMAP+72                                                00762000
CVTFLGS1 EQU   CVTDAR                                                   00763000
CVTDCB   EQU   CVTMAP+116                                               00764000
CVTIERLC EQU   CVTMAP+144                                               00765000
CVTOPTA  EQU   CVTMAP+182                                               00766000
CVTOPTB  EQU   CVTMAP+183                                               00767000
CVTGTF   EQU   CVTMAP+236                                               00768000
CVTGTFST EQU   CVTGTF                                                   00769000
CVTGTFS  EQU   CVTGTFST                                                 00770000
CVTSTATE EQU   CVTGTFST                                                 00771000
CVTTMODE EQU   CVTGTFST                                                 00772000
CVTFORM  EQU   CVTGTFST                                                 00773000
CVTAQAVT EQU   CVTMAP+240                                               00774000
CVTTCMFG EQU   CVTAQAVT                                                 00775000
CVTVOLM2 EQU   CVTMAP+244                                               00776000
CVTTATA  EQU   CVTVOLM2                                                 00777000
CVTTSKS  EQU   CVTTATA                                                  00778000
CVTVOLF2 EQU   CVTTSKS                                                  00779000
CVTTAT   EQU   CVTTATA+1                                                00780000
CVTATER  EQU   CVTMAP+248                                               00781000
CVTEXT1  EQU   CVTMAP+252                                               00782000
CVTPURG  EQU   CVTMAP+260                                               00783000
CVTQMSG  EQU   CVTMAP+268                                               00784000
CVTDMSR  EQU   CVTMAP+272                                               00785000
CVTERPV  EQU   CVTMAP+316                                               00786000
CVTINTLA EQU   CVTMAP+320                                               00787000
CVTAPF   EQU   CVTMAP+324                                               00788000
CVTEXT2  EQU   CVTMAP+328                                               00789000
CVTHJES  EQU   CVTMAP+332                                               00790000
CVTPGSIA EQU   CVTMAP+348                                               00791000
CVTA1F1  EQU   CVTMAP+356                                               00792000
CVTSYSK  EQU   CVTMAP+357                                               00793000
CVTVOLM1 EQU   CVTMAP+380                                               00794000
CVTVOLF1 EQU   CVTVOLM1                                                 00795000
CVTATMCT EQU   CVTMAP+388                                               00796000
CVTXTNT1 EQU   0                                                        00797000
CVTXTNT2 EQU   0                                                        00798000
CVTDSSV  EQU   CVTXTNT2                                                 00799000
CVTFLGBT EQU   CVTXTNT2+5                                               00800000
CVTQID   EQU   CVTXTNT2+24                                              00801000
CVTSHS   EQU   CVTXTNT2+40                                              00802000
CVTRV400 EQU   CVTXTNT2+52                                              00803000
CVTRV409 EQU   CVTXTNT2+53                                              00804000
CVTATCVT EQU   CVTXTNT2+64                                              00805000
CVTRV429 EQU   CVTXTNT2+84                                              00806000
CVTRV438 EQU   CVTXTNT2+85                                              00807000
CVTRV457 EQU   CVTXTNT2+112                                             00808000
CVTRV466 EQU   CVTXTNT2+113                                             00809000
CVTFIX   EQU   0                                                        00810000
CVTRELNO EQU   CVTFIX+252                                               00811000
@NM00003 EQU   0                                                        00812000
CMZID003 EQU   @NM00003                                                 00813000
@NM00004 EQU   @NM00003+4                                               00814000
CMZSA003 EQU   0                                                        00815000
ISTPAB   EQU   0                                                        00816000
PABWQCHN EQU   ISTPAB                                                   00817000
PABWEQA  EQU   PABWQCHN                                                 00818000
PABCHAIN EQU   PABWQCHN+4                                               00819000
PABRPHFG EQU   ISTPAB+12                                                00820000
PABFLAGS EQU   PABRPHFG                                                 00821000
PABERLCK EQU   PABFLAGS                                                 00822000
PABERRLK EQU   PABERLCK                                                 00823000
ISTLOK   EQU   0                                                        00824000
LOKCHN   EQU   ISTLOK+1                                                 00825000
LOKCHNG  EQU   LOKCHN                                                   00826000
@NM00006 EQU   LOKCHNG+2                                                00827000
ISTDYPAB EQU   0                                                        00828000
ISTRPH   EQU   0                                                        00829000
RPHFLAGS EQU   ISTRPH+2                                                 00830000
RPHAPTYP EQU   RPHFLAGS                                                 00831000
RPHFSTLC EQU   RPHFLAGS                                                 00832000
RPHFLGB  EQU   ISTRPH+3                                                 00833000
RPHRPHA  EQU   ISTRPH+4                                                 00834000
RPHTSKID EQU   ISTRPH+8                                                 00835000
RPHRESMA EQU   ISTRPH+16                                                00836000
RPHWPFLG EQU   RPHRESMA                                                 00837000
RPHWEA   EQU   ISTRPH+24                                                00838000
RPHCSPA  EQU   RPHWEA                                                   00839000
RPHSRPRM EQU   ISTRPH+28                                                00840000
RPHPABQA EQU   ISTRPH+36                                                00841000
RPHWORK  EQU   ISTRPH+40                                                00842000
RPHSAVE1 EQU   RPHWORK                                                  00843000
RPHSBITS EQU   RPHSAVE1+1                                               00844000
ISTATCVT EQU   0                                                        00845000
ATCCOM   EQU   ISTATCVT                                                 00846000
ATCSTAT  EQU   ATCCOM                                                   00847000
ATCSTAT1 EQU   ATCSTAT                                                  00848000
ATCSTFLG EQU   ATCSTAT+1                                                00849000
ATCPOFLG EQU   ATCSTAT+2                                                00850000
ATCSTAT4 EQU   ATCSTAT+3                                                00851000
ATCIOTRC EQU   ATCCOM+140                                               00852000
ATCTHTRC EQU   ATCIOTRC                                                 00853000
ATCCSMR  EQU   ISTATCVT+296                                             00854000
ATCSHRFG EQU   ISTATCVT+316                                             00855000
ATCMSGP  EQU   ISTATCVT+344                                             00856000
ATCHPGM  EQU   ISTATCVT+384                                             00857000
ATCVLCNT EQU   ISTATCVT+772                                             00858000
ATCSOPD  EQU   ISTATCVT+792                                             00859000
ATCSIPD  EQU   ISTATCVT+800                                             00860000
ATCSECST EQU   ISTATCVT+812                                             00861000
ATCAOSM  EQU   ISTATCVT+912                                             00862000
ATCGSRBQ EQU   ATCAOSM+4                                                00863000
ATCGSRBG EQU   ATCGSRBQ                                                 00864000
ATCICAPP EQU   ATCAOSM+100                                              00865000
ATCLDAPP EQU   ATCAOSM+120                                              00866000
ATCDAPVT EQU   ATCAOSM+140                                              00867000
ATCVTFLG EQU   ATCAOSM+392                                              00868000
ATCZFLAG EQU   ATCAOSM+588                                              00869000
CMTA003  EQU   0                                                        00870000
CVTS01   EQU   CVTPGSIA                                                 00871000
CVTLPDIA EQU   CVTS01+12                                                00872000
CVTDIRST EQU   CVTLPDIA                                                 00873000
CVTSLIDA EQU   CVTS01+24                                                00874000
CVTCTLFG EQU   CVTS01+50                                                00875000
CVTRV210 EQU   CVTS01+424                                               00876000
CVTRV219 EQU   CVTS01+425                                               00877000
CVTRV228 EQU   CVTS01+426                                               00878000
CVTRV237 EQU   CVTS01+427                                               00879000
CVTMFRTR EQU   CVTS01+452                                               00880000
CVTRV262 EQU   CVTS01+468                                               00881000
CVTRV271 EQU   CVTS01+469                                               00882000
CVTRV280 EQU   CVTS01+470                                               00883000
CVTRV289 EQU   CVTS01+471                                               00884000
CVTGSDA  EQU   CVTS01+600                                               00885000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00886000
CVTRV628 EQU   CVTS01+728                                               00887000
CVTRV627 EQU   CVTS01+724                                               00888000
CVTRV626 EQU   CVTS01+720                                               00889000
CVTRV625 EQU   CVTS01+716                                               00890000
CVTRV624 EQU   CVTS01+712                                               00891000
CVTRV623 EQU   CVTS01+708                                               00892000
CVTRV622 EQU   CVTS01+704                                               00893000
CVTRV621 EQU   CVTS01+700                                               00894000
CVTRV620 EQU   CVTS01+696                                               00895000
CVTRV619 EQU   CVTS01+692                                               00896000
CVTRV618 EQU   CVTS01+688                                               00897000
CVTRV617 EQU   CVTS01+684                                               00898000
CVTRV616 EQU   CVTS01+680                                               00899000
CVTRV615 EQU   CVTS01+676                                               00900000
CVTRV614 EQU   CVTS01+672                                               00901000
CVTRV613 EQU   CVTS01+668                                               00902000
CVTRV612 EQU   CVTS01+664                                               00903000
CVTRV611 EQU   CVTS01+660                                               00904000
CVTEVERM EQU   CVTS01+656                                               00905000
CVTIRM   EQU   CVTS01+652                                               00906000
CVTCGK   EQU   CVTS01+648                                               00907000
CVTRAC   EQU   CVTS01+644                                               00908000
CVTRV606 EQU   CVTS01+640                                               00909000
CVTRV605 EQU   CVTS01+636                                               00910000
CVTRV604 EQU   CVTS01+632                                               00911000
CVTEFF02 EQU   CVTS01+628                                               00912000
CVTCBBR  EQU   CVTS01+624                                               00913000
CVTSSCR  EQU   CVTS01+620                                               00914000
CVTEVENT EQU   CVTS01+616                                               00915000
CVTCRCA  EQU   CVTS01+612                                               00916000
CVTTPIO  EQU   CVTS01+608                                               00917000
CVTADV   EQU   CVTS01+604                                               00918000
CVTGSDAB EQU   CVTGSDA                                                  00919000
CVTQV3   EQU   CVTS01+596                                               00920000
CVTQV2   EQU   CVTS01+592                                               00921000
CVTQV1   EQU   CVTS01+588                                               00922000
CVTRPT   EQU   CVTS01+584                                               00923000
CVTSSRB  EQU   CVTS01+580                                               00924000
CVTCSDRL EQU   CVTS01+576                                               00925000
CVTEXP1  EQU   CVTS01+572                                               00926000
CVTRMPMT EQU   CVTS01+568                                               00927000
CVTRMPTT EQU   CVTS01+564                                               00928000
CVTVPSA  EQU   CVTS01+560                                               00929000
CVTVSTOP EQU   CVTS01+556                                               00930000
CVTGTFR8 EQU   CVTS01+552                                               00931000
CVTQUIT  EQU   CVTS01+548                                               00932000
CVTVACR  EQU   CVTS01+544                                               00933000
CVTWTCB  EQU   CVTS01+540                                               00934000
CVTSTPRS EQU   CVTS01+536                                               00935000
CVT0PT02 EQU   CVTS01+532                                               00936000
CVTDARCM EQU   CVTS01+528                                               00937000
CVTIRECM EQU   CVTS01+524                                               00938000
CVTJRECM EQU   CVTS01+520                                               00939000
CVTVEMS0 EQU   CVTS01+516                                               00940000
CVTSPFRR EQU   CVTS01+512                                               00941000
CVTRLSTG EQU   CVTS01+508                                               00942000
CVT0TC0A EQU   CVTS01+504                                               00943000
CVTGMBR  EQU   CVTS01+500                                               00944000
CVTLFRM  EQU   CVTS01+496                                               00945000
CVTRMBR  EQU   CVTS01+492                                               00946000
CVTVIOP  EQU   CVTS01+488                                               00947000
CVTRV307 EQU   CVTS01+486                                               00948000
CVTRV306 EQU   CVTS01+484                                               00949000
CVTRV305 EQU   CVTS01+482                                               00950000
CVTRV304 EQU   CVTS01+480                                               00951000
CVTRV303 EQU   CVTS01+478                                               00952000
CVTRV302 EQU   CVTS01+476                                               00953000
CVTTRCA  EQU   CVTS01+472                                               00954000
CVTRV297 EQU   CVTRV289                                                 00955000
CVTRV296 EQU   CVTRV289                                                 00956000
CVTRV295 EQU   CVTRV289                                                 00957000
CVTRV294 EQU   CVTRV289                                                 00958000
CVTRV293 EQU   CVTRV289                                                 00959000
CVTRV292 EQU   CVTRV289                                                 00960000
CVTRV291 EQU   CVTRV289                                                 00961000
CVTRV290 EQU   CVTRV289                                                 00962000
CVTRV288 EQU   CVTRV280                                                 00963000
CVTRV287 EQU   CVTRV280                                                 00964000
CVTRV286 EQU   CVTRV280                                                 00965000
CVTRV285 EQU   CVTRV280                                                 00966000
CVTRV284 EQU   CVTRV280                                                 00967000
CVTRV283 EQU   CVTRV280                                                 00968000
CVTRV282 EQU   CVTRV280                                                 00969000
CVTRV281 EQU   CVTRV280                                                 00970000
CVTRV279 EQU   CVTRV271                                                 00971000
CVTRV278 EQU   CVTRV271                                                 00972000
CVTRV277 EQU   CVTRV271                                                 00973000
CVTRV276 EQU   CVTRV271                                                 00974000
CVTRV275 EQU   CVTRV271                                                 00975000
CVTRV274 EQU   CVTRV271                                                 00976000
CVTRV273 EQU   CVTRV271                                                 00977000
CVTRV272 EQU   CVTRV271                                                 00978000
CVTRV270 EQU   CVTRV262                                                 00979000
CVTRV269 EQU   CVTRV262                                                 00980000
CVTRV268 EQU   CVTRV262                                                 00981000
CVTRV267 EQU   CVTRV262                                                 00982000
CVTRV266 EQU   CVTRV262                                                 00983000
CVTRV265 EQU   CVTRV262                                                 00984000
CVTRV264 EQU   CVTRV262                                                 00985000
CVTRV263 EQU   CVTRV262                                                 00986000
CVTVFP   EQU   CVTS01+464                                               00987000
CVTVSI   EQU   CVTS01+460                                               00988000
CVTVPSIB EQU   CVTS01+456                                               00989000
CVTMFACT EQU   CVTMFRTR                                                 00990000
CVTMFCTL EQU   CVTS01+448                                               00991000
CVTPVBP  EQU   CVTS01+444                                               00992000
CVTPWI   EQU   CVTS01+440                                               00993000
CVTRV254 EQU   CVTS01+438                                               00994000
CVTRV253 EQU   CVTS01+436                                               00995000
CVTRV252 EQU   CVTS01+434                                               00996000
CVTRV251 EQU   CVTS01+433                                               00997000
CVTRV250 EQU   CVTS01+432                                               00998000
CVTRV249 EQU   CVTS01+431                                               00999000
CVTRV248 EQU   CVTS01+430                                               01000000
CVTRV247 EQU   CVTS01+429                                               01001000
CVTRV246 EQU   CVTS01+428                                               01002000
CVTRV245 EQU   CVTRV237                                                 01003000
CVTRV244 EQU   CVTRV237                                                 01004000
CVTRV243 EQU   CVTRV237                                                 01005000
CVTRV242 EQU   CVTRV237                                                 01006000
CVTRV241 EQU   CVTRV237                                                 01007000
CVTRV240 EQU   CVTRV237                                                 01008000
CVTRV239 EQU   CVTRV237                                                 01009000
CVTRV238 EQU   CVTRV237                                                 01010000
CVTRV236 EQU   CVTRV228                                                 01011000
CVTRV235 EQU   CVTRV228                                                 01012000
CVTRV234 EQU   CVTRV228                                                 01013000
CVTRV233 EQU   CVTRV228                                                 01014000
CVTRV232 EQU   CVTRV228                                                 01015000
CVTRV231 EQU   CVTRV228                                                 01016000
CVTRV230 EQU   CVTRV228                                                 01017000
CVTRV229 EQU   CVTRV228                                                 01018000
CVTRV227 EQU   CVTRV219                                                 01019000
CVTRV226 EQU   CVTRV219                                                 01020000
CVTRV225 EQU   CVTRV219                                                 01021000
CVTRV224 EQU   CVTRV219                                                 01022000
CVTRV223 EQU   CVTRV219                                                 01023000
CVTRV222 EQU   CVTRV219                                                 01024000
CVTRV221 EQU   CVTRV219                                                 01025000
CVTRV220 EQU   CVTRV219                                                 01026000
CVTRV218 EQU   CVTRV210                                                 01027000
CVTRV217 EQU   CVTRV210                                                 01028000
CVTRV216 EQU   CVTRV210                                                 01029000
CVTRV215 EQU   CVTRV210                                                 01030000
CVTRV214 EQU   CVTRV210                                                 01031000
CVTRV213 EQU   CVTRV210                                                 01032000
CVTRV212 EQU   CVTRV210                                                 01033000
CVTRV211 EQU   CVTRV210                                                 01034000
CVTLCCAT EQU   CVTS01+420                                               01035000
CVTPCCAT EQU   CVTS01+416                                               01036000
CVTIPCRP EQU   CVTS01+412                                               01037000
CVTIPCRI EQU   CVTS01+408                                               01038000
CVTIPCDS EQU   CVTS01+404                                               01039000
CVTAIDVT EQU   CVTS01+400                                               01040000
CVTSSAP  EQU   CVTS01+396                                               01041000
CVTEHCIR EQU   CVTS01+392                                               01042000
CVTEHDEF EQU   CVTS01+388                                               01043000
CVTDAIR  EQU   CVTS01+384                                               01044000
CVTPERFM EQU   CVTS01+380                                               01045000
CVT044R2 EQU   CVTS01+376                                               01046000
CVTFETCH EQU   CVTS01+372                                               01047000
CVTRSTWD EQU   CVTS01+368                                               01048000
CVTSPOST EQU   CVTS01+364                                               01049000
CVTIOBP  EQU   CVTS01+360                                               01050000
CVTASMVT EQU   CVTS01+356                                               01051000
CVTRECRQ EQU   CVTS01+352                                               01052000
CVTWSAC  EQU   CVTS01+348                                               01053000
CVTRV149 EQU   CVTS01+344                                               01054000
CVTWSAL  EQU   CVTS01+340                                               01055000
CVTSPSA  EQU   CVTS01+336                                               01056000
CVTGLMN  EQU   CVTS01+332                                               01057000
CVTVEAC0 EQU   CVTS01+328                                               01058000
CVT062R1 EQU   CVTS01+324                                               01059000
CVTRPOST EQU   CVTS01+320                                               01060000
CVTDQIQE EQU   CVTS01+316                                               01061000
CVTCSD   EQU   CVTS01+312                                               01062000
CVTLKRMA EQU   CVTS01+308                                               01063000
CVTRSPIE EQU   CVTS01+304                                               01064000
CVTRENQ  EQU   CVTS01+300                                               01065000
CVTLQCB  EQU   CVTS01+296                                               01066000
CVTFQCB  EQU   CVTS01+292                                               01067000
CVTQCS01 EQU   CVTS01+288                                               01068000
CVTAPFT  EQU   CVTS01+284                                               01069000
CVTPARRL EQU   CVTS01+280                                               01070000
CVTVWAIT EQU   CVTS01+276                                               01071000
CVTGSPL  EQU   CVTS01+272                                               01072000
CVTLSMQ  EQU   CVTS01+268                                               01073000
CVTGSMQ  EQU   CVTS01+264                                               01074000
CVTEXPRO EQU   CVTS01+260                                               01075000
CVTOPCTP EQU   CVTS01+256                                               01076000
CVTSIC   EQU   CVTS01+252                                               01077000
CVTTPIOS EQU   CVTS01+248                                               01078000
CVTRTMS  EQU   CVTS01+244                                               01079000
CVTSDBF  EQU   CVTS01+240                                               01080000
CVTSCBP  EQU   CVTS01+236                                               01081000
CVTSDMP  EQU   CVTS01+232                                               01082000
CVTSV60  EQU   CVTS01+228                                               01083000
CVTRTMCT EQU   CVTS01+224                                               01084000
CVTASCBL EQU   CVTS01+220                                               01085000
CVTASCBH EQU   CVTS01+216                                               01086000
CVTGDA   EQU   CVTS01+212                                               01087000
CVTASVT  EQU   CVTS01+208                                               01088000
CVTVVMDI EQU   CVTS01+204                                               01089000
CVTAQTOP EQU   CVTS01+200                                               01090000
CVTIOSCS EQU   CVTS01+196                                               01091000
CVTSDRM  EQU   CVTS01+192                                               01092000
CVTOPTE  EQU   CVTS01+188                                               01093000
CVTSTXU  EQU   CVTS01+184                                               01094000
CVTQUIS  EQU   CVTS01+180                                               01095000
CVTPARS  EQU   CVTS01+176                                               01096000
CVTS1EE  EQU   CVTS01+172                                               01097000
CVTFRAS  EQU   CVTS01+168                                               01098000
CVTQSAS  EQU   CVTS01+164                                               01099000
CVTCRAS  EQU   CVTS01+160                                               01100000
CVTCRMN  EQU   CVTS01+156                                               01101000
CVTDELCP EQU   CVTS01+152                                               01102000
CVTFRECL EQU   CVTS01+148                                               01103000
CVTGETCL EQU   CVTS01+144                                               01104000
CVTBLDCP EQU   CVTS01+140                                               01105000
CVTAUTHL EQU   CVTS01+136                                               01106000
CVTSCAN  EQU   CVTS01+132                                               01107000
CVTRV144 EQU   CVTS01+130                                               01108000
CVTMAXMP EQU   CVTS01+128                                               01109000
CVTSTCK  EQU   CVTS01+124                                               01110000
CVTRV139 EQU   CVTS01+123                                               01111000
CVTDSSAC EQU   CVTS01+122                                               01112000
CVTRV513 EQU   CVTS01+121                                               01113000
CVTIOSPL EQU   CVTS01+120                                               01114000
CVTPTGT  EQU   CVTS01+116                                               01115000
CVTCSPIE EQU   CVTS01+112                                               01116000
CVTSMFEX EQU   CVTS01+108                                               01117000
CVTOLT0A EQU   CVTS01+104                                               01118000
CVTSRBRT EQU   CVTS01+100                                               01119000
CVTPUTL  EQU   CVTS01+96                                                01120000
CVTRV519 EQU   CVTS01+92                                                01121000
CVTRV327 EQU   CVTS01+88                                                01122000
CVTRV326 EQU   CVTS01+84                                                01123000
CVTRV325 EQU   CVTS01+80                                                01124000
CVTRV324 EQU   CVTS01+76                                                01125000
CVT0VL01 EQU   CVTS01+72                                                01126000
CVTSHRVM EQU   CVTS01+68                                                01127000
CVTRV332 EQU   CVTS01+64                                                01128000
CVTTAS   EQU   CVTS01+60                                                01129000
CVTRSCN  EQU   CVTS01+56                                                01130000
CVTTRAC2 EQU   CVTS01+54                                                01131000
CVTTRACE EQU   CVTS01+52                                                01132000
CVTAPG   EQU   CVTS01+51                                                01133000
CVTSDTRC EQU   CVTCTLFG                                                 01134000
CVTGTRCE EQU   CVTCTLFG                                                 01135000
CVTNOMP  EQU   CVTCTLFG                                                 01136000
CVTRSV79 EQU   CVTCTLFG                                                 01137000
CVTDSTAT EQU   CVTCTLFG                                                 01138000
CVTRSV78 EQU   CVTCTLFG                                                 01139000
CVTRV333 EQU   CVTCTLFG                                                 01140000
CVTRV323 EQU   CVTCTLFG                                                 01141000
CVTSPVLK EQU   CVTS01+49                                                01142000
CVTRSV77 EQU   CVTS01+48                                                01143000
CVTRV331 EQU   CVTS01+44                                                01144000
CVTRV330 EQU   CVTS01+40                                                01145000
CVTRV329 EQU   CVTS01+36                                                01146000
CVTRV328 EQU   CVTS01+32                                                01147000
CVTRV322 EQU   CVTS01+28                                                01148000
CVTSLID  EQU   CVTSLIDA+1                                               01149000
CVTSYLK  EQU   CVTSLIDA                                                 01150000
CVTRV321 EQU   CVTS01+20                                                01151000
CVTRV320 EQU   CVTS01+16                                                01152000
CVTLPDIR EQU   CVTLPDIA+1                                               01153000
CVTRSV69 EQU   CVTDIRST                                                 01154000
CVTRSV68 EQU   CVTDIRST                                                 01155000
CVTRSV67 EQU   CVTDIRST                                                 01156000
CVTRSV66 EQU   CVTDIRST                                                 01157000
CVTRSV65 EQU   CVTDIRST                                                 01158000
CVTRSV64 EQU   CVTDIRST                                                 01159000
CVTRSV63 EQU   CVTDIRST                                                 01160000
CVTDICOM EQU   CVTDIRST                                                 01161000
CVTPVTP  EQU   CVTS01+8                                                 01162000
CVTLPDSR EQU   CVTS01+4                                                 01163000
CVTGETL  EQU   CVTS01                                                   01164000
ATCAOS   EQU   ISTATCVT+1552                                            01165000
ATCVIOPM EQU   ATCAOSM+636                                              01166000
ATCTPMMI EQU   ATCAOSM+632                                              01167000
ATCTPMPB EQU   ATCAOSM+600                                              01168000
ATCRPLCT EQU   ATCAOSM+594                                              01169000
ATCCRACT EQU   ATCAOSM+592                                              01170000
ATCSRBCT EQU   ATCAOSM+590                                              01171000
ATCRSV75 EQU   ATCAOSM+589                                              01172000
ATCRSV66 EQU   ATCZFLAG                                                 01173000
ATCZF001 EQU   ATCZFLAG                                                 01174000
ATCTPCP1 EQU   ATCAOSM+584                                              01175000
ATCTPCP0 EQU   ATCAOSM+580                                              01176000
ATCAICTN EQU   ATCAOSM+576                                              01177000
ATCZR01  EQU   ATCAOSM+572                                              01178000
ATCMPLTA EQU   ATCAOSM+568                                              01179000
ATCASCB  EQU   ATCAOSM+564                                              01180000
ATCAP86  EQU   ATCAOSM+560                                              01181000
ATCAP85  EQU   ATCAOSM+556                                              01182000
ATCAP84  EQU   ATCAOSM+552                                              01183000
ATCAP83  EQU   ATCAOSM+548                                              01184000
ATCAP82  EQU   ATCAOSM+544                                              01185000
ATCAP69  EQU   ATCAOSM+540                                              01186000
ATCAP66  EQU   ATCAOSM+536                                              01187000
ATCAP62  EQU   ATCAOSM+532                                              01188000
ATCAPC59 EQU   ATCAOSM+528                                              01189000
ATCAP56  EQU   ATCAOSM+524                                              01190000
ATCAP55  EQU   ATCAOSM+520                                              01191000
ATCRCFY0 EQU   ATCAOSM+516                                              01192000
ATCAP41  EQU   ATCAOSM+512                                              01193000
ATCAPC25 EQU   ATCAOSM+508                                              01194000
ATCAP23  EQU   ATCAOSM+504                                              01195000
ATCTPSPB EQU   ATCAOSM+472                                              01196000
ATCTRMBP EQU   ATCAOSM+440                                              01197000
ATCPSTA  EQU   ATCAOSM+432                                              01198000
ATCSMABF EQU   ATCAOSM+428                                              01199000
ATCSMAPR EQU   ATCAOSM+424                                              01200000
ATCTPWQA EQU   ATCAOSM+420                                              01201000
ATCSMAID EQU   ATCAOSM+416                                              01202000
ATCSMARA EQU   ATCAOSM+412                                              01203000
ATCCACXA EQU   ATCAOSM+408                                              01204000
ATCZLAAB EQU   ATCAOSM+404                                              01205000
ATCATA10 EQU   ATCAOSM+400                                              01206000
ATCHLTCB EQU   ATCAOSM+396                                              01207000
@NM00014 EQU   ATCVTFLG                                                 01208000
ATCVTACT EQU   ATCVTFLG                                                 01209000
ATCRPT40 EQU   ATCAOSM+388                                              01210000
ATCRPT39 EQU   ATCAOSM+384                                              01211000
ATCRPT38 EQU   ATCAOSM+380                                              01212000
ATCRPT37 EQU   ATCAOSM+376                                              01213000
ATCRPT36 EQU   ATCAOSM+372                                              01214000
ATCRPT35 EQU   ATCAOSM+368                                              01215000
ATCRPT34 EQU   ATCAOSM+364                                              01216000
ATCRPT33 EQU   ATCAOSM+360                                              01217000
ATCRPT32 EQU   ATCAOSM+356                                              01218000
ATCRPT31 EQU   ATCAOSM+352                                              01219000
ATCRPT30 EQU   ATCAOSM+348                                              01220000
ATCRPT29 EQU   ATCAOSM+344                                              01221000
ATCRPT28 EQU   ATCAOSM+340                                              01222000
ATCRPT27 EQU   ATCAOSM+336                                              01223000
ATCRPT26 EQU   ATCAOSM+332                                              01224000
ATCRPT25 EQU   ATCAOSM+328                                              01225000
ATCRPT24 EQU   ATCAOSM+324                                              01226000
ATCRPT23 EQU   ATCAOSM+320                                              01227000
ATCRPT22 EQU   ATCAOSM+316                                              01228000
ATCRPT21 EQU   ATCAOSM+312                                              01229000
ATCRPT20 EQU   ATCAOSM+308                                              01230000
ATCRPT19 EQU   ATCAOSM+304                                              01231000
ATCRPT18 EQU   ATCAOSM+300                                              01232000
ATCRPT17 EQU   ATCAOSM+296                                              01233000
ATCRPT16 EQU   ATCAOSM+292                                              01234000
ATCRPT15 EQU   ATCAOSM+288                                              01235000
ATCRPT14 EQU   ATCAOSM+284                                              01236000
ATCRPT13 EQU   ATCAOSM+280                                              01237000
ATCRPT12 EQU   ATCAOSM+276                                              01238000
ATCRPT11 EQU   ATCAOSM+272                                              01239000
ATCAP38  EQU   ATCAOSM+268                                              01240000
ATCAP37  EQU   ATCAOSM+264                                              01241000
ATCZDFJ0 EQU   ATCAOSM+260                                              01242000
ATCAP51  EQU   ATCAOSM+256                                              01243000
ATCZPAB2 EQU   ATCAOSM+224                                              01244000
ATCZPAB1 EQU   ATCAOSM+192                                              01245000
ATCZLFVT EQU   ATCAOSM+188                                              01246000
ATCZLPVT EQU   ATCAOSM+184                                              01247000
ATCZDVTX EQU   ATCAOSM+180                                              01248000
ATCZDVTA EQU   ATCAOSM+176                                              01249000
ATCZDVT9 EQU   ATCAOSM+172                                              01250000
ATCZDVT8 EQU   ATCAOSM+168                                              01251000
ATCZDVT7 EQU   ATCAOSM+164                                              01252000
ATCRSV56 EQU   ATCDAPVT+22                                              01253000
ATCDAPDG EQU   ATCDAPVT+20                                              01254000
ATCDXCEA EQU   ATCDAPVT+16                                              01255000
ATCDCEA  EQU   ATCDAPVT+12                                              01256000
ATCDPCIA EQU   ATCDAPVT+8                                               01257000
ATCDSIOA EQU   ATCDAPVT+4                                               01258000
ATCDEOEA EQU   ATCDAPVT                                                 01259000
ATCZLAEA EQU   ATCLDAPP+16                                              01260000
ATCZLCEA EQU   ATCLDAPP+12                                              01261000
ATCRSV17 EQU   ATCLDAPP+8                                               01262000
ATCSMFRR EQU   ATCLDAPP+4                                               01263000
ATCCDTID EQU   ATCLDAPP                                                 01264000
ATCZAEA  EQU   ATCICAPP+16                                              01265000
ATCZCEA  EQU   ATCICAPP+12                                              01266000
ATCCDTCB EQU   ATCICAPP+8                                               01267000
ATCZSIOA EQU   ATCICAPP+4                                               01268000
ATCCDRPH EQU   ATCICAPP                                                 01269000
ATCAP65  EQU   ATCAOSM+96                                               01270000
ATCZDVT6 EQU   ATCAOSM+92                                               01271000
ATCZDVT4 EQU   ATCAOSM+88                                               01272000
ATCZDVT3 EQU   ATCAOSM+84                                               01273000
ATCZDVT1 EQU   ATCAOSM+80                                               01274000
ATCICNCB EQU   ATCAOSM+76                                               01275000
ATCZPSVT EQU   ATCAOSM+72                                               01276000
ATCZFSVT EQU   ATCAOSM+68                                               01277000
ATCAP64  EQU   ATCAOSM+64                                               01278000
ATCAP63  EQU   ATCAOSM+60                                               01279000
ATCAP61  EQU   ATCAOSM+56                                               01280000
ATCAP58  EQU   ATCAOSM+52                                               01281000
ATCAP57  EQU   ATCAOSM+48                                               01282000
ATCAP54  EQU   ATCAOSM+44                                               01283000
ATCAP53  EQU   ATCAOSM+40                                               01284000
ATCAP52  EQU   ATCAOSM+36                                               01285000
ATCAP34  EQU   ATCAOSM+32                                               01286000
ATCAP32  EQU   ATCAOSM+28                                               01287000
ATCAP31  EQU   ATCAOSM+24                                               01288000
ATCAP12  EQU   ATCAOSM+20                                               01289000
ATCAP11  EQU   ATCAOSM+16                                               01290000
ATCCMTCB EQU   ATCAOSM+12                                               01291000
ATCPRPH  EQU   ATCAOSM+8                                                01292000
ATCGSRBF EQU   ATCGSRBG                                                 01293000
ATCSRBRT EQU   ATCAOSM                                                  01294000
ATCRSVBB EQU   ISTATCVT+908                                             01295000
ATCVDLOK EQU   ISTATCVT+904                                             01296000
ATCVFPAB EQU   ISTATCVT+872                                             01297000
ATCVDPAB EQU   ISTATCVT+840                                             01298000
ATCIOECB EQU   ISTATCVT+836                                             01299000
ATCINCW3 EQU   ISTATCVT+832                                             01300000
ATCMODTB EQU   ISTATCVT+828                                             01301000
ATCUSSPT EQU   ISTATCVT+824                                             01302000
ATCSRTAB EQU   ISTATCVT+820                                             01303000
@NM00013 EQU   ISTATCVT+818                                             01304000
ATCNMCTR EQU   ISTATCVT+816                                             01305000
ATCSEC51 EQU   ATCSECST                                                 01306000
ATCSEC40 EQU   ATCSIPD+8                                                01307000
ATCSEC30 EQU   ATCSIPD+4                                                01308000
ATCSEC21 EQU   ATCSIPD                                                  01309000
ATCSEC10 EQU   ATCSOPD+4                                                01310000
ATCSEC01 EQU   ATCSOPD                                                  01311000
ATCPOIA  EQU   ISTATCVT+788                                             01312000
ATCPODVT EQU   ISTATCVT+784                                             01313000
ATCS49XL EQU   ISTATCVT+780                                             01314000
ATCS49XI EQU   ISTATCVT+776                                             01315000
ATCLCLCT EQU   ATCVLCNT+2                                               01316000
ATCRNCNT EQU   ATCVLCNT                                                 01317000
ATCCFEAD EQU   ISTATCVT+768                                             01318000
ATCPTR00 EQU   ISTATCVT+736                                             01319000
ATCRSV10 EQU   ISTATCVT+704                                             01320000
ATCTACB  EQU   ISTATCVT+700                                             01321000
ATCVTINM EQU   ISTATCVT+696                                             01322000
ATCTCLIM EQU   ISTATCVT+692                                             01323000
ATCTCLOM EQU   ISTATCVT+688                                             01324000
ATCVTIPB EQU   ISTATCVT+656                                             01325000
ATCTCIPB EQU   ISTATCVT+624                                             01326000
ATCTIPAB EQU   ISTATCVT+592                                             01327000
ATCOCCCB EQU   ISTATCVT+588                                             01328000
ATCOCCOB EQU   ISTATCVT+584                                             01329000
ATCCDLAD EQU   ISTATCVT+580                                             01330000
ATCCCLAD EQU   ISTATCVT+576                                             01331000
ATCDLRPB EQU   ISTATCVT+544                                             01332000
ATCPGPAB EQU   ISTATCVT+512                                             01333000
ATCVPAB1 EQU   ISTATCVT+480                                             01334000
ATCRSV97 EQU   ISTATCVT+476                                             01335000
ATCRDTLK EQU   ISTATCVT+472                                             01336000
ATCVOCLK EQU   ISTATCVT+468                                             01337000
ATCCDFDN EQU   ISTATCVT+464                                             01338000
ATCCDFIN EQU   ISTATCVT+460                                             01339000
ATCDVTLK EQU   ISTATCVT+456                                             01340000
ATCAP36  EQU   ISTATCVT+452                                             01341000
ATCAP35  EQU   ISTATCVT+448                                             01342000
ATCAP33  EQU   ISTATCVT+444                                             01343000
ATCRSV99 EQU   ISTATCVT+412                                             01344000
ATCLDECB EQU   ISTATCVT+408                                             01345000
ATCLDNCS EQU   ISTATCVT+404                                             01346000
ATCCDPTR EQU   ISTATCVT+400                                             01347000
ATCADEL  EQU   ISTATCVT+396                                             01348000
ATCTODVT EQU   ISTATCVT+392                                             01349000
ATCDEBCH EQU   ISTATCVT+388                                             01350000
ATCHBSIZ EQU   ATCHPGM+2                                                01351000
ATCHBFNO EQU   ATCHPGM                                                  01352000
ATCCRME  EQU   ISTATCVT+380                                             01353000
ATCRVCHS EQU   ISTATCVT+372                                             01354000
ATCECTLP EQU   ISTATCVT+368                                             01355000
ATCZDVTB EQU   ISTATCVT+364                                             01356000
ATCECPRT EQU   ISTATCVT+360                                             01357000
ATCVTLOD EQU   ISTATCVT+356                                             01358000
ATCTRPAB EQU   ISTATCVT+352                                             01359000
ATCMSGM  EQU   ISTATCVT+348                                             01360000
ATCEPT   EQU   ISTATCVT+340                                             01361000
ATCDVT   EQU   ISTATCVT+336                                             01362000
ATCTRCPT EQU   ISTATCVT+332                                             01363000
ATCDVLOD EQU   ISTATCVT+328                                             01364000
ATCALERT EQU   ISTATCVT+324                                             01365000
ATCEPA   EQU   ISTATCVT+320                                             01366000
ATCSAF   EQU   ISTATCVT+318                                             01367000
ATCXRANG EQU   ISTATCVT+317                                             01368000
ATCLAST  EQU   ATCSHRFG                                                 01369000
ATCSHRTN EQU   ISTATCVT+308                                             01370000
ATCUEP   EQU   ISTATCVT+304                                             01371000
ATCOCRT  EQU   ISTATCVT+300                                             01372000
ATCCSMA  EQU   ATCCSMR                                                  01373000
ATCESC02 EQU   ISTATCVT+292                                             01374000
ATCESC01 EQU   ISTATCVT+288                                             01375000
ATCCDFND EQU   ISTATCVT+284                                             01376000
ATCCDDEL EQU   ISTATCVT+280                                             01377000
ATCCDADD EQU   ISTATCVT+276                                             01378000
ATCMNT   EQU   ISTATCVT+272                                             01379000
ATCRSV16 EQU   ISTATCVT+270                                             01380000
ATCMAXID EQU   ISTATCVT+269                                             01381000
ATCMSGSP EQU   ATCCOM+268                                               01382000
ATCCIDM  EQU   ATCCOM+266                                               01383000
ATCACTRM EQU   ATCCOM+264                                               01384000
ATCNERAP EQU   ATCCOM+260                                               01385000
ATCNESAL EQU   ATCCOM+256                                               01386000
ATCRCC65 EQU   ATCCOM+252                                               01387000
ATCRCC26 EQU   ATCCOM+248                                               01388000
ATCRCC63 EQU   ATCCOM+244                                               01389000
ATCRSV11 EQU   ATCCOM+242                                               01390000
ATCVTMID EQU   ATCCOM+240                                               01391000
ATCAPOST EQU   ATCCOM+236                                               01392000
ATCNERFN EQU   ATCCOM+232                                               01393000
ATCNERNE EQU   ATCCOM+228                                               01394000
ATCNERCV EQU   ATCCOM+224                                               01395000
ATCNERST EQU   ATCCOM+220                                               01396000
ATCDCC61 EQU   ATCCOM+216                                               01397000
ATCDCC60 EQU   ATCCOM+212                                               01398000
ATCSRTDF EQU   ATCCOM+208                                               01399000
ATCSRTAD EQU   ATCCOM+204                                               01400000
ATCFIRA  EQU   ATCCOM+200                                               01401000
ATCSMBQ  EQU   ATCCOM+196                                               01402000
ATCSMRC  EQU   ATCCOM+192                                               01403000
ATCSMRS  EQU   ATCCOM+188                                               01404000
ATCSMQU  EQU   ATCCOM+184                                               01405000
ATCSMRQ  EQU   ATCCOM+180                                               01406000
ATCACDA  EQU   ATCCOM+176                                               01407000
ATCSTMA  EQU   ATCCOM+172                                               01408000
ATCFRSTR EQU   ATCCOM+168                                               01409000
ATCGTSTR EQU   ATCCOM+164                                               01410000
ATCREADA EQU   ATCCOM+160                                               01411000
ATCALOAD EQU   ATCCOM+156                                               01412000
ATCBLDLA EQU   ATCCOM+152                                               01413000
ATCFBRPH EQU   ATCCOM+148                                               01414000
ATCBFTRC EQU   ATCCOM+144                                               01415000
ATCTPBUF EQU   ATCTHTRC                                                 01416000
ATCREMOV EQU   ATCCOM+136                                               01417000
ATCADD   EQU   ATCCOM+132                                               01418000
ATCBPDA  EQU   ATCCOM+128                                               01419000
ATCDVTPT EQU   ATCCOM+124                                               01420000
ATCFEPT  EQU   ATCCOM+120                                               01421000
ATCFDVT  EQU   ATCCOM+116                                               01422000
ATCCONFT EQU   ATCCOM+112                                               01423000
ATCPTCHA EQU   ATCCOM+108                                               01424000
ATCAUTHA EQU   ATCCOM+104                                               01425000
ATCACCTA EQU   ATCCOM+100                                               01426000
ATCRDTH  EQU   ATCCOM+96                                                01427000
ATCFRSCH EQU   ATCCOM+92                                                01428000
ATCFSB   EQU   ATCCOM+88                                                01429000
ATCHLTMS EQU   ATCCOM+84                                                01430000
ATCECPRM EQU   ATCCOM+80                                                01431000
ATCECNET EQU   ATCCOM+76                                                01432000
ATCECOPC EQU   ATCCOM+72                                                01433000
ATCVPARM EQU   ATCCOM+68                                                01434000
ATCECVRQ EQU   ATCCOM+64                                                01435000
ATCECSES EQU   ATCCOM+60                                                01436000
ATCOCHA  EQU   ATCCOM+56                                                01437000
ATCDSPLQ EQU   ATCCOM+52                                                01438000
ATCECDSP EQU   ATCCOM+48                                                01439000
ATCVARYQ EQU   ATCCOM+44                                                01440000
ATCECVRY EQU   ATCCOM+40                                                01441000
ATCHALTQ EQU   ATCCOM+36                                                01442000
ATCECHLT EQU   ATCCOM+32                                                01443000
ATCMODQ  EQU   ATCCOM+28                                                01444000
ATCECMOD EQU   ATCCOM+24                                                01445000
ATCASCHD EQU   ATCCOM+20                                                01446000
ATCSRT   EQU   ATCCOM+16                                                01447000
ATCRDT   EQU   ATCCOM+12                                                01448000
ATCDCFRR EQU   ATCCOM+8                                                 01449000
ATCAPI   EQU   ATCCOM+4                                                 01450000
ATCRSV04 EQU   ATCSTAT4                                                 01451000
ATCNCSD  EQU   ATCSTAT4                                                 01452000
ATCMTST  EQU   ATCSTAT4                                                 01453000
ATCTPRT  EQU   ATCSTAT4                                                 01454000
ATCPRTAT EQU   ATCSTAT4                                                 01455000
@NM00012 EQU   ATCPOFLG                                                 01456000
ATCPOUNS EQU   ATCPOFLG                                                 01457000
ATCHSDMF EQU   ATCSTFLG                                                 01458000
@NM00011 EQU   ATCSTAT1                                                 01459000
ATCINHLT EQU   ATCSTAT1                                                 01460000
ATCNETSL EQU   ATCSTAT1                                                 01461000
ATCQKHLT EQU   ATCSTAT1                                                 01462000
ATCSNHLT EQU   ATCSTAT1                                                 01463000
ATCACTIV EQU   ATCSTAT1                                                 01464000
ATCSTART EQU   ATCSTAT1                                                 01465000
RPHNEXPO EQU   ISTRPH+104                                               01466000
RPHSAV16 EQU   RPHWORK+60                                               01467000
RPHSAV15 EQU   RPHWORK+56                                               01468000
RPHSAV14 EQU   RPHWORK+52                                               01469000
RPHSAV13 EQU   RPHWORK+48                                               01470000
RPHSAV12 EQU   RPHWORK+44                                               01471000
RPHSAV11 EQU   RPHWORK+40                                               01472000
RPHSAV10 EQU   RPHWORK+36                                               01473000
RPHSAVE9 EQU   RPHWORK+32                                               01474000
RPHSAVE8 EQU   RPHWORK+28                                               01475000
RPHSAVE7 EQU   RPHWORK+24                                               01476000
RPHSAVE6 EQU   RPHWORK+20                                               01477000
RPHSAVE5 EQU   RPHWORK+16                                               01478000
RPHSAVE4 EQU   RPHWORK+12                                               01479000
RPHSAVE3 EQU   RPHWORK+8                                                01480000
RPHSAVE2 EQU   RPHWORK+4                                                01481000
RPHSHALF EQU   RPHSAVE1+2                                               01482000
RPHSBIT8 EQU   RPHSBITS                                                 01483000
RPHSBIT7 EQU   RPHSBITS                                                 01484000
RPHSBIT6 EQU   RPHSBITS                                                 01485000
RPHSBIT5 EQU   RPHSBITS                                                 01486000
RPHSBIT4 EQU   RPHSBITS                                                 01487000
RPHSBIT3 EQU   RPHSBITS                                                 01488000
RPHSBIT2 EQU   RPHSBITS                                                 01489000
RPHSBIT1 EQU   RPHSBITS                                                 01490000
RPHSBYTE EQU   RPHSAVE1                                                 01491000
RPHPABQP EQU   RPHPABQA+1                                               01492000
RPHPABFG EQU   RPHPABQA                                                 01493000
RPHCRR   EQU   ISTRPH+32                                                01494000
RPHSRP34 EQU   RPHSRPRM+2                                               01495000
RPHSRP12 EQU   RPHSRPRM                                                 01496000
RPHWEGT  EQU   RPHCSPA                                                  01497000
RPHMAJCB EQU   ISTRPH+21                                                01498000
RPHPABOF EQU   ISTRPH+20                                                01499000
RPHRESUM EQU   RPHRESMA+1                                               01500000
RPHRSV01 EQU   RPHWPFLG                                                 01501000
RPHPURGE EQU   RPHWPFLG                                                 01502000
RPHPT    EQU   RPHWPFLG                                                 01503000
RPHWT    EQU   RPHWPFLG                                                 01504000
RPHRSKEY EQU   RPHWPFLG                                                 01505000
RPHDVTA  EQU   ISTRPH+12                                                01506000
RPHTIK   EQU   RPHTSKID+3                                               01507000
@NM00010 EQU   RPHTSKID                                                 01508000
RPHRPHAP EQU   RPHRPHA+1                                                01509000
@NM00009 EQU   RPHRPHA                                                  01510000
RPHGATE  EQU   RPHRPHA                                                  01511000
@NM00008 EQU   RPHFLGB                                                  01512000
RPHRLCRA EQU   RPHFLGB                                                  01513000
RPHNRSAV EQU   RPHFLGB                                                  01514000
RPHPGCMP EQU   RPHFLGB                                                  01515000
RPHFBAPS EQU   RPHFLGB                                                  01516000
RPHBSSP  EQU   RPHFLGB                                                  01517000
RPHLOCK  EQU   RPHFLGB                                                  01518000
RPHFNFLG EQU   RPHFSTLC                                                 01519000
RPHMLTCP EQU   RPHFLAGS                                                 01520000
RPHSMCLR EQU   RPHFLAGS                                                 01521000
RPHSMTYP EQU   RPHFLAGS                                                 01522000
RPHSMQ   EQU   RPHFLAGS                                                 01523000
RPHAUTEX EQU   RPHAPTYP                                                 01524000
RPHSPGIN EQU   RPHFLAGS                                                 01525000
RPHOGIND EQU   RPHFLAGS                                                 01526000
RPHLNGTH EQU   ISTRPH+1                                                 01527000
RPHTYPE  EQU   ISTRPH                                                   01528000
DYPPAB   EQU   ISTDYPAB+16                                              01529000
DYPRSV01 EQU   ISTDYPAB+12                                              01530000
DYPTSKID EQU   ISTDYPAB+8                                               01531000
DYPCHAIN EQU   ISTDYPAB+4                                               01532000
DYPFLGS  EQU   ISTDYPAB+2                                               01533000
DYPLNGTH EQU   ISTDYPAB+1                                               01534000
DYPTYPE  EQU   ISTDYPAB                                                 01535000
LOKXCL   EQU   @NM00006                                                 01536000
LOKPRY   EQU   @NM00006                                                 01537000
@NM00007 EQU   @NM00006                                                 01538000
@NM00005 EQU   LOKCHNG                                                  01539000
LOKCT    EQU   ISTLOK                                                   01540000
PABRPHA  EQU   PABRPHFG+1                                               01541000
PABNODQ  EQU   PABFLAGS                                                 01542000
PABINHBT EQU   PABFLAGS                                                 01543000
PABERLOK EQU   PABERRLK                                                 01544000
PABSSN   EQU   PABFLAGS                                                 01545000
PABDYNAM EQU   PABFLAGS                                                 01546000
PABNORPR EQU   PABFLAGS                                                 01547000
PABPRIOR EQU   PABFLAGS                                                 01548000
PABAPYP  EQU   PABFLAGS                                                 01549000
PABDVTA  EQU   ISTPAB+9                                                 01550000
PABOFFST EQU   ISTPAB+8                                                 01551000
PABCHNGP EQU   PABCHAIN+1                                               01552000
PABRSV02 EQU   PABCHAIN                                                 01553000
PABRUNNG EQU   PABCHAIN                                                 01554000
PABRESET EQU   PABCHAIN                                                 01555000
PABUNCON EQU   PABCHAIN                                                 01556000
PABCDP   EQU   PABCHAIN                                                 01557000
PABRESCH EQU   PABCHAIN                                                 01558000
PABCHNG  EQU   PABCHAIN                                                 01559000
PABWEQP  EQU   PABWEQA+1                                                01560000
PABRSV01 EQU   PABWEQA                                                  01561000
PABWEQG  EQU   PABWEQA                                                  01562000
CMZVP003 EQU   @NM00003+12                                              01563000
CMZEA003 EQU   @NM00003+8                                               01564000
CMZRA003 EQU   @NM00004+1                                               01565000
CMZRL003 EQU   @NM00004                                                 01566000
CVTLEVL  EQU   CVTRELNO+2                                               01567000
CVTNUMB  EQU   CVTRELNO                                                 01568000
CVTMDL   EQU   CVTFIX+250                                               01569000
@NM00002 EQU   CVTFIX+248                                               01570000
@NM00001 EQU   CVTFIX                                                   01571000
CVTRV482 EQU   CVTXTNT2+128                                             01572000
CVTRV481 EQU   CVTXTNT2+124                                             01573000
CVTRV480 EQU   CVTXTNT2+120                                             01574000
CVTRV479 EQU   CVTXTNT2+118                                             01575000
CVTRV478 EQU   CVTXTNT2+117                                             01576000
CVTRV477 EQU   CVTXTNT2+116                                             01577000
CVTRV476 EQU   CVTXTNT2+115                                             01578000
CVTRV475 EQU   CVTXTNT2+114                                             01579000
CVTRV474 EQU   CVTRV466                                                 01580000
CVTRV473 EQU   CVTRV466                                                 01581000
CVTRV472 EQU   CVTRV466                                                 01582000
CVTRV471 EQU   CVTRV466                                                 01583000
CVTRV470 EQU   CVTRV466                                                 01584000
CVTRV469 EQU   CVTRV466                                                 01585000
CVTRV468 EQU   CVTRV466                                                 01586000
CVTRV467 EQU   CVTRV466                                                 01587000
CVTRV465 EQU   CVTRV457                                                 01588000
CVTRV464 EQU   CVTRV457                                                 01589000
CVTRV463 EQU   CVTRV457                                                 01590000
CVTRV462 EQU   CVTRV457                                                 01591000
CVTRV461 EQU   CVTRV457                                                 01592000
CVTRV460 EQU   CVTRV457                                                 01593000
CVTRV459 EQU   CVTRV457                                                 01594000
CVTRV458 EQU   CVTRV457                                                 01595000
CVTRV456 EQU   CVTXTNT2+108                                             01596000
CVTRV455 EQU   CVTXTNT2+104                                             01597000
CVTRV454 EQU   CVTXTNT2+100                                             01598000
CVTRV453 EQU   CVTXTNT2+96                                              01599000
CVTRV452 EQU   CVTXTNT2+94                                              01600000
CVTRV451 EQU   CVTXTNT2+92                                              01601000
CVTRV450 EQU   CVTXTNT2+90                                              01602000
CVTRV449 EQU   CVTXTNT2+88                                              01603000
CVTRV448 EQU   CVTXTNT2+87                                              01604000
CVTRV447 EQU   CVTXTNT2+86                                              01605000
CVTRV446 EQU   CVTRV438                                                 01606000
CVTRV445 EQU   CVTRV438                                                 01607000
CVTRV444 EQU   CVTRV438                                                 01608000
CVTRV443 EQU   CVTRV438                                                 01609000
CVTRV442 EQU   CVTRV438                                                 01610000
CVTRV441 EQU   CVTRV438                                                 01611000
CVTRV440 EQU   CVTRV438                                                 01612000
CVTRV439 EQU   CVTRV438                                                 01613000
CVTRV437 EQU   CVTRV429                                                 01614000
CVTRV436 EQU   CVTRV429                                                 01615000
CVTRV435 EQU   CVTRV429                                                 01616000
CVTRV434 EQU   CVTRV429                                                 01617000
CVTRV433 EQU   CVTRV429                                                 01618000
CVTRV432 EQU   CVTRV429                                                 01619000
CVTRV431 EQU   CVTRV429                                                 01620000
CVTRV430 EQU   CVTRV429                                                 01621000
CVTRV428 EQU   CVTXTNT2+80                                              01622000
CVTRV427 EQU   CVTXTNT2+76                                              01623000
CVTRV426 EQU   CVTXTNT2+72                                              01624000
CVTRV425 EQU   CVTXTNT2+68                                              01625000
CVTATACT EQU   CVTATCVT                                                 01626000
CVTRV423 EQU   CVTXTNT2+62                                              01627000
CVTRV422 EQU   CVTXTNT2+60                                              01628000
CVTRV421 EQU   CVTXTNT2+58                                              01629000
CVTRV420 EQU   CVTXTNT2+56                                              01630000
CVTRV419 EQU   CVTXTNT2+55                                              01631000
CVTRV418 EQU   CVTXTNT2+54                                              01632000
CVTRV417 EQU   CVTRV409                                                 01633000
CVTRV416 EQU   CVTRV409                                                 01634000
CVTRV415 EQU   CVTRV409                                                 01635000
CVTRV414 EQU   CVTRV409                                                 01636000
CVTRV413 EQU   CVTRV409                                                 01637000
CVTRV412 EQU   CVTRV409                                                 01638000
CVTRV411 EQU   CVTRV409                                                 01639000
CVTRV410 EQU   CVTRV409                                                 01640000
CVTRV408 EQU   CVTRV400                                                 01641000
CVTRV407 EQU   CVTRV400                                                 01642000
CVTRV406 EQU   CVTRV400                                                 01643000
CVTRV405 EQU   CVTRV400                                                 01644000
CVTRV404 EQU   CVTRV400                                                 01645000
CVTRV403 EQU   CVTRV400                                                 01646000
CVTRV402 EQU   CVTRV400                                                 01647000
CVTRV401 EQU   CVTRV400                                                 01648000
CVTICB   EQU   CVTXTNT2+48                                              01649000
CVTSKTA  EQU   CVTXTNT2+44                                              01650000
CVTSHSB  EQU   CVTSHS                                                   01651000
CVTRSV98 EQU   CVTXTNT2+36                                              01652000
CVTRSV97 EQU   CVTXTNT2+34                                              01653000
CVTRSV96 EQU   CVTXTNT2+32                                              01654000
CVTOLTEP EQU   CVTXTNT2+28                                              01655000
CVTQIDA  EQU   CVTQID+1                                                 01656000
CVTRSV95 EQU   CVTQID                                                   01657000
CVTRSV94 EQU   CVTXTNT2+20                                              01658000
CVTRSV93 EQU   CVTXTNT2+16                                              01659000
CVTRSV92 EQU   CVTXTNT2+12                                              01660000
CVTDEBVR EQU   CVTXTNT2+8                                               01661000
CVTRSV91 EQU   CVTXTNT2+6                                               01662000
CVTRSV9H EQU   CVTFLGBT                                                 01663000
CVTRSV9G EQU   CVTFLGBT                                                 01664000
CVTRSV9F EQU   CVTFLGBT                                                 01665000
CVTRSV9E EQU   CVTFLGBT                                                 01666000
CVTRSV9D EQU   CVTFLGBT                                                 01667000
CVTRSV9C EQU   CVTFLGBT                                                 01668000
CVTVME   EQU   CVTFLGBT                                                 01669000
CVTNPE   EQU   CVTFLGBT                                                 01670000
CVTNUCLS EQU   CVTXTNT2+4                                               01671000
CVTDSSVA EQU   CVTDSSV+1                                                01672000
CVTRSV89 EQU   CVTDSSV                                                  01673000
CVTRSV88 EQU   CVTXTNT1+8                                               01674000
CVTRSV87 EQU   CVTXTNT1+4                                               01675000
CVTFACHN EQU   CVTXTNT1                                                 01676000
CVTRV488 EQU   CVTMAP+412                                               01677000
CVTRV487 EQU   CVTMAP+408                                               01678000
CVTRV486 EQU   CVTMAP+404                                               01679000
CVTRV485 EQU   CVTMAP+400                                               01680000
CVTACTAP EQU   CVTMAP+396                                               01681000
CVTAUTH  EQU   CVTMAP+392                                               01682000
CVTATMCA EQU   CVTATMCT+1                                               01683000
CVTATMST EQU   CVTATMCT                                                 01684000
CVTRSV61 EQU   CVTMAP+384                                               01685000
CVTVOLT1 EQU   CVTVOLM1+1                                               01686000
CVTVOLI1 EQU   CVTVOLF1                                                 01687000
CVTSTOA  EQU   CVTMAP+376                                               01688000
CVTRSV58 EQU   CVTMAP+374                                               01689000
CVTRSV57 EQU   CVTMAP+372                                               01690000
CVTDDCE  EQU   CVTMAP+368                                               01691000
CVTPNWFR EQU   CVTMAP+364                                               01692000
CVTSMF   EQU   CVTMAP+360                                               01693000
CVTSULK  EQU   CVTMAP+358                                               01694000
CVTSLKO  EQU   CVTSYSK                                                  01695000
CVTSLKP  EQU   CVTSYSK                                                  01696000
CVTSLKQ  EQU   CVTSYSK                                                  01697000
CVTSLKR  EQU   CVTSYSK                                                  01698000
CVTRSV56 EQU   CVTSYSK                                                  01699000
CVTRSV55 EQU   CVTSYSK                                                  01700000
CVTRSV54 EQU   CVTSYSK                                                  01701000
CVTRSV53 EQU   CVTSYSK                                                  01702000
CVTRSV52 EQU   CVTA1F1                                                  01703000
CVTRSV51 EQU   CVTA1F1                                                  01704000
CVTRSV50 EQU   CVTA1F1                                                  01705000
CVTRSV49 EQU   CVTA1F1                                                  01706000
CVTRSV48 EQU   CVTA1F1                                                  01707000
CVTRSV47 EQU   CVTA1F1                                                  01708000
CVTSRSW  EQU   CVTA1F1                                                  01709000
CVTPFSW  EQU   CVTA1F1                                                  01710000
CVTPCVT  EQU   CVTMAP+352                                               01711000
CVTRSV46 EQU   CVTMAP+344                                               01712000
CVTRSV45 EQU   CVTMAP+340                                               01713000
CVTRSV44 EQU   CVTMAP+338                                               01714000
CVTRSV43 EQU   CVTMAP+336                                               01715000
CVTHJESA EQU   CVTHJES+1                                                01716000
CVTRSV42 EQU   CVTHJES                                                  01717000
CVTEXT2A EQU   CVTEXT2+1                                                01718000
CVTRSV41 EQU   CVTEXT2                                                  01719000
CVTAPFA  EQU   CVTAPF+1                                                 01720000
CVTRSV40 EQU   CVTAPF                                                   01721000
CVTRV518 EQU   CVTINTLA                                                 01722000
CVTRV517 EQU   CVTERPV                                                  01723000
CVTEORM  EQU   CVTMAP+312                                               01724000
CVTMCHPR EQU   CVTMAP+308                                               01725000
CVTTZ    EQU   CVTMAP+304                                               01726000
CVTJEPS  EQU   CVTMAP+300                                               01727000
CVTJESCT EQU   CVTMAP+296                                               01728000
CVTMODE  EQU   CVTMAP+292                                               01729000
CVTPTRV  EQU   CVTMAP+288                                               01730000
CVTREAL  EQU   CVTMAP+284                                               01731000
CVTRSV39 EQU   CVTMAP+280                                               01732000
CVTRSV38 EQU   CVTMAP+276                                               01733000
CVTDMSRA EQU   CVTDMSR+1                                                01734000
CVTRSV37 EQU   CVTDMSR                                                  01735000
CVTQMSGA EQU   CVTQMSG+1                                                01736000
CVTRSV36 EQU   CVTQMSG                                                  01737000
CVTAMFF  EQU   CVTMAP+264                                               01738000
CVTPURGA EQU   CVTPURG+1                                                01739000
CVTRSV35 EQU   CVTPURG                                                  01740000
CVTCBSP  EQU   CVTMAP+256                                               01741000
CVTATERA EQU   CVTATER+1                                                01742000
CVTSYST  EQU   CVTATER                                                  01743000
CVTVOLT2 EQU   CVTTAT                                                   01744000
CVTVOLI2 EQU   CVTVOLF2                                                 01745000
CVTAQAVB EQU   CVTAQAVT+1                                               01746000
CVTRSV34 EQU   CVTTCMFG                                                 01747000
CVTRSV33 EQU   CVTTCMFG                                                 01748000
CVTRSV32 EQU   CVTTCMFG                                                 01749000
CVTRSV31 EQU   CVTTCMFG                                                 01750000
CVTRSV30 EQU   CVTTCMFG                                                 01751000
CVTRSV29 EQU   CVTTCMFG                                                 01752000
CVTRSV28 EQU   CVTTCMFG                                                 01753000
CVTTCRDY EQU   CVTTCMFG                                                 01754000
CVTGTFA  EQU   CVTGTF+1                                                 01755000
CVTRSV27 EQU   CVTGTFST                                                 01756000
CVTRNIO  EQU   CVTGTFST                                                 01757000
CVTUSR   EQU   CVTGTFST                                                 01758000
CVTRV318 EQU   CVTFORM                                                  01759000
CVTRV317 EQU   CVTTMODE                                                 01760000
CVTRV316 EQU   CVTSTATE                                                 01761000
CVTRV315 EQU   CVTGTFS                                                  01762000
CVTGTFAV EQU   CVTGTFS                                                  01763000
CVT0SCR1 EQU   CVTMAP+232                                               01764000
CVTRV515 EQU   CVTMAP+228                                               01765000
CVTRMS   EQU   CVTMAP+224                                               01766000
CVTPATCH EQU   CVTMAP+220                                               01767000
CVTTSCE  EQU   CVTMAP+216                                               01768000
CVTLNKSC EQU   CVTMAP+214                                               01769000
CVTQABST EQU   CVTMAP+212                                               01770000
CVTMDLDS EQU   CVTMAP+208                                               01771000
CVTUSER  EQU   CVTMAP+204                                               01772000
CVTABEND EQU   CVTMAP+200                                               01773000
CVTSMCA  EQU   CVTMAP+196                                               01774000
CVTRSV18 EQU   CVTMAP+192                                               01775000
CVTQLPAQ EQU   CVTMAP+188                                               01776000
CVTQCDSR EQU   CVTMAP+184                                               01777000
CVTRSV17 EQU   CVTOPTB                                                  01778000
CVTRSV16 EQU   CVTOPTB                                                  01779000
CVTFP    EQU   CVTOPTB                                                  01780000
CVTAPTHR EQU   CVTOPTB                                                  01781000
CVTNLOG  EQU   CVTOPTB                                                  01782000
CVTTOD   EQU   CVTOPTB                                                  01783000
CVTCTIMS EQU   CVTOPTB                                                  01784000
CVTPROT  EQU   CVTOPTB                                                  01785000
CVTXPFP  EQU   CVTOPTA                                                  01786000
CVTASCII EQU   CVTOPTA                                                  01787000
CVTRSV13 EQU   CVTOPTA                                                  01788000
CVTRSV12 EQU   CVTOPTA                                                  01789000
CVTNIP   EQU   CVTOPTA                                                  01790000
CVTDDR   EQU   CVTOPTA                                                  01791000
CVTAPR   EQU   CVTOPTA                                                  01792000
CVTCCH   EQU   CVTOPTA                                                  01793000
CVTSNCTR EQU   CVTMAP+180                                               01794000
CVTQMWR  EQU   CVTMAP+176                                               01795000
CVTQOCR  EQU   CVTMAP+172                                               01796000
CVT1EF00 EQU   CVTMAP+168                                               01797000
CVTMZ00  EQU   CVTMAP+164                                               01798000
CVTHEAD  EQU   CVTMAP+160                                               01799000
CVTRSV11 EQU   CVTMAP+156                                               01800000
CVT0PT01 EQU   CVTMAP+152                                               01801000
CVTMSER  EQU   CVTMAP+148                                               01802000
CVTRV516 EQU   CVTIERLC                                                 01803000
CVTILCH  EQU   CVTMAP+140                                               01804000
CVT0DS   EQU   CVTMAP+136                                               01805000
CVTFBOSV EQU   CVTMAP+132                                               01806000
CVTNUCB  EQU   CVTMAP+128                                               01807000
CVTIXAVL EQU   CVTMAP+124                                               01808000
CVTIOQET EQU   CVTMAP+120                                               01809000
CVTDCBA  EQU   CVTMAP+117                                               01810000
CVTMVS2  EQU   CVTDCB                                                   01811000
CVT6DAT  EQU   CVTDCB                                                   01812000
CVT4MPS  EQU   CVTDCB                                                   01813000
CVTRSV09 EQU   CVTDCB                                                   01814000
CVT4MS1  EQU   CVTDCB                                                   01815000
CVT2SPS  EQU   CVTDCB                                                   01816000
CVT1SSS  EQU   CVTDCB                                                   01817000
CVTRSV08 EQU   CVTDCB                                                   01818000
CVTSTB   EQU   CVTMAP+112                                               01819000
CVTQTD00 EQU   CVTMAP+108                                               01820000
CVTQTE00 EQU   CVTMAP+104                                               01821000
CVTCUCB  EQU   CVTMAP+100                                               01822000
CVTSJQ   EQU   CVTMAP+96                                                01823000
CVTPBLDL EQU   CVTMAP+92                                                01824000
CVTTPC   EQU   CVTMAP+88                                                01825000
CVTSVDCB EQU   CVTMAP+84                                                01826000
CVTBRET  EQU   CVTMAP+82                                                01827000
CVTEXIT  EQU   CVTMAP+80                                                01828000
CVT0FN00 EQU   CVTMAP+76                                                01829000
CVTDARA  EQU   CVTDAR+1                                                 01830000
CVTRSV07 EQU   CVTFLGS1                                                 01831000
CVTRSV06 EQU   CVTFLGS1                                                 01832000
CVTRSV05 EQU   CVTFLGS1                                                 01833000
CVTRSV04 EQU   CVTFLGS1                                                 01834000
CVTRSV03 EQU   CVTFLGS1                                                 01835000
CVTRSV02 EQU   CVTFLGS1                                                 01836000
CVTRSV01 EQU   CVTFLGS1                                                 01837000
CVTDMPLK EQU   CVTFLGS1                                                 01838000
CVTXITP  EQU   CVTMAP+68                                                01839000
CVTZDTAB EQU   CVTMAP+64                                                01840000
CVTMSLT  EQU   CVTMAP+60                                                01841000
CVTDATE  EQU   CVTMAP+56                                                01842000
CVTBTERM EQU   CVTMAP+52                                                01843000
CVTSYSAD EQU   CVTMAP+48                                                01844000
CVTXTLER EQU   CVTMAP+44                                                01845000
CVTILK2  EQU   CVTMAP+40                                                01846000
CVTILK1  EQU   CVTMAP+36                                                01847000
CVTPRLTV EQU   CVTMAP+32                                                01848000
CVTPCNVT EQU   CVTMAP+28                                                01849000
CVT0VL00 EQU   CVTMAP+24                                                01850000
CVTXAPG  EQU   CVTMAP+20                                                01851000
CVTBUF   EQU   CVTMAP+16                                                01852000
CVTJOB   EQU   CVTMAP+12                                                01853000
CVTLINK  EQU   CVTMAP+8                                                 01854000
CVT0EF00 EQU   CVTMAP+4                                                 01855000
CVTTCBP  EQU   CVTMAP                                                   01856000
CVT      EQU   CVTMAP                                                   01857000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01858000
@ENDDATA EQU   *                                                        01859000
         END   ISTINCOE,(C'PLS0242',0603,75129)                         01860000
