         TITLE 'RESIDENT MODULE- ISTIC000                              *00001000
                        '                                               00002000
ISTIC000 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTIC000  78.150'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @11,0                                               0001 00012000
@PSTART  LA    @12,4095(,@11)                                      0001 00013000
         USING @PSTART,@11                                         0001 00014000
         USING @PSTART+4095,@12                                    0001 00015000
         ST    @13,@SA00001+4                                      0001 00016000
         LA    @14,@SA00001                                        0001 00017000
         ST    @14,8(,@13)                                         0001 00018000
         LR    @13,@14                                             0001 00019000
*                                                                  0271 00020000
*/********************************************************************/ 00021000
*                                                                  0272 00022000
*I00C0000:                                                         0272 00023000
*   ;                                                              0272 00024000
I00C0000 DS    0H                                                  0273 00025000
*   DO;                             /* MODESET MODE(SUP)             */ 00026000
*     I10701='00000000'B;           /* OR MASK                       */ 00027000
         MVI   I10701,B'00000000'                                  0274 00028000
*     I10702='00000000'B;           /* AND MASK                      */ 00029000
         MVI   I10702,B'00000000'                                  0275 00030000
*     I10703='00000000'B;           /* RESERVED                      */ 00031000
         MVI   I10703,B'00000000'                                  0276 00032000
*     I10704='00001100'B;                                          0277 00033000
         MVI   I10704,B'00001100'                                  0277 00034000
*     RESPECIFY                                                    0278 00035000
*       GPR01F RESTRICTED;                                         0278 00036000
*     GPR01F=I107;                  /* MODESET PARMLIST              */ 00037000
         ICM   GPR01F,15,I107                                      0279 00038000
*     SVC(107);                     /* ISSUE MODESET SVC             */ 00039000
         SVC   107                                                 0280 00040000
*     RESPECIFY                                                    0281 00041000
*      (GPR01F) UNRESTRICTED;                                      0281 00042000
*   END;                            /* MODESET MODE(SUP)             */ 00043000
*   R3=ADDR(TLTACB);                /* ESTABLISH PTR TO RCA          */ 00044000
         LA    R3,TLTACB                                           0283 00045000
*   GEN(STM   R0,R15,SAVEALL);      /* SAVE REGS FOR LATER           */ 00046000
         STM   R0,R15,SAVEALL                                           00047000
*   K=ADDR(MSGS2);                  /* SET PTR FOR TOLTEP FAILURE  0285 00048000
*                                      REASONS                       */ 00049000
         LA    @10,MSGS2                                           0285 00050000
         ST    @10,K                                               0285 00051000
*I00C0001:                                                         0286 00052000
*   ;                                                              0286 00053000
*                                                                  0286 00054000
I00C0001 DS    0H                                                  0287 00055000
*/********************************************************************/ 00056000
*/*        STAE EXIT MACRO                                           */ 00057000
*/********************************************************************/ 00058000
*/*VSTAE  ENTRYPT(I00C0060)SAVEAREA(ABNDSAVE)                        */ 00059000
*                                                                  0287 00060000
*   DO;                             /* DECLARE AND RESTRICT REG 2    */ 00061000
*     DCL                                                          0288 00062000
*       GPR02F FIXED(31) REG(02);                                  0288 00063000
*     DCL                                                          0289 00064000
*       GPR02P PTR(31) REG(02);                                    0289 00065000
*     RFY                                                          0290 00066000
*      (GPR02P) RSTD;               /* INVOKE XREGSET MACRO TO CHECK    00067000
*                                      ENTRYPT PARM AND PUT ADDR IN     00068000
*                                      REGISTER 1                    */ 00069000
*/*XREGSET  PPARM(I00C0060)RREG(2,GPR02P)PID('ENTRYPT')              */ 00070000
*                                                                  0291 00071000
*     DO;                                                          0291 00072000
*       GPR02P=ADDR(I00C0060);      /* SET RREG SYMBOL TO ADDRESS OF    00073000
*                                      PPARM OPERAND                 */ 00074000
         LA    GPR02P,I00C0060                                     0292 00075000
*     END;                          /* XREGSET INVOKE STAE MACRO     */ 00076000
*     GEN;                                                         0294 00077000
         ESTAE  (2),CT,XCTL=YES,PURGE=NONE,ASYNCH=YES                   00078000
*                                   /* UNRESTRICT REG 2              */ 00079000
*     RFY                                                          0295 00080000
*      (GPR02P) UNRSTD;                                            0295 00081000
*   END;                            /* VSTAE                         */ 00082000
*   RCAPTR=ADDR(TLTACB);            /* SET UP BASE FOR R.C.A         */ 00083000
         LA    RCAPTR,TLTACB                                       0297 00084000
*   GEN(STM   R11,R12,BASEREGS);    /* SAVE BASE REG FOR LATER       */ 00085000
         STM   R11,R12,BASEREGS                                         00086000
*/********************************************************************/ 00087000
*/*   OPEN ACB & CHECK FOR  ERROR                                    */ 00088000
*/********************************************************************/ 00089000
*                                                                  0299 00090000
*I00C0004:                                                         0299 00091000
*   ;                                                              0299 00092000
I00C0004 DS    0H                                                  0300 00093000
*   $CVTSAVE=0;                     /* ZERO CVT PTR                  */ 00094000
         SLR   @10,@10                                             0300 00095000
         ST    @10,$CVTSAVE(,RCAPTR)                               0300 00096000
*   R15=0;                          /* SET R15 FOR SUCCESS OPEN      */ 00097000
         SLR   R15,R15                                             0301 00098000
*   GEN(OPEN  TLTACB);              /* OPEN ACB TO SIGNAL ATCAM      */ 00099000
         OPEN  TLTACB                                                   00100000
*   R4=R15;                         /* SAVE RETURN CODE              */ 00101000
         LR    R4,R15                                              0303 00102000
*   IF R4^=0                        /* WAS OPEN SUCCESSFUL           */ 00103000
*     THEN                          /* IF YES GO ON TO WAIT          */ 00104000
         LTR   R4,R4                                               0304 00105000
         BNZ   @RT00304                                            0304 00106000
*     GOTO I00C0063;                /* IF NOT ISSUE TOLTEP INACT.    */ 00107000
*   DO;                             /* LISATCVT STATUS(INQUIRE)CVTBAS   00108000
*                                      E(PAGEABLE,(R4))              */ 00109000
*     R4=ATCLCPTR;                  /* SET UP ATCVT POINTER          */ 00110000
         L     R4,ATCLCPTR                                         0307 00111000
*     RFY                                                          0308 00112000
*      (EMCR15) RSTD;                                              0308 00113000
*     GEN SETS(EMCR15)(L     EMCR15,X'10' POINT TO CVT);           0309 00114000
         L     EMCR15,X'10' POINT TO CVT                                00115000
*     IF ATCLCPTR->ATCACTIV='1'B    /* IS VTAM MARKED ACTIVE         */ 00116000
*         &ATCLCPTR->ATCSNHLT='0'B  /* AND NOT HALTING               */ 00117000
*         &ATCLCPTR->ATCQKHLT='0'B THEN                            0310 00118000
         L     @10,ATCLCPTR                                        0310 00119000
         TM    ATCACTIV(@10),B'01000000'                           0310 00120000
         BNO   @RF00310                                            0310 00121000
         TM    ATCSNHLT(@10),B'00110000'                           0310 00122000
         BNZ   @RF00310                                            0310 00123000
*       EMCR15=0;                   /* YES, INDICATE VTAM ACTIVE     */ 00124000
         SLR   EMCR15,EMCR15                                       0311 00125000
*     ELSE                          /* NO, VTAM NOT ACTIVE           */ 00126000
*       EMCR15=4;                   /* INDICATE VTAM INACTIVE        */ 00127000
         B     @RC00310                                            0312 00128000
@RF00310 LA    EMCR15,4                                            0312 00129000
*     RFY                                                          0313 00130000
*      (EMCR15) UNRSTD;                                            0313 00131000
@RC00310 DS    0H                                                  0314 00132000
*   END;                            /* LISATCVT                      */ 00133000
*   IF R15^=0                       /* IS VTAM ACTIVE                */ 00134000
*     THEN                                                         0315 00135000
         LTR   R15,R15                                             0315 00136000
         BNZ   @RT00315                                            0315 00137000
*     GOTO I00C0068;                /* BR NO                         */ 00138000
*   $CVTSAVE=R4;                    /* SAVE PTR TO CVT               */ 00139000
         ST    R4,$CVTSAVE(,RCAPTR)                                0317 00140000
*   RESPECIFY                                                      0318 00141000
*     ISTATCVT BASED(R4);                                          0318 00142000
*   RESPECIFY                                                      0319 00143000
*     ISTDYPAB BASED(ADDR(ATCTIPAB));                              0319 00144000
*   RESPECIFY                                                      0320 00145000
*     ISTPAB BASED(ADDR(DYPPAB));                                  0320 00146000
*   RESPECIFY                                                      0321 00147000
*     ISTUECB BASED(UECBPTR);                                      0321 00148000
*   PABDVTA=ADDR(ATCTODVT);         /* INIT DVT PTR IN PAB           */ 00149000
         LA    @10,ATCTODVT(,R4)                                   0322 00150000
         STCM  @10,7,PABDVTA+608(R4)                               0322 00151000
*   ATCTACB=RCAPTR;                 /* STORE RCA PTR IN CVT          */ 00152000
         ST    RCAPTR,ATCTACB(,R4)                                 0323 00153000
*   RESPECIFY                                                      0324 00154000
*     IFGACB BASED(ADDR(TLTACB));                                  0324 00155000
*   R5=ACBDEB;                      /* PICK UP DEB PTR               */ 00156000
         LA    @10,TLTACB                                          0325 00157000
         L     R5,ACBDEB-1(,@10)                                   0325 00158000
         LA    R5,0(,R5)                                           0325 00159000
*   R5=R5-16;                       /* BACK UP TO TASK ID            */ 00160000
         SL    R5,@CF00708                                         0326 00161000
*   DYPTSKID=TASKID;                /* SET UP TASK ID IN PAB         */ 00162000
         L     @10,TASKID(,R5)                                     0327 00163000
         ST    @10,DYPTSKID+592(,R4)                               0327 00164000
*   ATCTODVT=ADDR(I00C0030);        /* POINT TO RFT EXIT             */ 00165000
         LA    @10,I00C0030                                        0328 00166000
         ST    @10,ATCTODVT(,R4)                                   0328 00167000
*   GEN(SETLOGON RPL=TLTPRPL,ACB=TLTACB,OPTCD=(SYN,START));        0329 00168000
         SETLOGON RPL=TLTPRPL,ACB=TLTACB,OPTCD=(SYN,START)              00169000
*   GOTO I00C0006;                                                 0330 00170000
*                                                                  0330 00171000
         B     I00C0006                                            0330 00172000
*/********************************************************************/ 00173000
*/*   WAIT MACRO - WAITS ON ECB TLTPECB1                             */ 00174000
*/********************************************************************/ 00175000
*                                                                  0331 00176000
*I00C0005:                                                         0331 00177000
*   ;                                                              0331 00178000
I00C0005 DS    0H                                                  0332 00179000
*   GEN;                                                           0332 00180000
         USING *,R15                                                    00181000
         LM    R0,R15,SAVEALL                                           00182000
          DROP  R15                                                     00183000
*   IF $VTAMEND='1'B                /* IS VTAM ENDING                */ 00184000
*     THEN                                                         0333 00185000
         TM    $VTAMEND(RCAPTR),B'00000001'                        0333 00186000
         BO    @RT00333                                            0333 00187000
*     GOTO I00C0068;                /* YES GO CLOSE ACB              */ 00188000
*I00C0006:                                                         0335 00189000
*   ;                                                              0335 00190000
*                                                                  0335 00191000
I00C0006 DS    0H                                                  0336 00192000
*   /*****************************************************************/ 00193000
*   /*                                                               */ 00194000
*   /* FIND VTAM CVT & WAIT ON ECB                                   */ 00195000
*   /*                                                               */ 00196000
*   /*****************************************************************/ 00197000
*                                                                  0336 00198000
*   R4=$CVTSAVE;                    /* SET PTR TO CVT                */ 00199000
         L     R4,$CVTSAVE(,RCAPTR)                                0336 00200000
*   R1=ADDR(ATCECTLP);              /* PICK UP ADDRESS OF ECB        */ 00201000
         LA    R1,ATCECTLP(,R4)                                    0337 00202000
*   CALL I00C1002;                  /* WAIT TO START         @D32JPPW*/ 00203000
         BAL   @14,I00C1002                                        0338 00204000
*   IF $VTAMEND='1'B                /* IS VTAM ENDING                */ 00205000
*     THEN                                                         0339 00206000
         TM    $VTAMEND(RCAPTR),B'00000001'                        0339 00207000
         BO    @RT00339                                            0339 00208000
*     GOTO I00C0068;                /* YES CLOSE ACB                 */ 00209000
*   IF ATCMTST='1'B                 /* ** TEST FOR CONSOLE LOG       */ 00210000
*     THEN                          /* ** IF YES CALL SIM LOGON**    */ 00211000
         TM    ATCMTST(R4),B'00100000'                             0341 00212000
         BNO   @RF00341                                            0341 00213000
*     DO;                           /* ** I00C0070                   */ 00214000
*       R15=ADDR(I00C0070);         /* **                            */ 00215000
         LA    R15,I00C0070                                        0343 00216000
*       CALL I00C0070;              /* **                            */ 00217000
         BAL   @14,I00C0070                                        0344 00218000
*       IF R15^=0                   /* ** WAS LOGON ACCEPTED         */ 00219000
*         THEN                      /* ** NO GOTO ISSUE WAIT         */ 00220000
         LTR   R15,R15                                             0345 00221000
         BNZ   @RT00345                                            0345 00222000
*         GOTO I00C0006;                                           0346 00223000
*     END;                          /* **                            */ 00224000
*   IF $FSTAREA=0                   /* TEST FOR ACTIVE TEST REQ      */ 00225000
*     THEN                          /* IF NOT FIELD ZERO             */ 00226000
@RF00341 L     @10,$FSTAREA(,RCAPTR)                               0348 00227000
         LTR   @10,@10                                             0348 00228000
         BZ    @RT00348                                            0348 00229000
*     GOTO I00C0006;                /* GO BACK AND WAIT              */ 00230000
*   ELSE                            /* IF NOT ZERO                   */ 00231000
*     R2=$FSTAREA;                  /* USE PTR                       */ 00232000
         LR    R2,@10                                              0350 00233000
*   $CURRTWA=R2;                    /* SET UP CURR T.W.A. PTR        */ 00234000
         ST    R2,$CURRTWA(,RCAPTR)                                0351 00235000
*   CALL ISTIC002;                  /* GOTO COMM INTERVAL            */ 00236000
         L     @15,@CV02669                                        0352 00237000
         BALR  @14,@15                                             0352 00238000
*   GOTO I00C0006;                  /* LOOP TO WAIT AGAIN            */ 00239000
         B     I00C0006                                            0353 00240000
*/********************************************************************/ 00241000
*                                                                  0354 00242000
*                                                                  0354 00243000
*/********************************************************************/ 00244000
*/*      LOGON EXIT      R1 POINTS TO PARM. 2ND WORD=SYMBOLIC NAME   */ 00245000
*/********************************************************************/ 00246000
*                                                                  0354 00247000
*I00C0020:                                                         0354 00248000
*   ;                                                              0354 00249000
I00C0020 DS    0H                                                  0355 00250000
*   GEN;                                                           0355 00251000
         USING *,15                                                     00252000
         LM    R11,R12,BASEREGS         /* PICK UP SAVED BASE REG    */ 00253000
         DROP  R15                                                      00254000
*   LOGSV14=R14;                    /* SAVE RETURN POINT             */ 00255000
         ST    R14,LOGSV14                                         0356 00256000
*   LOGSVR1=R1;                     /* SAVE RPH PTR                  */ 00257000
         ST    R1,LOGSVR1                                          0357 00258000
*   R3=ADDR(TLTACB);                /* SET PTR TO R.C.A.             */ 00259000
         LA    R3,TLTACB                                           0358 00260000
*   R4=$CVTSAVE;                    /* SET PTR TO CVT                */ 00261000
         L     R4,$CVTSAVE(,RCAPTR)                                0359 00262000
*   R6=LENGTH(ISTDYPAB);            /* GET SIZE OF DYN PAB           */ 00263000
         LA    R6,32                                               0360 00264000
*   IF TOLACBA=R3                   /* IS IT A TRUE LOGON            */ 00265000
*     THEN                          /* YES                           */ 00266000
         C     R3,TOLACBA(,R1)                                     0361 00267000
         BNE   @RF00361                                            0361 00268000
*     UECBPTR=R1-R6;                /* COMPUTE START OF UECB         */ 00269000
         LR    @10,R1                                              0362 00270000
         SLR   @10,R6                                              0362 00271000
         ST    @10,UECBPTR                                         0362 00272000
*   ELSE                            /* IF NOT TRUE LOG               */ 00273000
*     UECBPTR=R1;                   /* THN PTR IS UECB               */ 00274000
         B     @RC00361                                            0363 00275000
@RF00361 ST    R1,UECBPTR                                          0363 00276000
*   IF UECREQNM=CICALL|             /* IS CALL FROM                  */ 00277000
*       UECREQNM=NETCALL            /* CI OR SYSCON                  */ 00278000
*     THEN                          /* IF YES NO NEED                */ 00279000
@RC00361 L     @10,UECBPTR                                         0364 00280000
         CLC   UECREQNM(8,@10),CICALL                              0364 00281000
         BE    @RT00364                                            0364 00282000
         CLC   UECREQNM(8,@10),NETCALL                             0364 00283000
         BE    @RT00364                                            0364 00284000
*     GOTO I00C0021;                /* TO SET UP TIE                 */ 00285000
*   R5=ADDR(LOGINTEL);              /* SET PTR TO TIE                */ 00286000
         LA    R5,LOGINTEL                                         0366 00287000
*   TIETYPE=TITYPE;                 /* SET UP TOLTEP INT ELEMENT     */ 00288000
         MVI   TIETYPE(R5),X'18'                                   0367 00289000
*   TIELNGTH=LENGTH(ISTTIE);                                       0368 00290000
         MVI   TIELNGTH(R5),X'10'                                  0368 00291000
*   TIESNA=SYMPTR;                  /* MOVE SYM NAME PTR TO TIE      */ 00292000
         L     @09,SYMPTR(,R1)                                     0369 00293000
         ST    @09,TIESNA(,R5)                                     0369 00294000
*   TIERPHA=0;                      /* SET ECB TO ZERO               */ 00295000
         SLR   @09,@09                                             0370 00296000
         ST    @09,TIERPHA(,R5)                                    0370 00297000
*   UECUSFLD=R5;                    /* SET TIE PTR TO USER FIELD     */ 00298000
         ST    R5,UECUSFLD(,@10)                                   0371 00299000
*I00C0021:                                                         0372 00300000
*   ;                                                              0372 00301000
I00C0021 DS    0H                                                  0373 00302000
*   $DEVAREA=($DEVAREA&&$DEVAREA);  /* CLEAR DEV CHARS               */ 00303000
         XC    $DEVAREA(4,RCAPTR),$DEVAREA(RCAPTR)                 0373 00304000
*   GEN(STM   R0,R15,LOGSVE3);      /* SAVE REGS                     */ 00305000
         STM   R0,R15,LOGSVE3                                           00306000
*   CALL I00C0031;                  /* GO ON TO LOGON                */ 00307000
         BAL   @14,I00C0031                                        0375 00308000
*   GEN(LM    R0,R15,LOGSVE3);                                     0376 00309000
         LM    R0,R15,LOGSVE3                                           00310000
*   R1=LOGSVR1;                     /* RESET R1                      */ 00311000
         L     R1,LOGSVR1                                          0377 00312000
*   R14=LOGSV14;                    /* PICK UP RTN POINTER           */ 00313000
         L     R14,LOGSV14                                         0378 00314000
*   GEN(BR    R14);                                                0379 00315000
*                                                                  0379 00316000
         BR    R14                                                      00317000
*/********************************************************************/ 00318000
*                                                                  0380 00319000
*                                                                  0380 00320000
*/********************************************************************/ 00321000
*/*      REQUEST FOR TEXT EXIT     R1 POINTS TO SYMBOLIC NAME        */ 00322000
*/********************************************************************/ 00323000
*                                                                  0380 00324000
*I00C0030:                                                         0380 00325000
*   ;                                                              0380 00326000
I00C0030 DS    0H                                                  0381 00327000
*   GEN;                                                           0381 00328000
         USING *,R15                                                    00329000
         LM    R11,R12,BASEREGS         /* PICK UP SAVED BASE REG    */ 00330000
         DROP  R15                                                      00331000
*   R13=ADDR(LOGSVE5);              /* POINT TO SAVEAREA     @D32JPPW*/ 00332000
         LA    R13,LOGSVE5                                         0382 00333000
*   RPHSVR1=R1;                     /* SAVE PTR TO RPH               */ 00334000
         ST    R1,RPHSVR1                                          0383 00335000
*   R3=ADDR(TLTACB);                /* SET PTR TO RCA                */ 00336000
         LA    R3,TLTACB                                           0384 00337000
*   R4=$CVTSAVE;                    /* SET PTR TO CVT                */ 00338000
         L     R4,$CVTSAVE(,RCAPTR)                                0385 00339000
*   R5=RPHWEA;                      /* GET PTR TO TIE                */ 00340000
         L     R5,RPHWEA(,RPHPTR)                                  0386 00341000
*   IF $NEWCT^='1'B&                /* TEST FOR CALL FRM             */ 00342000
*       $CONSOLE^='1'B              /* CI OR I00C0070                */ 00343000
*     THEN                          /* IF NEITHER IGNORE             */ 00344000
         TM    $NEWCT(RCAPTR),B'00100100'                          0387 00345000
         BZ    @RT00387                                            0387 00346000
*     GOTO I00C003X;                /* REQUEST-INVALID               */ 00347000
*                                                                  0388 00348000
*   /*****************************************************************/ 00349000
*   /*                                                               */ 00350000
*   /* REQSTORE CBID(UECB)CLEAR(YES)SAVE(YES)PRIORITY(NO)            */ 00351000
*   /*                                                               */ 00352000
*   /*****************************************************************/ 00353000
*                                                                  0389 00354000
*   DO;                                                            0389 00355000
*                                                                  0389 00356000
@RF00387 DS    0H                                                  0390 00357000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 00358000
*/* END OF ATBUILD                                                   */ 00359000
*                                                                  0390 00360000
*     DCL                                                          0390 00361000
*       GPR01F FIXED(31) REG(01);                                  0390 00362000
*     DCL                                                          0391 00363000
*       GPR01P PTR(31) REG(01);                                    0391 00364000
*     DCL                                                          0392 00365000
*       GPR03F FIXED(31) REG(03);                                  0392 00366000
*     DCL                                                          0393 00367000
*       GPR03P PTR(31) REG(03);                                    0393 00368000
*     DCL                                                          0394 00369000
*       GPR04F FIXED(31) REG(04);                                  0394 00370000
*     DCL                                                          0395 00371000
*       GPR04P PTR(31) REG(04);                                    0395 00372000
*     DCL                                                          0396 00373000
*       GPR05F FIXED(31) REG(05);                                  0396 00374000
*     DCL                                                          0397 00375000
*       GPR05P PTR(31) REG(05);                                    0397 00376000
*     DCL                                                          0398 00377000
*       GPR06F FIXED(31) REG(06);                                  0398 00378000
*     DCL                                                          0399 00379000
*       GPR06P PTR(31) REG(06);                                    0399 00380000
*     DCL                                                          0400 00381000
*       GPR07F FIXED(31) REG(07);                                  0400 00382000
*     DCL                                                          0401 00383000
*       GPR07P PTR(31) REG(07);                                    0401 00384000
*     DCL                                                          0402 00385000
*       GPR08F FIXED(31) REG(08);                                  0402 00386000
*     DCL                                                          0403 00387000
*       GPR08P PTR(31) REG(08);                                    0403 00388000
*     DCL                                                          0404 00389000
*       GPR09F FIXED(31) REG(09);                                  0404 00390000
*     DCL                                                          0405 00391000
*       GPR09P PTR(31) REG(09);                                    0405 00392000
*     DCL                                                          0406 00393000
*       GPR10F FIXED(31) REG(10);                                  0406 00394000
*     DCL                                                          0407 00395000
*       GPR10P PTR(31) REG(10);                                    0407 00396000
*     DCL                                                          0408 00397000
*       GPR11F FIXED(31) REG(11);                                  0408 00398000
*     DCL                                                          0409 00399000
*       GPR11P PTR(31) REG(11);                                    0409 00400000
*     DCL                                                          0410 00401000
*       GPR12F FIXED(31) REG(12);                                  0410 00402000
*     DCL                                                          0411 00403000
*       GPR12P PTR(31) REG(12);                                    0411 00404000
*     DCL                                                          0412 00405000
*       GPR13F FIXED(31) REG(13);                                  0412 00406000
*     DCL                                                          0413 00407000
*       GPR13P PTR(31) REG(13);                                    0413 00408000
*     DCL                                                          0414 00409000
*       GPR15F FIXED(31) REG(15);                                  0414 00410000
*     DCL                                                          0415 00411000
*       GPR15P PTR(31) REG(15);                                    0415 00412000
*     RFY                                                          0416 00413000
*      (GPR02P,                                                    0416 00414000
*       GPR03P,                                                    0416 00415000
*       GPR04P,                                                    0416 00416000
*       GPR15P) RSTD;                                              0416 00417000
*     RFY                                                          0417 00418000
*      (GPR01P,                                                    0417 00419000
*       GPR13P) RSTD;                                              0417 00420000
*     GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);           0418 00421000
           STM GPR02P,GPR13P,RPHWORK(GPR01P)                            00422000
*     RFY                                                          0419 00423000
*      (GPR01P,                                                    0419 00424000
*       GPR13P) UNRSTD;                                            0419 00425000
*     DO;                           /* LISATCVT                    0420 00426000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00427000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 00428000
         L     GPR15P,ATCLCPTR                                     0421 00429000
*     END;                          /* LISATCVT                      */ 00430000
*     GPR02P=GPR15P->ATCBPDA|'80000000'X;                          0423 00431000
         L     GPR02P,ATCBPDA(,GPR15P)                             0423 00432000
         O     GPR02P,@CF01984                                     0423 00433000
*     DCL                                                          0424 00434000
*       1 FMZA0030 FIXED(31) STATIC LOCAL,                         0424 00435000
*        2 * FIXED(8) INIT(152),                                   0424 00436000
*        2 * PTR(24) INIT(0);                                      0424 00437000
*     GPR03F=FMZA0030;                                             0425 00438000
         L     GPR03F,FMZA0030                                     0425 00439000
*     GPR04F=17;                                                   0426 00440000
         LA    GPR04F,17                                           0426 00441000
*     GPR15P=GPR15P->ATCSMRQ;                                      0427 00442000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0427 00443000
*     DCL                                                          0428 00444000
*       FMZL0030 BASED(GPR15P) LABEL VALUERANGE(*);                0428 00445000
*     CALL FMZL0030;                                               0429 00446000
         BALR  @14,@15                                             0429 00447000
*     RFY                                                          0430 00448000
*      (GPR13P) RSTD;                                              0430 00449000
*     GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);           0431 00450000
           LM GPR02P,GPR13P,RPHWORK(GPR01P)                             00451000
*     RFY                                                          0432 00452000
*      (GPR13P) UNRSTD;                                            0432 00453000
*     RFY                                                          0433 00454000
*      (GPR02P,                                                    0433 00455000
*       GPR03P,                                                    0433 00456000
*       GPR04P,                                                    0433 00457000
*       GPR15P) UNRSTD;                                            0433 00458000
*   END;                                                           0434 00459000
*                                                                  0434 00460000
*   /*****************************************************************/ 00461000
*   /*                                                               */ 00462000
*   /* ******** END OF REQSTORE EXPANSION                            */ 00463000
*   /*                                                               */ 00464000
*   /*****************************************************************/ 00465000
*                                                                  0435 00466000
*   IF R15^=0                       /* WAS STORAGE AVAILABLE         */ 00467000
*     THEN                                                         0435 00468000
         LTR   R15,R15                                             0435 00469000
         BZ    @RF00435                                            0435 00470000
*     DO;                           /* IGNORE RFT                    */ 00471000
*       TIERETCD='04'X;             /* SET BAD RETN CODE             */ 00472000
         MVI   TIERETCD(R5),X'04'                                  0437 00473000
*       R1=ADDR(TIERPHA);           /* POST WTING ECB                */ 00474000
         LA    R1,TIERPHA(,R5)                                     0438 00475000
*       CALL I00C1001;              /* POST ECB              @D32JPPW*/ 00476000
         BAL   @14,I00C1001                                        0439 00477000
*       GOTO I00C003X;              /* GOTO TPEXIT                   */ 00478000
         B     I00C003X                                            0440 00479000
*     END;                                                         0441 00480000
*   UECBPTR=RPHSRPRM;               /* PICK UP PTR TO UECB           */ 00481000
@RF00435 L     @10,RPHSRPRM(,RPHPTR)                               0442 00482000
         ST    @10,UECBPTR                                         0442 00483000
*   UECTYPE=UECLOGON;               /* SET UP UECB                   */ 00484000
         MVI   UECTYPE(@10),X'06'                                  0443 00485000
*   UECLEN=LENGTH(ISTUECB);                                        0444 00486000
         MVI   UECLEN(@10),X'54'                                   0444 00487000
*   UECTSKID=DYPTSKID;                                             0445 00488000
         L     @09,DYPTSKID+592(,R4)                               0445 00489000
         ST    @09,UECTSKID(,@10)                                  0445 00490000
*   UECID=UECTYP;                   /* INDICATE BLK UECB             */ 00491000
         MVI   UECID(@10),X'26'                                    0446 00492000
*   RESPECIFY                                                      0447 00493000
*     ISTPAB BASED(ADDR(UECPAB));                                  0447 00494000
*   PABOFFST=ADDR(UECPAB)-ADDR(ISTUECB);                           0448 00495000
         LA    @09,16                                              0448 00496000
         ALR   @09,@10                                             0448 00497000
         MVI   PABOFFST(@09),X'10'                                 0448 00498000
*   PABDVTA=ADDR(ATCUEP);                                          0449 00499000
         LA    @08,ATCUEP(,R4)                                     0449 00500000
         STCM  @08,7,PABDVTA(@09)                                  0449 00501000
*   PABAPYP='1'B;                   /* SET USER EXIT BIT             */ 00502000
         OI    PABAPYP(@09),B'10000000'                            0450 00503000
*   RESPECIFY                                                      0451 00504000
*     ISTPAB BASED(ADDR(DYPPAB));                                  0451 00505000
*   UECACB=R3;                                                     0452 00506000
         ST    R3,UECACB(,@10)                                     0452 00507000
*   UECNDID=ADDR(UECSYMNM);                                        0453 00508000
         LA    @09,UECSYMNM(,@10)                                  0453 00509000
         ST    @09,UECNDID(,@10)                                   0453 00510000
*   R4=TIESNA;                                                     0454 00511000
         L     R4,TIESNA(,R5)                                      0454 00512000
*   UECSYMNM=$RFTTERM;                                             0455 00513000
         MVC   UECSYMNM(8,@10),$RFTTERM(R4)                        0455 00514000
*   R4=$CVTSAVE;                    /* SET PTR TO CVT                */ 00515000
         L     R4,$CVTSAVE(,RCAPTR)                                0456 00516000
*   UECUSFLD=R5;                                                   0457 00517000
         ST    R5,UECUSFLD(,@10)                                   0457 00518000
*   IF $NEWCT='1'B                  /* IF CALL FROM CI               */ 00519000
*     THEN                                                         0458 00520000
         TM    $NEWCT(RCAPTR),B'00000100'                          0458 00521000
         BNO   @RF00458                                            0458 00522000
*     UECREQNM=CICALL;              /* SET CICALL INTO TIE           */ 00523000
         MVC   UECREQNM(8,@10),CICALL                              0459 00524000
*   ELSE                            /* ELSE CALL FRM 070             */ 00525000
*     UECREQNM=NETCALL;             /* SET SYSCON IN UECB            */ 00526000
         B     @RC00458                                            0460 00527000
@RF00458 L     @10,UECBPTR                                         0460 00528000
         MVC   UECREQNM(8,@10),NETCALL                             0460 00529000
*   $CONSOLE='0'B;                  /* DONE WITH SWITCH              */ 00530000
@RC00458 NI    $CONSOLE(RCAPTR),B'11011111'                        0461 00531000
*   R7=UECBPTR;                     /* PICK UP PTR TO UECB           */ 00532000
         L     @10,UECBPTR                                         0462 00533000
         LR    R7,@10                                              0462 00534000
*   R0=R7;                          /* POINT TO ELEMENT      @D32JPPW*/ 00535000
         LR    R0,R7                                               0463 00536000
*   R1=ADDR(UECPAB);                /* POINT TO PAB          @D32JPPW*/ 00537000
         LA    R1,UECPAB(,@10)                                     0464 00538000
*   CALL I00C1000;                  /* TPQUE                 @D32JPPW*/ 00539000
         BAL   @14,I00C1000                                        0465 00540000
*I00C003X:                                                         0466 00541000
*   ;                                                              0466 00542000
I00C003X DS    0H                                                  0467 00543000
*   R1=RPHSVR1;                     /* RESET PTR TO RPH              */ 00544000
         L     R1,RPHSVR1                                          0467 00545000
*/* TPEXIT  NORM                                                     */ 00546000
*                                                                  0468 00547000
*   DO;                                                            0468 00548000
*     DCL                                                          0469 00549000
*       GPR00F FIXED(31) REG(00);                                  0469 00550000
*     DCL                                                          0470 00551000
*       GPR00P PTR(31) REG(00);                                    0470 00552000
*     RESPECIFY                                                    0471 00553000
*       GPR15P RSTD;                                               0471 00554000
*                                                                  0471 00555000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */ 00556000
*/* END OF ATBUILD                                                   */ 00557000
*                                                                  0472 00558000
*     DO;                           /* LISATCVT                    0472 00559000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00560000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 00561000
         L     GPR15P,ATCLCPTR                                     0473 00562000
*     END;                          /* LISATCVT                      */ 00563000
*     RESPECIFY                                                    0475 00564000
*       GPR00F RSTD;                                               0475 00565000
*     GPR00F=4;                     /* SET PARAMETER REGISTER TO 4   */ 00566000
         LA    GPR00F,4                                            0476 00567000
*     GPR15P=GPR15P->ATCAP31;                                      0477 00568000
         L     GPR15P,ATCAP31(,GPR15P)                             0477 00569000
*     DCL                                                          0478 00570000
*       FMZL0049 BASED(GPR15P) LABEL VALUERANGE(*);                0478 00571000
*     CALL FMZL0049;                                               0479 00572000
         BALR  @14,@15                                             0479 00573000
*     RESPECIFY                                                    0480 00574000
*      (GPR00F,                                                    0480 00575000
*       GPR15P) UNRSTD;                                            0480 00576000
*   END;                            /* **** END OF TPEXIT            */ 00577000
*   GEN(EJECT);                                                    0482 00578000
         EJECT                                                          00579000
*                                                                  0483 00580000
*/********************************************************************/ 00581000
*/*     RFT/LOGON COMMON CODE                                        */ 00582000
*/********************************************************************/ 00583000
*                                                                  0483 00584000
*I00C0031:                                                         0483 00585000
*   ;                                                              0483 00586000
I00C0031 DS    0H                                                  0484 00587000
*   R13=ADDR(LOGSVE5);              /* GET A SAVE AREA               */ 00588000
         LA    R13,LOGSVE5                                         0484 00589000
*   RFTSV14=R14;                    /* SAVE R14                      */ 00590000
         ST    R14,RFTSV14                                         0485 00591000
*   R3=ADDR(TLTACB);                /* SET PTR TO R.C.A.             */ 00592000
         LA    R3,TLTACB                                           0486 00593000
*   J=ADDR(MSGS1);                  /* SET PTR TO REASONS            */ 00594000
         LA    @10,MSGS1                                           0487 00595000
         ST    @10,J                                               0487 00596000
*   R5=UECUSFLD;                    /* GET PTR TO TIE                */ 00597000
         L     @10,UECBPTR                                         0488 00598000
         L     R5,UECUSFLD(,@10)                                   0488 00599000
*   TIERETCD='00'X;                 /* SET GOOD RTN CODE             */ 00600000
         MVI   TIERETCD(R5),X'00'                                  0489 00601000
*   R4=UECNDID;                     /* GET PTR TO SYMNAME IN TIE     */ 00602000
         L     R4,UECNDID(,@10)                                    0490 00603000
*   QNAME=R4;                       /* SET PTR IN QHNDLR PARM        */ 00604000
         ST    R4,QNAME                                            0491 00605000
*   QCODE='00'X;                    /* SET CODE TO SEARCH ON NAME    */ 00606000
         MVI   QCODE,X'00'                                         0492 00607000
*   R1=ADDR(QHNLPARM);              /* SET PTR TO PARM               */ 00608000
         LA    R1,QHNLPARM                                         0493 00609000
*   CALL ISTCC015;                  /* GOTO TBL SEARCH               */ 00610000
         L     @15,@CV02665                                        0494 00611000
         BALR  @14,@15                                             0494 00612000
*   IF R15=0                        /* IF RTN ZERO TERM IS IN        */ 00613000
*     THEN                          /* USE ASSUME THIS IS A REQ      */ 00614000
         LTR   R15,R15                                             0495 00615000
         BNZ   @RF00495                                            0495 00616000
*     DO;                           /* FOR THE C.I.                  */ 00617000
*       R2=R1;                      /* SET UP BASE REG FOR DSECT     */ 00618000
         LR    R2,R1                                               0497 00619000
*       DO I=1 TO $DEVCNTS WHILE($RFTTERM^=$SYSMN(I));/* NASA      0498 00620000
*                                                            @ZA20801*/ 00621000
         LA    @10,1                                               0498 00622000
         B     @DE00498                                            0498 00623000
@DL00498 LR    @09,@10                                             0498 00624000
         MH    @09,@CH01461                                        0498 00625000
         ALR   @09,WAPTR                                           0498 00626000
         CLC   $RFTTERM(8,R4),$SYSMN-68(@09)                       0498 00627000
         BE    @DC00498                                            0498 00628000
*       END;                        /*                       @ZA20801*/ 00629000
         AL    @10,@CF00063                                        0499 00630000
@DE00498 STH   @10,I                                               0499 00631000
         CH    @10,$DEVCNTS(,WAPTR)                                0499 00632000
         BNH   @DL00498                                            0499 00633000
@DC00498 DS    0H                                                  0500 00634000
*       IF I>1&I<$DEVCNTS+1 THEN    /* IS LOGON FOR TEST TERMINAL? 0500 00635000
*                                                            @ZA20801*/ 00636000
         LH    @10,I                                               0500 00637000
         LA    @09,1                                               0500 00638000
         CR    @10,@09                                             0500 00639000
         BNH   @RF00500                                            0500 00640000
         LH    @08,$DEVCNTS(,WAPTR)                                0500 00641000
         ALR   @08,@09                                             0500 00642000
         CR    @10,@08                                             0500 00643000
         BNL   @RF00500                                            0500 00644000
*         DO;                       /*                       @ZA20801*/ 00645000
*                                                                  0501 00646000
*           /*********************************************************/ 00647000
*           /*                                                       */ 00648000
*           /* THIS ROUTINE ISSUES AN OPNDST WITH PREEMPT FOR AN     */ 00649000
*           /* ENDING NODE                                   @ZA20801*/ 00650000
*           /*                                                       */ 00651000
*           /*********************************************************/ 00652000
*                                                                  0502 00653000
*           COUNTFI=I;              /*                       @ZA20801*/ 00654000
         L     @09,$PTRAREA(,WAPTR)                                0502 00655000
         STH   @10,COUNTFI(,@09)                                   0502 00656000
*           $OPIS(I)=$OPIS(I)+1;    /* ADD ONE TO OPENS ISSUED CTR 0503 00657000
*                                                            @ZA20801*/ 00658000
*                                                                  0503 00659000
         MH    @10,@CH01461                                        0503 00660000
         LA    @09,1                                               0503 00661000
         AH    @09,$OPIS-68(@10,WAPTR)                             0503 00662000
         STH   @09,$OPIS-68(@10,WAPTR)                             0503 00663000
*           /*********************************************************/ 00664000
*           /*                                                       */ 00665000
*           /* SET UP RPL AND NIB IN OLT AREA                @ZA20801*/ 00666000
*           /*                                                       */ 00667000
*           /*********************************************************/ 00668000
*                                                                  0504 00669000
*           BUFFRPL(1:LENGTH($TLTPRPL))=$TLTPRPL;/*          @ZA20801*/ 00670000
         L     @09,$PTRAREA(,WAPTR)                                0504 00671000
         ST    @10,@TF00001                                        0504 00672000
         LA    @10,12                                              0504 00673000
         ALR   @10,@09                                             0504 00674000
         MVC   BUFFRPL(120,@10),$TLTPRPL(RCAPTR)                   0504 00675000
*           ADDR(BUFFRPL)->RPLUSFLD=WAPTR;/* STORE TWA PTR IN RPL  0505 00676000
*                                                            @ZA20801*/ 00677000
         ST    WAPTR,RPLUSFLD(,@10)                                0505 00678000
*           NIBPTR=$PTRAREA+LENGTH($TLTPRPL)+LENGTH(WORKFLS);/*    0506 00679000
*                                                            @ZA20801*/ 00680000
         AL    @09,@CF01162                                        0506 00681000
         LR    NIBPTR,@09                                          0506 00682000
*           BUFFNIB(1:LENGTH(ISTNIB))=M200820;/*             @ZA20801*/ 00683000
         MVC   BUFFNIB(64,NIBPTR),M200820                          0507 00684000
*           NIBSYM=$SYSMN(I);       /* MOVE IN SYM. NAME IN NIB    0508 00685000
*                                                            @ZA20801*/ 00686000
         LR    @10,WAPTR                                           0508 00687000
         AL    @10,@TF00001                                        0508 00688000
         MVC   NIBSYM(8,NIBPTR),$SYSMN-68(@10)                     0508 00689000
*           NIBMODE(1:8)='BASIC   ';/* DEFAULT BASIC         @ZA20801*/ 00690000
         MVC   NIBMODE(8,NIBPTR),@CC03006                          0509 00691000
*           BINDLEN=0;              /* INIT BIND LENGTH      @ZA20801*/ 00692000
         SLR   @10,@10                                             0510 00693000
         ST    @10,BINDLEN                                         0510 00694000
*           IF $DEVLU(I)='1'B THEN  /* IS THIS DEVICE AN LU  @ZA20801*/ 00695000
         LR    @10,WAPTR                                           0511 00696000
         AL    @10,@TF00001                                        0511 00697000
         TM    $DEVLU-68(@10),B'00001000'                          0511 00698000
         BNO   @RF00511                                            0511 00699000
*             DO;                   /* YES                   @ZA20801*/ 00700000
*               NIBMODE(1:8)='RECORD  ';/* SET MODE TO RECORD      0513 00701000
*                                                            @ZA20801*/ 00702000
         MVC   NIBMODE(8,NIBPTR),@CC03008                          0513 00703000
*               NIBLMODE='';        /* BLANK OUT NIBLMODE    @ZA20801*/ 00704000
         MVI   NIBLMODE(NIBPTR),C' '                               0514 00705000
         MVC   NIBLMODE+1(7,NIBPTR),NIBLMODE(NIBPTR)               0514 00706000
*               IF $DVLGMDE(I)='1'B THEN/* NIBLMODE SPECIFIED      0515 00707000
*                                                            @ZA20801*/ 00708000
         LR    @10,WAPTR                                           0515 00709000
         AL    @10,@TF00001                                        0515 00710000
         TM    $DVLGMDE-68(@10),B'00001000'                        0515 00711000
         BNO   @RF00515                                            0515 00712000
*                 NIBLMODE=$IFTOUT(I,1:8);/* YES GET IT      @ZA20801*/ 00713000
         LR    @10,WAPTR                                           0516 00714000
         AL    @10,@TF00001                                        0516 00715000
         MVC   NIBLMODE(8,NIBPTR),$IFTOUT-68(@10)                  0516 00716000
*               BINDLEN=LENGTH(ISTBIND);/* LENGTH OF BIND PARMS    0517 00717000
*                                                            @ZA20801*/ 00718000
@RF00515 LA    @10,36                                              0517 00719000
         ST    @10,BINDLEN                                         0517 00720000
*               R1=ADDR(BUFFRPL);   /* ADDR OF RECORD RPL    @ZA20801*/ 00721000
         LA    R1,12                                               0518 00722000
         AL    R1,$PTRAREA(,WAPTR)                                 0518 00723000
*               R1->RPLBUFL=BINDLEN;/* USE R1 TO PT TO RPL   @ZA20801*/ 00724000
         ST    @10,RPLBUFL(,R1)                                    0519 00725000
*               R5=NIBPTR;          /* GET ADDRESS OF NIB    @ZA20801*/ 00726000
         LR    R5,NIBPTR                                           0520 00727000
*               GEN;                                               0521 00728000
*                                                        /*@ZA20801*/   00729000
         INQUIRE RPL=(1),NIB=(R5),OPTCD=(SYN,SESSPARM),AREA=BINDBUFR    00730000
*               IF R15^=0 THEN      /* INQUIRE OK            @ZA20801*/ 00731000
         LTR   R15,R15                                             0522 00732000
         BNZ   @RT00522                                            0522 00733000
*                 GOTO M080197;     /* NO                    @ZA20801*/ 00734000
*               IF $DVSPRM(I)='1'B THEN/* SESSPARMS SPECIFIED?     0524 00735000
*                                                            @ZA20801*/ 00736000
         LH    @10,I                                               0524 00737000
         MH    @10,@CH01461                                        0524 00738000
         ST    @10,@TF00001                                        0524 00739000
         ALR   @10,WAPTR                                           0524 00740000
         TM    $DVSPRM-68(@10),B'00010000'                         0524 00741000
         BNO   @RF00524                                            0524 00742000
*                 BINDBUFR(2:7)=$DEVSESP(I,1:6);/* YES PICK UP     0525 00743000
*                                                            @ZA20801*/ 00744000
         LR    @10,WAPTR                                           0525 00745000
         AL    @10,@TF00001                                        0525 00746000
         MVC   BINDBUFR+1(6),$DEVSESP-68(@10)                      0525 00747000
*               $DVSPRM(I)='0'B;    /* SET SESSPARM FLAG OFF @ZA20801*/ 00748000
@RF00524 DS    0H                                                  0527 00749000
*               $DVLGMDE(I)='0'B;   /* SET LOGMODE FLAG OFF  @ZA20801*/ 00750000
         LH    @10,I                                               0527 00751000
         MH    @10,@CH01461                                        0527 00752000
         ST    @10,@TF00001                                        0527 00753000
         ALR   @10,WAPTR                                           0527 00754000
         NI    $DVSPRM-68(@10),B'11100111'                         0527 00755000
*               RFY                                                0528 00756000
*                 ISTBIND BASED(ADDR(BINDBUFR));/*           @ZA20801*/ 00757000
*               BINDPTR=$PTRAREA+LENGTH($TLTPRPL)+/* COMPUTE PTR   0529 00758000
*                                                            @ZA20801*/ 00759000
*                   LENGTH(ISTNIB)+LENGTH(WORKFLS);/*        @ZA20801*/ 00760000
         LA    @10,196                                             0529 00761000
         AL    @10,$PTRAREA(,WAPTR)                                0529 00762000
         ST    @10,BINDPTR                                         0529 00763000
*               BUFFBIND(1:BINDLEN)=BINDBUFR;/* MOVE DATA    @ZA20801*/ 00764000
         L     @09,BINDLEN                                         0530 00765000
         BCTR  @09,0                                               0530 00766000
         EX    @09,@SM03173                                        0530 00767000
*               $DEVSESP(I)=BINDBUFR(2:LENGTH($DEVSESP(I))+1);/*   0531 00768000
*                                                            @ZA20801*/ 00769000
         LR    @09,WAPTR                                           0531 00770000
         AL    @09,@TF00001                                        0531 00771000
         MVC   $DEVSESP-68(6,@09),BINDBUFR+1                       0531 00772000
*               NIBNDAR=BINDPTR;    /* PT TO BIND PARM       @ZA20801*/ 00773000
         ST    @10,NIBNDAR(,NIBPTR)                                0532 00774000
*             END;                  /*                       @ZA20801*/ 00775000
*                                                                  0533 00776000
*           /*********************************************************/ 00777000
*           /*                                                       */ 00778000
*           /* GET PTR TO RPL AND NIB                        @ZA20801*/ 00779000
*           /*                                                       */ 00780000
*           /*********************************************************/ 00781000
*                                                                  0534 00782000
*           DEFUSERF=ADDR(TOLTEPWA);/*                       @ZA20801*/ 00783000
@RF00511 ST    WAPTR,DEFUSERF(,NIBPTR)                             0534 00784000
*           R1=$PTRAREA+LENGTH(WORKFLS);/*                   @ZA20801*/ 00785000
         LA    R1,12                                               0535 00786000
         AL    R1,$PTRAREA(,WAPTR)                                 0535 00787000
*           R15=NIBPTR;             /*                       @ZA20801*/ 00788000
*                                                                  0536 00789000
         LR    R15,NIBPTR                                          0536 00790000
*           /*********************************************************/ 00791000
*           /*                                                       */ 00792000
*           /* ISSUE OPNDST                                  @ZA20801*/ 00793000
*           /*                                                       */ 00794000
*           /*********************************************************/ 00795000
*                                                                  0537 00796000
*           RFY                                                    0537 00797000
*             R8 RSTD;              /*                       @ZA20801*/ 00798000
*           R8=ADDR(M080330);       /*                       @ZA20801*/ 00799000
         L     R8,@CV02670                                         0538 00800000
*           GENERATE;                                              0539 00801000
*                                                          /*@ZA20801*/ 00802000
         OPNDST RPL=(R1),NIB=(R15),OPTCD=(ASY,ACCEPT),                 X00803000
               EXIT=(R8)                                                00804000
*           RFY                                                    0540 00805000
*             R8 UNRSTD;            /*                       @ZA20801*/ 00806000
*           IF R15=0                /* CHECK VTAM RETURN CODE      0541 00807000
*                                                            @ZA20801*/ 00808000
*             THEN                                                 0541 00809000
         LTR   R15,R15                                             0541 00810000
         BZ    @RT00541                                            0541 00811000
*             GOTO I00C003E;        /* GOOD OPEN             @ZA20801*/ 00812000
*           $OPNDCNT=$OPNDCNT+1;    /*                       @ZA20801*/ 00813000
         LA    @10,1                                               0543 00814000
         AH    @10,$OPNDCNT(,WAPTR)                                0543 00815000
         STH   @10,$OPNDCNT(,WAPTR)                                0543 00816000
*           RPLRTNCD=0;             /* MOVE RTNCD TO RPL     @ZA20801*/ 00817000
         MVI   RPLRTNCD(RPLPTR),X'00'                              0544 00818000
*           RPLFDB2=R15;            /* MOVE FDBK2 TO RPL     @ZA20801*/ 00819000
         STC   R15,RPLFDB2(,RPLPTR)                                0545 00820000
*M080197:                           /*                       @ZA20801*/ 00821000
*           $NOTDEV(I)='1'B;        /* OPEN FAILED           @ZA20801   00822000
*                                      SO MARK ENTRY         @ZA20801*/ 00823000
M080197  DS    0H                                                  0547 00824000
*           $ACQRED(I)='1'B;        /* AS NOT A DEV          @ZA20801*/ 00825000
         LH    @10,I                                               0547 00826000
         MH    @10,@CH01461                                        0547 00827000
         ALR   @10,WAPTR                                           0547 00828000
         OI    $NOTDEV-68(@10),B'11000000'                         0547 00829000
*M080198:                                                          0548 00830000
*           ;                       /*                       @ZA20801*/ 00831000
M080198  DS    0H                                                  0549 00832000
*           $FEEDBCK(I,1)=RPLRTNCD; /*                       @ZA20801*/ 00833000
         LH    @10,I                                               0549 00834000
         MH    @10,@CH01461                                        0549 00835000
         SLR   @09,@09                                             0549 00836000
         IC    @09,RPLRTNCD(,RPLPTR)                               0549 00837000
         STC   @09,$FEEDBCK-68(@10,WAPTR)                          0549 00838000
*           $FEEDBCK(I,2)=RPLFDB2;  /*                       @ZA20801*/ 00839000
         SLR   @09,@09                                             0550 00840000
         IC    @09,RPLFDB2(,RPLPTR)                                0550 00841000
         STC   @09,$FEEDBCK-67(@10,WAPTR)                          0550 00842000
*           GOTO I00C003E;          /* OPNDST FOR TEST TERMINAL DONE    00843000
*                                                            @ZA20801*/ 00844000
         B     I00C003E                                            0551 00845000
*         END;                      /*                       @ZA20801*/ 00846000
*       TIERETCD='04'X;             /* SET BAD RET CODE      @ZA20801*/ 00847000
@RF00500 MVI   TIERETCD(R5),X'04'                                  0553 00848000
*       IF $RFTTERM^=$SYSMN(1)      /* IS THIS NOT A         @D32JPFR*/ 00849000
*         THEN                      /* CT BUT A TEST TERM    @D32JPFR*/ 00850000
         CLC   $RFTTERM(8,R4),$SYSMN(WAPTR)                        0554 00851000
         BNE   @RT00554                                            0554 00852000
*         GOTO I00C0036;            /* IF YES IGNORE LOGON   @D32JPFR*/ 00853000
*       IF $UPDATE='1'B             /* IF UPDATE IN PROGRESS @D32JPFR*/ 00854000
*         THEN                      /* IGNORE                @D32JPFR*/ 00855000
         TM    $UPDATE(RCAPTR),B'10000000'                         0556 00856000
         BO    @RT00556                                            0556 00857000
*         GOTO I00C003D;            /* CI NOT ALLOWED        @D32JPFR*/ 00858000
*       $CIREQ='1'B;                /* SET C.I. SWITCH ON (R2 SET    */ 00859000
         OI    $CIREQ(WAPTR),B'00000001'                           0558 00860000
*       GOTO I00C003D;              /* BY SUBROUTINE $QUEHNDL        */ 00861000
         B     I00C003D                                            0559 00862000
*     END;                          /* AND EXIT                      */ 00863000
*   IF $UPDATE='1'B|                /* IF UPDATE IS IN USE OR        */ 00864000
*       $CUTESTB='1'B               /* CUTEST IS IN PROGRESS         */ 00865000
*     THEN                          /* THEN IGNORE RFT/LOGON         */ 00866000
@RF00495 TM    $UPDATE(RCAPTR),B'10010000'                         0561 00867000
         BNZ   @RT00561                                            0561 00868000
*     GOTO I00C0037;                                               0562 00869000
*   GO TO I00C0050;                 /* GO CALL ISTIC001      @D32JPFR*/ 00870000
         B     I00C0050                                            0563 00871000
*I00C0036:                                                         0564 00872000
*   ;                                                              0564 00873000
I00C0036 DS    0H                                                  0565 00874000
*   J=J+20;                                                        0565 00875000
         LA    @10,20                                              0565 00876000
         AL    @10,J                                               0565 00877000
         ST    @10,J                                               0565 00878000
*I00C0037:                                                         0566 00879000
*   ;                                                              0566 00880000
I00C0037 DS    0H                                                  0567 00881000
*   J=J+20;                                                        0567 00882000
         LA    @10,20                                              0567 00883000
         AL    @10,J                                               0567 00884000
         ST    @10,J                                               0567 00885000
*I00C0038:                                                         0568 00886000
*   ;                                                              0568 00887000
I00C0038 DS    0H                                                  0569 00888000
*   J=J+20;                                                        0569 00889000
         LA    @10,20                                              0569 00890000
         AL    @10,J                                               0569 00891000
         ST    @10,J                                               0569 00892000
*I00C0039:                                                         0570 00893000
*   ;                                                              0570 00894000
I00C0039 DS    0H                                                  0571 00895000
*   J=J+20;                                                        0571 00896000
         LA    @10,20                                              0571 00897000
         AL    @10,J                                               0571 00898000
         ST    @10,J                                               0571 00899000
*I00C003A:                                                         0572 00900000
*   ;                                                              0572 00901000
I00C003A DS    0H                                                  0573 00902000
*   J=J+20;                                                        0573 00903000
         LA    @10,20                                              0573 00904000
         AL    @10,J                                               0573 00905000
         ST    @10,J                                               0573 00906000
*I00C003B:                                                         0574 00907000
*   ;                                                              0574 00908000
I00C003B DS    0H                                                  0575 00909000
*   R5=J;                           /* PICK UP REASON CODE PTR       */ 00910000
         L     R5,J                                                0575 00911000
*   R1=ADDR(WTOPARM);               /* SET PTR FOR IWTO              */ 00912000
         LA    R1,WTOPARM                                          0576 00913000
*   WTOSIZE=63;                     /* SET SIZE + 4                  */ 00914000
         MVC   WTOSIZE(2),@CH03031                                 0577 00915000
*   M923FLL1=$RFTTERM;              /* PUT NAME INTO MESSAGE         */ 00916000
         MVC   M923FLL1(8),$RFTTERM(R4)                            0578 00917000
*   M923FLL2=REASON1;               /* PUT FAILURE REASON IN MSG     */ 00918000
         MVC   M923FLL2(20),REASON1(R5)                            0579 00919000
*   WTOTEXT=MSG923I;                /* MOVE MSG TO TEXT BUFFER     0580 00920000
*                                                            @ZA18922*/ 00921000
         MVI   WTOTEXT+59,C' '                                     0580 00922000
         MVC   WTOTEXT+60(72),WTOTEXT+59                           0580 00923000
         MVC   WTOTEXT(59),MSG923I                                 0580 00924000
*   WTOTEXT(60:63)=MCSCODE;         /* MOVE MCSCODES TO TEXT @ZA18922*/ 00925000
         MVC   WTOTEXT+59(4),MCSCODE                               0581 00926000
*/***** IWTO ****                                                    */ 00927000
*                                                                  0582 00928000
*   DO;                                                            0582 00929000
*     GEN;                                                         0583 00930000
         WTO   MF=(E,(1))                                               00931000
*   END;                            /* IWTO                          */ 00932000
*I00C003C:                                                         0585 00933000
*   ;                                                              0585 00934000
I00C003C DS    0H                                                  0586 00935000
*   R5=UECUSFLD;                    /* GET PTR TO TIE                */ 00936000
         L     @10,UECBPTR                                         0586 00937000
         L     R5,UECUSFLD(,@10)                                   0586 00938000
*   TIERETCD='04'X;                 /* SET BAD RTN CODE              */ 00939000
         MVI   TIERETCD(R5),X'04'                                  0587 00940000
*   IF UECREQNM=NETCALL             /* IS THIS FOR SYS CON           */ 00941000
*     THEN                                                         0588 00942000
         CLC   UECREQNM(8,@10),NETCALL                             0588 00943000
         BE    @RT00588                                            0588 00944000
*     GOTO I00C003D;                /* IF YES SKIP CLSDST            */ 00945000
*   ADDR(TLTNIB)->NIBSYM=UECREQNM;  /* CLSDST THE RIGHT TERMINAL   0590 00946000
*                                                            @ZA29486*/ 00947000
         LA    @09,TLTNIB                                          0590 00948000
         MVC   NIBSYM(8,@09),UECREQNM(@10)                         0590 00949000
*   GEN(CLSDST RPL=TLTPRPL,ACB=TLTACB,NIB=TLTNIB,OPTCD=(SYN,RELEASE));  00950000
         CLSDST RPL=TLTPRPL,ACB=TLTACB,NIB=TLTNIB,OPTCD=(SYN,RELEASE)   00951000
*I00C003D:                                                         0592 00952000
*   ;                                                              0592 00953000
I00C003D DS    0H                                                  0593 00954000
*   R5=UECUSFLD;                    /* PICK UP PTR TO TIE            */ 00955000
         L     @10,UECBPTR                                         0593 00956000
         L     R5,UECUSFLD(,@10)                                   0593 00957000
*   R1=ADDR(TIERPHA);               /* SET PTR TO ECB                */ 00958000
         LA    R1,TIERPHA(,R5)                                     0594 00959000
*   CALL I00C1001;                  /* POST                  @D32JPPW*/ 00960000
         BAL   @14,I00C1001                                        0595 00961000
*I00C003E:                                                         0596 00962000
*   ;                                                              0596 00963000
I00C003E DS    0H                                                  0597 00964000
*   DO;                             /* MODESET MODE(PROB)            */ 00965000
*     I10701='00000000'B;           /* OR MASK                       */ 00966000
         MVI   I10701,B'00000000'                                  0598 00967000
*     I10702='00000000'B;           /* AND MASK                      */ 00968000
         MVI   I10702,B'00000000'                                  0599 00969000
*     I10703='00000000'B;           /* RESERVED                      */ 00970000
         MVI   I10703,B'00000000'                                  0600 00971000
*     I10704='00000100'B;                                          0601 00972000
         MVI   I10704,B'00000100'                                  0601 00973000
*     RESPECIFY                                                    0602 00974000
*       GPR01F RESTRICTED;                                         0602 00975000
*     GPR01F=I107;                  /* MODESET PARMLIST              */ 00976000
         ICM   GPR01F,15,I107                                      0603 00977000
*     SVC(107);                     /* ISSUE MODESET SVC             */ 00978000
         SVC   107                                                 0604 00979000
*     RESPECIFY                                                    0605 00980000
*      (GPR01F) UNRESTRICTED;                                      0605 00981000
*   END;                            /* MODESET MODE(PROB)            */ 00982000
*   R14=RFTSV14;                    /* RESET R14                     */ 00983000
         L     R14,RFTSV14                                         0607 00984000
*   GEN(BR    R14);                 /* RETURN TO LOGON EXIT CODE     */ 00985000
         BR    R14                                                      00986000
*/********************************************************************/ 00987000
*                                                                  0609 00988000
*                                                                  0609 00989000
*/********************************************************************/ 00990000
*                                                                  0609 00991000
*I00C0050:                                                         0609 00992000
*   ;                                                              0609 00993000
I00C0050 DS    0H                                                  0610 00994000
*   IF $USECNT>0                    /* IS TOLTEP ACTIVE              */ 00995000
*     THEN                          /* IF USECNT NOT GTR THAN 0      */ 00996000
         SLR   @10,@10                                             0610 00997000
         CH    @10,$USECNT(,RCAPTR)                                0610 00998000
         BL    @RT00610                                            0610 00999000
*     GOTO I00C0051;                /* TOLTEP IS NOT ACTIVE          */ 01000000
*   $TOLTEP=ADDR(ISTIC000);         /* SET PTR IN RCA                */ 01001000
         L     @09,@CA00028                                        0612 01002000
         ST    @09,$TOLTEP(,RCAPTR)                                0612 01003000
*   $USECNT=0;                      /* SET ACTIVE USER COUNT TO 0    */ 01004000
         STH   @10,$USECNT(,RCAPTR)                                0613 01005000
*I00C0051:                                                         0614 01006000
*   ;                                                              0614 01007000
I00C0051 DS    0H                                                  0615 01008000
*   $USECNT=$USECNT+1;              /* ADD 1 TO NO. OF USERS         */ 01009000
         LA    @10,1                                               0615 01010000
         AH    @10,$USECNT(,RCAPTR)                                0615 01011000
         STH   @10,$USECNT(,RCAPTR)                                0615 01012000
*I00C0052:                                                         0616 01013000
*   ;                                                              0616 01014000
I00C0052 DS    0H                                                  0617 01015000
*   DO;                             /* MODESET MODE(SUP)             */ 01016000
*     I10701='00000000'B;           /* OR MASK                       */ 01017000
         MVI   I10701,B'00000000'                                  0618 01018000
*     I10702='00000000'B;           /* AND MASK                      */ 01019000
         MVI   I10702,B'00000000'                                  0619 01020000
*     I10703='00000000'B;           /* RESERVED                      */ 01021000
         MVI   I10703,B'00000000'                                  0620 01022000
*     I10704='00001100'B;                                          0621 01023000
         MVI   I10704,B'00001100'                                  0621 01024000
*     RESPECIFY                                                    0622 01025000
*       GPR01F RESTRICTED;                                         0622 01026000
*     GPR01F=I107;                  /* MODESET PARMLIST              */ 01027000
         ICM   GPR01F,15,I107                                      0623 01028000
*     SVC(107);                     /* ISSUE MODESET SVC             */ 01029000
         SVC   107                                                 0624 01030000
*     RESPECIFY                                                    0625 01031000
*      (GPR01F) UNRESTRICTED;                                      0625 01032000
*   END;                            /* MODESET MODE(SUP)             */ 01033000
*   R15=ADDR(ISTIC001);             /* SET PTR TO TEST INIT R3 & R4     01034000
*                                      ARE PASSED TO TEST INIT R3=PTR   01035000
*                                      TO R.C.A. R4=PTR TO SYM NAME  */ 01036000
         L     R15,@CV02667                                        0627 01037000
*   GEN(BALR  R14,R15);             /* GOTO TEST INIT CHK RTN CDE    */ 01038000
         BALR  R14,R15                                                  01039000
*   IF R15=0                        /* TEST FOR RET OF ZERO          */ 01040000
*     THEN                          /* IF YES RETURN TO CALLER       */ 01041000
         LTR   R15,R15                                             0629 01042000
         BZ    @RT00629                                            0629 01043000
*     GOTO I00C003D;                                               0630 01044000
*   $USECNT=$USECNT-1;              /* DECREMENT USE COUNT           */ 01045000
         LH    @10,$USECNT(,RCAPTR)                                0631 01046000
         BCTR  @10,0                                               0631 01047000
         STH   @10,$USECNT(,RCAPTR)                                0631 01048000
*   IF R15=4                        /* RTN CODE 4= NO STORAGE        */ 01049000
*     THEN                                                         0632 01050000
         C     R15,@CF00055                                        0632 01051000
         BE    @RT00632                                            0632 01052000
*     GOTO I00C003A;                                               0633 01053000
*   IF R15=8 THEN                   /* INQUIRE FAILURE       @D32JPFR*/ 01054000
         C     R15,@CF00061                                        0634 01055000
         BE    @RT00634                                            0634 01056000
*     GOTO I00C0038;                /* YES                   @D32JPFR*/ 01057000
*   IF R15=12 THEN                  /* VTAM FAILURE          @D32JPFR*/ 01058000
         C     R15,@CF00033                                        0636 01059000
         BE    @RT00636                                            0636 01060000
*     GOTO I00C003B;                /* YES                   @D32JPFR*/ 01061000
*   IF R15=16 THEN                  /* OPNDST FAILURE        @D32JPFR*/ 01062000
         C     R15,@CF00708                                        0638 01063000
         BE    @RT00638                                            0638 01064000
*     GOTO I00C0039;                /* YES                   @D32JPFR*/ 01065000
*/********************************************************************/ 01066000
*                                                                  0640 01067000
*   GEN(EJECT);                                                    0640 01068000
         EJECT                                                          01069000
*                                                                  0641 01070000
*/********************************************************************/ 01071000
*/*   ABEND EXIT                                                     */ 01072000
*/********************************************************************/ 01073000
*                                                                  0641 01074000
*I00C0060:                                                         0641 01075000
*   ;                                                              0641 01076000
I00C0060 DS    0H                                                  0642 01077000
*   GEN;                                                           0642 01078000
         USING *,R15                                                    01079000
         STM   R14,R12,L12(R13)                                         01080000
          LM    R11,R12,BASEREGS        /* SAVE REGS & PICK UP BASE  */ 01081000
          DROP  R15                                                     01082000
*   LOGSVE3(2)=R13;                                                0643 01083000
         ST    R13,LOGSVE3+4                                       0643 01084000
*   R13=ADDR(LOGSVE3);              /* SET NEW AREA                  */ 01085000
         LA    R13,LOGSVE3                                         0644 01086000
*   DO;                             /* MODESET EXTKEY(VTAM)          */ 01087000
*     SPKA(96);                     /* SET PSW KEY                   */ 01088000
         LA    @10,96                                              0646 01089000
         SPKA  0(@10)                                              0646 01090000
*   END;                            /* MODESET EXTKEY(VTAM)          */ 01091000
*   R3=ADDR(TLTACB);                /* SET PTR TO RCA                */ 01092000
         LA    R3,TLTACB                                           0648 01093000
*   R2=$CURRTWA;                    /* PICK UP PTR TO CURRENT USER   */ 01094000
         L     R2,$CURRTWA(,RCAPTR)                                0649 01095000
*   IF $ABEND=0                     /* HAS THE ABEND ADR BEEN SET    */ 01096000
*     THEN                          /* IF NOT TAKE IT ALL DOWN       */ 01097000
         SLR   @10,@10                                             0650 01098000
         C     @10,$ABEND(,RCAPTR)                                 0650 01099000
         BE    @RT00650                                            0650 01100000
*     GOTO I00C0064;                                               0651 01101000
*   IF $FSTAREA=0                   /* CHECK FOR ZERO                */ 01102000
*     THEN                          /* IF YES TAKE IT ALL DOWN       */ 01103000
         L     @09,$FSTAREA(,RCAPTR)                               0652 01104000
         CR    @09,@10                                             0652 01105000
         BE    @RT00652                                            0652 01106000
*     GOTO I00C0064;                                               0653 01107000
*   IF R2=0                         /* INSURE R2 HAS PTR TO TWA      */ 01108000
*     THEN                          /* USE $CURRTWA OR               */ 01109000
         CR    R2,@10                                              0654 01110000
         BNE   @RF00654                                            0654 01111000
*     R2=$FSTAREA;                  /* $FSTAREA                      */ 01112000
         LR    R2,@09                                              0655 01113000
*   $ABNDALL='1'B;                  /* SET ON ABEND ALL BIT          */ 01114000
@RF00654 OI    $ABNDALL(RCAPTR),B'00001000'                        0656 01115000
*I00C0062:                                                         0657 01116000
*   ;                                                              0657 01117000
I00C0062 DS    0H                                                  0658 01118000
*   IF $ABTERM='1'B                 /* HAS THIS TASK ABENDED         */ 01119000
*     THEN                          /* IF YES TAKE IT ALL DOWN       */ 01120000
         TM    $ABTERM(WAPTR),B'00000010'                          0658 01121000
         BO    @RT00658                                            0658 01122000
*     GOTO I00C0065;                                               0659 01123000
*   R5=R1;                          /* SAVE PTR TO INPUT REGS        */ 01124000
         LR    R5,R1                                               0660 01125000
*   R1=ADDR(ABNDSAVE);              /* SET R1 TO SAVE AREA           */ 01126000
         LA    R1,ABNDSAVE                                         0661 01127000
*   IF R0^=12                       /* WAS AN AREA PASSED            */ 01128000
*     THEN                                                         0662 01129000
         C     R0,@CF00033                                         0662 01130000
         BE    @RF00662                                            0662 01131000
*     DO;                           /* BR-NO                         */ 01132000
*       DMPPSW=VS1PSW;              /* SET UP DMP AREA               */ 01133000
         MVC   DMPPSW(8,R1),VS1PSW(R5)                             0664 01134000
*       DMPREGS=VS1REGS;            /* PSW & REGS                    */ 01135000
         MVC   DMPREGS(64,R1),VS1REGS(R5)                          0665 01136000
*     END;                                                         0666 01137000
*   R15=$ABEND;                     /* PICK UP ROUTINE ADDR          */ 01138000
@RF00662 L     R15,$ABEND(,RCAPTR)                                 0667 01139000
*   GEN(BALR  R14,R15);             /* GOTO ABEND CLEANUP            */ 01140000
         BALR  R14,R15                                                  01141000
*   GOTO I00C0068;                                                 0669 01142000
         B     I00C0068                                            0669 01143000
*I00C0063:                                                         0670 01144000
*   ;                                                              0670 01145000
I00C0063 DS    0H                                                  0671 01146000
*   K=K+12;                         /* BUMP PTR TO REASONS           */ 01147000
         LA    @10,12                                              0671 01148000
         AL    @10,K                                               0671 01149000
         ST    @10,K                                               0671 01150000
*I00C0064:                                                         0672 01151000
*   ;                                                              0672 01152000
I00C0064 DS    0H                                                  0673 01153000
*   K=K+12;                                                        0673 01154000
         LA    @10,12                                              0673 01155000
         AL    @10,K                                               0673 01156000
         ST    @10,K                                               0673 01157000
*I00C0065:                                                         0674 01158000
*   ;                                                              0674 01159000
I00C0065 DS    0H                                                  0675 01160000
*   R5=K;                           /* PICK UP REASON PTR            */ 01161000
         L     R5,K                                                0675 01162000
*   R1=ADDR(WTOPARM);               /* SET PTR TO IWTO               */ 01163000
         LA    R1,WTOPARM                                          0676 01164000
*   WTOSIZE=46;                     /* SET SIZE & 4                  */ 01165000
         MVC   WTOSIZE(2),@CH03053                                 0677 01166000
*   M921FILL=REASON2;               /* SET REASON INTO MESSAGE       */ 01167000
         MVC   M921FILL(10),REASON2(R5)                            0678 01168000
*   WTOTEXT=MSG921I;                /* MOVE MSG TO TEXT BUFFER     0679 01169000
*                                                            @ZA18922*/ 01170000
         MVI   WTOTEXT+42,C' '                                     0679 01171000
         MVC   WTOTEXT+43(89),WTOTEXT+42                           0679 01172000
         MVC   WTOTEXT(42),MSG921I                                 0679 01173000
*   WTOTEXT(43:46)=MCSCODE;         /* MOVE MCSCODES TO TEXT @ZA18922*/ 01174000
         MVC   WTOTEXT+42(4),MCSCODE                               0680 01175000
*/***** IWTO ****                                                    */ 01176000
*                                                                  0681 01177000
*   DO;                                                            0681 01178000
*     GEN;                                                         0682 01179000
         WTO   MF=(E,(1))                                               01180000
*   END;                            /* IWTO                          */ 01181000
*I00C0068:                                                         0684 01182000
*   ;                                                              0684 01183000
I00C0068 DS    0H                                                  0685 01184000
*   R4=$CVTSAVE;                    /* SET PTR TO CVT                */ 01185000
         L     R4,$CVTSAVE(,RCAPTR)                                0685 01186000
*   IF R4^=0                        /* IS VTAM ACTIVE                */ 01187000
*     THEN                          /* IF YES                        */ 01188000
         SLR   @10,@10                                             0686 01189000
         CR    R4,@10                                              0686 01190000
         BE    @RF00686                                            0686 01191000
*     ATCTODVT=0;                   /* SET DVT TO PTR TO ZERO        */ 01192000
         ST    @10,ATCTODVT(,R4)                                   0687 01193000
*   GEN(CLOSE TLTACB);                                             0688 01194000
@RF00686 DS    0H                                                  0688 01195000
         CLOSE TLTACB                                                   01196000
*   RETURN CODE(0);                                                0689 01197000
*                                                                  0689 01198000
         SLR   @15,@15                                             0689 01199000
@EL00001 L     @13,4(,@13)                                         0689 01200000
@EF00001 DS    0H                                                  0689 01201000
@ER00001 L     @14,12(,@13)                                        0689 01202000
         LM    @00,@12,20(@13)                                     0689 01203000
         BR    @14                                                 0689 01204000
*/********************************************************************/ 01205000
*                                                                  0690 01206000
*   GEN(EJECT);                                                    0690 01207000
         EJECT                                                          01208000
*                                                                  0691 01209000
*/********************************************************************/ 01210000
*/*     FAKE A LOGON FOR SYSTEM CONSOLE INITIATION                   */ 01211000
*/********************************************************************/ 01212000
*                                                                  0691 01213000
*I00C0070:                                                         0691 01214000
*   ;                                                              0691 01215000
I00C0070 DS    0H                                                  0692 01216000
*   GEN;                                                           0692 01217000
         USING *,R15                                                    01218000
         STM R14,R12,L12(R13)                                           01219000
         LM    R11,R12,BASEREGS                                         01220000
         DROP  R15                                                      01221000
*   LOGSVE2(2)=R13;                                                0693 01222000
         ST    R13,LOGSVE2+4                                       0693 01223000
*   R13=ADDR(LOGSVE2);                                             0694 01224000
         LA    R13,LOGSVE2                                         0694 01225000
*   $CONSOLE='1'B;                  /* SET INDICATOR ON              */ 01226000
         OI    $CONSOLE(RCAPTR),B'00100000'                        0695 01227000
*   R4=$CVTSAVE;                    /* SET PTR TO CVT                */ 01228000
         L     R4,$CVTSAVE(,RCAPTR)                                0696 01229000
*   ATCMTST='0'B;                   /* SET OFF MOD NET BIT           */ 01230000
         NI    ATCMTST(R4),B'11011111'                             0697 01231000
*   R5=ADDR(MODINTEL);              /* SET PTR TO TIE                */ 01232000
         LA    @10,MODINTEL                                        0698 01233000
         LR    R5,@10                                              0698 01234000
*   TIETYPE=TITYPE;                                                0699 01235000
         MVI   TIETYPE(R5),X'18'                                   0699 01236000
*   TIELNGTH=LENGTH(ISTTIE);                                       0700 01237000
         MVI   TIELNGTH(R5),X'10'                                  0700 01238000
*   TIERPHA=0;                      /* SET ECB TO ZERO               */ 01239000
         SLR   @09,@09                                             0701 01240000
         ST    @09,TIERPHA(,R5)                                    0701 01241000
*   TIESNA=ADDR(SYSCON);            /* SET PTR TO SYM NAME           */ 01242000
         LA    @09,SYSCON                                          0702 01243000
         ST    @09,TIESNA(,R5)                                     0702 01244000
*   R0=ADDR(MODINTEL);              /* POINT TO TIE          @D32JPPW*/ 01245000
         LR    R0,@10                                              0703 01246000
*   R1=ADDR(DYPPAB);                /* POINT TO PAB          @D32JPPW*/ 01247000
         LA    R1,DYPPAB+592(,R4)                                  0704 01248000
*   CALL I00C1000;                  /* TPQUE                 @D32JPPW*/ 01249000
         BAL   @14,I00C1000                                        0705 01250000
*   R1=ADDR(TIERPHA);               /* SET PTR TO ECB                */ 01251000
         LA    R1,TIERPHA(,R5)                                     0706 01252000
*   CALL I00C1002;                  /* WAIT                  @D32JPPW*/ 01253000
         BAL   @14,I00C1002                                        0707 01254000
*   IF TIERETCD='00'X               /* WAS OPEN SUCCESSFUL           */ 01255000
*     THEN                                                         0708 01256000
         CLI   TIERETCD(R5),X'00'                                  0708 01257000
         BNE   @RF00708                                            0708 01258000
*     R15=0;                        /* YES                           */ 01259000
         SLR   R15,R15                                             0709 01260000
*   ELSE                                                           0710 01261000
*     R15=4;                        /* NO                            */ 01262000
         B     @RC00708                                            0710 01263000
@RF00708 LA    R15,4                                               0710 01264000
*   R13=LOGSVE2(2);                 /* PTR TO CALLERS SAVE           */ 01265000
@RC00708 L     R13,LOGSVE2+4                                       0711 01266000
*   GEN(L     R14,L12(R13));        /* GET RETURN POINT              */ 01267000
         L     R14,L12(R13)                                             01268000
*   GEN(LM    R0,R12,L20(R13));     /* RESET REGS                    */ 01269000
         LM    R0,R12,L20(R13)                                          01270000
*   GEN(BR    R14);                                                0714 01271000
*                                                                  0714 01272000
         BR    R14                                                      01273000
*/********************************************************************/ 01274000
*                                                                  0715 01275000
*   GEN(EJECT);                                                    0715 01276000
         EJECT                                                          01277000
*                                                                  0716 01278000
*/****************************************************************** */ 01279000
*/*    LOST TERMINAL EXIT                                            */ 01280000
*/****************************************************************** */ 01281000
*                                                                  0716 01282000
*I00C0080:                                                         0716 01283000
*   ;                                                              0716 01284000
I00C0080 DS    0H                                                  0717 01285000
*   GEN;                                                           0717 01286000
         USING *,R15                                                    01287000
         LM    R11,R12,BASEREGS    /* RESET BASE REG */                 01288000
         DROP  R15                                                      01289000
*   R13=ADDR(LOGSVE1);              /* SET PTR TO A SAVE REG         */ 01290000
         LA    R13,LOGSVE1                                         0718 01291000
*   GEN(STM   R14,R12,L12(R13));    /* SAVE REGS                     */ 01292000
         STM   R14,R12,L12(R13)                                         01293000
*   CALL I00C0090;                  /* SET UP SAVE AREA              */ 01294000
         BAL   @14,I00C0090                                        0720 01295000
*   R4=ADDR(EXITCID);               /* SET R4 TO PT TO CID           */ 01296000
         LA    R4,EXITCID(,R1)                                     0721 01297000
*   R2=EXITUSR;                     /* GET WORKAREA ADDR     @D32JPPW*/ 01298000
         L     R2,EXITUSR(,R1)                                     0722 01299000
*   R5=$FSTAREA;                    /* GET FIRST WORKAREA PTR      0723 01300000
*                                                            @ZA18482*/ 01301000
         L     R5,$FSTAREA(,RCAPTR)                                0723 01302000
*   DO WHILE R5^=0;                 /* CHECK FOR ANY WORKAREA      0724 01303000
*                                                            @ZA18482*/ 01304000
         B     @DE00724                                            0724 01305000
@DL00724 DS    0H                                                  0725 01306000
*     IF R5=R2 THEN                 /* PARM WORKAREA IS VALID      0725 01307000
*                                                            @ZA18482*/ 01308000
         CR    R5,R2                                               0725 01309000
         BNE   @RF00725                                            0725 01310000
*       DO I=1 TO 18;               /* LOOP THRU DEVICE TABLE      0726 01311000
*                                                            @ZD10883*/ 01312000
         LA    @10,1                                               0726 01313000
         STH   @10,I                                               0726 01314000
@DL00726 DS    0H                                                  0727 01315000
*         IF $CID(I)=LSTCID THEN    /* FIND MATCH IN TABLE   @ZD10883*/ 01316000
         LR    @09,@10                                             0727 01317000
         MH    @09,@CH01461                                        0727 01318000
         ALR   @09,WAPTR                                           0727 01319000
         CLC   $CID-68(4,@09),LSTCID(R4)                           0727 01320000
         BE    @RT00727                                            0727 01321000
*           GOTO I00C0082;                                         0728 01322000
*       END;                                                       0729 01323000
         AL    @10,@CF00063                                        0729 01324000
         STH   @10,I                                               0729 01325000
         C     @10,@CF01177                                        0729 01326000
         BNH   @DL00726                                            0729 01327000
*     R5=R5->$TFWDPTR;              /* POINT TO NEXT WORKAREA      0730 01328000
*                                                            @ZA18482*/ 01329000
@RF00725 L     R5,$TFWDPTR(,R5)                                    0730 01330000
*   END;                            /* END DO WHILE          @ZA18482*/ 01331000
@DE00724 LTR   R5,R5                                               0731 01332000
         BNZ   @DL00724                                            0731 01333000
*   GOTO I00C0081;                  /* NO MATCH FOUND        @ZD10883*/ 01334000
         B     I00C0081                                            0732 01335000
*I00C0082:                          /* MATCH FOUND CONTINUE        0733 01336000
*                                      PROCESSING            @ZD10883*/ 01337000
*   IF I=1                          /* WAS CT LOST                   */ 01338000
*     THEN                          /* YES SET CIREQ NEXT            */ 01339000
I00C0082 CLC   I(2),@CH00063                                       0733 01340000
         BNE   @RF00733                                            0733 01341000
*     DO;                           /* CT IS LOST                    */ 01342000
*       $CANCEL='1'B;               /* CANCEL THIS USER              */ 01343000
         OI    $CANCEL(WAPTR),B'00000010'                          0735 01344000
*       $CTERROR='1'B;              /* CT ERROR OCCURED              */ 01345000
         OI    $CTERROR(WAPTR),B'01000000'                         0736 01346000
*       $POSTFLG='0'B;              /* STOP WAITING FOR INPUT        */ 01347000
         NI    $POSTFLG(WAPTR),B'10111111'                         0737 01348000
*       $CIREQ='1'B;                /* I/O RTN WILL PIN POINT WHICH  */ 01349000
         OI    $CIREQ(WAPTR),B'00000001'                           0738 01350000
*     END;                          /* END OF CT IS LOST             */ 01351000
*   IF I>2 THEN                     /* IF TEST DEV END TEST  @ZD10883*/ 01352000
@RF00733 LH    @10,I                                               0740 01353000
         C     @10,@CF00075                                        0740 01354000
         BNH   @RF00740                                            0740 01355000
*     $ENDTEST='0'B;                                               0741 01356000
         NI    $ENDTEST(WAPTR),B'11110111'                         0741 01357000
*   IF I=2                          /* WAS THE ALTERNATE PRINTER LOST*/ 01358000
*     THEN                          /* IF YES TURN OFF INDICATION    */ 01359000
@RF00740 CLC   I(2),@CH00075                                       0742 01360000
         BNE   @RF00742                                            0742 01361000
*     $ALTPRTR='0'B;                /* CLOSE OUT AP &                */ 01362000
         NI    $ALTPRTR(WAPTR),B'11111101'                         0743 01363000
*   $NOTDEV(I)='1'B;                /* SET BITS TO                   */ 01364000
@RF00742 DS    0H                                                  0745 01365000
*   $ACQRED(I)='0'B;                /* INDICATE STATUS               */ 01366000
         LH    @10,I                                               0745 01367000
         MH    @10,@CH01461                                        0745 01368000
         ST    @10,@TF00001                                        0745 01369000
         ALR   @10,WAPTR                                           0745 01370000
         OI    $NOTDEV-68(@10),B'10000000'                         0745 01371000
         NI    $ACQRED-68(@10),B'10111111'                         0745 01372000
*   R4=ADDR($SYSMN(I));                                            0746 01373000
         L     R4,@TF00001                                         0746 01374000
         LA    R4,$SYSMN-68(R4,WAPTR)                              0746 01375000
*   GEN(MVC TLTNIB+L12(L8),L0(R4));                                0747 01376000
         MVC TLTNIB+L12(L8),L0(R4)                                      01377000
*   GEN(CLSDST RPL=TLTPRPL,ACB=TLTACB,NIB=TLTNIB,OPTCD=(SYN,RELEASE));  01378000
         CLSDST RPL=TLTPRPL,ACB=TLTACB,NIB=TLTNIB,OPTCD=(SYN,RELEASE)   01379000
*I00C0081:                                                         0749 01380000
*   ;                                                              0749 01381000
I00C0081 DS    0H                                                  0750 01382000
*   R13=LOGSAVE(2);                 /* RESET SAVE PTR                */ 01383000
         L     R13,LOGSAVE+4                                       0750 01384000
*   GEN(LM    R14,R12,L12(R13));                                   0751 01385000
         LM    R14,R12,L12(R13)                                         01386000
*   GEN(BR    R14);                                                0752 01387000
*                                                                  0752 01388000
         BR    R14                                                      01389000
*/********************************************************************/ 01390000
*                                                                  0753 01391000
*   GEN(EJECT);                                                    0753 01392000
         EJECT                                                          01393000
*                                                                  0754 01394000
*/********************************************************************/ 01395000
*/*      COMMON ROUTINE TO ESTABLISH SAVE AREA POINTERS              */ 01396000
*/********************************************************************/ 01397000
*                                                                  0754 01398000
*I00C0090:                                                         0754 01399000
*   ;                                                              0754 01400000
I00C0090 DS    0H                                                  0755 01401000
*   LOGSAVE(2)=R13;                 /* SAVE CALLERS R13              */ 01402000
         ST    R13,LOGSAVE+4                                       0755 01403000
*   R13=ADDR(LOGSAVE);              /* SET TO MY SAVE AREA           */ 01404000
         LA    R13,LOGSAVE                                         0756 01405000
*   R3=ADDR(TLTACB);                /* SET POINTER TO RCA            */ 01406000
         LA    R3,TLTACB                                           0757 01407000
*   GEN(BR    R14);                                                0758 01408000
         BR    R14                                                      01409000
*   GEN(EJECT);                                                    0759 01410000
         EJECT                                                          01411000
*                                                                  0760 01412000
*/********************************************************************/ 01413000
*/*  VTAM ENDING                                                     */ 01414000
*/********************************************************************/ 01415000
*                                                                  0760 01416000
*I00C0100:                                                         0760 01417000
*   ;                                                              0760 01418000
I00C0100 DS    0H                                                  0761 01419000
*   GEN;                                                           0761 01420000
         USING *,R15                                                    01421000
         LM    R11,R12,BASEREGS       /* SET BASE REG */                01422000
         DROP  R15                                                      01423000
*   R13=ADDR(LOGSVE1);              /* PICK UP A SAVE AREA           */ 01424000
         LA    R13,LOGSVE1                                         0762 01425000
*   GEN(STM   R14,R12,L12(R13));    /* SAVE REGS                     */ 01426000
         STM   R14,R12,L12(R13)                                         01427000
*   CALL I00C0090;                                                 0764 01428000
         BAL   @14,I00C0090                                        0764 01429000
*   R2=$FSTAREA;                    /* PICK UP PTR TO 1ST USER AREA  */ 01430000
         L     R2,$FSTAREA(,RCAPTR)                                0765 01431000
*   IF $ABNDALL='1'B                /* IF ABEND IN PROG THEN         */ 01432000
*     THEN                          /* FORGET IT                     */ 01433000
         TM    $ABNDALL(RCAPTR),B'00001000'                        0766 01434000
         BO    @RT00766                                            0766 01435000
*     GOTO I00C0101;                /* TOLTEP BEING CANCELED         */ 01436000
*   $VTAMEND='1'B;                  /* SET VTAM ENDING INDICATOR     */ 01437000
         OI    $VTAMEND(RCAPTR),B'00000001'                        0768 01438000
*   IF R2=0                         /* IS THER A 1ST USER            */ 01439000
*     THEN                                                         0769 01440000
         LTR   R2,R2                                               0769 01441000
         BZ    @RT00769                                            0769 01442000
*     GOTO I00C0101;                /* NO-BR                         */ 01443000
*   DO I=1 TO $USECNT BY 1;                                        0771 01444000
         LA    @10,1                                               0771 01445000
         STH   @10,I                                               0771 01446000
         B     @DE00771                                            0771 01447000
@DL00771 DS    0H                                                  0772 01448000
*     $TEP1ST='0'B;                 /* SET SWITCHES TO FORCE A CANCEL*/ 01449000
*     $TEP2ND='0'B;                 /* AND GOTO EACH FOR CLEANUP     */ 01450000
*     $OLTMACC='0'B;                                               0774 01451000
         NI    $TEP1ST(WAPTR),B'11011100'                          0774 01452000
*     $ENDTEST='0'B;                                               0775 01453000
*     $POSTFLG='0'B;                                               0776 01454000
         NI    $ENDTEST(WAPTR),B'10110111'                         0776 01455000
*     $REQSTOR='0'B;                                               0777 01456000
         NI    $REQSTOR(WAPTR),B'11101111'                         0777 01457000
*     $ACTOPND='0'B;                                               0778 01458000
*     $CLSSACT='0'B;                                               0779 01459000
         NI    $ACTOPND(WAPTR),B'11111010'                         0779 01460000
*     $WAITFLG='0'B;                                               0780 01461000
         NI    $WAITFLG(WAPTR),B'10111111'                         0780 01462000
*     $CIREQ='0'B;                                                 0781 01463000
         NI    $CIREQ(WAPTR),B'11111110'                           0781 01464000
*     $TEP3RD='0'B;                                                0782 01465000
         NI    $TEP3RD(WAPTR),B'01111111'                          0782 01466000
*     $MSG922='1'B;                 /* SET HOLD BIT TO STOP        0783 01467000
*                                      PROCESSING                    */ 01468000
*     $EOJ='1'B;                                                   0784 01469000
         OI    $MSG922(WAPTR),B'00010010'                          0784 01470000
*     $CIREQ='0'B;                                                 0785 01471000
         NI    $CIREQ(WAPTR),B'11111110'                           0785 01472000
*     R2=$TFWDPTR;                  /* PICK UP PTR TO NEXT AREA      */ 01473000
         L     R2,$TFWDPTR(,WAPTR)                                 0786 01474000
*   END;                                                           0787 01475000
         AL    @10,@CF00063                                        0787 01476000
         STH   @10,I                                               0787 01477000
@DE00771 CH    @10,$USECNT(,RCAPTR)                                0787 01478000
         BNH   @DL00771                                            0787 01479000
*   R2=$FSTAREA;                    /* PICK UP PTR                   */ 01480000
         L     R2,$FSTAREA(,RCAPTR)                                0788 01481000
*   R1=ADDR($TLTECB2);              /* PICK UP PTR TO ECB            */ 01482000
         LA    R1,$TLTECB2(,RCAPTR)                                0789 01483000
*   CALL I00C1001;                  /* POST                  @D32JPPW*/ 01484000
         BAL   @14,I00C1001                                        0790 01485000
*I00C0101:                                                         0791 01486000
*   ;                                                              0791 01487000
I00C0101 DS    0H                                                  0792 01488000
*   R4=$CVTSAVE;                    /* SET PTR TO CVT                */ 01489000
         L     R4,$CVTSAVE(,RCAPTR)                                0792 01490000
*   IF R4=0                         /* HAS IT BEEN INITIALIZED       */ 01491000
*     THEN                                                         0793 01492000
         LTR   R4,R4                                               0793 01493000
         BZ    @RT00793                                            0793 01494000
*     GOTO I00C0081;                /* NO SKIP POST                  */ 01495000
*   R1=ADDR(ATCECTLP);              /* SET ADDR OF ECB IN CVT        */ 01496000
         LA    R1,ATCECTLP(,R4)                                    0795 01497000
*   CALL I00C1001;                  /* POST                  @D32JPPW*/ 01498000
         BAL   @14,I00C1001                                        0796 01499000
*   GOTO I00C0081;                  /* RETURN TO VTAM                */ 01500000
         B     I00C0081                                            0797 01501000
*   GEN(EJECT);                                                    0798 01502000
         EJECT                                                          01503000
*                                                                  0799 01504000
*   /*****************************************************************/ 01505000
*   /*                                                               */ 01506000
*   /* TPQUE FUNCTION, R0=PTR TO ELEMENT, R1=DYNAMIC PAB POINTER     */ 01507000
*   /*                                                               */ 01508000
*   /*****************************************************************/ 01509000
*                                                                  0799 01510000
*   DCL                                                            0799 01511000
*     TPQEL CHAR(*) BASED(R8);      /* A MAP OF THE ELEMENT TO QUE 0799 01512000
*                                                            @D32JPPW*/ 01513000
*I00C1000:                                                         0800 01514000
*   ;                                                              0800 01515000
I00C1000 DS    0H                                                  0801 01516000
*   GEN;                                                           0801 01517000
         BALR  R15,0                                                    01518000
         USING *,R15                                           @D32JPPW 01519000
         STM   R14,R12,L12(R13)          SAVE CALLERS REGS     @D32JPPW 01520000
         LM    R11,R12,BASEREGS        GET THE BASE REGS       @D32JPPW 01521000
         DROP  R15                RELEASE BASE                 @D32JPPW 01522000
*   R7=R0;                          /* POINT TO THE ELEMENT TO QUE 0802 01523000
*                                                            @D32JPPW*/ 01524000
         LR    R7,R0                                               0802 01525000
*   R8=R1;                          /* POINT TO THE PAB TO QUEUE TO     01526000
*                                                            @D32JPPW*/ 01527000
         LR    R8,R1                                               0803 01528000
*   GEN(MODESET MODE=SUP);                                         0804 01529000
*                                                                  0804 01530000
         MODESET MODE=SUP                                               01531000
*/*  TPQUE (R7,TPQEL) NSTR NORM ENA LAST                             */ 01532000
*/*                          CMZVER = OS/VS2                         */ 01533000
*                                                                  0805 01534000
*   DO;                                                            0805 01535000
*     RFY                                                          0806 01536000
*      (GPR00P,                                                    0806 01537000
*       GPR01P,                                                    0806 01538000
*       GPR04P,                                                    0806 01539000
*       GPR05P,                                                    0806 01540000
*       GPR15P) RSTD;                                              0806 01541000
*     GPR00P=0;                                                    0807 01542000
         SLR   GPR00P,GPR00P                                       0807 01543000
*     GPR15P=ADDR(TPQEL);           /* HOLD PAB PTR                  */ 01544000
         LR    GPR15P,R8                                           0808 01545000
*     GPR04P=R7;                    /* WORK ELE PTR                  */ 01546000
         LR    GPR04P,R7                                           0809 01547000
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */ 01548000
         LR    GPR05P,GPR15P                                       0810 01549000
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            0811 01550000
         L     @10,ATCLCPTR                                        0811 01551000
         L     @15,ATCAP37(,@10)                                   0811 01552000
         BALR  @14,@15                                             0811 01553000
*     GEN(NOPR  8)                                                 0812 01554000
*     NOSETS NOREFS;                                               0812 01555000
         NOPR  8                                                        01556000
*     RFY                                                          0813 01557000
*      (GPR00P,                                                    0813 01558000
*       GPR01P,                                                    0813 01559000
*       GPR04P,                                                    0813 01560000
*       GPR05P,                                                    0813 01561000
*       GPR15P) UNRSTD;                                            0813 01562000
*   END;                            /* *** END OF TPQUE GENERATION   */ 01563000
*   GEN( LM R14,R12,L12(R13));      /* RESTORE REGISTERS     @D32JPPW*/ 01564000
          LM R14,R12,L12(R13)                                           01565000
*   GEN(BR R14);                    /* RETURN TO CALLER      @D32JPPW*/ 01566000
         BR R14                                                         01567000
*                                                                  0817 01568000
*   /*****************************************************************/ 01569000
*   /*                                                               */ 01570000
*   /* EXTERNAL ROUTINE TO POST,R1=PTR TO ECB                @D32JPPW*/ 01571000
*   /*                                                               */ 01572000
*   /*****************************************************************/ 01573000
*                                                                  0817 01574000
*I00C1001:                                                         0817 01575000
*   GEN;                                                           0817 01576000
I00C1001 DS    0H                                                  0817 01577000
*                 /* INITIAL LINKAGE    @D32JPPW*/                      01578000
         BALR  R15,0                                                    01579000
         USING *,R15                                                    01580000
*   GEN( POST (1) );                /* POST THE EVENT COMPLETE     0818 01581000
*                                                            @D32JPPW*/ 01582000
          POST (1)                                                      01583000
*   GEN(DROP R15);                  /* RELEASE BASE          @D32JPPW*/ 01584000
         DROP R15                                                       01585000
*   GEN(BR R14);                    /* RETURN TO THE CALLER  @D32JPPW*/ 01586000
         BR R14                                                         01587000
*                                                                  0821 01588000
*   /*****************************************************************/ 01589000
*   /*                                                               */ 01590000
*   /* EXTERNAL ROUTINE TO WAIT,R1=ECB ADDRESS               @D32JPPW*/ 01591000
*   /*                                                               */ 01592000
*   /*****************************************************************/ 01593000
*                                                                  0821 01594000
*I00C1002:                                                         0821 01595000
*   GEN;                                                           0821 01596000
*                                                                  0821 01597000
I00C1002 DS    0H                                                  0821 01598000
*                /* INITIAL LINKAGE     @D32JPPW*/                      01599000
         BALR  R15,0               SETUP ADDRESSABILITY        @D32JPPW 01600000
         USING *,R15                                           @D32JPPW 01601000
*/*VWAIT  ECB((1))TASK(APPL)                                         */ 01602000
*                                                                  0822 01603000
*   DO;                             /* DECLARE AND RESTRICT REG 1    */ 01604000
*     RESPECIFY                                                    0823 01605000
*       GPR01F RSTD;                /* INVOKE XREGSET MACRO TO TEST     01606000
*                                      ECB PARM VALIDITY             */ 01607000
*/*XREGSET  PPARM((1))RREG(1,GPR01F)PID('ECB')                       */ 01608000
*                                                                  0824 01609000
*     DO;                                                          0824 01610000
*                                                                  0824 01611000
*/*PARM ALREADY IN PROPER REGISTER                                   */ 01612000
*                                                                  0825 01613000
*     END;                          /* XREGSET                       */ 01614000
*     GEN;                                                         0826 01615000
         WAIT 1,ECB=(1)                                                 01616000
*     RESPECIFY                                                    0827 01617000
*       GPR01F UNRSTD;              /* UNRESTRICT REG 1              */ 01618000
*   END;                            /* VWAIT                         */ 01619000
*   GEN(XC 0(4,R1),0(R1));          /* ZERO THE ECB AFTER WAITING  0829 01620000
*                                                            @D32JPPW*/ 01621000
         XC 0(4,R1),0(R1)                                               01622000
*   GEN(DROP R15);                  /* RELEASE THE BASE      @D32JPPW*/ 01623000
         DROP R15                                                       01624000
*   GEN(BR R14);                    /* RETURN TO THE CALLER  @D32JPPW*/ 01625000
         BR R14                                                         01626000
*                                                                  0832 01627000
*/********************************************************************/ 01628000
*/*    DEVICE  SEARCH  ROUTINE                                       */ 01629000
*/********************************************************************/ 01630000
*                                                                  0832 01631000
*I00C0200:                                                         0832 01632000
*   ;                                                              0832 01633000
I00C0200 DS    0H                                                  0833 01634000
*   GEN;                                                           0833 01635000
         USING *,R15                                                    01636000
         STM R14,R12,L12(R13)                                           01637000
         LM    R11,R12,BASEREGS                                         01638000
         DROP R15                                                       01639000
*   LOGSVE4(2)=R13;                 /* SET PTR TO SAVE AREA          */ 01640000
         ST    R13,LOGSVE4+4                                       0834 01641000
*   R13=ADDR(LOGSVE4);              /* AND CHAIN BACK WARDS          */ 01642000
         LA    R13,LOGSVE4                                         0835 01643000
*   DEVPTR=R1;                      /* SET PTR TO DEVTCODE           */ 01644000
         LR    DEVPTR,R1                                           0836 01645000
*   Q=ADDR(CKDEV(55));              /* GET LAST ELEMENT PTR          */ 01646000
         LA    @10,CKDEV+108                                       0837 01647000
         ST    @10,Q                                               0837 01648000
*   DO P=ADDR(CKDEV) TO Q BY 2;     /* SEARCH TABLE                  */ 01649000
         LA    P,CKDEV                                             0838 01650000
         B     @DE00838                                            0838 01651000
@DL00838 DS    0H                                                  0839 01652000
*     IF CODEV=ELEM THEN                                           0839 01653000
         CLC   CODEV(1,DEVPTR),ELEM(P)                             0839 01654000
         BNE   @RF00839                                            0839 01655000
*       DO;                                                        0840 01656000
*         P=P+1;                    /* P PTS TO RC                   */ 01657000
         AL    P,@CF00063                                          0841 01658000
*         R15=ELEM;                 /* SET R15                       */ 01659000
         SLR   R15,R15                                             0842 01660000
         IC    R15,ELEM(,P)                                        0842 01661000
*         GOTO I00C0201;                                           0843 01662000
         B     I00C0201                                            0843 01663000
*       END;                                                       0844 01664000
*   END;                                                           0845 01665000
*                                                                  0845 01666000
@RF00839 AL    P,@CF00075                                          0845 01667000
@DE00838 C     P,Q                                                 0845 01668000
         BNH   @DL00838                                            0845 01669000
*/* IF THE DEVICE IS NOT KNOWN TO VTAM THEN A RETURN CODE 12 IS MADE */ 01670000
*                                                                  0846 01671000
*   R15=12;                                                        0846 01672000
         LA    R15,12                                              0846 01673000
*I00C0201:                                                         0847 01674000
*   ;                                                              0847 01675000
I00C0201 DS    0H                                                  0848 01676000
*   IF R15=0&                       /* MAKE SURE A MODUL OF THE      */ 01677000
*       DEVINPUT^='1'B&             /* CT DOES NOT CHANGE ABILITY    */ 01678000
*       DEVOTPUT^='1'B              /* TO BE A CT BOTH BITS          */ 01679000
*     THEN                          /* MUST BE ON FOR A CT           */ 01680000
         LTR   R15,R15                                             0848 01681000
         BNZ   @RF00848                                            0848 01682000
         TM    DEVINPUT(DEVPTR),B'11000000'                        0848 01683000
         BNZ   @RF00848                                            0848 01684000
*     R15=4;                        /* IF NOT SET NXT LOWER RTN      */ 01685000
         LA    R15,4                                               0849 01686000
*   IF R15=4&                       /* SAME CHECK AS ABOVE BUT       */ 01687000
*       DEVOTPUT^='1'B              /* ONLU FOR OUTPUT               */ 01688000
*     THEN                          /* SET FOR TT IF NOT ON          */ 01689000
@RF00848 C     R15,@CF00055                                        0850 01690000
         BNE   @RF00850                                            0850 01691000
         TM    DEVOTPUT(DEVPTR),B'01000000'                        0850 01692000
         BO    @RF00850                                            0850 01693000
*     R15=8;                                                       0851 01694000
         LA    R15,8                                               0851 01695000
*   R13=LOGSVE4(2);                 /* PICK UP PTR TO SAVE AREA      */ 01696000
@RF00850 L     R13,LOGSVE4+4                                       0852 01697000
*   GEN(L     R14,L12(R13));        /* RESET RETURN REG              */ 01698000
         L     R14,L12(R13)                                             01699000
*   GEN(LM    R0,R12,L20(R13));     /* RESET REST REGS               */ 01700000
         LM    R0,R12,L20(R13)                                          01701000
*   GEN(BR    R14);                                                0855 01702000
         BR    R14                                                      01703000
*   GEN(EJECT);                                                    0856 01704000
         EJECT                                                          01705000
*                                                                  0857 01706000
*/********************************************************************/ 01707000
*/*    SET TIMER                                                     */ 01708000
*/********************************************************************/ 01709000
*                                                                  0857 01710000
*I00C0300:                                                         0857 01711000
*   GEN;                                                           0857 01712000
I00C0300 DS    0H                                                  0857 01713000
           USING *,R15                                                  01714000
         STM   R14,R12,L12(R13)         /* SAVE CALLERS REGS        */  01715000
         LM    R11,R12,BASEREGS         /* GET BASE REGS            */  01716000
         DROP R15                                                       01717000
*   LOGSVE5(2)=R13;                 /* SAVE PTR TO CALLER AREA       */ 01718000
         ST    R13,LOGSVE5+4                                       0858 01719000
*   R13=ADDR(LOGSVE5);                                             0859 01720000
         LA    R13,LOGSVE5                                         0859 01721000
*   TIMVAL=R1*100;                  /* MULTY BY 100 INC=.01 SEC      */ 01722000
         LR    @10,R1                                              0860 01723000
         MH    @10,@CH01135                                        0860 01724000
         ST    @10,TIMVAL                                          0860 01725000
*   GEN SETS(TIMVAL) REFS(I00C0350);                               0861 01726000
         STIMER REAL,I00C0350,BINTVL=TIMVAL                             01727000
*   R13=LOGSVE5(2);                 /* RESTORE CALLERS SAVEAREA ADDR */ 01728000
         L     R13,LOGSVE5+4                                       0862 01729000
*   GEN(LM R14,R12,L12(R13));       /* RESTORE ALL REGISTERS         */ 01730000
         LM R14,R12,L12(R13)                                            01731000
*   GEN(BR R14);                    /* RETURN TO THE CALLER          */ 01732000
         BR R14                                                         01733000
*I00C0350:                                                         0865 01734000
*   GEN;                                                           0865 01735000
I00C0350 DS    0H                                                  0865 01736000
         USING I00C0350,R15        SET UP ADDRESSABLITY                 01737000
         STM   R14,R12,L12(R13)    SAVE ALL CALLERS REGS                01738000
         LM    R11,R12,BASEREGS    PICK UP INTERNAL BASE REGS           01739000
         DROP  R15                 FORGET ABOUT ENTRY REG               01740000
*   RCAPTR=ADDR(TLTACB);            /* POINT TO THE RCA FOR THE POST */ 01741000
         LA    RCAPTR,TLTACB                                       0866 01742000
*   R1=ADDR($TLTECB2);              /* POST ECB ISTCC014 IS WAITING     01743000
*                                      ON                            */ 01744000
         LA    R1,$TLTECB2(,RCAPTR)                                0867 01745000
*   GEN( POST (1) );                /* POST THE ECB COMPLETE         */ 01746000
          POST (1)                                                      01747000
*   GEN;                                                           0869 01748000
           LM    R14,R12,L12(R13)                                       01749000
           BR    R14                                                    01750000
           LTORG                                                        01751000
*   GEN(EJECT);                                                    0870 01752000
         EJECT                                                          01753000
*                                                                  0871 01754000
*/********************************************************************/ 01755000
*/*   ATTENTION EXIT                                                 */ 01756000
*/********************************************************************/ 01757000
*                                                                  0871 01758000
*I00C0400:                                                         0871 01759000
*   ;                                                              0871 01760000
I00C0400 DS    0H                                                  0872 01761000
*   GEN;                                                           0872 01762000
         USING *,R15                                                    01763000
         LM    R11,R12,BASEREGS         /* RESET BASE REGS           */ 01764000
         DROP  R15                                                      01765000
*   R13=ADDR(LOGSVE1);              /* GET PTR TO A SAVE REG         */ 01766000
         LA    R13,LOGSVE1                                         0873 01767000
*   GEN(STM   R14,R12,L12(R13));    /* SAVE REGS                     */ 01768000
         STM   R14,R12,L12(R13)                                         01769000
*   CALL I00C0090;                  /* SET UP SAVE AREAS             */ 01770000
         BAL   @14,I00C0090                                        0875 01771000
*   R4=ADDR(EXITCID);               /* SET PTR TO CID                */ 01772000
         LA    R4,EXITCID(,R1)                                     0876 01773000
*   R2=EXITUSR;                     /* PICKUP WORK AREA      @D32JPPW*/ 01774000
         L     R2,EXITUSR(,R1)                                     0877 01775000
*   IF $CID(1)=LSTCID               /* IS IT THE CT                  */ 01776000
*     THEN                                                         0878 01777000
         CLC   $CID(4,WAPTR),LSTCID(R4)                            0878 01778000
         BNE   @RF00878                                            0878 01779000
*     DO;                                                          0879 01780000
*       $CIREQ='1'B;                /* SET IND FOR DTO               */ 01781000
         OI    $CIREQ(WAPTR),B'00000001'                           0880 01782000
*       R4=ADDR($TLTRPL1);                                         0881 01783000
         LA    R4,$TLTRPL1(,WAPTR)                                 0881 01784000
*       R5=$CID(1);                 /* GET CID               @YA04061*/ 01785000
         ICM   R5,15,$CID(WAPTR)                                   0882 01786000
*       GEN;                                                       0883 01787000
         RESET RPL=(R4),ACB=TLTACB,OPTCD=(SYN,CA,LOCK),ARG=(R5)         01788000
*     END;                                                         0884 01789000
*   R13=LOGSAVE(2);                 /* GET ORIG SAVE AREA PTR        */ 01790000
@RF00878 L     R13,LOGSAVE+4                                       0885 01791000
*   GEN(LM    R14,R12,L12(R13));    /* RESET REGS                    */ 01792000
         LM    R14,R12,L12(R13)                                         01793000
*   GEN(BR    R14);                 /* RETURN                        */ 01794000
         BR    R14                                                      01795000
*   GEN(EJECT);                                                    0888 01796000
         EJECT                                                          01797000
*                                                                  0889 01798000
*/********************************************************************/ 01799000
*/*      RESIDENT COMMON AREA  R.C.A.                                */ 01800000
*/********************************************************************/ 01801000
*                                                                  0889 01802000
*   GEN(DS    0D);                  /* SET ALIGNMENT                 */ 01803000
         DS    0D                                                       01804000
*   GEN;                                                           0890 01805000
BASEREGS  DC    2F'0'                                                   01806000
SAVEALL   DC    16F'0'                                                  01807000
*TLTACB:                                                           0891 01808000
*   ;                                                              0891 01809000
TLTACB   DS    0H                                                  0892 01810000
*   GEN;                                                           0892 01811000
*                                                                  0892 01812000
ACB       ACB   AM=VTAM,APPLID=NAME,EXLST=EXITLIST,MACRF=LOGON          01813000
        ORG ACB+100                                            @D32JPPW 01814000
TOLTEP   DC    F'0'                                                     01815000
CVTSAVE DC F'0'                                                         01816000
FSTAREA  DC    F'0'                                                     01817000
LSTAREA  DC    F'0'                                                     01818000
ABEND    DC    F'0'                                                     01819000
CLEANUP  DC    F'0'                                                     01820000
TLTECB1  DC    F'0'                                                     01821000
TLTECB2  DC    F'0'                                                     01822000
RTNPTR    DC    F'0'                                                    01823000
EXITLIST EXLST AM=VTAM,                                                C01824000
               LOGON=(I00C0020),                                       C01825000
               LOSTERM=(I00C0080),                                     C01826000
               ATTN=(I00C0400),                                        C01827000
               TPEND=(I00C0100)                                         01828000
         ORG   EXITLIST+80                                    @D32JPPW  01829000
QUEHNDL  DC    V(ISTCC015)                                              01830000
COMINT   DC    F'0'                                                     01831000
TRTBLA   DC    A(TRTBL-C'0')                                            01832000
CTARGX   DC    F'0'                                                     01833000
CTNAME   DC    CL8' '                                                   01834000
CURRTWA  DC    F'0'                                                     01835000
USECNT   DC    H'0'                                                     01836000
         DC    H'0'                SPARE                                01837000
TRTBL    DC    C'0123456789ABCDEF'                                      01838000
TLTPRPL  RPL   ACB=TLTACB,AM=VTAM,NIB=TLTNIB,EXIT=*                     01839000
         ORG   TLTPRPL+120                                     @D32JPPW 01840000
TLTNIB   NIB   MODE=BASIC,LISTEND=YES,PROC=(MONITOR)                    01841000
         ORG   TLTNIB+80                                       @D32JPPW 01842000
BUFFS    DC    CL132' '                                                 01843000
CTDVAR   DC    F'0'                                                     01844000
DEVAREA  DC    F'0'                                                     01845000
RCAFLGS  DC    XL1'00'                                                  01846000
         DC    XL3'0'                          SPARE           @D32JPPW 01847000
TRASCII  DC    XL16'000000000009007F0000000B0C0D0E0F' X'00'    @ZD10879 01848000
         DC    XL16'0011121300000800180000001C1D1E00' X'10'    @DM00909 01849000
         DC    XL16'00000000000A001B0000000000000007' X'20'    @ZD10879 01850000
         DC    XL16'00000000000000000000000014000000' X'30'    @ZD10879 01851000
         DC    XL16'200000000000000000005B2E3C282B21' X'40'    @ZD10879 01852000
         DC    XL16'260000000000000000005D242A293B00' X'50'    @ZD10879 01853000
         DC    XL16'2D2F00000000000000007C2C255E3E3F' X'60'    @ZD10879 01854000
         DC    XL16'000000000000000000603A2340273D22' X'70'    @ZD10879 01855000
         DC    XL16'00616263646566676869000000000000' X'80'    @ZD10879 01856000
         DC    XL16'006A6B6C6D6E6F707172000000000000' X'90'    @ZD10879 01857000
         DC    XL16'0000737475767778797A000000000000' X'A0'    @ZD10879 01858000
         DC    XL16'00000000000000000000000000000000' X'B0'    @ZD10879 01859000
         DC    XL16'7B414243444546474849000000000000' X'C0'    @ZD10879 01860000
         DC    XL16'7D4A4B4C4D4E4F505152000000000000' X'D0'    @D32JPPW 01861000
         DC    XL16'5C00535455565758595A000000000000' X'E0'    @ZD10879 01862000
         DC    XL16'30313233343536373839000000000000' X'F0'    @ZD10879 01863000
EXITSAV  DC    18F'0'                  SAVE AREA FOR EXITS     @D32JPPW 01864000
TLTEND   DC    XL1'89'                                                  01865000
L0       EQU   0                                                        01866000
L4       EQU   4                                                        01867000
L8       EQU   8                                                        01868000
L12      EQU   12                                                       01869000
L20      EQU   20                                                       01870000
*/********************************************************************/ 01871000
*/*  USER EXIT CONTROL BLOCK                                         */ 01872000
*/*  REVISIONS                                         002 03/06/75  */ 01873000
*                                                                  0893 01874000
*   DCL                                                            0893 01875000
*     1 ISTUECB BASED BDY(DWORD),   /*                               */ 01876000
*      2 UECID CHAR(1),             /* UECB IDENTIFIER               */ 01877000
*      2 UECLEN PTR(8),             /* LENGTH OF UECB                */ 01878000
*      2 UECRSV01 BIT(8),           /* RESERVED                      */ 01879000
*      2 UECTYPE CHAR(1),           /* ID OF EXIT TO BE SCHEDULED    */ 01880000
*      2 UECFORW PTR(31),           /* CHAIN FIELD                   */ 01881000
*      2 UECTSKID PTR(31),          /* ID OF TASK EXIT RUNS UNDER    */ 01882000
*      2 UECEXLST PTR(31),          /* EXIT LIST POINTER             */ 01883000
*      2 UECPAB CHAR(LENGTH(ISTPAB)) BDY(DWORD),/* PAB USED TO     0893 01884000
*                                      SCHEDULE EXIT                 */ 01885000
*      2 UECPLIST CHAR(20) BDY(WORD),/* PARM LIST FOR USER EXIT      */ 01886000
*       3 UECACB PTR(31),           /* ACB ADDRESS                   */ 01887000
*        4 UECRPLAD PTR(31),        /* RPL ADDRESS                   */ 01888000
*       3 UECNDID PTR(31),          /* NODE ID OR CID                */ 01889000
*        4 UECTPNCD PTR(31),        /* TPEND REASON CODE             */ 01890000
*         5 UECSAF BIT(16),         /* SOURCE ID FOR CID             */ 01891000
*         5 UECDAF BIT(16),         /* DESTINATION ID FOR CID        */ 01892000
*       3 UECREQTR CHAR(4),         /* PTR TO REQUESTER SYMBOLIC NAME*/ 01893000
*        4 UECUSFLD CHAR(4),        /* USER FIELD                    */ 01894000
*       3 UECDLEN BIT(32),          /* LENGTH OF DATA                */ 01895000
*        4 UECRSNCD BIT(32),        /* REASON CODE FOR DEV DISCONNECT*/ 01896000
*         5 * CHAR(3),              /* RESERVED                      */ 01897000
*         5 UECRSNBT FIXED(8),      /* UECB REASON CODE              */ 01898000
*       3 UECVRPL PTR(31),          /* VRPL POINTER                  */ 01899000
*      2 UECSYMNM CHAR(8),          /* SYMBOLIC NAME OF TERMINAL     */ 01900000
*      2 UECREQNM CHAR(8),          /* SYMBOLIC NAME OF REQUESTOR    */ 01901000
*      2 UECDVTPT PTR(31),          /* PTR TO USER EXIT INTERFACE    */ 01902000
*      2 UECLGDTA PTR(31),          /* ADDR OF THE FIRST BUFFER OF OF   01903000
*                                      LOGON DATA                    */ 01904000
*      2 UECRVPT3 PTR(31),          /* RESERVED                      */ 01905000
*      2 UECRVPT4 PTR(31);          /* RESERVED                      */ 01906000
*                                                                  0893 01907000
*   /*****************************************************************/ 01908000
*   /*                                                               */ 01909000
*   /* UECRBTYP FIELDS                                               */ 01910000
*   /*                                                               */ 01911000
*   /*****************************************************************/ 01912000
*                                                                  0894 01913000
*   DCL                                                            0894 01914000
*     UECLSRB BIT(2) CONSTANT('10'B);/* LOCAL SRB                    */ 01915000
*   DCL                                                            0895 01916000
*     UECGSRB BIT(2) CONSTANT('11'B);/* GLOBAL SRB                   */ 01917000
*                                                                  0895 01918000
*   /*****************************************************************/ 01919000
*   /*                                                               */ 01920000
*   /* UECTYPE FIELDS - MUST REFLECT IFGEXLST FIELD ORDER            */ 01921000
*   /*                                                               */ 01922000
*   /*****************************************************************/ 01923000
*                                                                  0896 01924000
*   DCL                                                            0896 01925000
*     UECSYNAD BIT(8) CONSTANT('03'X);/* EXIT SYN (EXLSYN)           */ 01926000
*   DCL                                                            0897 01927000
*     UECLERAD BIT(8) CONSTANT('04'X);/* EXIT LERAD (EXLLER)         */ 01928000
*   DCL                                                            0898 01929000
*     UECLOGON BIT(8) CONSTANT('06'X);/* EXIT LGN (EXLLGN)           */ 01930000
*   DCL                                                            0899 01931000
*     UECLOGOF BIT(8) CONSTANT('09'X);/* EXIT NLGN (EXLNLGN)         */ 01932000
*   DCL                                                            0900 01933000
*     UECRELRQ BIT(8) CONSTANT('0A'X);/* EXIT RLRQ (EXLRLRQ)         */ 01934000
*   DCL                                                            0901 01935000
*     UECUNSIP BIT(8) CONSTANT('0B'X);/* EXIT UNSP (EXLUNSP)         */ 01936000
*   DCL                                                            0902 01937000
*     UECATTEN BIT(8) CONSTANT('0C'X);/* EXIT ATTN (EXLATTN)         */ 01938000
*   DCL                                                            0903 01939000
*     UECTPEND BIT(8) CONSTANT('0D'X);/* EXIT TPEND (EXLTPEND)       */ 01940000
*   DCL                                                            0904 01941000
*     UECASYIP BIT(8) CONSTANT('0E'X);/* EXIT ASYP (EXLASYP)         */ 01942000
*   DCL                                                            0905 01943000
*     UECRPL BIT(8) CONSTANT('00'X);/* RPL USER EXIT                 */ 01944000
*   DCL                                                            0906 01945000
*     UECTYP BIT(8) CONSTANT('26'X);/* TYPE CODE FOR UECB            */ 01946000
*                                                                  0906 01947000
*   /*****************************************************************/ 01948000
*   /*                                                               */ 01949000
*   /* UECID FIELDS                                                  */ 01950000
*   /*                                                               */ 01951000
*   /*****************************************************************/ 01952000
*                                                                  0907 01953000
*   DCL                                                            0907 01954000
*     UEID BIT(8) CONSTANT('10'X);  /* UEC6 TYPE ID                  */ 01955000
*   DCL                                                            0908 01956000
*     UECHALTS BIT(8) CONSTANT('00'X);/* HALT NORMAL                 */ 01957000
*   DCL                                                            0909 01958000
*     UECHALTQ BIT(8) CONSTANT('04'X);/* HALT QUICK ISSUED           */ 01959000
*   DCL                                                            0910 01960000
*     UECHALTI BIT(8) CONSTANT('08'X);/* INTERNAL HALT QUICK         */ 01961000
*   DCL                                                            0911 01962000
*     UECSCIP BIT(8) CONSTANT('05'X);/* SESSION CTL INPUT EXIT       */ 01963000
*   DCL                                                            0912 01964000
*     UECDFASY BIT(8) CONSTANT('07'X);/* DATA FLOW ASY EXIT          */ 01965000
*   DCL                                                            0913 01966000
*     UECRESP BIT(8) CONSTANT('08'X);/* RESPONSE EXIT                */ 01967000
*   DCL                                                            0914 01968000
*     UECDFSYN BIT(8) CONSTANT('0E'X);/* DATA FLOW SYN EXIT          */ 01969000
*/*  UECB REASON CODE                                                */ 01970000
*                                                                  0915 01971000
*   DCL                                                            0915 01972000
*     UECCDR FIXED(8) CONSTANT(12), /* CLOSDEST REQUIRED             */ 01973000
*     UECTSOLT FIXED(8) CONSTANT(1),/* TSO/VTAM LTERM SCH    @ZA27997*/ 01974000
*     UECFIRM FIXED(8) CONSTANT(16),/* LU FAILED                     */ 01975000
*     UECTERM FIXED(8) CONSTANT(20),/* TERMINATE RECEIVED            */ 01976000
*     UECNTFY FIXED(8) CONSTANT(24),/* NOTIFY FROM VARY              */ 01977000
*     UECRTRM FIXED(8) CONSTANT(40);/* TEST REQUEST                  */ 01978000
*   DCL                                                            0916 01979000
*     UECPREMT FIXED(8) CONSTANT(08),/* TOLTEP PREEMPT               */ 01980000
*     UECRESTR FIXED(8) CONSTANT(28),/* RESTORE AFTER PREEMPT        */ 01981000
*     UECRSNPR FIXED(8) CONSTANT(08),/* PREEMPT                      */ 01982000
*     UECRSNRE FIXED(8) CONSTANT(28),/* RESTORE                      */ 01983000
*     UECNDTRM FIXED(8) CONSTANT(32),/* COND TERMINATE RECEIVED      */ 01984000
*     UECBFFLD FIXED(8) CONSTANT(36),/* BUFFER FLOODING              */ 01985000
*     UECSEGER FIXED(8) CONSTANT(28);/* SEGMENTTING ERROR            */ 01986000
*/* TPEPILOG                                                         */ 01987000
*                                                                  0917 01988000
*   GEN(PRINT OFF);                                                0917 01989000
         PRINT OFF                                                      01990000
*   DECLARE                                                        0918 01991000
*     EMCR0 PTR REG(0),                                            0918 01992000
*     EMCR1 PTR REG(1),                                            0918 01993000
*     EMCR2 PTR REG(2),                                            0918 01994000
*     EMCR3 PTR REG(3),                                            0918 01995000
*     EMCR4 PTR REG(4),                                            0918 01996000
*     EMCR5 PTR REG(5),                                            0918 01997000
*     EMCR6 PTR REG(6),                                            0918 01998000
*     EMCR7 PTR REG(7),                                            0918 01999000
*     EMCR8 PTR REG(8),                                            0918 02000000
*     EMCR9 PTR REG(9),                                            0918 02001000
*     EMCR10 PTR REG(10),                                          0918 02002000
*     EMCR11 PTR REG(11),                                          0918 02003000
*     EMCR12 PTR REG(12),                                          0918 02004000
*     EMCR13 PTR REG(13),                                          0918 02005000
*     EMCR14 PTR REG(14),                                          0918 02006000
*     EMCR15 PTR REG(15);                                          0918 02007000
*   DCL                                                            0919 02008000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 02009000
*   DCL                                                            0920 02010000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 02011000
*   GEN(PRINT ON);                                                 0921 02012000
*                                                                  0921 02013000
         PRINT ON                                                       02014000
*/* END OF TPEPILOG                                                  */ 02015000
*/* ATDSPLY   INVOKED.                                               */ 02016000
*/********************************************************************/ 02017000
*/* THE FOLLOWING ATBUILD INCLUSIONS HAVE BEEN MADE IN THIS          */ 02018000
*/* COMPILATION:                                                     */ 02019000
*/*             ISTPROCD                                             */ 02020000
*/*             ISTDEVCH                                             */ 02021000
*/*             ISTNIB                                               */ 02022000
*/*             ISTAVT                                               */ 02023000
*/*             ISTPAB                                               */ 02024000
*/*             ISTLOK                                               */ 02025000
*/*             ISTDYPAB                                             */ 02026000
*/*             ISTRPH                                               */ 02027000
*/*             ISTATCVT                                             */ 02028000
*/*             ISTTIE                                               */ 02029000
*/*             ISTBIND                                              */ 02030000
*/********************************************************************/ 02031000
*/* END OF ATDSPLY.                                                  */ 02032000
*                                                                  0922 02033000
*   END                                                            0922 02034000
*                                                                  0922 02035000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02036000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02037000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 02038000
*/*%INCLUDE SYSLIB  (IFGRPLVT)                                       */ 02039000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 02040000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 02041000
*/*%INCLUDE SYSLIB  (IFGACBVT)                                       */ 02042000
*/*%INCLUDE SYSLIB  (ISTUECB )                                       */ 02043000
*                                                                  0922 02044000
*       ;                                                          0922 02045000
         B     @EL00001                                            0922 02046000
@DATA    DS    0H                                                       02047000
@CH03053 DC    H'46'                                                    02048000
@CH03031 DC    H'63'                                                    02049000
@CH01461 DC    H'68'                                                    02050000
@CH01135 DC    H'100'                                                   02051000
@SM03173 MVC   BUFFBIND(0,@10),BINDBUFR                                 02052000
         DS    0F                                                       02053000
@SA00001 DS    18F                                                      02054000
@TF00001 DS    F                                                        02055000
         DS    0F                                                       02056000
@CF00063 DC    F'1'                                                     02057000
@CH00063 EQU   @CF00063+2                                               02058000
@CF00075 DC    F'2'                                                     02059000
@CH00075 EQU   @CF00075+2                                               02060000
@CF00055 DC    F'4'                                                     02061000
@CF00061 DC    F'8'                                                     02062000
@CF00033 DC    F'12'                                                    02063000
@CF00708 DC    F'16'                                                    02064000
@CF01177 DC    F'18'                                                    02065000
@CF01162 DC    F'132'                                                   02066000
@CF01984 DC    XL4'80000000'                                            02067000
@CA00028 DC    A(ISTIC000)                                              02068000
@CV02665 DC    V(ISTCC015)                                              02069000
@CV02667 DC    V(ISTIC001)                                              02070000
@CV02669 DC    V(ISTIC002)                                              02071000
@CV02670 DC    V(M080330)                                               02072000
@CV02666 DC    V(ISTSC020)                                              02073000
@CV02668 DC    V(ISTTC035)                                              02074000
         DS    0D                                                       02075000
CVTPTR   DS    A                                                        02076000
RFTSV14  DC    F'0'                                                     02077000
LOGSV14  DC    F'0'                                                     02078000
LOGSVR1  DC    F'0'                                                     02079000
RPHSVR1  DC    F'0'                                                     02080000
UECBPTR  DC    A(0)                                                     02081000
SAVEDRPH DC    A(0)                                                     02082000
TIMVAL   DC    F'0'                                                     02083000
J        DC    F'0'                                                     02084000
K        DC    F'0'                                                     02085000
Q        DS    A                                                        02086000
BINDPTR  DS    A                                                        02087000
WTOECB   DC    F'0'                                                     02088000
FMZA0030 DS    FL4                                                      02089000
         ORG   FMZA0030                                                 02090000
@NM00146 DC    AL1(152)                                                 02091000
@NM00147 DC    AL3(0)                                                   02092000
         ORG   FMZA0030+4                                               02093000
BINDLEN  DS    F                                                        02094000
I        DS    H                                                        02095000
@CC03006 DC    C'BASIC   '                                              02096000
@CC03008 DC    C'RECORD  '                                              02097000
         DS    CL2                                                      02098000
LOGINTEL DS    CL16                                                     02099000
         ORG   LOGINTEL                                                 02100000
@NM00117 DS    FL4                                                      02101000
         ORG   @NM00117                                                 02102000
@NM00118 DC    X'18'                                                    02103000
@NM00119 DC    X'10'                                                    02104000
@NM00120 DC    X'0000'                                                  02105000
         ORG   LOGINTEL+4                                               02106000
@NM00121 DC    F'0'                                                     02107000
@NM00122 DC    F'0'                                                     02108000
@NM00123 DC    F'0'                                                     02109000
         ORG   LOGINTEL+16                                              02110000
MODINTEL DS    CL16                                                     02111000
         ORG   MODINTEL                                                 02112000
@NM00124 DS    FL4                                                      02113000
         ORG   @NM00124                                                 02114000
@NM00125 DC    X'18'                                                    02115000
@NM00126 DC    X'10'                                                    02116000
@NM00127 DC    X'0000'                                                  02117000
         ORG   MODINTEL+4                                               02118000
@NM00128 DC    F'0'                                                     02119000
@NM00129 DC    F'0'                                                     02120000
@NM00130 DC    F'0'                                                     02121000
         ORG   MODINTEL+16                                              02122000
SYSCON   DC    CL8'SYS CON '                                            02123000
NAME     DS    CL9                                                      02124000
         ORG   NAME                                                     02125000
@NM00131 DC    X'08'                                                    02126000
@NM00132 DC    CL8'ISTOLTEP'                                            02127000
         ORG   NAME+9                                                   02128000
         DS    CL3                                                      02129000
QHNLPARM DS    CL9                                                      02130000
         ORG   QHNLPARM                                                 02131000
QACB     DC    AL4(TLTACB)                                              02132000
QNAME    DS    FL4                                                      02133000
QCODE    DS    CL1                                                      02134000
         ORG   QHNLPARM+9                                               02135000
         DS    CL3                                                      02136000
WTOBLK   DS    CL148                                                    02137000
         ORG   WTOBLK                                                   02138000
WTORPREF DS    CL8                                                      02139000
         ORG   WTORPREF                                                 02140000
WTORINLN DC    AL1(0)                                                   02141000
WTORBFRP DC    AL3(0)                                                   02142000
WTORECBP DC    AL4(WTOECB)                                              02143000
         ORG   WTOBLK+8                                                 02144000
WTOPARM  DS    CL140                                                    02145000
         ORG   WTOPARM                                                  02146000
WTOSIZE  DS    FL2                                                      02147000
MCSFLAG  DC    X'8000'                                                  02148000
WTOTEXT  DS    CL132                                                    02149000
MCSCODE  DC    X'02000040'                                              02150000
         ORG   WTOBLK+148                                               02151000
MSG920D  DS    CL50                                                     02152000
         ORG   MSG920D                                                  02153000
@NM00133 DC    CL12'ITA920D MAY'                                        02154000
M920FILL DS    CL8                                                      02155000
@NM00134 DC    CL21' BE USED FOR TESTING'                               02156000
@NM00135 DC    CL9'REPLY Y/N'                                           02157000
         ORG   MSG920D+50                                               02158000
MSG299D  DS    CL24                                                     02159000
         ORG   MSG299D                                                  02160000
@NM00136 DC    CL24'ITA299D INCORRECT REPLY '                           02161000
         ORG   MSG299D+24                                               02162000
MSG923I  DS    CL59                                                     02163000
         ORG   MSG923I                                                  02164000
@NM00137 DC    CL9'ITA923I '                                            02165000
M923FLL1 DS    CL8                                                      02166000
@NM00138 DC    CL22' CANNOT INVOKE TOLTEP.'                             02167000
M923FLL2 DS    CL20                                                     02168000
         ORG   MSG923I+59                                               02169000
MSG921I  DS    CL42                                                     02170000
         ORG   MSG921I                                                  02171000
@NM00139 DC    CL32'ITA921I ISTOLTEP MADE INACTIVE.'                    02172000
M921FILL DS    CL10                                                     02173000
         ORG   MSG921I+42                                               02174000
RFTCALL  DC    CL8'RFT CALL'                                            02175000
CICALL   DC    CL8'CI CALL'                                             02176000
NETCALL  DC    CL8'NET CALL'                                            02177000
SUPRMODE DC    X'00'                                                    02178000
PBLMMODE DC    X'20'                                                    02179000
         DS    CL3                                                      02180000
BINDBUFR DS    CL36                                                     02181000
I107     DS    CL4                                                      02182000
         ORG   I107                                                     02183000
I10701   DS    BL1                                                      02184000
I10702   DS    BL1                                                      02185000
I10703   DS    BL1                                                      02186000
I10704   DS    BL1                                                      02187000
         ORG   I107+4                                                   02188000
LOGSVE1  DS    18F                                                      02189000
LOGSVE2  DS    18F                                                      02190000
ABNDSAVE DC    18F'0'                                                   02191000
LOGSVE3  DS    18F                                                      02192000
LOGSVE4  DS    18F                                                      02193000
LOGSVE5  DS    18F                                                      02194000
MSGS1    DC    CL20'VTAM FAILURE'                                       02195000
         DC    CL20'NO STORAGE SPACE'                                   02196000
         DC    CL20'OPNDST FAILED'                                      02197000
         DC    CL20' INVALID DEVICE TYPE'                               02198000
         DC    CL20'UPDATE/CUTEST IN USE'                               02199000
         DC    CL20'IN USE BY TOLTEP'                                   02200000
MSGS2    DC    CL12'ABEND LOOP'                                         02201000
         DC    CL12'INIT FAILED'                                        02202000
         DC    CL12'OPEN FAILED'                                        02203000
PATCH    DC    70F'0'                                                   02204000
CKDEV    DC    X'0100'                                                  02205000
         DC    X'0200'                                                  02206000
         DC    X'0300'                                                  02207000
         DC    X'040C'                                                  02208000
         DC    X'050C'                                                  02209000
         DC    X'0608'                                                  02210000
         DC    X'070C'                                                  02211000
         DC    X'0808'                                                  02212000
         DC    X'0900'                                                  02213000
         DC    X'0A04'                                                  02214000
         DC    X'0B00'                                                  02215000
         DC    X'0C04'                                                  02216000
         DC    X'0D08'                                                  02217000
         DC    X'0E08'                                                  02218000
         DC    X'0F08'                                                  02219000
         DC    X'1008'                                                  02220000
         DC    X'1108'                                                  02221000
         DC    X'1208'                                                  02222000
         DC    X'1308'                                                  02223000
         DC    X'1408'                                                  02224000
         DC    X'1508'                                                  02225000
         DC    X'160C'                                                  02226000
         DC    X'170C'                                                  02227000
         DC    X'1808'                                                  02228000
         DC    X'1900'                                                  02229000
         DC    X'1A04'                                                  02230000
         DC    X'1B04'                                                  02231000
         DC    X'1C00'                                                  02232000
         DC    X'1D08'                                                  02233000
         DC    X'1E08'                                                  02234000
         DC    X'2808'                                                  02235000
         DC    X'3308'                                                  02236000
         DC    X'3408'                                                  02237000
         DC    X'6400'                                                  02238000
         DC    X'6504'                                                  02239000
         DC    X'6608'                                                  02240000
         DC    X'6704'                                                  02241000
         DC    X'6808'                                                  02242000
         DC    X'6908'                                                  02243000
         DC    X'6A08'                                                  02244000
         DC    X'6B08'                                                  02245000
         DC    X'6C08'                                                  02246000
         DC    X'7808'                                                  02247000
         DC    X'7908'                                                  02248000
         DC    X'7A08'                                                  02249000
         DC    X'7B04'                                                  02250000
         DC    X'7C04'                                                  02251000
         DC    X'7D00'                                                  02252000
         DC    X'7E08'                                                  02253000
         DC    X'7F08'                                                  02254000
         DC    X'8008'                                                  02255000
         DC    X'8108'                                                  02256000
         DC    X'000C'                                                  02257000
         DC    X'000C'                                                  02258000
         DC    X'000C'                                                  02259000
ISTIC000 CSECT                                                          02260000
*                                                       /*@ZA20801*/    02261000
M200820 NIB MODE=BASIC,LISTEND=YES                      /*@ZA20801*/    02262000
ISTIC000 CSECT                                                          02263000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02264000
@01      EQU   01                                                       02265000
@02      EQU   02                                                       02266000
@03      EQU   03                                                       02267000
@04      EQU   04                                                       02268000
@05      EQU   05                                                       02269000
@06      EQU   06                                                       02270000
@07      EQU   07                                                       02271000
@08      EQU   08                                                       02272000
@09      EQU   09                                                       02273000
@10      EQU   10                                                       02274000
@11      EQU   11                                                       02275000
@12      EQU   12                                                       02276000
@13      EQU   13                                                       02277000
@14      EQU   14                                                       02278000
@15      EQU   15                                                       02279000
NIBPTR   EQU   @08                                                      02280000
P        EQU   @08                                                      02281000
RPLPTR   EQU   @06                                                      02282000
DEVPTR   EQU   @07                                                      02283000
RCAPTR   EQU   @03                                                      02284000
WAPTR    EQU   @02                                                      02285000
RPHPTR   EQU   @01                                                      02286000
R0       EQU   @00                                                      02287000
R1       EQU   @01                                                      02288000
R2       EQU   @02                                                      02289000
R3       EQU   @03                                                      02290000
R4       EQU   @04                                                      02291000
R5       EQU   @05                                                      02292000
R11      EQU   @11                                                      02293000
R13      EQU   @13                                                      02294000
R14      EQU   @14                                                      02295000
R15      EQU   @15                                                      02296000
R6       EQU   @06                                                      02297000
R7       EQU   @07                                                      02298000
R8       EQU   @08                                                      02299000
GPR01F   EQU   @01                                                      02300000
GPR02P   EQU   @02                                                      02301000
EMCR15   EQU   @15                                                      02302000
GPR01P   EQU   @01                                                      02303000
GPR03F   EQU   @03                                                      02304000
GPR03P   EQU   @03                                                      02305000
GPR04F   EQU   @04                                                      02306000
GPR04P   EQU   @04                                                      02307000
GPR05P   EQU   @05                                                      02308000
GPR13P   EQU   @13                                                      02309000
GPR15P   EQU   @15                                                      02310000
GPR00F   EQU   @00                                                      02311000
GPR00P   EQU   @00                                                      02312000
EMCR0    EQU   @00                                                      02313000
EMCR1    EQU   @01                                                      02314000
EMCR10   EQU   @10                                                      02315000
EMCR11   EQU   @11                                                      02316000
EMCR12   EQU   @12                                                      02317000
EMCR13   EQU   @13                                                      02318000
EMCR14   EQU   @14                                                      02319000
EMCR2    EQU   @02                                                      02320000
EMCR3    EQU   @03                                                      02321000
EMCR4    EQU   @04                                                      02322000
EMCR5    EQU   @05                                                      02323000
EMCR6    EQU   @06                                                      02324000
EMCR7    EQU   @07                                                      02325000
EMCR8    EQU   @08                                                      02326000
EMCR9    EQU   @09                                                      02327000
GPR02F   EQU   @02                                                      02328000
GPR05F   EQU   @05                                                      02329000
GPR06F   EQU   @06                                                      02330000
GPR06P   EQU   @06                                                      02331000
GPR07F   EQU   @07                                                      02332000
GPR07P   EQU   @07                                                      02333000
GPR08F   EQU   @08                                                      02334000
GPR08P   EQU   @08                                                      02335000
GPR09F   EQU   @09                                                      02336000
GPR09P   EQU   @09                                                      02337000
GPR10F   EQU   @10                                                      02338000
GPR10P   EQU   @10                                                      02339000
GPR11F   EQU   @11                                                      02340000
GPR11P   EQU   @11                                                      02341000
GPR12F   EQU   @12                                                      02342000
GPR12P   EQU   @12                                                      02343000
GPR13F   EQU   @13                                                      02344000
GPR15F   EQU   @15                                                      02345000
R10      EQU   @10                                                      02346000
R12      EQU   @12                                                      02347000
R9       EQU   @09                                                      02348000
         ENTRY I00C0005                                                 02349000
         ENTRY I00C0020                                                 02350000
         ENTRY I00C0030                                                 02351000
         ENTRY I00C0060                                                 02352000
         ENTRY I00C0070                                                 02353000
         ENTRY I00C0200                                                 02354000
         ENTRY I00C0300                                                 02355000
         ENTRY I00C1000                                                 02356000
         ENTRY I00C1001                                                 02357000
         ENTRY I00C1002                                                 02358000
ATCLCPTR EQU   1032                                                     02359000
CVTMAP   EQU   0                                                        02360000
CVTDAR   EQU   CVTMAP+72                                                02361000
CVTFLGS1 EQU   CVTDAR                                                   02362000
CVTDCB   EQU   CVTMAP+116                                               02363000
CVTIERLC EQU   CVTMAP+144                                               02364000
CVTOPTA  EQU   CVTMAP+182                                               02365000
CVTOPTB  EQU   CVTMAP+183                                               02366000
CVTGTF   EQU   CVTMAP+236                                               02367000
CVTGTFST EQU   CVTGTF                                                   02368000
CVTGTFS  EQU   CVTGTFST                                                 02369000
CVTSTATE EQU   CVTGTFST                                                 02370000
CVTTMODE EQU   CVTGTFST                                                 02371000
CVTFORM  EQU   CVTGTFST                                                 02372000
CVTAQAVT EQU   CVTMAP+240                                               02373000
CVTTCMFG EQU   CVTAQAVT                                                 02374000
CVTVOLM2 EQU   CVTMAP+244                                               02375000
CVTTATA  EQU   CVTVOLM2                                                 02376000
CVTTSKS  EQU   CVTTATA                                                  02377000
CVTVOLF2 EQU   CVTTSKS                                                  02378000
CVTTAT   EQU   CVTTATA+1                                                02379000
CVTATER  EQU   CVTMAP+248                                               02380000
CVTEXT1  EQU   CVTMAP+252                                               02381000
CVTPURG  EQU   CVTMAP+260                                               02382000
CVTQMSG  EQU   CVTMAP+268                                               02383000
CVTDMSR  EQU   CVTMAP+272                                               02384000
CVTRSV37 EQU   CVTDMSR                                                  02385000
CVTDMSRF EQU   CVTRSV37                                                 02386000
CVTERPV  EQU   CVTMAP+316                                               02387000
CVTINTLA EQU   CVTMAP+320                                               02388000
CVTAPF   EQU   CVTMAP+324                                               02389000
CVTEXT2  EQU   CVTMAP+328                                               02390000
CVTHJES  EQU   CVTMAP+332                                               02391000
CVTPGSIA EQU   CVTMAP+348                                               02392000
CVTA1F1  EQU   CVTMAP+356                                               02393000
CVTSYSK  EQU   CVTMAP+357                                               02394000
CVTVOLM1 EQU   CVTMAP+380                                               02395000
CVTVOLF1 EQU   CVTVOLM1                                                 02396000
CVTATMCT EQU   CVTMAP+388                                               02397000
CVTXTNT1 EQU   0                                                        02398000
CVTXTNT2 EQU   0                                                        02399000
CVTDSSV  EQU   CVTXTNT2                                                 02400000
CVTFLGBT EQU   CVTXTNT2+5                                               02401000
CVTQID   EQU   CVTXTNT2+24                                              02402000
CVTSHS   EQU   CVTXTNT2+40                                              02403000
CVTRV400 EQU   CVTXTNT2+52                                              02404000
CVTRV409 EQU   CVTXTNT2+53                                              02405000
CVTATCVT EQU   CVTXTNT2+64                                              02406000
CVTRV429 EQU   CVTXTNT2+84                                              02407000
CVTRV438 EQU   CVTXTNT2+85                                              02408000
CVTRV457 EQU   CVTXTNT2+112                                             02409000
CVTRV466 EQU   CVTXTNT2+113                                             02410000
CVTFIX   EQU   0                                                        02411000
CVTRELNO EQU   CVTFIX+252                                               02412000
IFGRPL   EQU   0                                                        02413000
RPLCOMN  EQU   IFGRPL                                                   02414000
RPLIDWD  EQU   RPLCOMN                                                  02415000
RPLLEN   EQU   RPLIDWD+3                                                02416000
RPLECB   EQU   RPLCOMN+8                                                02417000
RPLFDBWD EQU   RPLCOMN+12                                               02418000
RPLFDBK  EQU   RPLFDBWD+1                                               02419000
RPLRTNCD EQU   RPLFDBK                                                  02420000
RPLCNDCD EQU   RPLFDBK+1                                                02421000
RPLCMPON EQU   RPLCNDCD                                                 02422000
RPLFDB2  EQU   RPLCMPON                                                 02423000
RPLERRCD EQU   RPLCNDCD+1                                               02424000
RPLFDB3  EQU   RPLERRCD                                                 02425000
RPLKEYLE EQU   RPLCOMN+16                                               02426000
RPLARG   EQU   RPLCOMN+36                                               02427000
RPLOPTCD EQU   RPLCOMN+40                                               02428000
RPLOPT1  EQU   RPLOPTCD                                                 02429000
RPLECBSW EQU   RPLOPT1                                                  02430000
RPLOPT2  EQU   RPLOPTCD+1                                               02431000
RPLADR   EQU   RPLOPT2                                                  02432000
RPLOPT3  EQU   RPLOPTCD+2                                               02433000
RPLOPT4  EQU   RPLOPTCD+3                                               02434000
RPLNXTRP EQU   RPLCOMN+44                                               02435000
RPLBUFL  EQU   RPLCOMN+52                                               02436000
RPLOPTC2 EQU   RPLCOMN+56                                               02437000
RPLOPT5  EQU   RPLOPTC2                                                 02438000
RPLWRTYP EQU   RPLOPT5                                                  02439000
RPLOPT6  EQU   RPLOPTC2+1                                               02440000
RPLUNTYP EQU   RPLOPT6                                                  02441000
RPLOPT7  EQU   RPLOPTC2+2                                               02442000
RPLCNOPT EQU   RPLOPT7                                                  02443000
RPLOPT8  EQU   RPLOPTC2+3                                               02444000
RPLRBAR  EQU   RPLCOMN+60                                               02445000
RPLAIXID EQU   RPLRBAR+2                                                02446000
RPLEXTDS EQU   RPLCOMN+68                                               02447000
RPLEXTD1 EQU   RPLEXTDS                                                 02448000
RPLVTEXT EQU   IFGRPL+76                                                02449000
RPLFDBK2 EQU   RPLVTEXT+12                                              02450000
RPLSSNSI EQU   RPLFDBK2                                                 02451000
RPLDSB   EQU   RPLSSNSI                                                 02452000
RPLDSB1  EQU   RPLDSB                                                   02453000
RPLSSEI  EQU   RPLDSB1                                                  02454000
RPLDSB2  EQU   RPLDSB+1                                                 02455000
RPLUSNSI EQU   RPLFDBK2+2                                               02456000
RPLUSFLD EQU   RPLVTEXT+16                                              02457000
RPLOPTC3 EQU   RPLVTEXT+20                                              02458000
RPLOPT9  EQU   RPLOPTC3                                                 02459000
RPLOPT10 EQU   RPLOPTC3+1                                               02460000
RPLOPT11 EQU   RPLOPTC3+2                                               02461000
RPLOPT12 EQU   RPLOPTC3+3                                               02462000
RPLOSENS EQU   RPLVTEXT+24                                              02463000
RPLSSNSO EQU   RPLOSENS                                                 02464000
RPLSSEO  EQU   RPLSSNSO                                                 02465000
RPLOF16  EQU   0                                                        02466000
RPLRH3   EQU   RPLOF16                                                  02467000
RPLSRTYP EQU   RPLOF16+1                                                02468000
RPLSTYPE EQU   RPLSRTYP                                                 02469000
RPLRTYPE EQU   RPLSRTYP                                                 02470000
RPLCHN   EQU   RPLOF16+2                                                02471000
RPLVTFL1 EQU   RPLOF16+3                                                02472000
RPLVTFL2 EQU   RPLOF16+4                                                02473000
RPLPOSTV EQU   RPLVTFL2                                                 02474000
RPLRESP  EQU   RPLVTFL2                                                 02475000
RPLCNTRL EQU   RPLOF16+5                                                02476000
RPLCNTDF EQU   RPLCNTRL                                                 02477000
RPLCNTDC EQU   RPLCNTRL+1                                               02478000
RPLCNTSC EQU   RPLCNTRL+2                                               02479000
RPLOF60  EQU   0                                                        02480000
RPLOBSQ  EQU   RPLOF60+4                                                02481000
RPLIBSQ  EQU   RPLOF60+5                                                02482000
IFGACB   EQU   0                                                        02483000
ACBCOMN  EQU   IFGACB                                                   02484000
ACBLENG  EQU   ACBCOMN+2                                                02485000
ACBLENG2 EQU   ACBLENG                                                  02486000
ACBAMBL  EQU   ACBCOMN+4                                                02487000
ACBJWA   EQU   ACBAMBL                                                  02488000
ACBMACRF EQU   ACBCOMN+12                                               02489000
ACBMACR1 EQU   ACBMACRF                                                 02490000
ACBADR   EQU   ACBMACR1                                                 02491000
ACBCNV   EQU   ACBMACR1                                                 02492000
ACBMACR2 EQU   ACBMACRF+1                                               02493000
ACBBUFPL EQU   ACBCOMN+20                                               02494000
ACBMACR3 EQU   ACBBUFPL                                                 02495000
ACBRECFM EQU   ACBCOMN+24                                               02496000
ACBCCTYP EQU   ACBCOMN+25                                               02497000
ACBOPT   EQU   ACBCOMN+26                                               02498000
ACBDSORG EQU   ACBOPT                                                   02499000
ACBCROPS EQU   ACBDSORG                                                 02500000
ACBDVIND EQU   ACBDSORG                                                 02501000
ACBEXLST EQU   ACBCOMN+36                                               02502000
ACBDDNM  EQU   ACBCOMN+40                                               02503000
ACBAMETH EQU   ACBDDNM+3                                                02504000
ACBDEB   EQU   ACBDDNM+5                                                02505000
ACBOFLGS EQU   ACBCOMN+48                                               02506000
ACBEXFG  EQU   ACBOFLGS                                                 02507000
ACBIOSFG EQU   ACBOFLGS                                                 02508000
ACBINFLG EQU   ACBCOMN+50                                               02509000
ACBVVIC  EQU   ACBINFLG                                                 02510000
ACBUJFCB EQU   ACBCOMN+52                                               02511000
ACBBLKSZ EQU   ACBCOMN+60                                               02512000
ACBVTEXT EQU   IFGACB+76                                                02513000
ISTDEVCH EQU   0                                                        02514000
DEVSHCH  EQU   ISTDEVCH                                                 02515000
DEVCHAR  EQU   DEVSHCH                                                  02516000
DEVINPUT EQU   DEVCHAR                                                  02517000
DEVOTPUT EQU   DEVCHAR                                                  02518000
DEVTCODE EQU   ISTDEVCH+1                                               02519000
DEVFLAGS EQU   ISTDEVCH+3                                               02520000
DEVFCCTL EQU   DEVFLAGS                                                 02521000
DEVCHAR3 EQU   DEVFLAGS                                                 02522000
$RCAAREA EQU   0                                                        02523000
$POINTER EQU   $RCAAREA+100                                             02524000
$TOLTEP  EQU   $POINTER                                                 02525000
$CVTSAVE EQU   $POINTER+4                                               02526000
$FSTAREA EQU   $POINTER+8                                               02527000
$ABEND   EQU   $POINTER+16                                              02528000
$TLTECB2 EQU   $POINTER+28                                              02529000
$TRTBLA  EQU   $POINTER+124                                             02530000
$CURRTWA EQU   $POINTER+140                                             02531000
$CONSTNT EQU   $RCAAREA+244                                             02532000
$USECNT  EQU   $CONSTNT                                                 02533000
$TLTPRPL EQU   $CONSTNT+20                                              02534000
$DEVAREA EQU   $RCAAREA+600                                             02535000
$RCAFLG  EQU   $RCAAREA+604                                             02536000
$UPDATE  EQU   $RCAFLG                                                  02537000
$CONSOLE EQU   $RCAFLG                                                  02538000
$CUTESTB EQU   $RCAFLG                                                  02539000
$ABNDALL EQU   $RCAFLG                                                  02540000
$NEWCT   EQU   $RCAFLG                                                  02541000
$VTAMEND EQU   $RCAFLG                                                  02542000
TOLTEPWA EQU   0                                                        02543000
$SCTTBLE EQU   TOLTEPWA                                                 02544000
$TESTOPT EQU   $SCTTBLE+2                                               02545000
$ERROPT  EQU   $SCTTBLE+3                                               02546000
$PDEVFLG EQU   $SCTTBLE+10                                              02547000
$CDSFLGS EQU   $SCTTBLE+11                                              02548000
$CDS8T19 EQU   $SCTTBLE+20                                              02549000
$EXECFLG EQU   $SCTTBLE+33                                              02550000
$OLTFLGS EQU   $SCTTBLE+36                                              02551000
$OLTFLG2 EQU   $SCTTBLE+37                                              02552000
$TOTFLG1 EQU   $SCTTBLE+38                                              02553000
$ROUTMSK EQU   $SCTTBLE+40                                              02554000
$CDA     EQU   TOLTEPWA+100                                             02555000
$TFWDPTR EQU   $CDA+8                                                   02556000
$RCA     EQU   $CDA+44                                                  02557000
$OLTPTR  EQU   $CDA+52                                                  02558000
$HIMOREC EQU   $CDA+60                                                  02559000
$PTRAREA EQU   $CDA+92                                                  02560000
$OPNDCNT EQU   $CDA+112                                                 02561000
$COMMFLG EQU   TOLTEPWA+224                                             02562000
$FLAG1   EQU   $COMMFLG                                                 02563000
$TEP3RD  EQU   $FLAG1                                                   02564000
$FLAG2   EQU   $COMMFLG+1                                               02565000
$FLAG3   EQU   $COMMFLG+2                                               02566000
$REQSTOR EQU   $FLAG3                                                   02567000
$ALTPRTR EQU   $FLAG3                                                   02568000
$FLAG4   EQU   $COMMFLG+3                                               02569000
$CLSSACT EQU   $FLAG4                                                   02570000
$ACTOPND EQU   $FLAG4                                                   02571000
$FLAG5   EQU   $COMMFLG+4                                               02572000
$MSG922  EQU   $FLAG5                                                   02573000
$EOJ     EQU   $FLAG5                                                   02574000
$CANCEL  EQU   $EOJ                                                     02575000
$FLAG6   EQU   $COMMFLG+5                                               02576000
$CTERROR EQU   $FLAG6                                                   02577000
$ABNDBIT EQU   $FLAG6                                                   02578000
$ABTERM  EQU   $ABNDBIT                                                 02579000
$CIREQ   EQU   $FLAG6                                                   02580000
$FLAG7   EQU   $COMMFLG+6                                               02581000
$FLAG8   EQU   $COMMFLG+7                                               02582000
$FLAG9   EQU   $COMMFLG+8                                               02583000
$FLAG10  EQU   $COMMFLG+9                                               02584000
$WAITFLG EQU   $FLAG10                                                  02585000
$FLAG11  EQU   $COMMFLG+10                                              02586000
$FLAG12  EQU   $COMMFLG+11                                              02587000
$POSTFLG EQU   $FLAG12                                                  02588000
$ENDTEST EQU   $FLAG12                                                  02589000
$FLAG13  EQU   $COMMFLG+12                                              02590000
$OLTMACC EQU   $FLAG13                                                  02591000
$TEP1ST  EQU   $FLAG13                                                  02592000
$TEP2ND  EQU   $FLAG13                                                  02593000
$DEVTBLE EQU   TOLTEPWA+240                                             02594000
$DEVCDS  EQU   $DEVTBLE                                                 02595000
$DEVUNAD EQU   $DEVCDS                                                  02596000
@NM00081 EQU   $DEVUNAD+2                                               02597000
$DEVFEAT EQU   $DEVCDS+4                                                02598000
$DEVCDSF EQU   $DEVCDS+9                                                02599000
$DEVSDCF EQU   $DEVCDS+10                                               02600000
$$SYMNME EQU   $DEVCDS+12                                               02601000
$DEVFLG1 EQU   $DEVTBLE+20                                              02602000
$EVNCPLT EQU   $DEVFLG1                                                 02603000
$DVSPRM  EQU   $EVNCPLT                                                 02604000
$ATTNEXP EQU   $DEVFLG1                                                 02605000
$DVLGMDE EQU   $ATTNEXP                                                 02606000
$INTOCC  EQU   $DEVFLG1                                                 02607000
$DEVFLG2 EQU   $DEVTBLE+21                                              02608000
$DEVTECB EQU   $DEVTBLE+22                                              02609000
$OPIS    EQU   $DEVTECB                                                 02610000
$OPND    EQU   $DEVTECB+2                                               02611000
$DEVFLG3 EQU   $DEVTBLE+27                                              02612000
$NOTDEV  EQU   $DEVFLG3                                                 02613000
$ACQRED  EQU   $DEVFLG3                                                 02614000
$SIOFLG  EQU   $DEVFLG3                                                 02615000
$SYSMN   EQU   $DEVTBLE+28                                              02616000
$IFTOUT  EQU   $DEVTBLE+36                                              02617000
$DEVSESP EQU   $IFTOUT                                                  02618000
$SSCPDAF EQU   $IFTOUT+6                                                02619000
$LDNCBPT EQU   $DEVTBLE+48                                              02620000
$CID     EQU   $DEVTBLE+52                                              02621000
$RNINFO  EQU   $DEVTBLE+56                                              02622000
$DEVFLG5 EQU   $RNINFO+8                                                02623000
$DEVLU   EQU   $DEVFLG5                                                 02624000
$DEVFLG4 EQU   $DEVTBLE+65                                              02625000
$FEEDBCK EQU   $DEVTBLE+66                                              02626000
$DEVCNTS EQU   TOLTEPWA+1464                                            02627000
$SLTBL   EQU   TOLTEPWA+1468                                            02628000
$RUNTEST EQU   $SLTBL+13                                                02629000
$TESTFLG EQU   $SLTBL+21                                                02630000
$SECLST  EQU   $SLTBL+22                                                02631000
$TLTRPL1 EQU   TOLTEPWA+1616                                            02632000
#EXITA   EQU   TOLTEPWA+2632                                            02633000
$CCOMDAT EQU   TOLTEPWA+2644                                            02634000
$CFLGS   EQU   $CCOMDAT+16                                              02635000
$24FEMSG EQU   TOLTEPWA+2681                                            02636000
$24CATMG EQU   $24FEMSG+11                                              02637000
@NM00090 EQU   TOLTEPWA+2776                                            02638000
$OUNTPTR EQU   @NM00090+4                                               02639000
$NSPTR   EQU   $OUNTPTR                                                 02640000
$NSCNT   EQU   @NM00090+10                                              02641000
$ENXX    EQU   @NM00090+15                                              02642000
$IMITX   EQU   $ENXX                                                    02643000
SVESC033 EQU   TOLTEPWA+3160                                            02644000
SVECC013 EQU   TOLTEPWA+3232                                            02645000
SVEIC003 EQU   TOLTEPWA+3592                                            02646000
SVESC022 EQU   TOLTEPWA+3736                                            02647000
SVECC011 EQU   TOLTEPWA+4024                                            02648000
ISTPROCD EQU   0                                                        02649000
PROPROC  EQU   ISTPROCD                                                 02650000
PROPROC1 EQU   PROPROC                                                  02651000
PROPROC2 EQU   PROPROC+1                                                02652000
PROPROC3 EQU   PROPROC+2                                                02653000
PROPROC4 EQU   PROPROC+3                                                02654000
PROPROCS EQU   0                                                        02655000
PROSETMS EQU   PROPROCS+1                                               02656000
PROSETM2 EQU   PROSETMS                                                 02657000
PROSETM3 EQU   PROSETMS+1                                               02658000
PROSETM4 EQU   PROSETMS+2                                               02659000
ISTNIB   EQU   0                                                        02660000
NIBUSER  EQU   ISTNIB+8                                                 02661000
NIBSYM   EQU   ISTNIB+12                                                02662000
NIBMODE  EQU   ISTNIB+20                                                02663000
NIBFLGS  EQU   ISTNIB+40                                                02664000
NIBFLG1  EQU   NIBFLGS                                                  02665000
NIBLMODE EQU   ISTNIB+48                                                02666000
NIBNDAR  EQU   ISTNIB+56                                                02667000
ISTAVT   EQU   0                                                        02668000
ISTAS49  EQU   ISTAVT+4                                                 02669000
ISTPAB   EQU   0                                                        02670000
PABWQCHN EQU   ISTPAB                                                   02671000
PABWEQA  EQU   PABWQCHN                                                 02672000
PABCHAIN EQU   PABWQCHN+4                                               02673000
PABOFFST EQU   ISTPAB+8                                                 02674000
PABDVTA  EQU   ISTPAB+9                                                 02675000
PABRPHFG EQU   ISTPAB+12                                                02676000
PABFLAGS EQU   PABRPHFG                                                 02677000
PABAPYP  EQU   PABFLAGS                                                 02678000
PABERLCK EQU   PABFLAGS                                                 02679000
PABERRLK EQU   PABERLCK                                                 02680000
ISTLOK   EQU   0                                                        02681000
LOKCHN   EQU   ISTLOK+1                                                 02682000
LOKCHNG  EQU   LOKCHN                                                   02683000
@NM00099 EQU   LOKCHNG+2                                                02684000
ISTDYPAB EQU   0                                                        02685000
DYPTSKID EQU   ISTDYPAB+8                                               02686000
DYPPAB   EQU   ISTDYPAB+16                                              02687000
ISTRPH   EQU   0                                                        02688000
RPHCNTL  EQU   ISTRPH                                                   02689000
RPHFLAGS EQU   RPHCNTL+2                                                02690000
RPHAPTYP EQU   RPHFLAGS                                                 02691000
RPHFSTLC EQU   RPHFLAGS                                                 02692000
RPHFLGB  EQU   RPHCNTL+3                                                02693000
RPHRPHA  EQU   ISTRPH+4                                                 02694000
RPHTSKID EQU   ISTRPH+8                                                 02695000
RPHRESMA EQU   ISTRPH+16                                                02696000
RPHWPFLG EQU   RPHRESMA                                                 02697000
RPHWEA   EQU   ISTRPH+24                                                02698000
RPHCSPA  EQU   RPHWEA                                                   02699000
RPHSRPRM EQU   ISTRPH+28                                                02700000
RPHPABQA EQU   ISTRPH+36                                                02701000
RPHWORK  EQU   ISTRPH+40                                                02702000
RPHSAVE1 EQU   RPHWORK                                                  02703000
RPHSBITS EQU   RPHSAVE1+1                                               02704000
ISTATCVT EQU   0                                                        02705000
ATCCOM   EQU   ISTATCVT                                                 02706000
ATCSTAT  EQU   ATCCOM                                                   02707000
ATCSTAT1 EQU   ATCSTAT                                                  02708000
ATCACTIV EQU   ATCSTAT1                                                 02709000
ATCSNHLT EQU   ATCSTAT1                                                 02710000
ATCQKHLT EQU   ATCSTAT1                                                 02711000
ATCSTFLG EQU   ATCSTAT+1                                                02712000
ATCPOFLG EQU   ATCSTAT+2                                                02713000
ATCSTAT4 EQU   ATCSTAT+3                                                02714000
ATCMTST  EQU   ATCSTAT4                                                 02715000
ATCBPDA  EQU   ATCCOM+128                                               02716000
ATCIOTRC EQU   ATCCOM+140                                               02717000
ATCTHTRC EQU   ATCIOTRC                                                 02718000
ATCSMRQ  EQU   ATCCOM+180                                               02719000
ATCCSMR  EQU   ISTATCVT+296                                             02720000
ATCUEP   EQU   ISTATCVT+304                                             02721000
ATCSHRFG EQU   ISTATCVT+316                                             02722000
ATCECTLP EQU   ISTATCVT+368                                             02723000
ATCHPGM  EQU   ISTATCVT+384                                             02724000
ATCTODVT EQU   ISTATCVT+392                                             02725000
ATCTIPAB EQU   ISTATCVT+592                                             02726000
ATCTACB  EQU   ISTATCVT+700                                             02727000
ATCVLCNT EQU   ISTATCVT+772                                             02728000
ATCRNO   EQU   ISTATCVT+788                                             02729000
ATCSOPD  EQU   ISTATCVT+792                                             02730000
ATCSIPD  EQU   ISTATCVT+800                                             02731000
ATCSECST EQU   ISTATCVT+812                                             02732000
ATCSTAT2 EQU   ISTATCVT+818                                             02733000
ATCVTBAM EQU   ISTATCVT+908                                             02734000
@NM00110 EQU   ATCVTBAM+3                                               02735000
ATCAOSM  EQU   ISTATCVT+912                                             02736000
ATCGSRBQ EQU   ATCAOSM+4                                                02737000
ATCGSRBG EQU   ATCGSRBQ                                                 02738000
ATCAP31  EQU   ATCAOSM+24                                               02739000
ATCAP34  EQU   ATCAOSM+32                                               02740000
ATCICAPP EQU   ATCAOSM+100                                              02741000
ATCLDAPP EQU   ATCAOSM+120                                              02742000
ATCDAPVT EQU   ATCAOSM+140                                              02743000
ATCAP37  EQU   ATCAOSM+264                                              02744000
ATCCRA   EQU   ATCAOSM+280                                              02745000
ATCCRACN EQU   ATCCRA+4                                                 02746000
ATCSRB   EQU   ATCAOSM+288                                              02747000
ATCSRBCN EQU   ATCSRB+4                                                 02748000
ATCCRPL  EQU   ATCAOSM+296                                              02749000
ATCRPLCN EQU   ATCCRPL+4                                                02750000
ATCSQAFR EQU   ATCAOSM+304                                              02751000
ATCORTBC EQU   ATCSQAFR+4                                               02752000
ATCORSRB EQU   ATCORTBC                                                 02753000
@NM00112 EQU   ATCAOSM+332                                              02754000
ATCVTFLG EQU   ATCAOSM+392                                              02755000
ATCZFLAG EQU   ATCAOSM+588                                              02756000
ISTTIE   EQU   0                                                        02757000
TIETYPE  EQU   ISTTIE                                                   02758000
TIELNGTH EQU   ISTTIE+1                                                 02759000
TIERETCD EQU   ISTTIE+2                                                 02760000
TIETIEA  EQU   ISTTIE+4                                                 02761000
TIESNA   EQU   ISTTIE+8                                                 02762000
TIERPHA  EQU   ISTTIE+12                                                02763000
ISTBIND  EQU   0                                                        02764000
BINFMTY  EQU   ISTBIND                                                  02765000
BINPRIP  EQU   ISTBIND+3                                                02766000
BINSECP  EQU   ISTBIND+4                                                02767000
BINCMNP  EQU   ISTBIND+5                                                02768000
BINCMNP2 EQU   ISTBIND+6                                                02769000
BINTSU   EQU   ISTBIND+7                                                02770000
BINRPACE EQU   BINTSU+1                                                 02771000
BINRUSZ  EQU   BINTSU+2                                                 02772000
BINSRUSZ EQU   BINRUSZ                                                  02773000
BINPRUSZ EQU   BINRUSZ+1                                                02774000
BINPRSVC EQU   ISTBIND+13                                               02775000
BINLUP   EQU   BINPRSVC                                                 02776000
BINPSCHR EQU   BINPRSVC+1                                               02777000
WORKFLS  EQU   0                                                        02778000
COUNTFI  EQU   WORKFLS                                                  02779000
BUFFRPL  EQU   0                                                        02780000
BUFFNIB  EQU   0                                                        02781000
BUFFBIND EQU   0                                                        02782000
EXITPRM  EQU   0                                                        02783000
EXITCID  EQU   EXITPRM+4                                                02784000
EXITUSR  EQU   EXITPRM+8                                                02785000
TASKID   EQU   0                                                        02786000
$RFTTERM EQU   0                                                        02787000
LSTCID   EQU   0                                                        02788000
REASON1  EQU   0                                                        02789000
REASON2  EQU   0                                                        02790000
DEVCOD   EQU   0                                                        02791000
CODEV    EQU   DEVCOD+1                                                 02792000
ELEM     EQU   0                                                        02793000
@NM00143 EQU   0                                                        02794000
TOLACBA  EQU   @NM00143                                                 02795000
SYMPTR   EQU   @NM00143+4                                               02796000
VS1ABSVE EQU   0                                                        02797000
VS1PSW   EQU   VS1ABSVE+8                                               02798000
VS1REGS  EQU   VS1ABSVE+24                                              02799000
DMPSVE   EQU   0                                                        02800000
DMPPSW   EQU   DMPSVE                                                   02801000
DMPREGS  EQU   DMPSVE+8                                                 02802000
ISTUECB  EQU   0                                                        02803000
UECID    EQU   ISTUECB                                                  02804000
UECLEN   EQU   ISTUECB+1                                                02805000
UECTYPE  EQU   ISTUECB+3                                                02806000
UECTSKID EQU   ISTUECB+8                                                02807000
UECPAB   EQU   ISTUECB+16                                               02808000
UECPLIST EQU   ISTUECB+32                                               02809000
UECACB   EQU   UECPLIST                                                 02810000
UECNDID  EQU   UECPLIST+4                                               02811000
UECTPNCD EQU   UECNDID                                                  02812000
UECREQTR EQU   UECPLIST+8                                               02813000
UECUSFLD EQU   UECREQTR                                                 02814000
UECDLEN  EQU   UECPLIST+12                                              02815000
UECRSNCD EQU   UECDLEN                                                  02816000
UECSYMNM EQU   ISTUECB+52                                               02817000
UECREQNM EQU   ISTUECB+60                                               02818000
FMZL0030 EQU   0                                                        02819000
FMZL0049 EQU   0                                                        02820000
TPQEL    EQU   0                                                        02821000
ISTAPC37 EQU   0                                                        02822000
$TRTBL   EQU   0                                                        02823000
#EXIT    EQU   0                                                        02824000
ISTACB   EQU   0                                                        02825000
ISTAPC34 EQU   0                                                        02826000
ISTRPL   EQU   0                                                        02827000
CVTS01   EQU   CVTPGSIA                                                 02828000
CVTLPDIA EQU   CVTS01+12                                                02829000
CVTDIRST EQU   CVTLPDIA                                                 02830000
CVTSLIDA EQU   CVTS01+24                                                02831000
CVTCTLFG EQU   CVTS01+50                                                02832000
CVTRV210 EQU   CVTS01+424                                               02833000
CVTRV219 EQU   CVTS01+425                                               02834000
CVTRV228 EQU   CVTS01+426                                               02835000
CVTRV237 EQU   CVTS01+427                                               02836000
CVTMFRTR EQU   CVTS01+452                                               02837000
CVTRV262 EQU   CVTS01+468                                               02838000
CVTRV271 EQU   CVTS01+469                                               02839000
CVTRV280 EQU   CVTS01+470                                               02840000
CVTRV289 EQU   CVTS01+471                                               02841000
CVTGSDA  EQU   CVTS01+600                                               02842000
BINLUP1  EQU   BINPSCHR                                                 02843000
BINLUS   EQU   BINPSCHR                                                 02844000
BINFMF1  EQU   BINLUS                                                   02845000
BINRSV09 EQU   BINFMF1                                                  02846000
BINDSPF1 EQU   BINLUS+2                                                 02847000
BINMEDIA EQU   BINLUS+4                                                 02848000
BINLUP2  EQU   BINPSCHR                                                 02849000
BINLUP3  EQU   BINPSCHR                                                 02850000
LOGSAVE  EQU   EXITSAV                                                  02851000
DEFUSERF EQU   NIBUSER                                                  02852000
SVECC012 EQU   SVESC022                                                 02853000
SVEIC00A EQU   SVEIC003                                                 02854000
SVEIC004 EQU   SVEIC003                                                 02855000
SVEIC005 EQU   SVEIC003                                                 02856000
SVESC02A EQU   SVESC022                                                 02857000
SVESC02B EQU   SVESC022                                                 02858000
SVESC02D EQU   SVESC022                                                 02859000
SVESC02E EQU   SVESC022                                                 02860000
SVESC02F EQU   SVECC013                                                 02861000
SVESC024 EQU   SVESC022                                                 02862000
SVESC027 EQU   SVESC022                                                 02863000
SVESC029 EQU   SVESC033                                                 02864000
SVESC031 EQU   SVECC013                                                 02865000
SVESC032 EQU   SVECC011                                                 02866000
SVETC037 EQU   SVEIC003                                                 02867000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02868000
BINRSV26 EQU   BINLUP3                                                  02869000
BINRSV15 EQU   BINLUP2+10                                               02870000
BINPRESZ EQU   BINLUP2+9                                                02871000
BINRSV14 EQU   BINLUP2                                                  02872000
BINRSV13 EQU   BINMEDIA                                                 02873000
BINDISK  EQU   BINMEDIA                                                 02874000
BINXCHNG EQU   BINMEDIA                                                 02875000
BINCARD  EQU   BINMEDIA                                                 02876000
BINDOCMT EQU   BINMEDIA                                                 02877000
BINRSV17 EQU   BINDSPF1+1                                               02878000
BINTRNDS EQU   BINDSPF1                                                 02879000
BINRSV12 EQU   BINDSPF1                                                 02880000
BINVSDS  EQU   BINDSPF1                                                 02881000
BINVTDS  EQU   BINDSPF1                                                 02882000
BINHFDS  EQU   BINDSPF1                                                 02883000
BININTR  EQU   BINDSPF1                                                 02884000
BINRSV11 EQU   BINRSV09+1                                               02885000
BINXFPD  EQU   BINRSV09+1                                               02886000
BINCSDS  EQU   BINRSV09+1                                               02887000
BINQDSI  EQU   BINRSV09+1                                               02888000
BINRSV16 EQU   BINRSV09+1                                               02889000
BINARRR  EQU   BINRSV09                                                 02890000
BINSIDS  EQU   BINRSV09                                                 02891000
BINSAI   EQU   BINRSV09                                                 02892000
BINSDSI  EQU   BINRSV09                                                 02893000
BINKDDSI EQU   BINRSV09                                                 02894000
BINPDIR  EQU   BINFMF1                                                  02895000
BINCMPCT EQU   BINFMF1                                                  02896000
BINDESTS EQU   BINFMF1                                                  02897000
BINSLUS1 EQU   BINLUP1+6                                                02898000
BINPLUS1 EQU   BINLUP1+1                                                02899000
BINDSP1  EQU   BINLUP1                                                  02900000
BINFMHS1 EQU   BINLUP1                                                  02901000
CVTRV628 EQU   CVTS01+728                                               02902000
CVTRV627 EQU   CVTS01+724                                               02903000
CVTRV626 EQU   CVTS01+720                                               02904000
CVTRV625 EQU   CVTS01+716                                               02905000
CVTRV624 EQU   CVTS01+712                                               02906000
CVTRV623 EQU   CVTS01+708                                               02907000
CVTRV622 EQU   CVTS01+704                                               02908000
CVTRV621 EQU   CVTS01+700                                               02909000
CVTRV620 EQU   CVTS01+696                                               02910000
CVTRV619 EQU   CVTS01+692                                               02911000
CVTRV618 EQU   CVTS01+688                                               02912000
CVTRV617 EQU   CVTS01+684                                               02913000
CVTRV616 EQU   CVTS01+680                                               02914000
CVTRV615 EQU   CVTS01+676                                               02915000
CVTRV614 EQU   CVTS01+672                                               02916000
CVTRV613 EQU   CVTS01+668                                               02917000
CVTTCASP EQU   CVTS01+664                                               02918000
CVT0PT03 EQU   CVTS01+660                                               02919000
CVT0PT0E EQU   CVTS01+656                                               02920000
CVTIRM   EQU   CVTS01+652                                               02921000
CVTCGK   EQU   CVTS01+648                                               02922000
CVTRV607 EQU   CVTS01+644                                               02923000
CVTRV606 EQU   CVTS01+640                                               02924000
CVTRV605 EQU   CVTS01+636                                               02925000
CVTRV604 EQU   CVTS01+632                                               02926000
CVTEFF02 EQU   CVTS01+628                                               02927000
CVTCBBR  EQU   CVTS01+624                                               02928000
CVTSSCR  EQU   CVTS01+620                                               02929000
CVTEVENT EQU   CVTS01+616                                               02930000
CVTCRCA  EQU   CVTS01+612                                               02931000
CVTTPIO  EQU   CVTS01+608                                               02932000
CVTADV   EQU   CVTS01+604                                               02933000
CVTGSDAB EQU   CVTGSDA                                                  02934000
CVTQV3   EQU   CVTS01+596                                               02935000
CVTQV2   EQU   CVTS01+592                                               02936000
CVTQV1   EQU   CVTS01+588                                               02937000
CVTRPT   EQU   CVTS01+584                                               02938000
CVTSSRB  EQU   CVTS01+580                                               02939000
CVTCSDRL EQU   CVTS01+576                                               02940000
CVTEXP1  EQU   CVTS01+572                                               02941000
CVTRMPMT EQU   CVTS01+568                                               02942000
CVTRMPTT EQU   CVTS01+564                                               02943000
CVTVPSA  EQU   CVTS01+560                                               02944000
CVTVSTOP EQU   CVTS01+556                                               02945000
CVTGTFR8 EQU   CVTS01+552                                               02946000
CVTQUIT  EQU   CVTS01+548                                               02947000
CVTVACR  EQU   CVTS01+544                                               02948000
CVTWTCB  EQU   CVTS01+540                                               02949000
CVTSTPRS EQU   CVTS01+536                                               02950000
CVT0PT02 EQU   CVTS01+532                                               02951000
CVTDARCM EQU   CVTS01+528                                               02952000
CVTIRECM EQU   CVTS01+524                                               02953000
CVTJRECM EQU   CVTS01+520                                               02954000
CVTVEMS0 EQU   CVTS01+516                                               02955000
CVTSPFRR EQU   CVTS01+512                                               02956000
CVTRLSTG EQU   CVTS01+508                                               02957000
CVT0TC0A EQU   CVTS01+504                                               02958000
CVTGMBR  EQU   CVTS01+500                                               02959000
CVTLFRM  EQU   CVTS01+496                                               02960000
CVTRMBR  EQU   CVTS01+492                                               02961000
CVTVIOP  EQU   CVTS01+488                                               02962000
CVTRV307 EQU   CVTS01+486                                               02963000
CVTRV306 EQU   CVTS01+484                                               02964000
CVTRV305 EQU   CVTS01+482                                               02965000
CVTRV304 EQU   CVTS01+480                                               02966000
CVTRV303 EQU   CVTS01+478                                               02967000
CVTRV302 EQU   CVTS01+476                                               02968000
CVTTRCA  EQU   CVTS01+472                                               02969000
CVTRV297 EQU   CVTRV289                                                 02970000
CVTRV296 EQU   CVTRV289                                                 02971000
CVTRV295 EQU   CVTRV289                                                 02972000
CVTRV294 EQU   CVTRV289                                                 02973000
CVTRV293 EQU   CVTRV289                                                 02974000
CVTRV292 EQU   CVTRV289                                                 02975000
CVTRV291 EQU   CVTRV289                                                 02976000
CVTRV290 EQU   CVTRV289                                                 02977000
CVTRV288 EQU   CVTRV280                                                 02978000
CVTRV287 EQU   CVTRV280                                                 02979000
CVTRV286 EQU   CVTRV280                                                 02980000
CVTRV285 EQU   CVTRV280                                                 02981000
CVTRV284 EQU   CVTRV280                                                 02982000
CVTRV283 EQU   CVTRV280                                                 02983000
CVTRV282 EQU   CVTRV280                                                 02984000
CVTRV281 EQU   CVTRV280                                                 02985000
CVTRV279 EQU   CVTRV271                                                 02986000
CVTRV278 EQU   CVTRV271                                                 02987000
CVTRV277 EQU   CVTRV271                                                 02988000
CVTRV276 EQU   CVTRV271                                                 02989000
CVTRV275 EQU   CVTRV271                                                 02990000
CVTRV274 EQU   CVTRV271                                                 02991000
CVTRV273 EQU   CVTRV271                                                 02992000
CVTRV272 EQU   CVTRV271                                                 02993000
CVTRV270 EQU   CVTRV262                                                 02994000
CVTRV269 EQU   CVTRV262                                                 02995000
CVTRV268 EQU   CVTRV262                                                 02996000
CVTRV267 EQU   CVTRV262                                                 02997000
CVTRV266 EQU   CVTRV262                                                 02998000
CVTRV265 EQU   CVTRV262                                                 02999000
CVTRV264 EQU   CVTRV262                                                 03000000
CVTRV263 EQU   CVTRV262                                                 03001000
CVTVFP   EQU   CVTS01+464                                               03002000
CVTVSI   EQU   CVTS01+460                                               03003000
CVTVPSIB EQU   CVTS01+456                                               03004000
CVTMFACT EQU   CVTMFRTR                                                 03005000
CVTMFCTL EQU   CVTS01+448                                               03006000
CVTPVBP  EQU   CVTS01+444                                               03007000
CVTPWI   EQU   CVTS01+440                                               03008000
CVTRV254 EQU   CVTS01+438                                               03009000
CVTRV253 EQU   CVTS01+436                                               03010000
CVTRV252 EQU   CVTS01+434                                               03011000
CVTRV251 EQU   CVTS01+433                                               03012000
CVTRV250 EQU   CVTS01+432                                               03013000
CVTRV249 EQU   CVTS01+431                                               03014000
CVTRV248 EQU   CVTS01+430                                               03015000
CVTRV247 EQU   CVTS01+429                                               03016000
CVTRV246 EQU   CVTS01+428                                               03017000
CVTRV245 EQU   CVTRV237                                                 03018000
CVTRV244 EQU   CVTRV237                                                 03019000
CVTRV243 EQU   CVTRV237                                                 03020000
CVTRV242 EQU   CVTRV237                                                 03021000
CVTRV241 EQU   CVTRV237                                                 03022000
CVTRV240 EQU   CVTRV237                                                 03023000
CVTRV239 EQU   CVTRV237                                                 03024000
CVTRV238 EQU   CVTRV237                                                 03025000
CVTRV236 EQU   CVTRV228                                                 03026000
CVTRV235 EQU   CVTRV228                                                 03027000
CVTRV234 EQU   CVTRV228                                                 03028000
CVTRV233 EQU   CVTRV228                                                 03029000
CVTRV232 EQU   CVTRV228                                                 03030000
CVTRV231 EQU   CVTRV228                                                 03031000
CVTRV230 EQU   CVTRV228                                                 03032000
CVTRV229 EQU   CVTRV228                                                 03033000
CVTRV227 EQU   CVTRV219                                                 03034000
CVTRV226 EQU   CVTRV219                                                 03035000
CVTRV225 EQU   CVTRV219                                                 03036000
CVTRV224 EQU   CVTRV219                                                 03037000
CVTRV223 EQU   CVTRV219                                                 03038000
CVTRV222 EQU   CVTRV219                                                 03039000
CVTRV221 EQU   CVTRV219                                                 03040000
CVTRV220 EQU   CVTRV219                                                 03041000
CVTRV218 EQU   CVTRV210                                                 03042000
CVTRV217 EQU   CVTRV210                                                 03043000
CVTRV216 EQU   CVTRV210                                                 03044000
CVTRV215 EQU   CVTRV210                                                 03045000
CVTRV214 EQU   CVTRV210                                                 03046000
CVTRV213 EQU   CVTRV210                                                 03047000
CVTRV212 EQU   CVTRV210                                                 03048000
CVTRV211 EQU   CVTRV210                                                 03049000
CVTLCCAT EQU   CVTS01+420                                               03050000
CVTPCCAT EQU   CVTS01+416                                               03051000
CVTIPCRP EQU   CVTS01+412                                               03052000
CVTIPCRI EQU   CVTS01+408                                               03053000
CVTIPCDS EQU   CVTS01+404                                               03054000
CVTAIDVT EQU   CVTS01+400                                               03055000
CVTSSAP  EQU   CVTS01+396                                               03056000
CVTEHCIR EQU   CVTS01+392                                               03057000
CVTEHDEF EQU   CVTS01+388                                               03058000
CVTDAIR  EQU   CVTS01+384                                               03059000
CVTPERFM EQU   CVTS01+380                                               03060000
CVT044R2 EQU   CVTS01+376                                               03061000
CVTFETCH EQU   CVTS01+372                                               03062000
CVTRSTWD EQU   CVTS01+368                                               03063000
CVTSPOST EQU   CVTS01+364                                               03064000
CVTIOBP  EQU   CVTS01+360                                               03065000
CVTASMVT EQU   CVTS01+356                                               03066000
CVTRECRQ EQU   CVTS01+352                                               03067000
CVTWSAC  EQU   CVTS01+348                                               03068000
CVTRV149 EQU   CVTS01+344                                               03069000
CVTWSAL  EQU   CVTS01+340                                               03070000
CVTSPSA  EQU   CVTS01+336                                               03071000
CVTGLMN  EQU   CVTS01+332                                               03072000
CVTVEAC0 EQU   CVTS01+328                                               03073000
CVT062R1 EQU   CVTS01+324                                               03074000
CVTRPOST EQU   CVTS01+320                                               03075000
CVTDQIQE EQU   CVTS01+316                                               03076000
CVTCSD   EQU   CVTS01+312                                               03077000
CVTLKRMA EQU   CVTS01+308                                               03078000
CVTRSPIE EQU   CVTS01+304                                               03079000
CVTRENQ  EQU   CVTS01+300                                               03080000
CVTLQCB  EQU   CVTS01+296                                               03081000
CVTFQCB  EQU   CVTS01+292                                               03082000
CVTQCS01 EQU   CVTS01+288                                               03083000
CVTAPFT  EQU   CVTS01+284                                               03084000
CVTPARRL EQU   CVTS01+280                                               03085000
CVTVWAIT EQU   CVTS01+276                                               03086000
CVTGSPL  EQU   CVTS01+272                                               03087000
CVTLSMQ  EQU   CVTS01+268                                               03088000
CVTGSMQ  EQU   CVTS01+264                                               03089000
CVTEXPRO EQU   CVTS01+260                                               03090000
CVTOPCTP EQU   CVTS01+256                                               03091000
CVTSIC   EQU   CVTS01+252                                               03092000
CVTTPIOS EQU   CVTS01+248                                               03093000
CVTRTMS  EQU   CVTS01+244                                               03094000
CVTSDBF  EQU   CVTS01+240                                               03095000
CVTSCBP  EQU   CVTS01+236                                               03096000
CVTSDMP  EQU   CVTS01+232                                               03097000
CVTSV60  EQU   CVTS01+228                                               03098000
CVTRTMCT EQU   CVTS01+224                                               03099000
CVTASCBL EQU   CVTS01+220                                               03100000
CVTASCBH EQU   CVTS01+216                                               03101000
CVTGDA   EQU   CVTS01+212                                               03102000
CVTASVT  EQU   CVTS01+208                                               03103000
CVTVVMDI EQU   CVTS01+204                                               03104000
CVTAQTOP EQU   CVTS01+200                                               03105000
CVTIOSCS EQU   CVTS01+196                                               03106000
CVTSDRM  EQU   CVTS01+192                                               03107000
CVTOPTE  EQU   CVTS01+188                                               03108000
CVTSTXU  EQU   CVTS01+184                                               03109000
CVTQUIS  EQU   CVTS01+180                                               03110000
CVTPARS  EQU   CVTS01+176                                               03111000
CVTS1EE  EQU   CVTS01+172                                               03112000
CVTFRAS  EQU   CVTS01+168                                               03113000
CVTQSAS  EQU   CVTS01+164                                               03114000
CVTCRAS  EQU   CVTS01+160                                               03115000
CVTCRMN  EQU   CVTS01+156                                               03116000
CVTDELCP EQU   CVTS01+152                                               03117000
CVTFRECL EQU   CVTS01+148                                               03118000
CVTGETCL EQU   CVTS01+144                                               03119000
CVTBLDCP EQU   CVTS01+140                                               03120000
CVTAUTHL EQU   CVTS01+136                                               03121000
CVTSCAN  EQU   CVTS01+132                                               03122000
CVTRV144 EQU   CVTS01+130                                               03123000
CVTMAXMP EQU   CVTS01+128                                               03124000
CVTSTCK  EQU   CVTS01+124                                               03125000
CVTRV139 EQU   CVTS01+123                                               03126000
CVTDSSAC EQU   CVTS01+122                                               03127000
CVTRV513 EQU   CVTS01+121                                               03128000
CVTIOSPL EQU   CVTS01+120                                               03129000
CVTPTGT  EQU   CVTS01+116                                               03130000
CVTCSPIE EQU   CVTS01+112                                               03131000
CVTSMFEX EQU   CVTS01+108                                               03132000
CVTOLT0A EQU   CVTS01+104                                               03133000
CVTSRBRT EQU   CVTS01+100                                               03134000
CVTPUTL  EQU   CVTS01+96                                                03135000
CVTASCRL EQU   CVTS01+92                                                03136000
CVTASCRF EQU   CVTS01+88                                                03137000
CVTRV326 EQU   CVTS01+84                                                03138000
CVTRV325 EQU   CVTS01+80                                                03139000
CVTRV324 EQU   CVTS01+76                                                03140000
CVT0VL01 EQU   CVTS01+72                                                03141000
CVTSHRVM EQU   CVTS01+68                                                03142000
CVTRV332 EQU   CVTS01+64                                                03143000
CVTTAS   EQU   CVTS01+60                                                03144000
CVTRSCN  EQU   CVTS01+56                                                03145000
CVTTRAC2 EQU   CVTS01+54                                                03146000
CVTTRACE EQU   CVTS01+52                                                03147000
CVTAPG   EQU   CVTS01+51                                                03148000
CVTSDTRC EQU   CVTCTLFG                                                 03149000
CVTGTRCE EQU   CVTCTLFG                                                 03150000
CVTNOMP  EQU   CVTCTLFG                                                 03151000
CVTRSV79 EQU   CVTCTLFG                                                 03152000
CVTDSTAT EQU   CVTCTLFG                                                 03153000
CVTRSV78 EQU   CVTCTLFG                                                 03154000
CVTRV333 EQU   CVTCTLFG                                                 03155000
CVTRV323 EQU   CVTCTLFG                                                 03156000
CVTSPVLK EQU   CVTS01+49                                                03157000
CVTRSV77 EQU   CVTS01+48                                                03158000
CVTRV331 EQU   CVTS01+44                                                03159000
CVTRV330 EQU   CVTS01+40                                                03160000
CVTRV329 EQU   CVTS01+36                                                03161000
CVTRV328 EQU   CVTS01+32                                                03162000
CVTRV322 EQU   CVTS01+28                                                03163000
CVTSLID  EQU   CVTSLIDA+1                                               03164000
CVTSYLK  EQU   CVTSLIDA                                                 03165000
CVTRV321 EQU   CVTS01+20                                                03166000
CVTRV320 EQU   CVTS01+16                                                03167000
CVTLPDIR EQU   CVTLPDIA+1                                               03168000
CVTRSV69 EQU   CVTDIRST                                                 03169000
CVTRSV68 EQU   CVTDIRST                                                 03170000
CVTRSV67 EQU   CVTDIRST                                                 03171000
CVTRSV66 EQU   CVTDIRST                                                 03172000
CVTRSV65 EQU   CVTDIRST                                                 03173000
CVTRSV64 EQU   CVTDIRST                                                 03174000
CVTRSV63 EQU   CVTDIRST                                                 03175000
CVTDICOM EQU   CVTDIRST                                                 03176000
CVTPVTP  EQU   CVTS01+8                                                 03177000
CVTLPDSR EQU   CVTS01+4                                                 03178000
CVTGETL  EQU   CVTS01                                                   03179000
UECRVPT4 EQU   ISTUECB+80                                               03180000
UECRVPT3 EQU   ISTUECB+76                                               03181000
UECLGDTA EQU   ISTUECB+72                                               03182000
UECDVTPT EQU   ISTUECB+68                                               03183000
UECVRPL  EQU   UECPLIST+16                                              03184000
UECRSNBT EQU   UECRSNCD+3                                               03185000
@NM00148 EQU   UECRSNCD                                                 03186000
UECDAF   EQU   UECTPNCD+2                                               03187000
UECSAF   EQU   UECTPNCD                                                 03188000
UECRPLAD EQU   UECACB                                                   03189000
UECEXLST EQU   ISTUECB+12                                               03190000
UECFORW  EQU   ISTUECB+4                                                03191000
UECRSV01 EQU   ISTUECB+2                                                03192000
@NM00145 EQU   VS1ABSVE+16                                              03193000
@NM00144 EQU   VS1ABSVE                                                 03194000
@NM00142 EQU   DEVCOD+3                                                 03195000
@NM00141 EQU   DEVCOD+2                                                 03196000
@NM00140 EQU   DEVCOD                                                   03197000
EXITACB  EQU   EXITPRM                                                  03198000
COUNTNM  EQU   WORKFLS+4                                                03199000
@NM00116 EQU   WORKFLS+2                                                03200000
BINUSE   EQU   ISTBIND+36                                               03201000
BINUSEL  EQU   ISTBIND+35                                               03202000
BINPRIM  EQU   ISTBIND+27                                               03203000
BINPRIML EQU   ISTBIND+26                                               03204000
BINRSV05 EQU   ISTBIND+25                                               03205000
BINLUTYP EQU   BINLUP                                                   03206000
BINRSV27 EQU   BINLUP                                                   03207000
BINRSV08 EQU   BINTSU+4                                                 03208000
BINPRUSE EQU   BINPRUSZ                                                 03209000
BINPRUSM EQU   BINPRUSZ                                                 03210000
BINSRUSE EQU   BINSRUSZ                                                 03211000
BINSRUSM EQU   BINSRUSZ                                                 03212000
BINRPACM EQU   BINRPACE                                                 03213000
BINRSV07 EQU   BINRPACE                                                 03214000
BINRSV06 EQU   BINTSU                                                   03215000
BINCONR  EQU   BINCMNP2                                                 03216000
BINRCHN  EQU   BINCMNP2                                                 03217000
BINMDIBK EQU   BINCMNP2                                                 03218000
BINBKFS  EQU   BINCMNP2                                                 03219000
BINRCVR  EQU   BINCMNP2                                                 03220000
BINFMTRM EQU   BINCMNP2                                                 03221000
BINRSV04 EQU   BINCMNP                                                  03222000
BINALT   EQU   BINCMNP                                                  03223000
BINBKTR  EQU   BINCMNP                                                  03224000
BINBRAK  EQU   BINCMNP                                                  03225000
BINFMHD  EQU   BINCMNP                                                  03226000
BINRSV03 EQU   BINCMNP                                                  03227000
BINSSEB  EQU   BINSECP                                                  03228000
BINSCMP  EQU   BINSECP                                                  03229000
BINRSV02 EQU   BINSECP                                                  03230000
BINSCHNR EQU   BINSECP                                                  03231000
BINSMCH  EQU   BINSECP                                                  03232000
BINSCHN  EQU   BINSECP                                                  03233000
BINPSEB  EQU   BINPRIP                                                  03234000
BINPCMP  EQU   BINPRIP                                                  03235000
BINRSV01 EQU   BINPRIP                                                  03236000
BINPCHNR EQU   BINPRIP                                                  03237000
BINPMCH  EQU   BINPRIP                                                  03238000
BINPCHN  EQU   BINPRIP                                                  03239000
BINTS    EQU   ISTBIND+2                                                03240000
BINFM    EQU   ISTBIND+1                                                03241000
BINTYPE  EQU   BINFMTY                                                  03242000
BINFMT   EQU   BINFMTY                                                  03243000
TIEPTR2  EQU   TIERPHA                                                  03244000
TIEPTR1  EQU   TIESNA                                                   03245000
TIEGATE  EQU   TIETIEA                                                  03246000
TIEREQ   EQU   ISTTIE+3                                                 03247000
ATCAOS   EQU   ISTATCVT+1584                                            03248000
ATCPOPAB EQU   ATCAOSM+640                                              03249000
ATCVIOPM EQU   ATCAOSM+636                                              03250000
ATCTPMMI EQU   ATCAOSM+632                                              03251000
ATCTPMPB EQU   ATCAOSM+600                                              03252000
ATCRSV88 EQU   ATCAOSM+596                                              03253000
ATCRPLCT EQU   ATCAOSM+594                                              03254000
ATCCRACT EQU   ATCAOSM+592                                              03255000
ATCSRBCT EQU   ATCAOSM+590                                              03256000
ATCRSV75 EQU   ATCAOSM+589                                              03257000
ATCRSV66 EQU   ATCZFLAG                                                 03258000
ATCZF001 EQU   ATCZFLAG                                                 03259000
ATCTPCP1 EQU   ATCAOSM+584                                              03260000
ATCTPCP0 EQU   ATCAOSM+580                                              03261000
ATCAICTN EQU   ATCAOSM+576                                              03262000
ATCZR01  EQU   ATCAOSM+572                                              03263000
ATCMPLTA EQU   ATCAOSM+568                                              03264000
ATCASCB  EQU   ATCAOSM+564                                              03265000
ATCAP86  EQU   ATCAOSM+560                                              03266000
ATCAP85  EQU   ATCAOSM+556                                              03267000
ATCAP84  EQU   ATCAOSM+552                                              03268000
ATCAP83  EQU   ATCAOSM+548                                              03269000
ATCAP82  EQU   ATCAOSM+544                                              03270000
ATCAP69  EQU   ATCAOSM+540                                              03271000
ATCAP66  EQU   ATCAOSM+536                                              03272000
ATCAP62  EQU   ATCAOSM+532                                              03273000
ATCAPC59 EQU   ATCAOSM+528                                              03274000
ATCAP56  EQU   ATCAOSM+524                                              03275000
ATCAP55  EQU   ATCAOSM+520                                              03276000
ATCRCFY0 EQU   ATCAOSM+516                                              03277000
ATCAP41  EQU   ATCAOSM+512                                              03278000
ATCAPC25 EQU   ATCAOSM+508                                              03279000
ATCAP23  EQU   ATCAOSM+504                                              03280000
ATCTPSPB EQU   ATCAOSM+472                                              03281000
ATCTRMPB EQU   ATCAOSM+440                                              03282000
ATCAPBE  EQU   ATCAOSM+436                                              03283000
ATCPSTA  EQU   ATCAOSM+432                                              03284000
ATCSMABF EQU   ATCAOSM+428                                              03285000
ATCSMAPR EQU   ATCAOSM+424                                              03286000
ATCTPWQA EQU   ATCAOSM+420                                              03287000
ATCSMAID EQU   ATCAOSM+416                                              03288000
ATCSMARA EQU   ATCAOSM+412                                              03289000
ATCCACXA EQU   ATCAOSM+408                                              03290000
ATCZLAAB EQU   ATCAOSM+404                                              03291000
ATCATA10 EQU   ATCAOSM+400                                              03292000
ATCHLTCB EQU   ATCAOSM+396                                              03293000
@NM00115 EQU   ATCVTFLG                                                 03294000
ATCVTACT EQU   ATCVTFLG                                                 03295000
ATCRPT40 EQU   ATCAOSM+388                                              03296000
ATCRPT39 EQU   ATCAOSM+384                                              03297000
ATCRPT38 EQU   ATCAOSM+380                                              03298000
ATCRPT37 EQU   ATCAOSM+376                                              03299000
ATCRPT36 EQU   ATCAOSM+372                                              03300000
ATCRPT35 EQU   ATCAOSM+368                                              03301000
ATCRPT34 EQU   ATCAOSM+364                                              03302000
ATCRPT33 EQU   ATCAOSM+360                                              03303000
ATCRPT32 EQU   ATCAOSM+356                                              03304000
ATCRPT31 EQU   ATCAOSM+352                                              03305000
ATCRPT30 EQU   ATCAOSM+348                                              03306000
ATCRPT29 EQU   ATCAOSM+344                                              03307000
ATCRPT28 EQU   ATCAOSM+340                                              03308000
ATCRPT27 EQU   ATCAOSM+336                                              03309000
@NM00114 EQU   ATCAOSM+333                                              03310000
@NM00113 EQU   @NM00112                                                 03311000
ATCSNUF  EQU   @NM00112                                                 03312000
ATCOPKL  EQU   @NM00112                                                 03313000
ATCABEN  EQU   @NM00112                                                 03314000
ATCAIWT  EQU   ATCAOSM+328                                              03315000
ATCINFDD EQU   ATCAOSM+324                                              03316000
ATCORFMG EQU   ATCAOSM+320                                              03317000
ATCORFRL EQU   ATCAOSM+316                                              03318000
ATCOROBT EQU   ATCAOSM+312                                              03319000
ATCORQG  EQU   ATCORSRB                                                 03320000
ATCORTBF EQU   ATCSQAFR                                                 03321000
ATCRPLAC EQU   ATCRPLCN+2                                               03322000
ATCRPLRC EQU   ATCRPLCN                                                 03323000
ATCCRPLQ EQU   ATCCRPL                                                  03324000
ATCSRBAC EQU   ATCSRBCN+2                                               03325000
ATCSRBRC EQU   ATCSRBCN                                                 03326000
ATCSRBQ  EQU   ATCSRB                                                   03327000
ATCCRAAC EQU   ATCCRACN+2                                               03328000
ATCCRARC EQU   ATCCRACN                                                 03329000
ATCCRAQ  EQU   ATCCRA                                                   03330000
ATCRPT12 EQU   ATCAOSM+276                                              03331000
ATCDMAPP EQU   ATCAOSM+272                                              03332000
ATCAP38  EQU   ATCAOSM+268                                              03333000
ATCZDFJ0 EQU   ATCAOSM+260                                              03334000
ATCAP51  EQU   ATCAOSM+256                                              03335000
ATCZPAB2 EQU   ATCAOSM+224                                              03336000
ATCZPAB1 EQU   ATCAOSM+192                                              03337000
ATCZLFVT EQU   ATCAOSM+188                                              03338000
ATCZLPVT EQU   ATCAOSM+184                                              03339000
ATCZDVTX EQU   ATCAOSM+180                                              03340000
ATCZDVTA EQU   ATCAOSM+176                                              03341000
ATCZDVT9 EQU   ATCAOSM+172                                              03342000
ATCZDVT8 EQU   ATCAOSM+168                                              03343000
ATCZDVT7 EQU   ATCAOSM+164                                              03344000
ATCRSV56 EQU   ATCDAPVT+22                                              03345000
ATCDAPDG EQU   ATCDAPVT+20                                              03346000
ATCDXCEA EQU   ATCDAPVT+16                                              03347000
ATCDCEA  EQU   ATCDAPVT+12                                              03348000
ATCDPCIA EQU   ATCDAPVT+8                                               03349000
ATCDSIOA EQU   ATCDAPVT+4                                               03350000
ATCDEOEA EQU   ATCDAPVT                                                 03351000
ATCZLAEA EQU   ATCLDAPP+16                                              03352000
ATCZLCEA EQU   ATCLDAPP+12                                              03353000
ATCRSV17 EQU   ATCLDAPP+8                                               03354000
ATCSMFRR EQU   ATCLDAPP+4                                               03355000
ATCCDTID EQU   ATCLDAPP                                                 03356000
ATCZAEA  EQU   ATCICAPP+16                                              03357000
ATCZCEA  EQU   ATCICAPP+12                                              03358000
ATCCDTCB EQU   ATCICAPP+8                                               03359000
ATCZSIOA EQU   ATCICAPP+4                                               03360000
ATCCDRPH EQU   ATCICAPP                                                 03361000
ATCAP65  EQU   ATCAOSM+96                                               03362000
ATCZDVT6 EQU   ATCAOSM+92                                               03363000
ATCZDVT4 EQU   ATCAOSM+88                                               03364000
ATCZDVT3 EQU   ATCAOSM+84                                               03365000
ATCZDVT1 EQU   ATCAOSM+80                                               03366000
ATCICNCB EQU   ATCAOSM+76                                               03367000
ATCZPSVT EQU   ATCAOSM+72                                               03368000
ATCZFSVT EQU   ATCAOSM+68                                               03369000
ATCAP64  EQU   ATCAOSM+64                                               03370000
ATCAP63  EQU   ATCAOSM+60                                               03371000
ATCAP61  EQU   ATCAOSM+56                                               03372000
ATCAP58  EQU   ATCAOSM+52                                               03373000
ATCAP57  EQU   ATCAOSM+48                                               03374000
ATCAP54  EQU   ATCAOSM+44                                               03375000
ATCAP53  EQU   ATCAOSM+40                                               03376000
ATCAP52  EQU   ATCAOSM+36                                               03377000
ATCAP32  EQU   ATCAOSM+28                                               03378000
ATCAP12  EQU   ATCAOSM+20                                               03379000
ATCAP11  EQU   ATCAOSM+16                                               03380000
ATCCMTCB EQU   ATCAOSM+12                                               03381000
ATCPRPH  EQU   ATCAOSM+8                                                03382000
ATCGSRBF EQU   ATCGSRBG                                                 03383000
ATCSRBRT EQU   ATCAOSM                                                  03384000
@NM00111 EQU   @NM00110                                                 03385000
ATCVTMAB EQU   @NM00110                                                 03386000
@NM00109 EQU   ATCVTBAM                                                 03387000
ATCVDLOK EQU   ISTATCVT+904                                             03388000
ATCVFPAB EQU   ISTATCVT+872                                             03389000
ATCVDPAB EQU   ISTATCVT+840                                             03390000
ATCIOECB EQU   ISTATCVT+836                                             03391000
ATCINCW3 EQU   ISTATCVT+832                                             03392000
ATCMODTB EQU   ISTATCVT+828                                             03393000
ATCUSSPT EQU   ISTATCVT+824                                             03394000
ATCSRTAB EQU   ISTATCVT+820                                             03395000
@NM00108 EQU   ISTATCVT+819                                             03396000
@NM00107 EQU   ATCSTAT2                                                 03397000
ATCTRSMS EQU   ATCSTAT2                                                 03398000
ATCTRLOK EQU   ATCSTAT2                                                 03399000
ATCTRPSS EQU   ATCSTAT2                                                 03400000
ATCTRESC EQU   ATCSTAT2                                                 03401000
ATCTRAPI EQU   ATCSTAT2                                                 03402000
ATCNMCTR EQU   ISTATCVT+816                                             03403000
ATCSEC51 EQU   ATCSECST                                                 03404000
ATCSEC40 EQU   ATCSIPD+8                                                03405000
ATCSEC30 EQU   ATCSIPD+4                                                03406000
ATCSEC21 EQU   ATCSIPD                                                  03407000
ATCSEC10 EQU   ATCSOPD+4                                                03408000
ATCSEC01 EQU   ATCSOPD                                                  03409000
ATCPOIA  EQU   ATCRNO+1                                                 03410000
@NM00106 EQU   ATCRNO                                                   03411000
ATCPODVT EQU   ISTATCVT+784                                             03412000
ATCS49XL EQU   ISTATCVT+780                                             03413000
ATCS49XI EQU   ISTATCVT+776                                             03414000
ATCLCLCT EQU   ATCVLCNT+2                                               03415000
ATCRNCNT EQU   ATCVLCNT                                                 03416000
ATCCFEAD EQU   ISTATCVT+768                                             03417000
ATCPTR00 EQU   ISTATCVT+736                                             03418000
ATCRSV10 EQU   ISTATCVT+704                                             03419000
ATCVTINM EQU   ISTATCVT+696                                             03420000
ATCTCLIM EQU   ISTATCVT+692                                             03421000
ATCTCLOM EQU   ISTATCVT+688                                             03422000
ATCVTIPB EQU   ISTATCVT+656                                             03423000
ATCTCIPB EQU   ISTATCVT+624                                             03424000
ATCOCCCB EQU   ISTATCVT+588                                             03425000
ATCOCCOB EQU   ISTATCVT+584                                             03426000
ATCCDLAD EQU   ISTATCVT+580                                             03427000
ATCCCLAD EQU   ISTATCVT+576                                             03428000
ATCDLRPB EQU   ISTATCVT+544                                             03429000
ATCPGPAB EQU   ISTATCVT+512                                             03430000
ATCVPAB1 EQU   ISTATCVT+480                                             03431000
ATCRSV97 EQU   ISTATCVT+476                                             03432000
ATCRDTLK EQU   ISTATCVT+472                                             03433000
ATCVOCLK EQU   ISTATCVT+468                                             03434000
ATCCDFDN EQU   ISTATCVT+464                                             03435000
ATCCDFIN EQU   ISTATCVT+460                                             03436000
ATCDVTLK EQU   ISTATCVT+456                                             03437000
ATCAP36  EQU   ISTATCVT+452                                             03438000
ATCAP35  EQU   ISTATCVT+448                                             03439000
ATCAP33  EQU   ISTATCVT+444                                             03440000
ATCRSV99 EQU   ISTATCVT+440                                             03441000
ATCONFIG EQU   ISTATCVT+432                                             03442000
ATCNODDS EQU   ISTATCVT+428                                             03443000
ATCNODEL EQU   ISTATCVT+420                                             03444000
ATCRSV69 EQU   ISTATCVT+416                                             03445000
ATCAPCR5 EQU   ISTATCVT+412                                             03446000
ATCLDECB EQU   ISTATCVT+408                                             03447000
ATCLDNCS EQU   ISTATCVT+404                                             03448000
ATCCDPTR EQU   ISTATCVT+400                                             03449000
ATCADEL  EQU   ISTATCVT+396                                             03450000
ATCDEBCH EQU   ISTATCVT+388                                             03451000
ATCHBSIZ EQU   ATCHPGM+2                                                03452000
ATCHBFNO EQU   ATCHPGM                                                  03453000
ATCCRME  EQU   ISTATCVT+380                                             03454000
ATCRVCHS EQU   ISTATCVT+372                                             03455000
ATCZDVTB EQU   ISTATCVT+364                                             03456000
ATCECPRT EQU   ISTATCVT+360                                             03457000
ATCVTLOD EQU   ISTATCVT+356                                             03458000
ATCTRPAB EQU   ISTATCVT+352                                             03459000
ATCMSGM  EQU   ISTATCVT+348                                             03460000
ATCMSGP  EQU   ISTATCVT+344                                             03461000
ATCEPT   EQU   ISTATCVT+340                                             03462000
ATCDVT   EQU   ISTATCVT+336                                             03463000
ATCTRCPT EQU   ISTATCVT+332                                             03464000
ATCDVLOD EQU   ISTATCVT+328                                             03465000
ATCALERT EQU   ISTATCVT+324                                             03466000
ATCEPA   EQU   ISTATCVT+320                                             03467000
ATCSAF   EQU   ISTATCVT+318                                             03468000
ATCXRANG EQU   ISTATCVT+317                                             03469000
ATCLAST  EQU   ATCSHRFG                                                 03470000
ATCSHRTN EQU   ISTATCVT+308                                             03471000
ATCOCRT  EQU   ISTATCVT+300                                             03472000
ATCCSMA  EQU   ATCCSMR                                                  03473000
ATCESC02 EQU   ISTATCVT+292                                             03474000
ATCESC01 EQU   ISTATCVT+288                                             03475000
ATCCDFND EQU   ISTATCVT+284                                             03476000
ATCCDDEL EQU   ISTATCVT+280                                             03477000
ATCCDADD EQU   ISTATCVT+276                                             03478000
ATCMNT   EQU   ISTATCVT+272                                             03479000
ATCRSV16 EQU   ISTATCVT+270                                             03480000
ATCMAXID EQU   ISTATCVT+269                                             03481000
ATCMSGSP EQU   ATCCOM+268                                               03482000
ATCCIDM  EQU   ATCCOM+266                                               03483000
ATCACTRM EQU   ATCCOM+264                                               03484000
ATCNERAP EQU   ATCCOM+260                                               03485000
ATCNESAL EQU   ATCCOM+256                                               03486000
ATCRCC65 EQU   ATCCOM+252                                               03487000
ATCRCC26 EQU   ATCCOM+248                                               03488000
ATCRCC63 EQU   ATCCOM+244                                               03489000
ATCRSV11 EQU   ATCCOM+242                                               03490000
ATCVTMID EQU   ATCCOM+240                                               03491000
ATCAPOST EQU   ATCCOM+236                                               03492000
ATCNERFN EQU   ATCCOM+232                                               03493000
ATCNERNE EQU   ATCCOM+228                                               03494000
ATCNERCV EQU   ATCCOM+224                                               03495000
ATCNERST EQU   ATCCOM+220                                               03496000
ATCDCC61 EQU   ATCCOM+216                                               03497000
ATCDCC60 EQU   ATCCOM+212                                               03498000
ATCSRTDF EQU   ATCCOM+208                                               03499000
ATCSRTAD EQU   ATCCOM+204                                               03500000
ATCFIRA  EQU   ATCCOM+200                                               03501000
ATCSMBQ  EQU   ATCCOM+196                                               03502000
ATCSMRC  EQU   ATCCOM+192                                               03503000
ATCSMRS  EQU   ATCCOM+188                                               03504000
ATCSMQU  EQU   ATCCOM+184                                               03505000
ATCACDA  EQU   ATCCOM+176                                               03506000
ATCSTMA  EQU   ATCCOM+172                                               03507000
ATCFRSTR EQU   ATCCOM+168                                               03508000
ATCGTSTR EQU   ATCCOM+164                                               03509000
ATCREADA EQU   ATCCOM+160                                               03510000
ATCALOAD EQU   ATCCOM+156                                               03511000
ATCBLDLA EQU   ATCCOM+152                                               03512000
ATCFBRPH EQU   ATCCOM+148                                               03513000
ATCBFTRC EQU   ATCCOM+144                                               03514000
ATCTPBUF EQU   ATCTHTRC                                                 03515000
ATCREMOV EQU   ATCCOM+136                                               03516000
ATCADD   EQU   ATCCOM+132                                               03517000
ATCDVTPT EQU   ATCCOM+124                                               03518000
ATCFEPT  EQU   ATCCOM+120                                               03519000
ATCFDVT  EQU   ATCCOM+116                                               03520000
ATCCONFT EQU   ATCCOM+112                                               03521000
ATCPTCHA EQU   ATCCOM+108                                               03522000
ATCAUTHA EQU   ATCCOM+104                                               03523000
ATCACCTA EQU   ATCCOM+100                                               03524000
ATCRDTH  EQU   ATCCOM+96                                                03525000
ATCFRSCH EQU   ATCCOM+92                                                03526000
ATCFSB   EQU   ATCCOM+88                                                03527000
ATCHLTMS EQU   ATCCOM+84                                                03528000
ATCECPRM EQU   ATCCOM+80                                                03529000
ATCECNET EQU   ATCCOM+76                                                03530000
ATCECOPC EQU   ATCCOM+72                                                03531000
ATCVPARM EQU   ATCCOM+68                                                03532000
ATCECVRQ EQU   ATCCOM+64                                                03533000
ATCECSES EQU   ATCCOM+60                                                03534000
ATCOCHA  EQU   ATCCOM+56                                                03535000
ATCDSPLQ EQU   ATCCOM+52                                                03536000
ATCECDSP EQU   ATCCOM+48                                                03537000
ATCVARYQ EQU   ATCCOM+44                                                03538000
ATCECVRY EQU   ATCCOM+40                                                03539000
ATCHALTQ EQU   ATCCOM+36                                                03540000
ATCECHLT EQU   ATCCOM+32                                                03541000
ATCMODQ  EQU   ATCCOM+28                                                03542000
ATCECMOD EQU   ATCCOM+24                                                03543000
ATCASCHD EQU   ATCCOM+20                                                03544000
ATCSRT   EQU   ATCCOM+16                                                03545000
ATCRDT   EQU   ATCCOM+12                                                03546000
ATCDCFRR EQU   ATCCOM+8                                                 03547000
ATCAPI   EQU   ATCCOM+4                                                 03548000
ATCRSV04 EQU   ATCSTAT4                                                 03549000
ATCVTTRC EQU   ATCSTAT4                                                 03550000
ATCNCSD  EQU   ATCSTAT4                                                 03551000
ATCTPRT  EQU   ATCSTAT4                                                 03552000
ATCPRTAT EQU   ATCSTAT4                                                 03553000
@NM00105 EQU   ATCPOFLG                                                 03554000
ATCPOUNS EQU   ATCPOFLG                                                 03555000
ATCHSDMF EQU   ATCSTFLG                                                 03556000
@NM00104 EQU   ATCSTAT1                                                 03557000
ATCMDHLT EQU   ATCSTAT1                                                 03558000
ATCINHLT EQU   ATCSTAT1                                                 03559000
ATCNETSL EQU   ATCSTAT1                                                 03560000
ATCSTART EQU   ATCSTAT1                                                 03561000
RPHNEXPO EQU   ISTRPH+104                                               03562000
RPHSAV16 EQU   RPHWORK+60                                               03563000
RPHSAV15 EQU   RPHWORK+56                                               03564000
RPHSAV14 EQU   RPHWORK+52                                               03565000
RPHSAV13 EQU   RPHWORK+48                                               03566000
RPHSAV12 EQU   RPHWORK+44                                               03567000
RPHSAV11 EQU   RPHWORK+40                                               03568000
RPHSAV10 EQU   RPHWORK+36                                               03569000
RPHSAVE9 EQU   RPHWORK+32                                               03570000
RPHSAVE8 EQU   RPHWORK+28                                               03571000
RPHSAVE7 EQU   RPHWORK+24                                               03572000
RPHSAVE6 EQU   RPHWORK+20                                               03573000
RPHSAVE5 EQU   RPHWORK+16                                               03574000
RPHSAVE4 EQU   RPHWORK+12                                               03575000
RPHSAVE3 EQU   RPHWORK+8                                                03576000
RPHSAVE2 EQU   RPHWORK+4                                                03577000
RPHSHALF EQU   RPHSAVE1+2                                               03578000
RPHSBIT8 EQU   RPHSBITS                                                 03579000
RPHSBIT7 EQU   RPHSBITS                                                 03580000
RPHSBIT6 EQU   RPHSBITS                                                 03581000
RPHSBIT5 EQU   RPHSBITS                                                 03582000
RPHSBIT4 EQU   RPHSBITS                                                 03583000
RPHSBIT3 EQU   RPHSBITS                                                 03584000
RPHSBIT2 EQU   RPHSBITS                                                 03585000
RPHSBIT1 EQU   RPHSBITS                                                 03586000
RPHSBYTE EQU   RPHSAVE1                                                 03587000
RPHPABQP EQU   RPHPABQA+1                                               03588000
RPHPABFG EQU   RPHPABQA                                                 03589000
RPHCRR   EQU   ISTRPH+32                                                03590000
RPHSRP34 EQU   RPHSRPRM+2                                               03591000
RPHSRP12 EQU   RPHSRPRM                                                 03592000
RPHWEGT  EQU   RPHCSPA                                                  03593000
RPHMAJCB EQU   ISTRPH+21                                                03594000
RPHPABOF EQU   ISTRPH+20                                                03595000
RPHRESUM EQU   RPHRESMA+1                                               03596000
RPHRSV01 EQU   RPHWPFLG                                                 03597000
RPHPURGE EQU   RPHWPFLG                                                 03598000
RPHPT    EQU   RPHWPFLG                                                 03599000
RPHWT    EQU   RPHWPFLG                                                 03600000
RPHRSKEY EQU   RPHWPFLG                                                 03601000
RPHDVTA  EQU   ISTRPH+12                                                03602000
RPHTIK   EQU   RPHTSKID+3                                               03603000
@NM00103 EQU   RPHTSKID                                                 03604000
RPHRPHAP EQU   RPHRPHA+1                                                03605000
@NM00102 EQU   RPHRPHA                                                  03606000
RPHGATE  EQU   RPHRPHA                                                  03607000
@NM00101 EQU   RPHFLGB                                                  03608000
RPHRLCRA EQU   RPHFLGB                                                  03609000
RPHNRSAV EQU   RPHFLGB                                                  03610000
RPHPGCMP EQU   RPHFLGB                                                  03611000
RPHFBAPS EQU   RPHFLGB                                                  03612000
RPHBSSP  EQU   RPHFLGB                                                  03613000
RPHLOCK  EQU   RPHFLGB                                                  03614000
RPHFNFLG EQU   RPHFSTLC                                                 03615000
RPHMLTCP EQU   RPHFLAGS                                                 03616000
RPHSMCLR EQU   RPHFLAGS                                                 03617000
RPHSMTYP EQU   RPHFLAGS                                                 03618000
RPHSMQ   EQU   RPHFLAGS                                                 03619000
RPHAUTEX EQU   RPHAPTYP                                                 03620000
RPHSPGIN EQU   RPHFLAGS                                                 03621000
RPHOGIND EQU   RPHFLAGS                                                 03622000
RPHLNGTH EQU   RPHCNTL+1                                                03623000
RPHTYPE  EQU   RPHCNTL                                                  03624000
DYPRSV01 EQU   ISTDYPAB+12                                              03625000
DYPCHAIN EQU   ISTDYPAB+4                                               03626000
DYPFLGS  EQU   ISTDYPAB+2                                               03627000
DYPLNGTH EQU   ISTDYPAB+1                                               03628000
DYPTYPE  EQU   ISTDYPAB                                                 03629000
LOKXCL   EQU   @NM00099                                                 03630000
LOKPRY   EQU   @NM00099                                                 03631000
@NM00100 EQU   @NM00099                                                 03632000
@NM00098 EQU   LOKCHNG                                                  03633000
LOKCT    EQU   ISTLOK                                                   03634000
PABRPHA  EQU   PABRPHFG+1                                               03635000
PABNODQ  EQU   PABFLAGS                                                 03636000
PABINHBT EQU   PABFLAGS                                                 03637000
PABERLOK EQU   PABERRLK                                                 03638000
PABSSN   EQU   PABFLAGS                                                 03639000
PABDYNAM EQU   PABFLAGS                                                 03640000
PABNORPR EQU   PABFLAGS                                                 03641000
PABPRIOR EQU   PABFLAGS                                                 03642000
PABCHNGP EQU   PABCHAIN+1                                               03643000
PABRSV02 EQU   PABCHAIN                                                 03644000
PABDELAY EQU   PABCHAIN                                                 03645000
PABRUNNG EQU   PABCHAIN                                                 03646000
PABRESET EQU   PABCHAIN                                                 03647000
PABUNCON EQU   PABCHAIN                                                 03648000
PABCDP   EQU   PABCHAIN                                                 03649000
PABRESCH EQU   PABCHAIN                                                 03650000
PABCHNG  EQU   PABCHAIN                                                 03651000
PABWEQP  EQU   PABWEQA+1                                                03652000
PABRSV01 EQU   PABWEQA                                                  03653000
PABWEQG  EQU   PABWEQA                                                  03654000
ISTPDAVP EQU   ISTAVT+40                                                03655000
ISTAVR01 EQU   ISTAVT+38                                                03656000
ISTVTTP  EQU   ISTAVT+36                                                03657000
ISTAGTWT EQU   ISTAVT+34                                                03658000
ISTATRT  EQU   ISTAVT+32                                                03659000
ISTARID  EQU   ISTAVT+30                                                03660000
ISTX1    EQU   ISTAVT+29                                                03661000
ISTPHNM  EQU   ISTAVT+24                                                03662000
ISTAPSEX EQU   ISTAVT+20                                                03663000
ISTVTTIK EQU   ISTAVT+18                                                03664000
AVTASID  EQU   ISTAVT+16                                                03665000
ISTAPSTA EQU   ISTAVT+12                                                03666000
ISTAS53  EQU   ISTAVT+8                                                 03667000
ISTAHIP  EQU   ISTAS49                                                  03668000
ISTACVT  EQU   ISTAVT                                                   03669000
NIBRESV  EQU   ISTNIB+60                                                03670000
NIBEXLST EQU   ISTNIB+44                                                03671000
NIBLIMIT EQU   ISTNIB+42                                                03672000
@NM00097 EQU   ISTNIB+41                                                03673000
@NM00096 EQU   NIBFLG1                                                  03674000
@NM00095 EQU   NIBFLG1                                                  03675000
@NM00094 EQU   NIBFLG1                                                  03676000
@NM00093 EQU   NIBFLG1                                                  03677000
NIBSHLTP EQU   NIBFLG1                                                  03678000
NIBSDAPP EQU   NIBFLG1                                                  03679000
NIBCON   EQU   NIBFLG1                                                  03680000
NIBLAST  EQU   NIBFLG1                                                  03681000
NIBPROCD EQU   ISTNIB+36                                                03682000
NIBDEVCH EQU   ISTNIB+28                                                03683000
NIBCID   EQU   ISTNIB+4                                                 03684000
NIBLEN   EQU   ISTNIB+3                                                 03685000
NIBCONDN EQU   ISTNIB+2                                                 03686000
NIBRSV01 EQU   ISTNIB+1                                                 03687000
NIBID    EQU   ISTNIB                                                   03688000
PROSRDEF EQU   PROSETM4                                                 03689000
PRORSV47 EQU   PROSETM4                                                 03690000
PROSCON  EQU   PROSETM4                                                 03691000
PRORSV46 EQU   PROSETM3                                                 03692000
PROSMONT EQU   PROSETM3                                                 03693000
PRORSV45 EQU   PROSETM3                                                 03694000
PROSNTO  EQU   PROSETM3                                                 03695000
PRORSV44 EQU   PROSETM3                                                 03696000
PROCPUID EQU   PROSETM3                                                 03697000
PRORSV43 EQU   PROSETM2                                                 03698000
PROSNTFL EQU   PROSETM2                                                 03699000
PRORSV42 EQU   PROSETM2                                                 03700000
PRORSV41 EQU   PROPROCS                                                 03701000
PROMODC  EQU   PROPROC4                                                 03702000
PROMODT  EQU   PROPROC4                                                 03703000
PROMODM  EQU   PROPROC4                                                 03704000
PROMODB  EQU   PROPROC4                                                 03705000
PRORSV14 EQU   PROPROC4                                                 03706000
PRORSV13 EQU   PROPROC4                                                 03707000
PRORSV12 EQU   PROPROC4                                                 03708000
PROEIB   EQU   PROPROC4                                                 03709000
PROMONT3 EQU   PROPROC3                                                 03710000
PROMONT2 EQU   PROPROC3                                                 03711000
PROMONIT EQU   PROPROC3                                                 03712000
PROSUBLK EQU   PROPROC3                                                 03713000
PRONTO   EQU   PROPROC3                                                 03714000
PROLGIN  EQU   PROPROC3                                                 03715000
PROERPI  EQU   PROPROC3                                                 03716000
PRORSV07 EQU   PROPROC3                                                 03717000
PROCFTX  EQU   PROPROC2                                                 03718000
PROEMLC  EQU   PROPROC2                                                 03719000
PRONTFL  EQU   PROPROC2                                                 03720000
PRORSV05 EQU   PROPROC2                                                 03721000
PRORSV04 EQU   PROPROC2                                                 03722000
PROLGOT  EQU   PROPROC2                                                 03723000
PROERPO  EQU   PROPROC2                                                 03724000
PRORSV03 EQU   PROPROC2                                                 03725000
PRORPLC  EQU   PROPROC1                                                 03726000
PROCS    EQU   PROPROC1                                                 03727000
PROCA    EQU   PROPROC1                                                 03728000
PRORESPX EQU   PROPROC1                                                 03729000
PRODFASY EQU   PROPROC1                                                 03730000
PROXPOPT EQU   PROPROC1                                                 03731000
PROTRUNC EQU   PROPROC1                                                 03732000
PROASYIP EQU   PROPROC1                                                 03733000
SVECC010 EQU   TOLTEPWA+3952                                            03734000
SVETC035 EQU   TOLTEPWA+3880                                            03735000
SVESC030 EQU   TOLTEPWA+3808                                            03736000
SVESC020 EQU   TOLTEPWA+3664                                            03737000
SVEIC002 EQU   TOLTEPWA+3520                                            03738000
SVECC014 EQU   TOLTEPWA+3376                                            03739000
SVESC120 EQU   TOLTEPWA+3304                                            03740000
SVESC025 EQU   TOLTEPWA+3088                                            03741000
@NM00092 EQU   TOLTEPWA+2980                                            03742000
$RPLERR  EQU   TOLTEPWA+2977                                            03743000
@NM00091 EQU   TOLTEPWA+2976                                            03744000
$R13PR3  EQU   TOLTEPWA+2972                                            03745000
$CEINT2  EQU   TOLTEPWA+2968                                            03746000
$CEINT1  EQU   TOLTEPWA+2964                                            03747000
$MSGGET  EQU   TOLTEPWA+2960                                            03748000
$ACQLIST EQU   TOLTEPWA+2956                                            03749000
$R4SAVE1 EQU   TOLTEPWA+2952                                            03750000
$CLSISS  EQU   TOLTEPWA+2950                                            03751000
$CLSCNT  EQU   TOLTEPWA+2948                                            03752000
$CUTABLE EQU   TOLTEPWA+2868                                            03753000
$BUFSZ2  EQU   TOLTEPWA+2864                                            03754000
$RESID2  EQU   TOLTEPWA+2860                                            03755000
$OLTCCW2 EQU   TOLTEPWA+2856                                            03756000
$ENDBFR2 EQU   TOLTEPWA+2852                                            03757000
$1STBFR2 EQU   TOLTEPWA+2848                                            03758000
$TECB2   EQU   TOLTEPWA+2844                                            03759000
$BUFSZ1  EQU   TOLTEPWA+2840                                            03760000
$RESID1  EQU   TOLTEPWA+2836                                            03761000
$OLTCCW1 EQU   TOLTEPWA+2832                                            03762000
$ENDBFR1 EQU   TOLTEPWA+2828                                            03763000
$1STBFR1 EQU   TOLTEPWA+2824                                            03764000
$TECB1   EQU   TOLTEPWA+2820                                            03765000
$WAITIME EQU   TOLTEPWA+2816                                            03766000
$TRTN#   EQU   TOLTEPWA+2815                                            03767000
$WIODEV  EQU   TOLTEPWA+2814                                            03768000
$RQSTSZE EQU   TOLTEPWA+2812                                            03769000
$RQSTPTR EQU   TOLTEPWA+2808                                            03770000
$R4SAVE  EQU   TOLTEPWA+2804                                            03771000
$PARTADR EQU   TOLTEPWA+2800                                            03772000
$TBSDATA EQU   TOLTEPWA+2796                                            03773000
$CTWIDTH EQU   TOLTEPWA+2795                                            03774000
$CTLINE  EQU   TOLTEPWA+2794                                            03775000
$APWIDTH EQU   TOLTEPWA+2793                                            03776000
$APLINE  EQU   TOLTEPWA+2792                                            03777000
$INDEX   EQU   $IMITX                                                   03778000
$UMXX    EQU   @NM00090+14                                              03779000
$NSXX    EQU   @NM00090+12                                              03780000
$ATACNT  EQU   $NSCNT                                                   03781000
$CTR     EQU   @NM00090+8                                               03782000
$ATAPTR  EQU   $NSPTR                                                   03783000
$DDRPTR  EQU   @NM00090                                                 03784000
$DTORESP EQU   TOLTEPWA+2712                                            03785000
$APNAME  EQU   TOLTEPWA+2704                                            03786000
$24SYMNE EQU   $24CATMG+4                                               03787000
$24DEVAD EQU   $24CATMG                                                 03788000
$24RTN#  EQU   $24FEMSG+8                                               03789000
$ESECTID EQU   $24FEMSG                                                 03790000
$24FLGS  EQU   TOLTEPWA+2680                                            03791000
$24SAVE2 EQU   TOLTEPWA+2676                                            03792000
$24SAVE1 EQU   TOLTEPWA+2672                                            03793000
$24UNADR EQU   TOLTEPWA+2668                                            03794000
$24SAV13 EQU   TOLTEPWA+2664                                            03795000
$24RETCD EQU   TOLTEPWA+2663                                            03796000
$MACID   EQU   TOLTEPWA+2661                                            03797000
$CSPARE  EQU   $CFLGS                                                   03798000
$C2WAY   EQU   $CFLGS                                                   03799000
$CINCT   EQU   $CCOMDAT+12                                              03800000
$CINADR  EQU   $CCOMDAT+8                                               03801000
$COUTCT  EQU   $CCOMDAT+4                                               03802000
$COUTAD  EQU   $CCOMDAT                                                 03803000
ROOTLOC  EQU   TOLTEPWA+2640                                            03804000
$RETREG  EQU   TOLTEPWA+2636                                            03805000
$WORK    EQU   TOLTEPWA+2376                                            03806000
$EXTA    EQU   TOLTEPWA+2320                                            03807000
$PASSONA EQU   TOLTEPWA+2264                                            03808000
$TRMINPT EQU   TOLTEPWA+2184                                            03809000
$INBUFR  EQU   TOLTEPWA+2104                                            03810000
$BUFFER  EQU   TOLTEPWA+1976                                            03811000
$TLTRPL3 EQU   TOLTEPWA+1856                                            03812000
$TLTRPL2 EQU   TOLTEPWA+1736                                            03813000
@NM00089 EQU   $SLTBL+135                                               03814000
$HIGHRTN EQU   $SLTBL+134                                               03815000
$PRIMADR EQU   $SLTBL+130                                               03816000
$CTSTPT  EQU   $SLTBL+128                                               03817000
$TSTCNT  EQU   $SLTBL+126                                               03818000
$SECFLGS EQU   $SECLST+3                                                03819000
$SECTION EQU   $SECLST                                                  03820000
$SECACT  EQU   $TESTFLG                                                 03821000
$CANTRUN EQU   $TESTFLG                                                 03822000
$FINAL   EQU   $TESTFLG                                                 03823000
$TESTSUF EQU   $RUNTEST+5                                               03824000
$TESTNUM EQU   $RUNTEST+1                                               03825000
$LETPRF  EQU   $RUNTEST                                                 03826000
$SYMBOLC EQU   $SLTBL+5                                                 03827000
$FAMILY  EQU   $SLTBL                                                   03828000
$CDEVPT  EQU   TOLTEPWA+1466                                            03829000
$WTISUED EQU   $DEVFLG4                                                 03830000
$EXIOISD EQU   $DEVFLG4                                                 03831000
$REMWRIT EQU   $DEVFLG4                                                 03832000
$REMDONE EQU   $DEVFLG4                                                 03833000
$2NDUSED EQU   $DEVFLG4                                                 03834000
$1STUSED EQU   $DEVFLG4                                                 03835000
$IGLXIFB EQU   $DEVFLG4                                                 03836000
$EXIOLV3 EQU   $DEVFLG4                                                 03837000
@NM00088 EQU   $DEVFLG5                                                 03838000
$ASCII   EQU   $DEVFLG5                                                 03839000
$OPNDFAL EQU   $DEVFLG5                                                 03840000
$ACQNCB  EQU   $DEVFLG5                                                 03841000
$REMOTE  EQU   $DEVFLG5                                                 03842000
$ENDNODE EQU   $DEVFLG5                                                 03843000
$LINENME EQU   $RNINFO                                                  03844000
$DVCOL   EQU   $LDNCBPT+2                                               03845000
$DVROW   EQU   $LDNCBPT                                                 03846000
$NCSPLP  EQU   $DEVTBLE+44                                              03847000
$DVLN    EQU   $SSCPDAF                                                 03848000
$DAF     EQU   $DEVSESP+4                                               03849000
$VARYPAB EQU   $DEVSESP                                                 03850000
@NM00087 EQU   $DEVFLG3                                                 03851000
$CLRSNT  EQU   $DEVFLG3                                                 03852000
$OLTERR  EQU   $DEVFLG3                                                 03853000
$SRTEST  EQU   $DEVFLG3                                                 03854000
$DVSNDOK EQU   $SIOFLG                                                  03855000
$POLLREQ EQU   $DEVFLG3                                                 03856000
$DVINCT  EQU   $DEVTBLE+26                                              03857000
$DVBRKST EQU   $OPND+1                                                  03858000
$DVBRKSN EQU   $OPND                                                    03859000
$DVSEQNO EQU   $OPIS                                                    03860000
$CEINTRP EQU   $DEVFLG2                                                 03861000
$TESTMDE EQU   $DEVFLG2                                                 03862000
$DEVALOC EQU   $DEVFLG2                                                 03863000
$ALLDATA EQU   $DEVFLG2                                                 03864000
$ENDCNTL EQU   $DEVFLG2                                                 03865000
$CTLDEV  EQU   $DEVFLG2                                                 03866000
$NOCDS   EQU   $DEVFLG2                                                 03867000
$DATAIN  EQU   $DEVFLG2                                                 03868000
$PRIMARY EQU   $DEVFLG1                                                 03869000
$DVCTBYT EQU   $INTOCC                                                  03870000
$DEVACT  EQU   $DEVFLG1                                                 03871000
$GRABBED EQU   $DEVFLG1                                                 03872000
$CATASTR EQU   $DEVFLG1                                                 03873000
$LETGO   EQU   $DEVFLG1                                                 03874000
$CURELEM EQU   $$SYMNME+4                                               03875000
$MSGOTSD EQU   $$SYMNME                                                 03876000
$EXTDEV  EQU   $DEVCDS+11                                               03877000
@NM00086 EQU   $DEVSDCF                                                 03878000
$NOTPRIM EQU   $DEVSDCF                                                 03879000
@NM00085 EQU   $DEVCDSF                                                 03880000
@NM00084 EQU   $DEVCDSF                                                 03881000
@NM00083 EQU   $DEVCDSF                                                 03882000
$CDSNAME EQU   $DEVCDSF                                                 03883000
$EXTRN   EQU   $DEVCDSF                                                 03884000
$CEVOLUM EQU   $DEVCDSF                                                 03885000
$SHARD   EQU   $DEVCDSF                                                 03886000
$DEVFPM  EQU   $DEVCDSF                                                 03887000
$DEVCNT  EQU   $DEVCDS+8                                                03888000
$DEVTYPE EQU   $DEVFEAT+3                                               03889000
$DEVCLAS EQU   $DEVFEAT+2                                               03890000
$DEVFRRS EQU   $DEVFEAT+1                                               03891000
$DEVMOD  EQU   $DEVFEAT                                                 03892000
$DEVRDGT EQU   @NM00081+1                                               03893000
$DEVCTLU EQU   @NM00081+1                                               03894000
$DEVCHAN EQU   @NM00081                                                 03895000
@NM00082 EQU   @NM00081                                                 03896000
$CTINDX  EQU   $DEVUNAD                                                 03897000
$FLAG16  EQU   $COMMFLG+15                                              03898000
$FLAG15  EQU   $COMMFLG+14                                              03899000
$FLAG14  EQU   $COMMFLG+13                                              03900000
$CATMSG  EQU   $FLAG13                                                  03901000
$PRMPTSW EQU   $FLAG13                                                  03902000
$DEVENT  EQU   $FLAG13                                                  03903000
$LGON    EQU   $FLAG13                                                  03904000
$CTLOGON EQU   $FLAG13                                                  03905000
@NM00080 EQU   $FLAG12                                                  03906000
$VARYINP EQU   $FLAG12                                                  03907000
$VRYHRD  EQU   $FLAG12                                                  03908000
$VRYSFT  EQU   $FLAG12                                                  03909000
$OPTMSG  EQU   $FLAG12                                                  03910000
$FEORCAT EQU   $FLAG11                                                  03911000
@NM00079 EQU   $FLAG11                                                  03912000
@NM00078 EQU   $FLAG10                                                  03913000
$INBND   EQU   $FLAG10                                                  03914000
$DPRINT  EQU   $FLAG10                                                  03915000
$HOLD    EQU   $FLAG9                                                   03916000
$NOTRRCH EQU   $FLAG9                                                   03917000
@NM00077 EQU   $FLAG9                                                   03918000
$COPY    EQU   $FLAG9                                                   03919000
$LSTLNSW EQU   $FLAG9                                                   03920000
$MULLNSW EQU   $FLAG9                                                   03921000
$REMSW   EQU   $FLAG9                                                   03922000
$IGRES   EQU   $FLAG9                                                   03923000
$TCECM   EQU   $FLAG8                                                   03924000
$VS2     EQU   $FLAG8                                                   03925000
$VS1     EQU   $FLAG8                                                   03926000
$EDOS    EQU   $FLAG8                                                   03927000
@NM00076 EQU   $FLAG8                                                   03928000
$TWOWAY  EQU   $FLAG8                                                   03929000
@NM00075 EQU   $FLAG8                                                   03930000
$RCVMSG  EQU   $FLAG7                                                   03931000
$RCVRFLG EQU   $FLAG7                                                   03932000
$SNDRFLG EQU   $FLAG7                                                   03933000
$LDOIS   EQU   $FLAG7                                                   03934000
$DCONTCT EQU   $FLAG7                                                   03935000
$EXIOWAT EQU   $FLAG7                                                   03936000
$2NDDATA EQU   $FLAG7                                                   03937000
$1STDATA EQU   $FLAG7                                                   03938000
$FSTMCIS EQU   $FLAG6                                                   03939000
$DISCREQ EQU   $FLAG6                                                   03940000
$DISCISS EQU   $FLAG6                                                   03941000
$CHANGE  EQU   $FLAG6                                                   03942000
$RECAL11 EQU   $FLAG6                                                   03943000
@NM00074 EQU   $FLAG5                                                   03944000
$PROGCK  EQU   $CANCEL                                                  03945000
$PRINTAP EQU   $FLAG5                                                   03946000
@NM00073 EQU   $FLAG5                                                   03947000
$CT924   EQU   $FLAG5                                                   03948000
$FSTCAT  EQU   $FLAG5                                                   03949000
$FSTFE   EQU   $FLAG5                                                   03950000
$ACQCUTT EQU   $FLAG4                                                   03951000
$BACKINT EQU   $FLAG4                                                   03952000
$DMSGSW  EQU   $FLAG4                                                   03953000
$TSTDEVP EQU   $FLAG4                                                   03954000
$APRQPER EQU   $FLAG4                                                   03955000
$OPCOM   EQU   $FLAG4                                                   03956000
$NEWAP   EQU   $FLAG3                                                   03957000
$OPTERR  EQU   $FLAG3                                                   03958000
$PRTONLY EQU   $FLAG3                                                   03959000
$LOGOFFE EQU   $FLAG3                                                   03960000
$TSTERR  EQU   $FLAG3                                                   03961000
$DEVERR  EQU   $FLAG3                                                   03962000
$PARTIAL EQU   $FLAG2                                                   03963000
$NRMTERM EQU   $FLAG2                                                   03964000
$VALDTST EQU   $FLAG2                                                   03965000
$VALDDEV EQU   $FLAG2                                                   03966000
$DBLSLSH EQU   $FLAG2                                                   03967000
$NDR     EQU   $FLAG2                                                   03968000
@NM00072 EQU   $FLAG2                                                   03969000
$OLTACT  EQU   $FLAG1                                                   03970000
$NORELDV EQU   $FLAG1                                                   03971000
@NM00071 EQU   $FLAG1                                                   03972000
$OPTCHNG EQU   $FLAG1                                                   03973000
$DEVCHNG EQU   $FLAG1                                                   03974000
$TESTCNG EQU   $FLAG1                                                   03975000
$CNSLFG  EQU   $FLAG1                                                   03976000
@NM00070 EQU   $CDA+120                                                 03977000
$CUCNT   EQU   $CDA+118                                                 03978000
@NM00069 EQU   $CDA+117                                                 03979000
$PRTFORM EQU   $CDA+116                                                 03980000
$OPISCNT EQU   $CDA+114                                                 03981000
$GETMSZE EQU   $CDA+110                                                 03982000
$GRCNTS  EQU   $CDA+108                                                 03983000
$CTLCNT  EQU   $CDA+106                                                 03984000
$ACTLVL  EQU   $CDA+105                                                 03985000
$PRNTLVL EQU   $CDA+104                                                 03986000
$ERRCNTA EQU   $CDA+102                                                 03987000
$TLCNT   EQU   $CDA+100                                                 03988000
$TIMEALW EQU   $CDA+96                                                  03989000
$GETMPTR EQU   $CDA+88                                                  03990000
$R13PTRT EQU   $CDA+84                                                  03991000
$R13PTR  EQU   $CDA+80                                                  03992000
$TEPEND  EQU   $CDA+76                                                  03993000
$PLINKDL EQU   $CDA+72                                                  03994000
$TEPBEGN EQU   $CDA+68                                                  03995000
$FRELPTR EQU   $CDA+64                                                  03996000
$HIGHADR EQU   $HIMOREC                                                 03997000
$LOMOREC EQU   $CDA+56                                                  03998000
$LOWADDR EQU   $OLTPTR                                                  03999000
$ENDCOMM EQU   $CDA+48                                                  04000000
$COMMON  EQU   $RCA                                                     04001000
$SLASHAD EQU   $CDA+32                                                  04002000
$PASSON  EQU   $CDA+28                                                  04003000
$TOLBRTB EQU   $CDA+24                                                  04004000
$SCTPTR8 EQU   $CDA+20                                                  04005000
$SCTPTR  EQU   $CDA+16                                                  04006000
$TBWDPTR EQU   $CDA+12                                                  04007000
@NM00068 EQU   $CDA                                                     04008000
@NM00067 EQU   $SCTTBLE+98                                              04009000
$SCTLWTC EQU   $SCTTBLE+96                                              04010000
$SCTLWTA EQU   $SCTTBLE+92                                              04011000
#EXT     EQU   $SCTTBLE+88                                              04012000
#PASS    EQU   $SCTTBLE+84                                              04013000
#TABLE   EQU   $SCTTBLE+80                                              04014000
#MSGIDAC EQU   $SCTTBLE+78                                              04015000
@NM00066 EQU   $SCTTBLE+71                                              04016000
$RETMASK EQU   $SCTTBLE+70                                              04017000
$R249255 EQU   $ROUTMSK+29                                              04018000
$R241248 EQU   $ROUTMSK+28                                              04019000
$R233240 EQU   $ROUTMSK+27                                              04020000
$R225232 EQU   $ROUTMSK+26                                              04021000
$R217224 EQU   $ROUTMSK+25                                              04022000
$R209216 EQU   $ROUTMSK+24                                              04023000
$R201208 EQU   $ROUTMSK+23                                              04024000
$R193200 EQU   $ROUTMSK+22                                              04025000
$R185192 EQU   $ROUTMSK+21                                              04026000
$R177184 EQU   $ROUTMSK+20                                              04027000
$R169176 EQU   $ROUTMSK+19                                              04028000
$R161168 EQU   $ROUTMSK+18                                              04029000
$R153160 EQU   $ROUTMSK+17                                              04030000
$R145152 EQU   $ROUTMSK+16                                              04031000
$R137144 EQU   $ROUTMSK+15                                              04032000
$R129136 EQU   $ROUTMSK+14                                              04033000
$R121128 EQU   $ROUTMSK+13                                              04034000
$R113120 EQU   $ROUTMSK+12                                              04035000
$R105112 EQU   $ROUTMSK+11                                              04036000
$R097104 EQU   $ROUTMSK+10                                              04037000
$R089096 EQU   $ROUTMSK+9                                               04038000
$R081088 EQU   $ROUTMSK+8                                               04039000
$R073080 EQU   $ROUTMSK+7                                               04040000
$R065072 EQU   $ROUTMSK+6                                               04041000
$R057064 EQU   $ROUTMSK+5                                               04042000
$R049056 EQU   $ROUTMSK+4                                               04043000
$R041048 EQU   $ROUTMSK+3                                               04044000
$R033040 EQU   $ROUTMSK+2                                               04045000
$R025032 EQU   $ROUTMSK+1                                               04046000
$R017024 EQU   $ROUTMSK                                                 04047000
$TOTFLG2 EQU   $SCTTBLE+39                                              04048000
@NM00065 EQU   $TOTFLG1                                                 04049000
@NM00064 EQU   $TOTFLG1                                                 04050000
@NM00063 EQU   $TOTFLG1                                                 04051000
$CURELOD EQU   $TOTFLG1                                                 04052000
$CTEQTT  EQU   $TOTFLG1                                                 04053000
@NM00062 EQU   $TOTFLG1                                                 04054000
@NM00061 EQU   $TOTFLG1                                                 04055000
$LINESHR EQU   $TOTFLG1                                                 04056000
@NM00060 EQU   $OLTFLG2                                                 04057000
@NM00059 EQU   $OLTFLG2                                                 04058000
@NM00058 EQU   $OLTFLG2                                                 04059000
@NM00057 EQU   $OLTFLG2                                                 04060000
@NM00056 EQU   $OLTFLG2                                                 04061000
@NM00055 EQU   $OLTFLG2                                                 04062000
@NM00054 EQU   $OLTFLG2                                                 04063000
$TALK    EQU   $OLTFLG2                                                 04064000
$DYCOM   EQU   $OLTFLGS                                                 04065000
@NM00053 EQU   $OLTFLGS                                                 04066000
$TRACE   EQU   $OLTFLGS                                                 04067000
$RETCODE EQU   $OLTFLGS                                                 04068000
$CONTCB  EQU   $OLTFLGS                                                 04069000
$RETAIN  EQU   $OLTFLGS                                                 04070000
$CLEANRT EQU   $OLTFLGS                                                 04071000
$MANINTV EQU   $OLTFLGS                                                 04072000
$OLTSIZE EQU   $SCTTBLE+34                                              04073000
$QSCTMOD EQU   $EXECFLG                                                 04074000
$CTRLMOD EQU   $EXECFLG                                                 04075000
$CLEANUP EQU   $EXECFLG                                                 04076000
$LSTPDEV EQU   $EXECFLG                                                 04077000
$ERRCNT  EQU   $EXECFLG                                                 04078000
$RTNSLCT EQU   $EXECFLG                                                 04079000
$MULTDEV EQU   $EXECFLG                                                 04080000
@NM00052 EQU   $EXECFLG                                                 04081000
$RMSKCNT EQU   $SCTTBLE+32                                              04082000
$SYNAME  EQU   $CDS8T19+4                                               04083000
$EXTSIG  EQU   $CDS8T19+3                                               04084000
$CDFLGS  EQU   $CDS8T19+1                                               04085000
$CDSCNT  EQU   $CDS8T19                                                 04086000
$PDEVDSC EQU   $SCTTBLE+16                                              04087000
$PDEVADR EQU   $SCTTBLE+12                                              04088000
$COMMCN  EQU   $CDSFLGS                                                 04089000
$CUSTSYM EQU   $CDSFLGS                                                 04090000
$TWOCHSW EQU   $CDSFLGS                                                 04091000
$SYMNAME EQU   $CDSFLGS                                                 04092000
$EXTINTC EQU   $CDSFLGS                                                 04093000
$CEVOL   EQU   $CDSFLGS                                                 04094000
$SHARED  EQU   $CDSFLGS                                                 04095000
$FPM     EQU   $CDSFLGS                                                 04096000
$LASTSUB EQU   $PDEVFLG                                                 04097000
@NM00051 EQU   $PDEVFLG                                                 04098000
@NM00050 EQU   $PDEVFLG                                                 04099000
@NM00049 EQU   $PDEVFLG                                                 04100000
$LASTDEV EQU   $PDEVFLG                                                 04101000
@NM00048 EQU   $PDEVFLG                                                 04102000
$EXFILPT EQU   $PDEVFLG                                                 04103000
$FPMOLD  EQU   $PDEVFLG                                                 04104000
$TSSSYM  EQU   $SCTTBLE+8                                               04105000
$SCTLEVL EQU   $SCTTBLE+7                                               04106000
$DRIVER  EQU   $SCTTBLE+6                                               04107000
$RT0916  EQU   $SCTTBLE+5                                               04108000
$RT0108  EQU   $SCTTBLE+4                                               04109000
$LOOPTST EQU   $ERROPT                                                  04110000
$LOOPERR EQU   $ERROPT                                                  04111000
$NERRPRT EQU   $ERROPT                                                  04112000
$NOCNTRL EQU   $ERROPT                                                  04113000
$ALTPRNT EQU   $ERROPT                                                  04114000
$CATERR  EQU   $ERROPT                                                  04115000
$ASTERIK EQU   $ERROPT                                                  04116000
$TESTERR EQU   $ERROPT                                                  04117000
$FSTCOMM EQU   $TESTOPT                                                 04118000
$INDEFLP EQU   $TESTOPT                                                 04119000
$NOPRT   EQU   $TESTOPT                                                 04120000
$PARAPRT EQU   $TESTOPT                                                 04121000
@NM00047 EQU   $TESTOPT                                                 04122000
$ERRLPCT EQU   $SCTTBLE                                                 04123000
$TLTEND  EQU   $RCAAREA+936                                             04124000
$EXITSAV EQU   $RCAAREA+864                                             04125000
$TRASCII EQU   $RCAAREA+608                                             04126000
@NM00046 EQU   $RCAAREA+605                                             04127000
$TPPOSTD EQU   $RCAFLG                                                  04128000
$TPLOGON EQU   $RCAFLG                                                  04129000
$CTDVAR  EQU   $RCAAREA+596                                             04130000
$BUFFS   EQU   $RCAAREA+464                                             04131000
$TLTNIB  EQU   $CONSTNT+140                                             04132000
@NM00045 EQU   $CONSTNT+4                                               04133000
@NM00044 EQU   $CONSTNT+2                                               04134000
$CTNAME  EQU   $POINTER+132                                             04135000
$CTARGX  EQU   $POINTER+128                                             04136000
$COMINT  EQU   $POINTER+120                                             04137000
$QUEHNDL EQU   $POINTER+116                                             04138000
@NM00043 EQU   $POINTER+36                                              04139000
$RTNPTR  EQU   $POINTER+32                                              04140000
$TLTECB1 EQU   $POINTER+24                                              04141000
$CLEANP  EQU   $POINTER+20                                              04142000
$LSTAREA EQU   $POINTER+12                                              04143000
$TLTACB  EQU   $RCAAREA                                                 04144000
DEVRSV03 EQU   ISTDEVCH+5                                               04145000
DEVPHYSA EQU   ISTDEVCH+4                                               04146000
DEVCSLPN EQU   DEVCHAR3                                                 04147000
DEVCSTCL EQU   DEVCHAR3                                                 04148000
DEVCCHEK EQU   DEVCHAR3                                                 04149000
DEVCATTN EQU   DEVCHAR3                                                 04150000
DEVCSWL  EQU   DEVFCCTL                                                 04151000
DEVCRVB  EQU   DEVFCCTL                                                 04152000
DEVCSSL  EQU   DEVFCCTL                                                 04153000
DEVCBSC  EQU   DEVFCCTL                                                 04154000
DEVMCODE EQU   ISTDEVCH+2                                               04155000
DEVCHAR2 EQU   DEVTCODE                                                 04156000
DEVRSV01 EQU   DEVCHAR                                                  04157000
DEVCCTL  EQU   DEVCHAR                                                  04158000
DEVNNSPT EQU   DEVCHAR                                                  04159000
DEVSPS   EQU   DEVCHAR                                                  04160000
DEVSUBND EQU   DEVCHAR                                                  04161000
DEVCONVR EQU   DEVCHAR                                                  04162000
@NM00042 EQU   ACBVTEXT+8                                               04163000
@NM00041 EQU   ACBVTEXT+6                                               04164000
ACBRTN   EQU   ACBVTEXT                                                 04165000
ACBAPID  EQU   ACBCOMN+72                                               04166000
ACBCBMWA EQU   ACBCOMN+68                                               04167000
ACBUAPTR EQU   ACBCOMN+64                                               04168000
ACBLRECL EQU   ACBCOMN+62                                               04169000
ACBMSGLN EQU   ACBBLKSZ                                                 04170000
ACBBUFSP EQU   ACBCOMN+56                                               04171000
@NM00040 EQU   ACBUJFCB+1                                               04172000
ACBOPTN  EQU   ACBUJFCB                                                 04173000
@NM00039 EQU   ACBINFLG+1                                               04174000
ACBBYPSS EQU   ACBINFLG                                                 04175000
ACBSDS   EQU   ACBVVIC                                                  04176000
ACBUCRA  EQU   ACBINFLG                                                 04177000
ACBSCRA  EQU   ACBINFLG                                                 04178000
ACBCAT   EQU   ACBINFLG                                                 04179000
ACBIJRQE EQU   ACBINFLG                                                 04180000
ACBJEPS  EQU   ACBINFLG                                                 04181000
@NM00038 EQU   ACBINFLG                                                 04182000
ACBERFLG EQU   ACBCOMN+49                                               04183000
ACBBUSY  EQU   ACBIOSFG                                                 04184000
ACBLOCK  EQU   ACBEXFG                                                  04185000
@NM00037 EQU   ACBOFLGS                                                 04186000
ACBDSERR EQU   ACBOFLGS                                                 04187000
ACBOPEN  EQU   ACBOFLGS                                                 04188000
ACBEOV   EQU   ACBOFLGS                                                 04189000
@NM00036 EQU   ACBOFLGS                                                 04190000
ACBERFL  EQU   ACBDDNM+4                                                04191000
ACBAM    EQU   ACBAMETH                                                 04192000
ACBINFL  EQU   ACBDDNM+2                                                04193000
ACBTIOT  EQU   ACBDDNM                                                  04194000
ACBUEL   EQU   ACBEXLST                                                 04195000
ACBPASSW EQU   ACBCOMN+32                                               04196000
ACBMSGAR EQU   ACBCOMN+28                                               04197000
@NM00035 EQU   ACBDSORG+1                                               04198000
ACBDORGA EQU   ACBDSORG+1                                               04199000
@NM00034 EQU   ACBDSORG                                                 04200000
ACBOPTJ  EQU   ACBDVIND                                                 04201000
ACBCRNRE EQU   ACBCROPS                                                 04202000
ACBCRNCK EQU   ACBCROPS                                                 04203000
ACBASA   EQU   ACBCCTYP                                                 04204000
@NM00033 EQU   ACBCCTYP                                                 04205000
ACBTRCID EQU   ACBCCTYP                                                 04206000
@NM00032 EQU   ACBRECFM                                                 04207000
ACBRECAF EQU   ACBRECFM                                                 04208000
ACBJBUF  EQU   ACBBUFPL+2                                               04209000
ACBMACR4 EQU   ACBBUFPL+1                                               04210000
@NM00031 EQU   ACBMACR3                                                 04211000
ACBNCFX  EQU   ACBMACR3                                                 04212000
ACBSIS   EQU   ACBMACR3                                                 04213000
ACBDFR   EQU   ACBMACR3                                                 04214000
ACBICI   EQU   ACBMACR3                                                 04215000
ACBGSR   EQU   ACBMACR3                                                 04216000
ACBLSR   EQU   ACBMACR3                                                 04217000
@NM00030 EQU   ACBMACR3                                                 04218000
ACBBUFNI EQU   ACBCOMN+18                                               04219000
ACBBUFND EQU   ACBCOMN+16                                               04220000
ACBSTRNO EQU   ACBCOMN+15                                               04221000
ACBBSTNO EQU   ACBCOMN+14                                               04222000
ACBAIX   EQU   ACBMACR2                                                 04223000
ACBDSN   EQU   ACBMACR2                                                 04224000
ACBRST   EQU   ACBMACR2                                                 04225000
ACBLOGON EQU   ACBMACR2                                                 04226000
ACBSKP   EQU   ACBMACR2                                                 04227000
@NM00029 EQU   ACBMACR2                                                 04228000
ACBUBF   EQU   ACBMACR1                                                 04229000
ACBOUT   EQU   ACBMACR1                                                 04230000
ACBIN    EQU   ACBMACR1                                                 04231000
ACBDIR   EQU   ACBMACR1                                                 04232000
ACBSEQ   EQU   ACBMACR1                                                 04233000
ACBBLK   EQU   ACBCNV                                                   04234000
ACBADD   EQU   ACBADR                                                   04235000
ACBKEY   EQU   ACBMACR1                                                 04236000
ACBINRTN EQU   ACBCOMN+8                                                04237000
ACBIBCT  EQU   ACBJWA                                                   04238000
ACBLEN2  EQU   ACBLENG2                                                 04239000
ACBSTYP  EQU   ACBCOMN+1                                                04240000
ACBID    EQU   ACBCOMN                                                  04241000
RPLSEQNO EQU   RPLOF60+6                                                04242000
@NM00028 EQU   RPLIBSQ                                                  04243000
RPLIINV  EQU   RPLIBSQ                                                  04244000
RPLINEG  EQU   RPLIBSQ                                                  04245000
RPLIPOS  EQU   RPLIBSQ                                                  04246000
RPLIIGN  EQU   RPLIBSQ                                                  04247000
RPLIRSET EQU   RPLIBSQ                                                  04248000
RPLITST  EQU   RPLIBSQ                                                  04249000
RPLISET  EQU   RPLIBSQ                                                  04250000
@NM00027 EQU   RPLOBSQ                                                  04251000
RPLOINV  EQU   RPLOBSQ                                                  04252000
RPLONEG  EQU   RPLOBSQ                                                  04253000
RPLOPOS  EQU   RPLOBSQ                                                  04254000
RPLOIGN  EQU   RPLOBSQ                                                  04255000
RPLORSET EQU   RPLOBSQ                                                  04256000
RPLOTST  EQU   RPLOBSQ                                                  04257000
RPLOSET  EQU   RPLOBSQ                                                  04258000
RPLIBSQV EQU   RPLOF60+2                                                04259000
RPLOBSQV EQU   RPLOF60                                                  04260000
@NM00026 EQU   RPLCNTSC                                                 04261000
RPLRSHUT EQU   RPLCNTSC                                                 04262000
RPLRQR   EQU   RPLCNTSC                                                 04263000
RPLSHUTC EQU   RPLCNTSC                                                 04264000
RPLSHUTD EQU   RPLCNTSC                                                 04265000
RPLSTSN  EQU   RPLCNTSC                                                 04266000
RPLCLEAR EQU   RPLCNTSC                                                 04267000
RPLSDT   EQU   RPLCNTSC                                                 04268000
@NM00025 EQU   RPLCNTDC                                                 04269000
RPLSIGNL EQU   RPLCNTDC                                                 04270000
RPLLUS   EQU   RPLCNTDC                                                 04271000
RPLRTR   EQU   RPLCNTDC                                                 04272000
RPLBID   EQU   RPLCNTDC                                                 04273000
@NM00024 EQU   RPLCNTDF                                                 04274000
RPLQI    EQU   RPLCNTDF                                                 04275000
RPLRELQ  EQU   RPLCNTDF                                                 04276000
RPLCHASE EQU   RPLCNTDF                                                 04277000
RPLQEC   EQU   RPLCNTDF                                                 04278000
RPLQC    EQU   RPLCNTDF                                                 04279000
RPLCNCEL EQU   RPLCNTDF                                                 04280000
RPLDATA  EQU   RPLCNTDF                                                 04281000
RPLRRN   EQU   RPLRESP                                                  04282000
RPLNFME  EQU   RPLRESP                                                  04283000
RPLEX    EQU   RPLRESP                                                  04284000
@NM00023 EQU   RPLRESP                                                  04285000
@NM00022 EQU   RPLPOSTV                                                 04286000
RPLSCHED EQU   RPLPOSTV                                                 04287000
@NM00021 EQU   RPLVTFL1                                                 04288000
RPLAUTUS EQU   RPLVTFL1                                                 04289000
RPLVTUSE EQU   RPLVTFL1                                                 04290000
@NM00020 EQU   RPLVTFL1                                                 04291000
@NM00019 EQU   RPLCHN                                                   04292000
RPLONLY  EQU   RPLCHN                                                   04293000
RPLLAST  EQU   RPLCHN                                                   04294000
RPLMIDLE EQU   RPLCHN                                                   04295000
RPLFIRST EQU   RPLCHN                                                   04296000
@NM00018 EQU   RPLRTYPE                                                 04297000
RPLDFASY EQU   RPLRTYPE                                                 04298000
RPLNFSYN EQU   RPLRTYPE                                                 04299000
RPLRRESP EQU   RPLRTYPE                                                 04300000
@NM00017 EQU   RPLSTYPE                                                 04301000
RPLSRESP EQU   RPLSTYPE                                                 04302000
@NM00016 EQU   RPLRH3                                                   04303000
RPLCSI   EQU   RPLRH3                                                   04304000
RPLCHREQ EQU   RPLRH3                                                   04305000
RPLCMD   EQU   RPLRH3                                                   04306000
RPLEB    EQU   RPLRH3                                                   04307000
RPLBB    EQU   RPLRH3                                                   04308000
RPLSIGDA EQU   RPLVTEXT+32                                              04309000
RPLSAV13 EQU   RPLVTEXT+28                                              04310000
RPLUSNSO EQU   RPLOSENS+2                                               04311000
RPLSSMO  EQU   RPLSSNSO+1                                               04312000
@NM00015 EQU   RPLSSEO                                                  04313000
RPLRRO   EQU   RPLSSEO                                                  04314000
RPLFIO   EQU   RPLSSEO                                                  04315000
RPLSTATO EQU   RPLSSEO                                                  04316000
RPLCPMO  EQU   RPLSSEO                                                  04317000
@NM00014 EQU   RPLSSEO                                                  04318000
RPLFMHDR EQU   RPLOPT12                                                 04319000
@NM00013 EQU   RPLOPT12                                                 04320000
@NM00012 EQU   RPLOPT12                                                 04321000
@NM00011 EQU   RPLOPT12                                                 04322000
RPLNIBTK EQU   RPLOPT12                                                 04323000
RPLTRUNC EQU   RPLOPT12                                                 04324000
RPLKEEP  EQU   RPLOPT12                                                 04325000
@NM00010 EQU   RPLOPT12                                                 04326000
RPLRSVE8 EQU   RPLOPT11                                                 04327000
RPLRSVE7 EQU   RPLOPT11                                                 04328000
RPLRSVE6 EQU   RPLOPT11                                                 04329000
RPLRSVE5 EQU   RPLOPT11                                                 04330000
RPLRSVE4 EQU   RPLOPT11                                                 04331000
RPLSTOP  EQU   RPLOPT11                                                 04332000
RPLSTART EQU   RPLOPT11                                                 04333000
RPLQUIES EQU   RPLOPT11                                                 04334000
RPLRSVI6 EQU   RPLOPT10                                                 04335000
RPLRSVI5 EQU   RPLOPT10                                                 04336000
RPLRSVI4 EQU   RPLOPT10                                                 04337000
RPLRSVI3 EQU   RPLOPT10                                                 04338000
RPLRSVI2 EQU   RPLOPT10                                                 04339000
RPLSPARM EQU   RPLOPT10                                                 04340000
RPLDSPLY EQU   RPLOPT10                                                 04341000
RPLBSCID EQU   RPLOPT10                                                 04342000
RPLTOPL  EQU   RPLOPT9                                                  04343000
RPLCIDE  EQU   RPLOPT9                                                  04344000
RPLRNNM  EQU   RPLOPT9                                                  04345000
RPLAPPST EQU   RPLOPT9                                                  04346000
RPLCOUNT EQU   RPLOPT9                                                  04347000
RPLTERMS EQU   RPLOPT9                                                  04348000
RPLDEVCH EQU   RPLOPT9                                                  04349000
RPLLOGON EQU   RPLOPT9                                                  04350000
RPLESR2  EQU   RPLUSNSI+1                                               04351000
RPLESR1  EQU   RPLUSNSI                                                 04352000
RPLSSMI  EQU   RPLDSB2                                                  04353000
@NM00009 EQU   RPLSSEI                                                  04354000
RPLRRI   EQU   RPLSSEI                                                  04355000
RPLFII   EQU   RPLSSEI                                                  04356000
RPLSTATI EQU   RPLSSEI                                                  04357000
RPLCPMI  EQU   RPLSSEI                                                  04358000
RPLPATHI EQU   RPLSSEI                                                  04359000
RPLARCLN EQU   RPLVTEXT+8                                               04360000
RPLAARLN EQU   RPLVTEXT+4                                               04361000
RPLAAREA EQU   RPLVTEXT                                                 04362000
RPLERMSA EQU   RPLCOMN+72                                               04363000
RPLEMLEN EQU   RPLCOMN+70                                               04364000
RPLACTIV EQU   RPLCOMN+69                                               04365000
RPLBRANC EQU   RPLEXTD1                                                 04366000
RPLNIB   EQU   RPLEXTD1                                                 04367000
@NM00008 EQU   RPLEXTD1                                                 04368000
RPLEXIT  EQU   RPLEXTD1                                                 04369000
RPLNEXIT EQU   RPLEXTD1                                                 04370000
RPLEXSCH EQU   RPLEXTD1                                                 04371000
RPLDDDD  EQU   RPLRBAR+4                                                04372000
@NM00007 EQU   RPLRBAR+3                                                04373000
@NM00006 EQU   RPLAIXID                                                 04374000
RPLAXPKP EQU   RPLAIXID                                                 04375000
RPLAIXPC EQU   RPLRBAR                                                  04376000
RPLRSV88 EQU   RPLOPT8                                                  04377000
RPLUNCON EQU   RPLOPT8                                                  04378000
RPLACTV  EQU   RPLOPT8                                                  04379000
RPLSESS  EQU   RPLOPT8                                                  04380000
RPLPEND  EQU   RPLOPT8                                                  04381000
RPLODPRM EQU   RPLOPT8                                                  04382000
RPLODACP EQU   RPLOPT8                                                  04383000
RPLODACQ EQU   RPLOPT8                                                  04384000
RPLRSV78 EQU   RPLOPT7                                                  04385000
RPLTCRNO EQU   RPLOPT7                                                  04386000
RPLRLSOP EQU   RPLOPT7                                                  04387000
RPLTPOST EQU   RPLOPT7                                                  04388000
RPLQOPT  EQU   RPLOPT7                                                  04389000
RPLCNIMM EQU   RPLCNOPT                                                 04390000
RPLCNANY EQU   RPLCNOPT                                                 04391000
RPLCNALL EQU   RPLCNOPT                                                 04392000
RPLRSV68 EQU   RPLOPT6                                                  04393000
RPLRSV67 EQU   RPLOPT6                                                  04394000
RPLLOCK  EQU   RPLOPT6                                                  04395000
RPLNCOND EQU   RPLOPT6                                                  04396000
RPLCOND  EQU   RPLOPT6                                                  04397000
RPLEOT   EQU   RPLUNTYP                                                 04398000
RPLEOM   EQU   RPLUNTYP                                                 04399000
RPLEOB   EQU   RPLUNTYP                                                 04400000
RPLWROPT EQU   RPLOPT5                                                  04401000
RPLNODE  EQU   RPLOPT5                                                  04402000
RPLERACE EQU   RPLWRTYP                                                 04403000
RPLEAU   EQU   RPLWRTYP                                                 04404000
RPLNERAS EQU   RPLWRTYP                                                 04405000
RPLPSOPT EQU   RPLOPT5                                                  04406000
@NM00005 EQU   RPLOPT5                                                  04407000
RPLDLGIN EQU   RPLOPT5                                                  04408000
RPLRLEN  EQU   RPLCOMN+48                                               04409000
RPLCHAIN EQU   RPLNXTRP                                                 04410000
RPLBOP   EQU   RPLOPT4                                                  04411000
@NM00004 EQU   RPLOPT4                                                  04412000
RPLMKFRM EQU   RPLOPT4                                                  04413000
RPLENDTR EQU   RPLOPT4                                                  04414000
RPLALIGN EQU   RPLOPT3                                                  04415000
RPLFMT   EQU   RPLOPT3                                                  04416000
RPLFLD   EQU   RPLOPT3                                                  04417000
RPLVFY   EQU   RPLOPT3                                                  04418000
RPLBLK   EQU   RPLOPT3                                                  04419000
RPLSFORM EQU   RPLOPT3                                                  04420000
RPLEODS  EQU   RPLOPT3                                                  04421000
RPLNSP   EQU   RPLOPT2                                                  04422000
RPLUPD   EQU   RPLOPT2                                                  04423000
@NM00003 EQU   RPLOPT2                                                  04424000
RPLLRD   EQU   RPLOPT2                                                  04425000
RPLBWD   EQU   RPLOPT2                                                  04426000
RPLCNV   EQU   RPLOPT2                                                  04427000
RPLADD   EQU   RPLADR                                                   04428000
RPLKEY   EQU   RPLOPT2                                                  04429000
RPLECBIN EQU   RPLECBSW                                                 04430000
RPLGEN   EQU   RPLOPT1                                                  04431000
RPLKGE   EQU   RPLOPT1                                                  04432000
RPLASY   EQU   RPLOPT1                                                  04433000
RPLSKP   EQU   RPLOPT1                                                  04434000
RPLSEQ   EQU   RPLOPT1                                                  04435000
RPLDIR   EQU   RPLOPT1                                                  04436000
RPLLOC   EQU   RPLOPT1                                                  04437000
RPLDAF   EQU   RPLARG+2                                                 04438000
RPLSAF   EQU   RPLARG                                                   04439000
RPLAREA  EQU   RPLCOMN+32                                               04440000
RPLTCBPT EQU   RPLCOMN+28                                               04441000
RPLDACB  EQU   RPLCOMN+24                                               04442000
RPLCCHAR EQU   RPLCOMN+20                                               04443000
RPLSTRID EQU   RPLCOMN+18                                               04444000
RPLKEYL  EQU   RPLKEYLE                                                 04445000
RPLRDSOH EQU   RPLFDB3                                                  04446000
RPLRLG   EQU   RPLFDB3                                                  04447000
RPLLGFRC EQU   RPLFDB3                                                  04448000
RPLREOT  EQU   RPLFDB3                                                  04449000
RPLREOM  EQU   RPLFDB3                                                  04450000
RPLREOB  EQU   RPLFDB3                                                  04451000
RPLSV32  EQU   RPLFDB3                                                  04452000
RPLUINPT EQU   RPLFDB3                                                  04453000
RPLSTSAV EQU   RPLFDB2                                                  04454000
RPLCUERR EQU   RPLFDB2                                                  04455000
RPLDLGFL EQU   RPLFDB2                                                  04456000
RPLIOERR EQU   RPLFDB2                                                  04457000
RPLDVUNS EQU   RPLFDB2                                                  04458000
RPLATND  EQU   RPLFDB2                                                  04459000
RPLRVID  EQU   RPLFDB2                                                  04460000
RPLERLK  EQU   RPLFDB2                                                  04461000
RPLERREG EQU   RPLRTNCD                                                 04462000
RPLSTAT  EQU   RPLFDBWD                                                 04463000
RPLPOST  EQU   RPLECB                                                   04464000
RPLWAIT  EQU   RPLECB                                                   04465000
RPLPLHPT EQU   RPLCOMN+4                                                04466000
RPLLEN2  EQU   RPLLEN                                                   04467000
RPLREQ   EQU   RPLIDWD+2                                                04468000
RPLSTYP  EQU   RPLIDWD+1                                                04469000
RPLID    EQU   RPLIDWD                                                  04470000
CVTLEVL  EQU   CVTRELNO+2                                               04471000
CVTNUMB  EQU   CVTRELNO                                                 04472000
CVTMDL   EQU   CVTFIX+250                                               04473000
@NM00002 EQU   CVTFIX+248                                               04474000
@NM00001 EQU   CVTFIX                                                   04475000
CVTRV482 EQU   CVTXTNT2+128                                             04476000
CVTRV481 EQU   CVTXTNT2+124                                             04477000
CVTRV480 EQU   CVTXTNT2+120                                             04478000
CVTRV479 EQU   CVTXTNT2+118                                             04479000
CVTRV478 EQU   CVTXTNT2+117                                             04480000
CVTRV477 EQU   CVTXTNT2+116                                             04481000
CVTRV476 EQU   CVTXTNT2+115                                             04482000
CVTRV475 EQU   CVTXTNT2+114                                             04483000
CVTRV474 EQU   CVTRV466                                                 04484000
CVTRV473 EQU   CVTRV466                                                 04485000
CVTRV472 EQU   CVTRV466                                                 04486000
CVTRV471 EQU   CVTRV466                                                 04487000
CVTRV470 EQU   CVTRV466                                                 04488000
CVTRV469 EQU   CVTRV466                                                 04489000
CVTRV468 EQU   CVTRV466                                                 04490000
CVTRV467 EQU   CVTRV466                                                 04491000
CVTRV465 EQU   CVTRV457                                                 04492000
CVTRV464 EQU   CVTRV457                                                 04493000
CVTRV463 EQU   CVTRV457                                                 04494000
CVTRV462 EQU   CVTRV457                                                 04495000
CVTRV461 EQU   CVTRV457                                                 04496000
CVTRV460 EQU   CVTRV457                                                 04497000
CVTRV459 EQU   CVTRV457                                                 04498000
CVTRV458 EQU   CVTRV457                                                 04499000
CVTRV456 EQU   CVTXTNT2+108                                             04500000
CVTRV455 EQU   CVTXTNT2+104                                             04501000
CVTRV454 EQU   CVTXTNT2+100                                             04502000
CVTRV453 EQU   CVTXTNT2+96                                              04503000
CVTRV452 EQU   CVTXTNT2+94                                              04504000
CVTRV451 EQU   CVTXTNT2+92                                              04505000
CVTRV450 EQU   CVTXTNT2+90                                              04506000
CVTRV449 EQU   CVTXTNT2+88                                              04507000
CVTRV448 EQU   CVTXTNT2+87                                              04508000
CVTRV447 EQU   CVTXTNT2+86                                              04509000
CVTRV446 EQU   CVTRV438                                                 04510000
CVTRV445 EQU   CVTRV438                                                 04511000
CVTRV444 EQU   CVTRV438                                                 04512000
CVTRV443 EQU   CVTRV438                                                 04513000
CVTRV442 EQU   CVTRV438                                                 04514000
CVTRV441 EQU   CVTRV438                                                 04515000
CVTRV440 EQU   CVTRV438                                                 04516000
CVTRV439 EQU   CVTRV438                                                 04517000
CVTRV437 EQU   CVTRV429                                                 04518000
CVTRV436 EQU   CVTRV429                                                 04519000
CVTRV435 EQU   CVTRV429                                                 04520000
CVTRV434 EQU   CVTRV429                                                 04521000
CVTRV433 EQU   CVTRV429                                                 04522000
CVTRV432 EQU   CVTRV429                                                 04523000
CVTRV431 EQU   CVTRV429                                                 04524000
CVTRV430 EQU   CVTRV429                                                 04525000
CVTRV428 EQU   CVTXTNT2+80                                              04526000
CVTRV427 EQU   CVTXTNT2+76                                              04527000
CVTRV426 EQU   CVTXTNT2+72                                              04528000
CVTRV425 EQU   CVTXTNT2+68                                              04529000
CVTATACT EQU   CVTATCVT                                                 04530000
CVTRV423 EQU   CVTXTNT2+62                                              04531000
CVTRV422 EQU   CVTXTNT2+60                                              04532000
CVTRV421 EQU   CVTXTNT2+58                                              04533000
CVTRV420 EQU   CVTXTNT2+56                                              04534000
CVTRV419 EQU   CVTXTNT2+55                                              04535000
CVTRV418 EQU   CVTXTNT2+54                                              04536000
CVTRV417 EQU   CVTRV409                                                 04537000
CVTRV416 EQU   CVTRV409                                                 04538000
CVTRV415 EQU   CVTRV409                                                 04539000
CVTRV414 EQU   CVTRV409                                                 04540000
CVTRV413 EQU   CVTRV409                                                 04541000
CVTRV412 EQU   CVTRV409                                                 04542000
CVTRV411 EQU   CVTRV409                                                 04543000
CVTRV410 EQU   CVTRV409                                                 04544000
CVTRV408 EQU   CVTRV400                                                 04545000
CVTRV407 EQU   CVTRV400                                                 04546000
CVTRV406 EQU   CVTRV400                                                 04547000
CVTRV405 EQU   CVTRV400                                                 04548000
CVTRV404 EQU   CVTRV400                                                 04549000
CVTRV403 EQU   CVTRV400                                                 04550000
CVTRV402 EQU   CVTRV400                                                 04551000
CVTRV401 EQU   CVTRV400                                                 04552000
CVTICB   EQU   CVTXTNT2+48                                              04553000
CVTSKTA  EQU   CVTXTNT2+44                                              04554000
CVTSHSB  EQU   CVTSHS                                                   04555000
CVTRSV98 EQU   CVTXTNT2+36                                              04556000
CVTRSV97 EQU   CVTXTNT2+34                                              04557000
CVTRSV96 EQU   CVTXTNT2+32                                              04558000
CVTOLTEP EQU   CVTXTNT2+28                                              04559000
CVTQIDA  EQU   CVTQID+1                                                 04560000
CVTRSV95 EQU   CVTQID                                                   04561000
CVTRSV94 EQU   CVTXTNT2+20                                              04562000
CVTRSV93 EQU   CVTXTNT2+16                                              04563000
CVTRSV92 EQU   CVTXTNT2+12                                              04564000
CVTDEBVR EQU   CVTXTNT2+8                                               04565000
CVTRSV91 EQU   CVTXTNT2+6                                               04566000
CVTRSV9H EQU   CVTFLGBT                                                 04567000
CVTRSV9G EQU   CVTFLGBT                                                 04568000
CVTRSV9F EQU   CVTFLGBT                                                 04569000
CVTRSV9E EQU   CVTFLGBT                                                 04570000
CVTRSV9D EQU   CVTFLGBT                                                 04571000
CVTRSV9C EQU   CVTFLGBT                                                 04572000
CVTVME   EQU   CVTFLGBT                                                 04573000
CVTNPE   EQU   CVTFLGBT                                                 04574000
CVTNUCLS EQU   CVTXTNT2+4                                               04575000
CVTDSSVA EQU   CVTDSSV+1                                                04576000
CVTRSV89 EQU   CVTDSSV                                                  04577000
CVTRSV88 EQU   CVTXTNT1+8                                               04578000
CVTRSV87 EQU   CVTXTNT1+4                                               04579000
CVTFACHN EQU   CVTXTNT1                                                 04580000
CVTRV488 EQU   CVTMAP+412                                               04581000
CVTRV487 EQU   CVTMAP+408                                               04582000
CVTRV486 EQU   CVTMAP+404                                               04583000
CVTRV485 EQU   CVTMAP+400                                               04584000
CVTACTAP EQU   CVTMAP+396                                               04585000
CVTAUTH  EQU   CVTMAP+392                                               04586000
CVTATMCA EQU   CVTATMCT+1                                               04587000
CVTATMST EQU   CVTATMCT                                                 04588000
CVTRSV61 EQU   CVTMAP+384                                               04589000
CVTVOLT1 EQU   CVTVOLM1+1                                               04590000
CVTVOLI1 EQU   CVTVOLF1                                                 04591000
CVTSTOA  EQU   CVTMAP+376                                               04592000
CVTRSV58 EQU   CVTMAP+374                                               04593000
CVTRSV57 EQU   CVTMAP+372                                               04594000
CVTDDCE  EQU   CVTMAP+368                                               04595000
CVTPNWFR EQU   CVTMAP+364                                               04596000
CVTSMF   EQU   CVTMAP+360                                               04597000
CVTSULK  EQU   CVTMAP+358                                               04598000
CVTSLKO  EQU   CVTSYSK                                                  04599000
CVTSLKP  EQU   CVTSYSK                                                  04600000
CVTSLKQ  EQU   CVTSYSK                                                  04601000
CVTSLKR  EQU   CVTSYSK                                                  04602000
CVTRSV56 EQU   CVTSYSK                                                  04603000
CVTRSV55 EQU   CVTSYSK                                                  04604000
CVTRSV54 EQU   CVTSYSK                                                  04605000
CVTRSV53 EQU   CVTSYSK                                                  04606000
CVTRSV52 EQU   CVTA1F1                                                  04607000
CVTRSV51 EQU   CVTA1F1                                                  04608000
CVTRSV50 EQU   CVTA1F1                                                  04609000
CVTRSV49 EQU   CVTA1F1                                                  04610000
CVTRSV48 EQU   CVTA1F1                                                  04611000
CVTRSV47 EQU   CVTA1F1                                                  04612000
CVTSRSW  EQU   CVTA1F1                                                  04613000
CVTPFSW  EQU   CVTA1F1                                                  04614000
CVTPCVT  EQU   CVTMAP+352                                               04615000
CVTRSV46 EQU   CVTMAP+344                                               04616000
CVTRSV45 EQU   CVTMAP+340                                               04617000
CVTRSV44 EQU   CVTMAP+338                                               04618000
CVTRSV43 EQU   CVTMAP+336                                               04619000
CVTHJESA EQU   CVTHJES+1                                                04620000
CVTRSV42 EQU   CVTHJES                                                  04621000
CVTEXT2A EQU   CVTEXT2+1                                                04622000
CVTRSV41 EQU   CVTEXT2                                                  04623000
CVTAPFA  EQU   CVTAPF+1                                                 04624000
CVTRSV40 EQU   CVTAPF                                                   04625000
CVTRV518 EQU   CVTINTLA                                                 04626000
CVTRV517 EQU   CVTERPV                                                  04627000
CVTEORM  EQU   CVTMAP+312                                               04628000
CVTMCHPR EQU   CVTMAP+308                                               04629000
CVTTZ    EQU   CVTMAP+304                                               04630000
CVTJEPS  EQU   CVTMAP+300                                               04631000
CVTJESCT EQU   CVTMAP+296                                               04632000
CVTMODE  EQU   CVTMAP+292                                               04633000
CVTPTRV  EQU   CVTMAP+288                                               04634000
CVTREAL  EQU   CVTMAP+284                                               04635000
CVTRSV39 EQU   CVTMAP+280                                               04636000
CVTRSV38 EQU   CVTMAP+276                                               04637000
CVTDMSRA EQU   CVTDMSR+1                                                04638000
CVTRV634 EQU   CVTDMSRF                                                 04639000
CVTRV633 EQU   CVTDMSRF                                                 04640000
CVTRV632 EQU   CVTDMSRF                                                 04641000
CVTRV631 EQU   CVTDMSRF                                                 04642000
CVTRV630 EQU   CVTDMSRF                                                 04643000
CVTRV629 EQU   CVTDMSRF                                                 04644000
CVTUDUMP EQU   CVTDMSRF                                                 04645000
CVTSDUMP EQU   CVTDMSRF                                                 04646000
CVTQMSGA EQU   CVTQMSG+1                                                04647000
CVTRSV36 EQU   CVTQMSG                                                  04648000
CVTAMFF  EQU   CVTMAP+264                                               04649000
CVTPURGA EQU   CVTPURG+1                                                04650000
CVTRSV35 EQU   CVTPURG                                                  04651000
CVTCBSP  EQU   CVTMAP+256                                               04652000
CVTATERA EQU   CVTATER+1                                                04653000
CVTSYST  EQU   CVTATER                                                  04654000
CVTVOLT2 EQU   CVTTAT                                                   04655000
CVTVOLI2 EQU   CVTVOLF2                                                 04656000
CVTAQAVB EQU   CVTAQAVT+1                                               04657000
CVTRSV34 EQU   CVTTCMFG                                                 04658000
CVTRSV33 EQU   CVTTCMFG                                                 04659000
CVTRSV32 EQU   CVTTCMFG                                                 04660000
CVTRSV31 EQU   CVTTCMFG                                                 04661000
CVTRSV30 EQU   CVTTCMFG                                                 04662000
CVTRSV29 EQU   CVTTCMFG                                                 04663000
CVTRSV28 EQU   CVTTCMFG                                                 04664000
CVTTCRDY EQU   CVTTCMFG                                                 04665000
CVTGTFA  EQU   CVTGTF+1                                                 04666000
CVTRSV27 EQU   CVTGTFST                                                 04667000
CVTRNIO  EQU   CVTGTFST                                                 04668000
CVTUSR   EQU   CVTGTFST                                                 04669000
CVTRV318 EQU   CVTFORM                                                  04670000
CVTRV317 EQU   CVTTMODE                                                 04671000
CVTRV316 EQU   CVTSTATE                                                 04672000
CVTRV315 EQU   CVTGTFS                                                  04673000
CVTGTFAV EQU   CVTGTFS                                                  04674000
CVT0SCR1 EQU   CVTMAP+232                                               04675000
CVTRV515 EQU   CVTMAP+228                                               04676000
CVTRMS   EQU   CVTMAP+224                                               04677000
CVTPATCH EQU   CVTMAP+220                                               04678000
CVTTSCE  EQU   CVTMAP+216                                               04679000
CVTLNKSC EQU   CVTMAP+214                                               04680000
CVTQABST EQU   CVTMAP+212                                               04681000
CVTMDLDS EQU   CVTMAP+208                                               04682000
CVTUSER  EQU   CVTMAP+204                                               04683000
CVTABEND EQU   CVTMAP+200                                               04684000
CVTSMCA  EQU   CVTMAP+196                                               04685000
CVTRSV18 EQU   CVTMAP+192                                               04686000
CVTQLPAQ EQU   CVTMAP+188                                               04687000
CVTQCDSR EQU   CVTMAP+184                                               04688000
CVTRSV17 EQU   CVTOPTB                                                  04689000
CVTRSV16 EQU   CVTOPTB                                                  04690000
CVTFP    EQU   CVTOPTB                                                  04691000
CVTAPTHR EQU   CVTOPTB                                                  04692000
CVTNLOG  EQU   CVTOPTB                                                  04693000
CVTTOD   EQU   CVTOPTB                                                  04694000
CVTCTIMS EQU   CVTOPTB                                                  04695000
CVTPROT  EQU   CVTOPTB                                                  04696000
CVTXPFP  EQU   CVTOPTA                                                  04697000
CVTASCII EQU   CVTOPTA                                                  04698000
CVTRSV13 EQU   CVTOPTA                                                  04699000
CVTRSV12 EQU   CVTOPTA                                                  04700000
CVTNIP   EQU   CVTOPTA                                                  04701000
CVTDDR   EQU   CVTOPTA                                                  04702000
CVTAPR   EQU   CVTOPTA                                                  04703000
CVTCCH   EQU   CVTOPTA                                                  04704000
CVTSNCTR EQU   CVTMAP+180                                               04705000
CVTQMWR  EQU   CVTMAP+176                                               04706000
CVTQOCR  EQU   CVTMAP+172                                               04707000
CVT1EF00 EQU   CVTMAP+168                                               04708000
CVTMZ00  EQU   CVTMAP+164                                               04709000
CVTHEAD  EQU   CVTMAP+160                                               04710000
CVTRSV11 EQU   CVTMAP+156                                               04711000
CVT0PT01 EQU   CVTMAP+152                                               04712000
CVTMSER  EQU   CVTMAP+148                                               04713000
CVTRV516 EQU   CVTIERLC                                                 04714000
CVTILCH  EQU   CVTMAP+140                                               04715000
CVT0DS   EQU   CVTMAP+136                                               04716000
CVTFBOSV EQU   CVTMAP+132                                               04717000
CVTNUCB  EQU   CVTMAP+128                                               04718000
CVTIXAVL EQU   CVTMAP+124                                               04719000
CVTIOQET EQU   CVTMAP+120                                               04720000
CVTDCBA  EQU   CVTMAP+117                                               04721000
CVTMVS2  EQU   CVTDCB                                                   04722000
CVT6DAT  EQU   CVTDCB                                                   04723000
CVT4MPS  EQU   CVTDCB                                                   04724000
CVTRSV09 EQU   CVTDCB                                                   04725000
CVT4MS1  EQU   CVTDCB                                                   04726000
CVT2SPS  EQU   CVTDCB                                                   04727000
CVT1SSS  EQU   CVTDCB                                                   04728000
CVTRSV08 EQU   CVTDCB                                                   04729000
CVTSTB   EQU   CVTMAP+112                                               04730000
CVTQTD00 EQU   CVTMAP+108                                               04731000
CVTQTE00 EQU   CVTMAP+104                                               04732000
CVTCUCB  EQU   CVTMAP+100                                               04733000
CVTSJQ   EQU   CVTMAP+96                                                04734000
CVTPBLDL EQU   CVTMAP+92                                                04735000
CVTTPC   EQU   CVTMAP+88                                                04736000
CVTSVDCB EQU   CVTMAP+84                                                04737000
CVTBRET  EQU   CVTMAP+82                                                04738000
CVTEXIT  EQU   CVTMAP+80                                                04739000
CVT0FN00 EQU   CVTMAP+76                                                04740000
CVTDARA  EQU   CVTDAR+1                                                 04741000
CVTRSV07 EQU   CVTFLGS1                                                 04742000
CVTRSV06 EQU   CVTFLGS1                                                 04743000
CVTRSV05 EQU   CVTFLGS1                                                 04744000
CVTRSV04 EQU   CVTFLGS1                                                 04745000
CVTRSV03 EQU   CVTFLGS1                                                 04746000
CVTRSV02 EQU   CVTFLGS1                                                 04747000
CVTRSV01 EQU   CVTFLGS1                                                 04748000
CVTDMPLK EQU   CVTFLGS1                                                 04749000
CVTXITP  EQU   CVTMAP+68                                                04750000
CVTZDTAB EQU   CVTMAP+64                                                04751000
CVTMSLT  EQU   CVTMAP+60                                                04752000
CVTDATE  EQU   CVTMAP+56                                                04753000
CVTBTERM EQU   CVTMAP+52                                                04754000
CVTSYSAD EQU   CVTMAP+48                                                04755000
CVTXTLER EQU   CVTMAP+44                                                04756000
CVTILK2  EQU   CVTMAP+40                                                04757000
CVTILK1  EQU   CVTMAP+36                                                04758000
CVTPRLTV EQU   CVTMAP+32                                                04759000
CVTPCNVT EQU   CVTMAP+28                                                04760000
CVT0VL00 EQU   CVTMAP+24                                                04761000
CVTXAPG  EQU   CVTMAP+20                                                04762000
CVTBUF   EQU   CVTMAP+16                                                04763000
CVTJOB   EQU   CVTMAP+12                                                04764000
CVTLINK  EQU   CVTMAP+8                                                 04765000
CVT0EF00 EQU   CVTMAP+4                                                 04766000
CVTTCBP  EQU   CVTMAP                                                   04767000
CVT      EQU   CVTMAP                                                   04768000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04769000
@RT00304 EQU   I00C0063                                                 04770000
@RT00315 EQU   I00C0068                                                 04771000
@RT00333 EQU   I00C0068                                                 04772000
@RT00339 EQU   I00C0068                                                 04773000
@RT00345 EQU   I00C0006                                                 04774000
@RT00348 EQU   I00C0006                                                 04775000
@RT00364 EQU   I00C0021                                                 04776000
@RT00387 EQU   I00C003X                                                 04777000
@RT00522 EQU   M080197                                                  04778000
@RT00541 EQU   I00C003E                                                 04779000
@RT00554 EQU   I00C0036                                                 04780000
@RT00556 EQU   I00C003D                                                 04781000
@RT00561 EQU   I00C0037                                                 04782000
@RT00588 EQU   I00C003D                                                 04783000
@RT00610 EQU   I00C0051                                                 04784000
@RT00629 EQU   I00C003D                                                 04785000
@RT00632 EQU   I00C003A                                                 04786000
@RT00634 EQU   I00C0038                                                 04787000
@RT00636 EQU   I00C003B                                                 04788000
@RT00638 EQU   I00C0039                                                 04789000
@RT00650 EQU   I00C0064                                                 04790000
@RT00652 EQU   I00C0064                                                 04791000
@RT00658 EQU   I00C0065                                                 04792000
@RT00727 EQU   I00C0082                                                 04793000
@RT00766 EQU   I00C0101                                                 04794000
@RT00769 EQU   I00C0101                                                 04795000
@RT00793 EQU   I00C0081                                                 04796000
@ENDDATA EQU   *                                                        04797000
         END   ISTIC000,(C'PLS1912',0701,78150)                         04798000
