         TITLE 'TEST INIT-MODULE ISTIC001                              *00001000
                        '                                               00002000
ISTIC001 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTIC001  76.244'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @02,@12,28(@13)                                     0001 00011000
         BALR  @12,0                                               0001 00012000
@PSTART  DS    0H                                                  0001 00013000
         USING @PSTART,@12                                         0001 00014000
         ST    @13,@SA00001+4                                      0001 00015000
         LA    @14,@SA00001                                        0001 00016000
         ST    @14,8(,@13)                                         0001 00017000
         LR    @13,@14                                             0001 00018000
         EJECT                                                          00019000
*                                                                  0227 00020000
*/********************************************************************/ 00021000
*/*            SAVE R4 HAS POINTER TO SYMBOLIC NAME                  */ 00022000
*/********************************************************************/ 00023000
*                                                                  0227 00024000
*   R4SAVE=R4;                                                     0227 00025000
         ST    R4,R4SAVE                                           0227 00026000
*   R3SAVE=R3;                                                     0228 00027000
         ST    R3,R3SAVE                                           0228 00028000
*   BASEREG=R12;                    /* SAVE BASE REG                 */ 00029000
         ST    R12,BASEREG                                         0229 00030000
*/********************************************************************/ 00031000
*/*      TEST  INIT      R3=PTR TO RCA                               */ 00032000
*/*      GET CORE FOR WORK AREA & 12K FOR OLT CONDITIONAL            */ 00033000
*/********************************************************************/ 00034000
*/*VGTMAIN SIZE(34816)STORAGE(NEWAREA)PAGE(YES)SUBPOOL(0)            */ 00035000
*                                                                  0230 00036000
*   DO;                             /* DECLARE AND RESTRICT REGISTERS   00037000
*                                      2,3, AND 4                    */ 00038000
*     DCL                                                          0231 00039000
*       GPR02F FIXED(31) REG(02);                                  0231 00040000
*     DCL                                                          0232 00041000
*       GPR02P PTR(31) REG(02);                                    0232 00042000
*     DCL                                                          0233 00043000
*       GPR03F FIXED(31) REG(03);                                  0233 00044000
*     DCL                                                          0234 00045000
*       GPR03P PTR(31) REG(03);                                    0234 00046000
*     DCL                                                          0235 00047000
*       GPR04F FIXED(31) REG(04);                                  0235 00048000
*     DCL                                                          0236 00049000
*       GPR04P PTR(31) REG(04);                                    0236 00050000
*     RFY                                                          0237 00051000
*      (GPR02P,                                                    0237 00052000
*       GPR03P,                                                    0237 00053000
*       GPR04P) RSTD;                                              0237 00054000
*     DCL                                                          0238 00055000
*       GPR15F FIXED(31) REG(15);                                  0238 00056000
*     DCL                                                          0239 00057000
*       GPR15P PTR(31) REG(15);     /* INVOKE XREGSET MACRO TO CHECK    00058000
*                                      SIZE PARM AND PUT VALUE IN  0239 00059000
*                                      REGISTER 2                    */ 00060000
*/*XREGSET  PID('SIZE')PPARM(34816)RREG(,GPR02F)OUTPUT(PARM)         */ 00061000
*                                                                  0240 00062000
*     DO;                                                          0240 00063000
*       GPR02F=34816;               /* SET RREG SYMBOL TO VALUE OF 0241 00064000
*                                      PPARM OPERAND                 */ 00065000
         L     GPR02F,@CF02662                                     0241 00066000
*     END;                          /* XREGSET INVOKE XREGSET MACRO     00067000
*                                      TO CHECK STORAGE PARM AND PUT    00068000
*                                      VALUE IN REGISTER 3           */ 00069000
*/*XREGSET  PID('STORAGE')PPARM(NEWAREA)RREG(,GPR03F)                */ 00070000
*                                                                  0243 00071000
*     DO;                                                          0243 00072000
*       GPR03F=ADDR(NEWAREA);       /* SET RREG SYMBOL TO ADDRESS OF    00073000
*                                      PPARM OPERAND                 */ 00074000
         LA    GPR03F,NEWAREA                                      0244 00075000
*     END;                          /* XREGSET INVOKE XREGSET MACRO     00076000
*                                      TO CHECK SUBPOOL PARM AND PUT    00077000
*                                      VALUE IN REGISTER 4           */ 00078000
*/*XREGSET  PID('SUBPOOL')PPARM(0)RREG(,GPR04F)OUTPUT(PARM)          */ 00079000
*                                                                  0246 00080000
*     DO;                                                          0246 00081000
*       GPR04F=0;                   /* SET RREG SYMBOL TO VALUE OF 0247 00082000
*                                      PPARM OPERAND                 */ 00083000
         SLR   GPR04F,GPR04F                                       0247 00084000
*     END;                          /* XREGSET INVOKE GETMAIN MACRO  */ 00085000
*     GEN REFS(GPR02F,GPR03P,GPR04F) SETS(GPR03P,GPR15F);          0249 00086000
         GETMAIN EC,LV=(2),A=(3),SP=(4),BNDRY=PAGE                      00087000
*                                   /* UNRESTRICT REGS 2,3, AND 4    */ 00088000
*     RFY                                                          0250 00089000
*      (GPR02P,                                                    0250 00090000
*       GPR03P,                                                    0250 00091000
*       GPR04P) UNRSTD;                                            0250 00092000
*   END;                            /* VGTMAIN                       */ 00093000
*   R5=R15;                         /* SAVE RTN CODE                 */ 00094000
         LR    R5,R15                                              0252 00095000
*   R3=R3SAVE;                      /* RESET R3 MACRO DESTROYED IT   */ 00096000
         L     R3,R3SAVE                                           0253 00097000
*   R4=R4SAVE;                      /* RESET R4 ALSO                 */ 00098000
         L     R4,R4SAVE                                           0254 00099000
*   R2=NEWAREA;                     /* PICK UP PASSED ADDR           */ 00100000
         L     R2,NEWAREA                                          0255 00101000
*   IF R5^=0                        /* IF RTN CODE NOT ZERO 14 K     */ 00102000
*     THEN                          /* NOT AVAILABLE IGORE REQ       */ 00103000
         LTR   R5,R5                                               0256 00104000
         BZ    @RF00256                                            0256 00105000
*     RETURN CODE(4);               /* RTN TO CALLER                 */ 00106000
         LA    @15,4                                               0257 00107000
@EL00001 L     @13,4(,@13)                                         0257 00108000
@EF00001 DS    0H                                                  0257 00109000
@ER00001 L     @14,12(,@13)                                        0257 00110000
         LM    @02,@12,28(@13)                                     0257 00111000
         BR    @14                                                 0257 00112000
*/********************************************************************/ 00113000
*/*      CLEAR GOTTEN AREA(2K + 12 5)                                */ 00114000
*/********************************************************************/ 00115000
*                                                                  0258 00116000
*   RESPECIFY                                                      0258 00117000
*    (R6,                                                          0258 00118000
*     R7) RESTRICTED;               /* WORK REGS FOR MVCL            */ 00119000
@RF00256 DS    0H                                                  0259 00120000
*/********************************************************************/ 00121000
*                                                                  0259 00122000
*I01C0000:                                                         0259 00123000
*   ;                                                              0259 00124000
I01C0000 DS    0H                                                  0260 00125000
*   $CURRTWA=R2;                    /* SAVE PTR TO CURRENT USER      */ 00126000
         ST    R2,$CURRTWA(,RCAPTR)                                0260 00127000
*   R4=R2;                          /* PTR TO AREA TO FLD            */ 00128000
         LR    R4,R2                                               0261 00129000
*   R5=34816;                       /* SIZE OF TO FLD                */ 00130000
         L     R5,@CF02662                                         0262 00131000
*   R6=R2;                          /* PTR TO AREA FROM FLD          */ 00132000
         LR    R6,R2                                               0263 00133000
*   R7=0;                           /* NO SIZE FROM STRTS PADDNG     */ 00134000
         SLR   R7,R7                                               0264 00135000
*   GEN(MVCL  R4,R6);               /* WITH HI BYTE OF R7='00'X      */ 00136000
         MVCL  R4,R6                                                    00137000
*/********************************************************************/ 00138000
*/*      CALL TABLE SRCH ROUTINE TO CHAIN WORK AREA                  */ 00139000
*/********************************************************************/ 00140000
*                                                                  0266 00141000
*   QACB=R3;                        /* SET ACB PTR IN PARM           */ 00142000
         ST    R3,QACB                                             0266 00143000
*   QPTR=R2;                        /* SET PTR IN PARM               */ 00144000
         ST    R2,QPTR                                             0267 00145000
*   QCODE='03'X;                                                   0268 00146000
         MVI   QCODE,X'03'                                         0268 00147000
*   R1=ADDR(QHNLPARM);              /* SET PTR TO PARM               */ 00148000
         LA    R1,QHNLPARM                                         0269 00149000
*   CALL ISTCC015;                                                 0270 00150000
         L     @15,@CV00054                                        0270 00151000
         BALR  @14,@15                                             0270 00152000
*   R5=R15;                         /* SAVE RETURN CODE              */ 00153000
         LR    R5,R15                                              0271 00154000
*   IF R5^=0                        /* TEST FOR A ZERO SICCESS       */ 00155000
*     THEN                          /* IF NOT ZERO UNSUCCESSFUL      */ 00156000
         LTR   R5,R5                                               0272 00157000
         BZ    @RF00272                                            0272 00158000
*     DO;                           /* IGNORE LOGON                  */ 00159000
*/*VFRMAIN  SIZE(34816)STORAGE((R2))SUBPOOL(0)                       */ 00160000
*                                                                  0274 00161000
*       DO;                                                        0274 00162000
*         DCL                                                      0275 00163000
*           GPR00F FIXED(31) REG(00);                              0275 00164000
*         DCL                                                      0276 00165000
*           GPR00P PTR(31) REG(00);                                0276 00166000
*         RFY                                                      0277 00167000
*          (GPR00P) RSTD;           /* PUT VALUE PASSED AS SIZE PARM    00168000
*                                      IN THREE LOW-ORDER BYTES OF 0277 00169000
*                                      REG 0                         */ 00170000
*         GPR00F=34816&'00FFFFFF'X;                                0278 00171000
         L     GPR00F,@CF02662                                     0278 00172000
*         RFY                                                      0279 00173000
*          (GPR15P) RSTD;           /* PUT SUBPOOL PARM IN HIGH-   0279 00174000
*                                      ORDER BYTE OF REG 15          */ 00175000
*         GPR15F=0;                                                0280 00176000
         SLR   GPR15F,GPR15F                                       0280 00177000
*         SLL(GPR15P,24);           /* COMBINE SUBPOOL AND SIZE IN 0281 00178000
*                                      REGISTER 0                    */ 00179000
         SLL   GPR15P,24                                           0281 00180000
*         GPR00P=GPR00P|GPR15P;                                    0282 00181000
         OR    GPR00P,GPR15P                                       0282 00182000
*         RFY                                                      0283 00183000
*          (GPR15P) UNRSTD;         /* DECLARE AND RESTRICT REG 1    */ 00184000
*         DCL                                                      0284 00185000
*           GPR01F FIXED(31) REG(01);                              0284 00186000
*         DCL                                                      0285 00187000
*           GPR01P PTR(31) REG(01);                                0285 00188000
*         RFY                                                      0286 00189000
*          (GPR01P) RSTD;           /* INVOKE XREGSET MACRO TO CHECK    00190000
*                                      STORAGE PARM AND PUT ADDR IN     00191000
*                                      REGISTER 1                    */ 00192000
*/*XREGSET  PID('STORAGE')PPARM((R2))RREG(1,GPR01P)                  */ 00193000
*                                                                  0287 00194000
*         DO;                                                      0287 00195000
*           GPR01P=R2;              /* SET RREG SYMBOL TO VALUE OF 0288 00196000
*                                      PPARM OPERAND                 */ 00197000
         LR    GPR01P,R2                                           0288 00198000
*         END;                      /* XREGSET INVOKE FREEMAIN MACRO */ 00199000
*         GEN;                                                     0290 00200000
         FREEMAIN R,LV=(0),A=(1)                                        00201000
*                                   /* UNRESTRICT REG 1              */ 00202000
*         RFY                                                      0291 00203000
*          (GPR01P) UNRSTD;         /* UNRESTRICT REG 0              */ 00204000
*         RFY                                                      0292 00205000
*          (GPR00P) UNRSTD;                                        0292 00206000
*       END;                        /* VFRMAIN                       */ 00207000
*       RETURN CODE(4);             /* RETURN BAD CODE               */ 00208000
         LA    @15,4                                               0294 00209000
         L     @13,4(,@13)                                         0294 00210000
         L     @14,12(,@13)                                        0294 00211000
         LM    @02,@12,28(@13)                                     0294 00212000
         BR    @14                                                 0294 00213000
*     END;                                                         0295 00214000
*                                                                  0295 00215000
*/********************************************************************/ 00216000
*                                                                  0296 00217000
*   GEN(EJECT);                                                    0296 00218000
@RF00272 DS    0H                                                  0296 00219000
         EJECT                                                          00220000
*                                                                  0297 00221000
*/********************************************************************/ 00222000
*/*      INITIALIZE RCA IF 1ST TIME  R4 HAS SYMBOLIC NAME            */ 00223000
*/********************************************************************/ 00224000
*                                                                  0297 00225000
*   IF $USECNT^=1                   /* TEST FOR 1ST USER             */ 00226000
*     THEN                          /* IF NOT 1 SKIP INIT.           */ 00227000
         CLC   $USECNT(2,RCAPTR),@CH00033                          0297 00228000
         BNE   @RT00297                                            0297 00229000
*     GOTO I01C0001;                /* OF RCA AREA                   */ 00230000
*   $ABEND=ADDR(I01C0050);          /* SET POINTER TO ABEND          */ 00231000
         LA    @14,I01C0050                                        0299 00232000
         ST    @14,$ABEND(,RCAPTR)                                 0299 00233000
*   $CLEANP=ADDR(I01C0060);         /* SET PTR TO CLEANUP ROUTINE    */ 00234000
         LA    @14,I01C0060                                        0300 00235000
         ST    @14,$CLEANP(,RCAPTR)                                0300 00236000
*   $COMINT=ADDR(ISTIC002);         /* SET PTR TO COMMINICATION I    */ 00237000
         L     @14,@CV00049                                        0301 00238000
         ST    @14,$COMINT(,RCAPTR)                                0301 00239000
*/********************************************************************/ 00240000
*/*      INITIALIZE TEST WORK AREA(BASED(R2) & WAPTR) R4=SYMBOLIC NME*/ 00241000
*/********************************************************************/ 00242000
*                                                                  0302 00243000
*I01C0001:                                                         0302 00244000
*   ;                                                              0302 00245000
I01C0001 DS    0H                                                  0303 00246000
*   R4=R4SAVE;                      /* RESTORE REG 4 (SYM NAME)      */ 00247000
         L     R4,R4SAVE                                           0303 00248000
*   $SCTPTR=R2;                     /* SET PARMS FOR OLT             */ 00249000
         ST    R2,$SCTPTR(,WAPTR)                                  0304 00250000
*   $SCTPTR8=R2+8;                  /*                               */ 00251000
         LA    @14,8                                               0305 00252000
         ALR   @14,R2                                              0305 00253000
         ST    @14,$SCTPTR8(,WAPTR)                                0305 00254000
*   $RCA=R3;                        /* SET PTR TO RCA                */ 00255000
         ST    R3,$RCA(,WAPTR)                                     0306 00256000
*   $ENDCOMM=ADDR($TLTEND);         /* SET PTR TO END OF RCA         */ 00257000
         LA    @14,$TLTEND(,RCAPTR)                                0307 00258000
         ST    @14,$ENDCOMM(,WAPTR)                                0307 00259000
*   $OLTPTR=R2+4096;                /* SET PTR TO STRT OLT AREA      */ 00260000
         LR    @14,R2                                              0308 00261000
         AL    @14,@CF00819                                        0308 00262000
         ST    @14,$OLTPTR(,WAPTR)                                 0308 00263000
*   $TEPBEGN=$TOLTEP;               /* SET PTR TO STRT TOLTEP        */ 00264000
         L     @14,$TOLTEP(,RCAPTR)                                0309 00265000
         ST    @14,$TEPBEGN(,WAPTR)                                0309 00266000
*   $TEPEND=ADDR(ISTEC000);         /* SET PTR TO END TOLTEP         */ 00267000
         L     @14,@CV00046                                        0310 00268000
         ST    @14,$TEPEND(,WAPTR)                                 0310 00269000
*   $PASSON=ADDR($PASSONA);         /* SET PTR TO PASSON AREA        */ 00270000
         LA    @14,$PASSONA(,WAPTR)                                0311 00271000
         ST    @14,$PASSON(,WAPTR)                                 0311 00272000
*   $TLCNT=1;                       /* SET TEST LOOP TO 500          */ 00273000
         LA    @11,1                                               0312 00274000
         STH   @11,$TLCNT(,WAPTR)                                  0312 00275000
*   $HIMOREC=R2+34816;              /* SET PTR TO HI OLT AREA        */ 00276000
         LR    @00,R2                                              0313 00277000
         AL    @00,@CF02662                                        0313 00278000
         ST    @00,$HIMOREC(,WAPTR)                                0313 00279000
*   $TLTRPL1=$TLTPRPL;              /* SET RPL TO TEST WORK AREA     */ 00280000
         MVC   $TLTRPL1(120,WAPTR),$TLTPRPL(RCAPTR)                0314 00281000
*   $TLTRPL2=$TLTRPL1;                                             0315 00282000
         MVC   $TLTRPL2(120,WAPTR),$TLTRPL1(WAPTR)                 0315 00283000
*   $TLTRPL3=$TLTRPL1;              /* SET UP SEND/RECEIVE RPL     0316 00284000
*                                                            @D32JPPW*/ 00285000
         MVC   $TLTRPL3(120,WAPTR),$TLTRPL1(WAPTR)                 0316 00286000
*   $TOLBRTB=ADDR($TABLE);          /* SET PTR TO BRANCH TABLE       */ 00287000
         LA    @10,$TABLE                                          0317 00288000
         ST    @10,$TOLBRTB(,WAPTR)                                0317 00289000
*   #TABLE=ADDR($TABLE);            /* SET POINTER FOR OLT           */ 00290000
         ST    @10,#TABLE(,WAPTR)                                  0318 00291000
*   #PASS=ADDR($PASSONA);           /* SET POINTER TO PASS AREA      */ 00292000
         ST    @14,#PASS(,WAPTR)                                   0319 00293000
*   #EXT=ADDR($EXTA);               /* SET POINTER FOR OLT           */ 00294000
         LA    @14,$EXTA(,WAPTR)                                   0320 00295000
         ST    @14,#EXT(,WAPTR)                                    0320 00296000
*   #EXITA=ADDR(ISTCC014);          /* SET POINTER TO SCM            */ 00297000
         L     @14,@CV00053                                        0321 00298000
         ST    @14,#EXITA(,WAPTR)                                  0321 00299000
*   $NOPRT='1'B;                    /* SET DEFAULT OPTIONS           */ 00300000
*   $FSTCOMM='1'B;                                                 0323 00301000
         OI    $NOPRT(WAPTR),B'00000101'                           0323 00302000
*   $NOCNTRL='1'B;                                                 0324 00303000
         OI    $NOCNTRL(WAPTR),B'00001000'                         0324 00304000
*   $SYSMN(1)=SYMNME;               /* MOVE TERM NAME TO DEV TAB   0325 00305000
*                                                            @D32JPPW*/ 00306000
         MVC   $SYSMN(8,WAPTR),SYMNME(R4)                          0325 00307000
*   $ENDNODE(1)='1'B;               /* SET END NODE INDICATOR        */ 00308000
*   $REMOTE(1)='1'B;                /* SET REMOTE IND                */ 00309000
         OI    $ENDNODE(WAPTR),B'11000000'                         0327 00310000
*   $DRIVER=$TLTEND;                /* SET DRIVER ID                 */ 00311000
         MVC   $DRIVER(1,WAPTR),$TLTEND(RCAPTR)                    0328 00312000
*   $DEVCNTS=1;                     /* SET DEV COUNTS TO ONE         */ 00313000
         STH   @11,$DEVCNTS(,WAPTR)                                0329 00314000
*   $DVINCT(1)=LENGTH($TRMINPT);    /* SET READ IN COUNT     @D32JPPW*/ 00315000
         MVI   $DVINCT(WAPTR),X'50'                                0330 00316000
*   $DVSEQNO=1;                     /* INBOUND SEQNO START AT 1    0331 00317000
*                                                            @ZD10885*/ 00318000
         STH   @11,$DVSEQNO(,WAPTR)                                0331 00319000
*   $ACQRED(1)='1'B;                /* SET ACQUIRED BIT ON           */ 00320000
         OI    $ACQRED(WAPTR),B'01000000'                          0332 00321000
*   $NOTDEV(2)='1'B;                /* INDICATE NO ALT PR YET        */ 00322000
         OI    $NOTDEV+68(WAPTR),B'10000000'                       0333 00323000
*   $LGON='1'B;                     /* INDICATE 1ST TIME BIT         */ 00324000
         OI    $LGON(WAPTR),B'01000000'                            0334 00325000
*   $RETCODE='1'B;                  /* SET RTN CDE HNDL SUPPORTED    */ 00326000
         OI    $RETCODE(WAPTR),B'00001000'                         0335 00327000
*   IF $TPLOGON='1'B                /* SET BIT IF LOGON REQ          */ 00328000
*     THEN                          /* DO NOT SET FOR RFT REQ        */ 00329000
         TM    $TPLOGON(RCAPTR),B'01000000'                        0336 00330000
         BNO   @RF00336                                            0336 00331000
*     $CTLOGON='1'B;                /* SET PERM IND ON               */ 00332000
         OI    $CTLOGON(WAPTR),B'10000000'                         0337 00333000
*   $OPCOM='1'B;                    /* SET OPERATOR COMM FLAG ON   0338 00334000
*                                                            @D32JPFR*/ 00335000
@RF00336 OI    $OPCOM(WAPTR),B'10000000'                           0338 00336000
*   IF SYMNME=SYSCON                /* IS THIS SYSTEM CONSL  @D32JPPW*/ 00337000
*     THEN                          /* IF YES SET $OPCOM BIT ON      */ 00338000
         CLC   SYMNME(8,R4),SYSCON                                 0339 00339000
         BNE   @RF00339                                            0339 00340000
*     DO;                                                          0340 00341000
*       $OPCOM='1'B;                                               0341 00342000
         OI    $OPCOM(WAPTR),B'10000000'                           0341 00343000
*       GOTO I01C0002;                                             0342 00344000
         B     I01C0002                                            0342 00345000
*     END;                                                         0343 00346000
*   R5=ADDR($SYSMN(1));                                            0344 00347000
@RF00339 LA    R5,$SYSMN(,WAPTR)                                   0344 00348000
*   GEN(MVC   $TLTNIB+L12(L8,R3),L0(R5));/* MOVE NAME TO NIB         */ 00349000
         MVC   $TLTNIB+L12(L8,R3),L0(R5)                                00350000
*   R5=ADDR($BUFFS);                /* SET AREA FOR INQUIRE          */ 00351000
         LA    R5,$BUFFS(,RCAPTR)                                  0346 00352000
*   R4=ADDR($TLTRPL1);              /* SET ADDR TO RPL               */ 00353000
         LA    R4,$TLTRPL1(,WAPTR)                                 0347 00354000
*   R6=ADDR($TLTNIB);               /* SET ADDR TP NIB               */ 00355000
         LA    R6,$TLTNIB(,RCAPTR)                                 0348 00356000
*   GEN;                                                           0349 00357000
         INQUIRE RPL=(R4),ACB=(R3),NIB=(R6),AREA=(R5),AREALEN=16,      X00358000
               OPTCD=(SYN,DEVCHAR)                                      00359000
*   IF R15^=0 THEN                  /* CHECK RC FROM INQUIRE @D32JPFR*/ 00360000
         LTR   R15,R15                                             0350 00361000
         BNZ   @RT00350                                            0350 00362000
*     GOTO I01C001B;                /* SET BAD RET CODE      @D32JPFR*/ 00363000
*   $DEVAREA=$BUFFS(1:4);           /* SAVE DEVCHARS         @D32JPFR*/ 00364000
         MVC   $DEVAREA(4,RCAPTR),$BUFFS(RCAPTR)                   0352 00365000
*   RFY                                                            0353 00366000
*     ISTNIB BASED(ADDR($TLTNIB));  /*                       @D32JPFR*/ 00367000
*   RFY                                                            0354 00368000
*     ISTDEVCH BASED(ADDR($DEVAREA));/*                      @D32JPFR*/ 00369000
*   NIBMODE(1:8)='BASIC   ';        /* DEFAULT IS BASIC      @D32JPFR*/ 00370000
         LA    @14,384                                             0355 00371000
         ALR   @14,RCAPTR                                          0355 00372000
         MVC   NIBMODE(8,@14),@CC02680                             0355 00373000
*   IF DEVTCODE=DEVLU THEN          /* IS THIS AN LU         @D32JPFR*/ 00374000
         CLI   DEVTCODE+600(RCAPTR),X'6D'                          0356 00375000
         BNE   @RF00356                                            0356 00376000
*     DO;                           /* YES                   @D32JPFR*/ 00377000
*       NIBMODE(1:8)='RECORD  ';    /* SET RECORD IN NIB     @D32JPFR*/ 00378000
         MVC   NIBMODE(8,@14),@CC02681                             0358 00379000
*       NIBLMODE='0000000000000000'X;/* ZERO OUT             @D32JPFR*/ 00380000
         MVC   NIBLMODE(8,@14),@CB02682                            0359 00381000
*       RFY                                                        0360 00382000
*         R10 RSTD;                                                0360 00383000
*       R10=LENGTH(ISTBIND);        /* GET LENGTH OF BIND PARMS    0361 00384000
*                                                            @D32JPFR*/ 00385000
         LA    R10,36                                              0361 00386000
*       GEN;                                                       0362 00387000
         INQUIRE RPL=(R4),ACB=(R3),NIB=(R6),AREA=(R5),AREALEN=(R10),   X00388000
               OPTCD=(SYN,SESSPARM)                                     00389000
*       RFY                                                        0363 00390000
*         R10 UNRSTD;                                              0363 00391000
*       IF R15^=0 THEN              /* CHECK RC              @D32JPFR*/ 00392000
         LTR   R15,R15                                             0364 00393000
         BZ    @RF00364                                            0364 00394000
*         DO;                       /* YES                   @D32JPFR*/ 00395000
*I01C001B:                                                         0366 00396000
*           RETCODE=8;              /* SET BAD RC            @D32JPFR*/ 00397000
I01C001B MVC   RETCODE(4),@CF00069                                 0366 00398000
*           GOTO I01C001C;          /* AND RETURN            @D32JPFR*/ 00399000
         B     I01C001C                                            0367 00400000
*         END;                      /*                       @D32JPFR*/ 00401000
*       RFY                                                        0369 00402000
*         ISTBIND BASED(ADDR($BUFFS));/*                     @D32JPFR*/ 00403000
@RF00364 DS    0H                                                  0370 00404000
*       R1=ADDR(BINFM);             /* GET PTR TO SESSPARMS  @D32JPFR*/ 00405000
         LA    R1,BINFM+464(,RCAPTR)                               0370 00406000
*       CALL I01C1500;              /* MODIFY BIND PARMS FOR CT      */ 00407000
         BAL   @14,I01C1500                                        0371 00408000
*       $DEVSESP(1)=$BUFFS(2:7);    /* MOVE TO TWA           @D32JPFR*/ 00409000
         MVC   $DEVSESP(6,WAPTR),$BUFFS+1(RCAPTR)                  0372 00410000
*       NIBNDAR=ADDR($BUFFS);       /* PT TO THEM FROM NIB   @D32JPFR*/ 00411000
         LA    @14,$BUFFS(,RCAPTR)                                 0373 00412000
         ST    @14,NIBNDAR+384(,RCAPTR)                            0373 00413000
*     END;                                                         0374 00414000
*   NIBUSER=R2;                     /* FILL IN RPL USER FLD WITH ADDR   00415000
*                                      OF TWA                @DM00894*/ 00416000
@RF00356 ST    R2,NIBUSER+384(,RCAPTR)                             0375 00417000
*   GEN;                                                           0376 00418000
  OPNDST RPL=(R4),ACB=(R3),NIB=(R6),OPTCD=(SYN,SPEC,NQ,CONANY,ACCEPT)   00419000
*   IF R15^=0 THEN                  /* CHK RC                @D32JPFR*/ 00420000
         LTR   R15,R15                                             0377 00421000
         BZ    @RF00377                                            0377 00422000
*     DO;                           /*                       @D32JPFR*/ 00423000
*       RETCODE=16;                 /* SET BAD RC            @D32JPFR*/ 00424000
         MVC   RETCODE(4),@CF00098                                 0379 00425000
*I01C001C:                          /*                       @D32JPFR*/ 00426000
*       QACB=R3;                    /* SET ACB PTR IN PARM   @D32JPFR*/ 00427000
I01C001C ST    R3,QACB                                             0380 00428000
*       QPTR=R2;                    /* SET PTR IN PARM       @D32JPFR*/ 00429000
         ST    R2,QPTR                                             0381 00430000
*       QCODE='04'X;                /* SET CODE TO UNCHAIN   @D32JPFR*/ 00431000
         MVI   QCODE,X'04'                                         0382 00432000
*       R1=ADDR(QHNLPARM);          /* SET PTR TO PARM       @D32JPFR*/ 00433000
         LA    R1,QHNLPARM                                         0383 00434000
*       CALL ISTCC015;              /* CALL TABLE SEARCH     @D32JPFR*/ 00435000
         L     @15,@CV00054                                        0384 00436000
         BALR  @14,@15                                             0384 00437000
*/*VFRMAIN  SIZE(34816)STORAGE((R2))SUBPOOL(0)                       */ 00438000
*                                                                  0385 00439000
*       DO;                                                        0385 00440000
*         RFY                                                      0386 00441000
*          (GPR00P) RSTD;           /* PUT VALUE PASSED AS SIZE PARM    00442000
*                                      IN THREE LOW-ORDER BYTES OF 0386 00443000
*                                      REG 0                         */ 00444000
*         GPR00F=34816&'00FFFFFF'X;                                0387 00445000
         L     GPR00F,@CF02662                                     0387 00446000
*         RFY                                                      0388 00447000
*          (GPR15P) RSTD;           /* PUT SUBPOOL PARM IN HIGH-   0388 00448000
*                                      ORDER BYTE OF REG 15          */ 00449000
*         GPR15F=0;                                                0389 00450000
         SLR   GPR15F,GPR15F                                       0389 00451000
*         SLL(GPR15P,24);           /* COMBINE SUBPOOL AND SIZE IN 0390 00452000
*                                      REGISTER 0                    */ 00453000
         SLL   GPR15P,24                                           0390 00454000
*         GPR00P=GPR00P|GPR15P;                                    0391 00455000
         OR    GPR00P,GPR15P                                       0391 00456000
*         RFY                                                      0392 00457000
*          (GPR15P) UNRSTD;         /* DECLARE AND RESTRICT REG 1    */ 00458000
*         RFY                                                      0393 00459000
*          (GPR01P) RSTD;           /* INVOKE XREGSET MACRO TO CHECK    00460000
*                                      STORAGE PARM AND PUT ADDR IN     00461000
*                                      REGISTER 1                    */ 00462000
*/*XREGSET  PID('STORAGE')PPARM((R2))RREG(1,GPR01P)                  */ 00463000
*                                                                  0394 00464000
*         DO;                                                      0394 00465000
*           GPR01P=R2;              /* SET RREG SYMBOL TO VALUE OF 0395 00466000
*                                      PPARM OPERAND                 */ 00467000
         LR    GPR01P,R2                                           0395 00468000
*         END;                      /* XREGSET INVOKE FREEMAIN MACRO */ 00469000
*         GEN;                                                     0397 00470000
         FREEMAIN R,LV=(0),A=(1)                                        00471000
*                                   /* UNRESTRICT REG 1              */ 00472000
*         RFY                                                      0398 00473000
*          (GPR01P) UNRSTD;         /* UNRESTRICT REG 0              */ 00474000
*         RFY                                                      0399 00475000
*          (GPR00P) UNRSTD;                                        0399 00476000
*       END;                        /* VFRMAIN                       */ 00477000
*       R15=RETCODE;                /* PICK UP RET CODE      @D32JPFR*/ 00478000
         L     R15,RETCODE                                         0401 00479000
*       RETURN;                     /* RETURN TO IC000       @D32JPFR*/ 00480000
         B     @EL00001                                            0402 00481000
*     END;                          /*                       @D32JPFR*/ 00482000
*   $CID(1)=R4->RPLARG;             /*                       @D32JPFR*/ 00483000
@RF00377 MVC   $CID(4,WAPTR),RPLARG(R4)                            0404 00484000
*   GEN;                                                           0405 00485000
          INQUIRE RPL=(R4),ACB=(R3),NIB=(R6),AREA=(R5),                X00486000
               AREALEN=16,OPTCD=(SYN,RNNAME)                            00487000
*   IF R15^=0                       /* TEST FOR SUCCESSFUL INQ       */ 00488000
*     THEN                          /* IF NOT SUCC TERM IS A LCL     */ 00489000
         LTR   R15,R15                                             0406 00490000
         BZ    @RF00406                                            0406 00491000
*     $REMOTE(1)='0'B;              /* DEVICE-RESET BIT              */ 00492000
         NI    $REMOTE(WAPTR),B'10111111'                          0407 00493000
*I01C001A:                                                         0408 00494000
*   IF DEVTCODE^=DEVLU THEN         /* IS DEV AN LU          @D32JPFR*/ 00495000
@RF00406 DS    0H                                                  0408 00496000
I01C001A CLI   DEVTCODE+600(RCAPTR),X'6D'                          0408 00497000
         BE    @RF00408                                            0408 00498000
*     DO;                           /* YES                   @D32JPFR*/ 00499000
*       R4=$CVTSAVE;                /* GET PTR TO CVT                */ 00500000
         L     R4,$CVTSAVE(,RCAPTR)                                0410 00501000
*       IFTPABPR=ADDR($IFTOUT(1));  /* SET PTR IN PARM LIST TO       */ 00502000
         LA    @14,IFTPL                                           0411 00503000
         LA    @00,$IFTOUT(,WAPTR)                                 0411 00504000
         ST    @00,IFTPABPR(,@14)                                  0411 00505000
*       IFTFPABP='1'B;              /* GET DAF'S & PABS              */ 00506000
*       IFTSTDAF='1'B;                                             0413 00507000
         OI    IFTFPABP(@14),B'00100001'                           0413 00508000
*       IFTTPPST='1'B;              /* SET FOR VPOST                 */ 00509000
         OI    IFTTPPST(@14),B'10000000'                           0414 00510000
*       IFTSYMRT=' ';               /* CLEAR LNAME FLD TO BINKS      */ 00511000
         MVI   IFTSYMRT+1(@14),C' '                                0415 00512000
         MVC   IFTSYMRT+2(6,@14),IFTSYMRT+1(@14)                   0415 00513000
         MVI   IFTSYMRT(@14),C' '                                  0415 00514000
*       IFTSYMOV=$SYSMN(1);         /* FILL IN DEV NAME              */ 00515000
         MVC   IFTSYMOV(8,@14),$SYSMN(WAPTR)                       0416 00516000
*       IFTECB=0;                   /* CLEAR ECB                     */ 00517000
         SLR   @00,@00                                             0417 00518000
         ST    @00,IFTECB                                          0417 00519000
*       IF $REMOTE(1)='1'B          /* GET LINE NAME IF DEV          */ 00520000
*         THEN                      /* IS REMOTE                     */ 00521000
         TM    $REMOTE(WAPTR),B'01000000'                          0418 00522000
         BNO   @RF00418                                            0418 00523000
*         IFTFLNNM='1'B;                                           0419 00524000
         OI    IFTFLNNM(@14),B'00010000'                           0419 00525000
*       ELSE                        /* IF LOCAL TURN OFF REQ         */ 00526000
*         IFTFLNNM='0'B;            /* BIT                           */ 00527000
         B     @RC00418                                            0420 00528000
@RF00418 LA    @14,IFTPL                                           0420 00529000
         NI    IFTFLNNM(@14),B'11101111'                           0420 00530000
*       R0=ADDR(TIE);               /* POINT TO ELEMENT TO ADD     0421 00531000
*                                                            @D32JPPW*/ 00532000
@RC00418 LA    R0,TIE                                              0421 00533000
*       R1=ADDR(DYPPAB);            /* POINT TO PAB TO ADD TO      0422 00534000
*                                                            @D32JPPW*/ 00535000
         LA    R1,DYPPAB+656(,R4)                                  0422 00536000
*       CALL I00C1000;              /* TPQUE                 @D32JPPW*/ 00537000
         L     @15,@CV02694                                        0423 00538000
         BALR  @14,@15                                             0423 00539000
*       R1=ADDR(IFTECB);            /* POINT TO ECB & WAIT           */ 00540000
         LA    R1,IFTECB                                           0424 00541000
*       CALL I00C1002;              /* WAIT ON ECB           @D32JPPW*/ 00542000
         L     @15,@CV02695                                        0425 00543000
         BALR  @14,@15                                             0425 00544000
*       $LINENME(1)=IFTSYMRT;       /* PLACE LINE NAME IN DEVTBL     */ 00545000
         LA    @14,IFTPL                                           0426 00546000
         MVC   $LINENME(8,WAPTR),IFTSYMRT(@14)                     0426 00547000
*     END;                          /*                       @D32JPFR*/ 00548000
*/********************************************************************/ 00549000
*/*            EXIT TO CALLER                                        */ 00550000
*/********************************************************************/ 00551000
*                                                                  0428 00552000
*I01C0002:                                                         0428 00553000
*   ;                                                              0428 00554000
@RF00408 DS    0H                                                  0428 00555000
I01C0002 DS    0H                                                  0429 00556000
*   IF $USECNT=1&                   /* IS IT 1ST TIME & NOT SYS CON  */ 00557000
*       $SYSMN(1,1:8)^='SYS CON '&  /* POST ECB IF NEEDED    @D32JPFR*/ 00558000
*       $NEWCT='0'B THEN            /* SKIP POST IF SYSCON OR NOT 1ST*/ 00559000
         CLC   $USECNT(2,RCAPTR),@CH00033                          0429 00560000
         BNE   @RF00429                                            0429 00561000
         CLC   $SYSMN(8,WAPTR),@CC00078                            0429 00562000
         BE    @RF00429                                            0429 00563000
         TM    $NEWCT(RCAPTR),B'00000100'                          0429 00564000
         BNZ   @RF00429                                            0429 00565000
*     DO;                                                          0430 00566000
*       DO;                         /* LISATCVT STATUS(INQUIRE)CVTBAS   00567000
*                                      E(PAGEABLE,(R4))              */ 00568000
*         R4=ATCLCPTR;              /* SET UP ATCVT POINTER          */ 00569000
         L     R4,ATCLCPTR                                         0432 00570000
*         RFY                                                      0433 00571000
*          (EMCR15) RSTD;                                          0433 00572000
*         GEN SETS(EMCR15)(L     EMCR15,X'10' POINT TO CVT);       0434 00573000
         L     EMCR15,X'10' POINT TO CVT                                00574000
*         IF ATCLCPTR->ATCACTIV='1'B/* IS VTAM MARKED ACTIVE         */ 00575000
*             &ATCLCPTR->ATCSNHLT='0'B/* AND NOT HALTING             */ 00576000
*             &ATCLCPTR->ATCQKHLT='0'B THEN                        0435 00577000
         L     @14,ATCLCPTR                                        0435 00578000
         TM    ATCACTIV(@14),B'01000000'                           0435 00579000
         BNO   @RF00435                                            0435 00580000
         TM    ATCSNHLT(@14),B'00110000'                           0435 00581000
         BNZ   @RF00435                                            0435 00582000
*           EMCR15=0;               /* YES, INDICATE VTAM ACTIVE     */ 00583000
         SLR   EMCR15,EMCR15                                       0436 00584000
*         ELSE                      /* NO, VTAM NOT ACTIVE           */ 00585000
*           EMCR15=4;               /* INDICATE VTAM INACTIVE        */ 00586000
         B     @RC00435                                            0437 00587000
@RF00435 LA    EMCR15,4                                            0437 00588000
*         RFY                                                      0438 00589000
*          (EMCR15) UNRSTD;                                        0438 00590000
@RC00435 DS    0H                                                  0439 00591000
*       END;                        /* LISATCVT                      */ 00592000
*       R1=ADDR(ATCECTLP);          /* PICK UP ECB ADDR              */ 00593000
         LA    R1,ATCECTLP(,R4)                                    0440 00594000
*       CALL I00C1001;              /* POST ECB              @D32JPPW*/ 00595000
         L     @15,@CV02698                                        0441 00596000
         BALR  @14,@15                                             0441 00597000
*     END;                                                         0442 00598000
*   $CIREQ='1'B;                                                   0443 00599000
@RF00429 OI    $CIREQ(WAPTR),B'00000001'                           0443 00600000
*   RETURN CODE(0);                                                0444 00601000
*                                                                  0444 00602000
         SLR   @15,@15                                             0444 00603000
         L     @13,4(,@13)                                         0444 00604000
         L     @14,12(,@13)                                        0444 00605000
         LM    @02,@12,28(@13)                                     0444 00606000
         BR    @14                                                 0444 00607000
*/********************************************************************/ 00608000
*                                                                  0445 00609000
*   GEN(EJECT);                                                    0445 00610000
         EJECT                                                          00611000
*                                                                  0446 00612000
*/********************************************************************/ 00613000
*/*      ABEND ROUTINE  R3 PTR TO RCA  R2 PTR TWA ABENDING           */ 00614000
*/********************************************************************/ 00615000
*                                                                  0446 00616000
*I01C0050:                                                         0446 00617000
*   ;                                                              0446 00618000
I01C0050 DS    0H                                                  0447 00619000
*   GEN;                                                           0447 00620000
         USING *,R15                                                    00621000
         STM   R14,R12,12(R13)                                          00622000
         L     R12,BASEREG              /* SET BASE REG SAVED BEFORE */ 00623000
         DROP  R15                                                      00624000
*   R3=R13;                         /* SET UP SAVE AREA CHAINS       */ 00625000
         LR    R3,R13                                              0448 00626000
*   R13=ADDR(ABSAVE);               /* SET PTR TO ABEND'S SAVE       */ 00627000
         LA    R13,ABSAVE                                          0449 00628000
*   ABSAVE(2)=R3;                   /* CHAIN AREAS TOGETHER          */ 00629000
         ST    R3,ABSAVE+4                                         0450 00630000
*   BACKSAVE(3)=R13;                                               0451 00631000
         ST    R13,BACKSAVE+8(,R3)                                 0451 00632000
*   R3=$RCA;                        /* SET UP PTR TO RCA             */ 00633000
         L     R3,$RCA(,WAPTR)                                     0452 00634000
*   R5=R1;                          /* SET PTR FOR DUMP              */ 00635000
         LR    R5,R1                                               0453 00636000
*   R2=$CURRTWA;                    /* PICKUP TEST                   */ 00637000
         L     R2,$CURRTWA(,RCAPTR)                                0454 00638000
*   IF R2=0 THEN                                                   0455 00639000
         LTR   R2,R2                                               0455 00640000
         BZ    @RT00455                                            0455 00641000
*     GOTO I01C0051;                                               0456 00642000
*   $TEP1ST='0'B;                   /* SET ALL TWA'S                 */ 00643000
*   $TEP2ND='0'B;                   /* SWITCHES TO                   */ 00644000
*   $OLTMACC='0'B;                                                 0459 00645000
         NI    $TEP1ST(WAPTR),B'11011100'                          0459 00646000
*   $ENDTEST='0'B;                                                 0460 00647000
*   $POSTFLG='0'B;                                                 0461 00648000
         NI    $ENDTEST(WAPTR),B'10110111'                         0461 00649000
*   $REQSTOR='0'B;                                                 0462 00650000
         NI    $REQSTOR(WAPTR),B'11101111'                         0462 00651000
*   $ACTOPND='0'B;                                                 0463 00652000
*   $CLSSACT='0'B;                                                 0464 00653000
         NI    $ACTOPND(WAPTR),B'11111010'                         0464 00654000
*   $WAITFLG='0'B;                                                 0465 00655000
         NI    $WAITFLG(WAPTR),B'10111111'                         0465 00656000
*   $CIREQ='0'B;                                                   0466 00657000
         NI    $CIREQ(WAPTR),B'11111110'                           0466 00658000
*   $TEP3RD='0'B;                   /* STOP PROCESSING               */ 00659000
         NI    $TEP3RD(WAPTR),B'01111111'                          0467 00660000
*   $CIREQ='0'B;                                                   0468 00661000
         NI    $CIREQ(WAPTR),B'11111110'                           0468 00662000
*   IF $ABNDALL='0'B                /* IF BIT OFF A                  */ 00663000
*     THEN                          /* DUMP IS REQ                   */ 00664000
         TM    $ABNDALL(RCAPTR),B'00001000'                        0469 00665000
         BNZ   @RF00469                                            0469 00666000
*     DO;                           /*                               */ 00667000
*       $ABTERM='1'B;               /* SET ABEND IND                 */ 00668000
         OI    $ABTERM(WAPTR),B'00000010'                          0471 00669000
*       $HOLD='0'B;                 /* MSG DONE IN DUMP              */ 00670000
*                                                                  0472 00671000
         NI    $HOLD(WAPTR),B'11111110'                            0472 00672000
*       /*************************************************************/ 00673000
*       /*                                                           */ 00674000
*       /* TCEC MSGN(547)DIR(NET)CKABEND(YES) INVOKED                */ 00675000
*       /*                                                           */ 00676000
*       /*************************************************************/ 00677000
*                                                                  0473 00678000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00679000
         OI    $TCECM(WAPTR),B'00000001'                           0473 00680000
*       R1=ADDR($TCA48);            /* SET UP PARM LIST $TR          */ 00681000
         LA    R1,$TCA48                                           0474 00682000
*       IF $ABTERM='1'B             /* IS ABEND OCCURING             */ 00683000
*         THEN                                                     0475 00684000
         TM    $ABTERM(WAPTR),B'00000010'                          0475 00685000
         BNO   @RF00475                                            0475 00686000
*         CALL ISTSC020;            /* YES- CALL CECOM (TCEC) DIRECT */ 00687000
         L     @15,@CV00047                                        0476 00688000
         BALR  @14,@15                                             0476 00689000
*       ELSE                                                       0477 00690000
*         CALL #EXIT;               /* NO- CALL CECOM VIA RES MGR    */ 00691000
         B     @RC00475                                            0477 00692000
@RF00475 L     @15,#EXITA(,WAPTR)                                  0477 00693000
         BALR  @14,@15                                             0477 00694000
*       DCL                                                        0478 00695000
*         1 $TCA48,                 /* TCEC PARM LIST                */ 00696000
*          2 $TCB48 FIXED(32) INIT(547),/* MSG NUMBER                */ 00697000
*          2 $TCC48 FIXED(32) INIT(0),/* INCT LEN                    */ 00698000
*          2 $TCD48 BIT(8) INIT('00001100'B),/* FLAG                 */ 00699000
*          2 $TCE48 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK         */ 00700000
@RC00475 DS    0H                                                  0479 00701000
*       CALL ISTTC037;              /* GOTO DUMP                     */ 00702000
         L     @15,@CV00048                                        0479 00703000
         BALR  @14,@15                                             0479 00704000
*     END;                          /*                               */ 00705000
*I01C0051:                                                         0481 00706000
*   ;                                                              0481 00707000
@RF00469 DS    0H                                                  0481 00708000
I01C0051 DS    0H                                                  0482 00709000
*   IF $USECNT>0                    /* ANY MORE USERS                */ 00710000
*     THEN                          /* YES SEE IF ALL                */ 00711000
         LH    @14,$USECNT(,RCAPTR)                                0482 00712000
         LTR   @14,@14                                             0482 00713000
         BNP   @RF00482                                            0482 00714000
*     DO;                           /* MUST BE CANCELLD              */ 00715000
*       R2=$FSTAREA;                /* GET FIRST AREA                */ 00716000
         L     R2,$FSTAREA(,RCAPTR)                                0484 00717000
*       $HOLD='0'B;                 /* RELEASE HOLD                  */ 00718000
         NI    $HOLD(WAPTR),B'11111110'                            0485 00719000
*       $ABTERM='1'B;               /* SET ABEND INDICATOR           */ 00720000
         OI    $ABTERM(WAPTR),B'00000010'                          0486 00721000
*       CALL ISTTC035;              /* END CURRENT TEST              */ 00722000
*                                                                  0487 00723000
         L     @15,@CV00051                                        0487 00724000
         BALR  @14,@15                                             0487 00725000
*       /*************************************************************/ 00726000
*       /*                                                           */ 00727000
*       /* TCEC MSGN(547)CKABEND(YES) INVOKED                        */ 00728000
*       /*                                                           */ 00729000
*       /*************************************************************/ 00730000
*                                                                  0488 00731000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00732000
         OI    $TCECM(WAPTR),B'00000001'                           0488 00733000
*       R1=ADDR($TCA49);            /* SET UP PARM LIST $TR          */ 00734000
         LA    R1,$TCA49                                           0489 00735000
*       IF $ABTERM='1'B             /* IS ABEND OCCURING             */ 00736000
*         THEN                                                     0490 00737000
         TM    $ABTERM(WAPTR),B'00000010'                          0490 00738000
         BNO   @RF00490                                            0490 00739000
*         CALL ISTSC020;            /* YES- CALL CECOM (TCEC) DIRECT */ 00740000
         L     @15,@CV00047                                        0491 00741000
         BALR  @14,@15                                             0491 00742000
*       ELSE                                                       0492 00743000
*         CALL #EXIT;               /* NO- CALL CECOM VIA RES MGR    */ 00744000
         B     @RC00490                                            0492 00745000
@RF00490 L     @15,#EXITA(,WAPTR)                                  0492 00746000
         BALR  @14,@15                                             0492 00747000
*       DCL                                                        0493 00748000
*         1 $TCA49,                 /* TCEC PARM LIST                */ 00749000
*          2 $TCB49 FIXED(32) INIT(547),/* MSG NUMBER                */ 00750000
*          2 $TCC49 FIXED(32) INIT(0),/* INCT LEN                    */ 00751000
*          2 $TCD49 BIT(8) INIT('00000100'B),/* FLAG                 */ 00752000
*          2 $TCE49 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK         */ 00753000
@RC00490 DS    0H                                                  0494 00754000
*       $EOJ='1'B;                  /* SET AUTO EOJ                  */ 00755000
         OI    $EOJ(WAPTR),B'00000010'                             0494 00756000
*       CALL ISTTC035;              /* GO TO DETERM                  */ 00757000
         L     @15,@CV00051                                        0495 00758000
         BALR  @14,@15                                             0495 00759000
*       R1=R2;                                                     0496 00760000
*                                                                  0496 00761000
         LR    R1,R2                                               0496 00762000
*/*VFRMAIN  SIZE(34816)STORAGE((1))SUBPOOL(0)                        */ 00763000
*                                                                  0497 00764000
*       DO;                                                        0497 00765000
*         RFY                                                      0498 00766000
*          (GPR00P) RSTD;           /* PUT VALUE PASSED AS SIZE PARM    00767000
*                                      IN THREE LOW-ORDER BYTES OF 0498 00768000
*                                      REG 0                         */ 00769000
*         GPR00F=34816&'00FFFFFF'X;                                0499 00770000
         L     GPR00F,@CF02662                                     0499 00771000
*         RFY                                                      0500 00772000
*          (GPR15P) RSTD;           /* PUT SUBPOOL PARM IN HIGH-   0500 00773000
*                                      ORDER BYTE OF REG 15          */ 00774000
*         GPR15F=0;                                                0501 00775000
         SLR   GPR15F,GPR15F                                       0501 00776000
*         SLL(GPR15P,24);           /* COMBINE SUBPOOL AND SIZE IN 0502 00777000
*                                      REGISTER 0                    */ 00778000
         SLL   GPR15P,24                                           0502 00779000
*         GPR00P=GPR00P|GPR15P;                                    0503 00780000
         OR    GPR00P,GPR15P                                       0503 00781000
*         RFY                                                      0504 00782000
*          (GPR15P) UNRSTD;         /* DECLARE AND RESTRICT REG 1    */ 00783000
*         RFY                                                      0505 00784000
*          (GPR01P) RSTD;           /* INVOKE XREGSET MACRO TO CHECK    00785000
*                                      STORAGE PARM AND PUT ADDR IN     00786000
*                                      REGISTER 1                    */ 00787000
*/*XREGSET  PID('STORAGE')PPARM((1))RREG(1,GPR01P)                   */ 00788000
*                                                                  0506 00789000
*         DO;                                                      0506 00790000
*                                                                  0506 00791000
*/*PARM ALREADY IN PROPER REGISTER                                   */ 00792000
*                                                                  0507 00793000
*         END;                      /* XREGSET INVOKE FREEMAIN MACRO */ 00794000
*         GEN;                                                     0508 00795000
         FREEMAIN R,LV=(0),A=(1)                                        00796000
*                                   /* UNRESTRICT REG 1              */ 00797000
*         RFY                                                      0509 00798000
*          (GPR01P) UNRSTD;         /* UNRESTRICT REG 0              */ 00799000
*         RFY                                                      0510 00800000
*          (GPR00P) UNRSTD;                                        0510 00801000
*       END;                        /* VFRMAIN                       */ 00802000
*       $USECNT=$USECNT-1;          /* DEC USER                      */ 00803000
         LH    @14,$USECNT(,RCAPTR)                                0512 00804000
         BCTR  @14,0                                               0512 00805000
         STH   @14,$USECNT(,RCAPTR)                                0512 00806000
*       GOTO I01C0051;              /* LOOP TILL DONE                */ 00807000
         B     I01C0051                                            0513 00808000
*     END;                          /* 1                             */ 00809000
*   RETURN CODE(0);                 /* AND RET TO ABEND              */ 00810000
@RF00482 SLR   @15,@15                                             0515 00811000
         L     @13,4(,@13)                                         0515 00812000
         L     @14,12(,@13)                                        0515 00813000
         LM    @02,@12,28(@13)                                     0515 00814000
         BR    @14                                                 0515 00815000
*/********************************************************************/ 00816000
*                                                                  0516 00817000
*                                                                  0516 00818000
*/********************************************************************/ 00819000
*/*      TOLTEP CLEANUP                R2 PTR TWA                    */ 00820000
*/********************************************************************/ 00821000
*                                                                  0516 00822000
*I01C0060:                                                         0516 00823000
*   ;                                                              0516 00824000
I01C0060 DS    0H                                                  0517 00825000
*   GEN;                                                           0517 00826000
         USING *,R15                                                    00827000
         STM   R14,R12,12(R13)                                          00828000
         L     R12,BASEREG                                              00829000
         DROP  R15                                                      00830000
*   CALL I01C0070;                  /* SET UP SAVE AREA PTRS         */ 00831000
         BAL   @14,I01C0070                                        0518 00832000
*   R3=$RCA;                        /* SET PTR TO RCA                */ 00833000
         L     R3,$RCA(,WAPTR)                                     0519 00834000
*   IF $CTERROR='1'B                /* WAS THERE AN ERROR ON THE CT  */ 00835000
*     THEN                                                         0520 00836000
         TM    $CTERROR(WAPTR),B'01000000'                         0520 00837000
         BNO   @RF00520                                            0520 00838000
*     DO;                           /* IF YES TELL NET OP            */ 00839000
*       RPLPTR=ADDR($TLTRPL1);      /* GET ADDR RPL                  */ 00840000
*                                                                  0522 00841000
         LA    RPLPTR,$TLTRPL1(,WAPTR)                             0522 00842000
*       /*************************************************************/ 00843000
*       /*                                                           */ 00844000
*       /* ITACONV FROM($RPLERR,2)TO($INBUFR,4) INVOKED              */ 00845000
*       /*                                                           */ 00846000
*       /*************************************************************/ 00847000
*                                                                  0523 00848000
*       DCL                                                        0523 00849000
*        (ITATCF,                                                  0523 00850000
*         ITATCT) CHAR(*) BASED;    /* GENERATE WORK VARABLES        */ 00851000
*       DCL                                                        0524 00852000
*         ITATCTS FIXED;            /* TEMP SPOT FOR ALTERED BYTE    */ 00853000
*       RFY                                                        0525 00854000
*         ITATCF BASED(ADDR($RPLERR));/* MAP VARIABLE OVER FROM      */ 00855000
*       RFY                                                        0526 00856000
*         ITATCT BASED(ADDR($INBUFR));/* MAP VARIBABLE OVER TO       */ 00857000
*       ITATCTS=ITATCT(4+1:4+1);    /* SAVE BYTE PAST TO FIELD       */ 00858000
         LA    @14,2104                                            0527 00859000
         ALR   @14,WAPTR                                           0527 00860000
         SLR   ITATCTS,ITATCTS                                     0527 00861000
         IC    ITATCTS,ITATCT+4(,@14)                              0527 00862000
*       UNPK(ITATCT(1:4+1),ITATCF(1:2+1));/* EXPAND HEX TO EBCDIC    */ 00863000
         UNPK  ITATCT(5,@14),ITATCF+2977(3,WAPTR)                  0528 00864000
*       TR(ITATCT(1:4),$TRTBL);     /* CONVERT FA-FF TO C1-C6        */ 00865000
         L     @11,$TRTBLA(,RCAPTR)                                0529 00866000
         TR    ITATCT(4,@14),$TRTBL(@11)                           0529 00867000
*       ITATCT(4+1:4+1)=ITATCTS;    /* RESTORE BYTE PAST TO FIELD    */ 00868000
         STC   ITATCTS,ITATCT+4(,@14)                              0530 00869000
*       $INBUFR(9:12)=$INBUFR(1:4); /* SWAP INFO                     */ 00870000
         MVC   $INBUFR+8(4,WAPTR),$INBUFR(WAPTR)                   0531 00871000
*       $INBUFR(1:8)=$SYSMN(1);     /* SET IN CT NAME                */ 00872000
*                                                                  0532 00873000
         MVC   $INBUFR(8,WAPTR),$SYSMN(WAPTR)                      0532 00874000
*       /*************************************************************/ 00875000
*       /*                                                           */ 00876000
*       /* TCEC MSGN(382)SUB(YES)DIR(NET)CKABEND(YES) INVOKED        */ 00877000
*       /*                                                           */ 00878000
*       /*************************************************************/ 00879000
*                                                                  0533 00880000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00881000
         OI    $TCECM(WAPTR),B'00000001'                           0533 00882000
*       R1=ADDR($TCA59);            /* SET UP PARM LIST $TR          */ 00883000
         LA    R1,$TCA59                                           0534 00884000
*       IF $ABTERM='1'B             /* IS ABEND OCCURING             */ 00885000
*         THEN                                                     0535 00886000
         TM    $ABTERM(WAPTR),B'00000010'                          0535 00887000
         BNO   @RF00535                                            0535 00888000
*         CALL ISTSC020;            /* YES- CALL CECOM (TCEC) DIRECT */ 00889000
         L     @15,@CV00047                                        0536 00890000
         BALR  @14,@15                                             0536 00891000
*       ELSE                                                       0537 00892000
*         CALL #EXIT;               /* NO- CALL CECOM VIA RES MGR    */ 00893000
         B     @RC00535                                            0537 00894000
@RF00535 L     @15,#EXITA(,WAPTR)                                  0537 00895000
         BALR  @14,@15                                             0537 00896000
*       DCL                                                        0538 00897000
*         1 $TCA59,                 /* TCEC PARM LIST                */ 00898000
*          2 $TCB59 FIXED(32) INIT(382),/* MSG NUMBER                */ 00899000
*          2 $TCC59 FIXED(32) INIT(0),/* INCT LEN                    */ 00900000
*          2 $TCD59 BIT(8) INIT('10001100'B),/* FLAG                 */ 00901000
*          2 $TCE59 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK         */ 00902000
@RC00535 DS    0H                                                  0539 00903000
*     END;                                                         0539 00904000
*   IF $CT924='1'B                  /* WAS CT LOST                   */ 00905000
*     THEN                                                         0540 00906000
@RF00520 TM    $CT924(WAPTR),B'00100000'                           0540 00907000
         BNO   @RF00540                                            0540 00908000
*     DO;                           /* IF YES PUT OUT MSG            */ 00909000
*       $INBUFR(1:8)=$SYSMN(1);     /* GET SYM NAME                  */ 00910000
*                                                                  0542 00911000
         MVC   $INBUFR(8,WAPTR),$SYSMN(WAPTR)                      0542 00912000
*       /*************************************************************/ 00913000
*       /*                                                           */ 00914000
*       /* TCEC MSGN(924)SUB(YES)DIR(NET)CKABEND(YES) INVOKED        */ 00915000
*       /*                                                           */ 00916000
*       /*************************************************************/ 00917000
*                                                                  0543 00918000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00919000
         OI    $TCECM(WAPTR),B'00000001'                           0543 00920000
*       R1=ADDR($TCA60);            /* SET UP PARM LIST $TR          */ 00921000
         LA    R1,$TCA60                                           0544 00922000
*       IF $ABTERM='1'B             /* IS ABEND OCCURING             */ 00923000
*         THEN                                                     0545 00924000
         TM    $ABTERM(WAPTR),B'00000010'                          0545 00925000
         BNO   @RF00545                                            0545 00926000
*         CALL ISTSC020;            /* YES- CALL CECOM (TCEC) DIRECT */ 00927000
         L     @15,@CV00047                                        0546 00928000
         BALR  @14,@15                                             0546 00929000
*       ELSE                                                       0547 00930000
*         CALL #EXIT;               /* NO- CALL CECOM VIA RES MGR    */ 00931000
         B     @RC00545                                            0547 00932000
@RF00545 L     @15,#EXITA(,WAPTR)                                  0547 00933000
         BALR  @14,@15                                             0547 00934000
*       DCL                                                        0548 00935000
*         1 $TCA60,                 /* TCEC PARM LIST                */ 00936000
*          2 $TCB60 FIXED(32) INIT(924),/* MSG NUMBER                */ 00937000
*          2 $TCC60 FIXED(32) INIT(0),/* INCT LEN                    */ 00938000
*          2 $TCD60 BIT(8) INIT('10001100'B),/* FLAG                 */ 00939000
*          2 $TCE60 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK         */ 00940000
@RC00545 DS    0H                                                  0549 00941000
*     END;                                                         0549 00942000
*   IF $MSG922='1'B                 /* IS VTAM ENDING                */ 00943000
*     THEN                                                         0550 00944000
@RF00540 TM    $MSG922(WAPTR),B'00010000'                          0550 00945000
         BNO   @RF00550                                            0550 00946000
*     DO;                           /* IF YES TELL CT                */ 00947000
*                                                                  0551 00948000
*       /*************************************************************/ 00949000
*       /*                                                           */ 00950000
*       /* TCEC MSGN(922)CKABEND(YES) INVOKED                        */ 00951000
*       /*                                                           */ 00952000
*       /*************************************************************/ 00953000
*                                                                  0552 00954000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00955000
         OI    $TCECM(WAPTR),B'00000001'                           0552 00956000
*       R1=ADDR($TCA61);            /* SET UP PARM LIST $TR          */ 00957000
         LA    R1,$TCA61                                           0553 00958000
*       IF $ABTERM='1'B             /* IS ABEND OCCURING             */ 00959000
*         THEN                                                     0554 00960000
         TM    $ABTERM(WAPTR),B'00000010'                          0554 00961000
         BNO   @RF00554                                            0554 00962000
*         CALL ISTSC020;            /* YES- CALL CECOM (TCEC) DIRECT */ 00963000
         L     @15,@CV00047                                        0555 00964000
         BALR  @14,@15                                             0555 00965000
*       ELSE                                                       0556 00966000
*         CALL #EXIT;               /* NO- CALL CECOM VIA RES MGR    */ 00967000
         B     @RC00554                                            0556 00968000
@RF00554 L     @15,#EXITA(,WAPTR)                                  0556 00969000
         BALR  @14,@15                                             0556 00970000
*       DCL                                                        0557 00971000
*         1 $TCA61,                 /* TCEC PARM LIST                */ 00972000
*          2 $TCB61 FIXED(32) INIT(922),/* MSG NUMBER                */ 00973000
*          2 $TCC61 FIXED(32) INIT(0),/* INCT LEN                    */ 00974000
*          2 $TCD61 BIT(8) INIT('00000100'B),/* FLAG                 */ 00975000
*          2 $TCE61 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK         */ 00976000
@RC00554 DS    0H                                                  0558 00977000
*     END;                                                         0558 00978000
*   R1=ADDR(RELPLIST);              /* PICK UP POINTER TO PARM     0559 00979000
*                                      DEVICES                       */ 00980000
@RF00550 LA    R1,RELPLIST                                         0559 00981000
*   RELALLS='0'B;                   /* SET RELEASE SWTCHS TO ZERO    */ 00982000
*   RELALLT='0'B;                   /* BEFORE SETTING SNGL FNCT      */ 00983000
         NI    RELALLS,B'10011111'                                 0561 00984000
*   IF $EOJ='1'B                    /* TEST FOR CANCEL REQ           */ 00985000
*     THEN                          /* IF YES SET BIT FOR ALL        */ 00986000
         TM    $EOJ(WAPTR),B'00000010'                             0562 00987000
         BNO   @RF00562                                            0562 00988000
*     RELALLS='1'B;                 /* DEVICES                       */ 00989000
         OI    RELALLS,B'00100000'                                 0563 00990000
*   ELSE                            /* IF NO SET BIT OFF             */ 00991000
*     RELALLT='1'B;                 /* SET REL ALL TEST DEVS         */ 00992000
         B     @RC00562                                            0564 00993000
@RF00562 OI    RELALLT,B'01000000'                                 0564 00994000
*   R15=ADDR(ISTSC031);             /* SET POINTER TO RELEASE        */ 00995000
@RC00562 L     R15,@CV00050                                        0565 00996000
*   CALL #EXIT;                     /* GOTO RELEASE DEVICES          */ 00997000
         L     @15,#EXITA(,WAPTR)                                  0566 00998000
         BALR  @14,@15                                             0566 00999000
*   IF $EOJ='0'B                    /* TEST FOR CANCEL AGAIN         */ 01000000
*     THEN                          /* IF NOT ON RETURN              */ 01001000
         TM    $EOJ(WAPTR),B'00000010'                             0567 01002000
         BNZ   @RF00567                                            0567 01003000
*     RETURN CODE(0);               /* IF ON RELEASE T. W. A.        */ 01004000
         SLR   @15,@15                                             0568 01005000
         L     @13,4(,@13)                                         0568 01006000
         L     @14,12(,@13)                                        0568 01007000
         LM    @02,@12,28(@13)                                     0568 01008000
         BR    @14                                                 0568 01009000
*   IF $OPCOM='1'B                  /* IS THIS SYS CON               */ 01010000
*     THEN                          /* IF YES NO NEED FOR MESSAGE    */ 01011000
@RF00567 TM    $OPCOM(WAPTR),B'10000000'                           0569 01012000
         BO    @RT00569                                            0569 01013000
*     GOTO I01C0061;                                               0570 01014000
*   $INBUFR(1:8)=$SYSMN(1);         /* SET SYM NAME FOR SUBSTITUTION */ 01015000
*                                                                  0571 01016000
         MVC   $INBUFR(8,WAPTR),$SYSMN(WAPTR)                      0571 01017000
*   /*****************************************************************/ 01018000
*   /*                                                               */ 01019000
*   /* TCEC MSGN(549)SUB(YES)DIR(NET)CKABEND(YES) INVOKED            */ 01020000
*   /*                                                               */ 01021000
*   /*****************************************************************/ 01022000
*                                                                  0572 01023000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 01024000
         OI    $TCECM(WAPTR),B'00000001'                           0572 01025000
*   R1=ADDR($TCA62);                /* SET UP PARM LIST $TR          */ 01026000
         LA    R1,$TCA62                                           0573 01027000
*   IF $ABTERM='1'B                 /* IS ABEND OCCURING             */ 01028000
*     THEN                                                         0574 01029000
         TM    $ABTERM(WAPTR),B'00000010'                          0574 01030000
         BNO   @RF00574                                            0574 01031000
*     CALL ISTSC020;                /* YES- CALL CECOM (TCEC) DIRECT */ 01032000
         L     @15,@CV00047                                        0575 01033000
         BALR  @14,@15                                             0575 01034000
*   ELSE                                                           0576 01035000
*     CALL #EXIT;                   /* NO- CALL CECOM VIA RES MGR    */ 01036000
         B     @RC00574                                            0576 01037000
@RF00574 L     @15,#EXITA(,WAPTR)                                  0576 01038000
         BALR  @14,@15                                             0576 01039000
*   DCL                                                            0577 01040000
*     1 $TCA62,                     /* TCEC PARM LIST                */ 01041000
*      2 $TCB62 FIXED(32) INIT(549),/* MSG NUMBER                    */ 01042000
*      2 $TCC62 FIXED(32) INIT(0),  /* INCT LEN                      */ 01043000
*      2 $TCD62 BIT(8) INIT('10001100'B),/* FLAG                     */ 01044000
*      2 $TCE62 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK             */ 01045000
@RC00574 DS    0H                                                  0578 01046000
*I01C0061:                                                         0578 01047000
*   ;                                                              0578 01048000
I01C0061 DS    0H                                                  0579 01049000
*   IF $GETMPTR^=0                  /* ANY CUTEST W.A. TO FREE       */ 01050000
*     THEN                          /* IF YES FREE IT                */ 01051000
         L     @14,$GETMPTR(,WAPTR)                                0579 01052000
         LTR   @14,@14                                             0579 01053000
         BZ    @RF00579                                            0579 01054000
*     DO;                                                          0580 01055000
*       R4=$GETMPTR;                /* SET PTR TO AREA               */ 01056000
         LR    R4,@14                                              0581 01057000
*/*VFRMAIN  SIZE($GETMSZE)STORAGE((R4))SUBPOOL(0)                    */ 01058000
*                                                                  0582 01059000
*       DO;                                                        0582 01060000
*         RFY                                                      0583 01061000
*          (GPR00P) RSTD;           /* PUT VALUE PASSED AS SIZE PARM    01062000
*                                      IN THREE LOW-ORDER BYTES OF 0583 01063000
*                                      REG 0                         */ 01064000
*         GPR00F=$GETMSZE&'00FFFFFF'X;                             0584 01065000
         LH    GPR00F,$GETMSZE(,WAPTR)                             0584 01066000
         N     GPR00F,@CF02667                                     0584 01067000
*         RFY                                                      0585 01068000
*          (GPR15P) RSTD;           /* PUT SUBPOOL PARM IN HIGH-   0585 01069000
*                                      ORDER BYTE OF REG 15          */ 01070000
*         GPR15F=0;                                                0586 01071000
         SLR   GPR15F,GPR15F                                       0586 01072000
*         SLL(GPR15P,24);           /* COMBINE SUBPOOL AND SIZE IN 0587 01073000
*                                      REGISTER 0                    */ 01074000
         SLL   GPR15P,24                                           0587 01075000
*         GPR00P=GPR00P|GPR15P;                                    0588 01076000
         OR    GPR00P,GPR15P                                       0588 01077000
*         RFY                                                      0589 01078000
*          (GPR15P) UNRSTD;         /* DECLARE AND RESTRICT REG 1    */ 01079000
*         RFY                                                      0590 01080000
*          (GPR01P) RSTD;           /* INVOKE XREGSET MACRO TO CHECK    01081000
*                                      STORAGE PARM AND PUT ADDR IN     01082000
*                                      REGISTER 1                    */ 01083000
*/*XREGSET  PID('STORAGE')PPARM((R4))RREG(1,GPR01P)                  */ 01084000
*                                                                  0591 01085000
*         DO;                                                      0591 01086000
*           GPR01P=R4;              /* SET RREG SYMBOL TO VALUE OF 0592 01087000
*                                      PPARM OPERAND                 */ 01088000
         LR    GPR01P,R4                                           0592 01089000
*         END;                      /* XREGSET INVOKE FREEMAIN MACRO */ 01090000
*         GEN;                                                     0594 01091000
         FREEMAIN R,LV=(0),A=(1)                                        01092000
*                                   /* UNRESTRICT REG 1              */ 01093000
*         RFY                                                      0595 01094000
*          (GPR01P) UNRSTD;         /* UNRESTRICT REG 0              */ 01095000
*         RFY                                                      0596 01096000
*          (GPR00P) UNRSTD;                                        0596 01097000
*       END;                        /* VFRMAIN                       */ 01098000
*       $GETMPTR=0;                 /* ZERO OUT ADDRESS              */ 01099000
         SLR   @14,@14                                             0598 01100000
         ST    @14,$GETMPTR(,WAPTR)                                0598 01101000
*       $GETMSZE=0;                 /* SIZE                          */ 01102000
         STH   @14,$GETMSZE(,WAPTR)                                0599 01103000
*       $CUCNT=0;                   /* COUNT                         */ 01104000
         STH   @14,$CUCNT(,WAPTR)                                  0600 01105000
*       $CUTESTB='0'B;              /* SET OFF CUTEST IND            */ 01106000
*       $UPDATE='0'B;               /* SET OFF UPDATE IND            */ 01107000
         NI    $CUTESTB(RCAPTR),B'01101111'                        0602 01108000
*     END;                                                         0603 01109000
*   QACB=$RCA;                      /* SET PTR TO ACB IN PARM        */ 01110000
@RF00579 L     @14,$RCA(,WAPTR)                                    0604 01111000
         ST    @14,QACB                                            0604 01112000
*   QPTR=R2;                        /* SET PTR TO AREA TO FREE       */ 01113000
         ST    R2,QPTR                                             0605 01114000
*   QCODE='04'X;                    /* SET CODE TO DETATCH USER      */ 01115000
         MVI   QCODE,X'04'                                         0606 01116000
*   R1=ADDR(QHNLPARM);              /* SET PTR TO PARM               */ 01117000
         LA    R1,QHNLPARM                                         0607 01118000
*   CALL ISTCC015;                                                 0608 01119000
         L     @15,@CV00054                                        0608 01120000
         BALR  @14,@15                                             0608 01121000
*   RETURN CODE(0);                                                0609 01122000
*                                                                  0609 01123000
         SLR   @15,@15                                             0609 01124000
         L     @13,4(,@13)                                         0609 01125000
         L     @14,12(,@13)                                        0609 01126000
         LM    @02,@12,28(@13)                                     0609 01127000
         BR    @14                                                 0609 01128000
*   /*****************************************************************/ 01129000
*   /*                                                               */ 01130000
*   /* ENTRY FROM EXTERNAL MODULES FOR SESSPARM MODIFYING            */ 01131000
*   /*                                                               */ 01132000
*   /*****************************************************************/ 01133000
*                                                                  0610 01134000
*I01C1000:                                                         0610 01135000
*   GEN;                                                           0610 01136000
I01C1000 DS    0H                                                  0610 01137000
*               /*SAVE REGS AND GET BASE @DA04697*/                     01138000
          USING I01C1000,R15      BASE TO PICK UP BASE         @DA04697 01139000
          STM   R14,R12,12(R13)   SAVE CALLERS REGS            @DA04697 01140000
          L     R12,BASEREG       PICK UP MY NEW BASE          @DA04697 01141000
          DROP  R15               RELEASE THE ENTRY REG        @DA04697 01142000
*   R3=R13;                         /* POINT TO THE CALLERS SAVE AREA   01143000
*                                                            @DA04697*/ 01144000
         LR    R3,R13                                              0611 01145000
*   R13=ADDR(SVECC010);             /*                       @D32JPFR*/ 01146000
         LA    R13,SVECC010(,WAPTR)                                0612 01147000
*   BACKSAVE(3)=R13;                /*                       @D32JPFR*/ 01148000
         ST    R13,BACKSAVE+8(,R3)                                 0613 01149000
*   SVECC010(2)=R3;                 /* SAVE THE ADDRESS OF THE     0614 01150000
*                                      CALLERS SAVE AREA     @DA04697*/ 01151000
         ST    R3,SVECC010+4(,WAPTR)                               0614 01152000
*   CALL I01C1500;                  /* CALL INTERNAL ROUTINE @D32JPFR*/ 01153000
         BAL   @14,I01C1500                                        0615 01154000
*   RETURN;                         /*                       @D32JPFR*/ 01155000
         B     @EL00001                                            0616 01156000
*/********************************************************************/ 01157000
*                                                                  0617 01158000
*   GEN(EJECT);                                                    0617 01159000
         EJECT                                                          01160000
*                                                                  0618 01161000
*/********************************************************************/ 01162000
*/*    COMMON SAVE AREA SETTER                                       */ 01163000
*/********************************************************************/ 01164000
*                                                                  0618 01165000
*I01C0070:                                                         0618 01166000
*   ;                                                              0618 01167000
I01C0070 DS    0H                                                  0619 01168000
*   R3=R13;                         /* SET BACKSAVE BASE             */ 01169000
         LR    R3,R13                                              0619 01170000
*   R13=ADDR(SVECC010);             /* SET R13 TO SAVE AREA          */ 01171000
         LA    R13,SVECC010(,WAPTR)                                0620 01172000
*   SVECC010(2)=R3;                 /* & CHAIN TOGETHER              */ 01173000
         ST    R3,SVECC010+4(,WAPTR)                               0621 01174000
*   BACKSAVE(3)=R13;                                               0622 01175000
         ST    R13,BACKSAVE+8(,R3)                                 0622 01176000
*   GEN(BR    R14);                 /* RETURN                        */ 01177000
         BR    R14                                                      01178000
*   GEN;                                                           0624 01179000
*                                                                  0624 01180000
L0       EQU   0                                                        01181000
L8       EQU   8                                                        01182000
L12      EQU   12                                                       01183000
*   /*****************************************************************/ 01184000
*   /*                                                               */ 01185000
*   /* SESSPARM MODIFYING ROUTINE                            @D32JPFR*/ 01186000
*   /*                                                               */ 01187000
*   /*****************************************************************/ 01188000
*                                                                  0625 01189000
*I01C1500:                                                         0625 01190000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @D32JPFR*/ 01191000
         B     @PB00002                                            0625 01192000
I01C1500 DS    0H                                                  0626 01193000
*   RFY                                                            0626 01194000
*    (R0,                                                          0626 01195000
*     R1) RSTD;                     /*                       @D32JPFR*/ 01196000
*   DCL                                                            0627 01197000
*     1 SESSPRM CHAR(6) BASED(R1),  /* MAP INPUT             @D32JPFR*/ 01198000
*      2 FM CHAR(1),                /*                       @D32JPFR*/ 01199000
*      2 TS CHAR(1),                /*                       @D32JPFR*/ 01200000
*      2 PRO CHAR(4);               /*                       @D32JPFR*/ 01201000
*   R0=PRO;                         /* PICK UP PROTOCOL      @D32JPFR*/ 01202000
         ICM   R0,15,PRO(R1)                                       0628 01203000
*   IF TS='02'X THEN                /* 3270 SNA DEV ?        @D32JPFR*/ 01204000
         CLI   TS(R1),X'02'                                        0629 01205000
         BNE   @RF00629                                            0629 01206000
*     DO;                                                          0630 01207000
*       FM='02'X;                   /* SET TO 3270 SNA DEV   @D32JPFR*/ 01208000
         MVI   FM(R1),X'02'                                        0631 01209000
*       R0=R0&'21413800'X;          /* AND OUT USED FLAGS    @D32JPFR*/ 01210000
         N     R0,@CF02763                                         0632 01211000
*       R0=R0|'21402000'X;          /* OR ON 3270 SNA FLAGS  @D32JPFR*/ 01212000
         O     R0,@CF02764                                         0633 01213000
*     END;                                                         0634 01214000
*   ELSE                                                           0635 01215000
*     DO;                                                          0635 01216000
         B     @RC00629                                            0635 01217000
@RF00629 DS    0H                                                  0636 01218000
*       FM='03'X;                   /* DEV IS AN RTS-1 OR 2  @D32JPFR*/ 01219000
         MVI   FM(R1),X'03'                                        0636 01220000
*       TS='03'X;                   /* SET TO SAME           @D32JPFR*/ 01221000
         MVI   TS(R1),X'03'                                        0637 01222000
*       R0=R0&'219138C0'X;          /* N OUT USED FLAGS      @AX11982*/ 01223000
         N     R0,@CF02765                                         0638 01224000
*       R0=R0|'21903000'X;          /* OR ON RTS-1 2 FLAGS   @AX11982*/ 01225000
         O     R0,@CF02766                                         0639 01226000
*     END;                                                         0640 01227000
*   PRO=R0;                         /* STORE PROTOCOL        @D32JPFR*/ 01228000
@RC00629 STCM  R0,15,PRO(R1)                                       0641 01229000
*   GEN(BR    R14);                                                0642 01230000
         BR    R14                                                      01231000
*   END I01C1500;                   /* END OF SESSPARM MODIFY RTN  0643 01232000
*                                                            @D32JPFR*/ 01233000
@EL00002 DS    0H                                                  0643 01234000
@EF00002 DS    0H                                                  0643 01235000
@ER00002 BR    @14                                                 0643 01236000
@PB00002 DS    0H                                                  0644 01237000
*/* TPEPILOG                                                         */ 01238000
*                                                                  0644 01239000
*   GEN(PRINT OFF);                                                0644 01240000
         PRINT OFF                                                      01241000
*   DECLARE                                                        0645 01242000
*     EMCR0 PTR REG(0),                                            0645 01243000
*     EMCR1 PTR REG(1),                                            0645 01244000
*     EMCR2 PTR REG(2),                                            0645 01245000
*     EMCR3 PTR REG(3),                                            0645 01246000
*     EMCR4 PTR REG(4),                                            0645 01247000
*     EMCR5 PTR REG(5),                                            0645 01248000
*     EMCR6 PTR REG(6),                                            0645 01249000
*     EMCR7 PTR REG(7),                                            0645 01250000
*     EMCR8 PTR REG(8),                                            0645 01251000
*     EMCR9 PTR REG(9),                                            0645 01252000
*     EMCR10 PTR REG(10),                                          0645 01253000
*     EMCR11 PTR REG(11),                                          0645 01254000
*     EMCR12 PTR REG(12),                                          0645 01255000
*     EMCR13 PTR REG(13),                                          0645 01256000
*     EMCR14 PTR REG(14),                                          0645 01257000
*     EMCR15 PTR REG(15);                                          0645 01258000
*   GEN(PRINT ON);                                                 0646 01259000
*                                                                  0646 01260000
         PRINT ON                                                       01261000
*/* END OF TPEPILOG                                                  */ 01262000
*/* ATDSPLY   INVOKED.                                               */ 01263000
*/********************************************************************/ 01264000
*/* THE FOLLOWING ATBUILD INCLUSIONS HAVE BEEN MADE IN THIS          */ 01265000
*/* COMPILATION:                                                     */ 01266000
*/*             ISTPROCD                                             */ 01267000
*/*             ISTDEVCH                                             */ 01268000
*/*             ISTNIB                                               */ 01269000
*/*             ISTAVT                                               */ 01270000
*/*             ISTPAB                                               */ 01271000
*/*             ISTLOK                                               */ 01272000
*/*             ISTDYPAB                                             */ 01273000
*/*             ISTRPH                                               */ 01274000
*/*             ISTATCVT                                             */ 01275000
*/*             ISTTIE                                               */ 01276000
*/*             ISTIFTPL                                             */ 01277000
*/*             ISTBIND                                              */ 01278000
*/********************************************************************/ 01279000
*/* END OF ATDSPLY.                                                  */ 01280000
*                                                                  0647 01281000
*   END                                                            0647 01282000
*                                                                  0647 01283000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01284000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01285000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 01286000
*/*%INCLUDE SYSLIB  (IFGRPLVT)                                       */ 01287000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 01288000
*                                                                  0647 01289000
*       ;                                                          0647 01290000
         B     @EL00001                                            0647 01291000
@DATA    DS    0H                                                       01292000
@CH00033 DC    H'1'                                                     01293000
         DS    0F                                                       01294000
@SA00001 DS    18F                                                      01295000
         DS    0F                                                       01296000
@CF00069 DC    F'8'                                                     01297000
@CF00098 DC    F'16'                                                    01298000
@CF00819 DC    F'4096'                                                  01299000
@CF02662 DC    F'34816'                                                 01300000
@CF02667 DC    XL4'00FFFFFF'                                            01301000
@CF02763 DC    XL4'21413800'                                            01302000
@CF02764 DC    XL4'21402000'                                            01303000
@CF02765 DC    XL4'219138C0'                                            01304000
@CF02766 DC    XL4'21903000'                                            01305000
@CV00046 DC    V(ISTEC000)                                              01306000
@CV00047 DC    V(ISTSC020)                                              01307000
@CV00048 DC    V(ISTTC037)                                              01308000
@CV00049 DC    V(ISTIC002)                                              01309000
@CV00050 DC    V(ISTSC031)                                              01310000
@CV00051 DC    V(ISTTC035)                                              01311000
@CV00053 DC    V(ISTCC014)                                              01312000
@CV00054 DC    V(ISTCC015)                                              01313000
@CV02694 DC    V(I00C1000)                                              01314000
@CV02695 DC    V(I00C1002)                                              01315000
@CV02698 DC    V(I00C1001)                                              01316000
@CV00052 DC    V(ISTCC010)                                              01317000
         DS    0D                                                       01318000
NEWAREA  DC    F'0'                                                     01319000
R4SAVE   DC    F'0'                                                     01320000
R3SAVE   DC    F'0'                                                     01321000
BASEREG  DC    F'0'                                                     01322000
IFTECB   DC    F'0'                                                     01323000
CVTPTR   DS    A                                                        01324000
RETCODE  DS    F                                                        01325000
I        DC    H'0'                                                     01326000
@CC00078 DC    C'SYS CON '                                              01327000
@CC02680 DC    C'BASIC   '                                              01328000
@CC02681 DC    C'RECORD  '                                              01329000
@CB02682 DC    X'0000000000000000'                                      01330000
SYSCON   DC    CL8'SYS CON '                                            01331000
         DS    CL2                                                      01332000
RELPLIST DS    CL9                                                      01333000
         ORG   RELPLIST                                                 01334000
@NM00001 DC    X'0102F3F1'                                              01335000
@NM00002 DC    A(0)                                                     01336000
@NM00003 DC    X'40'                                                    01337000
         ORG   @NM00003                                                 01338000
CTAPFLG  DS    BL1                                                      01339000
RELALLT  EQU   @NM00003+0                                               01340000
RELALLS  EQU   @NM00003+0                                               01341000
@NM00004 EQU   @NM00003+0                                               01342000
         ORG   RELPLIST+9                                               01343000
         DS    CL3                                                      01344000
QHNLPARM DS    CL9                                                      01345000
         ORG   QHNLPARM                                                 01346000
QACB     DS    FL4                                                      01347000
QPTR     DS    FL4                                                      01348000
QCODE    DS    CL1                                                      01349000
         ORG   QHNLPARM+9                                               01350000
         DS    CL3                                                      01351000
TIE      DS    CL16                                                     01352000
         ORG   TIE                                                      01353000
@NM00005 DC    X'18'                                                    01354000
@NM00006 DC    X'10'                                                    01355000
@NM00007 DC    H'5'                                                     01356000
@NM00008 DC    A(0)                                                     01357000
@NM00009 DC    AL4(IFTPL)                                               01358000
@NM00010 DC    A(0)                                                     01359000
         ORG   TIE+16                                                   01360000
IFTPL    DS    CL44                                                     01361000
         ORG   IFTPL                                                    01362000
@NM00011 DC    F'0'                                                     01363000
@NM00012 DC    AL4(IFTECB)                                              01364000
@NM00013 DS    CL16                                                     01365000
@NM00014 DC    A(0)                                                     01366000
@NM00015 DC    A(0)                                                     01367000
@NM00016 DC    A(0)                                                     01368000
@NM00017 DC    A(0)                                                     01369000
@NM00018 DC    A(0)                                                     01370000
         ORG   IFTPL+44                                                 01371000
$TCA48   DS    CL13                                                     01372000
         ORG   $TCA48                                                   01373000
$TCB48   DC    A(547)                                                   01374000
$TCC48   DC    A(0)                                                     01375000
$TCD48   DC    B'00001100'                                              01376000
$TCE48   DC    X'FFFFFFFF'                                              01377000
         ORG   $TCA48+13                                                01378000
         DS    CL3                                                      01379000
$TCA49   DS    CL13                                                     01380000
         ORG   $TCA49                                                   01381000
$TCB49   DC    A(547)                                                   01382000
$TCC49   DC    A(0)                                                     01383000
$TCD49   DC    B'00000100'                                              01384000
$TCE49   DC    X'FFFFFFFF'                                              01385000
         ORG   $TCA49+13                                                01386000
         DS    CL3                                                      01387000
$TCA59   DS    CL13                                                     01388000
         ORG   $TCA59                                                   01389000
$TCB59   DC    A(382)                                                   01390000
$TCC59   DC    A(0)                                                     01391000
$TCD59   DC    B'10001100'                                              01392000
$TCE59   DC    X'FFFFFFFF'                                              01393000
         ORG   $TCA59+13                                                01394000
         DS    CL3                                                      01395000
$TCA60   DS    CL13                                                     01396000
         ORG   $TCA60                                                   01397000
$TCB60   DC    A(924)                                                   01398000
$TCC60   DC    A(0)                                                     01399000
$TCD60   DC    B'10001100'                                              01400000
$TCE60   DC    X'FFFFFFFF'                                              01401000
         ORG   $TCA60+13                                                01402000
         DS    CL3                                                      01403000
$TCA61   DS    CL13                                                     01404000
         ORG   $TCA61                                                   01405000
$TCB61   DC    A(922)                                                   01406000
$TCC61   DC    A(0)                                                     01407000
$TCD61   DC    B'00000100'                                              01408000
$TCE61   DC    X'FFFFFFFF'                                              01409000
         ORG   $TCA61+13                                                01410000
         DS    CL3                                                      01411000
$TCA62   DS    CL13                                                     01412000
         ORG   $TCA62                                                   01413000
$TCB62   DC    A(549)                                                   01414000
$TCC62   DC    A(0)                                                     01415000
$TCD62   DC    B'10001100'                                              01416000
$TCE62   DC    X'FFFFFFFF'                                              01417000
         ORG   $TCA62+13                                                01418000
         DS    CL3                                                      01419000
$TABLE   DC    F'0'                                                     01420000
         DC    F'0'                                                     01421000
         DC    F'0'                                                     01422000
         DC    F'0'                                                     01423000
         DC    F'0'                                                     01424000
         DC    F'0'                                                     01425000
         DC    F'0'                                                     01426000
         DC    VL4(ISTCC014)                                            01427000
MYSAVE   DC    18F'0'                                                   01428000
ABSAVE   DC    18F'0'                                                   01429000
PATCH    DC    40F'0'                                                   01430000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01431000
@01      EQU   01                                                       01432000
@02      EQU   02                                                       01433000
@03      EQU   03                                                       01434000
@04      EQU   04                                                       01435000
@05      EQU   05                                                       01436000
@06      EQU   06                                                       01437000
@07      EQU   07                                                       01438000
@08      EQU   08                                                       01439000
@09      EQU   09                                                       01440000
@10      EQU   10                                                       01441000
@11      EQU   11                                                       01442000
@12      EQU   12                                                       01443000
@13      EQU   13                                                       01444000
@14      EQU   14                                                       01445000
@15      EQU   15                                                       01446000
ITATCTS  EQU   @10                                                      01447000
R1       EQU   @01                                                      01448000
R2       EQU   @02                                                      01449000
R3       EQU   @03                                                      01450000
R4       EQU   @04                                                      01451000
R5       EQU   @05                                                      01452000
R6       EQU   @06                                                      01453000
R12      EQU   @12                                                      01454000
R13      EQU   @13                                                      01455000
R15      EQU   @15                                                      01456000
RCAPTR   EQU   @03                                                      01457000
R0       EQU   @00                                                      01458000
RPLPTR   EQU   @05                                                      01459000
R7       EQU   @07                                                      01460000
R10      EQU   @10                                                      01461000
WAPTR    EQU   @02                                                      01462000
RPHPTR   EQU   @01                                                      01463000
GPR02F   EQU   @02                                                      01464000
GPR02P   EQU   @02                                                      01465000
GPR03F   EQU   @03                                                      01466000
GPR03P   EQU   @03                                                      01467000
GPR04F   EQU   @04                                                      01468000
GPR04P   EQU   @04                                                      01469000
GPR15F   EQU   @15                                                      01470000
GPR15P   EQU   @15                                                      01471000
GPR00F   EQU   @00                                                      01472000
GPR00P   EQU   @00                                                      01473000
GPR01P   EQU   @01                                                      01474000
EMCR15   EQU   @15                                                      01475000
EMCR0    EQU   @00                                                      01476000
EMCR1    EQU   @01                                                      01477000
EMCR10   EQU   @10                                                      01478000
EMCR11   EQU   @11                                                      01479000
EMCR12   EQU   @12                                                      01480000
EMCR13   EQU   @13                                                      01481000
EMCR14   EQU   @14                                                      01482000
EMCR2    EQU   @02                                                      01483000
EMCR3    EQU   @03                                                      01484000
EMCR4    EQU   @04                                                      01485000
EMCR5    EQU   @05                                                      01486000
EMCR6    EQU   @06                                                      01487000
EMCR7    EQU   @07                                                      01488000
EMCR8    EQU   @08                                                      01489000
EMCR9    EQU   @09                                                      01490000
GPR01F   EQU   @01                                                      01491000
R11      EQU   @11                                                      01492000
R14      EQU   @14                                                      01493000
R8       EQU   @08                                                      01494000
R9       EQU   @09                                                      01495000
         ENTRY I01C0050                                                 01496000
         ENTRY I01C0060                                                 01497000
         ENTRY I01C1000                                                 01498000
ATCLCPTR EQU   1032                                                     01499000
BACKSAVE EQU   0                                                        01500000
CVTMAP   EQU   0                                                        01501000
CVTDAR   EQU   CVTMAP+72                                                01502000
CVTFLGS1 EQU   CVTDAR                                                   01503000
CVTDCB   EQU   CVTMAP+116                                               01504000
CVTIERLC EQU   CVTMAP+144                                               01505000
CVTOPTA  EQU   CVTMAP+182                                               01506000
CVTOPTB  EQU   CVTMAP+183                                               01507000
CVTGTF   EQU   CVTMAP+236                                               01508000
CVTGTFST EQU   CVTGTF                                                   01509000
CVTGTFS  EQU   CVTGTFST                                                 01510000
CVTSTATE EQU   CVTGTFST                                                 01511000
CVTTMODE EQU   CVTGTFST                                                 01512000
CVTFORM  EQU   CVTGTFST                                                 01513000
CVTAQAVT EQU   CVTMAP+240                                               01514000
CVTTCMFG EQU   CVTAQAVT                                                 01515000
CVTVOLM2 EQU   CVTMAP+244                                               01516000
CVTTATA  EQU   CVTVOLM2                                                 01517000
CVTTSKS  EQU   CVTTATA                                                  01518000
CVTVOLF2 EQU   CVTTSKS                                                  01519000
CVTTAT   EQU   CVTTATA+1                                                01520000
CVTATER  EQU   CVTMAP+248                                               01521000
CVTEXT1  EQU   CVTMAP+252                                               01522000
CVTPURG  EQU   CVTMAP+260                                               01523000
CVTQMSG  EQU   CVTMAP+268                                               01524000
CVTDMSR  EQU   CVTMAP+272                                               01525000
CVTRSV37 EQU   CVTDMSR                                                  01526000
CVTDMSRF EQU   CVTRSV37                                                 01527000
CVTERPV  EQU   CVTMAP+316                                               01528000
CVTINTLA EQU   CVTMAP+320                                               01529000
CVTAPF   EQU   CVTMAP+324                                               01530000
CVTEXT2  EQU   CVTMAP+328                                               01531000
CVTHJES  EQU   CVTMAP+332                                               01532000
CVTPGSIA EQU   CVTMAP+348                                               01533000
CVTA1F1  EQU   CVTMAP+356                                               01534000
CVTSYSK  EQU   CVTMAP+357                                               01535000
CVTVOLM1 EQU   CVTMAP+380                                               01536000
CVTVOLF1 EQU   CVTVOLM1                                                 01537000
CVTATMCT EQU   CVTMAP+388                                               01538000
CVTXTNT1 EQU   0                                                        01539000
CVTXTNT2 EQU   0                                                        01540000
CVTDSSV  EQU   CVTXTNT2                                                 01541000
CVTFLGBT EQU   CVTXTNT2+5                                               01542000
CVTQID   EQU   CVTXTNT2+24                                              01543000
CVTSHS   EQU   CVTXTNT2+40                                              01544000
CVTRV400 EQU   CVTXTNT2+52                                              01545000
CVTRV409 EQU   CVTXTNT2+53                                              01546000
CVTATCVT EQU   CVTXTNT2+64                                              01547000
CVTRV429 EQU   CVTXTNT2+84                                              01548000
CVTRV438 EQU   CVTXTNT2+85                                              01549000
CVTRV457 EQU   CVTXTNT2+112                                             01550000
CVTRV466 EQU   CVTXTNT2+113                                             01551000
CVTFIX   EQU   0                                                        01552000
CVTRELNO EQU   CVTFIX+252                                               01553000
$RCAAREA EQU   0                                                        01554000
$POINTER EQU   $RCAAREA+100                                             01555000
$TOLTEP  EQU   $POINTER                                                 01556000
$CVTSAVE EQU   $POINTER+4                                               01557000
$FSTAREA EQU   $POINTER+8                                               01558000
$ABEND   EQU   $POINTER+16                                              01559000
$CLEANP  EQU   $POINTER+20                                              01560000
$COMINT  EQU   $POINTER+120                                             01561000
$TRTBLA  EQU   $POINTER+124                                             01562000
$CURRTWA EQU   $POINTER+140                                             01563000
$CONSTNT EQU   $RCAAREA+244                                             01564000
$USECNT  EQU   $CONSTNT                                                 01565000
$TLTPRPL EQU   $CONSTNT+20                                              01566000
$TLTNIB  EQU   $CONSTNT+140                                             01567000
$BUFFS   EQU   $RCAAREA+464                                             01568000
$DEVAREA EQU   $RCAAREA+600                                             01569000
$RCAFLG  EQU   $RCAAREA+604                                             01570000
$UPDATE  EQU   $RCAFLG                                                  01571000
$TPLOGON EQU   $RCAFLG                                                  01572000
$CUTESTB EQU   $RCAFLG                                                  01573000
$ABNDALL EQU   $RCAFLG                                                  01574000
$NEWCT   EQU   $RCAFLG                                                  01575000
$TLTEND  EQU   $RCAAREA+936                                             01576000
$TRTBL   EQU   0                                                        01577000
TOLTEPWA EQU   0                                                        01578000
$SCTTBLE EQU   TOLTEPWA                                                 01579000
$TESTOPT EQU   $SCTTBLE+2                                               01580000
$NOPRT   EQU   $TESTOPT                                                 01581000
$FSTCOMM EQU   $TESTOPT                                                 01582000
$ERROPT  EQU   $SCTTBLE+3                                               01583000
$NOCNTRL EQU   $ERROPT                                                  01584000
$DRIVER  EQU   $SCTTBLE+6                                               01585000
$PDEVFLG EQU   $SCTTBLE+10                                              01586000
$CDSFLGS EQU   $SCTTBLE+11                                              01587000
$CDS8T19 EQU   $SCTTBLE+20                                              01588000
$EXECFLG EQU   $SCTTBLE+33                                              01589000
$OLTFLGS EQU   $SCTTBLE+36                                              01590000
$RETCODE EQU   $OLTFLGS                                                 01591000
$OLTFLG2 EQU   $SCTTBLE+37                                              01592000
$TOTFLG1 EQU   $SCTTBLE+38                                              01593000
$ROUTMSK EQU   $SCTTBLE+40                                              01594000
#TABLE   EQU   $SCTTBLE+80                                              01595000
#PASS    EQU   $SCTTBLE+84                                              01596000
#EXT     EQU   $SCTTBLE+88                                              01597000
$CDA     EQU   TOLTEPWA+100                                             01598000
$SCTPTR  EQU   $CDA+16                                                  01599000
$SCTPTR8 EQU   $CDA+20                                                  01600000
$TOLBRTB EQU   $CDA+24                                                  01601000
$PASSON  EQU   $CDA+28                                                  01602000
$RCA     EQU   $CDA+44                                                  01603000
$ENDCOMM EQU   $CDA+48                                                  01604000
$OLTPTR  EQU   $CDA+52                                                  01605000
$HIMOREC EQU   $CDA+60                                                  01606000
$TEPBEGN EQU   $CDA+68                                                  01607000
$TEPEND  EQU   $CDA+76                                                  01608000
$GETMPTR EQU   $CDA+88                                                  01609000
$TLCNT   EQU   $CDA+100                                                 01610000
$GETMSZE EQU   $CDA+110                                                 01611000
$CUCNT   EQU   $CDA+118                                                 01612000
$COMMFLG EQU   TOLTEPWA+224                                             01613000
$FLAG1   EQU   $COMMFLG                                                 01614000
$TEP3RD  EQU   $FLAG1                                                   01615000
$FLAG2   EQU   $COMMFLG+1                                               01616000
$FLAG3   EQU   $COMMFLG+2                                               01617000
$REQSTOR EQU   $FLAG3                                                   01618000
$FLAG4   EQU   $COMMFLG+3                                               01619000
$OPCOM   EQU   $FLAG4                                                   01620000
$CLSSACT EQU   $FLAG4                                                   01621000
$ACTOPND EQU   $FLAG4                                                   01622000
$FLAG5   EQU   $COMMFLG+4                                               01623000
$CT924   EQU   $FLAG5                                                   01624000
$MSG922  EQU   $FLAG5                                                   01625000
$EOJ     EQU   $FLAG5                                                   01626000
$CANCEL  EQU   $EOJ                                                     01627000
$FLAG6   EQU   $COMMFLG+5                                               01628000
$CTERROR EQU   $FLAG6                                                   01629000
$ABNDBIT EQU   $FLAG6                                                   01630000
$ABTERM  EQU   $ABNDBIT                                                 01631000
$CIREQ   EQU   $FLAG6                                                   01632000
$FLAG7   EQU   $COMMFLG+6                                               01633000
$FLAG8   EQU   $COMMFLG+7                                               01634000
$TCECM   EQU   $FLAG8                                                   01635000
$FLAG9   EQU   $COMMFLG+8                                               01636000
$HOLD    EQU   $FLAG9                                                   01637000
$FLAG10  EQU   $COMMFLG+9                                               01638000
$WAITFLG EQU   $FLAG10                                                  01639000
$FLAG11  EQU   $COMMFLG+10                                              01640000
$FLAG12  EQU   $COMMFLG+11                                              01641000
$POSTFLG EQU   $FLAG12                                                  01642000
$ENDTEST EQU   $FLAG12                                                  01643000
$FLAG13  EQU   $COMMFLG+12                                              01644000
$CTLOGON EQU   $FLAG13                                                  01645000
$LGON    EQU   $FLAG13                                                  01646000
$OLTMACC EQU   $FLAG13                                                  01647000
$TEP1ST  EQU   $FLAG13                                                  01648000
$TEP2ND  EQU   $FLAG13                                                  01649000
$DEVTBLE EQU   TOLTEPWA+240                                             01650000
$DEVCDS  EQU   $DEVTBLE                                                 01651000
$DEVUNAD EQU   $DEVCDS                                                  01652000
@NM00059 EQU   $DEVUNAD+2                                               01653000
$DEVFEAT EQU   $DEVCDS+4                                                01654000
$DEVCDSF EQU   $DEVCDS+9                                                01655000
$DEVSDCF EQU   $DEVCDS+10                                               01656000
$$SYMNME EQU   $DEVCDS+12                                               01657000
$DEVFLG1 EQU   $DEVTBLE+20                                              01658000
$EVNCPLT EQU   $DEVFLG1                                                 01659000
$ATTNEXP EQU   $DEVFLG1                                                 01660000
$INTOCC  EQU   $DEVFLG1                                                 01661000
$DEVFLG2 EQU   $DEVTBLE+21                                              01662000
$DEVTECB EQU   $DEVTBLE+22                                              01663000
$OPIS    EQU   $DEVTECB                                                 01664000
$DVSEQNO EQU   $OPIS                                                    01665000
$OPND    EQU   $DEVTECB+2                                               01666000
$DVINCT  EQU   $DEVTBLE+26                                              01667000
$DEVFLG3 EQU   $DEVTBLE+27                                              01668000
$NOTDEV  EQU   $DEVFLG3                                                 01669000
$ACQRED  EQU   $DEVFLG3                                                 01670000
$SIOFLG  EQU   $DEVFLG3                                                 01671000
$SYSMN   EQU   $DEVTBLE+28                                              01672000
$IFTOUT  EQU   $DEVTBLE+36                                              01673000
$DEVSESP EQU   $IFTOUT                                                  01674000
$SSCPDAF EQU   $IFTOUT+6                                                01675000
$LDNCBPT EQU   $DEVTBLE+48                                              01676000
$CID     EQU   $DEVTBLE+52                                              01677000
$RNINFO  EQU   $DEVTBLE+56                                              01678000
$LINENME EQU   $RNINFO                                                  01679000
$DEVFLG5 EQU   $RNINFO+8                                                01680000
$ENDNODE EQU   $DEVFLG5                                                 01681000
$REMOTE  EQU   $DEVFLG5                                                 01682000
$DEVFLG4 EQU   $DEVTBLE+65                                              01683000
$DEVCNTS EQU   TOLTEPWA+1464                                            01684000
$SLTBL   EQU   TOLTEPWA+1468                                            01685000
$RUNTEST EQU   $SLTBL+13                                                01686000
$TESTFLG EQU   $SLTBL+21                                                01687000
$SECLST  EQU   $SLTBL+22                                                01688000
$TLTRPL1 EQU   TOLTEPWA+1616                                            01689000
$TLTRPL2 EQU   TOLTEPWA+1736                                            01690000
$TLTRPL3 EQU   TOLTEPWA+1856                                            01691000
$INBUFR  EQU   TOLTEPWA+2104                                            01692000
$TRMINPT EQU   TOLTEPWA+2184                                            01693000
$PASSONA EQU   TOLTEPWA+2264                                            01694000
$EXTA    EQU   TOLTEPWA+2320                                            01695000
#EXITA   EQU   TOLTEPWA+2632                                            01696000
$CCOMDAT EQU   TOLTEPWA+2644                                            01697000
$CFLGS   EQU   $CCOMDAT+16                                              01698000
$24FEMSG EQU   TOLTEPWA+2681                                            01699000
$24CATMG EQU   $24FEMSG+11                                              01700000
@NM00068 EQU   TOLTEPWA+2776                                            01701000
$OUNTPTR EQU   @NM00068+4                                               01702000
$NSPTR   EQU   $OUNTPTR                                                 01703000
$NSCNT   EQU   @NM00068+10                                              01704000
$ENXX    EQU   @NM00068+15                                              01705000
$IMITX   EQU   $ENXX                                                    01706000
$RPLERR  EQU   TOLTEPWA+2977                                            01707000
SVESC033 EQU   TOLTEPWA+3160                                            01708000
SVECC013 EQU   TOLTEPWA+3232                                            01709000
SVEIC003 EQU   TOLTEPWA+3592                                            01710000
SVESC022 EQU   TOLTEPWA+3736                                            01711000
SVECC010 EQU   TOLTEPWA+3952                                            01712000
SVECC011 EQU   TOLTEPWA+4024                                            01713000
#EXIT    EQU   0                                                        01714000
IFGRPL   EQU   0                                                        01715000
RPLCOMN  EQU   IFGRPL                                                   01716000
RPLIDWD  EQU   RPLCOMN                                                  01717000
RPLLEN   EQU   RPLIDWD+3                                                01718000
RPLECB   EQU   RPLCOMN+8                                                01719000
RPLFDBWD EQU   RPLCOMN+12                                               01720000
RPLFDBK  EQU   RPLFDBWD+1                                               01721000
RPLRTNCD EQU   RPLFDBK                                                  01722000
RPLCNDCD EQU   RPLFDBK+1                                                01723000
RPLCMPON EQU   RPLCNDCD                                                 01724000
RPLFDB2  EQU   RPLCMPON                                                 01725000
RPLERRCD EQU   RPLCNDCD+1                                               01726000
RPLFDB3  EQU   RPLERRCD                                                 01727000
RPLKEYLE EQU   RPLCOMN+16                                               01728000
RPLARG   EQU   RPLCOMN+36                                               01729000
RPLOPTCD EQU   RPLCOMN+40                                               01730000
RPLOPT1  EQU   RPLOPTCD                                                 01731000
RPLECBSW EQU   RPLOPT1                                                  01732000
RPLOPT2  EQU   RPLOPTCD+1                                               01733000
RPLADR   EQU   RPLOPT2                                                  01734000
RPLOPT3  EQU   RPLOPTCD+2                                               01735000
RPLOPT4  EQU   RPLOPTCD+3                                               01736000
RPLNXTRP EQU   RPLCOMN+44                                               01737000
RPLOPTC2 EQU   RPLCOMN+56                                               01738000
RPLOPT5  EQU   RPLOPTC2                                                 01739000
RPLWRTYP EQU   RPLOPT5                                                  01740000
RPLOPT6  EQU   RPLOPTC2+1                                               01741000
RPLUNTYP EQU   RPLOPT6                                                  01742000
RPLOPT7  EQU   RPLOPTC2+2                                               01743000
RPLCNOPT EQU   RPLOPT7                                                  01744000
RPLOPT8  EQU   RPLOPTC2+3                                               01745000
RPLRBAR  EQU   RPLCOMN+60                                               01746000
RPLAIXID EQU   RPLRBAR+2                                                01747000
RPLEXTDS EQU   RPLCOMN+68                                               01748000
RPLEXTD1 EQU   RPLEXTDS                                                 01749000
RPLVTEXT EQU   IFGRPL+76                                                01750000
RPLFDBK2 EQU   RPLVTEXT+12                                              01751000
RPLSSNSI EQU   RPLFDBK2                                                 01752000
RPLDSB   EQU   RPLSSNSI                                                 01753000
RPLDSB1  EQU   RPLDSB                                                   01754000
RPLSSEI  EQU   RPLDSB1                                                  01755000
RPLDSB2  EQU   RPLDSB+1                                                 01756000
RPLUSNSI EQU   RPLFDBK2+2                                               01757000
RPLOPTC3 EQU   RPLVTEXT+20                                              01758000
RPLOPT9  EQU   RPLOPTC3                                                 01759000
RPLOPT10 EQU   RPLOPTC3+1                                               01760000
RPLOPT11 EQU   RPLOPTC3+2                                               01761000
RPLOPT12 EQU   RPLOPTC3+3                                               01762000
RPLOSENS EQU   RPLVTEXT+24                                              01763000
RPLSSNSO EQU   RPLOSENS                                                 01764000
RPLSSEO  EQU   RPLSSNSO                                                 01765000
ISTPROCD EQU   0                                                        01766000
PROPROC  EQU   ISTPROCD                                                 01767000
PROPROC1 EQU   PROPROC                                                  01768000
PROPROC2 EQU   PROPROC+1                                                01769000
PROPROC3 EQU   PROPROC+2                                                01770000
PROPROC4 EQU   PROPROC+3                                                01771000
PROPROCS EQU   0                                                        01772000
PROSETMS EQU   PROPROCS+1                                               01773000
PROSETM2 EQU   PROSETMS                                                 01774000
PROSETM3 EQU   PROSETMS+1                                               01775000
PROSETM4 EQU   PROSETMS+2                                               01776000
ISTDEVCH EQU   0                                                        01777000
DEVSHCH  EQU   ISTDEVCH                                                 01778000
DEVCHAR  EQU   DEVSHCH                                                  01779000
DEVTCODE EQU   ISTDEVCH+1                                               01780000
DEVFLAGS EQU   ISTDEVCH+3                                               01781000
DEVFCCTL EQU   DEVFLAGS                                                 01782000
DEVCHAR3 EQU   DEVFLAGS                                                 01783000
ISTNIB   EQU   0                                                        01784000
NIBUSER  EQU   ISTNIB+8                                                 01785000
NIBMODE  EQU   ISTNIB+20                                                01786000
NIBFLGS  EQU   ISTNIB+40                                                01787000
NIBFLG1  EQU   NIBFLGS                                                  01788000
NIBLMODE EQU   ISTNIB+48                                                01789000
NIBNDAR  EQU   ISTNIB+56                                                01790000
ISTAVT   EQU   0                                                        01791000
ISTAS49  EQU   ISTAVT+4                                                 01792000
ISTPAB   EQU   0                                                        01793000
PABWQCHN EQU   ISTPAB                                                   01794000
PABWEQA  EQU   PABWQCHN                                                 01795000
PABCHAIN EQU   PABWQCHN+4                                               01796000
PABRPHFG EQU   ISTPAB+12                                                01797000
PABFLAGS EQU   PABRPHFG                                                 01798000
PABERLCK EQU   PABFLAGS                                                 01799000
PABERRLK EQU   PABERLCK                                                 01800000
ISTLOK   EQU   0                                                        01801000
LOKCHN   EQU   ISTLOK+1                                                 01802000
LOKCHNG  EQU   LOKCHN                                                   01803000
@NM00077 EQU   LOKCHNG+2                                                01804000
ISTDYPAB EQU   0                                                        01805000
DYPPAB   EQU   ISTDYPAB+16                                              01806000
ISTRPH   EQU   0                                                        01807000
RPHCNTL  EQU   ISTRPH                                                   01808000
RPHFLAGS EQU   RPHCNTL+2                                                01809000
RPHAPTYP EQU   RPHFLAGS                                                 01810000
RPHFSTLC EQU   RPHFLAGS                                                 01811000
RPHFLGB  EQU   RPHCNTL+3                                                01812000
RPHRPHA  EQU   ISTRPH+4                                                 01813000
RPHTSKID EQU   ISTRPH+8                                                 01814000
RPHRESMA EQU   ISTRPH+16                                                01815000
RPHWPFLG EQU   RPHRESMA                                                 01816000
RPHWEA   EQU   ISTRPH+24                                                01817000
RPHCSPA  EQU   RPHWEA                                                   01818000
RPHSRPRM EQU   ISTRPH+28                                                01819000
RPHPABQA EQU   ISTRPH+36                                                01820000
RPHWORK  EQU   ISTRPH+40                                                01821000
RPHSAVE1 EQU   RPHWORK                                                  01822000
RPHSBITS EQU   RPHSAVE1+1                                               01823000
ISTATCVT EQU   0                                                        01824000
ATCCOM   EQU   ISTATCVT                                                 01825000
ATCSTAT  EQU   ATCCOM                                                   01826000
ATCSTAT1 EQU   ATCSTAT                                                  01827000
ATCACTIV EQU   ATCSTAT1                                                 01828000
ATCSNHLT EQU   ATCSTAT1                                                 01829000
ATCQKHLT EQU   ATCSTAT1                                                 01830000
ATCSTFLG EQU   ATCSTAT+1                                                01831000
ATCPOFLG EQU   ATCSTAT+2                                                01832000
ATCSTAT4 EQU   ATCSTAT+3                                                01833000
ATCIOTRC EQU   ATCCOM+140                                               01834000
ATCTHTRC EQU   ATCIOTRC                                                 01835000
ATCCSMR  EQU   ISTATCVT+296                                             01836000
ATCSHRFG EQU   ISTATCVT+316                                             01837000
ATCECTLP EQU   ISTATCVT+368                                             01838000
ATCHPGM  EQU   ISTATCVT+384                                             01839000
ATCVTIPB EQU   ISTATCVT+656                                             01840000
ATCVLCNT EQU   ISTATCVT+772                                             01841000
ATCRNO   EQU   ISTATCVT+788                                             01842000
ATCSOPD  EQU   ISTATCVT+792                                             01843000
ATCSIPD  EQU   ISTATCVT+800                                             01844000
ATCSECST EQU   ISTATCVT+812                                             01845000
ATCSTAT2 EQU   ISTATCVT+818                                             01846000
ATCVTBAM EQU   ISTATCVT+908                                             01847000
@NM00088 EQU   ATCVTBAM+3                                               01848000
ATCAOSM  EQU   ISTATCVT+912                                             01849000
ATCGSRBQ EQU   ATCAOSM+4                                                01850000
ATCGSRBG EQU   ATCGSRBQ                                                 01851000
ATCICAPP EQU   ATCAOSM+100                                              01852000
ATCLDAPP EQU   ATCAOSM+120                                              01853000
ATCDAPVT EQU   ATCAOSM+140                                              01854000
ATCCRA   EQU   ATCAOSM+280                                              01855000
ATCCRACN EQU   ATCCRA+4                                                 01856000
ATCSRB   EQU   ATCAOSM+288                                              01857000
ATCSRBCN EQU   ATCSRB+4                                                 01858000
ATCCRPL  EQU   ATCAOSM+296                                              01859000
ATCRPLCN EQU   ATCCRPL+4                                                01860000
ATCVTFLG EQU   ATCAOSM+392                                              01861000
ATCZFLAG EQU   ATCAOSM+588                                              01862000
ISTTIE   EQU   0                                                        01863000
TIETIEA  EQU   ISTTIE+4                                                 01864000
TIESNA   EQU   ISTTIE+8                                                 01865000
TIERPHA  EQU   ISTTIE+12                                                01866000
ISTIFTPL EQU   0                                                        01867000
IFTFB0   EQU   ISTIFTPL                                                 01868000
IFTSTDAF EQU   IFTFB0                                                   01869000
IFTFLNNM EQU   IFTFB0                                                   01870000
IFTFPABP EQU   IFTFB0                                                   01871000
IFTSB0   EQU   ISTIFTPL+2                                               01872000
IFTTPPST EQU   IFTSB0                                                   01873000
IFTSYMDV EQU   ISTIFTPL+8                                               01874000
IFTSYMRT EQU   ISTIFTPL+16                                              01875000
IFTPABPR EQU   ISTIFTPL+24                                              01876000
IFTLDNPR EQU   ISTIFTPL+28                                              01877000
ISTBIND  EQU   0                                                        01878000
BINFMTY  EQU   ISTBIND                                                  01879000
BINFM    EQU   ISTBIND+1                                                01880000
BINPRIP  EQU   ISTBIND+3                                                01881000
BINSECP  EQU   ISTBIND+4                                                01882000
BINCMNP  EQU   ISTBIND+5                                                01883000
BINCMNP2 EQU   ISTBIND+6                                                01884000
BINTSU   EQU   ISTBIND+7                                                01885000
BINRPACE EQU   BINTSU+1                                                 01886000
BINRUSZ  EQU   BINTSU+2                                                 01887000
BINSRUSZ EQU   BINRUSZ                                                  01888000
BINPRUSZ EQU   BINRUSZ+1                                                01889000
BINPRSVC EQU   ISTBIND+13                                               01890000
BINLUP   EQU   BINPRSVC                                                 01891000
BINPSCHR EQU   BINPRSVC+1                                               01892000
RPLOF16  EQU   0                                                        01893000
RPLRH3   EQU   RPLOF16                                                  01894000
RPLSRTYP EQU   RPLOF16+1                                                01895000
RPLSTYPE EQU   RPLSRTYP                                                 01896000
RPLRTYPE EQU   RPLSRTYP                                                 01897000
RPLCHN   EQU   RPLOF16+2                                                01898000
RPLVTFL1 EQU   RPLOF16+3                                                01899000
RPLVTFL2 EQU   RPLOF16+4                                                01900000
RPLPOSTV EQU   RPLVTFL2                                                 01901000
RPLRESP  EQU   RPLVTFL2                                                 01902000
RPLCNTRL EQU   RPLOF16+5                                                01903000
RPLCNTDF EQU   RPLCNTRL                                                 01904000
RPLCNTDC EQU   RPLCNTRL+1                                               01905000
RPLCNTSC EQU   RPLCNTRL+2                                               01906000
RPLOF60  EQU   0                                                        01907000
RPLOBSQ  EQU   RPLOF60+4                                                01908000
RPLIBSQ  EQU   RPLOF60+5                                                01909000
SYMNME   EQU   0                                                        01910000
ITATCF   EQU   0                                                        01911000
ITATCT   EQU   0                                                        01912000
SESSPRM  EQU   0                                                        01913000
FM       EQU   SESSPRM                                                  01914000
TS       EQU   SESSPRM+1                                                01915000
PRO      EQU   SESSPRM+2                                                01916000
ISTRPL   EQU   0                                                        01917000
CVTS01   EQU   CVTPGSIA                                                 01918000
CVTLPDIA EQU   CVTS01+12                                                01919000
CVTDIRST EQU   CVTLPDIA                                                 01920000
CVTSLIDA EQU   CVTS01+24                                                01921000
CVTCTLFG EQU   CVTS01+50                                                01922000
CVTRV210 EQU   CVTS01+424                                               01923000
CVTRV219 EQU   CVTS01+425                                               01924000
CVTRV228 EQU   CVTS01+426                                               01925000
CVTRV237 EQU   CVTS01+427                                               01926000
CVTMFRTR EQU   CVTS01+452                                               01927000
CVTRV262 EQU   CVTS01+468                                               01928000
CVTRV271 EQU   CVTS01+469                                               01929000
CVTRV280 EQU   CVTS01+470                                               01930000
CVTRV289 EQU   CVTS01+471                                               01931000
CVTGSDA  EQU   CVTS01+600                                               01932000
IFTSYMOV EQU   IFTSYMDV                                                 01933000
BINLUP1  EQU   BINPSCHR                                                 01934000
BINLUS   EQU   BINPSCHR                                                 01935000
BINFMF1  EQU   BINLUS                                                   01936000
BINRSV09 EQU   BINFMF1                                                  01937000
BINDSPF1 EQU   BINLUS+2                                                 01938000
BINMEDIA EQU   BINLUS+4                                                 01939000
BINLUP2  EQU   BINPSCHR                                                 01940000
BINLUP3  EQU   BINPSCHR                                                 01941000
IFTLONPR EQU   IFTLDNPR                                                 01942000
SVECC012 EQU   SVESC022                                                 01943000
SVEIC00A EQU   SVEIC003                                                 01944000
SVEIC004 EQU   SVEIC003                                                 01945000
SVEIC005 EQU   SVEIC003                                                 01946000
SVESC02A EQU   SVESC022                                                 01947000
SVESC02B EQU   SVESC022                                                 01948000
SVESC02D EQU   SVESC022                                                 01949000
SVESC02E EQU   SVESC022                                                 01950000
SVESC02F EQU   SVECC013                                                 01951000
SVESC024 EQU   SVESC022                                                 01952000
SVESC027 EQU   SVESC022                                                 01953000
SVESC029 EQU   SVESC033                                                 01954000
SVESC031 EQU   SVECC013                                                 01955000
SVESC032 EQU   SVECC011                                                 01956000
SVETC037 EQU   SVEIC003                                                 01957000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01958000
BINRSV26 EQU   BINLUP3                                                  01959000
BINRSV15 EQU   BINLUP2+10                                               01960000
BINPRESZ EQU   BINLUP2+9                                                01961000
BINRSV14 EQU   BINLUP2                                                  01962000
BINRSV13 EQU   BINMEDIA                                                 01963000
BINDISK  EQU   BINMEDIA                                                 01964000
BINXCHNG EQU   BINMEDIA                                                 01965000
BINCARD  EQU   BINMEDIA                                                 01966000
BINDOCMT EQU   BINMEDIA                                                 01967000
BINRSV17 EQU   BINDSPF1+1                                               01968000
BINTRNDS EQU   BINDSPF1                                                 01969000
BINRSV12 EQU   BINDSPF1                                                 01970000
BINVSDS  EQU   BINDSPF1                                                 01971000
BINVTDS  EQU   BINDSPF1                                                 01972000
BINHFDS  EQU   BINDSPF1                                                 01973000
BININTR  EQU   BINDSPF1                                                 01974000
BINRSV11 EQU   BINRSV09+1                                               01975000
BINXFPD  EQU   BINRSV09+1                                               01976000
BINCSDS  EQU   BINRSV09+1                                               01977000
BINQDSI  EQU   BINRSV09+1                                               01978000
BINRSV16 EQU   BINRSV09+1                                               01979000
BINARRR  EQU   BINRSV09                                                 01980000
BINSIDS  EQU   BINRSV09                                                 01981000
BINSAI   EQU   BINRSV09                                                 01982000
BINSDSI  EQU   BINRSV09                                                 01983000
BINKDDSI EQU   BINRSV09                                                 01984000
BINPDIR  EQU   BINFMF1                                                  01985000
BINCMPCT EQU   BINFMF1                                                  01986000
BINDESTS EQU   BINFMF1                                                  01987000
BINSLUS1 EQU   BINLUP1+6                                                01988000
BINPLUS1 EQU   BINLUP1+1                                                01989000
BINDSP1  EQU   BINLUP1                                                  01990000
BINFMHS1 EQU   BINLUP1                                                  01991000
CVTRV628 EQU   CVTS01+728                                               01992000
CVTRV627 EQU   CVTS01+724                                               01993000
CVTRV626 EQU   CVTS01+720                                               01994000
CVTRV625 EQU   CVTS01+716                                               01995000
CVTRV624 EQU   CVTS01+712                                               01996000
CVTRV623 EQU   CVTS01+708                                               01997000
CVTRV622 EQU   CVTS01+704                                               01998000
CVTRV621 EQU   CVTS01+700                                               01999000
CVTRV620 EQU   CVTS01+696                                               02000000
CVTRV619 EQU   CVTS01+692                                               02001000
CVTRV618 EQU   CVTS01+688                                               02002000
CVTRV617 EQU   CVTS01+684                                               02003000
CVTRV616 EQU   CVTS01+680                                               02004000
CVTRV615 EQU   CVTS01+676                                               02005000
CVTRV614 EQU   CVTS01+672                                               02006000
CVTRV613 EQU   CVTS01+668                                               02007000
CVTTCASP EQU   CVTS01+664                                               02008000
CVT0PT03 EQU   CVTS01+660                                               02009000
CVT0PT0E EQU   CVTS01+656                                               02010000
CVTIRM   EQU   CVTS01+652                                               02011000
CVTCGK   EQU   CVTS01+648                                               02012000
CVTRV607 EQU   CVTS01+644                                               02013000
CVTRV606 EQU   CVTS01+640                                               02014000
CVTRV605 EQU   CVTS01+636                                               02015000
CVTRV604 EQU   CVTS01+632                                               02016000
CVTEFF02 EQU   CVTS01+628                                               02017000
CVTCBBR  EQU   CVTS01+624                                               02018000
CVTSSCR  EQU   CVTS01+620                                               02019000
CVTEVENT EQU   CVTS01+616                                               02020000
CVTCRCA  EQU   CVTS01+612                                               02021000
CVTTPIO  EQU   CVTS01+608                                               02022000
CVTADV   EQU   CVTS01+604                                               02023000
CVTGSDAB EQU   CVTGSDA                                                  02024000
CVTQV3   EQU   CVTS01+596                                               02025000
CVTQV2   EQU   CVTS01+592                                               02026000
CVTQV1   EQU   CVTS01+588                                               02027000
CVTRPT   EQU   CVTS01+584                                               02028000
CVTSSRB  EQU   CVTS01+580                                               02029000
CVTCSDRL EQU   CVTS01+576                                               02030000
CVTEXP1  EQU   CVTS01+572                                               02031000
CVTRMPMT EQU   CVTS01+568                                               02032000
CVTRMPTT EQU   CVTS01+564                                               02033000
CVTVPSA  EQU   CVTS01+560                                               02034000
CVTVSTOP EQU   CVTS01+556                                               02035000
CVTGTFR8 EQU   CVTS01+552                                               02036000
CVTQUIT  EQU   CVTS01+548                                               02037000
CVTVACR  EQU   CVTS01+544                                               02038000
CVTWTCB  EQU   CVTS01+540                                               02039000
CVTSTPRS EQU   CVTS01+536                                               02040000
CVT0PT02 EQU   CVTS01+532                                               02041000
CVTDARCM EQU   CVTS01+528                                               02042000
CVTIRECM EQU   CVTS01+524                                               02043000
CVTJRECM EQU   CVTS01+520                                               02044000
CVTVEMS0 EQU   CVTS01+516                                               02045000
CVTSPFRR EQU   CVTS01+512                                               02046000
CVTRLSTG EQU   CVTS01+508                                               02047000
CVT0TC0A EQU   CVTS01+504                                               02048000
CVTGMBR  EQU   CVTS01+500                                               02049000
CVTLFRM  EQU   CVTS01+496                                               02050000
CVTRMBR  EQU   CVTS01+492                                               02051000
CVTVIOP  EQU   CVTS01+488                                               02052000
CVTRV307 EQU   CVTS01+486                                               02053000
CVTRV306 EQU   CVTS01+484                                               02054000
CVTRV305 EQU   CVTS01+482                                               02055000
CVTRV304 EQU   CVTS01+480                                               02056000
CVTRV303 EQU   CVTS01+478                                               02057000
CVTRV302 EQU   CVTS01+476                                               02058000
CVTTRCA  EQU   CVTS01+472                                               02059000
CVTRV297 EQU   CVTRV289                                                 02060000
CVTRV296 EQU   CVTRV289                                                 02061000
CVTRV295 EQU   CVTRV289                                                 02062000
CVTRV294 EQU   CVTRV289                                                 02063000
CVTRV293 EQU   CVTRV289                                                 02064000
CVTRV292 EQU   CVTRV289                                                 02065000
CVTRV291 EQU   CVTRV289                                                 02066000
CVTRV290 EQU   CVTRV289                                                 02067000
CVTRV288 EQU   CVTRV280                                                 02068000
CVTRV287 EQU   CVTRV280                                                 02069000
CVTRV286 EQU   CVTRV280                                                 02070000
CVTRV285 EQU   CVTRV280                                                 02071000
CVTRV284 EQU   CVTRV280                                                 02072000
CVTRV283 EQU   CVTRV280                                                 02073000
CVTRV282 EQU   CVTRV280                                                 02074000
CVTRV281 EQU   CVTRV280                                                 02075000
CVTRV279 EQU   CVTRV271                                                 02076000
CVTRV278 EQU   CVTRV271                                                 02077000
CVTRV277 EQU   CVTRV271                                                 02078000
CVTRV276 EQU   CVTRV271                                                 02079000
CVTRV275 EQU   CVTRV271                                                 02080000
CVTRV274 EQU   CVTRV271                                                 02081000
CVTRV273 EQU   CVTRV271                                                 02082000
CVTRV272 EQU   CVTRV271                                                 02083000
CVTRV270 EQU   CVTRV262                                                 02084000
CVTRV269 EQU   CVTRV262                                                 02085000
CVTRV268 EQU   CVTRV262                                                 02086000
CVTRV267 EQU   CVTRV262                                                 02087000
CVTRV266 EQU   CVTRV262                                                 02088000
CVTRV265 EQU   CVTRV262                                                 02089000
CVTRV264 EQU   CVTRV262                                                 02090000
CVTRV263 EQU   CVTRV262                                                 02091000
CVTVFP   EQU   CVTS01+464                                               02092000
CVTVSI   EQU   CVTS01+460                                               02093000
CVTVPSIB EQU   CVTS01+456                                               02094000
CVTMFACT EQU   CVTMFRTR                                                 02095000
CVTMFCTL EQU   CVTS01+448                                               02096000
CVTPVBP  EQU   CVTS01+444                                               02097000
CVTPWI   EQU   CVTS01+440                                               02098000
CVTRV254 EQU   CVTS01+438                                               02099000
CVTRV253 EQU   CVTS01+436                                               02100000
CVTRV252 EQU   CVTS01+434                                               02101000
CVTRV251 EQU   CVTS01+433                                               02102000
CVTRV250 EQU   CVTS01+432                                               02103000
CVTRV249 EQU   CVTS01+431                                               02104000
CVTRV248 EQU   CVTS01+430                                               02105000
CVTRV247 EQU   CVTS01+429                                               02106000
CVTRV246 EQU   CVTS01+428                                               02107000
CVTRV245 EQU   CVTRV237                                                 02108000
CVTRV244 EQU   CVTRV237                                                 02109000
CVTRV243 EQU   CVTRV237                                                 02110000
CVTRV242 EQU   CVTRV237                                                 02111000
CVTRV241 EQU   CVTRV237                                                 02112000
CVTRV240 EQU   CVTRV237                                                 02113000
CVTRV239 EQU   CVTRV237                                                 02114000
CVTRV238 EQU   CVTRV237                                                 02115000
CVTRV236 EQU   CVTRV228                                                 02116000
CVTRV235 EQU   CVTRV228                                                 02117000
CVTRV234 EQU   CVTRV228                                                 02118000
CVTRV233 EQU   CVTRV228                                                 02119000
CVTRV232 EQU   CVTRV228                                                 02120000
CVTRV231 EQU   CVTRV228                                                 02121000
CVTRV230 EQU   CVTRV228                                                 02122000
CVTRV229 EQU   CVTRV228                                                 02123000
CVTRV227 EQU   CVTRV219                                                 02124000
CVTRV226 EQU   CVTRV219                                                 02125000
CVTRV225 EQU   CVTRV219                                                 02126000
CVTRV224 EQU   CVTRV219                                                 02127000
CVTRV223 EQU   CVTRV219                                                 02128000
CVTRV222 EQU   CVTRV219                                                 02129000
CVTRV221 EQU   CVTRV219                                                 02130000
CVTRV220 EQU   CVTRV219                                                 02131000
CVTRV218 EQU   CVTRV210                                                 02132000
CVTRV217 EQU   CVTRV210                                                 02133000
CVTRV216 EQU   CVTRV210                                                 02134000
CVTRV215 EQU   CVTRV210                                                 02135000
CVTRV214 EQU   CVTRV210                                                 02136000
CVTRV213 EQU   CVTRV210                                                 02137000
CVTRV212 EQU   CVTRV210                                                 02138000
CVTRV211 EQU   CVTRV210                                                 02139000
CVTLCCAT EQU   CVTS01+420                                               02140000
CVTPCCAT EQU   CVTS01+416                                               02141000
CVTIPCRP EQU   CVTS01+412                                               02142000
CVTIPCRI EQU   CVTS01+408                                               02143000
CVTIPCDS EQU   CVTS01+404                                               02144000
CVTAIDVT EQU   CVTS01+400                                               02145000
CVTSSAP  EQU   CVTS01+396                                               02146000
CVTEHCIR EQU   CVTS01+392                                               02147000
CVTEHDEF EQU   CVTS01+388                                               02148000
CVTDAIR  EQU   CVTS01+384                                               02149000
CVTPERFM EQU   CVTS01+380                                               02150000
CVT044R2 EQU   CVTS01+376                                               02151000
CVTFETCH EQU   CVTS01+372                                               02152000
CVTRSTWD EQU   CVTS01+368                                               02153000
CVTSPOST EQU   CVTS01+364                                               02154000
CVTIOBP  EQU   CVTS01+360                                               02155000
CVTASMVT EQU   CVTS01+356                                               02156000
CVTRECRQ EQU   CVTS01+352                                               02157000
CVTWSAC  EQU   CVTS01+348                                               02158000
CVTRV149 EQU   CVTS01+344                                               02159000
CVTWSAL  EQU   CVTS01+340                                               02160000
CVTSPSA  EQU   CVTS01+336                                               02161000
CVTGLMN  EQU   CVTS01+332                                               02162000
CVTVEAC0 EQU   CVTS01+328                                               02163000
CVT062R1 EQU   CVTS01+324                                               02164000
CVTRPOST EQU   CVTS01+320                                               02165000
CVTDQIQE EQU   CVTS01+316                                               02166000
CVTCSD   EQU   CVTS01+312                                               02167000
CVTLKRMA EQU   CVTS01+308                                               02168000
CVTRSPIE EQU   CVTS01+304                                               02169000
CVTRENQ  EQU   CVTS01+300                                               02170000
CVTLQCB  EQU   CVTS01+296                                               02171000
CVTFQCB  EQU   CVTS01+292                                               02172000
CVTQCS01 EQU   CVTS01+288                                               02173000
CVTAPFT  EQU   CVTS01+284                                               02174000
CVTPARRL EQU   CVTS01+280                                               02175000
CVTVWAIT EQU   CVTS01+276                                               02176000
CVTGSPL  EQU   CVTS01+272                                               02177000
CVTLSMQ  EQU   CVTS01+268                                               02178000
CVTGSMQ  EQU   CVTS01+264                                               02179000
CVTEXPRO EQU   CVTS01+260                                               02180000
CVTOPCTP EQU   CVTS01+256                                               02181000
CVTSIC   EQU   CVTS01+252                                               02182000
CVTTPIOS EQU   CVTS01+248                                               02183000
CVTRTMS  EQU   CVTS01+244                                               02184000
CVTSDBF  EQU   CVTS01+240                                               02185000
CVTSCBP  EQU   CVTS01+236                                               02186000
CVTSDMP  EQU   CVTS01+232                                               02187000
CVTSV60  EQU   CVTS01+228                                               02188000
CVTRTMCT EQU   CVTS01+224                                               02189000
CVTASCBL EQU   CVTS01+220                                               02190000
CVTASCBH EQU   CVTS01+216                                               02191000
CVTGDA   EQU   CVTS01+212                                               02192000
CVTASVT  EQU   CVTS01+208                                               02193000
CVTVVMDI EQU   CVTS01+204                                               02194000
CVTAQTOP EQU   CVTS01+200                                               02195000
CVTIOSCS EQU   CVTS01+196                                               02196000
CVTSDRM  EQU   CVTS01+192                                               02197000
CVTOPTE  EQU   CVTS01+188                                               02198000
CVTSTXU  EQU   CVTS01+184                                               02199000
CVTQUIS  EQU   CVTS01+180                                               02200000
CVTPARS  EQU   CVTS01+176                                               02201000
CVTS1EE  EQU   CVTS01+172                                               02202000
CVTFRAS  EQU   CVTS01+168                                               02203000
CVTQSAS  EQU   CVTS01+164                                               02204000
CVTCRAS  EQU   CVTS01+160                                               02205000
CVTCRMN  EQU   CVTS01+156                                               02206000
CVTDELCP EQU   CVTS01+152                                               02207000
CVTFRECL EQU   CVTS01+148                                               02208000
CVTGETCL EQU   CVTS01+144                                               02209000
CVTBLDCP EQU   CVTS01+140                                               02210000
CVTAUTHL EQU   CVTS01+136                                               02211000
CVTSCAN  EQU   CVTS01+132                                               02212000
CVTRV144 EQU   CVTS01+130                                               02213000
CVTMAXMP EQU   CVTS01+128                                               02214000
CVTSTCK  EQU   CVTS01+124                                               02215000
CVTRV139 EQU   CVTS01+123                                               02216000
CVTDSSAC EQU   CVTS01+122                                               02217000
CVTRV513 EQU   CVTS01+121                                               02218000
CVTIOSPL EQU   CVTS01+120                                               02219000
CVTPTGT  EQU   CVTS01+116                                               02220000
CVTCSPIE EQU   CVTS01+112                                               02221000
CVTSMFEX EQU   CVTS01+108                                               02222000
CVTOLT0A EQU   CVTS01+104                                               02223000
CVTSRBRT EQU   CVTS01+100                                               02224000
CVTPUTL  EQU   CVTS01+96                                                02225000
CVTASCRL EQU   CVTS01+92                                                02226000
CVTASCRF EQU   CVTS01+88                                                02227000
CVTRV326 EQU   CVTS01+84                                                02228000
CVTRV325 EQU   CVTS01+80                                                02229000
CVTRV324 EQU   CVTS01+76                                                02230000
CVT0VL01 EQU   CVTS01+72                                                02231000
CVTSHRVM EQU   CVTS01+68                                                02232000
CVTRV332 EQU   CVTS01+64                                                02233000
CVTTAS   EQU   CVTS01+60                                                02234000
CVTRSCN  EQU   CVTS01+56                                                02235000
CVTTRAC2 EQU   CVTS01+54                                                02236000
CVTTRACE EQU   CVTS01+52                                                02237000
CVTAPG   EQU   CVTS01+51                                                02238000
CVTSDTRC EQU   CVTCTLFG                                                 02239000
CVTGTRCE EQU   CVTCTLFG                                                 02240000
CVTNOMP  EQU   CVTCTLFG                                                 02241000
CVTRSV79 EQU   CVTCTLFG                                                 02242000
CVTDSTAT EQU   CVTCTLFG                                                 02243000
CVTRSV78 EQU   CVTCTLFG                                                 02244000
CVTRV333 EQU   CVTCTLFG                                                 02245000
CVTRV323 EQU   CVTCTLFG                                                 02246000
CVTSPVLK EQU   CVTS01+49                                                02247000
CVTRSV77 EQU   CVTS01+48                                                02248000
CVTRV331 EQU   CVTS01+44                                                02249000
CVTRV330 EQU   CVTS01+40                                                02250000
CVTRV329 EQU   CVTS01+36                                                02251000
CVTRV328 EQU   CVTS01+32                                                02252000
CVTRV322 EQU   CVTS01+28                                                02253000
CVTSLID  EQU   CVTSLIDA+1                                               02254000
CVTSYLK  EQU   CVTSLIDA                                                 02255000
CVTRV321 EQU   CVTS01+20                                                02256000
CVTRV320 EQU   CVTS01+16                                                02257000
CVTLPDIR EQU   CVTLPDIA+1                                               02258000
CVTRSV69 EQU   CVTDIRST                                                 02259000
CVTRSV68 EQU   CVTDIRST                                                 02260000
CVTRSV67 EQU   CVTDIRST                                                 02261000
CVTRSV66 EQU   CVTDIRST                                                 02262000
CVTRSV65 EQU   CVTDIRST                                                 02263000
CVTRSV64 EQU   CVTDIRST                                                 02264000
CVTRSV63 EQU   CVTDIRST                                                 02265000
CVTDICOM EQU   CVTDIRST                                                 02266000
CVTPVTP  EQU   CVTS01+8                                                 02267000
CVTLPDSR EQU   CVTS01+4                                                 02268000
CVTGETL  EQU   CVTS01                                                   02269000
RPLSEQNO EQU   RPLOF60+6                                                02270000
@NM00120 EQU   RPLIBSQ                                                  02271000
RPLIINV  EQU   RPLIBSQ                                                  02272000
RPLINEG  EQU   RPLIBSQ                                                  02273000
RPLIPOS  EQU   RPLIBSQ                                                  02274000
RPLIIGN  EQU   RPLIBSQ                                                  02275000
RPLIRSET EQU   RPLIBSQ                                                  02276000
RPLITST  EQU   RPLIBSQ                                                  02277000
RPLISET  EQU   RPLIBSQ                                                  02278000
@NM00119 EQU   RPLOBSQ                                                  02279000
RPLOINV  EQU   RPLOBSQ                                                  02280000
RPLONEG  EQU   RPLOBSQ                                                  02281000
RPLOPOS  EQU   RPLOBSQ                                                  02282000
RPLOIGN  EQU   RPLOBSQ                                                  02283000
RPLORSET EQU   RPLOBSQ                                                  02284000
RPLOTST  EQU   RPLOBSQ                                                  02285000
RPLOSET  EQU   RPLOBSQ                                                  02286000
RPLIBSQV EQU   RPLOF60+2                                                02287000
RPLOBSQV EQU   RPLOF60                                                  02288000
@NM00118 EQU   RPLCNTSC                                                 02289000
RPLRSHUT EQU   RPLCNTSC                                                 02290000
RPLRQR   EQU   RPLCNTSC                                                 02291000
RPLSHUTC EQU   RPLCNTSC                                                 02292000
RPLSHUTD EQU   RPLCNTSC                                                 02293000
RPLSTSN  EQU   RPLCNTSC                                                 02294000
RPLCLEAR EQU   RPLCNTSC                                                 02295000
RPLSDT   EQU   RPLCNTSC                                                 02296000
@NM00117 EQU   RPLCNTDC                                                 02297000
RPLSIGNL EQU   RPLCNTDC                                                 02298000
RPLLUS   EQU   RPLCNTDC                                                 02299000
RPLRTR   EQU   RPLCNTDC                                                 02300000
RPLBID   EQU   RPLCNTDC                                                 02301000
@NM00116 EQU   RPLCNTDF                                                 02302000
RPLQI    EQU   RPLCNTDF                                                 02303000
RPLRELQ  EQU   RPLCNTDF                                                 02304000
RPLCHASE EQU   RPLCNTDF                                                 02305000
RPLQEC   EQU   RPLCNTDF                                                 02306000
RPLQC    EQU   RPLCNTDF                                                 02307000
RPLCNCEL EQU   RPLCNTDF                                                 02308000
RPLDATA  EQU   RPLCNTDF                                                 02309000
RPLRRN   EQU   RPLRESP                                                  02310000
RPLNFME  EQU   RPLRESP                                                  02311000
RPLEX    EQU   RPLRESP                                                  02312000
@NM00115 EQU   RPLRESP                                                  02313000
@NM00114 EQU   RPLPOSTV                                                 02314000
RPLSCHED EQU   RPLPOSTV                                                 02315000
@NM00113 EQU   RPLVTFL1                                                 02316000
RPLAUTUS EQU   RPLVTFL1                                                 02317000
RPLVTUSE EQU   RPLVTFL1                                                 02318000
@NM00112 EQU   RPLVTFL1                                                 02319000
@NM00111 EQU   RPLCHN                                                   02320000
RPLONLY  EQU   RPLCHN                                                   02321000
RPLLAST  EQU   RPLCHN                                                   02322000
RPLMIDLE EQU   RPLCHN                                                   02323000
RPLFIRST EQU   RPLCHN                                                   02324000
@NM00110 EQU   RPLRTYPE                                                 02325000
RPLDFASY EQU   RPLRTYPE                                                 02326000
RPLNFSYN EQU   RPLRTYPE                                                 02327000
RPLRRESP EQU   RPLRTYPE                                                 02328000
@NM00109 EQU   RPLSTYPE                                                 02329000
RPLSRESP EQU   RPLSTYPE                                                 02330000
@NM00108 EQU   RPLRH3                                                   02331000
RPLCSI   EQU   RPLRH3                                                   02332000
RPLCHREQ EQU   RPLRH3                                                   02333000
RPLCMD   EQU   RPLRH3                                                   02334000
RPLEB    EQU   RPLRH3                                                   02335000
RPLBB    EQU   RPLRH3                                                   02336000
BINUSE   EQU   ISTBIND+36                                               02337000
BINUSEL  EQU   ISTBIND+35                                               02338000
BINPRIM  EQU   ISTBIND+27                                               02339000
BINPRIML EQU   ISTBIND+26                                               02340000
BINRSV05 EQU   ISTBIND+25                                               02341000
BINLUTYP EQU   BINLUP                                                   02342000
BINRSV27 EQU   BINLUP                                                   02343000
BINRSV08 EQU   BINTSU+4                                                 02344000
BINPRUSE EQU   BINPRUSZ                                                 02345000
BINPRUSM EQU   BINPRUSZ                                                 02346000
BINSRUSE EQU   BINSRUSZ                                                 02347000
BINSRUSM EQU   BINSRUSZ                                                 02348000
BINRPACM EQU   BINRPACE                                                 02349000
BINRSV07 EQU   BINRPACE                                                 02350000
BINRSV06 EQU   BINTSU                                                   02351000
BINCONR  EQU   BINCMNP2                                                 02352000
BINRCHN  EQU   BINCMNP2                                                 02353000
BINMDIBK EQU   BINCMNP2                                                 02354000
BINBKFS  EQU   BINCMNP2                                                 02355000
BINRCVR  EQU   BINCMNP2                                                 02356000
BINFMTRM EQU   BINCMNP2                                                 02357000
BINRSV04 EQU   BINCMNP                                                  02358000
BINALT   EQU   BINCMNP                                                  02359000
BINBKTR  EQU   BINCMNP                                                  02360000
BINBRAK  EQU   BINCMNP                                                  02361000
BINFMHD  EQU   BINCMNP                                                  02362000
BINRSV03 EQU   BINCMNP                                                  02363000
BINSSEB  EQU   BINSECP                                                  02364000
BINSCMP  EQU   BINSECP                                                  02365000
BINRSV02 EQU   BINSECP                                                  02366000
BINSCHNR EQU   BINSECP                                                  02367000
BINSMCH  EQU   BINSECP                                                  02368000
BINSCHN  EQU   BINSECP                                                  02369000
BINPSEB  EQU   BINPRIP                                                  02370000
BINPCMP  EQU   BINPRIP                                                  02371000
BINRSV01 EQU   BINPRIP                                                  02372000
BINPCHNR EQU   BINPRIP                                                  02373000
BINPMCH  EQU   BINPRIP                                                  02374000
BINPCHN  EQU   BINPRIP                                                  02375000
BINTS    EQU   ISTBIND+2                                                02376000
BINTYPE  EQU   BINFMTY                                                  02377000
BINFMT   EQU   BINFMTY                                                  02378000
@NM00094 EQU   ISTIFTPL+36                                              02379000
@NM00093 EQU   ISTIFTPL+33                                              02380000
IFTRETCD EQU   ISTIFTPL+32                                              02381000
IFTECBPR EQU   ISTIFTPL+4                                               02382000
@NM00092 EQU   ISTIFTPL+3                                               02383000
@NM00091 EQU   IFTSB0                                                   02384000
IFTDEVOF EQU   IFTSB0                                                   02385000
IFTRDTLK EQU   IFTSB0                                                   02386000
IFTVOCLK EQU   IFTSB0                                                   02387000
IFTFB1   EQU   ISTIFTPL+1                                               02388000
IFTFLDNP EQU   IFTFB0                                                   02389000
IFTTBIOF EQU   IFTFB0                                                   02390000
IFTTBIO  EQU   IFTFB0                                                   02391000
IFTTBOFF EQU   IFTFB0                                                   02392000
IFTTBON  EQU   IFTFB0                                                   02393000
TIEPTR2  EQU   TIERPHA                                                  02394000
TIEPTR1  EQU   TIESNA                                                   02395000
TIEGATE  EQU   TIETIEA                                                  02396000
TIEREQ   EQU   ISTTIE+3                                                 02397000
TIERETCD EQU   ISTTIE+2                                                 02398000
TIELNGTH EQU   ISTTIE+1                                                 02399000
TIETYPE  EQU   ISTTIE                                                   02400000
ATCAOS   EQU   ISTATCVT+1584                                            02401000
ATCPOPAB EQU   ATCAOSM+640                                              02402000
ATCVIOPM EQU   ATCAOSM+636                                              02403000
ATCTPMMI EQU   ATCAOSM+632                                              02404000
ATCTPMPB EQU   ATCAOSM+600                                              02405000
ATCRSV88 EQU   ATCAOSM+596                                              02406000
ATCRPLCT EQU   ATCAOSM+594                                              02407000
ATCCRACT EQU   ATCAOSM+592                                              02408000
ATCSRBCT EQU   ATCAOSM+590                                              02409000
ATCRSV75 EQU   ATCAOSM+589                                              02410000
ATCRSV66 EQU   ATCZFLAG                                                 02411000
ATCZF001 EQU   ATCZFLAG                                                 02412000
ATCTPCP1 EQU   ATCAOSM+584                                              02413000
ATCTPCP0 EQU   ATCAOSM+580                                              02414000
ATCAICTN EQU   ATCAOSM+576                                              02415000
ATCZR01  EQU   ATCAOSM+572                                              02416000
ATCMPLTA EQU   ATCAOSM+568                                              02417000
ATCASCB  EQU   ATCAOSM+564                                              02418000
ATCAP86  EQU   ATCAOSM+560                                              02419000
ATCAP85  EQU   ATCAOSM+556                                              02420000
ATCAP84  EQU   ATCAOSM+552                                              02421000
ATCAP83  EQU   ATCAOSM+548                                              02422000
ATCAP82  EQU   ATCAOSM+544                                              02423000
ATCAP69  EQU   ATCAOSM+540                                              02424000
ATCAP66  EQU   ATCAOSM+536                                              02425000
ATCAP62  EQU   ATCAOSM+532                                              02426000
ATCAPC59 EQU   ATCAOSM+528                                              02427000
ATCAP56  EQU   ATCAOSM+524                                              02428000
ATCAP55  EQU   ATCAOSM+520                                              02429000
ATCRCFY0 EQU   ATCAOSM+516                                              02430000
ATCAP41  EQU   ATCAOSM+512                                              02431000
ATCAPC25 EQU   ATCAOSM+508                                              02432000
ATCAP23  EQU   ATCAOSM+504                                              02433000
ATCTPSPB EQU   ATCAOSM+472                                              02434000
ATCTRMPB EQU   ATCAOSM+440                                              02435000
ATCAPBE  EQU   ATCAOSM+436                                              02436000
ATCPSTA  EQU   ATCAOSM+432                                              02437000
ATCSMABF EQU   ATCAOSM+428                                              02438000
ATCSMAPR EQU   ATCAOSM+424                                              02439000
ATCTPWQA EQU   ATCAOSM+420                                              02440000
ATCSMAID EQU   ATCAOSM+416                                              02441000
ATCSMARA EQU   ATCAOSM+412                                              02442000
ATCCACXA EQU   ATCAOSM+408                                              02443000
ATCZLAAB EQU   ATCAOSM+404                                              02444000
ATCATA10 EQU   ATCAOSM+400                                              02445000
ATCHLTCB EQU   ATCAOSM+396                                              02446000
@NM00090 EQU   ATCVTFLG                                                 02447000
ATCVTACT EQU   ATCVTFLG                                                 02448000
ATCRPT40 EQU   ATCAOSM+388                                              02449000
ATCRPT39 EQU   ATCAOSM+384                                              02450000
ATCRPT38 EQU   ATCAOSM+380                                              02451000
ATCRPT37 EQU   ATCAOSM+376                                              02452000
ATCRPT36 EQU   ATCAOSM+372                                              02453000
ATCRPT35 EQU   ATCAOSM+368                                              02454000
ATCRPT34 EQU   ATCAOSM+364                                              02455000
ATCRPT33 EQU   ATCAOSM+360                                              02456000
ATCRPT32 EQU   ATCAOSM+356                                              02457000
ATCRPT31 EQU   ATCAOSM+352                                              02458000
ATCRPT30 EQU   ATCAOSM+348                                              02459000
ATCRPT29 EQU   ATCAOSM+344                                              02460000
ATCRPT28 EQU   ATCAOSM+340                                              02461000
ATCRPT27 EQU   ATCAOSM+336                                              02462000
ATCRPT26 EQU   ATCAOSM+332                                              02463000
ATCRPT25 EQU   ATCAOSM+328                                              02464000
ATCRPT24 EQU   ATCAOSM+324                                              02465000
ATCRPT23 EQU   ATCAOSM+320                                              02466000
ATCRPT22 EQU   ATCAOSM+316                                              02467000
ATCRPT21 EQU   ATCAOSM+312                                              02468000
ATCRPT20 EQU   ATCAOSM+308                                              02469000
ATCRPT19 EQU   ATCAOSM+304                                              02470000
ATCRPLAC EQU   ATCRPLCN+2                                               02471000
ATCRPLRC EQU   ATCRPLCN                                                 02472000
ATCCRPLQ EQU   ATCCRPL                                                  02473000
ATCSRBAC EQU   ATCSRBCN+2                                               02474000
ATCSRBRC EQU   ATCSRBCN                                                 02475000
ATCSRBQ  EQU   ATCSRB                                                   02476000
ATCCRAAC EQU   ATCCRACN+2                                               02477000
ATCCRARC EQU   ATCCRACN                                                 02478000
ATCCRAQ  EQU   ATCCRA                                                   02479000
ATCRPT12 EQU   ATCAOSM+276                                              02480000
ATCDMAPP EQU   ATCAOSM+272                                              02481000
ATCAP38  EQU   ATCAOSM+268                                              02482000
ATCAP37  EQU   ATCAOSM+264                                              02483000
ATCZDFJ0 EQU   ATCAOSM+260                                              02484000
ATCAP51  EQU   ATCAOSM+256                                              02485000
ATCZPAB2 EQU   ATCAOSM+224                                              02486000
ATCZPAB1 EQU   ATCAOSM+192                                              02487000
ATCZLFVT EQU   ATCAOSM+188                                              02488000
ATCZLPVT EQU   ATCAOSM+184                                              02489000
ATCZDVTX EQU   ATCAOSM+180                                              02490000
ATCZDVTA EQU   ATCAOSM+176                                              02491000
ATCZDVT9 EQU   ATCAOSM+172                                              02492000
ATCZDVT8 EQU   ATCAOSM+168                                              02493000
ATCZDVT7 EQU   ATCAOSM+164                                              02494000
ATCRSV56 EQU   ATCDAPVT+22                                              02495000
ATCDAPDG EQU   ATCDAPVT+20                                              02496000
ATCDXCEA EQU   ATCDAPVT+16                                              02497000
ATCDCEA  EQU   ATCDAPVT+12                                              02498000
ATCDPCIA EQU   ATCDAPVT+8                                               02499000
ATCDSIOA EQU   ATCDAPVT+4                                               02500000
ATCDEOEA EQU   ATCDAPVT                                                 02501000
ATCZLAEA EQU   ATCLDAPP+16                                              02502000
ATCZLCEA EQU   ATCLDAPP+12                                              02503000
ATCRSV17 EQU   ATCLDAPP+8                                               02504000
ATCSMFRR EQU   ATCLDAPP+4                                               02505000
ATCCDTID EQU   ATCLDAPP                                                 02506000
ATCZAEA  EQU   ATCICAPP+16                                              02507000
ATCZCEA  EQU   ATCICAPP+12                                              02508000
ATCCDTCB EQU   ATCICAPP+8                                               02509000
ATCZSIOA EQU   ATCICAPP+4                                               02510000
ATCCDRPH EQU   ATCICAPP                                                 02511000
ATCAP65  EQU   ATCAOSM+96                                               02512000
ATCZDVT6 EQU   ATCAOSM+92                                               02513000
ATCZDVT4 EQU   ATCAOSM+88                                               02514000
ATCZDVT3 EQU   ATCAOSM+84                                               02515000
ATCZDVT1 EQU   ATCAOSM+80                                               02516000
ATCICNCB EQU   ATCAOSM+76                                               02517000
ATCZPSVT EQU   ATCAOSM+72                                               02518000
ATCZFSVT EQU   ATCAOSM+68                                               02519000
ATCAP64  EQU   ATCAOSM+64                                               02520000
ATCAP63  EQU   ATCAOSM+60                                               02521000
ATCAP61  EQU   ATCAOSM+56                                               02522000
ATCAP58  EQU   ATCAOSM+52                                               02523000
ATCAP57  EQU   ATCAOSM+48                                               02524000
ATCAP54  EQU   ATCAOSM+44                                               02525000
ATCAP53  EQU   ATCAOSM+40                                               02526000
ATCAP52  EQU   ATCAOSM+36                                               02527000
ATCAP34  EQU   ATCAOSM+32                                               02528000
ATCAP32  EQU   ATCAOSM+28                                               02529000
ATCAP31  EQU   ATCAOSM+24                                               02530000
ATCAP12  EQU   ATCAOSM+20                                               02531000
ATCAP11  EQU   ATCAOSM+16                                               02532000
ATCCMTCB EQU   ATCAOSM+12                                               02533000
ATCPRPH  EQU   ATCAOSM+8                                                02534000
ATCGSRBF EQU   ATCGSRBG                                                 02535000
ATCSRBRT EQU   ATCAOSM                                                  02536000
@NM00089 EQU   @NM00088                                                 02537000
ATCVTMAB EQU   @NM00088                                                 02538000
@NM00087 EQU   ATCVTBAM                                                 02539000
ATCVDLOK EQU   ISTATCVT+904                                             02540000
ATCVFPAB EQU   ISTATCVT+872                                             02541000
ATCVDPAB EQU   ISTATCVT+840                                             02542000
ATCIOECB EQU   ISTATCVT+836                                             02543000
ATCINCW3 EQU   ISTATCVT+832                                             02544000
ATCMODTB EQU   ISTATCVT+828                                             02545000
ATCUSSPT EQU   ISTATCVT+824                                             02546000
ATCSRTAB EQU   ISTATCVT+820                                             02547000
@NM00086 EQU   ISTATCVT+819                                             02548000
@NM00085 EQU   ATCSTAT2                                                 02549000
ATCTRSMS EQU   ATCSTAT2                                                 02550000
ATCTRLOK EQU   ATCSTAT2                                                 02551000
ATCTRPSS EQU   ATCSTAT2                                                 02552000
ATCTRESC EQU   ATCSTAT2                                                 02553000
ATCTRAPI EQU   ATCSTAT2                                                 02554000
ATCNMCTR EQU   ISTATCVT+816                                             02555000
ATCSEC51 EQU   ATCSECST                                                 02556000
ATCSEC40 EQU   ATCSIPD+8                                                02557000
ATCSEC30 EQU   ATCSIPD+4                                                02558000
ATCSEC21 EQU   ATCSIPD                                                  02559000
ATCSEC10 EQU   ATCSOPD+4                                                02560000
ATCSEC01 EQU   ATCSOPD                                                  02561000
ATCPOIA  EQU   ATCRNO+1                                                 02562000
@NM00084 EQU   ATCRNO                                                   02563000
ATCPODVT EQU   ISTATCVT+784                                             02564000
ATCS49XL EQU   ISTATCVT+780                                             02565000
ATCS49XI EQU   ISTATCVT+776                                             02566000
ATCLCLCT EQU   ATCVLCNT+2                                               02567000
ATCRNCNT EQU   ATCVLCNT                                                 02568000
ATCCFEAD EQU   ISTATCVT+768                                             02569000
ATCPTR00 EQU   ISTATCVT+736                                             02570000
ATCRSV10 EQU   ISTATCVT+704                                             02571000
ATCTACB  EQU   ISTATCVT+700                                             02572000
ATCVTINM EQU   ISTATCVT+696                                             02573000
ATCTCLIM EQU   ISTATCVT+692                                             02574000
ATCTCLOM EQU   ISTATCVT+688                                             02575000
ATCTCIPB EQU   ISTATCVT+624                                             02576000
ATCTIPAB EQU   ISTATCVT+592                                             02577000
ATCOCCCB EQU   ISTATCVT+588                                             02578000
ATCOCCOB EQU   ISTATCVT+584                                             02579000
ATCCDLAD EQU   ISTATCVT+580                                             02580000
ATCCCLAD EQU   ISTATCVT+576                                             02581000
ATCDLRPB EQU   ISTATCVT+544                                             02582000
ATCPGPAB EQU   ISTATCVT+512                                             02583000
ATCVPAB1 EQU   ISTATCVT+480                                             02584000
ATCRSV97 EQU   ISTATCVT+476                                             02585000
ATCRDTLK EQU   ISTATCVT+472                                             02586000
ATCVOCLK EQU   ISTATCVT+468                                             02587000
ATCCDFDN EQU   ISTATCVT+464                                             02588000
ATCCDFIN EQU   ISTATCVT+460                                             02589000
ATCDVTLK EQU   ISTATCVT+456                                             02590000
ATCAP36  EQU   ISTATCVT+452                                             02591000
ATCAP35  EQU   ISTATCVT+448                                             02592000
ATCAP33  EQU   ISTATCVT+444                                             02593000
ATCRSV99 EQU   ISTATCVT+440                                             02594000
ATCONFIG EQU   ISTATCVT+432                                             02595000
ATCNODDS EQU   ISTATCVT+428                                             02596000
ATCNODEL EQU   ISTATCVT+420                                             02597000
ATCRSV69 EQU   ISTATCVT+416                                             02598000
ATCAPCR5 EQU   ISTATCVT+412                                             02599000
ATCLDECB EQU   ISTATCVT+408                                             02600000
ATCLDNCS EQU   ISTATCVT+404                                             02601000
ATCCDPTR EQU   ISTATCVT+400                                             02602000
ATCADEL  EQU   ISTATCVT+396                                             02603000
ATCTODVT EQU   ISTATCVT+392                                             02604000
ATCDEBCH EQU   ISTATCVT+388                                             02605000
ATCHBSIZ EQU   ATCHPGM+2                                                02606000
ATCHBFNO EQU   ATCHPGM                                                  02607000
ATCCRME  EQU   ISTATCVT+380                                             02608000
ATCRVCHS EQU   ISTATCVT+372                                             02609000
ATCZDVTB EQU   ISTATCVT+364                                             02610000
ATCECPRT EQU   ISTATCVT+360                                             02611000
ATCVTLOD EQU   ISTATCVT+356                                             02612000
ATCTRPAB EQU   ISTATCVT+352                                             02613000
ATCMSGM  EQU   ISTATCVT+348                                             02614000
ATCMSGP  EQU   ISTATCVT+344                                             02615000
ATCEPT   EQU   ISTATCVT+340                                             02616000
ATCDVT   EQU   ISTATCVT+336                                             02617000
ATCTRCPT EQU   ISTATCVT+332                                             02618000
ATCDVLOD EQU   ISTATCVT+328                                             02619000
ATCALERT EQU   ISTATCVT+324                                             02620000
ATCEPA   EQU   ISTATCVT+320                                             02621000
ATCSAF   EQU   ISTATCVT+318                                             02622000
ATCXRANG EQU   ISTATCVT+317                                             02623000
ATCLAST  EQU   ATCSHRFG                                                 02624000
ATCSHRTN EQU   ISTATCVT+308                                             02625000
ATCUEP   EQU   ISTATCVT+304                                             02626000
ATCOCRT  EQU   ISTATCVT+300                                             02627000
ATCCSMA  EQU   ATCCSMR                                                  02628000
ATCESC02 EQU   ISTATCVT+292                                             02629000
ATCESC01 EQU   ISTATCVT+288                                             02630000
ATCCDFND EQU   ISTATCVT+284                                             02631000
ATCCDDEL EQU   ISTATCVT+280                                             02632000
ATCCDADD EQU   ISTATCVT+276                                             02633000
ATCMNT   EQU   ISTATCVT+272                                             02634000
ATCRSV16 EQU   ISTATCVT+270                                             02635000
ATCMAXID EQU   ISTATCVT+269                                             02636000
ATCMSGSP EQU   ATCCOM+268                                               02637000
ATCCIDM  EQU   ATCCOM+266                                               02638000
ATCACTRM EQU   ATCCOM+264                                               02639000
ATCNERAP EQU   ATCCOM+260                                               02640000
ATCNESAL EQU   ATCCOM+256                                               02641000
ATCRCC65 EQU   ATCCOM+252                                               02642000
ATCRCC26 EQU   ATCCOM+248                                               02643000
ATCRCC63 EQU   ATCCOM+244                                               02644000
ATCRSV11 EQU   ATCCOM+242                                               02645000
ATCVTMID EQU   ATCCOM+240                                               02646000
ATCAPOST EQU   ATCCOM+236                                               02647000
ATCNERFN EQU   ATCCOM+232                                               02648000
ATCNERNE EQU   ATCCOM+228                                               02649000
ATCNERCV EQU   ATCCOM+224                                               02650000
ATCNERST EQU   ATCCOM+220                                               02651000
ATCDCC61 EQU   ATCCOM+216                                               02652000
ATCDCC60 EQU   ATCCOM+212                                               02653000
ATCSRTDF EQU   ATCCOM+208                                               02654000
ATCSRTAD EQU   ATCCOM+204                                               02655000
ATCFIRA  EQU   ATCCOM+200                                               02656000
ATCSMBQ  EQU   ATCCOM+196                                               02657000
ATCSMRC  EQU   ATCCOM+192                                               02658000
ATCSMRS  EQU   ATCCOM+188                                               02659000
ATCSMQU  EQU   ATCCOM+184                                               02660000
ATCSMRQ  EQU   ATCCOM+180                                               02661000
ATCACDA  EQU   ATCCOM+176                                               02662000
ATCSTMA  EQU   ATCCOM+172                                               02663000
ATCFRSTR EQU   ATCCOM+168                                               02664000
ATCGTSTR EQU   ATCCOM+164                                               02665000
ATCREADA EQU   ATCCOM+160                                               02666000
ATCALOAD EQU   ATCCOM+156                                               02667000
ATCBLDLA EQU   ATCCOM+152                                               02668000
ATCFBRPH EQU   ATCCOM+148                                               02669000
ATCBFTRC EQU   ATCCOM+144                                               02670000
ATCTPBUF EQU   ATCTHTRC                                                 02671000
ATCREMOV EQU   ATCCOM+136                                               02672000
ATCADD   EQU   ATCCOM+132                                               02673000
ATCBPDA  EQU   ATCCOM+128                                               02674000
ATCDVTPT EQU   ATCCOM+124                                               02675000
ATCFEPT  EQU   ATCCOM+120                                               02676000
ATCFDVT  EQU   ATCCOM+116                                               02677000
ATCCONFT EQU   ATCCOM+112                                               02678000
ATCPTCHA EQU   ATCCOM+108                                               02679000
ATCAUTHA EQU   ATCCOM+104                                               02680000
ATCACCTA EQU   ATCCOM+100                                               02681000
ATCRDTH  EQU   ATCCOM+96                                                02682000
ATCFRSCH EQU   ATCCOM+92                                                02683000
ATCFSB   EQU   ATCCOM+88                                                02684000
ATCHLTMS EQU   ATCCOM+84                                                02685000
ATCECPRM EQU   ATCCOM+80                                                02686000
ATCECNET EQU   ATCCOM+76                                                02687000
ATCECOPC EQU   ATCCOM+72                                                02688000
ATCVPARM EQU   ATCCOM+68                                                02689000
ATCECVRQ EQU   ATCCOM+64                                                02690000
ATCECSES EQU   ATCCOM+60                                                02691000
ATCOCHA  EQU   ATCCOM+56                                                02692000
ATCDSPLQ EQU   ATCCOM+52                                                02693000
ATCECDSP EQU   ATCCOM+48                                                02694000
ATCVARYQ EQU   ATCCOM+44                                                02695000
ATCECVRY EQU   ATCCOM+40                                                02696000
ATCHALTQ EQU   ATCCOM+36                                                02697000
ATCECHLT EQU   ATCCOM+32                                                02698000
ATCMODQ  EQU   ATCCOM+28                                                02699000
ATCECMOD EQU   ATCCOM+24                                                02700000
ATCASCHD EQU   ATCCOM+20                                                02701000
ATCSRT   EQU   ATCCOM+16                                                02702000
ATCRDT   EQU   ATCCOM+12                                                02703000
ATCDCFRR EQU   ATCCOM+8                                                 02704000
ATCAPI   EQU   ATCCOM+4                                                 02705000
ATCRSV04 EQU   ATCSTAT4                                                 02706000
ATCVTTRC EQU   ATCSTAT4                                                 02707000
ATCNCSD  EQU   ATCSTAT4                                                 02708000
ATCMTST  EQU   ATCSTAT4                                                 02709000
ATCTPRT  EQU   ATCSTAT4                                                 02710000
ATCPRTAT EQU   ATCSTAT4                                                 02711000
@NM00083 EQU   ATCPOFLG                                                 02712000
ATCPOUNS EQU   ATCPOFLG                                                 02713000
ATCHSDMF EQU   ATCSTFLG                                                 02714000
@NM00082 EQU   ATCSTAT1                                                 02715000
ATCMDHLT EQU   ATCSTAT1                                                 02716000
ATCINHLT EQU   ATCSTAT1                                                 02717000
ATCNETSL EQU   ATCSTAT1                                                 02718000
ATCSTART EQU   ATCSTAT1                                                 02719000
RPHNEXPO EQU   ISTRPH+104                                               02720000
RPHSAV16 EQU   RPHWORK+60                                               02721000
RPHSAV15 EQU   RPHWORK+56                                               02722000
RPHSAV14 EQU   RPHWORK+52                                               02723000
RPHSAV13 EQU   RPHWORK+48                                               02724000
RPHSAV12 EQU   RPHWORK+44                                               02725000
RPHSAV11 EQU   RPHWORK+40                                               02726000
RPHSAV10 EQU   RPHWORK+36                                               02727000
RPHSAVE9 EQU   RPHWORK+32                                               02728000
RPHSAVE8 EQU   RPHWORK+28                                               02729000
RPHSAVE7 EQU   RPHWORK+24                                               02730000
RPHSAVE6 EQU   RPHWORK+20                                               02731000
RPHSAVE5 EQU   RPHWORK+16                                               02732000
RPHSAVE4 EQU   RPHWORK+12                                               02733000
RPHSAVE3 EQU   RPHWORK+8                                                02734000
RPHSAVE2 EQU   RPHWORK+4                                                02735000
RPHSHALF EQU   RPHSAVE1+2                                               02736000
RPHSBIT8 EQU   RPHSBITS                                                 02737000
RPHSBIT7 EQU   RPHSBITS                                                 02738000
RPHSBIT6 EQU   RPHSBITS                                                 02739000
RPHSBIT5 EQU   RPHSBITS                                                 02740000
RPHSBIT4 EQU   RPHSBITS                                                 02741000
RPHSBIT3 EQU   RPHSBITS                                                 02742000
RPHSBIT2 EQU   RPHSBITS                                                 02743000
RPHSBIT1 EQU   RPHSBITS                                                 02744000
RPHSBYTE EQU   RPHSAVE1                                                 02745000
RPHPABQP EQU   RPHPABQA+1                                               02746000
RPHPABFG EQU   RPHPABQA                                                 02747000
RPHCRR   EQU   ISTRPH+32                                                02748000
RPHSRP34 EQU   RPHSRPRM+2                                               02749000
RPHSRP12 EQU   RPHSRPRM                                                 02750000
RPHWEGT  EQU   RPHCSPA                                                  02751000
RPHMAJCB EQU   ISTRPH+21                                                02752000
RPHPABOF EQU   ISTRPH+20                                                02753000
RPHRESUM EQU   RPHRESMA+1                                               02754000
RPHRSV01 EQU   RPHWPFLG                                                 02755000
RPHPURGE EQU   RPHWPFLG                                                 02756000
RPHPT    EQU   RPHWPFLG                                                 02757000
RPHWT    EQU   RPHWPFLG                                                 02758000
RPHRSKEY EQU   RPHWPFLG                                                 02759000
RPHDVTA  EQU   ISTRPH+12                                                02760000
RPHTIK   EQU   RPHTSKID+3                                               02761000
@NM00081 EQU   RPHTSKID                                                 02762000
RPHRPHAP EQU   RPHRPHA+1                                                02763000
@NM00080 EQU   RPHRPHA                                                  02764000
RPHGATE  EQU   RPHRPHA                                                  02765000
@NM00079 EQU   RPHFLGB                                                  02766000
RPHRLCRA EQU   RPHFLGB                                                  02767000
RPHNRSAV EQU   RPHFLGB                                                  02768000
RPHPGCMP EQU   RPHFLGB                                                  02769000
RPHFBAPS EQU   RPHFLGB                                                  02770000
RPHBSSP  EQU   RPHFLGB                                                  02771000
RPHLOCK  EQU   RPHFLGB                                                  02772000
RPHFNFLG EQU   RPHFSTLC                                                 02773000
RPHMLTCP EQU   RPHFLAGS                                                 02774000
RPHSMCLR EQU   RPHFLAGS                                                 02775000
RPHSMTYP EQU   RPHFLAGS                                                 02776000
RPHSMQ   EQU   RPHFLAGS                                                 02777000
RPHAUTEX EQU   RPHAPTYP                                                 02778000
RPHSPGIN EQU   RPHFLAGS                                                 02779000
RPHOGIND EQU   RPHFLAGS                                                 02780000
RPHLNGTH EQU   RPHCNTL+1                                                02781000
RPHTYPE  EQU   RPHCNTL                                                  02782000
DYPRSV01 EQU   ISTDYPAB+12                                              02783000
DYPTSKID EQU   ISTDYPAB+8                                               02784000
DYPCHAIN EQU   ISTDYPAB+4                                               02785000
DYPFLGS  EQU   ISTDYPAB+2                                               02786000
DYPLNGTH EQU   ISTDYPAB+1                                               02787000
DYPTYPE  EQU   ISTDYPAB                                                 02788000
LOKXCL   EQU   @NM00077                                                 02789000
LOKPRY   EQU   @NM00077                                                 02790000
@NM00078 EQU   @NM00077                                                 02791000
@NM00076 EQU   LOKCHNG                                                  02792000
LOKCT    EQU   ISTLOK                                                   02793000
PABRPHA  EQU   PABRPHFG+1                                               02794000
PABNODQ  EQU   PABFLAGS                                                 02795000
PABINHBT EQU   PABFLAGS                                                 02796000
PABERLOK EQU   PABERRLK                                                 02797000
PABSSN   EQU   PABFLAGS                                                 02798000
PABDYNAM EQU   PABFLAGS                                                 02799000
PABNORPR EQU   PABFLAGS                                                 02800000
PABPRIOR EQU   PABFLAGS                                                 02801000
PABAPYP  EQU   PABFLAGS                                                 02802000
PABDVTA  EQU   ISTPAB+9                                                 02803000
PABOFFST EQU   ISTPAB+8                                                 02804000
PABCHNGP EQU   PABCHAIN+1                                               02805000
PABRSV02 EQU   PABCHAIN                                                 02806000
PABDELAY EQU   PABCHAIN                                                 02807000
PABRUNNG EQU   PABCHAIN                                                 02808000
PABRESET EQU   PABCHAIN                                                 02809000
PABUNCON EQU   PABCHAIN                                                 02810000
PABCDP   EQU   PABCHAIN                                                 02811000
PABRESCH EQU   PABCHAIN                                                 02812000
PABCHNG  EQU   PABCHAIN                                                 02813000
PABWEQP  EQU   PABWEQA+1                                                02814000
PABRSV01 EQU   PABWEQA                                                  02815000
PABWEQG  EQU   PABWEQA                                                  02816000
ISTPDAVP EQU   ISTAVT+40                                                02817000
ISTAVR01 EQU   ISTAVT+38                                                02818000
ISTVTTP  EQU   ISTAVT+36                                                02819000
ISTAGTWT EQU   ISTAVT+34                                                02820000
ISTATRT  EQU   ISTAVT+32                                                02821000
ISTARID  EQU   ISTAVT+30                                                02822000
ISTX1    EQU   ISTAVT+29                                                02823000
ISTPHNM  EQU   ISTAVT+24                                                02824000
ISTAPSEX EQU   ISTAVT+20                                                02825000
ISTVTTIK EQU   ISTAVT+18                                                02826000
AVTASID  EQU   ISTAVT+16                                                02827000
ISTAPSTA EQU   ISTAVT+12                                                02828000
ISTAS53  EQU   ISTAVT+8                                                 02829000
ISTAHIP  EQU   ISTAS49                                                  02830000
ISTACVT  EQU   ISTAVT                                                   02831000
NIBRESV  EQU   ISTNIB+60                                                02832000
NIBEXLST EQU   ISTNIB+44                                                02833000
NIBLIMIT EQU   ISTNIB+42                                                02834000
@NM00075 EQU   ISTNIB+41                                                02835000
@NM00074 EQU   NIBFLG1                                                  02836000
@NM00073 EQU   NIBFLG1                                                  02837000
@NM00072 EQU   NIBFLG1                                                  02838000
@NM00071 EQU   NIBFLG1                                                  02839000
NIBSHLTP EQU   NIBFLG1                                                  02840000
NIBSDAPP EQU   NIBFLG1                                                  02841000
NIBCON   EQU   NIBFLG1                                                  02842000
NIBLAST  EQU   NIBFLG1                                                  02843000
NIBPROCD EQU   ISTNIB+36                                                02844000
NIBDEVCH EQU   ISTNIB+28                                                02845000
NIBSYM   EQU   ISTNIB+12                                                02846000
NIBCID   EQU   ISTNIB+4                                                 02847000
NIBLEN   EQU   ISTNIB+3                                                 02848000
NIBCONDN EQU   ISTNIB+2                                                 02849000
NIBRSV01 EQU   ISTNIB+1                                                 02850000
NIBID    EQU   ISTNIB                                                   02851000
DEVRSV03 EQU   ISTDEVCH+5                                               02852000
DEVPHYSA EQU   ISTDEVCH+4                                               02853000
DEVCSLPN EQU   DEVCHAR3                                                 02854000
DEVCSTCL EQU   DEVCHAR3                                                 02855000
DEVCCHEK EQU   DEVCHAR3                                                 02856000
DEVCATTN EQU   DEVCHAR3                                                 02857000
DEVCSWL  EQU   DEVFCCTL                                                 02858000
DEVCRVB  EQU   DEVFCCTL                                                 02859000
DEVCSSL  EQU   DEVFCCTL                                                 02860000
DEVCBSC  EQU   DEVFCCTL                                                 02861000
DEVMCODE EQU   ISTDEVCH+2                                               02862000
DEVCHAR2 EQU   DEVTCODE                                                 02863000
DEVRSV01 EQU   DEVCHAR                                                  02864000
DEVCCTL  EQU   DEVCHAR                                                  02865000
DEVNNSPT EQU   DEVCHAR                                                  02866000
DEVSPS   EQU   DEVCHAR                                                  02867000
DEVSUBND EQU   DEVCHAR                                                  02868000
DEVCONVR EQU   DEVCHAR                                                  02869000
DEVOTPUT EQU   DEVCHAR                                                  02870000
DEVINPUT EQU   DEVCHAR                                                  02871000
PROSRDEF EQU   PROSETM4                                                 02872000
PRORSV47 EQU   PROSETM4                                                 02873000
PROSCON  EQU   PROSETM4                                                 02874000
PRORSV46 EQU   PROSETM3                                                 02875000
PROSMONT EQU   PROSETM3                                                 02876000
PRORSV45 EQU   PROSETM3                                                 02877000
PROSNTO  EQU   PROSETM3                                                 02878000
PRORSV44 EQU   PROSETM3                                                 02879000
PRORSV43 EQU   PROSETM2                                                 02880000
PROSNTFL EQU   PROSETM2                                                 02881000
PRORSV42 EQU   PROSETM2                                                 02882000
PRORSV41 EQU   PROPROCS                                                 02883000
PROMODC  EQU   PROPROC4                                                 02884000
PROMODT  EQU   PROPROC4                                                 02885000
PROMODM  EQU   PROPROC4                                                 02886000
PROMODB  EQU   PROPROC4                                                 02887000
PRORSV14 EQU   PROPROC4                                                 02888000
PRORSV13 EQU   PROPROC4                                                 02889000
PRORSV12 EQU   PROPROC4                                                 02890000
PROEIB   EQU   PROPROC4                                                 02891000
PRORSV11 EQU   PROPROC3                                                 02892000
PROMONT2 EQU   PROPROC3                                                 02893000
PROMONIT EQU   PROPROC3                                                 02894000
PROSUBLK EQU   PROPROC3                                                 02895000
PRONTO   EQU   PROPROC3                                                 02896000
PROLGIN  EQU   PROPROC3                                                 02897000
PROERPI  EQU   PROPROC3                                                 02898000
PRORSV07 EQU   PROPROC3                                                 02899000
PROCFTX  EQU   PROPROC2                                                 02900000
PROEMLC  EQU   PROPROC2                                                 02901000
PRONTFL  EQU   PROPROC2                                                 02902000
PRORSV05 EQU   PROPROC2                                                 02903000
PRORSV04 EQU   PROPROC2                                                 02904000
PROLGOT  EQU   PROPROC2                                                 02905000
PROERPO  EQU   PROPROC2                                                 02906000
PRORSV03 EQU   PROPROC2                                                 02907000
PRORPLC  EQU   PROPROC1                                                 02908000
PROCS    EQU   PROPROC1                                                 02909000
PROCA    EQU   PROPROC1                                                 02910000
PRORESPX EQU   PROPROC1                                                 02911000
PRODFASY EQU   PROPROC1                                                 02912000
PROXPOPT EQU   PROPROC1                                                 02913000
PROTRUNC EQU   PROPROC1                                                 02914000
PROASYIP EQU   PROPROC1                                                 02915000
RPLSIGDA EQU   RPLVTEXT+32                                              02916000
RPLSAV13 EQU   RPLVTEXT+28                                              02917000
RPLUSNSO EQU   RPLOSENS+2                                               02918000
RPLSSMO  EQU   RPLSSNSO+1                                               02919000
@NM00107 EQU   RPLSSEO                                                  02920000
RPLRRO   EQU   RPLSSEO                                                  02921000
RPLFIO   EQU   RPLSSEO                                                  02922000
RPLSTATO EQU   RPLSSEO                                                  02923000
RPLCPMO  EQU   RPLSSEO                                                  02924000
@NM00106 EQU   RPLSSEO                                                  02925000
RPLFMHDR EQU   RPLOPT12                                                 02926000
@NM00105 EQU   RPLOPT12                                                 02927000
@NM00104 EQU   RPLOPT12                                                 02928000
@NM00103 EQU   RPLOPT12                                                 02929000
RPLNIBTK EQU   RPLOPT12                                                 02930000
RPLTRUNC EQU   RPLOPT12                                                 02931000
RPLKEEP  EQU   RPLOPT12                                                 02932000
@NM00102 EQU   RPLOPT12                                                 02933000
RPLRSVE8 EQU   RPLOPT11                                                 02934000
RPLRSVE7 EQU   RPLOPT11                                                 02935000
RPLRSVE6 EQU   RPLOPT11                                                 02936000
RPLRSVE5 EQU   RPLOPT11                                                 02937000
RPLRSVE4 EQU   RPLOPT11                                                 02938000
RPLSTOP  EQU   RPLOPT11                                                 02939000
RPLSTART EQU   RPLOPT11                                                 02940000
RPLQUIES EQU   RPLOPT11                                                 02941000
RPLRSVI6 EQU   RPLOPT10                                                 02942000
RPLRSVI5 EQU   RPLOPT10                                                 02943000
RPLRSVI4 EQU   RPLOPT10                                                 02944000
RPLRSVI3 EQU   RPLOPT10                                                 02945000
RPLRSVI2 EQU   RPLOPT10                                                 02946000
RPLSPARM EQU   RPLOPT10                                                 02947000
RPLDSPLY EQU   RPLOPT10                                                 02948000
RPLBSCID EQU   RPLOPT10                                                 02949000
RPLTOPL  EQU   RPLOPT9                                                  02950000
RPLCIDE  EQU   RPLOPT9                                                  02951000
RPLRNNM  EQU   RPLOPT9                                                  02952000
RPLAPPST EQU   RPLOPT9                                                  02953000
RPLCOUNT EQU   RPLOPT9                                                  02954000
RPLTERMS EQU   RPLOPT9                                                  02955000
RPLDEVCH EQU   RPLOPT9                                                  02956000
RPLLOGON EQU   RPLOPT9                                                  02957000
RPLUSFLD EQU   RPLVTEXT+16                                              02958000
RPLESR2  EQU   RPLUSNSI+1                                               02959000
RPLESR1  EQU   RPLUSNSI                                                 02960000
RPLSSMI  EQU   RPLDSB2                                                  02961000
@NM00101 EQU   RPLSSEI                                                  02962000
RPLRRI   EQU   RPLSSEI                                                  02963000
RPLFII   EQU   RPLSSEI                                                  02964000
RPLSTATI EQU   RPLSSEI                                                  02965000
RPLCPMI  EQU   RPLSSEI                                                  02966000
RPLPATHI EQU   RPLSSEI                                                  02967000
RPLARCLN EQU   RPLVTEXT+8                                               02968000
RPLAARLN EQU   RPLVTEXT+4                                               02969000
RPLAAREA EQU   RPLVTEXT                                                 02970000
RPLERMSA EQU   RPLCOMN+72                                               02971000
RPLEMLEN EQU   RPLCOMN+70                                               02972000
RPLACTIV EQU   RPLCOMN+69                                               02973000
RPLBRANC EQU   RPLEXTD1                                                 02974000
RPLNIB   EQU   RPLEXTD1                                                 02975000
@NM00100 EQU   RPLEXTD1                                                 02976000
RPLEXIT  EQU   RPLEXTD1                                                 02977000
RPLNEXIT EQU   RPLEXTD1                                                 02978000
RPLEXSCH EQU   RPLEXTD1                                                 02979000
RPLDDDD  EQU   RPLRBAR+4                                                02980000
@NM00099 EQU   RPLRBAR+3                                                02981000
@NM00098 EQU   RPLAIXID                                                 02982000
RPLAXPKP EQU   RPLAIXID                                                 02983000
RPLAIXPC EQU   RPLRBAR                                                  02984000
RPLRSV88 EQU   RPLOPT8                                                  02985000
RPLUNCON EQU   RPLOPT8                                                  02986000
RPLACTV  EQU   RPLOPT8                                                  02987000
RPLSESS  EQU   RPLOPT8                                                  02988000
RPLPEND  EQU   RPLOPT8                                                  02989000
RPLODPRM EQU   RPLOPT8                                                  02990000
RPLODACP EQU   RPLOPT8                                                  02991000
RPLODACQ EQU   RPLOPT8                                                  02992000
RPLRSV78 EQU   RPLOPT7                                                  02993000
RPLTCRNO EQU   RPLOPT7                                                  02994000
RPLRLSOP EQU   RPLOPT7                                                  02995000
RPLTPOST EQU   RPLOPT7                                                  02996000
RPLQOPT  EQU   RPLOPT7                                                  02997000
RPLCNIMM EQU   RPLCNOPT                                                 02998000
RPLCNANY EQU   RPLCNOPT                                                 02999000
RPLCNALL EQU   RPLCNOPT                                                 03000000
RPLRSV68 EQU   RPLOPT6                                                  03001000
RPLRSV67 EQU   RPLOPT6                                                  03002000
RPLLOCK  EQU   RPLOPT6                                                  03003000
RPLNCOND EQU   RPLOPT6                                                  03004000
RPLCOND  EQU   RPLOPT6                                                  03005000
RPLEOT   EQU   RPLUNTYP                                                 03006000
RPLEOM   EQU   RPLUNTYP                                                 03007000
RPLEOB   EQU   RPLUNTYP                                                 03008000
RPLWROPT EQU   RPLOPT5                                                  03009000
RPLNODE  EQU   RPLOPT5                                                  03010000
RPLERACE EQU   RPLWRTYP                                                 03011000
RPLEAU   EQU   RPLWRTYP                                                 03012000
RPLNERAS EQU   RPLWRTYP                                                 03013000
RPLPSOPT EQU   RPLOPT5                                                  03014000
@NM00097 EQU   RPLOPT5                                                  03015000
RPLDLGIN EQU   RPLOPT5                                                  03016000
RPLBUFL  EQU   RPLCOMN+52                                               03017000
RPLRLEN  EQU   RPLCOMN+48                                               03018000
RPLCHAIN EQU   RPLNXTRP                                                 03019000
RPLBOP   EQU   RPLOPT4                                                  03020000
@NM00096 EQU   RPLOPT4                                                  03021000
RPLMKFRM EQU   RPLOPT4                                                  03022000
RPLENDTR EQU   RPLOPT4                                                  03023000
RPLALIGN EQU   RPLOPT3                                                  03024000
RPLFMT   EQU   RPLOPT3                                                  03025000
RPLFLD   EQU   RPLOPT3                                                  03026000
RPLVFY   EQU   RPLOPT3                                                  03027000
RPLBLK   EQU   RPLOPT3                                                  03028000
RPLSFORM EQU   RPLOPT3                                                  03029000
RPLEODS  EQU   RPLOPT3                                                  03030000
RPLNSP   EQU   RPLOPT2                                                  03031000
RPLUPD   EQU   RPLOPT2                                                  03032000
@NM00095 EQU   RPLOPT2                                                  03033000
RPLLRD   EQU   RPLOPT2                                                  03034000
RPLBWD   EQU   RPLOPT2                                                  03035000
RPLCNV   EQU   RPLOPT2                                                  03036000
RPLADD   EQU   RPLADR                                                   03037000
RPLKEY   EQU   RPLOPT2                                                  03038000
RPLECBIN EQU   RPLECBSW                                                 03039000
RPLGEN   EQU   RPLOPT1                                                  03040000
RPLKGE   EQU   RPLOPT1                                                  03041000
RPLASY   EQU   RPLOPT1                                                  03042000
RPLSKP   EQU   RPLOPT1                                                  03043000
RPLSEQ   EQU   RPLOPT1                                                  03044000
RPLDIR   EQU   RPLOPT1                                                  03045000
RPLLOC   EQU   RPLOPT1                                                  03046000
RPLDAF   EQU   RPLARG+2                                                 03047000
RPLSAF   EQU   RPLARG                                                   03048000
RPLAREA  EQU   RPLCOMN+32                                               03049000
RPLTCBPT EQU   RPLCOMN+28                                               03050000
RPLDACB  EQU   RPLCOMN+24                                               03051000
RPLCCHAR EQU   RPLCOMN+20                                               03052000
RPLSTRID EQU   RPLCOMN+18                                               03053000
RPLKEYL  EQU   RPLKEYLE                                                 03054000
RPLRDSOH EQU   RPLFDB3                                                  03055000
RPLRLG   EQU   RPLFDB3                                                  03056000
RPLLGFRC EQU   RPLFDB3                                                  03057000
RPLREOT  EQU   RPLFDB3                                                  03058000
RPLREOM  EQU   RPLFDB3                                                  03059000
RPLREOB  EQU   RPLFDB3                                                  03060000
RPLSV32  EQU   RPLFDB3                                                  03061000
RPLUINPT EQU   RPLFDB3                                                  03062000
RPLSTSAV EQU   RPLFDB2                                                  03063000
RPLCUERR EQU   RPLFDB2                                                  03064000
RPLDLGFL EQU   RPLFDB2                                                  03065000
RPLIOERR EQU   RPLFDB2                                                  03066000
RPLDVUNS EQU   RPLFDB2                                                  03067000
RPLATND  EQU   RPLFDB2                                                  03068000
RPLRVID  EQU   RPLFDB2                                                  03069000
RPLERLK  EQU   RPLFDB2                                                  03070000
RPLERREG EQU   RPLRTNCD                                                 03071000
RPLSTAT  EQU   RPLFDBWD                                                 03072000
RPLPOST  EQU   RPLECB                                                   03073000
RPLWAIT  EQU   RPLECB                                                   03074000
RPLPLHPT EQU   RPLCOMN+4                                                03075000
RPLLEN2  EQU   RPLLEN                                                   03076000
RPLREQ   EQU   RPLIDWD+2                                                03077000
RPLSTYP  EQU   RPLIDWD+1                                                03078000
RPLID    EQU   RPLIDWD                                                  03079000
SVETC035 EQU   TOLTEPWA+3880                                            03080000
SVESC030 EQU   TOLTEPWA+3808                                            03081000
SVESC020 EQU   TOLTEPWA+3664                                            03082000
SVEIC002 EQU   TOLTEPWA+3520                                            03083000
SVECC014 EQU   TOLTEPWA+3376                                            03084000
SVESC120 EQU   TOLTEPWA+3304                                            03085000
SVESC025 EQU   TOLTEPWA+3088                                            03086000
@NM00070 EQU   TOLTEPWA+2980                                            03087000
@NM00069 EQU   TOLTEPWA+2976                                            03088000
$R13PR3  EQU   TOLTEPWA+2972                                            03089000
$CEINT2  EQU   TOLTEPWA+2968                                            03090000
$CEINT1  EQU   TOLTEPWA+2964                                            03091000
$MSGGET  EQU   TOLTEPWA+2960                                            03092000
$ACQLIST EQU   TOLTEPWA+2956                                            03093000
$R4SAVE1 EQU   TOLTEPWA+2952                                            03094000
$CLSISS  EQU   TOLTEPWA+2950                                            03095000
$CLSCNT  EQU   TOLTEPWA+2948                                            03096000
$CUTABLE EQU   TOLTEPWA+2868                                            03097000
$BUFSZ2  EQU   TOLTEPWA+2864                                            03098000
$RESID2  EQU   TOLTEPWA+2860                                            03099000
$OLTCCW2 EQU   TOLTEPWA+2856                                            03100000
$ENDBFR2 EQU   TOLTEPWA+2852                                            03101000
$1STBFR2 EQU   TOLTEPWA+2848                                            03102000
$TECB2   EQU   TOLTEPWA+2844                                            03103000
$BUFSZ1  EQU   TOLTEPWA+2840                                            03104000
$RESID1  EQU   TOLTEPWA+2836                                            03105000
$OLTCCW1 EQU   TOLTEPWA+2832                                            03106000
$ENDBFR1 EQU   TOLTEPWA+2828                                            03107000
$1STBFR1 EQU   TOLTEPWA+2824                                            03108000
$TECB1   EQU   TOLTEPWA+2820                                            03109000
$WAITIME EQU   TOLTEPWA+2816                                            03110000
$TRTN#   EQU   TOLTEPWA+2815                                            03111000
$WIODEV  EQU   TOLTEPWA+2814                                            03112000
$RQSTSZE EQU   TOLTEPWA+2812                                            03113000
$RQSTPTR EQU   TOLTEPWA+2808                                            03114000
$R4SAVE  EQU   TOLTEPWA+2804                                            03115000
$PARTADR EQU   TOLTEPWA+2800                                            03116000
$TBSDATA EQU   TOLTEPWA+2796                                            03117000
$CTWIDTH EQU   TOLTEPWA+2795                                            03118000
$CTLINE  EQU   TOLTEPWA+2794                                            03119000
$APWIDTH EQU   TOLTEPWA+2793                                            03120000
$APLINE  EQU   TOLTEPWA+2792                                            03121000
$INDEX   EQU   $IMITX                                                   03122000
$UMXX    EQU   @NM00068+14                                              03123000
$NSXX    EQU   @NM00068+12                                              03124000
$ATACNT  EQU   $NSCNT                                                   03125000
$CTR     EQU   @NM00068+8                                               03126000
$ATAPTR  EQU   $NSPTR                                                   03127000
$DDRPTR  EQU   @NM00068                                                 03128000
$DTORESP EQU   TOLTEPWA+2712                                            03129000
$APNAME  EQU   TOLTEPWA+2704                                            03130000
$24SYMNE EQU   $24CATMG+4                                               03131000
$24DEVAD EQU   $24CATMG                                                 03132000
$24RTN#  EQU   $24FEMSG+8                                               03133000
$ESECTID EQU   $24FEMSG                                                 03134000
$24FLGS  EQU   TOLTEPWA+2680                                            03135000
$24SAVE2 EQU   TOLTEPWA+2676                                            03136000
$24SAVE1 EQU   TOLTEPWA+2672                                            03137000
$24UNADR EQU   TOLTEPWA+2668                                            03138000
$24SAV13 EQU   TOLTEPWA+2664                                            03139000
$24RETCD EQU   TOLTEPWA+2663                                            03140000
$MACID   EQU   TOLTEPWA+2661                                            03141000
$CSPARE  EQU   $CFLGS                                                   03142000
$C2WAY   EQU   $CFLGS                                                   03143000
$CINCT   EQU   $CCOMDAT+12                                              03144000
$CINADR  EQU   $CCOMDAT+8                                               03145000
$COUTCT  EQU   $CCOMDAT+4                                               03146000
$COUTAD  EQU   $CCOMDAT                                                 03147000
ROOTLOC  EQU   TOLTEPWA+2640                                            03148000
$RETREG  EQU   TOLTEPWA+2636                                            03149000
$WORK    EQU   TOLTEPWA+2376                                            03150000
$BUFFER  EQU   TOLTEPWA+1976                                            03151000
@NM00067 EQU   $SLTBL+135                                               03152000
$HIGHRTN EQU   $SLTBL+134                                               03153000
$PRIMADR EQU   $SLTBL+130                                               03154000
$CTSTPT  EQU   $SLTBL+128                                               03155000
$TSTCNT  EQU   $SLTBL+126                                               03156000
$SECFLGS EQU   $SECLST+3                                                03157000
$SECTION EQU   $SECLST                                                  03158000
$SECACT  EQU   $TESTFLG                                                 03159000
$CANTRUN EQU   $TESTFLG                                                 03160000
$FINAL   EQU   $TESTFLG                                                 03161000
$TESTSUF EQU   $RUNTEST+5                                               03162000
$TESTNUM EQU   $RUNTEST+1                                               03163000
$LETPRF  EQU   $RUNTEST                                                 03164000
$SYMBOLC EQU   $SLTBL+5                                                 03165000
$FAMILY  EQU   $SLTBL                                                   03166000
$CDEVPT  EQU   TOLTEPWA+1466                                            03167000
$FEEDBCK EQU   $DEVTBLE+66                                              03168000
$WTISUED EQU   $DEVFLG4                                                 03169000
$EXIOISD EQU   $DEVFLG4                                                 03170000
$REMWRIT EQU   $DEVFLG4                                                 03171000
$REMDONE EQU   $DEVFLG4                                                 03172000
$2NDUSED EQU   $DEVFLG4                                                 03173000
$1STUSED EQU   $DEVFLG4                                                 03174000
$IGLXIFB EQU   $DEVFLG4                                                 03175000
$EXIOLV3 EQU   $DEVFLG4                                                 03176000
@NM00066 EQU   $DEVFLG5                                                 03177000
$ASCII   EQU   $DEVFLG5                                                 03178000
$DEVLU   EQU   $DEVFLG5                                                 03179000
$OPNDFAL EQU   $DEVFLG5                                                 03180000
$ACQNCB  EQU   $DEVFLG5                                                 03181000
$DVCOL   EQU   $LDNCBPT+2                                               03182000
$DVROW   EQU   $LDNCBPT                                                 03183000
$NCSPLP  EQU   $DEVTBLE+44                                              03184000
$DVLN    EQU   $SSCPDAF                                                 03185000
$DAF     EQU   $DEVSESP+4                                               03186000
$VARYPAB EQU   $DEVSESP                                                 03187000
@NM00065 EQU   $DEVFLG3                                                 03188000
$CLRSNT  EQU   $DEVFLG3                                                 03189000
$OLTERR  EQU   $DEVFLG3                                                 03190000
$SRTEST  EQU   $DEVFLG3                                                 03191000
$DVSNDOK EQU   $SIOFLG                                                  03192000
$POLLREQ EQU   $DEVFLG3                                                 03193000
$DVBRKST EQU   $OPND+1                                                  03194000
$DVBRKSN EQU   $OPND                                                    03195000
$CEINTRP EQU   $DEVFLG2                                                 03196000
$TESTMDE EQU   $DEVFLG2                                                 03197000
$DEVALOC EQU   $DEVFLG2                                                 03198000
$ALLDATA EQU   $DEVFLG2                                                 03199000
$ENDCNTL EQU   $DEVFLG2                                                 03200000
$CTLDEV  EQU   $DEVFLG2                                                 03201000
$NOCDS   EQU   $DEVFLG2                                                 03202000
$DATAIN  EQU   $DEVFLG2                                                 03203000
$PRIMARY EQU   $DEVFLG1                                                 03204000
$DVCTBYT EQU   $INTOCC                                                  03205000
$DEVACT  EQU   $DEVFLG1                                                 03206000
$DVLGMDE EQU   $ATTNEXP                                                 03207000
$DVSPRM  EQU   $EVNCPLT                                                 03208000
$GRABBED EQU   $DEVFLG1                                                 03209000
$CATASTR EQU   $DEVFLG1                                                 03210000
$LETGO   EQU   $DEVFLG1                                                 03211000
$CURELEM EQU   $$SYMNME+4                                               03212000
$MSGOTSD EQU   $$SYMNME                                                 03213000
$EXTDEV  EQU   $DEVCDS+11                                               03214000
@NM00064 EQU   $DEVSDCF                                                 03215000
$NOTPRIM EQU   $DEVSDCF                                                 03216000
@NM00063 EQU   $DEVCDSF                                                 03217000
@NM00062 EQU   $DEVCDSF                                                 03218000
@NM00061 EQU   $DEVCDSF                                                 03219000
$CDSNAME EQU   $DEVCDSF                                                 03220000
$EXTRN   EQU   $DEVCDSF                                                 03221000
$CEVOLUM EQU   $DEVCDSF                                                 03222000
$SHARD   EQU   $DEVCDSF                                                 03223000
$DEVFPM  EQU   $DEVCDSF                                                 03224000
$DEVCNT  EQU   $DEVCDS+8                                                03225000
$DEVTYPE EQU   $DEVFEAT+3                                               03226000
$DEVCLAS EQU   $DEVFEAT+2                                               03227000
$DEVFRRS EQU   $DEVFEAT+1                                               03228000
$DEVMOD  EQU   $DEVFEAT                                                 03229000
$DEVRDGT EQU   @NM00059+1                                               03230000
$DEVCTLU EQU   @NM00059+1                                               03231000
$DEVCHAN EQU   @NM00059                                                 03232000
@NM00060 EQU   @NM00059                                                 03233000
$CTINDX  EQU   $DEVUNAD                                                 03234000
$FLAG16  EQU   $COMMFLG+15                                              03235000
$FLAG15  EQU   $COMMFLG+14                                              03236000
$FLAG14  EQU   $COMMFLG+13                                              03237000
$CATMSG  EQU   $FLAG13                                                  03238000
$PRMPTSW EQU   $FLAG13                                                  03239000
$DEVENT  EQU   $FLAG13                                                  03240000
@NM00058 EQU   $FLAG12                                                  03241000
$VARYINP EQU   $FLAG12                                                  03242000
$VRYHRD  EQU   $FLAG12                                                  03243000
$VRYSFT  EQU   $FLAG12                                                  03244000
$OPTMSG  EQU   $FLAG12                                                  03245000
$FEORCAT EQU   $FLAG11                                                  03246000
@NM00057 EQU   $FLAG11                                                  03247000
@NM00056 EQU   $FLAG10                                                  03248000
$INBND   EQU   $FLAG10                                                  03249000
$DPRINT  EQU   $FLAG10                                                  03250000
$NOTRRCH EQU   $FLAG9                                                   03251000
@NM00055 EQU   $FLAG9                                                   03252000
$COPY    EQU   $FLAG9                                                   03253000
$LSTLNSW EQU   $FLAG9                                                   03254000
$MULLNSW EQU   $FLAG9                                                   03255000
$REMSW   EQU   $FLAG9                                                   03256000
$IGRES   EQU   $FLAG9                                                   03257000
$VS2     EQU   $FLAG8                                                   03258000
$VS1     EQU   $FLAG8                                                   03259000
$EDOS    EQU   $FLAG8                                                   03260000
@NM00054 EQU   $FLAG8                                                   03261000
$TWOWAY  EQU   $FLAG8                                                   03262000
@NM00053 EQU   $FLAG8                                                   03263000
$RCVMSG  EQU   $FLAG7                                                   03264000
$RCVRFLG EQU   $FLAG7                                                   03265000
$SNDRFLG EQU   $FLAG7                                                   03266000
$LDOIS   EQU   $FLAG7                                                   03267000
$DCONTCT EQU   $FLAG7                                                   03268000
$EXIOWAT EQU   $FLAG7                                                   03269000
$2NDDATA EQU   $FLAG7                                                   03270000
$1STDATA EQU   $FLAG7                                                   03271000
$FSTMCIS EQU   $FLAG6                                                   03272000
$DISCREQ EQU   $FLAG6                                                   03273000
$DISCISS EQU   $FLAG6                                                   03274000
$CHANGE  EQU   $FLAG6                                                   03275000
$RECAL11 EQU   $FLAG6                                                   03276000
@NM00052 EQU   $FLAG5                                                   03277000
$PROGCK  EQU   $CANCEL                                                  03278000
$PRINTAP EQU   $FLAG5                                                   03279000
@NM00051 EQU   $FLAG5                                                   03280000
$FSTCAT  EQU   $FLAG5                                                   03281000
$FSTFE   EQU   $FLAG5                                                   03282000
$ACQCUTT EQU   $FLAG4                                                   03283000
$BACKINT EQU   $FLAG4                                                   03284000
$DMSGSW  EQU   $FLAG4                                                   03285000
$TSTDEVP EQU   $FLAG4                                                   03286000
$APRQPER EQU   $FLAG4                                                   03287000
$NEWAP   EQU   $FLAG3                                                   03288000
$ALTPRTR EQU   $FLAG3                                                   03289000
$OPTERR  EQU   $FLAG3                                                   03290000
$PRTONLY EQU   $FLAG3                                                   03291000
$LOGOFFE EQU   $FLAG3                                                   03292000
$TSTERR  EQU   $FLAG3                                                   03293000
$DEVERR  EQU   $FLAG3                                                   03294000
$PARTIAL EQU   $FLAG2                                                   03295000
$NRMTERM EQU   $FLAG2                                                   03296000
$VALDTST EQU   $FLAG2                                                   03297000
$VALDDEV EQU   $FLAG2                                                   03298000
$DBLSLSH EQU   $FLAG2                                                   03299000
$NDR     EQU   $FLAG2                                                   03300000
@NM00050 EQU   $FLAG2                                                   03301000
$OLTACT  EQU   $FLAG1                                                   03302000
$NORELDV EQU   $FLAG1                                                   03303000
@NM00049 EQU   $FLAG1                                                   03304000
$OPTCHNG EQU   $FLAG1                                                   03305000
$DEVCHNG EQU   $FLAG1                                                   03306000
$TESTCNG EQU   $FLAG1                                                   03307000
$CNSLFG  EQU   $FLAG1                                                   03308000
@NM00048 EQU   $CDA+120                                                 03309000
@NM00047 EQU   $CDA+117                                                 03310000
$PRTFORM EQU   $CDA+116                                                 03311000
$OPISCNT EQU   $CDA+114                                                 03312000
$OPNDCNT EQU   $CDA+112                                                 03313000
$GRCNTS  EQU   $CDA+108                                                 03314000
$CTLCNT  EQU   $CDA+106                                                 03315000
$ACTLVL  EQU   $CDA+105                                                 03316000
$PRNTLVL EQU   $CDA+104                                                 03317000
$ERRCNTA EQU   $CDA+102                                                 03318000
$TIMEALW EQU   $CDA+96                                                  03319000
$PTRAREA EQU   $CDA+92                                                  03320000
$R13PTRT EQU   $CDA+84                                                  03321000
$R13PTR  EQU   $CDA+80                                                  03322000
$PLINKDL EQU   $CDA+72                                                  03323000
$FRELPTR EQU   $CDA+64                                                  03324000
$HIGHADR EQU   $HIMOREC                                                 03325000
$LOMOREC EQU   $CDA+56                                                  03326000
$LOWADDR EQU   $OLTPTR                                                  03327000
$COMMON  EQU   $RCA                                                     03328000
$SLASHAD EQU   $CDA+32                                                  03329000
$TBWDPTR EQU   $CDA+12                                                  03330000
$TFWDPTR EQU   $CDA+8                                                   03331000
@NM00046 EQU   $CDA                                                     03332000
@NM00045 EQU   $SCTTBLE+98                                              03333000
$SCTLWTC EQU   $SCTTBLE+96                                              03334000
$SCTLWTA EQU   $SCTTBLE+92                                              03335000
#MSGIDAC EQU   $SCTTBLE+78                                              03336000
@NM00044 EQU   $SCTTBLE+71                                              03337000
$RETMASK EQU   $SCTTBLE+70                                              03338000
$R249255 EQU   $ROUTMSK+29                                              03339000
$R241248 EQU   $ROUTMSK+28                                              03340000
$R233240 EQU   $ROUTMSK+27                                              03341000
$R225232 EQU   $ROUTMSK+26                                              03342000
$R217224 EQU   $ROUTMSK+25                                              03343000
$R209216 EQU   $ROUTMSK+24                                              03344000
$R201208 EQU   $ROUTMSK+23                                              03345000
$R193200 EQU   $ROUTMSK+22                                              03346000
$R185192 EQU   $ROUTMSK+21                                              03347000
$R177184 EQU   $ROUTMSK+20                                              03348000
$R169176 EQU   $ROUTMSK+19                                              03349000
$R161168 EQU   $ROUTMSK+18                                              03350000
$R153160 EQU   $ROUTMSK+17                                              03351000
$R145152 EQU   $ROUTMSK+16                                              03352000
$R137144 EQU   $ROUTMSK+15                                              03353000
$R129136 EQU   $ROUTMSK+14                                              03354000
$R121128 EQU   $ROUTMSK+13                                              03355000
$R113120 EQU   $ROUTMSK+12                                              03356000
$R105112 EQU   $ROUTMSK+11                                              03357000
$R097104 EQU   $ROUTMSK+10                                              03358000
$R089096 EQU   $ROUTMSK+9                                               03359000
$R081088 EQU   $ROUTMSK+8                                               03360000
$R073080 EQU   $ROUTMSK+7                                               03361000
$R065072 EQU   $ROUTMSK+6                                               03362000
$R057064 EQU   $ROUTMSK+5                                               03363000
$R049056 EQU   $ROUTMSK+4                                               03364000
$R041048 EQU   $ROUTMSK+3                                               03365000
$R033040 EQU   $ROUTMSK+2                                               03366000
$R025032 EQU   $ROUTMSK+1                                               03367000
$R017024 EQU   $ROUTMSK                                                 03368000
$TOTFLG2 EQU   $SCTTBLE+39                                              03369000
@NM00043 EQU   $TOTFLG1                                                 03370000
@NM00042 EQU   $TOTFLG1                                                 03371000
@NM00041 EQU   $TOTFLG1                                                 03372000
$CURELOD EQU   $TOTFLG1                                                 03373000
$CTEQTT  EQU   $TOTFLG1                                                 03374000
@NM00040 EQU   $TOTFLG1                                                 03375000
@NM00039 EQU   $TOTFLG1                                                 03376000
$LINESHR EQU   $TOTFLG1                                                 03377000
@NM00038 EQU   $OLTFLG2                                                 03378000
@NM00037 EQU   $OLTFLG2                                                 03379000
@NM00036 EQU   $OLTFLG2                                                 03380000
@NM00035 EQU   $OLTFLG2                                                 03381000
@NM00034 EQU   $OLTFLG2                                                 03382000
@NM00033 EQU   $OLTFLG2                                                 03383000
@NM00032 EQU   $OLTFLG2                                                 03384000
$TALK    EQU   $OLTFLG2                                                 03385000
$DYCOM   EQU   $OLTFLGS                                                 03386000
@NM00031 EQU   $OLTFLGS                                                 03387000
$TRACE   EQU   $OLTFLGS                                                 03388000
$CONTCB  EQU   $OLTFLGS                                                 03389000
$RETAIN  EQU   $OLTFLGS                                                 03390000
$CLEANRT EQU   $OLTFLGS                                                 03391000
$MANINTV EQU   $OLTFLGS                                                 03392000
$OLTSIZE EQU   $SCTTBLE+34                                              03393000
$QSCTMOD EQU   $EXECFLG                                                 03394000
$CTRLMOD EQU   $EXECFLG                                                 03395000
$CLEANUP EQU   $EXECFLG                                                 03396000
$LSTPDEV EQU   $EXECFLG                                                 03397000
$ERRCNT  EQU   $EXECFLG                                                 03398000
$RTNSLCT EQU   $EXECFLG                                                 03399000
$MULTDEV EQU   $EXECFLG                                                 03400000
@NM00030 EQU   $EXECFLG                                                 03401000
$RMSKCNT EQU   $SCTTBLE+32                                              03402000
$SYNAME  EQU   $CDS8T19+4                                               03403000
$EXTSIG  EQU   $CDS8T19+3                                               03404000
$CDFLGS  EQU   $CDS8T19+1                                               03405000
$CDSCNT  EQU   $CDS8T19                                                 03406000
$PDEVDSC EQU   $SCTTBLE+16                                              03407000
$PDEVADR EQU   $SCTTBLE+12                                              03408000
$COMMCN  EQU   $CDSFLGS                                                 03409000
$CUSTSYM EQU   $CDSFLGS                                                 03410000
$TWOCHSW EQU   $CDSFLGS                                                 03411000
$SYMNAME EQU   $CDSFLGS                                                 03412000
$EXTINTC EQU   $CDSFLGS                                                 03413000
$CEVOL   EQU   $CDSFLGS                                                 03414000
$SHARED  EQU   $CDSFLGS                                                 03415000
$FPM     EQU   $CDSFLGS                                                 03416000
$LASTSUB EQU   $PDEVFLG                                                 03417000
@NM00029 EQU   $PDEVFLG                                                 03418000
@NM00028 EQU   $PDEVFLG                                                 03419000
@NM00027 EQU   $PDEVFLG                                                 03420000
$LASTDEV EQU   $PDEVFLG                                                 03421000
@NM00026 EQU   $PDEVFLG                                                 03422000
$EXFILPT EQU   $PDEVFLG                                                 03423000
$FPMOLD  EQU   $PDEVFLG                                                 03424000
$TSSSYM  EQU   $SCTTBLE+8                                               03425000
$SCTLEVL EQU   $SCTTBLE+7                                               03426000
$RT0916  EQU   $SCTTBLE+5                                               03427000
$RT0108  EQU   $SCTTBLE+4                                               03428000
$LOOPTST EQU   $ERROPT                                                  03429000
$LOOPERR EQU   $ERROPT                                                  03430000
$NERRPRT EQU   $ERROPT                                                  03431000
$ALTPRNT EQU   $ERROPT                                                  03432000
$CATERR  EQU   $ERROPT                                                  03433000
$ASTERIK EQU   $ERROPT                                                  03434000
$TESTERR EQU   $ERROPT                                                  03435000
$INDEFLP EQU   $TESTOPT                                                 03436000
$PARAPRT EQU   $TESTOPT                                                 03437000
@NM00025 EQU   $TESTOPT                                                 03438000
$ERRLPCT EQU   $SCTTBLE                                                 03439000
$EXITSAV EQU   $RCAAREA+864                                             03440000
$TRASCII EQU   $RCAAREA+608                                             03441000
@NM00024 EQU   $RCAAREA+605                                             03442000
$VTAMEND EQU   $RCAFLG                                                  03443000
$TPPOSTD EQU   $RCAFLG                                                  03444000
$CONSOLE EQU   $RCAFLG                                                  03445000
$CTDVAR  EQU   $RCAAREA+596                                             03446000
@NM00023 EQU   $CONSTNT+4                                               03447000
@NM00022 EQU   $CONSTNT+2                                               03448000
$CTNAME  EQU   $POINTER+132                                             03449000
$CTARGX  EQU   $POINTER+128                                             03450000
$QUEHNDL EQU   $POINTER+116                                             03451000
@NM00021 EQU   $POINTER+36                                              03452000
$RTNPTR  EQU   $POINTER+32                                              03453000
$TLTECB2 EQU   $POINTER+28                                              03454000
$TLTECB1 EQU   $POINTER+24                                              03455000
$LSTAREA EQU   $POINTER+12                                              03456000
$TLTACB  EQU   $RCAAREA                                                 03457000
CVTLEVL  EQU   CVTRELNO+2                                               03458000
CVTNUMB  EQU   CVTRELNO                                                 03459000
CVTMDL   EQU   CVTFIX+250                                               03460000
@NM00020 EQU   CVTFIX+248                                               03461000
@NM00019 EQU   CVTFIX                                                   03462000
CVTRV482 EQU   CVTXTNT2+128                                             03463000
CVTRV481 EQU   CVTXTNT2+124                                             03464000
CVTRV480 EQU   CVTXTNT2+120                                             03465000
CVTRV479 EQU   CVTXTNT2+118                                             03466000
CVTRV478 EQU   CVTXTNT2+117                                             03467000
CVTRV477 EQU   CVTXTNT2+116                                             03468000
CVTRV476 EQU   CVTXTNT2+115                                             03469000
CVTRV475 EQU   CVTXTNT2+114                                             03470000
CVTRV474 EQU   CVTRV466                                                 03471000
CVTRV473 EQU   CVTRV466                                                 03472000
CVTRV472 EQU   CVTRV466                                                 03473000
CVTRV471 EQU   CVTRV466                                                 03474000
CVTRV470 EQU   CVTRV466                                                 03475000
CVTRV469 EQU   CVTRV466                                                 03476000
CVTRV468 EQU   CVTRV466                                                 03477000
CVTRV467 EQU   CVTRV466                                                 03478000
CVTRV465 EQU   CVTRV457                                                 03479000
CVTRV464 EQU   CVTRV457                                                 03480000
CVTRV463 EQU   CVTRV457                                                 03481000
CVTRV462 EQU   CVTRV457                                                 03482000
CVTRV461 EQU   CVTRV457                                                 03483000
CVTRV460 EQU   CVTRV457                                                 03484000
CVTRV459 EQU   CVTRV457                                                 03485000
CVTRV458 EQU   CVTRV457                                                 03486000
CVTRV456 EQU   CVTXTNT2+108                                             03487000
CVTRV455 EQU   CVTXTNT2+104                                             03488000
CVTRV454 EQU   CVTXTNT2+100                                             03489000
CVTRV453 EQU   CVTXTNT2+96                                              03490000
CVTRV452 EQU   CVTXTNT2+94                                              03491000
CVTRV451 EQU   CVTXTNT2+92                                              03492000
CVTRV450 EQU   CVTXTNT2+90                                              03493000
CVTRV449 EQU   CVTXTNT2+88                                              03494000
CVTRV448 EQU   CVTXTNT2+87                                              03495000
CVTRV447 EQU   CVTXTNT2+86                                              03496000
CVTRV446 EQU   CVTRV438                                                 03497000
CVTRV445 EQU   CVTRV438                                                 03498000
CVTRV444 EQU   CVTRV438                                                 03499000
CVTRV443 EQU   CVTRV438                                                 03500000
CVTRV442 EQU   CVTRV438                                                 03501000
CVTRV441 EQU   CVTRV438                                                 03502000
CVTRV440 EQU   CVTRV438                                                 03503000
CVTRV439 EQU   CVTRV438                                                 03504000
CVTRV437 EQU   CVTRV429                                                 03505000
CVTRV436 EQU   CVTRV429                                                 03506000
CVTRV435 EQU   CVTRV429                                                 03507000
CVTRV434 EQU   CVTRV429                                                 03508000
CVTRV433 EQU   CVTRV429                                                 03509000
CVTRV432 EQU   CVTRV429                                                 03510000
CVTRV431 EQU   CVTRV429                                                 03511000
CVTRV430 EQU   CVTRV429                                                 03512000
CVTRV428 EQU   CVTXTNT2+80                                              03513000
CVTRV427 EQU   CVTXTNT2+76                                              03514000
CVTRV426 EQU   CVTXTNT2+72                                              03515000
CVTRV425 EQU   CVTXTNT2+68                                              03516000
CVTATACT EQU   CVTATCVT                                                 03517000
CVTRV423 EQU   CVTXTNT2+62                                              03518000
CVTRV422 EQU   CVTXTNT2+60                                              03519000
CVTRV421 EQU   CVTXTNT2+58                                              03520000
CVTRV420 EQU   CVTXTNT2+56                                              03521000
CVTRV419 EQU   CVTXTNT2+55                                              03522000
CVTRV418 EQU   CVTXTNT2+54                                              03523000
CVTRV417 EQU   CVTRV409                                                 03524000
CVTRV416 EQU   CVTRV409                                                 03525000
CVTRV415 EQU   CVTRV409                                                 03526000
CVTRV414 EQU   CVTRV409                                                 03527000
CVTRV413 EQU   CVTRV409                                                 03528000
CVTRV412 EQU   CVTRV409                                                 03529000
CVTRV411 EQU   CVTRV409                                                 03530000
CVTRV410 EQU   CVTRV409                                                 03531000
CVTRV408 EQU   CVTRV400                                                 03532000
CVTRV407 EQU   CVTRV400                                                 03533000
CVTRV406 EQU   CVTRV400                                                 03534000
CVTRV405 EQU   CVTRV400                                                 03535000
CVTRV404 EQU   CVTRV400                                                 03536000
CVTRV403 EQU   CVTRV400                                                 03537000
CVTRV402 EQU   CVTRV400                                                 03538000
CVTRV401 EQU   CVTRV400                                                 03539000
CVTICB   EQU   CVTXTNT2+48                                              03540000
CVTSKTA  EQU   CVTXTNT2+44                                              03541000
CVTSHSB  EQU   CVTSHS                                                   03542000
CVTRSV98 EQU   CVTXTNT2+36                                              03543000
CVTRSV97 EQU   CVTXTNT2+34                                              03544000
CVTRSV96 EQU   CVTXTNT2+32                                              03545000
CVTOLTEP EQU   CVTXTNT2+28                                              03546000
CVTQIDA  EQU   CVTQID+1                                                 03547000
CVTRSV95 EQU   CVTQID                                                   03548000
CVTRSV94 EQU   CVTXTNT2+20                                              03549000
CVTRSV93 EQU   CVTXTNT2+16                                              03550000
CVTRSV92 EQU   CVTXTNT2+12                                              03551000
CVTDEBVR EQU   CVTXTNT2+8                                               03552000
CVTRSV91 EQU   CVTXTNT2+6                                               03553000
CVTRSV9H EQU   CVTFLGBT                                                 03554000
CVTRSV9G EQU   CVTFLGBT                                                 03555000
CVTRSV9F EQU   CVTFLGBT                                                 03556000
CVTRSV9E EQU   CVTFLGBT                                                 03557000
CVTRSV9D EQU   CVTFLGBT                                                 03558000
CVTRSV9C EQU   CVTFLGBT                                                 03559000
CVTVME   EQU   CVTFLGBT                                                 03560000
CVTNPE   EQU   CVTFLGBT                                                 03561000
CVTNUCLS EQU   CVTXTNT2+4                                               03562000
CVTDSSVA EQU   CVTDSSV+1                                                03563000
CVTRSV89 EQU   CVTDSSV                                                  03564000
CVTRSV88 EQU   CVTXTNT1+8                                               03565000
CVTRSV87 EQU   CVTXTNT1+4                                               03566000
CVTFACHN EQU   CVTXTNT1                                                 03567000
CVTRV488 EQU   CVTMAP+412                                               03568000
CVTRV487 EQU   CVTMAP+408                                               03569000
CVTRV486 EQU   CVTMAP+404                                               03570000
CVTRV485 EQU   CVTMAP+400                                               03571000
CVTACTAP EQU   CVTMAP+396                                               03572000
CVTAUTH  EQU   CVTMAP+392                                               03573000
CVTATMCA EQU   CVTATMCT+1                                               03574000
CVTATMST EQU   CVTATMCT                                                 03575000
CVTRSV61 EQU   CVTMAP+384                                               03576000
CVTVOLT1 EQU   CVTVOLM1+1                                               03577000
CVTVOLI1 EQU   CVTVOLF1                                                 03578000
CVTSTOA  EQU   CVTMAP+376                                               03579000
CVTRSV58 EQU   CVTMAP+374                                               03580000
CVTRSV57 EQU   CVTMAP+372                                               03581000
CVTDDCE  EQU   CVTMAP+368                                               03582000
CVTPNWFR EQU   CVTMAP+364                                               03583000
CVTSMF   EQU   CVTMAP+360                                               03584000
CVTSULK  EQU   CVTMAP+358                                               03585000
CVTSLKO  EQU   CVTSYSK                                                  03586000
CVTSLKP  EQU   CVTSYSK                                                  03587000
CVTSLKQ  EQU   CVTSYSK                                                  03588000
CVTSLKR  EQU   CVTSYSK                                                  03589000
CVTRSV56 EQU   CVTSYSK                                                  03590000
CVTRSV55 EQU   CVTSYSK                                                  03591000
CVTRSV54 EQU   CVTSYSK                                                  03592000
CVTRSV53 EQU   CVTSYSK                                                  03593000
CVTRSV52 EQU   CVTA1F1                                                  03594000
CVTRSV51 EQU   CVTA1F1                                                  03595000
CVTRSV50 EQU   CVTA1F1                                                  03596000
CVTRSV49 EQU   CVTA1F1                                                  03597000
CVTRSV48 EQU   CVTA1F1                                                  03598000
CVTRSV47 EQU   CVTA1F1                                                  03599000
CVTSRSW  EQU   CVTA1F1                                                  03600000
CVTPFSW  EQU   CVTA1F1                                                  03601000
CVTPCVT  EQU   CVTMAP+352                                               03602000
CVTRSV46 EQU   CVTMAP+344                                               03603000
CVTRSV45 EQU   CVTMAP+340                                               03604000
CVTRSV44 EQU   CVTMAP+338                                               03605000
CVTRSV43 EQU   CVTMAP+336                                               03606000
CVTHJESA EQU   CVTHJES+1                                                03607000
CVTRSV42 EQU   CVTHJES                                                  03608000
CVTEXT2A EQU   CVTEXT2+1                                                03609000
CVTRSV41 EQU   CVTEXT2                                                  03610000
CVTAPFA  EQU   CVTAPF+1                                                 03611000
CVTRSV40 EQU   CVTAPF                                                   03612000
CVTRV518 EQU   CVTINTLA                                                 03613000
CVTRV517 EQU   CVTERPV                                                  03614000
CVTEORM  EQU   CVTMAP+312                                               03615000
CVTMCHPR EQU   CVTMAP+308                                               03616000
CVTTZ    EQU   CVTMAP+304                                               03617000
CVTJEPS  EQU   CVTMAP+300                                               03618000
CVTJESCT EQU   CVTMAP+296                                               03619000
CVTMODE  EQU   CVTMAP+292                                               03620000
CVTPTRV  EQU   CVTMAP+288                                               03621000
CVTREAL  EQU   CVTMAP+284                                               03622000
CVTRSV39 EQU   CVTMAP+280                                               03623000
CVTRSV38 EQU   CVTMAP+276                                               03624000
CVTDMSRA EQU   CVTDMSR+1                                                03625000
CVTRV634 EQU   CVTDMSRF                                                 03626000
CVTRV633 EQU   CVTDMSRF                                                 03627000
CVTRV632 EQU   CVTDMSRF                                                 03628000
CVTRV631 EQU   CVTDMSRF                                                 03629000
CVTRV630 EQU   CVTDMSRF                                                 03630000
CVTRV629 EQU   CVTDMSRF                                                 03631000
CVTUDUMP EQU   CVTDMSRF                                                 03632000
CVTSDUMP EQU   CVTDMSRF                                                 03633000
CVTQMSGA EQU   CVTQMSG+1                                                03634000
CVTRSV36 EQU   CVTQMSG                                                  03635000
CVTAMFF  EQU   CVTMAP+264                                               03636000
CVTPURGA EQU   CVTPURG+1                                                03637000
CVTRSV35 EQU   CVTPURG                                                  03638000
CVTCBSP  EQU   CVTMAP+256                                               03639000
CVTATERA EQU   CVTATER+1                                                03640000
CVTSYST  EQU   CVTATER                                                  03641000
CVTVOLT2 EQU   CVTTAT                                                   03642000
CVTVOLI2 EQU   CVTVOLF2                                                 03643000
CVTAQAVB EQU   CVTAQAVT+1                                               03644000
CVTRSV34 EQU   CVTTCMFG                                                 03645000
CVTRSV33 EQU   CVTTCMFG                                                 03646000
CVTRSV32 EQU   CVTTCMFG                                                 03647000
CVTRSV31 EQU   CVTTCMFG                                                 03648000
CVTRSV30 EQU   CVTTCMFG                                                 03649000
CVTRSV29 EQU   CVTTCMFG                                                 03650000
CVTRSV28 EQU   CVTTCMFG                                                 03651000
CVTTCRDY EQU   CVTTCMFG                                                 03652000
CVTGTFA  EQU   CVTGTF+1                                                 03653000
CVTRSV27 EQU   CVTGTFST                                                 03654000
CVTRNIO  EQU   CVTGTFST                                                 03655000
CVTUSR   EQU   CVTGTFST                                                 03656000
CVTRV318 EQU   CVTFORM                                                  03657000
CVTRV317 EQU   CVTTMODE                                                 03658000
CVTRV316 EQU   CVTSTATE                                                 03659000
CVTRV315 EQU   CVTGTFS                                                  03660000
CVTGTFAV EQU   CVTGTFS                                                  03661000
CVT0SCR1 EQU   CVTMAP+232                                               03662000
CVTRV515 EQU   CVTMAP+228                                               03663000
CVTRMS   EQU   CVTMAP+224                                               03664000
CVTPATCH EQU   CVTMAP+220                                               03665000
CVTTSCE  EQU   CVTMAP+216                                               03666000
CVTLNKSC EQU   CVTMAP+214                                               03667000
CVTQABST EQU   CVTMAP+212                                               03668000
CVTMDLDS EQU   CVTMAP+208                                               03669000
CVTUSER  EQU   CVTMAP+204                                               03670000
CVTABEND EQU   CVTMAP+200                                               03671000
CVTSMCA  EQU   CVTMAP+196                                               03672000
CVTRSV18 EQU   CVTMAP+192                                               03673000
CVTQLPAQ EQU   CVTMAP+188                                               03674000
CVTQCDSR EQU   CVTMAP+184                                               03675000
CVTRSV17 EQU   CVTOPTB                                                  03676000
CVTRSV16 EQU   CVTOPTB                                                  03677000
CVTFP    EQU   CVTOPTB                                                  03678000
CVTAPTHR EQU   CVTOPTB                                                  03679000
CVTNLOG  EQU   CVTOPTB                                                  03680000
CVTTOD   EQU   CVTOPTB                                                  03681000
CVTCTIMS EQU   CVTOPTB                                                  03682000
CVTPROT  EQU   CVTOPTB                                                  03683000
CVTXPFP  EQU   CVTOPTA                                                  03684000
CVTASCII EQU   CVTOPTA                                                  03685000
CVTRSV13 EQU   CVTOPTA                                                  03686000
CVTRSV12 EQU   CVTOPTA                                                  03687000
CVTNIP   EQU   CVTOPTA                                                  03688000
CVTDDR   EQU   CVTOPTA                                                  03689000
CVTAPR   EQU   CVTOPTA                                                  03690000
CVTCCH   EQU   CVTOPTA                                                  03691000
CVTSNCTR EQU   CVTMAP+180                                               03692000
CVTQMWR  EQU   CVTMAP+176                                               03693000
CVTQOCR  EQU   CVTMAP+172                                               03694000
CVT1EF00 EQU   CVTMAP+168                                               03695000
CVTMZ00  EQU   CVTMAP+164                                               03696000
CVTHEAD  EQU   CVTMAP+160                                               03697000
CVTRSV11 EQU   CVTMAP+156                                               03698000
CVT0PT01 EQU   CVTMAP+152                                               03699000
CVTMSER  EQU   CVTMAP+148                                               03700000
CVTRV516 EQU   CVTIERLC                                                 03701000
CVTILCH  EQU   CVTMAP+140                                               03702000
CVT0DS   EQU   CVTMAP+136                                               03703000
CVTFBOSV EQU   CVTMAP+132                                               03704000
CVTNUCB  EQU   CVTMAP+128                                               03705000
CVTIXAVL EQU   CVTMAP+124                                               03706000
CVTIOQET EQU   CVTMAP+120                                               03707000
CVTDCBA  EQU   CVTMAP+117                                               03708000
CVTMVS2  EQU   CVTDCB                                                   03709000
CVT6DAT  EQU   CVTDCB                                                   03710000
CVT4MPS  EQU   CVTDCB                                                   03711000
CVTRSV09 EQU   CVTDCB                                                   03712000
CVT4MS1  EQU   CVTDCB                                                   03713000
CVT2SPS  EQU   CVTDCB                                                   03714000
CVT1SSS  EQU   CVTDCB                                                   03715000
CVTRSV08 EQU   CVTDCB                                                   03716000
CVTSTB   EQU   CVTMAP+112                                               03717000
CVTQTD00 EQU   CVTMAP+108                                               03718000
CVTQTE00 EQU   CVTMAP+104                                               03719000
CVTCUCB  EQU   CVTMAP+100                                               03720000
CVTSJQ   EQU   CVTMAP+96                                                03721000
CVTPBLDL EQU   CVTMAP+92                                                03722000
CVTTPC   EQU   CVTMAP+88                                                03723000
CVTSVDCB EQU   CVTMAP+84                                                03724000
CVTBRET  EQU   CVTMAP+82                                                03725000
CVTEXIT  EQU   CVTMAP+80                                                03726000
CVT0FN00 EQU   CVTMAP+76                                                03727000
CVTDARA  EQU   CVTDAR+1                                                 03728000
CVTRSV07 EQU   CVTFLGS1                                                 03729000
CVTRSV06 EQU   CVTFLGS1                                                 03730000
CVTRSV05 EQU   CVTFLGS1                                                 03731000
CVTRSV04 EQU   CVTFLGS1                                                 03732000
CVTRSV03 EQU   CVTFLGS1                                                 03733000
CVTRSV02 EQU   CVTFLGS1                                                 03734000
CVTRSV01 EQU   CVTFLGS1                                                 03735000
CVTDMPLK EQU   CVTFLGS1                                                 03736000
CVTXITP  EQU   CVTMAP+68                                                03737000
CVTZDTAB EQU   CVTMAP+64                                                03738000
CVTMSLT  EQU   CVTMAP+60                                                03739000
CVTDATE  EQU   CVTMAP+56                                                03740000
CVTBTERM EQU   CVTMAP+52                                                03741000
CVTSYSAD EQU   CVTMAP+48                                                03742000
CVTXTLER EQU   CVTMAP+44                                                03743000
CVTILK2  EQU   CVTMAP+40                                                03744000
CVTILK1  EQU   CVTMAP+36                                                03745000
CVTPRLTV EQU   CVTMAP+32                                                03746000
CVTPCNVT EQU   CVTMAP+28                                                03747000
CVT0VL00 EQU   CVTMAP+24                                                03748000
CVTXAPG  EQU   CVTMAP+20                                                03749000
CVTBUF   EQU   CVTMAP+16                                                03750000
CVTJOB   EQU   CVTMAP+12                                                03751000
CVTLINK  EQU   CVTMAP+8                                                 03752000
CVT0EF00 EQU   CVTMAP+4                                                 03753000
CVTTCBP  EQU   CVTMAP                                                   03754000
CVT      EQU   CVTMAP                                                   03755000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03756000
@RT00297 EQU   I01C0001                                                 03757000
@RT00350 EQU   I01C001B                                                 03758000
@RT00455 EQU   I01C0051                                                 03759000
@RT00569 EQU   I01C0061                                                 03760000
@ENDDATA EQU   *                                                        03761000
         END   ISTIC001,(C'PLS0856',0701,76244)                         03762000
