         TITLE 'ISTINCDP - 370X LOAD/DUMP/ERP SUBTASK CONTROL          *00001000
                        '                                               00002000
ISTINCDP CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTINCDP  75.230'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         ST    @13,@SA00001+4                                      0001 00014000
         LA    @14,@SA00001                                        0001 00015000
         ST    @14,8(,@13)                                         0001 00016000
         LR    @13,@14                                             0001 00017000
*                                                                  0227 00018000
*/*------------------------------------------------------------------*/ 00019000
*/* THIS IS MAIN PROCESSOR, IT WAITS FOR ECB. IF THE ECB IS POSTED,  */ 00020000
*/* IT DEQUEUES ALL OF THE WAITING CONTROL BLOCKS AND DROPS INTO A   */ 00021000
*/* LOOP THAT ROUTES THE CONTROL BLOCKS (NCSPL OR DLRPL) TO THE      */ 00022000
*/* PROPER PROCESSING MODULE.                                        */ 00023000
*/*------------------------------------------------------------------*/ 00024000
*                                                                  0228 00025000
*                                                                  0228 00026000
* DO; /* LISATCVT CVTBASE(FIXED,(AVTPTR)) */                       0228 00027000
*                                                                  0228 00028000
* RFY (EMCR15) RSTD;                                               0229 00029000
*   GEN SETS (EMCR15)                                              0230 00030000
*        (L     EMCR15,X'10' POINT TO CVT);                        0230 00031000
         L     EMCR15,X'10' POINT TO CVT                                00032000
*   AVTPTR = EMCR15->CVTEXT2->CVTATCVT; /*SET UP AVT POINTER*/     0231 00033000
*                                                                  0231 00034000
         L     @14,CVTEXT2(,EMCR15)                                0231 00035000
         L     @14,CVTATCVT(,@14)                                  0231 00036000
         ST    @14,AVTPTR                                          0231 00037000
* RFY (EMCR15) UNRSTD;                                             0232 00038000
* END; /*LISATCVT*/                                                0233 00039000
*ATCVTPTR = ISTACVT;                 /* SET BASE FOR ATCVT */      0234 00040000
         L     ATCVTPTR,ISTACVT(,@14)                              0234 00041000
*DO UNTIL(ATCNCSD = ON);             /* DO UNTIL N.C.S. IS QUIESCED */  00042000
@DL00235 DS    0H                                                  0236 00043000
*/*VWAIT  ECB(ATCLDECB)TASK(VTAM)*/                                0236 00044000
*   DO;                                                            0236 00045000
*                                                                  0236 00046000
*   DCL GPR01F FIXED(31) REG(01);                                  0237 00047000
*   DCL GPR01P PTR(31)   REG(01);        /*DECLARE AND RESTRICT REG 1*/ 00048000
*     RESPECIFY GPR01F RSTD;             /*INVOKE XREGSET MACRO TO*/    00049000
*                                        /*TEST ECB PARM VALIDITY */    00050000
*                                                                  0240 00051000
*/*XREGSET  PPARM(ATCLDECB)RREG(1,GPR01F)PID('ECB')*/              0240 00052000
*   DO;                                                            0240 00053000
*     GPR01F=ADDR(ATCLDECB);             /*SET RREG SYMBOL TO ADDRESS*/ 00054000
         LA    GPR01F,ATCLDECB(,ATCVTPTR)                          0241 00055000
*                                        /*OF PPARM OPERAND          */ 00056000
*   END;  /* XREGSET */                                            0242 00057000
*     GEN;                                                         0243 00058000
         WAIT 1,ECB=(1)                                                 00059000
*     RESPECIFY GPR01F UNRSTD;           /*UNRESTRICT REG 1          */ 00060000
*   END;  /* VWAIT */                                              0245 00061000
*                                                                  0245 00062000
*/* DOINF  */                                                      0246 00063000
*                                                                  0246 00064000
*   DO  UNTIL(1=2);                           /* DEQUE ALL NCSPL */     00065000
@DL00246 DS    0H                                                  0247 00066000
*    ATCLDECB = 0;                    /* CLEAR ECB */              0247 00067000
         SLR   @11,@11                                             0247 00068000
         ST    @11,ATCLDECB(,ATCVTPTR)                             0247 00069000
*    GEN REFS(CDPSAVE) (STM 0,15,CDPSAVE);                         0248 00070000
*                                                                  0248 00071000
         STM 0,15,CDPSAVE                                               00072000
*/* TPDEQ (,ATCLDNCS) RETPTR(CDPRCREG)NSTR */                      0249 00073000
*     DO; /* BEGIN TPDEQ CODE GENERATION */                        0249 00074000
*     DCL FMZCA014 BIT(32) CONSTANT('80000000'X);                  0250 00075000
*     DCL FMZCB014 BIT(32) CONSTANT('7FFFFFFF'X);                  0251 00076000
*     DCL GPR00F FIXED(31) REG(00);                                0252 00077000
*     DCL GPR00P PTR(31)   REG(00);                                0253 00078000
*     DCL GPR14F FIXED(31) REG(14);                                0254 00079000
*     DCL GPR14P PTR(31)   REG(14);                                0255 00080000
*     DCL GPR15F FIXED(31) REG(15);                                0256 00081000
*     DCL GPR15P PTR(31)   REG(15);                                0257 00082000
*     RFY (GPR00P,GPR01P,GPR14P,GPR15P) RSTD;                      0258 00083000
*                                                                  0258 00084000
*     RFY ISTWKE  ;                                                0259 00085000
*     GPR15P=ADDR(ATCLDNCS); /*ADDRESS QUEUE POINTER */            0260 00086000
         LA    GPR15P,ATCLDNCS(,ATCVTPTR)                          0260 00087000
*     GPR14P=GPR15P->PABWEQA|FMZCA014;                             0261 00088000
         L     @11,@CF00732                                        0261 00089000
         L     GPR14P,PABWEQA(,GPR15P)                             0261 00090000
         OR    GPR14P,@11                                          0261 00091000
*     IF GPR14P=FMZCA014 THEN;                                     0262 00092000
         CLR   GPR14P,@11                                          0262 00093000
         BE    @RT00262                                            0262 00094000
*     ELSE DO;                                                     0264 00095000
*FMZL1014:;                                                        0265 00096000
FMZL1014 DS    0H                                                  0266 00097000
*       DO WHILE(GPR14P->WKECHAIN^=FMZCA014);                      0266 00098000
         B     @DE00266                                            0266 00099000
@DL00266 DS    0H                                                  0267 00100000
*         GPR15P=ADDR(GPR14P->WKECHAIN);                           0267 00101000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0267 00102000
*         GPR14P=GPR15P->PABWEQA;                                  0268 00103000
         L     GPR14P,PABWEQA(,GPR15P)                             0268 00104000
*       END;                                                       0269 00105000
@DE00266 L     @11,@CF00732                                        0269 00106000
         CL    @11,WKECHAIN(,GPR14P)                               0269 00107000
         BNE   @DL00266                                            0269 00108000
*       GPR00P=FMZCA014;                                           0270 00109000
         LR    GPR00P,@11                                          0270 00110000
*       CS(GPR14P,GPR00P,GPR15P->PABWEQA);                         0271 00111000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0271 00112000
*       BC(7,FMZL1014);                                            0272 00113000
         BC    7,FMZL1014                                          0272 00114000
*       GPR14P->WKECHAIN=0;                                        0273 00115000
         SLR   @11,@11                                             0273 00116000
         ST    @11,WKECHAIN(,GPR14P)                               0273 00117000
*     END;                                                         0274 00118000
*ISTA0014:;                                                        0275 00119000
@RT00262 DS    0H                                                  0275 00120000
ISTA0014 DS    0H                                                  0276 00121000
*     GPR14P=GPR14P&FMZCB014;                                      0276 00122000
         N     GPR14P,@CF00730                                     0276 00123000
*     CDPRCREG=GPR14P;                                             0277 00124000
         LR    CDPRCREG,GPR14P                                     0277 00125000
*     RFY (GPR00P,GPR01P,GPR14P,GPR15P) UNRSTD;                    0278 00126000
*     END; /* END TPDEQ GENERATION */   /* DEQUE A NCSPL */        0279 00127000
*    GEN REFS(CDPSAV2) (LM 2,8,CDPSAV2);                           0280 00128000
*                                                                  0280 00129000
         LM 2,8,CDPSAV2                                                 00130000
*/*   LEAVE ON(CDPRCREG=0) */                                      0281 00131000
*     IF (CDPRCREG=0) THEN                                         0281 00132000
         LTR   CDPRCREG,CDPRCREG                                   0281 00133000
         BZ    @RT00281                                            0281 00134000
*       GOTO #DC00013;    /* EXIT LOOP IF QUEUE IS EMPTY */        0282 00135000
*    IF CDPRCREG->DLRPLIDF=DLRPLBID /*IF CB A DLRPL          @X50BHKG*/ 00136000
*     THEN                          /*                       @X50BHKG*/ 00137000
         CLI   DLRPLIDF(CDPRCREG),80                               0283 00138000
         BNE   @RF00283                                            0283 00139000
*       IF CDPRCREG->DLRPLFCD=DLRPLCPM /* IF CPMSG           @X50BHYJ*/ 00140000
*         THEN                      /*                       @X50BHYJ*/ 00141000
*                                                                  0284 00142000
         CLI   DLRPLFCD(CDPRCREG),189                              0284 00143000
         BNE   @RF00284                                            0284 00144000
*GEN(ATTACH EP=ISTINCOQ,SF=(E,CMZINCDP));      /*            YES   0285 00145000
*@X50BHYJ*/                                                        0285 00146000
         ATTACH EP=ISTINCOQ,SF=(E,CMZINCDP)                             00147000
*         ELSE                      /*                       @X50BHYJ*/ 00148000
*           CALL ISTINCR6;          /*            NO         @X50BHYJ*/ 00149000
         B     @RC00284                                            0286 00150000
@RF00284 L     @15,@CV01803                                        0286 00151000
         BALR  @14,@15                                             0286 00152000
*     ELSE                          /*                       @X50BHKG*/ 00153000
*      DO;                          /*DO NCSPL               @X50BHKG*/ 00154000
         B     @RC00283                                            0287 00155000
@RF00283 DS    0H                                                  0288 00156000
*        NCSPLPTR = CDPRCREG;         /* GET DEQUED NCSPL ADDR */  0288 00157000
         LR    NCSPLPTR,CDPRCREG                                   0288 00158000
*        IF NCSPLCMD = NCSCRVIO       /*IF VSAM I/O          @X50BHKG*/ 00159000
*         THEN                        /*                     @X50BHKG*/ 00160000
         CLC   NCSPLCMD(2,NCSPLPTR),@CB01425                       0289 00161000
         BNE   @RF00289                                            0289 00162000
*          CALL ISTINCR4;             /*                     @XM9198K*/ 00163000
         L     @15,@CV01804                                        0290 00164000
         BALR  @14,@15                                             0290 00165000
*         ELSE                        /*                     @X50BHKG*/ 00166000
*          IF NCSPLCMD=NCSDABDN       /*                     @D32CKKG*/ 00167000
*           THEN CALL ISTINCY0;                            /*@XM19498*/ 00168000
         B     @RC00289                                            0291 00169000
@RF00289 CLC   NCSPLCMD(2,NCSPLPTR),@CB01678                       0291 00170000
         BNE   @RF00291                                            0291 00171000
         L     @15,@CV01805                                        0292 00172000
         BALR  @14,@15                                             0292 00173000
*           ELSE IF ISTAHIP = ON     /* IS HALT IN PROCESS         */   00174000
*           THEN DO;                 /* YES, DO FOLLOWING:   @D32CKKG*/ 00175000
         B     @RC00291                                            0293 00176000
@RF00291 L     @11,AVTPTR                                          0293 00177000
         TM    ISTAHIP(@11),B'10000000'                            0293 00178000
         BNO   @RF00293                                            0293 00179000
*            NCSIORC = NCSHALTD;     /* SET RETURN CODE IN NCSP */ 0295 00180000
         MVI   NCSIORC(NCSPLPTR),X'18'                             0295 00181000
*            CDPR1 = NCSPLRPH;       /* GET RPH ADDR. FOR TPPOST */     00182000
         L     CDPR1,NCSPLRPH(,NCSPLPTR)                           0296 00183000
*            GEN REFS(CDPSAVE) (STM 0,15,CDPSAVE);                 0297 00184000
         STM 0,15,CDPSAVE                                               00185000
*/*TPPOST    NSTR*/                                                0298 00186000
*             DO;                                                  0298 00187000
*                                                                  0298 00188000
*             DCL GPR02F FIXED(31) REG(02);                        0299 00189000
*             DCL GPR02P PTR(31)   REG(02);                        0300 00190000
*             DCL GPR03F FIXED(31) REG(03);                        0301 00191000
*             DCL GPR03P PTR(31)   REG(03);                        0302 00192000
*             DCL GPR04F FIXED(31) REG(04);                        0303 00193000
*             DCL GPR04P PTR(31)   REG(04);                        0304 00194000
*             DCL GPR05F FIXED(31) REG(05);                        0305 00195000
*             DCL GPR05P PTR(31)   REG(05);                        0306 00196000
*             DCL GPR06F FIXED(31) REG(06);                        0307 00197000
*             DCL GPR06P PTR(31)   REG(06);                        0308 00198000
*                                       /*DECLARE AND RESTRICT REGS*/   00199000
*               RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,            0309 00200000
*                         GPR06F,GPR14F,GPR15F) RSTD;              0309 00201000
*                                       /*0,1,4,5,6,14, AND 15   */     00202000
*                                                                  0310 00203000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH,ISTAVT,ISTATCVT)  */           0310 00204000
*/* END OF ATBUILD */                                              0310 00205000
*               GPR04F=GPR01F;          /*LOAD RPH PNTR INTO REG 4*/    00206000
         LR    GPR04F,GPR01F                                       0310 00207000
*               RFY GPR03F RSTD;                                   0311 00208000
*               GPR03F=0;                                          0312 00209000
*                                                                  0312 00210000
         SLR   @11,@11                                             0312 00211000
         LR    GPR03F,@11                                          0312 00212000
*             DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GP 00213000
*05F)*/         RESPECIFY (GPR02F) RESTRICTED;                     0313 00214000
*               GPR05F = GPR02F; /*SAVE REGISTER 2*/               0315 00215000
         LR    GPR05F,GPR02F                                       0315 00216000
*               IPK; /*SAVE CURRENT PSW KEY*/                      0316 00217000
         IPK                                                       0316 00218000
*               GPR06F = GPR02F;                                   0317 00219000
         LR    GPR06F,GPR02F                                       0317 00220000
*               GPR02F = GPR05F; /*RESTORE REGISTER 2*/            0318 00221000
         LR    GPR02F,GPR05F                                       0318 00222000
*               SPKA (GPR03F); /*SET PSW KEY*/                     0319 00223000
         SPKA  0(GPR03F)                                           0319 00224000
*               RESPECIFY (GPR02F) UNRESTRICTED;                   0320 00225000
*             END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(G 00226000
*R05F)*/        RFY GPR03F UNRSTD;                                 0321 00227000
*               GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;          0323 00228000
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0323 00229000
         LA    GPR05P,0(,GPR05P)                                   0323 00230000
         SLR   @08,@08                                             0323 00231000
         IC    @08,RPHPABOF(,GPR04P)                               0323 00232000
         ALR   GPR05P,@08                                          0323 00233000
*                                       /*LOAD REG 5  WITH ADDR OF*/    00234000
*                                       /*MAJOR CONTROL BLOCK PLUS*/    00235000
*                                       /*OFFSET OF PAB IN BLOCK  */    00236000
*               GPR14P=0;               /*LOAD 0 INTO REG 14      */    00237000
         LR    GPR14P,@11                                          0324 00238000
*               GPR15P='FFFFFFFF'X;     /*LOAD REG 15 WITH DUMMY  */    00239000
         SLR   GPR15P,GPR15P                                       0325 00240000
         BCTR  GPR15P,0                                            0325 00241000
*                                       /*ADDRESS                 */    00242000
*               CS (GPR14P,GPR15P,GPR04P->RPHRESMA);               0326 00243000
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0326 00244000
*                                       /*COMPARE RESUME ADDRESS  */    00245000
*                                       /*WITH 0 AND,IF EQUAL, PUT*/    00246000
*                                       /*DUMMY ADDRESS IN CONTROL*/    00247000
*                                       /*BLOCK RESUME ADDRESS    */    00248000
*               BC (8,FMZT0020);        /*IF EQUAL, BYPASS REMAINDER*/  00249000
         BC    8,FMZT0020                                          0327 00250000
*                                       /*OF EXPANSION              */  00251000
*FMZL0020:      IF GPR04P->RPHWT='1'B THEN                         0328 00252000
FMZL0020 TM    RPHWT(GPR04P),B'00001000'                           0328 00253000
         BNO   @RF00328                                            0328 00254000
*                                       /*WT/EXT CONTENTION FLAG ON */  00255000
*               DO;                     /*IN RPH                    */  00256000
*                 GPR14P=GPR04P->RPHRESMA|RPHWT1;                  0330 00257000
         L     GPR14P,RPHRESMA(,GPR04P)                            0330 00258000
         O     GPR14P,@CF00756                                     0330 00259000
*                                       /*LOAD REG 14 WITH FLAG FIELD*/ 00260000
*                                       /*AND MAKE CERTAIN WT/EXT    */ 00261000
*                                       /*CONTENTION FLAG STILL ON   */ 00262000
*                 GPR15P=GPR14P|RPHPT1; /*LOAD REG 15 WITH FLAG FIELD*/ 00263000
         LR    GPR15P,GPR14P                                       0331 00264000
         O     GPR15P,@CF00746                                     0331 00265000
*                                       /*AND TURN POST FLAG ON      */ 00266000
*                 CS (GPR14P,GPR15P,GPR04P->RPHRESMA);             0332 00267000
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0332 00268000
*                                       /*COMPARE REG 14 WITH FLAG */   00269000
*                                       /*FIELD--IF WT/EXT BIT ON, */   00270000
*                                       /*TURN ON POST FLAG        */   00271000
*                 BC (4,FMZL0020);      /*IF WT/EXT BIT WAS OFF, LOOP*/ 00272000
         BC    4,FMZL0020                                          0333 00273000
*                                       /*TO TEST CONTENTION FLAG    */ 00274000
*                 BC (8,FMZT0020);      /*IF WT/EXT BIT WAS OFF,     */ 00275000
         BC    8,FMZT0020                                          0334 00276000
*                                       /*BRANCH TO BYPASS CODE GEN  */ 00277000
*               END;                    /*IF POST FLAG IS ON, FALL*/    00278000
*                                       /*THRU BOTTOM OF LOOP     */    00279000
*               ELSE;                   /*WT/EXT CONTENTION FLAG OFF*/  00280000
@RF00328 DS    0H                                                  0337 00281000
*               GPR00F=0;               /*SET REG 0 TO INDICATE ENA*/   00282000
*                                                                  0337 00283000
         SLR   GPR00F,GPR00F                                       0337 00284000
*             DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */        0338 00285000
*               GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/        0339 00286000
         L     GPR15P,ATCLCPTR                                     0339 00287000
*             END; /*LISATCVT*/         /*PUT POINTER TO ATCVT IN */    00288000
*                                       /*  IN REG 15             */    00289000
*               CALL GPR15P->ATCAP32;   /* CALL ISTAPC32: TPSCHED */    00290000
         L     @11,ATCAP32(,GPR15P)                                0341 00291000
         LR    @15,@11                                             0341 00292000
         BALR  @14,@15                                             0341 00293000
*FMZT0020:                                                         0342 00294000
*             DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/     0342 00295000
FMZT0020 DS    0H                                                  0343 00296000
*               GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/    0343 00297000
         LR    GPR05F,GPR06F                                       0343 00298000
*               SPKA (GPR05F); /*SET PSW KEY*/                     0344 00299000
         SPKA  0(GPR05F)                                           0344 00300000
*             END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/    0345 00301000
*               RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,     0346 00302000
*               GPR14F,GPR15F) UNRSTD;  /*UNRESTRICT REGS 0,1,    */    00303000
*                                       /*4,5,14, AND 15          */    00304000
*             END;  /****END OF TPPOST GENERATION****/           /* TP  00305000
* POST */                                                          0347 00306000
*            GEN REFS(CDPSAV2) (LM 2,8,CDPSAV2);                   0348 00307000
         LM 2,8,CDPSAV2                                                 00308000
*           END;                                          /*@D32CKKG*/  00309000
*                                                                  0349 00310000
*/*------------------------------------------------------------------*/ 00311000
*/* THIS SECTION DETERMINES IF IT IS ERP, LOAD, DUMP, OR A DIAL      */ 00312000
*/* COMMAND TO BE                                            @D32CKGH*/ 00313000
*/* PERFORMED AND PASSES CONTROL TO ISTINCRP, ISTINC05,      @D32CKGH*/ 00314000
*/* ISTINCXI, OR ISTINCY0 ACCORDINGLY                        @D32CKGH*/ 00315000
*/*------------------------------------------------------------------*/ 00316000
*                                                                  0350 00317000
*         ELSE                                                     0350 00318000
*IF NCSPLVCD = NCSPLVC3              /* ERP ? */                   0350 00319000
*  THEN                                                            0350 00320000
         B     @RC00293                                            0350 00321000
@RF00293 CLI   NCSPLVCD(NCSPLPTR),X'03'                            0350 00322000
         BNE   @RF00350                                            0350 00323000
*GEN(ATTACH EP=ISTINCRP,SF=(E,CMZINCDP));           /* YES, INVOKE ISTI 00324000
*CRP */                                                            0351 00325000
         ATTACH EP=ISTINCRP,SF=(E,CMZINCDP)                             00326000
*  ELSE                              /* NOT ERP, DO FOLLOWS */     0352 00327000
*    IF NCSPLCMD=NCSCLCND |          /* CONDITIONAL LOAD OR */     0352 00328000
*       NCSPLCMD=NCSCUCND            /* UNCONDITIONAL LOAD ? */    0352 00329000
*      THEN                                                        0352 00330000
         B     @RC00350                                            0352 00331000
@RF00350 CLC   NCSPLCMD(2,NCSPLPTR),@CB01664                       0352 00332000
         BE    @RT00352                                            0352 00333000
         CLC   NCSPLCMD(2,NCSPLPTR),@CB01666                       0352 00334000
         BNE   @RF00352                                            0352 00335000
@RT00352 DS    0H                                                  0353 00336000
*GEN(ATTACH EP=ISTINC05,SF=(E,CMZINCDP));       /* YES, LOAD ISTINC05 * 00337000
         ATTACH EP=ISTINC05,SF=(E,CMZINCDP)                             00338000
*      ELSE                          /* SEE IF DUMP */             0354 00339000
*        IF NCSPLCMD=NCSDUCMD                                      0354 00340000
*          THEN                                                    0354 00341000
         B     @RC00352                                            0354 00342000
@RF00352 CLC   NCSPLCMD(2,NCSPLPTR),@CB01670                       0354 00343000
         BNE   @RF00354                                            0354 00344000
*GEN(ATTACH EP=ISTINCXI,SF=(E,CMZINCDP));   /* YES, IT IS DUMP */  0355 00345000
         ATTACH EP=ISTINCXI,SF=(E,CMZINCDP)                             00346000
*          ELSE                                                    0356 00347000
*            IF NCSPLCMD=NCSDOUT            /* DIAL OUT      @D32CKGH*/ 00348000
*             | NCSPLCMD=NCSDCNT            /* DIAL CONTACT  @D32CKGH*/ 00349000
*             | NCSPLCMD=NCSDENAS      /* DIAL ENABLE ANSWER @D32CKKG*/ 00350000
*          THEN CALL ISTINCY0;              /* YES           @XM19498*/ 00351000
         B     @RC00354                                            0356 00352000
@RF00354 CLC   NCSPLCMD(2,NCSPLPTR),@CB01674                       0356 00353000
         BE    @RT00356                                            0356 00354000
         CLC   NCSPLCMD(2,NCSPLPTR),@CB01676                       0356 00355000
         BE    @RT00356                                            0356 00356000
         CLC   NCSPLCMD(2,NCSPLPTR),@CB01680                       0356 00357000
         BNE   @RF00356                                            0356 00358000
@RT00356 DS    0H                                                  0357 00359000
         L     @15,@CV01805                                        0357 00360000
         BALR  @14,@15                                             0357 00361000
*          ELSE DO;                  /* ERROR CONDITION */         0358 00362000
         B     @RC00356                                            0358 00363000
@RF00356 DS    0H                                                  0359 00364000
*            NCSIORC=NCSUNREC;       /* SET UP ERROR CODE IN NCSPL */   00365000
         MVI   NCSIORC(NCSPLPTR),X'1C'                             0359 00366000
*            CDPR1 = NCSPLRPH;       /* GET RPH ADDR FOR TPOST */  0360 00367000
         L     CDPR1,NCSPLRPH(,NCSPLPTR)                           0360 00368000
*            GEN REFS(CDPSAVE) (STM 0,15,CDPSAVE);                 0361 00369000
*                                                                  0361 00370000
         STM 0,15,CDPSAVE                                               00371000
*/*TPPOST    NSTR*/                                                0362 00372000
*             DO;                                                  0362 00373000
*                                       /*DECLARE AND RESTRICT REGS*/   00374000
*               RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,            0363 00375000
*                         GPR06F,GPR14F,GPR15F) RSTD;              0363 00376000
*                                       /*0,1,4,5,6,14, AND 15   */     00377000
*                                                                  0364 00378000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH,ISTAVT,ISTATCVT)  */           0364 00379000
*/* END OF ATBUILD */                                              0364 00380000
*               GPR04F=GPR01F;          /*LOAD RPH PNTR INTO REG 4*/    00381000
         LR    GPR04F,GPR01F                                       0364 00382000
*               RFY GPR03F RSTD;                                   0365 00383000
*               GPR03F=0;                                          0366 00384000
*                                                                  0366 00385000
         SLR   @11,@11                                             0366 00386000
         LR    GPR03F,@11                                          0366 00387000
*             DO; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(GP 00388000
*05F)*/         RESPECIFY (GPR02F) RESTRICTED;                     0367 00389000
*               GPR05F = GPR02F; /*SAVE REGISTER 2*/               0369 00390000
         LR    GPR05F,GPR02F                                       0369 00391000
*               IPK; /*SAVE CURRENT PSW KEY*/                      0370 00392000
         IPK                                                       0370 00393000
*               GPR06F = GPR02F;                                   0371 00394000
         LR    GPR06F,GPR02F                                       0371 00395000
*               GPR02F = GPR05F; /*RESTORE REGISTER 2*/            0372 00396000
         LR    GPR02F,GPR05F                                       0372 00397000
*               SPKA (GPR03F); /*SET PSW KEY*/                     0373 00398000
         SPKA  0(GPR03F)                                           0373 00399000
*               RESPECIFY (GPR02F) UNRESTRICTED;                   0374 00400000
*             END; /*MODESET  SAVEKEY(GPR06F) KEYADDR(GPR03F) WORKREG(G 00401000
*R05F)*/        RFY GPR03F UNRSTD;                                 0375 00402000
*               GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;          0377 00403000
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0377 00404000
         LA    GPR05P,0(,GPR05P)                                   0377 00405000
         SLR   @08,@08                                             0377 00406000
         IC    @08,RPHPABOF(,GPR04P)                               0377 00407000
         ALR   GPR05P,@08                                          0377 00408000
*                                       /*LOAD REG 5  WITH ADDR OF*/    00409000
*                                       /*MAJOR CONTROL BLOCK PLUS*/    00410000
*                                       /*OFFSET OF PAB IN BLOCK  */    00411000
*               GPR14P=0;               /*LOAD 0 INTO REG 14      */    00412000
         LR    GPR14P,@11                                          0378 00413000
*               GPR15P='FFFFFFFF'X;     /*LOAD REG 15 WITH DUMMY  */    00414000
         SLR   GPR15P,GPR15P                                       0379 00415000
         BCTR  GPR15P,0                                            0379 00416000
*                                       /*ADDRESS                 */    00417000
*               CS (GPR14P,GPR15P,GPR04P->RPHRESMA);               0380 00418000
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0380 00419000
*                                       /*COMPARE RESUME ADDRESS  */    00420000
*                                       /*WITH 0 AND,IF EQUAL, PUT*/    00421000
*                                       /*DUMMY ADDRESS IN CONTROL*/    00422000
*                                       /*BLOCK RESUME ADDRESS    */    00423000
*               BC (8,FMZT0035);        /*IF EQUAL, BYPASS REMAINDER*/  00424000
         BC    8,FMZT0035                                          0381 00425000
*                                       /*OF EXPANSION              */  00426000
*FMZL0035:      IF GPR04P->RPHWT='1'B THEN                         0382 00427000
FMZL0035 TM    RPHWT(GPR04P),B'00001000'                           0382 00428000
         BNO   @RF00382                                            0382 00429000
*                                       /*WT/EXT CONTENTION FLAG ON */  00430000
*               DO;                     /*IN RPH                    */  00431000
*                 GPR14P=GPR04P->RPHRESMA|RPHWT1;                  0384 00432000
         L     GPR14P,RPHRESMA(,GPR04P)                            0384 00433000
         O     GPR14P,@CF00756                                     0384 00434000
*                                       /*LOAD REG 14 WITH FLAG FIELD*/ 00435000
*                                       /*AND MAKE CERTAIN WT/EXT    */ 00436000
*                                       /*CONTENTION FLAG STILL ON   */ 00437000
*                 GPR15P=GPR14P|RPHPT1; /*LOAD REG 15 WITH FLAG FIELD*/ 00438000
         LR    GPR15P,GPR14P                                       0385 00439000
         O     GPR15P,@CF00746                                     0385 00440000
*                                       /*AND TURN POST FLAG ON      */ 00441000
*                 CS (GPR14P,GPR15P,GPR04P->RPHRESMA);             0386 00442000
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0386 00443000
*                                       /*COMPARE REG 14 WITH FLAG */   00444000
*                                       /*FIELD--IF WT/EXT BIT ON, */   00445000
*                                       /*TURN ON POST FLAG        */   00446000
*                 BC (4,FMZL0035);      /*IF WT/EXT BIT WAS OFF, LOOP*/ 00447000
         BC    4,FMZL0035                                          0387 00448000
*                                       /*TO TEST CONTENTION FLAG    */ 00449000
*                 BC (8,FMZT0035);      /*IF WT/EXT BIT WAS OFF,     */ 00450000
         BC    8,FMZT0035                                          0388 00451000
*                                       /*BRANCH TO BYPASS CODE GEN  */ 00452000
*               END;                    /*IF POST FLAG IS ON, FALL*/    00453000
*                                       /*THRU BOTTOM OF LOOP     */    00454000
*               ELSE;                   /*WT/EXT CONTENTION FLAG OFF*/  00455000
@RF00382 DS    0H                                                  0391 00456000
*               GPR00F=0;               /*SET REG 0 TO INDICATE ENA*/   00457000
*                                                                  0391 00458000
         SLR   GPR00F,GPR00F                                       0391 00459000
*             DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */        0392 00460000
*               GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/        0393 00461000
         L     GPR15P,ATCLCPTR                                     0393 00462000
*             END; /*LISATCVT*/         /*PUT POINTER TO ATCVT IN */    00463000
*                                       /*  IN REG 15             */    00464000
*               CALL GPR15P->ATCAP32;   /* CALL ISTAPC32: TPSCHED */    00465000
         L     @11,ATCAP32(,GPR15P)                                0395 00466000
         LR    @15,@11                                             0395 00467000
         BALR  @14,@15                                             0395 00468000
*FMZT0035:                                                         0396 00469000
*             DO; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/     0396 00470000
FMZT0035 DS    0H                                                  0397 00471000
*               GPR05F = GPR06F; /*GET KEY FORM SAVE LOCATION*/    0397 00472000
         LR    GPR05F,GPR06F                                       0397 00473000
*               SPKA (GPR05F); /*SET PSW KEY*/                     0398 00474000
         SPKA  0(GPR05F)                                           0398 00475000
*             END; /*MODESET  KEYADDR(GPR06F) WORKREG(GPR05F)*/    0399 00476000
*               RESPECIFY (GPR00F,GPR01F,GPR04F,GPR05F,GPR06F,     0400 00477000
*               GPR14F,GPR15F) UNRSTD;  /*UNRESTRICT REGS 0,1,    */    00478000
*                                       /*4,5,14, AND 15          */    00479000
*             END;  /****END OF TPPOST GENERATION****/           /* TPP 00480000
*ST */                                                             0401 00481000
*            GEN REFS(CDPSAV2) (LM 2,8,CDPSAV2);                   0402 00482000
         LM 2,8,CDPSAV2                                                 00483000
*            END;                                                  0403 00484000
*      END;                           /*END PROCESS NCSPL    @X50BHKG*/ 00485000
*                                                                  0404 00486000
@RC00356 DS    0H                                                  0404 00487000
@RC00354 DS    0H                                                  0404 00488000
@RC00352 DS    0H                                                  0404 00489000
@RC00350 DS    0H                                                  0404 00490000
@RC00293 DS    0H                                                  0404 00491000
@RC00291 DS    0H                                                  0404 00492000
@RC00289 DS    0H                                                  0405 00493000
*   END; /* END  */                                                0405 00494000
@RC00283 DS    0H                                                  0405 00495000
@DE00246 B     @DL00246                                            0405 00496000
*#DC00013:;                                                        0406 00497000
#DC00013 DS    0H                                                  0407 00498000
*END;                                                              0407 00499000
*                                                                  0407 00500000
@DE00235 TM    ATCNCSD(ATCVTPTR),B'00010000'                       0407 00501000
         BNO   @DL00235                                            0407 00502000
*/* TPEPILOG   */                                                  0408 00503000
* GEN (PRINT OFF);                                                 0408 00504000
*                                                                  0408 00505000
         PRINT OFF                                                      00506000
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0409 00507000
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0409 00508000
*        2  * CHAR(4),                 /* SPACE                       * 00509000
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               * 00510000
*           3 WKEFLAGS BIT(8),         /* FLAGS                       * 00511000
*             4 WKEGATE  BIT(1),       /* GATE BIT                    * 00512000
*             4 *        BIT(7),       /* RESERVED                    * 00513000
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 * 00514000
*                                                                  0410 00515000
* DECLARE                                                          0410 00516000
*   EMCR0 PTR REG(0),                                              0410 00517000
*   EMCR1 PTR REG(1),                                              0410 00518000
*   EMCR2 PTR REG(2),                                              0410 00519000
*   EMCR3 PTR REG(3),                                              0410 00520000
*   EMCR4 PTR REG(4),                                              0410 00521000
*   EMCR5 PTR REG(5),                                              0410 00522000
*   EMCR6 PTR REG(6),                                              0410 00523000
*   EMCR7 PTR REG(7),                                              0410 00524000
*   EMCR8 PTR REG(8),                                              0410 00525000
*   EMCR9 PTR REG(9),                                              0410 00526000
*   EMCR10 PTR REG(10),                                            0410 00527000
*   EMCR11 PTR REG(11),                                            0410 00528000
*   EMCR12 PTR REG(12),                                            0410 00529000
*   EMCR13 PTR REG(13),                                            0410 00530000
*   EMCR14 PTR REG(14),                                            0410 00531000
*   EMCR15 PTR REG(15);                                            0410 00532000
*                                                                  0410 00533000
*GEN DATA;                                                         0411 00534000
* GEN (PRINT ON);                                                  0412 00535000
         PRINT ON                                                       00536000
*/* END OF TPEPILOG */                                             0413 00537000
*END ISTINCDP                                                      0413 00538000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00539000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00540000
*;                                                                 0413 00541000
@EL00001 L     @13,4(,@13)                                         0413 00542000
@EF00001 DS    0H                                                  0413 00543000
@ER00001 LM    @14,@12,12(@13)                                     0413 00544000
         BR    @14                                                 0413 00545000
@DATA    DS    0H                                                       00546000
         DS    0F                                                       00547000
@SA00001 DS    18F                                                      00548000
         DS    0F                                                       00549000
@CF00730 DC    XL4'7FFFFFFF'                                            00550000
@CF00732 DC    XL4'80000000'                                            00551000
@CF00746 DC    XL4'04000000'                                            00552000
@CF00756 DC    XL4'08000000'                                            00553000
@CV01803 DC    V(ISTINCR6)                                              00554000
@CV01804 DC    V(ISTINCR4)                                              00555000
@CV01805 DC    V(ISTINCY0)                                              00556000
         DS    0D                                                       00557000
CVTPTR   DS    A                                                        00558000
AVTPTR   DS    A                                                        00559000
WKEPTR   DS    A                                                        00560000
@CB01425 DC    X'0C00'                                                  00561000
@CB01664 DC    X'0041'                                                  00562000
@CB01666 DC    X'0042'                                                  00563000
@CB01670 DC    X'0044'                                                  00564000
@CB01674 DC    X'0046'                                                  00565000
@CB01676 DC    X'0047'                                                  00566000
@CB01678 DC    X'0048'                                                  00567000
@CB01680 DC    X'0049'                                                  00568000
CDPSAVE  DS    CL64                                                     00569000
         ORG   CDPSAVE                                                  00570000
@NM00021 DS    CL8                                                      00571000
CDPSAV2  DS    AL4                                                      00572000
         ORG   CDPSAVE+64                                               00573000
ISTINCDP CSECT                                                          00574000
CMZINCDP ATTACH SM=SUPV,SF=L                                            00575000
ISTINCDP CSECT                                                          00576000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00577000
@01      EQU   01                                                       00578000
@02      EQU   02                                                       00579000
@03      EQU   03                                                       00580000
@04      EQU   04                                                       00581000
@05      EQU   05                                                       00582000
@06      EQU   06                                                       00583000
@07      EQU   07                                                       00584000
@08      EQU   08                                                       00585000
@09      EQU   09                                                       00586000
@10      EQU   10                                                       00587000
@11      EQU   11                                                       00588000
@12      EQU   12                                                       00589000
@13      EQU   13                                                       00590000
@14      EQU   14                                                       00591000
@15      EQU   15                                                       00592000
RPHPTR   EQU   @01                                                      00593000
NCSPLPTR EQU   @09                                                      00594000
ATCVTPTR EQU   @10                                                      00595000
CDPRCREG EQU   @01                                                      00596000
CDPR1    EQU   @01                                                      00597000
EMCR15   EQU   @15                                                      00598000
GPR01F   EQU   @01                                                      00599000
GPR01P   EQU   @01                                                      00600000
GPR00F   EQU   @00                                                      00601000
GPR00P   EQU   @00                                                      00602000
GPR14F   EQU   @14                                                      00603000
GPR14P   EQU   @14                                                      00604000
GPR15F   EQU   @15                                                      00605000
GPR15P   EQU   @15                                                      00606000
GPR02F   EQU   @02                                                      00607000
GPR03F   EQU   @03                                                      00608000
GPR04F   EQU   @04                                                      00609000
GPR04P   EQU   @04                                                      00610000
GPR05F   EQU   @05                                                      00611000
GPR05P   EQU   @05                                                      00612000
GPR06F   EQU   @06                                                      00613000
EMCR0    EQU   @00                                                      00614000
EMCR1    EQU   @01                                                      00615000
EMCR10   EQU   @10                                                      00616000
EMCR11   EQU   @11                                                      00617000
EMCR12   EQU   @12                                                      00618000
EMCR13   EQU   @13                                                      00619000
EMCR14   EQU   @14                                                      00620000
EMCR2    EQU   @02                                                      00621000
EMCR3    EQU   @03                                                      00622000
EMCR4    EQU   @04                                                      00623000
EMCR5    EQU   @05                                                      00624000
EMCR6    EQU   @06                                                      00625000
EMCR7    EQU   @07                                                      00626000
EMCR8    EQU   @08                                                      00627000
EMCR9    EQU   @09                                                      00628000
GPR02P   EQU   @02                                                      00629000
GPR03P   EQU   @03                                                      00630000
GPR06P   EQU   @06                                                      00631000
ATCLCPTR EQU   1032                                                     00632000
CVTMAP   EQU   0                                                        00633000
CVTDAR   EQU   CVTMAP+72                                                00634000
CVTFLGS1 EQU   CVTDAR                                                   00635000
CVTDCB   EQU   CVTMAP+116                                               00636000
CVTIERLC EQU   CVTMAP+144                                               00637000
CVTOPTA  EQU   CVTMAP+182                                               00638000
CVTOPTB  EQU   CVTMAP+183                                               00639000
CVTGTF   EQU   CVTMAP+236                                               00640000
CVTGTFST EQU   CVTGTF                                                   00641000
CVTGTFS  EQU   CVTGTFST                                                 00642000
CVTSTATE EQU   CVTGTFST                                                 00643000
CVTTMODE EQU   CVTGTFST                                                 00644000
CVTFORM  EQU   CVTGTFST                                                 00645000
CVTAQAVT EQU   CVTMAP+240                                               00646000
CVTTCMFG EQU   CVTAQAVT                                                 00647000
CVTVOLM2 EQU   CVTMAP+244                                               00648000
CVTTATA  EQU   CVTVOLM2                                                 00649000
CVTTSKS  EQU   CVTTATA                                                  00650000
CVTVOLF2 EQU   CVTTSKS                                                  00651000
CVTTAT   EQU   CVTTATA+1                                                00652000
CVTATER  EQU   CVTMAP+248                                               00653000
CVTEXT1  EQU   CVTMAP+252                                               00654000
CVTPURG  EQU   CVTMAP+260                                               00655000
CVTQMSG  EQU   CVTMAP+268                                               00656000
CVTDMSR  EQU   CVTMAP+272                                               00657000
CVTERPV  EQU   CVTMAP+316                                               00658000
CVTINTLA EQU   CVTMAP+320                                               00659000
CVTAPF   EQU   CVTMAP+324                                               00660000
CVTEXT2  EQU   CVTMAP+328                                               00661000
CVTHJES  EQU   CVTMAP+332                                               00662000
CVTPGSIA EQU   CVTMAP+348                                               00663000
CVTA1F1  EQU   CVTMAP+356                                               00664000
CVTSYSK  EQU   CVTMAP+357                                               00665000
CVTVOLM1 EQU   CVTMAP+380                                               00666000
CVTVOLF1 EQU   CVTVOLM1                                                 00667000
CVTATMCT EQU   CVTMAP+388                                               00668000
CVTXTNT1 EQU   0                                                        00669000
CVTXTNT2 EQU   0                                                        00670000
CVTDSSV  EQU   CVTXTNT2                                                 00671000
CVTFLGBT EQU   CVTXTNT2+5                                               00672000
CVTQID   EQU   CVTXTNT2+24                                              00673000
CVTSHS   EQU   CVTXTNT2+40                                              00674000
CVTRV400 EQU   CVTXTNT2+52                                              00675000
CVTRV409 EQU   CVTXTNT2+53                                              00676000
CVTATCVT EQU   CVTXTNT2+64                                              00677000
CVTRV429 EQU   CVTXTNT2+84                                              00678000
CVTRV438 EQU   CVTXTNT2+85                                              00679000
CVTRV457 EQU   CVTXTNT2+112                                             00680000
CVTRV466 EQU   CVTXTNT2+113                                             00681000
CVTFIX   EQU   0                                                        00682000
CVTRELNO EQU   CVTFIX+252                                               00683000
ISTAVT   EQU   0                                                        00684000
ISTACVT  EQU   ISTAVT                                                   00685000
ISTAS49  EQU   ISTAVT+4                                                 00686000
ISTAHIP  EQU   ISTAS49                                                  00687000
ISTPAB   EQU   0                                                        00688000
PABWQCHN EQU   ISTPAB                                                   00689000
PABWEQA  EQU   PABWQCHN                                                 00690000
PABCHAIN EQU   PABWQCHN+4                                               00691000
PABRPHFG EQU   ISTPAB+12                                                00692000
PABFLAGS EQU   PABRPHFG                                                 00693000
PABERLCK EQU   PABFLAGS                                                 00694000
PABERRLK EQU   PABERLCK                                                 00695000
ISTLOK   EQU   0                                                        00696000
LOKCHN   EQU   ISTLOK+1                                                 00697000
LOKCHNG  EQU   LOKCHN                                                   00698000
@NM00004 EQU   LOKCHNG+2                                                00699000
ISTDYPAB EQU   0                                                        00700000
ISTRPH   EQU   0                                                        00701000
RPHCNTL  EQU   ISTRPH                                                   00702000
RPHFLAGS EQU   RPHCNTL+2                                                00703000
RPHAPTYP EQU   RPHFLAGS                                                 00704000
RPHFSTLC EQU   RPHFLAGS                                                 00705000
RPHFLGB  EQU   RPHCNTL+3                                                00706000
RPHRPHA  EQU   ISTRPH+4                                                 00707000
RPHTSKID EQU   ISTRPH+8                                                 00708000
RPHRESMA EQU   ISTRPH+16                                                00709000
RPHWPFLG EQU   RPHRESMA                                                 00710000
RPHWT    EQU   RPHWPFLG                                                 00711000
RPHPABOF EQU   ISTRPH+20                                                00712000
RPHMAJCB EQU   ISTRPH+21                                                00713000
RPHWEA   EQU   ISTRPH+24                                                00714000
RPHCSPA  EQU   RPHWEA                                                   00715000
RPHSRPRM EQU   ISTRPH+28                                                00716000
RPHPABQA EQU   ISTRPH+36                                                00717000
RPHWORK  EQU   ISTRPH+40                                                00718000
RPHSAVE1 EQU   RPHWORK                                                  00719000
RPHSBITS EQU   RPHSAVE1+1                                               00720000
ISTATCVT EQU   0                                                        00721000
ATCCOM   EQU   ISTATCVT                                                 00722000
ATCSTAT  EQU   ATCCOM                                                   00723000
ATCSTAT1 EQU   ATCSTAT                                                  00724000
ATCSTFLG EQU   ATCSTAT+1                                                00725000
ATCPOFLG EQU   ATCSTAT+2                                                00726000
ATCSTAT4 EQU   ATCSTAT+3                                                00727000
ATCNCSD  EQU   ATCSTAT4                                                 00728000
ATCIOTRC EQU   ATCCOM+140                                               00729000
ATCTHTRC EQU   ATCIOTRC                                                 00730000
ATCCSMR  EQU   ISTATCVT+296                                             00731000
ATCSHRFG EQU   ISTATCVT+316                                             00732000
ATCHPGM  EQU   ISTATCVT+384                                             00733000
ATCLDNCS EQU   ISTATCVT+404                                             00734000
ATCLDECB EQU   ISTATCVT+408                                             00735000
ATCVLCNT EQU   ISTATCVT+772                                             00736000
ATCRNO   EQU   ISTATCVT+788                                             00737000
ATCSOPD  EQU   ISTATCVT+792                                             00738000
ATCSIPD  EQU   ISTATCVT+800                                             00739000
ATCSECST EQU   ISTATCVT+812                                             00740000
ATCAOSM  EQU   ISTATCVT+912                                             00741000
ATCGSRBQ EQU   ATCAOSM+4                                                00742000
ATCGSRBG EQU   ATCGSRBQ                                                 00743000
ATCAP32  EQU   ATCAOSM+28                                               00744000
ATCICAPP EQU   ATCAOSM+100                                              00745000
ATCLDAPP EQU   ATCAOSM+120                                              00746000
ATCDAPVT EQU   ATCAOSM+140                                              00747000
ATCVTFLG EQU   ATCAOSM+392                                              00748000
ATCZFLAG EQU   ATCAOSM+588                                              00749000
ISTPOHD  EQU   0                                                        00750000
POHSTAT  EQU   ISTPOHD+1                                                00751000
ISTPFX   EQU   0                                                        00752000
PFXID    EQU   ISTPFX                                                   00753000
ISTNCSPL EQU   0                                                        00754000
@NM00014 EQU   ISTNCSPL                                                 00755000
NCSPFX   EQU   @NM00014                                                 00756000
NCSPLVCD EQU   ISTNCSPL+17                                              00757000
NCSPLVBF EQU   ISTNCSPL+18                                              00758000
NCSPLVFL EQU   ISTNCSPL+20                                              00759000
NCSPLVF1 EQU   ISTNCSPL+21                                              00760000
NCSIORC  EQU   ISTNCSPL+23                                              00761000
NCSPLCMD EQU   ISTNCSPL+60                                              00762000
NCSCMDA  EQU   NCSPLCMD                                                 00763000
NCSCRFLG EQU   ISTNCSPL+67                                              00764000
NCSPLRAD EQU   ISTNCSPL+144                                             00765000
NCSIOCID EQU   ISTNCSPL+148                                             00766000
NCSPLCID EQU   NCSIOCID                                                 00767000
NCSPLRPH EQU   ISTNCSPL+160                                             00768000
NCSPLFSB EQU   ISTNCSPL+168                                             00769000
NCSPLFL1 EQU   ISTNCSPL+176                                             00770000
NCSPLFL2 EQU   ISTNCSPL+177                                             00771000
NCSPLFL3 EQU   ISTNCSPL+178                                             00772000
NCSPLFL4 EQU   ISTNCSPL+179                                             00773000
NCSPLFL5 EQU   ISTNCSPL+181                                             00774000
NCSPLAPP EQU   ISTNCSPL+216                                             00775000
NCSSENSE EQU   ISTNCSPL+244                                             00776000
NCSCRMSK EQU   ISTNCSPL+268                                             00777000
NCSCHKPT EQU   NCSCRMSK                                                 00778000
NCSCRMOD EQU   NCSCRMSK+2                                               00779000
NCSPLSID EQU   ISTNCSPL+271                                             00780000
NCSPLSTA EQU   NCSPLSID                                                 00781000
NCSPLPHD EQU   NCSPLSID+1                                               00782000
NCSAPP   EQU   0                                                        00783000
NCSAPBUE EQU   NCSAPP+88                                                00784000
NCSUSSRU EQU   0                                                        00785000
ISTTPMPL EQU   0                                                        00786000
ISTDLRPL EQU   0                                                        00787000
DLRPLRSA EQU   ISTDLRPL                                                 00788000
DLRPLIDF EQU   DLRPLRSA                                                 00789000
DLRPLFCD EQU   DLRPLRSA+2                                               00790000
DLRPLIST EQU   ISTDLRPL+80                                              00791000
ISTWKE   EQU   0                                                        00792000
WKECHAIN EQU   ISTWKE+4                                                 00793000
WKEFLAGS EQU   WKECHAIN                                                 00794000
CVTS01   EQU   CVTPGSIA                                                 00795000
CVTLPDIA EQU   CVTS01+12                                                00796000
CVTDIRST EQU   CVTLPDIA                                                 00797000
CVTSLIDA EQU   CVTS01+24                                                00798000
CVTCTLFG EQU   CVTS01+50                                                00799000
CVTRV210 EQU   CVTS01+424                                               00800000
CVTRV219 EQU   CVTS01+425                                               00801000
CVTRV228 EQU   CVTS01+426                                               00802000
CVTRV237 EQU   CVTS01+427                                               00803000
CVTMFRTR EQU   CVTS01+452                                               00804000
CVTRV262 EQU   CVTS01+468                                               00805000
CVTRV271 EQU   CVTS01+469                                               00806000
CVTRV280 EQU   CVTS01+470                                               00807000
CVTRV289 EQU   CVTS01+471                                               00808000
CVTGSDA  EQU   CVTS01+600                                               00809000
DLRPLCOQ EQU   DLRPLIST                                                 00810000
DLRPLOPT EQU   DLRPLCOQ                                                 00811000
DLRPLCR6 EQU   DLRPLIST                                                 00812000
@NM00020 EQU   DLRPLCR6+8                                               00813000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00814000
DLRPLTPL EQU   DLRPLCR6+44                                              00815000
DLRPLMSG EQU   DLRPLCR6+24                                              00816000
DLRPLSA2 EQU   DLRPLCR6+20                                              00817000
DLRPLSA1 EQU   DLRPLCR6+16                                              00818000
DLRPLMID EQU   DLRPLCR6+12                                              00819000
DLRPLSWS EQU   @NM00020+1                                               00820000
DLRPLFNC EQU   @NM00020                                                 00821000
DLRPLNOD EQU   DLRPLCR6+4                                               00822000
DLRPLCON EQU   DLRPLCR6                                                 00823000
DLRPLTPM EQU   DLRPLCOQ+4                                               00824000
DLRPLGYN EQU   DLRPLOPT                                                 00825000
DLRPLFOL EQU   DLRPLOPT                                                 00826000
CVTRV628 EQU   CVTS01+728                                               00827000
CVTRV627 EQU   CVTS01+724                                               00828000
CVTRV626 EQU   CVTS01+720                                               00829000
CVTRV625 EQU   CVTS01+716                                               00830000
CVTRV624 EQU   CVTS01+712                                               00831000
CVTRV623 EQU   CVTS01+708                                               00832000
CVTRV622 EQU   CVTS01+704                                               00833000
CVTRV621 EQU   CVTS01+700                                               00834000
CVTRV620 EQU   CVTS01+696                                               00835000
CVTRV619 EQU   CVTS01+692                                               00836000
CVTRV618 EQU   CVTS01+688                                               00837000
CVTRV617 EQU   CVTS01+684                                               00838000
CVTRV616 EQU   CVTS01+680                                               00839000
CVTRV615 EQU   CVTS01+676                                               00840000
CVTRV614 EQU   CVTS01+672                                               00841000
CVTRV613 EQU   CVTS01+668                                               00842000
CVTTCASP EQU   CVTS01+664                                               00843000
CVT0PT03 EQU   CVTS01+660                                               00844000
CVT0PT0E EQU   CVTS01+656                                               00845000
CVTIRM   EQU   CVTS01+652                                               00846000
CVTCGK   EQU   CVTS01+648                                               00847000
CVTRV607 EQU   CVTS01+644                                               00848000
CVTRV606 EQU   CVTS01+640                                               00849000
CVTRV605 EQU   CVTS01+636                                               00850000
CVTRV604 EQU   CVTS01+632                                               00851000
CVTEFF02 EQU   CVTS01+628                                               00852000
CVTCBBR  EQU   CVTS01+624                                               00853000
CVTSSCR  EQU   CVTS01+620                                               00854000
CVTEVENT EQU   CVTS01+616                                               00855000
CVTCRCA  EQU   CVTS01+612                                               00856000
CVTTPIO  EQU   CVTS01+608                                               00857000
CVTADV   EQU   CVTS01+604                                               00858000
CVTGSDAB EQU   CVTGSDA                                                  00859000
CVTQV3   EQU   CVTS01+596                                               00860000
CVTQV2   EQU   CVTS01+592                                               00861000
CVTQV1   EQU   CVTS01+588                                               00862000
CVTRPT   EQU   CVTS01+584                                               00863000
CVTSSRB  EQU   CVTS01+580                                               00864000
CVTCSDRL EQU   CVTS01+576                                               00865000
CVTEXP1  EQU   CVTS01+572                                               00866000
CVTRMPMT EQU   CVTS01+568                                               00867000
CVTRMPTT EQU   CVTS01+564                                               00868000
CVTVPSA  EQU   CVTS01+560                                               00869000
CVTVSTOP EQU   CVTS01+556                                               00870000
CVTGTFR8 EQU   CVTS01+552                                               00871000
CVTQUIT  EQU   CVTS01+548                                               00872000
CVTVACR  EQU   CVTS01+544                                               00873000
CVTWTCB  EQU   CVTS01+540                                               00874000
CVTSTPRS EQU   CVTS01+536                                               00875000
CVT0PT02 EQU   CVTS01+532                                               00876000
CVTDARCM EQU   CVTS01+528                                               00877000
CVTIRECM EQU   CVTS01+524                                               00878000
CVTJRECM EQU   CVTS01+520                                               00879000
CVTVEMS0 EQU   CVTS01+516                                               00880000
CVTSPFRR EQU   CVTS01+512                                               00881000
CVTRLSTG EQU   CVTS01+508                                               00882000
CVT0TC0A EQU   CVTS01+504                                               00883000
CVTGMBR  EQU   CVTS01+500                                               00884000
CVTLFRM  EQU   CVTS01+496                                               00885000
CVTRMBR  EQU   CVTS01+492                                               00886000
CVTVIOP  EQU   CVTS01+488                                               00887000
CVTRV307 EQU   CVTS01+486                                               00888000
CVTRV306 EQU   CVTS01+484                                               00889000
CVTRV305 EQU   CVTS01+482                                               00890000
CVTRV304 EQU   CVTS01+480                                               00891000
CVTRV303 EQU   CVTS01+478                                               00892000
CVTRV302 EQU   CVTS01+476                                               00893000
CVTTRCA  EQU   CVTS01+472                                               00894000
CVTRV297 EQU   CVTRV289                                                 00895000
CVTRV296 EQU   CVTRV289                                                 00896000
CVTRV295 EQU   CVTRV289                                                 00897000
CVTRV294 EQU   CVTRV289                                                 00898000
CVTRV293 EQU   CVTRV289                                                 00899000
CVTRV292 EQU   CVTRV289                                                 00900000
CVTRV291 EQU   CVTRV289                                                 00901000
CVTRV290 EQU   CVTRV289                                                 00902000
CVTRV288 EQU   CVTRV280                                                 00903000
CVTRV287 EQU   CVTRV280                                                 00904000
CVTRV286 EQU   CVTRV280                                                 00905000
CVTRV285 EQU   CVTRV280                                                 00906000
CVTRV284 EQU   CVTRV280                                                 00907000
CVTRV283 EQU   CVTRV280                                                 00908000
CVTRV282 EQU   CVTRV280                                                 00909000
CVTRV281 EQU   CVTRV280                                                 00910000
CVTRV279 EQU   CVTRV271                                                 00911000
CVTRV278 EQU   CVTRV271                                                 00912000
CVTRV277 EQU   CVTRV271                                                 00913000
CVTRV276 EQU   CVTRV271                                                 00914000
CVTRV275 EQU   CVTRV271                                                 00915000
CVTRV274 EQU   CVTRV271                                                 00916000
CVTRV273 EQU   CVTRV271                                                 00917000
CVTRV272 EQU   CVTRV271                                                 00918000
CVTRV270 EQU   CVTRV262                                                 00919000
CVTRV269 EQU   CVTRV262                                                 00920000
CVTRV268 EQU   CVTRV262                                                 00921000
CVTRV267 EQU   CVTRV262                                                 00922000
CVTRV266 EQU   CVTRV262                                                 00923000
CVTRV265 EQU   CVTRV262                                                 00924000
CVTRV264 EQU   CVTRV262                                                 00925000
CVTRV263 EQU   CVTRV262                                                 00926000
CVTVFP   EQU   CVTS01+464                                               00927000
CVTVSI   EQU   CVTS01+460                                               00928000
CVTVPSIB EQU   CVTS01+456                                               00929000
CVTMFACT EQU   CVTMFRTR                                                 00930000
CVTMFCTL EQU   CVTS01+448                                               00931000
CVTPVBP  EQU   CVTS01+444                                               00932000
CVTPWI   EQU   CVTS01+440                                               00933000
CVTRV254 EQU   CVTS01+438                                               00934000
CVTRV253 EQU   CVTS01+436                                               00935000
CVTRV252 EQU   CVTS01+434                                               00936000
CVTRV251 EQU   CVTS01+433                                               00937000
CVTRV250 EQU   CVTS01+432                                               00938000
CVTRV249 EQU   CVTS01+431                                               00939000
CVTRV248 EQU   CVTS01+430                                               00940000
CVTRV247 EQU   CVTS01+429                                               00941000
CVTRV246 EQU   CVTS01+428                                               00942000
CVTRV245 EQU   CVTRV237                                                 00943000
CVTRV244 EQU   CVTRV237                                                 00944000
CVTRV243 EQU   CVTRV237                                                 00945000
CVTRV242 EQU   CVTRV237                                                 00946000
CVTRV241 EQU   CVTRV237                                                 00947000
CVTRV240 EQU   CVTRV237                                                 00948000
CVTRV239 EQU   CVTRV237                                                 00949000
CVTRV238 EQU   CVTRV237                                                 00950000
CVTRV236 EQU   CVTRV228                                                 00951000
CVTRV235 EQU   CVTRV228                                                 00952000
CVTRV234 EQU   CVTRV228                                                 00953000
CVTRV233 EQU   CVTRV228                                                 00954000
CVTRV232 EQU   CVTRV228                                                 00955000
CVTRV231 EQU   CVTRV228                                                 00956000
CVTRV230 EQU   CVTRV228                                                 00957000
CVTRV229 EQU   CVTRV228                                                 00958000
CVTRV227 EQU   CVTRV219                                                 00959000
CVTRV226 EQU   CVTRV219                                                 00960000
CVTRV225 EQU   CVTRV219                                                 00961000
CVTRV224 EQU   CVTRV219                                                 00962000
CVTRV223 EQU   CVTRV219                                                 00963000
CVTRV222 EQU   CVTRV219                                                 00964000
CVTRV221 EQU   CVTRV219                                                 00965000
CVTRV220 EQU   CVTRV219                                                 00966000
CVTRV218 EQU   CVTRV210                                                 00967000
CVTRV217 EQU   CVTRV210                                                 00968000
CVTRV216 EQU   CVTRV210                                                 00969000
CVTRV215 EQU   CVTRV210                                                 00970000
CVTRV214 EQU   CVTRV210                                                 00971000
CVTRV213 EQU   CVTRV210                                                 00972000
CVTRV212 EQU   CVTRV210                                                 00973000
CVTRV211 EQU   CVTRV210                                                 00974000
CVTLCCAT EQU   CVTS01+420                                               00975000
CVTPCCAT EQU   CVTS01+416                                               00976000
CVTIPCRP EQU   CVTS01+412                                               00977000
CVTIPCRI EQU   CVTS01+408                                               00978000
CVTIPCDS EQU   CVTS01+404                                               00979000
CVTAIDVT EQU   CVTS01+400                                               00980000
CVTSSAP  EQU   CVTS01+396                                               00981000
CVTEHCIR EQU   CVTS01+392                                               00982000
CVTEHDEF EQU   CVTS01+388                                               00983000
CVTDAIR  EQU   CVTS01+384                                               00984000
CVTPERFM EQU   CVTS01+380                                               00985000
CVT044R2 EQU   CVTS01+376                                               00986000
CVTFETCH EQU   CVTS01+372                                               00987000
CVTRSTWD EQU   CVTS01+368                                               00988000
CVTSPOST EQU   CVTS01+364                                               00989000
CVTIOBP  EQU   CVTS01+360                                               00990000
CVTASMVT EQU   CVTS01+356                                               00991000
CVTRECRQ EQU   CVTS01+352                                               00992000
CVTWSAC  EQU   CVTS01+348                                               00993000
CVTRV149 EQU   CVTS01+344                                               00994000
CVTWSAL  EQU   CVTS01+340                                               00995000
CVTSPSA  EQU   CVTS01+336                                               00996000
CVTGLMN  EQU   CVTS01+332                                               00997000
CVTVEAC0 EQU   CVTS01+328                                               00998000
CVT062R1 EQU   CVTS01+324                                               00999000
CVTRPOST EQU   CVTS01+320                                               01000000
CVTDQIQE EQU   CVTS01+316                                               01001000
CVTCSD   EQU   CVTS01+312                                               01002000
CVTLKRMA EQU   CVTS01+308                                               01003000
CVTRSPIE EQU   CVTS01+304                                               01004000
CVTRENQ  EQU   CVTS01+300                                               01005000
CVTLQCB  EQU   CVTS01+296                                               01006000
CVTFQCB  EQU   CVTS01+292                                               01007000
CVTQCS01 EQU   CVTS01+288                                               01008000
CVTAPFT  EQU   CVTS01+284                                               01009000
CVTPARRL EQU   CVTS01+280                                               01010000
CVTVWAIT EQU   CVTS01+276                                               01011000
CVTGSPL  EQU   CVTS01+272                                               01012000
CVTLSMQ  EQU   CVTS01+268                                               01013000
CVTGSMQ  EQU   CVTS01+264                                               01014000
CVTEXPRO EQU   CVTS01+260                                               01015000
CVTOPCTP EQU   CVTS01+256                                               01016000
CVTSIC   EQU   CVTS01+252                                               01017000
CVTTPIOS EQU   CVTS01+248                                               01018000
CVTRTMS  EQU   CVTS01+244                                               01019000
CVTSDBF  EQU   CVTS01+240                                               01020000
CVTSCBP  EQU   CVTS01+236                                               01021000
CVTSDMP  EQU   CVTS01+232                                               01022000
CVTSV60  EQU   CVTS01+228                                               01023000
CVTRTMCT EQU   CVTS01+224                                               01024000
CVTASCBL EQU   CVTS01+220                                               01025000
CVTASCBH EQU   CVTS01+216                                               01026000
CVTGDA   EQU   CVTS01+212                                               01027000
CVTASVT  EQU   CVTS01+208                                               01028000
CVTVVMDI EQU   CVTS01+204                                               01029000
CVTAQTOP EQU   CVTS01+200                                               01030000
CVTIOSCS EQU   CVTS01+196                                               01031000
CVTSDRM  EQU   CVTS01+192                                               01032000
CVTOPTE  EQU   CVTS01+188                                               01033000
CVTSTXU  EQU   CVTS01+184                                               01034000
CVTQUIS  EQU   CVTS01+180                                               01035000
CVTPARS  EQU   CVTS01+176                                               01036000
CVTS1EE  EQU   CVTS01+172                                               01037000
CVTFRAS  EQU   CVTS01+168                                               01038000
CVTQSAS  EQU   CVTS01+164                                               01039000
CVTCRAS  EQU   CVTS01+160                                               01040000
CVTCRMN  EQU   CVTS01+156                                               01041000
CVTDELCP EQU   CVTS01+152                                               01042000
CVTFRECL EQU   CVTS01+148                                               01043000
CVTGETCL EQU   CVTS01+144                                               01044000
CVTBLDCP EQU   CVTS01+140                                               01045000
CVTAUTHL EQU   CVTS01+136                                               01046000
CVTSCAN  EQU   CVTS01+132                                               01047000
CVTRV144 EQU   CVTS01+130                                               01048000
CVTMAXMP EQU   CVTS01+128                                               01049000
CVTSTCK  EQU   CVTS01+124                                               01050000
CVTRV139 EQU   CVTS01+123                                               01051000
CVTDSSAC EQU   CVTS01+122                                               01052000
CVTRV513 EQU   CVTS01+121                                               01053000
CVTIOSPL EQU   CVTS01+120                                               01054000
CVTPTGT  EQU   CVTS01+116                                               01055000
CVTCSPIE EQU   CVTS01+112                                               01056000
CVTSMFEX EQU   CVTS01+108                                               01057000
CVTOLT0A EQU   CVTS01+104                                               01058000
CVTSRBRT EQU   CVTS01+100                                               01059000
CVTPUTL  EQU   CVTS01+96                                                01060000
CVTASCRL EQU   CVTS01+92                                                01061000
CVTASCRF EQU   CVTS01+88                                                01062000
CVTRV326 EQU   CVTS01+84                                                01063000
CVTRV325 EQU   CVTS01+80                                                01064000
CVTRV324 EQU   CVTS01+76                                                01065000
CVT0VL01 EQU   CVTS01+72                                                01066000
CVTSHRVM EQU   CVTS01+68                                                01067000
CVTRV332 EQU   CVTS01+64                                                01068000
CVTTAS   EQU   CVTS01+60                                                01069000
CVTRSCN  EQU   CVTS01+56                                                01070000
CVTTRAC2 EQU   CVTS01+54                                                01071000
CVTTRACE EQU   CVTS01+52                                                01072000
CVTAPG   EQU   CVTS01+51                                                01073000
CVTSDTRC EQU   CVTCTLFG                                                 01074000
CVTGTRCE EQU   CVTCTLFG                                                 01075000
CVTNOMP  EQU   CVTCTLFG                                                 01076000
CVTRSV79 EQU   CVTCTLFG                                                 01077000
CVTDSTAT EQU   CVTCTLFG                                                 01078000
CVTRSV78 EQU   CVTCTLFG                                                 01079000
CVTRV333 EQU   CVTCTLFG                                                 01080000
CVTRV323 EQU   CVTCTLFG                                                 01081000
CVTSPVLK EQU   CVTS01+49                                                01082000
CVTRSV77 EQU   CVTS01+48                                                01083000
CVTRV331 EQU   CVTS01+44                                                01084000
CVTRV330 EQU   CVTS01+40                                                01085000
CVTRV329 EQU   CVTS01+36                                                01086000
CVTRV328 EQU   CVTS01+32                                                01087000
CVTRV322 EQU   CVTS01+28                                                01088000
CVTSLID  EQU   CVTSLIDA+1                                               01089000
CVTSYLK  EQU   CVTSLIDA                                                 01090000
CVTRV321 EQU   CVTS01+20                                                01091000
CVTRV320 EQU   CVTS01+16                                                01092000
CVTLPDIR EQU   CVTLPDIA+1                                               01093000
CVTRSV69 EQU   CVTDIRST                                                 01094000
CVTRSV68 EQU   CVTDIRST                                                 01095000
CVTRSV67 EQU   CVTDIRST                                                 01096000
CVTRSV66 EQU   CVTDIRST                                                 01097000
CVTRSV65 EQU   CVTDIRST                                                 01098000
CVTRSV64 EQU   CVTDIRST                                                 01099000
CVTRSV63 EQU   CVTDIRST                                                 01100000
CVTDICOM EQU   CVTDIRST                                                 01101000
CVTPVTP  EQU   CVTS01+8                                                 01102000
CVTLPDSR EQU   CVTS01+4                                                 01103000
CVTGETL  EQU   CVTS01                                                   01104000
WKECHNGP EQU   WKECHAIN+1                                               01105000
@NM00023 EQU   WKEFLAGS                                                 01106000
WKEGATE  EQU   WKEFLAGS                                                 01107000
@NM00022 EQU   ISTWKE                                                   01108000
DLRPLUSR EQU   ISTDLRPL+76                                              01109000
DLRPLRNF EQU   ISTDLRPL+73                                              01110000
DLRPLRPF EQU   ISTDLRPL+72                                              01111000
DLRPLR15 EQU   DLRPLRSA+16                                              01112000
@NM00019 EQU   DLRPLRSA+8                                               01113000
DLRPLQPT EQU   DLRPLRSA+4                                               01114000
DLRPLRCD EQU   DLRPLRSA+3                                               01115000
DLRPLLTH EQU   DLRPLRSA+1                                               01116000
TPMPLCID EQU   ISTTPMPL+16                                              01117000
TPMPLTXT EQU   ISTTPMPL+12                                              01118000
TPMPLRNF EQU   ISTTPMPL+8                                               01119000
TPMPLRBA EQU   ISTTPMPL+5                                               01120000
TPMPLRLN EQU   ISTTPMPL+4                                               01121000
TPMPLMID EQU   ISTTPMPL                                                 01122000
NCSRUITS EQU   NCSUSSRU+2                                               01123000
NCSRULEN EQU   NCSUSSRU                                                 01124000
NCSAPPAB EQU   NCSAPP+608                                               01125000
NCSAPDAT EQU   NCSAPBUE+8                                               01126000
NCSAPRU  EQU   NCSAPBUE+3                                               01127000
NCSRSV04 EQU   NCSAPBUE                                                 01128000
NCSAPEND EQU   NCSAPP+84                                                01129000
NCSAPTXT EQU   NCSAPP+76                                                01130000
NCSAPECB EQU   NCSAPP+72                                                01131000
NCSAPSA  EQU   NCSAPP                                                   01132000
NCSPLPDB EQU   NCSPLSID+5                                               01133000
NCSPLNID EQU   NCSPLPHD                                                 01134000
NCSPLPO  EQU   NCSPLSTA                                                 01135000
NCSRSVD4 EQU   NCSPLSTA                                                 01136000
NCSRSVD2 EQU   NCSCRMOD                                                 01137000
NCSPTMOD EQU   NCSCRMOD                                                 01138000
NCSAIMOD EQU   NCSCRMOD                                                 01139000
NCSRSVD1 EQU   NCSCHKPT+1                                               01140000
NCSPTUSE EQU   NCSCHKPT+1                                               01141000
NCSRNME  EQU   NCSCHKPT+1                                               01142000
NCSCUA   EQU   NCSCHKPT+1                                               01143000
NCSANSMD EQU   NCSCHKPT+1                                               01144000
NCSLGMOD EQU   NCSCHKPT                                                 01145000
NCSLGAPL EQU   NCSCHKPT                                                 01146000
NCSDTRLM EQU   NCSCHKPT                                                 01147000
NCSESLM  EQU   NCSCHKPT                                                 01148000
NCSNRPL  EQU   NCSCHKPT                                                 01149000
NCSPOLD  EQU   NCSCHKPT                                                 01150000
NCSPACTV EQU   NCSCHKPT                                                 01151000
NCSACTV  EQU   NCSCHKPT                                                 01152000
NCSCRDTE EQU   ISTNCSPL+264                                             01153000
NCSPLRTY EQU   ISTNCSPL+263                                             01154000
NCSPLRH  EQU   ISTNCSPL+260                                             01155000
NCSUFMCB EQU   ISTNCSPL+256                                             01156000
NCSMGLPT EQU   ISTNCSPL+252                                             01157000
NCSCPWPT EQU   ISTNCSPL+248                                             01158000
NCSSENS2 EQU   NCSSENSE+2                                               01159000
NCSSNS2  EQU   NCSSENSE+1                                               01160000
NCSSNS1  EQU   NCSSENSE                                                 01161000
NCSPLNSN EQU   ISTNCSPL+240                                             01162000
NCSPLMID EQU   ISTNCSPL+232                                             01163000
NCSPLPID EQU   ISTNCSPL+231                                             01164000
NCSPLGID EQU   ISTNCSPL+230                                             01165000
NCSPLSQN EQU   ISTNCSPL+228                                             01166000
NCSRNAME EQU   ISTNCSPL+220                                             01167000
NCSPLRUI EQU   ISTNCSPL+212                                             01168000
NCSPLRUO EQU   ISTNCSPL+208                                             01169000
NCSPLRRP EQU   ISTNCSPL+204                                             01170000
NCSPLWEL EQU   ISTNCSPL+200                                             01171000
NCSPLSPL EQU   ISTNCSPL+196                                             01172000
NCSPLP3  EQU   ISTNCSPL+192                                             01173000
NCSPLP2  EQU   ISTNCSPL+188                                             01174000
NCSPLP1  EQU   ISTNCSPL+184                                             01175000
NCSPLOLN EQU   ISTNCSPL+182                                             01176000
@NM00018 EQU   NCSPLFL5                                                 01177000
NCSFORCE EQU   NCSPLFL5                                                 01178000
NCSSDLK  EQU   NCSPLFL5                                                 01179000
NCSSCPPS EQU   NCSPLFL5                                                 01180000
NCSDLRSN EQU   ISTNCSPL+180                                             01181000
NCSPL2AP EQU   NCSPLFL4                                                 01182000
NCSDSPN  EQU   NCSPLFL4                                                 01183000
NCSDSPI  EQU   NCSPLFL4                                                 01184000
NCSDSPA  EQU   NCSPLFL4                                                 01185000
NCSDSPE  EQU   NCSPLFL4                                                 01186000
NCSPLVID EQU   NCSPLFL4                                                 01187000
NCSPLRSO EQU   NCSPLFL4                                                 01188000
NCSDLNID EQU   NCSPLFL4                                                 01189000
NCSEND   EQU   NCSPLFL3                                                 01190000
NCSFINAL EQU   NCSPLFL3                                                 01191000
NCSANS   EQU   NCSPLFL3                                                 01192000
NCSPID   EQU   NCSPLFL3                                                 01193000
NCSGID   EQU   NCSPLFL3                                                 01194000
NCSPLANS EQU   NCSPLFL3                                                 01195000
NCSEPP   EQU   NCSPLFL3                                                 01196000
NCSPLMOM EQU   NCSPLFL3                                                 01197000
NCSPLVIT EQU   NCSPLFL2                                                 01198000
NCSPLVIS EQU   NCSPLFL2                                                 01199000
NCSREMPO EQU   NCSPLFL2                                                 01200000
NCSPLDS  EQU   NCSPLFL2                                                 01201000
NCSOUFMC EQU   NCSPLFL2                                                 01202000
NCSPLRIO EQU   NCSPLFL2                                                 01203000
NCSPLRSF EQU   NCSPLFL2                                                 01204000
NCSPLVDP EQU   NCSPLFL2                                                 01205000
NCSPLPOS EQU   NCSPLFL1                                                 01206000
NCSPL2CN EQU   NCSPLFL1                                                 01207000
NCSPLAPU EQU   NCSPLFL1                                                 01208000
NCSPLNON EQU   NCSPLFL1                                                 01209000
NCSPLREQ EQU   NCSPLFL1                                                 01210000
NCSPLEBN EQU   NCSPLFL1                                                 01211000
NCSPLSOM EQU   NCSPLFL1                                                 01212000
NCSPL2IN EQU   NCSPLFL1                                                 01213000
NCSPLRCR EQU   ISTNCSPL+172                                             01214000
NCSPLECB EQU   ISTNCSPL+164                                             01215000
NCSPLCVT EQU   ISTNCSPL+156                                             01216000
NCSPLWKA EQU   ISTNCSPL+152                                             01217000
NCSPLDAF EQU   NCSPLCID+2                                               01218000
NCSPLSAF EQU   NCSPLCID                                                 01219000
NCSPLRCD EQU   NCSPLRAD+1                                               01220000
NCSLSCMD EQU   NCSPLRAD                                                 01221000
NCSPLWRF EQU   ISTNCSPL+72                                              01222000
NCSPLWRE EQU   ISTNCSPL+68                                              01223000
NCSSTCMD EQU   NCSCRFLG                                                 01224000
NCSUSRNF EQU   NCSCRFLG                                                 01225000
NCSOPRQU EQU   NCSCRFLG                                                 01226000
NCSCRDSE EQU   NCSCRFLG                                                 01227000
NCSFMERP EQU   NCSCRFLG                                                 01228000
NCSFMCLD EQU   NCSCRFLG                                                 01229000
NCSPLCLD EQU   NCSCRFLG                                                 01230000
NCSPLWRM EQU   NCSCRFLG                                                 01231000
NCSPLUAD EQU   ISTNCSPL+64                                              01232000
NCSMSGSP EQU   ISTNCSPL+63                                              01233000
NCSNCPEP EQU   ISTNCSPL+62                                              01234000
NCSCMDB  EQU   NCSPLCMD+1                                               01235000
@NM00017 EQU   NCSCMDA                                                  01236000
NCSPLUFM EQU   NCSCMDA                                                  01237000
NCSPLFLO EQU   NCSCMDA                                                  01238000
NCSPLSYN EQU   NCSCMDA                                                  01239000
NCSPLCTL EQU   NCSCMDA                                                  01240000
NCSPLSYS EQU   NCSCMDA                                                  01241000
NCSPLLPT EQU   ISTNCSPL+56                                              01242000
NCSPLRPT EQU   ISTNCSPL+52                                              01243000
NCSCRPID EQU   ISTNCSPL+51                                              01244000
NCSCRCMD EQU   ISTNCSPL+50                                              01245000
NCSDLID  EQU   ISTNCSPL+44                                              01246000
NCSPLLID EQU   ISTNCSPL+36                                              01247000
NCSPLRID EQU   ISTNCSPL+28                                              01248000
NCSRRNPT EQU   ISTNCSPL+24                                              01249000
NCSPRMRC EQU   ISTNCSPL+22                                              01250000
NCSOVFMC EQU   NCSPLVF1                                                 01251000
NCSRSV02 EQU   NCSPLVFL                                                 01252000
NCSDACLK EQU   NCSPLVFL                                                 01253000
NCSABCON EQU   NCSPLVFL                                                 01254000
NCSDCONT EQU   NCSPLVFL                                                 01255000
NCSVSTAT EQU   NCSPLVFL                                                 01256000
NCSVDEL  EQU   NCSPLVFL                                                 01257000
NCSVNCSA EQU   NCSPLVFL                                                 01258000
NCSVBF16 EQU   NCSPLVBF+1                                               01259000
NCSVBF15 EQU   NCSPLVBF+1                                               01260000
NCSVBF14 EQU   NCSPLVBF+1                                               01261000
NCSVBF13 EQU   NCSPLVBF+1                                               01262000
NCSVBF12 EQU   NCSPLVBF+1                                               01263000
NCSVBF11 EQU   NCSPLVBF+1                                               01264000
NCSVBF10 EQU   NCSPLVBF+1                                               01265000
NCSVBF09 EQU   NCSPLVBF+1                                               01266000
NCSVBF08 EQU   NCSPLVBF                                                 01267000
NCSVBF07 EQU   NCSPLVBF                                                 01268000
NCSVBF06 EQU   NCSPLVBF                                                 01269000
NCSVBF05 EQU   NCSPLVBF                                                 01270000
NCSVBF04 EQU   NCSPLVBF                                                 01271000
NCSVBF03 EQU   NCSPLVBF                                                 01272000
NCSVBF02 EQU   NCSPLVBF                                                 01273000
NCSVBF01 EQU   NCSPLVBF                                                 01274000
@NM00016 EQU   ISTNCSPL+16                                              01275000
NCSCRWKA EQU   NCSPFX+12                                                01276000
@NM00015 EQU   NCSPFX                                                   01277000
PFXBCK   EQU   ISTPFX+12                                                01278000
PFXFWD   EQU   ISTPFX+8                                                 01279000
PFXLNG   EQU   ISTPFX+5                                                 01280000
PFXPRTY  EQU   ISTPFX+4                                                 01281000
PFXCBID  EQU   PFXID                                                    01282000
POHID    EQU   ISTPOHD+2                                                01283000
POHGEN   EQU   POHSTAT                                                  01284000
POHRREQ  EQU   POHSTAT                                                  01285000
POHRSVD2 EQU   POHSTAT                                                  01286000
POHCNTRL EQU   POHSTAT                                                  01287000
POHLBL   EQU   POHSTAT                                                  01288000
POHDATA  EQU   POHSTAT                                                  01289000
POHEND   EQU   POHSTAT                                                  01290000
POHRSVD1 EQU   ISTPOHD                                                  01291000
ATCAOS   EQU   ISTATCVT+1584                                            01292000
ATCPOPAB EQU   ATCAOSM+640                                              01293000
ATCVIOPM EQU   ATCAOSM+636                                              01294000
ATCTPMMI EQU   ATCAOSM+632                                              01295000
ATCTPMPB EQU   ATCAOSM+600                                              01296000
ATCRSV88 EQU   ATCAOSM+596                                              01297000
ATCRPLCT EQU   ATCAOSM+594                                              01298000
ATCCRACT EQU   ATCAOSM+592                                              01299000
ATCSRBCT EQU   ATCAOSM+590                                              01300000
ATCRSV75 EQU   ATCAOSM+589                                              01301000
ATCRSV66 EQU   ATCZFLAG                                                 01302000
ATCZF001 EQU   ATCZFLAG                                                 01303000
ATCTPCP1 EQU   ATCAOSM+584                                              01304000
ATCTPCP0 EQU   ATCAOSM+580                                              01305000
ATCAICTN EQU   ATCAOSM+576                                              01306000
ATCZR01  EQU   ATCAOSM+572                                              01307000
ATCMPLTA EQU   ATCAOSM+568                                              01308000
ATCASCB  EQU   ATCAOSM+564                                              01309000
ATCAP86  EQU   ATCAOSM+560                                              01310000
ATCAP85  EQU   ATCAOSM+556                                              01311000
ATCAP84  EQU   ATCAOSM+552                                              01312000
ATCAP83  EQU   ATCAOSM+548                                              01313000
ATCAP82  EQU   ATCAOSM+544                                              01314000
ATCAP69  EQU   ATCAOSM+540                                              01315000
ATCAP66  EQU   ATCAOSM+536                                              01316000
ATCAP62  EQU   ATCAOSM+532                                              01317000
ATCAPC59 EQU   ATCAOSM+528                                              01318000
ATCAP56  EQU   ATCAOSM+524                                              01319000
ATCAP55  EQU   ATCAOSM+520                                              01320000
ATCRCFY0 EQU   ATCAOSM+516                                              01321000
ATCAP41  EQU   ATCAOSM+512                                              01322000
ATCAPC25 EQU   ATCAOSM+508                                              01323000
ATCAP23  EQU   ATCAOSM+504                                              01324000
ATCTPSPB EQU   ATCAOSM+472                                              01325000
ATCTRMPB EQU   ATCAOSM+440                                              01326000
ATCAPBE  EQU   ATCAOSM+436                                              01327000
ATCPSTA  EQU   ATCAOSM+432                                              01328000
ATCSMABF EQU   ATCAOSM+428                                              01329000
ATCSMAPR EQU   ATCAOSM+424                                              01330000
ATCTPWQA EQU   ATCAOSM+420                                              01331000
ATCSMAID EQU   ATCAOSM+416                                              01332000
ATCSMARA EQU   ATCAOSM+412                                              01333000
ATCCACXA EQU   ATCAOSM+408                                              01334000
ATCZLAAB EQU   ATCAOSM+404                                              01335000
ATCATA10 EQU   ATCAOSM+400                                              01336000
ATCHLTCB EQU   ATCAOSM+396                                              01337000
@NM00013 EQU   ATCVTFLG                                                 01338000
ATCVTACT EQU   ATCVTFLG                                                 01339000
ATCRPT40 EQU   ATCAOSM+388                                              01340000
ATCRPT39 EQU   ATCAOSM+384                                              01341000
ATCRPT38 EQU   ATCAOSM+380                                              01342000
ATCRPT37 EQU   ATCAOSM+376                                              01343000
ATCRPT36 EQU   ATCAOSM+372                                              01344000
ATCRPT35 EQU   ATCAOSM+368                                              01345000
ATCRPT34 EQU   ATCAOSM+364                                              01346000
ATCRPT33 EQU   ATCAOSM+360                                              01347000
ATCRPT32 EQU   ATCAOSM+356                                              01348000
ATCRPT31 EQU   ATCAOSM+352                                              01349000
ATCRPT30 EQU   ATCAOSM+348                                              01350000
ATCRPT29 EQU   ATCAOSM+344                                              01351000
ATCRPT28 EQU   ATCAOSM+340                                              01352000
ATCRPT27 EQU   ATCAOSM+336                                              01353000
ATCRPT26 EQU   ATCAOSM+332                                              01354000
ATCRPT25 EQU   ATCAOSM+328                                              01355000
ATCRPT24 EQU   ATCAOSM+324                                              01356000
ATCRPT23 EQU   ATCAOSM+320                                              01357000
ATCRPT22 EQU   ATCAOSM+316                                              01358000
ATCRPT21 EQU   ATCAOSM+312                                              01359000
ATCRPT20 EQU   ATCAOSM+308                                              01360000
ATCRPT19 EQU   ATCAOSM+304                                              01361000
ATCRPT18 EQU   ATCAOSM+300                                              01362000
ATCRPT17 EQU   ATCAOSM+296                                              01363000
ATCRPT16 EQU   ATCAOSM+292                                              01364000
ATCRPT15 EQU   ATCAOSM+288                                              01365000
ATCRPT14 EQU   ATCAOSM+284                                              01366000
ATCRPT13 EQU   ATCAOSM+280                                              01367000
ATCRPT12 EQU   ATCAOSM+276                                              01368000
ATCRPT11 EQU   ATCAOSM+272                                              01369000
ATCAP38  EQU   ATCAOSM+268                                              01370000
ATCAP37  EQU   ATCAOSM+264                                              01371000
ATCZDFJ0 EQU   ATCAOSM+260                                              01372000
ATCAP51  EQU   ATCAOSM+256                                              01373000
ATCZPAB2 EQU   ATCAOSM+224                                              01374000
ATCZPAB1 EQU   ATCAOSM+192                                              01375000
ATCZLFVT EQU   ATCAOSM+188                                              01376000
ATCZLPVT EQU   ATCAOSM+184                                              01377000
ATCZDVTX EQU   ATCAOSM+180                                              01378000
ATCZDVTA EQU   ATCAOSM+176                                              01379000
ATCZDVT9 EQU   ATCAOSM+172                                              01380000
ATCZDVT8 EQU   ATCAOSM+168                                              01381000
ATCZDVT7 EQU   ATCAOSM+164                                              01382000
ATCRSV56 EQU   ATCDAPVT+22                                              01383000
ATCDAPDG EQU   ATCDAPVT+20                                              01384000
ATCDXCEA EQU   ATCDAPVT+16                                              01385000
ATCDCEA  EQU   ATCDAPVT+12                                              01386000
ATCDPCIA EQU   ATCDAPVT+8                                               01387000
ATCDSIOA EQU   ATCDAPVT+4                                               01388000
ATCDEOEA EQU   ATCDAPVT                                                 01389000
ATCZLAEA EQU   ATCLDAPP+16                                              01390000
ATCZLCEA EQU   ATCLDAPP+12                                              01391000
ATCRSV17 EQU   ATCLDAPP+8                                               01392000
ATCSMFRR EQU   ATCLDAPP+4                                               01393000
ATCCDTID EQU   ATCLDAPP                                                 01394000
ATCZAEA  EQU   ATCICAPP+16                                              01395000
ATCZCEA  EQU   ATCICAPP+12                                              01396000
ATCCDTCB EQU   ATCICAPP+8                                               01397000
ATCZSIOA EQU   ATCICAPP+4                                               01398000
ATCCDRPH EQU   ATCICAPP                                                 01399000
ATCAP65  EQU   ATCAOSM+96                                               01400000
ATCZDVT6 EQU   ATCAOSM+92                                               01401000
ATCZDVT4 EQU   ATCAOSM+88                                               01402000
ATCZDVT3 EQU   ATCAOSM+84                                               01403000
ATCZDVT1 EQU   ATCAOSM+80                                               01404000
ATCICNCB EQU   ATCAOSM+76                                               01405000
ATCZPSVT EQU   ATCAOSM+72                                               01406000
ATCZFSVT EQU   ATCAOSM+68                                               01407000
ATCAP64  EQU   ATCAOSM+64                                               01408000
ATCAP63  EQU   ATCAOSM+60                                               01409000
ATCAP61  EQU   ATCAOSM+56                                               01410000
ATCAP58  EQU   ATCAOSM+52                                               01411000
ATCAP57  EQU   ATCAOSM+48                                               01412000
ATCAP54  EQU   ATCAOSM+44                                               01413000
ATCAP53  EQU   ATCAOSM+40                                               01414000
ATCAP52  EQU   ATCAOSM+36                                               01415000
ATCAP34  EQU   ATCAOSM+32                                               01416000
ATCAP31  EQU   ATCAOSM+24                                               01417000
ATCAP12  EQU   ATCAOSM+20                                               01418000
ATCAP11  EQU   ATCAOSM+16                                               01419000
ATCCMTCB EQU   ATCAOSM+12                                               01420000
ATCPRPH  EQU   ATCAOSM+8                                                01421000
ATCGSRBF EQU   ATCGSRBG                                                 01422000
ATCSRBRT EQU   ATCAOSM                                                  01423000
ATCRSVBB EQU   ISTATCVT+908                                             01424000
ATCVDLOK EQU   ISTATCVT+904                                             01425000
ATCVFPAB EQU   ISTATCVT+872                                             01426000
ATCVDPAB EQU   ISTATCVT+840                                             01427000
ATCIOECB EQU   ISTATCVT+836                                             01428000
ATCINCW3 EQU   ISTATCVT+832                                             01429000
ATCMODTB EQU   ISTATCVT+828                                             01430000
ATCUSSPT EQU   ISTATCVT+824                                             01431000
ATCSRTAB EQU   ISTATCVT+820                                             01432000
@NM00012 EQU   ISTATCVT+819                                             01433000
ATCSTAT2 EQU   ISTATCVT+818                                             01434000
ATCNMCTR EQU   ISTATCVT+816                                             01435000
ATCSEC51 EQU   ATCSECST                                                 01436000
ATCSEC40 EQU   ATCSIPD+8                                                01437000
ATCSEC30 EQU   ATCSIPD+4                                                01438000
ATCSEC21 EQU   ATCSIPD                                                  01439000
ATCSEC10 EQU   ATCSOPD+4                                                01440000
ATCSEC01 EQU   ATCSOPD                                                  01441000
ATCPOIA  EQU   ATCRNO+1                                                 01442000
@NM00011 EQU   ATCRNO                                                   01443000
ATCPODVT EQU   ISTATCVT+784                                             01444000
ATCS49XL EQU   ISTATCVT+780                                             01445000
ATCS49XI EQU   ISTATCVT+776                                             01446000
ATCLCLCT EQU   ATCVLCNT+2                                               01447000
ATCRNCNT EQU   ATCVLCNT                                                 01448000
ATCCFEAD EQU   ISTATCVT+768                                             01449000
ATCPTR00 EQU   ISTATCVT+736                                             01450000
ATCRSV10 EQU   ISTATCVT+704                                             01451000
ATCTACB  EQU   ISTATCVT+700                                             01452000
ATCVTINM EQU   ISTATCVT+696                                             01453000
ATCTCLIM EQU   ISTATCVT+692                                             01454000
ATCTCLOM EQU   ISTATCVT+688                                             01455000
ATCVTIPB EQU   ISTATCVT+656                                             01456000
ATCTCIPB EQU   ISTATCVT+624                                             01457000
ATCTIPAB EQU   ISTATCVT+592                                             01458000
ATCOCCCB EQU   ISTATCVT+588                                             01459000
ATCOCCOB EQU   ISTATCVT+584                                             01460000
ATCCDLAD EQU   ISTATCVT+580                                             01461000
ATCCCLAD EQU   ISTATCVT+576                                             01462000
ATCDLRPB EQU   ISTATCVT+544                                             01463000
ATCPGPAB EQU   ISTATCVT+512                                             01464000
ATCVPAB1 EQU   ISTATCVT+480                                             01465000
ATCRSV97 EQU   ISTATCVT+476                                             01466000
ATCRDTLK EQU   ISTATCVT+472                                             01467000
ATCVOCLK EQU   ISTATCVT+468                                             01468000
ATCCDFDN EQU   ISTATCVT+464                                             01469000
ATCCDFIN EQU   ISTATCVT+460                                             01470000
ATCDVTLK EQU   ISTATCVT+456                                             01471000
ATCAP36  EQU   ISTATCVT+452                                             01472000
ATCAP35  EQU   ISTATCVT+448                                             01473000
ATCAP33  EQU   ISTATCVT+444                                             01474000
ATCRSV99 EQU   ISTATCVT+440                                             01475000
ATCONFIG EQU   ISTATCVT+432                                             01476000
ATCNODDS EQU   ISTATCVT+428                                             01477000
ATCNODEL EQU   ISTATCVT+420                                             01478000
ATCRSV69 EQU   ISTATCVT+416                                             01479000
ATCAPCR5 EQU   ISTATCVT+412                                             01480000
ATCCDPTR EQU   ISTATCVT+400                                             01481000
ATCADEL  EQU   ISTATCVT+396                                             01482000
ATCTODVT EQU   ISTATCVT+392                                             01483000
ATCDEBCH EQU   ISTATCVT+388                                             01484000
ATCHBSIZ EQU   ATCHPGM+2                                                01485000
ATCHBFNO EQU   ATCHPGM                                                  01486000
ATCCRME  EQU   ISTATCVT+380                                             01487000
ATCRVCHS EQU   ISTATCVT+372                                             01488000
ATCECTLP EQU   ISTATCVT+368                                             01489000
ATCZDVTB EQU   ISTATCVT+364                                             01490000
ATCECPRT EQU   ISTATCVT+360                                             01491000
ATCVTLOD EQU   ISTATCVT+356                                             01492000
ATCTRPAB EQU   ISTATCVT+352                                             01493000
ATCMSGM  EQU   ISTATCVT+348                                             01494000
ATCMSGP  EQU   ISTATCVT+344                                             01495000
ATCEPT   EQU   ISTATCVT+340                                             01496000
ATCDVT   EQU   ISTATCVT+336                                             01497000
ATCTRCPT EQU   ISTATCVT+332                                             01498000
ATCDVLOD EQU   ISTATCVT+328                                             01499000
ATCALERT EQU   ISTATCVT+324                                             01500000
ATCEPA   EQU   ISTATCVT+320                                             01501000
ATCSAF   EQU   ISTATCVT+318                                             01502000
ATCXRANG EQU   ISTATCVT+317                                             01503000
ATCLAST  EQU   ATCSHRFG                                                 01504000
ATCSHRTN EQU   ISTATCVT+308                                             01505000
ATCUEP   EQU   ISTATCVT+304                                             01506000
ATCOCRT  EQU   ISTATCVT+300                                             01507000
ATCCSMA  EQU   ATCCSMR                                                  01508000
ATCESC02 EQU   ISTATCVT+292                                             01509000
ATCESC01 EQU   ISTATCVT+288                                             01510000
ATCCDFND EQU   ISTATCVT+284                                             01511000
ATCCDDEL EQU   ISTATCVT+280                                             01512000
ATCCDADD EQU   ISTATCVT+276                                             01513000
ATCMNT   EQU   ISTATCVT+272                                             01514000
ATCRSV16 EQU   ISTATCVT+270                                             01515000
ATCMAXID EQU   ISTATCVT+269                                             01516000
ATCMSGSP EQU   ATCCOM+268                                               01517000
ATCCIDM  EQU   ATCCOM+266                                               01518000
ATCACTRM EQU   ATCCOM+264                                               01519000
ATCNERAP EQU   ATCCOM+260                                               01520000
ATCNESAL EQU   ATCCOM+256                                               01521000
ATCRCC65 EQU   ATCCOM+252                                               01522000
ATCRCC26 EQU   ATCCOM+248                                               01523000
ATCRCC63 EQU   ATCCOM+244                                               01524000
ATCRSV11 EQU   ATCCOM+242                                               01525000
ATCVTMID EQU   ATCCOM+240                                               01526000
ATCAPOST EQU   ATCCOM+236                                               01527000
ATCNERFN EQU   ATCCOM+232                                               01528000
ATCNERNE EQU   ATCCOM+228                                               01529000
ATCNERCV EQU   ATCCOM+224                                               01530000
ATCNERST EQU   ATCCOM+220                                               01531000
ATCDCC61 EQU   ATCCOM+216                                               01532000
ATCDCC60 EQU   ATCCOM+212                                               01533000
ATCSRTDF EQU   ATCCOM+208                                               01534000
ATCSRTAD EQU   ATCCOM+204                                               01535000
ATCFIRA  EQU   ATCCOM+200                                               01536000
ATCSMBQ  EQU   ATCCOM+196                                               01537000
ATCSMRC  EQU   ATCCOM+192                                               01538000
ATCSMRS  EQU   ATCCOM+188                                               01539000
ATCSMQU  EQU   ATCCOM+184                                               01540000
ATCSMRQ  EQU   ATCCOM+180                                               01541000
ATCACDA  EQU   ATCCOM+176                                               01542000
ATCSTMA  EQU   ATCCOM+172                                               01543000
ATCFRSTR EQU   ATCCOM+168                                               01544000
ATCGTSTR EQU   ATCCOM+164                                               01545000
ATCREADA EQU   ATCCOM+160                                               01546000
ATCALOAD EQU   ATCCOM+156                                               01547000
ATCBLDLA EQU   ATCCOM+152                                               01548000
ATCFBRPH EQU   ATCCOM+148                                               01549000
ATCBFTRC EQU   ATCCOM+144                                               01550000
ATCTPBUF EQU   ATCTHTRC                                                 01551000
ATCREMOV EQU   ATCCOM+136                                               01552000
ATCADD   EQU   ATCCOM+132                                               01553000
ATCBPDA  EQU   ATCCOM+128                                               01554000
ATCDVTPT EQU   ATCCOM+124                                               01555000
ATCFEPT  EQU   ATCCOM+120                                               01556000
ATCFDVT  EQU   ATCCOM+116                                               01557000
ATCCONFT EQU   ATCCOM+112                                               01558000
ATCPTCHA EQU   ATCCOM+108                                               01559000
ATCAUTHA EQU   ATCCOM+104                                               01560000
ATCACCTA EQU   ATCCOM+100                                               01561000
ATCRDTH  EQU   ATCCOM+96                                                01562000
ATCFRSCH EQU   ATCCOM+92                                                01563000
ATCFSB   EQU   ATCCOM+88                                                01564000
ATCHLTMS EQU   ATCCOM+84                                                01565000
ATCECPRM EQU   ATCCOM+80                                                01566000
ATCECNET EQU   ATCCOM+76                                                01567000
ATCECOPC EQU   ATCCOM+72                                                01568000
ATCVPARM EQU   ATCCOM+68                                                01569000
ATCECVRQ EQU   ATCCOM+64                                                01570000
ATCECSES EQU   ATCCOM+60                                                01571000
ATCOCHA  EQU   ATCCOM+56                                                01572000
ATCDSPLQ EQU   ATCCOM+52                                                01573000
ATCECDSP EQU   ATCCOM+48                                                01574000
ATCVARYQ EQU   ATCCOM+44                                                01575000
ATCECVRY EQU   ATCCOM+40                                                01576000
ATCHALTQ EQU   ATCCOM+36                                                01577000
ATCECHLT EQU   ATCCOM+32                                                01578000
ATCMODQ  EQU   ATCCOM+28                                                01579000
ATCECMOD EQU   ATCCOM+24                                                01580000
ATCASCHD EQU   ATCCOM+20                                                01581000
ATCSRT   EQU   ATCCOM+16                                                01582000
ATCRDT   EQU   ATCCOM+12                                                01583000
ATCDCFRR EQU   ATCCOM+8                                                 01584000
ATCAPI   EQU   ATCCOM+4                                                 01585000
ATCRSV04 EQU   ATCSTAT4                                                 01586000
ATCMTST  EQU   ATCSTAT4                                                 01587000
ATCTPRT  EQU   ATCSTAT4                                                 01588000
ATCPRTAT EQU   ATCSTAT4                                                 01589000
@NM00010 EQU   ATCPOFLG                                                 01590000
ATCPOUNS EQU   ATCPOFLG                                                 01591000
ATCHSDMF EQU   ATCSTFLG                                                 01592000
@NM00009 EQU   ATCSTAT1                                                 01593000
ATCMDHLT EQU   ATCSTAT1                                                 01594000
ATCINHLT EQU   ATCSTAT1                                                 01595000
ATCNETSL EQU   ATCSTAT1                                                 01596000
ATCQKHLT EQU   ATCSTAT1                                                 01597000
ATCSNHLT EQU   ATCSTAT1                                                 01598000
ATCACTIV EQU   ATCSTAT1                                                 01599000
ATCSTART EQU   ATCSTAT1                                                 01600000
RPHNEXPO EQU   ISTRPH+104                                               01601000
RPHSAV16 EQU   RPHWORK+60                                               01602000
RPHSAV15 EQU   RPHWORK+56                                               01603000
RPHSAV14 EQU   RPHWORK+52                                               01604000
RPHSAV13 EQU   RPHWORK+48                                               01605000
RPHSAV12 EQU   RPHWORK+44                                               01606000
RPHSAV11 EQU   RPHWORK+40                                               01607000
RPHSAV10 EQU   RPHWORK+36                                               01608000
RPHSAVE9 EQU   RPHWORK+32                                               01609000
RPHSAVE8 EQU   RPHWORK+28                                               01610000
RPHSAVE7 EQU   RPHWORK+24                                               01611000
RPHSAVE6 EQU   RPHWORK+20                                               01612000
RPHSAVE5 EQU   RPHWORK+16                                               01613000
RPHSAVE4 EQU   RPHWORK+12                                               01614000
RPHSAVE3 EQU   RPHWORK+8                                                01615000
RPHSAVE2 EQU   RPHWORK+4                                                01616000
RPHSHALF EQU   RPHSAVE1+2                                               01617000
RPHSBIT8 EQU   RPHSBITS                                                 01618000
RPHSBIT7 EQU   RPHSBITS                                                 01619000
RPHSBIT6 EQU   RPHSBITS                                                 01620000
RPHSBIT5 EQU   RPHSBITS                                                 01621000
RPHSBIT4 EQU   RPHSBITS                                                 01622000
RPHSBIT3 EQU   RPHSBITS                                                 01623000
RPHSBIT2 EQU   RPHSBITS                                                 01624000
RPHSBIT1 EQU   RPHSBITS                                                 01625000
RPHSBYTE EQU   RPHSAVE1                                                 01626000
RPHPABQP EQU   RPHPABQA+1                                               01627000
RPHPABFG EQU   RPHPABQA                                                 01628000
RPHCRR   EQU   ISTRPH+32                                                01629000
RPHSRP34 EQU   RPHSRPRM+2                                               01630000
RPHSRP12 EQU   RPHSRPRM                                                 01631000
RPHWEGT  EQU   RPHCSPA                                                  01632000
RPHRESUM EQU   RPHRESMA+1                                               01633000
RPHRSV01 EQU   RPHWPFLG                                                 01634000
RPHPURGE EQU   RPHWPFLG                                                 01635000
RPHPT    EQU   RPHWPFLG                                                 01636000
RPHRSKEY EQU   RPHWPFLG                                                 01637000
RPHDVTA  EQU   ISTRPH+12                                                01638000
RPHTIK   EQU   RPHTSKID+3                                               01639000
@NM00008 EQU   RPHTSKID                                                 01640000
RPHRPHAP EQU   RPHRPHA+1                                                01641000
@NM00007 EQU   RPHRPHA                                                  01642000
RPHGATE  EQU   RPHRPHA                                                  01643000
@NM00006 EQU   RPHFLGB                                                  01644000
RPHRLCRA EQU   RPHFLGB                                                  01645000
RPHNRSAV EQU   RPHFLGB                                                  01646000
RPHPGCMP EQU   RPHFLGB                                                  01647000
RPHFBAPS EQU   RPHFLGB                                                  01648000
RPHBSSP  EQU   RPHFLGB                                                  01649000
RPHLOCK  EQU   RPHFLGB                                                  01650000
RPHFNFLG EQU   RPHFSTLC                                                 01651000
RPHMLTCP EQU   RPHFLAGS                                                 01652000
RPHSMCLR EQU   RPHFLAGS                                                 01653000
RPHSMTYP EQU   RPHFLAGS                                                 01654000
RPHSMQ   EQU   RPHFLAGS                                                 01655000
RPHAUTEX EQU   RPHAPTYP                                                 01656000
RPHSPGIN EQU   RPHFLAGS                                                 01657000
RPHOGIND EQU   RPHFLAGS                                                 01658000
RPHLNGTH EQU   RPHCNTL+1                                                01659000
RPHTYPE  EQU   RPHCNTL                                                  01660000
DYPPAB   EQU   ISTDYPAB+16                                              01661000
DYPRSV01 EQU   ISTDYPAB+12                                              01662000
DYPTSKID EQU   ISTDYPAB+8                                               01663000
DYPCHAIN EQU   ISTDYPAB+4                                               01664000
DYPFLGS  EQU   ISTDYPAB+2                                               01665000
DYPLNGTH EQU   ISTDYPAB+1                                               01666000
DYPTYPE  EQU   ISTDYPAB                                                 01667000
LOKXCL   EQU   @NM00004                                                 01668000
LOKPRY   EQU   @NM00004                                                 01669000
@NM00005 EQU   @NM00004                                                 01670000
@NM00003 EQU   LOKCHNG                                                  01671000
LOKCT    EQU   ISTLOK                                                   01672000
PABRPHA  EQU   PABRPHFG+1                                               01673000
PABNODQ  EQU   PABFLAGS                                                 01674000
PABINHBT EQU   PABFLAGS                                                 01675000
PABERLOK EQU   PABERRLK                                                 01676000
PABSSN   EQU   PABFLAGS                                                 01677000
PABDYNAM EQU   PABFLAGS                                                 01678000
PABNORPR EQU   PABFLAGS                                                 01679000
PABPRIOR EQU   PABFLAGS                                                 01680000
PABAPYP  EQU   PABFLAGS                                                 01681000
PABDVTA  EQU   ISTPAB+9                                                 01682000
PABOFFST EQU   ISTPAB+8                                                 01683000
PABCHNGP EQU   PABCHAIN+1                                               01684000
PABRSV02 EQU   PABCHAIN                                                 01685000
PABRUNNG EQU   PABCHAIN                                                 01686000
PABRESET EQU   PABCHAIN                                                 01687000
PABUNCON EQU   PABCHAIN                                                 01688000
PABCDP   EQU   PABCHAIN                                                 01689000
PABRESCH EQU   PABCHAIN                                                 01690000
PABCHNG  EQU   PABCHAIN                                                 01691000
PABWEQP  EQU   PABWEQA+1                                                01692000
PABRSV01 EQU   PABWEQA                                                  01693000
PABWEQG  EQU   PABWEQA                                                  01694000
ISTPDAVP EQU   ISTAVT+40                                                01695000
ISTAVR01 EQU   ISTAVT+38                                                01696000
ISTVTTP  EQU   ISTAVT+36                                                01697000
ISTAGTWT EQU   ISTAVT+34                                                01698000
ISTATRT  EQU   ISTAVT+32                                                01699000
ISTARID  EQU   ISTAVT+30                                                01700000
ISTX1    EQU   ISTAVT+29                                                01701000
ISTPHNM  EQU   ISTAVT+24                                                01702000
ISTAPSEX EQU   ISTAVT+20                                                01703000
ISTVTTIK EQU   ISTAVT+18                                                01704000
AVTASID  EQU   ISTAVT+16                                                01705000
ISTAPSTA EQU   ISTAVT+12                                                01706000
ISTAS53  EQU   ISTAVT+8                                                 01707000
CVTLEVL  EQU   CVTRELNO+2                                               01708000
CVTNUMB  EQU   CVTRELNO                                                 01709000
CVTMDL   EQU   CVTFIX+250                                               01710000
@NM00002 EQU   CVTFIX+248                                               01711000
@NM00001 EQU   CVTFIX                                                   01712000
CVTRV482 EQU   CVTXTNT2+128                                             01713000
CVTRV481 EQU   CVTXTNT2+124                                             01714000
CVTRV480 EQU   CVTXTNT2+120                                             01715000
CVTRV479 EQU   CVTXTNT2+118                                             01716000
CVTRV478 EQU   CVTXTNT2+117                                             01717000
CVTRV477 EQU   CVTXTNT2+116                                             01718000
CVTRV476 EQU   CVTXTNT2+115                                             01719000
CVTRV475 EQU   CVTXTNT2+114                                             01720000
CVTRV474 EQU   CVTRV466                                                 01721000
CVTRV473 EQU   CVTRV466                                                 01722000
CVTRV472 EQU   CVTRV466                                                 01723000
CVTRV471 EQU   CVTRV466                                                 01724000
CVTRV470 EQU   CVTRV466                                                 01725000
CVTRV469 EQU   CVTRV466                                                 01726000
CVTRV468 EQU   CVTRV466                                                 01727000
CVTRV467 EQU   CVTRV466                                                 01728000
CVTRV465 EQU   CVTRV457                                                 01729000
CVTRV464 EQU   CVTRV457                                                 01730000
CVTRV463 EQU   CVTRV457                                                 01731000
CVTRV462 EQU   CVTRV457                                                 01732000
CVTRV461 EQU   CVTRV457                                                 01733000
CVTRV460 EQU   CVTRV457                                                 01734000
CVTRV459 EQU   CVTRV457                                                 01735000
CVTRV458 EQU   CVTRV457                                                 01736000
CVTRV456 EQU   CVTXTNT2+108                                             01737000
CVTRV455 EQU   CVTXTNT2+104                                             01738000
CVTRV454 EQU   CVTXTNT2+100                                             01739000
CVTRV453 EQU   CVTXTNT2+96                                              01740000
CVTRV452 EQU   CVTXTNT2+94                                              01741000
CVTRV451 EQU   CVTXTNT2+92                                              01742000
CVTRV450 EQU   CVTXTNT2+90                                              01743000
CVTRV449 EQU   CVTXTNT2+88                                              01744000
CVTRV448 EQU   CVTXTNT2+87                                              01745000
CVTRV447 EQU   CVTXTNT2+86                                              01746000
CVTRV446 EQU   CVTRV438                                                 01747000
CVTRV445 EQU   CVTRV438                                                 01748000
CVTRV444 EQU   CVTRV438                                                 01749000
CVTRV443 EQU   CVTRV438                                                 01750000
CVTRV442 EQU   CVTRV438                                                 01751000
CVTRV441 EQU   CVTRV438                                                 01752000
CVTRV440 EQU   CVTRV438                                                 01753000
CVTRV439 EQU   CVTRV438                                                 01754000
CVTRV437 EQU   CVTRV429                                                 01755000
CVTRV436 EQU   CVTRV429                                                 01756000
CVTRV435 EQU   CVTRV429                                                 01757000
CVTRV434 EQU   CVTRV429                                                 01758000
CVTRV433 EQU   CVTRV429                                                 01759000
CVTRV432 EQU   CVTRV429                                                 01760000
CVTRV431 EQU   CVTRV429                                                 01761000
CVTRV430 EQU   CVTRV429                                                 01762000
CVTRV428 EQU   CVTXTNT2+80                                              01763000
CVTRV427 EQU   CVTXTNT2+76                                              01764000
CVTRV426 EQU   CVTXTNT2+72                                              01765000
CVTRV425 EQU   CVTXTNT2+68                                              01766000
CVTATACT EQU   CVTATCVT                                                 01767000
CVTRV423 EQU   CVTXTNT2+62                                              01768000
CVTRV422 EQU   CVTXTNT2+60                                              01769000
CVTRV421 EQU   CVTXTNT2+58                                              01770000
CVTRV420 EQU   CVTXTNT2+56                                              01771000
CVTRV419 EQU   CVTXTNT2+55                                              01772000
CVTRV418 EQU   CVTXTNT2+54                                              01773000
CVTRV417 EQU   CVTRV409                                                 01774000
CVTRV416 EQU   CVTRV409                                                 01775000
CVTRV415 EQU   CVTRV409                                                 01776000
CVTRV414 EQU   CVTRV409                                                 01777000
CVTRV413 EQU   CVTRV409                                                 01778000
CVTRV412 EQU   CVTRV409                                                 01779000
CVTRV411 EQU   CVTRV409                                                 01780000
CVTRV410 EQU   CVTRV409                                                 01781000
CVTRV408 EQU   CVTRV400                                                 01782000
CVTRV407 EQU   CVTRV400                                                 01783000
CVTRV406 EQU   CVTRV400                                                 01784000
CVTRV405 EQU   CVTRV400                                                 01785000
CVTRV404 EQU   CVTRV400                                                 01786000
CVTRV403 EQU   CVTRV400                                                 01787000
CVTRV402 EQU   CVTRV400                                                 01788000
CVTRV401 EQU   CVTRV400                                                 01789000
CVTICB   EQU   CVTXTNT2+48                                              01790000
CVTSKTA  EQU   CVTXTNT2+44                                              01791000
CVTSHSB  EQU   CVTSHS                                                   01792000
CVTRSV98 EQU   CVTXTNT2+36                                              01793000
CVTRSV97 EQU   CVTXTNT2+34                                              01794000
CVTRSV96 EQU   CVTXTNT2+32                                              01795000
CVTOLTEP EQU   CVTXTNT2+28                                              01796000
CVTQIDA  EQU   CVTQID+1                                                 01797000
CVTRSV95 EQU   CVTQID                                                   01798000
CVTRSV94 EQU   CVTXTNT2+20                                              01799000
CVTRSV93 EQU   CVTXTNT2+16                                              01800000
CVTRSV92 EQU   CVTXTNT2+12                                              01801000
CVTDEBVR EQU   CVTXTNT2+8                                               01802000
CVTRSV91 EQU   CVTXTNT2+6                                               01803000
CVTRSV9H EQU   CVTFLGBT                                                 01804000
CVTRSV9G EQU   CVTFLGBT                                                 01805000
CVTRSV9F EQU   CVTFLGBT                                                 01806000
CVTRSV9E EQU   CVTFLGBT                                                 01807000
CVTRSV9D EQU   CVTFLGBT                                                 01808000
CVTRSV9C EQU   CVTFLGBT                                                 01809000
CVTVME   EQU   CVTFLGBT                                                 01810000
CVTNPE   EQU   CVTFLGBT                                                 01811000
CVTNUCLS EQU   CVTXTNT2+4                                               01812000
CVTDSSVA EQU   CVTDSSV+1                                                01813000
CVTRSV89 EQU   CVTDSSV                                                  01814000
CVTRSV88 EQU   CVTXTNT1+8                                               01815000
CVTRSV87 EQU   CVTXTNT1+4                                               01816000
CVTFACHN EQU   CVTXTNT1                                                 01817000
CVTRV488 EQU   CVTMAP+412                                               01818000
CVTRV487 EQU   CVTMAP+408                                               01819000
CVTRV486 EQU   CVTMAP+404                                               01820000
CVTRV485 EQU   CVTMAP+400                                               01821000
CVTACTAP EQU   CVTMAP+396                                               01822000
CVTAUTH  EQU   CVTMAP+392                                               01823000
CVTATMCA EQU   CVTATMCT+1                                               01824000
CVTATMST EQU   CVTATMCT                                                 01825000
CVTRSV61 EQU   CVTMAP+384                                               01826000
CVTVOLT1 EQU   CVTVOLM1+1                                               01827000
CVTVOLI1 EQU   CVTVOLF1                                                 01828000
CVTSTOA  EQU   CVTMAP+376                                               01829000
CVTRSV58 EQU   CVTMAP+374                                               01830000
CVTRSV57 EQU   CVTMAP+372                                               01831000
CVTDDCE  EQU   CVTMAP+368                                               01832000
CVTPNWFR EQU   CVTMAP+364                                               01833000
CVTSMF   EQU   CVTMAP+360                                               01834000
CVTSULK  EQU   CVTMAP+358                                               01835000
CVTSLKO  EQU   CVTSYSK                                                  01836000
CVTSLKP  EQU   CVTSYSK                                                  01837000
CVTSLKQ  EQU   CVTSYSK                                                  01838000
CVTSLKR  EQU   CVTSYSK                                                  01839000
CVTRSV56 EQU   CVTSYSK                                                  01840000
CVTRSV55 EQU   CVTSYSK                                                  01841000
CVTRSV54 EQU   CVTSYSK                                                  01842000
CVTRSV53 EQU   CVTSYSK                                                  01843000
CVTRSV52 EQU   CVTA1F1                                                  01844000
CVTRSV51 EQU   CVTA1F1                                                  01845000
CVTRSV50 EQU   CVTA1F1                                                  01846000
CVTRSV49 EQU   CVTA1F1                                                  01847000
CVTRSV48 EQU   CVTA1F1                                                  01848000
CVTRSV47 EQU   CVTA1F1                                                  01849000
CVTSRSW  EQU   CVTA1F1                                                  01850000
CVTPFSW  EQU   CVTA1F1                                                  01851000
CVTPCVT  EQU   CVTMAP+352                                               01852000
CVTRSV46 EQU   CVTMAP+344                                               01853000
CVTRSV45 EQU   CVTMAP+340                                               01854000
CVTRSV44 EQU   CVTMAP+338                                               01855000
CVTRSV43 EQU   CVTMAP+336                                               01856000
CVTHJESA EQU   CVTHJES+1                                                01857000
CVTRSV42 EQU   CVTHJES                                                  01858000
CVTEXT2A EQU   CVTEXT2+1                                                01859000
CVTRSV41 EQU   CVTEXT2                                                  01860000
CVTAPFA  EQU   CVTAPF+1                                                 01861000
CVTRSV40 EQU   CVTAPF                                                   01862000
CVTRV518 EQU   CVTINTLA                                                 01863000
CVTRV517 EQU   CVTERPV                                                  01864000
CVTEORM  EQU   CVTMAP+312                                               01865000
CVTMCHPR EQU   CVTMAP+308                                               01866000
CVTTZ    EQU   CVTMAP+304                                               01867000
CVTJEPS  EQU   CVTMAP+300                                               01868000
CVTJESCT EQU   CVTMAP+296                                               01869000
CVTMODE  EQU   CVTMAP+292                                               01870000
CVTPTRV  EQU   CVTMAP+288                                               01871000
CVTREAL  EQU   CVTMAP+284                                               01872000
CVTRSV39 EQU   CVTMAP+280                                               01873000
CVTRSV38 EQU   CVTMAP+276                                               01874000
CVTDMSRA EQU   CVTDMSR+1                                                01875000
CVTRSV37 EQU   CVTDMSR                                                  01876000
CVTQMSGA EQU   CVTQMSG+1                                                01877000
CVTRSV36 EQU   CVTQMSG                                                  01878000
CVTAMFF  EQU   CVTMAP+264                                               01879000
CVTPURGA EQU   CVTPURG+1                                                01880000
CVTRSV35 EQU   CVTPURG                                                  01881000
CVTCBSP  EQU   CVTMAP+256                                               01882000
CVTATERA EQU   CVTATER+1                                                01883000
CVTSYST  EQU   CVTATER                                                  01884000
CVTVOLT2 EQU   CVTTAT                                                   01885000
CVTVOLI2 EQU   CVTVOLF2                                                 01886000
CVTAQAVB EQU   CVTAQAVT+1                                               01887000
CVTRSV34 EQU   CVTTCMFG                                                 01888000
CVTRSV33 EQU   CVTTCMFG                                                 01889000
CVTRSV32 EQU   CVTTCMFG                                                 01890000
CVTRSV31 EQU   CVTTCMFG                                                 01891000
CVTRSV30 EQU   CVTTCMFG                                                 01892000
CVTRSV29 EQU   CVTTCMFG                                                 01893000
CVTRSV28 EQU   CVTTCMFG                                                 01894000
CVTTCRDY EQU   CVTTCMFG                                                 01895000
CVTGTFA  EQU   CVTGTF+1                                                 01896000
CVTRSV27 EQU   CVTGTFST                                                 01897000
CVTRNIO  EQU   CVTGTFST                                                 01898000
CVTUSR   EQU   CVTGTFST                                                 01899000
CVTRV318 EQU   CVTFORM                                                  01900000
CVTRV317 EQU   CVTTMODE                                                 01901000
CVTRV316 EQU   CVTSTATE                                                 01902000
CVTRV315 EQU   CVTGTFS                                                  01903000
CVTGTFAV EQU   CVTGTFS                                                  01904000
CVT0SCR1 EQU   CVTMAP+232                                               01905000
CVTRV515 EQU   CVTMAP+228                                               01906000
CVTRMS   EQU   CVTMAP+224                                               01907000
CVTPATCH EQU   CVTMAP+220                                               01908000
CVTTSCE  EQU   CVTMAP+216                                               01909000
CVTLNKSC EQU   CVTMAP+214                                               01910000
CVTQABST EQU   CVTMAP+212                                               01911000
CVTMDLDS EQU   CVTMAP+208                                               01912000
CVTUSER  EQU   CVTMAP+204                                               01913000
CVTABEND EQU   CVTMAP+200                                               01914000
CVTSMCA  EQU   CVTMAP+196                                               01915000
CVTRSV18 EQU   CVTMAP+192                                               01916000
CVTQLPAQ EQU   CVTMAP+188                                               01917000
CVTQCDSR EQU   CVTMAP+184                                               01918000
CVTRSV17 EQU   CVTOPTB                                                  01919000
CVTRSV16 EQU   CVTOPTB                                                  01920000
CVTFP    EQU   CVTOPTB                                                  01921000
CVTAPTHR EQU   CVTOPTB                                                  01922000
CVTNLOG  EQU   CVTOPTB                                                  01923000
CVTTOD   EQU   CVTOPTB                                                  01924000
CVTCTIMS EQU   CVTOPTB                                                  01925000
CVTPROT  EQU   CVTOPTB                                                  01926000
CVTXPFP  EQU   CVTOPTA                                                  01927000
CVTASCII EQU   CVTOPTA                                                  01928000
CVTRSV13 EQU   CVTOPTA                                                  01929000
CVTRSV12 EQU   CVTOPTA                                                  01930000
CVTNIP   EQU   CVTOPTA                                                  01931000
CVTDDR   EQU   CVTOPTA                                                  01932000
CVTAPR   EQU   CVTOPTA                                                  01933000
CVTCCH   EQU   CVTOPTA                                                  01934000
CVTSNCTR EQU   CVTMAP+180                                               01935000
CVTQMWR  EQU   CVTMAP+176                                               01936000
CVTQOCR  EQU   CVTMAP+172                                               01937000
CVT1EF00 EQU   CVTMAP+168                                               01938000
CVTMZ00  EQU   CVTMAP+164                                               01939000
CVTHEAD  EQU   CVTMAP+160                                               01940000
CVTRSV11 EQU   CVTMAP+156                                               01941000
CVT0PT01 EQU   CVTMAP+152                                               01942000
CVTMSER  EQU   CVTMAP+148                                               01943000
CVTRV516 EQU   CVTIERLC                                                 01944000
CVTILCH  EQU   CVTMAP+140                                               01945000
CVT0DS   EQU   CVTMAP+136                                               01946000
CVTFBOSV EQU   CVTMAP+132                                               01947000
CVTNUCB  EQU   CVTMAP+128                                               01948000
CVTIXAVL EQU   CVTMAP+124                                               01949000
CVTIOQET EQU   CVTMAP+120                                               01950000
CVTDCBA  EQU   CVTMAP+117                                               01951000
CVTMVS2  EQU   CVTDCB                                                   01952000
CVT6DAT  EQU   CVTDCB                                                   01953000
CVT4MPS  EQU   CVTDCB                                                   01954000
CVTRSV09 EQU   CVTDCB                                                   01955000
CVT4MS1  EQU   CVTDCB                                                   01956000
CVT2SPS  EQU   CVTDCB                                                   01957000
CVT1SSS  EQU   CVTDCB                                                   01958000
CVTRSV08 EQU   CVTDCB                                                   01959000
CVTSTB   EQU   CVTMAP+112                                               01960000
CVTQTD00 EQU   CVTMAP+108                                               01961000
CVTQTE00 EQU   CVTMAP+104                                               01962000
CVTCUCB  EQU   CVTMAP+100                                               01963000
CVTSJQ   EQU   CVTMAP+96                                                01964000
CVTPBLDL EQU   CVTMAP+92                                                01965000
CVTTPC   EQU   CVTMAP+88                                                01966000
CVTSVDCB EQU   CVTMAP+84                                                01967000
CVTBRET  EQU   CVTMAP+82                                                01968000
CVTEXIT  EQU   CVTMAP+80                                                01969000
CVT0FN00 EQU   CVTMAP+76                                                01970000
CVTDARA  EQU   CVTDAR+1                                                 01971000
CVTRSV07 EQU   CVTFLGS1                                                 01972000
CVTRSV06 EQU   CVTFLGS1                                                 01973000
CVTRSV05 EQU   CVTFLGS1                                                 01974000
CVTRSV04 EQU   CVTFLGS1                                                 01975000
CVTRSV03 EQU   CVTFLGS1                                                 01976000
CVTRSV02 EQU   CVTFLGS1                                                 01977000
CVTRSV01 EQU   CVTFLGS1                                                 01978000
CVTDMPLK EQU   CVTFLGS1                                                 01979000
CVTXITP  EQU   CVTMAP+68                                                01980000
CVTZDTAB EQU   CVTMAP+64                                                01981000
CVTMSLT  EQU   CVTMAP+60                                                01982000
CVTDATE  EQU   CVTMAP+56                                                01983000
CVTBTERM EQU   CVTMAP+52                                                01984000
CVTSYSAD EQU   CVTMAP+48                                                01985000
CVTXTLER EQU   CVTMAP+44                                                01986000
CVTILK2  EQU   CVTMAP+40                                                01987000
CVTILK1  EQU   CVTMAP+36                                                01988000
CVTPRLTV EQU   CVTMAP+32                                                01989000
CVTPCNVT EQU   CVTMAP+28                                                01990000
CVT0VL00 EQU   CVTMAP+24                                                01991000
CVTXAPG  EQU   CVTMAP+20                                                01992000
CVTBUF   EQU   CVTMAP+16                                                01993000
CVTJOB   EQU   CVTMAP+12                                                01994000
CVTLINK  EQU   CVTMAP+8                                                 01995000
CVT0EF00 EQU   CVTMAP+4                                                 01996000
CVTTCBP  EQU   CVTMAP                                                   01997000
CVT      EQU   CVTMAP                                                   01998000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01999000
@RT00281 EQU   #DC00013                                                 02000000
@RC00284 EQU   @RC00283                                                 02001000
@ENDDATA EQU   *                                                        02002000
         END   ISTINCDP,(C'PLS1819',0603,75230)                         02003000
