SVTM     TITLE 'ISTNMCCR - CLUSTER REDRIVE OUTBOUND PROCESSOR          *00001000
                        '                                               00002000
ISTNMCCR CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTNMCCR  77.087'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
*/********************************************************************* 00013000
*/*   ISTNMCCR IS THE REDRIVE OUTBOUND PROCESSOR FOR THE CLUSTER      * 00014000
*/* CONTRO LAYER. IT DETERMINES IF THE CLUSTER CONTROL LAYER SHOULD   * 00015000
*/* ATTEMPT GENERAL POLLING OF THE CLUSTER CONTROL UNIT.              * 00016000
*/*    IF GENERAL POLLING IS TO BE RETRIED, IT DOES THE FOLLOWING:    * 00017000
*/* IF THE PABERLCK BIT IS SET, ISTNMCCR FORMATS A RESET ERROR LOCK   * 00018000
*/* LCCW IN THE 2ND LCCW SLOT OF THE NMLPB AND CHAINS A READ PERPET-  * 00019000
*/* UAL LCCW TO IT. OTHERWISE, IT JUST FORMATS A READ PERPETUAL LCCW  * 00020000
*/* IN THE 1ST LCCW SLOT.                                             * 00021000
*/********************************************************************* 00022000
*/* CODE FOR ISTNMCCR BEGINS HERE */                               0315 00023000
* DO;                                                              0315 00024000
*/***  CRRMAINT  PROCNM(ISTNMCCR)COMP(CS)FUNC(SUB)  ***/           0316 00025000
* DCL CMZK0005 PTR(31) REG(1);                                     0316 00026000
* RFY (CMZK0005) RSTD;                                             0317 00027000
*                                                                  0317 00028000
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTCSCRR)  */                  0318 00029000
*/* END OF ATBUILD */                                              0318 00030000
* /*** SET ENTERED BIT FOR THIS PROCEDURE ***/                     0318 00031000
*CMZK0005->RPHCRR->CRACRR->NNMCCR = '1'B;                          0318 00032000
         L     @11,RPHCRR(,CMZK0005)                               0318 00033000
         L     @11,CRACRR(,@11)                                    0318 00034000
         OI    NNMCCR(@11),B'00000001'                             0318 00035000
* /*** CLEAR AND SET CURRENT PROCEDURE BIT ***/                    0319 00036000
*CMZK0005->RPHCRR->CRACRR->CSCCRT = '0'B;                          0319 00037000
         MVI   CSCCRT+1(@11),X'00'                                 0319 00038000
         MVI   CSCCRT(@11),B'00000000'                             0319 00039000
*CMZK0005->RPHCRR->CRACRR->CNMCCR = '1'B;                          0320 00040000
         OI    CNMCCR(@11),B'00000001'                             0320 00041000
* END;                                                             0321 00042000
*RPHSVPTR=RPHPTR; /* SAVE PTR TO RPH */                            0322 00043000
         LR    RPHSVPTR,RPHPTR                                     0322 00044000
*FREEREG=CCRINC; /* INDICATE NMLPB SHOULD BE FREED */              0323 00045000
         LA    FREEREG,1                                           0323 00046000
*IF FMCLUSTR>CCRCLEAR THEN /* IS ST CTL COUNT > 0 ? */             0324 00047000
         L     @11,RPHMAJCB-1(,RPHSVPTR)                           0324 00048000
         LA    @11,0(,@11)                                         0324 00049000
         CLI   FMCLUSTR(@11),0                                     0324 00050000
         BNH   @RF00324                                            0324 00051000
*  IF NMIPSEQ=FMCIPSEQ THEN /* IF ID OF NMLPB MATCHES ID OF FMCB */     00052000
         L     @08,RPHWEA(,RPHSVPTR)                               0325 00053000
         CLC   NMIPSEQ(1,@08),FMCIPSEQ(@11)                        0325 00054000
         BNE   @RF00325                                            0325 00055000
*     DO;                                                          0326 00056000
*     FREEREG=FREEREG&&FREEREG; /* INDICATE SHOULD NOT FREE NMLPB */    00057000
         XR    FREEREG,FREEREG                                     0327 00058000
*     DOREDRIV: ;                                                  0328 00059000
DOREDRIV DS    0H                                                  0329 00060000
*     LCPFLAGS=LCPFLAGS&&LCPFLAGS; /* CLEAR LCPB FIELDS */         0329 00061000
         L     @11,RPHWEA(,RPHSVPTR)                               0329 00062000
         XC    LCPFLAGS(1,@11),LCPFLAGS(@11)                       0329 00063000
*     LCPMNRCD=LCPMNRCD&&LCPMNRCD;                                 0330 00064000
         XC    LCPMNRCD(1,@11),LCPMNRCD(@11)                       0330 00065000
*     LCPFDBA=LCPFDBA&&LCPFDBA;                                    0331 00066000
         L     @08,LCPFDBA(,@11)                                   0331 00067000
         LR    @00,@08                                             0331 00068000
         XR    @00,@08                                             0331 00069000
         ST    @00,LCPFDBA(,@11)                                   0331 00070000
*     LCPTLBAD=LCPTLBAD&&LCPTLBAD;                         /*@ZA18452*/ 00071000
         L     @08,LCPTLBAD(,@11)                                  0332 00072000
         LR    @00,@08                                             0332 00073000
         XR    @00,@08                                             0332 00074000
         ST    @00,LCPTLBAD(,@11)                                  0332 00075000
*     LCPFOSN=LCPFOSN&&LCPFOSN;                            /*@ZA18452*/ 00076000
         XC    LCPFOSN(2,@11),LCPFOSN(@11)                         0333 00077000
*     LCPFSNCH=LCPFSNCH&&LCPFSNCH;                         /*@ZA18452*/ 00078000
         LH    @08,LCPFSNCH(,@11)                                  0334 00079000
         N     @08,@CF03185                                        0334 00080000
         LR    @00,@08                                             0334 00081000
         XR    @00,@08                                             0334 00082000
         STH   @00,LCPFSNCH(,@11)                                  0334 00083000
*     LCPSTYPE=0;                                          /*@ZA18452*/ 00084000
         MVI   LCPSTYPE(@11),X'00'                                 0335 00085000
*     LCPFLG1=0;                                           /*@ZA18452*/ 00086000
         MVI   LCPFLG1(@11),X'00'                                  0336 00087000
*     LCPLCCW=LCPLCCW&&LCPLCCW;                                    0337 00088000
         XC    LCPLCCW(8,@11),LCPLCCW(@11)                         0337 00089000
*     NMLCW2=NMLCW2&&NMLCW2;                                       0338 00090000
         XC    NMLCW2(8,@11),NMLCW2(@11)                           0338 00091000
*     NMLCW3=NMLCW3&&NMLCW3;                                       0339 00092000
         XC    NMLCW3(8,@11),NMLCW3(@11)                           0339 00093000
*     IF PABERLCK=CCRON THEN /* CHECK IF PAB ERR LOCK ON */        0340 00094000
         L     @11,RPHMAJCB-1(,RPHSVPTR)                           0340 00095000
         TM    PABERLCK+96(@11),B'00000100'                        0340 00096000
         BNO   @RF00340                                            0340 00097000
*        DO;                                                       0341 00098000
*        ADDR(NMLCW2)->LCCWOP=LXEL; /* SET UP RESET ERROR LOCK */  0342 00099000
         L     @11,RPHWEA(,RPHSVPTR)                               0342 00100000
         LA    @08,56                                              0342 00101000
         ALR   @08,@11                                             0342 00102000
         MVI   LCCWOP(@08),X'0B'                                   0342 00103000
*                                   /* LCCW IN NMLPB */            0343 00104000
*        ADDR(NMLCW2)->LCCWCC=CCRON; /* SET CHAIN CMD BIT ON */    0343 00105000
         OI    LCCWCC(@08),B'01000000'                             0343 00106000
*        ADDR(NMLCW3)->LCCWRWOP=LRPEP; /* INDICATE READ PERPETUAL */    00107000
         LA    @08,64                                              0344 00108000
         ALR   @08,@11                                             0344 00109000
         NI    LCCWRWOP(@08),B'11011110'                           0344 00110000
         OI    LCCWRWOP(@08),B'00011110'                           0344 00111000
*                                    /* IN 3RD SLOT */             0345 00112000
*        ADDR(NMLCW3)->LCCWSI=CCRON; /* TURN ON SEESIONS INITIATE  0345 00113000
*                                       FLAG */                    0345 00114000
*        ADDR(NMLCW3)->LCCWSD=CCRON; /* TURN ON SESSIONS DISCONN */     00115000
         OI    LCCWSI(@08),B'11000000'                             0346 00116000
*        LCPNXLCW=ADDR(NMLCW2); /* PT NEXT LCCW AD TO SLOT 2 */    0347 00117000
         LA    @08,NMLCW2(,@11)                                    0347 00118000
         ST    @08,LCPNXLCW(,@11)                                  0347 00119000
*        RPHPTR=RPHSVPTR; /* PUT RPH @ IN REG 1 */                 0348 00120000
         LR    RPHPTR,RPHSVPTR                                     0348 00121000
*        /* TPQUE THE NMLPB TO TPIOS OUTBOUND PAB */               0349 00122000
*                                                                  0349 00123000
*/*  TPQUE (RPHWEA,FMCPAB3) RESET */                               0349 00124000
*                                                                  0349 00125000
*         DO;                                                      0349 00126000
*                                                                  0349 00127000
*         RFY ISTDYPAB;                                            0350 00128000
*         RFY ISTATCVT;                                            0351 00129000
*         DCL GPR00F FIXED(31) REG(00);                            0352 00130000
*         DCL GPR00P PTR(31)   REG(00);                            0353 00131000
*         DCL GPR01F FIXED(31) REG(01);                            0354 00132000
*         DCL GPR01P PTR(31)   REG(01);                            0355 00133000
*         DCL GPR02F FIXED(31) REG(02);                            0356 00134000
*         DCL GPR02P PTR(31)   REG(02);                            0357 00135000
*         DCL GPR15F FIXED(31) REG(15);                            0358 00136000
*         DCL GPR15P PTR(31)   REG(15);                            0359 00137000
*         RFY (GPR00P,GPR01P,GPR02P,GPR15P) RSTD;                  0360 00138000
*         DCL GPR09F FIXED(31) REG(09);                            0361 00139000
*         DCL GPR09P PTR(31)   REG(09);                            0362 00140000
*         DCL GPR14F FIXED(31) REG(14);                            0363 00141000
*         DCL GPR14P PTR(31)   REG(14);                            0364 00142000
*         GEN REFS(GPR01P) SETS(RPHWORK)                           0365 00143000
*        (STM   GPR14P,GPR09P,RPHWORK(GPR01P));                    0365 00144000
         STM   GPR14P,GPR09P,RPHWORK(GPR01P)                            00145000
*         GPR00P=ADDR(FMCPAB3);                                    0366 00146000
         L     @14,RPHMAJCB-1(,RPHSVPTR)                           0366 00147000
         LA    @14,0(,@14)                                         0366 00148000
         LA    GPR00P,FMCPAB3(,@14)                                0366 00149000
*         GPR02P=RPHWEA;                                           0367 00150000
         L     GPR02P,RPHWEA(,RPHSVPTR)                            0367 00151000
*         CALL ATCLCPTR->ATCAP34->ISTAPC34;                        0368 00152000
         L     @11,ATCLCPTR                                        0368 00153000
         L     @15,ATCAP34(,@11)                                   0368 00154000
         BALR  @14,@15                                             0368 00155000
*         GEN REFS(RPHWORK,GPR01P) NOSETS                          0369 00156000
*        (LM    GPR14P,GPR09P,RPHWORK(GPR01P));                    0369 00157000
         LM    GPR14P,GPR09P,RPHWORK(GPR01P)                            00158000
*         RFY (GPR00P,GPR01P,GPR02P,GPR15P) UNRSTD;                0370 00159000
*         END; /**** END OF TPQUE GENERATION ****/                 0371 00160000
*        END; /* END FOR PABERLCK =1 */                            0372 00161000
*      ELSE DO;                                                    0373 00162000
         B     @RC00340                                            0373 00163000
@RF00340 DS    0H                                                  0374 00164000
*           LCCWRWOP=LRPEP; /* INDICATE READ PERPETUAL IN SLOT 1 */     00165000
         L     @11,RPHWEA(,RPHSVPTR)                               0374 00166000
         LA    @08,48                                              0374 00167000
         ALR   @08,@11                                             0374 00168000
         NI    LCCWRWOP(@08),B'11011110'                           0374 00169000
         OI    LCCWRWOP(@08),B'00011110'                           0374 00170000
*           LCCWSI=CCRON; /* TURN ON SESSIONS INITIATE FLAG */     0375 00171000
*           LCCWSD=CCRON; /* TURN ON SESSIONS DISCONNECT */        0376 00172000
         OI    LCCWSI(@08),B'11000000'                             0376 00173000
*           LCPNXLCW=ADDR(LCPLCCW); /* NEXT LCCW ADD=SLOT 1 */     0377 00174000
         LA    @08,LCPLCCW(,@11)                                   0377 00175000
         ST    @08,LCPNXLCW(,@11)                                  0377 00176000
*           RPHPTR=RPHSVPTR; /* PUT RPH @ REG 1 */                 0378 00177000
         LR    RPHPTR,RPHSVPTR                                     0378 00178000
*           /* TPQUE NMLPB TO TPIOS OUTBOUND PAB */                0379 00179000
*                                                                  0379 00180000
*/*  TPQUE (RPHWEA,FMCPAB3) NORM */                                0379 00181000
*                                                                  0379 00182000
*            DO;                                                   0379 00183000
*            DCL GPR04F FIXED(31) REG(04);                         0380 00184000
*            DCL GPR04P PTR(31)   REG(04);                         0381 00185000
*            DCL GPR05F FIXED(31) REG(05);                         0382 00186000
*            DCL GPR05P PTR(31)   REG(05);                         0383 00187000
*            RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) RSTD;        0384 00188000
*            DCL GPR08F FIXED(31) REG(08);                         0385 00189000
*            DCL GPR08P PTR(31)   REG(08);                         0386 00190000
*            GEN REFS(GPR01P) SETS(RPHWORK)                        0387 00191000
*        (STM GPR02P,GPR08P,RPHWORK(GPR01P));                      0387 00192000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00193000
*            GPR00P=0;                                             0388 00194000
         SLR   GPR00P,GPR00P                                       0388 00195000
*            GPR15P=ADDR(FMCPAB3); /*HOLD PAB PTR*/                0389 00196000
         L     GPR15P,RPHMAJCB-1(,RPHSVPTR)                        0389 00197000
         LA    GPR15P,0(,GPR15P)                                   0389 00198000
         LA    GPR15P,FMCPAB3(,GPR15P)                             0389 00199000
*            GPR04P=RPHWEA; /*WORK ELE PTR*/                       0390 00200000
         L     GPR04P,RPHWEA(,RPHSVPTR)                            0390 00201000
*            GPR05P=GPR15P; /*PASS PAB PTR*/                       0391 00202000
         LR    GPR05P,GPR15P                                       0391 00203000
*            CALL ATCLCPTR->ATCAP37->ISTAPC37;                     0392 00204000
         L     @11,ATCLCPTR                                        0392 00205000
         L     @15,ATCAP37(,@11)                                   0392 00206000
         BALR  @14,@15                                             0392 00207000
*            GEN(NOPR  0)NOSETS NOREFS;                            0393 00208000
         NOPR  0                                                        00209000
*            RFY (GPR00P,GPR01P,GPR04P,GPR05P,GPR15P) UNRSTD;      0394 00210000
*            END; /**** END OF TPQUE GENERATION ****/              0395 00211000
*           END; /* END FOR PABERLCK = 0 */                        0396 00212000
*     END; /* END FOR LAST CMD ST CTL AND I.P. ID'S EQUAL */       0397 00213000
*   ELSE; /* ELSE FOR NMLPB NOT LAST I.P. ID IN FMCB */            0398 00214000
@RF00325 DS    0H                                                  0399 00215000
*ELSE; /* ELSE FOR LAST CTL CMD NOT ST CTL */                      0399 00216000
@RF00324 DS    0H                                                  0400 00217000
*IF FREEREG=CCRINC THEN /* CHECK IF NMLPB SHOULD BE FREED */       0400 00218000
@RC00324 C     FREEREG,@CF00060                                    0400 00219000
         BNE   @RF00400                                            0400 00220000
*   DO;                                                            0401 00221000
*   RPHPTR=RPHSVPTR; /* PUT @ RPH IN REG 1 */                      0402 00222000
         LR    RPHPTR,RPHSVPTR                                     0402 00223000
*    /*RELSTORE BUFADDR(RPHWEA)*/                                  0403 00224000
*     DO;                                                          0403 00225000
*/* ATBUILD (ISTATCVT,ISTRPH)  */                                  0404 00226000
*              /* DYNAMIC PAB 1K633 */                             0404 00227000
* /* 1K0997 JAN 20, 1973  MB   */                                  0404 00228000
* /* 1K1142 MAR 03, 1973  MB   */                                  0404 00229000
* DCL 1 ISTDYPAB BDY(DWORD) BASED, /* LEVEL 1 DECLARE 1K633 */     0404 00230000
*       2  DYPTYPE CHAR(1), /* CONTROL BLOCK TYPE CODE 1K633 */    0404 00231000
*       2  DYPLNGTH PTR(8), /* CONTROL BLOCK LENGTH (BYTES)  1K633 */   00232000
*       2 DYPFLGS CHAR(2),     /* FLAGS 1K633 */                   0404 00233000
*       2 DYPCHAIN PTR(31),    /* CHAIN POINTER 1K633 */           0404 00234000
*       2 DYPTSKID PTR(31),    /* TASKID OR PTR TO PSS TABLES 1K633 */  00235000
*       2  DYPRSV01 PTR(31),   /* RESERVED TO PRESERVE ALIGNMENT   0404 00236000
*                                                             1K0997 */ 00237000
*       2 DYPPAB CHAR(LENGTH(ISTPAB)) BDY(DWORD); /* LENGTH OF 1K0997   00238000
*                                                    PAB         */     00239000
*DCL DYTYP   BIT(8) CONSTANT ('11'X);   /* TYPE           1K1142 */     00240000
*/*  REVISIONS                                         015 11/16/75   * 00241000
*DCL ATCLCPTR PTR LOCATION(1032);      /* POINTER TO ATCVT            * 00242000
*DCL  1  ISTATCVT BDY(DWORD) BASED,                                0407 00243000
*        2  ATCCOM BDY(WORD),          /* SYSTEM INDEPENDENT FIELDS   * 00244000
*           3  ATCSTAT CHAR(4),        /* VTAM  STATUS INDICATORS     * 00245000
*              4  ATCSTAT1 CHAR(1),    /* VTAM  STATUS BYTE 1         * 00246000
*                 5  ATCSTART BIT(1),  /* VTAM  IS STARTING           * 00247000
*                 5  ATCACTIV BIT(1),  /* VTAM  IS ACTIVE             * 00248000
*                 5  ATCSNHLT BIT(1),  /* VTAM  SESSION HALT          * 00249000
*                 5  ATCQKHLT BIT(1),  /* VTAM  QUICK HALT            * 00250000
*                 5  ATCNETSL BIT(1),  /* NETSOL=YES SPECIFIED ON CMD * 00251000
*                 5  ATCINHLT BIT(1),  /* INTERNAL VTAM HALT QUICK    * 00252000
*                 5  ATCMDHLT BIT(1),  /* VTAM CMD PROC HALTED        * 00253000
*                 5 * BIT(1),          /* RESERVED                    * 00254000
*              4  ATCSTFLG BIT(8),     /* STORAGE MANAGEMENT FLAGS    * 00255000
*                 5  ATCHSDMF BIT(1),  /* SYSTEM SLOW DOWN FLAG       * 00256000
*              4  ATCPOFLG BIT(8),     /* PROGRAM OPERATOR            * 00257000
*                                      /* INTERFACE FLAGS             * 00258000
*                 5 ATCPOUNS BIT(1),   /* APPLICATION AUTHORIZED TO   * 00259000
*                                      /* RECEIVE UNSOLICITED MESSAGES* 00260000
*                                      /* 1 = YES                     * 00261000
*                 5 *        BIT(7),   /* RESERVED                    * 00262000
*              4  ATCSTAT4 CHAR(1),    /* VTAM  STATUS BYTE 4         * 00263000
*                 5  ATCPRTAT BIT(1),  /* 1 = TRACE PRINT ACTIVE,  0407 00264000
*                                         0 = NOT ACTIVE              * 00265000
*                 5  ATCTPRT BIT(1),   /* WHEN 1, TPRINT IN PROCESS   * 00266000
*                 5  ATCMTST BIT(1),   /* WHEN 1, MODIFY TEST IN   0407 00267000
*                                         PROCESS                     * 00268000
*                 5  ATCNCSD BIT(1),   /* NCS QUIESCED DURING HALT    * 00269000
*                 5  ATCVTTRC BIT(1),  /* VTAM TRACE, 1=ACTIVE        * 00270000
*                 5  ATCRSV04 BIT(3),  /* RESERVED                    * 00271000
*           3  ATCAPI PTR(31),         /* ADDR OF API ROUTINE         * 00272000
*           3  ATCDCFRR PTR(31),       /* POINTER TO FRR OF CONTROL     00273000
*                                         LAYER,INITIALIZED BY OPENDST* 00274000
*           3  ATCRDT PTR(31),         /* POINTER TO FIRST RDT        * 00275000
*           3  ATCSRT PTR(31),         /* POINTER TO SRT DIRECTORY    * 00276000
*           3  ATCASCHD PTR(31),       /* POINTER TO AP SCHEDULER     * 00277000
*           3  ATCECMOD CHAR(4),       /* ECB FOR MODIFY COMMAND PROC.* 00278000
*           3  ATCMODQ PTR(31),        /* POINTER FOR OUTPUT QUEUE    * 00279000
*                                      /* FOR MODIFY COMMAND          * 00280000
*           3  ATCECHLT CHAR(4),       /* ECB FOR HALT COMMAND        * 00281000
*           3  ATCHALTQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 00282000
*                                      /* FOR HALT COMMAND            * 00283000
*           3  ATCECVRY CHAR(4),       /* ECB FOR VARY COMMAND PROC.  * 00284000
*           3  ATCVARYQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 00285000
*                                      /* FOR VARY COMMAND            * 00286000
*           3  ATCECDSP CHAR(4),       /* ECB FOR DISPLAY COMMAND     * 00287000
*           3  ATCDSPLQ PTR(31),       /*  POINTER TO OUTPUT QUEUE    * 00288000
*                                      /* FOR DISPLAY COMMAND         * 00289000
*           3  ATCOCHA PTR(31),        /* POINTER TO OCT HEADER       * 00290000
*           3  ATCECSES CHAR(4),       /* ECB TO HALT SESSION MODE    * 00291000
*           3  ATCECVRQ CHAR(4),       /* ERP ECB FOR VARY REQ. INFO. * 00292000
*                                      /* REQUEST NOTIFICATION        * 00293000
*           3  ATCVPARM PTR(31),       /* ADDR OF VARY PARAMETERS     * 00294000
*           3  ATCECOPC CHAR(4),       /* ECB TOINDICATE OPERATOR     * 00295000
*                                      /* CONTROL PROCESSING COMPLETE * 00296000
*           3  ATCECNET CHAR(4),       /* ERP ECB FOR NETWORK         * 00297000
*                                      /* CONFIGURATION REQUEST       * 00298000
*           3  ATCECPRM PTR(31),       /* POINTER TO QAB FOR ERP'S    * 00299000
*                                      /* ECB PARAMETERS              * 00300000
*           3  ATCHLTMS PTR(31),       /* POINTER TO HALT COMMAND     * 00301000
*                                      /* OR HALT RETURN MESSAGE      * 00302000
*           3  ATCFSB PTR(31),         /* PTR TO FEEDBACK STATUS      * 00303000
*                                      /* BLOCK                       * 00304000
*           3  ATCFRSCH PTR(31),       /* POINTER TO FEEDBACK         * 00305000
*                                      /* ROUTINE SCHEDULER           * 00306000
*           3  ATCRDTH PTR(31),        /*  POINTER RDT HEADER         * 00307000
*           3  ATCACCTA PTR(31),       /* POINTER TO INSTALLATION     * 00308000
*                                      /* ACCOUNTING ROUTINE          * 00309000
*           3  ATCAUTHA PTR(31),       /* POINTER TO INSTALLATION     * 00310000
*                                      /* AUTHORISATION ROUTINE       * 00311000
*           3  ATCPTCHA PTR(31),       /* PTR TO VTAM PATCH AREA      * 00312000
*           3  ATCCONFT PTR(31),       /* POINTER TO VTAM             * 00313000
*                                      /* CONFIGURATION TABLE         * 00314000
*           3  ATCFDVT PTR(31),        /* PTR TO FIRST DVT FOR O/C    * 00315000
*           3  ATCFEPT PTR(31),        /* PTR TO FIRST EPT FOR O/C    * 00316000
*           3  ATCDVTPT PTR(31),       /* ADDR OF LOAD MOD FOR        * 00317000
*                                      /* TYPE=VTAM TRACING           * 00318000
*           3  ATCBPDA PTR(31),        /* PTR TO BUFFER POOL DIRECTORY* 00319000
*           3  ATCADD PTR(31),         /* POINTER TO ADD PROCEDURE    * 00320000
*           3  ATCREMOV PTR(31),       /* POINTER TO REMOVE PROCEDURE * 00321000
*           3  ATCIOTRC PTR(31),       /*  POINTER TO I/O TRACE       * 00322000
*                                      /* PROCEDURE                   * 00323000
*              4 ATCTHTRC PTR(31),     /* ADDR OF TH TRACE ROUTINE    * 00324000
*                5 ATCTPBUF PTR(31),   /* TPIOS BUFFER TRACE(ISTRARTP)* 00325000
*           3  ATCBFTRC PTR(31),       /* PTR TO BUFFER TRACE         * 00326000
*                                      /* PROCEDURE                   * 00327000
*           3  ATCFBRPH PTR(31),       /* ADDR OF FEEDBACK PROC RPH   * 00328000
*           3  ATCBLDLA PTR(31),       /* ADDR OF BLDL ROUTINE        * 00329000
*           3  ATCALOAD PTR(31),       /* ADDR OF ALOAD ROUTINE       * 00330000
*           3  ATCREADA PTR(31),       /* ADDR OF SOURCE READ ROUTINE * 00331000
*           3  ATCGTSTR PTR(31),       /* ADDR OF GETSTOR ROUTINE     * 00332000
*           3  ATCFRSTR PTR(31),       /* ADDR OF FREESTOR ROUTINE    * 00333000
*           3  ATCSTMA PTR(31),        /* ADDR OF SM INITIALIZATION   * 00334000
*                                      /* ROUTINE                     * 00335000
*           3  ATCACDA PTR(31),        /* ADDR OF FIRST ACDEB         * 00336000
*           3  ATCSMRQ PTR(31),        /* ADDR OF REQUEST STORAGE     * 00337000
*                                      /* ROUTINE                     * 00338000
*           3  ATCSMQU PTR(31),        /* ADDR OF QUEUE REQUEST RTNE    00339000
*                                         - DOS ONLY                  * 00340000
*           3  ATCSMRS PTR(31),        /* ADDR OF RELEASE STORAGE     * 00341000
*                                      /* ROUTINE                     * 00342000
*           3  ATCSMRC PTR(31),        /* ADDR OF RECOVER STORAGE     * 00343000
*                                      /* ROUTINE  - DOS ONLY         * 00344000
*           3  ATCSMBQ PTR(31),        /* PTR TO Q'ED REQ. SMS RTN.   * 00345000
*           3  ATCFIRA PTR(31),        /* ADDR OF FEEDBACK INITIATION * 00346000
*                                      /* RPH                         * 00347000
*           3  ATCSRTAD PTR(31),       /* PTR TO SRTADD ROUTINE       * 00348000
*           3  ATCSRTDF PTR(31),       /* PTR TO SRTDELE ROUTN        * 00349000
*           3  ATCDCC60 PTR(31),       /* PTR TO ISTDCC60 - CTL. LAYER  00350000
*                                         MOVE TO USER AREA           * 00351000
*           3  ATCDCC61 PTR(31),       /* PTR TO ISTDCC61 - CTL. LAYER  00352000
*                                         MOVE FIXED TO PAGABLE       * 00353000
*/*  BEGIN 'ANY' DVT                                                  * 00354000
*           3  ATCNERST PTR(31),       /* PTR TO ISTDCC00 - REQUEST-ST* 00355000
*           3  ATCNERCV PTR(31),       /* PTR TO ISTRCC21-RECEIVE OB  * 00356000
*           3  ATCNERNE PTR(31),      /* PTR TO ISTDCC25 - READ-ANY   * 00357000
*           3  ATCNERFN PTR(31),      /* PTR TO ISTDCC02 - REQUEST-FN * 00358000
*/*  END 'ANY' DVT                                                    * 00359000
*           3  ATCAPOST PTR(31),      /* PTR TO VTAM  POST ROUTINE    * 00360000
*           3  ATCVTMID CHAR(2),      /* HOST MAJOR NODE I.D.         * 00361000
*           3  ATCRSV11 CHAR(2),      /* RESERVED                     * 00362000
*           3 ATCRCC63 PTR(31),  /* HSKPANYQ POINTER                  * 00363000
*           3 ATCRCC26 PTR(31),  /* SEND RESPONSE POINTER             * 00364000
*           3 ATCRCC65 PTR(31),  /* SET RPL POINTER                   * 00365000
*           3  ATCNESAL PTR(31),      /* PTR TO ISTDCC24 - SOLICIT-ALL* 00366000
*           3  ATCNERAP PTR(31),       /* PTR TO ISTDCC85 - READ ANY    00367000
*                                         PURGE                       * 00368000
*           3 ATCACTRM FIXED(15),     /* COUNT OF ACTIVE TERMINALS    * 00369000
*           3 ATCCIDM BIT(16),        /* CID MASK                     * 00370000
*           3 ATCMSGSP BIT(8), /* RESERVED FOR MESAGE SURPRESSION     * 00371000
*         2 ATCMAXID PTR(8),   /* MAXIMUM NUMBER OF MAJOR NODES, 0 =    00372000
*                                 NUMBER OF ENTRIES IN THE MNT        * 00373000
*         2 ATCRSV16 CHAR(2),  /* NOT USED                            * 00374000
*         2 ATCMNT PTR(31),    /*PTR TO MAJOR NODE TABLE -SET BY SYS.   00375000
*                                DEF. REF. BY ISTSDCCB (CBDEF),    0407 00376000
*                                ISTSDCCI (CINDEXY)                   * 00377000
*         2 ATCCDADD PTR(31),  /*PTR TO CIDADD ROUTINE ISTSDCCA    0407 00378000
*                                 REF. BY CIDCTL MACRO                * 00379000
*         2 ATCCDDEL PTR(31),  /*PTR TO CIDDEL ROUTINE ISTSDCCD    0407 00380000
*                                 REF. BY CIDCTL MACRO                * 00381000
*         2 ATCCDFND PTR(31),  /*PTR TO CIDFND ROUTINE IATSDCCF    0407 00382000
*                                 REF. BY CIDCTL MACRO                * 00383000
*         2 ATCESC01 PTR(31),  /*PTR TO ESC01                         * 00384000
*         2 ATCESC02 PTR(31),  /*PTR TO ESC02                         * 00385000
*         2 ATCCSMR PTR(31),        /* PTR TO CONNECTION SERVICES     * 00386000
*                                   /*  MASTER ROUTINE                * 00387000
*           3 ATCCSMA PTR(31),      /* PTR TO CONNECTION SERVICES  0407 00388000
*                                      MASTER ROUTINE                 * 00389000
*         2 ATCOCRT PTR(31),        /* PTR TO OPEN/CLOSE ROUTINE      * 00390000
*         2 ATCUEP  PTR(31),        /* POINTER TO USER EXIT           * 00391000
*         2 ATCSHRTN CHAR(8),       /* NAME OF VTAM  SHARED RTN       * 00392000
*                                   /*  TO BE LOADED                  * 00393000
*         2 ATCSHRFG BIT(8),        /* ATTRIBUTE FLAGS                * 00394000
*           3 ATCLAST BIT(1),       /* INDICATE HTIS IS LAST MODULE   * 00395000
*         2 ATCXRANG CHAR(1),       /* NUMBER OT BITS IN X-VALUE   0407 00396000
*                                       PORTION   OF CID              * 00397000
*         2 ATCSAF   CHAR(2),       /* SUB AREA ADDRESS FIELD         * 00398000
*         2 ATCEPA PTR(31),         /* ENTRY POINT ADDR OF LOADED     * 00399000
*         2 ATCALERT PTR(31),       /* POINTER TO ALERT-ROUTINE    0407 00400000
*                                      ISTSDCAL                       * 00401000
*         2 ATCDVLOD PTR(31),       /* PTR TO ISTSDCOD                * 00402000
*         2 ATCTRCPT PTR(31),       /* POINTER TO TRACE PARM LIST     * 00403000
*         2 ATCDVT   PTR(31),       /* POINTER TO FIRST DVT ON CHAIN  * 00404000
*         2 ATCEPT   PTR(31),       /* POINTER TO FIRST EPT ON CHAIN  * 00405000
*         2 ATCMSGP PTR(31),        /* POINTER TO TPMSG PROCESSOR     * 00406000
*         2 ATCMSGM PTR(31),        /* POINTER TO TPMSG - MESSAGE  0407 00407000
*                                      CSECT                          * 00408000
*         2 ATCTRPAB  PTR(31),      /* ADDRESS OF TRACE WRITER PAB    * 00409000
*         2 ATCVTLOD PTR(31),       /* ADDR OF VTAM LOAD LIST         * 00410000
*         2 ATCECPRT CHAR(4),       /* ECB FOR TRACE FILE PRINT       * 00411000
*         2 ATCZDVTB PTR(31),       /* ADDRESS OF ISTZCFBI            * 00412000
*         2 ATCECTLP CHAR(4),       /* TOLTEP ECB                     * 00413000
*         2 ATCRVCHS CHAR(8),       /* RESERVED                       * 00414000
*         2 ATCCRME  PTR(31),       /* VARY PSS CONTROL MECHANISM     * 00415000
*         2 ATCHPGM,                /* BUFFER INFORMATION            */ 00416000
*           3 ATCHBFNO FIXED(15),   /* NUMBER OF BUFFS FOR CHANNEL   */ 00417000
*           3 ATCHBSIZ FIXED(15),   /* BUFFER SIZE IN BYTES          */ 00418000
*         2 ATCDEBCH PTR(31),       /* CLOSE DEB CHAIN PTR           */ 00419000
*         2 ATCTODVT PTR(31),       /* THE TOLTEP DVT PTR POINTED  0407 00420000
*                                      TO BY 3RD WORD OF PAB         */ 00421000
*         2 ATCADEL  PTR(31),       /* A DELETE ROUTINE ADDRESS      */ 00422000
*         2 ATCCDPTR PTR(31),       /* PTR TO ISTOCCCD - DOS ONLY    */ 00423000
*         2 ATCLDNCS PTR(31),       /* PTR TO NCSPL FOR LOAD/DUMP    */ 00424000
*         2 ATCLDECB BIT(32),       /* ECB FOR LOAD/DUMP SUBTASK     */ 00425000
*         2 ATCAPCR5 PTR(31),       /* POINTER TO ISTINCR5           */ 00426000
*         2 ATCRSV69 PTR(31),       /* RESERVED TO SYNCH WITH DOS    */ 00427000
*         2 ATCNODEL CHAR(8),       /* VSAM DATA SET NAME            */ 00428000
*         2 ATCNODDS PTR(31),       /* POINTER TO RPL                */ 00429000
*         2 ATCONFIG CHAR(8),       /* START VTAM CONFIG = PARAMETER */ 00430000
*         2 ATCRSV99 CHAR(4),       /* RESERVED FOR LATER POINTERS   */ 00431000
*         2 ATCAP33 PTR(31),        /* PTR TO ISTAPC33               */ 00432000
*         2 ATCAP35 PTR(31),        /* PTR TO ISTAPC35               */ 00433000
*         2 ATCAP36 PTR(31),        /* PTR TO ISTAPC36               */ 00434000
*         2 ATCDVTLK CHAR(LENGTH(ISTLOK)), /* LOCK WORD FOR DVT LOCK */ 00435000
*         2 ATCCDFIN PTR(31),       /* POINTER TO ISTSDCRR           */ 00436000
*         2 ATCCDFDN PTR(31),       /* POINTER TO ISTSDCCN           */ 00437000
*         2 ATCVOCLK CHAR(LENGTH(ISTLOK)), /* VOCLOCK LOCK           */ 00438000
*         2 ATCRDTLK CHAR(LENGTH(ISTLOK)), /* RDTLOCK LOCK           */ 00439000
*         2 ATCRSV97 PTR(31),              /* DWORD ALIGNMENT        */ 00440000
*         2 ATCVPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR VARY 00441000
*                                           UNDER PSS CONTROL        */ 00442000
*         2 ATCPGPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* ERP PAB FOR  00443000
*                                      PURGE                         */ 00444000
*         2 ATCDLRPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* DUMP LOAD &  00445000
*                                           RESTART PAB              */ 00446000
*         2 ATCCCLAD PTR(31),       /* ADDRESS OF VARY ERP (ISTINCCL)*/ 00447000
*         2 ATCCDLAD PTR(31),       /* ADDRESS OF VARY DUMP,LD RSTRT    00448000
*                                      (ISTINCDL)                    */ 00449000
*         2 ATCOCCOB PTR(31),       /* ADDRESS ISTOCCOB              */ 00450000
*         2 ATCOCCCB PTR(31),       /* ADDRESS ISTOCCCB              */ 00451000
*         2 ATCTIPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0407 00452000
*                                           FOR ISTOLTP              */ 00453000
*         2 ATCTCIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0407 00454000
*                                           FOR TOLTEP CLIP          */ 00455000
*         2 ATCVTIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0407 00456000
*                                           FOR TOLTEP-VTAM INTERFACE*/ 00457000
*         2 ATCTCLOM PTR(31),      /* ADDR TOLTEP CLOP PROC          */ 00458000
*         2 ATCTCLIM PTR(31),      /* ADDR TOLTEP CLIP PROC          */ 00459000
*         2 ATCVTINM PTR(31),      /* ADDR TOLTEP-VTAM INTF PROC     */ 00460000
*         2 ATCTACB  PTR(31),      /* TOLTEP ACB                     */ 00461000
*         2 ATCRSV10 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* RESERVED  */ 00462000
*         2 ATCPTR00 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB     */ 00463000
*         2 ATCCFEAD PTR(31),          /* ADDR OF ISTINCFE           */ 00464000
*         2 ATCVLCNT CHAR(4) BDY(HWORD), /* VARY DEVICE ONLINE COUNTS*/ 00465000
*           3 ATCRNCNT PTR(16),        /* 370X COUNT                 */ 00466000
*           3 ATCLCLCT PTR(16),        /* 3270 COUNT                 */ 00467000
*         2 ATCS49XI PTR(31),          /* ADDRESS OF ISTPICXI        */ 00468000
*         2 ATCS49XL PTR(31),          /* ADDRESS OF ISTPICXL        */ 00469000
*         2 ATCPODVT PTR(31),          /* PTR TO PROGRAM OPERATOR DVT*/ 00470000
*         2 ATCRNO,                                                0407 00471000
*           3 *        CHAR(1),                                    0407 00472000
*           3 ATCPOIA  PTR(24),        /* PTR TO PROGRAM OPERATOR    */ 00473000
*                                      /* INTERFACE AREA             */ 00474000
*         2 ATCSOPD CHAR(8) BDY(WORD), /* SESSION CONTROL            */ 00475000
*           3 ATCSEC01 PTR(31),        /* OUTBOUND PROCESSING        */ 00476000
*           3 ATCSEC10 PTR(31),        /* DVT                        */ 00477000
*         2 ATCSIPD CHAR(12) BDY(WORD),/* SESSION CONTROL            */ 00478000
*           3 ATCSEC21 PTR(31),        /* INBOUND PROCESSING         */ 00479000
*           3 ATCSEC30 PTR(31),        /* FEEDBACK                   */ 00480000
*           3 ATCSEC40 PTR(31),        /* DVT                        */ 00481000
*         2 ATCSECST CHAR(4) BDY(WORD),/* SESSION CONTROLSESS TERM   */ 00482000
*           3 ATCSEC51 PTR(31),        /* RECOVERY DVT               */ 00483000
*         2 ATCNMCTR FIXED(15),        /* NAME COUNTER               */ 00484000
*         2 ATCSTAT2 BIT(8),           /* TRACE FLAGS                */ 00485000
*           3 ATCTRAPI BIT(1),         /* API                        */ 00486000
*           3 ATCTRESC BIT(1),         /* ESC                        */ 00487000
*           3 ATCTRPSS BIT(1),         /* PSS                        */ 00488000
*           3 ATCTRLOK BIT(1),         /* LOCKS                      */ 00489000
*           3 ATCTRSMS BIT(1),         /* SMS                        */ 00490000
*           3 *        BIT(3),         /* RESERVED                   */ 00491000
*         2 *        BIT(8),           /* RESERVED                   */ 00492000
*         2 ATCSRTAB PTR(31),          /* SEARCH LOGON MODE TABLE    */ 00493000
*                                      /* RTN ADDRESS (ISTINCSH)     */ 00494000
*         2 ATCUSSPT PTR(31),          /* DEFAULT USS DEFINITION     */ 00495000
*                                      /* TABLE ADDRESS (ISTINCDT)   */ 00496000
*         2 ATCMODTB PTR(31),          /* DEFAULT SYSTEM LOGON MODE  */ 00497000
*                                      /* TABLE ADDRESS (ISTINCLM)   */ 00498000
*         2 ATCINCW3 PTR(31),          /* ADDRESS OF ISTINCW3        */ 00499000
*         2 ATCIOECB PTR(31),          /* ECB USED BY IOS -          */ 00500000
*                                      /* POINTED TO BY IOBECBPT     */ 00501000
* 2 ATCVDPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0407 00502000
*                                    /* SSCP COMMAND PROCESSING PAB  */ 00503000
* 2 ATCVFPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0407 00504000
*                                    /* SSCP FRONT END PAB           */ 00505000
* 2 ATCVDLOK CHAR(LENGTH(ISTLOK)),   /* SSCP SERIALIZATION LOCK      */ 00506000
*/* END OF COMMON AREA                                               */ 00507000
*/* VS1/VS2 COMMON CODE.                                             */ 00508000
*        2  ATCVTBAM CHAR(4),                                      0407 00509000
*           3  *     CHAR(3),          /* RESERVED                    * 00510000
*           3  *     CHAR(1),          /* FLAGS                       * 00511000
*              4 ATCVTMAB BIT(1) ABNL, /* ABEND IN VTAM JOBSTEP       * 00512000
*              4 *        BIT(7),      /* RESERVED                    * 00513000
*        2  ATCAOSM BDY(DWORD),                                    0407 00514000
*/*                                                                   * 00515000
*           3  ATCSRBRT PTR(31),       /* POINTER TO ROUTINE UNDER    * 00516000
*                                      /* SRB CONTROL                 * 00517000
*           3  ATCGSRBQ PTR(31),       /* READY QUEUE FOR GLOBAL SRB'S* 00518000
*              4  ATCGSRBG BIT(8),     /* READY QUEUE GATE BYTE       * 00519000
*                 5  ATCGSRBF BIT(1),  /* READY QUEUE GATE BIT        * 00520000
*           3  ATCPRPH PTR(31),        /* PTR TO PREALLOCATED RPH     * 00521000
*           3  ATCCMTCB PTR(31),       /* PTR TO COMMUNICATIONS TASK  * 00522000
*                                      /* TCB                         * 00523000
*           3  ATCAP11 PTR(31),        /* PTR TO ISTAPC11             * 00524000
*           3  ATCAP12 PTR(31),        /* PTR TO ISTAPC12             * 00525000
*           3  ATCAP31 PTR(31),        /* PTR TO ISTAPC31             * 00526000
*           3  ATCAP32 PTR(31),        /* PTR TO ISTAPC32             * 00527000
*           3  ATCAP34 PTR(31),        /* PTR TO ISTAPC34             * 00528000
*           3  ATCAP52 PTR(31),        /* PTR TO ISTAPC52             * 00529000
*           3  ATCAP53 PTR(31),        /* PTR TO ISTAPC53             * 00530000
*           3  ATCAP54 PTR(31),        /* PTR TO ISTAPC54             * 00531000
*           3  ATCAP57 PTR(31),        /* PTR TO ISTAPC57             * 00532000
*           3  ATCAP58 PTR(31),        /* PTR TO ISTAPC58             * 00533000
*           3  ATCAP61 PTR(31),        /* PTR TO ISTAPC61             * 00534000
*           3  ATCAP63 PTR(31),        /* PTR TO ISTAPC63             * 00535000
*           3  ATCAP64 PTR(31),        /* PTR TO ISTAPC64             * 00536000
*           3  ATCZFSVT PTR(31),       /* TPIOS FIXED SRVICES VCTR TAB* 00537000
*           3  ATCZPSVT PTR(31),       /* TPIOS PAGBL SRVCES VCTR TABL* 00538000
*           3  ATCICNCB PTR(31),       /* HEAD OF ICNCB QUEUE         * 00539000
*           3  ATCZDVT1 PTR(31),       /* TPIOS SLODWN RECOVRY PRCSR  * 00540000
*           3  ATCZDVT3 PTR(31),       /* 370X FEEDBACK STAT CNTRL RTR* 00541000
*           3  ATCZDVT4 PTR(31),       /* OPERATOR MESSAGE SCHEDULER  * 00542000
*           3  ATCZDVT6 PTR(31),       /* DIALOGUE SCHEDULER (INBOUND)* 00543000
*           3  ATCAP65 PTR(31),        /* PTR TO ISTAPC65            */ 00544000
*           3  ATCICAPP CHAR(20) BDY(WORD), /* 3705 APPENDAGE VECTOR  * 00545000
*              4  ATCCDRPH PTR(31),    /* ADDR CLOSE DEB RPH       0407 00546000
*                                         (DUMMY EOA APP.)           */ 00547000
*              4  ATCZSIOA PTR(31),    /* ADDR 3705 SIO APPENDAGE    */ 00548000
*              4  ATCCDTCB PTR(31),    /* VTAM TCB (DUMMY PCI APP.)  */ 00549000
*              4  ATCZCEA PTR(31),     /* ADDR 3705 CHANNEL END    0407 00550000
*                                         APPENDAGE                  */ 00551000
*              4  ATCZAEA PTR(31),     /* ADDR 3705 CHANNEL END    0407 00552000
*                                         APPENDAGE                  */ 00553000
*           3  ATCLDAPP CHAR(20) BDY(WORD), /* LOCAL 3270 APPENDAGE     00554000
*                                         VECTOR                     */ 00555000
*              4  ATCCDTID PTR(31),    /* TASK ID OF VTAM          0407 00556000
*                                         (DUMP EOE)                 */ 00557000
*              4  ATCSMFRR PTR(31),    /* ADDR OF SMS FRR          0407 00558000
*                                         (DUMMY SIOA)               */ 00559000
*              4  ATCRSV17 PTR(31),    /* RESERVED FOR ALIGNMENT     */ 00560000
*              4  ATCZLCEA PTR(31),    /* ADDR 3270 CHANNEL END    0407 00561000
*                                         APPENDAGE                  */ 00562000
*              4  ATCZLAEA PTR(31),    /* ADDR 3270 CHANNEL END    0407 00563000
*                                         APPENDAGE                  */ 00564000
*           3  ATCDAPVT CHAR(24) BDY(WORD),  /* DUMMY APPENDAGE    0407 00565000
*                                         VECTOR TABLE FOR LOAD/DVMMY*/ 00566000
*              4  ATCDEOEA PTR(31),    /* ADDRESS OF DUMMY END     0407 00567000
*                                         OF EXTENT APPENDAGE        */ 00568000
*              4  ATCDSIOA PTR(31),    /* ADDRESS OF DUMMY END     0407 00569000
*                                         OF SIO APPENDAGE           */ 00570000
*              4  ATCDPCIA PTR(31),    /* ADDRESS OF DUMMY PCI     0407 00571000
*                                         APPENDAGE                  */ 00572000
*              4  ATCDCEA PTR(31),     /* ADDRESS OF CHANNEL END   0407 00573000
*                                         APPENDAGE                  */ 00574000
*              4  ATCDXCEA PTR(31),    /* ADDRESS OF ABNORMAL      0407 00575000
*                                         END APPENDAGE              */ 00576000
*              4  ATCDAPDG CHAR(2),    /* DUMMY APPENDAGE            */ 00577000
*              4  ATCRSV56 CHAR(2),    /* RESERVED                   */ 00578000
*           3  ATCZDVT7 PTR(31),       /* ADDR OF RESET CLEANUP    0407 00579000
*                                         (PHASE 1)                   * 00580000
*           3  ATCZDVT8 PTR(31),       /* 3270 LOCAL TEST AND CTL  0407 00581000
*                                         FEEDBACK ROUTER            */ 00582000
*           3  ATCZDVT9 PTR(31),       /* ADDRESS OF ISTZDFKA        */ 00583000
*           3  ATCZDVTA PTR(31),       /* ADDRESS OF ISTZCFIA        */ 00584000
*           3  ATCZDVTX PTR(31),       /* ADDRESS OF TRUNK LINE    0407 00585000
*                                         DEACTIVATE ROUTINE         */ 00586000
*           3  ATCZLPVT PTR(31),       /* ADDRESS OF ISTZPSVA        */ 00587000
*           3  ATCZLFVT PTR(31),       /* TPIOS 3270 LOCAL FIXED   0407 00588000
*                                         SERVICES VECTOR TABLE      */ 00589000
*           3  ATCZPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR   00590000
*                                         TEST AND CTL FEEDBACK ROUTER* 00591000
*           3  ATCZPAB2 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* 370X 0407 00592000
*                                         STATUS AND FEEDBACK ROUTER    00593000
*                                         DYNAMIC PAB                */ 00594000
*           3  ATCAP51  PTR(31),       /* PTR TO ISTAPC51            */ 00595000
*           3  ATCZDFJ0 PTR(31),       /* ADDR OF ISTZDFJ0           */ 00596000
*           3  ATCAP37  PTR(31),       /* PTR TO ISTAPC37            */ 00597000
*           3  ATCAP38  PTR(31),       /* PTR TO ISTAPC38            */ 00598000
*           3  ATCDMAPP PTR(31),       /* DUMMY APPENDAGE ROUTINE    */ 00599000
*                                      /* FOR ABEND                  */ 00600000
*           3  ATCRPT12 PTR(31),       /* RESERVED                   */ 00601000
*        3  ATCCRA   CHAR(8) BDY(DWORD), /* AVAILABLE CRA             * 00602000
*           4 ATCCRAQ  PTR(31),          /* QUEUE OF AVAILABLE CRAS   * 00603000
*           4 ATCCRACN FIXED(31),        /* COUNTS                    * 00604000
*             5 ATCCRARC FIXED(16),      /* ENQUEUE COUNT TO ALLOW    * 00605000
*                                        /* MULTIPLE SIMUALTANIOUS    * 00606000
*                                        /* ENQUEUES AND DEQUEUES     * 00607000
*             5 ATCCRAAC FIXED(16),      /* COUNT OF CRAS ON AVAIL Q  * 00608000
*        3  ATCSRB   CHAR(8) BDY(DWORD), /* AVAILABLE SRBS            * 00609000
*             4 ATCSRBQ  PTR(31),        /* QUE OF AVAILABLE SRBS     * 00610000
*             4 ATCSRBCN FIXED(31),      /* COUNTS                    * 00611000
*               5 ATCSRBRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    * 00612000
*                                        /* MULTIPLE SIMUALTANIOUS    * 00613000
*                                        /* ENQUEUES AND DEQUEUES     * 00614000
*               5 ATCSRBAC FIXED(16),    /* COUNT OF SRBS ON AVAIL Q  * 00615000
*        3  ATCCRPL  CHAR(8) BDY(DWORD), /* AVAILABLE CRPLS           * 00616000
*             4 ATCCRPLQ PTR(31),        /* QUE OF AVAILABLE CRPLS    * 00617000
*             4 ATCRPLCN FIXED(31),      /* COUNTS                    * 00618000
*               5 ATCRPLRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    * 00619000
*                                        /* MULTIPLE SIMUALTANIOUS    * 00620000
*                                        /* ENQUEUES AND DEQUEUES     * 00621000
*               5 ATCRPLAC FIXED(16),    /* COUNT OF CRPLS ON AVAIL Q * 00622000
*           3  ATCRPT19 PTR(31),       /* RESERVED                   */ 00623000
*           3  ATCRPT20 PTR(31),       /* RESERVED                   */ 00624000
*           3  ATCRPT21 PTR(31),       /* RESERVED                   */ 00625000
*           3  ATCRPT22 PTR(31),       /* RESERVED                   */ 00626000
*           3  ATCRPT23 PTR(31),       /* RESERVED                   */ 00627000
*           3  ATCRPT24 PTR(31),       /* RESERVED                   */ 00628000
*           3  ATCRPT25 PTR(31),       /* RESERVED                   */ 00629000
*           3  ATCRPT26 PTR(31),       /* RESERVED                   */ 00630000
*           3  ATCRPT27 PTR(31),       /* RESERVED                   */ 00631000
*           3  ATCRPT28 PTR(31),       /* RESERVED                   */ 00632000
*           3  ATCRPT29 PTR(31),       /* RESERVED                   */ 00633000
*           3  ATCRPT30 PTR(31),       /* RESERVED                   */ 00634000
*           3  ATCRPT31 PTR(31),       /* RESERVED                   */ 00635000
*           3  ATCRPT32 PTR(31),       /* RESERVED                   */ 00636000
*           3  ATCRPT33 PTR(31),       /* RESERVED                   */ 00637000
*           3  ATCRPT34 PTR(31),       /* RESERVED                   */ 00638000
*           3  ATCRPT35 PTR(31),       /* RESERVED                   */ 00639000
*           3  ATCRPT36 PTR(31),       /* RESERVED                   */ 00640000
*           3  ATCRPT37 PTR(31),       /* RESERVED                   */ 00641000
*           3  ATCRPT38 PTR(31),       /* RESERVED                   */ 00642000
*           3  ATCRPT39 PTR(31),       /* RESERVED                   */ 00643000
*           3  ATCRPT40 PTR(31),       /* RESERVED                   */ 00644000
*/* END OF VS1/VS2 COMMON CODE.                                      */ 00645000
*/* START OF VS2 UNIQUE CODE.                                        */ 00646000
*           3  ATCVTFLG BIT(32),                                   0407 00647000
*              4 ATCVTACT BIT(1),      /* VTT ACTIVE                 */ 00648000
*              4 *        BIT(31),     /* RESERVED                   */ 00649000
*           3  ATCHLTCB PTR(31),       /* ECB FOR HALTING VTAM       */ 00650000
*           3  ATCATA10 PTR(31),       /* PTR TO ISTATM10            */ 00651000
*           3  ATCZLAAB PTR(31),       /* PTR TO ISTZLFAB            */ 00652000
*           3  ATCCACXA PTR(31),       /* PTR TO ISTCFCXA            */ 00653000
*           3  ATCSMARA PTR(31),       /* PTR TO ISTORFRA            */ 00654000
*           3  ATCSMAID PTR(31),       /* PTR TO ISTORFID            */ 00655000
*           3  ATCTPWQA PTR(31),       /* WAIT Q ANCHOR FOR TPIOS    */ 00656000
*           3  ATCSMAPR PTR(31),       /* PTR TO ISTORFPR            */ 00657000
*           3  ATCSMABF PTR(31),       /* PTR TO ISTORFBF            */ 00658000
*           3  ATCPSTA  PTR(31),       /* ACTIVE PST QUEUE           */ 00659000
*           3  ATCAPBE  PTR(31),       /* POINTER TO ISTAICBE        */ 00660000
*           3  ATCTRMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0407 00661000
*                                      /* PAB FOR VTAM TERM TASK     */ 00662000
*           3  ATCTPSPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0407 00663000
*                                      /* PAB FOR TPIOS              */ 00664000
*           3  ATCAP23  PTR(31),       /* PTR TO ISTAPC23            */ 00665000
*           3  ATCAPC25 PTR(31),       /* PTR TO ISTAPC25            */ 00666000
*           3  ATCAP41  PTR(31),       /* PTR TO ISTAPC41            */ 00667000
*           3  ATCRCFY0 PTR(31),       /* PTR TO ISTRCFY0            */ 00668000
*           3  ATCAP55  PTR(31),       /* PTR TO ISTAPC55            */ 00669000
*           3  ATCAP56  PTR(31),       /* PTR TO ISTAPC56            */ 00670000
*           3  ATCAPC59 PTR(31),       /* PTR TO ISTAPC59            */ 00671000
*           3  ATCAP62  PTR(31),       /* PTR TO ISTAPC62            */ 00672000
*           3  ATCAP66  PTR(31),       /* PTR TO ISTAPC66            */ 00673000
*           3  ATCAP69  PTR(31),       /* PTR TO ISTAPM69            */ 00674000
*           3  ATCAP82  PTR(31),       /* PTR TO ISTAPC82            */ 00675000
*           3  ATCAP83  PTR(31),       /* PTR TO ISTAPC83            */ 00676000
*           3  ATCAP84  PTR(31),       /* PTR TO ISTAPC84            */ 00677000
*           3  ATCAP85  PTR(31),       /* PTR TO ISTAPC85            */ 00678000
*           3  ATCAP86  PTR(31),       /* PTR TO ISTAPC86            */ 00679000
*           3  ATCASCB  PTR(31),       /* PTR TO VTAM ASCB           */ 00680000
*           3  ATCMPLTA  PTR(31),      /* PTR TO MPST LIST TABLE     */ 00681000
*           3  ATCZR01  PTR(31),       /* PTR TO ISTZRM01            */ 00682000
*           3  ATCAICTN PTR(31),       /* PTR TO ISTAICTN            */ 00683000
*           3  ATCTPCP0 PTR(31),       /* PTR TO ISTZFSAV            */ 00684000
*           3  ATCTPCP1 PTR(31),       /* PTR TO ISTZ19SV            */ 00685000
*           3  ATCZFLAG BIT(8),        /* FLAG BYTE                  */ 00686000
*              4 ATCZF001 BIT(1),      /* MDR RECORDING SUSPENDED    */ 00687000
*              4 ATCRSV66 BIT(7),      /* RESERVED                   */ 00688000
*           3  ATCRSV75 BIT(8),        /* RESERVED                   */ 00689000
*           3  ATCSRBCT FIXED(16),     /* COUNT OF PREALLOCATED SRB'S*/ 00690000
*           3  ATCCRACT FIXED(16),     /* COUNT OF PREALLOCATED CRA'S*/ 00691000
*           3  ATCRPLCT FIXED(16),     /* COUNT OF PREALLOCATED CRPL */ 00692000
*           3  ATCRSV88 PTR(31),       /* RESERVED                   */ 00693000
*           3  ATCTPMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /*TP MSG PAB 00694000
*                                                         FOR VS2    */ 00695000
*           3  ATCTPMMI PTR(31),        /* PTR TO ISTCFMMI - MSG ISSUER 00696000
*                                          FOR SRB MODE ROUTINES     */ 00697000
*           3  ATCVIOPM PTR(31),       /* PTR TO ISTVIOPM            */ 00698000
*           3  ATCPOPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0407 00699000
*                   /* POPAB FOR REPLY PROCESSING, POI TERMINATION,  */ 00700000
*                   /* AND VTAM MESSAGE PROCESSOR                    */ 00701000
*        2  ATCAOS CHAR(0) BDY(WORD);  /* VS2 ONLY FIELDS            */ 00702000
*/* END OF ATBUILD */                                              0408 00703000
*    DCL GPR03F FIXED(31) REG(03);                                 0408 00704000
*    DCL GPR03P PTR(31)   REG(03);                                 0409 00705000
*    DCL GPR06F FIXED(31) REG(06);                                 0410 00706000
*    DCL GPR06P PTR(31)   REG(06);                                 0411 00707000
*    DCL GPR07F FIXED(31) REG(07);                                 0412 00708000
*    DCL GPR07P PTR(31)   REG(07);                                 0413 00709000
*    DCL GPR10F FIXED(31) REG(10);                                 0414 00710000
*    DCL GPR10P PTR(31)   REG(10);                                 0415 00711000
*    DCL GPR11F FIXED(31) REG(11);                                 0416 00712000
*    DCL GPR11P PTR(31)   REG(11);                                 0417 00713000
*    DCL GPR12F FIXED(31) REG(12);                                 0418 00714000
*    DCL GPR12P PTR(31)   REG(12);                                 0419 00715000
*    DCL GPR13F FIXED(31) REG(13);                                 0420 00716000
*    DCL GPR13P PTR(31)   REG(13);                                 0421 00717000
*    RFY (GPR02P,GPR03P,GPR04P,GPR15P) RSTD;                       0422 00718000
*         RFY (GPR01P,GPR13P) RSTD;                                0423 00719000
*         GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);       0424 00720000
          STM GPR02P,GPR13P,RPHWORK(GPR01P)                             00721000
*         RFY GPR13P UNRSTD;                                       0425 00722000
*         GPR04P=RPHWEA;                                           0426 00723000
         L     GPR04P,RPHWEA(,RPHSVPTR)                            0426 00724000
*         DCL 1 FMZA0019 FIXED(31) STATIC LOCAL,                   0427 00725000
*             2 * FIXED(8) INIT(64),                               0427 00726000
*             2 * PTR(24) INIT(0);                                 0427 00727000
*         GPR03F = FMZA0019;                                       0428 00728000
*                                                                  0428 00729000
         L     GPR03F,FMZA0019                                     0428 00730000
*    DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                 0429 00731000
*      GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                 0430 00732000
         L     GPR15P,ATCLCPTR                                     0430 00733000
*    END; /*LISATCVT*/                                             0431 00734000
*         GPR02P = GPR15P->ATCBPDA;                                0432 00735000
         L     GPR02P,ATCBPDA(,GPR15P)                             0432 00736000
*         GPR15P=GPR15P->ATCSMRS;                                  0433 00737000
         L     GPR15P,ATCSMRS(,GPR15P)                             0433 00738000
*         DCL FMZL0019 BASED(GPR15P) LABEL VALUERANGE(*);          0434 00739000
*         CALL FMZL0019;                                           0435 00740000
         BALR  @14,@15                                             0435 00741000
*         RFY GPR13P RSTD;                                         0436 00742000
*         GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);       0437 00743000
          LM GPR02P,GPR13P,RPHWORK(GPR01P)                              00744000
*         RFY (GPR01P,GPR13P) UNRSTD;                              0438 00745000
*    RFY (GPR02P,GPR03P,GPR04P,GPR15P) UNRSTD;                     0439 00746000
*    END ;/**********END OF RELSTORE EXPANSION**********/          0440 00747000
*   END;                                                           0441 00748000
*ELSE; /* ELSE NMLPB SHOULD NOT BE FREED */                        0442 00749000
@RF00400 DS    0H                                                  0443 00750000
*RPHPTR=RPHSVPTR;                                                  0443 00751000
         LR    RPHPTR,RPHSVPTR                                     0443 00752000
*/* TPEXIT  NORM */                                                0444 00753000
* DO;                                                              0444 00754000
*   RESPECIFY GPR15P RSTD;                                         0445 00755000
*                                                                  0445 00756000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)  */                         0446 00757000
*/* END OF ATBUILD */                                              0446 00758000
*                                                                  0446 00759000
* DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR15P)) */                    0446 00760000
*   GPR15P = ATCLCPTR; /*SET UP ATCVT POINTER*/                    0447 00761000
         L     GPR15P,ATCLCPTR                                     0447 00762000
* END; /*LISATCVT*/                                                0448 00763000
*   RESPECIFY GPR00F RSTD;                                         0449 00764000
*   GPR00F=4;    /* SET PARAMETER REGISTER TO 4 */                 0450 00765000
         LA    GPR00F,4                                            0450 00766000
*   GPR15P=GPR15P->ATCAP31;                                        0451 00767000
         L     GPR15P,ATCAP31(,GPR15P)                             0451 00768000
*   DCL FMZL0035 BASED(GPR15P) LABEL VALUERANGE(*);                0452 00769000
*   CALL FMZL0035;                                                 0453 00770000
         BALR  @14,@15                                             0453 00771000
*   RESPECIFY (GPR00F,GPR15P) UNRSTD;                              0454 00772000
* END; /***** END OF TPEXIT  *****/                                0455 00773000
*                                                                  0455 00774000
*/* TPEPILOG   */                                                  0456 00775000
* GEN (PRINT OFF);                                                 0456 00776000
*                                                                  0456 00777000
         PRINT OFF                                                      00778000
* DCL ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*); /*RESET ROUTINE*/    0457 00779000
* DCL ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*); /*TPQUE ROUTINE*/    0458 00780000
* GEN (PRINT ON);                                                  0459 00781000
         PRINT ON                                                       00782000
*/* END OF TPEPILOG */                                                / 00783000
*@DL31HHG*/                                                        0460 00784000
*END ISTNMCCR                                                      0460 00785000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00786000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00787000
*;                                                                 0460 00788000
@EL00001 DS    0H                                                  0460 00789000
@EF00001 DS    0H                                                  0460 00790000
@ER00001 BR    @14                                                 0460 00791000
@DATA    DS    0H                                                       00792000
@DATD    DSECT                                                          00793000
         DS    0F                                                       00794000
ISTNMCCR CSECT                                                          00795000
         DS    0F                                                       00796000
@CF00060 DC    F'1'                                                     00797000
@CF03185 DC    XL4'0000FFFF'                                            00798000
@DATD    DSECT                                                          00799000
         DS    0D                                                       00800000
CVTPTR   DS    A                                                        00801000
FMCBPTR  DS    A                                                        00802000
LCPBPTR  DS    A                                                        00803000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00804000
@ENDDATD EQU   *                                                        00805000
ISTNMCCR CSECT                                                          00806000
         DS    0F                                                       00807000
@SIZDATD DC    AL1(0)                                                   00808000
         DC    AL3(@ENDDATD-@DATD)                                      00809000
         DS    0D                                                       00810000
FMZA0019 DS    FL4                                                      00811000
         ORG   FMZA0019                                                 00812000
@NM00045 DC    AL1(64)                                                  00813000
@NM00046 DC    AL3(0)                                                   00814000
         ORG   FMZA0019+4                                               00815000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00816000
@01      EQU   01                                                       00817000
@02      EQU   02                                                       00818000
@03      EQU   03                                                       00819000
@04      EQU   04                                                       00820000
@05      EQU   05                                                       00821000
@06      EQU   06                                                       00822000
@07      EQU   07                                                       00823000
@08      EQU   08                                                       00824000
@09      EQU   09                                                       00825000
@10      EQU   10                                                       00826000
@11      EQU   11                                                       00827000
@12      EQU   12                                                       00828000
@13      EQU   13                                                       00829000
@14      EQU   14                                                       00830000
@15      EQU   15                                                       00831000
RPHPTR   EQU   @01                                                      00832000
RPHSVPTR EQU   @09                                                      00833000
FREEREG  EQU   @10                                                      00834000
CMZK0005 EQU   @01                                                      00835000
GPR00F   EQU   @00                                                      00836000
GPR00P   EQU   @00                                                      00837000
GPR01P   EQU   @01                                                      00838000
GPR02P   EQU   @02                                                      00839000
GPR15P   EQU   @15                                                      00840000
GPR04P   EQU   @04                                                      00841000
GPR05P   EQU   @05                                                      00842000
GPR03F   EQU   @03                                                      00843000
GPR03P   EQU   @03                                                      00844000
GPR13P   EQU   @13                                                      00845000
GPR01F   EQU   @01                                                      00846000
GPR02F   EQU   @02                                                      00847000
GPR04F   EQU   @04                                                      00848000
GPR05F   EQU   @05                                                      00849000
GPR06F   EQU   @06                                                      00850000
GPR06P   EQU   @06                                                      00851000
GPR07F   EQU   @07                                                      00852000
GPR07P   EQU   @07                                                      00853000
GPR08F   EQU   @08                                                      00854000
GPR08P   EQU   @08                                                      00855000
GPR09F   EQU   @09                                                      00856000
GPR09P   EQU   @09                                                      00857000
GPR10F   EQU   @10                                                      00858000
GPR10P   EQU   @10                                                      00859000
GPR11F   EQU   @11                                                      00860000
GPR11P   EQU   @11                                                      00861000
GPR12F   EQU   @12                                                      00862000
GPR12P   EQU   @12                                                      00863000
GPR13F   EQU   @13                                                      00864000
GPR14F   EQU   @14                                                      00865000
GPR14P   EQU   @14                                                      00866000
GPR15F   EQU   @15                                                      00867000
ATCLCPTR EQU   1032                                                     00868000
CVTMAP   EQU   0                                                        00869000
CVTDAR   EQU   CVTMAP+72                                                00870000
CVTFLGS1 EQU   CVTDAR                                                   00871000
CVTDCB   EQU   CVTMAP+116                                               00872000
CVTIERLC EQU   CVTMAP+144                                               00873000
CVTOPTA  EQU   CVTMAP+182                                               00874000
CVTOPTB  EQU   CVTMAP+183                                               00875000
CVTGTF   EQU   CVTMAP+236                                               00876000
CVTGTFST EQU   CVTGTF                                                   00877000
CVTGTFS  EQU   CVTGTFST                                                 00878000
CVTSTATE EQU   CVTGTFST                                                 00879000
CVTTMODE EQU   CVTGTFST                                                 00880000
CVTFORM  EQU   CVTGTFST                                                 00881000
CVTAQAVT EQU   CVTMAP+240                                               00882000
CVTTCMFG EQU   CVTAQAVT                                                 00883000
CVTVOLM2 EQU   CVTMAP+244                                               00884000
CVTTATA  EQU   CVTVOLM2                                                 00885000
CVTTSKS  EQU   CVTTATA                                                  00886000
CVTVOLF2 EQU   CVTTSKS                                                  00887000
CVTTAT   EQU   CVTTATA+1                                                00888000
CVTATER  EQU   CVTMAP+248                                               00889000
CVTEXT1  EQU   CVTMAP+252                                               00890000
CVTPURG  EQU   CVTMAP+260                                               00891000
CVTQMSG  EQU   CVTMAP+268                                               00892000
CVTDMSR  EQU   CVTMAP+272                                               00893000
CVTRSV37 EQU   CVTDMSR                                                  00894000
CVTDMSRF EQU   CVTRSV37                                                 00895000
CVTERPV  EQU   CVTMAP+316                                               00896000
CVTINTLA EQU   CVTMAP+320                                               00897000
CVTAPF   EQU   CVTMAP+324                                               00898000
CVTEXT2  EQU   CVTMAP+328                                               00899000
CVTHJES  EQU   CVTMAP+332                                               00900000
CVTPGSIA EQU   CVTMAP+348                                               00901000
CVTA1F1  EQU   CVTMAP+356                                               00902000
CVTSYSK  EQU   CVTMAP+357                                               00903000
CVTVOLM1 EQU   CVTMAP+380                                               00904000
CVTVOLF1 EQU   CVTVOLM1                                                 00905000
CVTATMCT EQU   CVTMAP+388                                               00906000
CVTXTNT1 EQU   0                                                        00907000
CVTXTNT2 EQU   0                                                        00908000
CVTDSSV  EQU   CVTXTNT2                                                 00909000
CVTFLGBT EQU   CVTXTNT2+5                                               00910000
CVTQID   EQU   CVTXTNT2+24                                              00911000
CVTSHS   EQU   CVTXTNT2+40                                              00912000
CVTRV400 EQU   CVTXTNT2+52                                              00913000
CVTRV409 EQU   CVTXTNT2+53                                              00914000
CVTATCVT EQU   CVTXTNT2+64                                              00915000
CVTRV429 EQU   CVTXTNT2+84                                              00916000
CVTRV438 EQU   CVTXTNT2+85                                              00917000
CVTRV457 EQU   CVTXTNT2+112                                             00918000
CVTRV466 EQU   CVTXTNT2+113                                             00919000
CVTFIX   EQU   0                                                        00920000
CVTRELNO EQU   CVTFIX+252                                               00921000
ISTRPH   EQU   0                                                        00922000
RPHCNTL  EQU   ISTRPH                                                   00923000
RPHFLAGS EQU   RPHCNTL+2                                                00924000
RPHAPTYP EQU   RPHFLAGS                                                 00925000
RPHFSTLC EQU   RPHFLAGS                                                 00926000
RPHFLGB  EQU   RPHCNTL+3                                                00927000
RPHRPHA  EQU   ISTRPH+4                                                 00928000
RPHTSKID EQU   ISTRPH+8                                                 00929000
RPHRESMA EQU   ISTRPH+16                                                00930000
RPHWPFLG EQU   RPHRESMA                                                 00931000
RPHMAJCB EQU   ISTRPH+21                                                00932000
RPHWEA   EQU   ISTRPH+24                                                00933000
RPHCSPA  EQU   RPHWEA                                                   00934000
RPHSRPRM EQU   ISTRPH+28                                                00935000
RPHCRR   EQU   ISTRPH+32                                                00936000
RPHPABQA EQU   ISTRPH+36                                                00937000
RPHWORK  EQU   ISTRPH+40                                                00938000
RPHSAVE1 EQU   RPHWORK                                                  00939000
RPHSBITS EQU   RPHSAVE1+1                                               00940000
ISTPAB   EQU   0                                                        00941000
PABWQCHN EQU   ISTPAB                                                   00942000
PABWEQA  EQU   PABWQCHN                                                 00943000
PABCHAIN EQU   PABWQCHN+4                                               00944000
PABRPHFG EQU   ISTPAB+12                                                00945000
PABFLAGS EQU   PABRPHFG                                                 00946000
PABERLCK EQU   PABFLAGS                                                 00947000
PABERRLK EQU   PABERLCK                                                 00948000
ISTLOK   EQU   0                                                        00949000
LOKCHN   EQU   ISTLOK+1                                                 00950000
LOKCHNG  EQU   LOKCHN                                                   00951000
@NM00007 EQU   LOKCHNG+2                                                00952000
ISTDEVCH EQU   0                                                        00953000
DEVSHCH  EQU   ISTDEVCH                                                 00954000
DEVCHAR  EQU   DEVSHCH                                                  00955000
DEVTCODE EQU   ISTDEVCH+1                                               00956000
DEVFLAGS EQU   ISTDEVCH+3                                               00957000
DEVFCCTL EQU   DEVFLAGS                                                 00958000
DEVCHAR3 EQU   DEVFLAGS                                                 00959000
ISTPROCD EQU   0                                                        00960000
PROPROC  EQU   ISTPROCD                                                 00961000
PROPROC1 EQU   PROPROC                                                  00962000
PROPROC2 EQU   PROPROC+1                                                00963000
PROPROC3 EQU   PROPROC+2                                                00964000
PROPROC4 EQU   PROPROC+3                                                00965000
PROPROCS EQU   0                                                        00966000
PROSETMS EQU   PROPROCS+1                                               00967000
PROSETM2 EQU   PROSETMS                                                 00968000
PROSETM3 EQU   PROSETMS+1                                               00969000
PROSETM4 EQU   PROSETMS+2                                               00970000
ISTFMCB  EQU   0                                                        00971000
FMCSTAT  EQU   ISTFMCB+28                                               00972000
FMCSTAT1 EQU   ISTFMCB+29                                               00973000
FMCCMDFL EQU   ISTFMCB+31                                               00974000
FMCCMPS1 EQU   ISTFMCB+36                                               00975000
FMCPAB3  EQU   ISTFMCB+96                                               00976000
FMCSIPA  EQU   ISTFMCB+148                                              00977000
FMCNXOSQ EQU   ISTFMCB+152                                              00978000
FMCNXCFM EQU   FMCNXOSQ                                                 00979000
FMCNXOSC EQU   FMCNXOSQ+2                                               00980000
FMCSSTAT EQU   ISTFMCB+159                                              00981000
FMCPACE  EQU   ISTFMCB+160                                              00982000
FMCPACEN EQU   FMCPACE                                                  00983000
FMCPACEM EQU   FMCPACE+1                                                00984000
FMCPACPC EQU   FMCPACE+2                                                00985000
FMCCVAL  EQU   FMCPACE+3                                                00986000
FMCOBCE  EQU   FMCCVAL                                                  00987000
FMCCLEXT EQU   ISTFMCB+164                                              00988000
FMCRPLA  EQU   FMCCLEXT                                                 00989000
FMCFBA   EQU   FMCCLEXT+4                                               00990000
FMCCMPS2 EQU   FMCCLEXT+16                                              00991000
FMCFLGA  EQU   FMCCMPS2                                                 00992000
FMCFLGCL EQU   FMCCMPS2+1                                               00993000
FMCPSCMD EQU   FMCCMPS2+2                                               00994000
FMCPSTAT EQU   FMCCMPS2+3                                               00995000
FMCSTAT2 EQU   ISTFMCB+186                                              00996000
FMCLUSTR EQU   ISTFMCB+187                                              00997000
FMCIPSEQ EQU   ISTFMCB+188                                              00998000
FMCMODEB EQU   ISTFMCB+189                                              00999000
FMCCLSEQ EQU   ISTFMCB+190                                              01000000
FMCRRESP EQU   ISTFMCB+195                                              01001000
FMCSSEGQ EQU   ISTFMCB+200                                              01002000
FMCFBAS  EQU   ISTFMCB+216                                              01003000
FMCZV002 EQU   FMCFBAS                                                  01004000
FMCSNCTL EQU   ISTFMCB+224                                              01005000
FMCSCFLG EQU   FMCSNCTL                                                 01006000
FMCVS1   EQU   ISTFMCB+232                                              01007000
FMCZFLAG EQU   FMCVS1                                                   01008000
FMCZF006 EQU   FMCZFLAG                                                 01009000
FMCLBXM  EQU   FMCVS1+12                                                01010000
FMCSHEAQ EQU   FMCLBXM                                                  01011000
FMCLCPBQ EQU   FMCVS1+16                                                01012000
FMCLCPAQ EQU   FMCVS1+20                                                01013000
FMCSEQ1  EQU   FMCVS1+34                                                01014000
FMCZFLG2 EQU   FMCVS1+35                                                01015000
FMCCVFLG EQU   FMCVS1+44                                                01016000
FMCFLAG  EQU   0                                                        01017000
FMCFLGB  EQU   FMCFLAG                                                  01018000
ISTLCCW  EQU   0                                                        01019000
LCCWOP   EQU   ISTLCCW                                                  01020000
LCCWSI   EQU   LCCWOP                                                   01021000
LCCWSD   EQU   LCCWOP                                                   01022000
LCCWRWOP EQU   LCCWOP                                                   01023000
LCCWCTL  EQU   LCCWRWOP                                                 01024000
LCCWFLAG EQU   ISTLCCW+1                                                01025000
LCCWCC   EQU   LCCWFLAG                                                 01026000
LCCWLSI  EQU   LCCWFLAG                                                 01027000
ISTLCPB  EQU   0                                                        01028000
LCPREQTG EQU   ISTLCPB+2                                                01029000
LCPFLAGS EQU   LCPREQTG                                                 01030000
LCPZF001 EQU   LCPFLAGS                                                 01031000
LCPZRT02 EQU   LCPZF001                                                 01032000
LCPZF002 EQU   LCPFLAGS                                                 01033000
LCPZRT03 EQU   LCPZF002                                                 01034000
LCPZF003 EQU   LCPFLAGS                                                 01035000
LCPZRT04 EQU   LCPZF003                                                 01036000
LCPZF004 EQU   LCPFLAGS                                                 01037000
LCPZRT05 EQU   LCPZF004                                                 01038000
LCPZRT06 EQU   LCPFLAGS                                                 01039000
LCPZRT07 EQU   LCPFLAGS                                                 01040000
LCPMNRCD EQU   LCPREQTG+1                                               01041000
LCPZRT08 EQU   LCPMNRCD                                                 01042000
LCPZRT09 EQU   LCPMNRCD                                                 01043000
LCPCHAIN EQU   ISTLCPB+4                                                01044000
LCPCHAI1 EQU   LCPCHAIN                                                 01045000
LCPRUCNT EQU   ISTLCPB+8                                                01046000
LCPFLAG2 EQU   ISTLCPB+9                                                01047000
LCPTLBPI EQU   LCPFLAG2                                                 01048000
LCPFID0  EQU   LCPFLAG2                                                 01049000
LCPSEQ   EQU   ISTLCPB+10                                               01050000
LCPCID   EQU   ISTLCPB+16                                               01051000
LCPNXLCW EQU   ISTLCPB+20                                               01052000
LCPFDBA  EQU   ISTLCPB+24                                               01053000
LCPTLBAD EQU   ISTLCPB+28                                               01054000
LCPFOSN  EQU   ISTLCPB+32                                               01055000
LCPFSNCH EQU   ISTLCPB+34                                               01056000
LCPSTYPE EQU   ISTLCPB+36                                               01057000
LCPFLG1  EQU   ISTLCPB+37                                               01058000
LCPFLCCW EQU   ISTLCPB+40                                               01059000
LCPLCCW  EQU   ISTLCPB+48                                               01060000
LCPPABA  EQU   LCPLCCW+4                                                01061000
LCPRPHA  EQU   LCPPABA                                                  01062000
ISTDCLCP EQU   0                                                        01063000
DCLRTYPE EQU   ISTDCLCP+76                                              01064000
DCLRFLG  EQU   DCLRTYPE+1                                               01065000
DCLFLAG1 EQU   ISTDCLCP+78                                              01066000
ISTNMLPB EQU   0                                                        01067000
NMLCW2   EQU   ISTNMLPB+56                                              01068000
NMLCW3   EQU   ISTNMLPB+64                                              01069000
NMCONTRL EQU   ISTNMLPB+72                                              01070000
NMLCWCMD EQU   NMCONTRL+2                                               01071000
NMRDTEA  EQU   NMCONTRL+4                                               01072000
NMIPSEQ  EQU   ISTNMLPB+80                                              01073000
ISTPFCRR EQU   0                                                        01074000
PFCCRR   EQU   ISTPFCRR                                                 01075000
PFCCRRID EQU   PFCCRR                                                   01076000
PFCCRRLN EQU   PFCCRR+2                                                 01077000
PFCHDR   EQU   ISTPFCRR+4                                               01078000
PFCCRRO  EQU   PFCHDR                                                   01079000
PFCFRRO  EQU   PFCHDR+4                                                 01080000
ISTDCCRR EQU   0                                                        01081000
CRRSPACE EQU   ISTDCCRR+12                                              01082000
CRRSAREA EQU   0                                                        01083000
CRRMAS   EQU   CRRSAREA+148                                             01084000
CRRMAS1  EQU   CRRMAS                                                   01085000
CRRMAS2  EQU   CRRMAS+1                                                 01086000
CRRMAS3  EQU   CRRMAS+2                                                 01087000
CRRMAS4  EQU   CRRMAS+3                                                 01088000
CRRRMAS1 EQU   CRRMAS+4                                                 01089000
CRRRMAS2 EQU   CRRMAS+5                                                 01090000
CRRRMAS3 EQU   CRRMAS+6                                                 01091000
CRRSMAS  EQU   CRRRMAS3                                                 01092000
CRRATS   EQU   CRRSAREA+156                                             01093000
CRRATS1  EQU   CRRATS                                                   01094000
CRRATS2  EQU   CRRATS+1                                                 01095000
CRRATS3  EQU   CRRATS+2                                                 01096000
CRRATS4  EQU   CRRATS+3                                                 01097000
CRRRATS1 EQU   CRRATS+4                                                 01098000
CRRRATS2 EQU   CRRATS+5                                                 01099000
CRRRATS3 EQU   CRRATS+6                                                 01100000
CRRSATS  EQU   CRRRATS3                                                 01101000
CRRFLGS1 EQU   CRRSAREA+164                                             01102000
CRRFLGS2 EQU   CRRSAREA+165                                             01103000
CRRFLGS3 EQU   CRRSAREA+166                                             01104000
CRRFLGS4 EQU   CRRSAREA+167                                             01105000
CRRFLGS  EQU   CRRSAREA+168                                             01106000
CRRRFLG1 EQU   CRRSAREA+169                                             01107000
CRRRTYPE EQU   CRRRFLG1                                                 01108000
CRRFDBK1 EQU   CRRSAREA+170                                             01109000
CRRFDB2  EQU   CRRFDBK1+1                                               01110000
CRRFDB3  EQU   CRRFDBK1+2                                               01111000
CRRFDBK2 EQU   CRRSAREA+176                                             01112000
CRRDSB   EQU   CRRFDBK2                                                 01113000
CRRESR   EQU   CRRFDBK2+2                                               01114000
CRRTRBUF EQU   CRRSAREA+204                                             01115000
CRRBFLGS EQU   CRRSAREA+280                                             01116000
ISTCSCRR EQU   0                                                        01117000
CSCAUDIT EQU   ISTCSCRR+16                                              01118000
CSCNTRD  EQU   CSCAUDIT                                                 01119000
NNMCCR   EQU   CSCNTRD                                                  01120000
CSCCRT   EQU   CSCAUDIT+2                                               01121000
CNMCCR   EQU   CSCCRT                                                   01122000
ISTZSAVE EQU   0                                                        01123000
ZSAZSVBC EQU   ISTZSAVE                                                 01124000
ZSAZSVMS EQU   ZSAZSVBC                                                 01125000
ISTCFCRR EQU   0                                                        01126000
CFCAUDIT EQU   ISTCFCRR                                                 01127000
CFCNTRD  EQU   CFCAUDIT                                                 01128000
CFCCRT   EQU   CFCAUDIT+1                                               01129000
ISTZCRR  EQU   0                                                        01130000
ZCRCRR   EQU   ISTZCRR                                                  01131000
ZCRFLGS1 EQU   ISTZCRR+12                                               01132000
ZCRFLGS2 EQU   ISTZCRR+13                                               01133000
ZCRSWFLD EQU   ISTZCRR+14                                               01134000
ZCRENDSH EQU   ZCRSWFLD                                                 01135000
ZCRNDLCP EQU   ZCRSWFLD                                                 01136000
ZCRRESET EQU   ZCRSWFLD                                                 01137000
ZCRFLGS3 EQU   ISTZCRR+15                                               01138000
ZCRGENSW EQU   ISTZCRR+16                                               01139000
ZCRPFLGS EQU   ISTZCRR+17                                               01140000
ZCRIBPR  EQU   ISTZCRR+18                                               01141000
ZCRSCPSW EQU   ISTZCRR+19                                               01142000
ZCRPARMS EQU   ISTZCRR+24                                               01143000
ZCRFBPTR EQU   ZCRPARMS                                                 01144000
ZCRDFRDA EQU   ZCRPARMS+10                                              01145000
ZCRPCOD1 EQU   ZCRPARMS+12                                              01146000
ZCRPLSBF EQU   ZCRPCOD1                                                 01147000
ZCRPCOD2 EQU   ZCRPARMS+13                                              01148000
ZCRSVRTN EQU   ISTZCRR+56                                               01149000
ZCRWKARA EQU   ISTZCRR+156                                              01150000
ZCRCIDSV EQU   ISTZCRR+192                                              01151000
ZCRAUDIT EQU   ISTZCRR+440                                              01152000
ZCRENTER EQU   ZCRAUDIT+5                                               01153000
ZCRLCPB  EQU   ISTZCRR+480                                              01154000
ZCRRHRU  EQU   ZCRLCPB                                                  01155000
ISTASCRR EQU   0                                                        01156000
ASCFLAGS EQU   ISTASCRR+16                                              01157000
ASCFLG1  EQU   ASCFLAGS                                                 01158000
ASCFLG2  EQU   ASCFLAGS+2                                               01159000
ASCFLG3  EQU   ASCFLAGS+4                                               01160000
ASCUSRGS EQU   ISTASCRR+28                                              01161000
ISTAPCRR EQU   0                                                        01162000
APCATFLG EQU   ISTAPCRR+16                                              01163000
APCRFLG  EQU   ISTAPCRR+18                                              01164000
APCSAVE  EQU   ISTAPCRR+44                                              01165000
APCCOMF  EQU   ISTAPCRR+116                                             01166000
APCCOMF1 EQU   APCCOMF                                                  01167000
APC31FLG EQU   ISTAPCRR+132                                             01168000
APC52FLG EQU   ISTAPCRR+133                                             01169000
APC53FLG EQU   ISTAPCRR+134                                             01170000
APC54FLG EQU   ISTAPCRR+135                                             01171000
APC57FLG EQU   ISTAPCRR+136                                             01172000
ISTCRA   EQU   0                                                        01173000
CRABASIC EQU   ISTCRA                                                   01174000
CRAHDR   EQU   CRABASIC                                                 01175000
CRACRR   EQU   CRAHDR                                                   01176000
CRALKACT EQU   CRABASIC+8                                               01177000
CRAPROCR EQU   ISTCRA+312                                               01178000
CRASVC   EQU   ISTCRA+848                                               01179000
CRABUFA  EQU   CRASVC+68                                                01180000
ISTDYPAB EQU   0                                                        01181000
ISTATCVT EQU   0                                                        01182000
ATCCOM   EQU   ISTATCVT                                                 01183000
ATCSTAT  EQU   ATCCOM                                                   01184000
ATCSTAT1 EQU   ATCSTAT                                                  01185000
ATCSTFLG EQU   ATCSTAT+1                                                01186000
ATCPOFLG EQU   ATCSTAT+2                                                01187000
ATCSTAT4 EQU   ATCSTAT+3                                                01188000
ATCBPDA  EQU   ATCCOM+128                                               01189000
ATCIOTRC EQU   ATCCOM+140                                               01190000
ATCTHTRC EQU   ATCIOTRC                                                 01191000
ATCSMRS  EQU   ATCCOM+188                                               01192000
ATCCSMR  EQU   ISTATCVT+296                                             01193000
ATCSHRFG EQU   ISTATCVT+316                                             01194000
ATCHPGM  EQU   ISTATCVT+384                                             01195000
ATCVLCNT EQU   ISTATCVT+772                                             01196000
ATCRNO   EQU   ISTATCVT+788                                             01197000
ATCSOPD  EQU   ISTATCVT+792                                             01198000
ATCSIPD  EQU   ISTATCVT+800                                             01199000
ATCSECST EQU   ISTATCVT+812                                             01200000
ATCSTAT2 EQU   ISTATCVT+818                                             01201000
ATCVTBAM EQU   ISTATCVT+908                                             01202000
@NM00042 EQU   ATCVTBAM+3                                               01203000
ATCAOSM  EQU   ISTATCVT+912                                             01204000
ATCGSRBQ EQU   ATCAOSM+4                                                01205000
ATCGSRBG EQU   ATCGSRBQ                                                 01206000
ATCAP31  EQU   ATCAOSM+24                                               01207000
ATCAP34  EQU   ATCAOSM+32                                               01208000
ATCICAPP EQU   ATCAOSM+100                                              01209000
ATCLDAPP EQU   ATCAOSM+120                                              01210000
ATCDAPVT EQU   ATCAOSM+140                                              01211000
ATCAP37  EQU   ATCAOSM+264                                              01212000
ATCCRA   EQU   ATCAOSM+280                                              01213000
ATCCRACN EQU   ATCCRA+4                                                 01214000
ATCSRB   EQU   ATCAOSM+288                                              01215000
ATCSRBCN EQU   ATCSRB+4                                                 01216000
ATCCRPL  EQU   ATCAOSM+296                                              01217000
ATCRPLCN EQU   ATCCRPL+4                                                01218000
ATCVTFLG EQU   ATCAOSM+392                                              01219000
ATCZFLAG EQU   ATCAOSM+588                                              01220000
ISTAPC34 EQU   0                                                        01221000
ISTAPC37 EQU   0                                                        01222000
FMZL0019 EQU   0                                                        01223000
FMZL0035 EQU   0                                                        01224000
CVTS01   EQU   CVTPGSIA                                                 01225000
CVTLPDIA EQU   CVTS01+12                                                01226000
CVTDIRST EQU   CVTLPDIA                                                 01227000
CVTSLIDA EQU   CVTS01+24                                                01228000
CVTCTLFG EQU   CVTS01+50                                                01229000
CVTRV210 EQU   CVTS01+424                                               01230000
CVTRV219 EQU   CVTS01+425                                               01231000
CVTRV228 EQU   CVTS01+426                                               01232000
CVTRV237 EQU   CVTS01+427                                               01233000
CVTMFRTR EQU   CVTS01+452                                               01234000
CVTRV262 EQU   CVTS01+468                                               01235000
CVTRV271 EQU   CVTS01+469                                               01236000
CVTRV280 EQU   CVTS01+470                                               01237000
CVTRV289 EQU   CVTS01+471                                               01238000
CVTGSDA  EQU   CVTS01+600                                               01239000
LCPZTIE  EQU   LCPCID                                                   01240000
LCPZSNAM EQU   LCPZTIE+8                                                01241000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01242000
LCPZTRV4 EQU   LCPZSNAM+4                                               01243000
LCPZTRV1 EQU   LCPZSNAM                                                 01244000
LCPZSNA  EQU   LCPZTIE+4                                                01245000
LCPZFMCA EQU   LCPZTIE                                                  01246000
CVTRV628 EQU   CVTS01+728                                               01247000
CVTRV627 EQU   CVTS01+724                                               01248000
CVTRV626 EQU   CVTS01+720                                               01249000
CVTRV625 EQU   CVTS01+716                                               01250000
CVTRV624 EQU   CVTS01+712                                               01251000
CVTRV623 EQU   CVTS01+708                                               01252000
CVTRV622 EQU   CVTS01+704                                               01253000
CVTRV621 EQU   CVTS01+700                                               01254000
CVTRV620 EQU   CVTS01+696                                               01255000
CVTRV619 EQU   CVTS01+692                                               01256000
CVTRV618 EQU   CVTS01+688                                               01257000
CVTRV617 EQU   CVTS01+684                                               01258000
CVTRV616 EQU   CVTS01+680                                               01259000
CVTRV615 EQU   CVTS01+676                                               01260000
CVTRV614 EQU   CVTS01+672                                               01261000
CVTRV613 EQU   CVTS01+668                                               01262000
CVTTCASP EQU   CVTS01+664                                               01263000
CVT0PT03 EQU   CVTS01+660                                               01264000
CVT0PT0E EQU   CVTS01+656                                               01265000
CVTIRM   EQU   CVTS01+652                                               01266000
CVTCGK   EQU   CVTS01+648                                               01267000
CVTRV607 EQU   CVTS01+644                                               01268000
CVTRV606 EQU   CVTS01+640                                               01269000
CVTRV605 EQU   CVTS01+636                                               01270000
CVTRV604 EQU   CVTS01+632                                               01271000
CVTEFF02 EQU   CVTS01+628                                               01272000
CVTCBBR  EQU   CVTS01+624                                               01273000
CVTSSCR  EQU   CVTS01+620                                               01274000
CVTEVENT EQU   CVTS01+616                                               01275000
CVTCRCA  EQU   CVTS01+612                                               01276000
CVTTPIO  EQU   CVTS01+608                                               01277000
CVTADV   EQU   CVTS01+604                                               01278000
CVTGSDAB EQU   CVTGSDA                                                  01279000
CVTQV3   EQU   CVTS01+596                                               01280000
CVTQV2   EQU   CVTS01+592                                               01281000
CVTQV1   EQU   CVTS01+588                                               01282000
CVTRPT   EQU   CVTS01+584                                               01283000
CVTSSRB  EQU   CVTS01+580                                               01284000
CVTCSDRL EQU   CVTS01+576                                               01285000
CVTEXP1  EQU   CVTS01+572                                               01286000
CVTRMPMT EQU   CVTS01+568                                               01287000
CVTRMPTT EQU   CVTS01+564                                               01288000
CVTVPSA  EQU   CVTS01+560                                               01289000
CVTVSTOP EQU   CVTS01+556                                               01290000
CVTGTFR8 EQU   CVTS01+552                                               01291000
CVTQUIT  EQU   CVTS01+548                                               01292000
CVTVACR  EQU   CVTS01+544                                               01293000
CVTWTCB  EQU   CVTS01+540                                               01294000
CVTSTPRS EQU   CVTS01+536                                               01295000
CVT0PT02 EQU   CVTS01+532                                               01296000
CVTDARCM EQU   CVTS01+528                                               01297000
CVTIRECM EQU   CVTS01+524                                               01298000
CVTJRECM EQU   CVTS01+520                                               01299000
CVTVEMS0 EQU   CVTS01+516                                               01300000
CVTSPFRR EQU   CVTS01+512                                               01301000
CVTRLSTG EQU   CVTS01+508                                               01302000
CVT0TC0A EQU   CVTS01+504                                               01303000
CVTGMBR  EQU   CVTS01+500                                               01304000
CVTLFRM  EQU   CVTS01+496                                               01305000
CVTRMBR  EQU   CVTS01+492                                               01306000
CVTVIOP  EQU   CVTS01+488                                               01307000
CVTRV307 EQU   CVTS01+486                                               01308000
CVTRV306 EQU   CVTS01+484                                               01309000
CVTRV305 EQU   CVTS01+482                                               01310000
CVTRV304 EQU   CVTS01+480                                               01311000
CVTRV303 EQU   CVTS01+478                                               01312000
CVTRV302 EQU   CVTS01+476                                               01313000
CVTTRCA  EQU   CVTS01+472                                               01314000
CVTRV297 EQU   CVTRV289                                                 01315000
CVTRV296 EQU   CVTRV289                                                 01316000
CVTRV295 EQU   CVTRV289                                                 01317000
CVTRV294 EQU   CVTRV289                                                 01318000
CVTRV293 EQU   CVTRV289                                                 01319000
CVTRV292 EQU   CVTRV289                                                 01320000
CVTRV291 EQU   CVTRV289                                                 01321000
CVTRV290 EQU   CVTRV289                                                 01322000
CVTRV288 EQU   CVTRV280                                                 01323000
CVTRV287 EQU   CVTRV280                                                 01324000
CVTRV286 EQU   CVTRV280                                                 01325000
CVTRV285 EQU   CVTRV280                                                 01326000
CVTRV284 EQU   CVTRV280                                                 01327000
CVTRV283 EQU   CVTRV280                                                 01328000
CVTRV282 EQU   CVTRV280                                                 01329000
CVTRV281 EQU   CVTRV280                                                 01330000
CVTRV279 EQU   CVTRV271                                                 01331000
CVTRV278 EQU   CVTRV271                                                 01332000
CVTRV277 EQU   CVTRV271                                                 01333000
CVTRV276 EQU   CVTRV271                                                 01334000
CVTRV275 EQU   CVTRV271                                                 01335000
CVTRV274 EQU   CVTRV271                                                 01336000
CVTRV273 EQU   CVTRV271                                                 01337000
CVTRV272 EQU   CVTRV271                                                 01338000
CVTRV270 EQU   CVTRV262                                                 01339000
CVTRV269 EQU   CVTRV262                                                 01340000
CVTRV268 EQU   CVTRV262                                                 01341000
CVTRV267 EQU   CVTRV262                                                 01342000
CVTRV266 EQU   CVTRV262                                                 01343000
CVTRV265 EQU   CVTRV262                                                 01344000
CVTRV264 EQU   CVTRV262                                                 01345000
CVTRV263 EQU   CVTRV262                                                 01346000
CVTVFP   EQU   CVTS01+464                                               01347000
CVTVSI   EQU   CVTS01+460                                               01348000
CVTVPSIB EQU   CVTS01+456                                               01349000
CVTMFACT EQU   CVTMFRTR                                                 01350000
CVTMFCTL EQU   CVTS01+448                                               01351000
CVTPVBP  EQU   CVTS01+444                                               01352000
CVTPWI   EQU   CVTS01+440                                               01353000
CVTRV254 EQU   CVTS01+438                                               01354000
CVTRV253 EQU   CVTS01+436                                               01355000
CVTRV252 EQU   CVTS01+434                                               01356000
CVTRV251 EQU   CVTS01+433                                               01357000
CVTRV250 EQU   CVTS01+432                                               01358000
CVTRV249 EQU   CVTS01+431                                               01359000
CVTRV248 EQU   CVTS01+430                                               01360000
CVTRV247 EQU   CVTS01+429                                               01361000
CVTRV246 EQU   CVTS01+428                                               01362000
CVTRV245 EQU   CVTRV237                                                 01363000
CVTRV244 EQU   CVTRV237                                                 01364000
CVTRV243 EQU   CVTRV237                                                 01365000
CVTRV242 EQU   CVTRV237                                                 01366000
CVTRV241 EQU   CVTRV237                                                 01367000
CVTRV240 EQU   CVTRV237                                                 01368000
CVTRV239 EQU   CVTRV237                                                 01369000
CVTRV238 EQU   CVTRV237                                                 01370000
CVTRV236 EQU   CVTRV228                                                 01371000
CVTRV235 EQU   CVTRV228                                                 01372000
CVTRV234 EQU   CVTRV228                                                 01373000
CVTRV233 EQU   CVTRV228                                                 01374000
CVTRV232 EQU   CVTRV228                                                 01375000
CVTRV231 EQU   CVTRV228                                                 01376000
CVTRV230 EQU   CVTRV228                                                 01377000
CVTRV229 EQU   CVTRV228                                                 01378000
CVTRV227 EQU   CVTRV219                                                 01379000
CVTRV226 EQU   CVTRV219                                                 01380000
CVTRV225 EQU   CVTRV219                                                 01381000
CVTRV224 EQU   CVTRV219                                                 01382000
CVTRV223 EQU   CVTRV219                                                 01383000
CVTRV222 EQU   CVTRV219                                                 01384000
CVTRV221 EQU   CVTRV219                                                 01385000
CVTRV220 EQU   CVTRV219                                                 01386000
CVTRV218 EQU   CVTRV210                                                 01387000
CVTRV217 EQU   CVTRV210                                                 01388000
CVTRV216 EQU   CVTRV210                                                 01389000
CVTRV215 EQU   CVTRV210                                                 01390000
CVTRV214 EQU   CVTRV210                                                 01391000
CVTRV213 EQU   CVTRV210                                                 01392000
CVTRV212 EQU   CVTRV210                                                 01393000
CVTRV211 EQU   CVTRV210                                                 01394000
CVTLCCAT EQU   CVTS01+420                                               01395000
CVTPCCAT EQU   CVTS01+416                                               01396000
CVTIPCRP EQU   CVTS01+412                                               01397000
CVTIPCRI EQU   CVTS01+408                                               01398000
CVTIPCDS EQU   CVTS01+404                                               01399000
CVTAIDVT EQU   CVTS01+400                                               01400000
CVTSSAP  EQU   CVTS01+396                                               01401000
CVTEHCIR EQU   CVTS01+392                                               01402000
CVTEHDEF EQU   CVTS01+388                                               01403000
CVTDAIR  EQU   CVTS01+384                                               01404000
CVTPERFM EQU   CVTS01+380                                               01405000
CVT044R2 EQU   CVTS01+376                                               01406000
CVTFETCH EQU   CVTS01+372                                               01407000
CVTRSTWD EQU   CVTS01+368                                               01408000
CVTSPOST EQU   CVTS01+364                                               01409000
CVTIOBP  EQU   CVTS01+360                                               01410000
CVTASMVT EQU   CVTS01+356                                               01411000
CVTRECRQ EQU   CVTS01+352                                               01412000
CVTWSAC  EQU   CVTS01+348                                               01413000
CVTRV149 EQU   CVTS01+344                                               01414000
CVTWSAL  EQU   CVTS01+340                                               01415000
CVTSPSA  EQU   CVTS01+336                                               01416000
CVTGLMN  EQU   CVTS01+332                                               01417000
CVTVEAC0 EQU   CVTS01+328                                               01418000
CVT062R1 EQU   CVTS01+324                                               01419000
CVTRPOST EQU   CVTS01+320                                               01420000
CVTDQIQE EQU   CVTS01+316                                               01421000
CVTCSD   EQU   CVTS01+312                                               01422000
CVTLKRMA EQU   CVTS01+308                                               01423000
CVTRSPIE EQU   CVTS01+304                                               01424000
CVTRENQ  EQU   CVTS01+300                                               01425000
CVTLQCB  EQU   CVTS01+296                                               01426000
CVTFQCB  EQU   CVTS01+292                                               01427000
CVTQCS01 EQU   CVTS01+288                                               01428000
CVTAPFT  EQU   CVTS01+284                                               01429000
CVTPARRL EQU   CVTS01+280                                               01430000
CVTVWAIT EQU   CVTS01+276                                               01431000
CVTGSPL  EQU   CVTS01+272                                               01432000
CVTLSMQ  EQU   CVTS01+268                                               01433000
CVTGSMQ  EQU   CVTS01+264                                               01434000
CVTEXPRO EQU   CVTS01+260                                               01435000
CVTOPCTP EQU   CVTS01+256                                               01436000
CVTSIC   EQU   CVTS01+252                                               01437000
CVTTPIOS EQU   CVTS01+248                                               01438000
CVTRTMS  EQU   CVTS01+244                                               01439000
CVTSDBF  EQU   CVTS01+240                                               01440000
CVTSCBP  EQU   CVTS01+236                                               01441000
CVTSDMP  EQU   CVTS01+232                                               01442000
CVTSV60  EQU   CVTS01+228                                               01443000
CVTRTMCT EQU   CVTS01+224                                               01444000
CVTASCBL EQU   CVTS01+220                                               01445000
CVTASCBH EQU   CVTS01+216                                               01446000
CVTGDA   EQU   CVTS01+212                                               01447000
CVTASVT  EQU   CVTS01+208                                               01448000
CVTVVMDI EQU   CVTS01+204                                               01449000
CVTAQTOP EQU   CVTS01+200                                               01450000
CVTIOSCS EQU   CVTS01+196                                               01451000
CVTSDRM  EQU   CVTS01+192                                               01452000
CVTOPTE  EQU   CVTS01+188                                               01453000
CVTSTXU  EQU   CVTS01+184                                               01454000
CVTQUIS  EQU   CVTS01+180                                               01455000
CVTPARS  EQU   CVTS01+176                                               01456000
CVTS1EE  EQU   CVTS01+172                                               01457000
CVTFRAS  EQU   CVTS01+168                                               01458000
CVTQSAS  EQU   CVTS01+164                                               01459000
CVTCRAS  EQU   CVTS01+160                                               01460000
CVTCRMN  EQU   CVTS01+156                                               01461000
CVTDELCP EQU   CVTS01+152                                               01462000
CVTFRECL EQU   CVTS01+148                                               01463000
CVTGETCL EQU   CVTS01+144                                               01464000
CVTBLDCP EQU   CVTS01+140                                               01465000
CVTAUTHL EQU   CVTS01+136                                               01466000
CVTSCAN  EQU   CVTS01+132                                               01467000
CVTRV144 EQU   CVTS01+130                                               01468000
CVTMAXMP EQU   CVTS01+128                                               01469000
CVTSTCK  EQU   CVTS01+124                                               01470000
CVTRV139 EQU   CVTS01+123                                               01471000
CVTDSSAC EQU   CVTS01+122                                               01472000
CVTRV513 EQU   CVTS01+121                                               01473000
CVTIOSPL EQU   CVTS01+120                                               01474000
CVTPTGT  EQU   CVTS01+116                                               01475000
CVTCSPIE EQU   CVTS01+112                                               01476000
CVTSMFEX EQU   CVTS01+108                                               01477000
CVTOLT0A EQU   CVTS01+104                                               01478000
CVTSRBRT EQU   CVTS01+100                                               01479000
CVTPUTL  EQU   CVTS01+96                                                01480000
CVTASCRL EQU   CVTS01+92                                                01481000
CVTASCRF EQU   CVTS01+88                                                01482000
CVTRV326 EQU   CVTS01+84                                                01483000
CVTRV325 EQU   CVTS01+80                                                01484000
CVTRV324 EQU   CVTS01+76                                                01485000
CVT0VL01 EQU   CVTS01+72                                                01486000
CVTSHRVM EQU   CVTS01+68                                                01487000
CVTRV332 EQU   CVTS01+64                                                01488000
CVTTAS   EQU   CVTS01+60                                                01489000
CVTRSCN  EQU   CVTS01+56                                                01490000
CVTTRAC2 EQU   CVTS01+54                                                01491000
CVTTRACE EQU   CVTS01+52                                                01492000
CVTAPG   EQU   CVTS01+51                                                01493000
CVTSDTRC EQU   CVTCTLFG                                                 01494000
CVTGTRCE EQU   CVTCTLFG                                                 01495000
CVTNOMP  EQU   CVTCTLFG                                                 01496000
CVTRSV79 EQU   CVTCTLFG                                                 01497000
CVTDSTAT EQU   CVTCTLFG                                                 01498000
CVTRSV78 EQU   CVTCTLFG                                                 01499000
CVTRV333 EQU   CVTCTLFG                                                 01500000
CVTRV323 EQU   CVTCTLFG                                                 01501000
CVTSPVLK EQU   CVTS01+49                                                01502000
CVTRSV77 EQU   CVTS01+48                                                01503000
CVTRV331 EQU   CVTS01+44                                                01504000
CVTRV330 EQU   CVTS01+40                                                01505000
CVTRV329 EQU   CVTS01+36                                                01506000
CVTRV328 EQU   CVTS01+32                                                01507000
CVTRV322 EQU   CVTS01+28                                                01508000
CVTSLID  EQU   CVTSLIDA+1                                               01509000
CVTSYLK  EQU   CVTSLIDA                                                 01510000
CVTRV321 EQU   CVTS01+20                                                01511000
CVTRV320 EQU   CVTS01+16                                                01512000
CVTLPDIR EQU   CVTLPDIA+1                                               01513000
CVTRSV69 EQU   CVTDIRST                                                 01514000
CVTRSV68 EQU   CVTDIRST                                                 01515000
CVTRSV67 EQU   CVTDIRST                                                 01516000
CVTRSV66 EQU   CVTDIRST                                                 01517000
CVTRSV65 EQU   CVTDIRST                                                 01518000
CVTRSV64 EQU   CVTDIRST                                                 01519000
CVTRSV63 EQU   CVTDIRST                                                 01520000
CVTDICOM EQU   CVTDIRST                                                 01521000
CVTPVTP  EQU   CVTS01+8                                                 01522000
CVTLPDSR EQU   CVTS01+4                                                 01523000
CVTGETL  EQU   CVTS01                                                   01524000
ATCAOS   EQU   ISTATCVT+1584                                            01525000
ATCPOPAB EQU   ATCAOSM+640                                              01526000
ATCVIOPM EQU   ATCAOSM+636                                              01527000
ATCTPMMI EQU   ATCAOSM+632                                              01528000
ATCTPMPB EQU   ATCAOSM+600                                              01529000
ATCRSV88 EQU   ATCAOSM+596                                              01530000
ATCRPLCT EQU   ATCAOSM+594                                              01531000
ATCCRACT EQU   ATCAOSM+592                                              01532000
ATCSRBCT EQU   ATCAOSM+590                                              01533000
ATCRSV75 EQU   ATCAOSM+589                                              01534000
ATCRSV66 EQU   ATCZFLAG                                                 01535000
ATCZF001 EQU   ATCZFLAG                                                 01536000
ATCTPCP1 EQU   ATCAOSM+584                                              01537000
ATCTPCP0 EQU   ATCAOSM+580                                              01538000
ATCAICTN EQU   ATCAOSM+576                                              01539000
ATCZR01  EQU   ATCAOSM+572                                              01540000
ATCMPLTA EQU   ATCAOSM+568                                              01541000
ATCASCB  EQU   ATCAOSM+564                                              01542000
ATCAP86  EQU   ATCAOSM+560                                              01543000
ATCAP85  EQU   ATCAOSM+556                                              01544000
ATCAP84  EQU   ATCAOSM+552                                              01545000
ATCAP83  EQU   ATCAOSM+548                                              01546000
ATCAP82  EQU   ATCAOSM+544                                              01547000
ATCAP69  EQU   ATCAOSM+540                                              01548000
ATCAP66  EQU   ATCAOSM+536                                              01549000
ATCAP62  EQU   ATCAOSM+532                                              01550000
ATCAPC59 EQU   ATCAOSM+528                                              01551000
ATCAP56  EQU   ATCAOSM+524                                              01552000
ATCAP55  EQU   ATCAOSM+520                                              01553000
ATCRCFY0 EQU   ATCAOSM+516                                              01554000
ATCAP41  EQU   ATCAOSM+512                                              01555000
ATCAPC25 EQU   ATCAOSM+508                                              01556000
ATCAP23  EQU   ATCAOSM+504                                              01557000
ATCTPSPB EQU   ATCAOSM+472                                              01558000
ATCTRMPB EQU   ATCAOSM+440                                              01559000
ATCAPBE  EQU   ATCAOSM+436                                              01560000
ATCPSTA  EQU   ATCAOSM+432                                              01561000
ATCSMABF EQU   ATCAOSM+428                                              01562000
ATCSMAPR EQU   ATCAOSM+424                                              01563000
ATCTPWQA EQU   ATCAOSM+420                                              01564000
ATCSMAID EQU   ATCAOSM+416                                              01565000
ATCSMARA EQU   ATCAOSM+412                                              01566000
ATCCACXA EQU   ATCAOSM+408                                              01567000
ATCZLAAB EQU   ATCAOSM+404                                              01568000
ATCATA10 EQU   ATCAOSM+400                                              01569000
ATCHLTCB EQU   ATCAOSM+396                                              01570000
@NM00044 EQU   ATCVTFLG                                                 01571000
ATCVTACT EQU   ATCVTFLG                                                 01572000
ATCRPT40 EQU   ATCAOSM+388                                              01573000
ATCRPT39 EQU   ATCAOSM+384                                              01574000
ATCRPT38 EQU   ATCAOSM+380                                              01575000
ATCRPT37 EQU   ATCAOSM+376                                              01576000
ATCRPT36 EQU   ATCAOSM+372                                              01577000
ATCRPT35 EQU   ATCAOSM+368                                              01578000
ATCRPT34 EQU   ATCAOSM+364                                              01579000
ATCRPT33 EQU   ATCAOSM+360                                              01580000
ATCRPT32 EQU   ATCAOSM+356                                              01581000
ATCRPT31 EQU   ATCAOSM+352                                              01582000
ATCRPT30 EQU   ATCAOSM+348                                              01583000
ATCRPT29 EQU   ATCAOSM+344                                              01584000
ATCRPT28 EQU   ATCAOSM+340                                              01585000
ATCRPT27 EQU   ATCAOSM+336                                              01586000
ATCRPT26 EQU   ATCAOSM+332                                              01587000
ATCRPT25 EQU   ATCAOSM+328                                              01588000
ATCRPT24 EQU   ATCAOSM+324                                              01589000
ATCRPT23 EQU   ATCAOSM+320                                              01590000
ATCRPT22 EQU   ATCAOSM+316                                              01591000
ATCRPT21 EQU   ATCAOSM+312                                              01592000
ATCRPT20 EQU   ATCAOSM+308                                              01593000
ATCRPT19 EQU   ATCAOSM+304                                              01594000
ATCRPLAC EQU   ATCRPLCN+2                                               01595000
ATCRPLRC EQU   ATCRPLCN                                                 01596000
ATCCRPLQ EQU   ATCCRPL                                                  01597000
ATCSRBAC EQU   ATCSRBCN+2                                               01598000
ATCSRBRC EQU   ATCSRBCN                                                 01599000
ATCSRBQ  EQU   ATCSRB                                                   01600000
ATCCRAAC EQU   ATCCRACN+2                                               01601000
ATCCRARC EQU   ATCCRACN                                                 01602000
ATCCRAQ  EQU   ATCCRA                                                   01603000
ATCRPT12 EQU   ATCAOSM+276                                              01604000
ATCDMAPP EQU   ATCAOSM+272                                              01605000
ATCAP38  EQU   ATCAOSM+268                                              01606000
ATCZDFJ0 EQU   ATCAOSM+260                                              01607000
ATCAP51  EQU   ATCAOSM+256                                              01608000
ATCZPAB2 EQU   ATCAOSM+224                                              01609000
ATCZPAB1 EQU   ATCAOSM+192                                              01610000
ATCZLFVT EQU   ATCAOSM+188                                              01611000
ATCZLPVT EQU   ATCAOSM+184                                              01612000
ATCZDVTX EQU   ATCAOSM+180                                              01613000
ATCZDVTA EQU   ATCAOSM+176                                              01614000
ATCZDVT9 EQU   ATCAOSM+172                                              01615000
ATCZDVT8 EQU   ATCAOSM+168                                              01616000
ATCZDVT7 EQU   ATCAOSM+164                                              01617000
ATCRSV56 EQU   ATCDAPVT+22                                              01618000
ATCDAPDG EQU   ATCDAPVT+20                                              01619000
ATCDXCEA EQU   ATCDAPVT+16                                              01620000
ATCDCEA  EQU   ATCDAPVT+12                                              01621000
ATCDPCIA EQU   ATCDAPVT+8                                               01622000
ATCDSIOA EQU   ATCDAPVT+4                                               01623000
ATCDEOEA EQU   ATCDAPVT                                                 01624000
ATCZLAEA EQU   ATCLDAPP+16                                              01625000
ATCZLCEA EQU   ATCLDAPP+12                                              01626000
ATCRSV17 EQU   ATCLDAPP+8                                               01627000
ATCSMFRR EQU   ATCLDAPP+4                                               01628000
ATCCDTID EQU   ATCLDAPP                                                 01629000
ATCZAEA  EQU   ATCICAPP+16                                              01630000
ATCZCEA  EQU   ATCICAPP+12                                              01631000
ATCCDTCB EQU   ATCICAPP+8                                               01632000
ATCZSIOA EQU   ATCICAPP+4                                               01633000
ATCCDRPH EQU   ATCICAPP                                                 01634000
ATCAP65  EQU   ATCAOSM+96                                               01635000
ATCZDVT6 EQU   ATCAOSM+92                                               01636000
ATCZDVT4 EQU   ATCAOSM+88                                               01637000
ATCZDVT3 EQU   ATCAOSM+84                                               01638000
ATCZDVT1 EQU   ATCAOSM+80                                               01639000
ATCICNCB EQU   ATCAOSM+76                                               01640000
ATCZPSVT EQU   ATCAOSM+72                                               01641000
ATCZFSVT EQU   ATCAOSM+68                                               01642000
ATCAP64  EQU   ATCAOSM+64                                               01643000
ATCAP63  EQU   ATCAOSM+60                                               01644000
ATCAP61  EQU   ATCAOSM+56                                               01645000
ATCAP58  EQU   ATCAOSM+52                                               01646000
ATCAP57  EQU   ATCAOSM+48                                               01647000
ATCAP54  EQU   ATCAOSM+44                                               01648000
ATCAP53  EQU   ATCAOSM+40                                               01649000
ATCAP52  EQU   ATCAOSM+36                                               01650000
ATCAP32  EQU   ATCAOSM+28                                               01651000
ATCAP12  EQU   ATCAOSM+20                                               01652000
ATCAP11  EQU   ATCAOSM+16                                               01653000
ATCCMTCB EQU   ATCAOSM+12                                               01654000
ATCPRPH  EQU   ATCAOSM+8                                                01655000
ATCGSRBF EQU   ATCGSRBG                                                 01656000
ATCSRBRT EQU   ATCAOSM                                                  01657000
@NM00043 EQU   @NM00042                                                 01658000
ATCVTMAB EQU   @NM00042                                                 01659000
@NM00041 EQU   ATCVTBAM                                                 01660000
ATCVDLOK EQU   ISTATCVT+904                                             01661000
ATCVFPAB EQU   ISTATCVT+872                                             01662000
ATCVDPAB EQU   ISTATCVT+840                                             01663000
ATCIOECB EQU   ISTATCVT+836                                             01664000
ATCINCW3 EQU   ISTATCVT+832                                             01665000
ATCMODTB EQU   ISTATCVT+828                                             01666000
ATCUSSPT EQU   ISTATCVT+824                                             01667000
ATCSRTAB EQU   ISTATCVT+820                                             01668000
@NM00040 EQU   ISTATCVT+819                                             01669000
@NM00039 EQU   ATCSTAT2                                                 01670000
ATCTRSMS EQU   ATCSTAT2                                                 01671000
ATCTRLOK EQU   ATCSTAT2                                                 01672000
ATCTRPSS EQU   ATCSTAT2                                                 01673000
ATCTRESC EQU   ATCSTAT2                                                 01674000
ATCTRAPI EQU   ATCSTAT2                                                 01675000
ATCNMCTR EQU   ISTATCVT+816                                             01676000
ATCSEC51 EQU   ATCSECST                                                 01677000
ATCSEC40 EQU   ATCSIPD+8                                                01678000
ATCSEC30 EQU   ATCSIPD+4                                                01679000
ATCSEC21 EQU   ATCSIPD                                                  01680000
ATCSEC10 EQU   ATCSOPD+4                                                01681000
ATCSEC01 EQU   ATCSOPD                                                  01682000
ATCPOIA  EQU   ATCRNO+1                                                 01683000
@NM00038 EQU   ATCRNO                                                   01684000
ATCPODVT EQU   ISTATCVT+784                                             01685000
ATCS49XL EQU   ISTATCVT+780                                             01686000
ATCS49XI EQU   ISTATCVT+776                                             01687000
ATCLCLCT EQU   ATCVLCNT+2                                               01688000
ATCRNCNT EQU   ATCVLCNT                                                 01689000
ATCCFEAD EQU   ISTATCVT+768                                             01690000
ATCPTR00 EQU   ISTATCVT+736                                             01691000
ATCRSV10 EQU   ISTATCVT+704                                             01692000
ATCTACB  EQU   ISTATCVT+700                                             01693000
ATCVTINM EQU   ISTATCVT+696                                             01694000
ATCTCLIM EQU   ISTATCVT+692                                             01695000
ATCTCLOM EQU   ISTATCVT+688                                             01696000
ATCVTIPB EQU   ISTATCVT+656                                             01697000
ATCTCIPB EQU   ISTATCVT+624                                             01698000
ATCTIPAB EQU   ISTATCVT+592                                             01699000
ATCOCCCB EQU   ISTATCVT+588                                             01700000
ATCOCCOB EQU   ISTATCVT+584                                             01701000
ATCCDLAD EQU   ISTATCVT+580                                             01702000
ATCCCLAD EQU   ISTATCVT+576                                             01703000
ATCDLRPB EQU   ISTATCVT+544                                             01704000
ATCPGPAB EQU   ISTATCVT+512                                             01705000
ATCVPAB1 EQU   ISTATCVT+480                                             01706000
ATCRSV97 EQU   ISTATCVT+476                                             01707000
ATCRDTLK EQU   ISTATCVT+472                                             01708000
ATCVOCLK EQU   ISTATCVT+468                                             01709000
ATCCDFDN EQU   ISTATCVT+464                                             01710000
ATCCDFIN EQU   ISTATCVT+460                                             01711000
ATCDVTLK EQU   ISTATCVT+456                                             01712000
ATCAP36  EQU   ISTATCVT+452                                             01713000
ATCAP35  EQU   ISTATCVT+448                                             01714000
ATCAP33  EQU   ISTATCVT+444                                             01715000
ATCRSV99 EQU   ISTATCVT+440                                             01716000
ATCONFIG EQU   ISTATCVT+432                                             01717000
ATCNODDS EQU   ISTATCVT+428                                             01718000
ATCNODEL EQU   ISTATCVT+420                                             01719000
ATCRSV69 EQU   ISTATCVT+416                                             01720000
ATCAPCR5 EQU   ISTATCVT+412                                             01721000
ATCLDECB EQU   ISTATCVT+408                                             01722000
ATCLDNCS EQU   ISTATCVT+404                                             01723000
ATCCDPTR EQU   ISTATCVT+400                                             01724000
ATCADEL  EQU   ISTATCVT+396                                             01725000
ATCTODVT EQU   ISTATCVT+392                                             01726000
ATCDEBCH EQU   ISTATCVT+388                                             01727000
ATCHBSIZ EQU   ATCHPGM+2                                                01728000
ATCHBFNO EQU   ATCHPGM                                                  01729000
ATCCRME  EQU   ISTATCVT+380                                             01730000
ATCRVCHS EQU   ISTATCVT+372                                             01731000
ATCECTLP EQU   ISTATCVT+368                                             01732000
ATCZDVTB EQU   ISTATCVT+364                                             01733000
ATCECPRT EQU   ISTATCVT+360                                             01734000
ATCVTLOD EQU   ISTATCVT+356                                             01735000
ATCTRPAB EQU   ISTATCVT+352                                             01736000
ATCMSGM  EQU   ISTATCVT+348                                             01737000
ATCMSGP  EQU   ISTATCVT+344                                             01738000
ATCEPT   EQU   ISTATCVT+340                                             01739000
ATCDVT   EQU   ISTATCVT+336                                             01740000
ATCTRCPT EQU   ISTATCVT+332                                             01741000
ATCDVLOD EQU   ISTATCVT+328                                             01742000
ATCALERT EQU   ISTATCVT+324                                             01743000
ATCEPA   EQU   ISTATCVT+320                                             01744000
ATCSAF   EQU   ISTATCVT+318                                             01745000
ATCXRANG EQU   ISTATCVT+317                                             01746000
ATCLAST  EQU   ATCSHRFG                                                 01747000
ATCSHRTN EQU   ISTATCVT+308                                             01748000
ATCUEP   EQU   ISTATCVT+304                                             01749000
ATCOCRT  EQU   ISTATCVT+300                                             01750000
ATCCSMA  EQU   ATCCSMR                                                  01751000
ATCESC02 EQU   ISTATCVT+292                                             01752000
ATCESC01 EQU   ISTATCVT+288                                             01753000
ATCCDFND EQU   ISTATCVT+284                                             01754000
ATCCDDEL EQU   ISTATCVT+280                                             01755000
ATCCDADD EQU   ISTATCVT+276                                             01756000
ATCMNT   EQU   ISTATCVT+272                                             01757000
ATCRSV16 EQU   ISTATCVT+270                                             01758000
ATCMAXID EQU   ISTATCVT+269                                             01759000
ATCMSGSP EQU   ATCCOM+268                                               01760000
ATCCIDM  EQU   ATCCOM+266                                               01761000
ATCACTRM EQU   ATCCOM+264                                               01762000
ATCNERAP EQU   ATCCOM+260                                               01763000
ATCNESAL EQU   ATCCOM+256                                               01764000
ATCRCC65 EQU   ATCCOM+252                                               01765000
ATCRCC26 EQU   ATCCOM+248                                               01766000
ATCRCC63 EQU   ATCCOM+244                                               01767000
ATCRSV11 EQU   ATCCOM+242                                               01768000
ATCVTMID EQU   ATCCOM+240                                               01769000
ATCAPOST EQU   ATCCOM+236                                               01770000
ATCNERFN EQU   ATCCOM+232                                               01771000
ATCNERNE EQU   ATCCOM+228                                               01772000
ATCNERCV EQU   ATCCOM+224                                               01773000
ATCNERST EQU   ATCCOM+220                                               01774000
ATCDCC61 EQU   ATCCOM+216                                               01775000
ATCDCC60 EQU   ATCCOM+212                                               01776000
ATCSRTDF EQU   ATCCOM+208                                               01777000
ATCSRTAD EQU   ATCCOM+204                                               01778000
ATCFIRA  EQU   ATCCOM+200                                               01779000
ATCSMBQ  EQU   ATCCOM+196                                               01780000
ATCSMRC  EQU   ATCCOM+192                                               01781000
ATCSMQU  EQU   ATCCOM+184                                               01782000
ATCSMRQ  EQU   ATCCOM+180                                               01783000
ATCACDA  EQU   ATCCOM+176                                               01784000
ATCSTMA  EQU   ATCCOM+172                                               01785000
ATCFRSTR EQU   ATCCOM+168                                               01786000
ATCGTSTR EQU   ATCCOM+164                                               01787000
ATCREADA EQU   ATCCOM+160                                               01788000
ATCALOAD EQU   ATCCOM+156                                               01789000
ATCBLDLA EQU   ATCCOM+152                                               01790000
ATCFBRPH EQU   ATCCOM+148                                               01791000
ATCBFTRC EQU   ATCCOM+144                                               01792000
ATCTPBUF EQU   ATCTHTRC                                                 01793000
ATCREMOV EQU   ATCCOM+136                                               01794000
ATCADD   EQU   ATCCOM+132                                               01795000
ATCDVTPT EQU   ATCCOM+124                                               01796000
ATCFEPT  EQU   ATCCOM+120                                               01797000
ATCFDVT  EQU   ATCCOM+116                                               01798000
ATCCONFT EQU   ATCCOM+112                                               01799000
ATCPTCHA EQU   ATCCOM+108                                               01800000
ATCAUTHA EQU   ATCCOM+104                                               01801000
ATCACCTA EQU   ATCCOM+100                                               01802000
ATCRDTH  EQU   ATCCOM+96                                                01803000
ATCFRSCH EQU   ATCCOM+92                                                01804000
ATCFSB   EQU   ATCCOM+88                                                01805000
ATCHLTMS EQU   ATCCOM+84                                                01806000
ATCECPRM EQU   ATCCOM+80                                                01807000
ATCECNET EQU   ATCCOM+76                                                01808000
ATCECOPC EQU   ATCCOM+72                                                01809000
ATCVPARM EQU   ATCCOM+68                                                01810000
ATCECVRQ EQU   ATCCOM+64                                                01811000
ATCECSES EQU   ATCCOM+60                                                01812000
ATCOCHA  EQU   ATCCOM+56                                                01813000
ATCDSPLQ EQU   ATCCOM+52                                                01814000
ATCECDSP EQU   ATCCOM+48                                                01815000
ATCVARYQ EQU   ATCCOM+44                                                01816000
ATCECVRY EQU   ATCCOM+40                                                01817000
ATCHALTQ EQU   ATCCOM+36                                                01818000
ATCECHLT EQU   ATCCOM+32                                                01819000
ATCMODQ  EQU   ATCCOM+28                                                01820000
ATCECMOD EQU   ATCCOM+24                                                01821000
ATCASCHD EQU   ATCCOM+20                                                01822000
ATCSRT   EQU   ATCCOM+16                                                01823000
ATCRDT   EQU   ATCCOM+12                                                01824000
ATCDCFRR EQU   ATCCOM+8                                                 01825000
ATCAPI   EQU   ATCCOM+4                                                 01826000
ATCRSV04 EQU   ATCSTAT4                                                 01827000
ATCVTTRC EQU   ATCSTAT4                                                 01828000
ATCNCSD  EQU   ATCSTAT4                                                 01829000
ATCMTST  EQU   ATCSTAT4                                                 01830000
ATCTPRT  EQU   ATCSTAT4                                                 01831000
ATCPRTAT EQU   ATCSTAT4                                                 01832000
@NM00037 EQU   ATCPOFLG                                                 01833000
ATCPOUNS EQU   ATCPOFLG                                                 01834000
ATCHSDMF EQU   ATCSTFLG                                                 01835000
@NM00036 EQU   ATCSTAT1                                                 01836000
ATCMDHLT EQU   ATCSTAT1                                                 01837000
ATCINHLT EQU   ATCSTAT1                                                 01838000
ATCNETSL EQU   ATCSTAT1                                                 01839000
ATCQKHLT EQU   ATCSTAT1                                                 01840000
ATCSNHLT EQU   ATCSTAT1                                                 01841000
ATCACTIV EQU   ATCSTAT1                                                 01842000
ATCSTART EQU   ATCSTAT1                                                 01843000
DYPPAB   EQU   ISTDYPAB+16                                              01844000
DYPRSV01 EQU   ISTDYPAB+12                                              01845000
DYPTSKID EQU   ISTDYPAB+8                                               01846000
DYPCHAIN EQU   ISTDYPAB+4                                               01847000
DYPFLGS  EQU   ISTDYPAB+2                                               01848000
DYPLNGTH EQU   ISTDYPAB+1                                               01849000
DYPTYPE  EQU   ISTDYPAB                                                 01850000
CRACHAIN EQU   ISTCRA+928                                               01851000
CRARSV02 EQU   ISTCRA+924                                               01852000
CRARSV01 EQU   ISTCRA+920                                               01853000
CRABFTBA EQU   CRABUFA                                                  01854000
CRAMASK  EQU   CRASVC+64                                                01855000
CRAHSIZ  EQU   CRASVC+60                                                01856000
CRAASCRR EQU   CRASVC                                                   01857000
CRAPSS   EQU   ISTCRA+160                                               01858000
CRARPH   EQU   ISTCRA+52                                                01859000
CRALAPTR EQU   CRABASIC+48                                              01860000
CRAL9PTR EQU   CRABASIC+44                                              01861000
CRAL8PTR EQU   CRABASIC+40                                              01862000
CRAL7PTR EQU   CRABASIC+36                                              01863000
CRAL6PTR EQU   CRABASIC+32                                              01864000
CRAL5PTR EQU   CRABASIC+28                                              01865000
CRAL4PTR EQU   CRABASIC+24                                              01866000
CRAL3PTR EQU   CRABASIC+20                                              01867000
CRAL2PTR EQU   CRABASIC+16                                              01868000
CRAL1PTR EQU   CRABASIC+12                                              01869000
CRALEV01 EQU   CRALKACT+3                                               01870000
CRALEV02 EQU   CRALKACT+3                                               01871000
CRALEV03 EQU   CRALKACT+3                                               01872000
CRALEV04 EQU   CRALKACT+3                                               01873000
CRALEV05 EQU   CRALKACT+3                                               01874000
CRALEV06 EQU   CRALKACT+3                                               01875000
CRALEV07 EQU   CRALKACT+3                                               01876000
CRALEV08 EQU   CRALKACT+3                                               01877000
CRALEV09 EQU   CRALKACT+2                                               01878000
CRALEV10 EQU   CRALKACT+2                                               01879000
CRALEV11 EQU   CRALKACT+2                                               01880000
CRALEV12 EQU   CRALKACT+2                                               01881000
CRALEV13 EQU   CRALKACT+2                                               01882000
CRALEV14 EQU   CRALKACT+2                                               01883000
CRALEV15 EQU   CRALKACT+2                                               01884000
CRALEV16 EQU   CRALKACT+2                                               01885000
CRALEV17 EQU   CRALKACT+1                                               01886000
CRALEV18 EQU   CRALKACT+1                                               01887000
CRALEV19 EQU   CRALKACT+1                                               01888000
CRALEV20 EQU   CRALKACT+1                                               01889000
CRALEV21 EQU   CRALKACT+1                                               01890000
CRALEV22 EQU   CRALKACT+1                                               01891000
CRALEV23 EQU   CRALKACT+1                                               01892000
CRALEV24 EQU   CRALKACT+1                                               01893000
CRALEV25 EQU   CRALKACT                                                 01894000
CRALEV26 EQU   CRALKACT                                                 01895000
CRALEV27 EQU   CRALKACT                                                 01896000
CRALEV28 EQU   CRALKACT                                                 01897000
CRALEV29 EQU   CRALKACT                                                 01898000
CRALEV30 EQU   CRALKACT                                                 01899000
CRALEV31 EQU   CRALKACT                                                 01900000
CRALEV32 EQU   CRALKACT                                                 01901000
CRAFRR   EQU   CRAHDR+4                                                 01902000
@NM00035 EQU   ISTAPCRR+137                                             01903000
@NM00034 EQU   APC57FLG                                                 01904000
APCNREL  EQU   APC57FLG                                                 01905000
APCRECRA EQU   APC57FLG                                                 01906000
@NM00033 EQU   APC54FLG                                                 01907000
APCRLST  EQU   APC54FLG                                                 01908000
APCPR153 EQU   APC53FLG                                                 01909000
@NM00032 EQU   APC52FLG                                                 01910000
APCWKF   EQU   APC52FLG                                                 01911000
APCNWF   EQU   APC52FLG                                                 01912000
APCRDQ   EQU   APC52FLG                                                 01913000
APCQENQ  EQU   APC52FLG                                                 01914000
APCSMSR  EQU   APC52FLG                                                 01915000
APCCKRQ  EQU   APC52FLG                                                 01916000
@NM00031 EQU   APC31FLG                                                 01917000
APCSORT  EQU   APC31FLG                                                 01918000
APCRESCH EQU   APC31FLG                                                 01919000
APCTPXIT EQU   APC31FLG                                                 01920000
APCSWTWD EQU   ISTAPCRR+128                                             01921000
APCSAV2  EQU   ISTAPCRR+124                                             01922000
APCSAV1  EQU   ISTAPCRR+120                                             01923000
APCRETCD EQU   APCCOMF+2                                                01924000
@NM00030 EQU   APCCOMF1+1                                               01925000
APCZLBER EQU   APCCOMF1                                                 01926000
APCEXIT  EQU   APCCOMF1                                                 01927000
APCRELR  EQU   APCCOMF1                                                 01928000
APCIRB2  EQU   APCCOMF1                                                 01929000
APCIRB1  EQU   APCCOMF1                                                 01930000
APCSMCR  EQU   APCCOMF1                                                 01931000
APCUETSK EQU   APCCOMF1                                                 01932000
APCSSTSK EQU   APCCOMF1                                                 01933000
APCESTAL EQU   APCSAVE                                                  01934000
APCFRRPM EQU   ISTAPCRR+40                                              01935000
APCQWFO  EQU   ISTAPCRR+36                                              01936000
APCPABSV EQU   ISTAPCRR+32                                              01937000
APCRTRN  EQU   ISTAPCRR+28                                              01938000
APCTCBA  EQU   ISTAPCRR+24                                              01939000
APCPSTA  EQU   ISTAPCRR+20                                              01940000
@NM00029 EQU   APCRFLG+1                                                01941000
APC31R   EQU   APCRFLG                                                  01942000
APC58R   EQU   APCRFLG                                                  01943000
APC57R   EQU   APCRFLG                                                  01944000
APC56R   EQU   APCRFLG                                                  01945000
APC54R   EQU   APCRFLG                                                  01946000
APC53R   EQU   APCRFLG                                                  01947000
APC52R   EQU   APCRFLG                                                  01948000
APC51R   EQU   APCRFLG                                                  01949000
@NM00028 EQU   APCATFLG+1                                               01950000
APC31E   EQU   APCATFLG                                                 01951000
APC58E   EQU   APCATFLG                                                 01952000
APC57E   EQU   APCATFLG                                                 01953000
APC56E   EQU   APCATFLG                                                 01954000
APC54E   EQU   APCATFLG                                                 01955000
APC53E   EQU   APCATFLG                                                 01956000
APC52E   EQU   APCATFLG                                                 01957000
APC51E   EQU   APCATFLG                                                 01958000
APCHDRSV EQU   ISTAPCRR                                                 01959000
ASCPSREG EQU   ISTASCRR+44                                              01960000
ASCUSR01 EQU   ASCUSRGS+12                                              01961000
ASCUSR00 EQU   ASCUSRGS+8                                               01962000
ASCUSR15 EQU   ASCUSRGS+4                                               01963000
ASCUSR14 EQU   ASCUSRGS                                                 01964000
ASCETRYA EQU   ISTASCRR+24                                              01965000
ASCKEY   EQU   ISTASCRR+23                                              01966000
ASCAUDIT EQU   ASCFLG3                                                  01967000
ASCFBDUD EQU   ASCFLG3                                                  01968000
ASCLLKF  EQU   ASCFLG3                                                  01969000
ASCKEYF  EQU   ASCFLG3                                                  01970000
ASCFBDAL EQU   ASCFLG3                                                  01971000
ASCFSRGT EQU   ASCFLG3                                                  01972000
ASCICR   EQU   ASCFLG2                                                  01973000
ASCFSRIC EQU   ASCFLG2                                                  01974000
ASCFBDIC EQU   ASCFLG2                                                  01975000
ASCFBAIC EQU   ASCFLG2                                                  01976000
ASCPASTR EQU   ASCFLG1                                                  01977000
ASCFSR   EQU   ASCFLG1                                                  01978000
ASCFBD   EQU   ASCFLG1                                                  01979000
ASCFBA   EQU   ASCFLG1                                                  01980000
ASCPFCRR EQU   ISTASCRR                                                 01981000
ZCRRU    EQU   ZCRRHRU+3                                                01982000
ZCRRH    EQU   ZCRRHRU                                                  01983000
ZCRWORDA EQU   ISTZCRR+477                                              01984000
ZCRCMNRC EQU   ISTZCRR+476                                              01985000
ZCRRSV97 EQU   ZCRENTER+18                                              01986000
ZCREIC2B EQU   ZCRENTER+18                                              01987000
ZCREAC2B EQU   ZCRENTER+18                                              01988000
ZCRELCAB EQU   ZCRENTER+18                                              01989000
ZCREDCMF EQU   ZCRENTER+18                                              01990000
ZCREBCIF EQU   ZCRENTER+18                                              01991000
ZCREICSG EQU   ZCRENTER+18                                              01992000
ZCREDCK0 EQU   ZCRENTER+18                                              01993000
ZCRECFY0 EQU   ZCRENTER+17                                              01994000
ZCREKCCB EQU   ZCRENTER+17                                              01995000
ZCREDCNB EQU   ZCRENTER+17                                              01996000
ZCREICOE EQU   ZCRENTER+17                                              01997000
ZCREBCNB EQU   ZCRENTER+17                                              01998000
ZCREBC0L EQU   ZCRENTER+17                                              01999000
ZCREBCAL EQU   ZCRENTER+17                                              02000000
ZCREDCQR EQU   ZCRENTER+17                                              02001000
ZCREDCPR EQU   ZCRENTER+16                                              02002000
ZCREBCSB EQU   ZCRENTER+16                                              02003000
ZCREAC1R EQU   ZCRENTER+16                                              02004000
ZCRECCCI EQU   ZCRENTER+16                                              02005000
ZCRECCAI EQU   ZCRENTER+16                                              02006000
ZCRECCBI EQU   ZCRENTER+16                                              02007000
ZCREBCAR EQU   ZCRENTER+16                                              02008000
ZCREBCDR EQU   ZCRENTER+16                                              02009000
ZCREBCBR EQU   ZCRENTER+15                                              02010000
ZCREDCXR EQU   ZCRENTER+15                                              02011000
ZCREDCWB EQU   ZCRENTER+15                                              02012000
ZCREDCWR EQU   ZCRENTER+15                                              02013000
ZCREKCCN EQU   ZCRENTER+15                                              02014000
ZCREKCBN EQU   ZCRENTER+15                                              02015000
ZCREKCBB EQU   ZCRENTER+15                                              02016000
ZCREJC0B EQU   ZCRENTER+15                                              02017000
ZCREJCDB EQU   ZCRENTER+14                                              02018000
ZCREJCCB EQU   ZCRENTER+14                                              02019000
ZCREJCBB EQU   ZCRENTER+14                                              02020000
ZCREJCAB EQU   ZCRENTER+14                                              02021000
ZCREIC1B EQU   ZCRENTER+14                                              02022000
ZCREIC0B EQU   ZCRENTER+14                                              02023000
ZCREICX0 EQU   ZCRENTER+14                                              02024000
ZCREICWB EQU   ZCRENTER+14                                              02025000
ZCREICVB EQU   ZCRENTER+13                                              02026000
ZCREICUB EQU   ZCRENTER+13                                              02027000
ZCREICTB EQU   ZCRENTER+13                                              02028000
ZCREICSC EQU   ZCRENTER+13                                              02029000
ZCREICSB EQU   ZCRENTER+13                                              02030000
ZCREICRB EQU   ZCRENTER+13                                              02031000
ZCREICQB EQU   ZCRENTER+13                                              02032000
ZCREICQA EQU   ZCRENTER+13                                              02033000
ZCREICOB EQU   ZCRENTER+12                                              02034000
ZCREICOA EQU   ZCRENTER+12                                              02035000
ZCREICNB EQU   ZCRENTER+12                                              02036000
ZCREICNA EQU   ZCRENTER+12                                              02037000
ZCREICMB EQU   ZCRENTER+12                                              02038000
ZCREICLB EQU   ZCRENTER+12                                              02039000
ZCREICKG EQU   ZCRENTER+12                                              02040000
ZCREICKE EQU   ZCRENTER+12                                              02041000
ZCREICKB EQU   ZCRENTER+11                                              02042000
ZCREICJB EQU   ZCRENTER+11                                              02043000
ZCREICID EQU   ZCRENTER+11                                              02044000
ZCREICIB EQU   ZCRENTER+11                                              02045000
ZCREICHB EQU   ZCRENTER+11                                              02046000
ZCREICGB EQU   ZCRENTER+11                                              02047000
ZCREICEB EQU   ZCRENTER+11                                              02048000
ZCREICDB EQU   ZCRENTER+11                                              02049000
ZCREICCI EQU   ZCRENTER+10                                              02050000
ZCREICCB EQU   ZCRENTER+10                                              02051000
ZCREICBI EQU   ZCRENTER+10                                              02052000
ZCREICBB EQU   ZCRENTER+10                                              02053000
ZCREICAB EQU   ZCRENTER+10                                              02054000
ZCREICAA EQU   ZCRENTER+10                                              02055000
ZCREHCAN EQU   ZCRENTER+10                                              02056000
ZCREGC0B EQU   ZCRENTER+10                                              02057000
ZCREGC0A EQU   ZCRENTER+9                                               02058000
ZCREGCLA EQU   ZCRENTER+9                                               02059000
ZCREGCEB EQU   ZCRENTER+9                                               02060000
ZCREGCDB EQU   ZCRENTER+9                                               02061000
@NM00027 EQU   ZCRENTER+9                                               02062000
ZCREGCBB EQU   ZCRENTER+9                                               02063000
ZCREGCAB EQU   ZCRENTER+9                                               02064000
ZCREFCEB EQU   ZCRENTER+9                                               02065000
ZCREFCEA EQU   ZCRENTER+8                                               02066000
ZCREECTA EQU   ZCRENTER+8                                               02067000
ZCREECEA EQU   ZCRENTER+8                                               02068000
ZCREECDA EQU   ZCRENTER+8                                               02069000
ZCREECCB EQU   ZCRENTER+8                                               02070000
ZCREECCA EQU   ZCRENTER+8                                               02071000
ZCREECBB EQU   ZCRENTER+8                                               02072000
ZCREECBA EQU   ZCRENTER+8                                               02073000
ZCREDCMB EQU   ZCRENTER+7                                               02074000
ZCREDCL0 EQU   ZCRENTER+7                                               02075000
ZCREDCKB EQU   ZCRENTER+7                                               02076000
ZCREDCKA EQU   ZCRENTER+7                                               02077000
ZCREDCJ0 EQU   ZCRENTER+7                                               02078000
ZCREDCI0 EQU   ZCRENTER+7                                               02079000
ZCREDCH0 EQU   ZCRENTER+7                                               02080000
ZCREDCF0 EQU   ZCRENTER+7                                               02081000
ZCREDCE0 EQU   ZCRENTER+6                                               02082000
ZCREDCD0 EQU   ZCRENTER+6                                               02083000
ZCREDCC0 EQU   ZCRENTER+6                                               02084000
ZCREDCB0 EQU   ZCRENTER+6                                               02085000
ZCREDCA0 EQU   ZCRENTER+6                                               02086000
ZCRECC2B EQU   ZCRENTER+6                                               02087000
ZCRECC1B EQU   ZCRENTER+6                                               02088000
ZCRECC1A EQU   ZCRENTER+6                                               02089000
ZCRECC0B EQU   ZCRENTER+5                                               02090000
ZCRECC0A EQU   ZCRENTER+5                                               02091000
ZCREBC0B EQU   ZCRENTER+5                                               02092000
ZCREBC0A EQU   ZCRENTER+5                                               02093000
ZCREBCZ0 EQU   ZCRENTER+5                                               02094000
ZCREBCY0 EQU   ZCRENTER+5                                               02095000
ZCREBCX0 EQU   ZCRENTER+5                                               02096000
ZCREBCXA EQU   ZCRENTER+5                                               02097000
ZCREBCSC EQU   ZCRENTER+4                                               02098000
ZCREBCRB EQU   ZCRENTER+4                                               02099000
ZCREBCRA EQU   ZCRENTER+4                                               02100000
ZCREBCQB EQU   ZCRENTER+4                                               02101000
ZCREBCPB EQU   ZCRENTER+4                                               02102000
ZCREBCOB EQU   ZCRENTER+4                                               02103000
ZCREBCNE EQU   ZCRENTER+4                                               02104000
ZCREBCND EQU   ZCRENTER+4                                               02105000
ZCREBCMB EQU   ZCRENTER+3                                               02106000
ZCREBCLB EQU   ZCRENTER+3                                               02107000
ZCREBCLA EQU   ZCRENTER+3                                               02108000
ZCREBCKB EQU   ZCRENTER+3                                               02109000
ZCREBCKA EQU   ZCRENTER+3                                               02110000
ZCREBCJB EQU   ZCRENTER+3                                               02111000
ZCREBCJA EQU   ZCRENTER+3                                               02112000
ZCREBCID EQU   ZCRENTER+3                                               02113000
ZCREBCIB EQU   ZCRENTER+2                                               02114000
ZCREBCIA EQU   ZCRENTER+2                                               02115000
ZCREBCHB EQU   ZCRENTER+2                                               02116000
ZCREBCHA EQU   ZCRENTER+2                                               02117000
ZCREBCGB EQU   ZCRENTER+2                                               02118000
ZCREBCGA EQU   ZCRENTER+2                                               02119000
ZCREBCFB EQU   ZCRENTER+2                                               02120000
ZCREBCFA EQU   ZCRENTER+2                                               02121000
ZCREBCEB EQU   ZCRENTER+1                                               02122000
ZCREBCDI EQU   ZCRENTER+1                                               02123000
ZCREBCCB EQU   ZCRENTER+1                                               02124000
ZCREBCBI EQU   ZCRENTER+1                                               02125000
ZCREBCBB EQU   ZCRENTER+1                                               02126000
ZCREBCBA EQU   ZCRENTER+1                                               02127000
ZCREBCAM EQU   ZCRENTER+1                                               02128000
ZCREBCAI EQU   ZCRENTER+1                                               02129000
ZCREBCAG EQU   ZCRENTER                                                 02130000
ZCREBCAE EQU   ZCRENTER                                                 02131000
ZCREBCAB EQU   ZCRENTER                                                 02132000
ZCREBCAA EQU   ZCRENTER                                                 02133000
ZCREAC1B EQU   ZCRENTER                                                 02134000
ZCREAC0B EQU   ZCRENTER                                                 02135000
ZCREAC0A EQU   ZCRENTER                                                 02136000
ZCREAC1A EQU   ZCRENTER                                                 02137000
ZCRTNAME EQU   ZCRAUDIT+1                                               02138000
ZCRTID   EQU   ZCRAUDIT                                                 02139000
ZCRREMIC EQU   ISTZCRR+436                                              02140000
ZCRSAVEZ EQU   ISTZCRR+196                                              02141000
ZCRDAFSV EQU   ZCRCIDSV+2                                               02142000
ZCRSAFSV EQU   ZCRCIDSV                                                 02143000
ZCRR13SV EQU   ISTZCRR+188                                              02144000
ZCRR2SV  EQU   ISTZCRR+184                                              02145000
ZCROPCDE EQU   ISTZCRR+183                                              02146000
ZCRPRMTC EQU   ISTZCRR+182                                              02147000
ZCRRCDSV EQU   ISTZCRR+181                                              02148000
ZCRAWQSW EQU   ISTZCRR+180                                              02149000
ZCRTOPQ  EQU   ISTZCRR+180                                              02150000
ZCRLSTFB EQU   ISTZCRR+180                                              02151000
ZCRXSCHD EQU   ISTZCRR+180                                              02152000
ZCRNXTEL EQU   ISTZCRR+180                                              02153000
ZCRSCANQ EQU   ISTZCRR+180                                              02154000
ZCRMOREL EQU   ISTZCRR+180                                              02155000
ZCRFBPRC EQU   ISTZCRR+180                                              02156000
ZCRFSBSV EQU   ISTZCRR+176                                              02157000
ZCRSVWK5 EQU   ZCRWKARA+16                                              02158000
ZCRSVWK4 EQU   ZCRWKARA+12                                              02159000
ZCRSVWK3 EQU   ZCRWKARA+8                                               02160000
ZCRSVWK2 EQU   ZCRWKARA+4                                               02161000
ZCRSVWK1 EQU   ZCRWKARA                                                 02162000
ZCRSVF25 EQU   ZCRSVRTN+96                                              02163000
ZCRSVF24 EQU   ZCRSVRTN+92                                              02164000
ZCRSVF23 EQU   ZCRSVRTN+88                                              02165000
ZCRSVF22 EQU   ZCRSVRTN+84                                              02166000
ZCRSVF21 EQU   ZCRSVRTN+80                                              02167000
ZCRSVF20 EQU   ZCRSVRTN+76                                              02168000
ZCRSVF19 EQU   ZCRSVRTN+72                                              02169000
ZCRSVF18 EQU   ZCRSVRTN+68                                              02170000
ZCRSVF17 EQU   ZCRSVRTN+64                                              02171000
ZCRSVF16 EQU   ZCRSVRTN+60                                              02172000
ZCRSVF15 EQU   ZCRSVRTN+56                                              02173000
ZCRSVF14 EQU   ZCRSVRTN+52                                              02174000
ZCRSVF13 EQU   ZCRSVRTN+48                                              02175000
ZCRSVF12 EQU   ZCRSVRTN+44                                              02176000
ZCRSVF11 EQU   ZCRSVRTN+40                                              02177000
ZCRSVF10 EQU   ZCRSVRTN+36                                              02178000
ZCRSVF9  EQU   ZCRSVRTN+32                                              02179000
ZCRSVF8  EQU   ZCRSVRTN+28                                              02180000
ZCRSVF7  EQU   ZCRSVRTN+24                                              02181000
ZCRSVF6  EQU   ZCRSVRTN+20                                              02182000
ZCRSVF5  EQU   ZCRSVRTN+16                                              02183000
ZCRSVF4  EQU   ZCRSVRTN+12                                              02184000
ZCRSVF3  EQU   ZCRSVRTN+8                                               02185000
ZCRSVF2  EQU   ZCRSVRTN+4                                               02186000
ZCRSVF1  EQU   ZCRSVRTN                                                 02187000
ZCRPVZB  EQU   ISTZCRR+52                                               02188000
ZCRZLB   EQU   ISTZCRR+48                                               02189000
ZCRBFPTR EQU   ISTZCRR+44                                               02190000
ZCRCCWA  EQU   ISTZCRR+40                                               02191000
ZCRPSW   EQU   ZCRPARMS+15                                              02192000
ZCRPCHAR EQU   ZCRPARMS+14                                              02193000
ZCRPRES2 EQU   ZCRPCOD2                                                 02194000
ZCRPMFGF EQU   ZCRPCOD2                                                 02195000
ZCRPFHDR EQU   ZCRPCOD2                                                 02196000
ZCRPPG2  EQU   ZCRPCOD2                                                 02197000
ZCRPRES  EQU   ZCRPCOD1                                                 02198000
ZCRPCFTX EQU   ZCRPCOD1                                                 02199000
ZCRPBUF  EQU   ZCRPCOD1                                                 02200000
ZCRPLSCB EQU   ZCRPCOD1                                                 02201000
ZCRPLSBQ EQU   ZCRPLSBF                                                 02202000
ZCRPFSB  EQU   ZCRPCOD1                                                 02203000
ZCRPLNG  EQU   ZCRPCOD1                                                 02204000
ZCRPPG   EQU   ZCRPCOD1                                                 02205000
ZCRDTODA EQU   ZCRDFRDA                                                 02206000
ZCRMLNG  EQU   ZCRPARMS+8                                               02207000
ZCRTBPTR EQU   ZCRPARMS+4                                               02208000
ZCRCBPTR EQU   ZCRFBPTR                                                 02209000
ZCRCRLCP EQU   ISTZCRR+20                                               02210000
@NM00026 EQU   ZCRSCPSW                                                 02211000
ZCRSKIPT EQU   ZCRSCPSW                                                 02212000
ZCRFSBWE EQU   ZCRSCPSW                                                 02213000
ZCRPRCMP EQU   ZCRSCPSW                                                 02214000
ZCRLREQ  EQU   ZCRSCPSW                                                 02215000
ZCRRJLCP EQU   ZCRSCPSW                                                 02216000
ZCRTPINV EQU   ZCRSCPSW                                                 02217000
ZCRTPEX  EQU   ZCRSCPSW                                                 02218000
@NM00025 EQU   ZCRIBPR                                                  02219000
ZCR3270R EQU   ZCRIBPR                                                  02220000
ZCR3270  EQU   ZCRIBPR                                                  02221000
ZCRLCPFD EQU   ZCRIBPR                                                  02222000
ZCRLCPFR EQU   ZCRIBPR                                                  02223000
ZCRRELK  EQU   ZCRIBPR                                                  02224000
ZCRERR   EQU   ZCRIBPR                                                  02225000
ZCRNOBUF EQU   ZCRIBPR                                                  02226000
@NM00024 EQU   ZCRPFLGS                                                 02227000
ZCRQAHED EQU   ZCRPFLGS                                                 02228000
ZCRF1RES EQU   ZCRGENSW                                                 02229000
ZCRBRIS  EQU   ZCRGENSW                                                 02230000
ZCRCLRBD EQU   ZCRGENSW                                                 02231000
ZCREXRES EQU   ZCRGENSW                                                 02232000
ZCRLCSYN EQU   ZCRGENSW                                                 02233000
ZCRRT06  EQU   ZCRGENSW                                                 02234000
ZCRTSW2  EQU   ZCRGENSW                                                 02235000
ZCRTSW1  EQU   ZCRGENSW                                                 02236000
ZCRINLCP EQU   ZCRFLGS3                                                 02237000
ZCRWRPTR EQU   ZCRFLGS3                                                 02238000
ZCRNOFRE EQU   ZCRFLGS3                                                 02239000
ZCREDRIV EQU   ZCRFLGS3                                                 02240000
ZCRDISC  EQU   ZCRFLGS3                                                 02241000
ZCRTPDIS EQU   ZCRFLGS3                                                 02242000
ZCRTPCON EQU   ZCRFLGS3                                                 02243000
ZCRTIC   EQU   ZCRFLGS3                                                 02244000
ZCRCNLXL EQU   ZCRRESET                                                 02245000
ZCRENDAN EQU   ZCRSWFLD                                                 02246000
ZCRENDXL EQU   ZCRSWFLD                                                 02247000
ZCRENDX  EQU   ZCRSWFLD                                                 02248000
ZCROB1   EQU   ZCRNDLCP                                                 02249000
ZCRENDPR EQU   ZCRSWFLD                                                 02250000
ZCREXTYP EQU   ZCRSWFLD                                                 02251000
ZCRSLCP  EQU   ZCRENDSH                                                 02252000
ZCRIF0E3 EQU   ZCRFLGS2                                                 02253000
ZCRIF0E2 EQU   ZCRFLGS2                                                 02254000
ZCRIF0E1 EQU   ZCRFLGS2                                                 02255000
ZCROB    EQU   ZCRFLGS2                                                 02256000
ZCRFMSED EQU   ZCRFLGS2                                                 02257000
ZCRSHEDI EQU   ZCRFLGS2                                                 02258000
ZCRLOCAL EQU   ZCRFLGS2                                                 02259000
ZCRFEXIT EQU   ZCRFLGS1                                                 02260000
ZCRUNSOL EQU   ZCRFLGS1                                                 02261000
ZCRENDLP EQU   ZCRFLGS1                                                 02262000
ZCRNRMEX EQU   ZCRFLGS1                                                 02263000
ZCRWAIT  EQU   ZCRFLGS1                                                 02264000
ZCRDEQSW EQU   ZCRFLGS1                                                 02265000
ZCRQUESW EQU   ZCRFLGS1                                                 02266000
ZCREXSW  EQU   ZCRFLGS1                                                 02267000
ZCRFRRA  EQU   ISTZCRR+8                                                02268000
ZCRCHAIN EQU   ISTZCRR+4                                                02269000
ZCRFLAG  EQU   ZCRCRR+3                                                 02270000
ZCRLEN   EQU   ZCRCRR+1                                                 02271000
ZCRID    EQU   ZCRCRR                                                   02272000
CCFRSVD1 EQU   CFCCRT                                                   02273000
CCFCR2   EQU   CFCCRT                                                   02274000
CCFCRP   EQU   CFCCRT                                                   02275000
CCFCR1   EQU   CFCCRT                                                   02276000
CCFCS2   EQU   CFCCRT                                                   02277000
CCFCS1   EQU   CFCCRT                                                   02278000
NCFRSVD  EQU   CFCNTRD                                                  02279000
NCFCR2   EQU   CFCNTRD                                                  02280000
NCFCRP   EQU   CFCNTRD                                                  02281000
NCFCR1   EQU   CFCNTRD                                                  02282000
NCFCS2   EQU   CFCNTRD                                                  02283000
NCFCS1   EQU   CFCNTRD                                                  02284000
ZSAZTRAC EQU   ISTZSAVE+36                                              02285000
ZSAZSVVR EQU   ISTZSAVE+12                                              02286000
ZSAZSVRR EQU   ISTZSAVE+8                                               02287000
ZSAZSVFC EQU   ISTZSAVE+4                                               02288000
ZSAZACTV EQU   ZSAZSVMS                                                 02289000
CSCRSV97 EQU   ISTCSCRR+116                                             02290000
CSCRSV98 EQU   ISTCSCRR+112                                             02291000
CSCRSV99 EQU   ISTCSCRR+108                                             02292000
CSCPLIST EQU   ISTCSCRR+92                                              02293000
CSCREGSV EQU   ISTCSCRR+20                                              02294000
CCSRSVRD EQU   CSCCRT+1                                                 02295000
CNMCCZ   EQU   CSCCRT+1                                                 02296000
CNMCCA   EQU   CSCCRT                                                   02297000
CNMCCO   EQU   CSCCRT                                                   02298000
CNMCCS   EQU   CSCCRT                                                   02299000
CNMCCF   EQU   CSCCRT                                                   02300000
CNMCCT   EQU   CSCCRT                                                   02301000
CNMCCB   EQU   CSCCRT                                                   02302000
CNMCCI   EQU   CSCCRT                                                   02303000
NCSRSVRD EQU   CSCNTRD+1                                                02304000
NNMCCZ   EQU   CSCNTRD+1                                                02305000
NNMCCA   EQU   CSCNTRD                                                  02306000
NNMCCO   EQU   CSCNTRD                                                  02307000
NNMCCS   EQU   CSCNTRD                                                  02308000
NNMCCF   EQU   CSCNTRD                                                  02309000
NNMCCT   EQU   CSCNTRD                                                  02310000
NNMCCB   EQU   CSCNTRD                                                  02311000
NNMCCI   EQU   CSCNTRD                                                  02312000
CSCPRFX  EQU   ISTCSCRR                                                 02313000
CRRRVPT5 EQU   CRRSAREA+316                                             02314000
CRRRVPT4 EQU   CRRSAREA+312                                             02315000
CRRRVPT3 EQU   CRRSAREA+308                                             02316000
CRRRVPT2 EQU   CRRSAREA+304                                             02317000
CRRRVPT1 EQU   CRRSAREA+300                                             02318000
CRRRVCR2 EQU   CRRSAREA+292                                             02319000
CRRRVCR1 EQU   CRRSAREA+291                                             02320000
CRRXFNCD EQU   CRRSAREA+290                                             02321000
CRRLDOCT EQU   CRRSAREA+288                                             02322000
CRRBTLEN EQU   CRRSAREA+284                                             02323000
CRRBLEN  EQU   CRRSAREA+282                                             02324000
CRRBRTCD EQU   CRRSAREA+281                                             02325000
@NM00023 EQU   CRRBFLGS                                                 02326000
CRRBFLG1 EQU   CRRBFLGS                                                 02327000
CRRBLDAD EQU   CRRSAREA+276                                             02328000
CRRBARAD EQU   CRRSAREA+272                                             02329000
CRRRTN12 EQU   CRRSAREA+268                                             02330000
CRRRTN11 EQU   CRRSAREA+264                                             02331000
CRRRTN10 EQU   CRRSAREA+260                                             02332000
CRRRTN9  EQU   CRRSAREA+256                                             02333000
CRRRTN8  EQU   CRRSAREA+252                                             02334000
CRRRTN7  EQU   CRRSAREA+248                                             02335000
CRRRTN6  EQU   CRRSAREA+244                                             02336000
CRRRTN5  EQU   CRRSAREA+240                                             02337000
CRRRTN4  EQU   CRRSAREA+236                                             02338000
CRRRTN3  EQU   CRRSAREA+232                                             02339000
CRRRTN2  EQU   CRRSAREA+228                                             02340000
CRRRTN1  EQU   CRRSAREA+224                                             02341000
CRRRES1  EQU   CRRSAREA+222                                             02342000
CRRLCNT  EQU   CRRSAREA+220                                             02343000
CRRATCVT EQU   CRRSAREA+216                                             02344000
CRRVALCK EQU   CRRSAREA+212                                             02345000
CRRARPL  EQU   CRRTRBUF+4                                               02346000
CRRBIND  EQU   CRRTRBUF+3                                               02347000
CRRTRRES EQU   CRRTRBUF                                                 02348000
CRRCLDO  EQU   CRRSAREA+200                                             02349000
CRRUECB  EQU   CRRSAREA+196                                             02350000
CRRLCPB  EQU   CRRSAREA+192                                             02351000
CRRCMDAD EQU   CRRSAREA+188                                             02352000
CRRFMCB  EQU   CRRSAREA+184                                             02353000
CRRCLCCW EQU   CRRSAREA+180                                             02354000
CRRESR2  EQU   CRRESR+1                                                 02355000
CRRESR1  EQU   CRRESR                                                   02356000
CRRDSB2  EQU   CRRDSB+1                                                 02357000
CRRDSB1  EQU   CRRDSB                                                   02358000
CRRDTACT EQU   CRRSAREA+174                                             02359000
CRRRSV99 EQU   CRRSAREA+173                                             02360000
CRRRDSOH EQU   CRRFDB3                                                  02361000
CRRRLG   EQU   CRRFDB3                                                  02362000
CRRLGFRC EQU   CRRFDB3                                                  02363000
CRRRDEOT EQU   CRRFDB3                                                  02364000
CRRRDEOM EQU   CRRFDB3                                                  02365000
CRRRDEOB EQU   CRRFDB3                                                  02366000
CRRUNUSD EQU   CRRFDB3                                                  02367000
CRRUINPT EQU   CRRFDB3                                                  02368000
CRRSTSAV EQU   CRRFDB2                                                  02369000
CRRCUERR EQU   CRRFDB2                                                  02370000
CRRDLGFL EQU   CRRFDB2                                                  02371000
CRRIOERR EQU   CRRFDB2                                                  02372000
CRRDVUNS EQU   CRRFDB2                                                  02373000
CRRATND  EQU   CRRFDB2                                                  02374000
CRRRVID  EQU   CRRFDB2                                                  02375000
CRRERLK  EQU   CRRFDB2                                                  02376000
CRRRTNCD EQU   CRRFDBK1                                                 02377000
CRRNSNA  EQU   CRRRTYPE                                                 02378000
CRRDFSYN EQU   CRRRTYPE                                                 02379000
CRRRESP  EQU   CRRRTYPE                                                 02380000
CRRDFASY EQU   CRRRTYPE                                                 02381000
CRRDBLCK EQU   CRRRFLG1                                                 02382000
CRRRPSBD EQU   CRRRFLG1                                                 02383000
CRRRPLOQ EQU   CRRRFLG1                                                 02384000
CRRRPLS  EQU   CRRRFLG1                                                 02385000
CRRSW7   EQU   CRRFLGS                                                  02386000
CRRSW6   EQU   CRRFLGS                                                  02387000
CRRSW5   EQU   CRRFLGS                                                  02388000
CRRSW4   EQU   CRRFLGS                                                  02389000
CRRSW3   EQU   CRRFLGS                                                  02390000
CRRSW2   EQU   CRRFLGS                                                  02391000
CRRSW1   EQU   CRRFLGS                                                  02392000
CRRSW0   EQU   CRRFLGS                                                  02393000
CRRRSV04 EQU   CRRFLGS4                                                 02394000
CRRFMCLK EQU   CRRFLGS4                                                 02395000
CRRDLCCW EQU   CRRFLGS3                                                 02396000
CRRRESET EQU   CRRFLGS3                                                 02397000
CRRSUBBK EQU   CRRFLGS3                                                 02398000
CRRRSV08 EQU   CRRFLGS3                                                 02399000
CRRDEBQ  EQU   CRRFLGS3                                                 02400000
CRRSTSPR EQU   CRRFLGS3                                                 02401000
CRRDREQ  EQU   CRRFLGS3                                                 02402000
CRRDFDBK EQU   CRRFLGS3                                                 02403000
CRRDFSB  EQU   CRRFLGS2                                                 02404000
CRRDPROC EQU   CRRFLGS2                                                 02405000
CRREXTS  EQU   CRRFLGS2                                                 02406000
CRRELSRI EQU   CRRFLGS2                                                 02407000
CRRPOST  EQU   CRRFLGS2                                                 02408000
CRRENDLW EQU   CRRFLGS2                                                 02409000
CRRPRGIP EQU   CRRFLGS2                                                 02410000
CRRDEXP  EQU   CRRFLGS2                                                 02411000
CRRSOLRQ EQU   CRRFLGS1                                                 02412000
CRRREQP  EQU   CRRFLGS1                                                 02413000
CRRCPROC EQU   CRRFLGS1                                                 02414000
CRRFINI  EQU   CRRFLGS1                                                 02415000
CRRPREIO EQU   CRRFLGS1                                                 02416000
CRRINIO  EQU   CRRFLGS1                                                 02417000
CRRFLDOS EQU   CRRFLGS1                                                 02418000
CRRDOCUR EQU   CRRFLGS1                                                 02419000
CRRRATS4 EQU   CRRATS+7                                                 02420000
@NM00022 EQU   CRRSATS                                                  02421000
CRRASC51 EQU   CRRSATS                                                  02422000
CRRASC40 EQU   CRRSATS                                                  02423000
CRRASC30 EQU   CRRSATS                                                  02424000
CRRASC21 EQU   CRRSATS                                                  02425000
CRRASC10 EQU   CRRSATS                                                  02426000
CRRASC01 EQU   CRRSATS                                                  02427000
@NM00021 EQU   CRRRATS2                                                 02428000
CRRPLIC  EQU   CRRRATS2                                                 02429000
CRRRC81  EQU   CRRRATS2                                                 02430000
CRRRC80  EQU   CRRRATS2                                                 02431000
CRRRC65  EQU   CRRRATS2                                                 02432000
CRRRC63  EQU   CRRRATS2                                                 02433000
CRRRC55  EQU   CRRRATS2                                                 02434000
CRRRC54  EQU   CRRRATS2                                                 02435000
CRRRC53  EQU   CRRRATS1                                                 02436000
CRRRC52  EQU   CRRRATS1                                                 02437000
CRRRC51  EQU   CRRRATS1                                                 02438000
CRRRC30  EQU   CRRRATS1                                                 02439000
CRRRC26  EQU   CRRRATS1                                                 02440000
CRRRC23  EQU   CRRRATS1                                                 02441000
CRRRC22  EQU   CRRRATS1                                                 02442000
CRRRC21  EQU   CRRRATS1                                                 02443000
@NM00020 EQU   CRRATS4                                                  02444000
CRRC3X   EQU   CRRATS4                                                  02445000
CRRC85   EQU   CRRATS4                                                  02446000
CRRC83   EQU   CRRATS4                                                  02447000
CRRC82   EQU   CRRATS4                                                  02448000
CRRC61   EQU   CRRATS4                                                  02449000
CRRC60   EQU   CRRATS4                                                  02450000
CRRC81   EQU   CRRATS3                                                  02451000
CRRC80   EQU   CRRATS3                                                  02452000
CRRC75   EQU   CRRATS3                                                  02453000
CRRC51   EQU   CRRATS3                                                  02454000
CRRC50   EQU   CRRATS3                                                  02455000
CRRC42   EQU   CRRATS3                                                  02456000
CRRC41   EQU   CRRATS3                                                  02457000
CRRC40   EQU   CRRATS3                                                  02458000
CRRC32   EQU   CRRATS2                                                  02459000
CRRC31   EQU   CRRATS2                                                  02460000
CRRC30   EQU   CRRATS2                                                  02461000
CRRC25   EQU   CRRATS2                                                  02462000
CRRC24   EQU   CRRATS2                                                  02463000
CRRC23   EQU   CRRATS2                                                  02464000
CRRC22   EQU   CRRATS2                                                  02465000
CRRC21   EQU   CRRATS2                                                  02466000
CRRC20   EQU   CRRATS1                                                  02467000
CRRC13   EQU   CRRATS1                                                  02468000
CRRC12   EQU   CRRATS1                                                  02469000
CRRC11   EQU   CRRATS1                                                  02470000
CRRC10   EQU   CRRATS1                                                  02471000
CRRC02   EQU   CRRATS1                                                  02472000
CRRC01   EQU   CRRATS1                                                  02473000
CRRC00   EQU   CRRATS1                                                  02474000
CRRRMAS4 EQU   CRRMAS+7                                                 02475000
@NM00019 EQU   CRRSMAS                                                  02476000
CRRMSC51 EQU   CRRSMAS                                                  02477000
CRRMSC40 EQU   CRRSMAS                                                  02478000
CRRMSC30 EQU   CRRSMAS                                                  02479000
CRRMSC21 EQU   CRRSMAS                                                  02480000
CRRMSC10 EQU   CRRSMAS                                                  02481000
CRRMSC01 EQU   CRRSMAS                                                  02482000
@NM00018 EQU   CRRRMAS2                                                 02483000
CRRRM81  EQU   CRRRMAS2                                                 02484000
CRRRM80  EQU   CRRRMAS2                                                 02485000
CRRRM65  EQU   CRRRMAS2                                                 02486000
CRRRM63  EQU   CRRRMAS2                                                 02487000
CRRRM55  EQU   CRRRMAS2                                                 02488000
CRRRM54  EQU   CRRRMAS2                                                 02489000
CRRRM53  EQU   CRRRMAS1                                                 02490000
CRRRM52  EQU   CRRRMAS1                                                 02491000
CRRRM51  EQU   CRRRMAS1                                                 02492000
CRRRM30  EQU   CRRRMAS1                                                 02493000
CRRRM26  EQU   CRRRMAS1                                                 02494000
CRRRM23  EQU   CRRRMAS1                                                 02495000
CRRRM22  EQU   CRRRMAS1                                                 02496000
CRRRM21  EQU   CRRRMAS1                                                 02497000
@NM00017 EQU   CRRMAS4                                                  02498000
CRRM3X   EQU   CRRMAS4                                                  02499000
CRRM85   EQU   CRRMAS4                                                  02500000
CRRM83   EQU   CRRMAS4                                                  02501000
CRRM82   EQU   CRRMAS4                                                  02502000
CRRM61   EQU   CRRMAS4                                                  02503000
CRRM60   EQU   CRRMAS4                                                  02504000
CRRM81   EQU   CRRMAS3                                                  02505000
CRRM80   EQU   CRRMAS3                                                  02506000
CRRM75   EQU   CRRMAS3                                                  02507000
CRRM51   EQU   CRRMAS3                                                  02508000
CRRM50   EQU   CRRMAS3                                                  02509000
CRRM42   EQU   CRRMAS3                                                  02510000
CRRM41   EQU   CRRMAS3                                                  02511000
CRRM40   EQU   CRRMAS3                                                  02512000
CRRM32   EQU   CRRMAS2                                                  02513000
CRRM31   EQU   CRRMAS2                                                  02514000
CRRM30   EQU   CRRMAS2                                                  02515000
CRRM25   EQU   CRRMAS2                                                  02516000
CRRM24   EQU   CRRMAS2                                                  02517000
CRRM23   EQU   CRRMAS2                                                  02518000
CRRM22   EQU   CRRMAS2                                                  02519000
CRRM21   EQU   CRRMAS2                                                  02520000
CRRM20   EQU   CRRMAS1                                                  02521000
CRRM13   EQU   CRRMAS1                                                  02522000
CRRM12   EQU   CRRMAS1                                                  02523000
CRRM11   EQU   CRRMAS1                                                  02524000
CRRM10   EQU   CRRMAS1                                                  02525000
CRRM02   EQU   CRRMAS1                                                  02526000
CRRM01   EQU   CRRMAS1                                                  02527000
CRRM00   EQU   CRRMAS1                                                  02528000
CRRFSB   EQU   CRRSAREA+144                                             02529000
CRRSAVE1 EQU   CRRSAREA+72                                              02530000
CRRSAVE  EQU   CRRSAREA                                                 02531000
CRRRSV22 EQU   ISTDCCRR+4                                               02532000
CRRCRR   EQU   ISTDCCRR                                                 02533000
PFCRSV01 EQU   ISTPFCRR+13                                              02534000
PFCFTA   EQU   ISTPFCRR+12                                              02535000
CRRFRR   EQU   PFCFRRO                                                  02536000
CRRCHAIN EQU   PFCCRRO                                                  02537000
CRRLEN   EQU   PFCCRRLN                                                 02538000
PFCRSV10 EQU   PFCCRR+1                                                 02539000
CRRID    EQU   PFCCRRID                                                 02540000
NMLRSV05 EQU   ISTNMLPB+96                                              02541000
NMLRSV04 EQU   ISTNMLPB+92                                              02542000
NMLDRDTE EQU   ISTNMLPB+88                                              02543000
NMECBPTR EQU   ISTNMLPB+84                                              02544000
NMLRSV02 EQU   ISTNMLPB+82                                              02545000
NMLRSV06 EQU   ISTNMLPB+81                                              02546000
NMNCSPL  EQU   NMRDTEA                                                  02547000
NMRSV01  EQU   NMLCWCMD+1                                               02548000
NMECRST  EQU   NMLCWCMD+1                                               02549000
NMVRYPRG EQU   NMLCWCMD+1                                               02550000
NMSTCTLF EQU   NMLCWCMD+1                                               02551000
NMSTCTLI EQU   NMLCWCMD+1                                               02552000
NMSTCTLR EQU   NMLCWCMD                                                 02553000
NMFBDTA  EQU   NMLCWCMD                                                 02554000
NMRDBLK  EQU   NMLCWCMD                                                 02555000
NMDSEOC  EQU   NMLCWCMD                                                 02556000
NMPURGE  EQU   NMLCWCMD                                                 02557000
NMRESTI  EQU   NMLCWCMD                                                 02558000
NMCNTCT  EQU   NMLCWCMD                                                 02559000
NMINVT   EQU   NMLCWCMD                                                 02560000
NMPSRTRY EQU   NMCONTRL+1                                               02561000
NMFNCTCD EQU   NMCONTRL                                                 02562000
NMLCPB   EQU   ISTNMLPB                                                 02563000
DCLECHAR EQU   ISTDCLCP+98                                              02564000
DCLIOLEN EQU   ISTDCLCP+96                                              02565000
DCLBTLEN EQU   ISTDCLCP+92                                              02566000
DCLCLDOA EQU   ISTDCLCP+88                                              02567000
DCLIOBUF EQU   ISTDCLCP+84                                              02568000
DCLLDO1  EQU   ISTDCLCP+80                                              02569000
DCLRSV03 EQU   ISTDCLCP+79                                              02570000
DCLRSV02 EQU   DCLFLAG1                                                 02571000
DCLRPLS  EQU   DCLFLAG1                                                 02572000
DCLBTEIS EQU   DCLFLAG1                                                 02573000
DCLNODE  EQU   DCLFLAG1                                                 02574000
DCLRSV04 EQU   DCLFLAG1                                                 02575000
DCLSRESW EQU   DCLFLAG1                                                 02576000
DCLBNSP  EQU   DCLRFLG                                                  02577000
DCLCONV  EQU   DCLRFLG                                                  02578000
DCLRSV01 EQU   DCLRFLG                                                  02579000
DCLRQTP  EQU   DCLRTYPE                                                 02580000
DCLRPLA  EQU   ISTDCLCP+72                                              02581000
DCLLCCW3 EQU   ISTDCLCP+64                                              02582000
DCLLCCW2 EQU   ISTDCLCP+56                                              02583000
DCLLCPB  EQU   ISTDCLCP                                                 02584000
LCPFTYPE EQU   LCPRPHA                                                  02585000
LCPRSTQH EQU   LCPLCCW                                                  02586000
LCPCLREP EQU   ISTLCPB+44                                               02587000
LCPUBFSB EQU   LCPFLCCW                                                 02588000
LCPRSV77 EQU   ISTLCPB+39                                               02589000
LCPLCCWC EQU   ISTLCPB+38                                               02590000
LCPRSV78 EQU   LCPFLG1                                                  02591000
LCPTRANS EQU   LCPFLG1                                                  02592000
LCPSTLB  EQU   LCPFLG1                                                  02593000
LCPREDRV EQU   LCPFLG1                                                  02594000
LCPDIRPT EQU   LCPFLG1                                                  02595000
LCPINTER EQU   LCPFLG1                                                  02596000
LCPRESET EQU   LCPFLG1                                                  02597000
LCPFDB2  EQU   LCPFDBA+1                                                02598000
LCPFDB1  EQU   LCPFDBA                                                  02599000
LCPDAF   EQU   LCPCID+2                                                 02600000
LCPSAF   EQU   LCPCID                                                   02601000
LCPLCCW1 EQU   ISTLCPB+12                                               02602000
LCPRRCNT EQU   LCPSEQ+1                                                 02603000
LCPRRCCT EQU   LCPSEQ                                                   02604000
LCPATOP  EQU   LCPFLAG2                                                 02605000
LCPFREE  EQU   LCPFLAG2                                                 02606000
LCPDSTAT EQU   LCPFLAG2                                                 02607000
LCPEXRES EQU   LCPFID0                                                  02608000
LCPZRIMM EQU   LCPTLBPI                                                 02609000
LCPRSTRT EQU   LCPFLAG2                                                 02610000
LCPASYN  EQU   LCPFLAG2                                                 02611000
LCPPRFLG EQU   LCPFLAG2                                                 02612000
LCPZMIRC EQU   LCPRUCNT                                                 02613000
LCPCHAI2 EQU   LCPCHAIN+1                                               02614000
LCPCHNG  EQU   LCPCHAI1                                                 02615000
LCPZRT0B EQU   LCPMNRCD                                                 02616000
LCPZRT0A EQU   LCPMNRCD                                                 02617000
LCPZRTL9 EQU   LCPZRT09                                                 02618000
LCPZRTL8 EQU   LCPZRT08                                                 02619000
LCPZRTL7 EQU   LCPZRT07                                                 02620000
LCPZRTL6 EQU   LCPZRT06                                                 02621000
LCPZRTL5 EQU   LCPZRT05                                                 02622000
LCPZRTL4 EQU   LCPZRT04                                                 02623000
LCPZRTL3 EQU   LCPZRT03                                                 02624000
LCPZRTL2 EQU   LCPZRT02                                                 02625000
LCPZRT01 EQU   LCPFLAGS                                                 02626000
LCPZRT00 EQU   LCPFLAGS                                                 02627000
LCPLNGTH EQU   ISTLCPB+1                                                02628000
LCPTYPE  EQU   ISTLCPB                                                  02629000
LCCWDATA EQU   ISTLCCW+4                                                02630000
LCCWCNT  EQU   ISTLCCW+2                                                02631000
LCCWACI  EQU   LCCWFLAG                                                 02632000
LCCWRFI  EQU   LCCWFLAG                                                 02633000
LCCWPER  EQU   LCCWLSI                                                  02634000
LCCWIDAT EQU   LCCWFLAG                                                 02635000
LCCWNTVC EQU   LCCWFLAG                                                 02636000
LCCWCKPT EQU   LCCWFLAG                                                 02637000
LCCWCD   EQU   LCCWFLAG                                                 02638000
LCCWTYPE EQU   LCCWCTL                                                  02639000
LCCWMODE EQU   LCCWCTL                                                  02640000
LCCWSOP  EQU   LCCWRWOP                                                 02641000
@NM00016 EQU   LCCWRWOP                                                 02642000
FMCFLRSV EQU   FMCFLGB                                                  02643000
FMCFLGA8 EQU   FMCFLGB                                                  02644000
FMCCLRPH EQU   FMCVS1+45                                                02645000
FMCRSV0X EQU   FMCCVFLG                                                 02646000
FMCVYRPH EQU   FMCCVFLG                                                 02647000
FMCZV004 EQU   FMCVS1+40                                                02648000
FMCLOCK2 EQU   FMCVS1+36                                                02649000
@NM00015 EQU   FMCZFLG2                                                 02650000
FMCZF027 EQU   FMCZFLG2                                                 02651000
FMCZF026 EQU   FMCZFLG2                                                 02652000
FMCSEQ1B EQU   FMCSEQ1                                                  02653000
FMCSEQ1T EQU   FMCSEQ1                                                  02654000
FMCZX006 EQU   FMCVS1+33                                                02655000
FMCZX005 EQU   FMCVS1+32                                                02656000
FMCZX004 EQU   FMCVS1+31                                                02657000
FMCZX003 EQU   FMCVS1+30                                                02658000
FMCZX002 EQU   FMCVS1+29                                                02659000
FMCZX001 EQU   FMCVS1+28                                                02660000
FMCZV001 EQU   FMCVS1+24                                                02661000
FMCAWATQ EQU   FMCLCPAQ+1                                               02662000
@NM00014 EQU   FMCLCPAQ                                                 02663000
FMCLCPB2 EQU   FMCLCPBQ+1                                               02664000
FMCLCPB1 EQU   FMCLCPBQ                                                 02665000
FMCASCDQ EQU   FMCSHEAQ+1                                               02666000
@NM00013 EQU   FMCSHEAQ                                                 02667000
FMCSHEDQ EQU   FMCVS1+8                                                 02668000
FMCZFCSQ EQU   FMCVS1+6                                                 02669000
FMCZH001 EQU   FMCVS1+4                                                 02670000
FMCZF025 EQU   FMCZFLAG+3                                               02671000
FMCZF024 EQU   FMCZFLAG+3                                               02672000
FMCZF023 EQU   FMCZFLAG+3                                               02673000
FMCZF022 EQU   FMCZFLAG+3                                               02674000
FMCZF021 EQU   FMCZFLAG+3                                               02675000
FMCZF020 EQU   FMCZFLAG+3                                               02676000
FMCZF019 EQU   FMCZFLAG+3                                               02677000
FMCZF018 EQU   FMCZFLAG+3                                               02678000
FMCZF017 EQU   FMCZFLAG+2                                               02679000
FMCZF016 EQU   FMCZFLAG+2                                               02680000
FMCZF015 EQU   FMCZFLAG+2                                               02681000
FMCZF014 EQU   FMCZFLAG+2                                               02682000
FMCZF013 EQU   FMCZFLAG+2                                               02683000
FMCZF012 EQU   FMCZFLAG+2                                               02684000
FMCZF011 EQU   FMCZFLAG+2                                               02685000
FMCZF010 EQU   FMCZFLAG+2                                               02686000
FMCZF00F EQU   FMCZFLAG+1                                               02687000
FMCZF00E EQU   FMCZFLAG+1                                               02688000
FMCZF00D EQU   FMCZFLAG+1                                               02689000
FMCZF00C EQU   FMCZFLAG+1                                               02690000
FMCZF00B EQU   FMCZFLAG+1                                               02691000
FMCRSV10 EQU   FMCZFLAG+1                                               02692000
FMCZF009 EQU   FMCZFLAG+1                                               02693000
FMCZFD06 EQU   FMCZF006+1                                               02694000
FMCZFC06 EQU   FMCZF006                                                 02695000
FMCZFB06 EQU   FMCZF006                                                 02696000
FMCZFA06 EQU   FMCZF006                                                 02697000
FMCZF005 EQU   FMCZFLAG                                                 02698000
FMCZF004 EQU   FMCZFLAG                                                 02699000
FMCZF003 EQU   FMCZFLAG                                                 02700000
FMCZF002 EQU   FMCZFLAG                                                 02701000
FMCZF001 EQU   FMCZFLAG                                                 02702000
FMCFRESA EQU   ISTFMCB+228                                              02703000
FMCSCSQN EQU   FMCSNCTL+2                                               02704000
FMCSCCTL EQU   FMCSNCTL+1                                               02705000
FMCSTCTL EQU   FMCSCFLG                                                 02706000
FMCSCCLO EQU   FMCSCFLG                                                 02707000
FMCAPRO  EQU   FMCSCFLG                                                 02708000
FMCLURO  EQU   FMCSCFLG                                                 02709000
FMCOBSAC EQU   FMCSCFLG                                                 02710000
FMCIBSAC EQU   FMCSCFLG                                                 02711000
FMCFBRE  EQU   ISTFMCB+220                                              02712000
FMCFBXM  EQU   FMCZV002                                                 02713000
FMCASEGQ EQU   ISTFMCB+212                                              02714000
FMCRDTPT EQU   ISTFMCB+208                                              02715000
FMCLOCK  EQU   ISTFMCB+204                                              02716000
FMCSEGD  EQU   FMCSSEGQ                                                 02717000
FMCRSPLM EQU   ISTFMCB+198                                              02718000
FMCPSTRS EQU   ISTFMCB+196                                              02719000
@NM00012 EQU   FMCRRESP                                                 02720000
FMCTSLHA EQU   FMCRRESP                                                 02721000
FMCFRRN  EQU   FMCRRESP                                                 02722000
FMCFME   EQU   FMCRRESP                                                 02723000
FMCFEX   EQU   FMCRRESP                                                 02724000
FMCFPE   EQU   FMCRRESP                                                 02725000
FMCCTLB  EQU   ISTFMCB+194                                              02726000
FMCBSQNO EQU   FMCCLSEQ+2                                               02727000
FMCTSQNO EQU   FMCCLSEQ                                                 02728000
FMCOBPRG EQU   FMCMODEB                                                 02729000
FMCIBPRG EQU   FMCMODEB                                                 02730000
FMCRESOT EQU   FMCMODEB                                                 02731000
FMCRSTSR EQU   FMCMODEB                                                 02732000
FMCLUQ   EQU   FMCMODEB                                                 02733000
FMCAPQ   EQU   FMCMODEB                                                 02734000
FMCCLEAR EQU   FMCMODEB                                                 02735000
FMCHOLD  EQU   FMCMODEB                                                 02736000
FMCRSV87 EQU   FMCSTAT2                                                 02737000
FMCSEQI  EQU   FMCSTAT2                                                 02738000
FMCCPIP  EQU   FMCSTAT2                                                 02739000
FMCALIPR EQU   FMCSTAT2                                                 02740000
FMCIAIO  EQU   FMCSTAT2                                                 02741000
FMCZF00A EQU   FMCSTAT2                                                 02742000
FMCVPIP  EQU   FMCSTAT2                                                 02743000
FMCBHSET EQU   ISTFMCB+185                                              02744000
FMCPRMRC EQU   FMCCLEXT+20                                              02745000
FMCRSV89 EQU   FMCPSTAT                                                 02746000
FMCPCLSD EQU   FMCPSTAT                                                 02747000
FMCDDOCD EQU   FMCPSTAT                                                 02748000
FMCIDVFD EQU   FMCPSTAT                                                 02749000
FMCELKST EQU   FMCPSTAT                                                 02750000
FMCRSV88 EQU   FMCPSCMD                                                 02751000
FMCRDBLK EQU   FMCPSCMD                                                 02752000
FMCDSEOC EQU   FMCPSCMD                                                 02753000
FMCPURGE EQU   FMCPSCMD                                                 02754000
FMCRESTI EQU   FMCPSCMD                                                 02755000
FMCCNTCT EQU   FMCPSCMD                                                 02756000
FMCINVT  EQU   FMCPSCMD                                                 02757000
FMCFLGB7 EQU   FMCFLGCL                                                 02758000
FMCFLGB6 EQU   FMCFLGCL                                                 02759000
FMCFLGB5 EQU   FMCFLGCL                                                 02760000
FMCFLGB4 EQU   FMCFLGCL                                                 02761000
FMCFLGB3 EQU   FMCFLGCL                                                 02762000
FMCFLGB2 EQU   FMCFLGCL                                                 02763000
FMCFLGB1 EQU   FMCFLGCL                                                 02764000
FMCFLGB0 EQU   FMCFLGCL                                                 02765000
FMCFLGA7 EQU   FMCFLGA                                                  02766000
FMCFLGA6 EQU   FMCFLGA                                                  02767000
FMCFLGA5 EQU   FMCFLGA                                                  02768000
FMCFLGA4 EQU   FMCFLGA                                                  02769000
FMCFLGA3 EQU   FMCFLGA                                                  02770000
FMCFLGA2 EQU   FMCFLGA                                                  02771000
FMCFLGA1 EQU   FMCFLGA                                                  02772000
FMCFLGA0 EQU   FMCFLGA                                                  02773000
FMCDCLOK EQU   FMCCLEXT+12                                              02774000
FMCRAFM  EQU   FMCCLEXT+8                                               02775000
FMCFBPTR EQU   FMCFBA+1                                                 02776000
FMCFBRSV EQU   FMCFBA                                                   02777000
FMCRPLPT EQU   FMCRPLA+1                                                02778000
FMCRPLRS EQU   FMCRPLA                                                  02779000
FMCPRCLS EQU   FMCCVAL                                                  02780000
FMCIBCE  EQU   FMCCVAL                                                  02781000
FMCONLY  EQU   FMCOBCE                                                  02782000
FMCLAST  EQU   FMCOBCE                                                  02783000
FMCMIDLE EQU   FMCOBCE                                                  02784000
FMCFIRST EQU   FMCOBCE                                                  02785000
FMCCPCNT EQU   FMCPACPC                                                 02786000
FMCMPCNT EQU   FMCPACEM                                                 02787000
FMCNPCNT EQU   FMCPACEN                                                 02788000
FMCCONF  EQU   FMCSSTAT                                                 02789000
FMCPURCH EQU   FMCSSTAT                                                 02790000
FMCNSALU EQU   FMCSSTAT                                                 02791000
FMCBIP   EQU   FMCSSTAT                                                 02792000
FMCSDTR  EQU   FMCSSTAT                                                 02793000
FMCUIPI  EQU   FMCSSTAT                                                 02794000
FMCCIPI  EQU   FMCSSTAT                                                 02795000
FMCSNBI  EQU   FMCSSTAT                                                 02796000
FMCRVD01 EQU   ISTFMCB+158                                              02797000
FMCISSN  EQU   ISTFMCB+156                                              02798000
FMCOASN  EQU   FMCNXOSC                                                 02799000
FMCOSSN  EQU   FMCNXCFM                                                 02800000
FMCSIP   EQU   FMCSIPA                                                  02801000
FMCEXLST EQU   ISTFMCB+144                                              02802000
FMCPAB5  EQU   ISTFMCB+128                                              02803000
FMCPAB4  EQU   ISTFMCB+112                                              02804000
FMCPAB2  EQU   ISTFMCB+80                                               02805000
FMCPAB1  EQU   ISTFMCB+64                                               02806000
FMCFASYA EQU   ISTFMCB+60                                               02807000
FMCMODE  EQU   ISTFMCB+52                                               02808000
FMCPROCD EQU   ISTFMCB+48                                               02809000
FMCVWT   EQU   ISTFMCB+44                                               02810000
FMCRPLH  EQU   ISTFMCB+40                                               02811000
FMCBUFNB EQU   FMCCMPS1+2                                               02812000
FMCBUFLM EQU   FMCCMPS1                                                 02813000
FMCDEBA  EQU   ISTFMCB+32                                               02814000
@NM00011 EQU   FMCCMDFL                                                 02815000
FMCSNA   EQU   FMCCMDFL                                                 02816000
FMCVSNA  EQU   FMCCMDFL                                                 02817000
FMCCMDR  EQU   FMCCMDFL                                                 02818000
@NM00010 EQU   ISTFMCB+30                                               02819000
@NM00009 EQU   FMCSTAT1                                                 02820000
FMCLTCLS EQU   FMCSTAT1                                                 02821000
FMCHPURG EQU   FMCSTAT1                                                 02822000
FMCVSP2  EQU   FMCSTAT1                                                 02823000
FMCVSP1  EQU   FMCSTAT                                                  02824000
FMCLTEAS EQU   FMCSTAT                                                  02825000
FMCZF007 EQU   FMCSTAT                                                  02826000
FMCDEDSC EQU   FMCSTAT                                                  02827000
FMCDEVOF EQU   FMCSTAT                                                  02828000
FMCDAPT  EQU   FMCSTAT                                                  02829000
FMCPRMTE EQU   FMCSTAT                                                  02830000
FMCPRMTR EQU   FMCSTAT                                                  02831000
FMCUSFLD EQU   ISTFMCB+24                                               02832000
FMCFMCBA EQU   ISTFMCB+20                                               02833000
FMCDNCBA EQU   ISTFMCB+16                                               02834000
FMCDVTA  EQU   ISTFMCB+12                                               02835000
FMCTSKID EQU   ISTFMCB+8                                                02836000
FMCNXTCB EQU   ISTFMCB+4                                                02837000
FMCSAF   EQU   ISTFMCB+2                                                02838000
FMCLNGTH EQU   ISTFMCB+1                                                02839000
FMCTYPE  EQU   ISTFMCB                                                  02840000
PROSRDEF EQU   PROSETM4                                                 02841000
PRORSV47 EQU   PROSETM4                                                 02842000
PROSCON  EQU   PROSETM4                                                 02843000
PRORSV46 EQU   PROSETM3                                                 02844000
PROSMONT EQU   PROSETM3                                                 02845000
PRORSV45 EQU   PROSETM3                                                 02846000
PROSNTO  EQU   PROSETM3                                                 02847000
PRORSV44 EQU   PROSETM3                                                 02848000
PRORSV43 EQU   PROSETM2                                                 02849000
PROSNTFL EQU   PROSETM2                                                 02850000
PRORSV42 EQU   PROSETM2                                                 02851000
PRORSV41 EQU   PROPROCS                                                 02852000
PROMODC  EQU   PROPROC4                                                 02853000
PROMODT  EQU   PROPROC4                                                 02854000
PROMODM  EQU   PROPROC4                                                 02855000
PROMODB  EQU   PROPROC4                                                 02856000
PRORSV14 EQU   PROPROC4                                                 02857000
PRORSV13 EQU   PROPROC4                                                 02858000
PRORSV12 EQU   PROPROC4                                                 02859000
PROEIB   EQU   PROPROC4                                                 02860000
PRORSV11 EQU   PROPROC3                                                 02861000
PROMONT2 EQU   PROPROC3                                                 02862000
PROMONIT EQU   PROPROC3                                                 02863000
PROSUBLK EQU   PROPROC3                                                 02864000
PRONTO   EQU   PROPROC3                                                 02865000
PROLGIN  EQU   PROPROC3                                                 02866000
PROERPI  EQU   PROPROC3                                                 02867000
PRORSV07 EQU   PROPROC3                                                 02868000
PROCFTX  EQU   PROPROC2                                                 02869000
PROEMLC  EQU   PROPROC2                                                 02870000
PRONTFL  EQU   PROPROC2                                                 02871000
PRORSV05 EQU   PROPROC2                                                 02872000
PRORSV04 EQU   PROPROC2                                                 02873000
PROLGOT  EQU   PROPROC2                                                 02874000
PROERPO  EQU   PROPROC2                                                 02875000
PRORSV03 EQU   PROPROC2                                                 02876000
PRORPLC  EQU   PROPROC1                                                 02877000
PROCS    EQU   PROPROC1                                                 02878000
PROCA    EQU   PROPROC1                                                 02879000
PRORESPX EQU   PROPROC1                                                 02880000
PRODFASY EQU   PROPROC1                                                 02881000
PROXPOPT EQU   PROPROC1                                                 02882000
PROTRUNC EQU   PROPROC1                                                 02883000
PROASYIP EQU   PROPROC1                                                 02884000
DEVRSV03 EQU   ISTDEVCH+5                                               02885000
DEVPHYSA EQU   ISTDEVCH+4                                               02886000
DEVCSLPN EQU   DEVCHAR3                                                 02887000
DEVCSTCL EQU   DEVCHAR3                                                 02888000
DEVCCHEK EQU   DEVCHAR3                                                 02889000
DEVCATTN EQU   DEVCHAR3                                                 02890000
DEVCSWL  EQU   DEVFCCTL                                                 02891000
DEVCRVB  EQU   DEVFCCTL                                                 02892000
DEVCSSL  EQU   DEVFCCTL                                                 02893000
DEVCBSC  EQU   DEVFCCTL                                                 02894000
DEVMCODE EQU   ISTDEVCH+2                                               02895000
DEVCHAR2 EQU   DEVTCODE                                                 02896000
DEVRSV01 EQU   DEVCHAR                                                  02897000
DEVCCTL  EQU   DEVCHAR                                                  02898000
DEVNNSPT EQU   DEVCHAR                                                  02899000
DEVSPS   EQU   DEVCHAR                                                  02900000
DEVSUBND EQU   DEVCHAR                                                  02901000
DEVCONVR EQU   DEVCHAR                                                  02902000
DEVOTPUT EQU   DEVCHAR                                                  02903000
DEVINPUT EQU   DEVCHAR                                                  02904000
LOKXCL   EQU   @NM00007                                                 02905000
LOKPRY   EQU   @NM00007                                                 02906000
@NM00008 EQU   @NM00007                                                 02907000
@NM00006 EQU   LOKCHNG                                                  02908000
LOKCT    EQU   ISTLOK                                                   02909000
PABRPHA  EQU   PABRPHFG+1                                               02910000
PABNODQ  EQU   PABFLAGS                                                 02911000
PABINHBT EQU   PABFLAGS                                                 02912000
PABERLOK EQU   PABERRLK                                                 02913000
PABSSN   EQU   PABFLAGS                                                 02914000
PABDYNAM EQU   PABFLAGS                                                 02915000
PABNORPR EQU   PABFLAGS                                                 02916000
PABPRIOR EQU   PABFLAGS                                                 02917000
PABAPYP  EQU   PABFLAGS                                                 02918000
PABDVTA  EQU   ISTPAB+9                                                 02919000
PABOFFST EQU   ISTPAB+8                                                 02920000
PABCHNGP EQU   PABCHAIN+1                                               02921000
PABRSV02 EQU   PABCHAIN                                                 02922000
PABDELAY EQU   PABCHAIN                                                 02923000
PABRUNNG EQU   PABCHAIN                                                 02924000
PABRESET EQU   PABCHAIN                                                 02925000
PABUNCON EQU   PABCHAIN                                                 02926000
PABCDP   EQU   PABCHAIN                                                 02927000
PABRESCH EQU   PABCHAIN                                                 02928000
PABCHNG  EQU   PABCHAIN                                                 02929000
PABWEQP  EQU   PABWEQA+1                                                02930000
PABRSV01 EQU   PABWEQA                                                  02931000
PABWEQG  EQU   PABWEQA                                                  02932000
RPHNEXPO EQU   ISTRPH+104                                               02933000
RPHSAV16 EQU   RPHWORK+60                                               02934000
RPHSAV15 EQU   RPHWORK+56                                               02935000
RPHSAV14 EQU   RPHWORK+52                                               02936000
RPHSAV13 EQU   RPHWORK+48                                               02937000
RPHSAV12 EQU   RPHWORK+44                                               02938000
RPHSAV11 EQU   RPHWORK+40                                               02939000
RPHSAV10 EQU   RPHWORK+36                                               02940000
RPHSAVE9 EQU   RPHWORK+32                                               02941000
RPHSAVE8 EQU   RPHWORK+28                                               02942000
RPHSAVE7 EQU   RPHWORK+24                                               02943000
RPHSAVE6 EQU   RPHWORK+20                                               02944000
RPHSAVE5 EQU   RPHWORK+16                                               02945000
RPHSAVE4 EQU   RPHWORK+12                                               02946000
RPHSAVE3 EQU   RPHWORK+8                                                02947000
RPHSAVE2 EQU   RPHWORK+4                                                02948000
RPHSHALF EQU   RPHSAVE1+2                                               02949000
RPHSBIT8 EQU   RPHSBITS                                                 02950000
RPHSBIT7 EQU   RPHSBITS                                                 02951000
RPHSBIT6 EQU   RPHSBITS                                                 02952000
RPHSBIT5 EQU   RPHSBITS                                                 02953000
RPHSBIT4 EQU   RPHSBITS                                                 02954000
RPHSBIT3 EQU   RPHSBITS                                                 02955000
RPHSBIT2 EQU   RPHSBITS                                                 02956000
RPHSBIT1 EQU   RPHSBITS                                                 02957000
RPHSBYTE EQU   RPHSAVE1                                                 02958000
RPHPABQP EQU   RPHPABQA+1                                               02959000
RPHPABFG EQU   RPHPABQA                                                 02960000
RPHSRP34 EQU   RPHSRPRM+2                                               02961000
RPHSRP12 EQU   RPHSRPRM                                                 02962000
RPHWEGT  EQU   RPHCSPA                                                  02963000
RPHPABOF EQU   ISTRPH+20                                                02964000
RPHRESUM EQU   RPHRESMA+1                                               02965000
RPHRSV01 EQU   RPHWPFLG                                                 02966000
RPHPURGE EQU   RPHWPFLG                                                 02967000
RPHPT    EQU   RPHWPFLG                                                 02968000
RPHWT    EQU   RPHWPFLG                                                 02969000
RPHRSKEY EQU   RPHWPFLG                                                 02970000
RPHDVTA  EQU   ISTRPH+12                                                02971000
RPHTIK   EQU   RPHTSKID+3                                               02972000
@NM00005 EQU   RPHTSKID                                                 02973000
RPHRPHAP EQU   RPHRPHA+1                                                02974000
@NM00004 EQU   RPHRPHA                                                  02975000
RPHGATE  EQU   RPHRPHA                                                  02976000
@NM00003 EQU   RPHFLGB                                                  02977000
RPHRLCRA EQU   RPHFLGB                                                  02978000
RPHNRSAV EQU   RPHFLGB                                                  02979000
RPHPGCMP EQU   RPHFLGB                                                  02980000
RPHFBAPS EQU   RPHFLGB                                                  02981000
RPHBSSP  EQU   RPHFLGB                                                  02982000
RPHLOCK  EQU   RPHFLGB                                                  02983000
RPHFNFLG EQU   RPHFSTLC                                                 02984000
RPHMLTCP EQU   RPHFLAGS                                                 02985000
RPHSMCLR EQU   RPHFLAGS                                                 02986000
RPHSMTYP EQU   RPHFLAGS                                                 02987000
RPHSMQ   EQU   RPHFLAGS                                                 02988000
RPHAUTEX EQU   RPHAPTYP                                                 02989000
RPHSPGIN EQU   RPHFLAGS                                                 02990000
RPHOGIND EQU   RPHFLAGS                                                 02991000
RPHLNGTH EQU   RPHCNTL+1                                                02992000
RPHTYPE  EQU   RPHCNTL                                                  02993000
CVTLEVL  EQU   CVTRELNO+2                                               02994000
CVTNUMB  EQU   CVTRELNO                                                 02995000
CVTMDL   EQU   CVTFIX+250                                               02996000
@NM00002 EQU   CVTFIX+248                                               02997000
@NM00001 EQU   CVTFIX                                                   02998000
CVTRV482 EQU   CVTXTNT2+128                                             02999000
CVTRV481 EQU   CVTXTNT2+124                                             03000000
CVTRV480 EQU   CVTXTNT2+120                                             03001000
CVTRV479 EQU   CVTXTNT2+118                                             03002000
CVTRV478 EQU   CVTXTNT2+117                                             03003000
CVTRV477 EQU   CVTXTNT2+116                                             03004000
CVTRV476 EQU   CVTXTNT2+115                                             03005000
CVTRV475 EQU   CVTXTNT2+114                                             03006000
CVTRV474 EQU   CVTRV466                                                 03007000
CVTRV473 EQU   CVTRV466                                                 03008000
CVTRV472 EQU   CVTRV466                                                 03009000
CVTRV471 EQU   CVTRV466                                                 03010000
CVTRV470 EQU   CVTRV466                                                 03011000
CVTRV469 EQU   CVTRV466                                                 03012000
CVTRV468 EQU   CVTRV466                                                 03013000
CVTRV467 EQU   CVTRV466                                                 03014000
CVTRV465 EQU   CVTRV457                                                 03015000
CVTRV464 EQU   CVTRV457                                                 03016000
CVTRV463 EQU   CVTRV457                                                 03017000
CVTRV462 EQU   CVTRV457                                                 03018000
CVTRV461 EQU   CVTRV457                                                 03019000
CVTRV460 EQU   CVTRV457                                                 03020000
CVTRV459 EQU   CVTRV457                                                 03021000
CVTRV458 EQU   CVTRV457                                                 03022000
CVTRV456 EQU   CVTXTNT2+108                                             03023000
CVTRV455 EQU   CVTXTNT2+104                                             03024000
CVTRV454 EQU   CVTXTNT2+100                                             03025000
CVTRV453 EQU   CVTXTNT2+96                                              03026000
CVTRV452 EQU   CVTXTNT2+94                                              03027000
CVTRV451 EQU   CVTXTNT2+92                                              03028000
CVTRV450 EQU   CVTXTNT2+90                                              03029000
CVTRV449 EQU   CVTXTNT2+88                                              03030000
CVTRV448 EQU   CVTXTNT2+87                                              03031000
CVTRV447 EQU   CVTXTNT2+86                                              03032000
CVTRV446 EQU   CVTRV438                                                 03033000
CVTRV445 EQU   CVTRV438                                                 03034000
CVTRV444 EQU   CVTRV438                                                 03035000
CVTRV443 EQU   CVTRV438                                                 03036000
CVTRV442 EQU   CVTRV438                                                 03037000
CVTRV441 EQU   CVTRV438                                                 03038000
CVTRV440 EQU   CVTRV438                                                 03039000
CVTRV439 EQU   CVTRV438                                                 03040000
CVTRV437 EQU   CVTRV429                                                 03041000
CVTRV436 EQU   CVTRV429                                                 03042000
CVTRV435 EQU   CVTRV429                                                 03043000
CVTRV434 EQU   CVTRV429                                                 03044000
CVTRV433 EQU   CVTRV429                                                 03045000
CVTRV432 EQU   CVTRV429                                                 03046000
CVTRV431 EQU   CVTRV429                                                 03047000
CVTRV430 EQU   CVTRV429                                                 03048000
CVTRV428 EQU   CVTXTNT2+80                                              03049000
CVTRV427 EQU   CVTXTNT2+76                                              03050000
CVTRV426 EQU   CVTXTNT2+72                                              03051000
CVTRV425 EQU   CVTXTNT2+68                                              03052000
CVTATACT EQU   CVTATCVT                                                 03053000
CVTRV423 EQU   CVTXTNT2+62                                              03054000
CVTRV422 EQU   CVTXTNT2+60                                              03055000
CVTRV421 EQU   CVTXTNT2+58                                              03056000
CVTRV420 EQU   CVTXTNT2+56                                              03057000
CVTRV419 EQU   CVTXTNT2+55                                              03058000
CVTRV418 EQU   CVTXTNT2+54                                              03059000
CVTRV417 EQU   CVTRV409                                                 03060000
CVTRV416 EQU   CVTRV409                                                 03061000
CVTRV415 EQU   CVTRV409                                                 03062000
CVTRV414 EQU   CVTRV409                                                 03063000
CVTRV413 EQU   CVTRV409                                                 03064000
CVTRV412 EQU   CVTRV409                                                 03065000
CVTRV411 EQU   CVTRV409                                                 03066000
CVTRV410 EQU   CVTRV409                                                 03067000
CVTRV408 EQU   CVTRV400                                                 03068000
CVTRV407 EQU   CVTRV400                                                 03069000
CVTRV406 EQU   CVTRV400                                                 03070000
CVTRV405 EQU   CVTRV400                                                 03071000
CVTRV404 EQU   CVTRV400                                                 03072000
CVTRV403 EQU   CVTRV400                                                 03073000
CVTRV402 EQU   CVTRV400                                                 03074000
CVTRV401 EQU   CVTRV400                                                 03075000
CVTICB   EQU   CVTXTNT2+48                                              03076000
CVTSKTA  EQU   CVTXTNT2+44                                              03077000
CVTSHSB  EQU   CVTSHS                                                   03078000
CVTRSV98 EQU   CVTXTNT2+36                                              03079000
CVTRSV97 EQU   CVTXTNT2+34                                              03080000
CVTRSV96 EQU   CVTXTNT2+32                                              03081000
CVTOLTEP EQU   CVTXTNT2+28                                              03082000
CVTQIDA  EQU   CVTQID+1                                                 03083000
CVTRSV95 EQU   CVTQID                                                   03084000
CVTRSV94 EQU   CVTXTNT2+20                                              03085000
CVTRSV93 EQU   CVTXTNT2+16                                              03086000
CVTRSV92 EQU   CVTXTNT2+12                                              03087000
CVTDEBVR EQU   CVTXTNT2+8                                               03088000
CVTRSV91 EQU   CVTXTNT2+6                                               03089000
CVTRSV9H EQU   CVTFLGBT                                                 03090000
CVTRSV9G EQU   CVTFLGBT                                                 03091000
CVTRSV9F EQU   CVTFLGBT                                                 03092000
CVTRSV9E EQU   CVTFLGBT                                                 03093000
CVTRSV9D EQU   CVTFLGBT                                                 03094000
CVTRSV9C EQU   CVTFLGBT                                                 03095000
CVTVME   EQU   CVTFLGBT                                                 03096000
CVTNPE   EQU   CVTFLGBT                                                 03097000
CVTNUCLS EQU   CVTXTNT2+4                                               03098000
CVTDSSVA EQU   CVTDSSV+1                                                03099000
CVTRSV89 EQU   CVTDSSV                                                  03100000
CVTRSV88 EQU   CVTXTNT1+8                                               03101000
CVTRSV87 EQU   CVTXTNT1+4                                               03102000
CVTFACHN EQU   CVTXTNT1                                                 03103000
CVTRV488 EQU   CVTMAP+412                                               03104000
CVTRV487 EQU   CVTMAP+408                                               03105000
CVTRV486 EQU   CVTMAP+404                                               03106000
CVTRV485 EQU   CVTMAP+400                                               03107000
CVTACTAP EQU   CVTMAP+396                                               03108000
CVTAUTH  EQU   CVTMAP+392                                               03109000
CVTATMCA EQU   CVTATMCT+1                                               03110000
CVTATMST EQU   CVTATMCT                                                 03111000
CVTRSV61 EQU   CVTMAP+384                                               03112000
CVTVOLT1 EQU   CVTVOLM1+1                                               03113000
CVTVOLI1 EQU   CVTVOLF1                                                 03114000
CVTSTOA  EQU   CVTMAP+376                                               03115000
CVTRSV58 EQU   CVTMAP+374                                               03116000
CVTRSV57 EQU   CVTMAP+372                                               03117000
CVTDDCE  EQU   CVTMAP+368                                               03118000
CVTPNWFR EQU   CVTMAP+364                                               03119000
CVTSMF   EQU   CVTMAP+360                                               03120000
CVTSULK  EQU   CVTMAP+358                                               03121000
CVTSLKO  EQU   CVTSYSK                                                  03122000
CVTSLKP  EQU   CVTSYSK                                                  03123000
CVTSLKQ  EQU   CVTSYSK                                                  03124000
CVTSLKR  EQU   CVTSYSK                                                  03125000
CVTRSV56 EQU   CVTSYSK                                                  03126000
CVTRSV55 EQU   CVTSYSK                                                  03127000
CVTRSV54 EQU   CVTSYSK                                                  03128000
CVTRSV53 EQU   CVTSYSK                                                  03129000
CVTRSV52 EQU   CVTA1F1                                                  03130000
CVTRSV51 EQU   CVTA1F1                                                  03131000
CVTRSV50 EQU   CVTA1F1                                                  03132000
CVTRSV49 EQU   CVTA1F1                                                  03133000
CVTRSV48 EQU   CVTA1F1                                                  03134000
CVTRSV47 EQU   CVTA1F1                                                  03135000
CVTSRSW  EQU   CVTA1F1                                                  03136000
CVTPFSW  EQU   CVTA1F1                                                  03137000
CVTPCVT  EQU   CVTMAP+352                                               03138000
CVTRSV46 EQU   CVTMAP+344                                               03139000
CVTRSV45 EQU   CVTMAP+340                                               03140000
CVTRSV44 EQU   CVTMAP+338                                               03141000
CVTRSV43 EQU   CVTMAP+336                                               03142000
CVTHJESA EQU   CVTHJES+1                                                03143000
CVTRSV42 EQU   CVTHJES                                                  03144000
CVTEXT2A EQU   CVTEXT2+1                                                03145000
CVTRSV41 EQU   CVTEXT2                                                  03146000
CVTAPFA  EQU   CVTAPF+1                                                 03147000
CVTRSV40 EQU   CVTAPF                                                   03148000
CVTRV518 EQU   CVTINTLA                                                 03149000
CVTRV517 EQU   CVTERPV                                                  03150000
CVTEORM  EQU   CVTMAP+312                                               03151000
CVTMCHPR EQU   CVTMAP+308                                               03152000
CVTTZ    EQU   CVTMAP+304                                               03153000
CVTJEPS  EQU   CVTMAP+300                                               03154000
CVTJESCT EQU   CVTMAP+296                                               03155000
CVTMODE  EQU   CVTMAP+292                                               03156000
CVTPTRV  EQU   CVTMAP+288                                               03157000
CVTREAL  EQU   CVTMAP+284                                               03158000
CVTRSV39 EQU   CVTMAP+280                                               03159000
CVTRSV38 EQU   CVTMAP+276                                               03160000
CVTDMSRA EQU   CVTDMSR+1                                                03161000
CVTRV634 EQU   CVTDMSRF                                                 03162000
CVTRV633 EQU   CVTDMSRF                                                 03163000
CVTRV632 EQU   CVTDMSRF                                                 03164000
CVTRV631 EQU   CVTDMSRF                                                 03165000
CVTRV630 EQU   CVTDMSRF                                                 03166000
CVTRV629 EQU   CVTDMSRF                                                 03167000
CVTUDUMP EQU   CVTDMSRF                                                 03168000
CVTSDUMP EQU   CVTDMSRF                                                 03169000
CVTQMSGA EQU   CVTQMSG+1                                                03170000
CVTRSV36 EQU   CVTQMSG                                                  03171000
CVTAMFF  EQU   CVTMAP+264                                               03172000
CVTPURGA EQU   CVTPURG+1                                                03173000
CVTRSV35 EQU   CVTPURG                                                  03174000
CVTCBSP  EQU   CVTMAP+256                                               03175000
CVTATERA EQU   CVTATER+1                                                03176000
CVTSYST  EQU   CVTATER                                                  03177000
CVTVOLT2 EQU   CVTTAT                                                   03178000
CVTVOLI2 EQU   CVTVOLF2                                                 03179000
CVTAQAVB EQU   CVTAQAVT+1                                               03180000
CVTRSV34 EQU   CVTTCMFG                                                 03181000
CVTRSV33 EQU   CVTTCMFG                                                 03182000
CVTRSV32 EQU   CVTTCMFG                                                 03183000
CVTRSV31 EQU   CVTTCMFG                                                 03184000
CVTRSV30 EQU   CVTTCMFG                                                 03185000
CVTRSV29 EQU   CVTTCMFG                                                 03186000
CVTRSV28 EQU   CVTTCMFG                                                 03187000
CVTTCRDY EQU   CVTTCMFG                                                 03188000
CVTGTFA  EQU   CVTGTF+1                                                 03189000
CVTRSV27 EQU   CVTGTFST                                                 03190000
CVTRNIO  EQU   CVTGTFST                                                 03191000
CVTUSR   EQU   CVTGTFST                                                 03192000
CVTRV318 EQU   CVTFORM                                                  03193000
CVTRV317 EQU   CVTTMODE                                                 03194000
CVTRV316 EQU   CVTSTATE                                                 03195000
CVTRV315 EQU   CVTGTFS                                                  03196000
CVTGTFAV EQU   CVTGTFS                                                  03197000
CVT0SCR1 EQU   CVTMAP+232                                               03198000
CVTRV515 EQU   CVTMAP+228                                               03199000
CVTRMS   EQU   CVTMAP+224                                               03200000
CVTPATCH EQU   CVTMAP+220                                               03201000
CVTTSCE  EQU   CVTMAP+216                                               03202000
CVTLNKSC EQU   CVTMAP+214                                               03203000
CVTQABST EQU   CVTMAP+212                                               03204000
CVTMDLDS EQU   CVTMAP+208                                               03205000
CVTUSER  EQU   CVTMAP+204                                               03206000
CVTABEND EQU   CVTMAP+200                                               03207000
CVTSMCA  EQU   CVTMAP+196                                               03208000
CVTRSV18 EQU   CVTMAP+192                                               03209000
CVTQLPAQ EQU   CVTMAP+188                                               03210000
CVTQCDSR EQU   CVTMAP+184                                               03211000
CVTRSV17 EQU   CVTOPTB                                                  03212000
CVTRSV16 EQU   CVTOPTB                                                  03213000
CVTFP    EQU   CVTOPTB                                                  03214000
CVTAPTHR EQU   CVTOPTB                                                  03215000
CVTNLOG  EQU   CVTOPTB                                                  03216000
CVTTOD   EQU   CVTOPTB                                                  03217000
CVTCTIMS EQU   CVTOPTB                                                  03218000
CVTPROT  EQU   CVTOPTB                                                  03219000
CVTXPFP  EQU   CVTOPTA                                                  03220000
CVTASCII EQU   CVTOPTA                                                  03221000
CVTRSV13 EQU   CVTOPTA                                                  03222000
CVTRSV12 EQU   CVTOPTA                                                  03223000
CVTNIP   EQU   CVTOPTA                                                  03224000
CVTDDR   EQU   CVTOPTA                                                  03225000
CVTAPR   EQU   CVTOPTA                                                  03226000
CVTCCH   EQU   CVTOPTA                                                  03227000
CVTSNCTR EQU   CVTMAP+180                                               03228000
CVTQMWR  EQU   CVTMAP+176                                               03229000
CVTQOCR  EQU   CVTMAP+172                                               03230000
CVT1EF00 EQU   CVTMAP+168                                               03231000
CVTMZ00  EQU   CVTMAP+164                                               03232000
CVTHEAD  EQU   CVTMAP+160                                               03233000
CVTRSV11 EQU   CVTMAP+156                                               03234000
CVT0PT01 EQU   CVTMAP+152                                               03235000
CVTMSER  EQU   CVTMAP+148                                               03236000
CVTRV516 EQU   CVTIERLC                                                 03237000
CVTILCH  EQU   CVTMAP+140                                               03238000
CVT0DS   EQU   CVTMAP+136                                               03239000
CVTFBOSV EQU   CVTMAP+132                                               03240000
CVTNUCB  EQU   CVTMAP+128                                               03241000
CVTIXAVL EQU   CVTMAP+124                                               03242000
CVTIOQET EQU   CVTMAP+120                                               03243000
CVTDCBA  EQU   CVTMAP+117                                               03244000
CVTMVS2  EQU   CVTDCB                                                   03245000
CVT6DAT  EQU   CVTDCB                                                   03246000
CVT4MPS  EQU   CVTDCB                                                   03247000
CVTRSV09 EQU   CVTDCB                                                   03248000
CVT4MS1  EQU   CVTDCB                                                   03249000
CVT2SPS  EQU   CVTDCB                                                   03250000
CVT1SSS  EQU   CVTDCB                                                   03251000
CVTRSV08 EQU   CVTDCB                                                   03252000
CVTSTB   EQU   CVTMAP+112                                               03253000
CVTQTD00 EQU   CVTMAP+108                                               03254000
CVTQTE00 EQU   CVTMAP+104                                               03255000
CVTCUCB  EQU   CVTMAP+100                                               03256000
CVTSJQ   EQU   CVTMAP+96                                                03257000
CVTPBLDL EQU   CVTMAP+92                                                03258000
CVTTPC   EQU   CVTMAP+88                                                03259000
CVTSVDCB EQU   CVTMAP+84                                                03260000
CVTBRET  EQU   CVTMAP+82                                                03261000
CVTEXIT  EQU   CVTMAP+80                                                03262000
CVT0FN00 EQU   CVTMAP+76                                                03263000
CVTDARA  EQU   CVTDAR+1                                                 03264000
CVTRSV07 EQU   CVTFLGS1                                                 03265000
CVTRSV06 EQU   CVTFLGS1                                                 03266000
CVTRSV05 EQU   CVTFLGS1                                                 03267000
CVTRSV04 EQU   CVTFLGS1                                                 03268000
CVTRSV03 EQU   CVTFLGS1                                                 03269000
CVTRSV02 EQU   CVTFLGS1                                                 03270000
CVTRSV01 EQU   CVTFLGS1                                                 03271000
CVTDMPLK EQU   CVTFLGS1                                                 03272000
CVTXITP  EQU   CVTMAP+68                                                03273000
CVTZDTAB EQU   CVTMAP+64                                                03274000
CVTMSLT  EQU   CVTMAP+60                                                03275000
CVTDATE  EQU   CVTMAP+56                                                03276000
CVTBTERM EQU   CVTMAP+52                                                03277000
CVTSYSAD EQU   CVTMAP+48                                                03278000
CVTXTLER EQU   CVTMAP+44                                                03279000
CVTILK2  EQU   CVTMAP+40                                                03280000
CVTILK1  EQU   CVTMAP+36                                                03281000
CVTPRLTV EQU   CVTMAP+32                                                03282000
CVTPCNVT EQU   CVTMAP+28                                                03283000
CVT0VL00 EQU   CVTMAP+24                                                03284000
CVTXAPG  EQU   CVTMAP+20                                                03285000
CVTBUF   EQU   CVTMAP+16                                                03286000
CVTJOB   EQU   CVTMAP+12                                                03287000
CVTLINK  EQU   CVTMAP+8                                                 03288000
CVT0EF00 EQU   CVTMAP+4                                                 03289000
CVTTCBP  EQU   CVTMAP                                                   03290000
CVT      EQU   CVTMAP                                                   03291000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03292000
@RC00325 EQU   @RC00324                                                 03293000
@RC00340 EQU   @RC00325                                                 03294000
@ENDDATA EQU   *                                                        03295000
         END   ISTNMCCR,(C'PLS2130',0701,77087)                         03296000
