SVTM     TITLE 'ISTOCCQU - QUIESCE ROUTINE                             *00001000
                        '                                               00002000
ISTOCCQU CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTOCCQU  75.136'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
*                                                                  0314 00013000
*/********************************************************************/ 00014000
*/*  ROUTINE NAME: MAIN LINE                                         */ 00015000
*/*  FUNCTION:                                                       */ 00016000
*/*      THIS IS THE MAIN LINE FOR ISTOCCQU. IT'S FUNCTION IS TO     */ 00017000
*/*      ROUTE CONTROL TO THE PROPER FUNCTION OF SETLOGON. IF THE    */ 00018000
*/*      RPL INDICATES THAT THIS IS A FIRST TIME REQUEST, THEN THE   */ 00019000
*/*       ACTIVATE ROUTINE IS CALLED TO PROCESS LOGONS. FOR A        */ 00020000
*/*      QUIESCE REQUEST, THE QUIESCE ROUTINE IS CALLED. IF THE APPL */ 00021000
*/*      WANTS TO TEMPARILY BLOCK LOGONS, THEN RAPATLGN IS SET.      */ 00022000
*/*      FOR A SECOND TIME START, RAPATLGN IS RESET. THIS ROUTINE    */ 00023000
*/*      WILL CALL ROUTINES DOLOCK AND DOUNLOCK TO OBTAIN AND        */ 00024000
*/*      RELEASE LOCKS. EXIT IS TO ISTOCCUR.                         */ 00025000
*/*  ROUTINES CALLED:                                                */ 00026000
*/*      DOLOCK - OBTAIN THE VOC AND RDT LOCKS                       */ 00027000
*/*      ACTIVATE - PROCESS QUEUED LOGONS OR VARY LOGON TERMINALS    */ 00028000
*/*      QUIESCE - QUIESCE THE APPLICATION                           */ 00029000
*/*      DOUNLOCK - RELEASE THE LOCKS OBTAINED IN DOLOCK             */ 00030000
*/*  MACROS USED:                                                    */ 00031000
*/*      CRRMAINT - FOOT PRINT                                       */ 00032000
*/********************************************************************/ 00033000
*                                                                  0314 00034000
*   DO;                                                            0314 00035000
*                                                                  0314 00036000
*/***  CRRMAINT  PROCNM(ISTOCCQU)COMP(OC)FUNC(MAIN)  **              */ 00037000
*                                                                  0315 00038000
*     DCL                                                          0315 00039000
*       CMZK0006 PTR(31) REG(1);                                   0315 00040000
*     RFY                                                          0316 00041000
*      (CMZK0006) RSTD;                                            0316 00042000
*                                                                  0316 00043000
*/* ATBUILD (ISTRPH,ISTCRA,ISTPFCRR,ISTOCCRR)                        */ 00044000
*                                                                  0317 00045000
*     RFY                                                          0317 00046000
*       ISTLCCW;                                                   0317 00047000
*     RFY                                                          0318 00048000
*       ISTLCPB;                                                   0318 00049000
*     RFY                                                          0319 00050000
*       ISTZSAVE;                                                  0319 00051000
*     RFY                                                          0320 00052000
*       ISTPFCRR;                                                  0320 00053000
*     RFY                                                          0321 00054000
*       ISTCFCRR;                                                  0321 00055000
*     RFY                                                          0322 00056000
*       ISTZCRR;                                                   0322 00057000
*     RFY                                                          0323 00058000
*       ISTASCRR;                                                  0323 00059000
*     RFY                                                          0324 00060000
*       ISTAPCRR;                                                  0324 00061000
*     RFY                                                          0325 00062000
*       ISTCRA;                                                    0325 00063000
*     RFY                                                          0326 00064000
*       ISTCNSTA;                                                  0326 00065000
*     RFY                                                          0327 00066000
*       ISTOCCRR;                                                  0327 00067000
*                                                                  0327 00068000
*/* END OF ATBUILD                                                   */ 00069000
*/*  ** SAVE CRR AND FRR POINTERS **                                 */ 00070000
*                                                                  0328 00071000
*     ADDR(CMZK0006->RPHCRR->CRAPROCR)->PFCCRRO=CMZK0006->RPHCRR-> 0328 00072000
*         CRACRR;                                                  0328 00073000
         L     @11,RPHCRR(,CMZK0006)                               0328 00074000
         LA    @05,312                                             0328 00075000
         ALR   @05,@11                                             0328 00076000
         L     @00,CRACRR(,@11)                                    0328 00077000
         ST    @00,PFCCRRO(,@05)                                   0328 00078000
*     ADDR(CMZK0006->RPHCRR->CRAPROCR)->PFCFRRO=CMZK0006->RPHCRR-> 0329 00079000
*         CRAFRR;                                                  0329 00080000
*                                                                  0329 00081000
         L     @00,CRAFRR(,@11)                                    0329 00082000
         ST    @00,PFCFRRO(,@05)                                   0329 00083000
*/*  ** SET UP POINTERS TO OUR CRR, FRR **                           */ 00084000
*                                                                  0330 00085000
*     CMZK0006->RPHCRR->CRACRR=ADDR(CMZK0006->RPHCRR->CRAPROCR);   0330 00086000
         LA    @05,CRAPROCR(,@11)                                  0330 00087000
         ST    @05,CRACRR(,@11)                                    0330 00088000
*     CMZK0006->RPHCRR->CRAFRR=0;                                  0331 00089000
*                                                                  0331 00090000
         SLR   @00,@00                                             0331 00091000
         ST    @00,CRAFRR(,@11)                                    0331 00092000
*/*  ** SET OUR COMPONENT PROCESS ID IN CRR **                       */ 00093000
*                                                                  0332 00094000
*     CMZK0006->RPHCRR->CRACRR->PFCFTA=TIDOCCQU;                   0332 00095000
*                                                                  0332 00096000
         MVI   PFCFTA(@05),X'20'                                   0332 00097000
*/*  ** CLEAR COMPONENT ENTERED INDICATORS **                        */ 00098000
*                                                                  0333 00099000
*     CMZK0006->RPHCRR->CRACRR->OCCNTRD='0'B;                      0333 00100000
*                                                                  0333 00101000
         XC    OCCNTRD+1(2,@05),OCCNTRD+1(@05)                     0333 00102000
         MVI   OCCNTRD(@05),B'00000000'                            0333 00103000
*/*  ** SET ENTERED BIT FOR THIS PROCEDURE **                        */ 00104000
*                                                                  0334 00105000
*     CMZK0006->RPHCRR->CRACRR->NOCCQU='1'B;                       0334 00106000
*                                                                  0334 00107000
         OI    NOCCQU(@05),B'10000000'                             0334 00108000
*/*  ** CLEAR AND SET CURRENT PROCEDURE BIT **                       */ 00109000
*                                                                  0335 00110000
*     CMZK0006->RPHCRR->CRACRR->OCCCRT='0'B;                       0335 00111000
         XC    OCCCRT+1(2,@05),OCCCRT+1(@05)                       0335 00112000
         MVI   OCCCRT(@05),B'00000000'                             0335 00113000
*     CMZK0006->RPHCRR->CRACRR->COCCQU='1'B;                       0336 00114000
         OI    COCCQU(@05),B'10000000'                             0336 00115000
*   END;                                                           0337 00116000
*   OCWPTR=RPHWEA;                  /* SET UP POINTER TO OCW         */ 00117000
         L     OCWPTR,RPHWEA(,RPHPTR)                              0338 00118000
*   SVEAREA=ADDR(OCWSAVE1);         /* SET UP PTR TO REG SAVE AREA   */ 00119000
         LA    SVEAREA,OCWSAVE1(,OCWPTR)                           0339 00120000
*   C14SVPTR=ADDR(OCWR14SV)+4;      /* SET UP R14 SAVE AREA          */ 00121000
         LA    @11,OCWR14SV(,OCWPTR)                               0340 00122000
         AL    @11,@CF00053                                        0340 00123000
         ST    @11,C14SVPTR+624(,OCWPTR)                           0340 00124000
*   CALL DOLOCK;                    /* LOCK RDTE IN STORAGE          */ 00125000
         BAL   @14,DOLOCK                                          0341 00126000
*   IF OCWRC^=0                     /* IF LOCKS NOT OBTAINED         */ 00127000
*     THEN                                                         0342 00128000
         CLI   OCWRC(OCWPTR),0                                     0342 00129000
         BNE   @RT00342                                            0342 00130000
*     ;                                                            0343 00131000
*   ELSE                                                           0344 00132000
*     IF RAPABLGN=CON|RAPAQUI=CON   /* ILLEGAL QUIESCE               */ 00133000
*       THEN                                                       0344 00134000
         L     @11,OCWARDTE(,OCWPTR)                               0344 00135000
         TM    RAPABLGN(@11),B'11000000'                           0344 00136000
         BZ    @RF00344                                            0344 00137000
*       DO;                                                        0345 00138000
*         OCWRC='08'X;              /* LOGICAL ERROR                 */ 00139000
         MVI   OCWRC(OCWPTR),X'08'                                 0346 00140000
*         OCWEC='66'X;              /* ILLEGAL QUIESCE               */ 00141000
         MVI   OCWEC(OCWPTR),X'66'                                 0347 00142000
*       END;                                                       0348 00143000
*     ELSE                                                         0349 00144000
*       DO;                                                        0349 00145000
         B     @RC00344                                            0349 00146000
@RF00344 DS    0H                                                  0350 00147000
*         IF RPLSTART=CON           /* START LOGONS FOR APPLI        */ 00148000
*           THEN                                                   0350 00149000
         L     @11,OCWRPL(,OCWPTR)                                 0350 00150000
         TM    RPLSTART(@11),B'01000000'                           0350 00151000
         BNO   @RF00350                                            0350 00152000
*           IF RAPASLGI=COFF        /* FIRST TIME FOR ACTIVATE?      */ 00153000
*             THEN                                                 0351 00154000
         L     @11,OCWARDTE(,OCWPTR)                               0351 00155000
         TM    RAPASLGI(@11),B'00100000'                           0351 00156000
         BNZ   @RF00351                                            0351 00157000
*             IF ATCQKHLT=CON|ATCSNHLT=CON/* HALT GOING ON           */ 00158000
*               THEN                                               0352 00159000
         L     @11,OCWACVT(,OCWPTR)                                0352 00160000
         TM    ATCQKHLT(@11),B'00110000'                           0352 00161000
         BZ    @RF00352                                            0352 00162000
*               DO;                                                0353 00163000
*                 OCWRC='08'X;      /* LOGICAL ERR                   */ 00164000
         MVI   OCWRC(OCWPTR),X'08'                                 0354 00165000
*                 OCWEC='5B'X;      /* HALT IN PROGRESS              */ 00166000
         MVI   OCWEC(OCWPTR),X'5B'                                 0355 00167000
*               END;                                               0356 00168000
*             ELSE                                                 0357 00169000
*               DO;                                                0357 00170000
         B     @RC00352                                            0357 00171000
@RF00352 DS    0H                                                  0358 00172000
*                 RAPASLGI=CON;     /* NOT FIRST TIME ANY MORE       */ 00173000
*                 RAPATLGN=COFF;    /* TEMP STOP LOGONS FLAG OFF     */ 00174000
         L     @11,OCWARDTE(,OCWPTR)                               0359 00175000
         OI    RAPASLGI(@11),B'00100000'                           0359 00176000
         NI    RAPATLGN(@11),B'11101111'                           0359 00177000
*                 CALL ACTIVATE;                                   0360 00178000
         BAL   @14,ACTIVATE                                        0360 00179000
*               END;                                               0361 00180000
*           ELSE                                                   0362 00181000
*             DO;                                                  0362 00182000
         B     @RC00351                                            0362 00183000
@RF00351 DS    0H                                                  0363 00184000
*               RAPATLGN=COFF;      /* APPL WILL ACCEPT LOGONS NOW   */ 00185000
         L     @11,OCWARDTE(,OCWPTR)                               0363 00186000
         NI    RAPATLGN(@11),B'11101111'                           0363 00187000
*               OCWRC=0;                                           0364 00188000
         MVI   OCWRC(OCWPTR),X'00'                                 0364 00189000
*               OCWEC=0;                                           0365 00190000
         MVI   OCWEC(OCWPTR),X'00'                                 0365 00191000
*             END;                                                 0366 00192000
*         ELSE                                                     0367 00193000
*           IF RPLSTOP=CON          /* STOP LOGONS TO THIS APPL      */ 00194000
*             THEN                                                 0367 00195000
         B     @RC00350                                            0367 00196000
@RF00350 L     @11,OCWRPL(,OCWPTR)                                 0367 00197000
         TM    RPLSTOP(@11),B'00100000'                            0367 00198000
         BNO   @RF00367                                            0367 00199000
*             RAPATLGN=CON;         /* STOP LOGONS TO THIS TERM FOR     00200000
*                                      NOW                           */ 00201000
         L     @11,OCWARDTE(,OCWPTR)                               0368 00202000
         OI    RAPATLGN(@11),B'00010000'                           0368 00203000
*           ELSE                                                   0369 00204000
*             IF RPLQUIES=CON       /* APPL SHUTTING DOWN?           */ 00205000
*               THEN                                               0369 00206000
         B     @RC00367                                            0369 00207000
@RF00367 L     @11,OCWRPL(,OCWPTR)                                 0369 00208000
         TM    RPLQUIES(@11),B'10000000'                           0369 00209000
         BNO   @RF00369                                            0369 00210000
*               CALL QUIESCE;       /* QUIESCE THIS APPL             */ 00211000
         BAL   @14,QUIESCE                                         0370 00212000
*             ELSE                                                 0371 00213000
*               DO;                                                0371 00214000
         B     @RC00369                                            0371 00215000
@RF00369 DS    0H                                                  0372 00216000
*                 OCWRC='24'X;      /* SYSTEM ERROR                  */ 00217000
         MVI   OCWRC(OCWPTR),X'24'                                 0372 00218000
*                 OCWEC='01'X;                                     0373 00219000
         MVI   OCWEC(OCWPTR),X'01'                                 0373 00220000
*               END;                                               0374 00221000
*       END;                                                       0375 00222000
@RC00369 DS    0H                                                  0375 00223000
@RC00367 DS    0H                                                  0375 00224000
@RC00350 DS    0H                                                  0376 00225000
*   CALL DOUNLOCK;                  /* LOCK RDTE IN STORAGE          */ 00226000
@RC00344 DS    0H                                                  0376 00227000
@RT00342 BAL   @14,DOUNLOCK                                        0376 00228000
*   RPHWEA=OCWPTR;                  /* OCW ADDR INTO RPH             */ 00229000
         ST    OCWPTR,RPHWEA(,RPHPTR)                              0377 00230000
*   RPLRTNCD=OCWRC;                 /* ERROR CODE INTO RPL           */ 00231000
         L     @11,OCWRPL(,OCWPTR)                                 0378 00232000
         MVC   RPLRTNCD(1,@11),OCWRC(OCWPTR)                       0378 00233000
*   RPLFDB2=OCWEC;                  /* DITTO                 @DM09103*/ 00234000
         MVC   RPLFDB2(1,@11),OCWEC(OCWPTR)                        0379 00235000
*   RFY                                                            0380 00236000
*     ISTATCVT BASED(OCWACVT);                                     0380 00237000
*   CALL ISTOCCUR;                  /* EXIT TO UNROUTER              */ 00238000
         L     @15,@CV03198                                        0381 00239000
         BALR  @14,@15                                             0381 00240000
*                                                                  0382 00241000
*/********************************************************************/ 00242000
*/*  ROUTINE NAME: QUIESCE                                           */ 00243000
*/*  FUNCTION:                                                       */ 00244000
*/*      THIS ROUTINE IS CALLED BY MAIN LINE TO SET A BIT IN THE     */ 00245000
*/*      APPLICATION'S RDT WHICH WILL BLOCK LOGONS TO THIS APPL.     */ 00246000
*/*      THE NUMBER OF QUEUED LOGONS WILL BE RETURNED IN THE RPL.    */ 00247000
*/*  ROUTINES CALLED:                                                */ 00248000
*/*      NONE                                                        */ 00249000
*/*  MACROS USED:                                                    */ 00250000
*/*      NONE                                                        */ 00251000
*/********************************************************************/ 00252000
*                                                                  0382 00253000
*QUIESCE:                                                          0382 00254000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0382 00255000
         B     @PB00002                                            0382 00256000
QUIESCE  DS    0H                                                  0383 00257000
*   C14SAVE=CR14PTR;                                               0383 00258000
         LA    @11,624                                             0383 00259000
         ALR   @11,OCWPTR                                          0383 00260000
         L     @05,C14SVPTR(,@11)                                  0383 00261000
         ST    CR14PTR,C14SAVE(,@05)                               0383 00262000
*   C14SVPTR=C14SVPTR+4;                                           0384 00263000
         AL    @05,@CF00053                                        0384 00264000
         ST    @05,C14SVPTR(,@11)                                  0384 00265000
*   RFY                                                            0385 00266000
*     CLGNPND RSTD;                                                0385 00267000
*   RAPAQUI=CON;                    /* INDICATE QUIESCE IN PROGRESS  */ 00268000
         L     @05,OCWARDTE(,OCWPTR)                               0386 00269000
         OI    RAPAQUI(@05),B'01000000'                            0386 00270000
*   CLGNPND=CZERO;                  /* CLEAR LOGONS PENDING COUNTER  */ 00271000
         SLR   CLGNPND,CLGNPND                                     0387 00272000
*   RAPATLGN=COFF;                  /* ENSURE TEMP BLK LOGONS BIT OFF*/ 00273000
         NI    RAPATLGN(@05),B'11101111'                           0388 00274000
*   ICEPTR=RAPICELG;                /* GET LOGON ICE POINTER         */ 00275000
         L     ICEPTR,RAPICELG(,@05)                               0389 00276000
*   DO WHILE(ICEPTR^=ADDR(RAPICELG));/* COUNT PENDING LOGONS         */ 00277000
         B     @DE00390                                            0390 00278000
@DL00390 DS    0H                                                  0391 00279000
*     CLGNPND=CLGNPND+1;            /* INCREMENT LOGON PENDING COUNT */ 00280000
         AL    CLGNPND,@CF00061                                    0391 00281000
*     ICEPTR=ICESUBJQ;              /* GET POINTER TO NEXT ICE       */ 00282000
         L     ICEPTR,ICESUBJQ(,ICEPTR)                            0392 00283000
*   END;                            /* END LOGON PENDING COUNT LOOP  */ 00284000
@DE00390 L     @05,OCWARDTE(,OCWPTR)                               0393 00285000
         LA    @05,RAPICELG(,@05)                                  0393 00286000
         CR    ICEPTR,@05                                          0393 00287000
         BNE   @DL00390                                            0393 00288000
*   RPLFDBK=CLGNPND;                /* INDICATE HOW MANY LOGONS PEND */ 00289000
         L     @05,OCWRPL(,OCWPTR)                                 0394 00290000
         STCM  CLGNPND,7,RPLFDBK(@05)                              0394 00291000
*   RFY                                                            0395 00292000
*     CLGNPND UNRSTD;                                              0395 00293000
*   C14SVPTR=C14SVPTR-4;                                           0396 00294000
         LA    @11,624                                             0396 00295000
         ALR   @11,OCWPTR                                          0396 00296000
         L     @05,C14SVPTR(,@11)                                  0396 00297000
         SL    @05,@CF00053                                        0396 00298000
         ST    @05,C14SVPTR(,@11)                                  0396 00299000
*   CR14PTR=C14SAVE;                                               0397 00300000
         L     CR14PTR,C14SAVE(,@05)                               0397 00301000
*   END QUIESCE;                                                   0398 00302000
@EL00002 DS    0H                                                  0398 00303000
@EF00002 DS    0H                                                  0398 00304000
@ER00002 BR    @14                                                 0398 00305000
*ACTIVATE:                                                         0399 00306000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0399 00307000
*                                                                  0399 00308000
ACTIVATE DS    0H                                                  0400 00309000
*/********************************************************************/ 00310000
*/*  ROUTINE NAME: ACTIVATE                                          */ 00311000
*/*  FUNCTION:                                                       */ 00312000
*/*      THIS ROUTINE IS CALLED BY MAIN LINE TO DETERMINE IF THERE   */ 00313000
*/*      ARE ANY LOGONS QUEUED ON THE LOGONTOME CHAIN OR IF THERE IS */ 00314000
*/*      A VARY LOGON CHAIN TO BE PROCESSED.                         */ 00315000
*/*  ROUTINES CALLED:                                                */ 00316000
*/*      LOGEXIT - SCHEDULES USERS EXITS FOR ANY QUEUED ICES         */ 00317000
*/*      DOLOGON - CALLS CONN SERV TO LOGON TERMS ON VARY LOGON      */ 00318000
*/*      CHAIN.                                                      */ 00319000
*/*  MACROS USED:                                                    */ 00320000
*/*      NONE                                                        */ 00321000
*/********************************************************************/ 00322000
*                                                                  0400 00323000
*   C14SAVE=CR14PTR;                                               0400 00324000
         LA    @11,624                                             0400 00325000
         ALR   @11,OCWPTR                                          0400 00326000
         L     @05,C14SVPTR(,@11)                                  0400 00327000
         ST    CR14PTR,C14SAVE(,@05)                               0400 00328000
*   C14SVPTR=C14SVPTR+4;                                           0401 00329000
         AL    @05,@CF00053                                        0401 00330000
         ST    @05,C14SVPTR(,@11)                                  0401 00331000
*   IF RAPICELG^=ADDR(RAPICELG)     /* REAL LOGONS PENDING?          */ 00332000
*     THEN                                                         0402 00333000
         L     @11,OCWARDTE(,OCWPTR)                               0402 00334000
         LA    @05,RAPICELG(,@11)                                  0402 00335000
         C     @05,RAPICELG(,@11)                                  0402 00336000
         BE    @RF00402                                            0402 00337000
*     CALL LOGEXIT;                 /* LOGON EXIT PROCESSING         */ 00338000
         BAL   @14,LOGEXIT                                         0403 00339000
*   ELSE                                                           0404 00340000
*     ;                                                            0404 00341000
@RF00402 DS    0H                                                  0405 00342000
*   IF RPRLGONF^=RPRLGONB           /* IF LOGONS PENDING             */ 00343000
*     THEN                                                         0405 00344000
         L     @11,OCWARDTE(,OCWPTR)                               0405 00345000
         CLC   RPRLGONF(4,@11),RPRLGONB(@11)                       0405 00346000
         BE    @RF00405                                            0405 00347000
*     DO;                                                          0406 00348000
*       CALL DOLOGON;               /* CALL CON SERV FOR LOG         */ 00349000
         BAL   @14,DOLOGON                                         0407 00350000
*     END;                                                         0408 00351000
*   ELSE                                                           0409 00352000
*     ;                                                            0409 00353000
@RF00405 DS    0H                                                  0410 00354000
*   C14SVPTR=C14SVPTR-4;                                           0410 00355000
         LA    @11,624                                             0410 00356000
         ALR   @11,OCWPTR                                          0410 00357000
         L     @05,C14SVPTR(,@11)                                  0410 00358000
         SL    @05,@CF00053                                        0410 00359000
         ST    @05,C14SVPTR(,@11)                                  0410 00360000
*   CR14PTR=C14SAVE;                                               0411 00361000
         L     CR14PTR,C14SAVE(,@05)                               0411 00362000
*   END ACTIVATE;                                                  0412 00363000
@EL00003 DS    0H                                                  0412 00364000
@EF00003 DS    0H                                                  0412 00365000
@ER00003 BR    @14                                                 0412 00366000
*LOGEXIT:                                                          0413 00367000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0413 00368000
*                                                                  0413 00369000
LOGEXIT  DS    0H                                                  0414 00370000
*/********************************************************************/ 00371000
*/*  ROUTINE NAME: LOGEXIT                                           */ 00372000
*/*  FUNCTION:                                                       */ 00373000
*/*      THIS ROUTINE IS CALLED BY ACTIVATE TO DETERMINE             */ 00374000
*/*      IF USER EXIT'S SHOULD BE SCHEDULED FOR ANY ICE'S QUEUED.    */ 00375000
*/*      THE APPLICATION'S LOGONTOME ICE CHAIN IS LOOPED THROUGH AND */ 00376000
*/*      LOGSCHED IS CALLED TO SCHEDULE THE EXIT FOR EACH ICE.       */ 00377000
*/*  ROUTINES CALLED:                                                */ 00378000
*/*      LOGSCHED - SCHE A UECB FOR ONE ICE                          */ 00379000
*/*  MACROS USED:                                                    */ 00380000
*/*        MODESET                                                   */ 00381000
*/********************************************************************/ 00382000
*                                                                  0414 00383000
*   C14SAVE=CR14PTR;                                               0414 00384000
         LA    @11,624                                             0414 00385000
         ALR   @11,OCWPTR                                          0414 00386000
         L     @05,C14SVPTR(,@11)                                  0414 00387000
         ST    CR14PTR,C14SAVE(,@05)                               0414 00388000
*   C14SVPTR=C14SVPTR+4;                                           0415 00389000
         AL    @05,@CF00053                                        0415 00390000
         ST    @05,C14SVPTR(,@11)                                  0415 00391000
*   ICEPTR=RAPICELG;                /* SET PTR TO ISTICE             */ 00392000
         L     @05,OCWARDTE(,OCWPTR)                               0416 00393000
         L     ICEPTR,RAPICELG(,@05)                               0416 00394000
*   DO;                             /* MODESET EXTKEY(ZERO)          */ 00395000
*     SPKA(0);                      /* SET PSW KEY                   */ 00396000
         SLR   @11,@11                                             0418 00397000
         SPKA  0(@11)                                              0418 00398000
*   END;                            /* MODESET EXTKEY(ZERO)          */ 00399000
*   IF ACBUEL^=CZERO                /* IF UEXL PTR NOT ZERO          */ 00400000
*     THEN                                                         0420 00401000
         L     @05,OCWACDEB(,OCWPTR)                               0420 00402000
         L     @05,ACDACB-1(,@05)                                  0420 00403000
         LA    @05,0(,@05)                                         0420 00404000
         L     @05,ACBUEL(,@05)                                    0420 00405000
         CR    @05,@11                                             0420 00406000
         BE    @RF00420                                            0420 00407000
*     IF EXLLGNP^=CZERO             /* IF LOGN EXIT PTR NOT 0        */ 00408000
*       THEN                                                       0421 00409000
         ICM   @00,15,EXLLGNP(@05)                                 0421 00410000
         CR    @11,@00                                             0421 00411000
         BE    @RF00421                                            0421 00412000
*       DO;                                                        0422 00413000
*         DO WHILE ICEPTR^=ADDR(RAPICELG);/* DO WHILE ICE'S EXST     */ 00414000
         B     @DE00423                                            0423 00415000
@DL00423 DS    0H                                                  0424 00416000
*           CALL LOGSCHED;          /* LOGON EXIT FOR DEST           */ 00417000
         BAL   @14,LOGSCHED                                        0424 00418000
*           IF OCWRC='00'X          /* IF ACB COPY ERR CODE 0        */ 00419000
*             THEN                                                 0425 00420000
         CLI   OCWRC(OCWPTR),X'00'                                 0425 00421000
         BNE   @RF00425                                            0425 00422000
*             ICEPTR=ICESUBJQ;      /* GET ADDR NEXT ICE             */ 00423000
         L     ICEPTR,ICESUBJQ(,ICEPTR)                            0426 00424000
*           ELSE                                                   0427 00425000
*             ICEPTR=ADDR(RAPICELG);/* GET OUT OF LOOP               */ 00426000
         B     @RC00425                                            0427 00427000
@RF00425 L     ICEPTR,OCWARDTE(,OCWPTR)                            0427 00428000
         LA    ICEPTR,RAPICELG(,ICEPTR)                            0427 00429000
*         END;                                                     0428 00430000
@RC00425 DS    0H                                                  0428 00431000
@DE00423 L     @11,OCWARDTE(,OCWPTR)                               0428 00432000
         LA    @11,RAPICELG(,@11)                                  0428 00433000
         CR    ICEPTR,@11                                          0428 00434000
         BNE   @DL00423                                            0428 00435000
*       END;                                                       0429 00436000
*     ELSE                                                         0430 00437000
*       ;                                                          0430 00438000
@RF00421 DS    0H                                                  0431 00439000
*   ELSE                                                           0431 00440000
*     ;                                                            0431 00441000
@RF00420 DS    0H                                                  0432 00442000
*   DO;                             /* MODESET EXTKEY(VTAM)          */ 00443000
*     SPKA(96);                     /* SET PSW KEY                   */ 00444000
         LA    @11,96                                              0433 00445000
         SPKA  0(@11)                                              0433 00446000
*   END;                            /* MODESET EXTKEY(VTAM)          */ 00447000
*   C14SVPTR=C14SVPTR-4;                                           0435 00448000
         LA    @11,624                                             0435 00449000
         ALR   @11,OCWPTR                                          0435 00450000
         L     @05,C14SVPTR(,@11)                                  0435 00451000
         SL    @05,@CF00053                                        0435 00452000
         ST    @05,C14SVPTR(,@11)                                  0435 00453000
*   CR14PTR=C14SAVE;                                               0436 00454000
         L     CR14PTR,C14SAVE(,@05)                               0436 00455000
*   END LOGEXIT;                                                   0437 00456000
@EL00004 DS    0H                                                  0437 00457000
@EF00004 DS    0H                                                  0437 00458000
@ER00004 BR    @14                                                 0437 00459000
*DOLOGON:                                                          0438 00460000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0438 00461000
*                                                                  0438 00462000
DOLOGON  DS    0H                                                  0439 00463000
*/********************************************************************/ 00464000
*/*  ROUTINE NAME: DOLOGON                                           */ 00465000
*/*  FUNCTION:                                                       */ 00466000
*/*      DOLOGON IS CALLED BY ACTIVATE TO PROCESS THE VARY LOGON     */ 00467000
*/*      CHAIN IN THE APPLICATION'S RDTE. THIS CHAIN IS LOOPED       */ 00468000
*/*      THROUGH AND CONN SERV IS CALLED FOR EVERY TERM ON THE       */ 00469000
*/*      CHAIN TO LOG IT ON TO THE APPLICATION.                      */ 00470000
*/*  ROUTINES CALLED:                                                */ 00471000
*/*      CSINIT - INITIALIZE A CONN SERV PARM LIST                   */ 00472000
*/*      ISTCSCMR - LOGON TERM TO APPL                               */ 00473000
*/*  MACROS USED:                                                    */ 00474000
*/*      CRRMINT - FOOTPRINT                                         */ 00475000
*/********************************************************************/ 00476000
*                                                                  0439 00477000
*   C14SAVE=CR14PTR;                                               0439 00478000
         LA    @11,624                                             0439 00479000
         ALR   @11,OCWPTR                                          0439 00480000
         L     @05,C14SVPTR(,@11)                                  0439 00481000
         ST    CR14PTR,C14SAVE(,@05)                               0439 00482000
*   C14SVPTR=C14SVPTR+4;                                           0440 00483000
         AL    @05,@CF00053                                        0440 00484000
         ST    @05,C14SVPTR(,@11)                                  0440 00485000
*   OCWDRDTE=RPRLGONF;              /* SET UP DEST RDTE BASE         */ 00486000
*                                                                  0441 00487000
         L     @11,OCWARDTE(,OCWPTR)                               0441 00488000
         L     @11,RPRLGONF(,@11)                                  0441 00489000
         ST    @11,OCWDRDTE(,OCWPTR)                               0441 00490000
*   /*****************************************************************/ 00491000
*   /*                                                               */ 00492000
*   /* DO WHILE Q NOT EMPTY & NO ERRORS                              */ 00493000
*   /*                                                               */ 00494000
*   /*****************************************************************/ 00495000
*                                                                  0442 00496000
*   DO WHILE OCWDRDTE^=RPRLGONB&OCWRC=0;                           0442 00497000
         B     @DE00442                                            0442 00498000
@DL00442 DS    0H                                                  0443 00499000
*     IF OCWDRDTE->RPRTIED=COFF&    /* IF DEST RDTE UNTIED           */ 00500000
*         OCWDRDTE->RPRLIVE=CON     /* IF TERMINAL LIVE              */ 00501000
*       THEN                                                       0443 00502000
         L     @11,OCWDRDTE(,OCWPTR)                               0443 00503000
         TM    RPRLIVE(@11),B'00000001'                            0443 00504000
         BNO   @RF00443                                            0443 00505000
         TM    RPRTIED(@11),B'00100000'                            0443 00506000
         BNZ   @RF00443                                            0443 00507000
*       DO;                                                        0444 00508000
*         CALL CSINIT;              /* INITIALIZE CS PARM LIST       */ 00509000
         BAL   @14,CSINIT                                          0445 00510000
*         CALL ATCCSMR;             /* CALL CONNECT SERVICES         */ 00511000
         L     @11,OCWACVT(,OCWPTR)                                0446 00512000
         L     @15,ATCCSMR(,@11)                                   0446 00513000
         BALR  @14,@15                                             0446 00514000
*         DO;                                                      0447 00515000
*                                                                  0447 00516000
*/***  CRRMAINT  PROCNM(ISTOCCQU)COMP(OC)FUNC(RET)  **               */ 00517000
*                                                                  0448 00518000
*           DCL                                                    0448 00519000
*             CMZK0012 PTR(31) REG(1);                             0448 00520000
*           RFY                                                    0449 00521000
*            (CMZK0012) RSTD;                                      0449 00522000
*                                                                  0449 00523000
*           /*********************************************************/ 00524000
*           /*                                                       */ 00525000
*           /* ** CLEAR AND SET CURRENT PROCEDURE BIT                */ 00526000
*           /*                                                       */ 00527000
*           /*********************************************************/ 00528000
*                                                                  0450 00529000
*           CMZK0012->RPHCRR->CRACRR->OCCCRT='0'B;                 0450 00530000
         L     @11,RPHCRR(,CMZK0012)                               0450 00531000
         L     @11,CRACRR(,@11)                                    0450 00532000
         XC    OCCCRT+1(2,@11),OCCCRT+1(@11)                       0450 00533000
         MVI   OCCCRT(@11),B'00000000'                             0450 00534000
*           CMZK0012->RPHCRR->CRACRR->COCCQU='1'B;                 0451 00535000
         OI    COCCQU(@11),B'10000000'                             0451 00536000
*         END;                                                     0452 00537000
*         IF CSPCC=0|CSPCC=8        /* IF SIM LOG RET CODE OK        */ 00538000
*           THEN                                                   0453 00539000
         LH    @11,CSPCC+224(,OCWPTR)                              0453 00540000
         LTR   @11,@11                                             0453 00541000
         BZ    @RT00453                                            0453 00542000
         C     @11,@CF00059                                        0453 00543000
         BE    @RT00453                                            0453 00544000
*           ;                                                      0454 00545000
*         ELSE                                                     0455 00546000
*           IF CSPCC=12             /* NO UECB SPACE AVAIL   @XM02306*/ 00547000
*             THEN                                                 0455 00548000
         CLC   CSPCC+224(2,OCWPTR),@CH00032                        0455 00549000
         BNE   @RF00455                                            0455 00550000
*             DO;                                                  0456 00551000
*               OCWRC='14'X;        /* 'TEMPORARY' ERROR             */ 00552000
         MVI   OCWRC(OCWPTR),X'14'                                 0457 00553000
*               OCWEC='01'X;        /* STORAGE ALLOCATION FAILURE    */ 00554000
         MVI   OCWEC(OCWPTR),X'01'                                 0458 00555000
*             END;                                                 0459 00556000
*           ELSE                                                   0460 00557000
*             DO;                                                  0460 00558000
         B     @RC00455                                            0460 00559000
@RF00455 DS    0H                                                  0461 00560000
*               OCWRC='24'X;        /* SYSTEM ERROR                  */ 00561000
         MVI   OCWRC(OCWPTR),X'24'                                 0461 00562000
*               OCWEC='01'X;        /* UNEXP RC                      */ 00563000
         MVI   OCWEC(OCWPTR),X'01'                                 0462 00564000
*             END;                                                 0463 00565000
*       END;                                                       0464 00566000
*     ELSE                                                         0465 00567000
*       ;                                                          0465 00568000
@RF00443 DS    0H                                                  0466 00569000
*     OCWDRDTE=OCWDRDTE->RPRLGONF;  /* PTR TO NEXT DEST RDTE         */ 00570000
@RC00443 L     @11,OCWDRDTE(,OCWPTR)                               0466 00571000
         L     @11,RPRLGONF(,@11)                                  0466 00572000
         ST    @11,OCWDRDTE(,OCWPTR)                               0466 00573000
*   END;                                                           0467 00574000
@DE00442 L     @11,OCWARDTE(,OCWPTR)                               0467 00575000
         CLC   OCWDRDTE(4,OCWPTR),RPRLGONB(@11)                    0467 00576000
         BE    @DC00442                                            0467 00577000
         CLI   OCWRC(OCWPTR),0                                     0467 00578000
         BE    @DL00442                                            0467 00579000
@DC00442 DS    0H                                                  0468 00580000
*   C14SVPTR=C14SVPTR-4;            /* RESTORE REG 14                */ 00581000
         LA    @11,624                                             0468 00582000
         ALR   @11,OCWPTR                                          0468 00583000
         L     @05,C14SVPTR(,@11)                                  0468 00584000
         SL    @05,@CF00053                                        0468 00585000
         ST    @05,C14SVPTR(,@11)                                  0468 00586000
*   CR14PTR=C14SAVE;                                               0469 00587000
         L     CR14PTR,C14SAVE(,@05)                               0469 00588000
*   END DOLOGON;                                                   0470 00589000
@EL00005 DS    0H                                                  0470 00590000
@EF00005 DS    0H                                                  0470 00591000
@ER00005 BR    @14                                                 0470 00592000
*CSINIT:                                                           0471 00593000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0471 00594000
*                                                                  0471 00595000
CSINIT   DS    0H                                                  0472 00596000
*/********************************************************************/ 00597000
*/*  ROUTINE NAME: CSINIT                                            */ 00598000
*/*  FUNCTION:                                                       */ 00599000
*/*      CALLED BY DOLOGON TO INITIALIZE THE CONN SERV PARM LIST     */ 00600000
*/*      FOR A LOGON REQUEST.                                        */ 00601000
*/*  INPUT:                                                          */ 00602000
*/*      ISTCSP - CONNECTION SERVICE PARM LIST                       */ 00603000
*/*  OUTPUT:                                                         */ 00604000
*/*      SEE CODE                                                    */ 00605000
*/*  ROUTINES CALLED:                                                */ 00606000
*/*      NONE                                                        */ 00607000
*/*  MACROS USED:                                                    */ 00608000
*/*      NONE                                                        */ 00609000
*/********************************************************************/ 00610000
*                                                                  0472 00611000
*   C14SAVE=CR14PTR;                                               0472 00612000
         LA    @11,624                                             0472 00613000
         ALR   @11,OCWPTR                                          0472 00614000
         L     @05,C14SVPTR(,@11)                                  0472 00615000
         ST    CR14PTR,C14SAVE(,@05)                               0472 00616000
*   C14SVPTR=C14SVPTR+4;                                           0473 00617000
         LA    @09,4                                               0473 00618000
         ALR   @05,@09                                             0473 00619000
         ST    @05,C14SVPTR(,@11)                                  0473 00620000
*   ISTCSP(1:LENGTH(ISTCSP))=ISTCSP(1:LENGTH(ISTCSP))&&/* ZERO PARM     00621000
*                                      LIST                          */ 00622000
*       ISTCSP(1:LENGTH(ISTCSP));                                  0474 00623000
         LA    @08,224                                             0474 00624000
         ALR   @08,OCWPTR                                          0474 00625000
         XC    ISTCSP(40,@08),ISTCSP(@08)                          0474 00626000
*   ISTCSL(1:LENGTH(ISTCSL))=ISTCSL(1:LENGTH(ISTCSL))&&/* ZERO CSL   */ 00627000
*       ISTCSL(1:LENGTH(ISTCSL));   /*                       @D32CKQM*/ 00628000
         LA    @08,28                                              0475 00629000
         ALR   @08,OCWPTR                                          0475 00630000
         XC    ISTCSL(12,@08),ISTCSL(@08)                          0475 00631000
*   CSLRDTE=OCWDRDTE;               /* CSL -> TO DEST RDTE   @D32CKQM*/ 00632000
         L     @00,OCWDRDTE(,OCWPTR)                               0476 00633000
         ST    @00,CSLRDTE(,@08)                                   0476 00634000
*   CSPRSCE=ADDR(OCWCSL);           /* PTR TO CSL            @D32CKQM*/ 00635000
         LA    @08,224                                             0477 00636000
         ALR   @08,OCWPTR                                          0477 00637000
         LA    @00,OCWCSL(,OCWPTR)                                 0477 00638000
         ST    @00,CSPRSCE(,@08)                                   0477 00639000
*   CSPDEST=OCWARDTE;               /* DETS IS APPL                  */ 00640000
         L     @00,OCWARDTE(,OCWPTR)                               0478 00641000
         ST    @00,CSPDEST(,@08)                                   0478 00642000
*   RPHCSPA=ADDR(OCWCSPL);          /* @ PARM LIST IN RPH            */ 00643000
         LA    @00,OCWCSPL(,OCWPTR)                                0479 00644000
         ST    @00,RPHCSPA(,RPHPTR)                                0479 00645000
*   CSPIDX=CSPILGN;                 /* CALL TO CS LOGON TYPE @D32CKQM*/ 00646000
         STH   @09,CSPIDX(,@08)                                    0480 00647000
*   C14SVPTR=C14SVPTR-4;            /* RESTORE REG 14                */ 00648000
         SLR   @05,@09                                             0481 00649000
         ST    @05,C14SVPTR(,@11)                                  0481 00650000
*   CR14PTR=C14SAVE;                                               0482 00651000
         L     CR14PTR,C14SAVE(,@05)                               0482 00652000
*   END CSINIT;                                                    0483 00653000
@EL00006 DS    0H                                                  0483 00654000
@EF00006 DS    0H                                                  0483 00655000
@ER00006 BR    @14                                                 0483 00656000
*LOGSCHED:                                                         0484 00657000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0484 00658000
*                                                                  0484 00659000
LOGSCHED DS    0H                                                  0485 00660000
*/********************************************************************/ 00661000
*/*  ROUTINE NAME: LOGSCHED                                          */ 00662000
*/*  FUNCTION:                                                       */ 00663000
*/*      LOGSCHED IS CALLED BY LOGEXIT TO SCHED A UECB FOR A USER    */ 00664000
*/*      EXIT. LOGSCHED REQSTORES AND WAITS FOR THE UECB. IT THEN    */ 00665000
*/*      INITIALIZES THE UECB AND TPQUES IT TO THE UECPAB            */ 00666000
*/*  ROUTINES CALLED:                                                */ 00667000
*/*      NONE                                                        */ 00668000
*/*  MACROS USED:                                                    */ 00669000
*/*      REQSTORE - OBTAIN UECB                                      */ 00670000
*/*      TPWAIT - WAIT FOR STORAGE IF NECESSARY                      */ 00671000
*/*      TPQUE - SCHED USER EXIT                                     */ 00672000
*/********************************************************************/ 00673000
*                                                                  0485 00674000
*   C14SAVE=CR14PTR;                                               0485 00675000
         LA    @11,624                                             0485 00676000
         ALR   @11,OCWPTR                                          0485 00677000
         L     @05,C14SVPTR(,@11)                                  0485 00678000
         ST    CR14PTR,C14SAVE(,@05)                               0485 00679000
*   C14SVPTR=C14SVPTR+4;                                           0486 00680000
         AL    @05,@CF00053                                        0486 00681000
         ST    @05,C14SVPTR(,@11)                                  0486 00682000
*   RFY                                                            0487 00683000
*     UECBPTR RSTD;                                                0487 00684000
*   RFY                                                            0488 00685000
*     CRETCODE RSTD;                                               0488 00686000
*                                                                  0488 00687000
*/*  REQSTORE CBID(UECB)RPH(RPHPTR)CLEAR(YES)SAVE(YES)               */ 00688000
*                                                                  0489 00689000
*   DO;                                                            0489 00690000
*                                                                  0489 00691000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 00692000
*/* END OF ATBUILD                                                   */ 00693000
*                                                                  0490 00694000
*     RFY                                                          0490 00695000
*      (GPR02P,                                                    0490 00696000
*       GPR03P,                                                    0490 00697000
*       GPR04P,                                                    0490 00698000
*       GPR15P) RSTD;                                              0490 00699000
*     RFY                                                          0491 00700000
*      (GPR01P,                                                    0491 00701000
*       GPR13P) RSTD;                                              0491 00702000
*     GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);           0492 00703000
           STM GPR02P,GPR13P,RPHWORK(GPR01P)                            00704000
*     RFY                                                          0493 00705000
*      (GPR01P,                                                    0493 00706000
*       GPR13P) UNRSTD;                                            0493 00707000
*     DO;                           /* LISATCVT                    0494 00708000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00709000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 00710000
         L     GPR15P,ATCLCPTR                                     0495 00711000
*     END;                          /* LISATCVT                      */ 00712000
*     GPR02P=GPR15P->ATCBPDA|'80000000'X;                          0497 00713000
         L     GPR02P,ATCBPDA(,GPR15P)                             0497 00714000
         O     GPR02P,@CF01250                                     0497 00715000
*     DCL                                                          0498 00716000
*       1 FMZA0013 FIXED(31) STATIC LOCAL,                         0498 00717000
*        2 * FIXED(8) INIT(184),                                   0498 00718000
*        2 * PTR(24) INIT(0);                                      0498 00719000
*     GPR03F=FMZA0013;                                             0499 00720000
         L     GPR03F,FMZA0013                                     0499 00721000
*     GPR04F=17;                                                   0500 00722000
         LA    GPR04F,17                                           0500 00723000
*     GPR15P=GPR15P->ATCSMRQ;                                      0501 00724000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0501 00725000
*     DCL                                                          0502 00726000
*       FMZL0013 BASED(GPR15P) LABEL VALUERANGE(*);                0502 00727000
*     CALL FMZL0013;                                               0503 00728000
         BALR  @14,@15                                             0503 00729000
*     RFY                                                          0504 00730000
*      (GPR13P) RSTD;                                              0504 00731000
*     GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);           0505 00732000
           LM GPR02P,GPR13P,RPHWORK(GPR01P)                             00733000
*     RFY                                                          0506 00734000
*      (GPR13P) UNRSTD;                                            0506 00735000
*     RFY                                                          0507 00736000
*      (GPR02P,                                                    0507 00737000
*       GPR03P,                                                    0507 00738000
*       GPR04P,                                                    0507 00739000
*       GPR15P) UNRSTD;                                            0507 00740000
*   END;                            /* ******** END OF REQSTORE    0508 00741000
*                                      EXPANSION                     */ 00742000
*   IF CRETCODE=8 THEN                                             0509 00743000
         C     CRETCODE,@CF00059                                   0509 00744000
         BNE   @RF00509                                            0509 00745000
*     DO;                                                          0510 00746000
*                                                                  0510 00747000
*/*  TPWAIT (OCWPTR,ICEPTR,SVEAREA,CBASEREG)                         */ 00748000
*                                                                  0511 00749000
*       DO;                         /* BEGIN TPWAIT GENERATION       */ 00750000
*         RFY                                                      0512 00751000
*          (GPR01P,                                                0512 00752000
*           GPR14P,                                                0512 00753000
*           GPR15P) RSTD;                                          0512 00754000
*         RFY                                                      0513 00755000
*          (GPR00P) RSTD;                                          0513 00756000
*         GEN(STM   GPR00P,GPR15P,RPHWORK(GPR01P))                 0514 00757000
*         REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);                0514 00758000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            00759000
*         RFY                                                      0515 00760000
*          (GPR00P) UNRSTD;                                        0515 00761000
*         GPR15P=ADDR(LHAA0032);                                   0516 00762000
         LA    GPR15P,LHAA0032                                     0516 00763000
*         GPR14P=0;                                                0517 00764000
         SLR   GPR14P,GPR14P                                       0517 00765000
*         GPR15P=GPR15P&'00FFFFFF'X;                               0518 00766000
         N     GPR15P,@CF03231                                     0518 00767000
*         GPR15P=GPR15P|RPHWT1;                                    0519 00768000
         O     GPR15P,@CF01274                                     0519 00769000
*         CS(GPR14P,GPR15P,GPR01P->RPHRESMA);                      0520 00770000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         0520 00771000
*         BC(7,LHAB0032);                                          0521 00772000
*                                                                  0521 00773000
         BC    7,LHAB0032                                          0521 00774000
*/* TPEXIT  NONE                                                     */ 00775000
*                                                                  0522 00776000
*         DO;                                                      0522 00777000
*           RESPECIFY                                              0523 00778000
*             GPR15P RSTD;                                         0523 00779000
*                                                                  0523 00780000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */ 00781000
*/* END OF ATBUILD                                                   */ 00782000
*                                                                  0524 00783000
*           DO;                     /* LISATCVT                    0524 00784000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00785000
*             GPR15P=ATCLCPTR;      /* SET UP ATCVT POINTER          */ 00786000
         L     GPR15P,ATCLCPTR                                     0525 00787000
*           END;                    /* LISATCVT                      */ 00788000
*           RESPECIFY                                              0527 00789000
*             GPR00F RSTD;                                         0527 00790000
*           GPR00F=0;               /* SET PARAMETER REGISTER TO 0   */ 00791000
         SLR   GPR00F,GPR00F                                       0528 00792000
*           GPR15P=GPR15P->ATCAP31;                                0529 00793000
         L     GPR15P,ATCAP31(,GPR15P)                             0529 00794000
*           DCL                                                    0530 00795000
*             FMZL0037 BASED(GPR15P) LABEL VALUERANGE(*);          0530 00796000
*           CALL FMZL0037;                                         0531 00797000
         BALR  @14,@15                                             0531 00798000
*           RESPECIFY                                              0532 00799000
*            (GPR00F,                                              0532 00800000
*             GPR15P) UNRSTD;                                      0532 00801000
*         END;                      /* **** END OF TPEXIT            */ 00802000
*LHAB0032:                                                         0534 00803000
*         ;                                                        0534 00804000
LHAB0032 DS    0H                                                  0535 00805000
*         GPR01P->RPHRESMA=0;                                      0535 00806000
         SLR   @11,@11                                             0535 00807000
         ST    @11,RPHRESMA(,GPR01P)                               0535 00808000
*         RFY                                                      0536 00809000
*          (GPR00P) RSTD;                                          0536 00810000
*LHAA0032:                                                         0537 00811000
*         ;                                                        0537 00812000
LHAA0032 DS    0H                                                  0538 00813000
*         GEN(LM    GPR00P,GPR15P,RPHWORK(GPR01P))                 0538 00814000
*         REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);                0538 00815000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            00816000
*         RFY                                                      0539 00817000
*          (GPR00P,                                                0539 00818000
*           GPR01P,                                                0539 00819000
*           GPR14P,                                                0539 00820000
*           GPR15P) UNRSTD;                                        0539 00821000
*       END;                        /* ****END OF TPWAIT             */ 00822000
*       CRETCODE=0;                 /* INDIC BUFF OBT        @DM14044*/ 00823000
         SLR   CRETCODE,CRETCODE                                   0541 00824000
*     END;                                                         0542 00825000
*   ELSE                                                           0543 00826000
*     ;                                                            0543 00827000
@RF00509 DS    0H                                                  0544 00828000
*   IF CRETCODE<=4 THEN                                            0544 00829000
         C     CRETCODE,@CF00053                                   0544 00830000
         BH    @RF00544                                            0544 00831000
*     DO;                                                          0545 00832000
*       UECBPTR=RPHSRPRM;           /* SET PTR FOR UECB              */ 00833000
         L     UECBPTR,RPHSRPRM(,RPHPTR)                           0546 00834000
*       UECID=UEID;                 /* CON. BLK ID FOR UECB          */ 00835000
         MVI   UECID(UECBPTR),X'10'                                0547 00836000
*       UECLEN=LENGTH(ISTUECB);     /* PUT DEB TASK ID INTO UECB     */ 00837000
         MVI   UECLEN(UECBPTR),X'54'                               0548 00838000
*       UECTSKID=ACDTSKID;                                         0549 00839000
         L     @11,OCWACDEB(,OCWPTR)                               0549 00840000
         L     @09,ACDTSKID(,@11)                                  0549 00841000
         ST    @09,UECTSKID(,UECBPTR)                              0549 00842000
*       UECACB=ACDACB;              /* POINT TO ACB                  */ 00843000
         L     @11,ACDACB-1(,@11)                                  0550 00844000
         LA    @11,0(,@11)                                         0550 00845000
         ST    @11,UECACB(,UECBPTR)                                0550 00846000
*       UECSYMNM=ICEOBJ->RPRNAME;   /* SYMBOLIC NAME IN UECB         */ 00847000
         L     @11,ICEOBJ(,ICEPTR)                                 0551 00848000
         MVC   UECSYMNM(8,UECBPTR),RPRNAME(@11)                    0551 00849000
*       UECNDID=ADDR(UECSYMNM);     /* @ OF SYM NAME                 */ 00850000
         LA    @11,UECSYMNM(,UECBPTR)                              0552 00851000
         ST    @11,UECNDID(,UECBPTR)                               0552 00852000
*       UECDLEN=ICEDATA->DATALN;    /* LENGTH OF LOGON DATA          */ 00853000
         L     @11,ICEDATA(,ICEPTR)                                0553 00854000
         ICM   @11,12,DATALN(@11)                                  0553 00855000
         SRA   @11,16                                              0553 00856000
         ST    @11,UECDLEN(,UECBPTR)                               0553 00857000
*       UECREQTR=0;                 /* MAY PUT @ OF LOG ON DATA LATER*/ 00858000
         SLR   @11,@11                                             0554 00859000
         ST    @11,UECREQTR(,UECBPTR)                              0554 00860000
*       UECTYPE=UECLOGON;           /* EXIT TYPE = LOGON             */ 00861000
         MVI   UECTYPE(UECBPTR),X'06'                              0555 00862000
*       UECDVTPT=ATCUEP;            /* @ OF EXIT ROUTINE             */ 00863000
         L     @11,OCWACVT(,OCWPTR)                                0556 00864000
         L     @11,ATCUEP(,@11)                                    0556 00865000
         ST    @11,UECDVTPT(,UECBPTR)                              0556 00866000
*       PABDVTA=ADDR(UECDVTPT);     /* @ OF ABOVE                    */ 00867000
         LA    @11,16                                              0557 00868000
         ALR   @11,UECBPTR                                         0557 00869000
         LA    @09,UECDVTPT(,UECBPTR)                              0557 00870000
         STCM  @09,7,PABDVTA(@11)                                  0557 00871000
*       PABOFFST=ADDR(UECPAB)-UECBPTR;/* PUT OFFSET OF PAB INTO PAB  */ 00872000
         LA    @09,UECPAB(,UECBPTR)                                0558 00873000
         SLR   @09,UECBPTR                                         0558 00874000
         STC   @09,PABOFFST(,@11)                                  0558 00875000
*       PABAPYP=CON;                /* PAB TYPE IS USER              */ 00876000
         OI    PABAPYP(@11),B'10000000'                            0559 00877000
*/*  TPQUE (UECBPTR,UECPAB) NORM                                     */ 00878000
*                                                                  0560 00879000
*       DO;                                                        0560 00880000
*         RFY                                                      0561 00881000
*          (GPR00P,                                                0561 00882000
*           GPR01P,                                                0561 00883000
*           GPR04P,                                                0561 00884000
*           GPR05P,                                                0561 00885000
*           GPR15P) RSTD;                                          0561 00886000
*         GEN REFS(GPR01P) SETS(RPHWORK)                           0562 00887000
*             (STM GPR02P,GPR08P,RPHWORK(GPR01P));                 0562 00888000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00889000
*         GPR00P=0;                                                0563 00890000
         SLR   GPR00P,GPR00P                                       0563 00891000
*         GPR15P=ADDR(UECPAB);      /* HOLD PAB PTR                  */ 00892000
         LA    GPR15P,UECPAB(,UECBPTR)                             0564 00893000
*         GPR04P=UECBPTR;           /* WORK ELE PTR                  */ 00894000
         LR    GPR04P,UECBPTR                                      0565 00895000
*         GPR05P=GPR15P;            /* PASS PAB PTR                  */ 00896000
         LR    GPR05P,GPR15P                                       0566 00897000
*         CALL ATCLCPTR->ATCAP37->ISTAPC37;                        0567 00898000
         L     @11,ATCLCPTR                                        0567 00899000
         L     @15,ATCAP37(,@11)                                   0567 00900000
         BALR  @14,@15                                             0567 00901000
*         GEN(NOPR  0)                                             0568 00902000
*         NOSETS NOREFS;                                           0568 00903000
         NOPR  0                                                        00904000
*         RFY                                                      0569 00905000
*          (GPR00P,                                                0569 00906000
*           GPR01P,                                                0569 00907000
*           GPR04P,                                                0569 00908000
*           GPR05P,                                                0569 00909000
*           GPR15P) UNRSTD;                                        0569 00910000
*       END;                        /* *** END OF TPQUE GENERATION 0570 00911000
*                                      SCHEDULE PAB TO FIRE OFF EX RT*/ 00912000
*     END;                                                         0571 00913000
*   ELSE                                                           0572 00914000
*     DO;                                                          0572 00915000
         B     @RC00544                                            0572 00916000
@RF00544 DS    0H                                                  0573 00917000
*       OCWRC='24'X;                /* SYSTEM ERROR                  */ 00918000
         MVI   OCWRC(OCWPTR),X'24'                                 0573 00919000
*       OCWEC='01'X;                /* UNEXPECTED ERROR CODE         */ 00920000
         MVI   OCWEC(OCWPTR),X'01'                                 0574 00921000
*     END;                                                         0575 00922000
*   RFY                                                            0576 00923000
*     UECBPTR UNRSTD;                                              0576 00924000
@RC00544 DS    0H                                                  0577 00925000
*   RFY                                                            0577 00926000
*     CRETCODE UNRSTD;                                             0577 00927000
*   C14SVPTR=C14SVPTR-4;                                           0578 00928000
         LA    @15,624                                             0578 00929000
         ALR   @15,OCWPTR                                          0578 00930000
         L     @11,C14SVPTR(,@15)                                  0578 00931000
         SL    @11,@CF00053                                        0578 00932000
         ST    @11,C14SVPTR(,@15)                                  0578 00933000
*   CR14PTR=C14SAVE;                                               0579 00934000
         L     CR14PTR,C14SAVE(,@11)                               0579 00935000
*   END LOGSCHED;                                                  0580 00936000
@EL00007 DS    0H                                                  0580 00937000
@EF00007 DS    0H                                                  0580 00938000
@ER00007 BR    @14                                                 0580 00939000
*DOLOCK:                                                           0581 00940000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0581 00941000
*                                                                  0581 00942000
DOLOCK   DS    0H                                                  0582 00943000
*/********************************************************************/ 00944000
*/*  ROUTINE NAME: DOLOCK                                            */ 00945000
*/*  FUNCTION:                                                       */ 00946000
*/*      CALLED BY MAIN LINE TO OBTAIN THE VOC AND RDT LOCKS         */ 00947000
*/*  ROUTINES CALLED:                                                */ 00948000
*/*      NONE                                                        */ 00949000
*/*  MACROS USED:                                                    */ 00950000
*/*      TPLOCK - LOCK THE VOC AND RDT LOCKS                         */ 00951000
*/********************************************************************/ 00952000
*                                                                  0582 00953000
*   C14SAVE=CR14PTR;                                               0582 00954000
         LA    @15,624                                             0582 00955000
         ALR   @15,OCWPTR                                          0582 00956000
         L     @11,C14SVPTR(,@15)                                  0582 00957000
         ST    CR14PTR,C14SAVE(,@11)                               0582 00958000
*   C14SVPTR=C14SVPTR+4;                                           0583 00959000
*                                                                  0583 00960000
         AL    @11,@CF00053                                        0583 00961000
         ST    @11,C14SVPTR(,@15)                                  0583 00962000
*/*** START -TPLOCK (VOCLOCK)- **                                    */ 00963000
*                                                                  0584 00964000
*   DO;                                                            0584 00965000
*     RFY                                                          0585 00966000
*      (GPR00P,                                                    0585 00967000
*       GPR01P,                                                    0585 00968000
*       GPR02P,                                                    0585 00969000
*       GPR03P,                                                    0585 00970000
*       GPR04P,                                                    0585 00971000
*       GPR15P) RSTD;                                              0585 00972000
*     GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);   0586 00973000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              00974000
*     GPR15P=ATCAP35;               /* ADDRESS OF LOCK ROUTINE       */ 00975000
         L     @11,OCWACVT(,OCWPTR)                                0587 00976000
         L     GPR15P,ATCAP35(,@11)                                0587 00977000
*     GPR02P=ADDR(ATCVOCLK);        /* SET PARAM - LOCKWORD PTR      */ 00978000
         LA    GPR02P,ATCVOCLK(,@11)                               0588 00979000
*     GPR04P=GPR01P->RPHCRR;        /* SET PARAM - ISTCRA PTR        */ 00980000
         L     GPR04P,RPHCRR(,GPR01P)                              0589 00981000
*     GPR00P=CRALMS02;              /* SET PARAM - LOCK LEVEL FLAG   */ 00982000
         LA    GPR00P,2                                            0590 00983000
*     GPR03P=ADDR(GPR04P->CRAL2PTR);/* SET PARAM - LOCK LEVEL PTR    */ 00984000
         LA    GPR03P,CRAL2PTR(,GPR04P)                            0591 00985000
*     DCL                                                          0592 00986000
*       FMZL0053 BASED(GPR15P) LABEL VALUERANGE(*);                0592 00987000
*     CALL FMZL0053;                                               0593 00988000
         BALR  @14,@15                                             0593 00989000
*     GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P,GPR01P,   00990000
*         GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,GPR09P, 0594 00991000
*         GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);              0594 00992000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               00993000
*     RFY                                                          0595 00994000
*      (GPR00P,                                                    0595 00995000
*       GPR01P,                                                    0595 00996000
*       GPR02P,                                                    0595 00997000
*       GPR03P,                                                    0595 00998000
*       GPR04P,                                                    0595 00999000
*       GPR15P) UNRSTD;                                            0595 01000000
*   END;                                                           0596 01001000
*                                                                  0596 01002000
*/*** END -TPLOCK (VOCLOCK)- **                                      */ 01003000
*                                                                  0597 01004000
*                                   /* GET VOC LOCK            SHARED*/ 01005000
*   RFY                                                            0597 01006000
*     CRETCODE RSTD;                /*                       @XL03HHG*/ 01007000
*   IF CRETCODE=0                   /* LOCK OBTAINED                 */ 01008000
*     THEN                                                         0598 01009000
         LTR   CRETCODE,CRETCODE                                   0598 01010000
         BNZ   @RF00598                                            0598 01011000
*     DO;                                                          0599 01012000
*       OCWVLOCK=CON;               /* INDICATE LOCK OBTAINED        */ 01013000
         OI    OCWVLOCK(OCWPTR),B'10000000'                        0600 01014000
*/*** START -TPLOCK (RDTLOCK)TYPE(XCLSIVE)- **                       */ 01015000
*                                                                  0601 01016000
*       DO;                                                        0601 01017000
*         RFY                                                      0602 01018000
*          (GPR00P,                                                0602 01019000
*           GPR01P,                                                0602 01020000
*           GPR02P,                                                0602 01021000
*           GPR03P,                                                0602 01022000
*           GPR04P,                                                0602 01023000
*           GPR15P) RSTD;                                          0602 01024000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);    01025000
         STM GPR00P,GPR14P,RPHWORK(GPR01P)                              01026000
*         GPR15P=ATCAP36;           /* ADDRESS OF LOCK ROUTINE       */ 01027000
         L     @11,OCWACVT(,OCWPTR)                                0604 01028000
         L     GPR15P,ATCAP36(,@11)                                0604 01029000
*         GPR02P=ADDR(ATCRDTLK);    /* SET PARAM - LOCKWORD PTR      */ 01030000
         LA    GPR02P,ATCRDTLK(,@11)                               0605 01031000
*         GPR04P=GPR01P->RPHCRR;    /* SET PARAM - ISTCRA PTR        */ 01032000
         L     GPR04P,RPHCRR(,GPR01P)                              0606 01033000
*         GPR00P=CRALMS03;          /* SET PARAM - LOCK LEVEL FLAG   */ 01034000
         LA    GPR00P,4                                            0607 01035000
*         GPR03P=ADDR(GPR04P->CRAL3PTR);/* SET PARAM - LOCK LEVEL PTR*/ 01036000
         LA    GPR03P,CRAL3PTR(,GPR04P)                            0608 01037000
*         DCL                                                      0609 01038000
*           FMZL0058 BASED(GPR15P) LABEL VALUERANGE(*);            0609 01039000
*         CALL FMZL0058;                                           0610 01040000
         BALR  @14,@15                                             0610 01041000
*         GENERATE REFS(GPR00P,GPR01P,GPR14P,RPHWORK) SETS(GPR00P, 0611 01042000
*             GPR01P,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,  01043000
*             GPR09P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);   0611 01044000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               01045000
*         RFY                                                      0612 01046000
*          (GPR00P,                                                0612 01047000
*           GPR01P,                                                0612 01048000
*           GPR02P,                                                0612 01049000
*           GPR03P,                                                0612 01050000
*           GPR04P,                                                0612 01051000
*           GPR15P) UNRSTD;                                        0612 01052000
*       END;                                                       0613 01053000
*                                                                  0613 01054000
*/*** END -TPLOCK (RDTLOCK)TYPE(XCLSIVE)- **                         */ 01055000
*                                                                  0614 01056000
*                                   /* GET RDT LOCK EXECLUSIVE       */ 01057000
*       IF CRETCODE=0               /* LOCK GOTTEN                   */ 01058000
*         THEN                                                     0614 01059000
         LTR   CRETCODE,CRETCODE                                   0614 01060000
         BNZ   @RF00614                                            0614 01061000
*         OCWRLOCK=CON;             /* INDICATE LOCK GOTTEN          */ 01062000
         OI    OCWRLOCK(OCWPTR),B'01000000'                        0615 01063000
*       ELSE                                                       0616 01064000
*         DO;                                                      0616 01065000
         B     @RC00614                                            0616 01066000
@RF00614 DS    0H                                                  0617 01067000
*           OCWRC='24'X;            /* SYSTEM ERROR                  */ 01068000
         MVI   OCWRC(OCWPTR),X'24'                                 0617 01069000
*           OCWEC='06'X;            /* NO RDT LOCK                   */ 01070000
         MVI   OCWEC(OCWPTR),X'06'                                 0618 01071000
*         END;                                                     0619 01072000
*     END;                                                         0620 01073000
*   ELSE                                                           0621 01074000
*     DO;                                                          0621 01075000
         B     @RC00598                                            0621 01076000
@RF00598 DS    0H                                                  0622 01077000
*       OCWRC='24'X;                /* SYSTEM ERROR                  */ 01078000
         MVI   OCWRC(OCWPTR),X'24'                                 0622 01079000
*       OCWEC='05'X;                /* NO VOC LOCK                   */ 01080000
         MVI   OCWEC(OCWPTR),X'05'                                 0623 01081000
*     END;                                                         0624 01082000
*   RFY                                                            0625 01083000
*     CRETCODE UNRSTD;              /*                       @XL03HHG*/ 01084000
@RC00598 DS    0H                                                  0626 01085000
*   C14SVPTR=C14SVPTR-4;                                           0626 01086000
         LA    @15,624                                             0626 01087000
         ALR   @15,OCWPTR                                          0626 01088000
         L     @11,C14SVPTR(,@15)                                  0626 01089000
         SL    @11,@CF00053                                        0626 01090000
         ST    @11,C14SVPTR(,@15)                                  0626 01091000
*   CR14PTR=C14SAVE;                /* RESTORE R14 FOR RETURN        */ 01092000
         L     CR14PTR,C14SAVE(,@11)                               0627 01093000
*   END DOLOCK;                                                    0628 01094000
@EL00008 DS    0H                                                  0628 01095000
@EF00008 DS    0H                                                  0628 01096000
@ER00008 BR    @14                                                 0628 01097000
*DOUNLOCK:                                                         0629 01098000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0629 01099000
*                                                                  0629 01100000
DOUNLOCK DS    0H                                                  0630 01101000
*/********************************************************************/ 01102000
*/*  ROUTINE NAME: DOUNLOCK                                          */ 01103000
*/*  FUNCTION:                                                       */ 01104000
*/*      CALLED BY MAIN LINE TO RELE THE VOC AND/OR RDT LOCKS        */ 01105000
*/*  ROUTINES CALLED:                                                */ 01106000
*/*      NONE                                                        */ 01107000
*/*  MACROS USED:                                                    */ 01108000
*/*      TPUNLOCK - UNLOCK THE VOC AND/OR RDT LOCKS                  */ 01109000
*/********************************************************************/ 01110000
*                                                                  0630 01111000
*   C14SAVE=CR14PTR;                                               0630 01112000
         LA    @15,624                                             0630 01113000
         ALR   @15,OCWPTR                                          0630 01114000
         L     @11,C14SVPTR(,@15)                                  0630 01115000
         ST    CR14PTR,C14SAVE(,@11)                               0630 01116000
*   C14SVPTR=C14SVPTR+4;                                           0631 01117000
         AL    @11,@CF00053                                        0631 01118000
         ST    @11,C14SVPTR(,@15)                                  0631 01119000
*   IF OCWRLOCK=CON                 /* RDT LOCK HELD?                */ 01120000
*     THEN                                                         0632 01121000
         TM    OCWRLOCK(OCWPTR),B'01000000'                        0632 01122000
         BNO   @RF00632                                            0632 01123000
*     DO;                                                          0633 01124000
*                                                                  0633 01125000
*/*** START -TPUNLOCK (RDTLOCK)- **                                  */ 01126000
*                                                                  0634 01127000
*       DO;                                                        0634 01128000
*                                                                  0634 01129000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)                                   */ 01130000
*/* END OF ATBUILD                                                   */ 01131000
*                                                                  0635 01132000
*         RFY                                                      0635 01133000
*          (GPR00P,                                                0635 01134000
*           GPR01P,                                                0635 01135000
*           GPR02P,                                                0635 01136000
*           GPR03P,                                                0635 01137000
*           GPR04P,                                                0635 01138000
*           GPR15P) RSTD;                                          0635 01139000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);    01140000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              01141000
*         GPR02P=ADDR(ATCRDTLK);    /* SET PARAM - LOCKWORD PTR      */ 01142000
         L     GPR02P,OCWACVT(,OCWPTR)                             0637 01143000
         LA    GPR02P,ATCRDTLK(,GPR02P)                            0637 01144000
*         GPR04P=GPR01P->RPHCRR;    /* SET PARAM - ISTCRA PTR        */ 01145000
         L     GPR04P,RPHCRR(,GPR01P)                              0638 01146000
*         GPR00P=CRALMS03;          /* SET PARAM - LOCK LEVEL FLAG   */ 01147000
         LA    GPR00P,4                                            0639 01148000
*         GPR03P=ADDR(GPR04P->CRAL3PTR);/* SET PARAM - LOCK LEVEL PTR*/ 01149000
         LA    GPR03P,CRAL3PTR(,GPR04P)                            0640 01150000
*         DO;                       /* LISATCVT                    0641 01151000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01152000
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 01153000
         L     GPR15P,ATCLCPTR                                     0642 01154000
*         END;                      /* LISATCVT                      */ 01155000
*         GPR15P=GPR15P->ATCAP33;                                  0644 01156000
         L     GPR15P,ATCAP33(,GPR15P)                             0644 01157000
*         DCL                                                      0645 01158000
*           FMZL0063 BASED(GPR15P) LABEL VALUERANGE(*);            0645 01159000
*         CALL FMZL0063;                                           0646 01160000
         BALR  @14,@15                                             0646 01161000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P, 0647 01162000
*             GPR01P,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,  01163000
*             GPR09P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);   0647 01164000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               01165000
*         RFY                                                      0648 01166000
*          (GPR00P,                                                0648 01167000
*           GPR01P,                                                0648 01168000
*           GPR02P,                                                0648 01169000
*           GPR03P,                                                0648 01170000
*           GPR04P,                                                0648 01171000
*           GPR15P) UNRSTD;                                        0648 01172000
*       END;                                                       0649 01173000
*                                                                  0649 01174000
*/*** END -TPUNLOCK (RDTLOCK)- **                                    */ 01175000
*                                                                  0650 01176000
*                                   /* UNLOCK IT                     */ 01177000
*       OCWRLOCK=COFF;              /* INDICATE LOCK NOT HELD        */ 01178000
         NI    OCWRLOCK(OCWPTR),B'10111111'                        0650 01179000
*     END;                                                         0651 01180000
*   ELSE                                                           0652 01181000
*     ;                                                            0652 01182000
@RF00632 DS    0H                                                  0653 01183000
*   IF OCWVLOCK=CON                 /* VOC LOCK HELD?                */ 01184000
*     THEN                                                         0653 01185000
         TM    OCWVLOCK(OCWPTR),B'10000000'                        0653 01186000
         BNO   @RF00653                                            0653 01187000
*     DO;                                                          0654 01188000
*                                                                  0654 01189000
*/*** START -TPUNLOCK (VOCLOCK)- **                                  */ 01190000
*                                                                  0655 01191000
*       DO;                                                        0655 01192000
*                                                                  0655 01193000
*/* ATBUILD (ISTRPH,ISTLOK,ISTCRA)                                   */ 01194000
*/* END OF ATBUILD                                                   */ 01195000
*                                                                  0656 01196000
*         RFY                                                      0656 01197000
*          (GPR00P,                                                0656 01198000
*           GPR01P,                                                0656 01199000
*           GPR02P,                                                0656 01200000
*           GPR03P,                                                0656 01201000
*           GPR04P,                                                0656 01202000
*           GPR15P) RSTD;                                          0656 01203000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(RPHWORK);    01204000
         STM GPR00P,GPR15P,RPHWORK(GPR01P)                              01205000
*         GPR02P=ADDR(ATCVOCLK);    /* SET PARAM - LOCKWORD PTR      */ 01206000
         L     GPR02P,OCWACVT(,OCWPTR)                             0658 01207000
         LA    GPR02P,ATCVOCLK(,GPR02P)                            0658 01208000
*         GPR04P=GPR01P->RPHCRR;    /* SET PARAM - ISTCRA PTR        */ 01209000
         L     GPR04P,RPHCRR(,GPR01P)                              0659 01210000
*         GPR00P=CRALMS02;          /* SET PARAM - LOCK LEVEL FLAG   */ 01211000
         LA    GPR00P,2                                            0660 01212000
*         GPR03P=ADDR(GPR04P->CRAL2PTR);/* SET PARAM - LOCK LEVEL PTR*/ 01213000
         LA    GPR03P,CRAL2PTR(,GPR04P)                            0661 01214000
*         DO;                       /* LISATCVT                    0662 01215000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01216000
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 01217000
         L     GPR15P,ATCLCPTR                                     0663 01218000
*         END;                      /* LISATCVT                      */ 01219000
*         GPR15P=GPR15P->ATCAP33;                                  0665 01220000
         L     GPR15P,ATCAP33(,GPR15P)                             0665 01221000
*         DCL                                                      0666 01222000
*           FMZL0073 BASED(GPR15P) LABEL VALUERANGE(*);            0666 01223000
*         CALL FMZL0073;                                           0667 01224000
         BALR  @14,@15                                             0667 01225000
*         GENERATE REFS(GPR00P,GPR01P,GPR15P,RPHWORK) SETS(GPR00P, 0668 01226000
*             GPR01P,GPR02P,GPR03P,GPR04P,GPR05P,GPR06P,GPR07P,GPR08P,  01227000
*             GPR09P,GPR10P,GPR11P,GPR12P,GPR13P,GPR14P,GPR15P);   0668 01228000
         LM GPR00P,GPR15P,RPHWORK(GPR01P)                               01229000
*         RFY                                                      0669 01230000
*          (GPR00P,                                                0669 01231000
*           GPR01P,                                                0669 01232000
*           GPR02P,                                                0669 01233000
*           GPR03P,                                                0669 01234000
*           GPR04P,                                                0669 01235000
*           GPR15P) UNRSTD;                                        0669 01236000
*       END;                                                       0670 01237000
*                                                                  0670 01238000
*/*** END -TPUNLOCK (VOCLOCK)- **                                    */ 01239000
*                                                                  0671 01240000
*                                   /* RELEASE VOC LOCK              */ 01241000
*       OCWVLOCK=COFF;              /* INDICATE LOCK NOT HELD        */ 01242000
         NI    OCWVLOCK(OCWPTR),B'01111111'                        0671 01243000
*     END;                                                         0672 01244000
*   ELSE                                                           0673 01245000
*     ;                                                            0673 01246000
@RF00653 DS    0H                                                  0674 01247000
*   C14SVPTR=C14SVPTR-4;                                           0674 01248000
         LA    @15,624                                             0674 01249000
         ALR   @15,OCWPTR                                          0674 01250000
         L     @11,C14SVPTR(,@15)                                  0674 01251000
         SL    @11,@CF00053                                        0674 01252000
         ST    @11,C14SVPTR(,@15)                                  0674 01253000
*   CR14PTR=C14SAVE;                /* RESTORE R14 FOR RETURN        */ 01254000
         L     CR14PTR,C14SAVE(,@11)                               0675 01255000
*   END DOUNLOCK;                                                  0676 01256000
*                                                                  0676 01257000
@EL00009 DS    0H                                                  0676 01258000
@EF00009 DS    0H                                                  0676 01259000
@ER00009 BR    @14                                                 0676 01260000
@PB00009 DS    0H                                                  0677 01261000
*/* TPEPILOG                                                         */ 01262000
*                                                                  0677 01263000
*   GEN(PRINT OFF);                                                0677 01264000
         PRINT OFF                                                      01265000
*/* LOGICAL CHANNEL COMMAND WORD                                      * 01266000
*/* ADD A DECLARE                                      003 10/18/74   * 01267000
*DCL  1  ISTLCCW BDY(WORD) BASED,                                  0678 01268000
*        2  LCCWOP    CHAR(1),         /* OPERATION CODE -CONTROL     * 01269000
*           3  LCCWSI BIT(1),          /* SESS INIT / START DIALOG FLG* 01270000
*           3  LCCWSD BIT(1),          /* SESS DISCON/END DIALOG FLG  * 01271000
*           3  LCCWRWOP BIT(6),        /* READ/WRITE OPERATION CODE   * 01272000
*              4  * BIT(1),            /* RESERVED                    * 01273000
*              4  LCCWSOP BIT(1),      /* SPECIAL OPERATION LIKE   0678 01274000
*                                         ERASE OR READ CONT          * 01275000
*              4  LCCWCTL BIT(4),      /* CONTROL TYPE                * 01276000
*                 5  LCCWMODE BIT(2),  /* MODE TYPE                   * 01277000
*                 5  LCCWTYPE BIT(2),  /* OPERATION TYPE              * 01278000
*        2  LCCWFLAG  CHAR(1),         /* FLAG BYTE                   * 01279000
*           3  LCCWCD BIT(1),          /* CHAIN DATA                  * 01280000
*           3  LCCWCC BIT(1),          /* CHAIN COMMAND               * 01281000
*           3  LCCWCKPT BIT(1),        /* SUPPRESS 3705 CHECK POINT     01282000
*                                         RECORD                      * 01283000
*           3  LCCWNTVC BIT(1),        /* DO NOT PERFORM VALCHEK      * 01284000
*           3  LCCWIDAT BIT(1),        /* LCCWDATA CONTAINS DATA      * 01285000
*           3  LCCWLSI BIT(1),         /* LCCW SYNCH INDICATOR        * 01286000
*              4  LCCWPER BIT(1),      /* POST=RESP                   * 01287000
*           3  LCCWRFI BIT(1),         /* REQUEST FEEDBACK INDICATOR  * 01288000
*           3  LCCWACI BIT(1),         /* ADDITION COMMAND INDICATOR  * 01289000
*        2  LCCWCNT FIXED(16),         /* DATA COUNT                  * 01290000
*        2  LCCWDATA PTR(31);          /* DATA ADDRESS OR IMMED. DATA * 01291000
*/* LOGICAL COMMAND CODES */                                       0679 01292000
*DCL  LXDQ     BIT(8) CONSTANT('3B'X), /* RESET DEVICE QUEUE          * 01293000
*     LXEC     BIT(8) CONSTANT('4B'X), /* RESET AT END OF COMMAND     * 01294000
*     LXO      BIT(8) CONSTANT('5B'X), /* RESET ORDERLY               * 01295000
*     LCCWPRGE BIT(8) CONSTANT('6B'X), /* PURGE                       * 01296000
*     LWH      BIT(8) CONSTANT('0F'X), /* WRITE HEADER INDI. 1ST BLOCK* 01297000
*     LWRVI    BIT(8) CONSTANT('1F'X), /* WRITE RVI                   * 01298000
*     LWNA     BIT(8) CONSTANT('2F'X), /* WRITE NEGATIVE ACK          * 01299000
*     LWAA     BIT(8) CONSTANT('3F'X), /* WRITE ALTERNATE ACK         * 01300000
*     LWPLG    BIT(8) CONSTANT('5F'X), /* WRITE ACK LEADING GRAPHICS  * 01301000
*     LWNLG    BIT(8) CONSTANT('6F'X), /* WRITE NACK LEADING GRAPHICS * 01302000
*     LSMDE    BIT(8) CONSTANT('4F'X), /* SET MODE                    * 01303000
*     LIFBM    BIT(8) CONSTANT('7F'X), /* INDIC 1ST BLOCK OF MESSAGE  * 01304000
*     LTEST    BIT(8) CONSTANT('FE'X), /* TEST LCCW                   * 01305000
*     LPRMPT   BIT(8) CONSTANT('13'X), /* PREEMPT LCCW                * 01306000
*     LRSTR    BIT(8) CONSTANT('43'X), /* RESTORE LCCW                * 01307000
*     LEXEC    BIT(8) CONSTANT('FF'X), /* SPECIAL CONTROL OPERATION   * 01308000
*     LREAD    BIT(2) CONSTANT('10'B),  /* READ TYPE LCCW             * 01309000
*     LWRITE   BIT(2) CONSTANT('01'B),  /* WRITE TYPE LCCW            * 01310000
*     LCNTRL   BIT(2) CONSTANT('11'B),  /* CONTROL TYPE LCCW          * 01311000
*     LRESET   BIT(4) CONSTANT('1011'B),/* RESET COMMANDS             * 01312000
*     LTIC     BIT(8) CONSTANT('08'X),  /* LOGICAL TIC                * 01313000
*     LWR      BIT(6) CONSTANT('000001'B),  /* WRITE CONVERSATIONAL   * 01314000
*     LWB      BIT(6) CONSTANT('000101'B),  /* WRITE BLOCK            * 01315000
*     LWM      BIT(6) CONSTANT('001001'B),  /* WRITE MESSAGE          * 01316000
*     LWT      BIT(6) CONSTANT('001101'B),  /* WRITE TRANSMISSION     * 01317000
*     LEWM     BIT(6) CONSTANT('011001'B),  /* ERASE/WRITE MESSAGE    * 01318000
*     LEWT     BIT(6) CONSTANT('011101'B),  /* ERASE/WRITE TRNSMSSN   * 01319000
*     LEAU     BIT(6) CONSTANT('010001'B),  /* ERASE ALL UNPROTECTED  * 01320000
*     LRB      BIT(6) CONSTANT('000110'B),  /* READ BLOCK             * 01321000
*     LRM      BIT(6) CONSTANT('001010'B),  /* READ MESSAGE           * 01322000
*     LRT      BIT(6) CONSTANT('001110'B),  /* READ TRANSMISSION      * 01323000
*     LRMOD    BIT(6) CONSTANT('010010'B),  /* READ MODIFIED          * 01324000
*     LRBUF    BIT(6) CONSTANT('010110'B),  /* READ BUFFER            * 01325000
*     LRCONT   BIT(6) CONSTANT('011010'B),  /* READ CONTINUOUS        * 01326000
*     LRPEP    BIT(6) CONSTANT('011110'B),  /* READ PERPETUAL         * 01327000
*     LCPYM    BIT(6) CONSTANT('101001'B),  /* COPY MESSAGE           * 01328000
*     LCPYT    BIT(6) CONSTANT('101101'B),  /* COPY TRANSMISSION      * 01329000
*     LD       BIT(8) CONSTANT('23'X),  /* DISCONNECT                 * 01330000
*     LDEC     BIT(8) CONSTANT('33'X),  /* DISCONNECT WITH END OF CALL* 01331000
*     LEOC     BIT(8) CONSTANT('53'X),  /* END OF CALL COMMAND        * 01332000
*     LXEL     BIT(8) CONSTANT('0B'X),  /* RESET ERROR LOCK           * 01333000
*     LXC      BIT(8) CONSTANT('1B'X),  /* RESET CONDITIONAL          * 01334000
*     LXI      BIT(8) CONSTANT('2B'X),  /* RESET IMMEDIATE            * 01335000
*     LC       BIT(8) CONSTANT('03'X),  /* CONTACT                    * 01336000
*     LWPA     BIT(8) CONSTANT('FD'X); /* WRITE POSITIVE ACK          * 01337000
*DCL  LMT      BIT(2) CONSTANT('11'B), /* TRANSMISSION MODE           * 01338000
*     LMS      BIT(2) CONSTANT('00'B), /* SPECIAL MODE LIKE CONV, EAU * 01339000
*     LMB      BIT(2) CONSTANT('01'B), /* BLOCK MODE                  * 01340000
*     LMM      BIT(2) CONSTANT('10'B); /* MSG OR CONTINUOUS MODE      * 01341000
*/* FOLLOWING EQUATES FOR  - PORT SOLICITOR (DIAL)                    * 01342000
*/* PORT SOLICITOR COMMAND CODES                                      * 01343000
*DCL PSOL    BIT(8) CONSTANT('FE'X), /* SPECIAL PORT SOLICITOR     0681 01344000
*                                       COMMAND                       * 01345000
*    STCTL    BIT(8) CONSTANT('01'X), /* START CONTROL                * 01346000
*    RESTCTL  BIT(8) CONSTANT('02'X), /* RESET & CONTROL - REDRIVE    * 01347000
*    STIPUT   BIT(8) CONSTANT('03'X); /* START INPUT                  * 01348000
*/*   FOLLOWING EQUATES FOR SDLC SUPPORT                              * 01349000
*DCL  LCCHOLD  BIT(8) CONSTANT('01'X),  /* HOLD                       * 01350000
*     LCCRHOLD BIT(8) CONSTANT('02'X),  /* RELEASE HOLD               * 01351000
*     LSEND    BIT(8) CONSTANT ('F1'X), /* SEND                       * 01352000
*     LCLEAR   BIT(8) CONSTANT ('F2'X), /* CLEAR                      * 01353000
*     LCRUD    BIT(8) CONSTANT ('F3'X), /* CLEAR, UNBIND              * 01354000
*     LCRUDNFY BIT(8) CONSTANT ('F4'X), /* CLEAR, UNBIND, NOTIFY      * 01355000
*     LNFY     BIT(8) CONSTANT ('F5'X), /* NOTIFY                     * 01356000
*     LRELCB   BIT(8) CONSTANT ('F6'X), /* RELEASE CB                 * 01357000
*     LRESTSR  BIT(8) CONSTANT ('F7'X), /* RESETSR                    * 01358000
*     LCLRNFY  BIT(8) CONSTANT('F8'X),  /* CLEAR/NOTIFY               * 01359000
*     LCHPUR   BIT(8) CONSTANT('F9'X);  /* PURGE                      * 01360000
*DCL  LCCWSIZE FIXED(8) CONSTANT(8);    /* LCCW SIZE                  * 01361000
*DCL  LRDS     BIT(8) CONSTANT('FF'X);  /* RECORD DEV STATS COMMAND   * 01362000
*DCL  LQUIS    BIT(8) CONSTANT('FE'X);  /* QUIESCE COMMAND            * 01363000
*/*              LOGICAL CHANNEL PROGRAM BLOCK                       */ 01364000
*/*                                                                  */ 01365000
*/*  REVISIONS                                         006 03/24/75  */ 01366000
*/*                                                                  */ 01367000
*DCL  1  ISTLCPB BDY(WORD) BASED(LCPBPTR),                         0686 01368000
*        2 LCPTYPE CHAR(1),            /* TYPE CODE                  */ 01369000
*        2 LCPLNGTH  PTR(8),           /* LENGTH IN BYTES            */ 01370000
*        2 LCPREQTG CHAR(2),           /* LCPB REQ. TAG FIELD        */ 01371000
*          3 LCPFLAGS BIT(8),          /* FLAG BYTE                  */ 01372000
*            4 LCPZRT00 BIT(1),        /* LOGICAL ERROR FLAG         */ 01373000
*            4 LCPZRT01 BIT(1),        /* CONTROL BLOCK ERROR        */ 01374000
*            4 LCPZF001 BIT(1),        /* LCP START PROCESS FLAG     */ 01375000
*              5 LCPZRT02 BIT(1),      /* I/O INITIATION DISABLED    */ 01376000
*                6 LCPZRTL2 BIT(1),    /* END OF SCHEDULABLE BLOCK   */ 01377000
*            4 LCPZF002 BIT(1),        /* LCP IN PROCESSING FLAG     */ 01378000
*              5 LCPZRT03 BIT(1),      /* GO LOOK AT FMCB LINE STATE */ 01379000
*                                      /* FIELD (REQ. TAG OVERLAY)   */ 01380000
*                6 LCPZRTL3 BIT(1),    /* WRITE/READ REQUEST         */ 01381000
*            4 LCPZF003 BIT(1),        /* LCP PROCESSING COMPLETE FLAG* 01382000
*              5 LCPZRT04 BIT(1),      /* STPR SET IN BDU FLAG       */ 01383000
*                                      /* (REQ. TAG OVERLAY)         */ 01384000
*                6 LCPZRTL4 BIT(1),    /* FEEDBACK REQUESTED         */ 01385000
*            4 LCPZF004 BIT(1),        /* SINGLE LCCW/LCP FLAG       */ 01386000
*              5 LCPZRT05 BIT(1),      /* FEEDBACK TO BE ROUTED TO   */ 01387000
*                                      /* ICNCB FMCB (REQ. TAG       */ 01388000
*                                      /* OVERLAY)                   */ 01389000
*                6 LCPZRTL5 BIT(1),    /* DECREMENT SCHED COUNT ON DEQ* 01390000
*            4 LCPZRT06 BIT(1),        /* CRITICAL TEXT BLOCK        */ 01391000
*                                      /* FLAG (REQ. TAG OVERLAY)    */ 01392000
*              5 LCPZRTL6 BIT(1),      /* WRITE REQUEST              */ 01393000
*            4 LCPZRT07 BIT(1),        /* BUFFER TRACE ACTIVE        */ 01394000
*                                      /* FLAG (REQ. TAG OVERLAY)    */ 01395000
*              5 LCPZRTL7 BIT(1),      /* SCHEDULING FLAG            */ 01396000
*          3 LCPMNRCD CHAR(1),         /* LCP MINOR REJECTION CODE   */ 01397000
*            4 LCPZRT08 BIT(1),        /* I/O TRACE ACTIVE FLAG      */ 01398000
*                                      /* (REQ. TAG OVERLAY)         */ 01399000
*              5 LCPZRTL8 BIT(1),      /* DEVICE END NOTIFICATION    */ 01400000
*            4 LCPZRT09 BIT(1),        /* DIALOGUE SCHED DISABLED    */ 01401000
*              5 LCPZRTL9 BIT(1),      /* CRITICAL TEXT FLAG         */ 01402000
*            4 LCPZRT0A BIT(1),        /* SIMULATED CONTACT FLAG     */ 01403000
*            4 LCPZRT0B BIT(1),        /* SIMULATED DISCONNECT FLAG  */ 01404000
*        2 LCPCHAIN PTR(31),           /* APS CHAIN                  */ 01405000
*          3 LCPCHAI1 PTR(8),                                      0686 01406000
*            4 LCPCHNG BIT(1),         /* GATE BIT                   */ 01407000
*          3 LCPCHAI2 PTR(24),         /* ADDRESS FIELD              */ 01408000
*        2 LCPRUCNT PTR(8),            /* NUMBER OF RU FOR THIS LCPB */ 01409000
*          3 LCPZMIRC CHAR(1),         /* MINOR RETURN CODE          */ 01410000
*        2 LCPFLAG2 CHAR(1),           /* SECOND FLAG BYTE           */ 01411000
*          3 LCPPRFLG BIT(1),          /* PACING REQUIRED            */ 01412000
*          3 LCPASYN  BIT(1),          /* ASYNCHRONOUS LCPB          */ 01413000
*          3 LCPRSTRT BIT(1),          /* RESTART LCPB               */ 01414000
*          3 LCPTLBPI BIT(1),          /* TPIOS BLOCK LCCW           */ 01415000
*            4 LCPZRIMM BIT(1),        /* RESET IMMED REQUIRED ON ERR*/ 01416000
*          3 LCPFID0  BIT(1),          /* FID0 TH INDICATOR FOR RECORD* 01417000
*            4 LCPEXRES BIT(1),        /* EXCEP. RESPONSE SPEC. 3270R*/ 01418000
*          3 LCPDSTAT BIT(1),          /* DIALOGUE STATE BIT, 3270R  */ 01419000
*                                      /* 0=REQ. REJECT,1=STATE ERROR*/ 01420000
*          3 LCPFREE  BIT(1),          /* DEALLOCATE LCPB 3270R      */ 01421000
*          3 LCPATOP  BIT(1),          /* ATOP LCPB  3270R           */ 01422000
*        2 LCPSEQ   FIXED(16),         /* OUTBOUND SEQUENCE NUMBER   */ 01423000
*          3 LCPRRCCT PTR(8),          /* COUNT OF RESPONSES RECEIVED*/ 01424000
*          3 LCPRRCNT PTR(8),          /* COUNT OF RESPONSES REQUESTED* 01425000
*        2 LCPLCCW1 PTR(31),           /* ADDR FIRST LCCW FOR FID1   */ 01426000
*        2 LCPCID CHAR(4) BDY(WORD),   /* COMMUNICATION ID           */ 01427000
*          3 LCPSAF BIT(16),           /* SOURCE IDENTIFICATION      */ 01428000
*          3 LCPDAF BIT(16),           /* DESTINATION IDENTIFICATION */ 01429000
*        2 LCPNXLCW PTR(31),           /* ADDR NEXT LCCW             */ 01430000
*        2 LCPFDBA PTR(31),            /* BTU ADDRESS                */ 01431000
*          3 LCPFDB1 PTR(8),                                       0686 01432000
*          3 LCPFDB2 PTR(24),          /* ADDRESS FIELD              */ 01433000
*        2 LCPTLBAD PTR(31),           /* ADDRESS OF TLB             */ 01434000
*        2 LCPFOSN  BIT(16),           /* SEQUENCE NUMBER FIRST RU   */ 01435000
*        2 LCPFSNCH FIXED(15),         /* 1ST SEQ NUMBER IN RU CHAIN */ 01436000
*        2 LCPSTYPE FIXED(8),          /* LCPB SUB-TYPE X'FF' = RESET,* 01437000
*                                      /* X'00' = NON-RESET          */ 01438000
*        2 LCPFLG1 CHAR(1),            /* FLAGS                      */ 01439000
*          3 LCPRESET BIT(1),          /* A TPQUE WITH RESET QUEUED  */ 01440000
*                                      /* THIS ELEMENT               */ 01441000
*          3 LCPINTER BIT(1),          /* INTERNAL LCPB              */ 01442000
*          3 LCPDIRPT BIT(1),          /* NOT SEND W/POST=SCHED=0    */ 01443000
*          3 LCPREDRV BIT(1),          /* LCPB IS FOR REDRIVE        */ 01444000
*          3 LCPSTLB  BIT(1),          /* TLB NOT TO BE FREED        */ 01445000
*          3 LCPTRANS BIT(1),          /* DATA INCLUDES CONTROL CHARS*/ 01446000
*          3 LCPRSV78 BIT(2),          /* RESERVED                   */ 01447000
*        2 LCPLCCWC BIT(8),            /* COUNT OF LCCWS             */ 01448000
*        2 LCPRSV77 CHAR(1),           /* RESERVED                   */ 01449000
*        2 LCPFLCCW PTR(31),           /* ADDR OF FIRST LCCW         */ 01450000
*          3 LCPUBFSB PTR(31),         /* UNBIND FSB ADDRESS         */ 01451000
*        2 LCPCLREP PTR(31),           /* PTR TO CLEAR LCPB IN UCB   */ 01452000
*/*  NOTE:  THE FOLLOWING FIELD - LCPLCCW MUST BE THE LAST FIELD     */ 01453000
*/*         IN THIS CONTROL BLOCK.  THE CONTROL BLOCK ISTDCLCP HAS   */ 01454000
*/*         FIELDS IN IT WHICH MUST BE CONTIGUOUS WITH LCPLCCW       */ 01455000
*        2 LCPLCCW  CHAR(LENGTH(ISTLCCW)) BDY(WORD), /* FIRST LCCW   */ 01456000
*          3 LCPRSTQH PTR(31),         /* RESET LCPB QUEUE HEADER    */ 01457000
*          3 LCPPABA  PTR(31),         /* PAB POINTER                */ 01458000
*            4 LCPRPHA  PTR(31),       /* RPH POINTER                */ 01459000
*              5 LCPFTYPE BIT(1);      /* FEEDBACK TYPE              */ 01460000
*/*     CONSTANTS FOR LCPTYPE                                         * 01461000
*DCL  LCRPHFT  BIT(1) CONSTANT('1'B);                              0687 01462000
*DCL  LCPABFT  BIT(1) CONSTANT('0'B);                              0688 01463000
*DCL LCPBFIRM BIT(8) CONSTANT('10'X);  /* LU FAILED, CLSDST, SCHED LOST 01464000
*                                         TERM, OPNDST MAY BE TRIED   * 01465000
*DCL LCPBTERM BIT(8) CONSTANT('11'X);  /* TERM RECEIVED,CLSDST,    0690 01466000
*                                         SCHED LOST TERM             * 01467000
*/*                                                                   * 01468000
*                                                                  0691 01469000
*DCL 1 LCPZTIE BDY(WORD) DEFINED(LCPCID), /* TOLTEP INTERFACE      0691 01470000
*                                         ELEMENT OVERLAY            */ 01471000
*       2  LCPZFMCA PTR(31),           /* ACTIVE FMCB ADDRESS        */ 01472000
*       2  LCPZSNA PTR(31),            /* SYMBOLIC NAME ADDRESS      */ 01473000
*       2  LCPZSNAM CHAR(8) BDY(WORD), /* SYMBOLIC NAME              */ 01474000
*          3  LCPZTRV1 PTR(31),        /* RESERVED FOR RESTORE LCP   */ 01475000
*          3  LCPZTRV4 PTR(31);        /* RESERVED FOR RESTORE LCP   */ 01476000
*DCL LCTYPE BIT(8) CONSTANT('04'X);                                0692 01477000
*DCL PLCPTYPE BIT(8) CONSTANT('28'X);  /* PURGE LCPB TYPE ID         */ 01478000
*DCL LCPCLACB BIT(8) CONSTANT('04'X);  /* LCPB FROM CLOSE ACB        */ 01479000
*DCL LSRSTYPE BIT(8) CONSTANT('FF'X);  /* RESET SUBTYPE              */ 01480000
*DCL LCPETYPE BIT(8) CONSTANT('40'X);  /* EXTENDED LCPB TYPE ID      */ 01481000
*/*                                                                  */ 01482000
*/*  MINOR RETURN CODES                                              */ 01483000
*/*                                                                  */ 01484000
*DCL LCMCRSTR BIT(8) CONSTANT('F7'X),  /* MINOR RC FOR RESETSR       */ 01485000
*    LCPMNEW  BIT(8) CONSTANT('02'X),  /* EARLY WARNING,             */ 01486000
*                                      /* RECOVERY IN PROGRESS       */ 01487000
*    LCPMNPF  BIT(8) CONSTANT('03'X),  /* PERM. I/O FAILURE          */ 01488000
*    LCPMNAS  BIT(8) CONSTANT('04'X),  /* AUTO NETWORK SHUTDOWN      */ 01489000
*    LCPMNCL  BIT(8) CONSTANT('06'X),  /* CLOSE/CLSDST OCCURED       */ 01490000
*    LCPMNVD  BIT(8) CONSTANT('07'X),  /* VARY DEACTIVATE            */ 01491000
*    LCPMNTF  BIT(8) CONSTANT('10'X),  /* TEMP RECORD DEVICE FAILURE */ 01492000
*    LCPMNSF  BIT(8) CONSTANT('01'X),  /* TEMP BASIC FAILURE /       */ 01493000
*    LCPMNTS  BIT(8) CONSTANT('11'X),  /* TERMINATE SELF             */ 01494000
*    LCPMNAP  BIT(8) CONSTANT('0A'X),  /* APPL. ISSUED CLEAR         */ 01495000
*    LCPMNPR  BIT(8) CONSTANT('0B'X),  /* PREEMPT                    */ 01496000
*    LCPMNRE  BIT(8) CONSTANT('0C'X);  /* RESTORE                    */ 01497000
*/* VS1, VS2 TPIOS SAVEAREA FORMAT */                              0698 01498000
*DCL  1  ISTZSAVE BDY(WORD) BASED,                                 0698 01499000
*        2   ZSAZSVBC PTR(31),         /* SAVEAREA BACK CHAIN        */ 01500000
*            3   ZSAZSVMS CHAR(1),     /* MODULE TRACE CODE          */ 01501000
*                4 ZSAZACTV BIT(1),    /* ACTIVE SAVE AREA FLAG      */ 01502000
*        2   ZSAZSVFC PTR(31),         /* SAVEAREA FORWARD CHAIN     */ 01503000
*        2   ZSAZSVRR PTR(31),         /* RETURN REGISTER            */ 01504000
*        2   ZSAZSVVR (6) PTR(31),    /* VARIABLE REGS (7-12) SVEAREA*/ 01505000
*        2   ZSAZTRAC CHAR(4);        /* EBCDIC NAME OF OWNER        */ 01506000
*/*                                                                0699 01507000
*THE FOLLOWING EQUATES SHOULD READ ''FIXED(8) CONSTANT(LENGTH(X))'',    01508000
*WHERE X IS THE NAME OF THE VARIABLE CONTROL BLOCK OR FIELD OF WHICH    01509000
*LENGTH IS THE VALUE BEING EQUATED, SHOULD THE PLS COMPILER BE     0699 01510000
*BE ABLE TO TAKE IT.                                               0699 01511000
*                                                                    */ 01512000
*DCL ZSAZSVVA FIXED(8) CONSTANT(8);  /* DISPLACEMENT TO VARIABLE REGS*/ 01513000
*DCL ZSAZSVSZ FIXED(8) CONSTANT(40); /* LENGTH OF ISTZSAVE           */ 01514000
*/* PREFIX FOR CRR                                                   */ 01515000
*/*                                                                  */ 01516000
*/* RELEASE 1 - JUNE 28, 1973                                        */ 01517000
*/*                                                                  */ 01518000
*DCL 1 ISTPFCRR BASED BDY(WORD),        /* PREFIX FOR CRR            */ 01519000
*     2  PFCCRR   CHAR(4),              /* CRR HEADER                */ 01520000
*        3  PFCCRRID CHAR(1),           /* CRR ID FIELD              */ 01521000
*           4  CRRID CHAR(1),           /* BASIC CTL LAYER DEFINITION*/ 01522000
*        3  PFCRSV10 CHAR(1),           /* RESERVED FOR ALIGNMENT    */ 01523000
*        3  PFCCRRLN CHAR(2),           /* CRR LENGTH                */ 01524000
*           4  CRRLEN CHAR(2),          /* BASIC CTL LAYER DEF       */ 01525000
*     2  PFCHDR CHAR(8) BDY(WORD),      /* SAVE AREA FOR OLD CRR FRR */ 01526000
*        3  PFCCRRO  PTR(31),           /* PTR TO OLD CRR            */ 01527000
*           4  CRRCHAIN PTR(31),        /* BASIC CTL LAYER DEFINITION   01528000
*                                          FOR OLD CRR PTR           */ 01529000
*        3  PFCFRRO  PTR(31),           /* PTR TO OLD FRR            */ 01530000
*           4  CRRFRR   PTR(31),        /* BASIC CTL LAYER         0701 01531000
*                                          DEFINITION OF OLD FRR PTR */ 01532000
*     2  PFCFTA BIT(8),                 /* ID OF LAST FUNCTION TRACED*/ 01533000
*     2  PFCRSV01 CHAR(3);              /* ALIGNMENT                 */ 01534000
*DCL PFIDPIE BIT(8) CONSTANT('80'X);    /* DOS/VS TPIOS              */ 01535000
*DCL PFIDORE BIT(8) CONSTANT('81'X);    /* DOS/VS BMS                */ 01536000
*DCL PFIDAPE BIT(8) CONSTANT('82'X);    /* DOS/VS PSS                */ 01537000
*DCL PFCIDPSV BIT(8) CONSTANT('38'X); /* COMPONENT ID              0705 01538000
*                                          PSS - VS1 AND 2           */ 01539000
*DCL PFCIDTPV BIT(8) CONSTANT('3C'X); /* COMPONENT ID              0706 01540000
*                                          TPIOS VS1 AND 2           */ 01541000
*DCL PFCIDSME BIT(8) CONSTANT('3D'X); /* COMPONENT ID              0707 01542000
*                                          STORAGE MANAGEMENT DOS    */ 01543000
*DCL PFCIDOC BIT(8) CONSTANT('31'X);    /* COMPONENT ID OPEN/CLOSE   */ 01544000
*DCL PFCIDPS BIT(8) CONSTANT('32'X);    /* PORT SOLICITOR            */ 01545000
*DCL PFCIDCS BIT(8) CONSTANT('34'X);    /* CLUSTER SOLICITOR         */ 01546000
*DCL PFCIDIT BIT(8) CONSTANT('35'X);    /* INIT/TERM                 */ 01547000
*DCL PFCIDVY BIT(8) CONSTANT('36'X);    /* VARY                      */ 01548000
*DCL PFCIDNS  BIT(8) CONSTANT('37'X);   /* NET. STAT.SRV.            */ 01549000
*DCL PFCIDTPE BIT(8) CONSTANT('38'X);   /* COMPONENT ID            0714 01550000
*                                          TPIOS - DOS               */ 01551000
*DCL PFCIDCL BIT(8) CONSTANT('39'X);    /* COMPONENT ID            0715 01552000
*                                          CONTROL LAYER             */ 01553000
*DCL PFCIDPSE BIT(8) CONSTANT('3A'X);   /* COMPONENT ID            0716 01554000
*                                          PSS - DOS                 */ 01555000
*DCL PFCIDSMV BIT(8) CONSTANT('3F'X);   /* COMPONENT ID            0717 01556000
*                                          STORAGE MANAGEMENT        */ 01557000
*DCL PFCIDTIO BIT(8) CONSTANT('40'X);   /* COMPONENT ID TIIO       0718 01558000
*                                          PROCESSING (VS2)          */ 01559000
*DCL PFCIDRS  BIT(8) CONSTANT('41'X);   /* ID FOR REMOTE SOLICITOR   */ 01560000
*/* CRR FOR COMMAND FACILITIES                                      */  01561000
*DCL  1  ISTCFCRR BDY(WORD) BASED, /* CRR FOR COMMAND FACILITIES    */  01562000
*        2 CFCAUDIT,               /* AUDIT TRAIL FOR CMD FACILITIES*/  01563000
*          3 CFCNTRD  CHAR(1),     /* LIST OF MODULES IN COMMAND    */  01564000
*                                  /* FACILITIES ENTERED            */  01565000
*            4 NCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 ENTERED   */  01566000
*            4 NCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 ENTERED   */  01567000
*            4 NCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 ENTERED   */  01568000
*            4 NCFCRP   BIT(1),    /* IND MODULE ISTCFCRP ENTERED   */  01569000
*            4 NCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 ENTERED   */  01570000
*            4 NCFRSVD  BIT(3),    /* RESERVED                      */  01571000
*          3 CFCCRT   CHAR(1),     /* LIST OF MODULES IN COMMAND    */  01572000
*                                  /* FACILITIES RUNNING            */  01573000
*            4 CCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 RUNNING   */  01574000
*            4 CCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 RUNNING   */  01575000
*            4 CCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 RUNNING   */  01576000
*            4 CCFCRP   BIT(1),    /* IND MODULE ISTCFCRP RUNNING   */  01577000
*            4 CCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 RUNNING   */  01578000
*            4 CCFRSVD1 BIT(3);    /* RESERVED                      */  01579000
*/* COMPONENT RECOVERY RECORD FOR TPIOS */                         0721 01580000
*/*  DELTA                                             006 02/10/75  */ 01581000
*DCL                                                               0721 01582000
*1  ISTZCRR BDY(WORD) BASED,     /* CONTROL WORD                     */ 01583000
*   2  ZCRCRR CHAR(4),           /* CONTROL WORD                     */ 01584000
*      3  ZCRID CHAR(1),         /* CONTROL BLOCK ID                 */ 01585000
*      3  ZCRLEN CHAR(2),        /* LENGTH OF ZCR                    */ 01586000
*      3  ZCRFLAG CHAR(1),       /* FLAGS                            */ 01587000
*   2  ZCRCHAIN PTR(31),         /* POINTER TO PREVIOUS ZCR          */ 01588000
*   2  ZCRFRRA PTR(31),          /* PTR TO FRR                       */ 01589000
*   2  ZCRFLGS1 CHAR(1),         /* FLGS USED BY REQUEST COMPLETION  */ 01590000
*      3  ZCREXSW BIT(1),        /* EXIT SWITCH                      */ 01591000
*      3  ZCRQUESW BIT(1),       /* QUEUE SWITCH                     */ 01592000
*      3  ZCRDEQSW BIT(1),       /* DEQUEUE SWITCH                   */ 01593000
*      3  ZCRWAIT BIT(1),        /* WAIT Q ANALYSIS COMPLETE         */ 01594000
*      3  ZCRNRMEX BIT(1),       /* NORMAL EXIT TO BE TAKEN          */ 01595000
*      3  ZCRENDLP BIT(1),       /* END OF LOOP SWITCH               */ 01596000
*      3  ZCRUNSOL BIT(1),       /* UNSOLICITED DATA                 */ 01597000
*      3  ZCRFEXIT BIT(1),       /* FORCE EXIT SWITCH                */ 01598000
*   2  ZCRFLGS2 CHAR(1),         /* FLAGS USED WITHIN TPIOS          */ 01599000
*      3  ZCRLOCAL BIT(1),       /* LOCAL SUPPORT                    */ 01600000
*      3  ZCRSHEDI BIT(1),       /* IMMEDIATE SCHEDULE               */ 01601000
*      3  ZCRFMSED BIT(1),       /* FMCB SEARCH ENDED                */ 01602000
*      3  ZCROB    BIT(1),       /* OUTBOUND PROC IN PROGRESS        */ 01603000
*      3  ZCRIF0E1 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   01604000
*                                   INBOUND PROCESSING               */ 01605000
*      3  ZCRIF0E2 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   01606000
*                                   INBOUND PROCESSING               */ 01607000
*      3  ZCRIF0E3 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   01608000
*                                   INBOUND PROCESSING               */ 01609000
*   2  ZCRSWFLD CHAR(1),         /* SWITCHES FOR TPIOS OUTBOUND      */ 01610000
*      3  ZCRENDSH BIT(1),       /* EXIT FROM REMOTE DEV SCHEDULER   */ 01611000
*         4  ZCRSLCP BIT(1),     /* SCHEDULE LCPB                    */ 01612000
*      3  ZCREXTYP BIT(1),       /* TPEXIT TYPE                      */ 01613000
*      3  ZCRENDPR BIT(1),       /* EXIT FROM INNER PROCESS          */ 01614000
*      3  ZCRNDLCP BIT(1),       /* EXIT FROM LCPB PROCESSING        */ 01615000
*         4  ZCROB1 BIT(1),      /* REMOTE DEV SCHED 1ST TIME SWITCH */ 01616000
*      3  ZCRENDX BIT(1),        /* EXIT FROM LCCW/BTU XLATION       */ 01617000
*      3  ZCRENDXL BIT(1),       /* EXIT FROM LCCW PROC              */ 01618000
*      3  ZCRENDAN BIT(1),       /* EXIT FROM LCPB ANALYSIS          */ 01619000
*      3  ZCRRESET BIT(1),                                         0721 01620000
*         4  ZCRCNLXL BIT(1),    /* CANCEL FURTHER XLATE             */ 01621000
*   2  ZCRFLGS3 CHAR(1),         /* FLAGS FOR OUTBOUND PROCESSING    */ 01622000
*      3  ZCRTIC BIT(1),         /* SELECT NOT TO BE SENT            */ 01623000
*      3  ZCRTPCON BIT(1),       /* TPIOS CONTACT SENT               */ 01624000
*      3  ZCRTPDIS BIT(1),       /* TPIOS DISCONNECT TO BE SENT      */ 01625000
*      3  ZCRDISC  BIT(1),       /* DISCONNECT IN PROCESS            */ 01626000
*      3  ZCREDRIV BIT(1),       /* DO DERIVE                        */ 01627000
*      3  ZCRNOFRE BIT(1),       /* NO FREEING OF SIO QUEUE          */ 01628000
*      3  ZCRWRPTR BIT(1),       /* WRITE TO PRINTER REQUEST         */ 01629000
*      3  ZCRINLCP BIT(1),       /* ERROR OCCURED DURING OUTBND PROC */ 01630000
*   2  ZCRGENSW CHAR(1),         /* GENERAL SWITCHES                 */ 01631000
*      3  ZCRTSW1  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 01632000
*      3  ZCRTSW2  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 01633000
*      3  ZCRRT06  BIT(1),       /* CRITICAL TEXT OPTION             */ 01634000
*      3  ZCRLCSYN BIT(1),       /* LCCW SYNC SPECIFIED              */ 01635000
*      3  ZCREXRES BIT(1),       /* EXCEPTION RESPONSE SPECIFIED     */ 01636000
*      3  ZCRCLRBD BIT(1),       /* FLAG INDICATING BIND WAS CLEARED */ 01637000
*      3  ZCRBRIS  BIT(1),       /* BRACKET REJECTED DUE TO IN BRAC. */ 01638000
*      3  ZCRF1RES BIT(1),       /* FID1 RESPONSE TO BE GENERATED    */ 01639000
*   2  ZCRPFLGS CHAR(1),         /* UTILITIES PROC OPTION FLAGS      */ 01640000
*      3  ZCRQAHED BIT(1),      /* QXFR RTN TO USE INSERT OPT'N ON TPQ* 01641000
*      3  *        BIT(7),      /* RESERVED                          */ 01642000
*   2  ZCRIBPR CHAR(1),          /* INBOUND PROCESSING FLAGS         */ 01643000
*         3  ZCRNOBUF BIT(1),    /* FSB WITH NO BUFFER               */ 01644000
*         3  ZCRERR   BIT(1),    /* ERROR INDICATOR                  */ 01645000
*         3  ZCRRELK  BIT(1),    /* RESET ERROR LOCK FUNCTION REQ.   */ 01646000
*         3  ZCRLCPFR BIT(1),    /* FLAG IND. DEALLOCATE ATOP LCPB   */ 01647000
*         3  ZCRLCPFD BIT(1),    /* FLAG IND. LCPB FOUND ON WAITQ    */ 01648000
*         3  ZCR3270  BIT(1),    /* 3270 DEVICE                      */ 01649000
*         3  ZCR3270R BIT(1),    /* 3270 DEVICE IN RECORD MODE       */ 01650000
*         3  *        BIT(1),    /* RESERVED                         */ 01651000
*   2  ZCRSCPSW CHAR(1),         /* SESSION CONTROL FLAGS            */ 01652000
*         3  ZCRTPEX BIT(1),     /* TP EXIT                          */ 01653000
*         3  ZCRTPINV BIT(1),    /* INVOKE TPIOS                     */ 01654000
*         3  ZCRRJLCP BIT(1),    /* LCPB REJECTED                    */ 01655000
*         3  ZCRLREQ BIT(1),     /* REQUEST                          */ 01656000
*         3  ZCRPRCMP BIT(1),    /* PROCESSING COMPLETE              */ 01657000
*         3  ZCRFSBWE BIT(1),    /* FSB IS WORK ELEMENT              */ 01658000
*         3  ZCRSKIPT BIT(1),    /* SKIP TRACE FLAG                  */ 01659000
*         3  *       BIT(1),     /* RESERVED                         */ 01660000
*   2  ZCRCRLCP PTR(31),         /* CURRENT LCPB PTR                 */ 01661000
*   2  ZCRPARMS BDY(WORD),       /* PARAMETERS PASSED TO UTILITIES */   01662000
*      3  ZCRFBPTR PTR(31),      /* PTR TO FROM BUFFER               */ 01663000
*         4  ZCRCBPTR PTR(31),   /* PTR TO CURRENT BUFFER            */ 01664000
*      3  ZCRTBPTR PTR(31),      /* PTR TO TO-OR-TRANSLATE BUFFER    */ 01665000
*      3  ZCRMLNG FIXED(15),     /* LENGTH TO MOVE                   */ 01666000
*      3  ZCRDFRDA FIXED(15),    /* OFFSET FROM DATA ADDR IN FROM BUF*/ 01667000
*         4  ZCRDTODA FIXED(15), /* OFFSET FROM DATA ADDR XLATE BUF  */ 01668000
*      3  ZCRPCOD1 CHAR(1),      /* CODE BYTE FOR ALLOC/DISALLOC     */ 01669000
*         4  ZCRPPG BIT(1),      /* GET PAGEABLE BUFF                */ 01670000
*         4  ZCRPLNG BIT(1),     /* LENGTH OF BUFFER SPECIFIED       */ 01671000
*         4  ZCRPFSB BIT(1),     /* GET FSB                          */ 01672000
*         4  ZCRPLSBF BIT(1),    /* GET LSCB AND BUFFER              */ 01673000
*            5 ZCRPLSBQ BIT(1),  /* PURGE LSCB QUEUE                 */ 01674000
*         4  ZCRPLSCB BIT(1),    /* GET OR RELEASE LSCB              */ 01675000
*         4  ZCRPBUF BIT(1),     /* GET OR RELEASE BUFFER            */ 01676000
*         4  ZCRPCFTX BIT(1),    /* CONFIDENTIAL TEXT                */ 01677000
*         4  ZCRPRES BIT(1),     /* RESERVED                         */ 01678000
*      3  ZCRPCOD2 CHAR(1),      /* CODE BYTE FOR MOVE               */ 01679000
*         4  ZCRPPG2 BIT(1),     /* GET PAGEABLE BUFFER              */ 01680000
*         4  ZCRPFHDR BIT(1),    /* FROM BUFFER FDB TO BE USED       */ 01681000
*         4  ZCRPMFGF BIT(1),    /* MOVE STARTS WIHT 1ST BUFF IN BLOCK* 01682000
*         4  ZCRPRES2 BIT(5),    /* RESERVED                         */ 01683000
*      3  ZCRPCHAR CHAR(1),      /* TRANSLATE & TEST SEARCH CHARACTER*/ 01684000
*      3  ZCRPSW   CHAR(1),      /* SWITCH FIELD                     */ 01685000
*   2  ZCRCCWA PTR(31),          /* PTR TO CURRENT CCW (CCW 1 OR 2)  */ 01686000
*   2  ZCRBFPTR PTR(31),         /* SAVE 1ST BUFF PTR IN TO-BUFF CHN    01687000
*                                   OR LAST BUFFER IN CHANNEL PGM    */ 01688000
*   2  ZCRZLB PTR(31),           /* PTR TO CURR BUFF IN CHANNEL PGM  */ 01689000
*   2  ZCRPVZB PTR(31),          /* PTR TO PREVIOUS BUFF IN CHAN PGM */ 01690000
*   2  ZCRSVRTN BDY(WORD),       /* REG 14 SAVE AREAS                */ 01691000
*      3  ZCRSVF1 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01692000
*      3  ZCRSVF2 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01693000
*      3  ZCRSVF3 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01694000
*      3  ZCRSVF4 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01695000
*      3  ZCRSVF5 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01696000
*      3  ZCRSVF6 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01697000
*      3  ZCRSVF7 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01698000
*      3  ZCRSVF8 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01699000
*      3  ZCRSVF9 PTR(31),       /* SAVE REQUIRED REGISTER           */ 01700000
*      3  ZCRSVF10 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01701000
*      3  ZCRSVF11 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01702000
*      3  ZCRSVF12 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01703000
*      3  ZCRSVF13 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01704000
*      3  ZCRSVF14 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01705000
*      3  ZCRSVF15 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01706000
*      3  ZCRSVF16 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01707000
*      3  ZCRSVF17 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01708000
*      3  ZCRSVF18 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01709000
*      3  ZCRSVF19 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01710000
*      3  ZCRSVF20 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01711000
*      3  ZCRSVF21 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01712000
*      3  ZCRSVF22 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01713000
*      3  ZCRSVF23 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01714000
*      3  ZCRSVF24 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01715000
*      3  ZCRSVF25 PTR(31),      /* SAVE REQUIRED REGISTER           */ 01716000
*   2  ZCRWKARA BDY(WORD),       /* TEMPORARY REG SAVE AREA          */ 01717000
*      3  ZCRSVWK1 PTR(31),      /* SAVE REQUIRED REG                */ 01718000
*      3  ZCRSVWK2 PTR(31),      /* SAVE REQUIRED REG                */ 01719000
*      3  ZCRSVWK3 PTR(31),      /* SAVE REQUIRED REG                */ 01720000
*      3  ZCRSVWK4 PTR(31),      /* SAVE REQUIRED REG                */ 01721000
*      3  ZCRSVWK5 PTR(31),      /* SAVE REQUIRED REG                */ 01722000
*   2  ZCRFSBSV PTR(31),         /* FSB CHAIN PTR SAVEAREA           */ 01723000
*   2  ZCRFBPRC BIT(1),          /* FSB PROCESS SW                   */ 01724000
*   2  ZCRMOREL BIT(1),          /* MORE ELEMENTS SW                 */ 01725000
*   2  ZCRSCANQ BIT(1),          /* SCAN QUEUE SW                    */ 01726000
*   2  ZCRNXTEL BIT(1),          /* NEXT ELEMENT SW                  */ 01727000
*   2  ZCRXSCHD BIT(1),          /* EXIT SCHEDULE SW                 */ 01728000
*   2  ZCRLSTFB BIT(1),          /* INBOUND PROC LAST FSB FOR ELEM SW*/ 01729000
*   2  ZCRTOPQ  BIT(1),          /* QUEUE ELEMENT TO TOP SW          */ 01730000
*   2  ZCRAWQSW BIT(1),          /* CHECK AWAITQ FOR MORE WORK =1    */ 01731000
*                                /* CHECK WAITQ =0                   */ 01732000
*   2  ZCRRCDSV CHAR(1),         /* RETURN CODE SAVEAREA             */ 01733000
*   2  ZCRPRMTC CHAR(1),         /* PREEMPT COMPLETION PARAMETER BYTE*/ 01734000
*   2  ZCROPCDE CHAR(1),         /* OP CODE TO BE TRANSFORMED         * 01735000
*   2  ZCRR2SV PTR(31),          /* ISTZBFDI REG 2 SAVE EREA         */ 01736000
*   2  ZCRR13SV PTR(31),         /* ISTSBFDI REG 13 SAVE EREA        */ 01737000
*   2  ZCRCIDSV BDY(WORD),       /* ISTZBFDI CID SAVE AREA           */ 01738000
*      3  ZCRSAFSV CHAR(2),      /* ISTZBFDI SAF SAVE AREA           */ 01739000
*      3  ZCRDAFSV CHAR(2),      /* ISTZBFDI DAF SAVE AREA           */ 01740000
*   2  ZCRSAVEZ (6) BDY(WORD) CHAR(LENGTH(ISTZSAVE)),              0721 01741000
*                                /* SAVE/TRACE AREAS FOR TPIOS MODS  */ 01742000
*   2  ZCRREMIC PTR(31),        /* POINTER TO REMOTE RN ICNCB        */ 01743000
*   2  ZCRAUDIT CHAR(36),        /* TPIOS AUDIT TRAIL AREA           */ 01744000
*      3  ZCRTID CHAR(1),        /* THREAD I.D.                      */ 01745000
*      3  ZCRTNAME CHAR(4),      /* LAST 4 CHARS OF THREAD NAME      */ 01746000
*      3  ZCRENTER BIT(248),     /* BIT ARRAY FOR MODULES ENTERED    */ 01747000
*         4  ZCREAC1A BIT(1),    /* ISTZAC1A ENTERED                 */ 01748000
*         4  ZCREAC0A BIT(1),    /* ISTZAC0A ENTERED                 */ 01749000
*         4  ZCREAC0B BIT(1),    /* ISTZAC0B ENTERED                 */ 01750000
*         4  ZCREAC1B BIT(1),    /* ISTZAC1B ENTERED                 */ 01751000
*         4  ZCREBCAA BIT(1),    /* ISTZBCAA ENTERED                 */ 01752000
*         4  ZCREBCAB BIT(1),    /* ISTZBCAB ENTERED                 */ 01753000
*         4  ZCREBCAE BIT(1),    /* ISTZBCAE ENTERED                 */ 01754000
*         4  ZCREBCAG BIT(1),    /* ISTZBCAG ENTERED                 */ 01755000
*         4  ZCREBCAI BIT(1),    /* ISTZBCAI ENTERED                 */ 01756000
*         4  ZCREBCAM BIT(1),    /* ISTZBCAM ENTERED                 */ 01757000
*         4  ZCREBCBA BIT(1),    /* ISTZBCBA ENTERED                 */ 01758000
*         4  ZCREBCBB BIT(1),    /* ISTZBCBB ENTERED                 */ 01759000
*         4  ZCREBCBI BIT(1),    /* ISTZBCBI ENTERED                 */ 01760000
*         4  ZCREBCCB BIT(1),    /* ISTZBCCB ENTERED                 */ 01761000
*         4  ZCREBCDI BIT(1),    /* ISTZBCDI ENTERED                 */ 01762000
*         4  ZCREBCEB BIT(1),    /* ISTZBCEB ENTERED                 */ 01763000
*         4  ZCREBCFA BIT(1),    /* ISTZBCFA ENTERED                 */ 01764000
*         4  ZCREBCFB BIT(1),    /* ISTZBCFB ENTERED                 */ 01765000
*         4  ZCREBCGA BIT(1),    /* ISTZBCGA ENTERED                 */ 01766000
*         4  ZCREBCGB BIT(1),    /* ISTZBCGB ENTERED                 */ 01767000
*         4  ZCREBCHA BIT(1),    /* ISTZBCHA ENTERED                 */ 01768000
*         4  ZCREBCHB BIT(1),    /* ISTZBCHB ENTERED                 */ 01769000
*         4  ZCREBCIA BIT(1),    /* ISTZBCIA ENTERED                 */ 01770000
*         4  ZCREBCIB BIT(1),    /* ISTZBCIB ENTERED                 */ 01771000
*         4  ZCREBCID BIT(1),    /* ISTZBCID ENTERED                 */ 01772000
*         4  ZCREBCJA BIT(1),    /* ISTZBCJA ENTERED                 */ 01773000
*         4  ZCREBCJB BIT(1),    /* ISTZBCJB ENTERED                 */ 01774000
*         4  ZCREBCKA BIT(1),    /* ISTZBCKA ENTERED                 */ 01775000
*         4  ZCREBCKB BIT(1),    /* ISTZBCKB ENTERED                 */ 01776000
*         4  ZCREBCLA BIT(1),    /* ISTZBCLA ENTERED                 */ 01777000
*         4  ZCREBCLB BIT(1),    /* ISTZBCLB ENTERED                 */ 01778000
*         4  ZCREBCMB BIT(1),    /* ISTZBCMB ENTERED                 */ 01779000
*         4  ZCREBCND BIT(1),    /* ISTZBCND ENTERED                 */ 01780000
*         4  ZCREBCNE BIT(1),    /* ISTZBCNE ENTERED                 */ 01781000
*         4  ZCREBCOB BIT(1),    /* ISTZBCOB ENTERED                 */ 01782000
*         4  ZCREBCPB BIT(1),    /* ISTZBCPB ENTERED                 */ 01783000
*         4  ZCREBCQB BIT(1),    /* ISTZBCQB ENTERED                 */ 01784000
*         4  ZCREBCRA BIT(1),    /* ISTZBCRA ENTERED                 */ 01785000
*         4  ZCREBCRB BIT(1),    /* ISTZBCRB ENTERED                 */ 01786000
*         4  ZCREBCSC BIT(1),    /* ISTZBCSC ENTERED                 */ 01787000
*         4  ZCREBCXA BIT(1),    /* ISTZBCXA ENTERED                 */ 01788000
*         4  ZCREBCX0 BIT(1),    /* ISTZBCX0 ENTERED                 */ 01789000
*         4  ZCREBCY0 BIT(1),    /* ISTZBCY0 ENTERED                 */ 01790000
*         4  ZCREBCZ0 BIT(1),    /* ISTZBCZ0 ENTERED                 */ 01791000
*         4  ZCREBC0A BIT(1),    /* ISTZBC0A ENTERED                 */ 01792000
*         4  ZCREBC0B BIT(1),    /* ISTZBC0B ENTERED                 */ 01793000
*         4  ZCRECC0A BIT(1),    /* ISTZCC0A ENTERED                 */ 01794000
*         4  ZCRECC0B BIT(1),    /* ISTZCC0B ENTERED                 */ 01795000
*         4  ZCRECC1A BIT(1),    /* ISTZCC1A ENTERED                 */ 01796000
*         4  ZCRECC1B BIT(1),    /* ISTZCC1B ENTERED                 */ 01797000
*         4  ZCRECC2B BIT(1),    /* ISTZCC2B ENTERED                 */ 01798000
*         4  ZCREDCA0 BIT(1),    /* ISTZDCA0 ENTERED                 */ 01799000
*         4  ZCREDCB0 BIT(1),    /* ISTZDCB0 ENTERED                 */ 01800000
*         4  ZCREDCC0 BIT(1),    /* ISTZDCC0 ENTERED                 */ 01801000
*         4  ZCREDCD0 BIT(1),    /* ISTZDCD0 ENTERED                 */ 01802000
*         4  ZCREDCE0 BIT(1),    /* ISTZDCE0 ENTERED                 */ 01803000
*         4  ZCREDCF0 BIT(1),    /* ISTZDCF0 ENTERED                 */ 01804000
*         4  ZCREDCH0 BIT(1),    /* ISTZDCH0 ENTERED                 */ 01805000
*         4  ZCREDCI0 BIT(1),    /* ISTZDCI0 ENTERED                 */ 01806000
*         4  ZCREDCJ0 BIT(1),    /* ISTZDCJ0 ENTERED                 */ 01807000
*         4  ZCREDCKA BIT(1),    /* ISTZDCKA ENTERED                 */ 01808000
*         4  ZCREDCKB BIT(1),    /* ISTZDCKB ENTERED                 */ 01809000
*         4  ZCREDCL0 BIT(1),    /* ISTZDCL0 ENTERED                 */ 01810000
*         4  ZCREDCMB BIT(1),    /* ISTZDCMB ENTERED                 */ 01811000
*         4  ZCREECBA BIT(1),    /* ISTZECBA ENTERED                 */ 01812000
*         4  ZCREECBB BIT(1),    /* ISTZECBB ENTERED                 */ 01813000
*         4  ZCREECCA BIT(1),    /* ISTZECCA ENTERED                 */ 01814000
*         4  ZCREECCB BIT(1),    /* ISTZECCB ENTERED                 */ 01815000
*         4  ZCREECDA BIT(1),    /* ISTZECDA ENTERED                 */ 01816000
*         4  ZCREECEA BIT(1),    /* ISTZECEA ENTERED                 */ 01817000
*         4  ZCREECTA BIT(1),    /* ISTZECTA ENTERED                 */ 01818000
*         4  ZCREFCEA BIT(1),    /* ISTZFCEA ENTERED                 */ 01819000
*         4  ZCREFCEB BIT(1),    /* ISTZFCEB ENTERED                 */ 01820000
*         4  ZCREGCAB BIT(1),    /* ISTZGCAB ENTERED                 */ 01821000
*         4  ZCREGCBB BIT(1),    /* ISTZGCBB ENTERED                 */ 01822000
*         4  *        BIT(1),    /* NOT USED                         */ 01823000
*         4  ZCREGCDB BIT(1),    /* ISTZGCDB ENTERED                 */ 01824000
*         4  ZCREGCEB BIT(1),    /* ISTZGCEB ENTERED                 */ 01825000
*         4  ZCREGCLA BIT(1),    /* ISTZGCLA ENTERED                 */ 01826000
*         4  ZCREGC0A BIT(1),    /* ISTZGC0A ENTERED                 */ 01827000
*         4  ZCREGC0B BIT(1),    /* ISTZGC0B ENTERED                 */ 01828000
*         4  ZCREHCAN BIT(1),    /* ISTZHCAN ENTERED                 */ 01829000
*         4  ZCREICAA BIT(1),    /* ISTZICAA ENTERED                 */ 01830000
*         4  ZCREICAB BIT(1),    /* ISTZICAB ENTERED                 */ 01831000
*         4  ZCREICBB BIT(1),    /* ISTZICBB ENTERED                 */ 01832000
*         4  ZCREICBI BIT(1),    /* ISTZICBI ENTERED                 */ 01833000
*         4  ZCREICCB BIT(1),    /* ISTZICCB ENTERED                 */ 01834000
*         4  ZCREICCI BIT(1),    /* ISTZICCI ENTERED                 */ 01835000
*         4  ZCREICDB BIT(1),    /* ISTZICDB ENTERED                 */ 01836000
*         4  ZCREICEB BIT(1),    /* ISTZICEB ENTERED                 */ 01837000
*         4  ZCREICGB BIT(1),    /* ISTZICGB ENTERED                 */ 01838000
*         4  ZCREICHB BIT(1),    /* ISTZICHB ENTERED                 */ 01839000
*         4  ZCREICIB BIT(1),    /* ISTZICIB ENTERED                 */ 01840000
*         4  ZCREICID BIT(1),    /* ISTZICID ENTERED                 */ 01841000
*         4  ZCREICJB BIT(1),    /* ISTZICJB ENTERED                 */ 01842000
*         4  ZCREICKB BIT(1),    /* ISTZICKB ENTERED                 */ 01843000
*         4  ZCREICKE BIT(1),    /* ISTZICKE ENTERED                 */ 01844000
*         4  ZCREICKG BIT(1),    /* ISTZICKG ENTERED                 */ 01845000
*         4  ZCREICLB BIT(1),    /* ISTZICLB ENTERED                 */ 01846000
*         4  ZCREICMB BIT(1),    /* ISTZICMB ENTERED                 */ 01847000
*         4  ZCREICNA BIT(1),    /* ISTZICNA ENTERED                 */ 01848000
*         4  ZCREICNB BIT(1),    /* ISTZICNB ENTERED                 */ 01849000
*         4  ZCREICOA BIT(1),    /* ISTZICOA ENTERED                 */ 01850000
*         4  ZCREICOB BIT(1),    /* ISTZICOB ENTERED                 */ 01851000
*         4  ZCREICQA BIT(1),    /* ISTZICQA ENTERED                 */ 01852000
*         4  ZCREICQB BIT(1),    /* ISTZICQB ENTERED                 */ 01853000
*         4  ZCREICRB BIT(1),    /* ISTZICRB ENTERED                 */ 01854000
*         4  ZCREICSB BIT(1),    /* ISTZICSB ENTERED                 */ 01855000
*         4  ZCREICSC BIT(1),    /* ISTZICSC ENTERED                 */ 01856000
*         4  ZCREICTB BIT(1),    /* ISTZICTB ENTERED                 */ 01857000
*         4  ZCREICUB BIT(1),    /* ISTZICUB ENTERED                 */ 01858000
*         4  ZCREICVB BIT(1),    /* ISTZICVB ENTERED                 */ 01859000
*         4  ZCREICWB BIT(1),    /* ISTZICWB ENTERED                 */ 01860000
*         4  ZCREICX0 BIT(1),    /* ISTZICX0 ENTERED                 */ 01861000
*         4  ZCREIC0B BIT(1),    /* ISTZIC0B ENTERED                 */ 01862000
*         4  ZCREIC1B BIT(1),    /* ISTZIC1B ENTERED                 */ 01863000
*         4  ZCREJCAB BIT(1),    /* ISTZJCAB ENTERED                 */ 01864000
*         4  ZCREJCBB BIT(1),    /* ISTZJCBB ENTERED                 */ 01865000
*         4  ZCREJCCB BIT(1),    /* ISTZJCCB ENTERED                 */ 01866000
*         4  ZCREJCDB BIT(1),    /* ISTZJCDB ENTERED                 */ 01867000
*         4  ZCREJC0B BIT(1),    /* ISTZJC0B ENTERED                 */ 01868000
*         4  ZCREKCBB BIT(1),    /* ISTZKCBB ENTERED                 */ 01869000
*         4  ZCREKCBN BIT(1),    /* ISTZKCBN ENTERED                 */ 01870000
*         4  ZCREKCCN BIT(1),    /* ISTZKCCN ENTERED                 */ 01871000
*         4  ZCREDCWR BIT(1),    /* ISTZDCWR ENTERED                 */ 01872000
*         4  ZCREDCWB BIT(1),    /* ISTZDCWB ENTERED                 */ 01873000
*         4  ZCREDCXR BIT(1),    /* ISTZDCXR ENTERED                 */ 01874000
*         4  ZCREBCBR BIT(1),    /* ISTZBCBR ENTERED                 */ 01875000
*         4  ZCREBCDR BIT(1),    /* ISTZBCDR ENTERED                 */ 01876000
*         4  ZCREBCAR BIT(1),    /* ISTZBCAR ENTERED                 */ 01877000
*         4  ZCRECCBI BIT(1),    /* ISTZCCBI ENTERED                 */ 01878000
*         4  ZCRECCAI BIT(1),    /* ISTZCCAI ENTERED                 */ 01879000
*         4  ZCRECCCI BIT(1),    /* ISTZCCCI ENTERED                 */ 01880000
*         4  ZCREAC1R BIT(1),    /* ISTZAC1R ENTERED                 */ 01881000
*         4  ZCREBCSB BIT(1),    /* ISTZBCSB ENTERED                 */ 01882000
*         4  ZCREDCPR BIT(1),    /* ISTZDCPR ENTERED                 */ 01883000
*         4  ZCREDCQR BIT(1),    /* ISTZDCQR ENTERED                 */ 01884000
*         4  ZCREBCAL BIT(1),    /* ISTZBCAL ENTERED                 */ 01885000
*         4  ZCREBC0L BIT(1),    /* ISTZBC0L ENTERED                 */ 01886000
*         4  ZCREBCNB BIT(1),    /* ISTZBCNB ENTERED                 */ 01887000
*         4  ZCREICOE BIT(1),    /* ISTZICOE ENTERED                 */ 01888000
*         4  ZCREDCNB BIT(1),    /* ISTZDCNB ENTERED                 */ 01889000
*         4  ZCREKCCB BIT(1),    /* ISTZKCCB ENTERED                 */ 01890000
*         4  ZCRECFY0 BIT(1),    /* ISTZCFY0 ENTERED                 */ 01891000
*         4  ZCREDCK0 BIT(1),    /* ISTZDFK0 ENTERED                 */ 01892000
*         4  ZCREICSG BIT(1),    /* ISTZICSG ENTERED                 */ 01893000
*         4  ZCREBCIF BIT(1),    /* ISTZBCIF ENTERED                 */ 01894000
*         4  ZCREDCMF BIT(1),    /* ISTZDCMF ENTERED                 */ 01895000
*         4  ZCRELCAB BIT(1),    /* ISTZLCAB ENTERED                 */ 01896000
*         4  ZCREAC2B BIT(1),    /* ISTZAC2B ENTERED                 */ 01897000
*         4  ZCREIC2B BIT(1),    /* ISTZIC2B ENTERED                 */ 01898000
*         4  ZCRRSV97 BIT(97),   /* RESERVED                         */ 01899000
*   2  ZCRCMNRC CHAR(1),                /* PURGE MWOR RETURN CODE    */ 01900000
*   2  ZCRWORDA CHAR(3),                /* RESERVED FOR LATER USE    */ 01901000
*   2  ZCRLCPB  CHAR(LENGTH(ISTLCPB)),  /* 3270 S/R LCPB             */ 01902000
*      3 ZCRRHRU,                       /* SAVEAREA FOR RH AND RU    */ 01903000
*        4 ZCRRH    CHAR(3),            /* RH                        */ 01904000
*        4 ZCRRU    CHAR(*);            /* RU                        */ 01905000
*DCL ZCTYPE BIT(8) CONSTANT('00'X);   /* ZCR TYPE                   */  01906000
*DCL ZCLNG FIXED(15) CONSTANT(172);   /* ZCRR LENGTH                */  01907000
*DCL ZCRSAVNO BIT(8) CONSTANT('06'X); /* NUMBER OF SAVEAREAS IN ZCRR */ 01908000
*DCL ZCRLSVNO BIT(8) CONSTANT('04'X); /* NUMBER OF SAVE AREAS IN   0725 01909000
*                                         LOCAL SUPPORT              */ 01910000
*/* *** EQUATES FOR ZCRRCDSV *** */                                0726 01911000
*                                                                  0726 01912000
*DCL ZCRMRFSB BIT(8) CONSTANT('0C'X);  /* REQUEST COMPLETION MOVE FSB   01913000
*                                         TO PROCESS                 */ 01914000
*DCL ZCRSRCHQ BIT(8) CONSTANT('10'X);  /* REQUEST COMPLETION SEARCH     01915000
*                                         REQUEST QUEUE              */ 01916000
*DCL ZCREXIT  BIT(8) CONSTANT('14'X);  /* REQUEST COMPLETION EXIT    */ 01917000
*DCL ZCRSFSB  BIT(8) CONSTANT('18'X);  /* REQUEST COMPLETION SINGLE     01918000
*                                         FSB                        */ 01919000
*DCL ZCRDLFSB BIT(8) CONSTANT('1C'X);  /* REQUEST COMPLETION DUAL FSB * 01920000
*DCL ZCRNOSCH BIT (8) CONSTANT('20'X); /* REQUEST COMPLETION, EXIT WITH 01921000
*                                         SCHED NONE                 */ 01922000
*DCL ZCRNRSCH BIT (8) CONSTANT('24'X); /* REQUEST COMPLETION, EXIT WITH 01923000
*                                         SCHED NORM                 */ 01924000
*DCL ZCRLGERR FIXED(8) CONSTANT(8);    /* LOGICAL ERROR              */ 01925000
*DCL ZCPLSCB BIT(8) CONSTANT('08'X);   /* GET A RELEASE LSCB         */ 01926000
*DCL ZCPBUF  BIT(8) CONSTANT('04'X);   /* GET A RELEASE BUFFER       */ 01927000
*DCL ZCRTAC0A FIXED(8) CONSTANT(01);   /* LOCAL DEVICE SCHEDULER(OUT)*/ 01928000
*DCL ZCRTAC0B FIXED(8) CONSTANT(02);   /* REMOTE DEVICE SCHEDLER(OUT)*/ 01929000
*DCL ZCRTCC1A FIXED(8) CONSTANT(03);   /* LOCAL DIALOG SCHEDLER(IN)  */ 01930000
*DCL ZCRTCC1B FIXED(8) CONSTANT(04);   /* REMOTE DIALOG SCHEDLER(IN) */ 01931000
*DCL ZCRTDCE0 FIXED(8) CONSTANT(05);   /* NCP SLOWDOWN RECOVERY      */ 01932000
*DCL ZCRTDCKA FIXED(8) CONSTANT(06);   /* LOCAL GENERAL FUNCTIONS    */ 01933000
*DCL ZCRTDCKB FIXED(8) CONSTANT(07);   /* REMOTE GENERAL FUNCTIONS   */ 01934000
*DCL ZCRTFCEB FIXED(8) CONSTANT(08);   /* REMOTE READ BUFFER ALLOC.  */ 01935000
*DCL ZCRTGCLA FIXED(8) CONSTANT(09);   /* LCAL CTL & TEST FEEDBACK(IN)* 01936000
*DCL ZCRTGC0A FIXED(8) CONSTANT(10);   /* LOCAL REQ. COMPLETION(IN)  */ 01937000
*DCL ZCRTGC0B FIXED(8) CONSTANT(11);   /* REMOTE REQ. COMPLETION(IN) */ 01938000
*DCL ZCRTICWB FIXED(8) CONSTANT(12);   /* RESET CLEANUP (PHASE 5)    */ 01939000
*DCL ZCRTIC0B FIXED(8) CONSTANT(13);   /* REMOTE REQ COMPLTION CTL(IN)* 01940000
*DCL ZCRTAC1B FIXED(8) CONSTANT(14);   /* ISTZAC1B THREAD ID         */ 01941000
*DCL ZCRTIC1B FIXED(8) CONSTANT(15);   /* ISTZIC1B THREAD ID         */ 01942000
*DCL ZCRTCCBI FIXED(8) CONSTANT(16);   /* ISTZCCBI THREAD ID         */ 01943000
*DCL ZCRTAC1R FIXED(8) CONSTANT(17);   /* ISTZAC1R THREAD ID         */ 01944000
*DCL ZCRTAC1A FIXED(8) CONSTANT(18);   /* ISTZAC1A THREAD ID         */ 01945000
*DCL ZCRTLCAB FIXED(8) CONSTANT(19);   /* ISTZLCAB THREAD ID         */ 01946000
*/* COMPONENT RECOVERY                                               */ 01947000
*/*                                                                  */ 01948000
*DCL 1 ISTASCRR BDY(WORD) BASED,        /* CRR FOR SMS               */ 01949000
*     2  ASCPFCRR CHAR(LENGTH(ISTPFCRR)),                          0755 01950000
*     2  ASCFLAGS CHAR(7),              /* FLAGS                     */ 01951000
*        3  ASCFLG1 CHAR(2),            /* MODULE TRACE FLAGS        */ 01952000
*           4  ASCFBA BIT(1),           /* ALLOCATION IN PATH        */ 01953000
*           4  ASCFBD BIT(1),           /* DE-ALLOCATION IN PATH     */ 01954000
*           4  ASCFSR BIT(1),           /* FSR IN PATH               */ 01955000
*           4  ASCPASTR BIT(13),        /* RESERVED PATH FLAGS       */ 01956000
*        3  ASCFLG2 CHAR(2),            /* MODULE IN CONTROL FLAGS   */ 01957000
*           4  ASCFBAIC BIT(1),         /* ALLOCATION IN CONTROL     */ 01958000
*           4  ASCFBDIC BIT(1),         /* DE-ALLOCATION IN CONTROL  */ 01959000
*           4  ASCFSRIC BIT(1),         /* FSR IN CONTROL            */ 01960000
*           4  ASCICR BIT(13),          /* RESERVED IN CONTROL FLAGS */ 01961000
*        3  ASCFLG3 CHAR(3),            /* AUDIT FLAGS               */ 01962000
*           4  ASCFSRGT BIT(1),         /* FSR DOING GET PROCESSING  */ 01963000
*           4  ASCFBDAL BIT(1),         /* FBD DOING ALLOCATION      */ 01964000
*           4  ASCKEYF BIT(1),          /* KEY HAS BEEN ALTERED      */ 01965000
*           4  ASCLLKF BIT(1),          /* LOCAL LOCK HELD           */ 01966000
*           4  ASCFBDUD BIT(1),         /* FBD USING USER DATA       */ 01967000
*           4  ASCAUDIT BIT(19),        /* RESERVED AUDIT BITS       */ 01968000
*     2  ASCKEY CHAR(1),                /* ORIGINAL KEY              */ 01969000
*     2  ASCETRYA PTR(31),              /* RETRY ADRS FOR CONTINUE 0755 01970000
*                                          OPTION                    */ 01971000
*     2  ASCUSRGS CHAR(16),             /* SAVE AREA FOR USER REGS 0755 01972000
*                                          14 - 1                    */ 01973000
*        3  ASCUSR14 CHAR(4),           /* REGISTER 14               */ 01974000
*        3  ASCUSR15 CHAR(4),           /* REGISTER 15               */ 01975000
*        3  ASCUSR00 CHAR(4),           /* REGISTER 0                */ 01976000
*        3  ASCUSR01 CHAR(4),           /* REGISTER 1                */ 01977000
*     2  ASCPSREG CHAR(16);             /* SAVE AREA FOR PSS       0755 01978000
*                                          REGS 1 - 4                */ 01979000
*/*  INITIAL LEVEL                                      001 04/09/75 */ 01980000
*DCL 1 ISTAPCRR BDY(WORD) BASED,                                   0756 01981000
*     2 APCHDRSV CHAR(LENGTH(ISTPFCRR)),  /* HEADER                  */ 01982000
*     2  APCATFLG CHAR(2),              /* AUDIT TRACE FLAGS         */ 01983000
*        3  APC51E BIT(1),              /* ISTAPC51 WAS ENTERED      */ 01984000
*        3  APC52E BIT(1),              /* ISTAPC52  '     '         */ 01985000
*        3  APC53E BIT(1),              /* ISTAPC53                  */ 01986000
*        3  APC54E BIT(1),                                         0756 01987000
*        3  APC56E BIT(1),                                         0756 01988000
*        3  APC57E BIT(1),                                         0756 01989000
*        3  APC58E BIT(1),                                         0756 01990000
*        3  APC31E BIT(1),                                         0756 01991000
*        3 * BIT(8),                    /* RESERVED                  */ 01992000
*     2  APCRFLG CHAR(2),               /* AUDIT TRACE FLAGS         */ 01993000
*        3  APC51R BIT(1),              /* ISTAPCR1 IS RUNNING       */ 01994000
*        3  APC52R BIT(1),              /* ISTAPC52 IS RUNNING       */ 01995000
*        3  APC53R BIT(1),                                         0756 01996000
*        3  APC54R BIT(1),                                         0756 01997000
*        3  APC56R BIT(1),                                         0756 01998000
*        3  APC57R BIT(1),                                         0756 01999000
*        3  APC58R BIT(1),                                         0756 02000000
*        3  APC31R BIT(1),                                         0756 02001000
*        3  *      BIT(8),              /* RESERVED                  */ 02002000
*     2  APCPSTA PTR(31),               /* PST@                      */ 02003000
*     2  APCTCBA PTR(31),               /* TCB@                      */ 02004000
*     2  APCRTRN PTR(31),               /*@ TO BR14 TO RTN TO SYSTEM */ 02005000
*     2  APCPABSV PTR(31),              /*SAVED PAB@ TO REDISPATCH   */ 02006000
*     2  APCQWFO PTR(31),               /* Q@ IN PST WORK AREA ON    */ 02007000
*     2  APCFRRPM PTR(31),              /* WORKAREA@ RTN'D FROM SETFR*/ 02008000
*     2  APCSAVE CHAR(72),                                         0756 02009000
*        3  APCESTAL CHAR(72),          /* ESTAE PARAMETER LIST AREA */ 02010000
*     2  APCCOMF CHAR(4) BDY(HWORD),    /* FLAGS USED BY ALL PSS RTN */ 02011000
*        3  APCCOMF1 CHAR(2),                                      0756 02012000
*           4  APCSSTSK BIT(1),         /* IRB TYPE WORK             */ 02013000
*           4  APCUETSK BIT(1),         /* USER EXIT RUNNING UNDER IRB* 02014000
*           4  APCSMCR BIT(1),          /* SMA CRA BEING USED        */ 02015000
*           4  APCIRB1 BIT(1),          /* IRB1 BEING USED           */ 02016000
*           4  APCIRB2 BIT(1),          /* IRB2 BEING USED           */ 02017000
*           4  APCRELR BIT(1),          /*CALL ISTAPC58 TO RLEASE CRA*/ 02018000
*           4  APCEXIT BIT(1),          /* TELLS ISTAPC58 TO EXIT SYS*/ 02019000
*           4  APCZLBER BIT(1),         /* ERR WHILE RUNNING ZLFAB PAB* 02020000
*           4  * BIT(8),                /* RESERVED                  */ 02021000
*        3  APCRETCD FIXED(15),         /* RTN CODE FOR R15 FOR SYS  */ 02022000
*     2  APCSAV1 PTR(31),               /* 1ST SAVE WORD             */ 02023000
*     2  APCSAV2 PTR(31),               /* 2ND SAVE WORD             */ 02024000
*     2  APCSWTWD CHAR(4),              /* SWITCH AREA FOR PSS RTN   */ 02025000
*     2  APC31FLG CHAR(1),              /* ISTAPC31 FLAGS            */ 02026000
*        3  APCTPXIT BIT(1),            /* TPEXIT IN PROGRESS        */ 02027000
*        3  APCRESCH BIT(1),            /*PAB TPEXIT OCCURED  RESCHED*/ 02028000
*        3  APCSORT BIT(1),       /* PAB SORTED TO PROPER PST/MPST   */ 02029000
*        3  *       BIT(5),       /* RESERVED                        */ 02030000
*     2  APC52FLG CHAR(1),        /* ISTAPC52 FLAGS                  */ 02031000
*        3  APCCKRQ BIT(1),       /* CHECK RDY Q FOR WORK            */ 02032000
*        3  APCSMSR BIT(1),       /* RETURNING SMS RPH               */ 02033000
*        3  APCQENQ BIT(1),       /* ENQUEUEING PAB'S ON PST Q'S     */ 02034000
*        3  APCRDQ BIT(1),        /* DEQUEING PAB'S FROM PST RDY Q   */ 02035000
*        3  APCNWF BIT(1),        /* NO WORK FOUND                   */ 02036000
*        3  APCWKF   BIT(1),      /* WORK FOUND                      */ 02037000
*        3    *      BIT(2),      /* RESERVED                        */ 02038000
*     2  APC53FLG CHAR(1),        /* ISTAPC53 FLAGS                  */ 02039000
*        3  APCPR153 BIT(1),      /* USED PREALLOCATED CRA           */ 02040000
*     2  APC54FLG CHAR(1),        /* ISTAPC54 FLAGS                  */ 02041000
*        3  APCRLST BIT(1),       /* SMS BEING CALLED TO RELEASE UECB*/ 02042000
*        3  * BIT(7),             /* RESERVED                        */ 02043000
*     2  APC57FLG CHAR(1),        /* ISTAPC57 FLAGS                  */ 02044000
*        3  APCRECRA BIT(1),      /* RELEASE CRA BEING DONE          */ 02045000
*        3  APCNREL BIT(1),       /* DID NOT RELEASE CRA             */ 02046000
*        3  *   BIT(6),           /* RESERVED                        */ 02047000
*     2  * CHAR(15);              /* RESERVED                        */ 02048000
*/*               COMPONENT RECOVERY AREA                            */ 02049000
*/*  REVISIONS                                         005 04/09/75  */ 02050000
*DCL 1  ISTCRA BASED BDY(DWORD),        /* COMPONENT RECOVERY AREA   */ 02051000
*     2  CRABASIC BDY(WORD),            /* CRA WITHOUT PROCESS CRR   */ 02052000
*      3 CRAHDR CHAR(8) BDY(WORD),      /* CRA HEADER                */ 02053000
*        4  CRACRR PTR(31),             /* PTR TO ACTIVE CRR         */ 02054000
*        4  CRAFRR PTR(31),             /* PTR TO ACTIVE FRR         */ 02055000
*      3 CRALKACT BIT(32),              /* LOCK LEVEL AND          0757 02056000
*                                          OWNERSHIP FLAGS           */ 02057000
*        4  CRALEV32 BIT(1),            /* 1 = LEVEL 32 LOCK HELD    */ 02058000
*        4  CRALEV31 BIT(1),            /* 1 = LEVEL 31 LOCK HELD    */ 02059000
*        4  CRALEV30 BIT(1),            /* 1 = LEVEL 30 LOCK HELD    */ 02060000
*        4  CRALEV29 BIT(1),            /* 1 = LEVEL 29 LOCK HELD    */ 02061000
*        4  CRALEV28 BIT(1),            /* 1 = LEVEL 28 LOCK HELD    */ 02062000
*        4  CRALEV27 BIT(1),            /* 1 = LEVEL 27 LOCK HELD    */ 02063000
*        4  CRALEV26 BIT(1),            /* 1 = LEVEL 26 LOCK HELD    */ 02064000
*        4  CRALEV25 BIT(1),            /* 1 = LEVEL 25 LOCK HELD    */ 02065000
*        4  CRALEV24 BIT(1),            /* 1 = LEVEL 24 LOCK HELD    */ 02066000
*        4  CRALEV23 BIT(1),            /* 1 = LEVEL 23 LOCK HELD    */ 02067000
*        4  CRALEV22 BIT(1),            /* 1 = LEVEL 22 LOCK HELD    */ 02068000
*        4  CRALEV21 BIT(1),            /* 1 = LEVEL 21 LOCK HELD    */ 02069000
*        4  CRALEV20 BIT(1),            /* 1 = LEVEL 20 LOCK HELD    */ 02070000
*        4  CRALEV19 BIT(1),            /* 1 = LEVEL 19 LOCK HELD    */ 02071000
*        4  CRALEV18 BIT(1),            /* 1 = LEVEL 18 LOCK HELD    */ 02072000
*        4  CRALEV17 BIT(1),            /* 1 = LEVEL 17 LOCK HELD    */ 02073000
*        4  CRALEV16 BIT(1),            /* 1 = LEVEL 16 LOCK HELD    */ 02074000
*        4  CRALEV15 BIT(1),            /* 1 = LEVEL 15 LOCK HELD    */ 02075000
*        4  CRALEV14 BIT(1),            /* 1 = LEVEL 14 LOCK HELD    */ 02076000
*        4  CRALEV13 BIT(1),            /* 1 = LEVEL 13 LOCK HELD    */ 02077000
*        4  CRALEV12 BIT(1),            /* 1 = LEVEL 12 LOCK HELD    */ 02078000
*        4  CRALEV11 BIT(1),            /* 1 = LEVEL 11 LOCK HELD    */ 02079000
*        4  CRALEV10 BIT(1),            /* 1 = LEVEL 10 LOCK HELD    */ 02080000
*        4  CRALEV09 BIT(1),            /* 1 = LEVEL 9 LOCK HELD     */ 02081000
*        4  CRALEV08 BIT(1),            /* 1 = LEVEL 8 LOCK HELD     */ 02082000
*        4  CRALEV07 BIT(1),            /* 1 = LEVEL 7 LOCK HELD     */ 02083000
*        4  CRALEV06 BIT(1),            /* 1 = LEVEL 6 LOCK HELD     */ 02084000
*        4  CRALEV05 BIT(1),            /* 1 = LEVEL 5 LOCK HELD     */ 02085000
*        4  CRALEV04 BIT(1),            /* 1 = LEVEL 4 LOCK HELD     */ 02086000
*        4  CRALEV03 BIT(1),            /* 1 = LEVEL 3 LOCK HELD     */ 02087000
*        4  CRALEV02 BIT(1),            /* 1 = LEVEL 2 LOCK HELD     */ 02088000
*        4  CRALEV01 BIT(1),            /* 1 = LEVEL 1 LOCK HELD     */ 02089000
*      3 CRAL1PTR PTR(31),              /* PTR TO LEVEL 1 LOCK       */ 02090000
*      3 CRAL2PTR PTR(31),              /* PTR TO LEVEL 2 LOCK       */ 02091000
*      3 CRAL3PTR PTR(31),              /* PTR TO LEVEL 3 LOCK       */ 02092000
*      3 CRAL4PTR PTR(31),              /* PTR TO LEVEL 4 LOCK       */ 02093000
*      3 CRAL5PTR PTR(31),              /* PTR TO LEVEL 5 LOCK       */ 02094000
*      3 CRAL6PTR PTR(31),              /* PTR TO LEVEL 6 LOCK       */ 02095000
*      3 CRAL7PTR PTR(31),              /* PTR TO LEVEL 7 LOCK       */ 02096000
*      3 CRAL8PTR PTR(31),              /* PTR TO LEVEL 8 LOCK       */ 02097000
*      3 CRAL9PTR PTR(31),              /* PTR TO LEVEL 9 LOCK       */ 02098000
*      3 CRALAPTR PTR(31),              /* RESERVED                  */ 02099000
*/*                                                                  */ 02100000
*/*   VS1/VS2 EXTENSION                                              */ 02101000
*/*                                                                  */ 02102000
*     2  CRARPH CHAR(LENGTH(ISTRPH)),   /* RPH ASSOCIATED WITH     0757 02103000
*                                          THIS CRH                  */ 02104000
*     2  CRAPSS CHAR(LENGTH(ISTAPCRR)), /* PSS CRR                   */ 02105000
*     2  CRAPROCR CHAR(LENGTH(ISTZCRR)) BDY(DWORD), /* PROCESS CRR   */ 02106000
*     2  CRASVC CHAR(72) BDY(WORD),     /* SERVICE RTN CRA           */ 02107000
*        3  CRAASCRR CHAR(LENGTH(ISTASCRR)), /* CRR FOR SMS          */ 02108000
*        3  CRAHSIZ  PTR(31),           /* HEADER SIZE QUED SMS REQ  */ 02109000
*        3  CRAMASK  PTR(31),           /* PREFIX MASK QUED SMS REQ  */ 02110000
*        3  CRABUFA  FIXED(31),         /* BUFF QUE FOR FBQ ALLOCATION* 02111000
*           4 CRABFTBA BIT(1),          /* NO BUFFERS ALLOCATED YET   * 02112000
*     2  CRARSV01 PTR(31),              /* RESERVED                  */ 02113000
*     2  CRARSV02 PTR(31),              /* RESERVED                  */ 02114000
*     2  CRACHAIN PTR(31);              /* CHAIN FIELD USED TO QUEUE    02115000
*                                          CRA TO PREALLOCATE QUEUE     02116000
*                                          WHEN NOT IN USE           */ 02117000
*DCL CRALMS32 BIT(32) CONSTANT('80000000'X); /* 32ND LEVEL LOCK MASK */ 02118000
*DCL CRALMS31 BIT(32) CONSTANT('40000000'X); /* 31ST LEVEL LOCK MASK */ 02119000
*DCL CRALMS30 BIT(32) CONSTANT('20000000'X); /* 30TH LEVEL LOCK MASK */ 02120000
*DCL CRALMS29 BIT(32) CONSTANT('10000000'X); /* 29TH LEVEL LOCK MASK */ 02121000
*DCL CRALMS28 BIT(32) CONSTANT('08000000'X); /* 28TH LEVEL LOCK MASK */ 02122000
*DCL CRALMS27 BIT(32) CONSTANT('04000000'X); /* 27TH LEVEL LOCK MASK */ 02123000
*DCL CRALMS26 BIT(32) CONSTANT('02000000'X); /* 26TH LEVEL LOCK MASK */ 02124000
*DCL CRALMS25 BIT(32) CONSTANT('01000000'X); /* 25TH LEVEL LOCK MASK */ 02125000
*DCL CRALMS24 BIT(32) CONSTANT('00800000'X); /* 24TH LEVEL LOCK MASK */ 02126000
*DCL CRALMS23 BIT(32) CONSTANT('00400000'X); /* 23RD LEVEL LOCK MASK */ 02127000
*DCL CRALMS22 BIT(32) CONSTANT('00200000'X); /* 22ND LEVEL LOCK MASK */ 02128000
*DCL CRALMS21 BIT(32) CONSTANT('00100000'X); /* 21ST LEVEL LOCK MASK */ 02129000
*DCL CRALMS20 BIT(32) CONSTANT('00080000'X); /* 20TH LEVEL LOCK MASK */ 02130000
*DCL CRALMS19 BIT(32) CONSTANT('00040000'X); /* 19TH LEVEL LOCK MASK */ 02131000
*DCL CRALMS18 BIT(32) CONSTANT('00020000'X); /* 18TH LEVEL LOCK MASK */ 02132000
*DCL CRALMS17 BIT(32) CONSTANT('00010000'X); /* 17TH LEVEL LOCK MASK */ 02133000
*DCL CRALMS16 BIT(32) CONSTANT('00008000'X); /* 16TH LEVEL LOCK MASK */ 02134000
*DCL CRALMS15 BIT(32) CONSTANT('00004000'X); /* 15TH LEVEL LOCK MASK */ 02135000
*DCL CRALMS14 BIT(32) CONSTANT('00002000'X); /* 14TH LEVEL LOCK MASK */ 02136000
*DCL CRALMS13 BIT(32) CONSTANT('00001000'X); /* 13TH LEVEL LOCK MASK */ 02137000
*DCL CRALMS12 BIT(32) CONSTANT('00000800'X); /* 12TH LEVEL LOCK MASK */ 02138000
*DCL CRALMS11 BIT(32) CONSTANT('00000400'X); /* 11TH LEVEL LOCK MASK */ 02139000
*DCL CRALMS10 BIT(32) CONSTANT('00000200'X); /* 10TH LEVEL LOCK MASK */ 02140000
*DCL CRALMS09 BIT(32) CONSTANT('00000100'X); /* 9TH LEVEL LOCK MASK  */ 02141000
*DCL CRALMS08 BIT(32) CONSTANT('00000080'X); /* 8TH LEVEL LOCK MASK  */ 02142000
*DCL CRALMS07 BIT(32) CONSTANT('00000040'X); /* 7TH LEVEL LOCK MASK  */ 02143000
*DCL CRALMS06 BIT(32) CONSTANT('00000020'X); /* 6TH LEVEL LOCK MASK  */ 02144000
*DCL CRALMS05 BIT(32) CONSTANT('00000010'X); /* 5TH LEVEL LOCK MASK  */ 02145000
*DCL CRALMS04 BIT(32) CONSTANT('00000008'X); /* 4TH LEVEL LOCK MASK  */ 02146000
*DCL CRALMS03 BIT(32) CONSTANT('00000004'X); /* 3RD LEVEL LOCK MASK  */ 02147000
*DCL CRALMS02 BIT(32) CONSTANT('00000002'X); /* 2ND LEVEL LOCK MASK  */ 02148000
*DCL CRALMS01 BIT(32) CONSTANT('00000001'X); /* 1ST LEVEL LOCK MASK  */ 02149000
*DCL CRACRA   CHAR(4) CONSTANT('CRA ');      /* CHARACTER C.B. ID    */ 02150000
* /*  CONNECTION SERVICES COMPONENT RECOVERY RECORD                  */ 02151000
* /* COMPLETED DCR SOLUTIONS                                         */ 02152000
* /* 1H0540 APRIL 28, 1973 MB                                        */ 02153000
*/* ZTR4417 JUNE 20, 73 DNM */                                     0791 02154000
* DCL 1 ISTCNSTA BDY(WORD) BASED,       /* CONNECTION SERVICES     0791 02155000
*                                          COMPONENT RECOVERY RECORD */ 02156000
*     2  CNSTPFX CHAR(LENGTH(ISTPFCRR)), /* STANDARD PREFIX        0791 02157000
*                                          FOR CRR                   */ 02158000
*     2  CNSTFLDA CHAR(3),              /* TRACE FIELD A - HISTORY   */ 02159000
*        3  CNSMRINA BIT(1),            /* MASTER ENTERED            */ 02160000
*        3  CNSAUTHA BIT(1),            /* ABOUT TO CALL AUTHORI-  0791 02161000
*                                          SATION EXIT       ZTR4417 */ 02162000
*        3  CNSAQINA BIT(1),            /* ACQUIRE ENTERED           */ 02163000
*        3  CNSXREQA BIT(1),            /* ACQUIRE SATISFIED         */ 02164000
*        3  CNSQREQA BIT(1),            /* ACQUIRE QUEUED            */ 02165000
*        3  CNSRLINA BIT(1),            /* RELEASE ENTERED           */ 02166000
*        3  CNSDORLA BIT(1),            /* DOREL REALLOCATION      0791 02167000
*                                          ENTERED                   */ 02168000
*        3  CNSTRRLA BIT(1),            /* RELEASE OF ACTIVE       0791 02169000
*                                          CONNECTION                */ 02170000
*        3  CNSRQRLA BIT(1),            /* RELEASE QUEUED REQUEST    */ 02171000
*        3  CNSPSINA BIT(1),            /* PASS ENTERED              */ 02172000
*        3  CNSACINA BIT(1),            /* ACCEPT ENTERED            */ 02173000
*        3  CNSLGINA BIT(1),            /* LOGON ENTERED             */ 02174000
*        3  CNSGBINA BIT(1),            /* PREEMPT ENTERED           */ 02175000
*        3  CNSCLINA BIT(1),            /* CANCEL ENTERED            */ 02176000
*        3  CNSCLAQA BIT(1),            /* CANCEL ACQUIRES           */ 02177000
*        3  CNSTCONA BIT(1),            /* TCONNECT                  */ 02178000
*        3  CNSACONA BIT(1),            /* ACONNECT                  */ 02179000
*        3  CNSQUEUA BIT(1),            /* QUEUE                     */ 02180000
*        3  CNSSEARA BIT(1),            /* SEARCH Q                  */ 02181000
*        3  CNSGETSA BIT(1),            /* CONNECTION SERVICES     0791 02182000
*                                          GETSTORE                  */ 02183000
*        3  CNSFREEA BIT(1),            /* CONNECTION SERVICES     0791 02184000
*                                          FREESTORE                 */ 02185000
*        3  CNSACCTA BIT(1),            /* ABOUT TO CALL           0791 02186000
*                                          ACCOUNTING EXIT           */ 02187000
*        3  CNSLOG0A BIT(1),            /* LOGON 0                   */ 02188000
*        3  CNSRSV01 BIT(1),            /* RESERVED                  */ 02189000
*     2  CNSTFLDB CHAR(3),              /* TRACE FIELD B -         0791 02190000
*                                          CURRENT ACTIVITY          */ 02191000
*        3  CNSMRINB BIT(1),                                       0791 02192000
*        3  CNSAUTHB BIT(1),                                       0791 02193000
*        3  CNSAQINB BIT(1),                                       0791 02194000
*        3  CNSXREQB BIT(1),                                       0791 02195000
*        3  CNSQREQB BIT(1),                                       0791 02196000
*        3  CNSRLINB BIT(1),                                       0791 02197000
*        3  CNSDORLB BIT(1),                                       0791 02198000
*        3  CNSTRRLB BIT(1),                                       0791 02199000
*        3  CNSRQRLB BIT(1),                                       0791 02200000
*        3  CNSPSINB BIT(1),                                       0791 02201000
*        3  CNSACINB BIT(1),                                       0791 02202000
*        3  CNSLGINB BIT(1),                                       0791 02203000
*        3  CNSGBINB BIT(1),                                       0791 02204000
*        3  CNSCLINB BIT(1),                                       0791 02205000
*        3  CNSCLAQB BIT(1),                                       0791 02206000
*        3  CNSTCONB BIT(1),                                       0791 02207000
*        3  CNSACONB BIT(1),                                       0791 02208000
*        3  CNSQUEUB BIT(1),                                       0791 02209000
*        3  CNSSEARB BIT(1),                                       0791 02210000
*        3  CNSGETSB BIT(1),                                       0791 02211000
*        3  CNSFREEB BIT(1),                                       0791 02212000
*        3  CNSACCTB BIT(1),                                       0791 02213000
*        3  CNSLOG0B BIT(1),                                       0791 02214000
*        3  CNSRSV05 BIT(1);                                       0791 02215000
* /*     CRR FOR OPEN/CLOSE                                          */ 02216000
*/*  REVISIONS                                         002 03/27/75  */ 02217000
* DCL 1 ISTOCCRR BDY(WORD) BASED,       /* CRR FOR OPEN/CLOSE        */ 02218000
*     2  OCCCNS   CHAR(LENGTH(ISTCNSTA)), /* RESERVE SPACE FOR     0792 02219000
*                                          CONN. SVC'S AUDIT         */ 02220000
*     2  OCCAUDIT,                      /* AUDIT TRAIL FOR OPEN/CLOSE*/ 02221000
*        3  OCCNTRD CHAR(3),            /* LIST OF MODULES IN OPEN/     02222000
*                                          CLOSE ENTERED             */ 02223000
*           4  NOCCOC BIT(1),           /* INDICATES MODULE ISTOCCOC    02224000
*                                          ENTERED                   */ 02225000
*           4  NOCCCL BIT(1),           /* INDICATES MODULE ISTOCCCL    02226000
*                                          ENTERED                   */ 02227000
*           4  NOCCCH BIT(1),           /* INDICATES MODULE ISTOCCCH    02228000
*                                          ENTERED                   */ 02229000
*           4  NOCCSL BIT(1),           /* INDICATES MODULE ISTOCCSL    02230000
*                                          ENTERED                   */ 02231000
*           4  NOCCFO BIT(1),           /* INDICATES MODULE ISTOCCFO    02232000
*                                          ENTERED                   */ 02233000
*           4  NOCCFR BIT(1),           /* INDICATES MODULE ISTOCCFR    02234000
*                                          ENTERED                   */ 02235000
*           4  NOCCMD BIT(1),           /* INDICATES MODULE ISTOCCMD    02236000
*                                          ENTERED                   */ 02237000
*           4  NOCCFD BIT(1),           /* INDICATES MODULE ISTOCCFD    02238000
*                                          ENTERED                   */ 02239000
*           4  NOCCRD BIT(1),           /* INDICATES MODULE ISTOCCRD    02240000
*                                          ENTERED                   */ 02241000
*           4  NOCCSD BIT(1),           /* INDICATES MODULE ISTOCCSD    02242000
*                                          ENTERED                   */ 02243000
*           4  NOCCOD BIT(1),           /* INDICATES MODULE ISTOCCOD    02244000
*                                          ENTERED                   */ 02245000
*           4  NOCCOE BIT(1),           /* INDICATES MODULE ISTOCCOE    02246000
*                                          ENTERED                   */ 02247000
*           4  NOCCLD BIT(1),           /* INDICATES MODULE ISTOCCLD    02248000
*                                          ENTERED                   */ 02249000
*           4  NOCCOF BIT(1),           /* INDICATES MODULE ISTOCCOF    02250000
*                                          ENTERED                   */ 02251000
*           4  NOCCFB BIT(1),           /* INDICATES MODULE ISTOCCFB    02252000
*                                          ENTERED                   */ 02253000
*           4  NOCCRT BIT(1),           /* INDICATES MODULE ISTOCCRT    02254000
*                                          ENTERED                   */ 02255000
*           4  NOCCQU BIT(1),           /* INDICATES MODULE ISTOCCQU    02256000
*                                          ENTERED                   */ 02257000
*           4  NOCCRL BIT(1),           /* INDICATES MODULE ISTOCCRL    02258000
*                                          ENTERED                   */ 02259000
*           4  NOCCCC   BIT(1),         /* INDICATES MODULE ISTOCCCC    02260000
*                                          ENTERED                   */ 02261000
*           4  NOCCNV BIT(1),           /* INDICATES MODULE ISTOCCNV    02262000
*                                          ENTERED                   */ 02263000
*           4  NOCCCM BIT(1),           /* ISTOCCCM ENTERED          */ 02264000
*           4  NOCCCN BIT(1),           /* ISTOCCCN ENTERED          */ 02265000
*           4  NOCACX   BIT(1),                                    0792 02266000
*           4  NOCPOI BIT(1),           /* ISTCFCPO ENTERED OR       */ 02267000
*                                       /* ISTCFCPC ENTERED          */ 02268000
*        3  OCCCRT CHAR(3),             /* LIST OF OPEN/CLOSE      0792 02269000
*                                          MODULES RUNNING           */ 02270000
*           4  COCCOC BIT(1),           /* INDICATES MODULE ISTOCCOC    02271000
*                                          RUNNING                   */ 02272000
*           4  COCCCL BIT(1),           /* INDICATES MODULE ISTOCCCL    02273000
*                                          RUNNING                   */ 02274000
*           4  COCCCH BIT(1),           /* INDICATES MODULE ISTOCCCH    02275000
*                                          RUNNING                   */ 02276000
*           4  COCCSL BIT(1),           /* INDICATES MODULE ISTOCCSL    02277000
*                                          RUNNING                   */ 02278000
*           4  COCCFO BIT(1),           /* INDICATES MODULE ISTOCCFO    02279000
*                                          RUNNING                   */ 02280000
*           4  COCCFR BIT(1),           /* INDICATES MODULE ISTOCCFR    02281000
*                                          RUNNING                   */ 02282000
*           4  COCCMD BIT(1),           /* INDICATES MODULE ISTOCCMD    02283000
*                                          RUNNING                   */ 02284000
*           4  COCCFD BIT(1),           /* INDICATES  MODULE ISTOCCFD   02285000
*                                          RUNNING                   */ 02286000
*           4  COCCRD BIT(1),           /* INDICATES MODULE ISTOCCRD    02287000
*                                          RUNNING                   */ 02288000
*           4  COCCSD BIT(1),           /* INDICATES MODULE ISTOCCSD    02289000
*                                          RUNNING                   */ 02290000
*           4  COCCOD BIT(1),           /* INDICATES MODULE ISTOCCOD    02291000
*                                          RUNNING                   */ 02292000
*           4  COCCOE BIT(1),           /* INDICATES MODULE ISTOCCOE    02293000
*                                          RUNNING                   */ 02294000
*           4  COCCLD BIT(1),           /* INDICATES MODULE ISTOCCLD    02295000
*                                          RUNNING                   */ 02296000
*           4  COCCOF BIT(1),           /* INDICATES MODULE ISTOCCOF    02297000
*                                          RUNNING                   */ 02298000
*           4  COCCFB BIT(1),           /* INDICATES MODULE ISTOCCFB    02299000
*                                          RUNNING                   */ 02300000
*           4  COCCRT BIT(1),           /* INDICATES MODULE ISTOCCRT    02301000
*                                          RUNNING                   */ 02302000
*           4  COCCQU BIT(1),           /* INDICATES MODULE ISTOCCQU    02303000
*                                          RUNNING                   */ 02304000
*           4  COCCRL BIT(1),           /* INDICATES MODULE ISTOCCRL    02305000
*                                          RUNNING                   */ 02306000
*           4  COCCCC   BIT(1),         /* INDICATES MOD ISTOCCCC  0792 02307000
*                                          RUNNING                   */ 02308000
*           4  COCCNV BIT(1),           /* INDICATES MODULE ISTOCCNV    02309000
*                                          RUNNING                   */ 02310000
*           4  COCCCM BIT(1),           /* ISTOCCCM RUNNING          */ 02311000
*           4  COCCCN BIT(1),           /* ISTOCCCN RUNNING          */ 02312000
*           4  COCACX   BIT(1),                                    0792 02313000
*           4  COCPOI BIT(1);           /* ISTCFCPO RUNNING OR       */ 02314000
*                                       /* ISTCFCPC RUNNING          */ 02315000
*DCL TIDOCCCC BIT(8) CONSTANT('00'X);   /* THREAD ID FOR           0793 02316000
*                                          ISTOCCCC                  */ 02317000
*DCL TIDOCCCH BIT(8) CONSTANT('01'X);   /* THREAD ID FOR           0794 02318000
*                                          ISTOCCCH                  */ 02319000
*DCL TIDOCCOD BIT(8) CONSTANT('02'X);   /* THREAD ID FOR           0795 02320000
*                                          ISTOCCOD                  */ 02321000
*DCL TIDOCCCL BIT(8) CONSTANT('04'X);   /* THREAD ID FOR           0796 02322000
*                                          ISTOCCCL                  */ 02323000
*DCL TIDOCCOC BIT(8) CONSTANT('08'X);   /* THREAD ID FOR           0797 02324000
*                                          ISTOCCOC                  */ 02325000
*DCL TIDOCCRT BIT(8) CONSTANT('10'X);   /* THREAD ID FOR           0798 02326000
*                                          ISTOCCRT                  */ 02327000
*DCL TIDOCCQU BIT(8) CONSTANT('20'X);   /* THREAD ID FOR           0799 02328000
*                                          ISTOCCQU                  */ 02329000
*DCL TIDOCACX BIT(8) CONSTANT('30'X);   /* THREAD ID FOR           0800 02330000
*                                          ISTOCACX                  */ 02331000
*   DCL                                                            0801 02332000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 02333000
*   DCL                                                            0802 02334000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 02335000
*   GEN(PRINT ON);                                                 0803 02336000
*                                                                  0803 02337000
         PRINT ON                                                       02338000
*/* END OF TPEPILOG                                                  */ 02339000
*/* ATDSPLY   INVOKED.                                               */ 02340000
*/********************************************************************/ 02341000
*/* THE FOLLOWING ATBUILD INCLUSIONS HAVE BEEN MADE IN THIS          */ 02342000
*/* COMPILATION:                                                     */ 02343000
*/*             ISTPAB                                               */ 02344000
*/*             ISTCSP                                               */ 02345000
*/*             ISTICE                                               */ 02346000
*/*             ISTPROCD                                             */ 02347000
*/*             ISTDEVCH                                             */ 02348000
*/*             ISTBIND                                              */ 02349000
*/*             ISTCSL                                               */ 02350000
*/*             ISTNIB                                               */ 02351000
*/*             ISTOCW                                               */ 02352000
*/*             ISTLOK                                               */ 02353000
*/*             ISTRDT                                               */ 02354000
*/*             ISTRPH                                               */ 02355000
*/*             ISTDYPAB                                             */ 02356000
*/*             ISTATCVT                                             */ 02357000
*/*             ISTUECB                                              */ 02358000
*/*             ISTACDEB                                             */ 02359000
*/*             ISTLCCW                                              */ 02360000
*/*             ISTLCPB                                              */ 02361000
*/*             ISTZSAVE                                             */ 02362000
*/*             ISTPFCRR                                             */ 02363000
*/*             ISTCFCRR                                             */ 02364000
*/*             ISTZCRR                                              */ 02365000
*/*             ISTASCRR                                             */ 02366000
*/*             ISTAPCRR                                             */ 02367000
*/*             ISTCRA                                               */ 02368000
*/*             ISTCNSTA                                             */ 02369000
*/*             ISTOCCRR                                             */ 02370000
*/********************************************************************/ 02371000
*/* END OF ATDSPLY.                                                  */ 02372000
*                                                                  0804 02373000
*   END ISTOCCQU                                                   0804 02374000
*                                                                  0804 02375000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02376000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02377000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 02378000
*/*%INCLUDE SYSLIB  (IFGRPLVT)                                       */ 02379000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 02380000
*/*%INCLUDE SYSLIB  (IFGEXLST)                                       */ 02381000
*/*%INCLUDE SYSLIB  (IFGEXLVT)                                       */ 02382000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 02383000
*/*%INCLUDE SYSLIB  (IFGACBVT)                                       */ 02384000
*                                                                  0804 02385000
*       ;                                                          0804 02386000
@EL00001 DS    0H                                                  0804 02387000
@EF00001 DS    0H                                                  0804 02388000
@ER00001 BR    @14                                                 0804 02389000
@DATA    DS    0H                                                       02390000
@CH00032 DC    H'12'                                                    02391000
@DATD    DSECT                                                          02392000
         DS    0F                                                       02393000
ISTOCCQU CSECT                                                          02394000
         DS    0F                                                       02395000
@CF00061 DC    F'1'                                                     02396000
@CF00053 DC    F'4'                                                     02397000
@CF00059 DC    F'8'                                                     02398000
@CF01250 DC    XL4'80000000'                                            02399000
@CF01274 DC    XL4'08000000'                                            02400000
@CF03231 DC    XL4'00FFFFFF'                                            02401000
@DATD    DSECT                                                          02402000
         DS    0D                                                       02403000
CVTPTR   DS    A                                                        02404000
LCPBPTR  DS    A                                                        02405000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02406000
@ENDDATD EQU   *                                                        02407000
ISTOCCQU CSECT                                                          02408000
         DS    0F                                                       02409000
@SIZDATD DC    AL1(0)                                                   02410000
         DC    AL3(@ENDDATD-@DATD)                                      02411000
@CV03198 DC    V(ISTOCCUR)                                              02412000
         DS    0D                                                       02413000
FMZA0013 DS    FL4                                                      02414000
         ORG   FMZA0013                                                 02415000
@NM00088 DC    AL1(184)                                                 02416000
@NM00089 DC    AL3(0)                                                   02417000
         ORG   FMZA0013+4                                               02418000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02419000
@01      EQU   01                                                       02420000
@02      EQU   02                                                       02421000
@03      EQU   03                                                       02422000
@04      EQU   04                                                       02423000
@05      EQU   05                                                       02424000
@06      EQU   06                                                       02425000
@07      EQU   07                                                       02426000
@08      EQU   08                                                       02427000
@09      EQU   09                                                       02428000
@10      EQU   10                                                       02429000
@11      EQU   11                                                       02430000
@12      EQU   12                                                       02431000
@13      EQU   13                                                       02432000
@14      EQU   14                                                       02433000
@15      EQU   15                                                       02434000
RPHPTR   EQU   @01                                                      02435000
GPR00F   EQU   @00                                                      02436000
GPR00P   EQU   @00                                                      02437000
GPR01P   EQU   @01                                                      02438000
GPR02P   EQU   @02                                                      02439000
GPR03F   EQU   @03                                                      02440000
GPR03P   EQU   @03                                                      02441000
GPR04F   EQU   @04                                                      02442000
GPR04P   EQU   @04                                                      02443000
GPR05P   EQU   @05                                                      02444000
GPR06P   EQU   @06                                                      02445000
GPR07P   EQU   @07                                                      02446000
GPR08P   EQU   @08                                                      02447000
GPR09P   EQU   @09                                                      02448000
GPR10P   EQU   @10                                                      02449000
GPR11P   EQU   @11                                                      02450000
GPR12P   EQU   @12                                                      02451000
GPR13P   EQU   @13                                                      02452000
GPR14P   EQU   @14                                                      02453000
GPR15P   EQU   @15                                                      02454000
OCWPTR   EQU   @04                                                      02455000
UECBPTR  EQU   @08                                                      02456000
ICEPTR   EQU   @10                                                      02457000
CLGNPND  EQU   @11                                                      02458000
SVEAREA  EQU   @13                                                      02459000
CR14PTR  EQU   @14                                                      02460000
CRETCODE EQU   @15                                                      02461000
CMZK0006 EQU   @01                                                      02462000
CMZK0012 EQU   @01                                                      02463000
CBASEREG EQU   @12                                                      02464000
GPR01F   EQU   @01                                                      02465000
GPR02F   EQU   @02                                                      02466000
GPR05F   EQU   @05                                                      02467000
GPR06F   EQU   @06                                                      02468000
GPR07F   EQU   @07                                                      02469000
GPR08F   EQU   @08                                                      02470000
GPR09F   EQU   @09                                                      02471000
GPR10F   EQU   @10                                                      02472000
GPR11F   EQU   @11                                                      02473000
GPR12F   EQU   @12                                                      02474000
GPR13F   EQU   @13                                                      02475000
GPR14F   EQU   @14                                                      02476000
GPR15F   EQU   @15                                                      02477000
ATCLCPTR EQU   1032                                                     02478000
CVTMAP   EQU   0                                                        02479000
CVTDAR   EQU   CVTMAP+72                                                02480000
CVTFLGS1 EQU   CVTDAR                                                   02481000
CVTDCB   EQU   CVTMAP+116                                               02482000
CVTIERLC EQU   CVTMAP+144                                               02483000
CVTOPTA  EQU   CVTMAP+182                                               02484000
CVTOPTB  EQU   CVTMAP+183                                               02485000
CVTGTF   EQU   CVTMAP+236                                               02486000
CVTGTFST EQU   CVTGTF                                                   02487000
CVTGTFS  EQU   CVTGTFST                                                 02488000
CVTSTATE EQU   CVTGTFST                                                 02489000
CVTTMODE EQU   CVTGTFST                                                 02490000
CVTFORM  EQU   CVTGTFST                                                 02491000
CVTAQAVT EQU   CVTMAP+240                                               02492000
CVTTCMFG EQU   CVTAQAVT                                                 02493000
CVTVOLM2 EQU   CVTMAP+244                                               02494000
CVTTATA  EQU   CVTVOLM2                                                 02495000
CVTTSKS  EQU   CVTTATA                                                  02496000
CVTVOLF2 EQU   CVTTSKS                                                  02497000
CVTTAT   EQU   CVTTATA+1                                                02498000
CVTATER  EQU   CVTMAP+248                                               02499000
CVTEXT1  EQU   CVTMAP+252                                               02500000
CVTPURG  EQU   CVTMAP+260                                               02501000
CVTQMSG  EQU   CVTMAP+268                                               02502000
CVTDMSR  EQU   CVTMAP+272                                               02503000
CVTERPV  EQU   CVTMAP+316                                               02504000
CVTINTLA EQU   CVTMAP+320                                               02505000
CVTAPF   EQU   CVTMAP+324                                               02506000
CVTEXT2  EQU   CVTMAP+328                                               02507000
CVTHJES  EQU   CVTMAP+332                                               02508000
CVTPGSIA EQU   CVTMAP+348                                               02509000
CVTA1F1  EQU   CVTMAP+356                                               02510000
CVTSYSK  EQU   CVTMAP+357                                               02511000
CVTVOLM1 EQU   CVTMAP+380                                               02512000
CVTVOLF1 EQU   CVTVOLM1                                                 02513000
CVTATMCT EQU   CVTMAP+388                                               02514000
CVTXTNT1 EQU   0                                                        02515000
CVTXTNT2 EQU   0                                                        02516000
CVTDSSV  EQU   CVTXTNT2                                                 02517000
CVTFLGBT EQU   CVTXTNT2+5                                               02518000
CVTQID   EQU   CVTXTNT2+24                                              02519000
CVTSHS   EQU   CVTXTNT2+40                                              02520000
CVTRV400 EQU   CVTXTNT2+52                                              02521000
CVTRV409 EQU   CVTXTNT2+53                                              02522000
CVTATCVT EQU   CVTXTNT2+64                                              02523000
CVTRV429 EQU   CVTXTNT2+84                                              02524000
CVTRV438 EQU   CVTXTNT2+85                                              02525000
CVTRV457 EQU   CVTXTNT2+112                                             02526000
CVTRV466 EQU   CVTXTNT2+113                                             02527000
CVTFIX   EQU   0                                                        02528000
CVTRELNO EQU   CVTFIX+252                                               02529000
IFGRPL   EQU   0                                                        02530000
RPLCOMN  EQU   IFGRPL                                                   02531000
RPLIDWD  EQU   RPLCOMN                                                  02532000
RPLLEN   EQU   RPLIDWD+3                                                02533000
RPLECB   EQU   RPLCOMN+8                                                02534000
RPLFDBWD EQU   RPLCOMN+12                                               02535000
RPLFDBK  EQU   RPLFDBWD+1                                               02536000
RPLRTNCD EQU   RPLFDBK                                                  02537000
RPLCNDCD EQU   RPLFDBK+1                                                02538000
RPLCMPON EQU   RPLCNDCD                                                 02539000
RPLFDB2  EQU   RPLCMPON                                                 02540000
RPLERRCD EQU   RPLCNDCD+1                                               02541000
RPLFDB3  EQU   RPLERRCD                                                 02542000
RPLKEYLE EQU   RPLCOMN+16                                               02543000
RPLARG   EQU   RPLCOMN+36                                               02544000
RPLOPTCD EQU   RPLCOMN+40                                               02545000
RPLOPT1  EQU   RPLOPTCD                                                 02546000
RPLECBSW EQU   RPLOPT1                                                  02547000
RPLOPT2  EQU   RPLOPTCD+1                                               02548000
RPLADR   EQU   RPLOPT2                                                  02549000
RPLOPT3  EQU   RPLOPTCD+2                                               02550000
RPLOPT4  EQU   RPLOPTCD+3                                               02551000
RPLNXTRP EQU   RPLCOMN+44                                               02552000
RPLOPTC2 EQU   RPLCOMN+56                                               02553000
RPLOPT5  EQU   RPLOPTC2                                                 02554000
RPLWRTYP EQU   RPLOPT5                                                  02555000
RPLOPT6  EQU   RPLOPTC2+1                                               02556000
RPLUNTYP EQU   RPLOPT6                                                  02557000
RPLOPT7  EQU   RPLOPTC2+2                                               02558000
RPLCNOPT EQU   RPLOPT7                                                  02559000
RPLOPT8  EQU   RPLOPTC2+3                                               02560000
RPLRBAR  EQU   RPLCOMN+60                                               02561000
RPLAIXID EQU   RPLRBAR+2                                                02562000
RPLEXTDS EQU   RPLCOMN+68                                               02563000
RPLEXTD1 EQU   RPLEXTDS                                                 02564000
RPLVTEXT EQU   IFGRPL+76                                                02565000
RPLFDBK2 EQU   RPLVTEXT+12                                              02566000
RPLSSNSI EQU   RPLFDBK2                                                 02567000
RPLDSB   EQU   RPLSSNSI                                                 02568000
RPLDSB1  EQU   RPLDSB                                                   02569000
RPLSSEI  EQU   RPLDSB1                                                  02570000
RPLDSB2  EQU   RPLDSB+1                                                 02571000
RPLUSNSI EQU   RPLFDBK2+2                                               02572000
RPLOPTC3 EQU   RPLVTEXT+20                                              02573000
RPLOPT9  EQU   RPLOPTC3                                                 02574000
RPLOPT10 EQU   RPLOPTC3+1                                               02575000
RPLOPT11 EQU   RPLOPTC3+2                                               02576000
RPLQUIES EQU   RPLOPT11                                                 02577000
RPLSTART EQU   RPLOPT11                                                 02578000
RPLSTOP  EQU   RPLOPT11                                                 02579000
RPLOPT12 EQU   RPLOPTC3+3                                               02580000
RPLOSENS EQU   RPLVTEXT+24                                              02581000
RPLSSNSO EQU   RPLOSENS                                                 02582000
RPLSSEO  EQU   RPLSSNSO                                                 02583000
RPLOF16  EQU   0                                                        02584000
RPLRH3   EQU   RPLOF16                                                  02585000
RPLSRTYP EQU   RPLOF16+1                                                02586000
RPLSTYPE EQU   RPLSRTYP                                                 02587000
RPLRTYPE EQU   RPLSRTYP                                                 02588000
RPLCHN   EQU   RPLOF16+2                                                02589000
RPLVTFL1 EQU   RPLOF16+3                                                02590000
RPLVTFL2 EQU   RPLOF16+4                                                02591000
RPLPOSTV EQU   RPLVTFL2                                                 02592000
RPLRESP  EQU   RPLVTFL2                                                 02593000
RPLCNTRL EQU   RPLOF16+5                                                02594000
RPLCNTDF EQU   RPLCNTRL                                                 02595000
RPLCNTDC EQU   RPLCNTRL+1                                               02596000
RPLCNTSC EQU   RPLCNTRL+2                                               02597000
RPLOF60  EQU   0                                                        02598000
RPLOBSQ  EQU   RPLOF60+4                                                02599000
RPLIBSQ  EQU   RPLOF60+5                                                02600000
IFGEXLST EQU   0                                                        02601000
EXLCOMN  EQU   IFGEXLST                                                 02602000
EXLLEN   EQU   EXLCOMN+2                                                02603000
EXLEODF  EQU   EXLCOMN+5                                                02604000
EXLSYNF  EQU   EXLCOMN+10                                               02605000
EXLLERF  EQU   EXLCOMN+15                                               02606000
EXLSCIPF EQU   EXLCOMN+20                                               02607000
EXLLGNF  EQU   EXLCOMN+25                                               02608000
EXLLGNP  EQU   EXLCOMN+26                                               02609000
EXLJRNF  EQU   EXLCOMN+30                                               02610000
EXLOPNF  EQU   EXLCOMN+35                                               02611000
EXLVTEXT EQU   IFGEXLST+40                                              02612000
EXLNLGNF EQU   EXLVTEXT                                                 02613000
EXLRLRQF EQU   EXLVTEXT+5                                               02614000
EXLATTNF EQU   EXLVTEXT+15                                              02615000
EXLTPNDF EQU   EXLVTEXT+20                                              02616000
EXLDFAS  EQU   0                                                        02617000
EXLDFASF EQU   EXLDFAS                                                  02618000
EXLRESP  EQU   0                                                        02619000
EXLRESPF EQU   EXLRESP                                                  02620000
IFGEXLEF EQU   0                                                        02621000
EXLENTRY EQU   IFGEXLEF                                                 02622000
EXLFLAG  EQU   EXLENTRY                                                 02623000
EXLENFL  EQU   EXLFLAG                                                  02624000
EXLEXITP EQU   EXLENTRY+1                                               02625000
IFGACB   EQU   0                                                        02626000
ACBCOMN  EQU   IFGACB                                                   02627000
ACBLENG  EQU   ACBCOMN+2                                                02628000
ACBLENG2 EQU   ACBLENG                                                  02629000
ACBAMBL  EQU   ACBCOMN+4                                                02630000
ACBJWA   EQU   ACBAMBL                                                  02631000
ACBMACRF EQU   ACBCOMN+12                                               02632000
ACBMACR1 EQU   ACBMACRF                                                 02633000
ACBADR   EQU   ACBMACR1                                                 02634000
ACBCNV   EQU   ACBMACR1                                                 02635000
ACBMACR2 EQU   ACBMACRF+1                                               02636000
ACBBUFPL EQU   ACBCOMN+20                                               02637000
ACBMACR3 EQU   ACBBUFPL                                                 02638000
ACBRECFM EQU   ACBCOMN+24                                               02639000
ACBCCTYP EQU   ACBCOMN+25                                               02640000
ACBOPT   EQU   ACBCOMN+26                                               02641000
ACBDSORG EQU   ACBOPT                                                   02642000
ACBCROPS EQU   ACBDSORG                                                 02643000
ACBDVIND EQU   ACBDSORG                                                 02644000
ACBEXLST EQU   ACBCOMN+36                                               02645000
ACBUEL   EQU   ACBEXLST                                                 02646000
ACBDDNM  EQU   ACBCOMN+40                                               02647000
ACBAMETH EQU   ACBDDNM+3                                                02648000
ACBOFLGS EQU   ACBCOMN+48                                               02649000
ACBEXFG  EQU   ACBOFLGS                                                 02650000
ACBIOSFG EQU   ACBOFLGS                                                 02651000
ACBINFLG EQU   ACBCOMN+50                                               02652000
ACBVVIC  EQU   ACBINFLG                                                 02653000
ACBUJFCB EQU   ACBCOMN+52                                               02654000
ACBBLKSZ EQU   ACBCOMN+60                                               02655000
ACBVTEXT EQU   IFGACB+76                                                02656000
ISTPAB   EQU   0                                                        02657000
PABWQCHN EQU   ISTPAB                                                   02658000
PABWEQA  EQU   PABWQCHN                                                 02659000
PABCHAIN EQU   PABWQCHN+4                                               02660000
PABOFFST EQU   ISTPAB+8                                                 02661000
PABDVTA  EQU   ISTPAB+9                                                 02662000
PABRPHFG EQU   ISTPAB+12                                                02663000
PABFLAGS EQU   PABRPHFG                                                 02664000
PABAPYP  EQU   PABFLAGS                                                 02665000
PABERLCK EQU   PABFLAGS                                                 02666000
PABERRLK EQU   PABERLCK                                                 02667000
ISTCSP   EQU   0                                                        02668000
CSPIDX   EQU   ISTCSP                                                   02669000
CSPOPT   EQU   ISTCSP+2                                                 02670000
CSPOPT1  EQU   CSPOPT                                                   02671000
CSPOPT2  EQU   CSPOPT+1                                                 02672000
CSPDEST  EQU   ISTCSP+8                                                 02673000
CSPRSCE  EQU   ISTCSP+12                                                02674000
CSPCC    EQU   ISTCSP+20                                                02675000
ISTICE   EQU   0                                                        02676000
ICEOBJ   EQU   ISTICE+4                                                 02677000
ICESUBJQ EQU   ISTICE+8                                                 02678000
ICEDATA  EQU   ISTICE+20                                                02679000
ICEFLAGS EQU   ISTICE+28                                                02680000
ISTPROCD EQU   0                                                        02681000
PROPROC  EQU   ISTPROCD                                                 02682000
PROPROC1 EQU   PROPROC                                                  02683000
PROPROC2 EQU   PROPROC+1                                                02684000
PROPROC3 EQU   PROPROC+2                                                02685000
PROPROC4 EQU   PROPROC+3                                                02686000
PROPROCS EQU   0                                                        02687000
PROSETMS EQU   PROPROCS+1                                               02688000
PROSETM2 EQU   PROSETMS                                                 02689000
PROSETM3 EQU   PROSETMS+1                                               02690000
PROSETM4 EQU   PROSETMS+2                                               02691000
ISTDEVCH EQU   0                                                        02692000
DEVSHCH  EQU   ISTDEVCH                                                 02693000
DEVCHAR  EQU   DEVSHCH                                                  02694000
DEVTCODE EQU   ISTDEVCH+1                                               02695000
DEVFLAGS EQU   ISTDEVCH+3                                               02696000
DEVFCCTL EQU   DEVFLAGS                                                 02697000
DEVCHAR3 EQU   DEVFLAGS                                                 02698000
ISTBIND  EQU   0                                                        02699000
BINFMTY  EQU   ISTBIND                                                  02700000
BINPRIP  EQU   ISTBIND+3                                                02701000
BINSECP  EQU   ISTBIND+4                                                02702000
BINCMNP  EQU   ISTBIND+5                                                02703000
BINCMNP2 EQU   ISTBIND+6                                                02704000
ISTCSL   EQU   0                                                        02705000
CSLRDEF  EQU   ISTCSL                                                   02706000
CSLRDTE  EQU   CSLRDEF                                                  02707000
CSLNDEF  EQU   ISTCSL+4                                                 02708000
CSLNIB   EQU   CSLNDEF                                                  02709000
CSLDDEF  EQU   ISTCSL+8                                                 02710000
CSLDATA  EQU   CSLDDEF                                                  02711000
ISTNIB   EQU   0                                                        02712000
NIBFLGS  EQU   ISTNIB+40                                                02713000
NIBFLG1  EQU   NIBFLGS                                                  02714000
ISTOCW   EQU   0                                                        02715000
OCWRPL   EQU   ISTOCW+12                                                02716000
OCWACVT  EQU   ISTOCW+24                                                02717000
OCWCSL   EQU   ISTOCW+28                                                02718000
OCWLRDTE EQU   ISTOCW+40                                                02719000
OCWDRDTE EQU   OCWLRDTE                                                 02720000
OCWARDTE EQU   ISTOCW+48                                                02721000
OCWACDEB EQU   ISTOCW+64                                                02722000
OCWODRC  EQU   ISTOCW+92                                                02723000
OCWRC    EQU   OCWODRC                                                  02724000
OCWEC    EQU   OCWODRC+1                                                02725000
OCWSVCOD EQU   ISTOCW+94                                                02726000
OCWSWTA  EQU   ISTOCW+204                                               02727000
OCWSWTB  EQU   ISTOCW+205                                               02728000
OCWSWTC  EQU   ISTOCW+206                                               02729000
OCWSWTD  EQU   ISTOCW+207                                               02730000
OCWCSPL  EQU   ISTOCW+224                                               02731000
OCWSAVE1 EQU   ISTOCW+264                                               02732000
OCWR14SV EQU   ISTOCW+624                                               02733000
OCWSWTRD EQU   ISTOCW+730                                               02734000
OCWSWTE  EQU   ISTOCW+731                                               02735000
OCWLOCKS EQU   ISTOCW+740                                               02736000
OCWVLOCK EQU   OCWLOCKS                                                 02737000
OCWRLOCK EQU   OCWLOCKS                                                 02738000
OCWCID   EQU   ISTOCW+744                                               02739000
OCWSHPL  EQU   ISTOCW+784                                               02740000
OCWBIND  EQU   ISTOCW+796                                               02741000
OCWFLG1  EQU   ISTOCW+847                                               02742000
ISTLOK   EQU   0                                                        02743000
LOKCHN   EQU   ISTLOK+1                                                 02744000
LOKCHNG  EQU   LOKCHN                                                   02745000
@NM00070 EQU   LOKCHNG+2                                                02746000
ISTRPRE  EQU   0                                                        02747000
RPRNAME  EQU   ISTRPRE                                                  02748000
RPRCOMID EQU   ISTRPRE+8                                                02749000
RPRFLAGA EQU   ISTRPRE+21                                               02750000
RPRTIED  EQU   RPRFLAGA                                                 02751000
RPRLIVE  EQU   RPRFLAGA                                                 02752000
RPRFLAGB EQU   ISTRPRE+22                                               02753000
RPRCAUSE EQU   ISTRPRE+23                                               02754000
RPRLGONF EQU   ISTRPRE+28                                               02755000
RPRLGONB EQU   ISTRPRE+32                                               02756000
RPRFLAGD EQU   ISTRPRE+61                                               02757000
RPRFLAGC EQU   ISTRPRE+62                                               02758000
ISTRCPRE EQU   0                                                        02759000
RCPPMODE EQU   ISTRCPRE+91                                              02760000
RCPLGNIN EQU   ISTRCPRE+92                                              02761000
ISTRDT   EQU   0                                                        02762000
RDTPLEN  EQU   ISTRDT+72                                                02763000
RDTPRIOR EQU   RDTPLEN                                                  02764000
RDTFLAGB EQU   ISTRDT+91                                                02765000
RDTVYRPH EQU   ISTRDT+108                                               02766000
RDTSTCNT EQU   ISTRDT+112                                               02767000
ISTRAP   EQU   0                                                        02768000
RAPICELG EQU   ISTRAP+88                                                02769000
RAPFLG   EQU   ISTRAP+108                                               02770000
RAPABLGN EQU   RAPFLG                                                   02771000
RAPAQUI  EQU   RAPFLG                                                   02772000
RAPASLGI EQU   RAPFLG                                                   02773000
RAPATLGN EQU   RAPFLG                                                   02774000
RAPFLGB  EQU   ISTRAP+109                                               02775000
RAPFLGC  EQU   ISTRAP+110                                               02776000
ISTRLC   EQU   0                                                        02777000
RLCADR   EQU   ISTRLC+72                                                02778000
RLCFLAG  EQU   RLCADR                                                   02779000
ISTRRN   EQU   0                                                        02780000
RRNADR   EQU   ISTRRN+136                                               02781000
RRNFLAG  EQU   RRNADR                                                   02782000
RRNUCBAD EQU   RRNADR+1                                                 02783000
RRNRDF   EQU   ISTRRN+172                                               02784000
RRNRDFA  EQU   RRNRDF                                                   02785000
RRNRDFB  EQU   RRNRDF+1                                                 02786000
RRNCMF   EQU   ISTRRN+176                                               02787000
RRNCMFA  EQU   RRNCMF                                                   02788000
RRNCMFB  EQU   RRNCMF+1                                                 02789000
RRNCMFC  EQU   RRNCMF+2                                                 02790000
RRNCMFD  EQU   RRNCMF+3                                                 02791000
RRNNMDPD EQU   ISTRRN+192                                               02792000
RRNHPRE  EQU   ISTRRN+216                                               02793000
ISTRGP   EQU   0                                                        02794000
RGPFLG   EQU   ISTRGP+72                                                02795000
ISTRLN   EQU   0                                                        02796000
RLNADR   EQU   ISTRLN+72                                                02797000
RLNFLAG  EQU   RLNADR                                                   02798000
RLNUCBAD EQU   RLNADR+1                                                 02799000
RLNSTAT1 EQU   ISTRLN+86                                                02800000
RLNSTAT2 EQU   ISTRLN+87                                                02801000
RLNRDF   EQU   ISTRLN+88                                                02802000
RLNRDFA  EQU   RLNRDF                                                   02803000
RLNRACNT EQU   RLNRDFA                                                  02804000
RLNRDFB  EQU   RLNRDF+1                                                 02805000
RLNCRFLG EQU   ISTRLN+102                                               02806000
RLNLSCMD EQU   RLNCRFLG                                                 02807000
ISTRPT   EQU   0                                                        02808000
RPTLNCID EQU   ISTRPT+116                                               02809000
RPTDITT  EQU   ISTRPT+128                                               02810000
RPTFLAG1 EQU   ISTRPT+140                                               02811000
ISTRCL   EQU   0                                                        02812000
RCLADR   EQU   ISTRCL+72                                                02813000
RCLFLAG  EQU   RCLADR                                                   02814000
ISTRTR   EQU   0                                                        02815000
RTRADR   EQU   ISTRTR+124                                               02816000
RTRFLAG  EQU   RTRADR                                                   02817000
RTRRDFA  EQU   ISTRTR+136                                               02818000
RTRRAALL EQU   RTRRDFA                                                  02819000
RTRRDFB  EQU   ISTRTR+137                                               02820000
RTRRDFC  EQU   ISTRTR+138                                               02821000
RTRRDFD  EQU   ISTRTR+139                                               02822000
RTRRDFE  EQU   ISTRTR+140                                               02823000
RTRRDFF  EQU   ISTRTR+141                                               02824000
RTRCRFLG EQU   ISTRTR+143                                               02825000
RTRLSCMD EQU   RTRCRFLG                                                 02826000
RTRBSCID EQU   ISTRTR+188                                               02827000
ISTRIN   EQU   0                                                        02828000
RINDFD   EQU   ISTRIN+124                                               02829000
RINREMPO EQU   RINDFD                                                   02830000
RINNODEF EQU   RINDFD                                                   02831000
RINLDISC EQU   RINDFD                                                   02832000
RINNODID EQU   ISTRIN+125                                               02833000
RINRLDAF EQU   ISTRIN+126                                               02834000
RINREMOT EQU   ISTRIN+128                                               02835000
RINVPAB  EQU   ISTRIN+132                                               02836000
RINRPHCN EQU   ISTRIN+136                                               02837000
RINNCSPL EQU   ISTRIN+140                                               02838000
RINCNCNT EQU   ISTRIN+144                                               02839000
ISTRDS   EQU   0                                                        02840000
ISTDOT   EQU   0                                                        02841000
ISTRCC   EQU   0                                                        02842000
RCCFLAG  EQU   ISTRCC+73                                                02843000
RCCFLAGB EQU   ISTRCC+74                                                02844000
RCCSTAID EQU   ISTRCC+78                                                02845000
RCCID48  EQU   RCCSTAID+2                                               02846000
RCCCRFLG EQU   ISTRCC+108                                               02847000
ISTRLU   EQU   0                                                        02848000
RLUFLAG  EQU   ISTRLU+125                                               02849000
RLUCRFLG EQU   ISTRLU+126                                               02850000
RLUPACE  EQU   ISTRLU+132                                               02851000
RLUNCPPC EQU   ISTRLU+134                                               02852000
RLUUSSTB EQU   ISTRLU+140                                               02853000
RLUMODET EQU   ISTRLU+152                                               02854000
ISTRPX   EQU   0                                                        02855000
ISTRLX   EQU   0                                                        02856000
RLXFLAGA EQU   ISTRLX+76                                                02857000
ISTRSW   EQU   0                                                        02858000
ISTRDA   EQU   0                                                        02859000
RDAADR   EQU   ISTRDA+72                                                02860000
RDAFLAG  EQU   RDAADR                                                   02861000
RDAUCBAD EQU   RDAADR+1                                                 02862000
ISTRLS   EQU   0                                                        02863000
ISTDNT   EQU   0                                                        02864000
ISTGNT   EQU   0                                                        02865000
ISTPAT   EQU   0                                                        02866000
PATFLAGA EQU   ISTPAT+7                                                 02867000
ISTRPH   EQU   0                                                        02868000
RPHFLAGS EQU   ISTRPH+2                                                 02869000
RPHAPTYP EQU   RPHFLAGS                                                 02870000
RPHFSTLC EQU   RPHFLAGS                                                 02871000
RPHFLGB  EQU   ISTRPH+3                                                 02872000
RPHRPHA  EQU   ISTRPH+4                                                 02873000
RPHTSKID EQU   ISTRPH+8                                                 02874000
RPHRESMA EQU   ISTRPH+16                                                02875000
RPHWPFLG EQU   RPHRESMA                                                 02876000
RPHWEA   EQU   ISTRPH+24                                                02877000
RPHCSPA  EQU   RPHWEA                                                   02878000
RPHSRPRM EQU   ISTRPH+28                                                02879000
RPHCRR   EQU   ISTRPH+32                                                02880000
RPHPABQA EQU   ISTRPH+36                                                02881000
RPHWORK  EQU   ISTRPH+40                                                02882000
RPHSAVE1 EQU   RPHWORK                                                  02883000
RPHSBITS EQU   RPHSAVE1+1                                               02884000
ISTDYPAB EQU   0                                                        02885000
ISTATCVT EQU   0                                                        02886000
ATCCOM   EQU   ISTATCVT                                                 02887000
ATCSTAT  EQU   ATCCOM                                                   02888000
ATCSTAT1 EQU   ATCSTAT                                                  02889000
ATCSNHLT EQU   ATCSTAT1                                                 02890000
ATCQKHLT EQU   ATCSTAT1                                                 02891000
ATCSTFLG EQU   ATCSTAT+1                                                02892000
ATCPOFLG EQU   ATCSTAT+2                                                02893000
ATCSTAT4 EQU   ATCSTAT+3                                                02894000
ATCBPDA  EQU   ATCCOM+128                                               02895000
ATCIOTRC EQU   ATCCOM+140                                               02896000
ATCTHTRC EQU   ATCIOTRC                                                 02897000
ATCSMRQ  EQU   ATCCOM+180                                               02898000
ATCCSMR  EQU   ISTATCVT+296                                             02899000
ATCUEP   EQU   ISTATCVT+304                                             02900000
ATCSHRFG EQU   ISTATCVT+316                                             02901000
ATCHPGM  EQU   ISTATCVT+384                                             02902000
ATCAP33  EQU   ISTATCVT+444                                             02903000
ATCAP35  EQU   ISTATCVT+448                                             02904000
ATCAP36  EQU   ISTATCVT+452                                             02905000
ATCVOCLK EQU   ISTATCVT+468                                             02906000
ATCRDTLK EQU   ISTATCVT+472                                             02907000
ATCVLCNT EQU   ISTATCVT+772                                             02908000
ATCSOPD  EQU   ISTATCVT+792                                             02909000
ATCSIPD  EQU   ISTATCVT+800                                             02910000
ATCSECST EQU   ISTATCVT+812                                             02911000
ATCAOSM  EQU   ISTATCVT+912                                             02912000
ATCGSRBQ EQU   ATCAOSM+4                                                02913000
ATCGSRBG EQU   ATCGSRBQ                                                 02914000
ATCAP31  EQU   ATCAOSM+24                                               02915000
ATCAP34  EQU   ATCAOSM+32                                               02916000
ATCICAPP EQU   ATCAOSM+100                                              02917000
ATCLDAPP EQU   ATCAOSM+120                                              02918000
ATCDAPVT EQU   ATCAOSM+140                                              02919000
ATCAP37  EQU   ATCAOSM+264                                              02920000
ATCVTFLG EQU   ATCAOSM+392                                              02921000
ATCZFLAG EQU   ATCAOSM+588                                              02922000
ISTUECB  EQU   0                                                        02923000
UECID    EQU   ISTUECB                                                  02924000
UECLEN   EQU   ISTUECB+1                                                02925000
UECTYPE  EQU   ISTUECB+3                                                02926000
UECTSKID EQU   ISTUECB+8                                                02927000
UECPAB   EQU   ISTUECB+16                                               02928000
UECPLIST EQU   ISTUECB+32                                               02929000
UECACB   EQU   UECPLIST                                                 02930000
UECNDID  EQU   UECPLIST+4                                               02931000
UECTPNCD EQU   UECNDID                                                  02932000
UECREQTR EQU   UECPLIST+8                                               02933000
UECDLEN  EQU   UECPLIST+12                                              02934000
UECRSNCD EQU   UECDLEN                                                  02935000
UECSYMNM EQU   ISTUECB+52                                               02936000
UECDVTPT EQU   ISTUECB+68                                               02937000
ISTACDEB EQU   0                                                        02938000
ACDVTPRX EQU   ISTACDEB                                                 02939000
ACDTSKID EQU   ACDVTPRX+8                                               02940000
ACDDBPFX EQU   ISTACDEB+16                                              02941000
ACDTBLOF EQU   ACDDBPFX+6                                               02942000
ACDBASIC EQU   ISTACDEB+24                                              02943000
ACDTCBAD EQU   ACDBASIC                                                 02944000
ACDNMSUB EQU   ACDTCBAD                                                 02945000
ACDDEBAD EQU   ACDBASIC+4                                               02946000
ACDUSRPG EQU   ACDBASIC+16                                              02947000
ACDACBAD EQU   ACDBASIC+24                                              02948000
ACDACB   EQU   ACDACBAD+1                                               02949000
ACDAPPAD EQU   ACDBASIC+28                                              02950000
ACDVTAM  EQU   ISTACDEB+56                                              02951000
ACDSSFLG EQU   ACDVTAM+80                                               02952000
ACDAPDAT EQU   ACDVTAM+83                                               02953000
C14SVPTR EQU   0                                                        02954000
C14SAVE  EQU   0                                                        02955000
CDATA    EQU   0                                                        02956000
DATALN   EQU   CDATA+8                                                  02957000
ISTLCCW  EQU   0                                                        02958000
LCCWOP   EQU   ISTLCCW                                                  02959000
LCCWRWOP EQU   LCCWOP                                                   02960000
LCCWCTL  EQU   LCCWRWOP                                                 02961000
LCCWFLAG EQU   ISTLCCW+1                                                02962000
LCCWLSI  EQU   LCCWFLAG                                                 02963000
ISTLCPB  EQU   0                                                        02964000
LCPREQTG EQU   ISTLCPB+2                                                02965000
LCPFLAGS EQU   LCPREQTG                                                 02966000
LCPZF001 EQU   LCPFLAGS                                                 02967000
LCPZRT02 EQU   LCPZF001                                                 02968000
LCPZF002 EQU   LCPFLAGS                                                 02969000
LCPZRT03 EQU   LCPZF002                                                 02970000
LCPZF003 EQU   LCPFLAGS                                                 02971000
LCPZRT04 EQU   LCPZF003                                                 02972000
LCPZF004 EQU   LCPFLAGS                                                 02973000
LCPZRT05 EQU   LCPZF004                                                 02974000
LCPZRT06 EQU   LCPFLAGS                                                 02975000
LCPZRT07 EQU   LCPFLAGS                                                 02976000
LCPMNRCD EQU   LCPREQTG+1                                               02977000
LCPZRT08 EQU   LCPMNRCD                                                 02978000
LCPZRT09 EQU   LCPMNRCD                                                 02979000
LCPCHAIN EQU   ISTLCPB+4                                                02980000
LCPCHAI1 EQU   LCPCHAIN                                                 02981000
LCPRUCNT EQU   ISTLCPB+8                                                02982000
LCPFLAG2 EQU   ISTLCPB+9                                                02983000
LCPTLBPI EQU   LCPFLAG2                                                 02984000
LCPFID0  EQU   LCPFLAG2                                                 02985000
LCPSEQ   EQU   ISTLCPB+10                                               02986000
LCPCID   EQU   ISTLCPB+16                                               02987000
LCPFDBA  EQU   ISTLCPB+24                                               02988000
LCPFLG1  EQU   ISTLCPB+37                                               02989000
LCPFLCCW EQU   ISTLCPB+40                                               02990000
LCPLCCW  EQU   ISTLCPB+48                                               02991000
LCPPABA  EQU   LCPLCCW+4                                                02992000
LCPRPHA  EQU   LCPPABA                                                  02993000
ISTZSAVE EQU   0                                                        02994000
ZSAZSVBC EQU   ISTZSAVE                                                 02995000
ZSAZSVMS EQU   ZSAZSVBC                                                 02996000
ISTPFCRR EQU   0                                                        02997000
PFCCRR   EQU   ISTPFCRR                                                 02998000
PFCCRRID EQU   PFCCRR                                                   02999000
PFCCRRLN EQU   PFCCRR+2                                                 03000000
PFCHDR   EQU   ISTPFCRR+4                                               03001000
PFCCRRO  EQU   PFCHDR                                                   03002000
PFCFRRO  EQU   PFCHDR+4                                                 03003000
PFCFTA   EQU   ISTPFCRR+12                                              03004000
ISTCFCRR EQU   0                                                        03005000
CFCAUDIT EQU   ISTCFCRR                                                 03006000
CFCNTRD  EQU   CFCAUDIT                                                 03007000
CFCCRT   EQU   CFCAUDIT+1                                               03008000
ISTZCRR  EQU   0                                                        03009000
ZCRCRR   EQU   ISTZCRR                                                  03010000
ZCRFLGS1 EQU   ISTZCRR+12                                               03011000
ZCRFLGS2 EQU   ISTZCRR+13                                               03012000
ZCRSWFLD EQU   ISTZCRR+14                                               03013000
ZCRENDSH EQU   ZCRSWFLD                                                 03014000
ZCRNDLCP EQU   ZCRSWFLD                                                 03015000
ZCRRESET EQU   ZCRSWFLD                                                 03016000
ZCRFLGS3 EQU   ISTZCRR+15                                               03017000
ZCRGENSW EQU   ISTZCRR+16                                               03018000
ZCRPFLGS EQU   ISTZCRR+17                                               03019000
ZCRIBPR  EQU   ISTZCRR+18                                               03020000
ZCRSCPSW EQU   ISTZCRR+19                                               03021000
ZCRPARMS EQU   ISTZCRR+24                                               03022000
ZCRFBPTR EQU   ZCRPARMS                                                 03023000
ZCRDFRDA EQU   ZCRPARMS+10                                              03024000
ZCRPCOD1 EQU   ZCRPARMS+12                                              03025000
ZCRPLSBF EQU   ZCRPCOD1                                                 03026000
ZCRPCOD2 EQU   ZCRPARMS+13                                              03027000
ZCRSVRTN EQU   ISTZCRR+56                                               03028000
ZCRWKARA EQU   ISTZCRR+156                                              03029000
ZCRCIDSV EQU   ISTZCRR+192                                              03030000
ZCRAUDIT EQU   ISTZCRR+440                                              03031000
ZCRENTER EQU   ZCRAUDIT+5                                               03032000
ZCRLCPB  EQU   ISTZCRR+480                                              03033000
ZCRRHRU  EQU   ZCRLCPB                                                  03034000
ISTASCRR EQU   0                                                        03035000
ASCFLAGS EQU   ISTASCRR+16                                              03036000
ASCFLG1  EQU   ASCFLAGS                                                 03037000
ASCFLG2  EQU   ASCFLAGS+2                                               03038000
ASCFLG3  EQU   ASCFLAGS+4                                               03039000
ASCUSRGS EQU   ISTASCRR+28                                              03040000
ISTAPCRR EQU   0                                                        03041000
APCATFLG EQU   ISTAPCRR+16                                              03042000
APCRFLG  EQU   ISTAPCRR+18                                              03043000
APCSAVE  EQU   ISTAPCRR+44                                              03044000
APCCOMF  EQU   ISTAPCRR+116                                             03045000
APCCOMF1 EQU   APCCOMF                                                  03046000
APC31FLG EQU   ISTAPCRR+132                                             03047000
APC52FLG EQU   ISTAPCRR+133                                             03048000
APC53FLG EQU   ISTAPCRR+134                                             03049000
APC54FLG EQU   ISTAPCRR+135                                             03050000
APC57FLG EQU   ISTAPCRR+136                                             03051000
ISTCRA   EQU   0                                                        03052000
CRABASIC EQU   ISTCRA                                                   03053000
CRAHDR   EQU   CRABASIC                                                 03054000
CRACRR   EQU   CRAHDR                                                   03055000
CRAFRR   EQU   CRAHDR+4                                                 03056000
CRALKACT EQU   CRABASIC+8                                               03057000
CRAL2PTR EQU   CRABASIC+16                                              03058000
CRAL3PTR EQU   CRABASIC+20                                              03059000
CRAPROCR EQU   ISTCRA+312                                               03060000
CRASVC   EQU   ISTCRA+848                                               03061000
CRABUFA  EQU   CRASVC+68                                                03062000
ISTCNSTA EQU   0                                                        03063000
CNSTFLDA EQU   ISTCNSTA+16                                              03064000
CNSTFLDB EQU   ISTCNSTA+19                                              03065000
ISTOCCRR EQU   0                                                        03066000
OCCAUDIT EQU   ISTOCCRR+22                                              03067000
OCCNTRD  EQU   OCCAUDIT                                                 03068000
NOCCQU   EQU   OCCNTRD+2                                                03069000
OCCCRT   EQU   OCCAUDIT+3                                               03070000
COCCQU   EQU   OCCCRT+2                                                 03071000
FMZL0013 EQU   0                                                        03072000
FMZL0037 EQU   0                                                        03073000
ISTAPC37 EQU   0                                                        03074000
FMZL0053 EQU   0                                                        03075000
FMZL0058 EQU   0                                                        03076000
FMZL0063 EQU   0                                                        03077000
FMZL0073 EQU   0                                                        03078000
ISTACB   EQU   0                                                        03079000
ISTAPC34 EQU   0                                                        03080000
ISTRPL   EQU   0                                                        03081000
CVTS01   EQU   CVTPGSIA                                                 03082000
CVTLPDIA EQU   CVTS01+12                                                03083000
CVTDIRST EQU   CVTLPDIA                                                 03084000
CVTSLIDA EQU   CVTS01+24                                                03085000
CVTCTLFG EQU   CVTS01+50                                                03086000
CVTRV210 EQU   CVTS01+424                                               03087000
CVTRV219 EQU   CVTS01+425                                               03088000
CVTRV228 EQU   CVTS01+426                                               03089000
CVTRV237 EQU   CVTS01+427                                               03090000
CVTMFRTR EQU   CVTS01+452                                               03091000
CVTRV262 EQU   CVTS01+468                                               03092000
CVTRV271 EQU   CVTS01+469                                               03093000
CVTRV280 EQU   CVTS01+470                                               03094000
CVTRV289 EQU   CVTS01+471                                               03095000
CVTGSDA  EQU   CVTS01+600                                               03096000
LCPZTIE  EQU   LCPCID                                                   03097000
LCPZSNAM EQU   LCPZTIE+8                                                03098000
RTRDNCBA EQU   ISTRTR+40                                                03099000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03100000
LCPZTRV4 EQU   LCPZSNAM+4                                               03101000
LCPZTRV1 EQU   LCPZSNAM                                                 03102000
LCPZSNA  EQU   LCPZTIE+4                                                03103000
LCPZFMCA EQU   LCPZTIE                                                  03104000
CVTRV628 EQU   CVTS01+728                                               03105000
CVTRV627 EQU   CVTS01+724                                               03106000
CVTRV626 EQU   CVTS01+720                                               03107000
CVTRV625 EQU   CVTS01+716                                               03108000
CVTRV624 EQU   CVTS01+712                                               03109000
CVTRV623 EQU   CVTS01+708                                               03110000
CVTRV622 EQU   CVTS01+704                                               03111000
CVTRV621 EQU   CVTS01+700                                               03112000
CVTRV620 EQU   CVTS01+696                                               03113000
CVTRV619 EQU   CVTS01+692                                               03114000
CVTRV618 EQU   CVTS01+688                                               03115000
CVTRV617 EQU   CVTS01+684                                               03116000
CVTRV616 EQU   CVTS01+680                                               03117000
CVTRV615 EQU   CVTS01+676                                               03118000
CVTRV614 EQU   CVTS01+672                                               03119000
CVTRV613 EQU   CVTS01+668                                               03120000
CVTRV612 EQU   CVTS01+664                                               03121000
CVTRV611 EQU   CVTS01+660                                               03122000
CVTEVERM EQU   CVTS01+656                                               03123000
CVTIRM   EQU   CVTS01+652                                               03124000
CVTCGK   EQU   CVTS01+648                                               03125000
CVTRAC   EQU   CVTS01+644                                               03126000
CVTRV606 EQU   CVTS01+640                                               03127000
CVTRV605 EQU   CVTS01+636                                               03128000
CVTRV604 EQU   CVTS01+632                                               03129000
CVTEFF02 EQU   CVTS01+628                                               03130000
CVTCBBR  EQU   CVTS01+624                                               03131000
CVTSSCR  EQU   CVTS01+620                                               03132000
CVTEVENT EQU   CVTS01+616                                               03133000
CVTCRCA  EQU   CVTS01+612                                               03134000
CVTTPIO  EQU   CVTS01+608                                               03135000
CVTADV   EQU   CVTS01+604                                               03136000
CVTGSDAB EQU   CVTGSDA                                                  03137000
CVTQV3   EQU   CVTS01+596                                               03138000
CVTQV2   EQU   CVTS01+592                                               03139000
CVTQV1   EQU   CVTS01+588                                               03140000
CVTRPT   EQU   CVTS01+584                                               03141000
CVTSSRB  EQU   CVTS01+580                                               03142000
CVTCSDRL EQU   CVTS01+576                                               03143000
CVTEXP1  EQU   CVTS01+572                                               03144000
CVTRMPMT EQU   CVTS01+568                                               03145000
CVTRMPTT EQU   CVTS01+564                                               03146000
CVTVPSA  EQU   CVTS01+560                                               03147000
CVTVSTOP EQU   CVTS01+556                                               03148000
CVTGTFR8 EQU   CVTS01+552                                               03149000
CVTQUIT  EQU   CVTS01+548                                               03150000
CVTVACR  EQU   CVTS01+544                                               03151000
CVTWTCB  EQU   CVTS01+540                                               03152000
CVTSTPRS EQU   CVTS01+536                                               03153000
CVT0PT02 EQU   CVTS01+532                                               03154000
CVTDARCM EQU   CVTS01+528                                               03155000
CVTIRECM EQU   CVTS01+524                                               03156000
CVTJRECM EQU   CVTS01+520                                               03157000
CVTVEMS0 EQU   CVTS01+516                                               03158000
CVTSPFRR EQU   CVTS01+512                                               03159000
CVTRLSTG EQU   CVTS01+508                                               03160000
CVT0TC0A EQU   CVTS01+504                                               03161000
CVTGMBR  EQU   CVTS01+500                                               03162000
CVTLFRM  EQU   CVTS01+496                                               03163000
CVTRMBR  EQU   CVTS01+492                                               03164000
CVTVIOP  EQU   CVTS01+488                                               03165000
CVTRV307 EQU   CVTS01+486                                               03166000
CVTRV306 EQU   CVTS01+484                                               03167000
CVTRV305 EQU   CVTS01+482                                               03168000
CVTRV304 EQU   CVTS01+480                                               03169000
CVTRV303 EQU   CVTS01+478                                               03170000
CVTRV302 EQU   CVTS01+476                                               03171000
CVTTRCA  EQU   CVTS01+472                                               03172000
CVTRV297 EQU   CVTRV289                                                 03173000
CVTRV296 EQU   CVTRV289                                                 03174000
CVTRV295 EQU   CVTRV289                                                 03175000
CVTRV294 EQU   CVTRV289                                                 03176000
CVTRV293 EQU   CVTRV289                                                 03177000
CVTRV292 EQU   CVTRV289                                                 03178000
CVTRV291 EQU   CVTRV289                                                 03179000
CVTRV290 EQU   CVTRV289                                                 03180000
CVTRV288 EQU   CVTRV280                                                 03181000
CVTRV287 EQU   CVTRV280                                                 03182000
CVTRV286 EQU   CVTRV280                                                 03183000
CVTRV285 EQU   CVTRV280                                                 03184000
CVTRV284 EQU   CVTRV280                                                 03185000
CVTRV283 EQU   CVTRV280                                                 03186000
CVTRV282 EQU   CVTRV280                                                 03187000
CVTRV281 EQU   CVTRV280                                                 03188000
CVTRV279 EQU   CVTRV271                                                 03189000
CVTRV278 EQU   CVTRV271                                                 03190000
CVTRV277 EQU   CVTRV271                                                 03191000
CVTRV276 EQU   CVTRV271                                                 03192000
CVTRV275 EQU   CVTRV271                                                 03193000
CVTRV274 EQU   CVTRV271                                                 03194000
CVTRV273 EQU   CVTRV271                                                 03195000
CVTRV272 EQU   CVTRV271                                                 03196000
CVTRV270 EQU   CVTRV262                                                 03197000
CVTRV269 EQU   CVTRV262                                                 03198000
CVTRV268 EQU   CVTRV262                                                 03199000
CVTRV267 EQU   CVTRV262                                                 03200000
CVTRV266 EQU   CVTRV262                                                 03201000
CVTRV265 EQU   CVTRV262                                                 03202000
CVTRV264 EQU   CVTRV262                                                 03203000
CVTRV263 EQU   CVTRV262                                                 03204000
CVTVFP   EQU   CVTS01+464                                               03205000
CVTVSI   EQU   CVTS01+460                                               03206000
CVTVPSIB EQU   CVTS01+456                                               03207000
CVTMFACT EQU   CVTMFRTR                                                 03208000
CVTMFCTL EQU   CVTS01+448                                               03209000
CVTPVBP  EQU   CVTS01+444                                               03210000
CVTPWI   EQU   CVTS01+440                                               03211000
CVTRV254 EQU   CVTS01+438                                               03212000
CVTRV253 EQU   CVTS01+436                                               03213000
CVTRV252 EQU   CVTS01+434                                               03214000
CVTRV251 EQU   CVTS01+433                                               03215000
CVTRV250 EQU   CVTS01+432                                               03216000
CVTRV249 EQU   CVTS01+431                                               03217000
CVTRV248 EQU   CVTS01+430                                               03218000
CVTRV247 EQU   CVTS01+429                                               03219000
CVTRV246 EQU   CVTS01+428                                               03220000
CVTRV245 EQU   CVTRV237                                                 03221000
CVTRV244 EQU   CVTRV237                                                 03222000
CVTRV243 EQU   CVTRV237                                                 03223000
CVTRV242 EQU   CVTRV237                                                 03224000
CVTRV241 EQU   CVTRV237                                                 03225000
CVTRV240 EQU   CVTRV237                                                 03226000
CVTRV239 EQU   CVTRV237                                                 03227000
CVTRV238 EQU   CVTRV237                                                 03228000
CVTRV236 EQU   CVTRV228                                                 03229000
CVTRV235 EQU   CVTRV228                                                 03230000
CVTRV234 EQU   CVTRV228                                                 03231000
CVTRV233 EQU   CVTRV228                                                 03232000
CVTRV232 EQU   CVTRV228                                                 03233000
CVTRV231 EQU   CVTRV228                                                 03234000
CVTRV230 EQU   CVTRV228                                                 03235000
CVTRV229 EQU   CVTRV228                                                 03236000
CVTRV227 EQU   CVTRV219                                                 03237000
CVTRV226 EQU   CVTRV219                                                 03238000
CVTRV225 EQU   CVTRV219                                                 03239000
CVTRV224 EQU   CVTRV219                                                 03240000
CVTRV223 EQU   CVTRV219                                                 03241000
CVTRV222 EQU   CVTRV219                                                 03242000
CVTRV221 EQU   CVTRV219                                                 03243000
CVTRV220 EQU   CVTRV219                                                 03244000
CVTRV218 EQU   CVTRV210                                                 03245000
CVTRV217 EQU   CVTRV210                                                 03246000
CVTRV216 EQU   CVTRV210                                                 03247000
CVTRV215 EQU   CVTRV210                                                 03248000
CVTRV214 EQU   CVTRV210                                                 03249000
CVTRV213 EQU   CVTRV210                                                 03250000
CVTRV212 EQU   CVTRV210                                                 03251000
CVTRV211 EQU   CVTRV210                                                 03252000
CVTLCCAT EQU   CVTS01+420                                               03253000
CVTPCCAT EQU   CVTS01+416                                               03254000
CVTIPCRP EQU   CVTS01+412                                               03255000
CVTIPCRI EQU   CVTS01+408                                               03256000
CVTIPCDS EQU   CVTS01+404                                               03257000
CVTAIDVT EQU   CVTS01+400                                               03258000
CVTSSAP  EQU   CVTS01+396                                               03259000
CVTEHCIR EQU   CVTS01+392                                               03260000
CVTEHDEF EQU   CVTS01+388                                               03261000
CVTDAIR  EQU   CVTS01+384                                               03262000
CVTPERFM EQU   CVTS01+380                                               03263000
CVT044R2 EQU   CVTS01+376                                               03264000
CVTFETCH EQU   CVTS01+372                                               03265000
CVTRSTWD EQU   CVTS01+368                                               03266000
CVTSPOST EQU   CVTS01+364                                               03267000
CVTIOBP  EQU   CVTS01+360                                               03268000
CVTASMVT EQU   CVTS01+356                                               03269000
CVTRECRQ EQU   CVTS01+352                                               03270000
CVTWSAC  EQU   CVTS01+348                                               03271000
CVTRV149 EQU   CVTS01+344                                               03272000
CVTWSAL  EQU   CVTS01+340                                               03273000
CVTSPSA  EQU   CVTS01+336                                               03274000
CVTGLMN  EQU   CVTS01+332                                               03275000
CVTVEAC0 EQU   CVTS01+328                                               03276000
CVT062R1 EQU   CVTS01+324                                               03277000
CVTRPOST EQU   CVTS01+320                                               03278000
CVTDQIQE EQU   CVTS01+316                                               03279000
CVTCSD   EQU   CVTS01+312                                               03280000
CVTLKRMA EQU   CVTS01+308                                               03281000
CVTRSPIE EQU   CVTS01+304                                               03282000
CVTRENQ  EQU   CVTS01+300                                               03283000
CVTLQCB  EQU   CVTS01+296                                               03284000
CVTFQCB  EQU   CVTS01+292                                               03285000
CVTQCS01 EQU   CVTS01+288                                               03286000
CVTAPFT  EQU   CVTS01+284                                               03287000
CVTPARRL EQU   CVTS01+280                                               03288000
CVTVWAIT EQU   CVTS01+276                                               03289000
CVTGSPL  EQU   CVTS01+272                                               03290000
CVTLSMQ  EQU   CVTS01+268                                               03291000
CVTGSMQ  EQU   CVTS01+264                                               03292000
CVTEXPRO EQU   CVTS01+260                                               03293000
CVTOPCTP EQU   CVTS01+256                                               03294000
CVTSIC   EQU   CVTS01+252                                               03295000
CVTTPIOS EQU   CVTS01+248                                               03296000
CVTRTMS  EQU   CVTS01+244                                               03297000
CVTSDBF  EQU   CVTS01+240                                               03298000
CVTSCBP  EQU   CVTS01+236                                               03299000
CVTSDMP  EQU   CVTS01+232                                               03300000
CVTSV60  EQU   CVTS01+228                                               03301000
CVTRTMCT EQU   CVTS01+224                                               03302000
CVTASCBL EQU   CVTS01+220                                               03303000
CVTASCBH EQU   CVTS01+216                                               03304000
CVTGDA   EQU   CVTS01+212                                               03305000
CVTASVT  EQU   CVTS01+208                                               03306000
CVTVVMDI EQU   CVTS01+204                                               03307000
CVTAQTOP EQU   CVTS01+200                                               03308000
CVTIOSCS EQU   CVTS01+196                                               03309000
CVTSDRM  EQU   CVTS01+192                                               03310000
CVTOPTE  EQU   CVTS01+188                                               03311000
CVTSTXU  EQU   CVTS01+184                                               03312000
CVTQUIS  EQU   CVTS01+180                                               03313000
CVTPARS  EQU   CVTS01+176                                               03314000
CVTS1EE  EQU   CVTS01+172                                               03315000
CVTFRAS  EQU   CVTS01+168                                               03316000
CVTQSAS  EQU   CVTS01+164                                               03317000
CVTCRAS  EQU   CVTS01+160                                               03318000
CVTCRMN  EQU   CVTS01+156                                               03319000
CVTDELCP EQU   CVTS01+152                                               03320000
CVTFRECL EQU   CVTS01+148                                               03321000
CVTGETCL EQU   CVTS01+144                                               03322000
CVTBLDCP EQU   CVTS01+140                                               03323000
CVTAUTHL EQU   CVTS01+136                                               03324000
CVTSCAN  EQU   CVTS01+132                                               03325000
CVTRV144 EQU   CVTS01+130                                               03326000
CVTMAXMP EQU   CVTS01+128                                               03327000
CVTSTCK  EQU   CVTS01+124                                               03328000
CVTRV139 EQU   CVTS01+123                                               03329000
CVTDSSAC EQU   CVTS01+122                                               03330000
CVTRV513 EQU   CVTS01+121                                               03331000
CVTIOSPL EQU   CVTS01+120                                               03332000
CVTPTGT  EQU   CVTS01+116                                               03333000
CVTCSPIE EQU   CVTS01+112                                               03334000
CVTSMFEX EQU   CVTS01+108                                               03335000
CVTOLT0A EQU   CVTS01+104                                               03336000
CVTSRBRT EQU   CVTS01+100                                               03337000
CVTPUTL  EQU   CVTS01+96                                                03338000
CVTRV519 EQU   CVTS01+92                                                03339000
CVTRV327 EQU   CVTS01+88                                                03340000
CVTRV326 EQU   CVTS01+84                                                03341000
CVTRV325 EQU   CVTS01+80                                                03342000
CVTRV324 EQU   CVTS01+76                                                03343000
CVT0VL01 EQU   CVTS01+72                                                03344000
CVTSHRVM EQU   CVTS01+68                                                03345000
CVTRV332 EQU   CVTS01+64                                                03346000
CVTTAS   EQU   CVTS01+60                                                03347000
CVTRSCN  EQU   CVTS01+56                                                03348000
CVTTRAC2 EQU   CVTS01+54                                                03349000
CVTTRACE EQU   CVTS01+52                                                03350000
CVTAPG   EQU   CVTS01+51                                                03351000
CVTSDTRC EQU   CVTCTLFG                                                 03352000
CVTGTRCE EQU   CVTCTLFG                                                 03353000
CVTNOMP  EQU   CVTCTLFG                                                 03354000
CVTRSV79 EQU   CVTCTLFG                                                 03355000
CVTDSTAT EQU   CVTCTLFG                                                 03356000
CVTRSV78 EQU   CVTCTLFG                                                 03357000
CVTRV333 EQU   CVTCTLFG                                                 03358000
CVTRV323 EQU   CVTCTLFG                                                 03359000
CVTSPVLK EQU   CVTS01+49                                                03360000
CVTRSV77 EQU   CVTS01+48                                                03361000
CVTRV331 EQU   CVTS01+44                                                03362000
CVTRV330 EQU   CVTS01+40                                                03363000
CVTRV329 EQU   CVTS01+36                                                03364000
CVTRV328 EQU   CVTS01+32                                                03365000
CVTRV322 EQU   CVTS01+28                                                03366000
CVTSLID  EQU   CVTSLIDA+1                                               03367000
CVTSYLK  EQU   CVTSLIDA                                                 03368000
CVTRV321 EQU   CVTS01+20                                                03369000
CVTRV320 EQU   CVTS01+16                                                03370000
CVTLPDIR EQU   CVTLPDIA+1                                               03371000
CVTRSV69 EQU   CVTDIRST                                                 03372000
CVTRSV68 EQU   CVTDIRST                                                 03373000
CVTRSV67 EQU   CVTDIRST                                                 03374000
CVTRSV66 EQU   CVTDIRST                                                 03375000
CVTRSV65 EQU   CVTDIRST                                                 03376000
CVTRSV64 EQU   CVTDIRST                                                 03377000
CVTRSV63 EQU   CVTDIRST                                                 03378000
CVTDICOM EQU   CVTDIRST                                                 03379000
CVTPVTP  EQU   CVTS01+8                                                 03380000
CVTLPDSR EQU   CVTS01+4                                                 03381000
CVTGETL  EQU   CVTS01                                                   03382000
COCPOI   EQU   OCCCRT+2                                                 03383000
COCACX   EQU   OCCCRT+2                                                 03384000
COCCCN   EQU   OCCCRT+2                                                 03385000
COCCCM   EQU   OCCCRT+2                                                 03386000
COCCNV   EQU   OCCCRT+2                                                 03387000
COCCCC   EQU   OCCCRT+2                                                 03388000
COCCRL   EQU   OCCCRT+2                                                 03389000
COCCRT   EQU   OCCCRT+1                                                 03390000
COCCFB   EQU   OCCCRT+1                                                 03391000
COCCOF   EQU   OCCCRT+1                                                 03392000
COCCLD   EQU   OCCCRT+1                                                 03393000
COCCOE   EQU   OCCCRT+1                                                 03394000
COCCOD   EQU   OCCCRT+1                                                 03395000
COCCSD   EQU   OCCCRT+1                                                 03396000
COCCRD   EQU   OCCCRT+1                                                 03397000
COCCFD   EQU   OCCCRT                                                   03398000
COCCMD   EQU   OCCCRT                                                   03399000
COCCFR   EQU   OCCCRT                                                   03400000
COCCFO   EQU   OCCCRT                                                   03401000
COCCSL   EQU   OCCCRT                                                   03402000
COCCCH   EQU   OCCCRT                                                   03403000
COCCCL   EQU   OCCCRT                                                   03404000
COCCOC   EQU   OCCCRT                                                   03405000
NOCPOI   EQU   OCCNTRD+2                                                03406000
NOCACX   EQU   OCCNTRD+2                                                03407000
NOCCCN   EQU   OCCNTRD+2                                                03408000
NOCCCM   EQU   OCCNTRD+2                                                03409000
NOCCNV   EQU   OCCNTRD+2                                                03410000
NOCCCC   EQU   OCCNTRD+2                                                03411000
NOCCRL   EQU   OCCNTRD+2                                                03412000
NOCCRT   EQU   OCCNTRD+1                                                03413000
NOCCFB   EQU   OCCNTRD+1                                                03414000
NOCCOF   EQU   OCCNTRD+1                                                03415000
NOCCLD   EQU   OCCNTRD+1                                                03416000
NOCCOE   EQU   OCCNTRD+1                                                03417000
NOCCOD   EQU   OCCNTRD+1                                                03418000
NOCCSD   EQU   OCCNTRD+1                                                03419000
NOCCRD   EQU   OCCNTRD+1                                                03420000
NOCCFD   EQU   OCCNTRD                                                  03421000
NOCCMD   EQU   OCCNTRD                                                  03422000
NOCCFR   EQU   OCCNTRD                                                  03423000
NOCCFO   EQU   OCCNTRD                                                  03424000
NOCCSL   EQU   OCCNTRD                                                  03425000
NOCCCH   EQU   OCCNTRD                                                  03426000
NOCCCL   EQU   OCCNTRD                                                  03427000
NOCCOC   EQU   OCCNTRD                                                  03428000
OCCCNS   EQU   ISTOCCRR                                                 03429000
CNSRSV05 EQU   CNSTFLDB+2                                               03430000
CNSLOG0B EQU   CNSTFLDB+2                                               03431000
CNSACCTB EQU   CNSTFLDB+2                                               03432000
CNSFREEB EQU   CNSTFLDB+2                                               03433000
CNSGETSB EQU   CNSTFLDB+2                                               03434000
CNSSEARB EQU   CNSTFLDB+2                                               03435000
CNSQUEUB EQU   CNSTFLDB+2                                               03436000
CNSACONB EQU   CNSTFLDB+2                                               03437000
CNSTCONB EQU   CNSTFLDB+1                                               03438000
CNSCLAQB EQU   CNSTFLDB+1                                               03439000
CNSCLINB EQU   CNSTFLDB+1                                               03440000
CNSGBINB EQU   CNSTFLDB+1                                               03441000
CNSLGINB EQU   CNSTFLDB+1                                               03442000
CNSACINB EQU   CNSTFLDB+1                                               03443000
CNSPSINB EQU   CNSTFLDB+1                                               03444000
CNSRQRLB EQU   CNSTFLDB+1                                               03445000
CNSTRRLB EQU   CNSTFLDB                                                 03446000
CNSDORLB EQU   CNSTFLDB                                                 03447000
CNSRLINB EQU   CNSTFLDB                                                 03448000
CNSQREQB EQU   CNSTFLDB                                                 03449000
CNSXREQB EQU   CNSTFLDB                                                 03450000
CNSAQINB EQU   CNSTFLDB                                                 03451000
CNSAUTHB EQU   CNSTFLDB                                                 03452000
CNSMRINB EQU   CNSTFLDB                                                 03453000
CNSRSV01 EQU   CNSTFLDA+2                                               03454000
CNSLOG0A EQU   CNSTFLDA+2                                               03455000
CNSACCTA EQU   CNSTFLDA+2                                               03456000
CNSFREEA EQU   CNSTFLDA+2                                               03457000
CNSGETSA EQU   CNSTFLDA+2                                               03458000
CNSSEARA EQU   CNSTFLDA+2                                               03459000
CNSQUEUA EQU   CNSTFLDA+2                                               03460000
CNSACONA EQU   CNSTFLDA+2                                               03461000
CNSTCONA EQU   CNSTFLDA+1                                               03462000
CNSCLAQA EQU   CNSTFLDA+1                                               03463000
CNSCLINA EQU   CNSTFLDA+1                                               03464000
CNSGBINA EQU   CNSTFLDA+1                                               03465000
CNSLGINA EQU   CNSTFLDA+1                                               03466000
CNSACINA EQU   CNSTFLDA+1                                               03467000
CNSPSINA EQU   CNSTFLDA+1                                               03468000
CNSRQRLA EQU   CNSTFLDA+1                                               03469000
CNSTRRLA EQU   CNSTFLDA                                                 03470000
CNSDORLA EQU   CNSTFLDA                                                 03471000
CNSRLINA EQU   CNSTFLDA                                                 03472000
CNSQREQA EQU   CNSTFLDA                                                 03473000
CNSXREQA EQU   CNSTFLDA                                                 03474000
CNSAQINA EQU   CNSTFLDA                                                 03475000
CNSAUTHA EQU   CNSTFLDA                                                 03476000
CNSMRINA EQU   CNSTFLDA                                                 03477000
CNSTPFX  EQU   ISTCNSTA                                                 03478000
CRACHAIN EQU   ISTCRA+928                                               03479000
CRARSV02 EQU   ISTCRA+924                                               03480000
CRARSV01 EQU   ISTCRA+920                                               03481000
CRABFTBA EQU   CRABUFA                                                  03482000
CRAMASK  EQU   CRASVC+64                                                03483000
CRAHSIZ  EQU   CRASVC+60                                                03484000
CRAASCRR EQU   CRASVC                                                   03485000
CRAPSS   EQU   ISTCRA+160                                               03486000
CRARPH   EQU   ISTCRA+52                                                03487000
CRALAPTR EQU   CRABASIC+48                                              03488000
CRAL9PTR EQU   CRABASIC+44                                              03489000
CRAL8PTR EQU   CRABASIC+40                                              03490000
CRAL7PTR EQU   CRABASIC+36                                              03491000
CRAL6PTR EQU   CRABASIC+32                                              03492000
CRAL5PTR EQU   CRABASIC+28                                              03493000
CRAL4PTR EQU   CRABASIC+24                                              03494000
CRAL1PTR EQU   CRABASIC+12                                              03495000
CRALEV01 EQU   CRALKACT+3                                               03496000
CRALEV02 EQU   CRALKACT+3                                               03497000
CRALEV03 EQU   CRALKACT+3                                               03498000
CRALEV04 EQU   CRALKACT+3                                               03499000
CRALEV05 EQU   CRALKACT+3                                               03500000
CRALEV06 EQU   CRALKACT+3                                               03501000
CRALEV07 EQU   CRALKACT+3                                               03502000
CRALEV08 EQU   CRALKACT+3                                               03503000
CRALEV09 EQU   CRALKACT+2                                               03504000
CRALEV10 EQU   CRALKACT+2                                               03505000
CRALEV11 EQU   CRALKACT+2                                               03506000
CRALEV12 EQU   CRALKACT+2                                               03507000
CRALEV13 EQU   CRALKACT+2                                               03508000
CRALEV14 EQU   CRALKACT+2                                               03509000
CRALEV15 EQU   CRALKACT+2                                               03510000
CRALEV16 EQU   CRALKACT+2                                               03511000
CRALEV17 EQU   CRALKACT+1                                               03512000
CRALEV18 EQU   CRALKACT+1                                               03513000
CRALEV19 EQU   CRALKACT+1                                               03514000
CRALEV20 EQU   CRALKACT+1                                               03515000
CRALEV21 EQU   CRALKACT+1                                               03516000
CRALEV22 EQU   CRALKACT+1                                               03517000
CRALEV23 EQU   CRALKACT+1                                               03518000
CRALEV24 EQU   CRALKACT+1                                               03519000
CRALEV25 EQU   CRALKACT                                                 03520000
CRALEV26 EQU   CRALKACT                                                 03521000
CRALEV27 EQU   CRALKACT                                                 03522000
CRALEV28 EQU   CRALKACT                                                 03523000
CRALEV29 EQU   CRALKACT                                                 03524000
CRALEV30 EQU   CRALKACT                                                 03525000
CRALEV31 EQU   CRALKACT                                                 03526000
CRALEV32 EQU   CRALKACT                                                 03527000
@NM00102 EQU   ISTAPCRR+137                                             03528000
@NM00101 EQU   APC57FLG                                                 03529000
APCNREL  EQU   APC57FLG                                                 03530000
APCRECRA EQU   APC57FLG                                                 03531000
@NM00100 EQU   APC54FLG                                                 03532000
APCRLST  EQU   APC54FLG                                                 03533000
APCPR153 EQU   APC53FLG                                                 03534000
@NM00099 EQU   APC52FLG                                                 03535000
APCWKF   EQU   APC52FLG                                                 03536000
APCNWF   EQU   APC52FLG                                                 03537000
APCRDQ   EQU   APC52FLG                                                 03538000
APCQENQ  EQU   APC52FLG                                                 03539000
APCSMSR  EQU   APC52FLG                                                 03540000
APCCKRQ  EQU   APC52FLG                                                 03541000
@NM00098 EQU   APC31FLG                                                 03542000
APCSORT  EQU   APC31FLG                                                 03543000
APCRESCH EQU   APC31FLG                                                 03544000
APCTPXIT EQU   APC31FLG                                                 03545000
APCSWTWD EQU   ISTAPCRR+128                                             03546000
APCSAV2  EQU   ISTAPCRR+124                                             03547000
APCSAV1  EQU   ISTAPCRR+120                                             03548000
APCRETCD EQU   APCCOMF+2                                                03549000
@NM00097 EQU   APCCOMF1+1                                               03550000
APCZLBER EQU   APCCOMF1                                                 03551000
APCEXIT  EQU   APCCOMF1                                                 03552000
APCRELR  EQU   APCCOMF1                                                 03553000
APCIRB2  EQU   APCCOMF1                                                 03554000
APCIRB1  EQU   APCCOMF1                                                 03555000
APCSMCR  EQU   APCCOMF1                                                 03556000
APCUETSK EQU   APCCOMF1                                                 03557000
APCSSTSK EQU   APCCOMF1                                                 03558000
APCESTAL EQU   APCSAVE                                                  03559000
APCFRRPM EQU   ISTAPCRR+40                                              03560000
APCQWFO  EQU   ISTAPCRR+36                                              03561000
APCPABSV EQU   ISTAPCRR+32                                              03562000
APCRTRN  EQU   ISTAPCRR+28                                              03563000
APCTCBA  EQU   ISTAPCRR+24                                              03564000
APCPSTA  EQU   ISTAPCRR+20                                              03565000
@NM00096 EQU   APCRFLG+1                                                03566000
APC31R   EQU   APCRFLG                                                  03567000
APC58R   EQU   APCRFLG                                                  03568000
APC57R   EQU   APCRFLG                                                  03569000
APC56R   EQU   APCRFLG                                                  03570000
APC54R   EQU   APCRFLG                                                  03571000
APC53R   EQU   APCRFLG                                                  03572000
APC52R   EQU   APCRFLG                                                  03573000
APC51R   EQU   APCRFLG                                                  03574000
@NM00095 EQU   APCATFLG+1                                               03575000
APC31E   EQU   APCATFLG                                                 03576000
APC58E   EQU   APCATFLG                                                 03577000
APC57E   EQU   APCATFLG                                                 03578000
APC56E   EQU   APCATFLG                                                 03579000
APC54E   EQU   APCATFLG                                                 03580000
APC53E   EQU   APCATFLG                                                 03581000
APC52E   EQU   APCATFLG                                                 03582000
APC51E   EQU   APCATFLG                                                 03583000
APCHDRSV EQU   ISTAPCRR                                                 03584000
ASCPSREG EQU   ISTASCRR+44                                              03585000
ASCUSR01 EQU   ASCUSRGS+12                                              03586000
ASCUSR00 EQU   ASCUSRGS+8                                               03587000
ASCUSR15 EQU   ASCUSRGS+4                                               03588000
ASCUSR14 EQU   ASCUSRGS                                                 03589000
ASCETRYA EQU   ISTASCRR+24                                              03590000
ASCKEY   EQU   ISTASCRR+23                                              03591000
ASCAUDIT EQU   ASCFLG3                                                  03592000
ASCFBDUD EQU   ASCFLG3                                                  03593000
ASCLLKF  EQU   ASCFLG3                                                  03594000
ASCKEYF  EQU   ASCFLG3                                                  03595000
ASCFBDAL EQU   ASCFLG3                                                  03596000
ASCFSRGT EQU   ASCFLG3                                                  03597000
ASCICR   EQU   ASCFLG2                                                  03598000
ASCFSRIC EQU   ASCFLG2                                                  03599000
ASCFBDIC EQU   ASCFLG2                                                  03600000
ASCFBAIC EQU   ASCFLG2                                                  03601000
ASCPASTR EQU   ASCFLG1                                                  03602000
ASCFSR   EQU   ASCFLG1                                                  03603000
ASCFBD   EQU   ASCFLG1                                                  03604000
ASCFBA   EQU   ASCFLG1                                                  03605000
ASCPFCRR EQU   ISTASCRR                                                 03606000
ZCRRU    EQU   ZCRRHRU+3                                                03607000
ZCRRH    EQU   ZCRRHRU                                                  03608000
ZCRWORDA EQU   ISTZCRR+477                                              03609000
ZCRCMNRC EQU   ISTZCRR+476                                              03610000
ZCRRSV97 EQU   ZCRENTER+18                                              03611000
ZCREIC2B EQU   ZCRENTER+18                                              03612000
ZCREAC2B EQU   ZCRENTER+18                                              03613000
ZCRELCAB EQU   ZCRENTER+18                                              03614000
ZCREDCMF EQU   ZCRENTER+18                                              03615000
ZCREBCIF EQU   ZCRENTER+18                                              03616000
ZCREICSG EQU   ZCRENTER+18                                              03617000
ZCREDCK0 EQU   ZCRENTER+18                                              03618000
ZCRECFY0 EQU   ZCRENTER+17                                              03619000
ZCREKCCB EQU   ZCRENTER+17                                              03620000
ZCREDCNB EQU   ZCRENTER+17                                              03621000
ZCREICOE EQU   ZCRENTER+17                                              03622000
ZCREBCNB EQU   ZCRENTER+17                                              03623000
ZCREBC0L EQU   ZCRENTER+17                                              03624000
ZCREBCAL EQU   ZCRENTER+17                                              03625000
ZCREDCQR EQU   ZCRENTER+17                                              03626000
ZCREDCPR EQU   ZCRENTER+16                                              03627000
ZCREBCSB EQU   ZCRENTER+16                                              03628000
ZCREAC1R EQU   ZCRENTER+16                                              03629000
ZCRECCCI EQU   ZCRENTER+16                                              03630000
ZCRECCAI EQU   ZCRENTER+16                                              03631000
ZCRECCBI EQU   ZCRENTER+16                                              03632000
ZCREBCAR EQU   ZCRENTER+16                                              03633000
ZCREBCDR EQU   ZCRENTER+16                                              03634000
ZCREBCBR EQU   ZCRENTER+15                                              03635000
ZCREDCXR EQU   ZCRENTER+15                                              03636000
ZCREDCWB EQU   ZCRENTER+15                                              03637000
ZCREDCWR EQU   ZCRENTER+15                                              03638000
ZCREKCCN EQU   ZCRENTER+15                                              03639000
ZCREKCBN EQU   ZCRENTER+15                                              03640000
ZCREKCBB EQU   ZCRENTER+15                                              03641000
ZCREJC0B EQU   ZCRENTER+15                                              03642000
ZCREJCDB EQU   ZCRENTER+14                                              03643000
ZCREJCCB EQU   ZCRENTER+14                                              03644000
ZCREJCBB EQU   ZCRENTER+14                                              03645000
ZCREJCAB EQU   ZCRENTER+14                                              03646000
ZCREIC1B EQU   ZCRENTER+14                                              03647000
ZCREIC0B EQU   ZCRENTER+14                                              03648000
ZCREICX0 EQU   ZCRENTER+14                                              03649000
ZCREICWB EQU   ZCRENTER+14                                              03650000
ZCREICVB EQU   ZCRENTER+13                                              03651000
ZCREICUB EQU   ZCRENTER+13                                              03652000
ZCREICTB EQU   ZCRENTER+13                                              03653000
ZCREICSC EQU   ZCRENTER+13                                              03654000
ZCREICSB EQU   ZCRENTER+13                                              03655000
ZCREICRB EQU   ZCRENTER+13                                              03656000
ZCREICQB EQU   ZCRENTER+13                                              03657000
ZCREICQA EQU   ZCRENTER+13                                              03658000
ZCREICOB EQU   ZCRENTER+12                                              03659000
ZCREICOA EQU   ZCRENTER+12                                              03660000
ZCREICNB EQU   ZCRENTER+12                                              03661000
ZCREICNA EQU   ZCRENTER+12                                              03662000
ZCREICMB EQU   ZCRENTER+12                                              03663000
ZCREICLB EQU   ZCRENTER+12                                              03664000
ZCREICKG EQU   ZCRENTER+12                                              03665000
ZCREICKE EQU   ZCRENTER+12                                              03666000
ZCREICKB EQU   ZCRENTER+11                                              03667000
ZCREICJB EQU   ZCRENTER+11                                              03668000
ZCREICID EQU   ZCRENTER+11                                              03669000
ZCREICIB EQU   ZCRENTER+11                                              03670000
ZCREICHB EQU   ZCRENTER+11                                              03671000
ZCREICGB EQU   ZCRENTER+11                                              03672000
ZCREICEB EQU   ZCRENTER+11                                              03673000
ZCREICDB EQU   ZCRENTER+11                                              03674000
ZCREICCI EQU   ZCRENTER+10                                              03675000
ZCREICCB EQU   ZCRENTER+10                                              03676000
ZCREICBI EQU   ZCRENTER+10                                              03677000
ZCREICBB EQU   ZCRENTER+10                                              03678000
ZCREICAB EQU   ZCRENTER+10                                              03679000
ZCREICAA EQU   ZCRENTER+10                                              03680000
ZCREHCAN EQU   ZCRENTER+10                                              03681000
ZCREGC0B EQU   ZCRENTER+10                                              03682000
ZCREGC0A EQU   ZCRENTER+9                                               03683000
ZCREGCLA EQU   ZCRENTER+9                                               03684000
ZCREGCEB EQU   ZCRENTER+9                                               03685000
ZCREGCDB EQU   ZCRENTER+9                                               03686000
@NM00094 EQU   ZCRENTER+9                                               03687000
ZCREGCBB EQU   ZCRENTER+9                                               03688000
ZCREGCAB EQU   ZCRENTER+9                                               03689000
ZCREFCEB EQU   ZCRENTER+9                                               03690000
ZCREFCEA EQU   ZCRENTER+8                                               03691000
ZCREECTA EQU   ZCRENTER+8                                               03692000
ZCREECEA EQU   ZCRENTER+8                                               03693000
ZCREECDA EQU   ZCRENTER+8                                               03694000
ZCREECCB EQU   ZCRENTER+8                                               03695000
ZCREECCA EQU   ZCRENTER+8                                               03696000
ZCREECBB EQU   ZCRENTER+8                                               03697000
ZCREECBA EQU   ZCRENTER+8                                               03698000
ZCREDCMB EQU   ZCRENTER+7                                               03699000
ZCREDCL0 EQU   ZCRENTER+7                                               03700000
ZCREDCKB EQU   ZCRENTER+7                                               03701000
ZCREDCKA EQU   ZCRENTER+7                                               03702000
ZCREDCJ0 EQU   ZCRENTER+7                                               03703000
ZCREDCI0 EQU   ZCRENTER+7                                               03704000
ZCREDCH0 EQU   ZCRENTER+7                                               03705000
ZCREDCF0 EQU   ZCRENTER+7                                               03706000
ZCREDCE0 EQU   ZCRENTER+6                                               03707000
ZCREDCD0 EQU   ZCRENTER+6                                               03708000
ZCREDCC0 EQU   ZCRENTER+6                                               03709000
ZCREDCB0 EQU   ZCRENTER+6                                               03710000
ZCREDCA0 EQU   ZCRENTER+6                                               03711000
ZCRECC2B EQU   ZCRENTER+6                                               03712000
ZCRECC1B EQU   ZCRENTER+6                                               03713000
ZCRECC1A EQU   ZCRENTER+6                                               03714000
ZCRECC0B EQU   ZCRENTER+5                                               03715000
ZCRECC0A EQU   ZCRENTER+5                                               03716000
ZCREBC0B EQU   ZCRENTER+5                                               03717000
ZCREBC0A EQU   ZCRENTER+5                                               03718000
ZCREBCZ0 EQU   ZCRENTER+5                                               03719000
ZCREBCY0 EQU   ZCRENTER+5                                               03720000
ZCREBCX0 EQU   ZCRENTER+5                                               03721000
ZCREBCXA EQU   ZCRENTER+5                                               03722000
ZCREBCSC EQU   ZCRENTER+4                                               03723000
ZCREBCRB EQU   ZCRENTER+4                                               03724000
ZCREBCRA EQU   ZCRENTER+4                                               03725000
ZCREBCQB EQU   ZCRENTER+4                                               03726000
ZCREBCPB EQU   ZCRENTER+4                                               03727000
ZCREBCOB EQU   ZCRENTER+4                                               03728000
ZCREBCNE EQU   ZCRENTER+4                                               03729000
ZCREBCND EQU   ZCRENTER+4                                               03730000
ZCREBCMB EQU   ZCRENTER+3                                               03731000
ZCREBCLB EQU   ZCRENTER+3                                               03732000
ZCREBCLA EQU   ZCRENTER+3                                               03733000
ZCREBCKB EQU   ZCRENTER+3                                               03734000
ZCREBCKA EQU   ZCRENTER+3                                               03735000
ZCREBCJB EQU   ZCRENTER+3                                               03736000
ZCREBCJA EQU   ZCRENTER+3                                               03737000
ZCREBCID EQU   ZCRENTER+3                                               03738000
ZCREBCIB EQU   ZCRENTER+2                                               03739000
ZCREBCIA EQU   ZCRENTER+2                                               03740000
ZCREBCHB EQU   ZCRENTER+2                                               03741000
ZCREBCHA EQU   ZCRENTER+2                                               03742000
ZCREBCGB EQU   ZCRENTER+2                                               03743000
ZCREBCGA EQU   ZCRENTER+2                                               03744000
ZCREBCFB EQU   ZCRENTER+2                                               03745000
ZCREBCFA EQU   ZCRENTER+2                                               03746000
ZCREBCEB EQU   ZCRENTER+1                                               03747000
ZCREBCDI EQU   ZCRENTER+1                                               03748000
ZCREBCCB EQU   ZCRENTER+1                                               03749000
ZCREBCBI EQU   ZCRENTER+1                                               03750000
ZCREBCBB EQU   ZCRENTER+1                                               03751000
ZCREBCBA EQU   ZCRENTER+1                                               03752000
ZCREBCAM EQU   ZCRENTER+1                                               03753000
ZCREBCAI EQU   ZCRENTER+1                                               03754000
ZCREBCAG EQU   ZCRENTER                                                 03755000
ZCREBCAE EQU   ZCRENTER                                                 03756000
ZCREBCAB EQU   ZCRENTER                                                 03757000
ZCREBCAA EQU   ZCRENTER                                                 03758000
ZCREAC1B EQU   ZCRENTER                                                 03759000
ZCREAC0B EQU   ZCRENTER                                                 03760000
ZCREAC0A EQU   ZCRENTER                                                 03761000
ZCREAC1A EQU   ZCRENTER                                                 03762000
ZCRTNAME EQU   ZCRAUDIT+1                                               03763000
ZCRTID   EQU   ZCRAUDIT                                                 03764000
ZCRREMIC EQU   ISTZCRR+436                                              03765000
ZCRSAVEZ EQU   ISTZCRR+196                                              03766000
ZCRDAFSV EQU   ZCRCIDSV+2                                               03767000
ZCRSAFSV EQU   ZCRCIDSV                                                 03768000
ZCRR13SV EQU   ISTZCRR+188                                              03769000
ZCRR2SV  EQU   ISTZCRR+184                                              03770000
ZCROPCDE EQU   ISTZCRR+183                                              03771000
ZCRPRMTC EQU   ISTZCRR+182                                              03772000
ZCRRCDSV EQU   ISTZCRR+181                                              03773000
ZCRAWQSW EQU   ISTZCRR+180                                              03774000
ZCRTOPQ  EQU   ISTZCRR+180                                              03775000
ZCRLSTFB EQU   ISTZCRR+180                                              03776000
ZCRXSCHD EQU   ISTZCRR+180                                              03777000
ZCRNXTEL EQU   ISTZCRR+180                                              03778000
ZCRSCANQ EQU   ISTZCRR+180                                              03779000
ZCRMOREL EQU   ISTZCRR+180                                              03780000
ZCRFBPRC EQU   ISTZCRR+180                                              03781000
ZCRFSBSV EQU   ISTZCRR+176                                              03782000
ZCRSVWK5 EQU   ZCRWKARA+16                                              03783000
ZCRSVWK4 EQU   ZCRWKARA+12                                              03784000
ZCRSVWK3 EQU   ZCRWKARA+8                                               03785000
ZCRSVWK2 EQU   ZCRWKARA+4                                               03786000
ZCRSVWK1 EQU   ZCRWKARA                                                 03787000
ZCRSVF25 EQU   ZCRSVRTN+96                                              03788000
ZCRSVF24 EQU   ZCRSVRTN+92                                              03789000
ZCRSVF23 EQU   ZCRSVRTN+88                                              03790000
ZCRSVF22 EQU   ZCRSVRTN+84                                              03791000
ZCRSVF21 EQU   ZCRSVRTN+80                                              03792000
ZCRSVF20 EQU   ZCRSVRTN+76                                              03793000
ZCRSVF19 EQU   ZCRSVRTN+72                                              03794000
ZCRSVF18 EQU   ZCRSVRTN+68                                              03795000
ZCRSVF17 EQU   ZCRSVRTN+64                                              03796000
ZCRSVF16 EQU   ZCRSVRTN+60                                              03797000
ZCRSVF15 EQU   ZCRSVRTN+56                                              03798000
ZCRSVF14 EQU   ZCRSVRTN+52                                              03799000
ZCRSVF13 EQU   ZCRSVRTN+48                                              03800000
ZCRSVF12 EQU   ZCRSVRTN+44                                              03801000
ZCRSVF11 EQU   ZCRSVRTN+40                                              03802000
ZCRSVF10 EQU   ZCRSVRTN+36                                              03803000
ZCRSVF9  EQU   ZCRSVRTN+32                                              03804000
ZCRSVF8  EQU   ZCRSVRTN+28                                              03805000
ZCRSVF7  EQU   ZCRSVRTN+24                                              03806000
ZCRSVF6  EQU   ZCRSVRTN+20                                              03807000
ZCRSVF5  EQU   ZCRSVRTN+16                                              03808000
ZCRSVF4  EQU   ZCRSVRTN+12                                              03809000
ZCRSVF3  EQU   ZCRSVRTN+8                                               03810000
ZCRSVF2  EQU   ZCRSVRTN+4                                               03811000
ZCRSVF1  EQU   ZCRSVRTN                                                 03812000
ZCRPVZB  EQU   ISTZCRR+52                                               03813000
ZCRZLB   EQU   ISTZCRR+48                                               03814000
ZCRBFPTR EQU   ISTZCRR+44                                               03815000
ZCRCCWA  EQU   ISTZCRR+40                                               03816000
ZCRPSW   EQU   ZCRPARMS+15                                              03817000
ZCRPCHAR EQU   ZCRPARMS+14                                              03818000
ZCRPRES2 EQU   ZCRPCOD2                                                 03819000
ZCRPMFGF EQU   ZCRPCOD2                                                 03820000
ZCRPFHDR EQU   ZCRPCOD2                                                 03821000
ZCRPPG2  EQU   ZCRPCOD2                                                 03822000
ZCRPRES  EQU   ZCRPCOD1                                                 03823000
ZCRPCFTX EQU   ZCRPCOD1                                                 03824000
ZCRPBUF  EQU   ZCRPCOD1                                                 03825000
ZCRPLSCB EQU   ZCRPCOD1                                                 03826000
ZCRPLSBQ EQU   ZCRPLSBF                                                 03827000
ZCRPFSB  EQU   ZCRPCOD1                                                 03828000
ZCRPLNG  EQU   ZCRPCOD1                                                 03829000
ZCRPPG   EQU   ZCRPCOD1                                                 03830000
ZCRDTODA EQU   ZCRDFRDA                                                 03831000
ZCRMLNG  EQU   ZCRPARMS+8                                               03832000
ZCRTBPTR EQU   ZCRPARMS+4                                               03833000
ZCRCBPTR EQU   ZCRFBPTR                                                 03834000
ZCRCRLCP EQU   ISTZCRR+20                                               03835000
@NM00093 EQU   ZCRSCPSW                                                 03836000
ZCRSKIPT EQU   ZCRSCPSW                                                 03837000
ZCRFSBWE EQU   ZCRSCPSW                                                 03838000
ZCRPRCMP EQU   ZCRSCPSW                                                 03839000
ZCRLREQ  EQU   ZCRSCPSW                                                 03840000
ZCRRJLCP EQU   ZCRSCPSW                                                 03841000
ZCRTPINV EQU   ZCRSCPSW                                                 03842000
ZCRTPEX  EQU   ZCRSCPSW                                                 03843000
@NM00092 EQU   ZCRIBPR                                                  03844000
ZCR3270R EQU   ZCRIBPR                                                  03845000
ZCR3270  EQU   ZCRIBPR                                                  03846000
ZCRLCPFD EQU   ZCRIBPR                                                  03847000
ZCRLCPFR EQU   ZCRIBPR                                                  03848000
ZCRRELK  EQU   ZCRIBPR                                                  03849000
ZCRERR   EQU   ZCRIBPR                                                  03850000
ZCRNOBUF EQU   ZCRIBPR                                                  03851000
@NM00091 EQU   ZCRPFLGS                                                 03852000
ZCRQAHED EQU   ZCRPFLGS                                                 03853000
ZCRF1RES EQU   ZCRGENSW                                                 03854000
ZCRBRIS  EQU   ZCRGENSW                                                 03855000
ZCRCLRBD EQU   ZCRGENSW                                                 03856000
ZCREXRES EQU   ZCRGENSW                                                 03857000
ZCRLCSYN EQU   ZCRGENSW                                                 03858000
ZCRRT06  EQU   ZCRGENSW                                                 03859000
ZCRTSW2  EQU   ZCRGENSW                                                 03860000
ZCRTSW1  EQU   ZCRGENSW                                                 03861000
ZCRINLCP EQU   ZCRFLGS3                                                 03862000
ZCRWRPTR EQU   ZCRFLGS3                                                 03863000
ZCRNOFRE EQU   ZCRFLGS3                                                 03864000
ZCREDRIV EQU   ZCRFLGS3                                                 03865000
ZCRDISC  EQU   ZCRFLGS3                                                 03866000
ZCRTPDIS EQU   ZCRFLGS3                                                 03867000
ZCRTPCON EQU   ZCRFLGS3                                                 03868000
ZCRTIC   EQU   ZCRFLGS3                                                 03869000
ZCRCNLXL EQU   ZCRRESET                                                 03870000
ZCRENDAN EQU   ZCRSWFLD                                                 03871000
ZCRENDXL EQU   ZCRSWFLD                                                 03872000
ZCRENDX  EQU   ZCRSWFLD                                                 03873000
ZCROB1   EQU   ZCRNDLCP                                                 03874000
ZCRENDPR EQU   ZCRSWFLD                                                 03875000
ZCREXTYP EQU   ZCRSWFLD                                                 03876000
ZCRSLCP  EQU   ZCRENDSH                                                 03877000
ZCRIF0E3 EQU   ZCRFLGS2                                                 03878000
ZCRIF0E2 EQU   ZCRFLGS2                                                 03879000
ZCRIF0E1 EQU   ZCRFLGS2                                                 03880000
ZCROB    EQU   ZCRFLGS2                                                 03881000
ZCRFMSED EQU   ZCRFLGS2                                                 03882000
ZCRSHEDI EQU   ZCRFLGS2                                                 03883000
ZCRLOCAL EQU   ZCRFLGS2                                                 03884000
ZCRFEXIT EQU   ZCRFLGS1                                                 03885000
ZCRUNSOL EQU   ZCRFLGS1                                                 03886000
ZCRENDLP EQU   ZCRFLGS1                                                 03887000
ZCRNRMEX EQU   ZCRFLGS1                                                 03888000
ZCRWAIT  EQU   ZCRFLGS1                                                 03889000
ZCRDEQSW EQU   ZCRFLGS1                                                 03890000
ZCRQUESW EQU   ZCRFLGS1                                                 03891000
ZCREXSW  EQU   ZCRFLGS1                                                 03892000
ZCRFRRA  EQU   ISTZCRR+8                                                03893000
ZCRCHAIN EQU   ISTZCRR+4                                                03894000
ZCRFLAG  EQU   ZCRCRR+3                                                 03895000
ZCRLEN   EQU   ZCRCRR+1                                                 03896000
ZCRID    EQU   ZCRCRR                                                   03897000
CCFRSVD1 EQU   CFCCRT                                                   03898000
CCFCR2   EQU   CFCCRT                                                   03899000
CCFCRP   EQU   CFCCRT                                                   03900000
CCFCR1   EQU   CFCCRT                                                   03901000
CCFCS2   EQU   CFCCRT                                                   03902000
CCFCS1   EQU   CFCCRT                                                   03903000
NCFRSVD  EQU   CFCNTRD                                                  03904000
NCFCR2   EQU   CFCNTRD                                                  03905000
NCFCRP   EQU   CFCNTRD                                                  03906000
NCFCR1   EQU   CFCNTRD                                                  03907000
NCFCS2   EQU   CFCNTRD                                                  03908000
NCFCS1   EQU   CFCNTRD                                                  03909000
PFCRSV01 EQU   ISTPFCRR+13                                              03910000
CRRFRR   EQU   PFCFRRO                                                  03911000
CRRCHAIN EQU   PFCCRRO                                                  03912000
CRRLEN   EQU   PFCCRRLN                                                 03913000
PFCRSV10 EQU   PFCCRR+1                                                 03914000
CRRID    EQU   PFCCRRID                                                 03915000
ZSAZTRAC EQU   ISTZSAVE+36                                              03916000
ZSAZSVVR EQU   ISTZSAVE+12                                              03917000
ZSAZSVRR EQU   ISTZSAVE+8                                               03918000
ZSAZSVFC EQU   ISTZSAVE+4                                               03919000
ZSAZACTV EQU   ZSAZSVMS                                                 03920000
LCPFTYPE EQU   LCPRPHA                                                  03921000
LCPRSTQH EQU   LCPLCCW                                                  03922000
LCPCLREP EQU   ISTLCPB+44                                               03923000
LCPUBFSB EQU   LCPFLCCW                                                 03924000
LCPRSV77 EQU   ISTLCPB+39                                               03925000
LCPLCCWC EQU   ISTLCPB+38                                               03926000
LCPRSV78 EQU   LCPFLG1                                                  03927000
LCPTRANS EQU   LCPFLG1                                                  03928000
LCPSTLB  EQU   LCPFLG1                                                  03929000
LCPREDRV EQU   LCPFLG1                                                  03930000
LCPDIRPT EQU   LCPFLG1                                                  03931000
LCPINTER EQU   LCPFLG1                                                  03932000
LCPRESET EQU   LCPFLG1                                                  03933000
LCPSTYPE EQU   ISTLCPB+36                                               03934000
LCPFSNCH EQU   ISTLCPB+34                                               03935000
LCPFOSN  EQU   ISTLCPB+32                                               03936000
LCPTLBAD EQU   ISTLCPB+28                                               03937000
LCPFDB2  EQU   LCPFDBA+1                                                03938000
LCPFDB1  EQU   LCPFDBA                                                  03939000
LCPNXLCW EQU   ISTLCPB+20                                               03940000
LCPDAF   EQU   LCPCID+2                                                 03941000
LCPSAF   EQU   LCPCID                                                   03942000
LCPLCCW1 EQU   ISTLCPB+12                                               03943000
LCPRRCNT EQU   LCPSEQ+1                                                 03944000
LCPRRCCT EQU   LCPSEQ                                                   03945000
LCPATOP  EQU   LCPFLAG2                                                 03946000
LCPFREE  EQU   LCPFLAG2                                                 03947000
LCPDSTAT EQU   LCPFLAG2                                                 03948000
LCPEXRES EQU   LCPFID0                                                  03949000
LCPZRIMM EQU   LCPTLBPI                                                 03950000
LCPRSTRT EQU   LCPFLAG2                                                 03951000
LCPASYN  EQU   LCPFLAG2                                                 03952000
LCPPRFLG EQU   LCPFLAG2                                                 03953000
LCPZMIRC EQU   LCPRUCNT                                                 03954000
LCPCHAI2 EQU   LCPCHAIN+1                                               03955000
LCPCHNG  EQU   LCPCHAI1                                                 03956000
LCPZRT0B EQU   LCPMNRCD                                                 03957000
LCPZRT0A EQU   LCPMNRCD                                                 03958000
LCPZRTL9 EQU   LCPZRT09                                                 03959000
LCPZRTL8 EQU   LCPZRT08                                                 03960000
LCPZRTL7 EQU   LCPZRT07                                                 03961000
LCPZRTL6 EQU   LCPZRT06                                                 03962000
LCPZRTL5 EQU   LCPZRT05                                                 03963000
LCPZRTL4 EQU   LCPZRT04                                                 03964000
LCPZRTL3 EQU   LCPZRT03                                                 03965000
LCPZRTL2 EQU   LCPZRT02                                                 03966000
LCPZRT01 EQU   LCPFLAGS                                                 03967000
LCPZRT00 EQU   LCPFLAGS                                                 03968000
LCPLNGTH EQU   ISTLCPB+1                                                03969000
LCPTYPE  EQU   ISTLCPB                                                  03970000
LCCWDATA EQU   ISTLCCW+4                                                03971000
LCCWCNT  EQU   ISTLCCW+2                                                03972000
LCCWACI  EQU   LCCWFLAG                                                 03973000
LCCWRFI  EQU   LCCWFLAG                                                 03974000
LCCWPER  EQU   LCCWLSI                                                  03975000
LCCWIDAT EQU   LCCWFLAG                                                 03976000
LCCWNTVC EQU   LCCWFLAG                                                 03977000
LCCWCKPT EQU   LCCWFLAG                                                 03978000
LCCWCC   EQU   LCCWFLAG                                                 03979000
LCCWCD   EQU   LCCWFLAG                                                 03980000
LCCWTYPE EQU   LCCWCTL                                                  03981000
LCCWMODE EQU   LCCWCTL                                                  03982000
LCCWSOP  EQU   LCCWRWOP                                                 03983000
@NM00090 EQU   LCCWRWOP                                                 03984000
LCCWSD   EQU   LCCWOP                                                   03985000
LCCWSI   EQU   LCCWOP                                                   03986000
@NM00087 EQU   CDATA                                                    03987000
ACDREFQ  EQU   ISTACDEB+204                                             03988000
ACDASFQ  EQU   ISTACDEB+200                                             03989000
ACDSOP   EQU   ISTACDEB+184                                             03990000
ACDSIP   EQU   ISTACDEB+168                                             03991000
ACDRSV24 EQU   ACDVTAM+108                                              03992000
ACDRSV23 EQU   ACDVTAM+104                                              03993000
ACDRSV22 EQU   ACDVTAM+100                                              03994000
ACDOCWAD EQU   ACDVTAM+96                                               03995000
ACDRSV10 EQU   ACDVTAM+92                                               03996000
ACDAPDDT EQU   ACDAPDAT+1                                               03997000
ACDAPDLN EQU   ACDAPDAT                                                 03998000
ACDRSV07 EQU   ACDVTAM+82                                               03999000
ACDRSV06 EQU   ACDVTAM+81                                               04000000
ACDRSV09 EQU   ACDSSFLG                                                 04001000
ACDAICLS EQU   ACDSSFLG                                                 04002000
ACDABEND EQU   ACDSSFLG                                                 04003000
ACDCACB  EQU   ACDSSFLG                                                 04004000
ACDRSV21 EQU   ACDVTAM+64                                               04005000
ACDSSPAB EQU   ACDVTAM+48                                               04006000
ACDNEPAB EQU   ACDVTAM+32                                               04007000
ACDRSV20 EQU   ACDVTAM+20                                               04008000
ACDRARQ  EQU   ACDVTAM+16                                               04009000
ACDRAFQ  EQU   ACDVTAM+12                                               04010000
ACDFMCB  EQU   ACDVTAM+8                                                04011000
ACDRDTE  EQU   ACDVTAM+4                                                04012000
ACDLOCK  EQU   ACDVTAM                                                  04013000
ACDAPP   EQU   ACDAPPAD+1                                               04014000
ACDEXSCL EQU   ACDAPPAD                                                 04015000
ACDDEBID EQU   ACDACBAD                                                 04016000
ACDPROTG EQU   ACDACBAD                                                 04017000
ACDECBAD EQU   ACDBASIC+20                                              04018000
ACDUSRPB EQU   ACDUSRPG+1                                               04019000
ACDNMEXT EQU   ACDUSRPG                                                 04020000
ACDPRLEN EQU   ACDBASIC+15                                              04021000
ACDFLGS1 EQU   ACDBASIC+14                                              04022000
ACDQSCNT EQU   ACDBASIC+13                                              04023000
ACDOPATB EQU   ACDBASIC+12                                              04024000
ACDIRBAD EQU   ACDBASIC+8                                               04025000
ACDDEB   EQU   ACDDEBAD+1                                               04026000
ACDAMLNG EQU   ACDDEBAD                                                 04027000
ACDTCB   EQU   ACDTCBAD+1                                               04028000
ACDOPNAD EQU   ACDNMSUB                                                 04029000
ACDRSV03 EQU   ACDTBLOF+1                                               04030000
ACDRSV02 EQU   ACDTBLOF                                                 04031000
ACDAMTYP EQU   ACDDBPFX+5                                               04032000
ACDLENG  EQU   ACDDBPFX+4                                               04033000
ACDDEBX  EQU   ACDDBPFX                                                 04034000
ACDRSV08 EQU   ACDVTPRX+12                                              04035000
ACDCHN   EQU   ACDVTPRX+4                                               04036000
ACDSAF   EQU   ACDVTPRX+2                                               04037000
ACDLNGTH EQU   ACDVTPRX+1                                               04038000
ACDTYPE  EQU   ACDVTPRX                                                 04039000
UECRVPT4 EQU   ISTUECB+80                                               04040000
UECRVPT3 EQU   ISTUECB+76                                               04041000
UECLGDTA EQU   ISTUECB+72                                               04042000
UECREQNM EQU   ISTUECB+60                                               04043000
UECVRPL  EQU   UECPLIST+16                                              04044000
UECRSNBT EQU   UECRSNCD+3                                               04045000
@NM00086 EQU   UECRSNCD                                                 04046000
UECUSFLD EQU   UECREQTR                                                 04047000
UECDAF   EQU   UECTPNCD+2                                               04048000
UECSAF   EQU   UECTPNCD                                                 04049000
UECRPLAD EQU   UECACB                                                   04050000
UECEXLST EQU   ISTUECB+12                                               04051000
UECFORW  EQU   ISTUECB+4                                                04052000
UECRSV01 EQU   ISTUECB+2                                                04053000
ATCAOS   EQU   ISTATCVT+1584                                            04054000
ATCPOPAB EQU   ATCAOSM+640                                              04055000
ATCVIOPM EQU   ATCAOSM+636                                              04056000
ATCTPMMI EQU   ATCAOSM+632                                              04057000
ATCTPMPB EQU   ATCAOSM+600                                              04058000
ATCRPLCT EQU   ATCAOSM+594                                              04059000
ATCCRACT EQU   ATCAOSM+592                                              04060000
ATCSRBCT EQU   ATCAOSM+590                                              04061000
ATCRSV75 EQU   ATCAOSM+589                                              04062000
ATCRSV66 EQU   ATCZFLAG                                                 04063000
ATCZF001 EQU   ATCZFLAG                                                 04064000
ATCTPCP1 EQU   ATCAOSM+584                                              04065000
ATCTPCP0 EQU   ATCAOSM+580                                              04066000
ATCAICTN EQU   ATCAOSM+576                                              04067000
ATCZR01  EQU   ATCAOSM+572                                              04068000
ATCMPLTA EQU   ATCAOSM+568                                              04069000
ATCASCB  EQU   ATCAOSM+564                                              04070000
ATCAP86  EQU   ATCAOSM+560                                              04071000
ATCAP85  EQU   ATCAOSM+556                                              04072000
ATCAP84  EQU   ATCAOSM+552                                              04073000
ATCAP83  EQU   ATCAOSM+548                                              04074000
ATCAP82  EQU   ATCAOSM+544                                              04075000
ATCAP69  EQU   ATCAOSM+540                                              04076000
ATCAP66  EQU   ATCAOSM+536                                              04077000
ATCAP62  EQU   ATCAOSM+532                                              04078000
ATCAPC59 EQU   ATCAOSM+528                                              04079000
ATCAP56  EQU   ATCAOSM+524                                              04080000
ATCAP55  EQU   ATCAOSM+520                                              04081000
ATCRCFY0 EQU   ATCAOSM+516                                              04082000
ATCAP41  EQU   ATCAOSM+512                                              04083000
ATCAPC25 EQU   ATCAOSM+508                                              04084000
ATCAP23  EQU   ATCAOSM+504                                              04085000
ATCTPSPB EQU   ATCAOSM+472                                              04086000
ATCTRMPB EQU   ATCAOSM+440                                              04087000
ATCPSTA  EQU   ATCAOSM+432                                              04088000
ATCSMABF EQU   ATCAOSM+428                                              04089000
ATCSMAPR EQU   ATCAOSM+424                                              04090000
ATCTPWQA EQU   ATCAOSM+420                                              04091000
ATCSMAID EQU   ATCAOSM+416                                              04092000
ATCSMARA EQU   ATCAOSM+412                                              04093000
ATCCACXA EQU   ATCAOSM+408                                              04094000
ATCZLAAB EQU   ATCAOSM+404                                              04095000
ATCATA10 EQU   ATCAOSM+400                                              04096000
ATCHLTCB EQU   ATCAOSM+396                                              04097000
@NM00085 EQU   ATCVTFLG                                                 04098000
ATCVTACT EQU   ATCVTFLG                                                 04099000
ATCRPT40 EQU   ATCAOSM+388                                              04100000
ATCRPT39 EQU   ATCAOSM+384                                              04101000
ATCRPT38 EQU   ATCAOSM+380                                              04102000
ATCRPT37 EQU   ATCAOSM+376                                              04103000
ATCRPT36 EQU   ATCAOSM+372                                              04104000
ATCRPT35 EQU   ATCAOSM+368                                              04105000
ATCRPT34 EQU   ATCAOSM+364                                              04106000
ATCRPT33 EQU   ATCAOSM+360                                              04107000
ATCRPT32 EQU   ATCAOSM+356                                              04108000
ATCRPT31 EQU   ATCAOSM+352                                              04109000
ATCRPT30 EQU   ATCAOSM+348                                              04110000
ATCRPT29 EQU   ATCAOSM+344                                              04111000
ATCRPT28 EQU   ATCAOSM+340                                              04112000
ATCRPT27 EQU   ATCAOSM+336                                              04113000
ATCRPT26 EQU   ATCAOSM+332                                              04114000
ATCRPT25 EQU   ATCAOSM+328                                              04115000
ATCRPT24 EQU   ATCAOSM+324                                              04116000
ATCRPT23 EQU   ATCAOSM+320                                              04117000
ATCRPT22 EQU   ATCAOSM+316                                              04118000
ATCRPT21 EQU   ATCAOSM+312                                              04119000
ATCRPT20 EQU   ATCAOSM+308                                              04120000
ATCRPT19 EQU   ATCAOSM+304                                              04121000
ATCRPT18 EQU   ATCAOSM+300                                              04122000
ATCRPT17 EQU   ATCAOSM+296                                              04123000
ATCRPT16 EQU   ATCAOSM+292                                              04124000
ATCRPT15 EQU   ATCAOSM+288                                              04125000
ATCRPT14 EQU   ATCAOSM+284                                              04126000
ATCRPT13 EQU   ATCAOSM+280                                              04127000
ATCRPT12 EQU   ATCAOSM+276                                              04128000
ATCRPT11 EQU   ATCAOSM+272                                              04129000
ATCAP38  EQU   ATCAOSM+268                                              04130000
ATCZDFJ0 EQU   ATCAOSM+260                                              04131000
ATCAP51  EQU   ATCAOSM+256                                              04132000
ATCZPAB2 EQU   ATCAOSM+224                                              04133000
ATCZPAB1 EQU   ATCAOSM+192                                              04134000
ATCZLFVT EQU   ATCAOSM+188                                              04135000
ATCZLPVT EQU   ATCAOSM+184                                              04136000
ATCZDVTX EQU   ATCAOSM+180                                              04137000
ATCZDVTA EQU   ATCAOSM+176                                              04138000
ATCZDVT9 EQU   ATCAOSM+172                                              04139000
ATCZDVT8 EQU   ATCAOSM+168                                              04140000
ATCZDVT7 EQU   ATCAOSM+164                                              04141000
ATCRSV56 EQU   ATCDAPVT+22                                              04142000
ATCDAPDG EQU   ATCDAPVT+20                                              04143000
ATCDXCEA EQU   ATCDAPVT+16                                              04144000
ATCDCEA  EQU   ATCDAPVT+12                                              04145000
ATCDPCIA EQU   ATCDAPVT+8                                               04146000
ATCDSIOA EQU   ATCDAPVT+4                                               04147000
ATCDEOEA EQU   ATCDAPVT                                                 04148000
ATCZLAEA EQU   ATCLDAPP+16                                              04149000
ATCZLCEA EQU   ATCLDAPP+12                                              04150000
ATCRSV17 EQU   ATCLDAPP+8                                               04151000
ATCSMFRR EQU   ATCLDAPP+4                                               04152000
ATCCDTID EQU   ATCLDAPP                                                 04153000
ATCZAEA  EQU   ATCICAPP+16                                              04154000
ATCZCEA  EQU   ATCICAPP+12                                              04155000
ATCCDTCB EQU   ATCICAPP+8                                               04156000
ATCZSIOA EQU   ATCICAPP+4                                               04157000
ATCCDRPH EQU   ATCICAPP                                                 04158000
ATCAP65  EQU   ATCAOSM+96                                               04159000
ATCZDVT6 EQU   ATCAOSM+92                                               04160000
ATCZDVT4 EQU   ATCAOSM+88                                               04161000
ATCZDVT3 EQU   ATCAOSM+84                                               04162000
ATCZDVT1 EQU   ATCAOSM+80                                               04163000
ATCICNCB EQU   ATCAOSM+76                                               04164000
ATCZPSVT EQU   ATCAOSM+72                                               04165000
ATCZFSVT EQU   ATCAOSM+68                                               04166000
ATCAP64  EQU   ATCAOSM+64                                               04167000
ATCAP63  EQU   ATCAOSM+60                                               04168000
ATCAP61  EQU   ATCAOSM+56                                               04169000
ATCAP58  EQU   ATCAOSM+52                                               04170000
ATCAP57  EQU   ATCAOSM+48                                               04171000
ATCAP54  EQU   ATCAOSM+44                                               04172000
ATCAP53  EQU   ATCAOSM+40                                               04173000
ATCAP52  EQU   ATCAOSM+36                                               04174000
ATCAP32  EQU   ATCAOSM+28                                               04175000
ATCAP12  EQU   ATCAOSM+20                                               04176000
ATCAP11  EQU   ATCAOSM+16                                               04177000
ATCCMTCB EQU   ATCAOSM+12                                               04178000
ATCPRPH  EQU   ATCAOSM+8                                                04179000
ATCGSRBF EQU   ATCGSRBG                                                 04180000
ATCSRBRT EQU   ATCAOSM                                                  04181000
ATCRSVBB EQU   ISTATCVT+908                                             04182000
ATCVDLOK EQU   ISTATCVT+904                                             04183000
ATCVFPAB EQU   ISTATCVT+872                                             04184000
ATCVDPAB EQU   ISTATCVT+840                                             04185000
ATCIOECB EQU   ISTATCVT+836                                             04186000
ATCINCW3 EQU   ISTATCVT+832                                             04187000
ATCMODTB EQU   ISTATCVT+828                                             04188000
ATCUSSPT EQU   ISTATCVT+824                                             04189000
ATCSRTAB EQU   ISTATCVT+820                                             04190000
@NM00084 EQU   ISTATCVT+818                                             04191000
ATCNMCTR EQU   ISTATCVT+816                                             04192000
ATCSEC51 EQU   ATCSECST                                                 04193000
ATCSEC40 EQU   ATCSIPD+8                                                04194000
ATCSEC30 EQU   ATCSIPD+4                                                04195000
ATCSEC21 EQU   ATCSIPD                                                  04196000
ATCSEC10 EQU   ATCSOPD+4                                                04197000
ATCSEC01 EQU   ATCSOPD                                                  04198000
ATCPOIA  EQU   ISTATCVT+788                                             04199000
ATCPODVT EQU   ISTATCVT+784                                             04200000
ATCS49XL EQU   ISTATCVT+780                                             04201000
ATCS49XI EQU   ISTATCVT+776                                             04202000
ATCLCLCT EQU   ATCVLCNT+2                                               04203000
ATCRNCNT EQU   ATCVLCNT                                                 04204000
ATCCFEAD EQU   ISTATCVT+768                                             04205000
ATCPTR00 EQU   ISTATCVT+736                                             04206000
ATCRSV10 EQU   ISTATCVT+704                                             04207000
ATCTACB  EQU   ISTATCVT+700                                             04208000
ATCVTINM EQU   ISTATCVT+696                                             04209000
ATCTCLIM EQU   ISTATCVT+692                                             04210000
ATCTCLOM EQU   ISTATCVT+688                                             04211000
ATCVTIPB EQU   ISTATCVT+656                                             04212000
ATCTCIPB EQU   ISTATCVT+624                                             04213000
ATCTIPAB EQU   ISTATCVT+592                                             04214000
ATCOCCCB EQU   ISTATCVT+588                                             04215000
ATCOCCOB EQU   ISTATCVT+584                                             04216000
ATCCDLAD EQU   ISTATCVT+580                                             04217000
ATCCCLAD EQU   ISTATCVT+576                                             04218000
ATCDLRPB EQU   ISTATCVT+544                                             04219000
ATCPGPAB EQU   ISTATCVT+512                                             04220000
ATCVPAB1 EQU   ISTATCVT+480                                             04221000
ATCRSV97 EQU   ISTATCVT+476                                             04222000
ATCCDFDN EQU   ISTATCVT+464                                             04223000
ATCCDFIN EQU   ISTATCVT+460                                             04224000
ATCDVTLK EQU   ISTATCVT+456                                             04225000
ATCRSV99 EQU   ISTATCVT+412                                             04226000
ATCLDECB EQU   ISTATCVT+408                                             04227000
ATCLDNCS EQU   ISTATCVT+404                                             04228000
ATCCDPTR EQU   ISTATCVT+400                                             04229000
ATCADEL  EQU   ISTATCVT+396                                             04230000
ATCTODVT EQU   ISTATCVT+392                                             04231000
ATCDEBCH EQU   ISTATCVT+388                                             04232000
ATCHBSIZ EQU   ATCHPGM+2                                                04233000
ATCHBFNO EQU   ATCHPGM                                                  04234000
ATCCRME  EQU   ISTATCVT+380                                             04235000
ATCRVCHS EQU   ISTATCVT+372                                             04236000
ATCECTLP EQU   ISTATCVT+368                                             04237000
ATCZDVTB EQU   ISTATCVT+364                                             04238000
ATCECPRT EQU   ISTATCVT+360                                             04239000
ATCVTLOD EQU   ISTATCVT+356                                             04240000
ATCTRPAB EQU   ISTATCVT+352                                             04241000
ATCMSGM  EQU   ISTATCVT+348                                             04242000
ATCMSGP  EQU   ISTATCVT+344                                             04243000
ATCEPT   EQU   ISTATCVT+340                                             04244000
ATCDVT   EQU   ISTATCVT+336                                             04245000
ATCTRCPT EQU   ISTATCVT+332                                             04246000
ATCDVLOD EQU   ISTATCVT+328                                             04247000
ATCALERT EQU   ISTATCVT+324                                             04248000
ATCEPA   EQU   ISTATCVT+320                                             04249000
ATCSAF   EQU   ISTATCVT+318                                             04250000
ATCXRANG EQU   ISTATCVT+317                                             04251000
ATCLAST  EQU   ATCSHRFG                                                 04252000
ATCSHRTN EQU   ISTATCVT+308                                             04253000
ATCOCRT  EQU   ISTATCVT+300                                             04254000
ATCCSMA  EQU   ATCCSMR                                                  04255000
ATCESC02 EQU   ISTATCVT+292                                             04256000
ATCESC01 EQU   ISTATCVT+288                                             04257000
ATCCDFND EQU   ISTATCVT+284                                             04258000
ATCCDDEL EQU   ISTATCVT+280                                             04259000
ATCCDADD EQU   ISTATCVT+276                                             04260000
ATCMNT   EQU   ISTATCVT+272                                             04261000
ATCRSV16 EQU   ISTATCVT+270                                             04262000
ATCMAXID EQU   ISTATCVT+269                                             04263000
ATCMSGSP EQU   ATCCOM+268                                               04264000
ATCCIDM  EQU   ATCCOM+266                                               04265000
ATCACTRM EQU   ATCCOM+264                                               04266000
ATCNERAP EQU   ATCCOM+260                                               04267000
ATCNESAL EQU   ATCCOM+256                                               04268000
ATCRCC65 EQU   ATCCOM+252                                               04269000
ATCRCC26 EQU   ATCCOM+248                                               04270000
ATCRCC63 EQU   ATCCOM+244                                               04271000
ATCRSV11 EQU   ATCCOM+242                                               04272000
ATCVTMID EQU   ATCCOM+240                                               04273000
ATCAPOST EQU   ATCCOM+236                                               04274000
ATCNERFN EQU   ATCCOM+232                                               04275000
ATCNERNE EQU   ATCCOM+228                                               04276000
ATCNERCV EQU   ATCCOM+224                                               04277000
ATCNERST EQU   ATCCOM+220                                               04278000
ATCDCC61 EQU   ATCCOM+216                                               04279000
ATCDCC60 EQU   ATCCOM+212                                               04280000
ATCSRTDF EQU   ATCCOM+208                                               04281000
ATCSRTAD EQU   ATCCOM+204                                               04282000
ATCFIRA  EQU   ATCCOM+200                                               04283000
ATCSMBQ  EQU   ATCCOM+196                                               04284000
ATCSMRC  EQU   ATCCOM+192                                               04285000
ATCSMRS  EQU   ATCCOM+188                                               04286000
ATCSMQU  EQU   ATCCOM+184                                               04287000
ATCACDA  EQU   ATCCOM+176                                               04288000
ATCSTMA  EQU   ATCCOM+172                                               04289000
ATCFRSTR EQU   ATCCOM+168                                               04290000
ATCGTSTR EQU   ATCCOM+164                                               04291000
ATCREADA EQU   ATCCOM+160                                               04292000
ATCALOAD EQU   ATCCOM+156                                               04293000
ATCBLDLA EQU   ATCCOM+152                                               04294000
ATCFBRPH EQU   ATCCOM+148                                               04295000
ATCBFTRC EQU   ATCCOM+144                                               04296000
ATCTPBUF EQU   ATCTHTRC                                                 04297000
ATCREMOV EQU   ATCCOM+136                                               04298000
ATCADD   EQU   ATCCOM+132                                               04299000
ATCDVTPT EQU   ATCCOM+124                                               04300000
ATCFEPT  EQU   ATCCOM+120                                               04301000
ATCFDVT  EQU   ATCCOM+116                                               04302000
ATCCONFT EQU   ATCCOM+112                                               04303000
ATCPTCHA EQU   ATCCOM+108                                               04304000
ATCAUTHA EQU   ATCCOM+104                                               04305000
ATCACCTA EQU   ATCCOM+100                                               04306000
ATCRDTH  EQU   ATCCOM+96                                                04307000
ATCFRSCH EQU   ATCCOM+92                                                04308000
ATCFSB   EQU   ATCCOM+88                                                04309000
ATCHLTMS EQU   ATCCOM+84                                                04310000
ATCECPRM EQU   ATCCOM+80                                                04311000
ATCECNET EQU   ATCCOM+76                                                04312000
ATCECOPC EQU   ATCCOM+72                                                04313000
ATCVPARM EQU   ATCCOM+68                                                04314000
ATCECVRQ EQU   ATCCOM+64                                                04315000
ATCECSES EQU   ATCCOM+60                                                04316000
ATCOCHA  EQU   ATCCOM+56                                                04317000
ATCDSPLQ EQU   ATCCOM+52                                                04318000
ATCECDSP EQU   ATCCOM+48                                                04319000
ATCVARYQ EQU   ATCCOM+44                                                04320000
ATCECVRY EQU   ATCCOM+40                                                04321000
ATCHALTQ EQU   ATCCOM+36                                                04322000
ATCECHLT EQU   ATCCOM+32                                                04323000
ATCMODQ  EQU   ATCCOM+28                                                04324000
ATCECMOD EQU   ATCCOM+24                                                04325000
ATCASCHD EQU   ATCCOM+20                                                04326000
ATCSRT   EQU   ATCCOM+16                                                04327000
ATCRDT   EQU   ATCCOM+12                                                04328000
ATCDCFRR EQU   ATCCOM+8                                                 04329000
ATCAPI   EQU   ATCCOM+4                                                 04330000
ATCRSV04 EQU   ATCSTAT4                                                 04331000
ATCNCSD  EQU   ATCSTAT4                                                 04332000
ATCMTST  EQU   ATCSTAT4                                                 04333000
ATCTPRT  EQU   ATCSTAT4                                                 04334000
ATCPRTAT EQU   ATCSTAT4                                                 04335000
@NM00083 EQU   ATCPOFLG                                                 04336000
ATCPOUNS EQU   ATCPOFLG                                                 04337000
ATCHSDMF EQU   ATCSTFLG                                                 04338000
@NM00082 EQU   ATCSTAT1                                                 04339000
ATCINHLT EQU   ATCSTAT1                                                 04340000
ATCNETSL EQU   ATCSTAT1                                                 04341000
ATCACTIV EQU   ATCSTAT1                                                 04342000
ATCSTART EQU   ATCSTAT1                                                 04343000
DYPPAB   EQU   ISTDYPAB+16                                              04344000
DYPRSV01 EQU   ISTDYPAB+12                                              04345000
DYPTSKID EQU   ISTDYPAB+8                                               04346000
DYPCHAIN EQU   ISTDYPAB+4                                               04347000
DYPFLGS  EQU   ISTDYPAB+2                                               04348000
DYPLNGTH EQU   ISTDYPAB+1                                               04349000
DYPTYPE  EQU   ISTDYPAB                                                 04350000
RPHNEXPO EQU   ISTRPH+104                                               04351000
RPHSAV16 EQU   RPHWORK+60                                               04352000
RPHSAV15 EQU   RPHWORK+56                                               04353000
RPHSAV14 EQU   RPHWORK+52                                               04354000
RPHSAV13 EQU   RPHWORK+48                                               04355000
RPHSAV12 EQU   RPHWORK+44                                               04356000
RPHSAV11 EQU   RPHWORK+40                                               04357000
RPHSAV10 EQU   RPHWORK+36                                               04358000
RPHSAVE9 EQU   RPHWORK+32                                               04359000
RPHSAVE8 EQU   RPHWORK+28                                               04360000
RPHSAVE7 EQU   RPHWORK+24                                               04361000
RPHSAVE6 EQU   RPHWORK+20                                               04362000
RPHSAVE5 EQU   RPHWORK+16                                               04363000
RPHSAVE4 EQU   RPHWORK+12                                               04364000
RPHSAVE3 EQU   RPHWORK+8                                                04365000
RPHSAVE2 EQU   RPHWORK+4                                                04366000
RPHSHALF EQU   RPHSAVE1+2                                               04367000
RPHSBIT8 EQU   RPHSBITS                                                 04368000
RPHSBIT7 EQU   RPHSBITS                                                 04369000
RPHSBIT6 EQU   RPHSBITS                                                 04370000
RPHSBIT5 EQU   RPHSBITS                                                 04371000
RPHSBIT4 EQU   RPHSBITS                                                 04372000
RPHSBIT3 EQU   RPHSBITS                                                 04373000
RPHSBIT2 EQU   RPHSBITS                                                 04374000
RPHSBIT1 EQU   RPHSBITS                                                 04375000
RPHSBYTE EQU   RPHSAVE1                                                 04376000
RPHPABQP EQU   RPHPABQA+1                                               04377000
RPHPABFG EQU   RPHPABQA                                                 04378000
RPHSRP34 EQU   RPHSRPRM+2                                               04379000
RPHSRP12 EQU   RPHSRPRM                                                 04380000
RPHWEGT  EQU   RPHCSPA                                                  04381000
RPHMAJCB EQU   ISTRPH+21                                                04382000
RPHPABOF EQU   ISTRPH+20                                                04383000
RPHRESUM EQU   RPHRESMA+1                                               04384000
RPHRSV01 EQU   RPHWPFLG                                                 04385000
RPHPURGE EQU   RPHWPFLG                                                 04386000
RPHPT    EQU   RPHWPFLG                                                 04387000
RPHWT    EQU   RPHWPFLG                                                 04388000
RPHRSKEY EQU   RPHWPFLG                                                 04389000
RPHDVTA  EQU   ISTRPH+12                                                04390000
RPHTIK   EQU   RPHTSKID+3                                               04391000
@NM00081 EQU   RPHTSKID                                                 04392000
RPHRPHAP EQU   RPHRPHA+1                                                04393000
@NM00080 EQU   RPHRPHA                                                  04394000
RPHGATE  EQU   RPHRPHA                                                  04395000
@NM00079 EQU   RPHFLGB                                                  04396000
RPHRLCRA EQU   RPHFLGB                                                  04397000
RPHNRSAV EQU   RPHFLGB                                                  04398000
RPHPGCMP EQU   RPHFLGB                                                  04399000
RPHFBAPS EQU   RPHFLGB                                                  04400000
RPHBSSP  EQU   RPHFLGB                                                  04401000
RPHLOCK  EQU   RPHFLGB                                                  04402000
RPHFNFLG EQU   RPHFSTLC                                                 04403000
RPHMLTCP EQU   RPHFLAGS                                                 04404000
RPHSMCLR EQU   RPHFLAGS                                                 04405000
RPHSMTYP EQU   RPHFLAGS                                                 04406000
RPHSMQ   EQU   RPHFLAGS                                                 04407000
RPHAUTEX EQU   RPHAPTYP                                                 04408000
RPHSPGIN EQU   RPHFLAGS                                                 04409000
RPHOGIND EQU   RPHFLAGS                                                 04410000
RPHLNGTH EQU   ISTRPH+1                                                 04411000
RPHTYPE  EQU   ISTRPH                                                   04412000
PATRSV01 EQU   PATFLAGA                                                 04413000
PATUSEFG EQU   PATFLAGA                                                 04414000
PATRDCNT EQU   ISTPAT+6                                                 04415000
PATGRPID EQU   ISTPAT+5                                                 04416000
PATPTHID EQU   ISTPAT+4                                                 04417000
PATDINDX EQU   ISTPAT+2                                                 04418000
PATGINDX EQU   ISTPAT                                                   04419000
GNTGRPNM EQU   ISTGNT                                                   04420000
DNTTELNO EQU   ISTDNT+1                                                 04421000
DNTCTDIG EQU   ISTDNT                                                   04422000
RLSRSV02 EQU   ISTRLS+140                                               04423000
RLSRSV01 EQU   ISTRLS+138                                               04424000
RLSCTELU EQU   ISTRLS+136                                               04425000
RLSPRE   EQU   ISTRLS                                                   04426000
RDARSVPT EQU   ISTRDA+84                                                04427000
RDAPUBI  EQU   ISTRDA+83                                                04428000
RDADFCUA EQU   ISTRDA+80                                                04429000
RDACTPCC EQU   ISTRDA+79                                                04430000
RDADACUA EQU   ISTRDA+76                                                04431000
RDALUBA  EQU   RDAUCBAD+1                                               04432000
RDACHQI  EQU   RDAUCBAD                                                 04433000
RDARSV01 EQU   RDAFLAG                                                  04434000
RDARBISA EQU   RDAFLAG                                                  04435000
RDAPRE   EQU   ISTRDA                                                   04436000
RSWRSV01 EQU   ISTRSW+152                                               04437000
RSWRSV02 EQU   ISTRSW+150                                               04438000
RSWCTELU EQU   ISTRSW+148                                               04439000
RSWGRUPZ EQU   ISTRSW+146                                               04440000
RSWDIALZ EQU   ISTRSW+144                                               04441000
RSWGRUPT EQU   ISTRSW+140                                               04442000
RSWDIALT EQU   ISTRSW+136                                               04443000
RSWPRE   EQU   ISTRSW                                                   04444000
RLXRSV03 EQU   ISTRLX+80                                                04445000
RLXRSV02 EQU   ISTRLX+77                                                04446000
RLXRSV01 EQU   RLXFLAGA                                                 04447000
RLXINUSE EQU   RLXFLAGA                                                 04448000
RLXNLUX  EQU   ISTRLX+72                                                04449000
RLXPRE   EQU   ISTRLX                                                   04450000
RPXRSV01 EQU   ISTRPX+80                                                04451000
RPXRSV02 EQU   ISTRPX+77                                                04452000
RPXMAXLU EQU   ISTRPX+76                                                04453000
RPXFLUX  EQU   ISTRPX+72                                                04454000
RPXPRE   EQU   ISTRPX                                                   04455000
RLURSV02 EQU   ISTRLU+172                                               04456000
RLULGMOD EQU   ISTRLU+164                                               04457000
RLUMODEP EQU   RLUMODET+8                                               04458000
RLUMODEN EQU   RLUMODET                                                 04459000
RLUUSSPT EQU   RLUUSSTB+8                                               04460000
RLUUSSNM EQU   RLUUSSTB                                                 04461000
RLURSV01 EQU   ISTRLU+137                                               04462000
RLULOCAD EQU   ISTRLU+136                                               04463000
RLUNCPPM EQU   RLUNCPPC+1                                               04464000
RLUNCPPN EQU   RLUNCPPC                                                 04465000
RLUPACEM EQU   RLUPACE+1                                                04466000
RLUPACEN EQU   RLUPACE                                                  04467000
RLUINTA  EQU   ISTRLU+128                                               04468000
RLUSSCFM EQU   ISTRLU+127                                               04469000
RLUCRRSV EQU   RLUCRFLG                                                 04470000
RLUACTLU EQU   RLUCRFLG                                                 04471000
RLURSV00 EQU   RLUFLAG                                                  04472000
RLUGSTAT EQU   RLUFLAG                                                  04473000
RLUBATCH EQU   RLUFLAG                                                  04474000
RLURBISA EQU   RLUFLAG                                                  04475000
RLUTYPE  EQU   ISTRLU+124                                               04476000
RLUCRPR  EQU   ISTRLU                                                   04477000
RCCRVPT2 EQU   ISTRCC+144                                               04478000
RCCXTOSW EQU   ISTRCC+140                                               04479000
RCCSWTOX EQU   ISTRCC+136                                               04480000
RCCRSPT2 EQU   ISTRCC+133                                               04481000
RCCADDR  EQU   ISTRCC+132                                               04482000
RCCPASSL EQU   ISTRCC+131                                               04483000
RCCMXOUT EQU   ISTRCC+130                                               04484000
RCCMXDAT EQU   ISTRCC+128                                               04485000
RCCINDEX EQU   ISTRCC+126                                               04486000
RCCPATHZ EQU   ISTRCC+124                                               04487000
RCCPATHT EQU   ISTRCC+120                                               04488000
RCCDPQ   EQU   ISTRCC+116                                               04489000
RCCTPAB  EQU   ISTRCC+112                                               04490000
RCCRSV02 EQU   ISTRCC+109                                               04491000
RCCCRRSV EQU   RCCCRFLG                                                 04492000
RCCCTCFL EQU   RCCCRFLG                                                 04493000
RCCACTPU EQU   RCCCRFLG                                                 04494000
RCCNCSPL EQU   ISTRCC+104                                               04495000
RCCRPHCN EQU   ISTRCC+100                                               04496000
RCCEPAB  EQU   ISTRCC+96                                                04497000
RCCDPAB  EQU   ISTRCC+92                                                04498000
RCCVPAB  EQU   ISTRCC+88                                                04499000
@NM00078 EQU   ISTRCC+87                                                04500000
RCCSESCT EQU   ISTRCC+86                                                04501000
RCCIDNUM EQU   RCCID48+3                                                04502000
RCCIDBLK EQU   RCCID48+2                                                04503000
RCCIDPA2 EQU   RCCID48+1                                                04504000
RCCIDPUT EQU   RCCID48                                                  04505000
RCCIDPA1 EQU   RCCSTAID                                                 04506000
RCCCTELU EQU   ISTRCC+76                                                04507000
RCCCNCNT EQU   ISTRCC+75                                                04508000
RCCRTGOH EQU   RCCFLAGB                                                 04509000
RCCBRKCN EQU   RCCFLAGB                                                 04510000
RCCRESET EQU   RCCFLAGB                                                 04511000
RCCFINAL EQU   RCCFLAGB                                                 04512000
RCCBNNSP EQU   RCCFLAGB                                                 04513000
RCCIRETR EQU   RCCFLAGB                                                 04514000
RCCDIALP EQU   RCCFLAGB                                                 04515000
RCCDSTCT EQU   RCCFLAGB                                                 04516000
RCCCTPGD EQU   RCCFLAG                                                  04517000
RCCPRGDN EQU   RCCFLAG                                                  04518000
RCCOUERP EQU   RCCFLAG                                                  04519000
RCCOHIMM EQU   RCCFLAG                                                  04520000
RCCLDISC EQU   RCCFLAG                                                  04521000
RCCERPIP EQU   RCCFLAG                                                  04522000
RCCCUDIE EQU   RCCFLAG                                                  04523000
RCCRBISA EQU   RCCFLAG                                                  04524000
RCCTYPE  EQU   ISTRCC+72                                                04525000
RCCPRE   EQU   ISTRCC                                                   04526000
DOTADTRM EQU   ISTDOT                                                   04527000
RDSADDOT EQU   ISTRDS+76                                                04528000
RDSCTATR EQU   ISTRDS+74                                                04529000
RDSCTTRM EQU   ISTRDS+72                                                04530000
RDSPRE   EQU   ISTRDS                                                   04531000
RINRSV05 EQU   ISTRIN+156                                               04532000
RINRSV04 EQU   ISTRIN+152                                               04533000
RINLOCRN EQU   ISTRIN+148                                               04534000
RINRSV02 EQU   ISTRIN+145                                               04535000
RTRCNCNT EQU   RINCNCNT                                                 04536000
RTRNCSPL EQU   RINNCSPL                                                 04537000
RTRRPHCN EQU   RINRPHCN                                                 04538000
RTRVPAB  EQU   RINVPAB                                                  04539000
RTRREMOT EQU   RINREMOT                                                 04540000
RTRRLDAF EQU   RINRLDAF                                                 04541000
RTRNODID EQU   RINNODID                                                 04542000
RINRSV01 EQU   RINDFD                                                   04543000
RTRLDISC EQU   RINLDISC                                                 04544000
RTRNODEF EQU   RINNODEF                                                 04545000
RTRREMPO EQU   RINREMPO                                                 04546000
RINCRPRE EQU   ISTRIN                                                   04547000
RTRRSV04 EQU   ISTRTR+210                                               04548000
RTRLCTI  EQU   ISTRTR+209                                               04549000
RTRIDCAS EQU   RTRBSCID+1                                               04550000
RTRIDLEN EQU   RTRBSCID                                                 04551000
RTRRSVDD EQU   ISTRTR+181                                               04552000
RTRRDFG  EQU   ISTRTR+180                                               04553000
RTRDIAA  EQU   ISTRTR+176                                               04554000
RTRPOLA  EQU   ISTRTR+172                                               04555000
RTRCADDR EQU   ISTRTR+164                                               04556000
RTRCTADR EQU   ISTRTR+162                                               04557000
RTRCTPOL EQU   ISTRTR+160                                               04558000
RTRCTDIA EQU   ISTRTR+158                                               04559000
RTRRSV03 EQU   ISTRTR+156                                               04560000
RTRRVPT1 EQU   ISTRTR+152                                               04561000
RTRBHSN1 EQU   ISTRTR+144                                               04562000
RTRCRSV2 EQU   RTRCRFLG                                                 04563000
RTRDTRLM EQU   RTRLSCMD                                                 04564000
RTRCRSV1 EQU   RTRCRFLG                                                 04565000
RTRTRMAX EQU   ISTRTR+142                                               04566000
RTRRSV24 EQU   RTRRDFF                                                  04567000
RTRRFDEK EQU   RTRRDFF                                                  04568000
RTRRFANK EQU   RTRRDFF                                                  04569000
RTRRFPFK EQU   RTRRDFF                                                  04570000
RTRRFPEN EQU   RTRRDFF                                                  04571000
RTRRFXCT EQU   RTRRDFF                                                  04572000
RTRRESCT EQU   RTRRDFE                                                  04573000
RTRRESUP EQU   RTRRDFE                                                  04574000
RTRREATT EQU   RTRRDFE                                                  04575000
RTRRECHK EQU   RTRRDFE                                                  04576000
RTRREACR EQU   RTRRDFE                                                  04577000
RTRRSV0A EQU   RTRRDFE                                                  04578000
RTRREBRK EQU   RTRRDFE                                                  04579000
RTRRSV11 EQU   RTRRDFD                                                  04580000
RTRRSV10 EQU   RTRRDFD                                                  04581000
RTRRDBHI EQU   RTRRDFD                                                  04582000
RTRRDBHD EQU   RTRRDFD                                                  04583000
RTRRDBHN EQU   RTRRDFD                                                  04584000
RTRRSV23 EQU   RTRRDFC                                                  04585000
RTRRCXMS EQU   RTRRDFC                                                  04586000
RTRRCMSG EQU   RTRRDFC                                                  04587000
RTRRCBLK EQU   RTRRDFC                                                  04588000
RTRRCPT3 EQU   RTRRDFC                                                  04589000
RTRRCIT2 EQU   RTRRDFC                                                  04590000
RTRRCIT1 EQU   RTRRDFC                                                  04591000
RTRRSV32 EQU   RTRRDFB                                                  04592000
RTRRBEND EQU   RTRRDFB                                                  04593000
RTRRBECT EQU   RTRRDFB                                                  04594000
RTRRSV02 EQU   RTRRDFA                                                  04595000
RTRRACTR EQU   RTRRDFA                                                  04596000
RTRRSV60 EQU   RTRRDFA                                                  04597000
RTRRACDT EQU   RTRRDFA                                                  04598000
RTRRAPT3 EQU   RTRRAALL                                                 04599000
RTRRAPT2 EQU   RTRRAALL                                                 04600000
RTRRAPT1 EQU   RTRRAALL                                                 04601000
RTRRAATN EQU   RTRRDFA                                                  04602000
RTRRSV45 EQU   ISTRTR+132                                               04603000
RTRRSV01 EQU   ISTRTR+130                                               04604000
RTRCTECM EQU   ISTRTR+128                                               04605000
RTRADRPT EQU   RTRADR+1                                                 04606000
RTRRSV22 EQU   RTRFLAG                                                  04607000
RTRVTERM EQU   RTRFLAG                                                  04608000
RTRRSV51 EQU   RTRFLAG                                                  04609000
RTRRBISA EQU   RTRFLAG                                                  04610000
RTRRSV21 EQU   RTRFLAG                                                  04611000
RTRCRPR  EQU   ISTRTR                                                   04612000
RCLRVPT2 EQU   ISTRCL+92                                                04613000
RCLRVPT1 EQU   ISTRCL+88                                                04614000
RCLGPOLA EQU   ISTRCL+84                                                04615000
RCLCTNGP EQU   ISTRCL+82                                                04616000
RCLRSV01 EQU   ISTRCL+80                                                04617000
RCLCTECM EQU   ISTRCL+78                                                04618000
RCLCTETR EQU   ISTRCL+76                                                04619000
RCLGPADR EQU   RCLADR+1                                                 04620000
RCLRSV33 EQU   RCLFLAG                                                  04621000
RCLBATCH EQU   RCLFLAG                                                  04622000
RCLRBISA EQU   RCLFLAG                                                  04623000
RCLRSV22 EQU   RCLFLAG                                                  04624000
RCLPRE   EQU   ISTRCL                                                   04625000
RPTRSV03 EQU   ISTRPT+156                                               04626000
RPTRSV02 EQU   ISTRPT+152                                               04627000
RPTNSNSV EQU   ISTRPT+148                                               04628000
RPTPTHCT EQU   ISTRPT+146                                               04629000
RPTPEPCT EQU   ISTRPT+144                                               04630000
RPTDAFSV EQU   ISTRPT+142                                               04631000
RPTRSV01 EQU   ISTRPT+141                                               04632000
RPTISTAT EQU   RPTFLAG1                                                 04633000
RPTDYNAM EQU   RPTFLAG1                                                 04634000
RPTVYIMM EQU   RPTFLAG1                                                 04635000
RPTVIODN EQU   RPTFLAG1                                                 04636000
RPTONLIN EQU   RPTFLAG1                                                 04637000
RPTHLVPD EQU   RPTFLAG1                                                 04638000
RPTVRYPD EQU   RPTFLAG1                                                 04639000
RPTASLEP EQU   RPTFLAG1                                                 04640000
RPTUTERM EQU   ISTRPT+136                                               04641000
RPTATERM EQU   ISTRPT+132                                               04642000
RPTDIVT  EQU   RPTDITT                                                  04643000
RPTCTNM  EQU   ISTRPT+120                                               04644000
RPTLNDAF EQU   RPTLNCID+2                                               04645000
RPTLNSAF EQU   RPTLNCID                                                 04646000
RPTLN    EQU   ISTRPT                                                   04647000
RLNRVPT2 EQU   ISTRLN+112                                               04648000
RLNNCSPL EQU   ISTRLN+108                                               04649000
RLNX2SW  EQU   ISTRLN+104                                               04650000
@NM00077 EQU   ISTRLN+103                                               04651000
RLNCRRSV EQU   RLNCRFLG                                                 04652000
RLNSWEP  EQU   RLNCRFLG                                                 04653000
RLNSVSKP EQU   RLNLSCMD                                                 04654000
RLNSESLM EQU   RLNLSCMD                                                 04655000
RLNNPRLM EQU   RLNLSCMD                                                 04656000
RLNSWNCP EQU   RLNCRFLG                                                 04657000
RLNACTLN EQU   RLNCRFLG                                                 04658000
RLNPAUSE EQU   ISTRLN+101                                               04659000
RLNPOLMT EQU   ISTRLN+100                                               04660000
RLNACTSN EQU   ISTRLN+98                                                04661000
RLNRESV1 EQU   ISTRLN+97                                                04662000
RLNACTRM EQU   ISTRLN+96                                                04663000
RLNCTSES EQU   ISTRLN+95                                                04664000
RLNRDSLM EQU   ISTRLN+94                                                04665000
RLNAUTOA EQU   ISTRLN+92                                                04666000
RLNRDFD  EQU   RLNRDF+3                                                 04667000
RLNRDFC  EQU   RLNRDF+2                                                 04668000
RLNMULTP EQU   RLNRDFB                                                  04669000
RLNRATRN EQU   RLNRDFB                                                  04670000
RLNRAPOL EQU   RLNRDFB                                                  04671000
RLNTTV   EQU   RLNRDFB                                                  04672000
RLNRSV0B EQU   RLNRDFB                                                  04673000
RLNAUTOD EQU   RLNRDFB                                                  04674000
RLNANSWR EQU   RLNRDFB                                                  04675000
RLNRBUSE EQU   RLNRDFB                                                  04676000
RLNRAPEP EQU   RLNRDFA                                                  04677000
RLNRANCP EQU   RLNRDFA                                                  04678000
RLNRAEP  EQU   RLNRDFA                                                  04679000
RLNIDV   EQU   RLNRDFA                                                  04680000
RLNPORT  EQU   RLNRDFA                                                  04681000
RLNGANSW EQU   RLNRDFA                                                  04682000
RLNRACAN EQU   RLNRACNT                                                 04683000
RLNRACAT EQU   RLNRACNT                                                 04684000
RLNRSV04 EQU   RLNSTAT2                                                 04685000
RLNINUSE EQU   RLNSTAT2                                                 04686000
RLNOHIN  EQU   RLNSTAT2                                                 04687000
RLNRSV03 EQU   RLNSTAT1                                                 04688000
RLNVD    EQU   RLNSTAT1                                                 04689000
RLNINOPP EQU   RLNSTAT1                                                 04690000
RLNINOPL EQU   RLNSTAT1                                                 04691000
RLNLRST  EQU   RLNSTAT1                                                 04692000
RLNTRAP  EQU   RLNSTAT1                                                 04693000
RLNACTCT EQU   ISTRLN+84                                                04694000
RLNCTECM EQU   ISTRLN+82                                                04695000
RLNCTEIN EQU   ISTRLN+80                                                04696000
RLNCTETR EQU   ISTRLN+78                                                04697000
RLNCTECL EQU   ISTRLN+76                                                04698000
RLNCUA   EQU   RLNUCBAD                                                 04699000
RLNRSV01 EQU   RLNFLAG                                                  04700000
RLNRBISA EQU   RLNFLAG                                                  04701000
RLNEAM   EQU   RLNFLAG                                                  04702000
RLNPRE   EQU   ISTRLN                                                   04703000
RGPRVPT2 EQU   ISTRGP+88                                                04704000
RGPRVPT1 EQU   ISTRGP+84                                                04705000
RGPCTECM EQU   ISTRGP+82                                                04706000
RGPCTEIN EQU   ISTRGP+80                                                04707000
RGPCTETR EQU   ISTRGP+78                                                04708000
RGPCTECL EQU   ISTRGP+76                                                04709000
RGPCTELN EQU   ISTRGP+74                                                04710000
RGPRSV03 EQU   ISTRGP+73                                                04711000
RGPRSV02 EQU   RGPFLG                                                   04712000
RGPASDLC EQU   RGPFLG                                                   04713000
RGPABSC  EQU   RGPFLG                                                   04714000
RGPASS   EQU   RGPFLG                                                   04715000
RGPADIL  EQU   RGPFLG                                                   04716000
RGPPRE   EQU   ISTRGP                                                   04717000
RRNRINNM EQU   ISTRRN+248                                               04718000
@NM00076 EQU   ISTRRN+247                                               04719000
RRNRDCUA EQU   ISTRRN+244                                               04720000
RRNLASTE EQU   ISTRRN+240                                               04721000
RRNNCSPL EQU   ISTRRN+236                                               04722000
RRNRPLPT EQU   ISTRRN+232                                               04723000
RRNMSIZE EQU   ISTRRN+228                                               04724000
RRNNCPNM EQU   ISTRRN+221                                               04725000
RRNCTPCC EQU   ISTRRN+220                                               04726000
RRNHBUFS EQU   ISTRRN+218                                               04727000
RRNHLENT EQU   RRNHPRE+1                                                04728000
RRNHLENH EQU   RRNHPRE                                                  04729000
RRNNMNCP EQU   ISTRRN+208                                               04730000
RRNDELAY EQU   ISTRRN+206                                               04731000
RRNRSV04 EQU   ISTRRN+200                                               04732000
RRNRSV88 EQU   RRNNMDPD+7                                               04733000
RRNPUBI  EQU   RRNNMDPD+6                                               04734000
RRNDPLUB EQU   RRNNMDPD                                                 04735000
RRNEPADR EQU   ISTRRN+190                                               04736000
RRNCPLUB EQU   ISTRRN+184                                               04737000
RRNFLUX  EQU   ISTRRN+180                                               04738000
RRNRSV05 EQU   RRNCMFD                                                  04739000
RRNREMPO EQU   RRNCMFD                                                  04740000
RRNCDREC EQU   RRNCMFD                                                  04741000
RRNCDDSI EQU   RRNCMFD                                                  04742000
RRNCDBCK EQU   RRNCMFD                                                  04743000
RRNCDDTL EQU   RRNCMFD                                                  04744000
RRNCDSTD EQU   RRNCMFD                                                  04745000
RRNCDCSP EQU   RRNCMFD                                                  04746000
RRNCCCSL EQU   RRNCMFC                                                  04747000
RRNCCSIM EQU   RRNCMFC                                                  04748000
RRNCCRCM EQU   RRNCMFC                                                  04749000
RRNCCRIM EQU   RRNCMFC                                                  04750000
RRNCCCRC EQU   RRNCMFC                                                  04751000
RRNCCRST EQU   RRNCMFC                                                  04752000
RRNCCRDQ EQU   RRNCMFC                                                  04753000
RRNCCRCN EQU   RRNCMFC                                                  04754000
RRNCBALT EQU   RRNCMFB                                                  04755000
RRNCBMOD EQU   RRNCMFB                                                  04756000
RRNCBNPL EQU   RRNCMFB                                                  04757000
RRNCBRLS EQU   RRNCMFB                                                  04758000
RRNCBRDS EQU   RRNCMFB                                                  04759000
RRNCBDLR EQU   RRNCMFB                                                  04760000
RRNCBDLH EQU   RRNCMFB                                                  04761000
RRNCBDLO EQU   RRNCMFB                                                  04762000
RRNCADGO EQU   RRNCMFA                                                  04763000
RRNCADTD EQU   RRNCMFA                                                  04764000
RRNCACDT EQU   RRNCMFA                                                  04765000
RRNCAMBH EQU   RRNCMFA                                                  04766000
RRNCAATI EQU   RRNCMFA                                                  04767000
RRNCAATG EQU   RRNCMFA                                                  04768000
RRNCAATD EQU   RRNCMFA                                                  04769000
RRNCAALL EQU   RRNCMFA                                                  04770000
RRNRSV55 EQU   RRNRDF+3                                                 04771000
RRNPTASL EQU   RRNRDFB+1                                                04772000
RRNRSV01 EQU   RRNRDFB+1                                                04773000
RRNVYDON EQU   RRNRDFB+1                                                04774000
RRNRBBUP EQU   RRNRDFB+1                                                04775000
RRNRSV03 EQU   RRNRDFB                                                  04776000
RRNRBCT2 EQU   RRNRDFB                                                  04777000
RRNRBCT1 EQU   RRNRDFB                                                  04778000
RRNRBSEC EQU   RRNRDFB                                                  04779000
RRNRBCCT EQU   RRNRDFB                                                  04780000
RRNRBCCL EQU   RRNRDFB                                                  04781000
RRNRSV02 EQU   RRNRDFB                                                  04782000
RRNRBMDL EQU   RRNRDFB                                                  04783000
RRNRAPEP EQU   RRNRDFA                                                  04784000
RRNRANCP EQU   RRNRDFA                                                  04785000
RRNRBREM EQU   RRNRDFA                                                  04786000
RRNRAOLT EQU   RRNRDFA                                                  04787000
RRNRASYN EQU   RRNRDFA                                                  04788000
RRNRADMP EQU   RRNRDFA                                                  04789000
RRNRAIPL EQU   RRNRDFA                                                  04790000
RRNRASHT EQU   RRNRDFA                                                  04791000
RRNCTENT EQU   ISTRRN+170                                               04792000
RRNCTECM EQU   ISTRRN+168                                               04793000
RRNCTEIN EQU   ISTRRN+166                                               04794000
RRNCTETR EQU   ISTRRN+164                                               04795000
RRNCTECL EQU   ISTRRN+162                                               04796000
RRNCTELI EQU   ISTRRN+160                                               04797000
RRNCTEGP EQU   ISTRRN+158                                               04798000
RRNCTBHS EQU   ISTRRN+156                                               04799000
RRNBHSET EQU   ISTRRN+152                                               04800000
RRNTRENT EQU   ISTRRN+148                                               04801000
RRNRSV22 EQU   ISTRRN+147                                               04802000
RRNRNCUA EQU   ISTRRN+144                                               04803000
RRNGRPA  EQU   ISTRRN+140                                               04804000
RRNLUBA  EQU   RRNUCBAD+1                                               04805000
RRNCHQI  EQU   RRNUCBAD                                                 04806000
RRNRSV11 EQU   RRNFLAG                                                  04807000
RRNDSTCT EQU   RRNFLAG                                                  04808000
RRNERPIP EQU   RRNFLAG                                                  04809000
RRNLCDIP EQU   RRNFLAG                                                  04810000
RRNLCDIE EQU   RRNFLAG                                                  04811000
RRNLCSIP EQU   RRNFLAG                                                  04812000
RRNRBISA EQU   RRNFLAG                                                  04813000
RRNRSV89 EQU   RRNFLAG                                                  04814000
RRNPRE   EQU   ISTRRN                                                   04815000
RLCRVPT2 EQU   ISTRLC+80                                                04816000
RLCRVPT1 EQU   ISTRLC+79                                                04817000
RLCLCCUA EQU   ISTRLC+76                                                04818000
RLCUCBAD EQU   RLCADR+1                                                 04819000
RLCRSVDE EQU   RLCFLAG                                                  04820000
RLCACNT  EQU   RLCFLAG                                                  04821000
RLCRSV14 EQU   RLCFLAG                                                  04822000
RLCRBISA EQU   RLCFLAG                                                  04823000
RLCRSV22 EQU   RLCFLAG                                                  04824000
RLCPRE   EQU   ISTRLC                                                   04825000
RAPRVPT2 EQU   ISTRAP+116                                               04826000
RAPRVPT1 EQU   ISTRAP+112                                               04827000
RAPBFACT EQU   ISTRAP+111                                               04828000
RAPRSV17 EQU   RAPFLGC                                                  04829000
RAPRSV16 EQU   RAPFLGC                                                  04830000
RAPRSV15 EQU   RAPFLGC                                                  04831000
RAPRSV14 EQU   RAPFLGC                                                  04832000
RAPRSV13 EQU   RAPFLGC                                                  04833000
RAPRSV12 EQU   RAPFLGC                                                  04834000
RAPRSV11 EQU   RAPFLGC                                                  04835000
RAPRSV10 EQU   RAPFLGC                                                  04836000
RAPRSV09 EQU   RAPFLGB                                                  04837000
RAPASPO  EQU   RAPFLGB                                                  04838000
RAPAPPO  EQU   RAPFLGB                                                  04839000
RAPAACQ  EQU   RAPFLGB                                                  04840000
RAPAPRMT EQU   RAPFLGB                                                  04841000
RAPAPASS EQU   RAPFLGB                                                  04842000
RAPABLCK EQU   RAPFLGB                                                  04843000
RAPALLF  EQU   RAPFLGB                                                  04844000
RAPRSV06 EQU   RAPFLG                                                   04845000
RAPRSV05 EQU   RAPFLG                                                   04846000
RAPRSV04 EQU   RAPFLG                                                   04847000
RAPRSV03 EQU   RAPFLG                                                   04848000
RAPACEQD EQU   ISTRAP+106                                               04849000
RAPTRPRE EQU   ISTRAP+104                                               04850000
RAPACEAP EQU   ISTRAP+100                                               04851000
RAPICEAQ EQU   ISTRAP+96                                                04852000
RAPICEAC EQU   ISTRAP+92                                                04853000
RAPAPPWD EQU   ISTRAP+80                                                04854000
RAPACDEB EQU   ISTRAP+76                                                04855000
RAPACBA  EQU   ISTRAP+72                                                04856000
RAPPRE   EQU   ISTRAP                                                   04857000
RDTVSRPL EQU   ISTRDT+132                                               04858000
RDTCRSPW EQU   ISTRDT+124                                               04859000
RDTCRSDS EQU   ISTRDT+116                                               04860000
@NM00075 EQU   ISTRDT+113                                               04861000
RRNSTCNT EQU   RDTSTCNT                                                 04862000
RRNVYRPH EQU   RDTVYRPH                                                 04863000
RDTTPAB  EQU   ISTRDT+104                                               04864000
RDTDPAB  EQU   ISTRDT+100                                               04865000
RDTEPAB  EQU   ISTRDT+96                                                04866000
RDTVPAB  EQU   ISTRDT+92                                                04867000
RDTRSV01 EQU   RDTFLAGB                                                 04868000
RDTBHSET EQU   RDTFLAGB                                                 04869000
RDTCTCFL EQU   RDTFLAGB                                                 04870000
RDTCTPGD EQU   RDTFLAGB                                                 04871000
RDTPRGDN EQU   RDTFLAGB                                                 04872000
RDTOUERP EQU   RDTFLAGB                                                 04873000
RDTLGCT  EQU   ISTRDT+90                                                04874000
RDTNODID EQU   ISTRDT+89                                                04875000
RDTMAXID EQU   ISTRDT+88                                                04876000
RDTCTSNT EQU   ISTRDT+86                                                04877000
RDTFLAGS EQU   ISTRDT+84                                                04878000
RDTBACK  EQU   ISTRDT+80                                                04879000
RDTFORW  EQU   ISTRDT+76                                                04880000
RDTLEN   EQU   RDTPLEN+1                                                04881000
RDTPRILS EQU   RDTPRIOR                                                 04882000
RDTPRISW EQU   RDTPRIOR                                                 04883000
RDTPRIRN EQU   RDTPRIOR                                                 04884000
RDTPRILC EQU   RDTPRIOR                                                 04885000
RDTPRIAP EQU   RDTPRIOR                                                 04886000
@NM00074 EQU   RDTPRIOR                                                 04887000
RDTPRE   EQU   ISTRDT                                                   04888000
RCPRSV05 EQU   ISTRCPRE+120                                             04889000
RCPRSV04 EQU   ISTRCPRE+116                                             04890000
RCPRSV03 EQU   ISTRCPRE+112                                             04891000
RCPINTA  EQU   RCPLGNIN+16                                              04892000
RCPLGNCT EQU   RCPLGNIN+8                                               04893000
RCPLGNAP EQU   RCPLGNIN                                                 04894000
@NM00073 EQU   RCPPMODE                                                 04895000
RCPRRECD EQU   RCPPMODE                                                 04896000
RCPRBASC EQU   RCPPMODE                                                 04897000
RCPBFLIM EQU   ISTRCPRE+90                                              04898000
RCPBHSI2 EQU   ISTRCPRE+89                                              04899000
RCPBHSI1 EQU   ISTRCPRE+88                                              04900000
RCPACETR EQU   ISTRCPRE+84                                              04901000
RCPICEAQ EQU   ISTRCPRE+80                                              04902000
RCPLNAPA EQU   ISTRCPRE+76                                              04903000
RCPICELN EQU   ISTRCPRE+72                                              04904000
RCPPRE   EQU   ISTRCPRE                                                 04905000
RPRCONID EQU   ISTRPRE+63                                               04906000
RPRCLVPD EQU   RPRFLAGC                                                 04907000
RPRINIMM EQU   RPRFLAGD                                                 04908000
RPRRSV05 EQU   RPRFLAGD                                                 04909000
@NM00072 EQU   RPRFLAGD                                                 04910000
RPRRSON  EQU   RPRFLAGD                                                 04911000
RPRCONCT EQU   RPRFLAGD                                                 04912000
RPRLTASN EQU   RPRFLAGD                                                 04913000
RPRPTHCT EQU   ISTRPRE+60                                               04914000
RPRSWDAF EQU   ISTRPRE+58                                               04915000
RPRSTPCT EQU   ISTRPRE+56                                               04916000
RPRRVPT1 EQU   ISTRPRE+52                                               04917000
RPRDEVCH EQU   ISTRPRE+44                                               04918000
RPRNCBA  EQU   ISTRPRE+40                                               04919000
RPRNSNEA EQU   ISTRPRE+36                                               04920000
RPRHDTYP EQU   ISTRPRE+27                                               04921000
RPRTIOCT EQU   ISTRPRE+26                                               04922000
RPRPEPCT EQU   ISTRPRE+24                                               04923000
RPRRSV03 EQU   RPRCAUSE                                                 04924000
RPRRSYNC EQU   RPRCAUSE                                                 04925000
RPRCRCPT EQU   RPRCAUSE                                                 04926000
RPRNOSRT EQU   RPRCAUSE                                                 04927000
RPRINTST EQU   RPRFLAGB                                                 04928000
RPRVYIMM EQU   RPRFLAGB                                                 04929000
RPRHLVPD EQU   RPRFLAGB                                                 04930000
RPRONLIN EQU   RPRFLAGB                                                 04931000
RPRVIODN EQU   RPRFLAGB                                                 04932000
RPRAOPN  EQU   RPRFLAGB                                                 04933000
RPRENTVT EQU   RPRFLAGB                                                 04934000
RPRENTVH EQU   RPRFLAGB                                                 04935000
RPRVRYPD EQU   RPRFLAGA                                                 04936000
RPRENTED EQU   RPRFLAGA                                                 04937000
RPRENTIO EQU   RPRFLAGA                                                 04938000
RPRENTBF EQU   RPRFLAGA                                                 04939000
RPRINV   EQU   RPRFLAGA                                                 04940000
RPRACT   EQU   RPRFLAGA                                                 04941000
RPRENTRY EQU   ISTRPRE+20                                               04942000
RPRPELEN EQU   ISTRPRE+18                                               04943000
RPRELEN  EQU   ISTRPRE+16                                               04944000
RPRRLOCK EQU   ISTRPRE+12                                               04945000
RPRDAF   EQU   RPRCOMID+2                                               04946000
RPRSAF   EQU   RPRCOMID                                                 04947000
LOKXCL   EQU   @NM00070                                                 04948000
LOKPRY   EQU   @NM00070                                                 04949000
@NM00071 EQU   @NM00070                                                 04950000
@NM00069 EQU   LOKCHNG                                                  04951000
LOKCT    EQU   ISTLOK                                                   04952000
OCWEND   EQU   ISTOCW+848                                               04953000
@NM00068 EQU   OCWFLG1                                                  04954000
OCWEXIT  EQU   OCWFLG1                                                  04955000
OCWSENSE EQU   ISTOCW+843                                               04956000
OCWBNDSZ EQU   ISTOCW+841                                               04957000
OCWBINDD EQU   OCWBIND+37                                               04958000
OCWBINDA EQU   OCWBIND+1                                                04959000
OCWBINDC EQU   OCWBIND                                                  04960000
OCWSHPLC EQU   OCWSHPL+8                                                04961000
OCWSHPLB EQU   OCWSHPL+4                                                04962000
OCWSHPLA EQU   OCWSHPL                                                  04963000
OCWBNDRU EQU   ISTOCW+780                                               04964000
OCWELCP  EQU   ISTOCW+776                                               04965000
OCWRSV12 EQU   ISTOCW+772                                               04966000
OCWRSV11 EQU   ISTOCW+768                                               04967000
OCWRSV10 EQU   ISTOCW+764                                               04968000
OCWRSV09 EQU   ISTOCW+760                                               04969000
OCWPROCD EQU   ISTOCW+756                                               04970000
OCWRSV08 EQU   ISTOCW+752                                               04971000
OCWRSV07 EQU   ISTOCW+748                                               04972000
OCWDAF   EQU   OCWCID+2                                                 04973000
OCWSAF   EQU   OCWCID                                                   04974000
OCWNMLLN EQU   ISTOCW+742                                               04975000
OCWRSV0A EQU   ISTOCW+741                                               04976000
OCWRSV82 EQU   OCWLOCKS                                                 04977000
OCWMLOCK EQU   OCWLOCKS                                                 04978000
OCWALOCK EQU   OCWLOCKS                                                 04979000
OCWDLOCK EQU   OCWLOCKS                                                 04980000
OCWCLOCK EQU   OCWLOCKS                                                 04981000
OCWELOCK EQU   OCWLOCKS                                                 04982000
OCWACE   EQU   ISTOCW+736                                               04983000
OCWIOMIN EQU   ISTOCW+735                                               04984000
OCWIOMAJ EQU   ISTOCW+734                                               04985000
OCWBHSID EQU   ISTOCW+733                                               04986000
OCWRSV03 EQU   ISTOCW+732                                               04987000
OCWSWTE7 EQU   OCWSWTE                                                  04988000
OCWSWTE6 EQU   OCWSWTE                                                  04989000
OCWSWTE5 EQU   OCWSWTE                                                  04990000
OCWSWTE4 EQU   OCWSWTE                                                  04991000
OCWSWTE3 EQU   OCWSWTE                                                  04992000
OCWSWTE2 EQU   OCWSWTE                                                  04993000
OCWLCPBC EQU   OCWSWTE                                                  04994000
OCWSKEL  EQU   OCWSWTE                                                  04995000
OCWSWTR7 EQU   OCWSWTRD                                                 04996000
OCWSWTR6 EQU   OCWSWTRD                                                 04997000
OCWSWTR5 EQU   OCWSWTRD                                                 04998000
OCWDPDVT EQU   OCWSWTRD                                                 04999000
OCWEPTLP EQU   OCWSWTRD                                                 05000000
OCWCPARE EQU   OCWSWTRD                                                 05001000
OCWCLEN  EQU   OCWSWTRD                                                 05002000
OCWSRDVT EQU   OCWSWTRD                                                 05003000
OCWCLCD2 EQU   ISTOCW+728                                               05004000
OCWCLCD1 EQU   ISTOCW+726                                               05005000
OCWLALEN EQU   ISTOCW+724                                               05006000
OCWSDVTA EQU   ISTOCW+720                                               05007000
OCWOENIB EQU   ISTOCW+716                                               05008000
OCWSORTP EQU   ISTOCW+712                                               05009000
OCWMDVT  EQU   ISTOCW+708                                               05010000
OCWSDVT  EQU   ISTOCW+704                                               05011000
OCWPREV  EQU   ISTOCW+700                                               05012000
OCWLCPBA EQU   ISTOCW+696                                               05013000
OCWSAVE5 EQU   ISTOCW+552                                               05014000
OCWSAVE4 EQU   ISTOCW+480                                               05015000
OCWSAVE3 EQU   ISTOCW+408                                               05016000
OCWSAVE2 EQU   ISTOCW+336                                               05017000
OCWRSVD  EQU   ISTOCW+212                                               05018000
OCWVPAB  EQU   ISTOCW+208                                               05019000
OCWSWTD7 EQU   OCWSWTD                                                  05020000
OCWSWTD6 EQU   OCWSWTD                                                  05021000
OCWSWTD5 EQU   OCWSWTD                                                  05022000
OCWSWTD4 EQU   OCWSWTD                                                  05023000
OCWSWTD3 EQU   OCWSWTD                                                  05024000
OCWSTCTL EQU   OCWSWTD                                                  05025000
OCWNPOST EQU   OCWSWTD                                                  05026000
OCWCLDEB EQU   OCWSWTD                                                  05027000
OCWVARY  EQU   OCWSWTC                                                  05028000
OCWPRMTR EQU   OCWSWTC                                                  05029000
OCWPBH   EQU   OCWSWTC                                                  05030000
OCWRBH   EQU   OCWSWTC                                                  05031000
OCWCKACE EQU   OCWSWTC                                                  05032000
OCWODCLS EQU   OCWSWTC                                                  05033000
OCWSWTC1 EQU   OCWSWTC                                                  05034000
OCWSPCLS EQU   OCWSWTC                                                  05035000
OCWCSCAL EQU   OCWSWTB                                                  05036000
OCWPSREQ EQU   OCWSWTB                                                  05037000
OCWOLOCK EQU   OCWSWTB                                                  05038000
OCWCOREQ EQU   OCWSWTB                                                  05039000
OCWDOPHY EQU   OCWSWTB                                                  05040000
OCWCLOOP EQU   OCWSWTB                                                  05041000
OCWRECL  EQU   OCWSWTB                                                  05042000
OCWGOFUN EQU   OCWSWTB                                                  05043000
OCWNODLT EQU   OCWSWTA                                                  05044000
OCWODCL  EQU   OCWSWTA                                                  05045000
OCWGODST EQU   OCWSWTA                                                  05046000
OCWSORT  EQU   OCWSWTA                                                  05047000
OCWGOCNT EQU   OCWSWTA                                                  05048000
OCWNOCON EQU   OCWSWTA                                                  05049000
OCWSRT   EQU   OCWSWTA                                                  05050000
OCWGTLST EQU   OCWSWTA                                                  05051000
OCWSCPAD EQU   ISTOCW+176                                               05052000
OCWDNIB  EQU   ISTOCW+112                                               05053000
OCWBADNO EQU   ISTOCW+110                                               05054000
OCWDSTNO EQU   ISTOCW+108                                               05055000
OCWODCT2 EQU   ISTOCW+106                                               05056000
OCWODCT1 EQU   ISTOCW+104                                               05057000
OCWRSV02 EQU   ISTOCW+100                                               05058000
OCWRSV01 EQU   ISTOCW+96                                                05059000
OCWSVEC  EQU   OCWSVCOD+1                                               05060000
OCWSVRC  EQU   OCWSVCOD                                                 05061000
OCWODFST EQU   ISTOCW+88                                                05062000
OCWODNAS EQU   ISTOCW+84                                                05063000
OCWODLST EQU   ISTOCW+80                                                05064000
OCWLPOST EQU   ISTOCW+76                                                05065000
OCWCPOST EQU   ISTOCW+72                                                05066000
OCWFPOST EQU   ISTOCW+68                                                05067000
OCWNCB   EQU   ISTOCW+60                                                05068000
OCWFMCB  EQU   ISTOCW+56                                                05069000
OCWEPTAB EQU   ISTOCW+52                                                05070000
OCWNIB   EQU   ISTOCW+44                                                05071000
OCWDRHOB EQU   OCWDRDTE                                                 05072000
OCWPAB   EQU   ISTOCW+20                                                05073000
OCWRPH   EQU   ISTOCW+16                                                05074000
OCWCHAIN EQU   ISTOCW+8                                                 05075000
OCWPBCHN EQU   ISTOCW+4                                                 05076000
OCWTLEN  EQU   ISTOCW+2                                                 05077000
OCWSLEN  EQU   ISTOCW+1                                                 05078000
OCWID    EQU   ISTOCW                                                   05079000
NIBRESV  EQU   ISTNIB+60                                                05080000
NIBNDAR  EQU   ISTNIB+56                                                05081000
NIBLMODE EQU   ISTNIB+48                                                05082000
NIBEXLST EQU   ISTNIB+44                                                05083000
NIBLIMIT EQU   ISTNIB+42                                                05084000
@NM00067 EQU   ISTNIB+41                                                05085000
@NM00066 EQU   NIBFLG1                                                  05086000
@NM00065 EQU   NIBFLG1                                                  05087000
@NM00064 EQU   NIBFLG1                                                  05088000
@NM00063 EQU   NIBFLG1                                                  05089000
NIBSHLTP EQU   NIBFLG1                                                  05090000
NIBSDAPP EQU   NIBFLG1                                                  05091000
NIBCON   EQU   NIBFLG1                                                  05092000
NIBLAST  EQU   NIBFLG1                                                  05093000
NIBPROCD EQU   ISTNIB+36                                                05094000
NIBDEVCH EQU   ISTNIB+28                                                05095000
NIBMODE  EQU   ISTNIB+20                                                05096000
NIBSYM   EQU   ISTNIB+12                                                05097000
NIBUSER  EQU   ISTNIB+8                                                 05098000
NIBCID   EQU   ISTNIB+4                                                 05099000
NIBLEN   EQU   ISTNIB+3                                                 05100000
NIBCONDN EQU   ISTNIB+2                                                 05101000
NIBRSV01 EQU   ISTNIB+1                                                 05102000
NIBID    EQU   ISTNIB                                                   05103000
CSLDATAF EQU   CSLDATA                                                  05104000
CSLNIBF  EQU   CSLNIB                                                   05105000
CSLRDTEF EQU   CSLRDTE                                                  05106000
BINUSE   EQU   ISTBIND+36                                               05107000
BINUSEL  EQU   ISTBIND+35                                               05108000
BINPRIM  EQU   ISTBIND+27                                               05109000
BINPRIML EQU   ISTBIND+26                                               05110000
BINPRSVC EQU   ISTBIND+7                                                05111000
BINCONR  EQU   BINCMNP2                                                 05112000
BINRCHN  EQU   BINCMNP2                                                 05113000
BINMDIBK EQU   BINCMNP2                                                 05114000
BINBKFS  EQU   BINCMNP2                                                 05115000
BINRCVR  EQU   BINCMNP2                                                 05116000
BINFMTRM EQU   BINCMNP2                                                 05117000
BINRSV04 EQU   BINCMNP                                                  05118000
BINALT   EQU   BINCMNP                                                  05119000
BINBKTR  EQU   BINCMNP                                                  05120000
BINBRAK  EQU   BINCMNP                                                  05121000
BINFMHD  EQU   BINCMNP                                                  05122000
BINRSV03 EQU   BINCMNP                                                  05123000
BINSSEB  EQU   BINSECP                                                  05124000
BINSCMP  EQU   BINSECP                                                  05125000
BINRSV02 EQU   BINSECP                                                  05126000
BINSCHNR EQU   BINSECP                                                  05127000
BINSMCH  EQU   BINSECP                                                  05128000
BINSCHN  EQU   BINSECP                                                  05129000
BINPSEB  EQU   BINPRIP                                                  05130000
BINPCMP  EQU   BINPRIP                                                  05131000
BINRSV01 EQU   BINPRIP                                                  05132000
BINPCHNR EQU   BINPRIP                                                  05133000
BINPMCH  EQU   BINPRIP                                                  05134000
BINPCHN  EQU   BINPRIP                                                  05135000
BINTS    EQU   ISTBIND+2                                                05136000
BINFM    EQU   ISTBIND+1                                                05137000
BINTYPE  EQU   BINFMTY                                                  05138000
BINFMT   EQU   BINFMTY                                                  05139000
DEVRSV03 EQU   ISTDEVCH+5                                               05140000
DEVPHYSA EQU   ISTDEVCH+4                                               05141000
DEVCSLPN EQU   DEVCHAR3                                                 05142000
DEVCSTCL EQU   DEVCHAR3                                                 05143000
DEVCCHEK EQU   DEVCHAR3                                                 05144000
DEVCATTN EQU   DEVCHAR3                                                 05145000
DEVCSWL  EQU   DEVFCCTL                                                 05146000
DEVCRVB  EQU   DEVFCCTL                                                 05147000
DEVCSSL  EQU   DEVFCCTL                                                 05148000
DEVCBSC  EQU   DEVFCCTL                                                 05149000
DEVMCODE EQU   ISTDEVCH+2                                               05150000
DEVCHAR2 EQU   DEVTCODE                                                 05151000
DEVRSV01 EQU   DEVCHAR                                                  05152000
DEVCCTL  EQU   DEVCHAR                                                  05153000
DEVNNSPT EQU   DEVCHAR                                                  05154000
DEVSPS   EQU   DEVCHAR                                                  05155000
DEVSUBND EQU   DEVCHAR                                                  05156000
DEVCONVR EQU   DEVCHAR                                                  05157000
DEVOTPUT EQU   DEVCHAR                                                  05158000
DEVINPUT EQU   DEVCHAR                                                  05159000
PROSRDEF EQU   PROSETM4                                                 05160000
PRORSV47 EQU   PROSETM4                                                 05161000
PROSCON  EQU   PROSETM4                                                 05162000
PRORSV46 EQU   PROSETM3                                                 05163000
PROSMONT EQU   PROSETM3                                                 05164000
PRORSV45 EQU   PROSETM3                                                 05165000
PROSNTO  EQU   PROSETM3                                                 05166000
PRORSV44 EQU   PROSETM3                                                 05167000
PRORSV43 EQU   PROSETM2                                                 05168000
PROSNTFL EQU   PROSETM2                                                 05169000
PRORSV42 EQU   PROSETM2                                                 05170000
PRORSV41 EQU   PROPROCS                                                 05171000
PROMODC  EQU   PROPROC4                                                 05172000
PROMODT  EQU   PROPROC4                                                 05173000
PROMODM  EQU   PROPROC4                                                 05174000
PROMODB  EQU   PROPROC4                                                 05175000
PRORSV14 EQU   PROPROC4                                                 05176000
PRORSV13 EQU   PROPROC4                                                 05177000
PRORSV12 EQU   PROPROC4                                                 05178000
PROEIB   EQU   PROPROC4                                                 05179000
PRORSV11 EQU   PROPROC3                                                 05180000
PROMONT2 EQU   PROPROC3                                                 05181000
PROMONIT EQU   PROPROC3                                                 05182000
PROSUBLK EQU   PROPROC3                                                 05183000
PRONTO   EQU   PROPROC3                                                 05184000
PROLGIN  EQU   PROPROC3                                                 05185000
PROERPI  EQU   PROPROC3                                                 05186000
PRORSV07 EQU   PROPROC3                                                 05187000
PROCFTX  EQU   PROPROC2                                                 05188000
PROEMLC  EQU   PROPROC2                                                 05189000
PRONTFL  EQU   PROPROC2                                                 05190000
PRORSV05 EQU   PROPROC2                                                 05191000
PRORSV04 EQU   PROPROC2                                                 05192000
PROLGOT  EQU   PROPROC2                                                 05193000
PROERPO  EQU   PROPROC2                                                 05194000
PRORSV03 EQU   PROPROC2                                                 05195000
PRORPLC  EQU   PROPROC1                                                 05196000
PROCS    EQU   PROPROC1                                                 05197000
PROCA    EQU   PROPROC1                                                 05198000
PRORESPX EQU   PROPROC1                                                 05199000
PRODFASY EQU   PROPROC1                                                 05200000
PROXPOPT EQU   PROPROC1                                                 05201000
PROTRUNC EQU   PROPROC1                                                 05202000
PROASYIP EQU   PROPROC1                                                 05203000
ICERSC2B EQU   ISTICE+36                                                05204000
ICEUECBX EQU   ISTICE+32                                                05205000
@NM00062 EQU   ISTICE+29                                                05206000
@NM00061 EQU   ICEFLAGS                                                 05207000
ICESTAPR EQU   ICEFLAGS                                                 05208000
ICERSC2F EQU   ICEFLAGS                                                 05209000
ICELGON  EQU   ICEFLAGS                                                 05210000
ICEICX   EQU   ICEFLAGS                                                 05211000
ICESPEC  EQU   ICEFLAGS                                                 05212000
ICERPHA  EQU   ISTICE+24                                                05213000
ICESIDE  EQU   ISTICE+16                                                05214000
ICEOBJQ  EQU   ISTICE+12                                                05215000
ICESUBJ  EQU   ISTICE                                                   05216000
CSPRSC2B EQU   ISTCSP+32                                                05217000
CSPTRDTE EQU   ISTCSP+28                                                05218000
CSPRLRPH EQU   ISTCSP+24                                                05219000
CSPNO    EQU   ISTCSP+22                                                05220000
CSPDATA  EQU   ISTCSP+16                                                05221000
CSPSRC   EQU   ISTCSP+4                                                 05222000
@NM00060 EQU   CSPOPT2                                                  05223000
CSPRSC2F EQU   CSPOPT2                                                  05224000
CSPWASQD EQU   CSPOPT2                                                  05225000
CSPACQS  EQU   CSPOPT2                                                  05226000
CSPACES  EQU   CSPOPT2                                                  05227000
CSPNOREL EQU   CSPOPT2                                                  05228000
CSPCOREQ EQU   CSPOPT2                                                  05229000
CSPSTAP  EQU   CSPOPT2                                                  05230000
@NM00059 EQU   CSPOPT1                                                  05231000
CSPANY   EQU   CSPOPT1                                                  05232000
CSPACT   EQU   CSPOPT1                                                  05233000
CSPSESS  EQU   CSPOPT1                                                  05234000
CSPPND   EQU   CSPOPT1                                                  05235000
CSPLOGI  EQU   CSPOPT1                                                  05236000
CSPQ     EQU   CSPOPT1                                                  05237000
CSPRSC   EQU   CSPOPT1                                                  05238000
PABRPHA  EQU   PABRPHFG+1                                               05239000
PABNODQ  EQU   PABFLAGS                                                 05240000
PABINHBT EQU   PABFLAGS                                                 05241000
PABERLOK EQU   PABERRLK                                                 05242000
PABSSN   EQU   PABFLAGS                                                 05243000
PABDYNAM EQU   PABFLAGS                                                 05244000
PABNORPR EQU   PABFLAGS                                                 05245000
PABPRIOR EQU   PABFLAGS                                                 05246000
PABCHNGP EQU   PABCHAIN+1                                               05247000
PABRSV02 EQU   PABCHAIN                                                 05248000
PABRUNNG EQU   PABCHAIN                                                 05249000
PABRESET EQU   PABCHAIN                                                 05250000
PABUNCON EQU   PABCHAIN                                                 05251000
PABCDP   EQU   PABCHAIN                                                 05252000
PABRESCH EQU   PABCHAIN                                                 05253000
PABCHNG  EQU   PABCHAIN                                                 05254000
PABWEQP  EQU   PABWEQA+1                                                05255000
PABRSV01 EQU   PABWEQA                                                  05256000
PABWEQG  EQU   PABWEQA                                                  05257000
@NM00058 EQU   ACBVTEXT+8                                               05258000
@NM00057 EQU   ACBVTEXT+6                                               05259000
ACBRTN   EQU   ACBVTEXT                                                 05260000
ACBAPID  EQU   ACBCOMN+72                                               05261000
ACBCBMWA EQU   ACBCOMN+68                                               05262000
ACBUAPTR EQU   ACBCOMN+64                                               05263000
ACBLRECL EQU   ACBCOMN+62                                               05264000
ACBMSGLN EQU   ACBBLKSZ                                                 05265000
ACBBUFSP EQU   ACBCOMN+56                                               05266000
@NM00056 EQU   ACBUJFCB+1                                               05267000
ACBOPTN  EQU   ACBUJFCB                                                 05268000
@NM00055 EQU   ACBINFLG+1                                               05269000
ACBBYPSS EQU   ACBINFLG                                                 05270000
ACBSDS   EQU   ACBVVIC                                                  05271000
ACBUCRA  EQU   ACBINFLG                                                 05272000
ACBSCRA  EQU   ACBINFLG                                                 05273000
ACBCAT   EQU   ACBINFLG                                                 05274000
ACBIJRQE EQU   ACBINFLG                                                 05275000
ACBJEPS  EQU   ACBINFLG                                                 05276000
@NM00054 EQU   ACBINFLG                                                 05277000
ACBERFLG EQU   ACBCOMN+49                                               05278000
ACBBUSY  EQU   ACBIOSFG                                                 05279000
ACBLOCK  EQU   ACBEXFG                                                  05280000
@NM00053 EQU   ACBOFLGS                                                 05281000
ACBDSERR EQU   ACBOFLGS                                                 05282000
ACBOPEN  EQU   ACBOFLGS                                                 05283000
ACBEOV   EQU   ACBOFLGS                                                 05284000
@NM00052 EQU   ACBOFLGS                                                 05285000
ACBDEB   EQU   ACBDDNM+5                                                05286000
ACBERFL  EQU   ACBDDNM+4                                                05287000
ACBAM    EQU   ACBAMETH                                                 05288000
ACBINFL  EQU   ACBDDNM+2                                                05289000
ACBTIOT  EQU   ACBDDNM                                                  05290000
ACBPASSW EQU   ACBCOMN+32                                               05291000
ACBMSGAR EQU   ACBCOMN+28                                               05292000
@NM00051 EQU   ACBDSORG+1                                               05293000
ACBDORGA EQU   ACBDSORG+1                                               05294000
@NM00050 EQU   ACBDSORG                                                 05295000
ACBOPTJ  EQU   ACBDVIND                                                 05296000
ACBCRNRE EQU   ACBCROPS                                                 05297000
ACBCRNCK EQU   ACBCROPS                                                 05298000
ACBASA   EQU   ACBCCTYP                                                 05299000
@NM00049 EQU   ACBCCTYP                                                 05300000
ACBTRCID EQU   ACBCCTYP                                                 05301000
@NM00048 EQU   ACBRECFM                                                 05302000
ACBRECAF EQU   ACBRECFM                                                 05303000
ACBJBUF  EQU   ACBBUFPL+2                                               05304000
ACBMACR4 EQU   ACBBUFPL+1                                               05305000
@NM00047 EQU   ACBMACR3                                                 05306000
ACBNCFX  EQU   ACBMACR3                                                 05307000
ACBSIS   EQU   ACBMACR3                                                 05308000
ACBDFR   EQU   ACBMACR3                                                 05309000
ACBICI   EQU   ACBMACR3                                                 05310000
ACBGSR   EQU   ACBMACR3                                                 05311000
ACBLSR   EQU   ACBMACR3                                                 05312000
@NM00046 EQU   ACBMACR3                                                 05313000
ACBBUFNI EQU   ACBCOMN+18                                               05314000
ACBBUFND EQU   ACBCOMN+16                                               05315000
ACBSTRNO EQU   ACBCOMN+15                                               05316000
ACBBSTNO EQU   ACBCOMN+14                                               05317000
ACBAIX   EQU   ACBMACR2                                                 05318000
ACBDSN   EQU   ACBMACR2                                                 05319000
ACBRST   EQU   ACBMACR2                                                 05320000
ACBLOGON EQU   ACBMACR2                                                 05321000
ACBSKP   EQU   ACBMACR2                                                 05322000
@NM00045 EQU   ACBMACR2                                                 05323000
ACBUBF   EQU   ACBMACR1                                                 05324000
ACBOUT   EQU   ACBMACR1                                                 05325000
ACBIN    EQU   ACBMACR1                                                 05326000
ACBDIR   EQU   ACBMACR1                                                 05327000
ACBSEQ   EQU   ACBMACR1                                                 05328000
ACBBLK   EQU   ACBCNV                                                   05329000
ACBADD   EQU   ACBADR                                                   05330000
ACBKEY   EQU   ACBMACR1                                                 05331000
ACBINRTN EQU   ACBCOMN+8                                                05332000
ACBIBCT  EQU   ACBJWA                                                   05333000
ACBLEN2  EQU   ACBLENG2                                                 05334000
ACBSTYP  EQU   ACBCOMN+1                                                05335000
ACBID    EQU   ACBCOMN                                                  05336000
EXLEADDR EQU   EXLEXITP                                                 05337000
@NM00044 EQU   EXLENFL                                                  05338000
EXLLNK   EQU   EXLENFL                                                  05339000
EXLACTM  EQU   EXLENFL                                                  05340000
EXLSPEC  EQU   EXLENFL                                                  05341000
EXLRESPP EQU   EXLRESP+1                                                05342000
@NM00043 EQU   EXLRESPF                                                 05343000
EXLRESPK EQU   EXLRESPF                                                 05344000
EXLRESPA EQU   EXLRESPF                                                 05345000
EXLRESPS EQU   EXLRESPF                                                 05346000
EXLDFASP EQU   EXLDFAS+1                                                05347000
@NM00042 EQU   EXLDFASF                                                 05348000
EXLDFASK EQU   EXLDFASF                                                 05349000
EXLDFASA EQU   EXLDFASF                                                 05350000
EXLDFASS EQU   EXLDFASF                                                 05351000
EXLTPNDP EQU   EXLVTEXT+21                                              05352000
@NM00041 EQU   EXLTPNDF                                                 05353000
EXLTPNDK EQU   EXLTPNDF                                                 05354000
EXLTPNDA EQU   EXLTPNDF                                                 05355000
EXLTPNDS EQU   EXLTPNDF                                                 05356000
EXLATTNP EQU   EXLVTEXT+16                                              05357000
@NM00040 EQU   EXLATTNF                                                 05358000
EXLATTNK EQU   EXLATTNF                                                 05359000
EXLATTNA EQU   EXLATTNF                                                 05360000
EXLATTNS EQU   EXLATTNF                                                 05361000
@NM00039 EQU   EXLVTEXT+10                                              05362000
EXLRLRQP EQU   EXLVTEXT+6                                               05363000
@NM00038 EQU   EXLRLRQF                                                 05364000
EXLRLRQK EQU   EXLRLRQF                                                 05365000
EXLRLRQA EQU   EXLRLRQF                                                 05366000
EXLRLRQS EQU   EXLRLRQF                                                 05367000
EXLNLGNP EQU   EXLVTEXT+1                                               05368000
@NM00037 EQU   EXLNLGNF                                                 05369000
EXLNLGNK EQU   EXLNLGNF                                                 05370000
EXLNLGNA EQU   EXLNLGNF                                                 05371000
EXLNLGNS EQU   EXLNLGNF                                                 05372000
EXLOPNP  EQU   EXLCOMN+36                                               05373000
@NM00036 EQU   EXLOPNF                                                  05374000
EXLOPNK  EQU   EXLOPNF                                                  05375000
EXLOPNA  EQU   EXLOPNF                                                  05376000
EXLOPNS  EQU   EXLOPNF                                                  05377000
EXLJRNP  EQU   EXLCOMN+31                                               05378000
@NM00035 EQU   EXLJRNF                                                  05379000
EXLJRNK  EQU   EXLJRNF                                                  05380000
EXLJRNA  EQU   EXLJRNF                                                  05381000
EXLJRNS  EQU   EXLJRNF                                                  05382000
@NM00034 EQU   EXLLGNF                                                  05383000
EXLLGNK  EQU   EXLLGNF                                                  05384000
EXLLGNA  EQU   EXLLGNF                                                  05385000
EXLLGNS  EQU   EXLLGNF                                                  05386000
EXLSCIPP EQU   EXLCOMN+21                                               05387000
@NM00033 EQU   EXLSCIPF                                                 05388000
EXLSCIPK EQU   EXLSCIPF                                                 05389000
EXLSCIPA EQU   EXLSCIPF                                                 05390000
EXLSCIPS EQU   EXLSCIPF                                                 05391000
EXLLERP  EQU   EXLCOMN+16                                               05392000
@NM00032 EQU   EXLLERF                                                  05393000
EXLLERK  EQU   EXLLERF                                                  05394000
EXLLERA  EQU   EXLLERF                                                  05395000
EXLLERS  EQU   EXLLERF                                                  05396000
EXLSYNP  EQU   EXLCOMN+11                                               05397000
@NM00031 EQU   EXLSYNF                                                  05398000
EXLSYNK  EQU   EXLSYNF                                                  05399000
EXLSYNA  EQU   EXLSYNF                                                  05400000
EXLSYNS  EQU   EXLSYNF                                                  05401000
EXLEODP  EQU   EXLCOMN+6                                                05402000
@NM00030 EQU   EXLEODF                                                  05403000
EXLEODK  EQU   EXLEODF                                                  05404000
EXLEODA  EQU   EXLEODF                                                  05405000
EXLEODS  EQU   EXLEODF                                                  05406000
@NM00029 EQU   EXLCOMN+4                                                05407000
EXLLEN2  EQU   EXLLEN                                                   05408000
EXLSTYP  EQU   EXLCOMN+1                                                05409000
EXLID    EQU   EXLCOMN                                                  05410000
RPLSEQNO EQU   RPLOF60+6                                                05411000
@NM00028 EQU   RPLIBSQ                                                  05412000
RPLIINV  EQU   RPLIBSQ                                                  05413000
RPLINEG  EQU   RPLIBSQ                                                  05414000
RPLIPOS  EQU   RPLIBSQ                                                  05415000
RPLIIGN  EQU   RPLIBSQ                                                  05416000
RPLIRSET EQU   RPLIBSQ                                                  05417000
RPLITST  EQU   RPLIBSQ                                                  05418000
RPLISET  EQU   RPLIBSQ                                                  05419000
@NM00027 EQU   RPLOBSQ                                                  05420000
RPLOINV  EQU   RPLOBSQ                                                  05421000
RPLONEG  EQU   RPLOBSQ                                                  05422000
RPLOPOS  EQU   RPLOBSQ                                                  05423000
RPLOIGN  EQU   RPLOBSQ                                                  05424000
RPLORSET EQU   RPLOBSQ                                                  05425000
RPLOTST  EQU   RPLOBSQ                                                  05426000
RPLOSET  EQU   RPLOBSQ                                                  05427000
RPLIBSQV EQU   RPLOF60+2                                                05428000
RPLOBSQV EQU   RPLOF60                                                  05429000
@NM00026 EQU   RPLCNTSC                                                 05430000
RPLRSHUT EQU   RPLCNTSC                                                 05431000
RPLRQR   EQU   RPLCNTSC                                                 05432000
RPLSHUTC EQU   RPLCNTSC                                                 05433000
RPLSHUTD EQU   RPLCNTSC                                                 05434000
RPLSTSN  EQU   RPLCNTSC                                                 05435000
RPLCLEAR EQU   RPLCNTSC                                                 05436000
RPLSDT   EQU   RPLCNTSC                                                 05437000
@NM00025 EQU   RPLCNTDC                                                 05438000
RPLSIGNL EQU   RPLCNTDC                                                 05439000
RPLLUS   EQU   RPLCNTDC                                                 05440000
RPLRTR   EQU   RPLCNTDC                                                 05441000
RPLBID   EQU   RPLCNTDC                                                 05442000
@NM00024 EQU   RPLCNTDF                                                 05443000
RPLQI    EQU   RPLCNTDF                                                 05444000
RPLRELQ  EQU   RPLCNTDF                                                 05445000
RPLCHASE EQU   RPLCNTDF                                                 05446000
RPLQEC   EQU   RPLCNTDF                                                 05447000
RPLQC    EQU   RPLCNTDF                                                 05448000
RPLCNCEL EQU   RPLCNTDF                                                 05449000
RPLDATA  EQU   RPLCNTDF                                                 05450000
RPLRRN   EQU   RPLRESP                                                  05451000
RPLNFME  EQU   RPLRESP                                                  05452000
RPLEX    EQU   RPLRESP                                                  05453000
@NM00023 EQU   RPLRESP                                                  05454000
@NM00022 EQU   RPLPOSTV                                                 05455000
RPLSCHED EQU   RPLPOSTV                                                 05456000
@NM00021 EQU   RPLVTFL1                                                 05457000
RPLAUTUS EQU   RPLVTFL1                                                 05458000
RPLVTUSE EQU   RPLVTFL1                                                 05459000
@NM00020 EQU   RPLVTFL1                                                 05460000
@NM00019 EQU   RPLCHN                                                   05461000
RPLONLY  EQU   RPLCHN                                                   05462000
RPLLAST  EQU   RPLCHN                                                   05463000
RPLMIDLE EQU   RPLCHN                                                   05464000
RPLFIRST EQU   RPLCHN                                                   05465000
@NM00018 EQU   RPLRTYPE                                                 05466000
RPLDFASY EQU   RPLRTYPE                                                 05467000
RPLNFSYN EQU   RPLRTYPE                                                 05468000
RPLRRESP EQU   RPLRTYPE                                                 05469000
@NM00017 EQU   RPLSTYPE                                                 05470000
RPLSRESP EQU   RPLSTYPE                                                 05471000
@NM00016 EQU   RPLRH3                                                   05472000
RPLCSI   EQU   RPLRH3                                                   05473000
RPLCHREQ EQU   RPLRH3                                                   05474000
RPLCMD   EQU   RPLRH3                                                   05475000
RPLEB    EQU   RPLRH3                                                   05476000
RPLBB    EQU   RPLRH3                                                   05477000
RPLSIGDA EQU   RPLVTEXT+32                                              05478000
RPLSAV13 EQU   RPLVTEXT+28                                              05479000
RPLUSNSO EQU   RPLOSENS+2                                               05480000
RPLSSMO  EQU   RPLSSNSO+1                                               05481000
@NM00015 EQU   RPLSSEO                                                  05482000
RPLRRO   EQU   RPLSSEO                                                  05483000
RPLFIO   EQU   RPLSSEO                                                  05484000
RPLSTATO EQU   RPLSSEO                                                  05485000
RPLCPMO  EQU   RPLSSEO                                                  05486000
@NM00014 EQU   RPLSSEO                                                  05487000
RPLFMHDR EQU   RPLOPT12                                                 05488000
@NM00013 EQU   RPLOPT12                                                 05489000
@NM00012 EQU   RPLOPT12                                                 05490000
@NM00011 EQU   RPLOPT12                                                 05491000
RPLNIBTK EQU   RPLOPT12                                                 05492000
RPLTRUNC EQU   RPLOPT12                                                 05493000
RPLKEEP  EQU   RPLOPT12                                                 05494000
@NM00010 EQU   RPLOPT12                                                 05495000
RPLRSVE8 EQU   RPLOPT11                                                 05496000
RPLRSVE7 EQU   RPLOPT11                                                 05497000
RPLRSVE6 EQU   RPLOPT11                                                 05498000
RPLRSVE5 EQU   RPLOPT11                                                 05499000
RPLRSVE4 EQU   RPLOPT11                                                 05500000
RPLRSVI6 EQU   RPLOPT10                                                 05501000
RPLRSVI5 EQU   RPLOPT10                                                 05502000
RPLRSVI4 EQU   RPLOPT10                                                 05503000
RPLRSVI3 EQU   RPLOPT10                                                 05504000
RPLRSVI2 EQU   RPLOPT10                                                 05505000
RPLSPARM EQU   RPLOPT10                                                 05506000
RPLDSPLY EQU   RPLOPT10                                                 05507000
RPLBSCID EQU   RPLOPT10                                                 05508000
RPLTOPL  EQU   RPLOPT9                                                  05509000
RPLCIDE  EQU   RPLOPT9                                                  05510000
RPLRNNM  EQU   RPLOPT9                                                  05511000
RPLAPPST EQU   RPLOPT9                                                  05512000
RPLCOUNT EQU   RPLOPT9                                                  05513000
RPLTERMS EQU   RPLOPT9                                                  05514000
RPLDEVCH EQU   RPLOPT9                                                  05515000
RPLLOGON EQU   RPLOPT9                                                  05516000
RPLUSFLD EQU   RPLVTEXT+16                                              05517000
RPLESR2  EQU   RPLUSNSI+1                                               05518000
RPLESR1  EQU   RPLUSNSI                                                 05519000
RPLSSMI  EQU   RPLDSB2                                                  05520000
@NM00009 EQU   RPLSSEI                                                  05521000
RPLRRI   EQU   RPLSSEI                                                  05522000
RPLFII   EQU   RPLSSEI                                                  05523000
RPLSTATI EQU   RPLSSEI                                                  05524000
RPLCPMI  EQU   RPLSSEI                                                  05525000
RPLPATHI EQU   RPLSSEI                                                  05526000
RPLARCLN EQU   RPLVTEXT+8                                               05527000
RPLAARLN EQU   RPLVTEXT+4                                               05528000
RPLAAREA EQU   RPLVTEXT                                                 05529000
RPLERMSA EQU   RPLCOMN+72                                               05530000
RPLEMLEN EQU   RPLCOMN+70                                               05531000
RPLACTIV EQU   RPLCOMN+69                                               05532000
RPLBRANC EQU   RPLEXTD1                                                 05533000
RPLNIB   EQU   RPLEXTD1                                                 05534000
@NM00008 EQU   RPLEXTD1                                                 05535000
RPLEXIT  EQU   RPLEXTD1                                                 05536000
RPLNEXIT EQU   RPLEXTD1                                                 05537000
RPLEXSCH EQU   RPLEXTD1                                                 05538000
RPLDDDD  EQU   RPLRBAR+4                                                05539000
@NM00007 EQU   RPLRBAR+3                                                05540000
@NM00006 EQU   RPLAIXID                                                 05541000
RPLAXPKP EQU   RPLAIXID                                                 05542000
RPLAIXPC EQU   RPLRBAR                                                  05543000
RPLRSV88 EQU   RPLOPT8                                                  05544000
RPLUNCON EQU   RPLOPT8                                                  05545000
RPLACTV  EQU   RPLOPT8                                                  05546000
RPLSESS  EQU   RPLOPT8                                                  05547000
RPLPEND  EQU   RPLOPT8                                                  05548000
RPLODPRM EQU   RPLOPT8                                                  05549000
RPLODACP EQU   RPLOPT8                                                  05550000
RPLODACQ EQU   RPLOPT8                                                  05551000
RPLRSV78 EQU   RPLOPT7                                                  05552000
RPLRSV77 EQU   RPLOPT7                                                  05553000
RPLRLSOP EQU   RPLOPT7                                                  05554000
RPLTPOST EQU   RPLOPT7                                                  05555000
RPLQOPT  EQU   RPLOPT7                                                  05556000
RPLCNIMM EQU   RPLCNOPT                                                 05557000
RPLCNANY EQU   RPLCNOPT                                                 05558000
RPLCNALL EQU   RPLCNOPT                                                 05559000
RPLRSV68 EQU   RPLOPT6                                                  05560000
RPLRSV67 EQU   RPLOPT6                                                  05561000
RPLLOCK  EQU   RPLOPT6                                                  05562000
RPLNCOND EQU   RPLOPT6                                                  05563000
RPLCOND  EQU   RPLOPT6                                                  05564000
RPLEOT   EQU   RPLUNTYP                                                 05565000
RPLEOM   EQU   RPLUNTYP                                                 05566000
RPLEOB   EQU   RPLUNTYP                                                 05567000
RPLWROPT EQU   RPLOPT5                                                  05568000
RPLNODE  EQU   RPLOPT5                                                  05569000
RPLERACE EQU   RPLWRTYP                                                 05570000
RPLEAU   EQU   RPLWRTYP                                                 05571000
RPLNERAS EQU   RPLWRTYP                                                 05572000
RPLPSOPT EQU   RPLOPT5                                                  05573000
@NM00005 EQU   RPLOPT5                                                  05574000
RPLDLGIN EQU   RPLOPT5                                                  05575000
RPLBUFL  EQU   RPLCOMN+52                                               05576000
RPLRLEN  EQU   RPLCOMN+48                                               05577000
RPLCHAIN EQU   RPLNXTRP                                                 05578000
RPLBOP   EQU   RPLOPT4                                                  05579000
@NM00004 EQU   RPLOPT4                                                  05580000
RPLMKFRM EQU   RPLOPT4                                                  05581000
RPLENDTR EQU   RPLOPT4                                                  05582000
RPLALIGN EQU   RPLOPT3                                                  05583000
RPLFMT   EQU   RPLOPT3                                                  05584000
RPLFLD   EQU   RPLOPT3                                                  05585000
RPLVFY   EQU   RPLOPT3                                                  05586000
RPLBLK   EQU   RPLOPT3                                                  05587000
RPLSFORM EQU   RPLOPT3                                                  05588000
RPLEODS  EQU   RPLOPT3                                                  05589000
RPLNSP   EQU   RPLOPT2                                                  05590000
RPLUPD   EQU   RPLOPT2                                                  05591000
@NM00003 EQU   RPLOPT2                                                  05592000
RPLLRD   EQU   RPLOPT2                                                  05593000
RPLBWD   EQU   RPLOPT2                                                  05594000
RPLCNV   EQU   RPLOPT2                                                  05595000
RPLADD   EQU   RPLADR                                                   05596000
RPLKEY   EQU   RPLOPT2                                                  05597000
RPLECBIN EQU   RPLECBSW                                                 05598000
RPLGEN   EQU   RPLOPT1                                                  05599000
RPLKGE   EQU   RPLOPT1                                                  05600000
RPLASY   EQU   RPLOPT1                                                  05601000
RPLSKP   EQU   RPLOPT1                                                  05602000
RPLSEQ   EQU   RPLOPT1                                                  05603000
RPLDIR   EQU   RPLOPT1                                                  05604000
RPLLOC   EQU   RPLOPT1                                                  05605000
RPLDAF   EQU   RPLARG+2                                                 05606000
RPLSAF   EQU   RPLARG                                                   05607000
RPLAREA  EQU   RPLCOMN+32                                               05608000
RPLTCBPT EQU   RPLCOMN+28                                               05609000
RPLDACB  EQU   RPLCOMN+24                                               05610000
RPLCCHAR EQU   RPLCOMN+20                                               05611000
RPLSTRID EQU   RPLCOMN+18                                               05612000
RPLKEYL  EQU   RPLKEYLE                                                 05613000
RPLRDSOH EQU   RPLFDB3                                                  05614000
RPLRLG   EQU   RPLFDB3                                                  05615000
RPLLGFRC EQU   RPLFDB3                                                  05616000
RPLREOT  EQU   RPLFDB3                                                  05617000
RPLREOM  EQU   RPLFDB3                                                  05618000
RPLREOB  EQU   RPLFDB3                                                  05619000
RPLSV32  EQU   RPLFDB3                                                  05620000
RPLUINPT EQU   RPLFDB3                                                  05621000
RPLSTSAV EQU   RPLFDB2                                                  05622000
RPLCUERR EQU   RPLFDB2                                                  05623000
RPLDLGFL EQU   RPLFDB2                                                  05624000
RPLIOERR EQU   RPLFDB2                                                  05625000
RPLDVUNS EQU   RPLFDB2                                                  05626000
RPLATND  EQU   RPLFDB2                                                  05627000
RPLRVID  EQU   RPLFDB2                                                  05628000
RPLERLK  EQU   RPLFDB2                                                  05629000
RPLERREG EQU   RPLRTNCD                                                 05630000
RPLSTAT  EQU   RPLFDBWD                                                 05631000
RPLPOST  EQU   RPLECB                                                   05632000
RPLWAIT  EQU   RPLECB                                                   05633000
RPLPLHPT EQU   RPLCOMN+4                                                05634000
RPLLEN2  EQU   RPLLEN                                                   05635000
RPLREQ   EQU   RPLIDWD+2                                                05636000
RPLSTYP  EQU   RPLIDWD+1                                                05637000
RPLID    EQU   RPLIDWD                                                  05638000
CVTLEVL  EQU   CVTRELNO+2                                               05639000
CVTNUMB  EQU   CVTRELNO                                                 05640000
CVTMDL   EQU   CVTFIX+250                                               05641000
@NM00002 EQU   CVTFIX+248                                               05642000
@NM00001 EQU   CVTFIX                                                   05643000
CVTRV482 EQU   CVTXTNT2+128                                             05644000
CVTRV481 EQU   CVTXTNT2+124                                             05645000
CVTRV480 EQU   CVTXTNT2+120                                             05646000
CVTRV479 EQU   CVTXTNT2+118                                             05647000
CVTRV478 EQU   CVTXTNT2+117                                             05648000
CVTRV477 EQU   CVTXTNT2+116                                             05649000
CVTRV476 EQU   CVTXTNT2+115                                             05650000
CVTRV475 EQU   CVTXTNT2+114                                             05651000
CVTRV474 EQU   CVTRV466                                                 05652000
CVTRV473 EQU   CVTRV466                                                 05653000
CVTRV472 EQU   CVTRV466                                                 05654000
CVTRV471 EQU   CVTRV466                                                 05655000
CVTRV470 EQU   CVTRV466                                                 05656000
CVTRV469 EQU   CVTRV466                                                 05657000
CVTRV468 EQU   CVTRV466                                                 05658000
CVTRV467 EQU   CVTRV466                                                 05659000
CVTRV465 EQU   CVTRV457                                                 05660000
CVTRV464 EQU   CVTRV457                                                 05661000
CVTRV463 EQU   CVTRV457                                                 05662000
CVTRV462 EQU   CVTRV457                                                 05663000
CVTRV461 EQU   CVTRV457                                                 05664000
CVTRV460 EQU   CVTRV457                                                 05665000
CVTRV459 EQU   CVTRV457                                                 05666000
CVTRV458 EQU   CVTRV457                                                 05667000
CVTRV456 EQU   CVTXTNT2+108                                             05668000
CVTRV455 EQU   CVTXTNT2+104                                             05669000
CVTRV454 EQU   CVTXTNT2+100                                             05670000
CVTRV453 EQU   CVTXTNT2+96                                              05671000
CVTRV452 EQU   CVTXTNT2+94                                              05672000
CVTRV451 EQU   CVTXTNT2+92                                              05673000
CVTRV450 EQU   CVTXTNT2+90                                              05674000
CVTRV449 EQU   CVTXTNT2+88                                              05675000
CVTRV448 EQU   CVTXTNT2+87                                              05676000
CVTRV447 EQU   CVTXTNT2+86                                              05677000
CVTRV446 EQU   CVTRV438                                                 05678000
CVTRV445 EQU   CVTRV438                                                 05679000
CVTRV444 EQU   CVTRV438                                                 05680000
CVTRV443 EQU   CVTRV438                                                 05681000
CVTRV442 EQU   CVTRV438                                                 05682000
CVTRV441 EQU   CVTRV438                                                 05683000
CVTRV440 EQU   CVTRV438                                                 05684000
CVTRV439 EQU   CVTRV438                                                 05685000
CVTRV437 EQU   CVTRV429                                                 05686000
CVTRV436 EQU   CVTRV429                                                 05687000
CVTRV435 EQU   CVTRV429                                                 05688000
CVTRV434 EQU   CVTRV429                                                 05689000
CVTRV433 EQU   CVTRV429                                                 05690000
CVTRV432 EQU   CVTRV429                                                 05691000
CVTRV431 EQU   CVTRV429                                                 05692000
CVTRV430 EQU   CVTRV429                                                 05693000
CVTRV428 EQU   CVTXTNT2+80                                              05694000
CVTRV427 EQU   CVTXTNT2+76                                              05695000
CVTRV426 EQU   CVTXTNT2+72                                              05696000
CVTRV425 EQU   CVTXTNT2+68                                              05697000
CVTATACT EQU   CVTATCVT                                                 05698000
CVTRV423 EQU   CVTXTNT2+62                                              05699000
CVTRV422 EQU   CVTXTNT2+60                                              05700000
CVTRV421 EQU   CVTXTNT2+58                                              05701000
CVTRV420 EQU   CVTXTNT2+56                                              05702000
CVTRV419 EQU   CVTXTNT2+55                                              05703000
CVTRV418 EQU   CVTXTNT2+54                                              05704000
CVTRV417 EQU   CVTRV409                                                 05705000
CVTRV416 EQU   CVTRV409                                                 05706000
CVTRV415 EQU   CVTRV409                                                 05707000
CVTRV414 EQU   CVTRV409                                                 05708000
CVTRV413 EQU   CVTRV409                                                 05709000
CVTRV412 EQU   CVTRV409                                                 05710000
CVTRV411 EQU   CVTRV409                                                 05711000
CVTRV410 EQU   CVTRV409                                                 05712000
CVTRV408 EQU   CVTRV400                                                 05713000
CVTRV407 EQU   CVTRV400                                                 05714000
CVTRV406 EQU   CVTRV400                                                 05715000
CVTRV405 EQU   CVTRV400                                                 05716000
CVTRV404 EQU   CVTRV400                                                 05717000
CVTRV403 EQU   CVTRV400                                                 05718000
CVTRV402 EQU   CVTRV400                                                 05719000
CVTRV401 EQU   CVTRV400                                                 05720000
CVTICB   EQU   CVTXTNT2+48                                              05721000
CVTSKTA  EQU   CVTXTNT2+44                                              05722000
CVTSHSB  EQU   CVTSHS                                                   05723000
CVTRSV98 EQU   CVTXTNT2+36                                              05724000
CVTRSV97 EQU   CVTXTNT2+34                                              05725000
CVTRSV96 EQU   CVTXTNT2+32                                              05726000
CVTOLTEP EQU   CVTXTNT2+28                                              05727000
CVTQIDA  EQU   CVTQID+1                                                 05728000
CVTRSV95 EQU   CVTQID                                                   05729000
CVTRSV94 EQU   CVTXTNT2+20                                              05730000
CVTRSV93 EQU   CVTXTNT2+16                                              05731000
CVTRSV92 EQU   CVTXTNT2+12                                              05732000
CVTDEBVR EQU   CVTXTNT2+8                                               05733000
CVTRSV91 EQU   CVTXTNT2+6                                               05734000
CVTRSV9H EQU   CVTFLGBT                                                 05735000
CVTRSV9G EQU   CVTFLGBT                                                 05736000
CVTRSV9F EQU   CVTFLGBT                                                 05737000
CVTRSV9E EQU   CVTFLGBT                                                 05738000
CVTRSV9D EQU   CVTFLGBT                                                 05739000
CVTRSV9C EQU   CVTFLGBT                                                 05740000
CVTVME   EQU   CVTFLGBT                                                 05741000
CVTNPE   EQU   CVTFLGBT                                                 05742000
CVTNUCLS EQU   CVTXTNT2+4                                               05743000
CVTDSSVA EQU   CVTDSSV+1                                                05744000
CVTRSV89 EQU   CVTDSSV                                                  05745000
CVTRSV88 EQU   CVTXTNT1+8                                               05746000
CVTRSV87 EQU   CVTXTNT1+4                                               05747000
CVTFACHN EQU   CVTXTNT1                                                 05748000
CVTRV488 EQU   CVTMAP+412                                               05749000
CVTRV487 EQU   CVTMAP+408                                               05750000
CVTRV486 EQU   CVTMAP+404                                               05751000
CVTRV485 EQU   CVTMAP+400                                               05752000
CVTACTAP EQU   CVTMAP+396                                               05753000
CVTAUTH  EQU   CVTMAP+392                                               05754000
CVTATMCA EQU   CVTATMCT+1                                               05755000
CVTATMST EQU   CVTATMCT                                                 05756000
CVTRSV61 EQU   CVTMAP+384                                               05757000
CVTVOLT1 EQU   CVTVOLM1+1                                               05758000
CVTVOLI1 EQU   CVTVOLF1                                                 05759000
CVTSTOA  EQU   CVTMAP+376                                               05760000
CVTRSV58 EQU   CVTMAP+374                                               05761000
CVTRSV57 EQU   CVTMAP+372                                               05762000
CVTDDCE  EQU   CVTMAP+368                                               05763000
CVTPNWFR EQU   CVTMAP+364                                               05764000
CVTSMF   EQU   CVTMAP+360                                               05765000
CVTSULK  EQU   CVTMAP+358                                               05766000
CVTSLKO  EQU   CVTSYSK                                                  05767000
CVTSLKP  EQU   CVTSYSK                                                  05768000
CVTSLKQ  EQU   CVTSYSK                                                  05769000
CVTSLKR  EQU   CVTSYSK                                                  05770000
CVTRSV56 EQU   CVTSYSK                                                  05771000
CVTRSV55 EQU   CVTSYSK                                                  05772000
CVTRSV54 EQU   CVTSYSK                                                  05773000
CVTRSV53 EQU   CVTSYSK                                                  05774000
CVTRSV52 EQU   CVTA1F1                                                  05775000
CVTRSV51 EQU   CVTA1F1                                                  05776000
CVTRSV50 EQU   CVTA1F1                                                  05777000
CVTRSV49 EQU   CVTA1F1                                                  05778000
CVTRSV48 EQU   CVTA1F1                                                  05779000
CVTRSV47 EQU   CVTA1F1                                                  05780000
CVTSRSW  EQU   CVTA1F1                                                  05781000
CVTPFSW  EQU   CVTA1F1                                                  05782000
CVTPCVT  EQU   CVTMAP+352                                               05783000
CVTRSV46 EQU   CVTMAP+344                                               05784000
CVTRSV45 EQU   CVTMAP+340                                               05785000
CVTRSV44 EQU   CVTMAP+338                                               05786000
CVTRSV43 EQU   CVTMAP+336                                               05787000
CVTHJESA EQU   CVTHJES+1                                                05788000
CVTRSV42 EQU   CVTHJES                                                  05789000
CVTEXT2A EQU   CVTEXT2+1                                                05790000
CVTRSV41 EQU   CVTEXT2                                                  05791000
CVTAPFA  EQU   CVTAPF+1                                                 05792000
CVTRSV40 EQU   CVTAPF                                                   05793000
CVTRV518 EQU   CVTINTLA                                                 05794000
CVTRV517 EQU   CVTERPV                                                  05795000
CVTEORM  EQU   CVTMAP+312                                               05796000
CVTMCHPR EQU   CVTMAP+308                                               05797000
CVTTZ    EQU   CVTMAP+304                                               05798000
CVTJEPS  EQU   CVTMAP+300                                               05799000
CVTJESCT EQU   CVTMAP+296                                               05800000
CVTMODE  EQU   CVTMAP+292                                               05801000
CVTPTRV  EQU   CVTMAP+288                                               05802000
CVTREAL  EQU   CVTMAP+284                                               05803000
CVTRSV39 EQU   CVTMAP+280                                               05804000
CVTRSV38 EQU   CVTMAP+276                                               05805000
CVTDMSRA EQU   CVTDMSR+1                                                05806000
CVTRSV37 EQU   CVTDMSR                                                  05807000
CVTQMSGA EQU   CVTQMSG+1                                                05808000
CVTRSV36 EQU   CVTQMSG                                                  05809000
CVTAMFF  EQU   CVTMAP+264                                               05810000
CVTPURGA EQU   CVTPURG+1                                                05811000
CVTRSV35 EQU   CVTPURG                                                  05812000
CVTCBSP  EQU   CVTMAP+256                                               05813000
CVTATERA EQU   CVTATER+1                                                05814000
CVTSYST  EQU   CVTATER                                                  05815000
CVTVOLT2 EQU   CVTTAT                                                   05816000
CVTVOLI2 EQU   CVTVOLF2                                                 05817000
CVTAQAVB EQU   CVTAQAVT+1                                               05818000
CVTRSV34 EQU   CVTTCMFG                                                 05819000
CVTRSV33 EQU   CVTTCMFG                                                 05820000
CVTRSV32 EQU   CVTTCMFG                                                 05821000
CVTRSV31 EQU   CVTTCMFG                                                 05822000
CVTRSV30 EQU   CVTTCMFG                                                 05823000
CVTRSV29 EQU   CVTTCMFG                                                 05824000
CVTRSV28 EQU   CVTTCMFG                                                 05825000
CVTTCRDY EQU   CVTTCMFG                                                 05826000
CVTGTFA  EQU   CVTGTF+1                                                 05827000
CVTRSV27 EQU   CVTGTFST                                                 05828000
CVTRNIO  EQU   CVTGTFST                                                 05829000
CVTUSR   EQU   CVTGTFST                                                 05830000
CVTRV318 EQU   CVTFORM                                                  05831000
CVTRV317 EQU   CVTTMODE                                                 05832000
CVTRV316 EQU   CVTSTATE                                                 05833000
CVTRV315 EQU   CVTGTFS                                                  05834000
CVTGTFAV EQU   CVTGTFS                                                  05835000
CVT0SCR1 EQU   CVTMAP+232                                               05836000
CVTRV515 EQU   CVTMAP+228                                               05837000
CVTRMS   EQU   CVTMAP+224                                               05838000
CVTPATCH EQU   CVTMAP+220                                               05839000
CVTTSCE  EQU   CVTMAP+216                                               05840000
CVTLNKSC EQU   CVTMAP+214                                               05841000
CVTQABST EQU   CVTMAP+212                                               05842000
CVTMDLDS EQU   CVTMAP+208                                               05843000
CVTUSER  EQU   CVTMAP+204                                               05844000
CVTABEND EQU   CVTMAP+200                                               05845000
CVTSMCA  EQU   CVTMAP+196                                               05846000
CVTRSV18 EQU   CVTMAP+192                                               05847000
CVTQLPAQ EQU   CVTMAP+188                                               05848000
CVTQCDSR EQU   CVTMAP+184                                               05849000
CVTRSV17 EQU   CVTOPTB                                                  05850000
CVTRSV16 EQU   CVTOPTB                                                  05851000
CVTFP    EQU   CVTOPTB                                                  05852000
CVTAPTHR EQU   CVTOPTB                                                  05853000
CVTNLOG  EQU   CVTOPTB                                                  05854000
CVTTOD   EQU   CVTOPTB                                                  05855000
CVTCTIMS EQU   CVTOPTB                                                  05856000
CVTPROT  EQU   CVTOPTB                                                  05857000
CVTXPFP  EQU   CVTOPTA                                                  05858000
CVTASCII EQU   CVTOPTA                                                  05859000
CVTRSV13 EQU   CVTOPTA                                                  05860000
CVTRSV12 EQU   CVTOPTA                                                  05861000
CVTNIP   EQU   CVTOPTA                                                  05862000
CVTDDR   EQU   CVTOPTA                                                  05863000
CVTAPR   EQU   CVTOPTA                                                  05864000
CVTCCH   EQU   CVTOPTA                                                  05865000
CVTSNCTR EQU   CVTMAP+180                                               05866000
CVTQMWR  EQU   CVTMAP+176                                               05867000
CVTQOCR  EQU   CVTMAP+172                                               05868000
CVT1EF00 EQU   CVTMAP+168                                               05869000
CVTMZ00  EQU   CVTMAP+164                                               05870000
CVTHEAD  EQU   CVTMAP+160                                               05871000
CVTRSV11 EQU   CVTMAP+156                                               05872000
CVT0PT01 EQU   CVTMAP+152                                               05873000
CVTMSER  EQU   CVTMAP+148                                               05874000
CVTRV516 EQU   CVTIERLC                                                 05875000
CVTILCH  EQU   CVTMAP+140                                               05876000
CVT0DS   EQU   CVTMAP+136                                               05877000
CVTFBOSV EQU   CVTMAP+132                                               05878000
CVTNUCB  EQU   CVTMAP+128                                               05879000
CVTIXAVL EQU   CVTMAP+124                                               05880000
CVTIOQET EQU   CVTMAP+120                                               05881000
CVTDCBA  EQU   CVTMAP+117                                               05882000
CVTMVS2  EQU   CVTDCB                                                   05883000
CVT6DAT  EQU   CVTDCB                                                   05884000
CVT4MPS  EQU   CVTDCB                                                   05885000
CVTRSV09 EQU   CVTDCB                                                   05886000
CVT4MS1  EQU   CVTDCB                                                   05887000
CVT2SPS  EQU   CVTDCB                                                   05888000
CVT1SSS  EQU   CVTDCB                                                   05889000
CVTRSV08 EQU   CVTDCB                                                   05890000
CVTSTB   EQU   CVTMAP+112                                               05891000
CVTQTD00 EQU   CVTMAP+108                                               05892000
CVTQTE00 EQU   CVTMAP+104                                               05893000
CVTCUCB  EQU   CVTMAP+100                                               05894000
CVTSJQ   EQU   CVTMAP+96                                                05895000
CVTPBLDL EQU   CVTMAP+92                                                05896000
CVTTPC   EQU   CVTMAP+88                                                05897000
CVTSVDCB EQU   CVTMAP+84                                                05898000
CVTBRET  EQU   CVTMAP+82                                                05899000
CVTEXIT  EQU   CVTMAP+80                                                05900000
CVT0FN00 EQU   CVTMAP+76                                                05901000
CVTDARA  EQU   CVTDAR+1                                                 05902000
CVTRSV07 EQU   CVTFLGS1                                                 05903000
CVTRSV06 EQU   CVTFLGS1                                                 05904000
CVTRSV05 EQU   CVTFLGS1                                                 05905000
CVTRSV04 EQU   CVTFLGS1                                                 05906000
CVTRSV03 EQU   CVTFLGS1                                                 05907000
CVTRSV02 EQU   CVTFLGS1                                                 05908000
CVTRSV01 EQU   CVTFLGS1                                                 05909000
CVTDMPLK EQU   CVTFLGS1                                                 05910000
CVTXITP  EQU   CVTMAP+68                                                05911000
CVTZDTAB EQU   CVTMAP+64                                                05912000
CVTMSLT  EQU   CVTMAP+60                                                05913000
CVTDATE  EQU   CVTMAP+56                                                05914000
CVTBTERM EQU   CVTMAP+52                                                05915000
CVTSYSAD EQU   CVTMAP+48                                                05916000
CVTXTLER EQU   CVTMAP+44                                                05917000
CVTILK2  EQU   CVTMAP+40                                                05918000
CVTILK1  EQU   CVTMAP+36                                                05919000
CVTPRLTV EQU   CVTMAP+32                                                05920000
CVTPCNVT EQU   CVTMAP+28                                                05921000
CVT0VL00 EQU   CVTMAP+24                                                05922000
CVTXAPG  EQU   CVTMAP+20                                                05923000
CVTBUF   EQU   CVTMAP+16                                                05924000
CVTJOB   EQU   CVTMAP+12                                                05925000
CVTLINK  EQU   CVTMAP+8                                                 05926000
CVT0EF00 EQU   CVTMAP+4                                                 05927000
CVTTCBP  EQU   CVTMAP                                                   05928000
CVT      EQU   CVTMAP                                                   05929000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      05930000
@RC00351 EQU   @RC00350                                                 05931000
@RC00455 EQU   @RC00443                                                 05932000
@RT00453 EQU   @RC00443                                                 05933000
@RC00614 EQU   @RC00598                                                 05934000
@PB00008 EQU   @PB00009                                                 05935000
@RC00352 EQU   @RC00351                                                 05936000
@PB00007 EQU   @PB00008                                                 05937000
@PB00006 EQU   @PB00007                                                 05938000
@PB00005 EQU   @PB00006                                                 05939000
@PB00004 EQU   @PB00005                                                 05940000
@PB00003 EQU   @PB00004                                                 05941000
@PB00002 EQU   @PB00003                                                 05942000
@ENDDATA EQU   *                                                        05943000
         END   ISTOCCQU,(C'PLS1926',0603,75136)                         05944000
