         TITLE 'ISTOCCDF - SRT DELETE/FIND                             *00001000
                        '                                               00002000
ISTOCCDF CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(8)                                              0001 00007000
         DC    C'OCCDF000'                                         0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
*        CRETCODE=CNEGVAL;             /* SET RETURN CODE NEGATIVE */   00014000
         L     CRETCODE,CNEGVAL                                    0061 00015000
*        CNAMEPTR = CREG0;        /* REFERENCE SYMBOLIC NAME */    0062 00016000
*                                                                  0062 00017000
*/********************************************************************/ 00018000
*/*                                                                  */ 00019000
*/*  GET ADDRESS OF SRT DIRECTORY FROM ATCAM CVT AND PUT IN CSRTDPTR */ 00020000
*/*  IF THE DIRECTORY IS NOT PRESENT, AN ERROR CODE IS SET AND NO    */ 00021000
*/*  PROCESSING OCCURS.                                              */ 00022000
*/*                                                                  */ 00023000
*/********************************************************************/ 00024000
*                                                                  0063 00025000
*        RFY (ATCVTPTR,CBHSPTR,CSRTDPTR) RSTD;   /* BASE FOR ATCVT  */  00026000
*                                                                  0063 00027000
*          DO; /* LISATCVT CVTBASE(PAGEABLE,(ATCVTPTR)) */         0064 00028000
*            ATCVTPTR = ATCLCPTR; /*SET UP ATCVT POINTER*/         0065 00029000
         L     ATCVTPTR,ATCLCPTR                                   0065 00030000
*          END; /*LISATCVT*/  /* LOCATE CVT */                     0066 00031000
*         CSRTDPTR = ATCSRT;     /* SRT DIRECTORY POINTER */       0067 00032000
         L     CSRTDPTR,ATCSRT(,ATCVTPTR)                          0067 00033000
*        RFY ATCVTPTR UNRSTD;  /* DROP ATCVT BASE */               0068 00034000
*        IF CSRTDPTR = 0 THEN CRETCODE = CNODIR; /* ERROR-NO DIRECTORY* 00035000
         LTR   CSRTDPTR,CSRTDPTR                                   0069 00036000
         BNZ   @RF00069                                            0069 00037000
         LA    CRETCODE,8                                          0070 00038000
*        ELSE DO;                                                  0071 00039000
         B     @RC00069                                            0071 00040000
@RF00069 DS    0H                                                  0072 00041000
*             /* USE HASHING MECHANISM TO REFERENCE PROPER         0072 00042000
*                ENTRY IN THE DIRECTORY.  THE TWO HALVES OF THE    0072 00043000
*                SYMBOLIC NAMES ARE OR'ED TOGETHER                 0072 00044000
*                  THE RESULT IS DIVIDED BY THE                    0072 00045000
*                NUMBER OF ENTRIES IN THE TABLE.  THE REMAINDER IS 0072 00046000
*                MULTIPLIED BY 4 AND THE OFFSET TO THE START OF THE     00047000
*                ENTRIES IS ADDED.                                  */  00048000
*      RFY CTEMP RSTD;                                     /*@Z30APGK*/ 00049000
*      CTEMP=CBHSPTR; /* SAVE REG2 AROUND MODESET            @Z30APGK*/ 00050000
         LR    CTEMP,CBHSPTR                                       0073 00051000
*       DO; /*MODESET  SAVEKEY(GPR02F) EXTKEY(ZERO)*/              0074 00052000
*         RESPECIFY (GPR02F) RESTRICTED;                           0075 00053000
*         IPK; /*SAVE CURRENT PSW KEY*/                            0076 00054000
         IPK                                                       0076 00055000
*         SPKA (0); /*SET PSW KEY*/                                0077 00056000
         SLR   @09,@09                                             0077 00057000
         SPKA  0(@09)                                              0077 00058000
*         GPR02F = GPR02F;                                         0078 00059000
*         RESPECIFY (GPR02F) UNRESTRICTED;                         0079 00060000
*       END; /*MODESET  SAVEKEY(GPR02F) EXTKEY(ZERO)*/              /*@ 00061000
*30APGK*/                                                          0080 00062000
*             CLASTPTR = (CSYMNAM1 | CSYMNAM2);  /* FOLD NAME */   0081 00063000
         LR    @09,CNAMEPTR                                        0081 00064000
         ICM   CLASTPTR,15,CSYMNAM1(@09)                           0081 00065000
         LR    @09,CNAMEPTR                                        0081 00066000
         ICM   @08,15,CSYMNAM2(@09)                                0081 00067000
         OR    CLASTPTR,@08                                        0081 00068000
*       DO; /*MODESET  KEYADDR(GPR02F)*/                           0082 00069000
*         SPKA (GPR02F); /*SET PSW KEY*/                           0083 00070000
         SPKA  0(GPR02F)                                           0083 00071000
*       END; /*MODESET  KEYADDR(GPR02F)*/                           /*@ 00072000
*30APGK*/                                                          0084 00073000
*             GEN;                                                 0085 00074000
              LR     15,CLASTPTR      FOLDED NAME                       00075000
              SR     14,14            CLEAR FOR DIVIDE                  00076000
              LA     11,1023          NUMBER OF TABLE ENTRIES           00077000
              DR     14,11            COMPUTE REMAINDER                 00078000
              LR     CLASTPTR,14      PICK UP REMAINDER                 00079000
*             CLASTPTR=CLASTPTR*4+CSRTDOFF+CSRTDPTR; /*COMPUTE ENTRY*/  00080000
         LR    @09,CLASTPTR                                        0086 00081000
         SLA   @09,2                                               0086 00082000
         AL    @09,@CF00054                                        0086 00083000
         ALR   @09,CSRTDPTR                                        0086 00084000
         LR    CLASTPTR,@09                                        0086 00085000
*             END;                                                 0087 00086000
*        IF CRETCODE ^= CNEGVAL THEN;  /* ERROR PATH */            0088 00087000
@RC00069 C     CRETCODE,CNEGVAL                                    0088 00088000
         BNE   @RT00088                                            0088 00089000
*        ELSE IF CSRTDENT = 0 THEN CRETCODE = CNTFOUND; /*NO ENTRY*/    00090000
         L     @09,CSRTDENT(,CLASTPTR)                             0090 00091000
         LTR   @09,@09                                             0090 00092000
         BNZ   @RF00090                                            0090 00093000
         LA    CRETCODE,4                                          0091 00094000
*             ELSE DO;                                             0092 00095000
         B     @RC00090                                            0092 00096000
@RF00090 DS    0H                                                  0093 00097000
*                  /* SEARCH THROUGH ALL ENTRIES HASHED TO SAME    0093 00098000
*                     PLACE SEARCHING FOR SYMBOLIC NAME WHICH      0093 00099000
*                     MATCHES THE ONE PASSED AS AN ARGUMENT.       0093 00100000
*                     SEARCH UNTIL MATCH OR END OF CHAIN.           */  00101000
*                  SRTPTR=CSRTDENT; /* ENTRY ADDRESS */            0093 00102000
         L     SRTPTR,CSRTDENT(,CLASTPTR)                          0093 00103000
*       DO; /*MODESET  SAVEKEY(GPR02F) EXTKEY(ZERO)*/              0094 00104000
*         RESPECIFY (GPR02F) RESTRICTED;                           0095 00105000
*         IPK; /*SAVE CURRENT PSW KEY*/                            0096 00106000
         IPK                                                       0096 00107000
*         SPKA (0); /*SET PSW KEY*/                                0097 00108000
         SLR   @09,@09                                             0097 00109000
         SPKA  0(@09)                                              0097 00110000
*         GPR02F = GPR02F;                                         0098 00111000
*         RESPECIFY (GPR02F) UNRESTRICTED;                         0099 00112000
*       END; /*MODESET  SAVEKEY(GPR02F) EXTKEY(ZERO)*/              /*@ 00113000
*30APGK*/                                                          0100 00114000
*                  DO WHILE (CSYMNAME ^= SRTSYMNM & SRTSRTE ^= 0); 0101 00115000
         B     @DE00101                                            0101 00116000
@DL00101 DS    0H                                                  0102 00117000
*                  CLASTPTR = SRTPTR;  /* UPDATE TO NEXT ON CHAIN */    00118000
         LR    CLASTPTR,SRTPTR                                     0102 00119000
*                  SRTPTR = SRTSRTE;   /* NEXT SRTE */             0103 00120000
         L     SRTPTR,SRTSRTE(,SRTPTR)                             0103 00121000
*                  END;                                            0104 00122000
@DE00101 LR    @09,CNAMEPTR                                        0104 00123000
         CLC   CSYMNAME(8,@09),SRTSYMNM(SRTPTR)                    0104 00124000
         BE    @DC00101                                            0104 00125000
         L     @09,SRTSRTE(,SRTPTR)                                0104 00126000
         LTR   @09,@09                                             0104 00127000
         BNZ   @DL00101                                            0104 00128000
@DC00101 DS    0H                                                  0105 00129000
*                  IF CSYMNAME ^= SRTSYMNM THEN CRETCODE = CNTFOUND;    00130000
         LR    @09,CNAMEPTR                                        0105 00131000
         CLC   CSYMNAME(8,@09),SRTSYMNM(SRTPTR)                    0105 00132000
         BE    @RF00105                                            0105 00133000
         LA    CRETCODE,4                                          0106 00134000
*                  ELSE;  /* MATCH FOUND */                        0107 00135000
@RF00105 DS    0H                                                  0108 00136000
*       DO; /*MODESET  KEYADDR(GPR02F)*/                           0108 00137000
*         SPKA (GPR02F); /*SET PSW KEY*/                           0109 00138000
         SPKA  0(GPR02F)                                           0109 00139000
*       END; /*MODESET  KEYADDR(GPR02F)*/                           /*@ 00140000
*30APGK*/                                                          0110 00141000
*        CBHSPTR=CTEMP;   /* RESTORE REG2                    @Z30APGK*/ 00142000
         LR    CBHSPTR,CTEMP                                       0111 00143000
*        RFY CTEMP UNRSTD;                                 /*@Z30APGK*/ 00144000
*                  END;                                            0113 00145000
*                  RFY CSRTDPTR UNRSTD;                            0114 00146000
@RC00090 DS    0H                                                  0114 00147000
@RT00088 DS    0H                                                  0115 00148000
*        IF CRETCODE ^= CNEGVAL THEN;  /* ERROR WAS FOUND */       0115 00149000
         C     CRETCODE,CNEGVAL                                    0115 00150000
         BNE   @RT00115                                            0115 00151000
*        ELSE IF CBHSPTR < 0             /* BHSET INDICATED */     0117 00152000
*            THEN DO;                                              0117 00153000
         LTR   CBHSPTR,CBHSPTR                                     0117 00154000
         BNM   @RF00117                                            0117 00155000
*                IF SRTBHSET=CON         /* INSURE BHSET ENTRY */  0119 00156000
*                    THEN CALL CDFBHSET;                           0119 00157000
         TM    SRTBHSET(SRTPTR),B'10000000'                        0119 00158000
         BNO   @RF00119                                            0119 00159000
         BAL   @14,CDFBHSET                                        0120 00160000
*                    ELSE CRETCODE=CNTFOUND;                       0121 00161000
         B     @RC00119                                            0121 00162000
@RF00119 LA    CRETCODE,4                                          0121 00163000
*                 END;                                             0122 00164000
*            ELSE DO; /* PROCESS FOR RDT OR PROCESS MODULE */      0123 00165000
         B     @RC00117                                            0123 00166000
@RF00117 DS    0H                                                  0124 00167000
*                     /* IS SDVT INDICATOR = TO SRTE DVT INDICATOR */   00168000
*                    IF ((CREG1<0 & SRTSDVT=CON) |                 0124 00169000
*                       (CREG1^<0 & SRTSDVT=COFF))                 0124 00170000
*                     THEN;  /* ENTRY FOUND */                     0124 00171000
         LTR   CREG1,CREG1                                         0124 00172000
         BNM   @GL00002                                            0124 00173000
         TM    SRTSDVT(SRTPTR),B'01000000'                         0124 00174000
         BO    @RT00124                                            0124 00175000
@GL00002 LTR   CREG1,CREG1                                         0124 00176000
         BM    @RF00124                                            0124 00177000
         TM    SRTSDVT(SRTPTR),B'01000000'                         0124 00178000
         BZ    @RT00124                                            0124 00179000
*                     ELSE IF SRTSRTE=0                            0126 00180000
*                            THEN CRETCODE=CNTFOUND;               0126 00181000
@RF00124 L     @10,SRTSRTE(,SRTPTR)                                0126 00182000
         LTR   @10,@10                                             0126 00183000
         BNZ   @RF00126                                            0126 00184000
         LA    CRETCODE,4                                          0127 00185000
*                            ELSE DO;                              0128 00186000
         B     @RC00126                                            0128 00187000
@RF00126 DS    0H                                                  0129 00188000
*                       CLASTPTR=SRTPTR;     /* SEARCH FOR MATCH */     00189000
         LR    CLASTPTR,SRTPTR                                     0129 00190000
*                       SRTPTR=SRTSRTE;                            0130 00191000
         L     SRTPTR,SRTSRTE(,SRTPTR)                             0130 00192000
*                       DO WHILE (SRTSRTE^=0 & CSYMNAME^=SRTSYMNM);     00193000
         B     @DE00131                                            0131 00194000
@DL00131 DS    0H                                                  0132 00195000
*                       CLASTPTR=SRTPTR;                           0132 00196000
         LR    CLASTPTR,SRTPTR                                     0132 00197000
*                       SRTPTR=SRTSRTE;                            0133 00198000
         L     SRTPTR,SRTSRTE(,SRTPTR)                             0133 00199000
*                       END;                                       0134 00200000
@DE00131 L     @10,SRTSRTE(,SRTPTR)                                0134 00201000
         LTR   @10,@10                                             0134 00202000
         BZ    @DC00131                                            0134 00203000
         LR    @10,CNAMEPTR                                        0134 00204000
         CLC   CSYMNAME(8,@10),SRTSYMNM(SRTPTR)                    0134 00205000
         BNE   @DL00131                                            0134 00206000
@DC00131 DS    0H                                                  0135 00207000
*                       IF CSYMNAME^=SRTSYMNM  /* SYMBOLIC NAMES ^=? */ 00208000
*                        THEN CRETCODE=CNTFOUND;                   0135 00209000
         LR    @10,CNAMEPTR                                        0135 00210000
         CLC   CSYMNAME(8,@10),SRTSYMNM(SRTPTR)                    0135 00211000
         BE    @RF00135                                            0135 00212000
         LA    CRETCODE,4                                          0136 00213000
*                               /* MATCH FOUND ON NAMES    */      0137 00214000
*                               /* SDVT INDICATORS EQUAL ? */      0137 00215000
*                        ELSE     IF ((CREG1<0 & SRTSDVT=CON) |    0137 00216000
*                                    (CREG1^<0 & SRTSDVT=COFF))    0137 00217000
*                                   THEN;  /* ENTRY FOUND */       0137 00218000
         B     @RC00135                                            0137 00219000
@RF00135 LTR   CREG1,CREG1                                         0137 00220000
         BNM   @GL00006                                            0137 00221000
         TM    SRTSDVT(SRTPTR),B'01000000'                         0137 00222000
         BO    @RT00137                                            0137 00223000
@GL00006 LTR   CREG1,CREG1                                         0137 00224000
         BM    @RF00137                                            0137 00225000
         TM    SRTSDVT(SRTPTR),B'01000000'                         0137 00226000
         BZ    @RT00137                                            0137 00227000
*                                   ELSE CRETCODE=CNTFOUND;        0139 00228000
@RF00137 LA    CRETCODE,4                                          0139 00229000
*       DO; /*MODESET  KEYADDR(GPR02F)*/                           0140 00230000
@RT00137 DS    0H                                                  0140 00231000
@RC00135 DS    0H                                                  0141 00232000
*         SPKA (GPR02F); /*SET PSW KEY*/                           0141 00233000
         SPKA  0(GPR02F)                                           0141 00234000
*       END; /*MODESET  KEYADDR(GPR02F)*/                           /*@ 00235000
*30APGK*/                                                          0142 00236000
*        CBHSPTR=CTEMP;   /* RESTORE REG2                    @Z30APGK*/ 00237000
         LR    CBHSPTR,CTEMP                                       0143 00238000
*        RFY CTEMP UNRSTD;                                 /*@Z30APGK*/ 00239000
*                          END;                                    0145 00240000
*                       END;                                       0146 00241000
@RC00126 DS    0H                                                  0146 00242000
@RT00124 DS    0H                                                  0147 00243000
*        IF CRETCODE ^= CNEGVAL THEN;  /* PROCESSING COMPLETED */  0147 00244000
@RC00117 DS    0H                                                  0147 00245000
@RT00115 C     CRETCODE,CNEGVAL                                    0147 00246000
         BNE   @RT00147                                            0147 00247000
*        ELSE DO;   /* NON BHSET REQUESTED - NORMAL ENTRY */       0149 00248000
*             /* A FIND OR DELETE FOR A NORMAL SRT ENTRY WAS       0150 00249000
*                REQUESTED.                                   */   0150 00250000
*              IF (CNAMEPTR&CBITMASK)=CBITMASK THEN DO;            0150 00251000
         LR    @10,CNAMEPTR                                        0150 00252000
         ICM   @04,15,CBITMASK                                     0150 00253000
         NR    @10,@04                                             0150 00254000
         ICM   @04,15,CBITMASK                                     0150 00255000
         CLR   @10,@04                                             0150 00256000
         BNE   @RF00150                                            0150 00257000
*                               /* THE REQUEST WAS FOR FIND.  THE  0152 00258000
*                                  PROPER ENTRY IS POINTED TO BY   0152 00259000
*                                  BASE REGISTER SRTPTR. THE RDT   0152 00260000
*                                  ENTRY ADDRESS MUST BE PLACED IN 0152 00261000
*                                  REGISTER 0.                      */  00262000
*                               CREG0 = SRTRDTE;  /* RDTE ADDRESS */    00263000
         L     CREG0,SRTRDTE(,SRTPTR)                              0152 00264000
*                               CRETCODE = CGOOD;                  0153 00265000
         SLR   CRETCODE,CRETCODE                                   0153 00266000
*                               END;                               0154 00267000
*             ELSE DO;                                             0155 00268000
         B     @RC00150                                            0155 00269000
@RF00150 DS    0H                                                  0156 00270000
*                  /* A DELETE WAS REQUESTED.  THE CHAIN OF ENTRIES     00271000
*                     MUST BE UPDATED TO REFLECT THIS ENTRY BEING  0156 00272000
*                     REMOVED.  THE STORAGE OCCUPIED BY THIS ENTRY 0156 00273000
*                     MUST BE FREED.                                */  00274000
*                  CLASTPTR -> SRTSRTE = SRTSRTE; /* RECHAIN */    0156 00275000
         L     @10,SRTSRTE(,SRTPTR)                                0156 00276000
         ST    @10,SRTSRTE(,CLASTPTR)                              0156 00277000
*                  CWORKREG=SRTLNGTH; /* LENGTH FOR FREESTOR */    0157 00278000
         LH    CWORKREG,SRTLNGTH(,SRTPTR)                          0157 00279000
         N     CWORKREG,@CF01315                                   0157 00280000
*                  RFY REG9 RSTD;                         /* @XM06239*/ 00281000
*                  REG9=SRTPTR;                           /* @XM06239*/ 00282000
         LR    REG9,SRTPTR                                         0159 00283000
*         /*FREESTOR AREA(REG9)FETCHP(NO)SIZE(CWORKREG)*/          0160 00284000
*          DO;                                                     0160 00285000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  0161 00286000
*/* END OF ATBUILD */                                              0161 00287000
*         DCL GPR00F FIXED(31) REG(00);                            0161 00288000
*         DCL GPR00P PTR(31)   REG(00);                            0162 00289000
*         DCL GPR01F FIXED(31) REG(01);                            0163 00290000
*         DCL GPR01P PTR(31)   REG(01);                            0164 00291000
*         DCL GPR02F FIXED(31) REG(02);                            0165 00292000
*         DCL GPR02P PTR(31)   REG(02);                            0166 00293000
*         DCL GPR03F FIXED(31) REG(03);                            0167 00294000
*         DCL GPR03P PTR(31)   REG(03);                            0168 00295000
*         DCL GPR04F FIXED(31) REG(04);                            0169 00296000
*         DCL GPR04P PTR(31)   REG(04);                            0170 00297000
*         DCL GPR05F FIXED(31) REG(05);                            0171 00298000
*         DCL GPR05P PTR(31)   REG(05);                            0172 00299000
*         DCL GPR06F FIXED(31) REG(06);                            0173 00300000
*         DCL GPR06P PTR(31)   REG(06);                            0174 00301000
*         DCL GPR07F FIXED(31) REG(07);                            0175 00302000
*         DCL GPR07P PTR(31)   REG(07);                            0176 00303000
*         DCL GPR08F FIXED(31) REG(08);                            0177 00304000
*         DCL GPR08P PTR(31)   REG(08);                            0178 00305000
*         DCL GPR09F FIXED(31) REG(09);                            0179 00306000
*         DCL GPR09P PTR(31)   REG(09);                            0180 00307000
*         DCL GPR10F FIXED(31) REG(10);                            0181 00308000
*         DCL GPR10P PTR(31)   REG(10);                            0182 00309000
*         DCL GPR11F FIXED(31) REG(11);                            0183 00310000
*         DCL GPR11P PTR(31)   REG(11);                            0184 00311000
*         DCL GPR12F FIXED(31) REG(12);                            0185 00312000
*         DCL GPR12P PTR(31)   REG(12);                            0186 00313000
*         DCL GPR13F FIXED(31) REG(13);                            0187 00314000
*         DCL GPR13P PTR(31)   REG(13);                            0188 00315000
*         DCL GPR14F FIXED(31) REG(14);                            0189 00316000
*         DCL GPR14P PTR(31)   REG(14);                            0190 00317000
*         DCL GPR15F FIXED(31) REG(15);                            0191 00318000
*         DCL GPR15P PTR(31)   REG(15);                            0192 00319000
*         RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                  0193 00320000
*         RFY ISTRPH BASED(GPR01P);                                0194 00321000
*         GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,                    0195 00322000
*                  GPR06P,GPR07P,GPR08P,GPR09P,                    0195 00323000
*                  GPR10P,GPR11P,GPR12P,GPR13P)                    0195 00324000
*             SETS(RPHWORK);                                       0195 00325000
*                                                                  0195 00326000
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS      00327000
*         GPR00F = CWORKREG;                           /*SIZE IN REG0*/ 00328000
         LR    GPR00F,CWORKREG                                     0196 00329000
*         DCL 1 CMZA0019 FIXED(31) STATIC LOCAL,                   0197 00330000
*               2 * FIXED(8) INIT(64),               /* OPTION FLAGS */ 00331000
*               2 * FIXED(8) INIT(96),                /* STORAGE KEY */ 00332000
*               2 * FIXED(8) INIT(241),            /* SUBPOOL NUMBER */ 00333000
*               2 * FIXED(8) INIT('01'X);            /* REQUEST TYPE */ 00334000
*         GPR03F = CMZA0019;                                       0198 00335000
         L     GPR03F,CMZA0019                                     0198 00336000
*         RFY (GPR04P) RSTD;                                       0199 00337000
*         GPR04P = REG9;                  /*PUT FREEMAIN ADDR IN REG4*/ 00338000
*                                                                  0200 00339000
         LR    GPR04P,REG9                                         0200 00340000
*         DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */            0201 00341000
*           GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/            0202 00342000
         L     GPR02P,ATCLCPTR                                     0202 00343000
*         END; /*LISATCVT*/                                        0203 00344000
*         CALL GPR02P -> ATCGTSTR;                    /*CALL ISTORFSR*/ 00345000
         L     @15,ATCGTSTR(,GPR02P)                               0204 00346000
         BALR  @14,@15                                             0204 00347000
*         RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P) UNRSTD;         0205 00348000
*         END ;                                     /*END OF FREESTOR*/ 00349000
* /* @XM06239*/                                                    0207 00350000
*                  RFY REG9 UNRSTD;                       /* @XM06239*/ 00351000
*                  CRETCODE=CGOOD;                                 0208 00352000
         SLR   CRETCODE,CRETCODE                                   0208 00353000
*                END;                                              0209 00354000
*         END;                                                     0210 00355000
@RC00150 DS    0H                                                  0211 00356000
*        GENERATE;                                                 0211 00357000
@RT00147 DS    0H                                                  0211 00358000
         LR    CRCODE,CRETCODE                                          00359000
         L     CRETPTR,12(13)                                           00360000
         LM    1,12,24(13)                                              00361000
         BR    CRETPTR                                                  00362000
*CDFBHSET: PROC OPTIONS(NOSAVEAREA,NOSAVE);                        0212 00363000
         B     @PB00002                                            0212 00364000
CDFBHSET DS    0H                                                  0213 00365000
*        CSAVE = CRETPTR;       /* SAVE RETURN ADDRESS */          0213 00366000
         LR    CSAVE,CRETPTR                                       0213 00367000
*        RFY CSAVE RSTD;                                           0214 00368000
*                                                                  0214 00369000
*        /* THIS ROUTINE WILL SEARCH A SRT ENTRY WHICH WAS IDENTIFIED   00370000
*           AS CONTAINING BHSETS TO FIND THE ONE WHICH MATCHES THE 0215 00371000
*           RDTE ADDRESS WHICH WAS PASSED AS A PARAMETER.  IF FIND 0215 00372000
*           WAS REQUESTED, THE CORRESPONDING BHID IS RETURNED TO THE    00373000
*           CALLER IN REGISTER 0.  IF A DELETE WAS RIQUESTED, THE  0215 00374000
*           BHSET IS DELETED FROM THE SRT ENTRY.                    */  00375000
*        CBHSPTR=CBHSPTR & CBHSTMSK; /* CLEAR FLAG BIT */          0215 00376000
         ICM   @10,15,CBHSTMSK                                     0215 00377000
         NR    CBHSPTR,@10                                         0215 00378000
*        RFY CSIZE RSTD;                                           0216 00379000
*        CSIZE = SRTLNGTH-16;   /* FOR LOOP CONTROL */             0217 00380000
         LH    CSIZE,SRTLNGTH(,SRTPTR)                             0217 00381000
         N     CSIZE,@CF01315                                      0217 00382000
         SL    CSIZE,@CF00974                                      0217 00383000
*        /* SEARCH UNTIL MATCH OF RDTE ADDRESSES OR END OF ENTRY */     00384000
*        DO WHILE (CBHSPTR ^= SRTRDTE & CSIZE ^= 0);               0218 00385000
         B     @DE00218                                            0218 00386000
@DL00218 DS    0H                                                  0219 00387000
*        SRTPTR = SRTPTR + CBHLNGTH;  /* UPDATE TO NEXT BHSET */   0219 00388000
         AL    SRTPTR,@CF01239                                     0219 00389000
*        CSIZE = CSIZE-CBHLNGTH;  /* DECREMENT CSIZE LEFT IN ENTRY */   00390000
         SL    CSIZE,@CF01239                                      0220 00391000
*        END;                                                      0221 00392000
@DE00218 C     CBHSPTR,SRTRDTE(,SRTPTR)                            0221 00393000
         BE    @DC00218                                            0221 00394000
         LTR   CSIZE,CSIZE                                         0221 00395000
         BNZ   @DL00218                                            0221 00396000
@DC00218 DS    0H                                                  0222 00397000
*        IF CBHSPTR=SRTRDTE THEN DO;   /* MATCH FOUND */           0222 00398000
         C     CBHSPTR,SRTRDTE(,SRTPTR)                            0222 00399000
         BNE   @RF00222                                            0222 00400000
*                  IF (CNAMEPTR&CBITMASK)=CBITMASK THEN DO;        0224 00401000
         LR    @10,CNAMEPTR                                        0224 00402000
         ICM   @09,15,CBITMASK                                     0224 00403000
         NR    @10,@09                                             0224 00404000
         ICM   @09,15,CBITMASK                                     0224 00405000
         CLR   @10,@09                                             0224 00406000
         BNE   @RF00224                                            0224 00407000
*                                   /* RETURN BHID TO CALLER */    0226 00408000
*                                   CREG0 = SRTBHID;               0226 00409000
         SLR   CREG0,CREG0                                         0226 00410000
         IC    CREG0,SRTBHID(,SRTPTR)                              0226 00411000
*                                   CRETCODE = CGOOD;              0227 00412000
         SLR   CRETCODE,CRETCODE                                   0227 00413000
*                                   END;                           0228 00414000
*                  ELSE DO;  /* DELETE REQUESTED */                0229 00415000
         B     @RC00224                                            0229 00416000
@RF00224 DS    0H                                                  0230 00417000
*                       RFY CBHSPTR UNRSTD;                        0230 00418000
*                       SRTPTR=CLASTPTR->SRTSRTE; /*EST BASE */    0231 00419000
         L     SRTPTR,SRTSRTE(,CLASTPTR)                           0231 00420000
*                       IF SRTLNGTH= CBHNTRY1 THEN DO;             0232 00421000
         CLC   SRTLNGTH(2,SRTPTR),@CH01243                         0232 00422000
         BNE   @RF00232                                            0232 00423000
*                      /* ONLY ONE BHSET PRESENT SO                0234 00424000
*                         THE SRT ENTRY CAN BE DELETED */          0234 00425000
*                       CLASTPTR->SRTSRTE=SRTSRTE; /* RECHAIN ENTRIES*/ 00426000
         L     @10,SRTSRTE(,SRTPTR)                                0234 00427000
         ST    @10,SRTSRTE(,CLASTPTR)                              0234 00428000
*                       CWORKREG = SRTLNGTH;  /* LENGTH FOR FREESTOR */ 00429000
         LH    CWORKREG,SRTLNGTH(,SRTPTR)                          0235 00430000
         N     CWORKREG,@CF01315                                   0235 00431000
*                       RFY REG9 RSTD;                    /* @XM06239*/ 00432000
*                       REG9=SRTPTR;                      /* @XM06239*/ 00433000
         LR    REG9,SRTPTR                                         0237 00434000
*            /*FREESTOR AREA(REG9)FETCHP(NO)SIZE(CWORKREG)*/       0238 00435000
*             DO;                                                  0238 00436000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  0239 00437000
*/* END OF ATBUILD */                                              0239 00438000
*            RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;               0239 00439000
*            RFY ISTRPH BASED(GPR01P);                             0240 00440000
*            GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,                 0241 00441000
*                     GPR06P,GPR07P,GPR08P,GPR09P,                 0241 00442000
*                     GPR10P,GPR11P,GPR12P,GPR13P)                 0241 00443000
*                SETS(RPHWORK);                                    0241 00444000
*                                                                  0241 00445000
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS      00446000
*            GPR00F = CWORKREG;                        /*SIZE IN REG0*/ 00447000
         LR    GPR00F,CWORKREG                                     0242 00448000
*            DCL 1 CMZA0038 FIXED(31) STATIC LOCAL,                0243 00449000
*                  2 * FIXED(8) INIT(64),            /* OPTION FLAGS */ 00450000
*                  2 * FIXED(8) INIT(96),             /* STORAGE KEY */ 00451000
*                  2 * FIXED(8) INIT(241),         /* SUBPOOL NUMBER */ 00452000
*                  2 * FIXED(8) INIT('01'X);         /* REQUEST TYPE */ 00453000
*            GPR03F = CMZA0038;                                    0244 00454000
         L     GPR03F,CMZA0038                                     0244 00455000
*            RFY (GPR04P) RSTD;                                    0245 00456000
*            GPR04P = REG9;               /*PUT FREEMAIN ADDR IN REG4*/ 00457000
*                                                                  0246 00458000
         LR    GPR04P,REG9                                         0246 00459000
*            DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */         0247 00460000
*              GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/         0248 00461000
         L     GPR02P,ATCLCPTR                                     0248 00462000
*            END; /*LISATCVT*/                                     0249 00463000
*            CALL GPR02P -> ATCGTSTR;                 /*CALL ISTORFSR*/ 00464000
         L     @15,ATCGTSTR(,GPR02P)                               0250 00465000
         BALR  @14,@15                                             0250 00466000
*            RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P) UNRSTD;      0251 00467000
*            END ;                                  /*END OF FREESTOR*/ 00468000
**@XM06239*/                                                       0252 00469000
*                       RFY REG9 UNRSTD;                  /* @XM06239*/ 00470000
*                       CRETCODE=CGOOD;  /* SUCCESSFUL DELETE */   0254 00471000
         SLR   CRETCODE,CRETCODE                                   0254 00472000
*                       END;                                       0255 00473000
*                       ELSE DO;                                   0256 00474000
         B     @RC00232                                            0256 00475000
@RF00232 DS    0H                                                  0257 00476000
*                       /* MORE THAN ONE BHSET EXISTS FOR THE SRT  0257 00477000
*                          ENTRY.  STORAGE MUST BE OBTAINED AND THE     00478000
*                          EXISTING ENTRY COPIED TO IT, DELETING   0257 00479000
*                          THE BHSET THAT WAS REQUESTED TO BE      0257 00480000
*                          DELETED.  THE STORAGE FOR THE OLD ENTRY 0257 00481000
*                          WILL BE FREED.                           */  00482000
*                       RFY CTEMP RSTD;                            0257 00483000
*                       CTEMP=SRTLNGTH-CBHLNGTH; /*AMT FOR GETSTOR */   00484000
         LH    CTEMP,SRTLNGTH(,SRTPTR)                             0258 00485000
         N     CTEMP,@CF01315                                      0258 00486000
         SL    CTEMP,@CF01239                                      0258 00487000
*                   RFY SRTPTR UNRSTD;                             0259 00488000
*                   RFY CLASTPTR UNRSTD;                           0260 00489000
*                         /*GETSTOR SIZE(CTEMP)CLEAR(YES)FETCHP(NO)*/   00490000
*                          DO;                                     0261 00491000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  0262 00492000
*/* END OF ATBUILD */     RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;  0262 00493000
*                         RFY ISTRPH BASED(GPR01P);                0263 00494000
*                         GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,    0264 00495000
*                                  GPR06P,GPR07P,GPR08P,GPR09P,    0264 00496000
*                                  GPR10P,GPR11P,GPR12P,GPR13P)    0264 00497000
*                             SETS(RPHWORK);                       0264 00498000
*                                                                  0264 00499000
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS      00500000
*                         GPR00F = CTEMP;              /*SIZE IN REG0*/ 00501000
         LR    GPR00F,CTEMP                                        0265 00502000
*                         DCL 1 CMZA0057 FIXED(31) STATIC LOCAL,   0266 00503000
*                               2 * FIXED(8) INIT(96),             0266 00504000
*                                                    /* OPTION FLAGS */ 00505000
*                               2 * FIXED(8) INIT(96),/* STORAGE KEY */ 00506000
*                               2 * FIXED(8) INIT(241),            0266 00507000
*                                                  /* SUBPOOL NUMBER */ 00508000
*                               2 * FIXED(8) INIT('00'X);          0266 00509000
*                                                    /* REQUEST TYPE */ 00510000
*                         GPR03F = CMZA0057;                       0267 00511000
*                                                                  0267 00512000
         L     GPR03F,CMZA0057                                     0267 00513000
*                         DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */ 00514000
*                           GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/ 00515000
         L     GPR02P,ATCLCPTR                                     0269 00516000
*                         END; /*LISATCVT*/                        0270 00517000
*                         CALL GPR02P -> ATCGTSTR;    /*CALL ISTORFSR*/ 00518000
         L     @15,ATCGTSTR(,GPR02P)                               0271 00519000
         BALR  @14,@15                                             0271 00520000
*                         RFY (GPR00P,GPR01P,GPR02P,GPR03P) UNRSTD;     00521000
*                         END ;                      /*END OF GETSTOR*/ 00522000
*                   RFY SRTPTR RSTD;                               0274 00523000
*                   RFY CLASTPTR RSTD;                             0275 00524000
*                       CWORKREG=RPHSRPRM;  /* ADDRESS OF STORAGE */    00525000
         L     CWORKREG,RPHSRPRM(,GPR01P)                          0276 00526000
*                       IF CRCODE=0                                0277 00527000
*                          THEN DO;  /* STORAGE ACQUIRED */        0277 00528000
         LTR   CRCODE,CRCODE                                       0277 00529000
         BNZ   @RF00277                                            0277 00530000
*                          CSIZE = SRTLNGTH-CSIZE; /* AMT TO COPY */    00531000
         LH    @09,SRTLNGTH(,SRTPTR)                               0279 00532000
         N     @09,@CF01315                                        0279 00533000
         SLR   @09,CSIZE                                           0279 00534000
         LR    CSIZE,@09                                           0279 00535000
*                          CWORKREG->ISTSRT(1:CSIZE)=              0280 00536000
*                             ISTSRT(1:CSIZE);                     0280 00537000
         LR    @09,CSIZE                                           0280 00538000
         BCTR  @09,0                                               0280 00539000
         EX    @09,@SM01316                                        0280 00540000
*                          IF CTEMP=CSIZE THEN; /*BHSET AT END*/   0281 00541000
         CR    CTEMP,CSIZE                                         0281 00542000
         BE    @RT00281                                            0281 00543000
*                          ELSE DO;   /* MOVE REMAINDER */         0283 00544000
*                          CSIZE=CSIZE+1;  /* UPDATE START */      0284 00545000
         AL    CSIZE,@CF00081                                      0284 00546000
*                          CWORKREG->ISTSRT(CSIZE:CTEMP)=          0285 00547000
*                          ISTSRT(CSIZE+CBHLNGTH:CTEMP+CBHLNGTH);  0285 00548000
         LR    @09,CWORKREG                                        0285 00549000
         ALR   @09,CSIZE                                           0285 00550000
         AL    @09,@CF01233                                        0285 00551000
         LR    @04,CTEMP                                           0285 00552000
         SLR   @04,CSIZE                                           0285 00553000
         LR    @02,SRTPTR                                          0285 00554000
         ALR   @02,CSIZE                                           0285 00555000
         EX    @04,@SM01318                                        0285 00556000
*                          END;                                    0286 00557000
*                          RFY CSIZE UNRSTD;                       0287 00558000
@RT00281 DS    0H                                                  0288 00559000
*                          CWORKREG->SRTLNGTH=CTEMP; /* NEW LENGTH*/    00560000
         STH   CTEMP,SRTLNGTH(,CWORKREG)                           0288 00561000
*                         RFY CTEMP UNRSTD;                        0289 00562000
*                          CLASTPTR->SRTSRTE=CWORKREG; /*CHAIN NEW BLK* 00563000
         ST    CWORKREG,SRTSRTE(,CLASTPTR)                         0290 00564000
*                          CWORKREG=SRTLNGTH; /* LENGTH FOR FREESTOR */ 00565000
         LH    CWORKREG,SRTLNGTH(,SRTPTR)                          0291 00566000
         N     CWORKREG,@CF01315                                   0291 00567000
*                          RFY REG9 RSTD;                 /* @XM06239*/ 00568000
*                          REG9=SRTPTR;                   /* @XM06239*/ 00569000
         LR    REG9,SRTPTR                                         0293 00570000
*            /*FREESTOR AREA(REG9)FETCHP(NO)SIZE(CWORKREG)*/       0294 00571000
*             DO;                                                  0294 00572000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */                  0295 00573000
*/* END OF ATBUILD */                                              0295 00574000
*            RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;               0295 00575000
*            RFY ISTRPH BASED(GPR01P);                             0296 00576000
*            GEN REFS(GPR02P,GPR03P,GPR04P,GPR05P,                 0297 00577000
*                     GPR06P,GPR07P,GPR08P,GPR09P,                 0297 00578000
*                     GPR10P,GPR11P,GPR12P,GPR13P)                 0297 00579000
*                SETS(RPHWORK);                                    0297 00580000
*                                                                  0297 00581000
         STM   GPR02P,GPR13P,RPHWORK(GPR01P)        SAVE REGISTERS      00582000
*            GPR00F = CWORKREG;                        /*SIZE IN REG0*/ 00583000
         LR    GPR00F,CWORKREG                                     0298 00584000
*            DCL 1 CMZA0075 FIXED(31) STATIC LOCAL,                0299 00585000
*                  2 * FIXED(8) INIT(64),            /* OPTION FLAGS */ 00586000
*                  2 * FIXED(8) INIT(96),             /* STORAGE KEY */ 00587000
*                  2 * FIXED(8) INIT(241),         /* SUBPOOL NUMBER */ 00588000
*                  2 * FIXED(8) INIT('01'X);         /* REQUEST TYPE */ 00589000
*            GPR03F = CMZA0075;                                    0300 00590000
         L     GPR03F,CMZA0075                                     0300 00591000
*            RFY (GPR04P) RSTD;                                    0301 00592000
*            GPR04P = REG9;               /*PUT FREEMAIN ADDR IN REG4*/ 00593000
*                                                                  0302 00594000
         LR    GPR04P,REG9                                         0302 00595000
*            DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */         0303 00596000
*              GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/         0304 00597000
         L     GPR02P,ATCLCPTR                                     0304 00598000
*            END; /*LISATCVT*/                                     0305 00599000
*            CALL GPR02P -> ATCGTSTR;                 /*CALL ISTORFSR*/ 00600000
         L     @15,ATCGTSTR(,GPR02P)                               0306 00601000
         BALR  @14,@15                                             0306 00602000
*            RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P) UNRSTD;      0307 00603000
*            END ;                                  /*END OF FREESTOR*/ 00604000
**@XM06239*/                                                       0308 00605000
*                          RFY REG9 UNRSTD;               /* @XM06239*/ 00606000
*                          CRETCODE=CGOOD;  /* SUCCESSFUL DELETE */     00607000
         SLR   CRETCODE,CRETCODE                                   0310 00608000
*                          END;                                    0311 00609000
*                       ELSE CRETCODE=CNOCORE; /* ERROR-NO STORAGE */   00610000
         B     @RC00277                                            0312 00611000
@RF00277 LA    CRETCODE,12                                         0312 00612000
*                       END;                                       0313 00613000
*                  END;                                            0314 00614000
*                  END;                                            0315 00615000
*        ELSE CRETCODE=CNTFOUND;  /* MATCH NOT FOUND */            0316 00616000
         B     @RC00222                                            0316 00617000
@RF00222 LA    CRETCODE,4                                          0316 00618000
*        CRETPTR = CSAVE;        /* GET RETURN ADDRESS */          0317 00619000
@RC00222 LR    CRETPTR,CSAVE                                       0317 00620000
*        RFY CSAVE UNRSTD;                                         0318 00621000
*END CDFBHSET;                                                     0319 00622000
*                                                                  0319 00623000
@EL00002 DS    0H                                                  0319 00624000
@EF00002 DS    0H                                                  0319 00625000
@ER00002 BR    @14                                                 0319 00626000
@PB00002 DS    0H                                                  0319 00627000
*/* TPEPILOG   */                                                  0320 00628000
* GEN (PRINT OFF);                                                 0320 00629000
*                                                                  0320 00630000
         PRINT OFF                                                      00631000
* GEN (PRINT ON);                                                  0321 00632000
         PRINT ON                                                       00633000
*/* END OF TPEPILOG */                                             0322 00634000
*/* ATDSPLY   INVOKED. */                                          0322 00635000
*/********************************************************************/ 00636000
*/* THE FOLLOWING ATBUILD INCLUSIONS HAVE BEEN MADE IN THIS          */ 00637000
*/* COMPILATION:                                                     */ 00638000
*/*             ISTPAB                                               */ 00639000
*/*             ISTDYPAB                                             */ 00640000
*/*             ISTRPH                                               */ 00641000
*/*             ISTLOK                                               */ 00642000
*/*             ISTATCVT                                             */ 00643000
*/*             ISTSRT                                               */ 00644000
*/********************************************************************/ 00645000
*/* END OF ATDSPLY. */                                             0322 00646000
*END ISTOCCDF                                                      0322 00647000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00648000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00649000
*;                                                                 0322 00650000
@DATA    DS    0H                                                       00651000
@CH01243 DC    H'26'                                                    00652000
@SM01316 MVC   ISTSRT(0,CWORKREG),ISTSRT(SRTPTR)                        00653000
@SM01318 MVC   ISTSRT(0,@09),ISTSRT+9(@02)                              00654000
@DATD    DSECT                                                          00655000
         DS    0F                                                       00656000
ISTOCCDF CSECT                                                          00657000
         DS    0F                                                       00658000
@CF00081 DC    F'1'                                                     00659000
@CF00054 DC    F'4'                                                     00660000
@CF01239 DC    F'10'                                                    00661000
@CF00974 DC    F'16'                                                    00662000
@CF01233 DC    F'-1'                                                    00663000
@CF01315 DC    XL4'0000FFFF'                                            00664000
@DATD    DSECT                                                          00665000
         DS    0D                                                       00666000
CVTPTR   DS    A                                                        00667000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00668000
@ENDDATD EQU   *                                                        00669000
ISTOCCDF CSECT                                                          00670000
         DS    0F                                                       00671000
@SIZDATD DC    AL1(0)                                                   00672000
         DC    AL3(@ENDDATD-@DATD)                                      00673000
         DS    0D                                                       00674000
CNEGVAL  DC    F'-1'                                                    00675000
CMZA0019 DS    FL4                                                      00676000
         ORG   CMZA0019                                                 00677000
@NM00018 DC    AL1(64)                                                  00678000
@NM00019 DC    AL1(96)                                                  00679000
@NM00020 DC    AL1(241)                                                 00680000
@NM00021 DC    XL1'01'                                                  00681000
         ORG   CMZA0019+4                                               00682000
CMZA0038 DS    FL4                                                      00683000
         ORG   CMZA0038                                                 00684000
@NM00022 DC    AL1(64)                                                  00685000
@NM00023 DC    AL1(96)                                                  00686000
@NM00024 DC    AL1(241)                                                 00687000
@NM00025 DC    XL1'01'                                                  00688000
         ORG   CMZA0038+4                                               00689000
CMZA0057 DS    FL4                                                      00690000
         ORG   CMZA0057                                                 00691000
@NM00026 DC    AL1(96)                                                  00692000
@NM00027 DC    AL1(96)                                                  00693000
@NM00028 DC    AL1(241)                                                 00694000
@NM00029 DC    XL1'00'                                                  00695000
         ORG   CMZA0057+4                                               00696000
CMZA0075 DS    FL4                                                      00697000
         ORG   CMZA0075                                                 00698000
@NM00030 DC    AL1(64)                                                  00699000
@NM00031 DC    AL1(96)                                                  00700000
@NM00032 DC    AL1(241)                                                 00701000
@NM00033 DC    XL1'01'                                                  00702000
         ORG   CMZA0075+4                                               00703000
CBHSTMSK DC    X'7FFFFFFF'                                              00704000
CBITMASK DC    X'80000000'                                              00705000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00706000
@01      EQU   01                                                       00707000
@02      EQU   02                                                       00708000
@03      EQU   03                                                       00709000
@04      EQU   04                                                       00710000
@05      EQU   05                                                       00711000
@06      EQU   06                                                       00712000
@07      EQU   07                                                       00713000
@08      EQU   08                                                       00714000
@09      EQU   09                                                       00715000
@10      EQU   10                                                       00716000
@11      EQU   11                                                       00717000
@12      EQU   12                                                       00718000
@13      EQU   13                                                       00719000
@14      EQU   14                                                       00720000
@15      EQU   15                                                       00721000
CREG0    EQU   @00                                                      00722000
CNAMEPTR EQU   @00                                                      00723000
CREG1    EQU   @01                                                      00724000
CBHSPTR  EQU   @02                                                      00725000
SRTPTR   EQU   @03                                                      00726000
CSRTDPTR EQU   @04                                                      00727000
CLASTPTR EQU   @05                                                      00728000
CWORKREG EQU   @06                                                      00729000
CRETCODE EQU   @07                                                      00730000
ATCVTPTR EQU   @08                                                      00731000
CSIZE    EQU   @08                                                      00732000
REG9     EQU   @09                                                      00733000
CTEMP    EQU   @10                                                      00734000
CSAVE    EQU   @11                                                      00735000
CRETPTR  EQU   @14                                                      00736000
CRCODE   EQU   @15                                                      00737000
RPHPTR   EQU   @01                                                      00738000
GPR02F   EQU   @02                                                      00739000
GPR00F   EQU   @00                                                      00740000
GPR00P   EQU   @00                                                      00741000
GPR01P   EQU   @01                                                      00742000
GPR02P   EQU   @02                                                      00743000
GPR03F   EQU   @03                                                      00744000
GPR03P   EQU   @03                                                      00745000
GPR04P   EQU   @04                                                      00746000
GPR05P   EQU   @05                                                      00747000
GPR06P   EQU   @06                                                      00748000
GPR07P   EQU   @07                                                      00749000
GPR08P   EQU   @08                                                      00750000
GPR09P   EQU   @09                                                      00751000
GPR10P   EQU   @10                                                      00752000
GPR11P   EQU   @11                                                      00753000
GPR12P   EQU   @12                                                      00754000
GPR13P   EQU   @13                                                      00755000
GPR01F   EQU   @01                                                      00756000
GPR04F   EQU   @04                                                      00757000
GPR05F   EQU   @05                                                      00758000
GPR06F   EQU   @06                                                      00759000
GPR07F   EQU   @07                                                      00760000
GPR08F   EQU   @08                                                      00761000
GPR09F   EQU   @09                                                      00762000
GPR10F   EQU   @10                                                      00763000
GPR11F   EQU   @11                                                      00764000
GPR12F   EQU   @12                                                      00765000
GPR13F   EQU   @13                                                      00766000
GPR14F   EQU   @14                                                      00767000
GPR14P   EQU   @14                                                      00768000
GPR15F   EQU   @15                                                      00769000
GPR15P   EQU   @15                                                      00770000
ATCLCPTR EQU   1032                                                     00771000
CSRTDENT EQU   0                                                        00772000
CSYMNAME EQU   0                                                        00773000
CSYMNAM1 EQU   CSYMNAME                                                 00774000
CSYMNAM2 EQU   CSYMNAME+4                                               00775000
CVTMAP   EQU   0                                                        00776000
CVTDAR   EQU   CVTMAP+72                                                00777000
CVTFLGS1 EQU   CVTDAR                                                   00778000
CVTDCB   EQU   CVTMAP+116                                               00779000
CVTIERLC EQU   CVTMAP+144                                               00780000
CVTOPTA  EQU   CVTMAP+182                                               00781000
CVTOPTB  EQU   CVTMAP+183                                               00782000
CVTGTF   EQU   CVTMAP+236                                               00783000
CVTGTFST EQU   CVTGTF                                                   00784000
CVTGTFS  EQU   CVTGTFST                                                 00785000
CVTSTATE EQU   CVTGTFST                                                 00786000
CVTTMODE EQU   CVTGTFST                                                 00787000
CVTFORM  EQU   CVTGTFST                                                 00788000
CVTAQAVT EQU   CVTMAP+240                                               00789000
CVTTCMFG EQU   CVTAQAVT                                                 00790000
CVTVOLM2 EQU   CVTMAP+244                                               00791000
CVTTATA  EQU   CVTVOLM2                                                 00792000
CVTTSKS  EQU   CVTTATA                                                  00793000
CVTVOLF2 EQU   CVTTSKS                                                  00794000
CVTTAT   EQU   CVTTATA+1                                                00795000
CVTATER  EQU   CVTMAP+248                                               00796000
CVTEXT1  EQU   CVTMAP+252                                               00797000
CVTPURG  EQU   CVTMAP+260                                               00798000
CVTQMSG  EQU   CVTMAP+268                                               00799000
CVTDMSR  EQU   CVTMAP+272                                               00800000
CVTERPV  EQU   CVTMAP+316                                               00801000
CVTINTLA EQU   CVTMAP+320                                               00802000
CVTAPF   EQU   CVTMAP+324                                               00803000
CVTEXT2  EQU   CVTMAP+328                                               00804000
CVTHJES  EQU   CVTMAP+332                                               00805000
CVTPGSIA EQU   CVTMAP+348                                               00806000
CVTA1F1  EQU   CVTMAP+356                                               00807000
CVTSYSK  EQU   CVTMAP+357                                               00808000
CVTVOLM1 EQU   CVTMAP+380                                               00809000
CVTVOLF1 EQU   CVTVOLM1                                                 00810000
CVTATMCT EQU   CVTMAP+388                                               00811000
CVTXTNT1 EQU   0                                                        00812000
CVTXTNT2 EQU   0                                                        00813000
CVTDSSV  EQU   CVTXTNT2                                                 00814000
CVTFLGBT EQU   CVTXTNT2+5                                               00815000
CVTQID   EQU   CVTXTNT2+24                                              00816000
CVTSHS   EQU   CVTXTNT2+40                                              00817000
CVTRV400 EQU   CVTXTNT2+52                                              00818000
CVTRV409 EQU   CVTXTNT2+53                                              00819000
CVTATCVT EQU   CVTXTNT2+64                                              00820000
CVTRV429 EQU   CVTXTNT2+84                                              00821000
CVTRV438 EQU   CVTXTNT2+85                                              00822000
CVTRV457 EQU   CVTXTNT2+112                                             00823000
CVTRV466 EQU   CVTXTNT2+113                                             00824000
CVTFIX   EQU   0                                                        00825000
CVTRELNO EQU   CVTFIX+252                                               00826000
ISTPAB   EQU   0                                                        00827000
PABWQCHN EQU   ISTPAB                                                   00828000
PABWEQA  EQU   PABWQCHN                                                 00829000
PABCHAIN EQU   PABWQCHN+4                                               00830000
PABRPHFG EQU   ISTPAB+12                                                00831000
PABFLAGS EQU   PABRPHFG                                                 00832000
PABERLCK EQU   PABFLAGS                                                 00833000
PABERRLK EQU   PABERLCK                                                 00834000
ISTDYPAB EQU   0                                                        00835000
ISTRPH   EQU   0                                                        00836000
RPHFLAGS EQU   ISTRPH+2                                                 00837000
RPHAPTYP EQU   RPHFLAGS                                                 00838000
RPHFSTLC EQU   RPHFLAGS                                                 00839000
RPHFLGB  EQU   ISTRPH+3                                                 00840000
RPHRPHA  EQU   ISTRPH+4                                                 00841000
RPHTSKID EQU   ISTRPH+8                                                 00842000
RPHRESMA EQU   ISTRPH+16                                                00843000
RPHWPFLG EQU   RPHRESMA                                                 00844000
RPHWEA   EQU   ISTRPH+24                                                00845000
RPHCSPA  EQU   RPHWEA                                                   00846000
RPHSRPRM EQU   ISTRPH+28                                                00847000
RPHPABQA EQU   ISTRPH+36                                                00848000
RPHWORK  EQU   ISTRPH+40                                                00849000
RPHSAVE1 EQU   RPHWORK                                                  00850000
RPHSBITS EQU   RPHSAVE1+1                                               00851000
ISTLOK   EQU   0                                                        00852000
LOKCHN   EQU   ISTLOK+1                                                 00853000
LOKCHNG  EQU   LOKCHN                                                   00854000
@NM00007 EQU   LOKCHNG+2                                                00855000
ISTATCVT EQU   0                                                        00856000
ATCCOM   EQU   ISTATCVT                                                 00857000
ATCSTAT  EQU   ATCCOM                                                   00858000
ATCSTAT1 EQU   ATCSTAT                                                  00859000
ATCSTFLG EQU   ATCSTAT+1                                                00860000
ATCPOFLG EQU   ATCSTAT+2                                                00861000
ATCSTAT4 EQU   ATCSTAT+3                                                00862000
ATCSRT   EQU   ATCCOM+16                                                00863000
ATCIOTRC EQU   ATCCOM+140                                               00864000
ATCTHTRC EQU   ATCIOTRC                                                 00865000
ATCGTSTR EQU   ATCCOM+164                                               00866000
ATCCSMR  EQU   ISTATCVT+296                                             00867000
ATCSHRFG EQU   ISTATCVT+316                                             00868000
ATCHPGM  EQU   ISTATCVT+384                                             00869000
ATCVLCNT EQU   ISTATCVT+772                                             00870000
ATCSOPD  EQU   ISTATCVT+792                                             00871000
ATCSIPD  EQU   ISTATCVT+800                                             00872000
ATCSECST EQU   ISTATCVT+812                                             00873000
ATCAOSM  EQU   ISTATCVT+912                                             00874000
ATCGSRBQ EQU   ATCAOSM+4                                                00875000
ATCGSRBG EQU   ATCGSRBQ                                                 00876000
ATCICAPP EQU   ATCAOSM+100                                              00877000
ATCLDAPP EQU   ATCAOSM+120                                              00878000
ATCDAPVT EQU   ATCAOSM+140                                              00879000
ATCVTFLG EQU   ATCAOSM+392                                              00880000
ATCZFLAG EQU   ATCAOSM+588                                              00881000
ISTSRT   EQU   0                                                        00882000
SRTSRTE  EQU   ISTSRT                                                   00883000
SRTFLAGS EQU   ISTSRT+4                                                 00884000
SRTBHSET EQU   SRTFLAGS                                                 00885000
SRTSDVT  EQU   SRTFLAGS                                                 00886000
SRTLNGTH EQU   ISTSRT+6                                                 00887000
SRTSYMNM EQU   ISTSRT+8                                                 00888000
SRTRDTE  EQU   ISTSRT+16                                                00889000
SRTBHID  EQU   ISTSRT+25                                                00890000
CVTS01   EQU   CVTPGSIA                                                 00891000
CVTLPDIA EQU   CVTS01+12                                                00892000
CVTDIRST EQU   CVTLPDIA                                                 00893000
CVTSLIDA EQU   CVTS01+24                                                00894000
CVTCTLFG EQU   CVTS01+50                                                00895000
CVTRV210 EQU   CVTS01+424                                               00896000
CVTRV219 EQU   CVTS01+425                                               00897000
CVTRV228 EQU   CVTS01+426                                               00898000
CVTRV237 EQU   CVTS01+427                                               00899000
CVTMFRTR EQU   CVTS01+452                                               00900000
CVTRV262 EQU   CVTS01+468                                               00901000
CVTRV271 EQU   CVTS01+469                                               00902000
CVTRV280 EQU   CVTS01+470                                               00903000
CVTRV289 EQU   CVTS01+471                                               00904000
CVTGSDA  EQU   CVTS01+600                                               00905000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00906000
CVTRV628 EQU   CVTS01+728                                               00907000
CVTRV627 EQU   CVTS01+724                                               00908000
CVTRV626 EQU   CVTS01+720                                               00909000
CVTRV625 EQU   CVTS01+716                                               00910000
CVTRV624 EQU   CVTS01+712                                               00911000
CVTRV623 EQU   CVTS01+708                                               00912000
CVTRV622 EQU   CVTS01+704                                               00913000
CVTRV621 EQU   CVTS01+700                                               00914000
CVTRV620 EQU   CVTS01+696                                               00915000
CVTRV619 EQU   CVTS01+692                                               00916000
CVTRV618 EQU   CVTS01+688                                               00917000
CVTRV617 EQU   CVTS01+684                                               00918000
CVTRV616 EQU   CVTS01+680                                               00919000
CVTRV615 EQU   CVTS01+676                                               00920000
CVTRV614 EQU   CVTS01+672                                               00921000
CVTRV613 EQU   CVTS01+668                                               00922000
CVTRV612 EQU   CVTS01+664                                               00923000
CVTRV611 EQU   CVTS01+660                                               00924000
CVTEVERM EQU   CVTS01+656                                               00925000
CVTIRM   EQU   CVTS01+652                                               00926000
CVTCGK   EQU   CVTS01+648                                               00927000
CVTRAC   EQU   CVTS01+644                                               00928000
CVTRV606 EQU   CVTS01+640                                               00929000
CVTRV605 EQU   CVTS01+636                                               00930000
CVTRV604 EQU   CVTS01+632                                               00931000
CVTEFF02 EQU   CVTS01+628                                               00932000
CVTCBBR  EQU   CVTS01+624                                               00933000
CVTSSCR  EQU   CVTS01+620                                               00934000
CVTEVENT EQU   CVTS01+616                                               00935000
CVTCRCA  EQU   CVTS01+612                                               00936000
CVTTPIO  EQU   CVTS01+608                                               00937000
CVTADV   EQU   CVTS01+604                                               00938000
CVTGSDAB EQU   CVTGSDA                                                  00939000
CVTQV3   EQU   CVTS01+596                                               00940000
CVTQV2   EQU   CVTS01+592                                               00941000
CVTQV1   EQU   CVTS01+588                                               00942000
CVTRPT   EQU   CVTS01+584                                               00943000
CVTSSRB  EQU   CVTS01+580                                               00944000
CVTCSDRL EQU   CVTS01+576                                               00945000
CVTEXP1  EQU   CVTS01+572                                               00946000
CVTRMPMT EQU   CVTS01+568                                               00947000
CVTRMPTT EQU   CVTS01+564                                               00948000
CVTVPSA  EQU   CVTS01+560                                               00949000
CVTVSTOP EQU   CVTS01+556                                               00950000
CVTGTFR8 EQU   CVTS01+552                                               00951000
CVTQUIT  EQU   CVTS01+548                                               00952000
CVTVACR  EQU   CVTS01+544                                               00953000
CVTWTCB  EQU   CVTS01+540                                               00954000
CVTSTPRS EQU   CVTS01+536                                               00955000
CVT0PT02 EQU   CVTS01+532                                               00956000
CVTDARCM EQU   CVTS01+528                                               00957000
CVTIRECM EQU   CVTS01+524                                               00958000
CVTJRECM EQU   CVTS01+520                                               00959000
CVTVEMS0 EQU   CVTS01+516                                               00960000
CVTSPFRR EQU   CVTS01+512                                               00961000
CVTRLSTG EQU   CVTS01+508                                               00962000
CVT0TC0A EQU   CVTS01+504                                               00963000
CVTGMBR  EQU   CVTS01+500                                               00964000
CVTLFRM  EQU   CVTS01+496                                               00965000
CVTRMBR  EQU   CVTS01+492                                               00966000
CVTVIOP  EQU   CVTS01+488                                               00967000
CVTRV307 EQU   CVTS01+486                                               00968000
CVTRV306 EQU   CVTS01+484                                               00969000
CVTRV305 EQU   CVTS01+482                                               00970000
CVTRV304 EQU   CVTS01+480                                               00971000
CVTRV303 EQU   CVTS01+478                                               00972000
CVTRV302 EQU   CVTS01+476                                               00973000
CVTTRCA  EQU   CVTS01+472                                               00974000
CVTRV297 EQU   CVTRV289                                                 00975000
CVTRV296 EQU   CVTRV289                                                 00976000
CVTRV295 EQU   CVTRV289                                                 00977000
CVTRV294 EQU   CVTRV289                                                 00978000
CVTRV293 EQU   CVTRV289                                                 00979000
CVTRV292 EQU   CVTRV289                                                 00980000
CVTRV291 EQU   CVTRV289                                                 00981000
CVTRV290 EQU   CVTRV289                                                 00982000
CVTRV288 EQU   CVTRV280                                                 00983000
CVTRV287 EQU   CVTRV280                                                 00984000
CVTRV286 EQU   CVTRV280                                                 00985000
CVTRV285 EQU   CVTRV280                                                 00986000
CVTRV284 EQU   CVTRV280                                                 00987000
CVTRV283 EQU   CVTRV280                                                 00988000
CVTRV282 EQU   CVTRV280                                                 00989000
CVTRV281 EQU   CVTRV280                                                 00990000
CVTRV279 EQU   CVTRV271                                                 00991000
CVTRV278 EQU   CVTRV271                                                 00992000
CVTRV277 EQU   CVTRV271                                                 00993000
CVTRV276 EQU   CVTRV271                                                 00994000
CVTRV275 EQU   CVTRV271                                                 00995000
CVTRV274 EQU   CVTRV271                                                 00996000
CVTRV273 EQU   CVTRV271                                                 00997000
CVTRV272 EQU   CVTRV271                                                 00998000
CVTRV270 EQU   CVTRV262                                                 00999000
CVTRV269 EQU   CVTRV262                                                 01000000
CVTRV268 EQU   CVTRV262                                                 01001000
CVTRV267 EQU   CVTRV262                                                 01002000
CVTRV266 EQU   CVTRV262                                                 01003000
CVTRV265 EQU   CVTRV262                                                 01004000
CVTRV264 EQU   CVTRV262                                                 01005000
CVTRV263 EQU   CVTRV262                                                 01006000
CVTVFP   EQU   CVTS01+464                                               01007000
CVTVSI   EQU   CVTS01+460                                               01008000
CVTVPSIB EQU   CVTS01+456                                               01009000
CVTMFACT EQU   CVTMFRTR                                                 01010000
CVTMFCTL EQU   CVTS01+448                                               01011000
CVTPVBP  EQU   CVTS01+444                                               01012000
CVTPWI   EQU   CVTS01+440                                               01013000
CVTRV254 EQU   CVTS01+438                                               01014000
CVTRV253 EQU   CVTS01+436                                               01015000
CVTRV252 EQU   CVTS01+434                                               01016000
CVTRV251 EQU   CVTS01+433                                               01017000
CVTRV250 EQU   CVTS01+432                                               01018000
CVTRV249 EQU   CVTS01+431                                               01019000
CVTRV248 EQU   CVTS01+430                                               01020000
CVTRV247 EQU   CVTS01+429                                               01021000
CVTRV246 EQU   CVTS01+428                                               01022000
CVTRV245 EQU   CVTRV237                                                 01023000
CVTRV244 EQU   CVTRV237                                                 01024000
CVTRV243 EQU   CVTRV237                                                 01025000
CVTRV242 EQU   CVTRV237                                                 01026000
CVTRV241 EQU   CVTRV237                                                 01027000
CVTRV240 EQU   CVTRV237                                                 01028000
CVTRV239 EQU   CVTRV237                                                 01029000
CVTRV238 EQU   CVTRV237                                                 01030000
CVTRV236 EQU   CVTRV228                                                 01031000
CVTRV235 EQU   CVTRV228                                                 01032000
CVTRV234 EQU   CVTRV228                                                 01033000
CVTRV233 EQU   CVTRV228                                                 01034000
CVTRV232 EQU   CVTRV228                                                 01035000
CVTRV231 EQU   CVTRV228                                                 01036000
CVTRV230 EQU   CVTRV228                                                 01037000
CVTRV229 EQU   CVTRV228                                                 01038000
CVTRV227 EQU   CVTRV219                                                 01039000
CVTRV226 EQU   CVTRV219                                                 01040000
CVTRV225 EQU   CVTRV219                                                 01041000
CVTRV224 EQU   CVTRV219                                                 01042000
CVTRV223 EQU   CVTRV219                                                 01043000
CVTRV222 EQU   CVTRV219                                                 01044000
CVTRV221 EQU   CVTRV219                                                 01045000
CVTRV220 EQU   CVTRV219                                                 01046000
CVTRV218 EQU   CVTRV210                                                 01047000
CVTRV217 EQU   CVTRV210                                                 01048000
CVTRV216 EQU   CVTRV210                                                 01049000
CVTRV215 EQU   CVTRV210                                                 01050000
CVTRV214 EQU   CVTRV210                                                 01051000
CVTRV213 EQU   CVTRV210                                                 01052000
CVTRV212 EQU   CVTRV210                                                 01053000
CVTRV211 EQU   CVTRV210                                                 01054000
CVTLCCAT EQU   CVTS01+420                                               01055000
CVTPCCAT EQU   CVTS01+416                                               01056000
CVTIPCRP EQU   CVTS01+412                                               01057000
CVTIPCRI EQU   CVTS01+408                                               01058000
CVTIPCDS EQU   CVTS01+404                                               01059000
CVTAIDVT EQU   CVTS01+400                                               01060000
CVTSSAP  EQU   CVTS01+396                                               01061000
CVTEHCIR EQU   CVTS01+392                                               01062000
CVTEHDEF EQU   CVTS01+388                                               01063000
CVTDAIR  EQU   CVTS01+384                                               01064000
CVTPERFM EQU   CVTS01+380                                               01065000
CVT044R2 EQU   CVTS01+376                                               01066000
CVTFETCH EQU   CVTS01+372                                               01067000
CVTRSTWD EQU   CVTS01+368                                               01068000
CVTSPOST EQU   CVTS01+364                                               01069000
CVTIOBP  EQU   CVTS01+360                                               01070000
CVTASMVT EQU   CVTS01+356                                               01071000
CVTRECRQ EQU   CVTS01+352                                               01072000
CVTWSAC  EQU   CVTS01+348                                               01073000
CVTRV149 EQU   CVTS01+344                                               01074000
CVTWSAL  EQU   CVTS01+340                                               01075000
CVTSPSA  EQU   CVTS01+336                                               01076000
CVTGLMN  EQU   CVTS01+332                                               01077000
CVTVEAC0 EQU   CVTS01+328                                               01078000
CVT062R1 EQU   CVTS01+324                                               01079000
CVTRPOST EQU   CVTS01+320                                               01080000
CVTDQIQE EQU   CVTS01+316                                               01081000
CVTCSD   EQU   CVTS01+312                                               01082000
CVTLKRMA EQU   CVTS01+308                                               01083000
CVTRSPIE EQU   CVTS01+304                                               01084000
CVTRENQ  EQU   CVTS01+300                                               01085000
CVTLQCB  EQU   CVTS01+296                                               01086000
CVTFQCB  EQU   CVTS01+292                                               01087000
CVTQCS01 EQU   CVTS01+288                                               01088000
CVTAPFT  EQU   CVTS01+284                                               01089000
CVTPARRL EQU   CVTS01+280                                               01090000
CVTVWAIT EQU   CVTS01+276                                               01091000
CVTGSPL  EQU   CVTS01+272                                               01092000
CVTLSMQ  EQU   CVTS01+268                                               01093000
CVTGSMQ  EQU   CVTS01+264                                               01094000
CVTEXPRO EQU   CVTS01+260                                               01095000
CVTOPCTP EQU   CVTS01+256                                               01096000
CVTSIC   EQU   CVTS01+252                                               01097000
CVTTPIOS EQU   CVTS01+248                                               01098000
CVTRTMS  EQU   CVTS01+244                                               01099000
CVTSDBF  EQU   CVTS01+240                                               01100000
CVTSCBP  EQU   CVTS01+236                                               01101000
CVTSDMP  EQU   CVTS01+232                                               01102000
CVTSV60  EQU   CVTS01+228                                               01103000
CVTRTMCT EQU   CVTS01+224                                               01104000
CVTASCBL EQU   CVTS01+220                                               01105000
CVTASCBH EQU   CVTS01+216                                               01106000
CVTGDA   EQU   CVTS01+212                                               01107000
CVTASVT  EQU   CVTS01+208                                               01108000
CVTVVMDI EQU   CVTS01+204                                               01109000
CVTAQTOP EQU   CVTS01+200                                               01110000
CVTIOSCS EQU   CVTS01+196                                               01111000
CVTSDRM  EQU   CVTS01+192                                               01112000
CVTOPTE  EQU   CVTS01+188                                               01113000
CVTSTXU  EQU   CVTS01+184                                               01114000
CVTQUIS  EQU   CVTS01+180                                               01115000
CVTPARS  EQU   CVTS01+176                                               01116000
CVTS1EE  EQU   CVTS01+172                                               01117000
CVTFRAS  EQU   CVTS01+168                                               01118000
CVTQSAS  EQU   CVTS01+164                                               01119000
CVTCRAS  EQU   CVTS01+160                                               01120000
CVTCRMN  EQU   CVTS01+156                                               01121000
CVTDELCP EQU   CVTS01+152                                               01122000
CVTFRECL EQU   CVTS01+148                                               01123000
CVTGETCL EQU   CVTS01+144                                               01124000
CVTBLDCP EQU   CVTS01+140                                               01125000
CVTAUTHL EQU   CVTS01+136                                               01126000
CVTSCAN  EQU   CVTS01+132                                               01127000
CVTRV144 EQU   CVTS01+130                                               01128000
CVTMAXMP EQU   CVTS01+128                                               01129000
CVTSTCK  EQU   CVTS01+124                                               01130000
CVTRV139 EQU   CVTS01+123                                               01131000
CVTDSSAC EQU   CVTS01+122                                               01132000
CVTRV513 EQU   CVTS01+121                                               01133000
CVTIOSPL EQU   CVTS01+120                                               01134000
CVTPTGT  EQU   CVTS01+116                                               01135000
CVTCSPIE EQU   CVTS01+112                                               01136000
CVTSMFEX EQU   CVTS01+108                                               01137000
CVTOLT0A EQU   CVTS01+104                                               01138000
CVTSRBRT EQU   CVTS01+100                                               01139000
CVTPUTL  EQU   CVTS01+96                                                01140000
CVTRV519 EQU   CVTS01+92                                                01141000
CVTRV327 EQU   CVTS01+88                                                01142000
CVTRV326 EQU   CVTS01+84                                                01143000
CVTRV325 EQU   CVTS01+80                                                01144000
CVTRV324 EQU   CVTS01+76                                                01145000
CVT0VL01 EQU   CVTS01+72                                                01146000
CVTSHRVM EQU   CVTS01+68                                                01147000
CVTRV332 EQU   CVTS01+64                                                01148000
CVTTAS   EQU   CVTS01+60                                                01149000
CVTRSCN  EQU   CVTS01+56                                                01150000
CVTTRAC2 EQU   CVTS01+54                                                01151000
CVTTRACE EQU   CVTS01+52                                                01152000
CVTAPG   EQU   CVTS01+51                                                01153000
CVTSDTRC EQU   CVTCTLFG                                                 01154000
CVTGTRCE EQU   CVTCTLFG                                                 01155000
CVTNOMP  EQU   CVTCTLFG                                                 01156000
CVTRSV79 EQU   CVTCTLFG                                                 01157000
CVTDSTAT EQU   CVTCTLFG                                                 01158000
CVTRSV78 EQU   CVTCTLFG                                                 01159000
CVTRV333 EQU   CVTCTLFG                                                 01160000
CVTRV323 EQU   CVTCTLFG                                                 01161000
CVTSPVLK EQU   CVTS01+49                                                01162000
CVTRSV77 EQU   CVTS01+48                                                01163000
CVTRV331 EQU   CVTS01+44                                                01164000
CVTRV330 EQU   CVTS01+40                                                01165000
CVTRV329 EQU   CVTS01+36                                                01166000
CVTRV328 EQU   CVTS01+32                                                01167000
CVTRV322 EQU   CVTS01+28                                                01168000
CVTSLID  EQU   CVTSLIDA+1                                               01169000
CVTSYLK  EQU   CVTSLIDA                                                 01170000
CVTRV321 EQU   CVTS01+20                                                01171000
CVTRV320 EQU   CVTS01+16                                                01172000
CVTLPDIR EQU   CVTLPDIA+1                                               01173000
CVTRSV69 EQU   CVTDIRST                                                 01174000
CVTRSV68 EQU   CVTDIRST                                                 01175000
CVTRSV67 EQU   CVTDIRST                                                 01176000
CVTRSV66 EQU   CVTDIRST                                                 01177000
CVTRSV65 EQU   CVTDIRST                                                 01178000
CVTRSV64 EQU   CVTDIRST                                                 01179000
CVTRSV63 EQU   CVTDIRST                                                 01180000
CVTDICOM EQU   CVTDIRST                                                 01181000
CVTPVTP  EQU   CVTS01+8                                                 01182000
CVTLPDSR EQU   CVTS01+4                                                 01183000
CVTGETL  EQU   CVTS01                                                   01184000
SRTRES4  EQU   ISTSRT+20                                                01185000
SRTRES2  EQU   ISTSRT+5                                                 01186000
@NM00017 EQU   SRTFLAGS                                                 01187000
@NM00016 EQU   SRTFLAGS                                                 01188000
@NM00015 EQU   SRTFLAGS                                                 01189000
@NM00014 EQU   SRTFLAGS                                                 01190000
@NM00013 EQU   SRTFLAGS                                                 01191000
SRTSDEL  EQU   SRTFLAGS                                                 01192000
ATCAOS   EQU   ISTATCVT+1552                                            01193000
ATCVIOPM EQU   ATCAOSM+636                                              01194000
ATCTPMMI EQU   ATCAOSM+632                                              01195000
ATCTPMPB EQU   ATCAOSM+600                                              01196000
ATCRPLCT EQU   ATCAOSM+594                                              01197000
ATCCRACT EQU   ATCAOSM+592                                              01198000
ATCSRBCT EQU   ATCAOSM+590                                              01199000
ATCRSV75 EQU   ATCAOSM+589                                              01200000
ATCRSV66 EQU   ATCZFLAG                                                 01201000
ATCZF001 EQU   ATCZFLAG                                                 01202000
ATCTPCP1 EQU   ATCAOSM+584                                              01203000
ATCTPCP0 EQU   ATCAOSM+580                                              01204000
ATCAICTN EQU   ATCAOSM+576                                              01205000
ATCZR01  EQU   ATCAOSM+572                                              01206000
ATCMPLTA EQU   ATCAOSM+568                                              01207000
ATCASCB  EQU   ATCAOSM+564                                              01208000
ATCAP86  EQU   ATCAOSM+560                                              01209000
ATCAP85  EQU   ATCAOSM+556                                              01210000
ATCAP84  EQU   ATCAOSM+552                                              01211000
ATCAP83  EQU   ATCAOSM+548                                              01212000
ATCAP82  EQU   ATCAOSM+544                                              01213000
ATCAP69  EQU   ATCAOSM+540                                              01214000
ATCAP66  EQU   ATCAOSM+536                                              01215000
ATCAP62  EQU   ATCAOSM+532                                              01216000
ATCAPC59 EQU   ATCAOSM+528                                              01217000
ATCAP56  EQU   ATCAOSM+524                                              01218000
ATCAP55  EQU   ATCAOSM+520                                              01219000
ATCRCFY0 EQU   ATCAOSM+516                                              01220000
ATCAP41  EQU   ATCAOSM+512                                              01221000
ATCAPC25 EQU   ATCAOSM+508                                              01222000
ATCAP23  EQU   ATCAOSM+504                                              01223000
ATCTPSPB EQU   ATCAOSM+472                                              01224000
ATCTRMBP EQU   ATCAOSM+440                                              01225000
ATCPSTA  EQU   ATCAOSM+432                                              01226000
ATCSMABF EQU   ATCAOSM+428                                              01227000
ATCSMAPR EQU   ATCAOSM+424                                              01228000
ATCTPWQA EQU   ATCAOSM+420                                              01229000
ATCSMAID EQU   ATCAOSM+416                                              01230000
ATCSMARA EQU   ATCAOSM+412                                              01231000
ATCCACXA EQU   ATCAOSM+408                                              01232000
ATCZLAAB EQU   ATCAOSM+404                                              01233000
ATCATA10 EQU   ATCAOSM+400                                              01234000
ATCHLTCB EQU   ATCAOSM+396                                              01235000
@NM00012 EQU   ATCVTFLG                                                 01236000
ATCVTACT EQU   ATCVTFLG                                                 01237000
ATCRPT40 EQU   ATCAOSM+388                                              01238000
ATCRPT39 EQU   ATCAOSM+384                                              01239000
ATCRPT38 EQU   ATCAOSM+380                                              01240000
ATCRPT37 EQU   ATCAOSM+376                                              01241000
ATCRPT36 EQU   ATCAOSM+372                                              01242000
ATCRPT35 EQU   ATCAOSM+368                                              01243000
ATCRPT34 EQU   ATCAOSM+364                                              01244000
ATCRPT33 EQU   ATCAOSM+360                                              01245000
ATCRPT32 EQU   ATCAOSM+356                                              01246000
ATCRPT31 EQU   ATCAOSM+352                                              01247000
ATCRPT30 EQU   ATCAOSM+348                                              01248000
ATCRPT29 EQU   ATCAOSM+344                                              01249000
ATCRPT28 EQU   ATCAOSM+340                                              01250000
ATCRPT27 EQU   ATCAOSM+336                                              01251000
ATCRPT26 EQU   ATCAOSM+332                                              01252000
ATCRPT25 EQU   ATCAOSM+328                                              01253000
ATCRPT24 EQU   ATCAOSM+324                                              01254000
ATCRPT23 EQU   ATCAOSM+320                                              01255000
ATCRPT22 EQU   ATCAOSM+316                                              01256000
ATCRPT21 EQU   ATCAOSM+312                                              01257000
ATCRPT20 EQU   ATCAOSM+308                                              01258000
ATCRPT19 EQU   ATCAOSM+304                                              01259000
ATCRPT18 EQU   ATCAOSM+300                                              01260000
ATCRPT17 EQU   ATCAOSM+296                                              01261000
ATCRPT16 EQU   ATCAOSM+292                                              01262000
ATCRPT15 EQU   ATCAOSM+288                                              01263000
ATCRPT14 EQU   ATCAOSM+284                                              01264000
ATCRPT13 EQU   ATCAOSM+280                                              01265000
ATCRPT12 EQU   ATCAOSM+276                                              01266000
ATCRPT11 EQU   ATCAOSM+272                                              01267000
ATCAP38  EQU   ATCAOSM+268                                              01268000
ATCAP37  EQU   ATCAOSM+264                                              01269000
ATCZDFJ0 EQU   ATCAOSM+260                                              01270000
ATCAP51  EQU   ATCAOSM+256                                              01271000
ATCZPAB2 EQU   ATCAOSM+224                                              01272000
ATCZPAB1 EQU   ATCAOSM+192                                              01273000
ATCZLFVT EQU   ATCAOSM+188                                              01274000
ATCZLPVT EQU   ATCAOSM+184                                              01275000
ATCZDVTX EQU   ATCAOSM+180                                              01276000
ATCZDVTA EQU   ATCAOSM+176                                              01277000
ATCZDVT9 EQU   ATCAOSM+172                                              01278000
ATCZDVT8 EQU   ATCAOSM+168                                              01279000
ATCZDVT7 EQU   ATCAOSM+164                                              01280000
ATCRSV56 EQU   ATCDAPVT+22                                              01281000
ATCDAPDG EQU   ATCDAPVT+20                                              01282000
ATCDXCEA EQU   ATCDAPVT+16                                              01283000
ATCDCEA  EQU   ATCDAPVT+12                                              01284000
ATCDPCIA EQU   ATCDAPVT+8                                               01285000
ATCDSIOA EQU   ATCDAPVT+4                                               01286000
ATCDEOEA EQU   ATCDAPVT                                                 01287000
ATCZLAEA EQU   ATCLDAPP+16                                              01288000
ATCZLCEA EQU   ATCLDAPP+12                                              01289000
ATCRSV17 EQU   ATCLDAPP+8                                               01290000
ATCSMFRR EQU   ATCLDAPP+4                                               01291000
ATCCDTID EQU   ATCLDAPP                                                 01292000
ATCZAEA  EQU   ATCICAPP+16                                              01293000
ATCZCEA  EQU   ATCICAPP+12                                              01294000
ATCCDTCB EQU   ATCICAPP+8                                               01295000
ATCZSIOA EQU   ATCICAPP+4                                               01296000
ATCCDRPH EQU   ATCICAPP                                                 01297000
ATCAP65  EQU   ATCAOSM+96                                               01298000
ATCZDVT6 EQU   ATCAOSM+92                                               01299000
ATCZDVT4 EQU   ATCAOSM+88                                               01300000
ATCZDVT3 EQU   ATCAOSM+84                                               01301000
ATCZDVT1 EQU   ATCAOSM+80                                               01302000
ATCICNCB EQU   ATCAOSM+76                                               01303000
ATCZPSVT EQU   ATCAOSM+72                                               01304000
ATCZFSVT EQU   ATCAOSM+68                                               01305000
ATCAP64  EQU   ATCAOSM+64                                               01306000
ATCAP63  EQU   ATCAOSM+60                                               01307000
ATCAP61  EQU   ATCAOSM+56                                               01308000
ATCAP58  EQU   ATCAOSM+52                                               01309000
ATCAP57  EQU   ATCAOSM+48                                               01310000
ATCAP54  EQU   ATCAOSM+44                                               01311000
ATCAP53  EQU   ATCAOSM+40                                               01312000
ATCAP52  EQU   ATCAOSM+36                                               01313000
ATCAP34  EQU   ATCAOSM+32                                               01314000
ATCAP32  EQU   ATCAOSM+28                                               01315000
ATCAP31  EQU   ATCAOSM+24                                               01316000
ATCAP12  EQU   ATCAOSM+20                                               01317000
ATCAP11  EQU   ATCAOSM+16                                               01318000
ATCCMTCB EQU   ATCAOSM+12                                               01319000
ATCPRPH  EQU   ATCAOSM+8                                                01320000
ATCGSRBF EQU   ATCGSRBG                                                 01321000
ATCSRBRT EQU   ATCAOSM                                                  01322000
ATCRSVBB EQU   ISTATCVT+908                                             01323000
ATCVDLOK EQU   ISTATCVT+904                                             01324000
ATCVFPAB EQU   ISTATCVT+872                                             01325000
ATCVDPAB EQU   ISTATCVT+840                                             01326000
ATCIOECB EQU   ISTATCVT+836                                             01327000
ATCINCW3 EQU   ISTATCVT+832                                             01328000
ATCMODTB EQU   ISTATCVT+828                                             01329000
ATCUSSPT EQU   ISTATCVT+824                                             01330000
ATCSRTAB EQU   ISTATCVT+820                                             01331000
@NM00011 EQU   ISTATCVT+818                                             01332000
ATCNMCTR EQU   ISTATCVT+816                                             01333000
ATCSEC51 EQU   ATCSECST                                                 01334000
ATCSEC40 EQU   ATCSIPD+8                                                01335000
ATCSEC30 EQU   ATCSIPD+4                                                01336000
ATCSEC21 EQU   ATCSIPD                                                  01337000
ATCSEC10 EQU   ATCSOPD+4                                                01338000
ATCSEC01 EQU   ATCSOPD                                                  01339000
ATCPOIA  EQU   ISTATCVT+788                                             01340000
ATCPODVT EQU   ISTATCVT+784                                             01341000
ATCS49XL EQU   ISTATCVT+780                                             01342000
ATCS49XI EQU   ISTATCVT+776                                             01343000
ATCLCLCT EQU   ATCVLCNT+2                                               01344000
ATCRNCNT EQU   ATCVLCNT                                                 01345000
ATCCFEAD EQU   ISTATCVT+768                                             01346000
ATCPTR00 EQU   ISTATCVT+736                                             01347000
ATCRSV10 EQU   ISTATCVT+704                                             01348000
ATCTACB  EQU   ISTATCVT+700                                             01349000
ATCVTINM EQU   ISTATCVT+696                                             01350000
ATCTCLIM EQU   ISTATCVT+692                                             01351000
ATCTCLOM EQU   ISTATCVT+688                                             01352000
ATCVTIPB EQU   ISTATCVT+656                                             01353000
ATCTCIPB EQU   ISTATCVT+624                                             01354000
ATCTIPAB EQU   ISTATCVT+592                                             01355000
ATCOCCCB EQU   ISTATCVT+588                                             01356000
ATCOCCOB EQU   ISTATCVT+584                                             01357000
ATCCDLAD EQU   ISTATCVT+580                                             01358000
ATCCCLAD EQU   ISTATCVT+576                                             01359000
ATCDLRPB EQU   ISTATCVT+544                                             01360000
ATCPGPAB EQU   ISTATCVT+512                                             01361000
ATCVPAB1 EQU   ISTATCVT+480                                             01362000
ATCRSV97 EQU   ISTATCVT+476                                             01363000
ATCRDTLK EQU   ISTATCVT+472                                             01364000
ATCVOCLK EQU   ISTATCVT+468                                             01365000
ATCCDFDN EQU   ISTATCVT+464                                             01366000
ATCCDFIN EQU   ISTATCVT+460                                             01367000
ATCDVTLK EQU   ISTATCVT+456                                             01368000
ATCAP36  EQU   ISTATCVT+452                                             01369000
ATCAP35  EQU   ISTATCVT+448                                             01370000
ATCAP33  EQU   ISTATCVT+444                                             01371000
ATCRSV99 EQU   ISTATCVT+412                                             01372000
ATCLDECB EQU   ISTATCVT+408                                             01373000
ATCLDNCS EQU   ISTATCVT+404                                             01374000
ATCCDPTR EQU   ISTATCVT+400                                             01375000
ATCADEL  EQU   ISTATCVT+396                                             01376000
ATCTODVT EQU   ISTATCVT+392                                             01377000
ATCDEBCH EQU   ISTATCVT+388                                             01378000
ATCHBSIZ EQU   ATCHPGM+2                                                01379000
ATCHBFNO EQU   ATCHPGM                                                  01380000
ATCCRME  EQU   ISTATCVT+380                                             01381000
ATCRVCHS EQU   ISTATCVT+372                                             01382000
ATCECTLP EQU   ISTATCVT+368                                             01383000
ATCZDVTB EQU   ISTATCVT+364                                             01384000
ATCECPRT EQU   ISTATCVT+360                                             01385000
ATCVTLOD EQU   ISTATCVT+356                                             01386000
ATCTRPAB EQU   ISTATCVT+352                                             01387000
ATCMSGM  EQU   ISTATCVT+348                                             01388000
ATCMSGP  EQU   ISTATCVT+344                                             01389000
ATCEPT   EQU   ISTATCVT+340                                             01390000
ATCDVT   EQU   ISTATCVT+336                                             01391000
ATCTRCPT EQU   ISTATCVT+332                                             01392000
ATCDVLOD EQU   ISTATCVT+328                                             01393000
ATCALERT EQU   ISTATCVT+324                                             01394000
ATCEPA   EQU   ISTATCVT+320                                             01395000
ATCSAF   EQU   ISTATCVT+318                                             01396000
ATCXRANG EQU   ISTATCVT+317                                             01397000
ATCLAST  EQU   ATCSHRFG                                                 01398000
ATCSHRTN EQU   ISTATCVT+308                                             01399000
ATCUEP   EQU   ISTATCVT+304                                             01400000
ATCOCRT  EQU   ISTATCVT+300                                             01401000
ATCCSMA  EQU   ATCCSMR                                                  01402000
ATCESC02 EQU   ISTATCVT+292                                             01403000
ATCESC01 EQU   ISTATCVT+288                                             01404000
ATCCDFND EQU   ISTATCVT+284                                             01405000
ATCCDDEL EQU   ISTATCVT+280                                             01406000
ATCCDADD EQU   ISTATCVT+276                                             01407000
ATCMNT   EQU   ISTATCVT+272                                             01408000
ATCRSV16 EQU   ISTATCVT+270                                             01409000
ATCMAXID EQU   ISTATCVT+269                                             01410000
ATCMSGSP EQU   ATCCOM+268                                               01411000
ATCCIDM  EQU   ATCCOM+266                                               01412000
ATCACTRM EQU   ATCCOM+264                                               01413000
ATCNERAP EQU   ATCCOM+260                                               01414000
ATCNESAL EQU   ATCCOM+256                                               01415000
ATCRCC65 EQU   ATCCOM+252                                               01416000
ATCRCC26 EQU   ATCCOM+248                                               01417000
ATCRCC63 EQU   ATCCOM+244                                               01418000
ATCRSV11 EQU   ATCCOM+242                                               01419000
ATCVTMID EQU   ATCCOM+240                                               01420000
ATCAPOST EQU   ATCCOM+236                                               01421000
ATCNERFN EQU   ATCCOM+232                                               01422000
ATCNERNE EQU   ATCCOM+228                                               01423000
ATCNERCV EQU   ATCCOM+224                                               01424000
ATCNERST EQU   ATCCOM+220                                               01425000
ATCDCC61 EQU   ATCCOM+216                                               01426000
ATCDCC60 EQU   ATCCOM+212                                               01427000
ATCSRTDF EQU   ATCCOM+208                                               01428000
ATCSRTAD EQU   ATCCOM+204                                               01429000
ATCFIRA  EQU   ATCCOM+200                                               01430000
ATCSMBQ  EQU   ATCCOM+196                                               01431000
ATCSMRC  EQU   ATCCOM+192                                               01432000
ATCSMRS  EQU   ATCCOM+188                                               01433000
ATCSMQU  EQU   ATCCOM+184                                               01434000
ATCSMRQ  EQU   ATCCOM+180                                               01435000
ATCACDA  EQU   ATCCOM+176                                               01436000
ATCSTMA  EQU   ATCCOM+172                                               01437000
ATCFRSTR EQU   ATCCOM+168                                               01438000
ATCREADA EQU   ATCCOM+160                                               01439000
ATCALOAD EQU   ATCCOM+156                                               01440000
ATCBLDLA EQU   ATCCOM+152                                               01441000
ATCFBRPH EQU   ATCCOM+148                                               01442000
ATCBFTRC EQU   ATCCOM+144                                               01443000
ATCTPBUF EQU   ATCTHTRC                                                 01444000
ATCREMOV EQU   ATCCOM+136                                               01445000
ATCADD   EQU   ATCCOM+132                                               01446000
ATCBPDA  EQU   ATCCOM+128                                               01447000
ATCDVTPT EQU   ATCCOM+124                                               01448000
ATCFEPT  EQU   ATCCOM+120                                               01449000
ATCFDVT  EQU   ATCCOM+116                                               01450000
ATCCONFT EQU   ATCCOM+112                                               01451000
ATCPTCHA EQU   ATCCOM+108                                               01452000
ATCAUTHA EQU   ATCCOM+104                                               01453000
ATCACCTA EQU   ATCCOM+100                                               01454000
ATCRDTH  EQU   ATCCOM+96                                                01455000
ATCFRSCH EQU   ATCCOM+92                                                01456000
ATCFSB   EQU   ATCCOM+88                                                01457000
ATCHLTMS EQU   ATCCOM+84                                                01458000
ATCECPRM EQU   ATCCOM+80                                                01459000
ATCECNET EQU   ATCCOM+76                                                01460000
ATCECOPC EQU   ATCCOM+72                                                01461000
ATCVPARM EQU   ATCCOM+68                                                01462000
ATCECVRQ EQU   ATCCOM+64                                                01463000
ATCECSES EQU   ATCCOM+60                                                01464000
ATCOCHA  EQU   ATCCOM+56                                                01465000
ATCDSPLQ EQU   ATCCOM+52                                                01466000
ATCECDSP EQU   ATCCOM+48                                                01467000
ATCVARYQ EQU   ATCCOM+44                                                01468000
ATCECVRY EQU   ATCCOM+40                                                01469000
ATCHALTQ EQU   ATCCOM+36                                                01470000
ATCECHLT EQU   ATCCOM+32                                                01471000
ATCMODQ  EQU   ATCCOM+28                                                01472000
ATCECMOD EQU   ATCCOM+24                                                01473000
ATCASCHD EQU   ATCCOM+20                                                01474000
ATCRDT   EQU   ATCCOM+12                                                01475000
ATCDCFRR EQU   ATCCOM+8                                                 01476000
ATCAPI   EQU   ATCCOM+4                                                 01477000
ATCRSV04 EQU   ATCSTAT4                                                 01478000
ATCNCSD  EQU   ATCSTAT4                                                 01479000
ATCMTST  EQU   ATCSTAT4                                                 01480000
ATCTPRT  EQU   ATCSTAT4                                                 01481000
ATCPRTAT EQU   ATCSTAT4                                                 01482000
@NM00010 EQU   ATCPOFLG                                                 01483000
ATCPOUNS EQU   ATCPOFLG                                                 01484000
ATCHSDMF EQU   ATCSTFLG                                                 01485000
@NM00009 EQU   ATCSTAT1                                                 01486000
ATCINHLT EQU   ATCSTAT1                                                 01487000
ATCNETSL EQU   ATCSTAT1                                                 01488000
ATCQKHLT EQU   ATCSTAT1                                                 01489000
ATCSNHLT EQU   ATCSTAT1                                                 01490000
ATCACTIV EQU   ATCSTAT1                                                 01491000
ATCSTART EQU   ATCSTAT1                                                 01492000
LOKXCL   EQU   @NM00007                                                 01493000
LOKPRY   EQU   @NM00007                                                 01494000
@NM00008 EQU   @NM00007                                                 01495000
@NM00006 EQU   LOKCHNG                                                  01496000
LOKCT    EQU   ISTLOK                                                   01497000
RPHNEXPO EQU   ISTRPH+104                                               01498000
RPHSAV16 EQU   RPHWORK+60                                               01499000
RPHSAV15 EQU   RPHWORK+56                                               01500000
RPHSAV14 EQU   RPHWORK+52                                               01501000
RPHSAV13 EQU   RPHWORK+48                                               01502000
RPHSAV12 EQU   RPHWORK+44                                               01503000
RPHSAV11 EQU   RPHWORK+40                                               01504000
RPHSAV10 EQU   RPHWORK+36                                               01505000
RPHSAVE9 EQU   RPHWORK+32                                               01506000
RPHSAVE8 EQU   RPHWORK+28                                               01507000
RPHSAVE7 EQU   RPHWORK+24                                               01508000
RPHSAVE6 EQU   RPHWORK+20                                               01509000
RPHSAVE5 EQU   RPHWORK+16                                               01510000
RPHSAVE4 EQU   RPHWORK+12                                               01511000
RPHSAVE3 EQU   RPHWORK+8                                                01512000
RPHSAVE2 EQU   RPHWORK+4                                                01513000
RPHSHALF EQU   RPHSAVE1+2                                               01514000
RPHSBIT8 EQU   RPHSBITS                                                 01515000
RPHSBIT7 EQU   RPHSBITS                                                 01516000
RPHSBIT6 EQU   RPHSBITS                                                 01517000
RPHSBIT5 EQU   RPHSBITS                                                 01518000
RPHSBIT4 EQU   RPHSBITS                                                 01519000
RPHSBIT3 EQU   RPHSBITS                                                 01520000
RPHSBIT2 EQU   RPHSBITS                                                 01521000
RPHSBIT1 EQU   RPHSBITS                                                 01522000
RPHSBYTE EQU   RPHSAVE1                                                 01523000
RPHPABQP EQU   RPHPABQA+1                                               01524000
RPHPABFG EQU   RPHPABQA                                                 01525000
RPHCRR   EQU   ISTRPH+32                                                01526000
RPHSRP34 EQU   RPHSRPRM+2                                               01527000
RPHSRP12 EQU   RPHSRPRM                                                 01528000
RPHWEGT  EQU   RPHCSPA                                                  01529000
RPHMAJCB EQU   ISTRPH+21                                                01530000
RPHPABOF EQU   ISTRPH+20                                                01531000
RPHRESUM EQU   RPHRESMA+1                                               01532000
RPHRSV01 EQU   RPHWPFLG                                                 01533000
RPHPURGE EQU   RPHWPFLG                                                 01534000
RPHPT    EQU   RPHWPFLG                                                 01535000
RPHWT    EQU   RPHWPFLG                                                 01536000
RPHRSKEY EQU   RPHWPFLG                                                 01537000
RPHDVTA  EQU   ISTRPH+12                                                01538000
RPHTIK   EQU   RPHTSKID+3                                               01539000
@NM00005 EQU   RPHTSKID                                                 01540000
RPHRPHAP EQU   RPHRPHA+1                                                01541000
@NM00004 EQU   RPHRPHA                                                  01542000
RPHGATE  EQU   RPHRPHA                                                  01543000
@NM00003 EQU   RPHFLGB                                                  01544000
RPHRLCRA EQU   RPHFLGB                                                  01545000
RPHNRSAV EQU   RPHFLGB                                                  01546000
RPHPGCMP EQU   RPHFLGB                                                  01547000
RPHFBAPS EQU   RPHFLGB                                                  01548000
RPHBSSP  EQU   RPHFLGB                                                  01549000
RPHLOCK  EQU   RPHFLGB                                                  01550000
RPHFNFLG EQU   RPHFSTLC                                                 01551000
RPHMLTCP EQU   RPHFLAGS                                                 01552000
RPHSMCLR EQU   RPHFLAGS                                                 01553000
RPHSMTYP EQU   RPHFLAGS                                                 01554000
RPHSMQ   EQU   RPHFLAGS                                                 01555000
RPHAUTEX EQU   RPHAPTYP                                                 01556000
RPHSPGIN EQU   RPHFLAGS                                                 01557000
RPHOGIND EQU   RPHFLAGS                                                 01558000
RPHLNGTH EQU   ISTRPH+1                                                 01559000
RPHTYPE  EQU   ISTRPH                                                   01560000
DYPPAB   EQU   ISTDYPAB+16                                              01561000
DYPRSV01 EQU   ISTDYPAB+12                                              01562000
DYPTSKID EQU   ISTDYPAB+8                                               01563000
DYPCHAIN EQU   ISTDYPAB+4                                               01564000
DYPFLGS  EQU   ISTDYPAB+2                                               01565000
DYPLNGTH EQU   ISTDYPAB+1                                               01566000
DYPTYPE  EQU   ISTDYPAB                                                 01567000
PABRPHA  EQU   PABRPHFG+1                                               01568000
PABNODQ  EQU   PABFLAGS                                                 01569000
PABINHBT EQU   PABFLAGS                                                 01570000
PABERLOK EQU   PABERRLK                                                 01571000
PABSSN   EQU   PABFLAGS                                                 01572000
PABDYNAM EQU   PABFLAGS                                                 01573000
PABNORPR EQU   PABFLAGS                                                 01574000
PABPRIOR EQU   PABFLAGS                                                 01575000
PABAPYP  EQU   PABFLAGS                                                 01576000
PABDVTA  EQU   ISTPAB+9                                                 01577000
PABOFFST EQU   ISTPAB+8                                                 01578000
PABCHNGP EQU   PABCHAIN+1                                               01579000
PABRSV02 EQU   PABCHAIN                                                 01580000
PABRUNNG EQU   PABCHAIN                                                 01581000
PABRESET EQU   PABCHAIN                                                 01582000
PABUNCON EQU   PABCHAIN                                                 01583000
PABCDP   EQU   PABCHAIN                                                 01584000
PABRESCH EQU   PABCHAIN                                                 01585000
PABCHNG  EQU   PABCHAIN                                                 01586000
PABWEQP  EQU   PABWEQA+1                                                01587000
PABRSV01 EQU   PABWEQA                                                  01588000
PABWEQG  EQU   PABWEQA                                                  01589000
CVTLEVL  EQU   CVTRELNO+2                                               01590000
CVTNUMB  EQU   CVTRELNO                                                 01591000
CVTMDL   EQU   CVTFIX+250                                               01592000
@NM00002 EQU   CVTFIX+248                                               01593000
@NM00001 EQU   CVTFIX                                                   01594000
CVTRV482 EQU   CVTXTNT2+128                                             01595000
CVTRV481 EQU   CVTXTNT2+124                                             01596000
CVTRV480 EQU   CVTXTNT2+120                                             01597000
CVTRV479 EQU   CVTXTNT2+118                                             01598000
CVTRV478 EQU   CVTXTNT2+117                                             01599000
CVTRV477 EQU   CVTXTNT2+116                                             01600000
CVTRV476 EQU   CVTXTNT2+115                                             01601000
CVTRV475 EQU   CVTXTNT2+114                                             01602000
CVTRV474 EQU   CVTRV466                                                 01603000
CVTRV473 EQU   CVTRV466                                                 01604000
CVTRV472 EQU   CVTRV466                                                 01605000
CVTRV471 EQU   CVTRV466                                                 01606000
CVTRV470 EQU   CVTRV466                                                 01607000
CVTRV469 EQU   CVTRV466                                                 01608000
CVTRV468 EQU   CVTRV466                                                 01609000
CVTRV467 EQU   CVTRV466                                                 01610000
CVTRV465 EQU   CVTRV457                                                 01611000
CVTRV464 EQU   CVTRV457                                                 01612000
CVTRV463 EQU   CVTRV457                                                 01613000
CVTRV462 EQU   CVTRV457                                                 01614000
CVTRV461 EQU   CVTRV457                                                 01615000
CVTRV460 EQU   CVTRV457                                                 01616000
CVTRV459 EQU   CVTRV457                                                 01617000
CVTRV458 EQU   CVTRV457                                                 01618000
CVTRV456 EQU   CVTXTNT2+108                                             01619000
CVTRV455 EQU   CVTXTNT2+104                                             01620000
CVTRV454 EQU   CVTXTNT2+100                                             01621000
CVTRV453 EQU   CVTXTNT2+96                                              01622000
CVTRV452 EQU   CVTXTNT2+94                                              01623000
CVTRV451 EQU   CVTXTNT2+92                                              01624000
CVTRV450 EQU   CVTXTNT2+90                                              01625000
CVTRV449 EQU   CVTXTNT2+88                                              01626000
CVTRV448 EQU   CVTXTNT2+87                                              01627000
CVTRV447 EQU   CVTXTNT2+86                                              01628000
CVTRV446 EQU   CVTRV438                                                 01629000
CVTRV445 EQU   CVTRV438                                                 01630000
CVTRV444 EQU   CVTRV438                                                 01631000
CVTRV443 EQU   CVTRV438                                                 01632000
CVTRV442 EQU   CVTRV438                                                 01633000
CVTRV441 EQU   CVTRV438                                                 01634000
CVTRV440 EQU   CVTRV438                                                 01635000
CVTRV439 EQU   CVTRV438                                                 01636000
CVTRV437 EQU   CVTRV429                                                 01637000
CVTRV436 EQU   CVTRV429                                                 01638000
CVTRV435 EQU   CVTRV429                                                 01639000
CVTRV434 EQU   CVTRV429                                                 01640000
CVTRV433 EQU   CVTRV429                                                 01641000
CVTRV432 EQU   CVTRV429                                                 01642000
CVTRV431 EQU   CVTRV429                                                 01643000
CVTRV430 EQU   CVTRV429                                                 01644000
CVTRV428 EQU   CVTXTNT2+80                                              01645000
CVTRV427 EQU   CVTXTNT2+76                                              01646000
CVTRV426 EQU   CVTXTNT2+72                                              01647000
CVTRV425 EQU   CVTXTNT2+68                                              01648000
CVTATACT EQU   CVTATCVT                                                 01649000
CVTRV423 EQU   CVTXTNT2+62                                              01650000
CVTRV422 EQU   CVTXTNT2+60                                              01651000
CVTRV421 EQU   CVTXTNT2+58                                              01652000
CVTRV420 EQU   CVTXTNT2+56                                              01653000
CVTRV419 EQU   CVTXTNT2+55                                              01654000
CVTRV418 EQU   CVTXTNT2+54                                              01655000
CVTRV417 EQU   CVTRV409                                                 01656000
CVTRV416 EQU   CVTRV409                                                 01657000
CVTRV415 EQU   CVTRV409                                                 01658000
CVTRV414 EQU   CVTRV409                                                 01659000
CVTRV413 EQU   CVTRV409                                                 01660000
CVTRV412 EQU   CVTRV409                                                 01661000
CVTRV411 EQU   CVTRV409                                                 01662000
CVTRV410 EQU   CVTRV409                                                 01663000
CVTRV408 EQU   CVTRV400                                                 01664000
CVTRV407 EQU   CVTRV400                                                 01665000
CVTRV406 EQU   CVTRV400                                                 01666000
CVTRV405 EQU   CVTRV400                                                 01667000
CVTRV404 EQU   CVTRV400                                                 01668000
CVTRV403 EQU   CVTRV400                                                 01669000
CVTRV402 EQU   CVTRV400                                                 01670000
CVTRV401 EQU   CVTRV400                                                 01671000
CVTICB   EQU   CVTXTNT2+48                                              01672000
CVTSKTA  EQU   CVTXTNT2+44                                              01673000
CVTSHSB  EQU   CVTSHS                                                   01674000
CVTRSV98 EQU   CVTXTNT2+36                                              01675000
CVTRSV97 EQU   CVTXTNT2+34                                              01676000
CVTRSV96 EQU   CVTXTNT2+32                                              01677000
CVTOLTEP EQU   CVTXTNT2+28                                              01678000
CVTQIDA  EQU   CVTQID+1                                                 01679000
CVTRSV95 EQU   CVTQID                                                   01680000
CVTRSV94 EQU   CVTXTNT2+20                                              01681000
CVTRSV93 EQU   CVTXTNT2+16                                              01682000
CVTRSV92 EQU   CVTXTNT2+12                                              01683000
CVTDEBVR EQU   CVTXTNT2+8                                               01684000
CVTRSV91 EQU   CVTXTNT2+6                                               01685000
CVTRSV9H EQU   CVTFLGBT                                                 01686000
CVTRSV9G EQU   CVTFLGBT                                                 01687000
CVTRSV9F EQU   CVTFLGBT                                                 01688000
CVTRSV9E EQU   CVTFLGBT                                                 01689000
CVTRSV9D EQU   CVTFLGBT                                                 01690000
CVTRSV9C EQU   CVTFLGBT                                                 01691000
CVTVME   EQU   CVTFLGBT                                                 01692000
CVTNPE   EQU   CVTFLGBT                                                 01693000
CVTNUCLS EQU   CVTXTNT2+4                                               01694000
CVTDSSVA EQU   CVTDSSV+1                                                01695000
CVTRSV89 EQU   CVTDSSV                                                  01696000
CVTRSV88 EQU   CVTXTNT1+8                                               01697000
CVTRSV87 EQU   CVTXTNT1+4                                               01698000
CVTFACHN EQU   CVTXTNT1                                                 01699000
CVTRV488 EQU   CVTMAP+412                                               01700000
CVTRV487 EQU   CVTMAP+408                                               01701000
CVTRV486 EQU   CVTMAP+404                                               01702000
CVTRV485 EQU   CVTMAP+400                                               01703000
CVTACTAP EQU   CVTMAP+396                                               01704000
CVTAUTH  EQU   CVTMAP+392                                               01705000
CVTATMCA EQU   CVTATMCT+1                                               01706000
CVTATMST EQU   CVTATMCT                                                 01707000
CVTRSV61 EQU   CVTMAP+384                                               01708000
CVTVOLT1 EQU   CVTVOLM1+1                                               01709000
CVTVOLI1 EQU   CVTVOLF1                                                 01710000
CVTSTOA  EQU   CVTMAP+376                                               01711000
CVTRSV58 EQU   CVTMAP+374                                               01712000
CVTRSV57 EQU   CVTMAP+372                                               01713000
CVTDDCE  EQU   CVTMAP+368                                               01714000
CVTPNWFR EQU   CVTMAP+364                                               01715000
CVTSMF   EQU   CVTMAP+360                                               01716000
CVTSULK  EQU   CVTMAP+358                                               01717000
CVTSLKO  EQU   CVTSYSK                                                  01718000
CVTSLKP  EQU   CVTSYSK                                                  01719000
CVTSLKQ  EQU   CVTSYSK                                                  01720000
CVTSLKR  EQU   CVTSYSK                                                  01721000
CVTRSV56 EQU   CVTSYSK                                                  01722000
CVTRSV55 EQU   CVTSYSK                                                  01723000
CVTRSV54 EQU   CVTSYSK                                                  01724000
CVTRSV53 EQU   CVTSYSK                                                  01725000
CVTRSV52 EQU   CVTA1F1                                                  01726000
CVTRSV51 EQU   CVTA1F1                                                  01727000
CVTRSV50 EQU   CVTA1F1                                                  01728000
CVTRSV49 EQU   CVTA1F1                                                  01729000
CVTRSV48 EQU   CVTA1F1                                                  01730000
CVTRSV47 EQU   CVTA1F1                                                  01731000
CVTSRSW  EQU   CVTA1F1                                                  01732000
CVTPFSW  EQU   CVTA1F1                                                  01733000
CVTPCVT  EQU   CVTMAP+352                                               01734000
CVTRSV46 EQU   CVTMAP+344                                               01735000
CVTRSV45 EQU   CVTMAP+340                                               01736000
CVTRSV44 EQU   CVTMAP+338                                               01737000
CVTRSV43 EQU   CVTMAP+336                                               01738000
CVTHJESA EQU   CVTHJES+1                                                01739000
CVTRSV42 EQU   CVTHJES                                                  01740000
CVTEXT2A EQU   CVTEXT2+1                                                01741000
CVTRSV41 EQU   CVTEXT2                                                  01742000
CVTAPFA  EQU   CVTAPF+1                                                 01743000
CVTRSV40 EQU   CVTAPF                                                   01744000
CVTRV518 EQU   CVTINTLA                                                 01745000
CVTRV517 EQU   CVTERPV                                                  01746000
CVTEORM  EQU   CVTMAP+312                                               01747000
CVTMCHPR EQU   CVTMAP+308                                               01748000
CVTTZ    EQU   CVTMAP+304                                               01749000
CVTJEPS  EQU   CVTMAP+300                                               01750000
CVTJESCT EQU   CVTMAP+296                                               01751000
CVTMODE  EQU   CVTMAP+292                                               01752000
CVTPTRV  EQU   CVTMAP+288                                               01753000
CVTREAL  EQU   CVTMAP+284                                               01754000
CVTRSV39 EQU   CVTMAP+280                                               01755000
CVTRSV38 EQU   CVTMAP+276                                               01756000
CVTDMSRA EQU   CVTDMSR+1                                                01757000
CVTRSV37 EQU   CVTDMSR                                                  01758000
CVTQMSGA EQU   CVTQMSG+1                                                01759000
CVTRSV36 EQU   CVTQMSG                                                  01760000
CVTAMFF  EQU   CVTMAP+264                                               01761000
CVTPURGA EQU   CVTPURG+1                                                01762000
CVTRSV35 EQU   CVTPURG                                                  01763000
CVTCBSP  EQU   CVTMAP+256                                               01764000
CVTATERA EQU   CVTATER+1                                                01765000
CVTSYST  EQU   CVTATER                                                  01766000
CVTVOLT2 EQU   CVTTAT                                                   01767000
CVTVOLI2 EQU   CVTVOLF2                                                 01768000
CVTAQAVB EQU   CVTAQAVT+1                                               01769000
CVTRSV34 EQU   CVTTCMFG                                                 01770000
CVTRSV33 EQU   CVTTCMFG                                                 01771000
CVTRSV32 EQU   CVTTCMFG                                                 01772000
CVTRSV31 EQU   CVTTCMFG                                                 01773000
CVTRSV30 EQU   CVTTCMFG                                                 01774000
CVTRSV29 EQU   CVTTCMFG                                                 01775000
CVTRSV28 EQU   CVTTCMFG                                                 01776000
CVTTCRDY EQU   CVTTCMFG                                                 01777000
CVTGTFA  EQU   CVTGTF+1                                                 01778000
CVTRSV27 EQU   CVTGTFST                                                 01779000
CVTRNIO  EQU   CVTGTFST                                                 01780000
CVTUSR   EQU   CVTGTFST                                                 01781000
CVTRV318 EQU   CVTFORM                                                  01782000
CVTRV317 EQU   CVTTMODE                                                 01783000
CVTRV316 EQU   CVTSTATE                                                 01784000
CVTRV315 EQU   CVTGTFS                                                  01785000
CVTGTFAV EQU   CVTGTFS                                                  01786000
CVT0SCR1 EQU   CVTMAP+232                                               01787000
CVTRV515 EQU   CVTMAP+228                                               01788000
CVTRMS   EQU   CVTMAP+224                                               01789000
CVTPATCH EQU   CVTMAP+220                                               01790000
CVTTSCE  EQU   CVTMAP+216                                               01791000
CVTLNKSC EQU   CVTMAP+214                                               01792000
CVTQABST EQU   CVTMAP+212                                               01793000
CVTMDLDS EQU   CVTMAP+208                                               01794000
CVTUSER  EQU   CVTMAP+204                                               01795000
CVTABEND EQU   CVTMAP+200                                               01796000
CVTSMCA  EQU   CVTMAP+196                                               01797000
CVTRSV18 EQU   CVTMAP+192                                               01798000
CVTQLPAQ EQU   CVTMAP+188                                               01799000
CVTQCDSR EQU   CVTMAP+184                                               01800000
CVTRSV17 EQU   CVTOPTB                                                  01801000
CVTRSV16 EQU   CVTOPTB                                                  01802000
CVTFP    EQU   CVTOPTB                                                  01803000
CVTAPTHR EQU   CVTOPTB                                                  01804000
CVTNLOG  EQU   CVTOPTB                                                  01805000
CVTTOD   EQU   CVTOPTB                                                  01806000
CVTCTIMS EQU   CVTOPTB                                                  01807000
CVTPROT  EQU   CVTOPTB                                                  01808000
CVTXPFP  EQU   CVTOPTA                                                  01809000
CVTASCII EQU   CVTOPTA                                                  01810000
CVTRSV13 EQU   CVTOPTA                                                  01811000
CVTRSV12 EQU   CVTOPTA                                                  01812000
CVTNIP   EQU   CVTOPTA                                                  01813000
CVTDDR   EQU   CVTOPTA                                                  01814000
CVTAPR   EQU   CVTOPTA                                                  01815000
CVTCCH   EQU   CVTOPTA                                                  01816000
CVTSNCTR EQU   CVTMAP+180                                               01817000
CVTQMWR  EQU   CVTMAP+176                                               01818000
CVTQOCR  EQU   CVTMAP+172                                               01819000
CVT1EF00 EQU   CVTMAP+168                                               01820000
CVTMZ00  EQU   CVTMAP+164                                               01821000
CVTHEAD  EQU   CVTMAP+160                                               01822000
CVTRSV11 EQU   CVTMAP+156                                               01823000
CVT0PT01 EQU   CVTMAP+152                                               01824000
CVTMSER  EQU   CVTMAP+148                                               01825000
CVTRV516 EQU   CVTIERLC                                                 01826000
CVTILCH  EQU   CVTMAP+140                                               01827000
CVT0DS   EQU   CVTMAP+136                                               01828000
CVTFBOSV EQU   CVTMAP+132                                               01829000
CVTNUCB  EQU   CVTMAP+128                                               01830000
CVTIXAVL EQU   CVTMAP+124                                               01831000
CVTIOQET EQU   CVTMAP+120                                               01832000
CVTDCBA  EQU   CVTMAP+117                                               01833000
CVTMVS2  EQU   CVTDCB                                                   01834000
CVT6DAT  EQU   CVTDCB                                                   01835000
CVT4MPS  EQU   CVTDCB                                                   01836000
CVTRSV09 EQU   CVTDCB                                                   01837000
CVT4MS1  EQU   CVTDCB                                                   01838000
CVT2SPS  EQU   CVTDCB                                                   01839000
CVT1SSS  EQU   CVTDCB                                                   01840000
CVTRSV08 EQU   CVTDCB                                                   01841000
CVTSTB   EQU   CVTMAP+112                                               01842000
CVTQTD00 EQU   CVTMAP+108                                               01843000
CVTQTE00 EQU   CVTMAP+104                                               01844000
CVTCUCB  EQU   CVTMAP+100                                               01845000
CVTSJQ   EQU   CVTMAP+96                                                01846000
CVTPBLDL EQU   CVTMAP+92                                                01847000
CVTTPC   EQU   CVTMAP+88                                                01848000
CVTSVDCB EQU   CVTMAP+84                                                01849000
CVTBRET  EQU   CVTMAP+82                                                01850000
CVTEXIT  EQU   CVTMAP+80                                                01851000
CVT0FN00 EQU   CVTMAP+76                                                01852000
CVTDARA  EQU   CVTDAR+1                                                 01853000
CVTRSV07 EQU   CVTFLGS1                                                 01854000
CVTRSV06 EQU   CVTFLGS1                                                 01855000
CVTRSV05 EQU   CVTFLGS1                                                 01856000
CVTRSV04 EQU   CVTFLGS1                                                 01857000
CVTRSV03 EQU   CVTFLGS1                                                 01858000
CVTRSV02 EQU   CVTFLGS1                                                 01859000
CVTRSV01 EQU   CVTFLGS1                                                 01860000
CVTDMPLK EQU   CVTFLGS1                                                 01861000
CVTXITP  EQU   CVTMAP+68                                                01862000
CVTZDTAB EQU   CVTMAP+64                                                01863000
CVTMSLT  EQU   CVTMAP+60                                                01864000
CVTDATE  EQU   CVTMAP+56                                                01865000
CVTBTERM EQU   CVTMAP+52                                                01866000
CVTSYSAD EQU   CVTMAP+48                                                01867000
CVTXTLER EQU   CVTMAP+44                                                01868000
CVTILK2  EQU   CVTMAP+40                                                01869000
CVTILK1  EQU   CVTMAP+36                                                01870000
CVTPRLTV EQU   CVTMAP+32                                                01871000
CVTPCNVT EQU   CVTMAP+28                                                01872000
CVT0VL00 EQU   CVTMAP+24                                                01873000
CVTXAPG  EQU   CVTMAP+20                                                01874000
CVTBUF   EQU   CVTMAP+16                                                01875000
CVTJOB   EQU   CVTMAP+12                                                01876000
CVTLINK  EQU   CVTMAP+8                                                 01877000
CVT0EF00 EQU   CVTMAP+4                                                 01878000
CVTTCBP  EQU   CVTMAP                                                   01879000
CVT      EQU   CVTMAP                                                   01880000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01881000
@RC00119 EQU   @RC00117                                                 01882000
@RC00224 EQU   @RC00222                                                 01883000
@RC00232 EQU   @RC00222                                                 01884000
@RC00277 EQU   @RC00222                                                 01885000
@ENDDATA EQU   *                                                        01886000
         END   ISTOCCDF,(C'PLS0632',0603,75130)                         01887000
