         TITLE 'ISTOCMDC-VALIDITY CHECK VTAM ACDEB                     *00001000
                        '                                               00002000
ISTOCMDC CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTOCMDC  75.126'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @12,0                                               0001 00012000
@PSTART  DS    0H                                                  0001 00013000
         USING @PSTART,@12                                         0001 00014000
   MODESET EXTKEY=VTAM,WORKREG=2                                        00015000
*                                                                  0041 00016000
*/* SET UP ADDRESSABILITY TO DCE CHAIN                               */ 00017000
*                                                                  0042 00018000
*   MPSTPTR=PSAAOLD->ASCBASXB->ASXBMPST;                           0042 00019000
         L     @14,PSAAOLD                                         0042 00020000
         L     @14,ASCBASXB(,@14)                                  0042 00021000
         L     MPSTPTR,ASXBMPST(,@14)                              0042 00022000
*   DCEPTR=MPSDBTBL;                                               0043 00023000
*                                                                  0043 00024000
         L     DCEPTR,MPSDBTBL(,MPSTPTR)                           0043 00025000
*/*  ADJUST PTR TO DEB FROM DCE TO MATCH PTR IN ACB                  */ 00026000
*                                                                  0044 00027000
*   DEBCOMP=ACBDEB-(LENGTH(ACDVTPRX)+LENGTH(ACDDBPFX));            0044 00028000
*                                                                  0044 00029000
         LR    @14,ACBCOPY                                         0044 00030000
         L     DEBCOMP,ACBDEB-1(,@14)                              0044 00031000
         LA    DEBCOMP,0(,DEBCOMP)                                 0044 00032000
         SL    DEBCOMP,@CF00094                                    0044 00033000
*/* SEARCH DCE CHAIN FOR DEB TO CHECKED                              */ 00034000
*                                                                  0045 00035000
*   DO WHILE DEBCOMP^=DCEDBPTR&DCECHN^=0;                          0045 00036000
         B     @DE00045                                            0045 00037000
@DL00045 DS    0H                                                  0046 00038000
*     DCEPTR=DCECHN;                                               0046 00039000
         L     DCEPTR,DCECHN(,DCEPTR)                              0046 00040000
*   END;                                                           0047 00041000
*                                                                  0047 00042000
@DE00045 C     DEBCOMP,DCEDBPTR(,DCEPTR)                           0047 00043000
         BE    @DC00045                                            0047 00044000
         L     @14,DCECHN(,DCEPTR)                                 0047 00045000
         LTR   @14,@14                                             0047 00046000
         BNZ   @DL00045                                            0047 00047000
@DC00045 DS    0H                                                  0048 00048000
*/* VALIDITY CHECK THE ACDEB AS FOLLOWS                              */ 00049000
*/*  1. SEARCH DCE CAHIN FOR DEB ADDR SAME AS ACBDEB VALUE           */ 00050000
*/*  2. COMPARE ACB ADDR IN ACDEB WITH USERACB(REG 1)                */ 00051000
*/*  3. COMPARE CURRENT TCB ADDR(PSATOLD) WITH TCB ADDR IN           */ 00052000
*/*    ACDEB                                                         */ 00053000
*/*  IF ANY CONDITION FAILS, SET RETURN CODE TO VALUE 4 TO           */ 00054000
*/*   INDICATE ERROR, OTHERWISE SET RETURN CODE TO ZERO              */ 00055000
*/*  TO INDICATE VALID DEB                                           */ 00056000
*                                                                  0048 00057000
*   GEN(LA  1,0(1));                                               0048 00058000
         LA  1,0(1)                                                     00059000
*   RETCODE=4;                                                     0049 00060000
         LA    RETCODE,4                                           0049 00061000
*   IF DEBCOMP=DCEDBPTR THEN                                       0050 00062000
         C     DEBCOMP,DCEDBPTR(,DCEPTR)                           0050 00063000
         BNE   @RF00050                                            0050 00064000
*     DO;                                                          0051 00065000
*       IF ACDACB=ACBUSER THEN                                     0052 00066000
         L     @14,ACDACB-1(,DEBCOMP)                              0052 00067000
         LA    @14,0(,@14)                                         0052 00068000
         CR    ACBUSER,@14                                         0052 00069000
         BNE   @RF00052                                            0052 00070000
*         DO;                                                      0053 00071000
*           IF ACDTCB=PSATOLD THEN                                 0054 00072000
         L     @14,ACDTCB-1(,DEBCOMP)                              0054 00073000
         LA    @14,0(,@14)                                         0054 00074000
         C     @14,PSATOLD                                         0054 00075000
         BNE   @RF00054                                            0054 00076000
*             DO;                                                  0055 00077000
*               RETCODE=0;                                         0056 00078000
         SLR   RETCODE,RETCODE                                     0056 00079000
*             END;                                                 0057 00080000
*         END;                                                     0058 00081000
@RF00054 DS    0H                                                  0059 00082000
*     END;                                                         0059 00083000
*                                                                  0059 00084000
@RF00052 DS    0H                                                  0060 00085000
*/*    MODESET BACK TO CALLERS KEY                                   */ 00086000
*                                                                  0060 00087000
*   GEN;                                                           0060 00088000
@RF00050 DS    0H                                                  0060 00089000
  MODESET EXTKEY=DATAMGT,WORKREG=2                                      00090000
*   RETURN;                                                        0061 00091000
*                                                                  0061 00092000
@EL00001 DS    0H                                                  0061 00093000
@EF00001 DS    0H                                                  0061 00094000
@ER00001 L     @14,12(,@13)                                        0061 00095000
         LM    @00,@12,20(@13)                                     0061 00096000
         BR    @14                                                 0061 00097000
*/* TPEPILOG                                                         */ 00098000
*                                                                  0062 00099000
*   GEN(PRINT OFF);                                                0062 00100000
         PRINT OFF                                                      00101000
*   GEN(PRINT ON);                                                 0063 00102000
*                                                                  0063 00103000
         PRINT ON                                                       00104000
*/* END OF TPEPILOG                                                  */ 00105000
*                                                                  0064 00106000
*   END ISTOCMDC                                                   0064 00107000
*                                                                  0064 00108000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00109000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00110000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00111000
*/*%INCLUDE SYSLIB  (IHAASXB )                                       */ 00112000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 00113000
*                                                                  0064 00114000
*       ;                                                          0064 00115000
         B     @EL00001                                            0064 00116000
@DATA    DS    0H                                                       00117000
@DATD    DSECT                                                          00118000
         DS    0F                                                       00119000
ISTOCMDC CSECT                                                          00120000
         DS    0F                                                       00121000
@CF00094 DC    F'24'                                                    00122000
@DATD    DSECT                                                          00123000
         DS    0D                                                       00124000
ASCBPTR  DS    A                                                        00125000
ASXBPTR  DS    A                                                        00126000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00127000
@ENDDATD EQU   *                                                        00128000
ISTOCMDC CSECT                                                          00129000
         DS    0F                                                       00130000
@SIZDATD DC    AL1(0)                                                   00131000
         DC    AL3(@ENDDATD-@DATD)                                      00132000
         DS    0D                                                       00133000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00134000
@01      EQU   01                                                       00135000
@02      EQU   02                                                       00136000
@03      EQU   03                                                       00137000
@04      EQU   04                                                       00138000
@05      EQU   05                                                       00139000
@06      EQU   06                                                       00140000
@07      EQU   07                                                       00141000
@08      EQU   08                                                       00142000
@09      EQU   09                                                       00143000
@10      EQU   10                                                       00144000
@11      EQU   11                                                       00145000
@12      EQU   12                                                       00146000
@13      EQU   13                                                       00147000
@14      EQU   14                                                       00148000
@15      EQU   15                                                       00149000
ACBCOPY  EQU   @00                                                      00150000
ACBUSER  EQU   @01                                                      00151000
RETCODE  EQU   @15                                                      00152000
DCEPTR   EQU   @04                                                      00153000
MPSTPTR  EQU   @05                                                      00154000
DEBCOMP  EQU   @03                                                      00155000
PSA      EQU   0                                                        00156000
FLCRNPSW EQU   PSA                                                      00157000
FLCROPSW EQU   PSA+8                                                    00158000
FLCICCW2 EQU   PSA+16                                                   00159000
PSAEEPSW EQU   PSA+132                                                  00160000
PSAESPSW EQU   PSA+136                                                  00161000
FLCSVILC EQU   PSAESPSW+1                                               00162000
PSAEPPSW EQU   PSA+140                                                  00163000
FLCPIILC EQU   PSAEPPSW+1                                               00164000
FLCPICOD EQU   PSAEPPSW+2                                               00165000
PSAPICOD EQU   FLCPICOD+1                                               00166000
FLCTEA   EQU   PSAEPPSW+4                                               00167000
FLCPER   EQU   PSA+152                                                  00168000
FLCMCLA  EQU   PSA+168                                                  00169000
FLCIOEL  EQU   FLCMCLA+4                                                00170000
FLCIOA   EQU   FLCMCLA+16                                               00171000
FLCFSA   EQU   FLCMCLA+80                                               00172000
PSATOLD  EQU   PSA+540                                                  00173000
PSAAOLD  EQU   PSA+548                                                  00174000
PSASUPER EQU   PSA+552                                                  00175000
PSASUP1  EQU   PSASUPER                                                 00176000
PSASUP2  EQU   PSASUPER+1                                               00177000
PSASUP3  EQU   PSASUPER+2                                               00178000
PSASUP4  EQU   PSASUPER+3                                               00179000
PSACLHT  EQU   PSA+640                                                  00180000
PSALKSA  EQU   PSA+696                                                  00181000
PSAHLHI  EQU   PSA+760                                                  00182000
PSADSSFL EQU   PSA+836                                                  00183000
PSADSSF1 EQU   PSADSSFL                                                 00184000
PSADSSF3 EQU   PSADSSFL+2                                               00185000
PSADSSF4 EQU   PSADSSFL+3                                               00186000
PSARSVT  EQU   PSA+896                                                  00187000
ASCB     EQU   0                                                        00188000
ASCBFW1  EQU   ASCB+100                                                 00189000
ASCBRCTF EQU   ASCBFW1+2                                                00190000
ASCBFLG1 EQU   ASCBFW1+3                                                00191000
ASCBASXB EQU   ASCB+108                                                 00192000
ASCBDSP1 EQU   ASCB+114                                                 00193000
ASCBFLG2 EQU   ASCB+115                                                 00194000
ASXB     EQU   0                                                        00195000
ASXBMPST EQU   ASXB+16                                                  00196000
ASXBSECR EQU   ASXB+132                                                 00197000
ASXBSFLG EQU   ASXBSECR                                                 00198000
ASXBAEQ  EQU   ASXB+168                                                 00199000
IFGACB   EQU   0                                                        00200000
ACBCOMN  EQU   IFGACB                                                   00201000
ACBLENG  EQU   ACBCOMN+2                                                00202000
ACBLENG2 EQU   ACBLENG                                                  00203000
ACBAMBL  EQU   ACBCOMN+4                                                00204000
ACBJWA   EQU   ACBAMBL                                                  00205000
ACBMACRF EQU   ACBCOMN+12                                               00206000
ACBMACR1 EQU   ACBMACRF                                                 00207000
ACBADR   EQU   ACBMACR1                                                 00208000
ACBCNV   EQU   ACBMACR1                                                 00209000
ACBMACR2 EQU   ACBMACRF+1                                               00210000
ACBBUFPL EQU   ACBCOMN+20                                               00211000
ACBMACR3 EQU   ACBBUFPL                                                 00212000
ACBRECFM EQU   ACBCOMN+24                                               00213000
ACBCCTYP EQU   ACBCOMN+25                                               00214000
ACBOPT   EQU   ACBCOMN+26                                               00215000
ACBDSORG EQU   ACBOPT                                                   00216000
ACBCROPS EQU   ACBDSORG                                                 00217000
ACBDVIND EQU   ACBDSORG                                                 00218000
ACBEXLST EQU   ACBCOMN+36                                               00219000
ACBDDNM  EQU   ACBCOMN+40                                               00220000
ACBAMETH EQU   ACBDDNM+3                                                00221000
ACBDEB   EQU   ACBDDNM+5                                                00222000
ACBOFLGS EQU   ACBCOMN+48                                               00223000
ACBEXFG  EQU   ACBOFLGS                                                 00224000
ACBIOSFG EQU   ACBOFLGS                                                 00225000
ACBINFLG EQU   ACBCOMN+50                                               00226000
ACBVVIC  EQU   ACBINFLG                                                 00227000
ACBUJFCB EQU   ACBCOMN+52                                               00228000
ACBBLKSZ EQU   ACBCOMN+60                                               00229000
ISTPAB   EQU   0                                                        00230000
PABWQCHN EQU   ISTPAB                                                   00231000
PABWEQA  EQU   PABWQCHN                                                 00232000
PABCHAIN EQU   PABWQCHN+4                                               00233000
PABRPHFG EQU   ISTPAB+12                                                00234000
PABFLAGS EQU   PABRPHFG                                                 00235000
PABERLCK EQU   PABFLAGS                                                 00236000
PABERRLK EQU   PABERLCK                                                 00237000
ISTDYPAB EQU   0                                                        00238000
ISTMPST  EQU   0                                                        00239000
MPSRQUE  EQU   ISTMPST+8                                                00240000
MPSFLGA  EQU   ISTMPST+12                                               00241000
MPSCRA   EQU   ISTMPST+24                                               00242000
MPSCRACT EQU   MPSCRA+4                                                 00243000
MPSSRB   EQU   ISTMPST+32                                               00244000
MPSSRBCT EQU   MPSSRB+4                                                 00245000
MPSCRPL  EQU   ISTMPST+40                                               00246000
MPSRPLCT EQU   MPSCRPL+4                                                00247000
MPSDBTBL EQU   ISTMPST+124                                              00248000
ISTDCE   EQU   0                                                        00249000
DCEDBPTR EQU   ISTDCE                                                   00250000
DCECHN   EQU   ISTDCE+4                                                 00251000
ISTLOK   EQU   0                                                        00252000
LOKCHN   EQU   ISTLOK+1                                                 00253000
LOKCHNG  EQU   LOKCHN                                                   00254000
@NM00038 EQU   LOKCHNG+2                                                00255000
ISTACDEB EQU   0                                                        00256000
ACDVTPRX EQU   ISTACDEB                                                 00257000
ACDDBPFX EQU   ISTACDEB+16                                              00258000
ACDTBLOF EQU   ACDDBPFX+6                                               00259000
ACDBASIC EQU   ISTACDEB+24                                              00260000
ACDTCBAD EQU   ACDBASIC                                                 00261000
ACDNMSUB EQU   ACDTCBAD                                                 00262000
ACDTCB   EQU   ACDTCBAD+1                                               00263000
ACDDEBAD EQU   ACDBASIC+4                                               00264000
ACDUSRPG EQU   ACDBASIC+16                                              00265000
ACDACBAD EQU   ACDBASIC+24                                              00266000
ACDACB   EQU   ACDACBAD+1                                               00267000
ACDAPPAD EQU   ACDBASIC+28                                              00268000
ACDVTAM  EQU   ISTACDEB+56                                              00269000
ACDSSFLG EQU   ACDVTAM+80                                               00270000
ACDAPDAT EQU   ACDVTAM+83                                               00271000
PSARSVTE EQU   PSARSVT                                                  00272000
FLC      EQU   PSA                                                      00273000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00274000
PSARSAV  EQU   PSARSVTE+60                                              00275000
PSARSTK  EQU   PSARSVTE+56                                              00276000
PSAESAV3 EQU   PSARSVTE+52                                              00277000
PSAESTK3 EQU   PSARSVTE+48                                              00278000
PSAESAV2 EQU   PSARSVTE+44                                              00279000
PSAESTK2 EQU   PSARSVTE+40                                              00280000
PSAESAV1 EQU   PSARSVTE+36                                              00281000
PSAESTK1 EQU   PSARSVTE+32                                              00282000
PSAPSAV  EQU   PSARSVTE+28                                              00283000
PSAPSTK  EQU   PSARSVTE+24                                              00284000
PSAMSAV  EQU   PSARSVTE+20                                              00285000
PSAMSTK  EQU   PSARSVTE+16                                              00286000
PSASSAV  EQU   PSARSVTE+12                                              00287000
PSASSTK  EQU   PSARSVTE+8                                               00288000
PSANSTK  EQU   PSARSVTE+4                                               00289000
PSACSTK  EQU   PSARSVTE                                                 00290000
ACDREFQ  EQU   ISTACDEB+204                                             00291000
ACDASFQ  EQU   ISTACDEB+200                                             00292000
ACDSOP   EQU   ISTACDEB+184                                             00293000
ACDSIP   EQU   ISTACDEB+168                                             00294000
ACDRSV24 EQU   ACDVTAM+108                                              00295000
ACDRSV23 EQU   ACDVTAM+104                                              00296000
ACDRSV22 EQU   ACDVTAM+100                                              00297000
ACDOCWAD EQU   ACDVTAM+96                                               00298000
ACDRSV10 EQU   ACDVTAM+92                                               00299000
ACDAPDDT EQU   ACDAPDAT+1                                               00300000
ACDAPDLN EQU   ACDAPDAT                                                 00301000
ACDRSV07 EQU   ACDVTAM+82                                               00302000
ACDRSV06 EQU   ACDVTAM+81                                               00303000
ACDRSV09 EQU   ACDSSFLG                                                 00304000
ACDAICLS EQU   ACDSSFLG                                                 00305000
ACDABEND EQU   ACDSSFLG                                                 00306000
ACDCACB  EQU   ACDSSFLG                                                 00307000
ACDRSV21 EQU   ACDVTAM+64                                               00308000
ACDSSPAB EQU   ACDVTAM+48                                               00309000
ACDNEPAB EQU   ACDVTAM+32                                               00310000
ACDRSV20 EQU   ACDVTAM+20                                               00311000
ACDRARQ  EQU   ACDVTAM+16                                               00312000
ACDRAFQ  EQU   ACDVTAM+12                                               00313000
ACDFMCB  EQU   ACDVTAM+8                                                00314000
ACDRDTE  EQU   ACDVTAM+4                                                00315000
ACDLOCK  EQU   ACDVTAM                                                  00316000
ACDAPP   EQU   ACDAPPAD+1                                               00317000
ACDEXSCL EQU   ACDAPPAD                                                 00318000
ACDDEBID EQU   ACDACBAD                                                 00319000
ACDPROTG EQU   ACDACBAD                                                 00320000
ACDECBAD EQU   ACDBASIC+20                                              00321000
ACDUSRPB EQU   ACDUSRPG+1                                               00322000
ACDNMEXT EQU   ACDUSRPG                                                 00323000
ACDPRLEN EQU   ACDBASIC+15                                              00324000
ACDFLGS1 EQU   ACDBASIC+14                                              00325000
ACDQSCNT EQU   ACDBASIC+13                                              00326000
ACDOPATB EQU   ACDBASIC+12                                              00327000
ACDIRBAD EQU   ACDBASIC+8                                               00328000
ACDDEB   EQU   ACDDEBAD+1                                               00329000
ACDAMLNG EQU   ACDDEBAD                                                 00330000
ACDOPNAD EQU   ACDNMSUB                                                 00331000
ACDRSV03 EQU   ACDTBLOF+1                                               00332000
ACDRSV02 EQU   ACDTBLOF                                                 00333000
ACDAMTYP EQU   ACDDBPFX+5                                               00334000
ACDLENG  EQU   ACDDBPFX+4                                               00335000
ACDDEBX  EQU   ACDDBPFX                                                 00336000
ACDRSV08 EQU   ACDVTPRX+12                                              00337000
ACDTSKID EQU   ACDVTPRX+8                                               00338000
ACDCHN   EQU   ACDVTPRX+4                                               00339000
ACDSAF   EQU   ACDVTPRX+2                                               00340000
ACDLNGTH EQU   ACDVTPRX+1                                               00341000
ACDTYPE  EQU   ACDVTPRX                                                 00342000
LOKXCL   EQU   @NM00038                                                 00343000
LOKPRY   EQU   @NM00038                                                 00344000
@NM00039 EQU   @NM00038                                                 00345000
@NM00037 EQU   LOKCHNG                                                  00346000
LOKCT    EQU   ISTLOK                                                   00347000
DCERSV01 EQU   ISTDCE+12                                                00348000
DCETERM  EQU   ISTDCE+8                                                 00349000
MPSSAVE  EQU   ISTMPST+140                                              00350000
MPSMQLBP EQU   ISTMPST+136                                              00351000
MPSSYSRT EQU   ISTMPST+132                                              00352000
MPSQEL   EQU   ISTMPST+128                                              00353000
MPSASCB  EQU   ISTMPST+120                                              00354000
MPSTPPAB EQU   ISTMPST+88                                               00355000
MPSSMPAB EQU   ISTMPST+56                                               00356000
MPSSMRPH EQU   ISTMPST+52                                               00357000
MPSSRB55 EQU   ISTMPST+48                                               00358000
MPSRPLAC EQU   MPSRPLCT+2                                               00359000
MPSRPLRC EQU   MPSRPLCT                                                 00360000
MPSCRPLQ EQU   MPSCRPL                                                  00361000
MPSSRBAC EQU   MPSSRBCT+2                                               00362000
MPSSRBRC EQU   MPSSRBCT                                                 00363000
MPSSRBQ  EQU   MPSSRB                                                   00364000
MPSCRAAC EQU   MPSCRACT+2                                               00365000
MPSCRARC EQU   MPSCRACT                                                 00366000
MPSCRAQ  EQU   MPSCRA                                                   00367000
MPSMPSTP EQU   ISTMPST+20                                               00368000
MPSPSTCT EQU   ISTMPST+16                                               00369000
MPSASID  EQU   MPSFLGA+2                                                00370000
MPSRSV02 EQU   MPSFLGA+1                                                00371000
MPSPSTAB EQU   MPSFLGA                                                  00372000
MPSRSV01 EQU   MPSFLGA                                                  00373000
MPSTPBU  EQU   MPSFLGA                                                  00374000
MPMEMTRM EQU   MPSFLGA                                                  00375000
MPSAUTH  EQU   MPSFLGA                                                  00376000
MPSCRAO  EQU   MPSFLGA                                                  00377000
MPSSRBO  EQU   MPSFLGA                                                  00378000
MPSRQUEG EQU   MPSRQUE                                                  00379000
MPSRSV07 EQU   ISTMPST+4                                                00380000
MPSID    EQU   ISTMPST                                                  00381000
DYPPAB   EQU   ISTDYPAB+16                                              00382000
DYPRSV01 EQU   ISTDYPAB+12                                              00383000
DYPTSKID EQU   ISTDYPAB+8                                               00384000
DYPCHAIN EQU   ISTDYPAB+4                                               00385000
DYPFLGS  EQU   ISTDYPAB+2                                               00386000
DYPLNGTH EQU   ISTDYPAB+1                                               00387000
DYPTYPE  EQU   ISTDYPAB                                                 00388000
PABRPHA  EQU   PABRPHFG+1                                               00389000
PABNODQ  EQU   PABFLAGS                                                 00390000
PABINHBT EQU   PABFLAGS                                                 00391000
PABERLOK EQU   PABERRLK                                                 00392000
PABSSN   EQU   PABFLAGS                                                 00393000
PABDYNAM EQU   PABFLAGS                                                 00394000
PABNORPR EQU   PABFLAGS                                                 00395000
PABPRIOR EQU   PABFLAGS                                                 00396000
PABAPYP  EQU   PABFLAGS                                                 00397000
PABDVTA  EQU   ISTPAB+9                                                 00398000
PABOFFST EQU   ISTPAB+8                                                 00399000
PABCHNGP EQU   PABCHAIN+1                                               00400000
PABRSV02 EQU   PABCHAIN                                                 00401000
PABRESET EQU   PABCHAIN                                                 00402000
PABUNCON EQU   PABCHAIN                                                 00403000
PABCDP   EQU   PABCHAIN                                                 00404000
PABRESCH EQU   PABCHAIN                                                 00405000
PABCHNG  EQU   PABCHAIN                                                 00406000
PABWEQP  EQU   PABWEQA+1                                                00407000
PABRSV01 EQU   PABWEQA                                                  00408000
PABWEQG  EQU   PABWEQA                                                  00409000
ACBAPID  EQU   ACBCOMN+72                                               00410000
ACBCBMWA EQU   ACBCOMN+68                                               00411000
ACBUAPTR EQU   ACBCOMN+64                                               00412000
ACBLRECL EQU   ACBCOMN+62                                               00413000
ACBMSGLN EQU   ACBBLKSZ                                                 00414000
ACBBUFSP EQU   ACBCOMN+56                                               00415000
@NM00036 EQU   ACBUJFCB+1                                               00416000
ACBOPTN  EQU   ACBUJFCB                                                 00417000
@NM00035 EQU   ACBINFLG+1                                               00418000
ACBBYPSS EQU   ACBINFLG                                                 00419000
ACBSDS   EQU   ACBVVIC                                                  00420000
ACBUCRA  EQU   ACBINFLG                                                 00421000
ACBSCRA  EQU   ACBINFLG                                                 00422000
ACBCAT   EQU   ACBINFLG                                                 00423000
ACBIJRQE EQU   ACBINFLG                                                 00424000
ACBJEPS  EQU   ACBINFLG                                                 00425000
@NM00034 EQU   ACBINFLG                                                 00426000
ACBERFLG EQU   ACBCOMN+49                                               00427000
ACBBUSY  EQU   ACBIOSFG                                                 00428000
ACBLOCK  EQU   ACBEXFG                                                  00429000
@NM00033 EQU   ACBOFLGS                                                 00430000
ACBDSERR EQU   ACBOFLGS                                                 00431000
ACBOPEN  EQU   ACBOFLGS                                                 00432000
ACBEOV   EQU   ACBOFLGS                                                 00433000
@NM00032 EQU   ACBOFLGS                                                 00434000
ACBERFL  EQU   ACBDDNM+4                                                00435000
ACBAM    EQU   ACBAMETH                                                 00436000
ACBINFL  EQU   ACBDDNM+2                                                00437000
ACBTIOT  EQU   ACBDDNM                                                  00438000
ACBUEL   EQU   ACBEXLST                                                 00439000
ACBPASSW EQU   ACBCOMN+32                                               00440000
ACBMSGAR EQU   ACBCOMN+28                                               00441000
@NM00031 EQU   ACBDSORG+1                                               00442000
ACBDORGA EQU   ACBDSORG+1                                               00443000
@NM00030 EQU   ACBDSORG                                                 00444000
ACBOPTJ  EQU   ACBDVIND                                                 00445000
ACBCRNRE EQU   ACBCROPS                                                 00446000
ACBCRNCK EQU   ACBCROPS                                                 00447000
ACBASA   EQU   ACBCCTYP                                                 00448000
@NM00029 EQU   ACBCCTYP                                                 00449000
ACBTRCID EQU   ACBCCTYP                                                 00450000
@NM00028 EQU   ACBRECFM                                                 00451000
ACBRECAF EQU   ACBRECFM                                                 00452000
ACBJBUF  EQU   ACBBUFPL+2                                               00453000
ACBMACR4 EQU   ACBBUFPL+1                                               00454000
@NM00027 EQU   ACBMACR3                                                 00455000
ACBNCFX  EQU   ACBMACR3                                                 00456000
ACBSIS   EQU   ACBMACR3                                                 00457000
ACBDFR   EQU   ACBMACR3                                                 00458000
ACBICI   EQU   ACBMACR3                                                 00459000
ACBGSR   EQU   ACBMACR3                                                 00460000
ACBLSR   EQU   ACBMACR3                                                 00461000
@NM00026 EQU   ACBMACR3                                                 00462000
ACBBUFNI EQU   ACBCOMN+18                                               00463000
ACBBUFND EQU   ACBCOMN+16                                               00464000
ACBSTRNO EQU   ACBCOMN+15                                               00465000
ACBBSTNO EQU   ACBCOMN+14                                               00466000
ACBAIX   EQU   ACBMACR2                                                 00467000
ACBDSN   EQU   ACBMACR2                                                 00468000
ACBRST   EQU   ACBMACR2                                                 00469000
ACBLOGON EQU   ACBMACR2                                                 00470000
ACBSKP   EQU   ACBMACR2                                                 00471000
@NM00025 EQU   ACBMACR2                                                 00472000
ACBUBF   EQU   ACBMACR1                                                 00473000
ACBOUT   EQU   ACBMACR1                                                 00474000
ACBIN    EQU   ACBMACR1                                                 00475000
ACBDIR   EQU   ACBMACR1                                                 00476000
ACBSEQ   EQU   ACBMACR1                                                 00477000
ACBBLK   EQU   ACBCNV                                                   00478000
ACBADD   EQU   ACBADR                                                   00479000
ACBKEY   EQU   ACBMACR1                                                 00480000
ACBINRTN EQU   ACBCOMN+8                                                00481000
ACBIBCT  EQU   ACBJWA                                                   00482000
ACBLEN2  EQU   ACBLENG2                                                 00483000
ACBSTYP  EQU   ACBCOMN+1                                                00484000
ACBID    EQU   ACBCOMN                                                  00485000
ASXBEND  EQU   ASXB+232                                                 00486000
ASXBRV25 EQU   ASXB+228                                                 00487000
ASXBRV24 EQU   ASXB+224                                                 00488000
ASXBRV23 EQU   ASXB+220                                                 00489000
ASXBACLQ EQU   ASXB+216                                                 00490000
ASXBCTDC EQU   ASXB+212                                                 00491000
ASXBTDCB EQU   ASXB+208                                                 00492000
ASXBPMRA EQU   ASXB+204                                                 00493000
ASXBLOGQ EQU   ASXB+200                                                 00494000
ASXBUSER EQU   ASXB+193                                                 00495000
ASXBRV35 EQU   ASXB+192                                                 00496000
ASXBLSRB EQU   ASXBAEQ+20                                               00497000
ASXBFSRB EQU   ASXBAEQ+16                                               00498000
ASXBLRQE EQU   ASXBAEQ+12                                               00499000
ASXBFRQE EQU   ASXBAEQ+8                                                00500000
ASXBLIQE EQU   ASXBAEQ+4                                                00501000
ASXBFIQE EQU   ASXBAEQ                                                  00502000
ASXBETSK EQU   ASXB+164                                                 00503000
ASXBSIRB EQU   ASXB+160                                                 00504000
ASXBPSWD EQU   ASXB+152                                                 00505000
ASXBPRG  EQU   ASXB+136                                                 00506000
ASXBSENV EQU   ASXBSECR+1                                               00507000
ASXBRV33 EQU   ASXBSFLG                                                 00508000
ASXBRV32 EQU   ASXBSFLG                                                 00509000
ASXBRV31 EQU   ASXBSFLG                                                 00510000
ASXBRV30 EQU   ASXBSFLG                                                 00511000
ASXBRV29 EQU   ASXBSFLG                                                 00512000
ASXBRV28 EQU   ASXBSFLG                                                 00513000
ASXBRV27 EQU   ASXBSFLG                                                 00514000
ASXBSFND EQU   ASXBSFLG                                                 00515000
ASXBOUSB EQU   ASXB+128                                                 00516000
ASXBDDR  EQU   ASXB+124                                                 00517000
ASXBRCTD EQU   ASXB+120                                                 00518000
ASXBRSMD EQU   ASXB+116                                                 00519000
ASXBSPSA EQU   ASXB+112                                                 00520000
ASXBFRWA EQU   ASXB+108                                                 00521000
ASXBFLSA EQU   ASXB+36                                                  00522000
ASXBIHSA EQU   ASXB+32                                                  00523000
ASXBRV15 EQU   ASXB+28                                                  00524000
ASXBRV14 EQU   ASXB+24                                                  00525000
ASXBLWA  EQU   ASXB+20                                                  00526000
ASXBRV34 EQU   ASXB+15                                                  00527000
ASXBDSLV EQU   ASXB+14                                                  00528000
ASXBTCBS EQU   ASXB+12                                                  00529000
ASXBLTCB EQU   ASXB+8                                                   00530000
ASXBFTCB EQU   ASXB+4                                                   00531000
ASXBASXB EQU   ASXB                                                     00532000
ASXBEGIN EQU   ASXB                                                     00533000
ASCBEND  EQU   ASCB+208                                                 00534000
ASCBSRBT EQU   ASCB+200                                                 00535000
ASCBSWTL EQU   ASCB+196                                                 00536000
ASCBRS14 EQU   ASCB+195                                                 00537000
ASCBSMCT EQU   ASCB+194                                                 00538000
ASCBRS12 EQU   ASCB+192                                                 00539000
ASCBPCTT EQU   ASCB+188                                                 00540000
ASCBVGTT EQU   ASCB+184                                                 00541000
ASCBLGCB EQU   ASCB+180                                                 00542000
ASCBJBNS EQU   ASCB+176                                                 00543000
ASCBJBNI EQU   ASCB+172                                                 00544000
ASCBMCC  EQU   ASCB+168                                                 00545000
ASCBRTWA EQU   ASCB+164                                                 00546000
ASCBIQEA EQU   ASCB+160                                                 00547000
ASCBXMPQ EQU   ASCB+156                                                 00548000
ASCBRS01 EQU   ASCB+154                                                 00549000
ASCBFMCT EQU   ASCB+152                                                 00550000
ASCBOUXB EQU   ASCB+148                                                 00551000
ASCBOUCB EQU   ASCB+144                                                 00552000
ASCBMECB EQU   ASCB+140                                                 00553000
ASCBQECB EQU   ASCB+136                                                 00554000
ASCBCMSB EQU   ASCB+132                                                 00555000
ASCBCMSF EQU   ASCB+128                                                 00556000
ASCBTCBS EQU   ASCB+124                                                 00557000
ASCBNVSC EQU   ASCB+122                                                 00558000
ASCBVSC  EQU   ASCB+120                                                 00559000
ASCBSRBS EQU   ASCB+118                                                 00560000
ASCBSSRB EQU   ASCB+116                                                 00561000
ASCBRV06 EQU   ASCBFLG2                                                 00562000
ASCBRV05 EQU   ASCBFLG2                                                 00563000
ASCBRV04 EQU   ASCBFLG2                                                 00564000
ASCBSNQS EQU   ASCBFLG2                                                 00565000
ASCBS2S  EQU   ASCBFLG2                                                 00566000
ASCBCEXT EQU   ASCBFLG2                                                 00567000
ASCBPXMT EQU   ASCBFLG2                                                 00568000
ASCBXMPT EQU   ASCBFLG2                                                 00569000
ASCBRF07 EQU   ASCBDSP1                                                 00570000
ASCBRF06 EQU   ASCBDSP1                                                 00571000
ASCBRF05 EQU   ASCBDSP1                                                 00572000
ASCBRF04 EQU   ASCBDSP1                                                 00573000
ASCBRF03 EQU   ASCBDSP1                                                 00574000
ASCBRF02 EQU   ASCBDSP1                                                 00575000
ASCBFAIL EQU   ASCBDSP1                                                 00576000
ASCBNOQ  EQU   ASCBDSP1                                                 00577000
ASCBSWCT EQU   ASCB+112                                                 00578000
ASCBTMCH EQU   ASCB+104                                                 00579000
ASCBNSWP EQU   ASCBFLG1                                                 00580000
ASCBTYP1 EQU   ASCBFLG1                                                 00581000
ASCBSTND EQU   ASCBFLG1                                                 00582000
ASCBABNT EQU   ASCBFLG1                                                 00583000
ASCBTERM EQU   ASCBFLG1                                                 00584000
ASCBS3S  EQU   ASCBFLG1                                                 00585000
ASCBCMSH EQU   ASCBFLG1                                                 00586000
ASCBTOFF EQU   ASCBFLG1                                                 00587000
ASCBRF01 EQU   ASCBRCTF                                                 00588000
ASCBTMLW EQU   ASCBRCTF                                                 00589000
ASCBOUT  EQU   ASCBRCTF                                                 00590000
ASCBWAIT EQU   ASCBRCTF                                                 00591000
ASCBRV08 EQU   ASCBRCTF                                                 00592000
ASCBFQU  EQU   ASCBRCTF                                                 00593000
ASCBFRS  EQU   ASCBRCTF                                                 00594000
ASCBTMNO EQU   ASCBRCTF                                                 00595000
ASCBAFFN EQU   ASCBFW1                                                  00596000
ASCBDUMP EQU   ASCB+96                                                  00597000
ASCBQSVC EQU   ASCB+92                                                  00598000
ASCBUBET EQU   ASCB+88                                                  00599000
ASCBECB  EQU   ASCB+84                                                  00600000
ASCBJSTL EQU   ASCB+80                                                  00601000
ASCBEWST EQU   ASCB+72                                                  00602000
ASCBEJST EQU   ASCB+64                                                  00603000
ASCBTSB  EQU   ASCB+60                                                  00604000
ASCBCSCB EQU   ASCB+56                                                  00605000
ASCBRSM  EQU   ASCB+52                                                  00606000
ASCBLDA  EQU   ASCB+48                                                  00607000
ASCBSTOR EQU   ASCB+44                                                  00608000
ASCBDP   EQU   ASCB+43                                                  00609000
ASCBRV07 EQU   ASCB+42                                                  00610000
ASCBIOSM EQU   ASCB+40                                                  00611000
ASCBSEQN EQU   ASCB+38                                                  00612000
ASCBASID EQU   ASCB+36                                                  00613000
ASCBCPUS EQU   ASCB+32                                                  00614000
ASCBSPL  EQU   ASCB+28                                                  00615000
ASCBLSLQ EQU   ASCB+24                                                  00616000
ASCBFSLQ EQU   ASCB+20                                                  00617000
ASCBIOSP EQU   ASCB+16                                                  00618000
ASCBLOCK EQU   ASCB+12                                                  00619000
ASCBBWDP EQU   ASCB+8                                                   00620000
ASCBFWDP EQU   ASCB+4                                                   00621000
ASCBASCB EQU   ASCB                                                     00622000
ASCBEGIN EQU   ASCB                                                     00623000
@NM00024 EQU   PSA+3668                                                 00624000
PSASTAK  EQU   PSA+3072                                                 00625000
@NM00023 EQU   PSA+1040                                                 00626000
PSAUSEND EQU   PSA+1040                                                 00627000
PSARV062 EQU   PSA+1036                                                 00628000
PSAATCVT EQU   PSA+1032                                                 00629000
PSAPCPSW EQU   PSA+1024                                                 00630000
PSAPIR2  EQU   PSA+1020                                                 00631000
PSARV059 EQU   PSA+1018                                                 00632000
PSASVC13 EQU   PSA+1016                                                 00633000
PSALSFCC EQU   PSA+1012                                                 00634000
PSASFACC EQU   PSA+1008                                                 00635000
PSASTOP  EQU   PSA+992                                                  00636000
PSASTART EQU   PSA+976                                                  00637000
PSARSPSW EQU   PSA+968                                                  00638000
PSASRPSW EQU   PSA+960                                                  00639000
PSARV045 EQU   PSA+892                                                  00640000
PSARV044 EQU   PSA+888                                                  00641000
PSARV043 EQU   PSA+884                                                  00642000
PSARV042 EQU   PSA+880                                                  00643000
PSARV041 EQU   PSA+876                                                  00644000
PSARV040 EQU   PSA+872                                                  00645000
PSARV025 EQU   PSA+868                                                  00646000
PSADSSED EQU   PSA+868                                                  00647000
PSADSSPR EQU   PSA+864                                                  00648000
PSADSSFW EQU   PSA+860                                                  00649000
PSADSS14 EQU   PSA+856                                                  00650000
PSADSSPP EQU   PSA+848                                                  00651000
PSADSSRP EQU   PSA+840                                                  00652000
PSADSS05 EQU   PSADSSF4                                                 00653000
PSADSS10 EQU   PSADSSF4                                                 00654000
PSADSSVE EQU   PSADSSF4                                                 00655000
PSADSSDE EQU   PSADSSF4                                                 00656000
PSADSSC0 EQU   PSADSSF4                                                 00657000
PSADSSIE EQU   PSADSSF4                                                 00658000
PSADSS12 EQU   PSADSSF4                                                 00659000
PSADSSRC EQU   PSADSSF4                                                 00660000
PSARV057 EQU   PSADSSF3                                                 00661000
PSARV056 EQU   PSADSSF3                                                 00662000
PSARV055 EQU   PSADSSF3                                                 00663000
PSADSSMC EQU   PSADSSF3                                                 00664000
PSADSSRW EQU   PSADSSF3                                                 00665000
PSADSSNM EQU   PSADSSF3                                                 00666000
PSADSSES EQU   PSADSSF3                                                 00667000
PSADSSGP EQU   PSADSSF3                                                 00668000
PSADSSF2 EQU   PSADSSFL+1                                               00669000
PSADSSPI EQU   PSADSSF1                                                 00670000
PSADSSOI EQU   PSADSSF1                                                 00671000
PSADSSSP EQU   PSADSSF1                                                 00672000
PSADSSTP EQU   PSADSSF1                                                 00673000
PSADSSDW EQU   PSADSSF1                                                 00674000
PSADSSDD EQU   PSADSSF1                                                 00675000
PSADSSDM EQU   PSADSSF1                                                 00676000
PSADSSMV EQU   PSADSSF1                                                 00677000
PSADSSTS EQU   PSA+816                                                  00678000
PSADSSWK EQU   PSA+812                                                  00679000
PSADSSR3 EQU   PSA+808                                                  00680000
PSADSSR2 EQU   PSA+804                                                  00681000
PSADSSRS EQU   PSA+800                                                  00682000
PSASTOR  EQU   PSA+796                                                  00683000
PSACPUSA EQU   PSA+794                                                  00684000
PSAVSTAP EQU   PSA+792                                                  00685000
PSAWKVAP EQU   PSA+788                                                  00686000
PSAWKRAP EQU   PSA+784                                                  00687000
PSAMCHIC EQU   PSA+783                                                  00688000
PSARV061 EQU   PSA+782                                                  00689000
PSASYMSK EQU   PSA+781                                                  00690000
PSAMCHFL EQU   PSA+780                                                  00691000
PSACR0   EQU   PSA+776                                                  00692000
PSAPSWSV EQU   PSA+768                                                  00693000
PSALITA  EQU   PSA+764                                                  00694000
PSACLHS  EQU   PSAHLHI                                                  00695000
PSALKR15 EQU   PSALKSA+60                                               00696000
PSALKR14 EQU   PSALKSA+56                                               00697000
PSALKR13 EQU   PSALKSA+52                                               00698000
PSALKR12 EQU   PSALKSA+48                                               00699000
PSALKR11 EQU   PSALKSA+44                                               00700000
PSALKR10 EQU   PSALKSA+40                                               00701000
PSALKR9  EQU   PSALKSA+36                                               00702000
PSALKR8  EQU   PSALKSA+32                                               00703000
PSALKR7  EQU   PSALKSA+28                                               00704000
PSALKR6  EQU   PSALKSA+24                                               00705000
PSALKR5  EQU   PSALKSA+20                                               00706000
PSALKR4  EQU   PSALKSA+16                                               00707000
PSALKR3  EQU   PSALKSA+12                                               00708000
PSALKR2  EQU   PSALKSA+8                                                00709000
PSALKR1  EQU   PSALKSA+4                                                00710000
PSALKR0  EQU   PSALKSA                                                  00711000
PSARV023 EQU   PSACLHT+52                                               00712000
PSALOCAL EQU   PSACLHT+48                                               00713000
PSACMSL  EQU   PSACLHT+44                                               00714000
PSAOPTL  EQU   PSACLHT+40                                               00715000
PSATPACL EQU   PSACLHT+36                                               00716000
PSATPDNL EQU   PSACLHT+32                                               00717000
PSATPNCL EQU   PSACLHT+28                                               00718000
PSAIOSLL EQU   PSACLHT+24                                               00719000
PSAIOSUL EQU   PSACLHT+20                                               00720000
PSAIOSCL EQU   PSACLHT+16                                               00721000
PSAIOSSL EQU   PSACLHT+12                                               00722000
PSASALCL EQU   PSACLHT+8                                                00723000
PSAASML  EQU   PSACLHT+4                                                00724000
PSADISPL EQU   PSACLHT                                                  00725000
PSASRSA  EQU   PSA+636                                                  00726000
PSARV050 EQU   PSA+634                                                  00727000
PSADSSGO EQU   PSA+633                                                  00728000
PSARECUR EQU   PSA+632                                                  00729000
PSAHLHIS EQU   PSA+628                                                  00730000
PSAIPCSA EQU   PSA+624                                                  00731000
@NM00022 EQU   PSA+621                                                  00732000
PSAIPCDM EQU   PSA+620                                                  00733000
PSAIPCD  EQU   PSA+616                                                  00734000
@NM00021 EQU   PSA+613                                                  00735000
PSAIPCRM EQU   PSA+612                                                  00736000
PSAIPCR  EQU   PSA+608                                                  00737000
PSAMCHEX EQU   PSA+600                                                  00738000
PSAMPSW  EQU   PSA+592                                                  00739000
PSAEXPS2 EQU   PSA+584                                                  00740000
PSAEXPS1 EQU   PSA+576                                                  00741000
PSAPIREG EQU   PSA+572                                                  00742000
PSARSREG EQU   PSA+568                                                  00743000
PSAGPREG EQU   PSA+556                                                  00744000
PSARV022 EQU   PSASUP4                                                  00745000
PSARV021 EQU   PSASUP4                                                  00746000
PSARV020 EQU   PSASUP4                                                  00747000
PSARV019 EQU   PSASUP4                                                  00748000
PSARV018 EQU   PSASUP4                                                  00749000
PSARV017 EQU   PSASUP4                                                  00750000
PSARV016 EQU   PSASUP4                                                  00751000
PSARV015 EQU   PSASUP4                                                  00752000
PSARV014 EQU   PSASUP3                                                  00753000
PSARV013 EQU   PSASUP3                                                  00754000
PSARV012 EQU   PSASUP3                                                  00755000
PSARV011 EQU   PSASUP3                                                  00756000
PSASPR   EQU   PSASUP3                                                  00757000
PSAPSREG EQU   PSASUP3                                                  00758000
PSAPI2   EQU   PSASUP3                                                  00759000
PSAIOSUP EQU   PSASUP3                                                  00760000
PSALCR   EQU   PSASUP2                                                  00761000
PSARTM   EQU   PSASUP2                                                  00762000
PSAACR   EQU   PSASUP2                                                  00763000
PSAIPCE2 EQU   PSASUP2                                                  00764000
PSAIPCES EQU   PSASUP2                                                  00765000
PSAIPCEC EQU   PSASUP2                                                  00766000
PSAGTF   EQU   PSASUP2                                                  00767000
PSAIPCRI EQU   PSASUP2                                                  00768000
PSAIPCRP EQU   PSASUP1                                                  00769000
PSAIPCDR EQU   PSASUP1                                                  00770000
PSADISP  EQU   PSASUP1                                                  00771000
PSALOCK  EQU   PSASUP1                                                  00772000
PSAPI    EQU   PSASUP1                                                  00773000
PSAEXT   EQU   PSASUP1                                                  00774000
PSASVC   EQU   PSASUP1                                                  00775000
PSAIO    EQU   PSASUP1                                                  00776000
PSAANEW  EQU   PSA+544                                                  00777000
PSATNEW  EQU   PSA+536                                                  00778000
PSALCCAR EQU   PSA+532                                                  00779000
PSALCCAV EQU   PSA+528                                                  00780000
PSAPCCAR EQU   PSA+524                                                  00781000
PSAPCCAV EQU   PSA+520                                                  00782000
PSACPULA EQU   PSA+518                                                  00783000
PSACPUPA EQU   PSA+516                                                  00784000
PSAPSA   EQU   PSA+512                                                  00785000
FLCHDEND EQU   PSA+512                                                  00786000
FLCCRSAV EQU   FLCMCLA+280                                              00787000
FLCGRSAV EQU   FLCMCLA+216                                              00788000
FLCFPSAV EQU   FLCMCLA+184                                              00789000
FLCFLA   EQU   FLCMCLA+88                                               00790000
FLCRGNCD EQU   FLCMCLA+84                                               00791000
FLCFSAA  EQU   FLCFSA+1                                                 00792000
@NM00020 EQU   FLCFSA                                                   00793000
@NM00019 EQU   FLCMCLA+72                                               00794000
FLCMCIC  EQU   FLCMCLA+64                                               00795000
@NM00018 EQU   FLCMCLA+20                                               00796000
FLCIOAA  EQU   FLCIOA+1                                                 00797000
@NM00017 EQU   FLCIOA                                                   00798000
@NM00016 EQU   FLCMCLA+15                                               00799000
@NM00015 EQU   FLCMCLA+14                                               00800000
@NM00014 EQU   FLCMCLA+12                                               00801000
FLCLCL   EQU   FLCMCLA+8                                                00802000
FLCIOELA EQU   FLCIOEL+1                                                00803000
@NM00013 EQU   FLCIOEL                                                  00804000
FLCCHNID EQU   FLCMCLA                                                  00805000
@NM00012 EQU   PSA+160                                                  00806000
FLCMTRCD EQU   PSA+157                                                  00807000
@NM00011 EQU   PSA+156                                                  00808000
FLCPERA  EQU   FLCPER+1                                                 00809000
@NM00010 EQU   FLCPER                                                   00810000
@NM00009 EQU   PSA+151                                                  00811000
FLCPERCD EQU   PSA+150                                                  00812000
FLCMCNUM EQU   PSA+149                                                  00813000
@NM00008 EQU   PSA+148                                                  00814000
FLCTEAA  EQU   FLCTEA+1                                                 00815000
@NM00007 EQU   FLCTEA                                                   00816000
PSAPIPC  EQU   PSAPICOD                                                 00817000
PSAPIMC  EQU   PSAPICOD                                                 00818000
PSAPIPER EQU   PSAPICOD                                                 00819000
PSARV049 EQU   FLCPICOD                                                 00820000
FLCPILCB EQU   FLCPIILC                                                 00821000
@NM00006 EQU   FLCPIILC                                                 00822000
@NM00005 EQU   PSAEPPSW                                                 00823000
FLCSVCN  EQU   PSAESPSW+2                                               00824000
FLCSILCB EQU   FLCSVILC                                                 00825000
@NM00004 EQU   FLCSVILC                                                 00826000
@NM00003 EQU   PSAESPSW                                                 00827000
FLCEICOD EQU   PSAEEPSW+2                                               00828000
PSASPAD  EQU   PSAEEPSW                                                 00829000
@NM00002 EQU   PSA+128                                                  00830000
FLCINPSW EQU   PSA+120                                                  00831000
FLCMNPSW EQU   PSA+112                                                  00832000
FLCPNPSW EQU   PSA+104                                                  00833000
FLCSNPSW EQU   PSA+96                                                   00834000
FLCENPSW EQU   PSA+88                                                   00835000
FLCTRACE EQU   PSA+84                                                   00836000
FLCTIMER EQU   PSA+80                                                   00837000
FLCCVT2  EQU   PSA+76                                                   00838000
FLCCAW   EQU   PSA+72                                                   00839000
FLCCSW   EQU   PSA+64                                                   00840000
FLCIOPSW EQU   PSA+56                                                   00841000
FLCMOPSW EQU   PSA+48                                                   00842000
FLCPOPSW EQU   PSA+40                                                   00843000
FLCSOPSW EQU   PSA+32                                                   00844000
FLCEOPSW EQU   PSA+24                                                   00845000
@NM00001 EQU   FLCICCW2+4                                               00846000
FLCCVT   EQU   FLCICCW2                                                 00847000
FLCICCW1 EQU   FLCROPSW                                                 00848000
FLCIPPSW EQU   FLCRNPSW                                                 00849000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00850000
@ENDDATA EQU   *                                                        00851000
         END   ISTOCMDC,(C'PLS0652',0603,75126)                         00852000
