         TITLE 'ISTRAMA4 - MEMORY TERMINATION ESTAE VS2-VTAM           *00001000
                        '                                               00002000
ISTRAMA4 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTRAMA4  77.035'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
      ENTRY ISTRAMA4                                                    00011000
      USING ISTRAMA4,15                                                 00012000
*   PTRRMWA=R2;                     /* INIT PTR TO RMWA              */ 00013000
         LR    PTRRMWA,R2                                          0196 00014000
*   IF R0^=RC12 THEN                /* IF SDWA EXISTS                */ 00015000
         C     R0,@CF01743                                         0197 00016000
         BE    @RF00197                                            0197 00017000
*     DO;                           /* YES - DO                      */ 00018000
*       GEN(STM 14,12,12(13));      /* SAVE CALLERS REGS             */ 00019000
         STM 14,12,12(13)                                               00020000
*       R2=1;                       /* INDICATE SDWA EXISTS          */ 00021000
         LA    R2,1                                                0200 00022000
*       SDWAPTR=R1;                 /* GET SDWA POINTER              */ 00023000
         LR    SDWAPTR,R1                                          0201 00024000
*       PTRRMWA=SDWAPARM;           /* INIT RMWA BASE                */ 00025000
         L     PTRRMWA,SDWAPARM(,SDWAPTR)                          0202 00026000
*       MVC(SDWARECP,MODULEID);     /* MOVE MODULE ID IN SDWA        */ 00027000
         MVC   SDWARECP(24,SDWAPTR),MODULEID                       0203 00028000
*       SDWAURAL=LENGTH(RMWA);      /* SET LENGTH IN SDWA            */ 00029000
         MVI   SDWAURAL(SDWAPTR),X'40'                             0204 00030000
*       SDWAVRA(1:64)=RMWA;         /* MOVE RMWA IN SDWA FOR SETRP   */ 00031000
         MVC   SDWAVRA(64,SDWAPTR),RMWA(PTRRMWA)                   0205 00032000
*     END;                                                         0206 00033000
*                                                                  0206 00034000
*/*   CHANGE BASEREG TO TWELVE AT THIS POINT                         */ 00035000
*                                                                  0207 00036000
*   GEN;                                                           0207 00037000
@RF00197 DS    0H                                                  0207 00038000
      LR 12,15                                                          00039000
      USING ISTRAMA4,12                                                 00040000
      DROP 15                                                           00041000
*   R0=RSAVSZ;                      /* SET REG ZERO TO SIZE OF     0208 00042000
*                                      GETMAIN                       */ 00043000
         LA    R0,72                                               0208 00044000
*   GEN SETS(R1) REFS(R0);                                         0209 00045000
*                            /* ISSUE GETMAIN FOR MY SAVEAREA  */       00046000
      GETMAIN RC,LV=(0)                                                 00047000
*   R4=0;                                                          0210 00048000
         SLR   R4,R4                                               0210 00049000
*   IF ATCLCPTR^=0&                 /* IF ATCVT EXISTS AND   @ZA17033*/ 00050000
*       R15=0 THEN                                                 0211 00051000
         SLR   @09,@09                                             0211 00052000
         C     @09,ATCLCPTR                                        0211 00053000
         BE    @RF00211                                            0211 00054000
         CR    R15,@09                                             0211 00055000
         BNE   @RF00211                                            0211 00056000
*     DO;                           /* IF GETMAIN SUCCESS EST PTR TO    00057000
*                                      IT                            */ 00058000
*       R4=1;                       /* EST SWITCH FOR GETMAIN SUCCESS*/ 00059000
         LA    R4,1                                                0213 00060000
*       R7=R13;                     /* SAVE PTR TO CALLERS SAVE AREA */ 00061000
         LR    R7,R13                                              0214 00062000
*       R13=R1;                     /* PT TO MY SAVEAREA             */ 00063000
         LR    R13,R1                                              0215 00064000
*       RMSGPTR=ADDR(MSGOUT);       /* PT TO MSG OUTPUT AREA         */ 00065000
         LA    @03,MSGOUT(,PTRRMWA)                                0216 00066000
         ST    @03,RMSGPTR(,PTRRMWA)                               0216 00067000
*       PLAREAPT=ADDR(RMWACCRA);    /* PT TO PARMLIST AREA FOR TPMSG */ 00068000
         LA    @03,RMWACCRA(,PTRRMWA)                              0217 00069000
         ST    @03,PLAREAPT(,PTRRMWA)                              0217 00070000
*       IF MPSTFND2^=0 THEN                                        0218 00071000
         L     @03,MPSTFND2(,PTRRMWA)                              0218 00072000
         CR    @03,@09                                             0218 00073000
         BE    @RF00218                                            0218 00074000
*         MAPPL=MPSASID;            /* IF VTAM NOT ABENDING MOVE IN     00075000
*                                      ASID                          */ 00076000
         MVI   MAPPL+2(PTRRMWA),C' '                               0219 00077000
         MVC   MAPPL+3(5,PTRRMWA),MAPPL+2(PTRRMWA)                 0219 00078000
         MVC   MAPPL(2,PTRRMWA),MPSASID(@03)                       0219 00079000
*       ELSE                                                       0220 00080000
*         MAPPL=ASIDVTM;            /* YES VTAM ABENDED              */ 00081000
         B     @RC00218                                            0220 00082000
@RF00218 MVC   MAPPL(8,PTRRMWA),ASIDVTM                            0220 00083000
*/*TPMSG MSGID('417I')MSG((RMSGPTR))PLAREA((PLAREAPT))               */ 00084000
*                                                                  0221 00085000
*       DO;                                                        0221 00086000
@RC00218 DS    0H                                                  0222 00087000
*         DCL                                                      0222 00088000
*           REG1002 REG(1) PTR;                                    0222 00089000
*         RFY                                                      0223 00090000
*          (REG1002) RSTD;                                         0223 00091000
*         RFY                                                      0224 00092000
*          (EMCR13) RSTD;                                          0224 00093000
*         DCL                                                      0225 00094000
*           1 * BASED(REG1002),                                    0225 00095000
*            2 CMZID002 PTR(31),                                   0225 00096000
*            2 *,                                                  0225 00097000
*             3 CMZRL002 PTR(8),                                   0225 00098000
*             3 CMZRA002 PTR(24) BDY(BYTE),                        0225 00099000
*            2 CMZEA002 PTR(31),                                   0225 00100000
*            2 CMZVP002 PTR(31);                                   0225 00101000
*                                                                  0225 00102000
*/*XREGSET  PID('PLAREA')PPARM((PLAREAPT))RREG(,REG1002)             */ 00103000
*                                                                  0226 00104000
*         DO;                                                      0226 00105000
*           REG1002=PLAREAPT;       /* SET RREG SYMBOL TO VALUE OF 0227 00106000
*                                      PPARM OPERAND                 */ 00107000
         L     REG1002,PLAREAPT(,PTRRMWA)                          0227 00108000
*         END;                      /* XREGSET                       */ 00109000
*         CMZID002=0;                                              0229 00110000
         SLR   @09,@09                                             0229 00111000
         ST    @09,CMZID002(,REG1002)                              0229 00112000
*         CMZRL002=0;                                              0230 00113000
         MVI   CMZRL002(REG1002),X'00'                             0230 00114000
*         CMZRA002=0;                                              0231 00115000
         STCM  @09,7,CMZRA002(REG1002)                             0231 00116000
*         CMZEA002=0;                                              0232 00117000
         ST    @09,CMZEA002(,REG1002)                              0232 00118000
*         CMZVP002=0;                                              0233 00119000
         ST    @09,CMZVP002(,REG1002)                              0233 00120000
*         DCL                                                      0234 00121000
*           CMZAA002 CHAR(4) INIT('417I');                         0234 00122000
*         CMZID002=ADDR(CMZAA002);                                 0235 00123000
         LA    @09,CMZAA002                                        0235 00124000
         ST    @09,CMZID002(,REG1002)                              0235 00125000
*         CMZVP002=RMSGPTR;                                        0236 00126000
         L     @09,RMSGPTR(,PTRRMWA)                               0236 00127000
         ST    @09,CMZVP002(,REG1002)                              0236 00128000
*         DCL                                                      0237 00129000
*           CMZSA002(18) PTR(31) BASED(EMCR13);                    0237 00130000
*         DCL                                                      0238 00131000
*           CMZZO002(1) FIXED(31) INIT(0);                         0238 00132000
*         CMZSA002(5)=CMZZO002;                                    0239 00133000
         L     @09,CMZZO002                                        0239 00134000
         ST    @09,CMZSA002+16(,EMCR13)                            0239 00135000
*         DCL                                                      0240 00136000
*           REG15002 REG(15) PTR;                                  0240 00137000
*         RFY                                                      0241 00138000
*           REG15002 RSTD;                                         0241 00139000
*         DO;                       /* LISATCVT                    0242 00140000
*                                      CVTBASE(PAGEABLE,(REG15002))  */ 00141000
*           REG15002=ATCLCPTR;      /* SET UP ATCVT POINTER          */ 00142000
         L     REG15002,ATCLCPTR                                   0243 00143000
*         END;                      /* LISATCVT                      */ 00144000
*         DCL                                                      0245 00145000
*           CMTA002 BASED(REG15002) ENTRY VALUERANGE(*);           0245 00146000
*         REG15002=REG15002->ATCMSGP;                              0246 00147000
         L     REG15002,ATCMSGP(,REG15002)                         0246 00148000
*         CALL CMTA002;                                            0247 00149000
         BALR  @14,@15                                             0247 00150000
*         RESPECIFY                                                0248 00151000
*          (REG1002,                                               0248 00152000
*           REG15002) UNRESTRICTED;                                0248 00153000
*         RFY                                                      0249 00154000
*          (EMCR13) UNRSTD;                                        0249 00155000
*       END;                                                       0250 00156000
*     END;                                                         0251 00157000
*   ELSE                                                           0252 00158000
*     DO;                           /* NO SPACE AVAILABLE ISSUE WTO  */ 00159000
         B     @RC00211                                            0252 00160000
@RF00211 DS    0H                                                  0253 00161000
*       R1=ADDR(I04160);            /* ADDRESS MSG                   */ 00162000
         LA    R1,I04160                                           0253 00163000
*       SVC(35);                                                   0254 00164000
         SVC   35                                                  0254 00165000
*     END;                                                         0255 00166000
*                                                                  0255 00167000
*   /*****************************************************************/ 00168000
*   /*                                                               */ 00169000
*   /* SDUMP THE SYSTEM AREAS AND FAILING MEMORY                     */ 00170000
*   /*                                                               */ 00171000
*   /*****************************************************************/ 00172000
*                                                                  0256 00173000
*   R1=ADDR(DUMPPARM);              /* PT TO DUMP PARMLIST           */ 00174000
@RC00211 LA    R1,DUMPPARM                                         0256 00175000
*   GENERATE CODE REFS(CVTPTR,CVTMAP,CVTSDMP,R1);                  0257 00176000
          SDUMP MF=(E,(1))          ISSUE SDUMP MACRO                   00177000
*   IF MPSTFND2^=0 THEN                                            0258 00178000
         L     @09,MPSTFND2(,PTRRMWA)                              0258 00179000
         LTR   @09,@09                                             0258 00180000
         BZ    @RF00258                                            0258 00181000
*     DO;                           /* PTR TO MPST EXIST YES-DO      */ 00182000
*       R5=MPSDBTBL;                /* PT TO 1ST DCE ON CHAIN        */ 00183000
         L     R5,MPSDBTBL(,@09)                                   0260 00184000
*       DO WHILE R5^=0;             /* LOOP THRU ALL DCES            */ 00185000
         B     @DE00261                                            0261 00186000
@DL00261 DS    0H                                                  0262 00187000
*         IF ACDRDTE^=0&            /* DEB PT TO RDTE                */ 00188000
*             RAPACDEB=DCEDBPTR&    /* RDTE PTS TO DEB               */ 00189000
*             RPRONLIN=ON THEN      /* RDTE ONLINE                   */ 00190000
         SLR   @09,@09                                             0262 00191000
         L     @03,DCEDBPTR(,R5)                                   0262 00192000
         L     @11,ACDRDTE(,@03)                                   0262 00193000
         CR    @11,@09                                             0262 00194000
         BE    @RF00262                                            0262 00195000
         C     @03,RAPACDEB(,@11)                                  0262 00196000
         BNE   @RF00262                                            0262 00197000
         TM    RPRONLIN(@11),B'00001000'                           0262 00198000
         BNO   @RF00262                                            0262 00199000
*           DO;                                                    0263 00200000
*             RPRONLIN=OFF;         /* MARK THIS RDTE INACTIVE       */ 00201000
         NI    RPRONLIN(@11),B'11110111'                           0264 00202000
*             RPRLGONF=0;           /* ZERO LOGON CHAIN FIELD        */ 00203000
         ST    @09,RPRLGONF(,@11)                                  0265 00204000
*             IF R4=1 THEN                                         0266 00205000
         C     R4,@CF00049                                         0266 00206000
         BNE   @RF00266                                            0266 00207000
*               DO;                 /* STORAGE AVAILABLE ISSUE TPMSG */ 00208000
*                 MAPPL=RPRNAME;    /* ASSIGN APPLID TO OUTPUT AREA  */ 00209000
         MVC   MAPPL(8,PTRRMWA),RPRNAME(@11)                       0268 00210000
*                 TIOTPTR=ACDTCB->TCBTIO;/* PT TO TIOT               */ 00211000
         L     @03,ACDTCB-1(,@03)                                  0269 00212000
         L     TIOTPTR,TCBTIO(,@03)                                0269 00213000
*                 MSGW=TIOCNJOB;    /* ASSIGN JOBNAME TO OUTPUT AREA */ 00214000
         MVC   MSGW(8,PTRRMWA),TIOCNJOB(TIOTPTR)                   0270 00215000
*                 MSGX=TIOCSTEP;    /* ASSIGN STEPNAMAE TO OUTPUT  0271 00216000
*                                      AREA                          */ 00217000
         MVC   MSGX(8,PTRRMWA),TIOCSTEP(TIOTPTR)                   0271 00218000
*/*TPMSG MSGID('418I')MSG((RMSGPTR))PLAREA((PLAREAPT))               */ 00219000
*                                                                  0272 00220000
*                 DO;                                              0272 00221000
*                   DCL                                            0273 00222000
*                     REG1011 REG(1) PTR;                          0273 00223000
*                   RFY                                            0274 00224000
*                    (REG1011) RSTD;                               0274 00225000
*                   RFY                                            0275 00226000
*                    (EMCR13) RSTD;                                0275 00227000
*                   DCL                                            0276 00228000
*                     1 * BASED(REG1011),                          0276 00229000
*                      2 CMZID011 PTR(31),                         0276 00230000
*                      2 *,                                        0276 00231000
*                       3 CMZRL011 PTR(8),                         0276 00232000
*                       3 CMZRA011 PTR(24) BDY(BYTE),              0276 00233000
*                      2 CMZEA011 PTR(31),                         0276 00234000
*                      2 CMZVP011 PTR(31);                         0276 00235000
*                                                                  0276 00236000
*/*XREGSET  PID('PLAREA')PPARM((PLAREAPT))RREG(,REG1011)             */ 00237000
*                                                                  0277 00238000
*                   DO;                                            0277 00239000
*                     REG1011=PLAREAPT;/* SET RREG SYMBOL TO VALUE OF   00240000
*                                      PPARM OPERAND                 */ 00241000
         L     REG1011,PLAREAPT(,PTRRMWA)                          0278 00242000
*                   END;            /* XREGSET                       */ 00243000
*                   CMZID011=0;                                    0280 00244000
         ST    @09,CMZID011(,REG1011)                              0280 00245000
*                   CMZRL011=0;                                    0281 00246000
         MVI   CMZRL011(REG1011),X'00'                             0281 00247000
*                   CMZRA011=0;                                    0282 00248000
         STCM  @09,7,CMZRA011(REG1011)                             0282 00249000
*                   CMZEA011=0;                                    0283 00250000
         ST    @09,CMZEA011(,REG1011)                              0283 00251000
*                   CMZVP011=0;                                    0284 00252000
         ST    @09,CMZVP011(,REG1011)                              0284 00253000
*                   DCL                                            0285 00254000
*                     CMZAA011 CHAR(4) INIT('418I');               0285 00255000
*                   CMZID011=ADDR(CMZAA011);                       0286 00256000
         LA    @09,CMZAA011                                        0286 00257000
         ST    @09,CMZID011(,REG1011)                              0286 00258000
*                   CMZVP011=RMSGPTR;                              0287 00259000
         L     @09,RMSGPTR(,PTRRMWA)                               0287 00260000
         ST    @09,CMZVP011(,REG1011)                              0287 00261000
*                   DCL                                            0288 00262000
*                     CMZSA011(18) PTR(31) BASED(EMCR13);          0288 00263000
*                   DCL                                            0289 00264000
*                     CMZZO011(1) FIXED(31) INIT(0);               0289 00265000
*                   CMZSA011(5)=CMZZO011;                          0290 00266000
         L     @09,CMZZO011                                        0290 00267000
         ST    @09,CMZSA011+16(,EMCR13)                            0290 00268000
*                   DCL                                            0291 00269000
*                     REG15011 REG(15) PTR;                        0291 00270000
*                   RFY                                            0292 00271000
*                     REG15011 RSTD;                               0292 00272000
*                   DO;             /* LISATCVT                    0293 00273000
*                                      CVTBASE(PAGEABLE,(REG15011))  */ 00274000
*                     REG15011=ATCLCPTR;/* SET UP ATCVT POINTER      */ 00275000
         L     REG15011,ATCLCPTR                                   0294 00276000
*                   END;            /* LISATCVT                      */ 00277000
*                   DCL                                            0296 00278000
*                     CMTA011 BASED(REG15011) ENTRY VALUERANGE(*); 0296 00279000
*                   REG15011=REG15011->ATCMSGP;                    0297 00280000
         L     REG15011,ATCMSGP(,REG15011)                         0297 00281000
*                   CALL CMTA011;                                  0298 00282000
         BALR  @14,@15                                             0298 00283000
*                   RESPECIFY                                      0299 00284000
*                    (REG1011,                                     0299 00285000
*                     REG15011) UNRESTRICTED;                      0299 00286000
*                   RFY                                            0300 00287000
*                    (EMCR13) UNRSTD;                              0300 00288000
*                 END;                                             0301 00289000
*               END;                                               0302 00290000
*             ELSE                                                 0303 00291000
*               DO;                 /* NO SPACE AVAILABLE ISSUE WTO  */ 00292000
         B     @RC00266                                            0303 00293000
@RF00266 DS    0H                                                  0304 00294000
*                 R1=ADDR(I04151);  /* ADDRESS MSG                   */ 00295000
         LA    R1,I04151                                           0304 00296000
*                 SVC(35);                                         0305 00297000
         SVC   35                                                  0305 00298000
*               END;                                               0306 00299000
*           END;                                                   0307 00300000
@RC00266 DS    0H                                                  0308 00301000
*         R5=DCECHN;                /* PT TO NEXT DCE ON             */ 00302000
@RF00262 L     R5,DCECHN(,R5)                                      0308 00303000
*       END;                                                       0309 00304000
@DE00261 LTR   R5,R5                                               0309 00305000
         BNZ   @DL00261                                            0309 00306000
*     END;                                                         0310 00307000
*   IF R4=1 THEN                                                   0311 00308000
@RF00258 C     R4,@CF00049                                         0311 00309000
         BNE   @RF00311                                            0311 00310000
*     DO;                           /* IF STORAGE OBTAINED FREE IT   */ 00311000
*       R0=RSAVSZ;                  /* SIZE OF FREEMAIN              */ 00312000
         LA    R0,72                                               0313 00313000
*       R1=R13;                     /* PTR TO AREA IN ONE            */ 00314000
         LR    R1,R13                                              0314 00315000
*       GEN(FREEMAIN R,LV=(0),A=(1));/* FREE MY SAVE AREA            */ 00316000
         FREEMAIN R,LV=(0),A=(1)                                        00317000
*       R13=R7;                     /* PT BACK TO CALLERS SAVE AREA  */ 00318000
         LR    R13,R7                                              0316 00319000
*     END;                                                         0317 00320000
*   IF R2=1 THEN                    /* IF SDWA EXISTS ISSUE SETRP    */ 00321000
@RF00311 C     R2,@CF00049                                         0318 00322000
         BNE   @RF00318                                            0318 00323000
*     DO;                                                          0319 00324000
*       GEN(L 1,24(13));            /* RESTORE PTR TO SDWA IN REG ONE*/ 00325000
         L 1,24(13)                                                     00326000
*       DO;                         /* SETRP RECORD(YES)REGS(14,12)FR   00327000
*                                      ELOCK(LOCAL)                  */ 00328000
*         RESPECIFY                                                0322 00329000
*          (GPR00P,                                                0322 00330000
*           GPR01P,                                                0322 00331000
*           GPR14P,                                                0322 00332000
*           GPR15P) RSTD;                                          0322 00333000
*         GPR01P->SDWARCDE=0;       /* SAVE RC VALUE                 */ 00334000
         MVI   SDWARCDE(GPR01P),X'00'                              0323 00335000
*         GPR01P->SDWARCRD='1'B;    /* TURN ON RECORD INDICATOR      */ 00336000
         OI    SDWARCRD(GPR01P),B'10000000'                        0324 00337000
*         GPR01P->SDWAACF4=GPR01P->SDWAACF4|'00000001'B;/* INITIALIZE   00338000
*                                      LOCK FLAGS                    */ 00339000
         OI    SDWAACF4(GPR01P),B'00000001'                        0325 00340000
*         GEN(RETURN (14,12));                                     0326 00341000
         RETURN (14,12)                                                 00342000
*         RESPECIFY                                                0327 00343000
*          (GPR00P,                                                0327 00344000
*           GPR01P,                                                0327 00345000
*           GPR14P,                                                0327 00346000
*           GPR15P) UNRSTD;                                        0327 00347000
*       END;                                                       0328 00348000
*     END;                                                         0329 00349000
*   R15=0;                          /* ZERO REG 15 MEANS NO RETRY TO    00350000
*                                      RTM                           */ 00351000
@RF00318 SLR   R15,R15                                             0330 00352000
*   GEN(BR 14);                     /* RETURN TO RTM                 */ 00353000
         BR 14                                                          00354000
*/* TPEPILOG                                                         */ 00355000
*                                                                  0332 00356000
*   GEN(PRINT OFF);                                                0332 00357000
         PRINT OFF                                                      00358000
*   DECLARE                                                        0333 00359000
*     EMCR0 PTR REG(0),                                            0333 00360000
*     EMCR1 PTR REG(1),                                            0333 00361000
*     EMCR2 PTR REG(2),                                            0333 00362000
*     EMCR3 PTR REG(3),                                            0333 00363000
*     EMCR4 PTR REG(4),                                            0333 00364000
*     EMCR5 PTR REG(5),                                            0333 00365000
*     EMCR6 PTR REG(6),                                            0333 00366000
*     EMCR7 PTR REG(7),                                            0333 00367000
*     EMCR8 PTR REG(8),                                            0333 00368000
*     EMCR9 PTR REG(9),                                            0333 00369000
*     EMCR10 PTR REG(10),                                          0333 00370000
*     EMCR11 PTR REG(11),                                          0333 00371000
*     EMCR12 PTR REG(12),                                          0333 00372000
*     EMCR13 PTR REG(13),                                          0333 00373000
*     EMCR14 PTR REG(14),                                          0333 00374000
*     EMCR15 PTR REG(15);                                          0333 00375000
*   GEN(PRINT ON);                                                 0334 00376000
*                                                                  0334 00377000
         PRINT ON                                                       00378000
*/* END OF TPEPILOG                                                  */ 00379000
*                                                                  0335 00380000
*   END ISTRAMA4                                                   0335 00381000
*                                                                  0335 00382000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00383000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 00384000
*/*%INCLUDE SYSUT5  (DECLARES)                                       */ 00385000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00386000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 00387000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00388000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */ 00389000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00390000
*                                                                  0335 00391000
*       ;                                                          0335 00392000
@EL00001 DS    0H                                                  0335 00393000
@EF00001 DS    0H                                                  0335 00394000
@ER00001 BR    @14                                                 0335 00395000
@DATA    DS    0H                                                       00396000
@DATD    DSECT                                                          00397000
         DS    0F                                                       00398000
ISTRAMA4 CSECT                                                          00399000
         DS    0F                                                       00400000
@CF00049 DC    F'1'                                                     00401000
@CF01743 DC    F'12'                                                    00402000
@DATD    DSECT                                                          00403000
         DS    0D                                                       00404000
SRBPTR   DS    A                                                        00405000
TCBPTR   DS    A                                                        00406000
ISTRAMA4 CSECT                                                          00407000
         DS    0F                                                       00408000
@SIZDATD DC    AL1(0)                                                   00409000
         DC    AL3(@ENDDATD-@DATD)                                      00410000
         DS    0D                                                       00411000
MODULEID DC    CL24'ISTRAMA2ISTRAMA2ISTRAMA2'                           00412000
ASIDVTM  DC    CL8'  VTAM  '                                            00413000
I04160   DS    CL79                                                     00414000
         ORG   I04160                                                   00415000
I0416001 DC    H'75'                                                    00416000
I0416002 DC    B'1000000000000000'                                      00417000
I0416003 DC    CL71'IST416I SDUMP ISSUED DUE TO ADDRESS SPACE TERMINATIC00418000
               ON    '                                                  00419000
I0416004 DC    B'0001000000000000'                                      00420000
I0416005 DC    B'0100000100000000'                                      00421000
         ORG   I04160+79                                                00422000
         DS    CL1                                                      00423000
I04151   DS    CL90                                                     00424000
         ORG   I04151                                                   00425000
I0415101 DC    H'86'                                                    00426000
I0415102 DC    B'1000000000000000'                                      00427000
I0415103 DC    CL82'IST415I TERMINATION PROCESSING WILL NOT BE DONE FORC00428000
                JOBS IN ABENDING ADDRESS SPACE'                         00429000
I0415104 DC    B'0001000000000000'                                      00430000
I0415105 DC    B'0100000100000000'                                      00431000
         ORG   I04151+90                                                00432000
CMZAA002 DC    CL4'417I'                                                00433000
CMZAA011 DC    CL4'418I'                                                00434000
         DS    CL2                                                      00435000
CMZZO002 DC    F'0'                                                     00436000
CMZZO011 DC    F'0'                                                     00437000
ISTRAMA4 CSECT                                                          00438000
DUMPPARM SDUMP SDATA=(SQA,LSQA,TRT,ALLPSA,CSA),MF=L,                   X00439000
               HDR='ISTRAMA4 - VTAM MEMORY TERMINATION ESTAE'           00440000
@DATD    DSECT                                                          00441000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00442000
@ENDDATD EQU   *                                                        00443000
ISTRAMA4 CSECT                                                          00444000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00445000
@01      EQU   01                                                       00446000
@02      EQU   02                                                       00447000
@03      EQU   03                                                       00448000
@04      EQU   04                                                       00449000
@05      EQU   05                                                       00450000
@06      EQU   06                                                       00451000
@07      EQU   07                                                       00452000
@08      EQU   08                                                       00453000
@09      EQU   09                                                       00454000
@10      EQU   10                                                       00455000
@11      EQU   11                                                       00456000
@12      EQU   12                                                       00457000
@13      EQU   13                                                       00458000
@14      EQU   14                                                       00459000
@15      EQU   15                                                       00460000
SDWAPTR  EQU   @05                                                      00461000
TIOTPTR  EQU   @08                                                      00462000
RPHPTR   EQU   @01                                                      00463000
R0       EQU   @00                                                      00464000
R4       EQU   @04                                                      00465000
R5       EQU   @05                                                      00466000
R6       EQU   @06                                                      00467000
R7       EQU   @07                                                      00468000
R1       EQU   @01                                                      00469000
PTRRMWA  EQU   @06                                                      00470000
R2       EQU   @02                                                      00471000
R12      EQU   @12                                                      00472000
R13      EQU   @13                                                      00473000
R14      EQU   @14                                                      00474000
R15      EQU   @15                                                      00475000
GPR00P   EQU   @00                                                      00476000
GPR01P   EQU   @01                                                      00477000
GPR14P   EQU   @14                                                      00478000
GPR15P   EQU   @15                                                      00479000
REG1002  EQU   @01                                                      00480000
EMCR13   EQU   @13                                                      00481000
REG15002 EQU   @15                                                      00482000
REG1011  EQU   @01                                                      00483000
REG15011 EQU   @15                                                      00484000
EMCR0    EQU   @00                                                      00485000
EMCR1    EQU   @01                                                      00486000
EMCR10   EQU   @10                                                      00487000
EMCR11   EQU   @11                                                      00488000
EMCR12   EQU   @12                                                      00489000
EMCR14   EQU   @14                                                      00490000
EMCR15   EQU   @15                                                      00491000
EMCR2    EQU   @02                                                      00492000
EMCR3    EQU   @03                                                      00493000
EMCR4    EQU   @04                                                      00494000
EMCR5    EQU   @05                                                      00495000
EMCR6    EQU   @06                                                      00496000
EMCR7    EQU   @07                                                      00497000
EMCR8    EQU   @08                                                      00498000
EMCR9    EQU   @09                                                      00499000
CVTPTR   EQU   16                                                       00500000
ATCLCPTR EQU   1032                                                     00501000
SRBSECT  EQU   0                                                        00502000
SRBFLC   EQU   SRBSECT+12                                               00503000
SDWA     EQU   0                                                        00504000
SDWAPARM EQU   SDWA                                                     00505000
SDWAFIOB EQU   SDWA+4                                                   00506000
SDWAABCC EQU   SDWAFIOB                                                 00507000
SDWACMPF EQU   SDWAABCC                                                 00508000
SDWACTL1 EQU   SDWA+8                                                   00509000
SDWACMKA EQU   SDWACTL1                                                 00510000
SDWAMWPA EQU   SDWACTL1+1                                               00511000
SDWAPMKA EQU   SDWACTL1+4                                               00512000
SDWACTL2 EQU   SDWA+16                                                  00513000
SDWACMKP EQU   SDWACTL2                                                 00514000
SDWAMWPP EQU   SDWACTL2+1                                               00515000
SDWAPMKP EQU   SDWACTL2+4                                               00516000
SDWAGRSV EQU   SDWA+24                                                  00517000
SDWANAME EQU   SDWA+88                                                  00518000
SDWAEC1  EQU   SDWA+104                                                 00519000
SDWAEMK1 EQU   SDWAEC1                                                  00520000
SDWAMWP1 EQU   SDWAEC1+1                                                00521000
SDWAINT1 EQU   SDWAEC1+2                                                00522000
SDWANXT1 EQU   SDWAEC1+4                                                00523000
SDWAAEC1 EQU   SDWA+112                                                 00524000
SDWAILC1 EQU   SDWAAEC1+1                                               00525000
SDWAINC1 EQU   SDWAAEC1+2                                               00526000
SDWAICD1 EQU   SDWAINC1+1                                               00527000
SDWAEC2  EQU   SDWA+120                                                 00528000
SDWAEMK2 EQU   SDWAEC2                                                  00529000
SDWAMWP2 EQU   SDWAEC2+1                                                00530000
SDWAINT2 EQU   SDWAEC2+2                                                00531000
SDWANXT2 EQU   SDWAEC2+4                                                00532000
SDWAAEC2 EQU   SDWA+128                                                 00533000
SDWAILC2 EQU   SDWAAEC2+1                                               00534000
SDWAINC2 EQU   SDWAAEC2+2                                               00535000
SDWAICD2 EQU   SDWAINC2+1                                               00536000
SDWASRSV EQU   SDWA+136                                                 00537000
SDWAIDNT EQU   SDWA+200                                                 00538000
SDWAMCH  EQU   SDWA+204                                                 00539000
SDWASTCK EQU   SDWAMCH                                                  00540000
SDWAMCHI EQU   SDWAMCH+8                                                00541000
SDWAMCHS EQU   SDWAMCHI                                                 00542000
SDWAMCHD EQU   SDWAMCHI+1                                               00543000
SDWARSR1 EQU   SDWAMCH+12                                               00544000
SDWARSR2 EQU   SDWAMCH+13                                               00545000
SDWAFLGS EQU   SDWA+232                                                 00546000
SDWAERRA EQU   SDWAFLGS                                                 00547000
SDWAERRB EQU   SDWAFLGS+1                                               00548000
SDWAERRC EQU   SDWAFLGS+2                                               00549000
SDWAERRD EQU   SDWAFLGS+3                                               00550000
SDWAIOFS EQU   SDWA+238                                                 00551000
SDWACPUA EQU   SDWA+248                                                 00552000
SDWAPARQ EQU   SDWA+252                                                 00553000
SDWARCDE EQU   SDWAPARQ                                                 00554000
SDWAACF2 EQU   SDWAPARQ+1                                               00555000
SDWARCRD EQU   SDWAACF2                                                 00556000
SDWAACF3 EQU   SDWAPARQ+2                                               00557000
SDWAACF4 EQU   SDWAPARQ+3                                               00558000
SDWALKWA EQU   SDWA+256                                                 00559000
SDWALKWS EQU   SDWALKWA                                                 00560000
SDWARECP EQU   SDWA+292                                                 00561000
SDWASNPA EQU   SDWA+320                                                 00562000
SDWADUMP EQU   SDWASNPA                                                 00563000
SDWADPFS EQU   SDWADUMP+1                                               00564000
SDWADDAT EQU   SDWASNPA+4                                               00565000
SDWASDAT EQU   SDWADDAT                                                 00566000
SDWAPDAT EQU   SDWADDAT+2                                               00567000
SDWADPSA EQU   SDWA+328                                                 00568000
SDWADPSL EQU   SDWADPSA                                                 00569000
SDWARA   EQU   SDWA+400                                                 00570000
SDWADPVA EQU   SDWARA+2                                                 00571000
SDWAURAL EQU   SDWARA+3                                                 00572000
SDWAVRA  EQU   SDWARA+4                                                 00573000
TCBFIX   EQU   0                                                        00574000
TCBFRS   EQU   TCBFIX                                                   00575000
TCB      EQU   0                                                        00576000
TCBPIE   EQU   TCB+4                                                    00577000
TCBPMASK EQU   TCBPIE                                                   00578000
TCBTIO   EQU   TCB+12                                                   00579000
TCBCMP   EQU   TCB+16                                                   00580000
TCBCMPF  EQU   TCBCMP                                                   00581000
TCBCPP   EQU   TCBCMPF                                                  00582000
TCBSTCC  EQU   TCBCMPF                                                  00583000
TCBCDBL  EQU   TCBCMPF                                                  00584000
TCBCWTO  EQU   TCBCMPF                                                  00585000
TCBCIND  EQU   TCBCMPF                                                  00586000
TCBCMSG  EQU   TCBCMPF                                                  00587000
TCBTRN   EQU   TCB+20                                                   00588000
TCBABF   EQU   TCBTRN                                                   00589000
TCBMSS   EQU   TCB+24                                                   00590000
TCBPKF   EQU   TCB+28                                                   00591000
TCBFLGS  EQU   TCB+29                                                   00592000
TCBFLGS1 EQU   TCBFLGS                                                  00593000
TCBFLGS2 EQU   TCBFLGS+1                                                00594000
TCBFLGS3 EQU   TCBFLGS+2                                                00595000
TCBFLGS4 EQU   TCBFLGS+3                                                00596000
TCBFLGS5 EQU   TCBFLGS+4                                                00597000
TCBABWF  EQU   TCBFLGS5                                                 00598000
TCBJPQ   EQU   TCB+44                                                   00599000
TCBPURGE EQU   TCBJPQ                                                   00600000
TCBGRS   EQU   TCB+48                                                   00601000
TCBFSA   EQU   TCB+112                                                  00602000
TCBTME   EQU   TCB+120                                                  00603000
TCBJSTCB EQU   TCB+124                                                  00604000
TCBTSFLG EQU   TCB+148                                                  00605000
TCBTSTSK EQU   TCBTSFLG                                                 00606000
TCBSTAB  EQU   TCB+160                                                  00607000
TCBNSTAE EQU   TCBSTAB                                                  00608000
TCBTCT   EQU   TCB+164                                                  00609000
TCBTCTGF EQU   TCBTCT                                                   00610000
TCBSCNDY EQU   TCB+172                                                  00611000
TCBNDSP  EQU   TCBSCNDY                                                 00612000
TCBNDSP1 EQU   TCBNDSP+1                                                00613000
TCBNDSP2 EQU   TCBNDSP+2                                                00614000
TCBNDSP3 EQU   TCBNDSP+3                                                00615000
TCBJSCB  EQU   TCB+180                                                  00616000
TCBRECDE EQU   TCBJSCB                                                  00617000
TCBEXT1  EQU   TCB+196                                                  00618000
TCBBITS  EQU   TCB+200                                                  00619000
TCBNDSP4 EQU   TCBBITS                                                  00620000
TCBNDSP5 EQU   TCBBITS+1                                                00621000
TCBFLGS6 EQU   TCBBITS+2                                                00622000
TCBFLGS7 EQU   TCBBITS+3                                                00623000
TCBDAR   EQU   TCB+204                                                  00624000
TCBDARC  EQU   TCBDAR                                                   00625000
TCBEXT2  EQU   TCB+208                                                  00626000
TCBFOE   EQU   TCB+244                                                  00627000
TCBESTAE EQU   TCB+264                                                  00628000
TCBESTRM EQU   TCBESTAE+1                                               00629000
TCBFBYT1 EQU   TCB+276                                                  00630000
TCBFBYT2 EQU   TCB+277                                                  00631000
TCBRV124 EQU   TCB+278                                                  00632000
TCBRV133 EQU   TCB+279                                                  00633000
TCBXTNT2 EQU   0                                                        00634000
TCBGTF   EQU   TCBXTNT2                                                 00635000
TCBTFLG  EQU   TCBGTF                                                   00636000
TCBRV146 EQU   TCBXTNT2+28                                              00637000
TCBRV155 EQU   TCBXTNT2+29                                              00638000
TCBRV164 EQU   TCBXTNT2+30                                              00639000
TCBRV173 EQU   TCBXTNT2+31                                              00640000
TIOT1    EQU   0                                                        00641000
TIOCNJOB EQU   TIOT1                                                    00642000
TIOCSTEP EQU   TIOT1+8                                                  00643000
CVTMAP   EQU   0                                                        00644000
CVTDAR   EQU   CVTMAP+72                                                00645000
CVTFLGS1 EQU   CVTDAR                                                   00646000
CVTDCB   EQU   CVTMAP+116                                               00647000
CVTIERLC EQU   CVTMAP+144                                               00648000
CVTOPTA  EQU   CVTMAP+182                                               00649000
CVTOPTB  EQU   CVTMAP+183                                               00650000
CVTGTF   EQU   CVTMAP+236                                               00651000
CVTGTFST EQU   CVTGTF                                                   00652000
CVTGTFS  EQU   CVTGTFST                                                 00653000
CVTSTATE EQU   CVTGTFST                                                 00654000
CVTTMODE EQU   CVTGTFST                                                 00655000
CVTFORM  EQU   CVTGTFST                                                 00656000
CVTAQAVT EQU   CVTMAP+240                                               00657000
CVTTCMFG EQU   CVTAQAVT                                                 00658000
CVTVOLM2 EQU   CVTMAP+244                                               00659000
CVTTATA  EQU   CVTVOLM2                                                 00660000
CVTTSKS  EQU   CVTTATA                                                  00661000
CVTVOLF2 EQU   CVTTSKS                                                  00662000
CVTTAT   EQU   CVTTATA+1                                                00663000
CVTATER  EQU   CVTMAP+248                                               00664000
CVTEXT1  EQU   CVTMAP+252                                               00665000
CVTPURG  EQU   CVTMAP+260                                               00666000
CVTQMSG  EQU   CVTMAP+268                                               00667000
CVTDMSR  EQU   CVTMAP+272                                               00668000
CVTRSV37 EQU   CVTDMSR                                                  00669000
CVTDMSRF EQU   CVTRSV37                                                 00670000
CVTERPV  EQU   CVTMAP+316                                               00671000
CVTINTLA EQU   CVTMAP+320                                               00672000
CVTAPF   EQU   CVTMAP+324                                               00673000
CVTEXT2  EQU   CVTMAP+328                                               00674000
CVTHJES  EQU   CVTMAP+332                                               00675000
CVTPGSIA EQU   CVTMAP+348                                               00676000
CVTA1F1  EQU   CVTMAP+356                                               00677000
CVTSYSK  EQU   CVTMAP+357                                               00678000
CVTVOLM1 EQU   CVTMAP+380                                               00679000
CVTVOLF1 EQU   CVTVOLM1                                                 00680000
CVTATMCT EQU   CVTMAP+388                                               00681000
CVTXTNT1 EQU   0                                                        00682000
CVTXTNT2 EQU   0                                                        00683000
CVTDSSV  EQU   CVTXTNT2                                                 00684000
CVTFLGBT EQU   CVTXTNT2+5                                               00685000
CVTQID   EQU   CVTXTNT2+24                                              00686000
CVTSHS   EQU   CVTXTNT2+40                                              00687000
CVTRV400 EQU   CVTXTNT2+52                                              00688000
CVTRV409 EQU   CVTXTNT2+53                                              00689000
CVTATCVT EQU   CVTXTNT2+64                                              00690000
CVTRV429 EQU   CVTXTNT2+84                                              00691000
CVTRV438 EQU   CVTXTNT2+85                                              00692000
CVTRV457 EQU   CVTXTNT2+112                                             00693000
CVTRV466 EQU   CVTXTNT2+113                                             00694000
CVTFIX   EQU   0                                                        00695000
CVTRELNO EQU   CVTFIX+252                                               00696000
ISTPAB   EQU   0                                                        00697000
PABWQCHN EQU   ISTPAB                                                   00698000
PABWEQA  EQU   PABWQCHN                                                 00699000
PABCHAIN EQU   PABWQCHN+4                                               00700000
PABRPHFG EQU   ISTPAB+12                                                00701000
PABFLAGS EQU   PABRPHFG                                                 00702000
PABERLCK EQU   PABFLAGS                                                 00703000
PABERRLK EQU   PABERLCK                                                 00704000
ISTDYPAB EQU   0                                                        00705000
ISTMPST  EQU   0                                                        00706000
MPSRSV07 EQU   ISTMPST+4                                                00707000
MPSRQUE  EQU   ISTMPST+8                                                00708000
MPSFLGA  EQU   ISTMPST+12                                               00709000
MPSASID  EQU   MPSFLGA+2                                                00710000
MPSCRA   EQU   ISTMPST+24                                               00711000
MPSCRACT EQU   MPSCRA+4                                                 00712000
MPSSRB   EQU   ISTMPST+32                                               00713000
MPSSRBCT EQU   MPSSRB+4                                                 00714000
MPSCRPL  EQU   ISTMPST+40                                               00715000
MPSRPLCT EQU   MPSCRPL+4                                                00716000
MPSDBTBL EQU   ISTMPST+124                                              00717000
ISTDCE   EQU   0                                                        00718000
DCEDBPTR EQU   ISTDCE                                                   00719000
DCECHN   EQU   ISTDCE+4                                                 00720000
ISTLOK   EQU   0                                                        00721000
LOKCHN   EQU   ISTLOK+1                                                 00722000
LOKCHNG  EQU   LOKCHN                                                   00723000
@NM00060 EQU   LOKCHNG+2                                                00724000
ISTACDEB EQU   0                                                        00725000
ACDVTPRX EQU   ISTACDEB                                                 00726000
ACDDBPFX EQU   ISTACDEB+16                                              00727000
ACDTBLOF EQU   ACDDBPFX+6                                               00728000
ACDBASIC EQU   ISTACDEB+24                                              00729000
ACDTCBAD EQU   ACDBASIC                                                 00730000
ACDNMSUB EQU   ACDTCBAD                                                 00731000
ACDTCB   EQU   ACDTCBAD+1                                               00732000
ACDDEBAD EQU   ACDBASIC+4                                               00733000
ACDUSRPG EQU   ACDBASIC+16                                              00734000
ACDACBAD EQU   ACDBASIC+24                                              00735000
ACDAPPAD EQU   ACDBASIC+28                                              00736000
ACDVTAM  EQU   ISTACDEB+56                                              00737000
ACDRDTE  EQU   ACDVTAM+4                                                00738000
ACDSSFLG EQU   ACDVTAM+80                                               00739000
ACDAPDAT EQU   ACDVTAM+83                                               00740000
ISTDEVCH EQU   0                                                        00741000
DEVSHCH  EQU   ISTDEVCH                                                 00742000
DEVCHAR  EQU   DEVSHCH                                                  00743000
DEVTCODE EQU   ISTDEVCH+1                                               00744000
DEVFLAGS EQU   ISTDEVCH+3                                               00745000
DEVFCCTL EQU   DEVFLAGS                                                 00746000
DEVCHAR3 EQU   DEVFLAGS                                                 00747000
ISTRPRE  EQU   0                                                        00748000
RPRNAME  EQU   ISTRPRE                                                  00749000
RPRCOMID EQU   ISTRPRE+8                                                00750000
RPRFLAGA EQU   ISTRPRE+21                                               00751000
RPRFLAGB EQU   ISTRPRE+22                                               00752000
RPRONLIN EQU   RPRFLAGB                                                 00753000
RPRCAUSE EQU   ISTRPRE+23                                               00754000
RPRLGONF EQU   ISTRPRE+28                                               00755000
RPRFLAGD EQU   ISTRPRE+61                                               00756000
RPRFLAGC EQU   ISTRPRE+62                                               00757000
ISTRCPRE EQU   0                                                        00758000
RCPPMODE EQU   ISTRCPRE+91                                              00759000
RCPLGNIN EQU   ISTRCPRE+92                                              00760000
ISTRDT   EQU   0                                                        00761000
RDTPLEN  EQU   ISTRDT+72                                                00762000
RDTPRIOR EQU   RDTPLEN                                                  00763000
RDTFLAGB EQU   ISTRDT+91                                                00764000
RDTVYRPH EQU   ISTRDT+108                                               00765000
RDTSTCNT EQU   ISTRDT+112                                               00766000
ISTRAP   EQU   0                                                        00767000
RAPACDEB EQU   ISTRAP+76                                                00768000
RAPFLG   EQU   ISTRAP+108                                               00769000
RAPFLGB  EQU   ISTRAP+109                                               00770000
RAPFLGC  EQU   ISTRAP+110                                               00771000
ISTRLC   EQU   0                                                        00772000
RLCADR   EQU   ISTRLC+72                                                00773000
RLCFLAG  EQU   RLCADR                                                   00774000
ISTRRN   EQU   0                                                        00775000
RRNADR   EQU   ISTRRN+136                                               00776000
RRNFLAG  EQU   RRNADR                                                   00777000
RRNUCBAD EQU   RRNADR+1                                                 00778000
RRNRDF   EQU   ISTRRN+172                                               00779000
RRNRDFA  EQU   RRNRDF                                                   00780000
RRNRDFB  EQU   RRNRDF+1                                                 00781000
RRNCMF   EQU   ISTRRN+176                                               00782000
RRNCMFA  EQU   RRNCMF                                                   00783000
RRNCMFB  EQU   RRNCMF+1                                                 00784000
RRNCMFC  EQU   RRNCMF+2                                                 00785000
RRNCMFD  EQU   RRNCMF+3                                                 00786000
RRNNMDPD EQU   ISTRRN+192                                               00787000
RRNHPRE  EQU   ISTRRN+216                                               00788000
ISTRGP   EQU   0                                                        00789000
RGPFLG   EQU   ISTRGP+72                                                00790000
ISTRLN   EQU   0                                                        00791000
RLNADR   EQU   ISTRLN+72                                                00792000
RLNFLAG  EQU   RLNADR                                                   00793000
RLNUCBAD EQU   RLNADR+1                                                 00794000
RLNSTAT1 EQU   ISTRLN+86                                                00795000
RLNSTAT2 EQU   ISTRLN+87                                                00796000
RLNRDF   EQU   ISTRLN+88                                                00797000
RLNRDFA  EQU   RLNRDF                                                   00798000
RLNRACNT EQU   RLNRDFA                                                  00799000
RLNRDFB  EQU   RLNRDF+1                                                 00800000
RLNCRFLG EQU   ISTRLN+102                                               00801000
RLNLSCMD EQU   RLNCRFLG                                                 00802000
ISTRPT   EQU   0                                                        00803000
RPTLNCID EQU   ISTRPT+116                                               00804000
RPTDITT  EQU   ISTRPT+128                                               00805000
RPTFLAG1 EQU   ISTRPT+140                                               00806000
ISTRCL   EQU   0                                                        00807000
RCLADR   EQU   ISTRCL+72                                                00808000
RCLFLAG  EQU   RCLADR                                                   00809000
ISTRTR   EQU   0                                                        00810000
RTRADR   EQU   ISTRTR+124                                               00811000
RTRFLAG  EQU   RTRADR                                                   00812000
RTRRDFA  EQU   ISTRTR+136                                               00813000
RTRRAALL EQU   RTRRDFA                                                  00814000
RTRRDFB  EQU   ISTRTR+137                                               00815000
RTRRDFC  EQU   ISTRTR+138                                               00816000
RTRRDFD  EQU   ISTRTR+139                                               00817000
RTRRDFE  EQU   ISTRTR+140                                               00818000
RTRRDFF  EQU   ISTRTR+141                                               00819000
RTRCRFLG EQU   ISTRTR+143                                               00820000
RTRLSCMD EQU   RTRCRFLG                                                 00821000
RTRBSCID EQU   ISTRTR+188                                               00822000
ISTRIN   EQU   0                                                        00823000
RINDFD   EQU   ISTRIN+124                                               00824000
RINREMPO EQU   RINDFD                                                   00825000
RINNODEF EQU   RINDFD                                                   00826000
RINLDISC EQU   RINDFD                                                   00827000
RINNODID EQU   ISTRIN+125                                               00828000
RINRLDAF EQU   ISTRIN+126                                               00829000
RINREMOT EQU   ISTRIN+128                                               00830000
RINVPAB  EQU   ISTRIN+132                                               00831000
RINRPHCN EQU   ISTRIN+136                                               00832000
RINNCSPL EQU   ISTRIN+140                                               00833000
RINCNCNT EQU   ISTRIN+144                                               00834000
ISTRDS   EQU   0                                                        00835000
ISTDOT   EQU   0                                                        00836000
ISTRCC   EQU   0                                                        00837000
RCCFLAG  EQU   ISTRCC+73                                                00838000
RCCFLAGB EQU   ISTRCC+74                                                00839000
RCCSTAID EQU   ISTRCC+78                                                00840000
RCCID48  EQU   RCCSTAID+2                                               00841000
RCCCRFLG EQU   ISTRCC+108                                               00842000
ISTRLU   EQU   0                                                        00843000
RLUFLAG  EQU   ISTRLU+125                                               00844000
RLUCRFLG EQU   ISTRLU+126                                               00845000
RLUPACE  EQU   ISTRLU+132                                               00846000
RLUNCPPC EQU   ISTRLU+134                                               00847000
RLUUSSTB EQU   ISTRLU+140                                               00848000
RLUMODET EQU   ISTRLU+152                                               00849000
ISTRPX   EQU   0                                                        00850000
ISTRLX   EQU   0                                                        00851000
RLXFLAGA EQU   ISTRLX+76                                                00852000
ISTRSW   EQU   0                                                        00853000
ISTRDA   EQU   0                                                        00854000
RDAADR   EQU   ISTRDA+72                                                00855000
RDAFLAG  EQU   RDAADR                                                   00856000
RDAUCBAD EQU   RDAADR+1                                                 00857000
ISTRLS   EQU   0                                                        00858000
ISTDNT   EQU   0                                                        00859000
ISTGNT   EQU   0                                                        00860000
ISTPAT   EQU   0                                                        00861000
PATFLAGA EQU   ISTPAT+7                                                 00862000
ISTRPH   EQU   0                                                        00863000
RPHCNTL  EQU   ISTRPH                                                   00864000
RPHFLAGS EQU   RPHCNTL+2                                                00865000
RPHAPTYP EQU   RPHFLAGS                                                 00866000
RPHFSTLC EQU   RPHFLAGS                                                 00867000
RPHFLGB  EQU   RPHCNTL+3                                                00868000
RPHRPHA  EQU   ISTRPH+4                                                 00869000
RPHTSKID EQU   ISTRPH+8                                                 00870000
RPHRESMA EQU   ISTRPH+16                                                00871000
RPHWPFLG EQU   RPHRESMA                                                 00872000
RPHWEA   EQU   ISTRPH+24                                                00873000
RPHCSPA  EQU   RPHWEA                                                   00874000
RPHSRPRM EQU   ISTRPH+28                                                00875000
RPHPABQA EQU   ISTRPH+36                                                00876000
RPHWORK  EQU   ISTRPH+40                                                00877000
RPHSAVE1 EQU   RPHWORK                                                  00878000
RPHSBITS EQU   RPHSAVE1+1                                               00879000
ISTATCVT EQU   0                                                        00880000
ATCCOM   EQU   ISTATCVT                                                 00881000
ATCSTAT  EQU   ATCCOM                                                   00882000
ATCSTAT1 EQU   ATCSTAT                                                  00883000
ATCSTFLG EQU   ATCSTAT+1                                                00884000
ATCPOFLG EQU   ATCSTAT+2                                                00885000
ATCSTAT4 EQU   ATCSTAT+3                                                00886000
ATCIOTRC EQU   ATCCOM+140                                               00887000
ATCTHTRC EQU   ATCIOTRC                                                 00888000
ATCCSMR  EQU   ISTATCVT+296                                             00889000
ATCSHRFG EQU   ISTATCVT+316                                             00890000
ATCMSGP  EQU   ISTATCVT+344                                             00891000
ATCHPGM  EQU   ISTATCVT+384                                             00892000
ATCVLCNT EQU   ISTATCVT+772                                             00893000
ATCRNO   EQU   ISTATCVT+788                                             00894000
ATCSOPD  EQU   ISTATCVT+792                                             00895000
ATCSIPD  EQU   ISTATCVT+800                                             00896000
ATCSECST EQU   ISTATCVT+812                                             00897000
ATCSTAT2 EQU   ISTATCVT+818                                             00898000
ATCVTBAM EQU   ISTATCVT+908                                             00899000
@NM00077 EQU   ATCVTBAM+3                                               00900000
ATCAOSM  EQU   ISTATCVT+912                                             00901000
ATCGSRBQ EQU   ATCAOSM+4                                                00902000
ATCGSRBG EQU   ATCGSRBQ                                                 00903000
ATCICAPP EQU   ATCAOSM+100                                              00904000
ATCLDAPP EQU   ATCAOSM+120                                              00905000
ATCDAPVT EQU   ATCAOSM+140                                              00906000
ATCCRA   EQU   ATCAOSM+280                                              00907000
ATCCRACN EQU   ATCCRA+4                                                 00908000
ATCSRB   EQU   ATCAOSM+288                                              00909000
ATCSRBCN EQU   ATCSRB+4                                                 00910000
ATCCRPL  EQU   ATCAOSM+296                                              00911000
ATCRPLCN EQU   ATCCRPL+4                                                00912000
ATCVTFLG EQU   ATCAOSM+392                                              00913000
ATCZFLAG EQU   ATCAOSM+588                                              00914000
RMWA     EQU   0                                                        00915000
RMWAFLG1 EQU   RMWA                                                     00916000
RMWAFLG2 EQU   RMWA+1                                                   00917000
RMWACCRA EQU   RMWA+8                                                   00918000
MPSTFND2 EQU   RMWA+24                                                  00919000
PLAREAPT EQU   RMWA+28                                                  00920000
RMSGPTR  EQU   RMWA+32                                                  00921000
MSGOUT   EQU   RMWA+40                                                  00922000
MAPPL    EQU   MSGOUT                                                   00923000
MSGW     EQU   MSGOUT+8                                                 00924000
MSGX     EQU   MSGOUT+16                                                00925000
@NM00083 EQU   0                                                        00926000
CMZID002 EQU   @NM00083                                                 00927000
@NM00084 EQU   @NM00083+4                                               00928000
CMZRL002 EQU   @NM00084                                                 00929000
CMZRA002 EQU   @NM00084+1                                               00930000
CMZEA002 EQU   @NM00083+8                                               00931000
CMZVP002 EQU   @NM00083+12                                              00932000
CMZSA002 EQU   0                                                        00933000
CMTA002  EQU   0                                                        00934000
@NM00085 EQU   0                                                        00935000
CMZID011 EQU   @NM00085                                                 00936000
@NM00086 EQU   @NM00085+4                                               00937000
CMZRL011 EQU   @NM00086                                                 00938000
CMZRA011 EQU   @NM00086+1                                               00939000
CMZEA011 EQU   @NM00085+8                                               00940000
CMZVP011 EQU   @NM00085+12                                              00941000
CMZSA011 EQU   0                                                        00942000
CMTA011  EQU   0                                                        00943000
REGSAVE  EQU   0                                                        00944000
TIOENTRY EQU   TIOT1+24                                                 00945000
TIOESTTA EQU   TIOENTRY+1                                               00946000
TIOERLOC EQU   TIOENTRY+2                                               00947000
TIOELINK EQU   TIOERLOC+1                                               00948000
TIOESYOT EQU   TIOELINK                                                 00949000
TIOESTTC EQU   TIOENTRY+15                                              00950000
TIOESTTB EQU   TIOENTRY+16                                              00951000
POOLSTAR EQU   TIOENTRY+20                                              00952000
TIOEDEVE EQU   TIOESTTB                                                 00953000
TIOSTTB  EQU   TIOEDEVE                                                 00954000
CVTS01   EQU   CVTPGSIA                                                 00955000
CVTLPDIA EQU   CVTS01+12                                                00956000
CVTDIRST EQU   CVTLPDIA                                                 00957000
CVTSLIDA EQU   CVTS01+24                                                00958000
CVTCTLFG EQU   CVTS01+50                                                00959000
CVTSDMP  EQU   CVTS01+232                                               00960000
CVTRV210 EQU   CVTS01+424                                               00961000
CVTRV219 EQU   CVTS01+425                                               00962000
CVTRV228 EQU   CVTS01+426                                               00963000
CVTRV237 EQU   CVTS01+427                                               00964000
CVTMFRTR EQU   CVTS01+452                                               00965000
CVTRV262 EQU   CVTS01+468                                               00966000
CVTRV271 EQU   CVTS01+469                                               00967000
CVTRV280 EQU   CVTS01+470                                               00968000
CVTRV289 EQU   CVTS01+471                                               00969000
CVTGSDA  EQU   CVTS01+600                                               00970000
RTRDNCBA EQU   ISTRTR+40                                                00971000
SRB      EQU   SRBSECT                                                  00972000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00973000
CVTRV628 EQU   CVTS01+728                                               00974000
CVTRV627 EQU   CVTS01+724                                               00975000
CVTRV626 EQU   CVTS01+720                                               00976000
CVTRV625 EQU   CVTS01+716                                               00977000
CVTRV624 EQU   CVTS01+712                                               00978000
CVTRV623 EQU   CVTS01+708                                               00979000
CVTRV622 EQU   CVTS01+704                                               00980000
CVTRV621 EQU   CVTS01+700                                               00981000
CVTRV620 EQU   CVTS01+696                                               00982000
CVTRV619 EQU   CVTS01+692                                               00983000
CVTRV618 EQU   CVTS01+688                                               00984000
CVTRV617 EQU   CVTS01+684                                               00985000
CVTRV616 EQU   CVTS01+680                                               00986000
CVTRV615 EQU   CVTS01+676                                               00987000
CVTRV614 EQU   CVTS01+672                                               00988000
CVTRV613 EQU   CVTS01+668                                               00989000
CVTTCASP EQU   CVTS01+664                                               00990000
CVT0PT03 EQU   CVTS01+660                                               00991000
CVT0PT0E EQU   CVTS01+656                                               00992000
CVTIRM   EQU   CVTS01+652                                               00993000
CVTCGK   EQU   CVTS01+648                                               00994000
CVTRV607 EQU   CVTS01+644                                               00995000
CVTRV606 EQU   CVTS01+640                                               00996000
CVTRV605 EQU   CVTS01+636                                               00997000
CVTRV604 EQU   CVTS01+632                                               00998000
CVTEFF02 EQU   CVTS01+628                                               00999000
CVTCBBR  EQU   CVTS01+624                                               01000000
CVTSSCR  EQU   CVTS01+620                                               01001000
CVTEVENT EQU   CVTS01+616                                               01002000
CVTCRCA  EQU   CVTS01+612                                               01003000
CVTTPIO  EQU   CVTS01+608                                               01004000
CVTADV   EQU   CVTS01+604                                               01005000
CVTGSDAB EQU   CVTGSDA                                                  01006000
CVTQV3   EQU   CVTS01+596                                               01007000
CVTQV2   EQU   CVTS01+592                                               01008000
CVTQV1   EQU   CVTS01+588                                               01009000
CVTRPT   EQU   CVTS01+584                                               01010000
CVTSSRB  EQU   CVTS01+580                                               01011000
CVTCSDRL EQU   CVTS01+576                                               01012000
CVTEXP1  EQU   CVTS01+572                                               01013000
CVTRMPMT EQU   CVTS01+568                                               01014000
CVTRMPTT EQU   CVTS01+564                                               01015000
CVTVPSA  EQU   CVTS01+560                                               01016000
CVTVSTOP EQU   CVTS01+556                                               01017000
CVTGTFR8 EQU   CVTS01+552                                               01018000
CVTQUIT  EQU   CVTS01+548                                               01019000
CVTVACR  EQU   CVTS01+544                                               01020000
CVTWTCB  EQU   CVTS01+540                                               01021000
CVTSTPRS EQU   CVTS01+536                                               01022000
CVT0PT02 EQU   CVTS01+532                                               01023000
CVTDARCM EQU   CVTS01+528                                               01024000
CVTIRECM EQU   CVTS01+524                                               01025000
CVTJRECM EQU   CVTS01+520                                               01026000
CVTVEMS0 EQU   CVTS01+516                                               01027000
CVTSPFRR EQU   CVTS01+512                                               01028000
CVTRLSTG EQU   CVTS01+508                                               01029000
CVT0TC0A EQU   CVTS01+504                                               01030000
CVTGMBR  EQU   CVTS01+500                                               01031000
CVTLFRM  EQU   CVTS01+496                                               01032000
CVTRMBR  EQU   CVTS01+492                                               01033000
CVTVIOP  EQU   CVTS01+488                                               01034000
CVTRV307 EQU   CVTS01+486                                               01035000
CVTRV306 EQU   CVTS01+484                                               01036000
CVTRV305 EQU   CVTS01+482                                               01037000
CVTRV304 EQU   CVTS01+480                                               01038000
CVTRV303 EQU   CVTS01+478                                               01039000
CVTRV302 EQU   CVTS01+476                                               01040000
CVTTRCA  EQU   CVTS01+472                                               01041000
CVTRV297 EQU   CVTRV289                                                 01042000
CVTRV296 EQU   CVTRV289                                                 01043000
CVTRV295 EQU   CVTRV289                                                 01044000
CVTRV294 EQU   CVTRV289                                                 01045000
CVTRV293 EQU   CVTRV289                                                 01046000
CVTRV292 EQU   CVTRV289                                                 01047000
CVTRV291 EQU   CVTRV289                                                 01048000
CVTRV290 EQU   CVTRV289                                                 01049000
CVTRV288 EQU   CVTRV280                                                 01050000
CVTRV287 EQU   CVTRV280                                                 01051000
CVTRV286 EQU   CVTRV280                                                 01052000
CVTRV285 EQU   CVTRV280                                                 01053000
CVTRV284 EQU   CVTRV280                                                 01054000
CVTRV283 EQU   CVTRV280                                                 01055000
CVTRV282 EQU   CVTRV280                                                 01056000
CVTRV281 EQU   CVTRV280                                                 01057000
CVTRV279 EQU   CVTRV271                                                 01058000
CVTRV278 EQU   CVTRV271                                                 01059000
CVTRV277 EQU   CVTRV271                                                 01060000
CVTRV276 EQU   CVTRV271                                                 01061000
CVTRV275 EQU   CVTRV271                                                 01062000
CVTRV274 EQU   CVTRV271                                                 01063000
CVTRV273 EQU   CVTRV271                                                 01064000
CVTRV272 EQU   CVTRV271                                                 01065000
CVTRV270 EQU   CVTRV262                                                 01066000
CVTRV269 EQU   CVTRV262                                                 01067000
CVTRV268 EQU   CVTRV262                                                 01068000
CVTRV267 EQU   CVTRV262                                                 01069000
CVTRV266 EQU   CVTRV262                                                 01070000
CVTRV265 EQU   CVTRV262                                                 01071000
CVTRV264 EQU   CVTRV262                                                 01072000
CVTRV263 EQU   CVTRV262                                                 01073000
CVTVFP   EQU   CVTS01+464                                               01074000
CVTVSI   EQU   CVTS01+460                                               01075000
CVTVPSIB EQU   CVTS01+456                                               01076000
CVTMFACT EQU   CVTMFRTR                                                 01077000
CVTMFCTL EQU   CVTS01+448                                               01078000
CVTPVBP  EQU   CVTS01+444                                               01079000
CVTPWI   EQU   CVTS01+440                                               01080000
CVTRV254 EQU   CVTS01+438                                               01081000
CVTRV253 EQU   CVTS01+436                                               01082000
CVTRV252 EQU   CVTS01+434                                               01083000
CVTRV251 EQU   CVTS01+433                                               01084000
CVTRV250 EQU   CVTS01+432                                               01085000
CVTRV249 EQU   CVTS01+431                                               01086000
CVTRV248 EQU   CVTS01+430                                               01087000
CVTRV247 EQU   CVTS01+429                                               01088000
CVTRV246 EQU   CVTS01+428                                               01089000
CVTRV245 EQU   CVTRV237                                                 01090000
CVTRV244 EQU   CVTRV237                                                 01091000
CVTRV243 EQU   CVTRV237                                                 01092000
CVTRV242 EQU   CVTRV237                                                 01093000
CVTRV241 EQU   CVTRV237                                                 01094000
CVTRV240 EQU   CVTRV237                                                 01095000
CVTRV239 EQU   CVTRV237                                                 01096000
CVTRV238 EQU   CVTRV237                                                 01097000
CVTRV236 EQU   CVTRV228                                                 01098000
CVTRV235 EQU   CVTRV228                                                 01099000
CVTRV234 EQU   CVTRV228                                                 01100000
CVTRV233 EQU   CVTRV228                                                 01101000
CVTRV232 EQU   CVTRV228                                                 01102000
CVTRV231 EQU   CVTRV228                                                 01103000
CVTRV230 EQU   CVTRV228                                                 01104000
CVTRV229 EQU   CVTRV228                                                 01105000
CVTRV227 EQU   CVTRV219                                                 01106000
CVTRV226 EQU   CVTRV219                                                 01107000
CVTRV225 EQU   CVTRV219                                                 01108000
CVTRV224 EQU   CVTRV219                                                 01109000
CVTRV223 EQU   CVTRV219                                                 01110000
CVTRV222 EQU   CVTRV219                                                 01111000
CVTRV221 EQU   CVTRV219                                                 01112000
CVTRV220 EQU   CVTRV219                                                 01113000
CVTRV218 EQU   CVTRV210                                                 01114000
CVTRV217 EQU   CVTRV210                                                 01115000
CVTRV216 EQU   CVTRV210                                                 01116000
CVTRV215 EQU   CVTRV210                                                 01117000
CVTRV214 EQU   CVTRV210                                                 01118000
CVTRV213 EQU   CVTRV210                                                 01119000
CVTRV212 EQU   CVTRV210                                                 01120000
CVTRV211 EQU   CVTRV210                                                 01121000
CVTLCCAT EQU   CVTS01+420                                               01122000
CVTPCCAT EQU   CVTS01+416                                               01123000
CVTIPCRP EQU   CVTS01+412                                               01124000
CVTIPCRI EQU   CVTS01+408                                               01125000
CVTIPCDS EQU   CVTS01+404                                               01126000
CVTAIDVT EQU   CVTS01+400                                               01127000
CVTSSAP  EQU   CVTS01+396                                               01128000
CVTEHCIR EQU   CVTS01+392                                               01129000
CVTEHDEF EQU   CVTS01+388                                               01130000
CVTDAIR  EQU   CVTS01+384                                               01131000
CVTPERFM EQU   CVTS01+380                                               01132000
CVT044R2 EQU   CVTS01+376                                               01133000
CVTFETCH EQU   CVTS01+372                                               01134000
CVTRSTWD EQU   CVTS01+368                                               01135000
CVTSPOST EQU   CVTS01+364                                               01136000
CVTIOBP  EQU   CVTS01+360                                               01137000
CVTASMVT EQU   CVTS01+356                                               01138000
CVTRECRQ EQU   CVTS01+352                                               01139000
CVTWSAC  EQU   CVTS01+348                                               01140000
CVTRV149 EQU   CVTS01+344                                               01141000
CVTWSAL  EQU   CVTS01+340                                               01142000
CVTSPSA  EQU   CVTS01+336                                               01143000
CVTGLMN  EQU   CVTS01+332                                               01144000
CVTVEAC0 EQU   CVTS01+328                                               01145000
CVT062R1 EQU   CVTS01+324                                               01146000
CVTRPOST EQU   CVTS01+320                                               01147000
CVTDQIQE EQU   CVTS01+316                                               01148000
CVTCSD   EQU   CVTS01+312                                               01149000
CVTLKRMA EQU   CVTS01+308                                               01150000
CVTRSPIE EQU   CVTS01+304                                               01151000
CVTRENQ  EQU   CVTS01+300                                               01152000
CVTLQCB  EQU   CVTS01+296                                               01153000
CVTFQCB  EQU   CVTS01+292                                               01154000
CVTQCS01 EQU   CVTS01+288                                               01155000
CVTAPFT  EQU   CVTS01+284                                               01156000
CVTPARRL EQU   CVTS01+280                                               01157000
CVTVWAIT EQU   CVTS01+276                                               01158000
CVTGSPL  EQU   CVTS01+272                                               01159000
CVTLSMQ  EQU   CVTS01+268                                               01160000
CVTGSMQ  EQU   CVTS01+264                                               01161000
CVTEXPRO EQU   CVTS01+260                                               01162000
CVTOPCTP EQU   CVTS01+256                                               01163000
CVTSIC   EQU   CVTS01+252                                               01164000
CVTTPIOS EQU   CVTS01+248                                               01165000
CVTRTMS  EQU   CVTS01+244                                               01166000
CVTSDBF  EQU   CVTS01+240                                               01167000
CVTSCBP  EQU   CVTS01+236                                               01168000
CVTSV60  EQU   CVTS01+228                                               01169000
CVTRTMCT EQU   CVTS01+224                                               01170000
CVTASCBL EQU   CVTS01+220                                               01171000
CVTASCBH EQU   CVTS01+216                                               01172000
CVTGDA   EQU   CVTS01+212                                               01173000
CVTASVT  EQU   CVTS01+208                                               01174000
CVTVVMDI EQU   CVTS01+204                                               01175000
CVTAQTOP EQU   CVTS01+200                                               01176000
CVTIOSCS EQU   CVTS01+196                                               01177000
CVTSDRM  EQU   CVTS01+192                                               01178000
CVTOPTE  EQU   CVTS01+188                                               01179000
CVTSTXU  EQU   CVTS01+184                                               01180000
CVTQUIS  EQU   CVTS01+180                                               01181000
CVTPARS  EQU   CVTS01+176                                               01182000
CVTS1EE  EQU   CVTS01+172                                               01183000
CVTFRAS  EQU   CVTS01+168                                               01184000
CVTQSAS  EQU   CVTS01+164                                               01185000
CVTCRAS  EQU   CVTS01+160                                               01186000
CVTCRMN  EQU   CVTS01+156                                               01187000
CVTDELCP EQU   CVTS01+152                                               01188000
CVTFRECL EQU   CVTS01+148                                               01189000
CVTGETCL EQU   CVTS01+144                                               01190000
CVTBLDCP EQU   CVTS01+140                                               01191000
CVTAUTHL EQU   CVTS01+136                                               01192000
CVTSCAN  EQU   CVTS01+132                                               01193000
CVTRV144 EQU   CVTS01+130                                               01194000
CVTMAXMP EQU   CVTS01+128                                               01195000
CVTSTCK  EQU   CVTS01+124                                               01196000
CVTRV139 EQU   CVTS01+123                                               01197000
CVTDSSAC EQU   CVTS01+122                                               01198000
CVTRV513 EQU   CVTS01+121                                               01199000
CVTIOSPL EQU   CVTS01+120                                               01200000
CVTPTGT  EQU   CVTS01+116                                               01201000
CVTCSPIE EQU   CVTS01+112                                               01202000
CVTSMFEX EQU   CVTS01+108                                               01203000
CVTOLT0A EQU   CVTS01+104                                               01204000
CVTSRBRT EQU   CVTS01+100                                               01205000
CVTPUTL  EQU   CVTS01+96                                                01206000
CVTASCRL EQU   CVTS01+92                                                01207000
CVTASCRF EQU   CVTS01+88                                                01208000
CVTRV326 EQU   CVTS01+84                                                01209000
CVTRV325 EQU   CVTS01+80                                                01210000
CVTRV324 EQU   CVTS01+76                                                01211000
CVT0VL01 EQU   CVTS01+72                                                01212000
CVTSHRVM EQU   CVTS01+68                                                01213000
CVTRV332 EQU   CVTS01+64                                                01214000
CVTTAS   EQU   CVTS01+60                                                01215000
CVTRSCN  EQU   CVTS01+56                                                01216000
CVTTRAC2 EQU   CVTS01+54                                                01217000
CVTTRACE EQU   CVTS01+52                                                01218000
CVTAPG   EQU   CVTS01+51                                                01219000
CVTSDTRC EQU   CVTCTLFG                                                 01220000
CVTGTRCE EQU   CVTCTLFG                                                 01221000
CVTNOMP  EQU   CVTCTLFG                                                 01222000
CVTRSV79 EQU   CVTCTLFG                                                 01223000
CVTDSTAT EQU   CVTCTLFG                                                 01224000
CVTRSV78 EQU   CVTCTLFG                                                 01225000
CVTRV333 EQU   CVTCTLFG                                                 01226000
CVTRV323 EQU   CVTCTLFG                                                 01227000
CVTSPVLK EQU   CVTS01+49                                                01228000
CVTRSV77 EQU   CVTS01+48                                                01229000
CVTRV331 EQU   CVTS01+44                                                01230000
CVTRV330 EQU   CVTS01+40                                                01231000
CVTRV329 EQU   CVTS01+36                                                01232000
CVTRV328 EQU   CVTS01+32                                                01233000
CVTRV322 EQU   CVTS01+28                                                01234000
CVTSLID  EQU   CVTSLIDA+1                                               01235000
CVTSYLK  EQU   CVTSLIDA                                                 01236000
CVTRV321 EQU   CVTS01+20                                                01237000
CVTRV320 EQU   CVTS01+16                                                01238000
CVTLPDIR EQU   CVTLPDIA+1                                               01239000
CVTRSV69 EQU   CVTDIRST                                                 01240000
CVTRSV68 EQU   CVTDIRST                                                 01241000
CVTRSV67 EQU   CVTDIRST                                                 01242000
CVTRSV66 EQU   CVTDIRST                                                 01243000
CVTRSV65 EQU   CVTDIRST                                                 01244000
CVTRSV64 EQU   CVTDIRST                                                 01245000
CVTRSV63 EQU   CVTDIRST                                                 01246000
CVTDICOM EQU   CVTDIRST                                                 01247000
CVTPVTP  EQU   CVTS01+8                                                 01248000
CVTLPDSR EQU   CVTS01+4                                                 01249000
CVTGETL  EQU   CVTS01                                                   01250000
TIOUCBP  EQU   TIOEDEVE+1                                               01251000
TIOVERF  EQU   TIOSTTB                                                  01252000
TIOUNLD  EQU   TIOSTTB                                                  01253000
TIOMNTD  EQU   TIOSTTB                                                  01254000
TIOSETU  EQU   TIOSTTB                                                  01255000
TIOVLSR  EQU   TIOSTTB                                                  01256000
TIOPVIO  EQU   TIOSTTB                                                  01257000
TIOREQD  EQU   TIOSTTB                                                  01258000
TIOUSED  EQU   TIOSTTB                                                  01259000
TIOTFEND EQU   POOLSTAR+16                                              01260000
TIOPSLOT EQU   POOLSTAR+13                                              01261000
TIOPSTTB EQU   POOLSTAR+12                                              01262000
TIOPPOOL EQU   POOLSTAR+4                                               01263000
TIOPNSRT EQU   POOLSTAR+3                                               01264000
@NM00056 EQU   POOLSTAR+2                                               01265000
TIOPNSLT EQU   POOLSTAR+1                                               01266000
@NM00055 EQU   POOLSTAR                                                 01267000
TIOEFSRT EQU   TIOENTRY+17                                              01268000
TIOSVERF EQU   TIOESTTB                                                 01269000
TIOSUNLD EQU   TIOESTTB                                                 01270000
TIOSMNTD EQU   TIOESTTB                                                 01271000
TIOSSETU EQU   TIOESTTB                                                 01272000
TIOSVLSR EQU   TIOESTTB                                                 01273000
TIOSPVIO EQU   TIOESTTB                                                 01274000
TIOSREQD EQU   TIOESTTB                                                 01275000
TIOSUSED EQU   TIOESTTB                                                 01276000
TIOSBALS EQU   TIOESTTC                                                 01277000
TIOSBALP EQU   TIOESTTC                                                 01278000
TIOSVOLS EQU   TIOESTTC                                                 01279000
TIOSVOLP EQU   TIOESTTC                                                 01280000
TIOSAFFS EQU   TIOESTTC                                                 01281000
TIOSAFFP EQU   TIOESTTC                                                 01282000
TIOSDEFR EQU   TIOESTTC                                                 01283000
TIOSDKCR EQU   TIOESTTC                                                 01284000
TIOEJFCB EQU   TIOENTRY+12                                              01285000
TIOEDDNM EQU   TIOENTRY+4                                               01286000
TIOTREM  EQU   TIOELINK                                                 01287000
TIOESSDS EQU   TIOESYOT                                                 01288000
TIOESYIN EQU   TIOELINK                                                 01289000
TIOEQNAM EQU   TIOELINK                                                 01290000
TIOEDYNM EQU   TIOELINK                                                 01291000
TIOTTERM EQU   TIOELINK                                                 01292000
TIOTRV01 EQU   TIOELINK                                                 01293000
TIOSYOUT EQU   TIOELINK                                                 01294000
TIOEWTCT EQU   TIOERLOC                                                 01295000
TIOSDSP2 EQU   TIOESTTA                                                 01296000
TIOSDSP1 EQU   TIOESTTA                                                 01297000
TIOSLABL EQU   TIOESTTA                                                 01298000
TIOSDADS EQU   TIOESTTA                                                 01299000
TIOSJBLB EQU   TIOESTTA                                                 01300000
TIOSPLTS EQU   TIOESTTA                                                 01301000
TIOSPLTP EQU   TIOESTTA                                                 01302000
TIOSLTYP EQU   TIOESTTA                                                 01303000
TIOELNGH EQU   TIOENTRY                                                 01304000
RMWASPTR EQU   RMWA+36                                                  01305000
RMWAR13  EQU   RMWA+20                                                  01306000
DCECHNSV EQU   RMWA+16                                                  01307000
RMWACDCE EQU   RMWA+12                                                  01308000
RMWARADR EQU   RMWA+4                                                   01309000
@NM00082 EQU   RMWA+2                                                   01310000
@NM00081 EQU   RMWAFLG2                                                 01311000
DCECPLT  EQU   RMWAFLG2                                                 01312000
LOCKFREE EQU   RMWAFLG2                                                 01313000
ENTERMA2 EQU   RMWAFLG2                                                 01314000
@NM00080 EQU   RMWAFLG1                                                 01315000
RMWAFCRA EQU   RMWAFLG1                                                 01316000
ESTAFAIL EQU   RMWAFLG1                                                 01317000
IRB2SET  EQU   RMWAFLG1                                                 01318000
IRB1SET  EQU   RMWAFLG1                                                 01319000
CALLCLOS EQU   RMWAFLG1                                                 01320000
VTDEBFND EQU   RMWAFLG1                                                 01321000
ENTERMA1 EQU   RMWAFLG1                                                 01322000
ATCAOS   EQU   ISTATCVT+1584                                            01323000
ATCPOPAB EQU   ATCAOSM+640                                              01324000
ATCVIOPM EQU   ATCAOSM+636                                              01325000
ATCTPMMI EQU   ATCAOSM+632                                              01326000
ATCTPMPB EQU   ATCAOSM+600                                              01327000
ATCRSV88 EQU   ATCAOSM+596                                              01328000
ATCRPLCT EQU   ATCAOSM+594                                              01329000
ATCCRACT EQU   ATCAOSM+592                                              01330000
ATCSRBCT EQU   ATCAOSM+590                                              01331000
ATCRSV75 EQU   ATCAOSM+589                                              01332000
ATCRSV66 EQU   ATCZFLAG                                                 01333000
ATCZF001 EQU   ATCZFLAG                                                 01334000
ATCTPCP1 EQU   ATCAOSM+584                                              01335000
ATCTPCP0 EQU   ATCAOSM+580                                              01336000
ATCAICTN EQU   ATCAOSM+576                                              01337000
ATCZR01  EQU   ATCAOSM+572                                              01338000
ATCMPLTA EQU   ATCAOSM+568                                              01339000
ATCASCB  EQU   ATCAOSM+564                                              01340000
ATCAP86  EQU   ATCAOSM+560                                              01341000
ATCAP85  EQU   ATCAOSM+556                                              01342000
ATCAP84  EQU   ATCAOSM+552                                              01343000
ATCAP83  EQU   ATCAOSM+548                                              01344000
ATCAP82  EQU   ATCAOSM+544                                              01345000
ATCAP69  EQU   ATCAOSM+540                                              01346000
ATCAP66  EQU   ATCAOSM+536                                              01347000
ATCAP62  EQU   ATCAOSM+532                                              01348000
ATCAPC59 EQU   ATCAOSM+528                                              01349000
ATCAP56  EQU   ATCAOSM+524                                              01350000
ATCAP55  EQU   ATCAOSM+520                                              01351000
ATCRCFY0 EQU   ATCAOSM+516                                              01352000
ATCAP41  EQU   ATCAOSM+512                                              01353000
ATCAPC25 EQU   ATCAOSM+508                                              01354000
ATCAP23  EQU   ATCAOSM+504                                              01355000
ATCTPSPB EQU   ATCAOSM+472                                              01356000
ATCTRMPB EQU   ATCAOSM+440                                              01357000
ATCAPBE  EQU   ATCAOSM+436                                              01358000
ATCPSTA  EQU   ATCAOSM+432                                              01359000
ATCSMABF EQU   ATCAOSM+428                                              01360000
ATCSMAPR EQU   ATCAOSM+424                                              01361000
ATCTPWQA EQU   ATCAOSM+420                                              01362000
ATCSMAID EQU   ATCAOSM+416                                              01363000
ATCSMARA EQU   ATCAOSM+412                                              01364000
ATCCACXA EQU   ATCAOSM+408                                              01365000
ATCZLAAB EQU   ATCAOSM+404                                              01366000
ATCATA10 EQU   ATCAOSM+400                                              01367000
ATCHLTCB EQU   ATCAOSM+396                                              01368000
@NM00079 EQU   ATCVTFLG                                                 01369000
ATCVTACT EQU   ATCVTFLG                                                 01370000
ATCRPT40 EQU   ATCAOSM+388                                              01371000
ATCRPT39 EQU   ATCAOSM+384                                              01372000
ATCRPT38 EQU   ATCAOSM+380                                              01373000
ATCRPT37 EQU   ATCAOSM+376                                              01374000
ATCRPT36 EQU   ATCAOSM+372                                              01375000
ATCRPT35 EQU   ATCAOSM+368                                              01376000
ATCRPT34 EQU   ATCAOSM+364                                              01377000
ATCRPT33 EQU   ATCAOSM+360                                              01378000
ATCRPT32 EQU   ATCAOSM+356                                              01379000
ATCRPT31 EQU   ATCAOSM+352                                              01380000
ATCRPT30 EQU   ATCAOSM+348                                              01381000
ATCRPT29 EQU   ATCAOSM+344                                              01382000
ATCRPT28 EQU   ATCAOSM+340                                              01383000
ATCRPT27 EQU   ATCAOSM+336                                              01384000
ATCRPT26 EQU   ATCAOSM+332                                              01385000
ATCRPT25 EQU   ATCAOSM+328                                              01386000
ATCRPT24 EQU   ATCAOSM+324                                              01387000
ATCRPT23 EQU   ATCAOSM+320                                              01388000
ATCRPT22 EQU   ATCAOSM+316                                              01389000
ATCRPT21 EQU   ATCAOSM+312                                              01390000
ATCRPT20 EQU   ATCAOSM+308                                              01391000
ATCRPT19 EQU   ATCAOSM+304                                              01392000
ATCRPLAC EQU   ATCRPLCN+2                                               01393000
ATCRPLRC EQU   ATCRPLCN                                                 01394000
ATCCRPLQ EQU   ATCCRPL                                                  01395000
ATCSRBAC EQU   ATCSRBCN+2                                               01396000
ATCSRBRC EQU   ATCSRBCN                                                 01397000
ATCSRBQ  EQU   ATCSRB                                                   01398000
ATCCRAAC EQU   ATCCRACN+2                                               01399000
ATCCRARC EQU   ATCCRACN                                                 01400000
ATCCRAQ  EQU   ATCCRA                                                   01401000
ATCRPT12 EQU   ATCAOSM+276                                              01402000
ATCDMAPP EQU   ATCAOSM+272                                              01403000
ATCAP38  EQU   ATCAOSM+268                                              01404000
ATCAP37  EQU   ATCAOSM+264                                              01405000
ATCZDFJ0 EQU   ATCAOSM+260                                              01406000
ATCAP51  EQU   ATCAOSM+256                                              01407000
ATCZPAB2 EQU   ATCAOSM+224                                              01408000
ATCZPAB1 EQU   ATCAOSM+192                                              01409000
ATCZLFVT EQU   ATCAOSM+188                                              01410000
ATCZLPVT EQU   ATCAOSM+184                                              01411000
ATCZDVTX EQU   ATCAOSM+180                                              01412000
ATCZDVTA EQU   ATCAOSM+176                                              01413000
ATCZDVT9 EQU   ATCAOSM+172                                              01414000
ATCZDVT8 EQU   ATCAOSM+168                                              01415000
ATCZDVT7 EQU   ATCAOSM+164                                              01416000
ATCRSV56 EQU   ATCDAPVT+22                                              01417000
ATCDAPDG EQU   ATCDAPVT+20                                              01418000
ATCDXCEA EQU   ATCDAPVT+16                                              01419000
ATCDCEA  EQU   ATCDAPVT+12                                              01420000
ATCDPCIA EQU   ATCDAPVT+8                                               01421000
ATCDSIOA EQU   ATCDAPVT+4                                               01422000
ATCDEOEA EQU   ATCDAPVT                                                 01423000
ATCZLAEA EQU   ATCLDAPP+16                                              01424000
ATCZLCEA EQU   ATCLDAPP+12                                              01425000
ATCRSV17 EQU   ATCLDAPP+8                                               01426000
ATCSMFRR EQU   ATCLDAPP+4                                               01427000
ATCCDTID EQU   ATCLDAPP                                                 01428000
ATCZAEA  EQU   ATCICAPP+16                                              01429000
ATCZCEA  EQU   ATCICAPP+12                                              01430000
ATCCDTCB EQU   ATCICAPP+8                                               01431000
ATCZSIOA EQU   ATCICAPP+4                                               01432000
ATCCDRPH EQU   ATCICAPP                                                 01433000
ATCAP65  EQU   ATCAOSM+96                                               01434000
ATCZDVT6 EQU   ATCAOSM+92                                               01435000
ATCZDVT4 EQU   ATCAOSM+88                                               01436000
ATCZDVT3 EQU   ATCAOSM+84                                               01437000
ATCZDVT1 EQU   ATCAOSM+80                                               01438000
ATCICNCB EQU   ATCAOSM+76                                               01439000
ATCZPSVT EQU   ATCAOSM+72                                               01440000
ATCZFSVT EQU   ATCAOSM+68                                               01441000
ATCAP64  EQU   ATCAOSM+64                                               01442000
ATCAP63  EQU   ATCAOSM+60                                               01443000
ATCAP61  EQU   ATCAOSM+56                                               01444000
ATCAP58  EQU   ATCAOSM+52                                               01445000
ATCAP57  EQU   ATCAOSM+48                                               01446000
ATCAP54  EQU   ATCAOSM+44                                               01447000
ATCAP53  EQU   ATCAOSM+40                                               01448000
ATCAP52  EQU   ATCAOSM+36                                               01449000
ATCAP34  EQU   ATCAOSM+32                                               01450000
ATCAP32  EQU   ATCAOSM+28                                               01451000
ATCAP31  EQU   ATCAOSM+24                                               01452000
ATCAP12  EQU   ATCAOSM+20                                               01453000
ATCAP11  EQU   ATCAOSM+16                                               01454000
ATCCMTCB EQU   ATCAOSM+12                                               01455000
ATCPRPH  EQU   ATCAOSM+8                                                01456000
ATCGSRBF EQU   ATCGSRBG                                                 01457000
ATCSRBRT EQU   ATCAOSM                                                  01458000
@NM00078 EQU   @NM00077                                                 01459000
ATCVTMAB EQU   @NM00077                                                 01460000
@NM00076 EQU   ATCVTBAM                                                 01461000
ATCVDLOK EQU   ISTATCVT+904                                             01462000
ATCVFPAB EQU   ISTATCVT+872                                             01463000
ATCVDPAB EQU   ISTATCVT+840                                             01464000
ATCIOECB EQU   ISTATCVT+836                                             01465000
ATCINCW3 EQU   ISTATCVT+832                                             01466000
ATCMODTB EQU   ISTATCVT+828                                             01467000
ATCUSSPT EQU   ISTATCVT+824                                             01468000
ATCSRTAB EQU   ISTATCVT+820                                             01469000
@NM00075 EQU   ISTATCVT+819                                             01470000
@NM00074 EQU   ATCSTAT2                                                 01471000
ATCTRSMS EQU   ATCSTAT2                                                 01472000
ATCTRLOK EQU   ATCSTAT2                                                 01473000
ATCTRPSS EQU   ATCSTAT2                                                 01474000
ATCTRESC EQU   ATCSTAT2                                                 01475000
ATCTRAPI EQU   ATCSTAT2                                                 01476000
ATCNMCTR EQU   ISTATCVT+816                                             01477000
ATCSEC51 EQU   ATCSECST                                                 01478000
ATCSEC40 EQU   ATCSIPD+8                                                01479000
ATCSEC30 EQU   ATCSIPD+4                                                01480000
ATCSEC21 EQU   ATCSIPD                                                  01481000
ATCSEC10 EQU   ATCSOPD+4                                                01482000
ATCSEC01 EQU   ATCSOPD                                                  01483000
ATCPOIA  EQU   ATCRNO+1                                                 01484000
@NM00073 EQU   ATCRNO                                                   01485000
ATCPODVT EQU   ISTATCVT+784                                             01486000
ATCS49XL EQU   ISTATCVT+780                                             01487000
ATCS49XI EQU   ISTATCVT+776                                             01488000
ATCLCLCT EQU   ATCVLCNT+2                                               01489000
ATCRNCNT EQU   ATCVLCNT                                                 01490000
ATCCFEAD EQU   ISTATCVT+768                                             01491000
ATCPTR00 EQU   ISTATCVT+736                                             01492000
ATCRSV10 EQU   ISTATCVT+704                                             01493000
ATCTACB  EQU   ISTATCVT+700                                             01494000
ATCVTINM EQU   ISTATCVT+696                                             01495000
ATCTCLIM EQU   ISTATCVT+692                                             01496000
ATCTCLOM EQU   ISTATCVT+688                                             01497000
ATCVTIPB EQU   ISTATCVT+656                                             01498000
ATCTCIPB EQU   ISTATCVT+624                                             01499000
ATCTIPAB EQU   ISTATCVT+592                                             01500000
ATCOCCCB EQU   ISTATCVT+588                                             01501000
ATCOCCOB EQU   ISTATCVT+584                                             01502000
ATCCDLAD EQU   ISTATCVT+580                                             01503000
ATCCCLAD EQU   ISTATCVT+576                                             01504000
ATCDLRPB EQU   ISTATCVT+544                                             01505000
ATCPGPAB EQU   ISTATCVT+512                                             01506000
ATCVPAB1 EQU   ISTATCVT+480                                             01507000
ATCRSV97 EQU   ISTATCVT+476                                             01508000
ATCRDTLK EQU   ISTATCVT+472                                             01509000
ATCVOCLK EQU   ISTATCVT+468                                             01510000
ATCCDFDN EQU   ISTATCVT+464                                             01511000
ATCCDFIN EQU   ISTATCVT+460                                             01512000
ATCDVTLK EQU   ISTATCVT+456                                             01513000
ATCAP36  EQU   ISTATCVT+452                                             01514000
ATCAP35  EQU   ISTATCVT+448                                             01515000
ATCAP33  EQU   ISTATCVT+444                                             01516000
ATCRSV99 EQU   ISTATCVT+440                                             01517000
ATCONFIG EQU   ISTATCVT+432                                             01518000
ATCNODDS EQU   ISTATCVT+428                                             01519000
ATCNODEL EQU   ISTATCVT+420                                             01520000
ATCRSV69 EQU   ISTATCVT+416                                             01521000
ATCAPCR5 EQU   ISTATCVT+412                                             01522000
ATCLDECB EQU   ISTATCVT+408                                             01523000
ATCLDNCS EQU   ISTATCVT+404                                             01524000
ATCCDPTR EQU   ISTATCVT+400                                             01525000
ATCADEL  EQU   ISTATCVT+396                                             01526000
ATCTODVT EQU   ISTATCVT+392                                             01527000
ATCDEBCH EQU   ISTATCVT+388                                             01528000
ATCHBSIZ EQU   ATCHPGM+2                                                01529000
ATCHBFNO EQU   ATCHPGM                                                  01530000
ATCCRME  EQU   ISTATCVT+380                                             01531000
ATCRVCHS EQU   ISTATCVT+372                                             01532000
ATCECTLP EQU   ISTATCVT+368                                             01533000
ATCZDVTB EQU   ISTATCVT+364                                             01534000
ATCECPRT EQU   ISTATCVT+360                                             01535000
ATCVTLOD EQU   ISTATCVT+356                                             01536000
ATCTRPAB EQU   ISTATCVT+352                                             01537000
ATCMSGM  EQU   ISTATCVT+348                                             01538000
ATCEPT   EQU   ISTATCVT+340                                             01539000
ATCDVT   EQU   ISTATCVT+336                                             01540000
ATCTRCPT EQU   ISTATCVT+332                                             01541000
ATCDVLOD EQU   ISTATCVT+328                                             01542000
ATCALERT EQU   ISTATCVT+324                                             01543000
ATCEPA   EQU   ISTATCVT+320                                             01544000
ATCSAF   EQU   ISTATCVT+318                                             01545000
ATCXRANG EQU   ISTATCVT+317                                             01546000
ATCLAST  EQU   ATCSHRFG                                                 01547000
ATCSHRTN EQU   ISTATCVT+308                                             01548000
ATCUEP   EQU   ISTATCVT+304                                             01549000
ATCOCRT  EQU   ISTATCVT+300                                             01550000
ATCCSMA  EQU   ATCCSMR                                                  01551000
ATCESC02 EQU   ISTATCVT+292                                             01552000
ATCESC01 EQU   ISTATCVT+288                                             01553000
ATCCDFND EQU   ISTATCVT+284                                             01554000
ATCCDDEL EQU   ISTATCVT+280                                             01555000
ATCCDADD EQU   ISTATCVT+276                                             01556000
ATCMNT   EQU   ISTATCVT+272                                             01557000
ATCRSV16 EQU   ISTATCVT+270                                             01558000
ATCMAXID EQU   ISTATCVT+269                                             01559000
ATCMSGSP EQU   ATCCOM+268                                               01560000
ATCCIDM  EQU   ATCCOM+266                                               01561000
ATCACTRM EQU   ATCCOM+264                                               01562000
ATCNERAP EQU   ATCCOM+260                                               01563000
ATCNESAL EQU   ATCCOM+256                                               01564000
ATCRCC65 EQU   ATCCOM+252                                               01565000
ATCRCC26 EQU   ATCCOM+248                                               01566000
ATCRCC63 EQU   ATCCOM+244                                               01567000
ATCRSV11 EQU   ATCCOM+242                                               01568000
ATCVTMID EQU   ATCCOM+240                                               01569000
ATCAPOST EQU   ATCCOM+236                                               01570000
ATCNERFN EQU   ATCCOM+232                                               01571000
ATCNERNE EQU   ATCCOM+228                                               01572000
ATCNERCV EQU   ATCCOM+224                                               01573000
ATCNERST EQU   ATCCOM+220                                               01574000
ATCDCC61 EQU   ATCCOM+216                                               01575000
ATCDCC60 EQU   ATCCOM+212                                               01576000
ATCSRTDF EQU   ATCCOM+208                                               01577000
ATCSRTAD EQU   ATCCOM+204                                               01578000
ATCFIRA  EQU   ATCCOM+200                                               01579000
ATCSMBQ  EQU   ATCCOM+196                                               01580000
ATCSMRC  EQU   ATCCOM+192                                               01581000
ATCSMRS  EQU   ATCCOM+188                                               01582000
ATCSMQU  EQU   ATCCOM+184                                               01583000
ATCSMRQ  EQU   ATCCOM+180                                               01584000
ATCACDA  EQU   ATCCOM+176                                               01585000
ATCSTMA  EQU   ATCCOM+172                                               01586000
ATCFRSTR EQU   ATCCOM+168                                               01587000
ATCGTSTR EQU   ATCCOM+164                                               01588000
ATCREADA EQU   ATCCOM+160                                               01589000
ATCALOAD EQU   ATCCOM+156                                               01590000
ATCBLDLA EQU   ATCCOM+152                                               01591000
ATCFBRPH EQU   ATCCOM+148                                               01592000
ATCBFTRC EQU   ATCCOM+144                                               01593000
ATCTPBUF EQU   ATCTHTRC                                                 01594000
ATCREMOV EQU   ATCCOM+136                                               01595000
ATCADD   EQU   ATCCOM+132                                               01596000
ATCBPDA  EQU   ATCCOM+128                                               01597000
ATCDVTPT EQU   ATCCOM+124                                               01598000
ATCFEPT  EQU   ATCCOM+120                                               01599000
ATCFDVT  EQU   ATCCOM+116                                               01600000
ATCCONFT EQU   ATCCOM+112                                               01601000
ATCPTCHA EQU   ATCCOM+108                                               01602000
ATCAUTHA EQU   ATCCOM+104                                               01603000
ATCACCTA EQU   ATCCOM+100                                               01604000
ATCRDTH  EQU   ATCCOM+96                                                01605000
ATCFRSCH EQU   ATCCOM+92                                                01606000
ATCFSB   EQU   ATCCOM+88                                                01607000
ATCHLTMS EQU   ATCCOM+84                                                01608000
ATCECPRM EQU   ATCCOM+80                                                01609000
ATCECNET EQU   ATCCOM+76                                                01610000
ATCECOPC EQU   ATCCOM+72                                                01611000
ATCVPARM EQU   ATCCOM+68                                                01612000
ATCECVRQ EQU   ATCCOM+64                                                01613000
ATCECSES EQU   ATCCOM+60                                                01614000
ATCOCHA  EQU   ATCCOM+56                                                01615000
ATCDSPLQ EQU   ATCCOM+52                                                01616000
ATCECDSP EQU   ATCCOM+48                                                01617000
ATCVARYQ EQU   ATCCOM+44                                                01618000
ATCECVRY EQU   ATCCOM+40                                                01619000
ATCHALTQ EQU   ATCCOM+36                                                01620000
ATCECHLT EQU   ATCCOM+32                                                01621000
ATCMODQ  EQU   ATCCOM+28                                                01622000
ATCECMOD EQU   ATCCOM+24                                                01623000
ATCASCHD EQU   ATCCOM+20                                                01624000
ATCSRT   EQU   ATCCOM+16                                                01625000
ATCRDT   EQU   ATCCOM+12                                                01626000
ATCDCFRR EQU   ATCCOM+8                                                 01627000
ATCAPI   EQU   ATCCOM+4                                                 01628000
ATCRSV04 EQU   ATCSTAT4                                                 01629000
ATCVTTRC EQU   ATCSTAT4                                                 01630000
ATCNCSD  EQU   ATCSTAT4                                                 01631000
ATCMTST  EQU   ATCSTAT4                                                 01632000
ATCTPRT  EQU   ATCSTAT4                                                 01633000
ATCPRTAT EQU   ATCSTAT4                                                 01634000
@NM00072 EQU   ATCPOFLG                                                 01635000
ATCPOUNS EQU   ATCPOFLG                                                 01636000
ATCHSDMF EQU   ATCSTFLG                                                 01637000
@NM00071 EQU   ATCSTAT1                                                 01638000
ATCMDHLT EQU   ATCSTAT1                                                 01639000
ATCINHLT EQU   ATCSTAT1                                                 01640000
ATCNETSL EQU   ATCSTAT1                                                 01641000
ATCQKHLT EQU   ATCSTAT1                                                 01642000
ATCSNHLT EQU   ATCSTAT1                                                 01643000
ATCACTIV EQU   ATCSTAT1                                                 01644000
ATCSTART EQU   ATCSTAT1                                                 01645000
RPHNEXPO EQU   ISTRPH+104                                               01646000
RPHSAV16 EQU   RPHWORK+60                                               01647000
RPHSAV15 EQU   RPHWORK+56                                               01648000
RPHSAV14 EQU   RPHWORK+52                                               01649000
RPHSAV13 EQU   RPHWORK+48                                               01650000
RPHSAV12 EQU   RPHWORK+44                                               01651000
RPHSAV11 EQU   RPHWORK+40                                               01652000
RPHSAV10 EQU   RPHWORK+36                                               01653000
RPHSAVE9 EQU   RPHWORK+32                                               01654000
RPHSAVE8 EQU   RPHWORK+28                                               01655000
RPHSAVE7 EQU   RPHWORK+24                                               01656000
RPHSAVE6 EQU   RPHWORK+20                                               01657000
RPHSAVE5 EQU   RPHWORK+16                                               01658000
RPHSAVE4 EQU   RPHWORK+12                                               01659000
RPHSAVE3 EQU   RPHWORK+8                                                01660000
RPHSAVE2 EQU   RPHWORK+4                                                01661000
RPHSHALF EQU   RPHSAVE1+2                                               01662000
RPHSBIT8 EQU   RPHSBITS                                                 01663000
RPHSBIT7 EQU   RPHSBITS                                                 01664000
RPHSBIT6 EQU   RPHSBITS                                                 01665000
RPHSBIT5 EQU   RPHSBITS                                                 01666000
RPHSBIT4 EQU   RPHSBITS                                                 01667000
RPHSBIT3 EQU   RPHSBITS                                                 01668000
RPHSBIT2 EQU   RPHSBITS                                                 01669000
RPHSBIT1 EQU   RPHSBITS                                                 01670000
RPHSBYTE EQU   RPHSAVE1                                                 01671000
RPHPABQP EQU   RPHPABQA+1                                               01672000
RPHPABFG EQU   RPHPABQA                                                 01673000
RPHCRR   EQU   ISTRPH+32                                                01674000
RPHSRP34 EQU   RPHSRPRM+2                                               01675000
RPHSRP12 EQU   RPHSRPRM                                                 01676000
RPHWEGT  EQU   RPHCSPA                                                  01677000
RPHMAJCB EQU   ISTRPH+21                                                01678000
RPHPABOF EQU   ISTRPH+20                                                01679000
RPHRESUM EQU   RPHRESMA+1                                               01680000
RPHRSV01 EQU   RPHWPFLG                                                 01681000
RPHPURGE EQU   RPHWPFLG                                                 01682000
RPHPT    EQU   RPHWPFLG                                                 01683000
RPHWT    EQU   RPHWPFLG                                                 01684000
RPHRSKEY EQU   RPHWPFLG                                                 01685000
RPHDVTA  EQU   ISTRPH+12                                                01686000
RPHTIK   EQU   RPHTSKID+3                                               01687000
@NM00070 EQU   RPHTSKID                                                 01688000
RPHRPHAP EQU   RPHRPHA+1                                                01689000
@NM00069 EQU   RPHRPHA                                                  01690000
RPHGATE  EQU   RPHRPHA                                                  01691000
@NM00068 EQU   RPHFLGB                                                  01692000
RPHRLCRA EQU   RPHFLGB                                                  01693000
RPHNRSAV EQU   RPHFLGB                                                  01694000
RPHPGCMP EQU   RPHFLGB                                                  01695000
RPHFBAPS EQU   RPHFLGB                                                  01696000
RPHBSSP  EQU   RPHFLGB                                                  01697000
RPHLOCK  EQU   RPHFLGB                                                  01698000
RPHFNFLG EQU   RPHFSTLC                                                 01699000
RPHMLTCP EQU   RPHFLAGS                                                 01700000
RPHSMCLR EQU   RPHFLAGS                                                 01701000
RPHSMTYP EQU   RPHFLAGS                                                 01702000
RPHSMQ   EQU   RPHFLAGS                                                 01703000
RPHAUTEX EQU   RPHAPTYP                                                 01704000
RPHSPGIN EQU   RPHFLAGS                                                 01705000
RPHOGIND EQU   RPHFLAGS                                                 01706000
RPHLNGTH EQU   RPHCNTL+1                                                01707000
RPHTYPE  EQU   RPHCNTL                                                  01708000
PATRSV01 EQU   PATFLAGA                                                 01709000
PATUSEFG EQU   PATFLAGA                                                 01710000
PATRDCNT EQU   ISTPAT+6                                                 01711000
PATGRPID EQU   ISTPAT+5                                                 01712000
PATPTHID EQU   ISTPAT+4                                                 01713000
PATDINDX EQU   ISTPAT+2                                                 01714000
PATGINDX EQU   ISTPAT                                                   01715000
GNTGRPNM EQU   ISTGNT                                                   01716000
DNTTELNO EQU   ISTDNT+1                                                 01717000
DNTCTDIG EQU   ISTDNT                                                   01718000
RLSRSV02 EQU   ISTRLS+140                                               01719000
RLSRSV01 EQU   ISTRLS+138                                               01720000
RLSCTELU EQU   ISTRLS+136                                               01721000
RLSPRE   EQU   ISTRLS                                                   01722000
RDARSVPT EQU   ISTRDA+84                                                01723000
RDAPUBI  EQU   ISTRDA+83                                                01724000
RDADFCUA EQU   ISTRDA+80                                                01725000
RDACTPCC EQU   ISTRDA+79                                                01726000
RDADACUA EQU   ISTRDA+76                                                01727000
RDALUBA  EQU   RDAUCBAD+1                                               01728000
RDACHQI  EQU   RDAUCBAD                                                 01729000
RDARSV01 EQU   RDAFLAG                                                  01730000
RDARBISA EQU   RDAFLAG                                                  01731000
RDAPRE   EQU   ISTRDA                                                   01732000
RSWRSV01 EQU   ISTRSW+152                                               01733000
RSWRSV02 EQU   ISTRSW+150                                               01734000
RSWCTELU EQU   ISTRSW+148                                               01735000
RSWGRUPZ EQU   ISTRSW+146                                               01736000
RSWDIALZ EQU   ISTRSW+144                                               01737000
RSWGRUPT EQU   ISTRSW+140                                               01738000
RSWDIALT EQU   ISTRSW+136                                               01739000
RSWPRE   EQU   ISTRSW                                                   01740000
RLXRSV03 EQU   ISTRLX+80                                                01741000
RLXRSV02 EQU   ISTRLX+77                                                01742000
RLXRSV01 EQU   RLXFLAGA                                                 01743000
RLXINUSE EQU   RLXFLAGA                                                 01744000
RLXNLUX  EQU   ISTRLX+72                                                01745000
RLXPRE   EQU   ISTRLX                                                   01746000
RPXRSV01 EQU   ISTRPX+80                                                01747000
RPXRSV02 EQU   ISTRPX+77                                                01748000
RPXMAXLU EQU   ISTRPX+76                                                01749000
RPXFLUX  EQU   ISTRPX+72                                                01750000
RPXPRE   EQU   ISTRPX                                                   01751000
RLURSV02 EQU   ISTRLU+172                                               01752000
RLULGMOD EQU   ISTRLU+164                                               01753000
RLUMODEP EQU   RLUMODET+8                                               01754000
RLUMODEN EQU   RLUMODET                                                 01755000
RLUUSSPT EQU   RLUUSSTB+8                                               01756000
RLUUSSNM EQU   RLUUSSTB                                                 01757000
RLURSV01 EQU   ISTRLU+137                                               01758000
RLULOCAD EQU   ISTRLU+136                                               01759000
RLUNCPPM EQU   RLUNCPPC+1                                               01760000
RLUNCPPN EQU   RLUNCPPC                                                 01761000
RLUPACEM EQU   RLUPACE+1                                                01762000
RLUPACEN EQU   RLUPACE                                                  01763000
RLUINTA  EQU   ISTRLU+128                                               01764000
RLUSSCFM EQU   ISTRLU+127                                               01765000
RLUCRRSV EQU   RLUCRFLG                                                 01766000
RLUACTLU EQU   RLUCRFLG                                                 01767000
RLURSV00 EQU   RLUFLAG                                                  01768000
RLUNDSES EQU   RLUFLAG                                                  01769000
RLUGSTAT EQU   RLUFLAG                                                  01770000
RLUBATCH EQU   RLUFLAG                                                  01771000
RLURBISA EQU   RLUFLAG                                                  01772000
RLUTYPE  EQU   ISTRLU+124                                               01773000
RLUCRPR  EQU   ISTRLU                                                   01774000
RCCRVPT2 EQU   ISTRCC+144                                               01775000
RCCXTOSW EQU   ISTRCC+140                                               01776000
RCCSWTOX EQU   ISTRCC+136                                               01777000
RCCRSPT2 EQU   ISTRCC+133                                               01778000
RCCADDR  EQU   ISTRCC+132                                               01779000
RCCPASSL EQU   ISTRCC+131                                               01780000
RCCMXOUT EQU   ISTRCC+130                                               01781000
RCCMXDAT EQU   ISTRCC+128                                               01782000
RCCINDEX EQU   ISTRCC+126                                               01783000
RCCPATHZ EQU   ISTRCC+124                                               01784000
RCCPATHT EQU   ISTRCC+120                                               01785000
RCCDPQ   EQU   ISTRCC+116                                               01786000
RCCTPAB  EQU   ISTRCC+112                                               01787000
RCCRSV02 EQU   ISTRCC+109                                               01788000
RCCCRRSV EQU   RCCCRFLG                                                 01789000
RCCCTCFL EQU   RCCCRFLG                                                 01790000
RCCACTPU EQU   RCCCRFLG                                                 01791000
RCCNCSPL EQU   ISTRCC+104                                               01792000
RCCRPHCN EQU   ISTRCC+100                                               01793000
RCCEPAB  EQU   ISTRCC+96                                                01794000
RCCDPAB  EQU   ISTRCC+92                                                01795000
RCCVPAB  EQU   ISTRCC+88                                                01796000
@NM00067 EQU   ISTRCC+87                                                01797000
RCCSESCT EQU   ISTRCC+86                                                01798000
RCCIDNUM EQU   RCCID48+3                                                01799000
RCCIDBLK EQU   RCCID48+2                                                01800000
RCCIDPA2 EQU   RCCID48+1                                                01801000
RCCIDPUT EQU   RCCID48                                                  01802000
RCCIDPA1 EQU   RCCSTAID                                                 01803000
RCCCTELU EQU   ISTRCC+76                                                01804000
RCCCNCNT EQU   ISTRCC+75                                                01805000
RCCRTGOH EQU   RCCFLAGB                                                 01806000
RCCBRKCN EQU   RCCFLAGB                                                 01807000
RCCRESET EQU   RCCFLAGB                                                 01808000
RCCFINAL EQU   RCCFLAGB                                                 01809000
RCCBNNSP EQU   RCCFLAGB                                                 01810000
RCCIRETR EQU   RCCFLAGB                                                 01811000
RCCDIALP EQU   RCCFLAGB                                                 01812000
RCCDSTCT EQU   RCCFLAGB                                                 01813000
RCCCTPGD EQU   RCCFLAG                                                  01814000
RCCPRGDN EQU   RCCFLAG                                                  01815000
RCCOUERP EQU   RCCFLAG                                                  01816000
RCCOHIMM EQU   RCCFLAG                                                  01817000
RCCLDISC EQU   RCCFLAG                                                  01818000
RCCERPIP EQU   RCCFLAG                                                  01819000
RCCCUDIE EQU   RCCFLAG                                                  01820000
RCCRBISA EQU   RCCFLAG                                                  01821000
RCCTYPE  EQU   ISTRCC+72                                                01822000
RCCPRE   EQU   ISTRCC                                                   01823000
DOTADTRM EQU   ISTDOT                                                   01824000
RDSADDOT EQU   ISTRDS+76                                                01825000
RDSCTATR EQU   ISTRDS+74                                                01826000
RDSCTTRM EQU   ISTRDS+72                                                01827000
RDSPRE   EQU   ISTRDS                                                   01828000
RINRSV05 EQU   ISTRIN+156                                               01829000
RINRSV04 EQU   ISTRIN+152                                               01830000
RINLOCRN EQU   ISTRIN+148                                               01831000
RINRSV02 EQU   ISTRIN+145                                               01832000
RTRCNCNT EQU   RINCNCNT                                                 01833000
RTRNCSPL EQU   RINNCSPL                                                 01834000
RTRRPHCN EQU   RINRPHCN                                                 01835000
RTRVPAB  EQU   RINVPAB                                                  01836000
RTRREMOT EQU   RINREMOT                                                 01837000
RTRRLDAF EQU   RINRLDAF                                                 01838000
RTRNODID EQU   RINNODID                                                 01839000
RINRSV01 EQU   RINDFD                                                   01840000
RTRLDISC EQU   RINLDISC                                                 01841000
RTRNODEF EQU   RINNODEF                                                 01842000
RTRREMPO EQU   RINREMPO                                                 01843000
RINCRPRE EQU   ISTRIN                                                   01844000
RTRRSV04 EQU   ISTRTR+210                                               01845000
RTRLCTI  EQU   ISTRTR+209                                               01846000
RTRIDCAS EQU   RTRBSCID+1                                               01847000
RTRIDLEN EQU   RTRBSCID                                                 01848000
RTRRSVDD EQU   ISTRTR+181                                               01849000
RTRRDFG  EQU   ISTRTR+180                                               01850000
RTRDIAA  EQU   ISTRTR+176                                               01851000
RTRPOLA  EQU   ISTRTR+172                                               01852000
RTRCADDR EQU   ISTRTR+164                                               01853000
RTRCTADR EQU   ISTRTR+162                                               01854000
RTRCTPOL EQU   ISTRTR+160                                               01855000
RTRCTDIA EQU   ISTRTR+158                                               01856000
RTRRSV03 EQU   ISTRTR+156                                               01857000
RTRRVPT1 EQU   ISTRTR+152                                               01858000
RTRBHSN1 EQU   ISTRTR+144                                               01859000
RTRCRSV2 EQU   RTRCRFLG                                                 01860000
RTRDTRLM EQU   RTRLSCMD                                                 01861000
RTRCRSV1 EQU   RTRCRFLG                                                 01862000
RTRTRMAX EQU   ISTRTR+142                                               01863000
RTRRSV24 EQU   RTRRDFF                                                  01864000
RTRRFDEK EQU   RTRRDFF                                                  01865000
RTRRFANK EQU   RTRRDFF                                                  01866000
RTRRFPFK EQU   RTRRDFF                                                  01867000
RTRRFPEN EQU   RTRRDFF                                                  01868000
RTRRFXCT EQU   RTRRDFF                                                  01869000
RTRRESCT EQU   RTRRDFE                                                  01870000
RTRRESUP EQU   RTRRDFE                                                  01871000
RTRREATT EQU   RTRRDFE                                                  01872000
RTRRECHK EQU   RTRRDFE                                                  01873000
RTRREACR EQU   RTRRDFE                                                  01874000
RTRRSV0A EQU   RTRRDFE                                                  01875000
RTRREBRK EQU   RTRRDFE                                                  01876000
RTRRSV11 EQU   RTRRDFD                                                  01877000
RTRRSV10 EQU   RTRRDFD                                                  01878000
RTRRDBHI EQU   RTRRDFD                                                  01879000
RTRRDBHD EQU   RTRRDFD                                                  01880000
RTRRDBHN EQU   RTRRDFD                                                  01881000
RTRRSV23 EQU   RTRRDFC                                                  01882000
RTRRCXMS EQU   RTRRDFC                                                  01883000
RTRRCMSG EQU   RTRRDFC                                                  01884000
RTRRCBLK EQU   RTRRDFC                                                  01885000
RTRRCPT3 EQU   RTRRDFC                                                  01886000
RTRRCIT2 EQU   RTRRDFC                                                  01887000
RTRRCIT1 EQU   RTRRDFC                                                  01888000
RTRRSV32 EQU   RTRRDFB                                                  01889000
RTRRBEND EQU   RTRRDFB                                                  01890000
RTRRBECT EQU   RTRRDFB                                                  01891000
RTRRSV02 EQU   RTRRDFA                                                  01892000
RTRRACTR EQU   RTRRDFA                                                  01893000
RTRRSV60 EQU   RTRRDFA                                                  01894000
RTRRACDT EQU   RTRRDFA                                                  01895000
RTRRAPT3 EQU   RTRRAALL                                                 01896000
RTRRAPT2 EQU   RTRRAALL                                                 01897000
RTRRAPT1 EQU   RTRRAALL                                                 01898000
RTRRAATN EQU   RTRRDFA                                                  01899000
RTRRSV45 EQU   ISTRTR+132                                               01900000
RTRRSV01 EQU   ISTRTR+130                                               01901000
RTRCTECM EQU   ISTRTR+128                                               01902000
RTRADRPT EQU   RTRADR+1                                                 01903000
RTRRSV22 EQU   RTRFLAG                                                  01904000
RTRVTERM EQU   RTRFLAG                                                  01905000
RTRRSV51 EQU   RTRFLAG                                                  01906000
RTRRBISA EQU   RTRFLAG                                                  01907000
RTRRSV21 EQU   RTRFLAG                                                  01908000
RTRCRPR  EQU   ISTRTR                                                   01909000
RCLRVPT2 EQU   ISTRCL+92                                                01910000
RCLRVPT1 EQU   ISTRCL+88                                                01911000
RCLGPOLA EQU   ISTRCL+84                                                01912000
RCLCTNGP EQU   ISTRCL+82                                                01913000
RCLRSV01 EQU   ISTRCL+80                                                01914000
RCLCTECM EQU   ISTRCL+78                                                01915000
RCLCTETR EQU   ISTRCL+76                                                01916000
RCLGPADR EQU   RCLADR+1                                                 01917000
RCLRSV33 EQU   RCLFLAG                                                  01918000
RCLBATCH EQU   RCLFLAG                                                  01919000
RCLRBISA EQU   RCLFLAG                                                  01920000
RCLRSV22 EQU   RCLFLAG                                                  01921000
RCLPRE   EQU   ISTRCL                                                   01922000
RPTRSV03 EQU   ISTRPT+156                                               01923000
RPTRSV02 EQU   ISTRPT+152                                               01924000
RPTNSNSV EQU   ISTRPT+148                                               01925000
RPTPTHCT EQU   ISTRPT+146                                               01926000
RPTPEPCT EQU   ISTRPT+144                                               01927000
RPTDAFSV EQU   ISTRPT+142                                               01928000
RPTRSV01 EQU   ISTRPT+141                                               01929000
RPTISTAT EQU   RPTFLAG1                                                 01930000
RPTDYNAM EQU   RPTFLAG1                                                 01931000
RPTVYIMM EQU   RPTFLAG1                                                 01932000
RPTVIODN EQU   RPTFLAG1                                                 01933000
RPTONLIN EQU   RPTFLAG1                                                 01934000
RPTHLVPD EQU   RPTFLAG1                                                 01935000
RPTVRYPD EQU   RPTFLAG1                                                 01936000
RPTASLEP EQU   RPTFLAG1                                                 01937000
RPTUTERM EQU   ISTRPT+136                                               01938000
RPTATERM EQU   ISTRPT+132                                               01939000
RPTDIVT  EQU   RPTDITT                                                  01940000
RPTCTNM  EQU   ISTRPT+120                                               01941000
RPTLNDAF EQU   RPTLNCID+2                                               01942000
RPTLNSAF EQU   RPTLNCID                                                 01943000
RPTLN    EQU   ISTRPT                                                   01944000
RLNRVPT2 EQU   ISTRLN+112                                               01945000
RLNNCSPL EQU   ISTRLN+108                                               01946000
RLNX2SW  EQU   ISTRLN+104                                               01947000
@NM00066 EQU   ISTRLN+103                                               01948000
RLNCRRSV EQU   RLNCRFLG                                                 01949000
RLNSWEP  EQU   RLNCRFLG                                                 01950000
RLNSVSKP EQU   RLNLSCMD                                                 01951000
RLNSESLM EQU   RLNLSCMD                                                 01952000
RLNNPRLM EQU   RLNLSCMD                                                 01953000
RLNSWNCP EQU   RLNCRFLG                                                 01954000
RLNACTLN EQU   RLNCRFLG                                                 01955000
RLNPAUSE EQU   ISTRLN+101                                               01956000
RLNPOLMT EQU   ISTRLN+100                                               01957000
RLNACTSN EQU   ISTRLN+98                                                01958000
RLNRESV1 EQU   ISTRLN+97                                                01959000
RLNACTRM EQU   ISTRLN+96                                                01960000
RLNCTSES EQU   ISTRLN+95                                                01961000
RLNRDSLM EQU   ISTRLN+94                                                01962000
RLNAUTOA EQU   ISTRLN+92                                                01963000
RLNRDFD  EQU   RLNRDF+3                                                 01964000
RLNRDFC  EQU   RLNRDF+2                                                 01965000
RLNMULTP EQU   RLNRDFB                                                  01966000
RLNRATRN EQU   RLNRDFB                                                  01967000
RLNRAPOL EQU   RLNRDFB                                                  01968000
RLNTTV   EQU   RLNRDFB                                                  01969000
RLNRSV0B EQU   RLNRDFB                                                  01970000
RLNAUTOD EQU   RLNRDFB                                                  01971000
RLNANSWR EQU   RLNRDFB                                                  01972000
RLNRBUSE EQU   RLNRDFB                                                  01973000
RLNRAPEP EQU   RLNRDFA                                                  01974000
RLNRANCP EQU   RLNRDFA                                                  01975000
RLNRAEP  EQU   RLNRDFA                                                  01976000
RLNIDV   EQU   RLNRDFA                                                  01977000
RLNPORT  EQU   RLNRDFA                                                  01978000
RLNGANSW EQU   RLNRDFA                                                  01979000
RLNRACAN EQU   RLNRACNT                                                 01980000
RLNRACAT EQU   RLNRACNT                                                 01981000
RLNRSV04 EQU   RLNSTAT2                                                 01982000
RLNINUSE EQU   RLNSTAT2                                                 01983000
RLNOHIN  EQU   RLNSTAT2                                                 01984000
RLNRSV03 EQU   RLNSTAT1                                                 01985000
RLNVD    EQU   RLNSTAT1                                                 01986000
RLNINOPP EQU   RLNSTAT1                                                 01987000
RLNINOPL EQU   RLNSTAT1                                                 01988000
RLNLRST  EQU   RLNSTAT1                                                 01989000
RLNTRAP  EQU   RLNSTAT1                                                 01990000
RLNACTCT EQU   ISTRLN+84                                                01991000
RLNCTECM EQU   ISTRLN+82                                                01992000
RLNCTEIN EQU   ISTRLN+80                                                01993000
RLNCTETR EQU   ISTRLN+78                                                01994000
RLNCTECL EQU   ISTRLN+76                                                01995000
RLNCUA   EQU   RLNUCBAD                                                 01996000
RLNRSV01 EQU   RLNFLAG                                                  01997000
RLNRBISA EQU   RLNFLAG                                                  01998000
RLNEAM   EQU   RLNFLAG                                                  01999000
RLNPRE   EQU   ISTRLN                                                   02000000
RGPRVPT2 EQU   ISTRGP+88                                                02001000
RGPRVPT1 EQU   ISTRGP+84                                                02002000
RGPCTECM EQU   ISTRGP+82                                                02003000
RGPCTEIN EQU   ISTRGP+80                                                02004000
RGPCTETR EQU   ISTRGP+78                                                02005000
RGPCTECL EQU   ISTRGP+76                                                02006000
RGPCTELN EQU   ISTRGP+74                                                02007000
RGPRSV03 EQU   ISTRGP+73                                                02008000
RGPRSV02 EQU   RGPFLG                                                   02009000
RGPASDLC EQU   RGPFLG                                                   02010000
RGPABSC  EQU   RGPFLG                                                   02011000
RGPASS   EQU   RGPFLG                                                   02012000
RGPADIL  EQU   RGPFLG                                                   02013000
RGPPRE   EQU   ISTRGP                                                   02014000
RRNRINNM EQU   ISTRRN+248                                               02015000
@NM00065 EQU   ISTRRN+247                                               02016000
RRNRDCUA EQU   ISTRRN+244                                               02017000
RRNLASTE EQU   ISTRRN+240                                               02018000
RRNNCSPL EQU   ISTRRN+236                                               02019000
RRNRPLPT EQU   ISTRRN+232                                               02020000
RRNMSIZE EQU   ISTRRN+228                                               02021000
RRNNCPNM EQU   ISTRRN+221                                               02022000
RRNCTPCC EQU   ISTRRN+220                                               02023000
RRNHBUFS EQU   ISTRRN+218                                               02024000
RRNHLENT EQU   RRNHPRE+1                                                02025000
RRNHLENH EQU   RRNHPRE                                                  02026000
RRNNMNCP EQU   ISTRRN+208                                               02027000
RRNDELAY EQU   ISTRRN+206                                               02028000
RRNRSV04 EQU   ISTRRN+200                                               02029000
RRNRSV88 EQU   RRNNMDPD+7                                               02030000
RRNPUBI  EQU   RRNNMDPD+6                                               02031000
RRNDPLUB EQU   RRNNMDPD                                                 02032000
RRNEPADR EQU   ISTRRN+190                                               02033000
RRNCPLUB EQU   ISTRRN+184                                               02034000
RRNFLUX  EQU   ISTRRN+180                                               02035000
RRNRSV05 EQU   RRNCMFD                                                  02036000
RRNREMPO EQU   RRNCMFD                                                  02037000
RRNCDREC EQU   RRNCMFD                                                  02038000
RRNCDDSI EQU   RRNCMFD                                                  02039000
RRNCDBCK EQU   RRNCMFD                                                  02040000
RRNCDDTL EQU   RRNCMFD                                                  02041000
RRNCDSTD EQU   RRNCMFD                                                  02042000
RRNCDCSP EQU   RRNCMFD                                                  02043000
RRNCCCSL EQU   RRNCMFC                                                  02044000
RRNCCSIM EQU   RRNCMFC                                                  02045000
RRNCCRCM EQU   RRNCMFC                                                  02046000
RRNCCRIM EQU   RRNCMFC                                                  02047000
RRNCCCRC EQU   RRNCMFC                                                  02048000
RRNCCRST EQU   RRNCMFC                                                  02049000
RRNCCRDQ EQU   RRNCMFC                                                  02050000
RRNCCRCN EQU   RRNCMFC                                                  02051000
RRNCBALT EQU   RRNCMFB                                                  02052000
RRNCBMOD EQU   RRNCMFB                                                  02053000
RRNCBNPL EQU   RRNCMFB                                                  02054000
RRNCBRLS EQU   RRNCMFB                                                  02055000
RRNCBRDS EQU   RRNCMFB                                                  02056000
RRNCBDLR EQU   RRNCMFB                                                  02057000
RRNCBDLH EQU   RRNCMFB                                                  02058000
RRNCBDLO EQU   RRNCMFB                                                  02059000
RRNCADGO EQU   RRNCMFA                                                  02060000
RRNCADTD EQU   RRNCMFA                                                  02061000
RRNCACDT EQU   RRNCMFA                                                  02062000
RRNCAMBH EQU   RRNCMFA                                                  02063000
RRNCAATI EQU   RRNCMFA                                                  02064000
RRNCAATG EQU   RRNCMFA                                                  02065000
RRNCAATD EQU   RRNCMFA                                                  02066000
RRNCAALL EQU   RRNCMFA                                                  02067000
RRNRSV55 EQU   RRNRDF+3                                                 02068000
RRNPTASL EQU   RRNRDFB+1                                                02069000
RRNRSV01 EQU   RRNRDFB+1                                                02070000
RRNVYDON EQU   RRNRDFB+1                                                02071000
RRNRBBUP EQU   RRNRDFB+1                                                02072000
RRNRSV03 EQU   RRNRDFB                                                  02073000
RRNRBCT2 EQU   RRNRDFB                                                  02074000
RRNRBCT1 EQU   RRNRDFB                                                  02075000
RRNRBSEC EQU   RRNRDFB                                                  02076000
RRNRBCCT EQU   RRNRDFB                                                  02077000
RRNRBCCL EQU   RRNRDFB                                                  02078000
RRNRSV02 EQU   RRNRDFB                                                  02079000
RRNRBMDL EQU   RRNRDFB                                                  02080000
RRNRAPEP EQU   RRNRDFA                                                  02081000
RRNRANCP EQU   RRNRDFA                                                  02082000
RRNRBREM EQU   RRNRDFA                                                  02083000
RRNRAOLT EQU   RRNRDFA                                                  02084000
RRNRASYN EQU   RRNRDFA                                                  02085000
RRNRADMP EQU   RRNRDFA                                                  02086000
RRNRAIPL EQU   RRNRDFA                                                  02087000
RRNRASHT EQU   RRNRDFA                                                  02088000
RRNCTENT EQU   ISTRRN+170                                               02089000
RRNCTECM EQU   ISTRRN+168                                               02090000
RRNCTEIN EQU   ISTRRN+166                                               02091000
RRNCTETR EQU   ISTRRN+164                                               02092000
RRNCTECL EQU   ISTRRN+162                                               02093000
RRNCTELI EQU   ISTRRN+160                                               02094000
RRNCTEGP EQU   ISTRRN+158                                               02095000
RRNCTBHS EQU   ISTRRN+156                                               02096000
RRNBHSET EQU   ISTRRN+152                                               02097000
RRNTRENT EQU   ISTRRN+148                                               02098000
RRNRLDIP EQU   ISTRRN+147                                               02099000
RRNRNCUA EQU   ISTRRN+144                                               02100000
RRNGRPA  EQU   ISTRRN+140                                               02101000
RRNLUBA  EQU   RRNUCBAD+1                                               02102000
RRNCHQI  EQU   RRNUCBAD                                                 02103000
RRNRSV11 EQU   RRNFLAG                                                  02104000
RRNDSTCT EQU   RRNFLAG                                                  02105000
RRNERPIP EQU   RRNFLAG                                                  02106000
RRNLCDIP EQU   RRNFLAG                                                  02107000
RRNLCDIE EQU   RRNFLAG                                                  02108000
RRNLCSIP EQU   RRNFLAG                                                  02109000
RRNRBISA EQU   RRNFLAG                                                  02110000
RRNRSV89 EQU   RRNFLAG                                                  02111000
RRNPRE   EQU   ISTRRN                                                   02112000
RLCRVPT2 EQU   ISTRLC+80                                                02113000
RLCRVPT1 EQU   ISTRLC+79                                                02114000
RLCLCCUA EQU   ISTRLC+76                                                02115000
RLCUCBAD EQU   RLCADR+1                                                 02116000
RLCRSVDE EQU   RLCFLAG                                                  02117000
RLCACNT  EQU   RLCFLAG                                                  02118000
RLCRSV14 EQU   RLCFLAG                                                  02119000
RLCRBISA EQU   RLCFLAG                                                  02120000
RLCRSV22 EQU   RLCFLAG                                                  02121000
RLCPRE   EQU   ISTRLC                                                   02122000
RAPRVPT2 EQU   ISTRAP+116                                               02123000
RAPRVPT1 EQU   ISTRAP+112                                               02124000
RAPBFACT EQU   ISTRAP+111                                               02125000
RAPRSV17 EQU   RAPFLGC                                                  02126000
RAPRSV16 EQU   RAPFLGC                                                  02127000
RAPRSV15 EQU   RAPFLGC                                                  02128000
RAPRSV14 EQU   RAPFLGC                                                  02129000
RAPRSV13 EQU   RAPFLGC                                                  02130000
RAPRSV12 EQU   RAPFLGC                                                  02131000
RAPRSV11 EQU   RAPFLGC                                                  02132000
RAPRSV10 EQU   RAPFLGC                                                  02133000
RAPANVPC EQU   RAPFLGB                                                  02134000
RAPASPO  EQU   RAPFLGB                                                  02135000
RAPAPPO  EQU   RAPFLGB                                                  02136000
RAPAACQ  EQU   RAPFLGB                                                  02137000
RAPAPRMT EQU   RAPFLGB                                                  02138000
RAPAPASS EQU   RAPFLGB                                                  02139000
RAPABLCK EQU   RAPFLGB                                                  02140000
RAPALLF  EQU   RAPFLGB                                                  02141000
RAPRSV06 EQU   RAPFLG                                                   02142000
RAPRSV05 EQU   RAPFLG                                                   02143000
RAPRSV04 EQU   RAPFLG                                                   02144000
RAPRSV03 EQU   RAPFLG                                                   02145000
RAPATLGN EQU   RAPFLG                                                   02146000
RAPASLGI EQU   RAPFLG                                                   02147000
RAPAQUI  EQU   RAPFLG                                                   02148000
RAPABLGN EQU   RAPFLG                                                   02149000
RAPACEQD EQU   ISTRAP+106                                               02150000
RAPTRPRE EQU   ISTRAP+104                                               02151000
RAPACEAP EQU   ISTRAP+100                                               02152000
RAPICEAQ EQU   ISTRAP+96                                                02153000
RAPICEAC EQU   ISTRAP+92                                                02154000
RAPICELG EQU   ISTRAP+88                                                02155000
RAPAPPWD EQU   ISTRAP+80                                                02156000
RAPACBA  EQU   ISTRAP+72                                                02157000
RAPPRE   EQU   ISTRAP                                                   02158000
RDTVSRPL EQU   ISTRDT+132                                               02159000
RDTCRSPW EQU   ISTRDT+124                                               02160000
RDTCRSDS EQU   ISTRDT+116                                               02161000
@NM00064 EQU   ISTRDT+113                                               02162000
RRNSTCNT EQU   RDTSTCNT                                                 02163000
RRNVYRPH EQU   RDTVYRPH                                                 02164000
RDTTPAB  EQU   ISTRDT+104                                               02165000
RDTDPAB  EQU   ISTRDT+100                                               02166000
RDTEPAB  EQU   ISTRDT+96                                                02167000
RDTVPAB  EQU   ISTRDT+92                                                02168000
RDTRSV01 EQU   RDTFLAGB                                                 02169000
RDTBHSET EQU   RDTFLAGB                                                 02170000
RDTCTCFL EQU   RDTFLAGB                                                 02171000
RDTCTPGD EQU   RDTFLAGB                                                 02172000
RDTPRGDN EQU   RDTFLAGB                                                 02173000
RDTOUERP EQU   RDTFLAGB                                                 02174000
RDTLGCT  EQU   ISTRDT+90                                                02175000
RDTNODID EQU   ISTRDT+89                                                02176000
RDTMAXID EQU   ISTRDT+88                                                02177000
RDTCTSNT EQU   ISTRDT+86                                                02178000
RDTFLAGS EQU   ISTRDT+84                                                02179000
RDTBACK  EQU   ISTRDT+80                                                02180000
RDTFORW  EQU   ISTRDT+76                                                02181000
RDTLEN   EQU   RDTPLEN+1                                                02182000
RDTPRILS EQU   RDTPRIOR                                                 02183000
RDTPRISW EQU   RDTPRIOR                                                 02184000
RDTPRIRN EQU   RDTPRIOR                                                 02185000
RDTPRILC EQU   RDTPRIOR                                                 02186000
RDTPRIAP EQU   RDTPRIOR                                                 02187000
@NM00063 EQU   RDTPRIOR                                                 02188000
RDTPRE   EQU   ISTRDT                                                   02189000
RCPRSV05 EQU   ISTRCPRE+120                                             02190000
RCPRSV04 EQU   ISTRCPRE+116                                             02191000
RCPRSV03 EQU   ISTRCPRE+112                                             02192000
RCPINTA  EQU   RCPLGNIN+16                                              02193000
RCPLGNCT EQU   RCPLGNIN+8                                               02194000
RCPLGNAP EQU   RCPLGNIN                                                 02195000
@NM00062 EQU   RCPPMODE                                                 02196000
RCPRRECD EQU   RCPPMODE                                                 02197000
RCPRBASC EQU   RCPPMODE                                                 02198000
RCPBFLIM EQU   ISTRCPRE+90                                              02199000
RCPBHSI2 EQU   ISTRCPRE+89                                              02200000
RCPBHSI1 EQU   ISTRCPRE+88                                              02201000
RCPACETR EQU   ISTRCPRE+84                                              02202000
RCPICEAQ EQU   ISTRCPRE+80                                              02203000
RCPLNAPA EQU   ISTRCPRE+76                                              02204000
RCPICELN EQU   ISTRCPRE+72                                              02205000
RCPPRE   EQU   ISTRCPRE                                                 02206000
RPRCONID EQU   ISTRPRE+63                                               02207000
RPRCLVPD EQU   RPRFLAGC                                                 02208000
RPRINIMM EQU   RPRFLAGD                                                 02209000
RPRRSV05 EQU   RPRFLAGD                                                 02210000
RPRCONP  EQU   RPRFLAGD                                                 02211000
RPRACTP  EQU   RPRFLAGD                                                 02212000
RPRRSON  EQU   RPRFLAGD                                                 02213000
RPRCONCT EQU   RPRFLAGD                                                 02214000
RPRLTASN EQU   RPRFLAGD                                                 02215000
RPRPTHCT EQU   ISTRPRE+60                                               02216000
RPRSWDAF EQU   ISTRPRE+58                                               02217000
RPRSTPCT EQU   ISTRPRE+56                                               02218000
RPRRVPT1 EQU   ISTRPRE+52                                               02219000
RPRDEVCH EQU   ISTRPRE+44                                               02220000
RPRNCBA  EQU   ISTRPRE+40                                               02221000
RPRNSNEA EQU   ISTRPRE+36                                               02222000
RPRLGONB EQU   ISTRPRE+32                                               02223000
RPRHDTYP EQU   ISTRPRE+27                                               02224000
RPRTIOCT EQU   ISTRPRE+26                                               02225000
RPRPEPCT EQU   ISTRPRE+24                                               02226000
RPRRSV03 EQU   RPRCAUSE                                                 02227000
RPRRSYNC EQU   RPRCAUSE                                                 02228000
RPRCRCPT EQU   RPRCAUSE                                                 02229000
RPRNOSRT EQU   RPRCAUSE                                                 02230000
RPRINTST EQU   RPRFLAGB                                                 02231000
RPRVYIMM EQU   RPRFLAGB                                                 02232000
RPRHLVPD EQU   RPRFLAGB                                                 02233000
RPRVIODN EQU   RPRFLAGB                                                 02234000
RPRAOPN  EQU   RPRFLAGB                                                 02235000
RPRENTVT EQU   RPRFLAGB                                                 02236000
RPRENTVH EQU   RPRFLAGB                                                 02237000
RPRLIVE  EQU   RPRFLAGA                                                 02238000
RPRVRYPD EQU   RPRFLAGA                                                 02239000
RPRENTED EQU   RPRFLAGA                                                 02240000
RPRENTIO EQU   RPRFLAGA                                                 02241000
RPRENTBF EQU   RPRFLAGA                                                 02242000
RPRTIED  EQU   RPRFLAGA                                                 02243000
RPRINV   EQU   RPRFLAGA                                                 02244000
RPRACT   EQU   RPRFLAGA                                                 02245000
RPRENTRY EQU   ISTRPRE+20                                               02246000
RPRPELEN EQU   ISTRPRE+18                                               02247000
RPRELEN  EQU   ISTRPRE+16                                               02248000
RPRRLOCK EQU   ISTRPRE+12                                               02249000
RPRDAF   EQU   RPRCOMID+2                                               02250000
RPRSAF   EQU   RPRCOMID                                                 02251000
DEVRSV03 EQU   ISTDEVCH+5                                               02252000
DEVPHYSA EQU   ISTDEVCH+4                                               02253000
DEVCSLPN EQU   DEVCHAR3                                                 02254000
DEVCSTCL EQU   DEVCHAR3                                                 02255000
DEVCCHEK EQU   DEVCHAR3                                                 02256000
DEVCATTN EQU   DEVCHAR3                                                 02257000
DEVCSWL  EQU   DEVFCCTL                                                 02258000
DEVCRVB  EQU   DEVFCCTL                                                 02259000
DEVCSSL  EQU   DEVFCCTL                                                 02260000
DEVCBSC  EQU   DEVFCCTL                                                 02261000
DEVMCODE EQU   ISTDEVCH+2                                               02262000
DEVCHAR2 EQU   DEVTCODE                                                 02263000
DEVRSV01 EQU   DEVCHAR                                                  02264000
DEVCCTL  EQU   DEVCHAR                                                  02265000
DEVNNSPT EQU   DEVCHAR                                                  02266000
DEVSPS   EQU   DEVCHAR                                                  02267000
DEVSUBND EQU   DEVCHAR                                                  02268000
DEVCONVR EQU   DEVCHAR                                                  02269000
DEVOTPUT EQU   DEVCHAR                                                  02270000
DEVINPUT EQU   DEVCHAR                                                  02271000
ACDREFQ  EQU   ISTACDEB+204                                             02272000
ACDASFQ  EQU   ISTACDEB+200                                             02273000
ACDSOP   EQU   ISTACDEB+184                                             02274000
ACDSIP   EQU   ISTACDEB+168                                             02275000
ACDRSV24 EQU   ACDVTAM+108                                              02276000
ACDRSV23 EQU   ACDVTAM+104                                              02277000
ACDRSV22 EQU   ACDVTAM+100                                              02278000
ACDOCWAD EQU   ACDVTAM+96                                               02279000
ACDRSV10 EQU   ACDVTAM+92                                               02280000
ACDAPDDT EQU   ACDAPDAT+1                                               02281000
ACDAPDLN EQU   ACDAPDAT                                                 02282000
ACDRSV07 EQU   ACDVTAM+82                                               02283000
ACDRSV06 EQU   ACDVTAM+81                                               02284000
ACDRSV09 EQU   ACDSSFLG                                                 02285000
ACDAICLS EQU   ACDSSFLG                                                 02286000
ACDABEND EQU   ACDSSFLG                                                 02287000
ACDCACB  EQU   ACDSSFLG                                                 02288000
ACDRSV21 EQU   ACDVTAM+64                                               02289000
ACDSSPAB EQU   ACDVTAM+48                                               02290000
ACDNEPAB EQU   ACDVTAM+32                                               02291000
ACDRSV20 EQU   ACDVTAM+20                                               02292000
ACDRARQ  EQU   ACDVTAM+16                                               02293000
ACDRAFQ  EQU   ACDVTAM+12                                               02294000
ACDFMCB  EQU   ACDVTAM+8                                                02295000
ACDLOCK  EQU   ACDVTAM                                                  02296000
ACDAPP   EQU   ACDAPPAD+1                                               02297000
ACDEXSCL EQU   ACDAPPAD                                                 02298000
ACDACB   EQU   ACDACBAD+1                                               02299000
ACDDEBID EQU   ACDACBAD                                                 02300000
ACDPROTG EQU   ACDACBAD                                                 02301000
ACDECBAD EQU   ACDBASIC+20                                              02302000
ACDUSRPB EQU   ACDUSRPG+1                                               02303000
ACDNMEXT EQU   ACDUSRPG                                                 02304000
ACDPRLEN EQU   ACDBASIC+15                                              02305000
ACDFLGS1 EQU   ACDBASIC+14                                              02306000
ACDQSCNT EQU   ACDBASIC+13                                              02307000
ACDOPATB EQU   ACDBASIC+12                                              02308000
ACDIRBAD EQU   ACDBASIC+8                                               02309000
ACDDEB   EQU   ACDDEBAD+1                                               02310000
ACDAMLNG EQU   ACDDEBAD                                                 02311000
ACDOPNAD EQU   ACDNMSUB                                                 02312000
ACDRSV03 EQU   ACDTBLOF+1                                               02313000
ACDRSV02 EQU   ACDTBLOF                                                 02314000
ACDAMTYP EQU   ACDDBPFX+5                                               02315000
ACDLENG  EQU   ACDDBPFX+4                                               02316000
ACDDEBX  EQU   ACDDBPFX                                                 02317000
ACDRSV08 EQU   ACDVTPRX+12                                              02318000
ACDTSKID EQU   ACDVTPRX+8                                               02319000
ACDCHN   EQU   ACDVTPRX+4                                               02320000
ACDSAF   EQU   ACDVTPRX+2                                               02321000
ACDLNGTH EQU   ACDVTPRX+1                                               02322000
ACDTYPE  EQU   ACDVTPRX                                                 02323000
LOKXCL   EQU   @NM00060                                                 02324000
LOKPRY   EQU   @NM00060                                                 02325000
@NM00061 EQU   @NM00060                                                 02326000
@NM00059 EQU   LOKCHNG                                                  02327000
LOKCT    EQU   ISTLOK                                                   02328000
DCERSV01 EQU   ISTDCE+12                                                02329000
DCETERM  EQU   ISTDCE+8                                                 02330000
MPSSRB1  EQU   ISTMPST+172                                              02331000
MPSSAVE  EQU   ISTMPST+140                                              02332000
MPSMQLBP EQU   ISTMPST+136                                              02333000
MPSSYSRT EQU   ISTMPST+132                                              02334000
MPSQEL   EQU   ISTMPST+128                                              02335000
MPSASCB  EQU   ISTMPST+120                                              02336000
MPSTPPAB EQU   ISTMPST+88                                               02337000
MPSSMPAB EQU   ISTMPST+56                                               02338000
MPSSMRPH EQU   ISTMPST+52                                               02339000
MPSSRB55 EQU   ISTMPST+48                                               02340000
MPSRPLAC EQU   MPSRPLCT+2                                               02341000
MPSRPLRC EQU   MPSRPLCT                                                 02342000
MPSCRPLQ EQU   MPSCRPL                                                  02343000
MPSSRBAC EQU   MPSSRBCT+2                                               02344000
MPSSRBRC EQU   MPSSRBCT                                                 02345000
MPSSRBQ  EQU   MPSSRB                                                   02346000
MPSCRAAC EQU   MPSCRACT+2                                               02347000
MPSCRARC EQU   MPSCRACT                                                 02348000
MPSCRAQ  EQU   MPSCRA                                                   02349000
MPSMPSTP EQU   ISTMPST+20                                               02350000
MPSPSTCT EQU   ISTMPST+16                                               02351000
MPSRSV02 EQU   MPSFLGA+1                                                02352000
MPSPSTAB EQU   MPSFLGA                                                  02353000
MPSRSV01 EQU   MPSFLGA                                                  02354000
MPSTPBU  EQU   MPSFLGA                                                  02355000
MPMEMTRM EQU   MPSFLGA                                                  02356000
MPSAUTH  EQU   MPSFLGA                                                  02357000
MPSCRAO  EQU   MPSFLGA                                                  02358000
MPSSRBO  EQU   MPSFLGA                                                  02359000
MPSRQUEG EQU   MPSRQUE                                                  02360000
MPSTSOIW EQU   MPSRSV07                                                 02361000
MPSID    EQU   ISTMPST                                                  02362000
DYPPAB   EQU   ISTDYPAB+16                                              02363000
DYPRSV01 EQU   ISTDYPAB+12                                              02364000
DYPTSKID EQU   ISTDYPAB+8                                               02365000
DYPCHAIN EQU   ISTDYPAB+4                                               02366000
DYPFLGS  EQU   ISTDYPAB+2                                               02367000
DYPLNGTH EQU   ISTDYPAB+1                                               02368000
DYPTYPE  EQU   ISTDYPAB                                                 02369000
PABRPHA  EQU   PABRPHFG+1                                               02370000
PABNODQ  EQU   PABFLAGS                                                 02371000
PABINHBT EQU   PABFLAGS                                                 02372000
PABERLOK EQU   PABERRLK                                                 02373000
PABSSN   EQU   PABFLAGS                                                 02374000
PABDYNAM EQU   PABFLAGS                                                 02375000
PABNORPR EQU   PABFLAGS                                                 02376000
PABPRIOR EQU   PABFLAGS                                                 02377000
PABAPYP  EQU   PABFLAGS                                                 02378000
PABDVTA  EQU   ISTPAB+9                                                 02379000
PABOFFST EQU   ISTPAB+8                                                 02380000
PABCHNGP EQU   PABCHAIN+1                                               02381000
PABRSV02 EQU   PABCHAIN                                                 02382000
PABDELAY EQU   PABCHAIN                                                 02383000
PABRUNNG EQU   PABCHAIN                                                 02384000
PABRESET EQU   PABCHAIN                                                 02385000
PABUNCON EQU   PABCHAIN                                                 02386000
PABCDP   EQU   PABCHAIN                                                 02387000
PABRESCH EQU   PABCHAIN                                                 02388000
PABCHNG  EQU   PABCHAIN                                                 02389000
PABWEQP  EQU   PABWEQA+1                                                02390000
PABRSV01 EQU   PABWEQA                                                  02391000
PABWEQG  EQU   PABWEQA                                                  02392000
CVTLEVL  EQU   CVTRELNO+2                                               02393000
CVTNUMB  EQU   CVTRELNO                                                 02394000
CVTMDL   EQU   CVTFIX+250                                               02395000
@NM00058 EQU   CVTFIX+248                                               02396000
@NM00057 EQU   CVTFIX                                                   02397000
CVTRV482 EQU   CVTXTNT2+128                                             02398000
CVTRV481 EQU   CVTXTNT2+124                                             02399000
CVTRV480 EQU   CVTXTNT2+120                                             02400000
CVTRV479 EQU   CVTXTNT2+118                                             02401000
CVTRV478 EQU   CVTXTNT2+117                                             02402000
CVTRV477 EQU   CVTXTNT2+116                                             02403000
CVTRV476 EQU   CVTXTNT2+115                                             02404000
CVTRV475 EQU   CVTXTNT2+114                                             02405000
CVTRV474 EQU   CVTRV466                                                 02406000
CVTRV473 EQU   CVTRV466                                                 02407000
CVTRV472 EQU   CVTRV466                                                 02408000
CVTRV471 EQU   CVTRV466                                                 02409000
CVTRV470 EQU   CVTRV466                                                 02410000
CVTRV469 EQU   CVTRV466                                                 02411000
CVTRV468 EQU   CVTRV466                                                 02412000
CVTRV467 EQU   CVTRV466                                                 02413000
CVTRV465 EQU   CVTRV457                                                 02414000
CVTRV464 EQU   CVTRV457                                                 02415000
CVTRV463 EQU   CVTRV457                                                 02416000
CVTRV462 EQU   CVTRV457                                                 02417000
CVTRV461 EQU   CVTRV457                                                 02418000
CVTRV460 EQU   CVTRV457                                                 02419000
CVTRV459 EQU   CVTRV457                                                 02420000
CVTRV458 EQU   CVTRV457                                                 02421000
CVTRV456 EQU   CVTXTNT2+108                                             02422000
CVTRV455 EQU   CVTXTNT2+104                                             02423000
CVTRV454 EQU   CVTXTNT2+100                                             02424000
CVTRV453 EQU   CVTXTNT2+96                                              02425000
CVTRV452 EQU   CVTXTNT2+94                                              02426000
CVTRV451 EQU   CVTXTNT2+92                                              02427000
CVTRV450 EQU   CVTXTNT2+90                                              02428000
CVTRV449 EQU   CVTXTNT2+88                                              02429000
CVTRV448 EQU   CVTXTNT2+87                                              02430000
CVTRV447 EQU   CVTXTNT2+86                                              02431000
CVTRV446 EQU   CVTRV438                                                 02432000
CVTRV445 EQU   CVTRV438                                                 02433000
CVTRV444 EQU   CVTRV438                                                 02434000
CVTRV443 EQU   CVTRV438                                                 02435000
CVTRV442 EQU   CVTRV438                                                 02436000
CVTRV441 EQU   CVTRV438                                                 02437000
CVTRV440 EQU   CVTRV438                                                 02438000
CVTRV439 EQU   CVTRV438                                                 02439000
CVTRV437 EQU   CVTRV429                                                 02440000
CVTRV436 EQU   CVTRV429                                                 02441000
CVTRV435 EQU   CVTRV429                                                 02442000
CVTRV434 EQU   CVTRV429                                                 02443000
CVTRV433 EQU   CVTRV429                                                 02444000
CVTRV432 EQU   CVTRV429                                                 02445000
CVTRV431 EQU   CVTRV429                                                 02446000
CVTRV430 EQU   CVTRV429                                                 02447000
CVTRV428 EQU   CVTXTNT2+80                                              02448000
CVTRV427 EQU   CVTXTNT2+76                                              02449000
CVTRV426 EQU   CVTXTNT2+72                                              02450000
CVTRV425 EQU   CVTXTNT2+68                                              02451000
CVTATACT EQU   CVTATCVT                                                 02452000
CVTRV423 EQU   CVTXTNT2+62                                              02453000
CVTRV422 EQU   CVTXTNT2+60                                              02454000
CVTRV421 EQU   CVTXTNT2+58                                              02455000
CVTRV420 EQU   CVTXTNT2+56                                              02456000
CVTRV419 EQU   CVTXTNT2+55                                              02457000
CVTRV418 EQU   CVTXTNT2+54                                              02458000
CVTRV417 EQU   CVTRV409                                                 02459000
CVTRV416 EQU   CVTRV409                                                 02460000
CVTRV415 EQU   CVTRV409                                                 02461000
CVTRV414 EQU   CVTRV409                                                 02462000
CVTRV413 EQU   CVTRV409                                                 02463000
CVTRV412 EQU   CVTRV409                                                 02464000
CVTRV411 EQU   CVTRV409                                                 02465000
CVTRV410 EQU   CVTRV409                                                 02466000
CVTRV408 EQU   CVTRV400                                                 02467000
CVTRV407 EQU   CVTRV400                                                 02468000
CVTRV406 EQU   CVTRV400                                                 02469000
CVTRV405 EQU   CVTRV400                                                 02470000
CVTRV404 EQU   CVTRV400                                                 02471000
CVTRV403 EQU   CVTRV400                                                 02472000
CVTRV402 EQU   CVTRV400                                                 02473000
CVTRV401 EQU   CVTRV400                                                 02474000
CVTICB   EQU   CVTXTNT2+48                                              02475000
CVTSKTA  EQU   CVTXTNT2+44                                              02476000
CVTSHSB  EQU   CVTSHS                                                   02477000
CVTRSV98 EQU   CVTXTNT2+36                                              02478000
CVTRSV97 EQU   CVTXTNT2+34                                              02479000
CVTRSV96 EQU   CVTXTNT2+32                                              02480000
CVTOLTEP EQU   CVTXTNT2+28                                              02481000
CVTQIDA  EQU   CVTQID+1                                                 02482000
CVTRSV95 EQU   CVTQID                                                   02483000
CVTRSV94 EQU   CVTXTNT2+20                                              02484000
CVTRSV93 EQU   CVTXTNT2+16                                              02485000
CVTRSV92 EQU   CVTXTNT2+12                                              02486000
CVTDEBVR EQU   CVTXTNT2+8                                               02487000
CVTRSV91 EQU   CVTXTNT2+6                                               02488000
CVTRSV9H EQU   CVTFLGBT                                                 02489000
CVTRSV9G EQU   CVTFLGBT                                                 02490000
CVTRSV9F EQU   CVTFLGBT                                                 02491000
CVTRSV9E EQU   CVTFLGBT                                                 02492000
CVTRSV9D EQU   CVTFLGBT                                                 02493000
CVTRSV9C EQU   CVTFLGBT                                                 02494000
CVTVME   EQU   CVTFLGBT                                                 02495000
CVTNPE   EQU   CVTFLGBT                                                 02496000
CVTNUCLS EQU   CVTXTNT2+4                                               02497000
CVTDSSVA EQU   CVTDSSV+1                                                02498000
CVTRSV89 EQU   CVTDSSV                                                  02499000
CVTRSV88 EQU   CVTXTNT1+8                                               02500000
CVTRSV87 EQU   CVTXTNT1+4                                               02501000
CVTFACHN EQU   CVTXTNT1                                                 02502000
CVTRV488 EQU   CVTMAP+412                                               02503000
CVTRV487 EQU   CVTMAP+408                                               02504000
CVTRV486 EQU   CVTMAP+404                                               02505000
CVTRV485 EQU   CVTMAP+400                                               02506000
CVTACTAP EQU   CVTMAP+396                                               02507000
CVTAUTH  EQU   CVTMAP+392                                               02508000
CVTATMCA EQU   CVTATMCT+1                                               02509000
CVTATMST EQU   CVTATMCT                                                 02510000
CVTRSV61 EQU   CVTMAP+384                                               02511000
CVTVOLT1 EQU   CVTVOLM1+1                                               02512000
CVTVOLI1 EQU   CVTVOLF1                                                 02513000
CVTSTOA  EQU   CVTMAP+376                                               02514000
CVTRSV58 EQU   CVTMAP+374                                               02515000
CVTRSV57 EQU   CVTMAP+372                                               02516000
CVTDDCE  EQU   CVTMAP+368                                               02517000
CVTPNWFR EQU   CVTMAP+364                                               02518000
CVTSMF   EQU   CVTMAP+360                                               02519000
CVTSULK  EQU   CVTMAP+358                                               02520000
CVTSLKO  EQU   CVTSYSK                                                  02521000
CVTSLKP  EQU   CVTSYSK                                                  02522000
CVTSLKQ  EQU   CVTSYSK                                                  02523000
CVTSLKR  EQU   CVTSYSK                                                  02524000
CVTRSV56 EQU   CVTSYSK                                                  02525000
CVTRSV55 EQU   CVTSYSK                                                  02526000
CVTRSV54 EQU   CVTSYSK                                                  02527000
CVTRSV53 EQU   CVTSYSK                                                  02528000
CVTRSV52 EQU   CVTA1F1                                                  02529000
CVTRSV51 EQU   CVTA1F1                                                  02530000
CVTRSV50 EQU   CVTA1F1                                                  02531000
CVTRSV49 EQU   CVTA1F1                                                  02532000
CVTRSV48 EQU   CVTA1F1                                                  02533000
CVTRSV47 EQU   CVTA1F1                                                  02534000
CVTSRSW  EQU   CVTA1F1                                                  02535000
CVTPFSW  EQU   CVTA1F1                                                  02536000
CVTPCVT  EQU   CVTMAP+352                                               02537000
CVTRSV46 EQU   CVTMAP+344                                               02538000
CVTRSV45 EQU   CVTMAP+340                                               02539000
CVTRSV44 EQU   CVTMAP+338                                               02540000
CVTRSV43 EQU   CVTMAP+336                                               02541000
CVTHJESA EQU   CVTHJES+1                                                02542000
CVTRSV42 EQU   CVTHJES                                                  02543000
CVTEXT2A EQU   CVTEXT2+1                                                02544000
CVTRSV41 EQU   CVTEXT2                                                  02545000
CVTAPFA  EQU   CVTAPF+1                                                 02546000
CVTRSV40 EQU   CVTAPF                                                   02547000
CVTRV518 EQU   CVTINTLA                                                 02548000
CVTRV517 EQU   CVTERPV                                                  02549000
CVTEORM  EQU   CVTMAP+312                                               02550000
CVTMCHPR EQU   CVTMAP+308                                               02551000
CVTTZ    EQU   CVTMAP+304                                               02552000
CVTJEPS  EQU   CVTMAP+300                                               02553000
CVTJESCT EQU   CVTMAP+296                                               02554000
CVTMODE  EQU   CVTMAP+292                                               02555000
CVTPTRV  EQU   CVTMAP+288                                               02556000
CVTREAL  EQU   CVTMAP+284                                               02557000
CVTRSV39 EQU   CVTMAP+280                                               02558000
CVTRSV38 EQU   CVTMAP+276                                               02559000
CVTDMSRA EQU   CVTDMSR+1                                                02560000
CVTRV634 EQU   CVTDMSRF                                                 02561000
CVTRV633 EQU   CVTDMSRF                                                 02562000
CVTRV632 EQU   CVTDMSRF                                                 02563000
CVTRV631 EQU   CVTDMSRF                                                 02564000
CVTRV630 EQU   CVTDMSRF                                                 02565000
CVTRV629 EQU   CVTDMSRF                                                 02566000
CVTUDUMP EQU   CVTDMSRF                                                 02567000
CVTSDUMP EQU   CVTDMSRF                                                 02568000
CVTQMSGA EQU   CVTQMSG+1                                                02569000
CVTRSV36 EQU   CVTQMSG                                                  02570000
CVTAMFF  EQU   CVTMAP+264                                               02571000
CVTPURGA EQU   CVTPURG+1                                                02572000
CVTRSV35 EQU   CVTPURG                                                  02573000
CVTCBSP  EQU   CVTMAP+256                                               02574000
CVTATERA EQU   CVTATER+1                                                02575000
CVTSYST  EQU   CVTATER                                                  02576000
CVTVOLT2 EQU   CVTTAT                                                   02577000
CVTVOLI2 EQU   CVTVOLF2                                                 02578000
CVTAQAVB EQU   CVTAQAVT+1                                               02579000
CVTRSV34 EQU   CVTTCMFG                                                 02580000
CVTRSV33 EQU   CVTTCMFG                                                 02581000
CVTRSV32 EQU   CVTTCMFG                                                 02582000
CVTRSV31 EQU   CVTTCMFG                                                 02583000
CVTRSV30 EQU   CVTTCMFG                                                 02584000
CVTRSV29 EQU   CVTTCMFG                                                 02585000
CVTRSV28 EQU   CVTTCMFG                                                 02586000
CVTTCRDY EQU   CVTTCMFG                                                 02587000
CVTGTFA  EQU   CVTGTF+1                                                 02588000
CVTRSV27 EQU   CVTGTFST                                                 02589000
CVTRNIO  EQU   CVTGTFST                                                 02590000
CVTUSR   EQU   CVTGTFST                                                 02591000
CVTRV318 EQU   CVTFORM                                                  02592000
CVTRV317 EQU   CVTTMODE                                                 02593000
CVTRV316 EQU   CVTSTATE                                                 02594000
CVTRV315 EQU   CVTGTFS                                                  02595000
CVTGTFAV EQU   CVTGTFS                                                  02596000
CVT0SCR1 EQU   CVTMAP+232                                               02597000
CVTRV515 EQU   CVTMAP+228                                               02598000
CVTRMS   EQU   CVTMAP+224                                               02599000
CVTPATCH EQU   CVTMAP+220                                               02600000
CVTTSCE  EQU   CVTMAP+216                                               02601000
CVTLNKSC EQU   CVTMAP+214                                               02602000
CVTQABST EQU   CVTMAP+212                                               02603000
CVTMDLDS EQU   CVTMAP+208                                               02604000
CVTUSER  EQU   CVTMAP+204                                               02605000
CVTABEND EQU   CVTMAP+200                                               02606000
CVTSMCA  EQU   CVTMAP+196                                               02607000
CVTRSV18 EQU   CVTMAP+192                                               02608000
CVTQLPAQ EQU   CVTMAP+188                                               02609000
CVTQCDSR EQU   CVTMAP+184                                               02610000
CVTRSV17 EQU   CVTOPTB                                                  02611000
CVTRSV16 EQU   CVTOPTB                                                  02612000
CVTFP    EQU   CVTOPTB                                                  02613000
CVTAPTHR EQU   CVTOPTB                                                  02614000
CVTNLOG  EQU   CVTOPTB                                                  02615000
CVTTOD   EQU   CVTOPTB                                                  02616000
CVTCTIMS EQU   CVTOPTB                                                  02617000
CVTPROT  EQU   CVTOPTB                                                  02618000
CVTXPFP  EQU   CVTOPTA                                                  02619000
CVTASCII EQU   CVTOPTA                                                  02620000
CVTRSV13 EQU   CVTOPTA                                                  02621000
CVTRSV12 EQU   CVTOPTA                                                  02622000
CVTNIP   EQU   CVTOPTA                                                  02623000
CVTDDR   EQU   CVTOPTA                                                  02624000
CVTAPR   EQU   CVTOPTA                                                  02625000
CVTCCH   EQU   CVTOPTA                                                  02626000
CVTSNCTR EQU   CVTMAP+180                                               02627000
CVTQMWR  EQU   CVTMAP+176                                               02628000
CVTQOCR  EQU   CVTMAP+172                                               02629000
CVT1EF00 EQU   CVTMAP+168                                               02630000
CVTMZ00  EQU   CVTMAP+164                                               02631000
CVTHEAD  EQU   CVTMAP+160                                               02632000
CVTRSV11 EQU   CVTMAP+156                                               02633000
CVT0PT01 EQU   CVTMAP+152                                               02634000
CVTMSER  EQU   CVTMAP+148                                               02635000
CVTRV516 EQU   CVTIERLC                                                 02636000
CVTILCH  EQU   CVTMAP+140                                               02637000
CVT0DS   EQU   CVTMAP+136                                               02638000
CVTFBOSV EQU   CVTMAP+132                                               02639000
CVTNUCB  EQU   CVTMAP+128                                               02640000
CVTIXAVL EQU   CVTMAP+124                                               02641000
CVTIOQET EQU   CVTMAP+120                                               02642000
CVTDCBA  EQU   CVTMAP+117                                               02643000
CVTMVS2  EQU   CVTDCB                                                   02644000
CVT6DAT  EQU   CVTDCB                                                   02645000
CVT4MPS  EQU   CVTDCB                                                   02646000
CVTRSV09 EQU   CVTDCB                                                   02647000
CVT4MS1  EQU   CVTDCB                                                   02648000
CVT2SPS  EQU   CVTDCB                                                   02649000
CVT1SSS  EQU   CVTDCB                                                   02650000
CVTRSV08 EQU   CVTDCB                                                   02651000
CVTSTB   EQU   CVTMAP+112                                               02652000
CVTQTD00 EQU   CVTMAP+108                                               02653000
CVTQTE00 EQU   CVTMAP+104                                               02654000
CVTCUCB  EQU   CVTMAP+100                                               02655000
CVTSJQ   EQU   CVTMAP+96                                                02656000
CVTPBLDL EQU   CVTMAP+92                                                02657000
CVTTPC   EQU   CVTMAP+88                                                02658000
CVTSVDCB EQU   CVTMAP+84                                                02659000
CVTBRET  EQU   CVTMAP+82                                                02660000
CVTEXIT  EQU   CVTMAP+80                                                02661000
CVT0FN00 EQU   CVTMAP+76                                                02662000
CVTDARA  EQU   CVTDAR+1                                                 02663000
CVTRSV07 EQU   CVTFLGS1                                                 02664000
CVTRSV06 EQU   CVTFLGS1                                                 02665000
CVTRSV05 EQU   CVTFLGS1                                                 02666000
CVTRSV04 EQU   CVTFLGS1                                                 02667000
CVTRSV03 EQU   CVTFLGS1                                                 02668000
CVTRSV02 EQU   CVTFLGS1                                                 02669000
CVTRSV01 EQU   CVTFLGS1                                                 02670000
CVTDMPLK EQU   CVTFLGS1                                                 02671000
CVTXITP  EQU   CVTMAP+68                                                02672000
CVTZDTAB EQU   CVTMAP+64                                                02673000
CVTMSLT  EQU   CVTMAP+60                                                02674000
CVTDATE  EQU   CVTMAP+56                                                02675000
CVTBTERM EQU   CVTMAP+52                                                02676000
CVTSYSAD EQU   CVTMAP+48                                                02677000
CVTXTLER EQU   CVTMAP+44                                                02678000
CVTILK2  EQU   CVTMAP+40                                                02679000
CVTILK1  EQU   CVTMAP+36                                                02680000
CVTPRLTV EQU   CVTMAP+32                                                02681000
CVTPCNVT EQU   CVTMAP+28                                                02682000
CVT0VL00 EQU   CVTMAP+24                                                02683000
CVTXAPG  EQU   CVTMAP+20                                                02684000
CVTBUF   EQU   CVTMAP+16                                                02685000
CVTJOB   EQU   CVTMAP+12                                                02686000
CVTLINK  EQU   CVTMAP+8                                                 02687000
CVT0EF00 EQU   CVTMAP+4                                                 02688000
CVTTCBP  EQU   CVTMAP                                                   02689000
CVT      EQU   CVTMAP                                                   02690000
@NM00054 EQU   TCBXTNT2+32                                              02691000
TCBRV181 EQU   TCBRV173                                                 02692000
TCBRV180 EQU   TCBRV173                                                 02693000
TCBRV179 EQU   TCBRV173                                                 02694000
TCBRV178 EQU   TCBRV173                                                 02695000
TCBRV177 EQU   TCBRV173                                                 02696000
TCBRV176 EQU   TCBRV173                                                 02697000
TCBRV175 EQU   TCBRV173                                                 02698000
TCBRV174 EQU   TCBRV173                                                 02699000
TCBRV172 EQU   TCBRV164                                                 02700000
TCBRV171 EQU   TCBRV164                                                 02701000
TCBRV170 EQU   TCBRV164                                                 02702000
TCBRV169 EQU   TCBRV164                                                 02703000
TCBRV168 EQU   TCBRV164                                                 02704000
TCBRV167 EQU   TCBRV164                                                 02705000
TCBRV166 EQU   TCBRV164                                                 02706000
TCBRV165 EQU   TCBRV164                                                 02707000
TCBRV163 EQU   TCBRV155                                                 02708000
TCBRV162 EQU   TCBRV155                                                 02709000
TCBRV161 EQU   TCBRV155                                                 02710000
TCBRV160 EQU   TCBRV155                                                 02711000
TCBRV159 EQU   TCBRV155                                                 02712000
TCBRV158 EQU   TCBRV155                                                 02713000
TCBRV157 EQU   TCBRV155                                                 02714000
TCBRV156 EQU   TCBRV155                                                 02715000
TCBRV154 EQU   TCBRV146                                                 02716000
TCBRV153 EQU   TCBRV146                                                 02717000
TCBRV152 EQU   TCBRV146                                                 02718000
TCBRV151 EQU   TCBRV146                                                 02719000
TCBRV150 EQU   TCBRV146                                                 02720000
TCBRV149 EQU   TCBRV146                                                 02721000
TCBRV148 EQU   TCBRV146                                                 02722000
TCBRV147 EQU   TCBRV146                                                 02723000
TCBRV145 EQU   TCBXTNT2+26                                              02724000
TCBRV144 EQU   TCBXTNT2+24                                              02725000
TCBRV143 EQU   TCBXTNT2+20                                              02726000
TCBRV142 EQU   TCBXTNT2+16                                              02727000
TCBRSV49 EQU   TCBXTNT2+12                                              02728000
TCBEVENT EQU   TCBXTNT2+8                                               02729000
TCBRCMP  EQU   TCBXTNT2+5                                               02730000
TCBRSVAB EQU   TCBXTNT2+4                                               02731000
TCBGTFA  EQU   TCBGTF+1                                                 02732000
TCBRSV47 EQU   TCBTFLG                                                  02733000
TCBRSV46 EQU   TCBTFLG                                                  02734000
TCBRSV45 EQU   TCBTFLG                                                  02735000
TCBRSV44 EQU   TCBTFLG                                                  02736000
TCBRSV43 EQU   TCBTFLG                                                  02737000
TCBDSPIT EQU   TCBTFLG                                                  02738000
TCBERRTN EQU   TCBTFLG                                                  02739000
TCBASYNC EQU   TCBTFLG                                                  02740000
@NM00053 EQU   TCB+296                                                  02741000
TCBSVCA2 EQU   TCB+292                                                  02742000
TCBSWASA EQU   TCB+288                                                  02743000
TCBDBTB  EQU   TCB+284                                                  02744000
TCBRPT   EQU   TCB+280                                                  02745000
TCBRV141 EQU   TCBRV133                                                 02746000
TCBRV140 EQU   TCBRV133                                                 02747000
TCBRV139 EQU   TCBRV133                                                 02748000
TCBRV138 EQU   TCBRV133                                                 02749000
TCBRV137 EQU   TCBRV133                                                 02750000
TCBRV136 EQU   TCBRV133                                                 02751000
TCBRV135 EQU   TCBRV133                                                 02752000
TCBRV134 EQU   TCBRV133                                                 02753000
TCBRV132 EQU   TCBRV124                                                 02754000
TCBRV131 EQU   TCBRV124                                                 02755000
TCBRV130 EQU   TCBRV124                                                 02756000
TCBRV129 EQU   TCBRV124                                                 02757000
TCBRV128 EQU   TCBRV124                                                 02758000
TCBRV127 EQU   TCBRV124                                                 02759000
TCBRV126 EQU   TCBRV124                                                 02760000
TCBRV125 EQU   TCBRV124                                                 02761000
TCBRV123 EQU   TCBFBYT2                                                 02762000
TCBRV122 EQU   TCBFBYT2                                                 02763000
TCBECBNV EQU   TCBFBYT2                                                 02764000
TCBSSSYN EQU   TCBFBYT2                                                 02765000
TCBFPRAP EQU   TCBFBYT2                                                 02766000
TCBFDW   EQU   TCBFBYT2                                                 02767000
TCBFMW   EQU   TCBFBYT2                                                 02768000
TCBCNCB  EQU   TCBFBYT2                                                 02769000
TCBLLH   EQU   TCBFBYT1                                                 02770000
TCBRV113 EQU   TCBFBYT1                                                 02771000
TCBEOT   EQU   TCBFBYT1                                                 02772000
TCBRTM2  EQU   TCBFBYT1                                                 02773000
TCBPGNLY EQU   TCBFBYT1                                                 02774000
TCBNDIOS EQU   TCBFBYT1                                                 02775000
TCBACTIV EQU   TCBFBYT1                                                 02776000
TCBEOTFM EQU   TCBFBYT1                                                 02777000
TCBAFFN  EQU   TCB+274                                                  02778000
TCBCCPVI EQU   TCB+272                                                  02779000
TCBUKYSP EQU   TCB+268                                                  02780000
TCBMODE  EQU   TCBESTAE+3                                               02781000
TCBERTYP EQU   TCBESTAE+2                                               02782000
TCBRV314 EQU   TCBESTRM                                                 02783000
TCBRV313 EQU   TCBESTRM                                                 02784000
TCBRV312 EQU   TCBESTRM                                                 02785000
TCBRV311 EQU   TCBESTRM                                                 02786000
TCBRV310 EQU   TCBESTRM                                                 02787000
TCBRV309 EQU   TCBESTRM                                                 02788000
TCBRV308 EQU   TCBESTRM                                                 02789000
TCBETERM EQU   TCBESTRM                                                 02790000
TCBSCBKY EQU   TCBESTAE                                                 02791000
TCBRTM12 EQU   TCB+260                                                  02792000
TCBTCBID EQU   TCB+256                                                  02793000
TCBRSV96 EQU   TCB+252                                                  02794000
TCBSWA   EQU   TCB+248                                                  02795000
TCBFOEA  EQU   TCBFOE+1                                                 02796000
TCBRSV42 EQU   TCBFOE                                                   02797000
TCBRV306 EQU   TCB+240                                                  02798000
TCBRSV41 EQU   TCB+239                                                  02799000
TCBTID   EQU   TCB+238                                                  02800000
TCBRSVAA EQU   TCB+237                                                  02801000
TCBABCUR EQU   TCB+236                                                  02802000
TCBTMSAV EQU   TCB+232                                                  02803000
TCBIOTIM EQU   TCB+228                                                  02804000
TCBRTWA  EQU   TCB+224                                                  02805000
TCBBACK  EQU   TCB+220                                                  02806000
TCBTIRB  EQU   TCB+216                                                  02807000
TCBAECB  EQU   TCB+212                                                  02808000
TCBEXT2A EQU   TCBEXT2+1                                                02809000
TCBRSV39 EQU   TCBEXT2                                                  02810000
TCBSTMCT EQU   TCB+207                                                  02811000
TCBSYSCT EQU   TCB+206                                                  02812000
TCBRSV37 EQU   TCB+205                                                  02813000
TCBEXSVC EQU   TCBDAR                                                   02814000
TCBDARMS EQU   TCBDAR                                                   02815000
TCBDARWT EQU   TCBDAR                                                   02816000
TCBDARO  EQU   TCBDAR                                                   02817000
TCBDARMC EQU   TCBDARC                                                  02818000
TCBDARD  EQU   TCBDAR                                                   02819000
TCBDARS  EQU   TCBDAR                                                   02820000
TCBDARP  EQU   TCBDAR                                                   02821000
TCBGTOFM EQU   TCBFLGS7                                                 02822000
TCBADMP  EQU   TCBFLGS7                                                 02823000
TCBRSTSK EQU   TCBFLGS7                                                 02824000
TCBSVCS  EQU   TCBFLGS7                                                 02825000
TCBSTACK EQU   TCBFLGS7                                                 02826000
TCBRSV34 EQU   TCBFLGS7                                                 02827000
TCBRSV33 EQU   TCBFLGS7                                                 02828000
TCBGPECB EQU   TCBFLGS7                                                 02829000
TCBNTJS  EQU   TCBFLGS6                                                 02830000
TCBAPG   EQU   TCBFLGS6                                                 02831000
TCBMIGR  EQU   TCBFLGS6                                                 02832000
TCBRV303 EQU   TCBFLGS6                                                 02833000
TCBSPVLK EQU   TCBFLGS6                                                 02834000
TCBCPU   EQU   TCBFLGS6                                                 02835000
TCBPIE17 EQU   TCBFLGS6                                                 02836000
TCBRV    EQU   TCBFLGS6                                                 02837000
TCBRSV79 EQU   TCBNDSP5                                                 02838000
TCBRSV78 EQU   TCBNDSP5                                                 02839000
TCBRSV77 EQU   TCBNDSP5                                                 02840000
TCBRSV76 EQU   TCBNDSP5                                                 02841000
TCBRSV75 EQU   TCBNDSP5                                                 02842000
TCBRSV74 EQU   TCBNDSP5                                                 02843000
TCBRSV95 EQU   TCBNDSP5                                                 02844000
TCBRSV94 EQU   TCBNDSP5                                                 02845000
TCBRSV93 EQU   TCBNDSP4                                                 02846000
TCBRSV92 EQU   TCBNDSP4                                                 02847000
TCBRSV91 EQU   TCBNDSP4                                                 02848000
TCBRSV90 EQU   TCBNDSP4                                                 02849000
TCBRSV89 EQU   TCBNDSP4                                                 02850000
TCBRSV88 EQU   TCBNDSP4                                                 02851000
TCBRSV87 EQU   TCBNDSP4                                                 02852000
TCBRSV86 EQU   TCBNDSP4                                                 02853000
TCBEXT1A EQU   TCBEXT1+1                                                02854000
TCBRSV32 EQU   TCBEXT1                                                  02855000
TCBEXCPD EQU   TCB+192                                                  02856000
TCBIOBRC EQU   TCB+188                                                  02857000
TCBDDWTC EQU   TCB+186                                                  02858000
TCBDDEXC EQU   TCB+184                                                  02859000
TCBJSCBB EQU   TCBJSCB+1                                                02860000
@NM00052 EQU   TCBRECDE                                                 02861000
TCBREC   EQU   TCBRECDE                                                 02862000
TCBMDIDS EQU   TCB+176                                                  02863000
TCBNDINT EQU   TCBNDSP3                                                 02864000
TCBRSV27 EQU   TCBNDSP3                                                 02865000
TCBRSV26 EQU   TCBNDSP3                                                 02866000
TCBRSV25 EQU   TCBNDSP3                                                 02867000
TCBRSV24 EQU   TCBNDSP3                                                 02868000
TCBSRBND EQU   TCBNDSP3                                                 02869000
TCBRV302 EQU   TCBNDSP3                                                 02870000
TCBLJSND EQU   TCBNDSP3                                                 02871000
TCBABE   EQU   TCBNDSP2                                                 02872000
TCBDSS   EQU   TCBNDSP2                                                 02873000
TCBOWAIT EQU   TCBNDSP2                                                 02874000
TCBIWAIT EQU   TCBNDSP2                                                 02875000
TCBNDTS  EQU   TCBNDSP2                                                 02876000
TCBNDSVC EQU   TCBNDSP2                                                 02877000
TCBSTPP  EQU   TCBNDSP2                                                 02878000
TCBABD   EQU   TCBNDSP2                                                 02879000
TCBRSV22 EQU   TCBNDSP1                                                 02880000
TCBPIEND EQU   TCBNDSP1                                                 02881000
TCBTPSP  EQU   TCBNDSP1                                                 02882000
TCBDDRND EQU   TCBNDSP1                                                 02883000
TCBRSPND EQU   TCBNDSP1                                                 02884000
TCBRSTND EQU   TCBNDSP1                                                 02885000
TCBDARPN EQU   TCBNDSP1                                                 02886000
TCBDARTN EQU   TCBNDSP1                                                 02887000
TCBNDSP0 EQU   TCBNDSP                                                  02888000
TCBUSER  EQU   TCB+168                                                  02889000
TCBTCTB  EQU   TCBTCT+1                                                 02890000
TCBRSV9C EQU   TCBTCTGF                                                 02891000
TCBRSV9B EQU   TCBTCTGF                                                 02892000
TCBRSV9A EQU   TCBTCTGF                                                 02893000
TCBRSV99 EQU   TCBTCTGF                                                 02894000
TCBRSV98 EQU   TCBTCTGF                                                 02895000
TCBRSV97 EQU   TCBTCTGF                                                 02896000
TCBRSV20 EQU   TCBTCTGF                                                 02897000
TCBSMFGF EQU   TCBTCTGF                                                 02898000
TCBSTABB EQU   TCBSTAB+1                                                02899000
TCBSTCUR EQU   TCBNSTAE                                                 02900000
TCBRV301 EQU   TCBNSTAE                                                 02901000
TCBSYNCH EQU   TCBNSTAE                                                 02902000
TCBHALT  EQU   TCBNSTAE                                                 02903000
TCBPPSUP EQU   TCBNSTAE                                                 02904000
TCB33E   EQU   TCBNSTAE                                                 02905000
TCBQUIES EQU   TCBNSTAE                                                 02906000
TCBSTABE EQU   TCBNSTAE                                                 02907000
TCBAQE   EQU   TCB+156                                                  02908000
TCBPQE   EQU   TCB+152                                                  02909000
TCBTSDP  EQU   TCB+151                                                  02910000
TCBTSLP  EQU   TCB+150                                                  02911000
TCBSTPCT EQU   TCB+149                                                  02912000
TCBCPUBN EQU   TCBTSFLG                                                 02913000
TCBDYDSP EQU   TCBTSFLG                                                 02914000
TCBRSV18 EQU   TCBTSFLG                                                 02915000
TCBRSV17 EQU   TCBTSFLG                                                 02916000
TCBTIOTG EQU   TCBTSFLG                                                 02917000
TCBATT   EQU   TCBTSFLG                                                 02918000
TCBSTPPR EQU   TCBTSFLG                                                 02919000
TCBRV300 EQU   TCBTSTSK                                                 02920000
TCBECB   EQU   TCB+144                                                  02921000
TCBIQE   EQU   TCB+140                                                  02922000
TCBLTC   EQU   TCB+136                                                  02923000
TCBOTC   EQU   TCB+132                                                  02924000
TCBNTC   EQU   TCB+128                                                  02925000
TCBJSTCA EQU   TCBJSTCB+1                                               02926000
TCBRSV16 EQU   TCBJSTCB                                                 02927000
TCBTQET  EQU   TCBTME                                                   02928000
TCBTCB   EQU   TCB+116                                                  02929000
TCBFSAB  EQU   TCBFSA+1                                                 02930000
TCBQEL   EQU   TCBFSA                                                   02931000
TCBGRS15 EQU   TCBGRS+60                                                02932000
TCBGRS14 EQU   TCBGRS+56                                                02933000
TCBGRS13 EQU   TCBGRS+52                                                02934000
TCBGRS12 EQU   TCBGRS+48                                                02935000
TCBGRS11 EQU   TCBGRS+44                                                02936000
TCBGRS10 EQU   TCBGRS+40                                                02937000
TCBGRS9  EQU   TCBGRS+36                                                02938000
TCBGRS8  EQU   TCBGRS+32                                                02939000
TCBGRS7  EQU   TCBGRS+28                                                02940000
TCBGRS6  EQU   TCBGRS+24                                                02941000
TCBGRS5  EQU   TCBGRS+20                                                02942000
TCBGRS4  EQU   TCBGRS+16                                                02943000
TCBGRS3  EQU   TCBGRS+12                                                02944000
TCBGRS2  EQU   TCBGRS+8                                                 02945000
TCBGRS1  EQU   TCBGRS+4                                                 02946000
TCBGRS0  EQU   TCBGRS                                                   02947000
TCBJPQB  EQU   TCBJPQ+1                                                 02948000
TCBRSV15 EQU   TCBPURGE                                                 02949000
TCBRSV14 EQU   TCBPURGE                                                 02950000
TCBRSV13 EQU   TCBPURGE                                                 02951000
TCBRSV12 EQU   TCBPURGE                                                 02952000
TCBRSV11 EQU   TCBPURGE                                                 02953000
TCBRSV10 EQU   TCBPURGE                                                 02954000
TCBRSV09 EQU   TCBPURGE                                                 02955000
TCBJPQF  EQU   TCBPURGE                                                 02956000
TCBJLB   EQU   TCB+40                                                   02957000
TCBLLS   EQU   TCB+36                                                   02958000
TCBDSP   EQU   TCB+35                                                   02959000
TCBLMP   EQU   TCB+34                                                   02960000
TCBPNDSP EQU   TCBFLGS5                                                 02961000
TCBFCD1  EQU   TCBFLGS5                                                 02962000
TCBSTP   EQU   TCBFLGS5                                                 02963000
TCBSYS   EQU   TCBFLGS5                                                 02964000
TCBANDSP EQU   TCBFLGS5                                                 02965000
TCBPAGE  EQU   TCBFLGS5                                                 02966000
TCBUXNDF EQU   TCBABWF                                                  02967000
TCBFC    EQU   TCBFLGS5                                                 02968000
TCBONDSP EQU   TCBFLGS4                                                 02969000
TCBMPCND EQU   TCBFLGS4                                                 02970000
TCBMPCVQ EQU   TCBFLGS4                                                 02971000
TCBUXNDV EQU   TCBFLGS4                                                 02972000
TCBHNDSP EQU   TCBFLGS4                                                 02973000
TCBRQENA EQU   TCBFLGS4                                                 02974000
TCBSER   EQU   TCBFLGS4                                                 02975000
TCBNDUMP EQU   TCBFLGS4                                                 02976000
TCBDWSTA EQU   TCBFLGS3                                                 02977000
TCBRSV08 EQU   TCBFLGS3                                                 02978000
TCBRSV07 EQU   TCBFLGS3                                                 02979000
TCBRSV06 EQU   TCBFLGS3                                                 02980000
TCBABGM  EQU   TCBFLGS3                                                 02981000
TCBABTRM EQU   TCBFLGS3                                                 02982000
TCBADINP EQU   TCBFLGS3                                                 02983000
TCBFSM   EQU   TCBFLGS3                                                 02984000
TCBFTS   EQU   TCBFLGS2                                                 02985000
TCBFETXR EQU   TCBFLGS2                                                 02986000
TCBFDSOP EQU   TCBFLGS2                                                 02987000
TCBFJMC  EQU   TCBFLGS2                                                 02988000
TCBFSMC  EQU   TCBFLGS2                                                 02989000
TCBFABOP EQU   TCBFLGS2                                                 02990000
TCBFSTI  EQU   TCBFLGS2                                                 02991000
TCBFOINP EQU   TCBFLGS2                                                 02992000
TCBFX    EQU   TCBFLGS1                                                 02993000
TCBFS    EQU   TCBFLGS1                                                 02994000
TCBFT    EQU   TCBFLGS1                                                 02995000
TCBPDUMP EQU   TCBFLGS1                                                 02996000
TCBNONPR EQU   TCBFLGS1                                                 02997000
TCBFERA  EQU   TCBFLGS1                                                 02998000
TCBFE    EQU   TCBFLGS1                                                 02999000
TCBFA    EQU   TCBFLGS1                                                 03000000
TCBZERO  EQU   TCBPKF                                                   03001000
TCBFLAG  EQU   TCBPKF                                                   03002000
TCBMSSB  EQU   TCBMSS+1                                                 03003000
TCBRSV03 EQU   TCBMSS                                                   03004000
TCBTRNB  EQU   TCBTRN+1                                                 03005000
TCBRSV02 EQU   TCBABF                                                   03006000
TCBOLTEP EQU   TCBABF                                                   03007000
TCBTCP   EQU   TCBABF                                                   03008000
TCBTCPP  EQU   TCBABF                                                   03009000
TCBRSV01 EQU   TCBABF                                                   03010000
TCBGRPH  EQU   TCBABF                                                   03011000
TCBNOCHK EQU   TCBABF                                                   03012000
TCBMOD91 EQU   TCBABF                                                   03013000
TCBCMPC  EQU   TCBCMP+1                                                 03014000
TCBRV318 EQU   TCBCMSG                                                  03015000
TCBRV317 EQU   TCBCIND                                                  03016000
TCBRV316 EQU   TCBCWTO                                                  03017000
TCBCASID EQU   TCBCDBL                                                  03018000
TCBNOCC  EQU   TCBSTCC                                                  03019000
TCBDMPO  EQU   TCBCPP                                                   03020000
TCBCSTEP EQU   TCBCMPF                                                  03021000
TCBCREQ  EQU   TCBCMPF                                                  03022000
TCBDEB   EQU   TCB+8                                                    03023000
TCBPIEA  EQU   TCBPIE+1                                                 03024000
TCBPM    EQU   TCBPMASK                                                 03025000
@NM00051 EQU   TCBPMASK                                                 03026000
TCBRBP   EQU   TCB                                                      03027000
TCBFRS6  EQU   TCBFRS+24                                                03028000
TCBFRS4  EQU   TCBFRS+16                                                03029000
TCBFRS2  EQU   TCBFRS+8                                                 03030000
TCBFRS0  EQU   TCBFRS                                                   03031000
@NM00050 EQU   SDWA+512                                                 03032000
@NM00049 EQU   SDWADPVA                                                 03033000
SDWAEBC  EQU   SDWADPVA                                                 03034000
SDWAHEX  EQU   SDWADPVA                                                 03035000
SDWAVRAL EQU   SDWARA                                                   03036000
@NM00048 EQU   SDWA+396                                                 03037000
SDWACOMP EQU   SDWA+392                                                 03038000
SDWARCPL EQU   SDWA+364                                                 03039000
@NM00047 EQU   SDWADPSA+32                                              03040000
SDWATO4  EQU   SDWADPSL+28                                              03041000
SDWAFRM4 EQU   SDWADPSL+24                                              03042000
SDWATO3  EQU   SDWADPSL+20                                              03043000
SDWAFRM3 EQU   SDWADPSL+16                                              03044000
SDWATO2  EQU   SDWADPSL+12                                              03045000
SDWAFRM2 EQU   SDWADPSL+8                                               03046000
SDWATO1  EQU   SDWADPSL+4                                               03047000
SDWAFRM1 EQU   SDWADPSL                                                 03048000
@NM00046 EQU   SDWADDAT+3                                               03049000
@NM00045 EQU   SDWAPDAT                                                 03050000
SDWAUSPL EQU   SDWAPDAT                                                 03051000
SDWADPSW EQU   SDWAPDAT                                                 03052000
SDWATJPA EQU   SDWAPDAT                                                 03053000
SDWATLPA EQU   SDWAPDAT                                                 03054000
SDWADREG EQU   SDWAPDAT                                                 03055000
SDWADSAH EQU   SDWAPDAT                                                 03056000
SDWADSAS EQU   SDWAPDAT                                                 03057000
@NM00044 EQU   SDWADDAT+1                                               03058000
@NM00043 EQU   SDWASDAT                                                 03059000
SDWAQQS  EQU   SDWASDAT                                                 03060000
SDWACBS  EQU   SDWASDAT                                                 03061000
SDWAGTF  EQU   SDWASDAT                                                 03062000
SDWASWA  EQU   SDWASDAT                                                 03063000
SDWALSQA EQU   SDWASDAT                                                 03064000
SDWASQA  EQU   SDWASDAT                                                 03065000
SDWANUC  EQU   SDWASDAT                                                 03066000
@NM00042 EQU   SDWADUMP+2                                               03067000
@NM00041 EQU   SDWADPFS                                                 03068000
SDWASLST EQU   SDWADPFS                                                 03069000
@NM00040 EQU   SDWADPFS                                                 03070000
SDWADLST EQU   SDWADPFS                                                 03071000
SDWADPT  EQU   SDWADPFS                                                 03072000
SDWADPID EQU   SDWADUMP                                                 03073000
SDWADPLA EQU   SDWA+316                                                 03074000
SDWAREXN EQU   SDWARECP+16                                              03075000
SDWACSCT EQU   SDWARECP+8                                               03076000
SDWAMODN EQU   SDWARECP                                                 03077000
@NM00039 EQU   SDWALKWA+32                                              03078000
SDWATALW EQU   SDWALKWS+28                                              03079000
SDWATDLW EQU   SDWALKWS+24                                              03080000
SDWATNLW EQU   SDWALKWS+20                                              03081000
SDWAAPLW EQU   SDWALKWS+16                                              03082000
SDWAIPLW EQU   SDWALKWS+12                                              03083000
SDWAILLW EQU   SDWALKWS+8                                               03084000
SDWAIULW EQU   SDWALKWS+4                                               03085000
SDWAICLW EQU   SDWALKWS                                                 03086000
SDWAFLLK EQU   SDWAACF4                                                 03087000
SDWACMS  EQU   SDWAACF4                                                 03088000
SDWAOPTM EQU   SDWAACF4                                                 03089000
SDWATADB EQU   SDWAACF4                                                 03090000
SDWATDNB EQU   SDWAACF4                                                 03091000
SDWATNCB EQU   SDWAACF4                                                 03092000
SDWAILCH EQU   SDWAACF4                                                 03093000
SDWAIUCB EQU   SDWAACF4                                                 03094000
SDWAICAT EQU   SDWAACF3                                                 03095000
SDWAIPRG EQU   SDWAACF3                                                 03096000
SDWASALL EQU   SDWAACF3                                                 03097000
SDWAASMP EQU   SDWAACF3                                                 03098000
SDWADISP EQU   SDWAACF3                                                 03099000
@NM00038 EQU   SDWAACF3                                                 03100000
@NM00037 EQU   SDWAACF2                                                 03101000
SDWAFREE EQU   SDWAACF2                                                 03102000
SDWAUPRG EQU   SDWAACF2                                                 03103000
@NM00036 EQU   SDWAACF2                                                 03104000
SDWASPIN EQU   SDWAACF2                                                 03105000
@NM00035 EQU   SDWAACF2                                                 03106000
SDWALCPU EQU   SDWACPUA+2                                               03107000
@NM00034 EQU   SDWACPUA                                                 03108000
SDWARECA EQU   SDWA+244                                                 03109000
SDWARTYA EQU   SDWA+240                                                 03110000
@NM00033 EQU   SDWA+239                                                 03111000
@NM00032 EQU   SDWAIOFS                                                 03112000
SDWANIOP EQU   SDWAIOFS                                                 03113000
SDWANOIO EQU   SDWAIOFS                                                 03114000
SDWAIOHT EQU   SDWAIOFS                                                 03115000
SDWAIOQR EQU   SDWAIOFS                                                 03116000
SDWAFMID EQU   SDWA+236                                                 03117000
@NM00031 EQU   SDWAERRD                                                 03118000
SDWAMCIV EQU   SDWAERRD                                                 03119000
SDWARPIV EQU   SDWAERRD                                                 03120000
SDWAMABD EQU   SDWAERRD                                                 03121000
SDWACTS  EQU   SDWAERRD                                                 03122000
SDWASTAE EQU   SDWAERRD                                                 03123000
SDWANRBE EQU   SDWAERRD                                                 03124000
SDWACLUP EQU   SDWAERRD                                                 03125000
@NM00030 EQU   SDWAERRC                                                 03126000
SDWAEAS  EQU   SDWAERRC                                                 03127000
SDWAPERC EQU   SDWAERRC                                                 03128000
SDWAIRB  EQU   SDWAERRC                                                 03129000
SDWASTAI EQU   SDWAERRC                                                 03130000
SDWASTAF EQU   SDWAERRC                                                 03131000
SDWASRBM EQU   SDWAERRB                                                 03132000
SDWALDIS EQU   SDWAERRB                                                 03133000
SDWAENRB EQU   SDWAERRB                                                 03134000
SDWATYP1 EQU   SDWAERRB                                                 03135000
@NM00029 EQU   SDWAERRB                                                 03136000
SDWAPGIO EQU   SDWAERRA                                                 03137000
SDWATEXC EQU   SDWAERRA                                                 03138000
SDWASVCE EQU   SDWAERRA                                                 03139000
SDWAABTM EQU   SDWAERRA                                                 03140000
SDWASVCD EQU   SDWAERRA                                                 03141000
SDWARKEY EQU   SDWAERRA                                                 03142000
SDWAPCHK EQU   SDWAERRA                                                 03143000
SDWAMCHK EQU   SDWAERRA                                                 03144000
SDWATIME EQU   SDWAMCH+20                                               03145000
SDWARFSA EQU   SDWAMCH+16                                               03146000
@NM00028 EQU   SDWAMCH+14                                               03147000
SDWAVEQR EQU   SDWARSR2                                                 03148000
SDWAPGFX EQU   SDWARSR2                                                 03149000
SDWAFLSQ EQU   SDWARSR2                                                 03150000
SDWAFSQA EQU   SDWARSR2                                                 03151000
SDWANUCL EQU   SDWARSR2                                                 03152000
SDWASPER EQU   SDWARSR2                                                 03153000
SDWAINTC EQU   SDWARSR2                                                 03154000
SDWAOFLN EQU   SDWARSR2                                                 03155000
SDWACHNG EQU   SDWARSR1                                                 03156000
SDWAMSER EQU   SDWARSR1                                                 03157000
@NM00027 EQU   SDWARSR1                                                 03158000
SDWACPID EQU   SDWAMCH+10                                               03159000
SDWATERR EQU   SDWAMCHD                                                 03160000
SDWAFPRX EQU   SDWAMCHD                                                 03161000
SDWAINSF EQU   SDWAMCHD                                                 03162000
SDWAACR  EQU   SDWAMCHD                                                 03163000
SDWASCK  EQU   SDWAMCHD                                                 03164000
SDWAPSWU EQU   SDWAMCHD                                                 03165000
SDWAREGU EQU   SDWAMCHD                                                 03166000
SDWASKYF EQU   SDWAMCHD                                                 03167000
@NM00026 EQU   SDWAMCHS                                                 03168000
SDWARSRF EQU   SDWAMCHS                                                 03169000
SDWARSRC EQU   SDWAMCHS                                                 03170000
SDWAINVP EQU   SDWAMCHS                                                 03171000
SDWATSVL EQU   SDWAMCHS                                                 03172000
SDWARCDF EQU   SDWAMCHS                                                 03173000
SDWASRVL EQU   SDWAMCHS                                                 03174000
SDWASCKE EQU   SDWASTCK+4                                               03175000
SDWASCKB EQU   SDWASTCK                                                 03176000
SDWALNTH EQU   SDWAIDNT+1                                               03177000
SDWASPID EQU   SDWAIDNT                                                 03178000
SDWASR15 EQU   SDWASRSV+60                                              03179000
SDWASR14 EQU   SDWASRSV+56                                              03180000
SDWASR13 EQU   SDWASRSV+52                                              03181000
SDWASR12 EQU   SDWASRSV+48                                              03182000
SDWASR11 EQU   SDWASRSV+44                                              03183000
SDWASR10 EQU   SDWASRSV+40                                              03184000
SDWASR09 EQU   SDWASRSV+36                                              03185000
SDWASR08 EQU   SDWASRSV+32                                              03186000
SDWASR07 EQU   SDWASRSV+28                                              03187000
SDWASR06 EQU   SDWASRSV+24                                              03188000
SDWASR05 EQU   SDWASRSV+20                                              03189000
SDWASR04 EQU   SDWASRSV+16                                              03190000
SDWASR03 EQU   SDWASRSV+12                                              03191000
SDWASR02 EQU   SDWASRSV+8                                               03192000
SDWASR01 EQU   SDWASRSV+4                                               03193000
SDWASR00 EQU   SDWASRSV                                                 03194000
SDWATRN2 EQU   SDWAAEC2+4                                               03195000
SDWAIPC2 EQU   SDWAICD2                                                 03196000
SDWAIMC2 EQU   SDWAICD2                                                 03197000
SDWAIPR2 EQU   SDWAICD2                                                 03198000
@NM00025 EQU   SDWAINC2                                                 03199000
@NM00024 EQU   SDWAILC2                                                 03200000
SDWAIL2  EQU   SDWAILC2                                                 03201000
@NM00023 EQU   SDWAILC2                                                 03202000
@NM00022 EQU   SDWAAEC2                                                 03203000
SDWAADD2 EQU   SDWANXT2+1                                               03204000
@NM00021 EQU   SDWANXT2                                                 03205000
@NM00020 EQU   SDWAEC2+3                                                03206000
SDWASGN2 EQU   SDWAINT2                                                 03207000
SDWAEXP2 EQU   SDWAINT2                                                 03208000
SDWADEC2 EQU   SDWAINT2                                                 03209000
SDWAFPO2 EQU   SDWAINT2                                                 03210000
SDWACC2  EQU   SDWAINT2                                                 03211000
@NM00019 EQU   SDWAINT2                                                 03212000
SDWAPGM2 EQU   SDWAMWP2                                                 03213000
SDWAWAT2 EQU   SDWAMWP2                                                 03214000
SDWAMCK2 EQU   SDWAMWP2                                                 03215000
SDWAECT2 EQU   SDWAMWP2                                                 03216000
SDWAKEY2 EQU   SDWAMWP2                                                 03217000
SDWAEXT2 EQU   SDWAEMK2                                                 03218000
SDWAIO2  EQU   SDWAEMK2                                                 03219000
SDWATRM2 EQU   SDWAEMK2                                                 03220000
@NM00018 EQU   SDWAEMK2                                                 03221000
SDWAPER2 EQU   SDWAEMK2                                                 03222000
@NM00017 EQU   SDWAEMK2                                                 03223000
SDWATRAN EQU   SDWAAEC1+4                                               03224000
SDWAIPC1 EQU   SDWAICD1                                                 03225000
SDWAIMC1 EQU   SDWAICD1                                                 03226000
SDWAIPR1 EQU   SDWAICD1                                                 03227000
@NM00016 EQU   SDWAINC1                                                 03228000
@NM00015 EQU   SDWAILC1                                                 03229000
SDWAIL1  EQU   SDWAILC1                                                 03230000
@NM00014 EQU   SDWAILC1                                                 03231000
@NM00013 EQU   SDWAAEC1                                                 03232000
SDWAADD1 EQU   SDWANXT1+1                                               03233000
@NM00012 EQU   SDWANXT1                                                 03234000
@NM00011 EQU   SDWAEC1+3                                                03235000
SDWASGN1 EQU   SDWAINT1                                                 03236000
SDWAEXP1 EQU   SDWAINT1                                                 03237000
SDWADEC1 EQU   SDWAINT1                                                 03238000
SDWAFPO1 EQU   SDWAINT1                                                 03239000
SDWACC1  EQU   SDWAINT1                                                 03240000
@NM00010 EQU   SDWAINT1                                                 03241000
SDWAPGM1 EQU   SDWAMWP1                                                 03242000
SDWAWAT1 EQU   SDWAMWP1                                                 03243000
SDWAMCK1 EQU   SDWAMWP1                                                 03244000
SDWAECT1 EQU   SDWAMWP1                                                 03245000
SDWAKEY1 EQU   SDWAMWP1                                                 03246000
SDWAEXT1 EQU   SDWAEMK1                                                 03247000
SDWAIO1  EQU   SDWAEMK1                                                 03248000
SDWATRM1 EQU   SDWAEMK1                                                 03249000
@NM00009 EQU   SDWAEMK1                                                 03250000
SDWAPER1 EQU   SDWAEMK1                                                 03251000
@NM00008 EQU   SDWAEMK1                                                 03252000
SDWAIOBR EQU   SDWA+100                                                 03253000
SDWAEPA  EQU   SDWA+96                                                  03254000
@NM00007 EQU   SDWANAME+4                                               03255000
SDWARBAD EQU   SDWANAME                                                 03256000
SDWAGR15 EQU   SDWAGRSV+60                                              03257000
SDWAGR14 EQU   SDWAGRSV+56                                              03258000
SDWAGR13 EQU   SDWAGRSV+52                                              03259000
SDWAGR12 EQU   SDWAGRSV+48                                              03260000
SDWAGR11 EQU   SDWAGRSV+44                                              03261000
SDWAGR10 EQU   SDWAGRSV+40                                              03262000
SDWAGR09 EQU   SDWAGRSV+36                                              03263000
SDWAGR08 EQU   SDWAGRSV+32                                              03264000
SDWAGR07 EQU   SDWAGRSV+28                                              03265000
SDWAGR06 EQU   SDWAGRSV+24                                              03266000
SDWAGR05 EQU   SDWAGRSV+20                                              03267000
SDWAGR04 EQU   SDWAGRSV+16                                              03268000
SDWAGR03 EQU   SDWAGRSV+12                                              03269000
SDWAGR02 EQU   SDWAGRSV+8                                               03270000
SDWAGR01 EQU   SDWAGRSV+4                                               03271000
SDWAGR00 EQU   SDWAGRSV                                                 03272000
SDWANXTP EQU   SDWACTL2+5                                               03273000
SDWASGP  EQU   SDWAPMKP                                                 03274000
SDWAEUP  EQU   SDWAPMKP                                                 03275000
SDWADOP  EQU   SDWAPMKP                                                 03276000
SDWAFPP  EQU   SDWAPMKP                                                 03277000
SDWACCP  EQU   SDWAPMKP                                                 03278000
SDWAILP  EQU   SDWAPMKP                                                 03279000
SDWAINTP EQU   SDWACTL2+2                                               03280000
SDWASPVP EQU   SDWAMWPP                                                 03281000
SDWAWATP EQU   SDWAMWPP                                                 03282000
SDWAMCKP EQU   SDWAMWPP                                                 03283000
@NM00006 EQU   SDWAMWPP                                                 03284000
SDWAKEYP EQU   SDWAMWPP                                                 03285000
SDWAEXTP EQU   SDWACMKP                                                 03286000
SDWAIOP  EQU   SDWACMKP                                                 03287000
SDWANXTA EQU   SDWACTL1+5                                               03288000
SDWASGA  EQU   SDWAPMKA                                                 03289000
SDWAEUA  EQU   SDWAPMKA                                                 03290000
SDWADOA  EQU   SDWAPMKA                                                 03291000
SDWAFPA  EQU   SDWAPMKA                                                 03292000
SDWACCA  EQU   SDWAPMKA                                                 03293000
SDWAILA  EQU   SDWAPMKA                                                 03294000
SDWAINTA EQU   SDWACTL1+2                                               03295000
SDWASPVA EQU   SDWAMWPA                                                 03296000
SDWAWATA EQU   SDWAMWPA                                                 03297000
SDWAMCKA EQU   SDWAMWPA                                                 03298000
@NM00005 EQU   SDWAMWPA                                                 03299000
SDWAKEYA EQU   SDWAMWPA                                                 03300000
SDWAEXTA EQU   SDWACMKA                                                 03301000
SDWAIOA  EQU   SDWACMKA                                                 03302000
SDWACMPC EQU   SDWAABCC+1                                               03303000
@NM00004 EQU   SDWACMPF                                                 03304000
SDWASTCC EQU   SDWACMPF                                                 03305000
@NM00003 EQU   SDWACMPF                                                 03306000
SDWASTEP EQU   SDWACMPF                                                 03307000
SDWAREQ  EQU   SDWACMPF                                                 03308000
@NM00002 EQU   SRBSECT+40                                               03309000
@NM00001 EQU   SRBSECT+38                                               03310000
SRBPRIOR EQU   SRBSECT+37                                               03311000
SRBPKF   EQU   SRBSECT+36                                               03312000
SRBSAVE  EQU   SRBSECT+32                                               03313000
SRBPARM  EQU   SRBSECT+28                                               03314000
SRBRMTR  EQU   SRBSECT+24                                               03315000
SRBEP    EQU   SRBSECT+20                                               03316000
SRBPTCB  EQU   SRBFLC+4                                                 03317000
SRBPASID EQU   SRBFLC+2                                                 03318000
SRBCPAFF EQU   SRBFLC                                                   03319000
SRBASCB  EQU   SRBSECT+8                                                03320000
SRBFLNK  EQU   SRBSECT+4                                                03321000
SRBID    EQU   SRBSECT                                                  03322000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03323000
@ENDDATA EQU   *                                                        03324000
         END   ISTRAMA4,(C'PLS2000',0701,77035)                         03325000
