         TITLE 'ISTSDCRS   SIFT AND DEFAULT                            *00001000
                        '                                               00002000
ISTSDCRS CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTSDCRS  76.278'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@00,12(@13)                                     0001 00010000
         STM   @02,@12,28(@13)                                     0001 00011000
         BALR  @12,0                                               0001 00012000
@PSTART  DS    0H                                                  0001 00013000
         USING @PSTART,@12                                         0001 00014000
*   RNCAREG=MLCSECCA;               /*                       @D32CKCK*/ 00015000
         L     RNCAREG,MLCSECCA(,MLCAREG)                          0220 00016000
*   RNCSAV2(2)=GPR13;                                              0221 00017000
         ST    GPR13,RNCSAV2+4(,RNCAREG)                           0221 00018000
*   GPR13=ADDR(RNCSAV2);                                           0222 00019000
         LA    GPR13,RNCSAV2(,RNCAREG)                             0222 00020000
*   RNCSAV1(3)=GPR13;                                              0223 00021000
         ST    GPR13,RNCSAV1+8(,RNCAREG)                           0223 00022000
*   GENERATE REFS(RNCDAT2,RNCAREG) NOSETS                          0224 00023000
*       (USING @DATD-(RNCDAT2-ISTRNCA),RNCAREG);                   0224 00024000
         USING @DATD-(RNCDAT2-ISTRNCA),RNCAREG                          00025000
*   IF RNCGSWBD='0'B                /* NOT SWITCHED BLD?     @D32CKCK*/ 00026000
*       &RNCGLSBD='0'B              /* AND NOT LOCL BLD?     @D32CKCK*/ 00027000
*     THEN                                                         0225 00028000
         TM    RNCGSWBD(RNCAREG),B'00000011'                       0225 00029000
         BNZ   @RF00225                                            0225 00030000
*     DO;                           /* MUST BE RN BUILD      @D32CKCK*/ 00031000
*       IF GPR1=RPRENTRN                                           0227 00032000
*                                                                  0227 00033000
*/********************************************************************/ 00034000
*/* IF THE REQUEST IS FOR AN RN ENTRY, CALL DEFAULTS TO SET          */ 00035000
*/* DEFAULTS FOR THE RDT ENTRIES.  SET REG 1 & MCLPTR0 = @ OF THE    */ 00036000
*/* RN MODEL ENTRY.                                                  */ 00037000
*/********************************************************************/ 00038000
*                                                                  0227 00039000
*         THEN                                                     0227 00040000
         C     GPR1,@CF00065                                       0227 00041000
         BNE   @RF00227                                            0227 00042000
*         DO;                                                      0228 00043000
*           CALL DEFAULTS;                                         0229 00044000
         BAL   @14,DEFAULTS                                        0229 00045000
*DEFRTN:                                                           0230 00046000
*           ;                       /*                       @D32CKCK*/ 00047000
DEFRTN   DS    0H                                                  0231 00048000
*           GPR1=ADDR(RNCRNMDL);                                   0231 00049000
         LA    GPR1,RNCRNMDL(,RNCAREG)                             0231 00050000
*           MLCPTR0=GPR1;                                          0232 00051000
         ST    GPR1,MLCPTR0(,MLCAREG)                              0232 00052000
*         END;                                                     0233 00053000
*       ELSE                                                       0234 00054000
*CRSDS:                                                            0234 00055000
*         DO;                                                      0234 00056000
         B     @RC00227                                            0234 00057000
@RF00227 DS    0H                                                  0234 00058000
CRSDS    DS    0H                                                  0235 00059000
*           IF GPR1=RPRENTDS                                       0235 00060000
*                                                                  0235 00061000
*/********************************************************************/ 00062000
*/* IF THE REQUEST IS FOR A DIALSET ENTRY, SET THE DEFAULT           */ 00063000
*/* INFO IN THE DIALSET MODEL, SET REG 1 = @ OF DIALSET MODEL.       */ 00064000
*/* SET MLCPTR0 = @ OF DIALSET MODEL.                                */ 00065000
*/********************************************************************/ 00066000
*                                                                  0235 00067000
*             THEN                                                 0235 00068000
         C     GPR1,@CF00277                                       0235 00069000
         BNE   @RF00235                                            0235 00070000
*             DO;                                                  0236 00071000
*               RNCDSMDL=RNCDSMDL&&RNCDSMDL;                       0237 00072000
         XC    RNCDSMDL(80,RNCAREG),RNCDSMDL(RNCAREG)              0237 00073000
*               GPR1=ADDR(RNCDSMDL);                               0238 00074000
         LA    @07,RNCDSMDL(,RNCAREG)                              0238 00075000
         LR    GPR1,@07                                            0238 00076000
*               RPRELEN=LENGTH(ISTRDS);                            0239 00077000
         MVC   RPRELEN(2,GPR1),@CH01886                            0239 00078000
*               RPRENTRY=RPRENTDS;                                 0240 00079000
         MVI   RPRENTRY(GPR1),X'20'                                0240 00080000
*               RPRCONCT='1'B;      /*                       @D32CKCK*/ 00081000
         OI    RPRCONCT(GPR1),B'01000000'                          0241 00082000
*               MLCPTR0=ADDR(RNCDSMDL);                            0242 00083000
         ST    @07,MLCPTR0(,MLCAREG)                               0242 00084000
*             END;                                                 0243 00085000
*           ELSE                                                   0244 00086000
*CRSGP:                                                            0244 00087000
*             DO;                                                  0244 00088000
         B     @RC00235                                            0244 00089000
@RF00235 DS    0H                                                  0244 00090000
CRSGP    DS    0H                                                  0245 00091000
*               IF GPR1=RPRENTGP                                   0245 00092000
*                                                                  0245 00093000
*/********************************************************************/ 00094000
*/* IF THE REQUEST IS FOR A GROUP ENTRY, SET THE DEFAULT INFO IN     */ 00095000
*/* THE GROUP MODEL, SET REG 1 = @ OF THE GROUP MODEL, COPY THE      */ 00096000
*/* LINE DEFAULTS, CLUSTER DEFAULTS, TERMINAL DEFAULTS CLUSTER       */ 00097000
*/* CONTROLLER DEFAULTS AND LOGICAL UNIT DEFAULTS INTO               */ 00098000
*/* GROUP'S SIFT AREAS.  SET MLCPTR0-3,5,6 = @'S OF THE GROUP        */ 00099000
*/* MODEL AND GROUP'S SIFT AREAS.  TURN OFF THE LINE, CLUSTER,       */ 00100000
*/* TERMINAL, COMPONENT, L/U GLOBAL FOOTPRINTS.                      */ 00101000
*/********************************************************************/ 00102000
*                                                                  0245 00103000
*                 THEN                                             0245 00104000
         C     GPR1,@CF00270                                       0245 00105000
         BNE   @RF00245                                            0245 00106000
*                 DO;                                              0246 00107000
*                   RNCGPMDL=RNCGPMDL&&RNCGPMDL;                   0247 00108000
         XC    RNCGPMDL(92,RNCAREG),RNCGPMDL(RNCAREG)              0247 00109000
*                   GPR1=ADDR(RNCGPMDL);                           0248 00110000
         LA    GPR1,RNCGPMDL(,RNCAREG)                             0248 00111000
*                   RPRELEN=LENGTH(ISTRGP);                        0249 00112000
         MVC   RPRELEN(2,GPR1),@CH01887                            0249 00113000
*                   RPRENTRY=RPRENTGP;                             0250 00114000
         MVI   RPRENTRY(GPR1),X'30'                                0250 00115000
*                   RPRCONCT='1'B;  /*                       @DL31HCK*/ 00116000
         OI    RPRCONCT(GPR1),B'01000000'                          0251 00117000
*                   IF RNCGRGAP='1'B/*                       @DY04778*/ 00118000
*                     THEN                                         0252 00119000
         TM    RNCGRGAP(RNCAREG),B'00000010'                       0252 00120000
         BNO   @RF00252                                            0252 00121000
*                     DO;           /*                       @DY04778*/ 00122000
*                       RGPASDLC='1'B;/*                     @DY04778*/ 00123000
         OI    RGPASDLC(GPR1),B'00010000'                          0254 00124000
*                       ADDR(RNCLNDEF)->RLNRATRN='1'B;/*     @DY04778*/ 00125000
         OI    RLNRATRN+128(RNCAREG),B'00000010'                   0255 00126000
*                     END;          /*                       @DY04778*/ 00127000
*                   ELSE                                           0257 00128000
*                     RGPASS='1'B;  /*                       @DY04778*/ 00129000
         B     @RC00252                                            0257 00130000
@RF00252 OI    RGPASS(GPR1),B'01000000'                            0257 00131000
*                   RNCGPLN=RNCLNDEF;                              0258 00132000
@RC00252 MVC   RNCGPLN(160,RNCAREG),RNCLNDEF(RNCAREG)              0258 00133000
*                   IF RNCRN->RRNRAPEP='1'B THEN/*           @DL31HCK*/ 00134000
         L     @07,RNCRN(,RNCAREG)                                 0259 00135000
         TM    RRNRAPEP(@07),B'00000001'                           0259 00136000
         BNO   @RF00259                                            0259 00137000
*                     ADDR(RNCGPLN)->RLNRAPEP='1'B;/*        @DL31HCK*/ 00138000
         OI    RLNRAPEP+1004(RNCAREG),B'00000001'                  0260 00139000
*                   ELSE                                           0261 00140000
*                     IF RNCRN->RRNRANCP='1'B|/*             @DL31HCK*/ 00141000
*                         RNCRN->RRNRBREM='1'B THEN/*        @DL31HCK*/ 00142000
         B     @RC00259                                            0261 00143000
@RF00259 L     @07,RNCRN(,RNCAREG)                                 0261 00144000
         TM    RRNRANCP(@07),B'00000110'                           0261 00145000
         BZ    @RF00261                                            0261 00146000
*                       ADDR(RNCGPLN)->RLNRANCP='1'B;/*      @DL31HCK*/ 00147000
         OI    RLNRANCP+1004(RNCAREG),B'00000010'                  0262 00148000
*                     ELSE                                         0263 00149000
*                       ;           /*                       @DL31HCK*/ 00150000
@RF00261 DS    0H                                                  0264 00151000
*                   RNCGPCL=RNCCLDEF;                              0264 00152000
@RC00259 MVC   RNCGPCL(96,RNCAREG),RNCCLDEF(RNCAREG)               0264 00153000
*                   RNCGPTR=RNCTRDEF;                              0265 00154000
         MVC   RNCGPTR(212,RNCAREG),RNCTRDEF(RNCAREG)              0265 00155000
*                   RNCGPCC=RNCCCDEF;                              0266 00156000
         MVC   RNCGPCC(148,RNCAREG),RNCCCDEF(RNCAREG)              0266 00157000
*                   RNCGPLU=RNCLUDEF;                              0267 00158000
         MVC   RNCGPLU(176,RNCAREG),RNCLUDEF(RNCAREG)              0267 00159000
*                   RNCGPPX=RNCPXDEF;/*                      @D32CKCK*/ 00160000
         MVC   RNCGPPX(84,RNCAREG),RNCPXDEF(RNCAREG)               0268 00161000
*                   MLCPTR0=GPR1;                                  0269 00162000
         ST    GPR1,MLCPTR0(,MLCAREG)                              0269 00163000
*                   MLCPTR1=ADDR(RNCGPLN);                         0270 00164000
         LA    @07,RNCGPLN(,RNCAREG)                               0270 00165000
         ST    @07,MLCPTR1(,MLCAREG)                               0270 00166000
*                   MLCPTR2=ADDR(RNCGPCL);                         0271 00167000
         LA    @07,RNCGPCL(,RNCAREG)                               0271 00168000
         ST    @07,MLCPTR2(,MLCAREG)                               0271 00169000
*                   MLCPTR3=ADDR(RNCGPTR);                         0272 00170000
         LA    @07,RNCGPTR(,RNCAREG)                               0272 00171000
         ST    @07,MLCPTR3(,MLCAREG)                               0272 00172000
*                   MLCPTR5=ADDR(RNCGPCC);                         0273 00173000
         LA    @07,RNCGPCC(,RNCAREG)                               0273 00174000
         ST    @07,MLCPTR5(,MLCAREG)                               0273 00175000
*                   MLCPTR6=ADDR(RNCGPLU);                         0274 00176000
         LA    @07,RNCGPLU(,RNCAREG)                               0274 00177000
         ST    @07,MLCPTR6(,MLCAREG)                               0274 00178000
*                   MLCPTR7=ADDR(RNCGPPX);/*                 @D32CKCK*/ 00179000
         LA    @07,RNCGPPX(,RNCAREG)                               0275 00180000
         ST    @07,MLCPTR7(,MLCAREG)                               0275 00181000
*                   RNCGLINE='0'B;                                 0276 00182000
*                   RNCGCLUS='0'B;                                 0277 00183000
         NI    RNCGLINE(RNCAREG),B'11111001'                       0277 00184000
*                   RNCGTERM='0'B;                                 0278 00185000
*                   RNCGCOMP='0'B;                                 0279 00186000
*                   RNCGLU='0'B;                                   0280 00187000
         NI    RNCGTERM(RNCAREG),B'10001111'                       0280 00188000
*                 END;                                             0281 00189000
*               ELSE                                               0282 00190000
*CRSLN:                                                            0282 00191000
*                 DO;                                              0282 00192000
         B     @RC00245                                            0282 00193000
@RF00245 DS    0H                                                  0282 00194000
CRSLN    DS    0H                                                  0283 00195000
*                   IF GPR1=RPRENTLN                               0283 00196000
*                                                                  0283 00197000
*/********************************************************************/ 00198000
*/* IF THE REQUEST IS FOR A LINE ENTRY, COPY GROUP'S LINE SIFT AREA  */ 00199000
*/* INTO THE LINE MODEL ENTRY AND COPY GROUP'S CLUSTER, TERMINAL,    */ 00200000
*/* CLUSTER CONTROLLER AND LOGICAL UNIT SIFT AREAS INTO LINE'S SIFT  */ 00201000
*/* AREAS.  SET REG 1 & MLCPTR1 = @ OF THE LINE MODEL AND SET        */ 00202000
*/* MLCPTR2,3,5,6 = @'S OF THE LINE SIFT AREAS.  TURN OFF THE        */ 00203000
*/* CLUSTER, TERMINAL, COMPONENT, AND L/U GLOBAL FOOTPRINTS.         */ 00204000
*/********************************************************************/ 00205000
*                                                                  0283 00206000
*                     THEN                                         0283 00207000
         C     GPR1,@CF00267                                       0283 00208000
         BNE   @RF00283                                            0283 00209000
*                     DO;                                          0284 00210000
*                       RNCLNMDL=RNCGPLN;                          0285 00211000
         MVC   RNCLNMDL(160,RNCAREG),RNCGPLN(RNCAREG)              0285 00212000
*                       RNCLNCL=RNCGPCL;                           0286 00213000
         MVC   RNCLNCL(96,RNCAREG),RNCGPCL(RNCAREG)                0286 00214000
*                       RNCLNTR=RNCGPTR;                           0287 00215000
         MVC   RNCLNTR(212,RNCAREG),RNCGPTR(RNCAREG)               0287 00216000
*                       RNCLNCC=RNCGPCC;                           0288 00217000
         MVC   RNCLNCC(148,RNCAREG),RNCGPCC(RNCAREG)               0288 00218000
*                       RNCLNLU=RNCGPLU;                           0289 00219000
         MVC   RNCLNLU(176,RNCAREG),RNCGPLU(RNCAREG)               0289 00220000
*                       RNCLNPX=RNCGPPX;/*                   @D32CKCK*/ 00221000
         MVC   RNCLNPX(84,RNCAREG),RNCGPPX(RNCAREG)                0290 00222000
*                       GPR1=ADDR(RNCLNMDL);                       0291 00223000
         LA    GPR1,RNCLNMDL(,RNCAREG)                             0291 00224000
*                       MLCPTR1=GPR1;                              0292 00225000
         ST    GPR1,MLCPTR1(,MLCAREG)                              0292 00226000
*                       MLCPTR2=ADDR(RNCLNCL);                     0293 00227000
         LA    @07,RNCLNCL(,RNCAREG)                               0293 00228000
         ST    @07,MLCPTR2(,MLCAREG)                               0293 00229000
*                       MLCPTR3=ADDR(RNCLNTR);                     0294 00230000
         LA    @04,RNCLNTR(,RNCAREG)                               0294 00231000
         ST    @04,MLCPTR3(,MLCAREG)                               0294 00232000
*                       MLCPTR5=ADDR(RNCLNCC);                     0295 00233000
         LA    @03,RNCLNCC(,RNCAREG)                               0295 00234000
         ST    @03,MLCPTR5(,MLCAREG)                               0295 00235000
*                       MLCPTR6=ADDR(RNCLNLU);                     0296 00236000
         LA    @00,RNCLNLU(,RNCAREG)                               0296 00237000
         ST    @00,MLCPTR6(,MLCAREG)                               0296 00238000
*                       MLCPTR7=ADDR(RNCLNPX);/*             @D32CKCK*/ 00239000
         LA    @00,RNCLNPX(,RNCAREG)                               0297 00240000
         ST    @00,MLCPTR7(,MLCAREG)                               0297 00241000
*                       IF MLCPTR3->RTRRBISA='0'B/*          @DA06170*/ 00242000
*                         THEN                                     0298 00243000
         TM    RTRRBISA(@04),B'01000000'                           0298 00244000
         BNZ   @RF00298                                            0298 00245000
*                         DO;       /*                       @DA06170*/ 00246000
*                           MLCPTR2->RCLRBISA='0'B;/*        @DA06170*/ 00247000
         NI    RCLRBISA(@07),B'10111111'                           0300 00248000
*                           MLCPTR5->RCCRBISA='0'B;/*        @DA06170*/ 00249000
         NI    RCCRBISA(@03),B'01111111'                           0301 00250000
*                         END;      /*                       @DA06170*/ 00251000
*                       ELSE                                       0303 00252000
*                         ;         /*                       @DA06170*/ 00253000
@RF00298 DS    0H                                                  0304 00254000
*                       RNCGCLUS='0'B;                             0304 00255000
         NI    RNCGCLUS(RNCAREG),B'11111101'                       0304 00256000
*                       RNCGTERM='0'B;                             0305 00257000
*                       RNCGCOMP='0'B;                             0306 00258000
*                       RNCGLU='0'B;                               0307 00259000
         NI    RNCGTERM(RNCAREG),B'10001111'                       0307 00260000
*                     END;                                         0308 00261000
*                   ELSE                                           0309 00262000
*CRSCL:                                                            0309 00263000
*                     DO;                                          0309 00264000
         B     @RC00283                                            0309 00265000
@RF00283 DS    0H                                                  0309 00266000
CRSCL    DS    0H                                                  0310 00267000
*                       IF GPR1=RPRENTCL                           0310 00268000
*                                                                  0310 00269000
*/********************************************************************/ 00270000
*/* FOR A CLUSTER REQUEST, CLUSTER MODEL MUST BE SET UP. COPY LINE'S */ 00271000
*/* CLUSTER AREA INTO THE CLUSTER MODEL. COPY LINE'S TERMINAL SIFT   */ 00272000
*/* AREA INTO CLUSTER'S TERMINAL SIFT AREA. SET REG 1 & MLCPTR2 = @  */ 00273000
*/* OF THE CLUSTER MODEL AND SET MLCPTR3 = @ OF CLUSTER'S TERMINAL   */ 00274000
*/* SIFT AREA. TURN OFF TERMINAL, COMPONENT GLOBAL FOOTPRINTS.       */ 00275000
*/********************************************************************/ 00276000
*                                                                  0310 00277000
*                         THEN                                     0310 00278000
         C     GPR1,@CF00265                                       0310 00279000
         BNE   @RF00310                                            0310 00280000
*                         DO;                                      0311 00281000
*                           GPR1=ADDR(RNCCLMDL);/* CLUSTER           */ 00282000
         LA    GPR1,RNCCLMDL(,RNCAREG)                             0312 00283000
*                           RNCCLMDL=RNCLNCL;                      0313 00284000
         MVC   RNCCLMDL(96,RNCAREG),RNCLNCL(RNCAREG)               0313 00285000
*                           MLCPTR2=GPR1;                          0314 00286000
         ST    GPR1,MLCPTR2(,MLCAREG)                              0314 00287000
*                           MLCPTR3=ADDR(RNCCLTR);                 0315 00288000
         LA    @07,RNCCLTR(,RNCAREG)                               0315 00289000
         ST    @07,MLCPTR3(,MLCAREG)                               0315 00290000
*                           RNCCLTR=RNCLNTR;                       0316 00291000
         MVC   RNCCLTR(212,RNCAREG),RNCLNTR(RNCAREG)               0316 00292000
*                           IF MLCPTR3->RTRRBISA='0'B/*      @DA06170*/ 00293000
*                             THEN                                 0317 00294000
         TM    RTRRBISA(@07),B'01000000'                           0317 00295000
         BNZ   @RF00317                                            0317 00296000
*                             RCLRBISA='0'B;/*               @DA06170*/ 00297000
         NI    RCLRBISA(GPR1),B'10111111'                          0318 00298000
*                           ELSE                                   0319 00299000
*                             ;     /*                       @DA06170*/ 00300000
@RF00317 DS    0H                                                  0320 00301000
*                           RNCGTERM='0'B;                         0320 00302000
*                           RNCGCOMP='0'B;                         0321 00303000
         NI    RNCGTERM(RNCAREG),B'10101111'                       0321 00304000
*                         END;                                     0322 00305000
*                       ELSE                                       0323 00306000
*CRSIN:                                                            0323 00307000
*                         DO;       /*                       @XL03HCK*/ 00308000
         B     @RC00310                                            0323 00309000
@RF00310 DS    0H                                                  0323 00310000
CRSIN    DS    0H                                                  0324 00311000
*                           IF GPR1=RPRENTIN/*               @XL03HCK*/ 00312000
*/********************************************************************/ 00313000
*/* IF THE REQUEST IS FOR AN INNODE ENTRY, SET THE DEFAULT INFO IN   */ 00314000
*/* THE INNODE MODEL, SET REG 1 = @ OF INNODE MODEL.                 */ 00315000
*/********************************************************************/ 00316000
*                                                                  0324 00317000
*                             THEN                                 0324 00318000
         C     GPR1,@CF00260                                       0324 00319000
         BNE   @RF00324                                            0324 00320000
*                             DO;   /*                       @XL03HCK*/ 00321000
*                               RNCINMDL=RNCINMDL&&RNCINMDL;/*     0326 00322000
*                                                            @XL03HCK*/ 00323000
         XC    RNCINMDL(160,RNCAREG),RNCINMDL(RNCAREG)             0326 00324000
*                               GPR1=ADDR(RNCINMDL);/*       @XL03HCK*/ 00325000
         LA    GPR1,RNCINMDL(,RNCAREG)                             0327 00326000
*                               RPRELEN=LENGTH(ISTRIN);/*    @XL03HCK*/ 00327000
         MVC   RPRELEN(2,GPR1),@CH01890                            0328 00328000
*                               RPRENTRY=RPRENTIN;/*         @XL03HCK*/ 00329000
         MVI   RPRENTRY(GPR1),X'82'                                0329 00330000
*                               RPRCONCT='1'B;/*             @D32CKCK*/ 00331000
         OI    RPRCONCT(GPR1),B'01000000'                          0330 00332000
*                             END;  /*                       @XL03HCK*/ 00333000
*                           ELSE    /*                       @XL03HCK*/ 00334000
*CRSTR:                                                            0332 00335000
*                             DO;                                  0332 00336000
         B     @RC00324                                            0332 00337000
@RF00324 DS    0H                                                  0332 00338000
CRSTR    DS    0H                                                  0333 00339000
*                               IF GPR1=RPRENTTR                   0333 00340000
*                                                                  0333 00341000
*/********************************************************************/ 00342000
*/* IF THE REQUEST IS FOR A TERMINAL ENTRY, COPY EITHER LINE'S       */ 00343000
*/* TERMINAL SIFT AREA OR CLUSTER'S TERMINAL SIFT AREA INTO THE      */ 00344000
*/* TERMINAL MODEL.  SET REG 1 & MLCPTR3 = @ OF THE TERMINAL MODEL   */ 00345000
*/* AND TURN OFF THE COMPONENT GLOBAL FOOTPRINT.                     */ 00346000
*/********************************************************************/ 00347000
*                                                                  0333 00348000
*                                 THEN                             0333 00349000
         C     GPR1,@CF00167                                       0333 00350000
         BNE   @RF00333                                            0333 00351000
*                                 DO;                              0334 00352000
*                                   IF RNCGCLUS='0'B THEN          0335 00353000
         TM    RNCGCLUS(RNCAREG),B'00000010'                       0335 00354000
         BNZ   @RF00335                                            0335 00355000
*                                    RNCTRMDL=RNCLNTR;             0336 00356000
         MVC   RNCTRMDL(212,RNCAREG),RNCLNTR(RNCAREG)              0336 00357000
*                                   ELSE                           0337 00358000
*                                    RNCTRMDL=RNCCLTR;             0337 00359000
         B     @RC00335                                            0337 00360000
@RF00335 MVC   RNCTRMDL(212,RNCAREG),RNCCLTR(RNCAREG)              0337 00361000
*                                   GPR1=ADDR(RNCTRMDL);           0338 00362000
@RC00335 LA    GPR1,RNCTRMDL(,RNCAREG)                             0338 00363000
*                                   MLCPTR3=GPR1;                  0339 00364000
         ST    GPR1,MLCPTR3(,MLCAREG)                              0339 00365000
*                                   RNCGCOMP='0'B;                 0340 00366000
         NI    RNCGCOMP(RNCAREG),B'11101111'                       0340 00367000
*                                 END;                             0341 00368000
*                               ELSE                               0342 00369000
*CRSLU:                                                            0342 00370000
*                                 DO;                              0342 00371000
         B     @RC00333                                            0342 00372000
@RF00333 DS    0H                                                  0342 00373000
CRSLU    DS    0H                                                  0343 00374000
*                                   IF GPR1=RPRENTLU               0343 00375000
*                                                                  0343 00376000
*/********************************************************************/ 00377000
*/* FOR A LOGICAL UNIT ENTRY, COPY PU'S L/U SIFT AREA INTO THE       */ 00378000
*/* L/U MODEL. SET MLCPTR6 & REG 1 = @ OF THE L/U MODEL.             */ 00379000
*/********************************************************************/ 00380000
*                                                                  0343 00381000
*                                     THEN                         0343 00382000
         C     GPR1,@CF00169                                       0343 00383000
         BNE   @RF00343                                            0343 00384000
*                                    DO;                           0344 00385000
*                                     GPR1=ADDR(RNCLUMDL);         0345 00386000
         LA    GPR1,RNCLUMDL(,RNCAREG)                             0345 00387000
*                                     RNCLUMDL=RNCCCLU;            0346 00388000
         MVC   RNCLUMDL(176,RNCAREG),RNCCCLU(RNCAREG)              0346 00389000
*                                     IF RNCCC->RCCTYPE=1/* PU TYPE     00390000
*                                      OF 1?                 @D32CKMX*/ 00391000
*                                       THEN                       0347 00392000
         L     @07,RNCCC(,RNCAREG)                                 0347 00393000
         CLI   RCCTYPE(@07),1                                      0347 00394000
         BNE   @RF00347                                            0347 00395000
*                                      DO;/* DEFAULT PACING TO (1,1)    00396000
*                                                            @D32CKCK*/ 00397000
*                                       RLUNCPPN=1;/*        @D32CKMX*/ 00398000
         MVI   RLUNCPPN(GPR1),X'01'                                0349 00399000
*                                       RLUNCPPM=1;/*        @D32CKMX*/ 00400000
         MVI   RLUNCPPM(GPR1),X'01'                                0350 00401000
*                                      END;/*                @D32CKCK*/ 00402000
*                                     ELSE                         0352 00403000
*                                      ;/*                   @D32CKCK*/ 00404000
@RF00347 DS    0H                                                  0353 00405000
*                                     MLCPTR6=GPR1;                0353 00406000
         ST    GPR1,MLCPTR6(,MLCAREG)                              0353 00407000
*                                    END;                          0354 00408000
*                                   ELSE                           0355 00409000
*CRSCM:                                                            0355 00410000
*                                    DO;                           0355 00411000
         B     @RC00343                                            0355 00412000
@RF00343 DS    0H                                                  0355 00413000
CRSCM    DS    0H                                                  0356 00414000
*                                     IF GPR1=RPRENTCM/*     @D32CKCK*/ 00415000
*/********************************************************************/ 00416000
*/* IF THE REQUEST IS FOR A COMPONENT ENTRY, COPY THE TERM  MOD      */ 00417000
*/* INFO INTO THE COMPONENT MODEL AND SET ENTRY = COMP               */ 00418000
*/* AND MLCPTR3 = ADDR OF THE MODEL AND MLCPTR4 = ADDR RPRDEVCH      */ 00419000
*/********************************************************************/ 00420000
*                                                                  0356 00421000
*                                       THEN                       0356 00422000
         C     GPR1,@CF00258                                       0356 00423000
         BNE   @RF00356                                            0356 00424000
*                                      DO;/*                 @D32CKCK*/ 00425000
*                                       RNCCMMDL=RNCTRMDL;         0358 00426000
         MVC   RNCCMMDL(212,RNCAREG),RNCTRMDL(RNCAREG)             0358 00427000
*                                       GPR1=ADDR(RNCCMMDL);       0359 00428000
         LA    @07,RNCCMMDL(,RNCAREG)                              0359 00429000
         LR    GPR1,@07                                            0359 00430000
*                                       RPRENTRY=RPRENTCM;         0360 00431000
         MVI   RPRENTRY(GPR1),X'90'                                0360 00432000
*                                       MLCPTR3=ADDR(RNCCMMDL);    0361 00433000
         ST    @07,MLCPTR3(,MLCAREG)                               0361 00434000
*                                      END;/*                @D32CKCK*/ 00435000
*                                     ELSE/*                 @D32CKCK*/ 00436000
*CRSPU:                                                            0363 00437000
*                                      DO;/*                 @D32CKCK*/ 00438000
         B     @RC00356                                            0363 00439000
@RF00356 DS    0H                                                  0363 00440000
CRSPU    DS    0H                                                  0364 00441000
*                                       IF GPR1=RPRENTCC/*   @D32CKCK*/ 00442000
*/********************************************************************/ 00443000
*/* FOR A PHYSICAL UNIT ENTRY, COPY THE LINE CC SIFT AREA IN TO THE  */ 00444000
*/* PU MODEL. SIFT THE LINE TERMINAL SIFT AREA TO THE CLUSTER        */ 00445000
*/* TERMINAL SIFT AREA. SIFT THE LINE LU TO THE CC LU SIFT AREA. SET */ 00446000
*/* MLCPTR5 & REG 1 = @ OF THE PU MODEL. SET MLCPTR3 = @ OF CLUSTER  */ 00447000
*/* TERMINAL SIFT AREA. SET MLCPTR6 = @ OF CC LU SIFT AREA.          */ 00448000
*/********************************************************************/ 00449000
*                                                                  0364 00450000
*                                         THEN                     0364 00451000
         C     GPR1,@CF00280                                       0364 00452000
         BNE   @RF00364                                            0364 00453000
*                                        DO;/*               @D32CKCK*/ 00454000
*                                         GPR1=ADDR(RNCCCMDL);/*   0366 00455000
*                                                            @D32CKCK*/ 00456000
         LA    GPR1,RNCCCMDL(,RNCAREG)                             0366 00457000
*                                         RNCCCMDL=RNCLNCC;/*      0367 00458000
*                                                            @D32CKCK*/ 00459000
         MVC   RNCCCMDL(148,RNCAREG),RNCLNCC(RNCAREG)              0367 00460000
*                                         RNCCLTR=RNCLNTR;/* @D32CKCK*/ 00461000
         MVC   RNCCLTR(212,RNCAREG),RNCLNTR(RNCAREG)               0368 00462000
*                                         RNCCCLU=RNCLNLU;/* @D32CKCK*/ 00463000
         MVC   RNCCCLU(176,RNCAREG),RNCLNLU(RNCAREG)               0369 00464000
*                                         MLCPTR5=GPR1;/*    @D32CKCK*/ 00465000
         ST    GPR1,MLCPTR5(,MLCAREG)                              0370 00466000
*                                         MLCPTR3=ADDR(RNCCLTR);/* 0371 00467000
*                                                            @D32CKCK*/ 00468000
         LA    @07,RNCCLTR(,RNCAREG)                               0371 00469000
         ST    @07,MLCPTR3(,MLCAREG)                               0371 00470000
*                                         MLCPTR6=ADDR(RNCCCLU);/* 0372 00471000
*                                                            @D32CKCK*/ 00472000
         LA    @04,RNCCCLU(,RNCAREG)                               0372 00473000
         ST    @04,MLCPTR6(,MLCAREG)                               0372 00474000
*                                         IF MLCPTR3->RTRRBISA='0'B/*   00475000
*                                                            @DA06170*/ 00476000
*                                           THEN                   0373 00477000
         TM    RTRRBISA(@07),B'01000000'                           0373 00478000
         BNZ   @RF00373                                            0373 00479000
*                                          RCCRBISA='0'B;/*  @DA06170*/ 00480000
         NI    RCCRBISA(GPR1),B'01111111'                          0374 00481000
*                                         ELSE                     0375 00482000
*                                          ;/*               @DA06170*/ 00483000
@RF00373 DS    0H                                                  0376 00484000
*                                         RNCGLU='0'B;/*     @D32CKCK*/ 00485000
         NI    RNCGLU(RNCAREG),B'11011111'                         0376 00486000
*                                        END;/*              @D32CKCK*/ 00487000
*                                       ELSE/*               @D32CKCK*/ 00488000
*CRSPX:                                                            0378 00489000
*                                        DO;/*               @D32CKCK*/ 00490000
         B     @RC00364                                            0378 00491000
@RF00364 DS    0H                                                  0378 00492000
CRSPX    DS    0H                                                  0379 00493000
*                                         IF GPR1=RPRENTPX/* @D32CKCK*/ 00494000
*/********************************************************************/ 00495000
*/* IF THE REQUEST IS FOR A PUX ENTRY, SET THE DEFAULT INFO IN THE   */ 00496000
*/* PUX MODEL. SET REG 1 = @ OF PUX MODEL.                           */ 00497000
*/********************************************************************/ 00498000
*                                                                  0379 00499000
*                                           THEN                   0379 00500000
         C     GPR1,@CF00285                                       0379 00501000
         BNE   @RF00379                                            0379 00502000
*                                          DO;/*             @D32CKCK*/ 00503000
*                                           GPR1=ADDR(RNCPXMDL);/* 0381 00504000
*                                                            @D32CKCK*/ 00505000
         LA    GPR1,RNCPXMDL(,RNCAREG)                             0381 00506000
*                                           RNCPXMDL=RNCLNPX;/*    0382 00507000
*                                                            @D32CKCK*/ 00508000
         MVC   RNCPXMDL(84,RNCAREG),RNCLNPX(RNCAREG)               0382 00509000
*                                           MLCPTR7=GPR1;/*  @D32CKCK*/ 00510000
         ST    GPR1,MLCPTR7(,MLCAREG)                              0383 00511000
*                                          END;/*            @D32CKCK*/ 00512000
*                                         ELSE/*             @D32CKCK*/ 00513000
*CRSLX:                                                            0385 00514000
*                                          DO;/*             @D32CKCK*/ 00515000
         B     @RC00379                                            0385 00516000
@RF00379 DS    0H                                                  0385 00517000
CRSLX    DS    0H                                                  0386 00518000
*/********************************************************************/ 00519000
*/* IF THE REQUEST IS FOR A LUX ENTRY, SET DEFAULT INFO IN THE LUX   */ 00520000
*/* MODEL. SET REG 1 = @ OF LUX MODEL.                               */ 00521000
*/********************************************************************/ 00522000
*                                                                  0386 00523000
*                                           GPR1=ADDR(RNCLXMDL);/* 0386 00524000
*                                                            @D32CKCK*/ 00525000
         LA    GPR1,RNCLXMDL(,RNCAREG)                             0386 00526000
*                                           RNCLXMDL=RNCLXMDL&&RNCLXMDL 00527000
*                                               ;/*          @D32CKCK*/ 00528000
         XC    RNCLXMDL(84,RNCAREG),RNCLXMDL(RNCAREG)              0387 00529000
*                                           RPRELEN=LENGTH(ISTRLX);/*   00530000
*                                                            @D32CKCK*/ 00531000
         MVC   RPRELEN(2,GPR1),@CH01891                            0388 00532000
*                                           RPRENTRY=RPRENTLX;/*   0389 00533000
*                                                            @D32CKCK*/ 00534000
         MVI   RPRENTRY(GPR1),X'10'                                0389 00535000
*                                           RPRCONCT='1'B;/* @D32CKCK*/ 00536000
         OI    RPRCONCT(GPR1),B'01000000'                          0390 00537000
*                                          END CRSLX;/*      @D32CKCK*/ 00538000
*                                        END CRSPX;/*        @D32CKCK*/ 00539000
@RC00379 DS    0H                                                  0393 00540000
*                                      END CRSPU;/*          @D32CKCK*/ 00541000
@RC00364 DS    0H                                                  0394 00542000
*                                    END CRSCM;                    0394 00543000
@RC00356 DS    0H                                                  0395 00544000
*                                 END CRSLU;                       0395 00545000
@RC00343 DS    0H                                                  0396 00546000
*                             END CRSTR;                           0396 00547000
@RC00333 DS    0H                                                  0397 00548000
*                         END CRSIN;/*                       @XL03HCK*/ 00549000
@RC00324 DS    0H                                                  0398 00550000
*                     END CRSCL;                                   0398 00551000
@RC00310 DS    0H                                                  0399 00552000
*                 END CRSLN;                                       0399 00553000
@RC00283 DS    0H                                                  0400 00554000
*               MLCPTR4=ADDR(MLCPTR3->RPRDEVCH);                   0400 00555000
@RC00245 L     @07,MLCPTR3(,MLCAREG)                               0400 00556000
         LA    @07,RPRDEVCH(,@07)                                  0400 00557000
         ST    @07,MLCPTR4(,MLCAREG)                               0400 00558000
*             END CRSGP;                                           0401 00559000
*         END CRSDS;                                               0402 00560000
@RC00235 DS    0H                                                  0403 00561000
*       RPRHDTYP=RPRENTRN;          /*                       @D32CKQH*/ 00562000
@RC00227 MVI   RPRHDTYP(GPR1),X'01'                                0403 00563000
*     END;                          /*                       @D32CKCK*/ 00564000
*   ELSE                                                           0405 00565000
*     DO;                           /*                       @D32CKCK*/ 00566000
         B     @RC00225                                            0405 00567000
@RF00225 DS    0H                                                  0406 00568000
*       CALL SWLSSIFT;              /*                       @D32CKCK*/ 00569000
         BAL   @14,SWLSSIFT                                        0406 00570000
*SWLRTN:                                                           0407 00571000
*       ;                           /*                       @D32CKCK*/ 00572000
SWLRTN   DS    0H                                                  0408 00573000
*       MLCPTR4=ADDR(MLCPTR3->RPRDEVCH);/*                   @D32CKCK*/ 00574000
         L     @07,MLCPTR3(,MLCAREG)                               0408 00575000
         LA    @07,RPRDEVCH(,@07)                                  0408 00576000
         ST    @07,MLCPTR4(,MLCAREG)                               0408 00577000
*     END;                          /*                       @D32CKCK*/ 00578000
*   IF RPRENTRY=RPRENTDA            /* IS RDTE A DAN ENTRY?  @ZA12016*/ 00579000
*     THEN                                                         0410 00580000
@RC00225 CLI   RPRENTRY(GPR1),X'51'                                0410 00581000
         BE    @RT00410                                            0410 00582000
*     ;                             /* YES - DO NOTHING      @ZA12016*/ 00583000
*   ELSE                                                           0412 00584000
*     IF RPRENTRY=RPRENTLX          /* IS IT A LUX?          @ZA12016*/ 00585000
*       THEN                                                       0412 00586000
         CLI   RPRENTRY(GPR1),X'10'                                0412 00587000
         BNE   @RF00412                                            0412 00588000
*       RPRNAME='        ';         /* YES BLANK NAME        @ZA12016*/ 00589000
         MVC   RPRNAME(8,GPR1),@CC01797                            0413 00590000
*     ELSE                                                         0414 00591000
*       RPRNAME=MLCNAME;            /* NO MOVE NAME          @ZA12016*/ 00592000
         B     @RC00412                                            0414 00593000
@RF00412 MVC   RPRNAME(8,GPR1),MLCNAME(MLCAREG)                    0414 00594000
*   RPRNOSRT='1'B;                                                 0415 00595000
@RC00412 DS    0H                                                  0415 00596000
@RT00410 OI    RPRNOSRT(GPR1),B'10000000'                          0415 00597000
*   GPR13=RNCSAV2(2);                                              0416 00598000
         L     GPR13,RNCSAV2+4(,RNCAREG)                           0416 00599000
*   RETURN;                                                        0417 00600000
@EL00001 DS    0H                                                  0417 00601000
@EF00001 DS    0H                                                  0417 00602000
@ER00001 LM    @14,@00,12(@13)                                     0417 00603000
         LM    @02,@12,28(@13)                                     0417 00604000
         BR    @14                                                 0417 00605000
*DEFAULTS:                                                         0418 00606000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0418 00607000
*                                                                  0418 00608000
DEFAULTS DS    0H                                                  0419 00609000
*/********************************************************************/ 00610000
*/* THIS PROC SETS UP THE DEFAULTS FOR THE RN, LINE, CLUSTER,CC,LU,  */ 00611000
*/* PX,TERMINAL AND COMPONENT RDT ENTRIES.                           */ 00612000
*/********************************************************************/ 00613000
*                                                                  0419 00614000
*   RFY                                                            0419 00615000
*    (ISTRPRE,                                                     0419 00616000
*     ISTRCPRE,                                                    0419 00617000
*     ISTRDT,                                                      0419 00618000
*     ISTRRN,                                                      0419 00619000
*     ISTRLN,                                                      0419 00620000
*     ISTRCL,                                                      0419 00621000
*     ISTRTR,                                                      0419 00622000
*     ISTRPX,                                                      0419 00623000
*     ISTRPT) BASED(DUM);           /*                       @X50BHMX*/ 00624000
*   RFY                                                            0420 00625000
*     ISTDEVCH BASED(ADDR(RPRDEVCH));                              0420 00626000
*                                                                  0420 00627000
*/********************************************************************/ 00628000
*/* SET UP THE RN DEFAULTS IN THE RN MODEL.                          */ 00629000
*/********************************************************************/ 00630000
*                                                                  0421 00631000
*   DUM=ADDR(RNCRNMDL);                                            0421 00632000
         LA    DUM,RNCRNMDL(,RNCAREG)                              0421 00633000
*   RPRELEN=LENGTH(ISTRRN);                                        0422 00634000
         MVC   RPRELEN(2,DUM),@CH00977                             0422 00635000
*   RPRENTRY=RPRENTRN;                                             0423 00636000
         MVI   RPRENTRY(DUM),X'01'                                 0423 00637000
*   RPRHDTYP=RPRENTRN;              /*                       @D32CKQH*/ 00638000
         MVI   RPRHDTYP(DUM),X'01'                                 0424 00639000
*   RPRCONCT='1'B;                  /*                       @D32CKCK*/ 00640000
         OI    RPRCONCT(DUM),B'01000000'                           0425 00641000
*   RDTPRIRN='1'B;                  /*                       @D32CKCK*/ 00642000
         OI    RDTPRIRN(DUM),B'00000100'                           0426 00643000
*   RDTCRSDS=BLANK8;                /*                       @X50BHMX*/ 00644000
         MVC   RDTCRSDS(8,DUM),@CC01797                            0427 00645000
*   RRNRASYN='1'B;                  /*                       @X50BHMX*/ 00646000
         OI    RRNRASYN(DUM),B'00010000'                           0428 00647000
*   RRNRBISA='1'B;                                                 0429 00648000
         OI    RRNRBISA(DUM),B'01000000'                           0429 00649000
*   RRNRASHT='1'B;                                                 0430 00650000
*   RRNRAOLT='1'B;                                                 0431 00651000
*   RRNRANCP='1'B;                                                 0432 00652000
         OI    RRNRASHT(DUM),B'10001010'                           0432 00653000
*   RRNRBMDL='1'B;                                                 0433 00654000
*   RRNRBCT1='1'B;                                                 0434 00655000
*   RRNRBCT2='1'B;                                                 0435 00656000
         OI    RRNRBMDL(DUM),B'10000110'                           0435 00657000
*   RRNNMDPD=BLANK8;                                               0436 00658000
         MVC   RRNNMDPD(8,DUM),@CC01797                            0436 00659000
*   RRNNMNCP=BLANK8;                                               0437 00660000
         MVC   RRNNMNCP(8,DUM),@CC01797                            0437 00661000
*   RRNNCPNM='NCP001';                                             0438 00662000
         MVI   RRNNCPNM+6(DUM),C' '                                0438 00663000
         MVC   RRNNCPNM(6,DUM),@CC01857                            0438 00664000
*   DEVINPUT='1'B;                                                 0439 00665000
*   DEVOTPUT='1'B;                                                 0440 00666000
*   DEVCONVR='1'B;                                                 0441 00667000
*   DEVSUBND='1'B;                                                 0442 00668000
         LA    @07,44                                              0442 00669000
         LR    @04,DUM                                             0442 00670000
         ALR   @04,@07                                             0442 00671000
         OI    DEVINPUT(@04),B'11110000'                           0442 00672000
*   RRNMSIZE=65535;                 /*                       @XA07953*/ 00673000
         MVC   RRNMSIZE(4,DUM),@CF01858                            0443 00674000
*   RRNHLENH=LENGTH(FSBFSB)-4;      /*                       @DL31HCK*/ 00675000
         MVI   RRNHLENH(DUM),X'1C'                                 0444 00676000
*/********************************************************************/ 00677000
*/* SET UP THE LINE DEFAULTS IN THE LINE DEFAULT AREA.               */ 00678000
*/********************************************************************/ 00679000
*                                                                  0445 00680000
*   DUM=ADDR(RNCLNDEF);                                            0445 00681000
         LA    DUM,RNCLNDEF(,RNCAREG)                              0445 00682000
*   RPRELEN=LENGTH(ISTRLN);                                        0446 00683000
         MVC   RPRELEN(2,DUM),@CH01894                             0446 00684000
*   RPRENTRY=RPRENTLN;                                             0447 00685000
         MVI   RPRENTRY(DUM),X'50'                                 0447 00686000
*   RPRCONCT='1'B;                  /*                       @D32CKCK*/ 00687000
         OI    RPRCONCT(DUM),B'01000000'                           0448 00688000
*   RPTISTAT='1'B;                  /*                       @X50BHMX*/ 00689000
         OI    RPTISTAT(DUM),B'00000001'                           0449 00690000
*   RLNRACAT='1'B;                                                 0450 00691000
         OI    RLNRACAT(DUM),B'10000000'                           0450 00692000
*   RLNRBUSE='1'B;                                                 0451 00693000
         OI    RLNRBUSE(DUM),B'10000000'                           0451 00694000
*   RLNCTSES=1;                                                    0452 00695000
         MVI   RLNCTSES(DUM),X'01'                                 0452 00696000
*   RLNPOLMT=1;                                                    0453 00697000
         MVI   RLNPOLMT(DUM),X'01'                                 0453 00698000
*   RLNANSWR='1'B;                  /*                       @D32CKCK*/ 00699000
         OI    RLNANSWR(DUM),B'01000000'                           0454 00700000
*/********************************************************************/ 00701000
*/* SET UP THE CLUSTER DEFAULTS IN THE CLUSTER DEFAULT AREA.         */ 00702000
*/********************************************************************/ 00703000
*                                                                  0455 00704000
*   DUM=ADDR(RNCCLDEF);                                            0455 00705000
         LA    DUM,RNCCLDEF(,RNCAREG)                              0455 00706000
*   RPRELEN=LENGTH(ISTRCL);                                        0456 00707000
         MVC   RPRELEN(2,DUM),@CH01895                             0456 00708000
*   RPRENTRY=RPRENTCL;                                             0457 00709000
         MVI   RPRENTRY(DUM),X'70'                                 0457 00710000
*   RPRCONCT='1'B;                  /*                       @D32CKCK*/ 00711000
         OI    RPRCONCT(DUM),B'01000000'                           0458 00712000
*   RCLRBISA='1'B;                                                 0459 00713000
         OI    RCLRBISA(DUM),B'01000000'                           0459 00714000
*   DEVTCODE=DEV3271;                                              0460 00715000
         LR    @04,DUM                                             0460 00716000
         ALR   @04,@07                                             0460 00717000
         MVI   DEVTCODE(@04),X'34'                                 0460 00718000
*   DEVSUBND='1'B;                                                 0461 00719000
*   DEVNNSPT='1'B;                                                 0462 00720000
*                                                                  0462 00721000
         OI    DEVSUBND(@04),B'00010100'                           0462 00722000
*/********************************************************************/ 00723000
*/* SET UP THE TERMINAL DEFAULTS IN THE TERMINAL DEFAULT AREA.       */ 00724000
*/********************************************************************/ 00725000
*                                                                  0463 00726000
*   DUM=ADDR(RNCTRDEF);                                            0463 00727000
         LA    DUM,RNCTRDEF(,RNCAREG)                              0463 00728000
*   RPRELEN=LENGTH(ISTRTR);                                        0464 00729000
         MVC   RPRELEN(2,DUM),@CH01896                             0464 00730000
*   RPRENTRY=RPRENTTR;                                             0465 00731000
         MVI   RPRENTRY(DUM),X'80'                                 0465 00732000
*   RPRCONCT='1'B;                  /*                       @D32CKCK*/ 00733000
         OI    RPRCONCT(DUM),B'01000000'                           0466 00734000
*   RPRAOPN='1'B;                                                  0467 00735000
         OI    RPRAOPN(DUM),B'00100000'                            0467 00736000
*   RTRRBISA='1'B;                                                 0468 00737000
         OI    RTRRBISA(DUM),B'01000000'                           0468 00738000
*   RTRRCBLK='1'B;                                                 0469 00739000
         OI    RTRRCBLK(DUM),B'00010000'                           0469 00740000
*   RTRRDBHN='1'B;                                                 0470 00741000
         OI    RTRRDBHN(DUM),B'10000000'                           0470 00742000
*   RTRLCTI='FF'X;                                                 0471 00743000
         MVI   RTRLCTI(DUM),X'FF'                                  0471 00744000
*   RCPBFLIM=2;                                                    0472 00745000
         MVI   RCPBFLIM(DUM),X'02'                                 0472 00746000
*   RCPLGNAP=BLANK8;                                               0473 00747000
         MVC   RCPLGNAP(8,DUM),@CC01797                            0473 00748000
*   RCPLGNCT=BLANK8;                                               0474 00749000
         MVC   RCPLGNCT(8,DUM),@CC01797                            0474 00750000
*   RCPRBASC='1'B;                                                 0475 00751000
         OI    RCPRBASC(DUM),B'10000000'                           0475 00752000
*   RTRBHSN1=BLANK8;                                               0476 00753000
         MVC   RTRBHSN1(8,DUM),@CC01797                            0476 00754000
*   DEVINPUT='1'B;                                                 0477 00755000
*   DEVOTPUT='1'B;                                                 0478 00756000
*                                                                  0478 00757000
         ALR   @07,DUM                                             0478 00758000
         OI    DEVINPUT(@07),B'11000000'                           0478 00759000
*/********************************************************************/ 00760000
*/* SET UP THE PX DEFAULTS IN THE PX DEFAULT AREA.                   */ 00761000
*/********************************************************************/ 00762000
*                                                                  0479 00763000
*   DUM=ADDR(RNCPXDEF);             /*                       @D32CKCK*/ 00764000
         LA    DUM,RNCPXDEF(,RNCAREG)                              0479 00765000
*   RPRELEN=LENGTH(ISTRPX);         /*                       @D32CKCK*/ 00766000
         MVC   RPRELEN(2,DUM),@CH01891                             0480 00767000
*   RPRENTRY=RPRENTPX;              /*                       @D32CKCK*/ 00768000
         MVI   RPRENTRY(DUM),X'72'                                 0481 00769000
*   RPRCONCT='1'B;                  /*                       @D32CKCK*/ 00770000
         OI    RPRCONCT(DUM),B'01000000'                           0482 00771000
*/********************************************************************/ 00772000
*/* CALL ROUTINE TO SET PU AND LU DEFAULTS                           */ 00773000
*/********************************************************************/ 00774000
*                                                                  0483 00775000
*   CALL DEFPULU;                   /*                       @D32CKCK*/ 00776000
         BAL   @14,DEFPULU                                         0483 00777000
*   GPR14=ADDR(DEFRTN);             /*                       @D32CKCK*/ 00778000
         LA    GPR14,DEFRTN                                        0484 00779000
*   END DEFAULTS;                                                  0485 00780000
@EL00002 DS    0H                                                  0485 00781000
@EF00002 DS    0H                                                  0485 00782000
@ER00002 BR    @14                                                 0485 00783000
*                                                                  0486 00784000
*/********************************************************************/ 00785000
*/* PROCESS ENTRY TYPES IN SWITCHED AND LOCAL SUBAREAS.              */ 00786000
*/********************************************************************/ 00787000
*                                                                  0486 00788000
*SWLSSIFT:                                                         0486 00789000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @D32CKCK*/ 00790000
SWLSSIFT DS    0H                                                  0487 00791000
*   RFY                                                            0487 00792000
*    (ISTRPRE,                                                     0487 00793000
*     ISTRCPRE,                                                    0487 00794000
*     ISTRSW,                                                      0487 00795000
*     ISTRCC,                                                      0487 00796000
*     ISTRLU,                       /*                       @D32CKCK*/ 00797000
*     ISTRDT,                                                      0487 00798000
*     ISTRLS,                                                      0487 00799000
*     ISTRDA) BASED(GPR1);          /*                       @X50BHMX*/ 00800000
*   IF GPR1=RPRENTSW                /*                       @D32CKCK*/ 00801000
*/********************************************************************/ 00802000
*/* IF ENTRY TYPE IS SWITCHED HEADER, INITIALIZE THE MODEL, SET UP   */ 00803000
*/* DEFAULTS FOR THE HDR, LU, AND PU ENTRIES. SET MLCPTR0 AND REG1 = */ 00804000
*/* @ OF HDR MODEL.                                                  */ 00805000
*/********************************************************************/ 00806000
*                                                                  0488 00807000
*     THEN                                                         0488 00808000
         C     GPR1,@CF00071                                       0488 00809000
         BNE   @RF00488                                            0488 00810000
*     DO;                           /*                       @D32CKCK*/ 00811000
*       GPR1=ADDR(RNCSWMDL);        /*                       @D32CKCK*/ 00812000
         LA    GPR1,RNCSWMDL(,RNCAREG)                             0490 00813000
*       RPRELEN=LENGTH(ISTRSW);     /*                       @D32CKCK*/ 00814000
         MVC   RPRELEN(2,GPR1),@CH01897                            0491 00815000
*       RPRENTRY=RPRENTSW;          /*                       @D32CKCK*/ 00816000
         MVI   RPRENTRY(GPR1),X'04'                                0492 00817000
*       RPRHDTYP=RPRENTSW;          /*                       @D32CKQH*/ 00818000
         MVI   RPRHDTYP(GPR1),X'04'                                0493 00819000
*       RPRCONCT='1'B;              /*                       @D32CKCK*/ 00820000
         OI    RPRCONCT(GPR1),B'01000000'                          0494 00821000
*       RDTPRISW='1'B;              /*                       @D32CKCK*/ 00822000
         OI    RDTPRISW(GPR1),B'00000010'                          0495 00823000
*       RDTCRSDS=BLANK8;            /*                       @X50BHMX*/ 00824000
         MVC   RDTCRSDS(8,GPR1),@CC01797                           0496 00825000
*       CALL DEFPULU;               /*                       @D32CKCK*/ 00826000
         BAL   @14,DEFPULU                                         0497 00827000
*       MLCPTR0=GPR1;               /*                       @D32CKCK*/ 00828000
         ST    GPR1,MLCPTR0(,MLCAREG)                              0498 00829000
*     END;                          /*                       @D32CKCK*/ 00830000
*   ELSE                            /*                       @D32CKCK*/ 00831000
*SWLPU:                                                            0500 00832000
*     DO;                           /*                       @D32CKCK*/ 00833000
         B     @RC00488                                            0500 00834000
@RF00488 DS    0H                                                  0500 00835000
SWLPU    DS    0H                                                  0501 00836000
*       IF GPR1=RPRENTCC            /*                       @D32CKCK*/ 00837000
*/********************************************************************/ 00838000
*/* PU ENTRY TYPE - COPY DEFAULTS FROM PU DEF AREA TO THE PU MODEL.  */ 00839000
*/* COPY DEFAULTS FROM THE LU DEF AREA TO THE PU LU SIFT AREA. SET   */ 00840000
*/* MLCPTR5 AND REG 1 = @ OF PU MODEL. SET MLCPTR6 = @ OF PU LU SIFT.*/ 00841000
*/********************************************************************/ 00842000
*                                                                  0501 00843000
*         THEN                                                     0501 00844000
         C     GPR1,@CF00280                                       0501 00845000
         BNE   @RF00501                                            0501 00846000
*         DO;                       /*                       @D32CKCK*/ 00847000
*           GPR1=ADDR(RNCCCMDL);    /*                       @D32CKCK*/ 00848000
         LA    GPR1,RNCCCMDL(,RNCAREG)                             0503 00849000
*           RNCCCMDL=RNCCCDEF;      /*                       @D32CKCK*/ 00850000
         MVC   RNCCCMDL(148,RNCAREG),RNCCCDEF(RNCAREG)             0504 00851000
*           RNCCCLU=RNCLUDEF;       /*                       @D32CKCK*/ 00852000
         MVC   RNCCCLU(176,RNCAREG),RNCLUDEF(RNCAREG)              0505 00853000
*           MLCPTR5=GPR1;           /*                       @D32CKCK*/ 00854000
         ST    GPR1,MLCPTR5(,MLCAREG)                              0506 00855000
*           MLCPTR6=ADDR(RNCCCLU);  /*                       @D32CKCK*/ 00856000
         LA    @07,RNCCCLU(,RNCAREG)                               0507 00857000
         ST    @07,MLCPTR6(,MLCAREG)                               0507 00858000
*           RNCGLU='0'B;            /*                       @D32CKCK*/ 00859000
         NI    RNCGLU(RNCAREG),B'11011111'                         0508 00860000
*         END;                      /*                       @D32CKCK*/ 00861000
*       ELSE                        /*                       @D32CKCK*/ 00862000
*SWLLU:                                                            0510 00863000
*         DO;                       /*                       @D32CKCK*/ 00864000
         B     @RC00501                                            0510 00865000
@RF00501 DS    0H                                                  0510 00866000
SWLLU    DS    0H                                                  0511 00867000
*           IF GPR1=RPRENTLU        /*                       @D32CKCK*/ 00868000
*/********************************************************************/ 00869000
*/* FOR A LOGICAL UNIT ENTRY, COPY CLUSTER'S LU SIFT AREA INTO THE   */ 00870000
*/* LU MODEL. SET MLCPTR6 & REG 1 = @ OF THE LU MODEL.               */ 00871000
*/********************************************************************/ 00872000
*                                                                  0511 00873000
*             THEN                                                 0511 00874000
         C     GPR1,@CF00169                                       0511 00875000
         BNE   @RF00511                                            0511 00876000
*             DO;                   /*                       @D32CKCK*/ 00877000
*               GPR1=ADDR(RNCLUMDL);/*                       @D32CKCK*/ 00878000
         LA    GPR1,RNCLUMDL(,RNCAREG)                             0513 00879000
*               RNCLUMDL=RNCCCLU;   /*                       @D32CKCK*/ 00880000
         MVC   RNCLUMDL(176,RNCAREG),RNCCCLU(RNCAREG)              0514 00881000
*               IF RNCCC->RCCTYPE=1 /* PU TYPE OF 1?         @D32CKMX*/ 00882000
*                 THEN                                             0515 00883000
         L     @07,RNCCC(,RNCAREG)                                 0515 00884000
         CLI   RCCTYPE(@07),1                                      0515 00885000
         BNE   @RF00515                                            0515 00886000
*                 DO;               /* DEFAULT PACING TO (1,1)     0516 00887000
*                                                            @D32CKCK*/ 00888000
*                   RLUNCPPN=1;     /*                       @D32CKMX*/ 00889000
         MVI   RLUNCPPN(GPR1),X'01'                                0517 00890000
*                   RLUNCPPM=1;     /*                       @D32CKMX*/ 00891000
         MVI   RLUNCPPM(GPR1),X'01'                                0518 00892000
*                 END;              /*                       @D32CKCK*/ 00893000
*               ELSE                                               0520 00894000
*                 ;                 /*                       @D32CKCK*/ 00895000
@RF00515 DS    0H                                                  0521 00896000
*               MLCPTR6=GPR1;       /*                       @D32CKCK*/ 00897000
         ST    GPR1,MLCPTR6(,MLCAREG)                              0521 00898000
*             END;                  /*                       @D32CKCK*/ 00899000
*           ELSE                    /*                       @D32CKCK*/ 00900000
*SWLLS:                                                            0523 00901000
*             DO;                   /*                       @D32CKCK*/ 00902000
         B     @RC00511                                            0523 00903000
@RF00511 DS    0H                                                  0523 00904000
SWLLS    DS    0H                                                  0524 00905000
*               IF GPR1=RPRENTLS    /*                       @D32CKCK*/ 00906000
*/********************************************************************/ 00907000
*/* FOR LOCAL SUBAREA ENTRY, SET UP THE LS HDR DEFAULTS AND THE PU/LU*/ 00908000
*/* DEFAULTS. SET MLCPTR0 & REG 1 = @ OF THE LS MODEL.               */ 00909000
*/********************************************************************/ 00910000
*                                                                  0524 00911000
*                 THEN                                             0524 00912000
         C     GPR1,@CF00073                                       0524 00913000
         BNE   @RF00524                                            0524 00914000
*                 DO;               /*                       @D32CKCK*/ 00915000
*                   GPR1=ADDR(RNCLSMDL);/*                   @D32CKCK*/ 00916000
         LA    GPR1,RNCLSMDL(,RNCAREG)                             0526 00917000
*                   RPRELEN=LENGTH(ISTRLS);/*                @D32CKQH*/ 00918000
         MVC   RPRELEN(2,GPR1),@CH01898                            0527 00919000
*                   RPRENTRY=RPRENTLS;/*                     @D32CKQH*/ 00920000
         MVI   RPRENTRY(GPR1),X'05'                                0528 00921000
*                   RPRHDTYP=RPRENTLS;/*                     @D32CKQH*/ 00922000
         MVI   RPRHDTYP(GPR1),X'05'                                0529 00923000
*                   RPRCONCT='1'B;  /*                       @D32CKCK*/ 00924000
         OI    RPRCONCT(GPR1),B'01000000'                          0530 00925000
*                   RDTPRILS='1'B;  /*                       @D32CKCK*/ 00926000
         OI    RDTPRILS(GPR1),B'00000001'                          0531 00927000
*                   RDTCRSDS=BLANK8;/*                       @X50BHMX*/ 00928000
         MVC   RDTCRSDS(8,GPR1),@CC01797                           0532 00929000
*                   CALL DEFPULU;   /*                       @D32CKCK*/ 00930000
         BAL   @14,DEFPULU                                         0533 00931000
*                   MLCPTR0=GPR1;   /*                       @D32CKCK*/ 00932000
         ST    GPR1,MLCPTR0(,MLCAREG)                              0534 00933000
*                 END;              /*                       @D32CKCK*/ 00934000
*               ELSE                /*                       @D32CKCK*/ 00935000
*SWLDA:                                                            0536 00936000
*                 DO;               /*                       @D32CKCK*/ 00937000
         B     @RC00524                                            0536 00938000
@RF00524 DS    0H                                                  0536 00939000
SWLDA    DS    0H                                                  0537 00940000
*/********************************************************************/ 00941000
*/* FOR A DAN ENTRY BUILD BOTH A DAN AND PU ENTRY TYPES. SET UP THE  */ 00942000
*/* DAN DEFAULTS IN MODEL. COPY THE PU DEFAULT AREA TO THE PU MODEL. */ 00943000
*/* COPY THE LU DEFAULT AREA TO THE PU LU SIFT AREA. SET MLCPTR1 &   */ 00944000
*/* REG 1 = @ OF THE DAN MODEL. SET MLCPTR5 & REG 2 = @ OF THE PU    */ 00945000
*/* MODEL. SET MLCPTR6 = @ OF THE PU LU SIFT AREA.                   */ 00946000
*/********************************************************************/ 00947000
*                                                                  0537 00948000
*                   GPR1=ADDR(RNCDAMDL);/*                   @D32CKCK*/ 00949000
         LA    GPR1,RNCDAMDL(,RNCAREG)                             0537 00950000
*                   RNCDAMDL=RNCDAMDL&&RNCDAMDL;/*           @D32CKQH*/ 00951000
         XC    RNCDAMDL(88,RNCAREG),RNCDAMDL(RNCAREG)              0538 00952000
*                   RPRELEN=LENGTH(ISTRDA);/*                @D32CKCK*/ 00953000
         MVC   RPRELEN(2,GPR1),@CH01899                            0539 00954000
*                   RPRENTRY=RPRENTDA;/*                     @D32CKCK*/ 00955000
         MVI   RPRENTRY(GPR1),X'51'                                0540 00956000
*                   DEVSUBND='1'B;  /*                       @XA00448*/ 00957000
         OI    DEVSUBND+44(GPR1),B'00010000'                       0541 00958000
*                   RDARBISA='1'B;  /*                       @D32CKCK*/ 00959000
         OI    RDARBISA(GPR1),B'10000000'                          0542 00960000
*                   RPRCONCT='1'B;  /*                       @D32CKCK*/ 00961000
         OI    RPRCONCT(GPR1),B'01000000'                          0543 00962000
*                   RDACTPCC=1;     /*                       @D32CKCK*/ 00963000
         MVI   RDACTPCC(GPR1),X'01'                                0544 00964000
*                   RNCCCMDL=RNCCCDEF;/*                     @D32CKCK*/ 00965000
         MVC   RNCCCMDL(148,RNCAREG),RNCCCDEF(RNCAREG)             0545 00966000
*                   RNCCCLU=RNCLUDEF;/*                      @D32CKCK*/ 00967000
         MVC   RNCCCLU(176,RNCAREG),RNCLUDEF(RNCAREG)              0546 00968000
*                   MLCPTR1=GPR1;   /*                       @D32CKCK*/ 00969000
         ST    GPR1,MLCPTR1(,MLCAREG)                              0547 00970000
*                   MLCPTR5=ADDR(RNCCCMDL);/*                @D32CKCK*/ 00971000
         LA    @07,RNCCCMDL(,RNCAREG)                              0548 00972000
         ST    @07,MLCPTR5(,MLCAREG)                               0548 00973000
*                   MLCPTR6=ADDR(RNCCCLU);/*                 @D32CKCK*/ 00974000
         LA    @04,RNCCCLU(,RNCAREG)                               0549 00975000
         ST    @04,MLCPTR6(,MLCAREG)                               0549 00976000
*                   GPR2=MLCPTR5;   /*                       @D32CKCK*/ 00977000
         LR    GPR2,@07                                            0550 00978000
*                   RNCGLU='0'B;    /*                       @D32CKCK*/ 00979000
         NI    RNCGLU(RNCAREG),B'11011111'                         0551 00980000
*                   GPR2->RPRHDTYP=RPRENTLS;/*               @D32CKCK*/ 00981000
         MVI   RPRHDTYP(GPR2),X'05'                                0552 00982000
*                   GPR2->RPRNAME=MLCNAME;/*                 @D32CKQH*/ 00983000
         MVC   RPRNAME(8,GPR2),MLCNAME(MLCAREG)                    0553 00984000
*                   GPR2->RPRNOSRT='1'B;/*                   @D32CKCK*/ 00985000
         OI    RPRNOSRT(GPR2),B'10000000'                          0554 00986000
*                 END SWLDA;        /*                       @D32CKCK*/ 00987000
*             END SWLLS;            /*                       @D32CKCK*/ 00988000
@RC00524 DS    0H                                                  0557 00989000
*         END SWLLU;                /*                       @D32CKCK*/ 00990000
@RC00511 DS    0H                                                  0558 00991000
*     END SWLPU;                    /*                       @D32CKCK*/ 00992000
@RC00501 DS    0H                                                  0559 00993000
*   IF RPRENTRY^=RPRENTLS&RPRENTRY^=RPRENTSW/*               @D32CKMX*/ 00994000
*     THEN                                                         0559 00995000
@RC00488 CLI   RPRENTRY(GPR1),X'05'                                0559 00996000
         BE    @RF00559                                            0559 00997000
         CLI   RPRENTRY(GPR1),X'04'                                0559 00998000
         BE    @RF00559                                            0559 00999000
*     RPRHDTYP=RNCSWLS->RPRHDTYP;   /* SET HEADER TYPE IN          0560 01000000
*                                      NON-SWITCHED/LOCAL SUBAREA  0560 01001000
*                                      ENTRY                 @D32CKMX*/ 01002000
         L     @07,RNCSWLS(,RNCAREG)                               0560 01003000
         MVC   RPRHDTYP(1,GPR1),RPRHDTYP(@07)                      0560 01004000
*   ELSE                                                           0561 01005000
*     ;                             /* LOCAL SUB. OR SWITCHED SUB. DO   01006000
*                                      NOTHING               @D32CKMX*/ 01007000
@RF00559 DS    0H                                                  0562 01008000
*   GPR14=ADDR(SWLRTN);             /*                       @D32CKCK*/ 01009000
         LA    GPR14,SWLRTN                                        0562 01010000
*   END SWLSSIFT;                   /*                       @D32CKCK*/ 01011000
@EL00003 DS    0H                                                  0563 01012000
@EF00003 DS    0H                                                  0563 01013000
@ER00003 BR    @14                                                 0563 01014000
*                                                                  0564 01015000
*/********************************************************************/ 01016000
*/* THIS ROUTINE WILL SET THE DEFAULTS FOR PU AND LU ENTRIES.        */ 01017000
*/********************************************************************/ 01018000
*                                                                  0564 01019000
*DEFPULU:                                                          0564 01020000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @D32CKCK*/ 01021000
DEFPULU  DS    0H                                                  0565 01022000
*   RFY                                                            0565 01023000
*    (ISTRPRE,                                                     0565 01024000
*     ISTRCPRE,                                                    0565 01025000
*     ISTRCC,                                                      0565 01026000
*     ISTRLU) BASED(DUM);           /*                       @D32CKCK*/ 01027000
*/********************************************************************/ 01028000
*/* THE FOLLOWING ARE PU DEFAULTS COMMON TO ALL BUILDS.              */ 01029000
*/********************************************************************/ 01030000
*                                                                  0566 01031000
*   DUM=ADDR(RNCCCDEF);             /*                       @D32CKCK*/ 01032000
         LA    DUM,RNCCCDEF(,RNCAREG)                              0566 01033000
*   RPRELEN=LENGTH(ISTRCC);         /*                       @D32CKCK*/ 01034000
         MVC   RPRELEN(2,DUM),@CH01900                             0567 01035000
*   RPRENTRY=RPRENTCC;              /*                       @D32CKCK*/ 01036000
         MVI   RPRENTRY(DUM),X'71'                                 0568 01037000
*   DEVSUBND='1'B;                  /*                       @D32CKCK*/ 01038000
         LA    @07,44                                              0569 01039000
         ALR   @07,DUM                                             0569 01040000
         OI    DEVSUBND(@07),B'00010000'                           0569 01041000
*   DEVTCODE=DEVCC;                 /*                       @D32CKCK*/ 01042000
         MVI   DEVTCODE(@07),X'35'                                 0570 01043000
*   DEVINPUT='1'B;                  /*                       @D32CKCK*/ 01044000
*   DEVOTPUT='1'B;                  /*                       @D32CKCK*/ 01045000
*   DEVCONVR='1'B;                  /*                       @D32CKCK*/ 01046000
*   DEVNNSPT='1'B;                  /*                       @D32CKCK*/ 01047000
         OI    DEVINPUT(@07),B'11100100'                           0574 01048000
*   RCCTYPE=2;                      /*                       @D32CKCK*/ 01049000
         MVI   RCCTYPE(DUM),X'02'                                  0575 01050000
*   RCCMXOUT=1;                     /*                       @D32CKCK*/ 01051000
         MVI   RCCMXOUT(DUM),X'01'                                 0576 01052000
*   RCCPASSL=1;                     /*                       @D32CKCK*/ 01053000
         MVI   RCCPASSL(DUM),X'01'                                 0577 01054000
*   RCCRBISA='1'B;                  /*                       @D32CKCK*/ 01055000
         OI    RCCRBISA(DUM),B'10000000'                           0578 01056000
*   RPRNOSRT='1'B;                  /*                       @D32CKCK*/ 01057000
         OI    RPRNOSRT(DUM),B'10000000'                           0579 01058000
*   RPRAOPN='1'B;                   /*                       @D32CKCK*/ 01059000
         OI    RPRAOPN(DUM),B'00100000'                            0580 01060000
*   IF RNCGSWBD='0'B                /* NOT SWITCHED BLD?     @D32CKCK*/ 01061000
*       &RNCGLSBD='0'B              /* AND NOT LOCAL BLD?    @D32CKCK*/ 01062000
*     THEN                                                         0581 01063000
         TM    RNCGSWBD(RNCAREG),B'00000011'                       0581 01064000
         BNZ   @RF00581                                            0581 01065000
*     RPRCONCT='1'B;                /* MUST BE RN BUILD      @D32CKCK*/ 01066000
         OI    RPRCONCT(DUM),B'01000000'                           0582 01067000
*   ELSE                                                           0583 01068000
*     ;                             /*                       @D32CKCK*/ 01069000
@RF00581 DS    0H                                                  0584 01070000
*/********************************************************************/ 01071000
*/* THE FOLLOWING ARE LU DEFAULTS COMMON TO ALL BUILDS.              */ 01072000
*/********************************************************************/ 01073000
*                                                                  0584 01074000
*   DUM=ADDR(RNCLUDEF);             /*                       @D32CKCK*/ 01075000
         LA    DUM,RNCLUDEF(,RNCAREG)                              0584 01076000
*   RPRELEN=LENGTH(ISTRLU);         /*                       @D32CKCK*/ 01077000
         MVC   RPRELEN(2,DUM),@CH01901                             0585 01078000
*   RPRENTRY=RPRENTLU;              /*                       @D32CKCK*/ 01079000
         MVI   RPRENTRY(DUM),X'81'                                 0586 01080000
*   DEVINPUT='1'B;                  /*                       @D32CKCK*/ 01081000
*   DEVOTPUT='1'B;                  /*                       @D32CKCK*/ 01082000
         LA    @07,44                                              0588 01083000
         ALR   @07,DUM                                             0588 01084000
         OI    DEVINPUT(@07),B'11000000'                           0588 01085000
*   DEVTCODE=DEVLU;                 /*                       @D32CKCK*/ 01086000
         MVI   DEVTCODE(@07),X'6D'                                 0589 01087000
*   RLURBISA='1'B;                  /*                       @D32CKCK*/ 01088000
         OI    RLURBISA(DUM),B'10000000'                           0590 01089000
*   RLUSSCFM=RLUFSS;                /*                       @D32CKCK*/ 01090000
         MVI   RLUSSCFM(DUM),X'01'                                 0591 01091000
*   RLUTYPE=4;                      /*                       @D32CKCK*/ 01092000
         MVI   RLUTYPE(DUM),X'04'                                  0592 01093000
*   RLUMODEN=BLANK8;                /*                       @D32CKCK*/ 01094000
         MVC   RLUMODEN(8,DUM),@CC01797                            0593 01095000
*   RLUUSSNM=BLANK8;                /*                       @DM13371*/ 01096000
         MVC   RLUUSSNM(8,DUM),@CC01797                            0594 01097000
*   RPRAOPN='1'B;                   /*                       @D32CKCK*/ 01098000
         OI    RPRAOPN(DUM),B'00100000'                            0595 01099000
*   IF RNCGLSBD='1'B                /* LOCAL SUBAREA VPACING DEFAULTS   01100000
*                                      ARE (1,1)             @D32CKQH*/ 01101000
*     THEN                                                         0596 01102000
         TM    RNCGLSBD(RNCAREG),B'00000001'                       0596 01103000
         BNO   @RF00596                                            0596 01104000
*     RLUPACEN=1;                   /*                       @D32CKQH*/ 01105000
         MVI   RLUPACEN(DUM),X'01'                                 0597 01106000
*   ELSE                                                           0598 01107000
*     RLUPACEN=2;                   /*                       @D32CKQH*/ 01108000
         B     @RC00596                                            0598 01109000
@RF00596 MVI   RLUPACEN(DUM),X'02'                                 0598 01110000
*   RLUPACEM=1;                     /*                       @D32CKCK*/ 01111000
@RC00596 MVI   RLUPACEM(DUM),X'01'                                 0599 01112000
*   RCPLGNAP=BLANK8;                /*                       @D32CKCK*/ 01113000
         MVC   RCPLGNAP(8,DUM),@CC01797                            0600 01114000
*   RCPLGNCT=BLANK8;                /*                       @D32CKCK*/ 01115000
         MVC   RCPLGNCT(8,DUM),@CC01797                            0601 01116000
*   RCPBFLIM=2;                     /*                       @XM09007*/ 01117000
         MVI   RCPBFLIM(DUM),X'02'                                 0602 01118000
*   RCPRRECD='1'B;                  /*                       @D32CKCK*/ 01119000
         OI    RCPRRECD(DUM),B'01000000'                           0603 01120000
*   IF RNCGSWBD='0'B                /* NOT SWITCHED BLD?     @D32CKCK*/ 01121000
*       &RNCGLSBD='0'B              /* AND NOT LOCAL BLD?    @D32CKCK*/ 01122000
*     THEN                                                         0604 01123000
         TM    RNCGSWBD(RNCAREG),B'00000011'                       0604 01124000
         BNZ   @RF00604                                            0604 01125000
*     RPRCONCT='1'B;                /* MUST BE RN BUILD      @D32CKCK*/ 01126000
         OI    RPRCONCT(DUM),B'01000000'                           0605 01127000
*   ELSE                                                           0606 01128000
*     ;                             /*                       @D32CKCK*/ 01129000
@RF00604 DS    0H                                                  0607 01130000
*   END DEFPULU;                    /*                       @D32CKCK*/ 01131000
@EL00004 DS    0H                                                  0607 01132000
@EF00004 DS    0H                                                  0607 01133000
@ER00004 BR    @14                                                 0607 01134000
*                                                                  0608 01135000
*/********************************************************************/ 01136000
*/* SECONDARY ENTRY POINT, ISTSDCR1, IS CALLED BY RN BUILD AND THE   */ 01137000
*/* MACRO HANDLERS TO BYPASS MACROS AND KEYWORDS WHICH ARE TO BE     */ 01138000
*/* IGNORED BY VTAM SYSTEM DEFINITION.                               */ 01139000
*/********************************************************************/ 01140000
*                                                                  0608 01141000
*   GENERATE;                                                      0608 01142000
*                                                                  0608 01143000
           ENTRY ISTSDCR1                                               01144000
ISTSDCR1   SR 15,15                                                     01145000
           BR 14                                                        01146000
*/* TPEPILOG                                                         */ 01147000
*                                                                  0609 01148000
*   GEN(PRINT OFF);                                                0609 01149000
         PRINT OFF                                                      01150000
*   GEN(PRINT ON);                                                 0610 01151000
*                                                                  0610 01152000
         PRINT ON                                                       01153000
*/* END OF TPEPILOG                                                  */ 01154000
*                                                                  0611 01155000
*   END ISTSDCRS;                                                  0611 01156000
         B     @EL00001                                            0611 01157000
@DATA    DS    0H                                                       01158000
@CH01886 DC    H'80'                                                    01159000
@CH01891 DC    H'84'                                                    01160000
@CH01899 DC    H'88'                                                    01161000
@CH01887 DC    H'92'                                                    01162000
@CH01895 DC    H'96'                                                    01163000
@CH01894 DC    H'116'                                                   01164000
@CH01898 DC    H'144'                                                   01165000
@CH01900 DC    H'148'                                                   01166000
@CH01897 DC    H'156'                                                   01167000
@CH01890 DC    H'160'                                                   01168000
@CH01901 DC    H'176'                                                   01169000
@CH01896 DC    H'212'                                                   01170000
@CH00977 DC    H'256'                                                   01171000
@DATD    DSECT                                                          01172000
         DS    0F                                                       01173000
ISTSDCRS CSECT                                                          01174000
         DS    0F                                                       01175000
@CF01858 DC    F'65535'                                                 01176000
@CF00065 DC    XL4'01'                                                  01177000
@CF00071 DC    XL4'04'                                                  01178000
@CF00073 DC    XL4'05'                                                  01179000
@CF00167 DC    XL4'80'                                                  01180000
@CF00169 DC    XL4'81'                                                  01181000
@CF00258 DC    XL4'90'                                                  01182000
@CF00260 DC    XL4'82'                                                  01183000
@CF00265 DC    XL4'70'                                                  01184000
@CF00267 DC    XL4'50'                                                  01185000
@CF00270 DC    XL4'30'                                                  01186000
@CF00277 DC    XL4'20'                                                  01187000
@CF00280 DC    XL4'71'                                                  01188000
@CF00285 DC    XL4'72'                                                  01189000
@DATD    DSECT                                                          01190000
         DS    0D                                                       01191000
FSBPTR   DS    A                                                        01192000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01193000
@ENDDATD EQU   *                                                        01194000
ISTSDCRS CSECT                                                          01195000
         DS    0F                                                       01196000
@SIZDATD DC    AL1(0)                                                   01197000
         DC    AL3(@ENDDATD-@DATD)                                      01198000
         DS    0D                                                       01199000
@CC01797 DC    C'        '                                              01200000
@CC01857 DC    C'NCP001'                                                01201000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01202000
@01      EQU   01                                                       01203000
@02      EQU   02                                                       01204000
@03      EQU   03                                                       01205000
@04      EQU   04                                                       01206000
@05      EQU   05                                                       01207000
@06      EQU   06                                                       01208000
@07      EQU   07                                                       01209000
@08      EQU   08                                                       01210000
@09      EQU   09                                                       01211000
@10      EQU   10                                                       01212000
@11      EQU   11                                                       01213000
@12      EQU   12                                                       01214000
@13      EQU   13                                                       01215000
@14      EQU   14                                                       01216000
@15      EQU   15                                                       01217000
DUM      EQU   @03                                                      01218000
GPR1     EQU   @01                                                      01219000
GPR2     EQU   @02                                                      01220000
MLCAREG  EQU   @05                                                      01221000
RNCAREG  EQU   @06                                                      01222000
GPR13    EQU   @13                                                      01223000
GPR14    EQU   @14                                                      01224000
ISTDEVCH EQU   0                                                        01225000
DEVSHCH  EQU   ISTDEVCH                                                 01226000
DEVCHAR  EQU   DEVSHCH                                                  01227000
DEVINPUT EQU   DEVCHAR                                                  01228000
DEVOTPUT EQU   DEVCHAR                                                  01229000
DEVCONVR EQU   DEVCHAR                                                  01230000
DEVSUBND EQU   DEVCHAR                                                  01231000
DEVNNSPT EQU   DEVCHAR                                                  01232000
DEVTCODE EQU   ISTDEVCH+1                                               01233000
DEVFLAGS EQU   ISTDEVCH+3                                               01234000
DEVFCCTL EQU   DEVFLAGS                                                 01235000
DEVCHAR3 EQU   DEVFLAGS                                                 01236000
ISTLOK   EQU   0                                                        01237000
LOKCHN   EQU   ISTLOK+1                                                 01238000
LOKCHNG  EQU   LOKCHN                                                   01239000
@NM00002 EQU   LOKCHNG+2                                                01240000
ISTRPRE  EQU   0                                                        01241000
RPRNAME  EQU   ISTRPRE                                                  01242000
RPRCOMID EQU   ISTRPRE+8                                                01243000
RPRELEN  EQU   ISTRPRE+16                                               01244000
RPRENTRY EQU   ISTRPRE+20                                               01245000
RPRFLAGA EQU   ISTRPRE+21                                               01246000
RPRFLAGB EQU   ISTRPRE+22                                               01247000
RPRAOPN  EQU   RPRFLAGB                                                 01248000
RPRCAUSE EQU   ISTRPRE+23                                               01249000
RPRNOSRT EQU   RPRCAUSE                                                 01250000
RPRHDTYP EQU   ISTRPRE+27                                               01251000
RPRDEVCH EQU   ISTRPRE+44                                               01252000
RPRFLAGD EQU   ISTRPRE+61                                               01253000
RPRCONCT EQU   RPRFLAGD                                                 01254000
RPRFLAGC EQU   ISTRPRE+62                                               01255000
ISTRCPRE EQU   0                                                        01256000
RCPBFLIM EQU   ISTRCPRE+90                                              01257000
RCPPMODE EQU   ISTRCPRE+91                                              01258000
RCPRBASC EQU   RCPPMODE                                                 01259000
RCPRRECD EQU   RCPPMODE                                                 01260000
RCPLGNIN EQU   ISTRCPRE+92                                              01261000
RCPLGNAP EQU   RCPLGNIN                                                 01262000
RCPLGNCT EQU   RCPLGNIN+8                                               01263000
ISTRDT   EQU   0                                                        01264000
RDTPLEN  EQU   ISTRDT+72                                                01265000
RDTPRIOR EQU   RDTPLEN                                                  01266000
RDTPRIRN EQU   RDTPRIOR                                                 01267000
RDTPRISW EQU   RDTPRIOR                                                 01268000
RDTPRILS EQU   RDTPRIOR                                                 01269000
RDTFLAGB EQU   ISTRDT+91                                                01270000
RDTVYRPH EQU   ISTRDT+108                                               01271000
RDTSTCNT EQU   ISTRDT+112                                               01272000
RDTCRSDS EQU   ISTRDT+116                                               01273000
ISTRAP   EQU   0                                                        01274000
RAPFLG   EQU   ISTRAP+108                                               01275000
RAPFLGB  EQU   ISTRAP+109                                               01276000
RAPFLGC  EQU   ISTRAP+110                                               01277000
ISTRLC   EQU   0                                                        01278000
RLCADR   EQU   ISTRLC+72                                                01279000
RLCFLAG  EQU   RLCADR                                                   01280000
ISTRRN   EQU   0                                                        01281000
RRNADR   EQU   ISTRRN+136                                               01282000
RRNFLAG  EQU   RRNADR                                                   01283000
RRNRBISA EQU   RRNFLAG                                                  01284000
RRNUCBAD EQU   RRNADR+1                                                 01285000
RRNRDF   EQU   ISTRRN+172                                               01286000
RRNRDFA  EQU   RRNRDF                                                   01287000
RRNRASHT EQU   RRNRDFA                                                  01288000
RRNRASYN EQU   RRNRDFA                                                  01289000
RRNRAOLT EQU   RRNRDFA                                                  01290000
RRNRBREM EQU   RRNRDFA                                                  01291000
RRNRANCP EQU   RRNRDFA                                                  01292000
RRNRAPEP EQU   RRNRDFA                                                  01293000
RRNRDFB  EQU   RRNRDF+1                                                 01294000
RRNRBMDL EQU   RRNRDFB                                                  01295000
RRNRBCT1 EQU   RRNRDFB                                                  01296000
RRNRBCT2 EQU   RRNRDFB                                                  01297000
RRNCMF   EQU   ISTRRN+176                                               01298000
RRNCMFA  EQU   RRNCMF                                                   01299000
RRNCMFB  EQU   RRNCMF+1                                                 01300000
RRNCMFC  EQU   RRNCMF+2                                                 01301000
RRNCMFD  EQU   RRNCMF+3                                                 01302000
RRNNMDPD EQU   ISTRRN+192                                               01303000
RRNNMNCP EQU   ISTRRN+208                                               01304000
RRNHPRE  EQU   ISTRRN+216                                               01305000
RRNHLENH EQU   RRNHPRE                                                  01306000
RRNNCPNM EQU   ISTRRN+221                                               01307000
RRNMSIZE EQU   ISTRRN+228                                               01308000
ISTRGP   EQU   0                                                        01309000
RGPFLG   EQU   ISTRGP+72                                                01310000
RGPASS   EQU   RGPFLG                                                   01311000
RGPASDLC EQU   RGPFLG                                                   01312000
ISTRLN   EQU   0                                                        01313000
RLNADR   EQU   ISTRLN+72                                                01314000
RLNFLAG  EQU   RLNADR                                                   01315000
RLNUCBAD EQU   RLNADR+1                                                 01316000
RLNSTAT1 EQU   ISTRLN+86                                                01317000
RLNSTAT2 EQU   ISTRLN+87                                                01318000
RLNRDF   EQU   ISTRLN+88                                                01319000
RLNRDFA  EQU   RLNRDF                                                   01320000
RLNRACNT EQU   RLNRDFA                                                  01321000
RLNRACAT EQU   RLNRACNT                                                 01322000
RLNRANCP EQU   RLNRDFA                                                  01323000
RLNRAPEP EQU   RLNRDFA                                                  01324000
RLNRDFB  EQU   RLNRDF+1                                                 01325000
RLNRBUSE EQU   RLNRDFB                                                  01326000
RLNANSWR EQU   RLNRDFB                                                  01327000
RLNRATRN EQU   RLNRDFB                                                  01328000
RLNCTSES EQU   ISTRLN+95                                                01329000
RLNPOLMT EQU   ISTRLN+100                                               01330000
RLNCRFLG EQU   ISTRLN+102                                               01331000
RLNLSCMD EQU   RLNCRFLG                                                 01332000
ISTRPT   EQU   0                                                        01333000
RPTLNCID EQU   ISTRPT+116                                               01334000
RPTDITT  EQU   ISTRPT+128                                               01335000
RPTFLAG1 EQU   ISTRPT+140                                               01336000
RPTISTAT EQU   RPTFLAG1                                                 01337000
ISTRCL   EQU   0                                                        01338000
RCLADR   EQU   ISTRCL+72                                                01339000
RCLFLAG  EQU   RCLADR                                                   01340000
RCLRBISA EQU   RCLFLAG                                                  01341000
ISTRTR   EQU   0                                                        01342000
RTRADR   EQU   ISTRTR+124                                               01343000
RTRFLAG  EQU   RTRADR                                                   01344000
RTRRBISA EQU   RTRFLAG                                                  01345000
RTRRDFA  EQU   ISTRTR+136                                               01346000
RTRRAALL EQU   RTRRDFA                                                  01347000
RTRRDFB  EQU   ISTRTR+137                                               01348000
RTRRDFC  EQU   ISTRTR+138                                               01349000
RTRRCBLK EQU   RTRRDFC                                                  01350000
RTRRDFD  EQU   ISTRTR+139                                               01351000
RTRRDBHN EQU   RTRRDFD                                                  01352000
RTRRDFE  EQU   ISTRTR+140                                               01353000
RTRRDFF  EQU   ISTRTR+141                                               01354000
RTRCRFLG EQU   ISTRTR+143                                               01355000
RTRLSCMD EQU   RTRCRFLG                                                 01356000
RTRBHSN1 EQU   ISTRTR+144                                               01357000
RTRBSCID EQU   ISTRTR+188                                               01358000
RTRLCTI  EQU   ISTRTR+209                                               01359000
ISTRIN   EQU   0                                                        01360000
RINDFD   EQU   ISTRIN+124                                               01361000
RINREMPO EQU   RINDFD                                                   01362000
RINNODEF EQU   RINDFD                                                   01363000
RINLDISC EQU   RINDFD                                                   01364000
RINNODID EQU   ISTRIN+125                                               01365000
RINRLDAF EQU   ISTRIN+126                                               01366000
RINREMOT EQU   ISTRIN+128                                               01367000
RINVPAB  EQU   ISTRIN+132                                               01368000
RINRPHCN EQU   ISTRIN+136                                               01369000
RINNCSPL EQU   ISTRIN+140                                               01370000
RINCNCNT EQU   ISTRIN+144                                               01371000
ISTRDS   EQU   0                                                        01372000
ISTDOT   EQU   0                                                        01373000
ISTRCC   EQU   0                                                        01374000
RCCTYPE  EQU   ISTRCC+72                                                01375000
RCCFLAG  EQU   ISTRCC+73                                                01376000
RCCRBISA EQU   RCCFLAG                                                  01377000
RCCFLAGB EQU   ISTRCC+74                                                01378000
RCCSTAID EQU   ISTRCC+78                                                01379000
RCCID48  EQU   RCCSTAID+2                                               01380000
RCCCRFLG EQU   ISTRCC+108                                               01381000
RCCMXOUT EQU   ISTRCC+130                                               01382000
RCCPASSL EQU   ISTRCC+131                                               01383000
ISTRLU   EQU   0                                                        01384000
RLUTYPE  EQU   ISTRLU+124                                               01385000
RLUFLAG  EQU   ISTRLU+125                                               01386000
RLURBISA EQU   RLUFLAG                                                  01387000
RLUCRFLG EQU   ISTRLU+126                                               01388000
RLUSSCFM EQU   ISTRLU+127                                               01389000
RLUPACE  EQU   ISTRLU+132                                               01390000
RLUPACEN EQU   RLUPACE                                                  01391000
RLUPACEM EQU   RLUPACE+1                                                01392000
RLUNCPPC EQU   ISTRLU+134                                               01393000
RLUNCPPN EQU   RLUNCPPC                                                 01394000
RLUNCPPM EQU   RLUNCPPC+1                                               01395000
RLUUSSTB EQU   ISTRLU+140                                               01396000
RLUUSSNM EQU   RLUUSSTB                                                 01397000
RLUMODET EQU   ISTRLU+152                                               01398000
RLUMODEN EQU   RLUMODET                                                 01399000
ISTRPX   EQU   0                                                        01400000
ISTRLX   EQU   0                                                        01401000
RLXFLAGA EQU   ISTRLX+76                                                01402000
ISTRSW   EQU   0                                                        01403000
ISTRDA   EQU   0                                                        01404000
RDAADR   EQU   ISTRDA+72                                                01405000
RDAFLAG  EQU   RDAADR                                                   01406000
RDARBISA EQU   RDAFLAG                                                  01407000
RDAUCBAD EQU   RDAADR+1                                                 01408000
RDACTPCC EQU   ISTRDA+79                                                01409000
ISTRLS   EQU   0                                                        01410000
ISTDNT   EQU   0                                                        01411000
ISTGNT   EQU   0                                                        01412000
ISTPAT   EQU   0                                                        01413000
PATFLAGA EQU   ISTPAT+7                                                 01414000
ISTMLCA  EQU   0                                                        01415000
MLCSECCA EQU   ISTMLCA                                                  01416000
MLCFLAGS EQU   ISTMLCA+16                                               01417000
MLCERBF  EQU   ISTMLCA+28                                               01418000
MLCERBF1 EQU   MLCERBF                                                  01419000
MLCERBF2 EQU   MLCERBF+8                                                01420000
MLCNAME  EQU   MLCERBF2                                                 01421000
MLCERBF3 EQU   MLCERBF+32                                               01422000
MLCPTRS  EQU   ISTMLCA+96                                               01423000
MLCPTR0  EQU   MLCPTRS                                                  01424000
MLCPTR1  EQU   MLCPTRS+4                                                01425000
MLCPTR2  EQU   MLCPTRS+8                                                01426000
MLCPTR3  EQU   MLCPTRS+12                                               01427000
MLCPTR4  EQU   MLCPTRS+16                                               01428000
MLCPTR5  EQU   MLCPTRS+20                                               01429000
MLCPTR6  EQU   MLCPTRS+24                                               01430000
MLCPTR7  EQU   MLCPTRS+28                                               01431000
MLCADSAV EQU   ISTMLCA+652                                              01432000
MLCADDAT EQU   ISTMLCA+724                                              01433000
MLCWRK1  EQU   ISTMLCA+964                                              01434000
MLCWRK2  EQU   ISTMLCA+1220                                             01435000
MLCOCPRM EQU   MLCWRK2                                                  01436000
MLCWRK3  EQU   ISTMLCA+1284                                             01437000
MLCRDPRM EQU   MLCWRK3                                                  01438000
MLCWRK4  EQU   ISTMLCA+1348                                             01439000
MLCTPMSG EQU   MLCWRK4                                                  01440000
MLCDECB2 EQU   MLCTPMSG+32                                              01441000
ISTRNCA  EQU   0                                                        01442000
RNCRN    EQU   ISTRNCA                                                  01443000
RNCSWLS  EQU   ISTRNCA+4                                                01444000
RNCCC    EQU   ISTRNCA+28                                               01445000
RNCGLINE EQU   ISTRNCA+122                                              01446000
RNCGCLUS EQU   ISTRNCA+122                                              01447000
RNCGTERM EQU   ISTRNCA+123                                              01448000
RNCGLU   EQU   ISTRNCA+123                                              01449000
RNCGCOMP EQU   ISTRNCA+123                                              01450000
RNCGRGAP EQU   ISTRNCA+125                                              01451000
RNCGSWBD EQU   ISTRNCA+126                                              01452000
RNCGLSBD EQU   ISTRNCA+126                                              01453000
RNCLNDEF EQU   ISTRNCA+128                                              01454000
RNCCLDEF EQU   ISTRNCA+288                                              01455000
RNCCCDEF EQU   ISTRNCA+384                                              01456000
RNCPXDEF EQU   ISTRNCA+532                                              01457000
RNCTRDEF EQU   ISTRNCA+616                                              01458000
RNCLUDEF EQU   ISTRNCA+828                                              01459000
RNCGPLN  EQU   ISTRNCA+1004                                             01460000
RNCGPCL  EQU   ISTRNCA+1164                                             01461000
RNCGPCC  EQU   ISTRNCA+1260                                             01462000
RNCGPPX  EQU   ISTRNCA+1408                                             01463000
RNCGPTR  EQU   ISTRNCA+1492                                             01464000
RNCGPLU  EQU   ISTRNCA+1704                                             01465000
RNCLNCL  EQU   ISTRNCA+1880                                             01466000
RNCLNCC  EQU   ISTRNCA+1976                                             01467000
RNCLNPX  EQU   ISTRNCA+2124                                             01468000
RNCLNTR  EQU   ISTRNCA+2208                                             01469000
RNCLNLU  EQU   ISTRNCA+2420                                             01470000
RNCCLTR  EQU   ISTRNCA+2596                                             01471000
RNCCCLU  EQU   ISTRNCA+2808                                             01472000
RNCRNMDL EQU   ISTRNCA+2984                                             01473000
RNCTRMDL EQU   RNCRNMDL                                                 01474000
RNCLUMDL EQU   RNCTRMDL                                                 01475000
RNCLNMDL EQU   RNCLUMDL                                                 01476000
RNCSWMDL EQU   RNCLNMDL                                                 01477000
RNCLSMDL EQU   RNCSWMDL                                                 01478000
RNCCLMDL EQU   RNCLSMDL                                                 01479000
RNCDAMDL EQU   RNCCLMDL                                                 01480000
RNCDSMDL EQU   RNCDAMDL                                                 01481000
RNCCMMDL EQU   ISTRNCA+3240                                             01482000
RNCINMDL EQU   RNCCMMDL                                                 01483000
RNCCCMDL EQU   RNCINMDL                                                 01484000
RNCGPMDL EQU   RNCCCMDL                                                 01485000
RNCPXMDL EQU   RNCGPMDL                                                 01486000
RNCLXMDL EQU   RNCPXMDL                                                 01487000
RNCSAV1  EQU   ISTRNCA+3460                                             01488000
RNCSAV2  EQU   ISTRNCA+3588                                             01489000
RNCDAT2  EQU   ISTRNCA+3660                                             01490000
RNCWORK1 EQU   ISTRNCA+3844                                             01491000
RNCPHR1  EQU   RNCWORK1                                                 01492000
RNCWORK2 EQU   ISTRNCA+5892                                             01493000
RNCPHR2  EQU   RNCWORK2                                                 01494000
RNCWORK3 EQU   ISTRNCA+7940                                             01495000
ISTLCST  EQU   0                                                        01496000
LCSTTYPE EQU   ISTLCST+12                                               01497000
LCSTACR  EQU   ISTLCST+18                                               01498000
ISTDITHD EQU   0                                                        01499000
ISTDHDVI EQU   0                                                        01500000
DHDDIVTH EQU   ISTDHDVI+12                                              01501000
ISTDDTVI EQU   0                                                        01502000
ISTRNCDT EQU   0                                                        01503000
ISTRNCGT EQU   0                                                        01504000
ISTRNCPT EQU   0                                                        01505000
ISTFDB   EQU   0                                                        01506000
ISTFSB   EQU   0                                                        01507000
FSBFSB   EQU   ISTFSB                                                   01508000
FSBMNRCD EQU   FSBFSB+2                                                 01509000
FSBSFLGS EQU   FSBFSB+3                                                 01510000
FSBFSBA  EQU   FSBFSB+4                                                 01511000
FSBBTH   EQU   FSBFSB+8                                                 01512000
FSBCID   EQU   FSBBTH                                                   01513000
FSBRQTAG EQU   FSBBTH+4                                                 01514000
FSBSEQID EQU   FSBRQTAG                                                 01515000
FSBFLAGS EQU   FSBSEQID                                                 01516000
FSBSEQ   EQU   FSBSEQID+1                                               01517000
FSBCSWST EQU   FSBBTH+6                                                 01518000
FSBTHFLD EQU   FSBCSWST                                                 01519000
FSBTH1   EQU   FSBTHFLD                                                 01520000
FSBSYSRS EQU   FSBTH1                                                   01521000
FSBTH2   EQU   FSBTHFLD+1                                               01522000
FSBEXTRS EQU   FSBTH2                                                   01523000
FSBXFSTS EQU   FSBEXTRS                                                 01524000
FSBXCODE EQU   FSBEXTRS                                                 01525000
FSBNETRS EQU   FSBFSB+16                                                01526000
FSBSRCAT EQU   FSBNETRS                                                 01527000
FSBERC   EQU   FSBNETRS+1                                               01528000
FSBFBMI  EQU   FSBERC                                                   01529000
FSBDMGRS EQU   FSBFSB+18                                                01530000
FSBSS1   EQU   FSBDMGRS                                                 01531000
FSBSS2   EQU   FSBDMGRS+1                                               01532000
FSBLCPB  EQU   FSBFSB+20                                                01533000
FSBMSGID EQU   FSBLCPB                                                  01534000
FSBLCCWA EQU   FSBFSB+24                                                01535000
FSBRLSTS EQU   FSBLCCWA                                                 01536000
ISTCCW   EQU   0                                                        01537000
CCWVADDR EQU   ISTCCW                                                   01538000
CCWFLAGS EQU   ISTCCW+4                                                 01539000
CCWSPARE EQU   ISTCCW+5                                                 01540000
ISTTH    EQU   0                                                        01541000
THFLAG1  EQU   ISTTH                                                    01542000
THFLGA   EQU   THFLAG1                                                  01543000
THMPF    EQU   THFLGA                                                   01544000
THFLGB   EQU   THFLAG1+1                                                01545000
ISTTH2   EQU   0                                                        01546000
TH2FLAG1 EQU   ISTTH2                                                   01547000
TH2MPF   EQU   TH2FLAG1                                                 01548000
ISTRH    EQU   0                                                        01549000
RHFLAGS  EQU   ISTRH                                                    01550000
RH1      EQU   RHFLAGS                                                  01551000
RH2      EQU   RHFLAGS+1                                                01552000
RHRETRY  EQU   RH2                                                      01553000
RHRSVD1  EQU   RH2                                                      01554000
RH3      EQU   RHFLAGS+2                                                01555000
FSBCOMBN EQU   FSBNETRS                                                 01556000
FSBRHFLD EQU   FSBCOMBN+1                                               01557000
FSBRH3   EQU   FSBRHFLD+2                                               01558000
FSBLDFLG EQU   FSBRH3                                                   01559000
@NM00015 EQU   FSBRQTAG                                                 01560000
RTRDNCBA EQU   ISTRTR+40                                                01561000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01562000
FSBRT0B  EQU   @NM00015+1                                               01563000
FSBRT0A  EQU   @NM00015+1                                               01564000
FSBRT09  EQU   @NM00015+1                                               01565000
FSBRT08  EQU   @NM00015+1                                               01566000
FSBRT07  EQU   @NM00015                                                 01567000
FSBRT06  EQU   @NM00015                                                 01568000
FSBRT05  EQU   @NM00015                                                 01569000
FSBRT04  EQU   @NM00015                                                 01570000
FSBRT03  EQU   @NM00015                                                 01571000
FSBRT02  EQU   @NM00015                                                 01572000
FSBRT01  EQU   @NM00015                                                 01573000
FSBRT00  EQU   @NM00015                                                 01574000
FSBLDCUF EQU   FSBLDFLG                                                 01575000
FSBLDSIF EQU   FSBLDFLG                                                 01576000
FSBLDSOF EQU   FSBLDFLG                                                 01577000
FSBLDEBF EQU   FSBLDFLG                                                 01578000
FSBLDBBF EQU   FSBLDFLG                                                 01579000
FSBLDFME EQU   FSBLDFLG                                                 01580000
FSBLDSCF EQU   FSBLDFLG                                                 01581000
FSBLDRMF EQU   FSBLDFLG                                                 01582000
FSBRH2   EQU   FSBRHFLD+1                                               01583000
FSBRH1   EQU   FSBRHFLD                                                 01584000
FSBALIGN EQU   FSBCOMBN                                                 01585000
RHRSVD5  EQU   RH3                                                      01586000
RHRSVD4  EQU   RH3                                                      01587000
RHLOG    EQU   RH3                                                      01588000
RHRSVD3  EQU   RH3                                                      01589000
RHRCDIR  EQU   RH3                                                      01590000
RHCDIR   EQU   RH3                                                      01591000
RHEB     EQU   RH3                                                      01592000
RHBB     EQU   RH3                                                      01593000
RHPACE   EQU   RH2                                                      01594000
RHRSVD2  EQU   RH2                                                      01595000
RHINOP   EQU   RHRSVD1                                                  01596000
RHBUSY   EQU   RHRETRY                                                  01597000
RHEXCEPT EQU   RH2                                                      01598000
RHRRN    EQU   RH2                                                      01599000
RHPE     EQU   RH2                                                      01600000
RHFME    EQU   RH2                                                      01601000
RHCHAIN  EQU   RH1                                                      01602000
RHSENSE  EQU   RH1                                                      01603000
RHFORMAT EQU   RH1                                                      01604000
RHDIRI   EQU   RH1                                                      01605000
RHSCI    EQU   RH1                                                      01606000
RHTYPE   EQU   RH1                                                      01607000
RHQS     EQU   RH1                                                      01608000
TH2SNF   EQU   ISTTH2+4                                                 01609000
TH2OAF   EQU   ISTTH2+3                                                 01610000
TH2DAF   EQU   ISTTH2+2                                                 01611000
TH2CDF   EQU   TH2FLAG1+1                                               01612000
TH2SEF   EQU   TH2FLAG1+1                                               01613000
TH2PYF   EQU   TH2FLAG1+1                                               01614000
TH2AFI   EQU   TH2FLAG1                                                 01615000
TH2PSI   EQU   TH2FLAG1                                                 01616000
TH2CMPLI EQU   TH2MPF                                                   01617000
TH2RHI   EQU   TH2MPF                                                   01618000
TH2FID   EQU   TH2FLAG1                                                 01619000
THDCF    EQU   ISTTH+8                                                  01620000
THSNF    EQU   ISTTH+6                                                  01621000
THOAF    EQU   ISTTH+4                                                  01622000
THDAF    EQU   ISTTH+2                                                  01623000
THCDF    EQU   THFLGB                                                   01624000
THSEF    EQU   THFLGB                                                   01625000
THPYF    EQU   THFLGB                                                   01626000
THAFI    EQU   THFLGA                                                   01627000
THPSI    EQU   THFLGA                                                   01628000
THCMPLI  EQU   THMPF                                                    01629000
THRHI    EQU   THMPF                                                    01630000
THFID    EQU   THFLAG1                                                  01631000
CCWCOUNT EQU   ISTCCW+6                                                 01632000
CCWSPRSV EQU   CCWSPARE                                                 01633000
CCWCFTX  EQU   CCWSPARE                                                 01634000
CCWTRCE  EQU   CCWSPARE                                                 01635000
CCWNULL  EQU   CCWFLAGS                                                 01636000
CCWPCI   EQU   CCWFLAGS                                                 01637000
CCWSKIP  EQU   CCWFLAGS                                                 01638000
CCWSLI   EQU   CCWFLAGS                                                 01639000
CCWCC    EQU   CCWFLAGS                                                 01640000
CCWCD    EQU   CCWFLAGS                                                 01641000
CCWADDR  EQU   CCWVADDR+1                                               01642000
CCWCODE  EQU   CCWVADDR                                                 01643000
FSBFDB   EQU   ISTFSB+32                                                01644000
FSBRSV01 EQU   FSBFSB+30                                                01645000
FSBTHCNT EQU   FSBFSB+28                                                01646000
FSBRLRSV EQU   FSBRLSTS                                                 01647000
FSBCFTX  EQU   FSBRLSTS                                                 01648000
FSBICNCB EQU   FSBMSGID                                                 01649000
FSBSSOC  EQU   FSBSS2                                                   01650000
FSBSSCC  EQU   FSBSS2                                                   01651000
FSBSSDC  EQU   FSBSS2                                                   01652000
FSBSSEC  EQU   FSBSS2                                                   01653000
FSBSSIR  EQU   FSBSS2                                                   01654000
FSBSSCR  EQU   FSBSS2                                                   01655000
@NM00014 EQU   FSBSS2                                                   01656000
@NM00013 EQU   FSBSS1                                                   01657000
FSBSSDE  EQU   FSBSS1                                                   01658000
FSBSSUS  EQU   FSBSS1                                                   01659000
@NM00012 EQU   FSBSS1                                                   01660000
FSBSOHI  EQU   FSBERC                                                   01661000
FSBLGI   EQU   FSBERC                                                   01662000
FSBLMRI  EQU   FSBFBMI                                                  01663000
FSBETI   EQU   FSBERC                                                   01664000
FSBEMI   EQU   FSBERC                                                   01665000
FSBEBI   EQU   FSBERC                                                   01666000
FSBECI   EQU   FSBERC                                                   01667000
FSBELI   EQU   FSBERC                                                   01668000
FSBMJRCD EQU   FSBSRCAT                                                 01669000
FSBXLCI  EQU   FSBXCODE                                                 01670000
FSBXFINS EQU   FSBXCODE                                                 01671000
FSBXNORM EQU   FSBXFSTS                                                 01672000
FSBSCODE EQU   FSBSYSRS                                                 01673000
FSBSPHSE EQU   FSBSYSRS                                                 01674000
FSBSERR  EQU   FSBSYSRS                                                 01675000
FSBCMD   EQU   FSBSEQ                                                   01676000
FSBDTRCE EQU   FSBFLAGS                                                 01677000
FSBASBTU EQU   FSBFLAGS                                                 01678000
FSBINPET EQU   FSBFLAGS                                                 01679000
FSBNONCB EQU   FSBFLAGS                                                 01680000
FSBLBIND EQU   FSBFLAGS                                                 01681000
FSBFFIND EQU   FSBFLAGS                                                 01682000
FSBACIND EQU   FSBFLAGS                                                 01683000
FSBRFIND EQU   FSBFLAGS                                                 01684000
FSBDAF   EQU   FSBCID+2                                                 01685000
FSBSAF   EQU   FSBCID                                                   01686000
FSBGATE  EQU   FSBFSBA                                                  01687000
FSBRSV02 EQU   FSBSFLGS                                                 01688000
FSBPGBUF EQU   FSBSFLGS                                                 01689000
FSBMNSDA EQU   FSBMNRCD                                                 01690000
FSBMNOA  EQU   FSBMNRCD                                                 01691000
FSBMNDIF EQU   FSBMNRCD                                                 01692000
FSBMNEOP EQU   FSBMNRCD                                                 01693000
FSBMNDNU EQU   FSBMNRCD                                                 01694000
FSBMNATN EQU   FSBMNRCD                                                 01695000
FSBMNRVI EQU   FSBMNRCD                                                 01696000
FSBMNELI EQU   FSBMNRCD                                                 01697000
FSBLNGTH EQU   FSBFSB+1                                                 01698000
FSBTYPE  EQU   FSBFSB                                                   01699000
FDBOFSET EQU   ISTFDB+10                                                01700000
FDBDATCT EQU   ISTFDB+8                                                 01701000
FDBDATAA EQU   ISTFDB+4                                                 01702000
FDBFDBA  EQU   ISTFDB                                                   01703000
RNCPT    EQU   ISTRNCPT+4                                               01704000
RNCPTLN  EQU   ISTRNCPT                                                 01705000
RNCGT    EQU   ISTRNCGT+4                                               01706000
RNCGTLN  EQU   ISTRNCGT                                                 01707000
RNCDT    EQU   ISTRNCDT+4                                               01708000
RNCDTLN  EQU   ISTRNCDT                                                 01709000
DDTASSOC EQU   ISTDDTVI+40                                              01710000
DDTRDTPT EQU   ISTDDTVI+36                                              01711000
DDTTRNM  EQU   ISTDDTVI+28                                              01712000
DDTBSCLN EQU   ISTDDTVI+27                                              01713000
DDTBSCID EQU   ISTDDTVI+4                                               01714000
DDTFWPTR EQU   ISTDDTVI                                                 01715000
DHDGPPTR EQU   ISTDHDVI+32                                              01716000
DHDDVOFF EQU   ISTDHDVI+28                                              01717000
DHDDTPTR EQU   ISTDHDVI+24                                              01718000
DHDDHPTR EQU   ISTDHDVI+20                                              01719000
DHDRSVD  EQU   DHDDIVTH+6                                               01720000
DHDIDLEN EQU   DHDDIVTH+4                                               01721000
DHDNUMFE EQU   DHDDIVTH+2                                               01722000
DHDNUME  EQU   DHDDIVTH                                                 01723000
DHDHNAME EQU   ISTDHDVI+4                                               01724000
DHDFWPTR EQU   ISTDHDVI                                                 01725000
DITDITT  EQU   ISTDITHD+16                                              01726000
DITLEN   EQU   ISTDITHD+15                                              01727000
DITUNUSD EQU   ISTDITHD+12                                              01728000
DITLSTNM EQU   ISTDITHD+4                                               01729000
DITFWDPT EQU   ISTDITHD                                                 01730000
LCSTCODE EQU   ISTLCST+19                                               01731000
LCSTACR3 EQU   LCSTACR                                                  01732000
LCSTACR2 EQU   LCSTACR                                                  01733000
LCSTACR1 EQU   LCSTACR                                                  01734000
LCSTACR0 EQU   LCSTACR                                                  01735000
LCSTLCCD EQU   LCSTTYPE+5                                               01736000
LCSTLCTP EQU   LCSTTYPE                                                 01737000
LCSTNAME EQU   ISTLCST+4                                                01738000
LCSTFWDP EQU   ISTLCST                                                  01739000
RNCWORD5 EQU   ISTRNCA+8084                                             01740000
RNCWORD4 EQU   ISTRNCA+8080                                             01741000
RNCWORD3 EQU   ISTRNCA+8076                                             01742000
RNCWORD2 EQU   ISTRNCA+8072                                             01743000
RNCWORD1 EQU   ISTRNCA+8068                                             01744000
RNCWORK4 EQU   ISTRNCA+8004                                             01745000
RNCLDPRM EQU   RNCWORK3                                                 01746000
RNCOCPRM EQU   RNCPHR2                                                  01747000
RNCLMDCB EQU   RNCPHR1                                                  01748000
RNCDAT3  EQU   ISTRNCA+3788                                             01749000
RNCSAV3  EQU   ISTRNCA+3716                                             01750000
RNCDAT1  EQU   ISTRNCA+3532                                             01751000
@NM00011 EQU   ISTRNCA+3456                                             01752000
RNCRSV01 EQU   ISTRNCA+127                                              01753000
RNCTBFR  EQU   ISTRNCA+127                                              01754000
RNCGPUIN EQU   ISTRNCA+127                                              01755000
RNCGVB   EQU   ISTRNCA+127                                              01756000
RNCGRNBD EQU   ISTRNCA+126                                              01757000
RNCGCLPU EQU   ISTRNCA+126                                              01758000
RNCGANS  EQU   ISTRNCA+126                                              01759000
RNCGINOD EQU   ISTRNCA+126                                              01760000
RNCGCUA  EQU   ISTRNCA+126                                              01761000
RNCGRNAM EQU   ISTRNCA+126                                              01762000
RNCGDLLN EQU   ISTRNCA+125                                              01763000
RNCLNID  EQU   ISTRNCA+125                                              01764000
RNCGPID  EQU   ISTRNCA+125                                              01765000
RNCLNOW  EQU   ISTRNCA+125                                              01766000
RNCGNOW  EQU   ISTRNCA+125                                              01767000
RNCLQUE  EQU   ISTRNCA+125                                              01768000
RNCGQUE  EQU   ISTRNCA+125                                              01769000
RNCDTYPE EQU   ISTRNCA+124                                              01770000
RNCGVSEQ EQU   ISTRNCA+123                                              01771000
RNCGTWX  EQU   ISTRNCA+123                                              01772000
RNCGCTRM EQU   ISTRNCA+123                                              01773000
RNCGSTBH EQU   ISTRNCA+123                                              01774000
RNCGPA   EQU   ISTRNCA+123                                              01775000
RNCGPU   EQU   ISTRNCA+122                                              01776000
RNCGGRP  EQU   ISTRNCA+122                                              01777000
RNCGHOST EQU   ISTRNCA+122                                              01778000
RNCGSYSC EQU   ISTRNCA+122                                              01779000
RNCGBLD  EQU   ISTRNCA+122                                              01780000
RNCGPCCU EQU   ISTRNCA+122                                              01781000
RNCLPCT  EQU   ISTRNCA+120                                              01782000
RNCLPNM  EQU   ISTRNCA+112                                              01783000
RNCDIVT  EQU   ISTRNCA+108                                              01784000
RNCDITT  EQU   ISTRNCA+104                                              01785000
RNCLCST  EQU   ISTRNCA+100                                              01786000
RNCLWS   EQU   ISTRNCA+96                                               01787000
RNCFWS   EQU   ISTRNCA+92                                               01788000
RNCOFFS2 EQU   ISTRNCA+88                                               01789000
RNCOFFST EQU   ISTRNCA+84                                               01790000
RNCLTBLS EQU   ISTRNCA+80                                               01791000
RNCFTBLS EQU   ISTRNCA+76                                               01792000
RNCLENT  EQU   ISTRNCA+72                                               01793000
RNCFENT  EQU   ISTRNCA+68                                               01794000
RNCLRNLL EQU   ISTRNCA+64                                               01795000
RNCFRNLL EQU   ISTRNCA+60                                               01796000
RNCPX    EQU   ISTRNCA+56                                               01797000
RNCDA    EQU   ISTRNCA+52                                               01798000
RNCLLN   EQU   ISTRNCA+48                                               01799000
RNCCM    EQU   ISTRNCA+44                                               01800000
RNCIN    EQU   ISTRNCA+40                                               01801000
RNCLU    EQU   ISTRNCA+36                                               01802000
RNCTR    EQU   ISTRNCA+32                                               01803000
RNCCL    EQU   ISTRNCA+24                                               01804000
RNCLN    EQU   ISTRNCA+20                                               01805000
RNCGP    EQU   ISTRNCA+16                                               01806000
RNCDS    EQU   ISTRNCA+12                                               01807000
RNCRSV07 EQU   ISTRNCA+8                                                01808000
MLCSTOWL EQU   MLCDECB2                                                 01809000
MLCDECB1 EQU   MLCTPMSG                                                 01810000
MLCLDPRM EQU   MLCRDPRM                                                 01811000
MLCACPRM EQU   MLCOCPRM                                                 01812000
MLCDCB   EQU   MLCWRK1                                                  01813000
MLCMHDAT EQU   ISTMLCA+908                                              01814000
MLCERDAT EQU   ISTMLCA+852                                              01815000
MLCERSAV EQU   ISTMLCA+780                                              01816000
MLCARDAT EQU   MLCADDAT                                                 01817000
MLCARSAV EQU   MLCADSAV                                                 01818000
MLCDAT4  EQU   ISTMLCA+596                                              01819000
MLCSAV4  EQU   ISTMLCA+524                                              01820000
MLCDAT3  EQU   ISTMLCA+468                                              01821000
MLCSAV3  EQU   ISTMLCA+396                                              01822000
MLCDAT2  EQU   ISTMLCA+340                                              01823000
MLCSAV2  EQU   ISTMLCA+268                                              01824000
MLCDAT1  EQU   ISTMLCA+212                                              01825000
MLCSAV1  EQU   ISTMLCA+140                                              01826000
@NM00010 EQU   ISTMLCA+136                                              01827000
MLCNCSPL EQU   MLCPTRS+36                                               01828000
MLCLENT  EQU   MLCPTRS+32                                               01829000
MLCGETSZ EQU   ISTMLCA+92                                               01830000
MLCFIII  EQU   MLCERBF3+8                                               01831000
MLCCNFG2 EQU   MLCERBF3                                                 01832000
MLCFII   EQU   MLCERBF2+16                                              01833000
MLCMACRO EQU   MLCERBF2+8                                               01834000
MLCCONFG EQU   MLCERBF1                                                 01835000
MLCKWD   EQU   ISTMLCA+24                                               01836000
MLCENT   EQU   ISTMLCA+20                                               01837000
MLCINT   EQU   MLCFLAGS                                                 01838000
MLCSKDCB EQU   ISTMLCA+12                                               01839000
MLCSKEL  EQU   ISTMLCA+8                                                01840000
MLCRPH   EQU   ISTMLCA+4                                                01841000
PATRSV01 EQU   PATFLAGA                                                 01842000
PATUSEFG EQU   PATFLAGA                                                 01843000
PATRDCNT EQU   ISTPAT+6                                                 01844000
PATGRPID EQU   ISTPAT+5                                                 01845000
PATPTHID EQU   ISTPAT+4                                                 01846000
PATDINDX EQU   ISTPAT+2                                                 01847000
PATGINDX EQU   ISTPAT                                                   01848000
GNTGRPNM EQU   ISTGNT                                                   01849000
DNTTELNO EQU   ISTDNT+1                                                 01850000
DNTCTDIG EQU   ISTDNT                                                   01851000
RLSRSV02 EQU   ISTRLS+140                                               01852000
RLSRSV01 EQU   ISTRLS+138                                               01853000
RLSCTELU EQU   ISTRLS+136                                               01854000
RLSPRE   EQU   ISTRLS                                                   01855000
RDARSVPT EQU   ISTRDA+84                                                01856000
RDAPUBI  EQU   ISTRDA+83                                                01857000
RDADFCUA EQU   ISTRDA+80                                                01858000
RDADACUA EQU   ISTRDA+76                                                01859000
RDALUBA  EQU   RDAUCBAD+1                                               01860000
RDACHQI  EQU   RDAUCBAD                                                 01861000
RDARSV01 EQU   RDAFLAG                                                  01862000
RDAPRE   EQU   ISTRDA                                                   01863000
RSWRSV01 EQU   ISTRSW+152                                               01864000
RSWRSV02 EQU   ISTRSW+150                                               01865000
RSWCTELU EQU   ISTRSW+148                                               01866000
RSWGRUPZ EQU   ISTRSW+146                                               01867000
RSWDIALZ EQU   ISTRSW+144                                               01868000
RSWGRUPT EQU   ISTRSW+140                                               01869000
RSWDIALT EQU   ISTRSW+136                                               01870000
RSWPRE   EQU   ISTRSW                                                   01871000
RLXRSV03 EQU   ISTRLX+80                                                01872000
RLXRSV02 EQU   ISTRLX+77                                                01873000
RLXRSV01 EQU   RLXFLAGA                                                 01874000
RLXINUSE EQU   RLXFLAGA                                                 01875000
RLXNLUX  EQU   ISTRLX+72                                                01876000
RLXPRE   EQU   ISTRLX                                                   01877000
RPXRSV01 EQU   ISTRPX+80                                                01878000
RPXRSV02 EQU   ISTRPX+77                                                01879000
RPXMAXLU EQU   ISTRPX+76                                                01880000
RPXFLUX  EQU   ISTRPX+72                                                01881000
RPXPRE   EQU   ISTRPX                                                   01882000
RLURSV02 EQU   ISTRLU+172                                               01883000
RLULGMOD EQU   ISTRLU+164                                               01884000
RLUMODEP EQU   RLUMODET+8                                               01885000
RLUUSSPT EQU   RLUUSSTB+8                                               01886000
RLURSV01 EQU   ISTRLU+137                                               01887000
RLULOCAD EQU   ISTRLU+136                                               01888000
RLUINTA  EQU   ISTRLU+128                                               01889000
RLUCRRSV EQU   RLUCRFLG                                                 01890000
RLUACTLU EQU   RLUCRFLG                                                 01891000
RLURSV00 EQU   RLUFLAG                                                  01892000
RLUNDSES EQU   RLUFLAG                                                  01893000
RLUGSTAT EQU   RLUFLAG                                                  01894000
RLUBATCH EQU   RLUFLAG                                                  01895000
RLUCRPR  EQU   ISTRLU                                                   01896000
RCCRVPT2 EQU   ISTRCC+144                                               01897000
RCCXTOSW EQU   ISTRCC+140                                               01898000
RCCSWTOX EQU   ISTRCC+136                                               01899000
RCCRSPT2 EQU   ISTRCC+133                                               01900000
RCCADDR  EQU   ISTRCC+132                                               01901000
RCCMXDAT EQU   ISTRCC+128                                               01902000
RCCINDEX EQU   ISTRCC+126                                               01903000
RCCPATHZ EQU   ISTRCC+124                                               01904000
RCCPATHT EQU   ISTRCC+120                                               01905000
RCCDPQ   EQU   ISTRCC+116                                               01906000
RCCTPAB  EQU   ISTRCC+112                                               01907000
RCCRSV02 EQU   ISTRCC+109                                               01908000
RCCCRRSV EQU   RCCCRFLG                                                 01909000
RCCCTCFL EQU   RCCCRFLG                                                 01910000
RCCACTPU EQU   RCCCRFLG                                                 01911000
RCCNCSPL EQU   ISTRCC+104                                               01912000
RCCRPHCN EQU   ISTRCC+100                                               01913000
RCCEPAB  EQU   ISTRCC+96                                                01914000
RCCDPAB  EQU   ISTRCC+92                                                01915000
RCCVPAB  EQU   ISTRCC+88                                                01916000
@NM00009 EQU   ISTRCC+87                                                01917000
RCCSESCT EQU   ISTRCC+86                                                01918000
RCCIDNUM EQU   RCCID48+3                                                01919000
RCCIDBLK EQU   RCCID48+2                                                01920000
RCCIDPA2 EQU   RCCID48+1                                                01921000
RCCIDPUT EQU   RCCID48                                                  01922000
RCCIDPA1 EQU   RCCSTAID                                                 01923000
RCCCTELU EQU   ISTRCC+76                                                01924000
RCCCNCNT EQU   ISTRCC+75                                                01925000
RCCRTGOH EQU   RCCFLAGB                                                 01926000
RCCBRKCN EQU   RCCFLAGB                                                 01927000
RCCRESET EQU   RCCFLAGB                                                 01928000
RCCFINAL EQU   RCCFLAGB                                                 01929000
RCCBNNSP EQU   RCCFLAGB                                                 01930000
RCCIRETR EQU   RCCFLAGB                                                 01931000
RCCDIALP EQU   RCCFLAGB                                                 01932000
RCCDSTCT EQU   RCCFLAGB                                                 01933000
RCCCTPGD EQU   RCCFLAG                                                  01934000
RCCPRGDN EQU   RCCFLAG                                                  01935000
RCCOUERP EQU   RCCFLAG                                                  01936000
RCCOHIMM EQU   RCCFLAG                                                  01937000
RCCLDISC EQU   RCCFLAG                                                  01938000
RCCERPIP EQU   RCCFLAG                                                  01939000
RCCCUDIE EQU   RCCFLAG                                                  01940000
RCCPRE   EQU   ISTRCC                                                   01941000
DOTADTRM EQU   ISTDOT                                                   01942000
RDSADDOT EQU   ISTRDS+76                                                01943000
RDSCTATR EQU   ISTRDS+74                                                01944000
RDSCTTRM EQU   ISTRDS+72                                                01945000
RDSPRE   EQU   ISTRDS                                                   01946000
RINRSV05 EQU   ISTRIN+156                                               01947000
RINRSV04 EQU   ISTRIN+152                                               01948000
RINLOCRN EQU   ISTRIN+148                                               01949000
RINRSV02 EQU   ISTRIN+145                                               01950000
RTRCNCNT EQU   RINCNCNT                                                 01951000
RTRNCSPL EQU   RINNCSPL                                                 01952000
RTRRPHCN EQU   RINRPHCN                                                 01953000
RTRVPAB  EQU   RINVPAB                                                  01954000
RTRREMOT EQU   RINREMOT                                                 01955000
RTRRLDAF EQU   RINRLDAF                                                 01956000
RTRNODID EQU   RINNODID                                                 01957000
RINRSV01 EQU   RINDFD                                                   01958000
RTRLDISC EQU   RINLDISC                                                 01959000
RTRNODEF EQU   RINNODEF                                                 01960000
RTRREMPO EQU   RINREMPO                                                 01961000
RINCRPRE EQU   ISTRIN                                                   01962000
RTRRSV04 EQU   ISTRTR+210                                               01963000
RTRIDCAS EQU   RTRBSCID+1                                               01964000
RTRIDLEN EQU   RTRBSCID                                                 01965000
RTRRSVDD EQU   ISTRTR+181                                               01966000
RTRRDFG  EQU   ISTRTR+180                                               01967000
RTRDIAA  EQU   ISTRTR+176                                               01968000
RTRPOLA  EQU   ISTRTR+172                                               01969000
RTRCADDR EQU   ISTRTR+164                                               01970000
RTRCTADR EQU   ISTRTR+162                                               01971000
RTRCTPOL EQU   ISTRTR+160                                               01972000
RTRCTDIA EQU   ISTRTR+158                                               01973000
RTRRSV03 EQU   ISTRTR+156                                               01974000
RTRRVPT1 EQU   ISTRTR+152                                               01975000
RTRCRSV2 EQU   RTRCRFLG                                                 01976000
RTRDTRLM EQU   RTRLSCMD                                                 01977000
RTRCRSV1 EQU   RTRCRFLG                                                 01978000
RTRTRMAX EQU   ISTRTR+142                                               01979000
RTRRSV24 EQU   RTRRDFF                                                  01980000
RTRRFDEK EQU   RTRRDFF                                                  01981000
RTRRFANK EQU   RTRRDFF                                                  01982000
RTRRFPFK EQU   RTRRDFF                                                  01983000
RTRRFPEN EQU   RTRRDFF                                                  01984000
RTRRFXCT EQU   RTRRDFF                                                  01985000
RTRRESCT EQU   RTRRDFE                                                  01986000
RTRRESUP EQU   RTRRDFE                                                  01987000
RTRREATT EQU   RTRRDFE                                                  01988000
RTRRECHK EQU   RTRRDFE                                                  01989000
RTRREACR EQU   RTRRDFE                                                  01990000
RTRRSV0A EQU   RTRRDFE                                                  01991000
RTRREBRK EQU   RTRRDFE                                                  01992000
RTRRSV11 EQU   RTRRDFD                                                  01993000
RTRRSV10 EQU   RTRRDFD                                                  01994000
RTRRDBHI EQU   RTRRDFD                                                  01995000
RTRRDBHD EQU   RTRRDFD                                                  01996000
RTRRSV23 EQU   RTRRDFC                                                  01997000
RTRRCXMS EQU   RTRRDFC                                                  01998000
RTRRCMSG EQU   RTRRDFC                                                  01999000
RTRRCPT3 EQU   RTRRDFC                                                  02000000
RTRRCIT2 EQU   RTRRDFC                                                  02001000
RTRRCIT1 EQU   RTRRDFC                                                  02002000
RTRRSV32 EQU   RTRRDFB                                                  02003000
RTRRBEND EQU   RTRRDFB                                                  02004000
RTRRBECT EQU   RTRRDFB                                                  02005000
RTRRSV02 EQU   RTRRDFA                                                  02006000
RTRRACTR EQU   RTRRDFA                                                  02007000
RTRRSV60 EQU   RTRRDFA                                                  02008000
RTRRACDT EQU   RTRRDFA                                                  02009000
RTRRAPT3 EQU   RTRRAALL                                                 02010000
RTRRAPT2 EQU   RTRRAALL                                                 02011000
RTRRAPT1 EQU   RTRRAALL                                                 02012000
RTRRAATN EQU   RTRRDFA                                                  02013000
RTRRSV45 EQU   ISTRTR+132                                               02014000
RTRRSV01 EQU   ISTRTR+130                                               02015000
RTRCTECM EQU   ISTRTR+128                                               02016000
RTRADRPT EQU   RTRADR+1                                                 02017000
RTRRSV22 EQU   RTRFLAG                                                  02018000
RTRVTERM EQU   RTRFLAG                                                  02019000
RTRRSV51 EQU   RTRFLAG                                                  02020000
RTRRSV21 EQU   RTRFLAG                                                  02021000
RTRCRPR  EQU   ISTRTR                                                   02022000
RCLRVPT2 EQU   ISTRCL+92                                                02023000
RCLRVPT1 EQU   ISTRCL+88                                                02024000
RCLGPOLA EQU   ISTRCL+84                                                02025000
RCLCTNGP EQU   ISTRCL+82                                                02026000
RCLRSV01 EQU   ISTRCL+80                                                02027000
RCLCTECM EQU   ISTRCL+78                                                02028000
RCLCTETR EQU   ISTRCL+76                                                02029000
RCLGPADR EQU   RCLADR+1                                                 02030000
RCLRSV33 EQU   RCLFLAG                                                  02031000
RCLBATCH EQU   RCLFLAG                                                  02032000
RCLRSV22 EQU   RCLFLAG                                                  02033000
RCLPRE   EQU   ISTRCL                                                   02034000
RPTRSV03 EQU   ISTRPT+156                                               02035000
RPTRSV02 EQU   ISTRPT+152                                               02036000
RPTNSNSV EQU   ISTRPT+148                                               02037000
RPTPTHCT EQU   ISTRPT+146                                               02038000
RPTPEPCT EQU   ISTRPT+144                                               02039000
RPTDAFSV EQU   ISTRPT+142                                               02040000
RPTRSV01 EQU   ISTRPT+141                                               02041000
RPTDYNAM EQU   RPTFLAG1                                                 02042000
RPTVYIMM EQU   RPTFLAG1                                                 02043000
RPTVIODN EQU   RPTFLAG1                                                 02044000
RPTONLIN EQU   RPTFLAG1                                                 02045000
RPTHLVPD EQU   RPTFLAG1                                                 02046000
RPTVRYPD EQU   RPTFLAG1                                                 02047000
RPTASLEP EQU   RPTFLAG1                                                 02048000
RPTUTERM EQU   ISTRPT+136                                               02049000
RPTATERM EQU   ISTRPT+132                                               02050000
RPTDIVT  EQU   RPTDITT                                                  02051000
RPTCTNM  EQU   ISTRPT+120                                               02052000
RPTLNDAF EQU   RPTLNCID+2                                               02053000
RPTLNSAF EQU   RPTLNCID                                                 02054000
RPTLN    EQU   ISTRPT                                                   02055000
RLNRVPT2 EQU   ISTRLN+112                                               02056000
RLNNCSPL EQU   ISTRLN+108                                               02057000
RLNX2SW  EQU   ISTRLN+104                                               02058000
@NM00008 EQU   ISTRLN+103                                               02059000
RLNCRRSV EQU   RLNCRFLG                                                 02060000
RLNSWEP  EQU   RLNCRFLG                                                 02061000
RLNSVSKP EQU   RLNLSCMD                                                 02062000
RLNSESLM EQU   RLNLSCMD                                                 02063000
RLNNPRLM EQU   RLNLSCMD                                                 02064000
RLNSWNCP EQU   RLNCRFLG                                                 02065000
RLNACTLN EQU   RLNCRFLG                                                 02066000
RLNPAUSE EQU   ISTRLN+101                                               02067000
RLNACTSN EQU   ISTRLN+98                                                02068000
RLNRESV1 EQU   ISTRLN+97                                                02069000
RLNACTRM EQU   ISTRLN+96                                                02070000
RLNRDSLM EQU   ISTRLN+94                                                02071000
RLNAUTOA EQU   ISTRLN+92                                                02072000
RLNRDFD  EQU   RLNRDF+3                                                 02073000
RLNRDFC  EQU   RLNRDF+2                                                 02074000
RLNMULTP EQU   RLNRDFB                                                  02075000
RLNRAPOL EQU   RLNRDFB                                                  02076000
RLNTTV   EQU   RLNRDFB                                                  02077000
RLNRSV0B EQU   RLNRDFB                                                  02078000
RLNAUTOD EQU   RLNRDFB                                                  02079000
RLNRAEP  EQU   RLNRDFA                                                  02080000
RLNIDV   EQU   RLNRDFA                                                  02081000
RLNPORT  EQU   RLNRDFA                                                  02082000
RLNGANSW EQU   RLNRDFA                                                  02083000
RLNRACAN EQU   RLNRACNT                                                 02084000
RLNRSV04 EQU   RLNSTAT2                                                 02085000
RLNINUSE EQU   RLNSTAT2                                                 02086000
RLNOHIN  EQU   RLNSTAT2                                                 02087000
RLNRSV03 EQU   RLNSTAT1                                                 02088000
RLNVD    EQU   RLNSTAT1                                                 02089000
RLNINOPP EQU   RLNSTAT1                                                 02090000
RLNINOPL EQU   RLNSTAT1                                                 02091000
RLNLRST  EQU   RLNSTAT1                                                 02092000
RLNTRAP  EQU   RLNSTAT1                                                 02093000
RLNACTCT EQU   ISTRLN+84                                                02094000
RLNCTECM EQU   ISTRLN+82                                                02095000
RLNCTEIN EQU   ISTRLN+80                                                02096000
RLNCTETR EQU   ISTRLN+78                                                02097000
RLNCTECL EQU   ISTRLN+76                                                02098000
RLNCUA   EQU   RLNUCBAD                                                 02099000
RLNRSV01 EQU   RLNFLAG                                                  02100000
RLNRBISA EQU   RLNFLAG                                                  02101000
RLNEAM   EQU   RLNFLAG                                                  02102000
RLNPRE   EQU   ISTRLN                                                   02103000
RGPRVPT2 EQU   ISTRGP+88                                                02104000
RGPRVPT1 EQU   ISTRGP+84                                                02105000
RGPCTECM EQU   ISTRGP+82                                                02106000
RGPCTEIN EQU   ISTRGP+80                                                02107000
RGPCTETR EQU   ISTRGP+78                                                02108000
RGPCTECL EQU   ISTRGP+76                                                02109000
RGPCTELN EQU   ISTRGP+74                                                02110000
RGPRSV03 EQU   ISTRGP+73                                                02111000
RGPRSV02 EQU   RGPFLG                                                   02112000
RGPABSC  EQU   RGPFLG                                                   02113000
RGPADIL  EQU   RGPFLG                                                   02114000
RGPPRE   EQU   ISTRGP                                                   02115000
RRNRINNM EQU   ISTRRN+248                                               02116000
@NM00007 EQU   ISTRRN+247                                               02117000
RRNRDCUA EQU   ISTRRN+244                                               02118000
RRNLASTE EQU   ISTRRN+240                                               02119000
RRNNCSPL EQU   ISTRRN+236                                               02120000
RRNRPLPT EQU   ISTRRN+232                                               02121000
RRNCTPCC EQU   ISTRRN+220                                               02122000
RRNHBUFS EQU   ISTRRN+218                                               02123000
RRNHLENT EQU   RRNHPRE+1                                                02124000
RRNDELAY EQU   ISTRRN+206                                               02125000
RRNRSV04 EQU   ISTRRN+200                                               02126000
RRNRSV88 EQU   RRNNMDPD+7                                               02127000
RRNPUBI  EQU   RRNNMDPD+6                                               02128000
RRNDPLUB EQU   RRNNMDPD                                                 02129000
RRNEPADR EQU   ISTRRN+190                                               02130000
RRNCPLUB EQU   ISTRRN+184                                               02131000
RRNFLUX  EQU   ISTRRN+180                                               02132000
RRNRSV05 EQU   RRNCMFD                                                  02133000
RRNREMPO EQU   RRNCMFD                                                  02134000
RRNCDREC EQU   RRNCMFD                                                  02135000
RRNCDDSI EQU   RRNCMFD                                                  02136000
RRNCDBCK EQU   RRNCMFD                                                  02137000
RRNCDDTL EQU   RRNCMFD                                                  02138000
RRNCDSTD EQU   RRNCMFD                                                  02139000
RRNCDCSP EQU   RRNCMFD                                                  02140000
RRNCCCSL EQU   RRNCMFC                                                  02141000
RRNCCSIM EQU   RRNCMFC                                                  02142000
RRNCCRCM EQU   RRNCMFC                                                  02143000
RRNCCRIM EQU   RRNCMFC                                                  02144000
RRNCCCRC EQU   RRNCMFC                                                  02145000
RRNCCRST EQU   RRNCMFC                                                  02146000
RRNCCRDQ EQU   RRNCMFC                                                  02147000
RRNCCRCN EQU   RRNCMFC                                                  02148000
RRNCBALT EQU   RRNCMFB                                                  02149000
RRNCBMOD EQU   RRNCMFB                                                  02150000
RRNCBNPL EQU   RRNCMFB                                                  02151000
RRNCBRLS EQU   RRNCMFB                                                  02152000
RRNCBRDS EQU   RRNCMFB                                                  02153000
RRNCBDLR EQU   RRNCMFB                                                  02154000
RRNCBDLH EQU   RRNCMFB                                                  02155000
RRNCBDLO EQU   RRNCMFB                                                  02156000
RRNCADGO EQU   RRNCMFA                                                  02157000
RRNCADTD EQU   RRNCMFA                                                  02158000
RRNCACDT EQU   RRNCMFA                                                  02159000
RRNCAMBH EQU   RRNCMFA                                                  02160000
RRNCAATI EQU   RRNCMFA                                                  02161000
RRNCAATG EQU   RRNCMFA                                                  02162000
RRNCAATD EQU   RRNCMFA                                                  02163000
RRNCAALL EQU   RRNCMFA                                                  02164000
RRNRSV55 EQU   RRNRDF+3                                                 02165000
RRNPTASL EQU   RRNRDFB+1                                                02166000
RRNRSV01 EQU   RRNRDFB+1                                                02167000
RRNVYDON EQU   RRNRDFB+1                                                02168000
RRNRBBUP EQU   RRNRDFB+1                                                02169000
RRNRSV03 EQU   RRNRDFB                                                  02170000
RRNRBSEC EQU   RRNRDFB                                                  02171000
RRNRBCCT EQU   RRNRDFB                                                  02172000
RRNRBCCL EQU   RRNRDFB                                                  02173000
RRNRSV02 EQU   RRNRDFB                                                  02174000
RRNRADMP EQU   RRNRDFA                                                  02175000
RRNRAIPL EQU   RRNRDFA                                                  02176000
RRNCTENT EQU   ISTRRN+170                                               02177000
RRNCTECM EQU   ISTRRN+168                                               02178000
RRNCTEIN EQU   ISTRRN+166                                               02179000
RRNCTETR EQU   ISTRRN+164                                               02180000
RRNCTECL EQU   ISTRRN+162                                               02181000
RRNCTELI EQU   ISTRRN+160                                               02182000
RRNCTEGP EQU   ISTRRN+158                                               02183000
RRNCTBHS EQU   ISTRRN+156                                               02184000
RRNBHSET EQU   ISTRRN+152                                               02185000
RRNTRENT EQU   ISTRRN+148                                               02186000
RRNRLDIP EQU   ISTRRN+147                                               02187000
RRNRNCUA EQU   ISTRRN+144                                               02188000
RRNGRPA  EQU   ISTRRN+140                                               02189000
RRNLUBA  EQU   RRNUCBAD+1                                               02190000
RRNCHQI  EQU   RRNUCBAD                                                 02191000
RRNRSV11 EQU   RRNFLAG                                                  02192000
RRNDSTCT EQU   RRNFLAG                                                  02193000
RRNERPIP EQU   RRNFLAG                                                  02194000
RRNLCDIP EQU   RRNFLAG                                                  02195000
RRNLCDIE EQU   RRNFLAG                                                  02196000
RRNLCSIP EQU   RRNFLAG                                                  02197000
RRNRSV89 EQU   RRNFLAG                                                  02198000
RRNPRE   EQU   ISTRRN                                                   02199000
RLCRVPT2 EQU   ISTRLC+80                                                02200000
RLCRVPT1 EQU   ISTRLC+79                                                02201000
RLCLCCUA EQU   ISTRLC+76                                                02202000
RLCUCBAD EQU   RLCADR+1                                                 02203000
RLCRSVDE EQU   RLCFLAG                                                  02204000
RLCACNT  EQU   RLCFLAG                                                  02205000
RLCRSV14 EQU   RLCFLAG                                                  02206000
RLCRBISA EQU   RLCFLAG                                                  02207000
RLCRSV22 EQU   RLCFLAG                                                  02208000
RLCPRE   EQU   ISTRLC                                                   02209000
RAPRVPT2 EQU   ISTRAP+116                                               02210000
RAPRVPT1 EQU   ISTRAP+112                                               02211000
RAPBFACT EQU   ISTRAP+111                                               02212000
RAPRSV17 EQU   RAPFLGC                                                  02213000
RAPRSV16 EQU   RAPFLGC                                                  02214000
RAPRSV15 EQU   RAPFLGC                                                  02215000
RAPRSV14 EQU   RAPFLGC                                                  02216000
RAPRSV13 EQU   RAPFLGC                                                  02217000
RAPRSV12 EQU   RAPFLGC                                                  02218000
RAPRSV11 EQU   RAPFLGC                                                  02219000
RAPRSV10 EQU   RAPFLGC                                                  02220000
RAPANVPC EQU   RAPFLGB                                                  02221000
RAPASPO  EQU   RAPFLGB                                                  02222000
RAPAPPO  EQU   RAPFLGB                                                  02223000
RAPAACQ  EQU   RAPFLGB                                                  02224000
RAPAPRMT EQU   RAPFLGB                                                  02225000
RAPAPASS EQU   RAPFLGB                                                  02226000
RAPABLCK EQU   RAPFLGB                                                  02227000
RAPALLF  EQU   RAPFLGB                                                  02228000
RAPRSV06 EQU   RAPFLG                                                   02229000
RAPRSV05 EQU   RAPFLG                                                   02230000
RAPRSV04 EQU   RAPFLG                                                   02231000
RAPRSV03 EQU   RAPFLG                                                   02232000
RAPATLGN EQU   RAPFLG                                                   02233000
RAPASLGI EQU   RAPFLG                                                   02234000
RAPAQUI  EQU   RAPFLG                                                   02235000
RAPABLGN EQU   RAPFLG                                                   02236000
RAPACEQD EQU   ISTRAP+106                                               02237000
RAPTRPRE EQU   ISTRAP+104                                               02238000
RAPACEAP EQU   ISTRAP+100                                               02239000
RAPICEAQ EQU   ISTRAP+96                                                02240000
RAPICEAC EQU   ISTRAP+92                                                02241000
RAPICELG EQU   ISTRAP+88                                                02242000
RAPAPPWD EQU   ISTRAP+80                                                02243000
RAPACDEB EQU   ISTRAP+76                                                02244000
RAPACBA  EQU   ISTRAP+72                                                02245000
RAPPRE   EQU   ISTRAP                                                   02246000
RDTVSRPL EQU   ISTRDT+132                                               02247000
RDTCRSPW EQU   ISTRDT+124                                               02248000
@NM00006 EQU   ISTRDT+113                                               02249000
RRNSTCNT EQU   RDTSTCNT                                                 02250000
RRNVYRPH EQU   RDTVYRPH                                                 02251000
RDTTPAB  EQU   ISTRDT+104                                               02252000
RDTDPAB  EQU   ISTRDT+100                                               02253000
RDTEPAB  EQU   ISTRDT+96                                                02254000
RDTVPAB  EQU   ISTRDT+92                                                02255000
RDTRSV01 EQU   RDTFLAGB                                                 02256000
RDTBHSET EQU   RDTFLAGB                                                 02257000
RDTCTCFL EQU   RDTFLAGB                                                 02258000
RDTCTPGD EQU   RDTFLAGB                                                 02259000
RDTPRGDN EQU   RDTFLAGB                                                 02260000
RDTOUERP EQU   RDTFLAGB                                                 02261000
RDTLGCT  EQU   ISTRDT+90                                                02262000
RDTNODID EQU   ISTRDT+89                                                02263000
RDTMAXID EQU   ISTRDT+88                                                02264000
RDTCTSNT EQU   ISTRDT+86                                                02265000
RDTFLAGS EQU   ISTRDT+84                                                02266000
RDTBACK  EQU   ISTRDT+80                                                02267000
RDTFORW  EQU   ISTRDT+76                                                02268000
RDTLEN   EQU   RDTPLEN+1                                                02269000
RDTPRILC EQU   RDTPRIOR                                                 02270000
RDTPRIAP EQU   RDTPRIOR                                                 02271000
@NM00005 EQU   RDTPRIOR                                                 02272000
RDTPRE   EQU   ISTRDT                                                   02273000
RCPRSV05 EQU   ISTRCPRE+120                                             02274000
RCPRSV04 EQU   ISTRCPRE+116                                             02275000
RCPRSV03 EQU   ISTRCPRE+112                                             02276000
RCPINTA  EQU   RCPLGNIN+16                                              02277000
@NM00004 EQU   RCPPMODE                                                 02278000
RCPBHSI2 EQU   ISTRCPRE+89                                              02279000
RCPBHSI1 EQU   ISTRCPRE+88                                              02280000
RCPACETR EQU   ISTRCPRE+84                                              02281000
RCPICEAQ EQU   ISTRCPRE+80                                              02282000
RCPLNAPA EQU   ISTRCPRE+76                                              02283000
RCPICELN EQU   ISTRCPRE+72                                              02284000
RCPPRE   EQU   ISTRCPRE                                                 02285000
RPRCONID EQU   ISTRPRE+63                                               02286000
RPRCLVPD EQU   RPRFLAGC                                                 02287000
RPRINIMM EQU   RPRFLAGD                                                 02288000
RPRRSV05 EQU   RPRFLAGD                                                 02289000
RPRCONP  EQU   RPRFLAGD                                                 02290000
RPRACTP  EQU   RPRFLAGD                                                 02291000
RPRRSON  EQU   RPRFLAGD                                                 02292000
RPRLTASN EQU   RPRFLAGD                                                 02293000
RPRPTHCT EQU   ISTRPRE+60                                               02294000
RPRSWDAF EQU   ISTRPRE+58                                               02295000
RPRSTPCT EQU   ISTRPRE+56                                               02296000
RPRRVPT1 EQU   ISTRPRE+52                                               02297000
RPRNCBA  EQU   ISTRPRE+40                                               02298000
RPRNSNEA EQU   ISTRPRE+36                                               02299000
RPRLGONB EQU   ISTRPRE+32                                               02300000
RPRLGONF EQU   ISTRPRE+28                                               02301000
RPRTIOCT EQU   ISTRPRE+26                                               02302000
RPRPEPCT EQU   ISTRPRE+24                                               02303000
RPRRSV03 EQU   RPRCAUSE                                                 02304000
RPRRSYNC EQU   RPRCAUSE                                                 02305000
RPRCRCPT EQU   RPRCAUSE                                                 02306000
RPRINTST EQU   RPRFLAGB                                                 02307000
RPRVYIMM EQU   RPRFLAGB                                                 02308000
RPRHLVPD EQU   RPRFLAGB                                                 02309000
RPRONLIN EQU   RPRFLAGB                                                 02310000
RPRVIODN EQU   RPRFLAGB                                                 02311000
RPRENTVT EQU   RPRFLAGB                                                 02312000
RPRENTVH EQU   RPRFLAGB                                                 02313000
RPRLIVE  EQU   RPRFLAGA                                                 02314000
RPRVRYPD EQU   RPRFLAGA                                                 02315000
RPRENTED EQU   RPRFLAGA                                                 02316000
RPRENTIO EQU   RPRFLAGA                                                 02317000
RPRENTBF EQU   RPRFLAGA                                                 02318000
RPRTIED  EQU   RPRFLAGA                                                 02319000
RPRINV   EQU   RPRFLAGA                                                 02320000
RPRACT   EQU   RPRFLAGA                                                 02321000
RPRPELEN EQU   ISTRPRE+18                                               02322000
RPRRLOCK EQU   ISTRPRE+12                                               02323000
RPRDAF   EQU   RPRCOMID+2                                               02324000
RPRSAF   EQU   RPRCOMID                                                 02325000
LOKXCL   EQU   @NM00002                                                 02326000
LOKPRY   EQU   @NM00002                                                 02327000
@NM00003 EQU   @NM00002                                                 02328000
@NM00001 EQU   LOKCHNG                                                  02329000
LOKCT    EQU   ISTLOK                                                   02330000
DEVRSV03 EQU   ISTDEVCH+5                                               02331000
DEVPHYSA EQU   ISTDEVCH+4                                               02332000
DEVCSLPN EQU   DEVCHAR3                                                 02333000
DEVCSTCL EQU   DEVCHAR3                                                 02334000
DEVCCHEK EQU   DEVCHAR3                                                 02335000
DEVCATTN EQU   DEVCHAR3                                                 02336000
DEVCSWL  EQU   DEVFCCTL                                                 02337000
DEVCRVB  EQU   DEVFCCTL                                                 02338000
DEVCSSL  EQU   DEVFCCTL                                                 02339000
DEVCBSC  EQU   DEVFCCTL                                                 02340000
DEVMCODE EQU   ISTDEVCH+2                                               02341000
DEVCHAR2 EQU   DEVTCODE                                                 02342000
DEVRSV01 EQU   DEVCHAR                                                  02343000
DEVCCTL  EQU   DEVCHAR                                                  02344000
DEVSPS   EQU   DEVCHAR                                                  02345000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02346000
@ENDDATA EQU   *                                                        02347000
         END   ISTSDCRS,(C'PLS1809',0701,76278)                         02348000
