         TITLE 'ISTSC02F,WAITIO - WAITS FOR I/O COMPLETION             *00001000
                        '                                               00002000
* IBM DISK OPERATING SYSTEM                                             00003000
* TOLTEP - 5745-SCT-TLT                                                 00004000
         ISEQ 73,80                                                     00005000
ISTSC02F CSECT ,                                                   0002 00006000
@MAINENT DS    0H                                                  0002 00007000
         USING *,@15                                               0002 00008000
         B     @PROLOG                                             0002 00009000
         DC    AL2(@EP00002-@MAINENT)                                   00010000
         DC    AL1(16)                                             0002 00011000
         DC    C'ISTSC02F  75.225'                                 0002 00012000
S2FC1000 DS    0H                                                  0002 00013000
         USING *,@15                                               0002 00014000
         B     @PROLOG                                             0002 00015000
         DC    AL2(@EP00674-S2FC1000)                                   00016000
         ENTRY S2FC1000                                                 00017000
S2FC2000 DS    0H                                                  0002 00018000
         USING *,@15                                               0002 00019000
         B     @PROLOG                                             0002 00020000
         DC    AL2(@EP00751-S2FC2000)                                   00021000
         ENTRY S2FC2000                                                 00022000
         DROP  @15                                                      00023000
@PROLOG  ST    @14,12(,@13)                                        0002 00024000
         STM   @00,@12,20(@13)                                     0002 00025000
         BALR  @12,0                                               0002 00026000
@PSTART  DS    0H                                                  0002 00027000
         USING @PSTART,@12                                         0002 00028000
         AH    @15,4(,@15)                                         0002 00029000
         BR    @15                                                 0002 00030000
@EP00002 DS    0H                                                  0003 00031000
*   R14=R13;                        /* HOLD CALLER'S SVAREA PTR      */ 00032000
         LR    R14,R13                                             0419 00033000
*   R13=ADDR(SVESC02F);             /* PT TO MY SAVEAREA             */ 00034000
         LA    R13,SVESC02F(,WAPTR)                                0420 00035000
*   BACKSAVE(3)=R13;                /* PUT MY SVAPTR IN CALLER       */ 00036000
         STCM  R13,15,BACKSAVE+8(R14)                              0421 00037000
*   SVESC02F(2)=R14;                /* PUT CALLER'S SVAREA PTR IN MY    00038000
*                                      SAVEAREA                      */ 00039000
*                                                                  0422 00040000
         ST    R14,SVESC02F+4(,WAPTR)                              0422 00041000
*   /*****************************************************************/ 00042000
*   /*                                                               */ 00043000
*   /* ENTRY FROM RCM FOR OLT WAITIO MACRO REQUEST                   */ 00044000
*   /*                                                               */ 00045000
*   /*****************************************************************/ 00046000
*                                                                  0423 00047000
*   WAIPTR=R1;                      /* SAVE PTR TO WAITIO PARMLST    */ 00048000
         LR    WAIPTR,R1                                           0423 00049000
*   IF $WIODE=ON|$WIOANY=ON         /* IF WAIT=DE OR WAIT=ANY        */ 00050000
*     THEN                          /* THEN                          */ 00051000
         TM    $WIODE(WAIPTR),B'00011000'                          0424 00052000
         BZ    @RF00424                                            0424 00053000
*     DO;                                                          0425 00054000
*       R15=4;                      /* SET RC=04                     */ 00055000
         LA    R15,4                                               0426 00056000
*       GOTO S2FC9999;              /* RETURN TO CALLER              */ 00057000
         B     S2FC9999                                            0427 00058000
*     END;                                                         0428 00059000
*   IF $WIOTECB=0                   /* IF TECB ADDR = 0              */ 00060000
*     THEN                                                         0429 00061000
@RF00424 L     @08,$WIOTECB(,WAIPTR)                               0429 00062000
         LTR   @08,@08                                             0429 00063000
         BNZ   @RF00429                                            0429 00064000
*     DO;                                                          0430 00065000
*       J=0;                        /* NO DEVICE                     */ 00066000
         SLR   J,J                                                 0431 00067000
*       GOTO S2FC0900;              /* THEN STANDALONE WAIT          */ 00068000
         B     S2FC0900                                            0432 00069000
*     END;                                                         0433 00070000
*                                                                  0433 00071000
*   /*****************************************************************/ 00072000
*   /*                                                               */ 00073000
*   /* SEARCH DEVICE TABLE                                           */ 00074000
*   /*                                                               */ 00075000
*   /*****************************************************************/ 00076000
*                                                                  0434 00077000
*   IF $WIOCDS=0                    /* IF CDS ADDR = 0               */ 00078000
*     THEN                          /* THEN                          */ 00079000
@RF00429 L     @08,$WIOCDS(,WAIPTR)                                0434 00080000
         LTR   @08,@08                                             0434 00081000
         BNZ   @RF00434                                            0434 00082000
*     CDSPTR=ADDR($PDEVADR);        /* USE PRIMARY DEV ADDR          */ 00083000
         LA    CDSPTR,$PDEVADR(,WAPTR)                             0435 00084000
*   ELSE                            /* ELSE                          */ 00085000
*     CDSPTR=$WIOCDS;               /* USE WAITIO CDS PTR            */ 00086000
         B     @RC00434                                            0436 00087000
@RF00434 L     CDSPTR,$WIOCDS(,WAIPTR)                             0436 00088000
*   DO J=3 TO $DEVCNTS;             /*                               */ 00089000
@RC00434 LA    J,3                                                 0437 00090000
         B     @DE00437                                            0437 00091000
@DL00437 DS    0H                                                  0438 00092000
*     IF CDSSYMB=ON                 /* IF DEV HAS A SYMB NAME        */ 00093000
*       THEN                        /* THEN                          */ 00094000
         TM    CDSSYMB(CDSPTR),B'00001000'                         0438 00095000
         BNO   @RF00438                                            0438 00096000
*       DO;                                                        0439 00097000
*         IF CDSSYMBN=$$SYMNME(J)   /* CHK IF THEY MATCH             */ 00098000
*           THEN                    /*                               */ 00099000
         LR    @08,J                                               0440 00100000
         MH    @08,@CH01252                                        0440 00101000
         ALR   @08,WAPTR                                           0440 00102000
         CLC   CDSSYMBN(8,CDSPTR),$$SYMNME-68(@08)                 0440 00103000
         BE    @RT00440                                            0440 00104000
*           GOTO S2FC0200;          /* IF YES, CHK OUT DEVICE        */ 00105000
*         ELSE                                                     0442 00106000
*           GOTO S2FC0250;          /* IF NO, GOTO NEXT DEV          */ 00107000
         B     S2FC0250                                            0442 00108000
*       END;                                                       0443 00109000
*     ELSE                          /* IF NO SYMB NAME               */ 00110000
*       IF CDSUA^=$DEVUNAD(J)       /* DO UNIT ADDRESSES MATCH?      */ 00111000
*         THEN                      /*                               */ 00112000
@RF00438 LR    @08,J                                               0444 00113000
         MH    @08,@CH01252                                        0444 00114000
         L     @07,CDSUA(,CDSPTR)                                  0444 00115000
         CL    @07,$DEVUNAD-68(@08,WAPTR)                          0444 00116000
         BNE   @RT00444                                            0444 00117000
*         GOTO S2FC0250;            /* IF NO, GET NEXT DEV           */ 00118000
*S2FC0200:                                                         0446 00119000
*     IF $WIOTECB^=$DEVTECB(J)|     /* IF TECB NOT EXIOTECB          */ 00120000
*         $DEVACT(J)=OFF            /* OR DEVICE NOT ACTIVE          */ 00121000
*         |$NOTDEV(J)=ON            /* OR IF DEV HAS GONE AWAY       */ 00122000
*       THEN                        /* THEN                          */ 00123000
S2FC0200 LR    @08,J                                               0446 00124000
         MH    @08,@CH01252                                        0446 00125000
         L     @07,$WIOTECB(,WAIPTR)                               0446 00126000
         ST    @08,@TF00001                                        0446 00127000
         ALR   @08,WAPTR                                           0446 00128000
         ICM   @03,15,$DEVTECB-68(@08)                             0446 00129000
         CLR   @07,@03                                             0446 00130000
         BNE   @RT00446                                            0446 00131000
         LR    @08,WAPTR                                           0446 00132000
         AL    @08,@TF00001                                        0446 00133000
         TM    $DEVACT-68(@08),B'00000100'                         0446 00134000
         BZ    @RT00446                                            0446 00135000
         LR    @08,WAPTR                                           0446 00136000
         AL    @08,@TF00001                                        0446 00137000
         TM    $NOTDEV-68(@08),B'10000000'                         0446 00138000
         BNO   @RF00446                                            0446 00139000
@RT00446 DS    0H                                                  0447 00140000
*S2FC0240:                                                         0447 00141000
*       DO;                                                        0447 00142000
S2FC0240 DS    0H                                                  0448 00143000
*         R15='0C'X;                /* SET RC = 0C                   */ 00144000
         LA    R15,12                                              0448 00145000
*         GOTO S2FC9999;            /* RETURN                        */ 00146000
         B     S2FC9999                                            0449 00147000
*       END;                                                       0450 00148000
*     ELSE                                                         0451 00149000
*       GOTO S2FC0260;              /* ELSE CONTINUE                 */ 00150000
*S2FC0250:                                                         0452 00151000
*   END;                                                           0452 00152000
S2FC0250 AL    J,@CF00061                                          0452 00153000
@DE00437 CH    J,$DEVCNTS(,WAPTR)                                  0452 00154000
         BNH   @DL00437                                            0452 00155000
*   GOTO S2FC0240;                  /* IF DEV NOT FOUND, RC=C        */ 00156000
*                                                                  0453 00157000
         B     S2FC0240                                            0453 00158000
*   /*****************************************************************/ 00159000
*   /*                                                               */ 00160000
*   /* PURGE REQUEST                                                 */ 00161000
*   /*                                                               */ 00162000
*   /*****************************************************************/ 00163000
*                                                                  0454 00164000
*S2FC0260:                                                         0454 00165000
*   $WTISUED(J)=ON;                 /* WAITIO ISSUED                 */ 00166000
S2FC0260 LR    @08,J                                               0454 00167000
         MH    @08,@CH01252                                        0454 00168000
         ST    @08,@TF00001                                        0454 00169000
         ALR   @08,WAPTR                                           0454 00170000
         OI    $WTISUED-68(@08),B'00000001'                        0454 00171000
*   IF $WIOPURG=ON                  /* IF PURGE=YES REQUESTED        */ 00172000
*     THEN                          /* THEN                          */ 00173000
         TM    $WIOPURG(WAIPTR),B'00100000'                        0455 00174000
         BNO   @RF00455                                            0455 00175000
*     DO;                           /* REINIT FLGS, RET              */ 00176000
*       $IGLXIFB(J)=ON;             /* IGNORE PURGE FEEDBACK         */ 00177000
         LR    @07,WAPTR                                           0457 00178000
         AL    @07,@TF00001                                        0457 00179000
         OI    $IGLXIFB-68(@07),B'01000000'                        0457 00180000
*       DIOCDS=ADDR($DEVTBLE(J));   /* ADDRESS OF CDS                */ 00181000
         L     @07,@TF00001                                        0458 00182000
         LA    @07,$DEVTBLE-68(@07,WAPTR)                          0458 00183000
         ST    @07,DIOCDS                                          0458 00184000
*       DIOTECB=$DEVTECB(J);        /* ADDR OF TECB                  */ 00185000
         LR    @07,WAPTR                                           0459 00186000
         AL    @07,@TF00001                                        0459 00187000
         ICM   @03,15,$DEVTECB-68(@07)                             0459 00188000
         ST    @03,DIOTECB                                         0459 00189000
*       R1=ADDR(DIOPARM);           /* ADDR OF PARM LIST             */ 00190000
         LA    R1,DIOPARM                                          0460 00191000
*       CALL ISTSC032;              /* CALL DIO MODULE FOR HIO       */ 00192000
         L     @15,@CV03939                                        0461 00193000
         BALR  @14,@15                                             0461 00194000
*       GOTO S2FC9900;              /* I/O TO DEV DONE               */ 00195000
         B     S2FC9900                                            0462 00196000
*     END;                                                         0463 00197000
*                                                                  0463 00198000
*   /*****************************************************************/ 00199000
*   /*                                                               */ 00200000
*   /* WAIT=YES REQUEST & POLL=YES REQUEST                           */ 00201000
*   /*                                                               */ 00202000
*   /*****************************************************************/ 00203000
*                                                                  0464 00204000
*   IF $WIOYES=OFF                  /* IF NOT A WIO=YES REQUEST      */ 00205000
*       &$WIOPOLL=OFF               /* OR NOT WIO POLL               */ 00206000
*     THEN                          /* THEN                          */ 00207000
@RF00455 TM    $WIOYES(WAIPTR),B'11000000'                         0464 00208000
         BZ    @RT00464                                            0464 00209000
*     GOTO S2FC0900;                /* CALCULATE END TIME            */ 00210000
*   IF $REMOTE(J)=OFF               /* IF A LOCAL DEV                */ 00211000
*     THEN                          /* THEN                          */ 00212000
@RF00464 LR    @08,J                                               0466 00213000
         MH    @08,@CH01252                                        0466 00214000
         ST    @08,@TF00001                                        0466 00215000
         ALR   @08,WAPTR                                           0466 00216000
         TM    $REMOTE-68(@08),B'01000000'                         0466 00217000
         BZ    @RT00466                                            0466 00218000
*     GOTO S2FC0770;                /* CHECK FOR EVENT COMPLETE      */ 00219000
*                                                                  0467 00220000
*   /*****************************************************************/ 00221000
*   /*                                                               */ 00222000
*   /* REMOTE - IF A WRITE WAS ISSUED, EVENT COMPLETE                */ 00223000
*   /*                                                               */ 00224000
*   /*****************************************************************/ 00225000
*                                                                  0468 00226000
*   IF $REMWRIT(J)=ON               /* IF A WRITE WAS ISSUED         */ 00227000
*     THEN                                                         0468 00228000
         LR    @08,WAPTR                                           0468 00229000
         AL    @08,@TF00001                                        0468 00230000
         TM    $REMWRIT-68(@08),B'00000100'                        0468 00231000
         BO    @RT00468                                            0468 00232000
*     GOTO S2FC0800;                /* THEN WIO IS COMPLETE          */ 00233000
*                                                                  0469 00234000
*   /*****************************************************************/ 00235000
*   /*                                                               */ 00236000
*   /* REMOTE - CHECK FOR NCP DATA IN ALREADY                        */ 00237000
*   /*                                                               */ 00238000
*   /*****************************************************************/ 00239000
*                                                                  0470 00240000
*   IF $1STUSED(J)=ON               /* IF 1ST DEV ACTIVE             */ 00241000
*     THEN                          /* THEN                          */ 00242000
         LR    @08,WAPTR                                           0470 00243000
         AL    @08,@TF00001                                        0470 00244000
         TM    $1STUSED-68(@08),B'00100000'                        0470 00245000
         BNO   @RF00470                                            0470 00246000
*     DO;                                                          0471 00247000
*       IF($OLTCCW1^=0              /* IF OLT HAS READ FOR DATA      */ 00248000
*           &$1STBFR1^=0)           /* AND THERE IS DATA THERE       */ 00249000
*         THEN                      /* THEN                          */ 00250000
         SLR   @08,@08                                             0472 00251000
         C     @08,$OLTCCW1(,WAPTR)                                0472 00252000
         BE    @RF00472                                            0472 00253000
         C     @08,$1STBFR1(,WAPTR)                                0472 00254000
         BE    @RF00472                                            0472 00255000
*         CALL S2FC0300;            /* HAND FEEDBACK OVER TO OLT     */ 00256000
         BAL   @14,S2FC0300                                        0473 00257000
*       GOTO S2FC0770;              /* CHK FOR EVENT COMPLETE        */ 00258000
         B     S2FC0770                                            0474 00259000
*     END;                                                         0475 00260000
*   ELSE                            /* SECOND DEV ACTIVE             */ 00261000
*     DO;                           /* PROCESS SECOND ACTIVE         */ 00262000
@RF00470 DS    0H                                                  0477 00263000
*       IF $OLTCCW2^=0&$1STBFR2^=0 THEN/* CHECK FOR DATA AVAILABLE   */ 00264000
         SLR   @08,@08                                             0477 00265000
         C     @08,$OLTCCW2(,WAPTR)                                0477 00266000
         BE    @RF00477                                            0477 00267000
         C     @08,$1STBFR2(,WAPTR)                                0477 00268000
         BE    @RF00477                                            0477 00269000
*         CALL S2FC0300;            /* DATA HERE, PASS IT B ACK      */ 00270000
         BAL   @14,S2FC0300                                        0478 00271000
*       GO TO S2FC0770;             /* CHECK FOR EVENT COMPLETE      */ 00272000
         B     S2FC0770                                            0479 00273000
*     END;                          /* END OF SECOND ACTIVE          */ 00274000
*                                                                  0480 00275000
*   /*****************************************************************/ 00276000
*   /*                                                               */ 00277000
*   /* ROUTINE TO HAND FEEDBACK OVER TO OLTTCP                       */ 00278000
*   /*                                                               */ 00279000
*   /*****************************************************************/ 00280000
*                                                                  0481 00281000
*S2FC0300:                                                         0481 00282000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0481 00283000
S2FC0300 DS    0H                                                  0482 00284000
*   R14SAVE=R14;                                                   0482 00285000
         ST    R14,R14SAVE                                         0482 00286000
*   TECBPTR=$DEVTECB(J);            /* SAVE TECB PTR                 */ 00287000
         LR    @08,J                                               0483 00288000
         MH    @08,@CH01252                                        0483 00289000
         ST    @08,@TF00001                                        0483 00290000
         ALR   @08,WAPTR                                           0483 00291000
         ICM   TECBPTR,15,$DEVTECB-68(@08)                         0483 00292000
*   IF $1STUSED(J)=ON               /* IF 1ST SET BEING USED         */ 00293000
*     THEN                                                         0484 00294000
         LR    @10,WAPTR                                           0484 00295000
         AL    @10,@TF00001                                        0484 00296000
         TM    $1STUSED-68(@10),B'00100000'                        0484 00297000
         BNO   @RF00484                                            0484 00298000
*     DO;                                                          0485 00299000
*       BFRPTR=$1STBFR1;            /* PT TO OUR STORAGE BFR         */ 00300000
         L     @08,$1STBFR1(,WAPTR)                                0486 00301000
         LR    BFRPTR,@08                                          0486 00302000
*       TEMPTR=$1STBFR1;            /* PT TO BFR TO RELEASE          */ 00303000
         ST    @08,TEMPTR(,WAPTR)                                  0487 00304000
*       CCWPTR=$OLTCCW1;            /* POINT TO OLT'S READ CCW       */ 00305000
         L     CCWPTR,$OLTCCW1(,WAPTR)                             0488 00306000
*       $OLTCCW1=0;                 /* ZERO READ CCW PTR             */ 00307000
         SLR   @08,@08                                             0489 00308000
         ST    @08,$OLTCCW1(,WAPTR)                                0489 00309000
*     END;                                                         0490 00310000
*   ELSE                            /* IF 2ND SET BEING USED         */ 00311000
*     DO;                                                          0491 00312000
         B     @RC00484                                            0491 00313000
@RF00484 DS    0H                                                  0492 00314000
*       BFRPTR=$1STBFR2;            /* PT TO OUR STORGE BFR          */ 00315000
         L     @08,$1STBFR2(,WAPTR)                                0492 00316000
         LR    BFRPTR,@08                                          0492 00317000
*       TEMPTR=$1STBFR2;            /* PT TO BFR TO RELEASE          */ 00318000
         ST    @08,TEMPTR(,WAPTR)                                  0493 00319000
*       CCWPTR=$OLTCCW2;            /* POINT TO OLT READ CCW         */ 00320000
         L     CCWPTR,$OLTCCW2(,WAPTR)                             0494 00321000
*       $OLTCCW2=0;                 /* ZERO OUT OLT READ CCW PTR     */ 00322000
         SLR   @08,@08                                             0495 00323000
         ST    @08,$OLTCCW2(,WAPTR)                                0495 00324000
*     END;                                                         0496 00325000
*   FSBPTR=TEMPTR;                  /* PT TO FSB BFR                 */ 00326000
@RC00484 L     FSBPTR,TEMPTR(,WAPTR)                               0497 00327000
*   FDBPTR=ADDR(FSBFDB);            /* PT TO FDB IN FSB              */ 00328000
         LA    FDBPTR,FSBFDB(,FSBPTR)                              0498 00329000
*   READPTR=CCWADDR;                /* PT TO OLT BFR ADR             */ 00330000
         L     READPTR,CCWADDR-1(,CCWPTR)                          0499 00331000
         LA    READPTR,0(,READPTR)                                 0499 00332000
*   READSIZE=CCWCOUNT;              /* SIZE OF OLT BFR               */ 00333000
         LH    @07,CCWCOUNT(,CCWPTR)                               0500 00334000
         STH   @07,READSIZE(,WAPTR)                                0500 00335000
*   IF $1STUSED(J)=ON               /* IF 1ST DEV ACTIVE             */ 00336000
*     THEN                          /* AND                           */ 00337000
         LR    @07,J                                               0501 00338000
         MH    @07,@CH01252                                        0501 00339000
         ALR   @07,WAPTR                                           0501 00340000
         TM    $1STUSED-68(@07),B'00100000'                        0501 00341000
         BNO   @RF00501                                            0501 00342000
*     DO;                                                          0502 00343000
*       IF $RESID1^=0               /* IF RESIDUAL DATA LEFT IN BDU  */ 00344000
*         THEN                      /* THEN                          */ 00345000
         SLR   @07,@07                                             0503 00346000
         L     @03,$RESID1(,WAPTR)                                 0503 00347000
         CR    @03,@07                                             0503 00348000
         BE    @RF00503                                            0503 00349000
*         DO;                                                      0504 00350000
*           FDBPTR=$RESID1;         /* POINT TO BDU CONTAINING DATA  */ 00351000
         LR    FDBPTR,@03                                          0505 00352000
*           FBDATAPT=FDBPTR+$BUFSZ1;/* SKIP WHAT WAS ALREADY PASSED  */ 00353000
         LR    FBDATAPT,FDBPTR                                     0506 00354000
         AL    FBDATAPT,$BUFSZ1(,WAPTR)                            0506 00355000
*           $RESID1=0;              /* RESID DATA = 0                */ 00356000
         SLR   @03,@03                                             0507 00357000
         ST    @03,$RESID1(,WAPTR)                                 0507 00358000
*         END;                                                     0508 00359000
*       ELSE                        /* ELSE NO RESID DATA            */ 00360000
*         GO TO S2FC0400;           /* GO THROUGH NORMAL PROCESSING  */ 00361000
*     END;                                                         0510 00362000
*   ELSE                            /* ELSE FOR 2ND DEVICE           */ 00363000
*     DO;                                                          0511 00364000
         B     @RC00501                                            0511 00365000
@RF00501 DS    0H                                                  0512 00366000
*       IF $RESID2^=0               /* IF RESIDUAL DATA IN BDU       */ 00367000
*         THEN                      /* THEN                          */ 00368000
         SLR   @07,@07                                             0512 00369000
         L     @03,$RESID2(,WAPTR)                                 0512 00370000
         CR    @03,@07                                             0512 00371000
         BE    @RF00512                                            0512 00372000
*         DO;                                                      0513 00373000
*           FDBPTR=$RESID2;         /* POINT TO FDB WITH DATA        */ 00374000
         LR    FDBPTR,@03                                          0514 00375000
*           FBDATAPT=FDBPTR+$BUFSZ2;/* SKIP WHAT WAS ALREADY PASSED  */ 00376000
         LR    FBDATAPT,FDBPTR                                     0515 00377000
         AL    FBDATAPT,$BUFSZ2(,WAPTR)                            0515 00378000
*           $RESID2=0;              /* ZERO SECOND RESID PTR         */ 00379000
         SLR   @03,@03                                             0516 00380000
         ST    @03,$RESID2(,WAPTR)                                 0516 00381000
*         END;                                                     0517 00382000
*       ELSE                        /* NO RESID DATA                 */ 00383000
*         GO TO S2FC0400;           /* GO THROUGH NORMAL PROCESSING  */ 00384000
*     END;                                                         0519 00385000
*   TEMPSIZE=FDBDATCT-(FBDATAPT-FDBDATAA);/* AMT OF RESID DATA IN BDU*/ 00386000
@RC00501 LR    @03,FBDATAPT                                        0520 00387000
         SL    @03,FDBDATAA(,FDBPTR)                               0520 00388000
         LCR   @03,@03                                             0520 00389000
         AH    @03,FDBDATCT(,FDBPTR)                               0520 00390000
         ST    @03,TEMPSIZE(,WAPTR)                                0520 00391000
*   GOTO S2FC0500;                  /* GIVE DATA TO OLT              */ 00392000
*                                                                  0521 00393000
         B     S2FC0500                                            0521 00394000
*   /*****************************************************************/ 00395000
*   /*                                                               */ 00396000
*   /* PUT FEEDBACK DATA IN OLTTCP'S BUFFERS                         */ 00397000
*   /*                                                               */ 00398000
*   /*****************************************************************/ 00399000
*                                                                  0522 00400000
*S2FC0400:                                                         0522 00401000
*                                                                  0522 00402000
*   /*****************************************************************/ 00403000
*   /*                                                               */ 00404000
*   /* BTU                                                           */ 00405000
*   /*                                                               */ 00406000
*   /*****************************************************************/ 00407000
*                                                                  0522 00408000
*   FSBPTR=BFRPTR;                  /* FSB FIRST THING IN BFR        */ 00409000
S2FC0400 LR    FSBPTR,BFRPTR                                       0522 00410000
*   RFY                                                            0523 00411000
*     ISTPIU BASED(READPTR);                                       0523 00412000
*   THFLAG1=FSBTH1;                 /* TH FLGS TO OLT                */ 00413000
         MVI   THFLAG1+1(READPTR),C' '                             0524 00414000
         MVC   THFLAG1(1,READPTR),FSBTH1(FSBPTR)                   0524 00415000
*   THDAF=FSBSAF;                   /* DESTINATION ADDR TO OLT       */ 00416000
         MVC   THDAF(2,READPTR),FSBSAF(FSBPTR)                     0525 00417000
*   THOAF=FSBDAF;                   /* ORIGINAL ADDR TO OLT          */ 00418000
         MVC   THOAF(2,READPTR),FSBDAF(FSBPTR)                     0526 00419000
*   THSNF=FSBSEQID;                 /* SEQUENCE NUMBER TO OLT        */ 00420000
         MVC   THSNF(2,READPTR),FSBSEQID(FSBPTR)                   0527 00421000
*   THDCF=FSBTHCNT;                 /* DATA COUNT TO OLT             */ 00422000
         LH    @00,FSBTHCNT(,FSBPTR)                               0528 00423000
         STH   @00,THDCF(,READPTR)                                 0528 00424000
*   ISTRH=FSBRHFLD;                 /* PASS BACK RH                  */ 00425000
         MVC   ISTRH+10(3,READPTR),FSBRHFLD(FSBPTR)                0529 00426000
*   READPTR=ADDR(ISTMRU);           /* ADJUST READ PTR TO MRU        */ 00427000
         LA    @15,13                                              0530 00428000
         ALR   READPTR,@15                                         0530 00429000
*   READSIZE=READSIZE-(LENGTH(ISTTH)+LENGTH(ISTRH));/* LOWER BYTES 0531 00430000
*                                      LEFT                          */ 00431000
         LCR   @15,@15                                             0531 00432000
         AH    @15,READSIZE(,WAPTR)                                0531 00433000
         STH   @15,READSIZE(,WAPTR)                                0531 00434000
*   FDBPTR=ADDR(FSBFDB);            /* PT TO FDB                     */ 00435000
*                                                                  0532 00436000
         LA    FDBPTR,FSBFDB(,FSBPTR)                              0532 00437000
*   /*****************************************************************/ 00438000
*   /*                                                               */ 00439000
*   /* DATA                                                          */ 00440000
*   /*                                                               */ 00441000
*   /*****************************************************************/ 00442000
*                                                                  0533 00443000
*   TEMPSIZE=FDBDATCT;              /* DATA COUNT                    */ 00444000
         LH    @03,FDBDATCT(,FDBPTR)                               0533 00445000
         ST    @03,TEMPSIZE(,WAPTR)                                0533 00446000
*   FBDATAPT=FDBDATAA;              /* PTR TO FB DATA PAST FDB       */ 00447000
         L     FBDATAPT,FDBDATAA(,FDBPTR)                          0534 00448000
*S2FC0500:                                                         0535 00449000
*   RFY                                                            0535 00450000
*    (R0,                                                          0535 00451000
*     R1,                                                          0535 00452000
*     R14,                                                         0535 00453000
*     R15) RSTD;                                                   0535 00454000
S2FC0500 DS    0H                                                  0536 00455000
*   R0=ADDR(OLTBUFR);               /* POINT TO RECEIVING BUFFER     */ 00456000
         LR    R0,READPTR                                          0536 00457000
*   R1=MIN(TEMPSIZE,READSIZE);      /* GET BYTES TO MOVE TO OLT      */ 00458000
         L     R1,TEMPSIZE(,WAPTR)                                 0537 00459000
         LH    @03,READSIZE(,WAPTR)                                0537 00460000
         CR    R1,@03                                              0537 00461000
         BNH   *+6                                                      00462000
         LR    R1,@03                                              0537 00463000
*   R14=ADDR(FBDATA);               /* POINT TO SOURCE BUFFER        */ 00464000
         LR    R14,FBDATAPT                                        0538 00465000
*   R15=R1;                         /* MAKE FROM AND TO COUNTS THE 0539 00466000
*                                      SAME                          */ 00467000
         LR    R15,R1                                              0539 00468000
*   MVCL(R0,R14);                   /* MOVE THE DATA                 */ 00469000
         MVCL  R0,R14                                              0540 00470000
*   RFY                                                            0541 00471000
*    (R0,                                                          0541 00472000
*     R1,                                                          0541 00473000
*     R14,                                                         0541 00474000
*     R15) RSTD;                                                   0541 00475000
*   IF TEMPSIZE>READSIZE            /* IF NOT ENOUGH ROOM IN OLT BFR */ 00476000
*     THEN                                                         0542 00477000
         L     @03,TEMPSIZE(,WAPTR)                                0542 00478000
         CH    @03,READSIZE(,WAPTR)                                0542 00479000
         BNH   @RF00542                                            0542 00480000
*     DO;                                                          0543 00481000
*S2FC0600:                                                         0544 00482000
*       TCBEVCSW(7:8)=0;            /* FILLED BUFFER, NO RESIDUAL  0544 00483000
*                                      COUT                          */ 00484000
S2FC0600 LA    @03,TECBEVT1(,TECBPTR)                              0544 00485000
         SLR   @05,@05                                             0544 00486000
         IC    @05,TECBFDLN(,TECBPTR)                              0544 00487000
         ST    @03,@TF00001                                        0544 00488000
         SLR   @03,@03                                             0544 00489000
         IC    @03,TECBEVOC(,TECBPTR)                              0544 00490000
         MR    @04,@03                                             0544 00491000
         AL    @05,@TF00001                                        0544 00492000
         SLR   @03,@03                                             0544 00493000
         STCM  @03,3,TCBEVCSW+6(@05)                               0544 00494000
*       READPTR=FBDATAPT-FDBPTR+READSIZE;/* SET COUNT FOR STORING  0545 00495000
*                                      AWAY                          */ 00496000
         LR    READPTR,FBDATAPT                                    0545 00497000
         SLR   READPTR,FDBPTR                                      0545 00498000
         AH    READPTR,READSIZE(,WAPTR)                            0545 00499000
*       IF $1STUSED(J)=ON           /* IF 1ST BEING USED             */ 00500000
*         THEN                                                     0546 00501000
         LR    @03,J                                               0546 00502000
         MH    @03,@CH01252                                        0546 00503000
         ALR   @03,WAPTR                                           0546 00504000
         TM    $1STUSED-68(@03),B'00100000'                        0546 00505000
         BNO   @RF00546                                            0546 00506000
*         DO;                                                      0547 00507000
*           $RESID1=FDBPTR;         /* PT TO FDB RESID DATA IS IN    */ 00508000
         ST    FDBPTR,$RESID1(,WAPTR)                              0548 00509000
*           $BUFSZ1=READPTR;        /* POINT TO DATA NOT YET PASSED  */ 00510000
         ST    READPTR,$BUFSZ1(,WAPTR)                             0549 00511000
*         END;                                                     0550 00512000
*       ELSE                                                       0551 00513000
*         DO;                                                      0551 00514000
         B     @RC00546                                            0551 00515000
@RF00546 DS    0H                                                  0552 00516000
*           $RESID2=FDBPTR;         /* PT TO FDB RESID DATA IS IN    */ 00517000
         ST    FDBPTR,$RESID2(,WAPTR)                              0552 00518000
*           $BUFSZ2=READPTR;        /* POINT TO DATA NOT YET PASSED  */ 00519000
         ST    READPTR,$BUFSZ2(,WAPTR)                             0553 00520000
*         END;                                                     0554 00521000
*     END;                                                         0555 00522000
*   ELSE                                                           0556 00523000
*     DO;                                                          0556 00524000
         B     @RC00542                                            0556 00525000
@RF00542 DS    0H                                                  0557 00526000
*S2FC0700:                                                         0557 00527000
*       READSIZE=READSIZE-TEMPSIZE; /* DECR BFR SZ LEFT              */ 00528000
S2FC0700 L     @10,TEMPSIZE(,WAPTR)                                0557 00529000
         LH    @03,READSIZE(,WAPTR)                                0557 00530000
         SLR   @03,@10                                             0557 00531000
         STH   @03,READSIZE(,WAPTR)                                0557 00532000
*       READPTR=READPTR+TEMPSIZE;   /* INCR OLT BFR PTR              */ 00533000
         ALR   READPTR,@10                                         0558 00534000
*       IF(FDBFDBA&S2FGATE)=0       /* IF NO MORE FDB'S              */ 00535000
*         THEN                                                     0559 00536000
         SLR   @10,@10                                             0559 00537000
         L     @05,FDBFDBA(,FDBPTR)                                0559 00538000
         N     @05,S2FGATE                                         0559 00539000
         CR    @05,@10                                             0559 00540000
         BNE   @RF00559                                            0559 00541000
*         DO;                                                      0560 00542000
*           TCBEVCSW(7:8)=READSIZE; /* RAN OUT OF DATA, SET RESIDUAL    00543000
*                                      COUNT                         */ 00544000
         LA    @08,TECBEVT1(,TECBPTR)                              0561 00545000
         SLR   @05,@05                                             0561 00546000
         IC    @05,TECBFDLN(,TECBPTR)                              0561 00547000
         SLR   @07,@07                                             0561 00548000
         IC    @07,TECBEVOC(,TECBPTR)                              0561 00549000
         MR    @04,@07                                             0561 00550000
         ALR   @08,@05                                             0561 00551000
         STCM  @03,3,TCBEVCSW+6(@08)                               0561 00552000
*           IF BUFCHAIN=0&$TESTMDE(J)=OFF/* END OF TEST SEQUENCE     */ 00553000
*             THEN                  /* THEN                          */ 00554000
         L     @08,TEMPTR(,WAPTR)                                  0562 00555000
         C     @10,BUFCHAIN(,@08)                                  0562 00556000
         BNE   @RF00562                                            0562 00557000
         LR    @08,J                                               0562 00558000
         MH    @08,@CH01252                                        0562 00559000
         ST    @08,@TF00001                                        0562 00560000
         ALR   @08,WAPTR                                           0562 00561000
         TM    $TESTMDE-68(@08),B'00000010'                        0562 00562000
         BNZ   @RF00562                                            0562 00563000
*             DO;                                                  0563 00564000
*               $DEVACT(J)=OFF;     /* REMOTE DEV THRU               */ 00565000
         LR    @08,WAPTR                                           0564 00566000
         AL    @08,@TF00001                                        0564 00567000
         NI    $DEVACT-68(@08),B'11111011'                         0564 00568000
*               IF $1STUSED(J)=ON   /* IF THIS IS 1ST DEV ACTIVE     */ 00569000
*                 THEN              /* THEN                          */ 00570000
         LR    @08,WAPTR                                           0565 00571000
         AL    @08,@TF00001                                        0565 00572000
         TM    $1STUSED-68(@08),B'00100000'                        0565 00573000
         BNO   @RF00565                                            0565 00574000
*                 DO;                                              0566 00575000
*                   $1STDATA=OFF;   /* TURN OFF 1ST FLAG             */ 00576000
         NI    $1STDATA(WAPTR),B'01111111'                         0567 00577000
*                 END;                                             0568 00578000
*               ELSE                /* ELSE                          */ 00579000
*                 DO;                                              0569 00580000
         B     @RC00565                                            0569 00581000
@RF00565 DS    0H                                                  0570 00582000
*                   $2NDDATA=OFF;   /* TURN OFF 2ND FLAG             */ 00583000
         NI    $2NDDATA(WAPTR),B'10111111'                         0570 00584000
*                 END;                                             0571 00585000
*             END;                                                 0572 00586000
*           GOTO S2FC0740;          /* EVENT COMPLETE                */ 00587000
         B     S2FC0740                                            0573 00588000
*         END;                                                     0574 00589000
*       ELSE                        /* IF MORE FB DATA               */ 00590000
*         DO;                       /* THEN                          */ 00591000
@RF00559 DS    0H                                                  0576 00592000
*           FDBPTR=FDBFDBA;         /* PT TO NEXT FDB                */ 00593000
         L     FDBPTR,FDBFDBA(,FDBPTR)                             0576 00594000
*           FBDATAPT=FDBDATAA;      /* PT TO FB DATA                 */ 00595000
         L     FBDATAPT,FDBDATAA(,FDBPTR)                          0577 00596000
*           TEMPSIZE=FDBDATCT;      /* INITIALIZE DATA COUNT         */ 00597000
         LH    @03,FDBDATCT(,FDBPTR)                               0578 00598000
         ST    @03,TEMPSIZE(,WAPTR)                                0578 00599000
*           GOTO S2FC0500;          /* MOVE DATA INTO OLT BFR        */ 00600000
         B     S2FC0500                                            0579 00601000
*         END;                                                     0580 00602000
*S2FC0740:                                                         0581 00603000
*                                                                  0581 00604000
*       /*************************************************************/ 00605000
*       /*                                                           */ 00606000
*       /* SET UP TO RELEASE BUFFER                                  */ 00607000
*       /*                                                           */ 00608000
*       /*************************************************************/ 00609000
*                                                                  0581 00610000
*       RFY                                                        0581 00611000
*         ISTTIE BASED(TIEPTR);                                    0581 00612000
S2FC0740 DS    0H                                                  0582 00613000
*       RFY                                                        0582 00614000
*         ISTLDNCB BASED($LDNCBPT(J));                             0582 00615000
*       RFY                                                        0583 00616000
*         ISTATCVT BASED($CVTSAVE);                                0583 00617000
*       RFY                                                        0584 00618000
*         ISTDYPAB BASED(ADDR(ATCTCIPB));                          0584 00619000
*       RFY                                                        0585 00620000
*         IOSB BASED(ADDR(LDNIOSB));                               0585 00621000
*       TIEPTR=ADDR(WAITIE);        /* PTR TO WAITIO WORK TIE        */ 00622000
         LA    TIEPTR,WAITIE                                       0586 00623000
*       TIEPTR1=TEMPTR;                                            0587 00624000
         L     @03,TEMPTR(,WAPTR)                                  0587 00625000
         ST    @03,TIEPTR1(,TIEPTR)                                0587 00626000
*       ECB=0;                      /* SET ECB=0                     */ 00627000
         SLR   @11,@11                                             0588 00628000
         ST    @11,ECB                                             0588 00629000
*       TIEPTR2=ADDR(ECB);          /* SET PARM                      */ 00630000
         LA    @11,ECB                                             0589 00631000
         ST    @11,TIEPTR2(,TIEPTR)                                0589 00632000
*       BUFWAPTR=WAPTR;             /* PASS CURRENT WORKAREA POINTER */ 00633000
         ST    WAPTR,BUFWAPTR(,@03)                                0590 00634000
*       BUFJ=J;                     /* PASS CURRENT DEVICE INDEX     */ 00635000
         ST    J,BUFJ(,@03)                                        0591 00636000
*       CVTPTR=$CVTSAVE;            /* GET PTR TO CVT                */ 00637000
         L     @03,RCAPTR(,WAPTR)                                  0592 00638000
         L     CVTPTR,$CVTSAVE(,@03)                               0592 00639000
*       RFY                                                        0593 00640000
*         ISTATCVT BASED(CVTPTR);                                  0593 00641000
*       R0=TIEPTR;                  /* POINT TO TIE          @D32JPPW*/ 00642000
         LR    R0,TIEPTR                                           0594 00643000
*       R1=ADDR(DYPPAB);            /* POINT TO PAB          @D32JPPW*/ 00644000
         LA    R1,DYPPAB+624(,CVTPTR)                              0595 00645000
*       CALL I00C1000;              /* TPQUE                 @D32JPPW*/ 00646000
         L     @15,@CV03969                                        0596 00647000
         BALR  @14,@15                                             0596 00648000
*       R1=ADDR(ECB);               /* POINT TO ECB          @D32JPPW*/ 00649000
         LA    R1,ECB                                              0597 00650000
*       CALL I00C1002;              /* WAIT                  @D32JPPW*/ 00651000
         L     @15,@CV03970                                        0598 00652000
         BALR  @14,@15                                             0598 00653000
*     END;                          /* ALL BUFFER USED UP AND FREED  */ 00654000
*S2FC0750:                                                         0600 00655000
*   $EVNCPLT(J)=ON;                 /* EVENT COMPLETE                */ 00656000
@RC00542 DS    0H                                                  0600 00657000
S2FC0750 LR    @08,J                                               0600 00658000
         MH    @08,@CH01252                                        0600 00659000
         ALR   @08,WAPTR                                           0600 00660000
         OI    $EVNCPLT-68(@08),B'00010000'                        0600 00661000
*   R14=R14SAVE;                    /* RESTORE R14                   */ 00662000
         L     R14,R14SAVE                                         0601 00663000
*   END S2FC0300;                                                  0602 00664000
*                                                                  0602 00665000
@EL00002 DS    0H                                                  0602 00666000
@EF00002 DS    0H                                                  0602 00667000
@ER00002 BR    @14                                                 0602 00668000
*   /*****************************************************************/ 00669000
*   /*                                                               */ 00670000
*   /* CHECK FOR EVENT COMPLETE LOCAL AND REMOTE                     */ 00671000
*   /*                                                               */ 00672000
*   /*****************************************************************/ 00673000
*                                                                  0603 00674000
*S2FC0770:                                                         0603 00675000
*   IF $EVNCPLT(J)=ON               /* AND IF EVENT IS COMPLETE      */ 00676000
*     THEN                          /* THEN                          */ 00677000
S2FC0770 LR    @08,J                                               0603 00678000
         MH    @08,@CH01252                                        0603 00679000
         ALR   @08,WAPTR                                           0603 00680000
         TM    $EVNCPLT-68(@08),B'00010000'                        0603 00681000
         BNO   @RF00603                                            0603 00682000
*S2FC0800:                                                         0604 00683000
*     DO;                                                          0604 00684000
S2FC0800 DS    0H                                                  0605 00685000
*       IF $REMOTE(J)=OFF           /* IF LOCAL DEVICE               */ 00686000
*         THEN                                                     0605 00687000
         LR    @07,J                                               0605 00688000
         MH    @07,@CH01252                                        0605 00689000
         ST    @07,@TF00001                                        0605 00690000
         ALR   @07,WAPTR                                           0605 00691000
         TM    $REMOTE-68(@07),B'01000000'                         0605 00692000
         BNZ   @RF00605                                            0605 00693000
*         DO;                                                      0606 00694000
*           IF $1STUSED(J)=ON THEN                                 0607 00695000
         LR    @07,WAPTR                                           0607 00696000
         AL    @07,@TF00001                                        0607 00697000
         TM    $1STUSED-68(@07),B'00100000'                        0607 00698000
         BNO   @RF00607                                            0607 00699000
*             DO;                                                  0608 00700000
*               $1STUSED(J)=OFF;    /* 1ST USED OFF                  */ 00701000
         LR    @07,WAPTR                                           0609 00702000
         AL    @07,@TF00001                                        0609 00703000
         NI    $1STUSED-68(@07),B'11011111'                        0609 00704000
*               $1STDATA=OFF;       /* RELEASE 1ST SET               */ 00705000
         NI    $1STDATA(WAPTR),B'01111111'                         0610 00706000
*             END;                                                 0611 00707000
*           ELSE                    /* FOR 2ND DEV ACTIVE            */ 00708000
*             DO;                                                  0612 00709000
         B     @RC00607                                            0612 00710000
@RF00607 DS    0H                                                  0613 00711000
*               $2NDUSED(J)=OFF;    /* 2ND FLAG OFF                  */ 00712000
         LR    @07,J                                               0613 00713000
         MH    @07,@CH01252                                        0613 00714000
         ALR   @07,WAPTR                                           0613 00715000
         NI    $2NDUSED-68(@07),B'11101111'                        0613 00716000
*               $2NDDATA=OFF;       /* RELEASE 2ND SET               */ 00717000
         NI    $2NDDATA(WAPTR),B'10111111'                         0614 00718000
*             END;                                                 0615 00719000
*           $TESTMDE(J)=OFF;        /* THEN IT IS OUT OF TEST MODE   */ 00720000
@RC00607 LR    @07,J                                               0616 00721000
         MH    @07,@CH01252                                        0616 00722000
         ST    @07,@TF00001                                        0616 00723000
         ALR   @07,WAPTR                                           0616 00724000
         NI    $TESTMDE-68(@07),B'11111101'                        0616 00725000
*           IF $SYSMN(J)=$SYSMN(1)  /* IF TEST AND CT EQUAL          */ 00726000
*             THEN                  /* THEN                          */ 00727000
         LR    @07,WAPTR                                           0617 00728000
         AL    @07,@TF00001                                        0617 00729000
         CLC   $SYSMN-68(8,@07),$SYSMN(WAPTR)                      0617 00730000
         BNE   @RF00617                                            0617 00731000
*             DO;                                                  0618 00732000
*               $TESTMDE(1)=OFF;    /* CT TESTMODE OFF ALSO          */ 00733000
         NI    $TESTMDE(WAPTR),B'11111101'                         0619 00734000
*               $DISCREQ=ON;        /* DISCONNECT REQUIRED BEFORE API   00735000
*                                      REQ                           */ 00736000
         OI    $DISCREQ(WAPTR),B'00001000'                         0620 00737000
*             END;                                                 0621 00738000
*           $DEVACT(J)=OFF;         /* DEV ACTIVE OFF                */ 00739000
@RF00617 LR    @07,J                                               0622 00740000
         MH    @07,@CH01252                                        0622 00741000
         ALR   @07,WAPTR                                           0622 00742000
         NI    $DEVACT-68(@07),B'11111011'                         0622 00743000
*         END;                                                     0623 00744000
*       $EVNCPLT(J)=OFF;            /* EVENT COMPLETE OFF            */ 00745000
@RF00605 DS    0H                                                  0625 00746000
*       $ATTNEXP(J)=OFF;            /* ATTENTION EXPECTED OFF        */ 00747000
*       $INTOCC(J)=OFF;             /* INTERRUPT OCCRD OFF           */ 00748000
         LR    @07,J                                               0626 00749000
         MH    @07,@CH01252                                        0626 00750000
         ST    @07,@TF00001                                        0626 00751000
         ALR   @07,WAPTR                                           0626 00752000
         NI    $EVNCPLT-68(@07),B'11100101'                        0626 00753000
*       $WTISUED(J)=OFF;            /* WAIT ISSUED OFF               */ 00754000
*       $IGLXIFB(J)=OFF;            /* IGNORE RESET IMM FB OFF       */ 00755000
*       $EXIOISD(J)=OFF;            /* EXIO ISSUED                   */ 00756000
*       $EXIOLV3(J)=OFF;            /* EXIO LEVEL 3 OFF              */ 00757000
         LR    @07,WAPTR                                           0630 00758000
         AL    @07,@TF00001                                        0630 00759000
         NI    $WTISUED-68(@07),B'00111100'                        0630 00760000
*       $WAITFLG=OFF;               /* WAITIO IS DONE                */ 00761000
         NI    $WAITFLG(WAPTR),B'10111111'                         0631 00762000
*       $REMWRIT(J)=OFF;            /* REMOTE WRITE ISSUED OFF       */ 00763000
         LR    @07,WAPTR                                           0632 00764000
         AL    @07,@TF00001                                        0632 00765000
         NI    $REMWRIT-68(@07),B'11111011'                        0632 00766000
*       GOTO S2FC9900;              /* RETURN                        */ 00767000
         B     S2FC9900                                            0633 00768000
*     END;                                                         0634 00769000
*   IF $WIOPOLL=ON                  /* IF WIO POLL REQ               */ 00770000
*     THEN                          /* THEN                          */ 00771000
@RF00603 TM    $WIOPOLL(WAIPTR),B'01000000'                        0635 00772000
         BNO   @RF00635                                            0635 00773000
*     DO;                                                          0636 00774000
*       IF $INTOCC(J)=ON            /* IF AN INTERRUPT OCCURRED      */ 00775000
*         THEN                      /* THEN                          */ 00776000
         LR    @07,J                                               0637 00777000
         MH    @07,@CH01252                                        0637 00778000
         ALR   @07,WAPTR                                           0637 00779000
         TM    $INTOCC-68(@07),B'00000010'                         0637 00780000
         BNO   @RF00637                                            0637 00781000
*         DO;                                                      0638 00782000
*           $WAITFLG=OFF;           /* WAITIO IS DONE                */ 00783000
         NI    $WAITFLG(WAPTR),B'10111111'                         0639 00784000
*           R15='10'X;              /* SET RC=10                     */ 00785000
         LA    R15,16                                              0640 00786000
*           GOTO S2FC9999;          /* RETURN                        */ 00787000
         B     S2FC9999                                            0641 00788000
*         END;                                                     0642 00789000
*       ELSE                        /* ELSE                          */ 00790000
*         DO;                                                      0643 00791000
@RF00637 DS    0H                                                  0644 00792000
*           R15=8;                  /* SET RC=8                      */ 00793000
         LA    R15,8                                               0644 00794000
*           GOTO S2FC9999;          /* RETURN                        */ 00795000
         B     S2FC9999                                            0645 00796000
*         END;                                                     0646 00797000
*     END;                                                         0647 00798000
*                                                                  0647 00799000
*   /*****************************************************************/ 00800000
*   /*                                                               */ 00801000
*   /* ROUTINE TO SET UP WAIT REQUEST                                */ 00802000
*   /*                                                               */ 00803000
*   /*****************************************************************/ 00804000
*                                                                  0648 00805000
*S2FC0900:                                                         0648 00806000
*   IF $WIOTIME>1800                /* IF REQUEST FOR > 30 MIN       */ 00807000
*     THEN                          /* THEN                          */ 00808000
@RF00635 DS    0H                                                  0648 00809000
S2FC0900 CLC   $WIOTIME(2,WAIPTR),@CH03975                         0648 00810000
         BNH   @RF00648                                            0648 00811000
*     DO;                                                          0649 00812000
*       R15='0C'X;                  /* SET RC=0C                     */ 00813000
         LA    R15,12                                              0650 00814000
*       GOTO S2FC9999;              /* AND RETURN                    */ 00815000
         B     S2FC9999                                            0651 00816000
*     END;                                                         0652 00817000
*   IF $WIOTIME=0                   /* IF NO TIME SPECIFIED,         */ 00818000
*     THEN                                                         0653 00819000
@RF00648 ICM   @08,3,$WIOTIME(WAIPTR)                              0653 00820000
         BNZ   @RF00653                                            0653 00821000
*     WAITIME=30;                   /* DEFAULT TO 30 SEC             */ 00822000
         MVC   WAITIME(2,WAPTR),@CH01060                           0654 00823000
*   ELSE                                                           0655 00824000
*     WAITIME=$WIOTIME;             /* ELSE USE TIME SPECIFIED       */ 00825000
         B     @RC00653                                            0655 00826000
@RF00653 MVC   WAITIME(2,WAPTR),$WIOTIME(WAIPTR)                   0655 00827000
*   IF J>0                          /* IF A DEVICE WAIT              */ 00828000
*     THEN                          /* THEN                          */ 00829000
@RC00653 C     J,@CF00036                                          0656 00830000
         BNH   @RF00656                                            0656 00831000
*     DO;                                                          0657 00832000
*       IF $REMOTE(J)=OFF           /* IF A LOCAL DEVICE             */ 00833000
*         THEN                      /* THEN                          */ 00834000
         LR    @07,J                                               0658 00835000
         MH    @07,@CH01252                                        0658 00836000
         ALR   @07,WAPTR                                           0658 00837000
         TM    $REMOTE-68(@07),B'01000000'                         0658 00838000
         BNZ   @RF00658                                            0658 00839000
*         DO;                                                      0659 00840000
*           CALL S2FC3000;                                         0660 00841000
         BAL   @14,S2FC3000                                        0660 00842000
*           IF $SIOFLG(J)=OFF THEN                                 0661 00843000
         LR    @07,J                                               0661 00844000
         MH    @07,@CH01252                                        0661 00845000
         ALR   @07,WAPTR                                           0661 00846000
         TM    $SIOFLG-68(@07),B'00010000'                         0661 00847000
         BNZ   @RF00661                                            0661 00848000
*             DO;                                                  0662 00849000
*               $CEINT1=WAITIME;    /* SAVE USER WAIT TIME           */ 00850000
         LH    @07,WAITIME(,WAPTR)                                 0663 00851000
         ST    @07,$CEINT1(,WAPTR)                                 0663 00852000
*               CALL S2FC2500(SIOTIME,$WAITIME);/* SET END TIME      */ 00853000
         LA    @07,SIOTIME                                         0664 00854000
         ST    @07,@AL00001                                        0664 00855000
         LA    @07,$WAITIME(,WAPTR)                                0664 00856000
         ST    @07,@AL00001+4                                      0664 00857000
         LA    @01,@AL00001                                        0664 00858000
         BAL   @14,S2FC2500                                        0664 00859000
*               GOTO S2FC0920;                                     0665 00860000
         B     S2FC0920                                            0665 00861000
*             END;                                                 0666 00862000
*           GOTO S2FC0910;          /* ELSE DO USER WAIT             */ 00863000
         B     S2FC0910                                            0667 00864000
*         END;                                                     0668 00865000
*     END;                                                         0669 00866000
@RF00658 DS    0H                                                  0670 00867000
*S2FC0910:                                                         0670 00868000
*   CALL S2FC2500(WAITIME,$WAITIME);/* TIME CALCULATING RTN          */ 00869000
@RF00656 DS    0H                                                  0670 00870000
S2FC0910 LA    @07,WAITIME(,WAPTR)                                 0670 00871000
         ST    @07,@AL00001                                        0670 00872000
         LA    @07,$WAITIME(,WAPTR)                                0670 00873000
         ST    @07,@AL00001+4                                      0670 00874000
         LA    @01,@AL00001                                        0670 00875000
         BAL   @14,S2FC2500                                        0670 00876000
*S2FC0920:                                                         0671 00877000
*   $WIODEV=J;                      /* SAVE PTR TO DEV NTRY          */ 00878000
S2FC0920 STC   J,$WIODEV(,WAPTR)                                   0671 00879000
*   $WAITFLG=ON;                    /* TURN ON WAITING FLAG          */ 00880000
         OI    $WAITFLG(WAPTR),B'01000000'                         0672 00881000
*   GOTO S2FC9999;                  /* RETURN                        */ 00882000
         B     S2FC9999                                            0673 00883000
*                                                                  0674 00884000
*   /*****************************************************************/ 00885000
*   /*                                                               */ 00886000
*   /* ENTRY FROM RCM TO SEE IF REQUESTED TIME HAS ELAPSED           */ 00887000
*   /*                                                               */ 00888000
*   /*****************************************************************/ 00889000
*                                                                  0674 00890000
*S2FC1000:                                                         0674 00891000
*   ENTRY;                                                         0674 00892000
@EP00674 DS    0H                                                  0675 00893000
*   R14=R13;                        /* HOLD CALLER'S SVAREA PTR      */ 00894000
         LR    R14,R13                                             0675 00895000
*   R13=ADDR(SVESC02F);             /* PT TO MY SAVE AREA            */ 00896000
         LA    R13,SVESC02F(,WAPTR)                                0676 00897000
*   BACKSAVE(3)=R13;                /* PUT MY SVAPTR IN CALLER       */ 00898000
         STCM  R13,15,BACKSAVE+8(R14)                              0677 00899000
*   SVESC02F(2)=R14;                /* PUT CALLER'S SVAREA PTR IN MY    00900000
*                                      SAVEAREA                      */ 00901000
         ST    R14,SVESC02F+4(,WAPTR)                              0678 00902000
*/*                                                                  */ 00903000
*                                                                  0679 00904000
*   CALL ISTSC026;                  /* GO TO $DTIME FOR CURR TIME    */ 00905000
         L     @15,@CV03986                                        0679 00906000
         BALR  @14,@15                                             0679 00907000
*/*                                                                  */ 00908000
*                                                                  0680 00909000
*   DTIME=R1;                       /* SAVE CURRENT TIME             */ 00910000
         ST    R1,DTIME(,WAPTR)                                    0680 00911000
*   J=$WIODEV;                      /* SET UP PTR TO DEV NTRY        */ 00912000
         SLR   J,J                                                 0681 00913000
         IC    J,$WIODEV(,WAPTR)                                   0681 00914000
*   IF J=0                          /* IF A STANDALONE WAIT          */ 00915000
*     THEN                          /* THEN                          */ 00916000
         C     J,@CF00036                                          0682 00917000
         BE    @RT00682                                            0682 00918000
*     GOTO S2FC1100;                /* DON'T CHECK FOR EVENT COMPLETE*/ 00919000
*   ELSE                            /* ELSE, A WAIT FOR A DEVICE     */ 00920000
*     DO;                                                          0684 00921000
*       IF $DATAIN(J)=ON            /* IF DATA IN FOR NCP            */ 00922000
*         THEN                      /* THEN                          */ 00923000
         LR    @07,J                                               0685 00924000
         MH    @07,@CH01252                                        0685 00925000
         ALR   @07,WAPTR                                           0685 00926000
         TM    $DATAIN-68(@07),B'10000000'                         0685 00927000
         BNO   @RF00685                                            0685 00928000
*         CALL S2FC0300;            /* GET DATA                      */ 00929000
         BAL   @14,S2FC0300                                        0686 00930000
*     END;                                                         0687 00931000
@RF00685 DS    0H                                                  0688 00932000
*S2FC1050:                                                         0688 00933000
*   IF $EVNCPLT(J)=ON               /* IF EVENT COMPLETE             */ 00934000
*     THEN                          /* THEN                          */ 00935000
S2FC1050 LR    @07,J                                               0688 00936000
         MH    @07,@CH01252                                        0688 00937000
         ST    @07,@TF00001                                        0688 00938000
         ALR   @07,WAPTR                                           0688 00939000
         TM    $EVNCPLT-68(@07),B'00010000'                        0688 00940000
         BO    @RT00688                                            0688 00941000
*     GOTO S2FC1300;                /* PROCESS EVENT COMPLETE        */ 00942000
*   IF $REMOTE(J)=OFF               /* IF LOCAL DEVICE               */ 00943000
*       &$SIOFLG(J)=OFF THEN                                       0690 00944000
         LR    @07,WAPTR                                           0690 00945000
         AL    @07,@TF00001                                        0690 00946000
         TM    $REMOTE-68(@07),B'01000000'                         0690 00947000
         BNZ   @RF00690                                            0690 00948000
         LR    @07,WAPTR                                           0690 00949000
         AL    @07,@TF00001                                        0690 00950000
         TM    $SIOFLG-68(@07),B'00010000'                         0690 00951000
         BNZ   @RF00690                                            0690 00952000
*     DO;                                                          0691 00953000
*       CALL S2FC3000;                                             0692 00954000
         BAL   @14,S2FC3000                                        0692 00955000
*       IF $SIOFLG(J)=ON THEN       /* THEN                          */ 00956000
         LR    @07,J                                               0693 00957000
         MH    @07,@CH01252                                        0693 00958000
         ALR   @07,WAPTR                                           0693 00959000
         TM    $SIOFLG-68(@07),B'00010000'                         0693 00960000
         BNO   @RF00693                                            0693 00961000
*         DO;                                                      0694 00962000
*           CETIME=$CEINT1;         /* MOVE TO HALFWORD THE PARAMETER*/ 00963000
         L     @07,$CEINT1(,WAPTR)                                 0695 00964000
         STH   @07,CETIME(,WAPTR)                                  0695 00965000
*           CALL S2FC2500(CETIME,$WAITIME);/* SET USER WAIT TIME     */ 00966000
         LA    @07,CETIME(,WAPTR)                                  0696 00967000
         ST    @07,@AL00001                                        0696 00968000
         LA    @07,$WAITIME(,WAPTR)                                0696 00969000
         ST    @07,@AL00001+4                                      0696 00970000
         LA    @01,@AL00001                                        0696 00971000
         BAL   @14,S2FC2500                                        0696 00972000
*           GOTO S2FC1050;          /* CHECK FOR EVENT COMPLETE      */ 00973000
         B     S2FC1050                                            0697 00974000
*         END;                                                     0698 00975000
*     END;                                                         0699 00976000
@RF00693 DS    0H                                                  0700 00977000
*S2FC1100:                                                         0700 00978000
*   IF DTIME>=$WAITIME              /* IF TIME HAS EXPIRED           */ 00979000
*     THEN                          /* THEN                          */ 00980000
@RF00690 DS    0H                                                  0700 00981000
S2FC1100 CLC   DTIME(4,WAPTR),$WAITIME(WAPTR)                      0700 00982000
         BL    @RF00700                                            0700 00983000
*     DO;                                                          0701 00984000
*       $WAITFLG=OFF;               /* TURN OFF WAITING FLG          */ 00985000
         NI    $WAITFLG(WAPTR),B'10111111'                         0702 00986000
*       IF J=0                      /* IF A NO DEV TIMEOUT           */ 00987000
*         THEN                      /* THEN                          */ 00988000
         C     J,@CF00036                                          0703 00989000
         BE    @RT00703                                            0703 00990000
*         GOTO S2FC1200;            /* SKIP PURGE                    */ 00991000
*       $IGLXIFB(J)=ON;             /* IGNORE PURGE FEEDBACK         */ 00992000
         LR    @07,J                                               0705 00993000
         MH    @07,@CH01252                                        0705 00994000
         ST    @07,@TF00001                                        0705 00995000
         ALR   @07,WAPTR                                           0705 00996000
         OI    $IGLXIFB-68(@07),B'01000000'                        0705 00997000
*       DIOCDS=ADDR($DEVTBLE(J));   /* SET UP CDS PTR                */ 00998000
         L     @07,@TF00001                                        0706 00999000
         LA    @07,$DEVTBLE-68(@07,WAPTR)                          0706 01000000
         ST    @07,DIOCDS                                          0706 01001000
*       DIOTECB=$DEVTECB(J);        /* SET UP TECB PTR               */ 01002000
         LR    @07,WAPTR                                           0707 01003000
         AL    @07,@TF00001                                        0707 01004000
         ICM   @03,15,$DEVTECB-68(@07)                             0707 01005000
         ST    @03,DIOTECB                                         0707 01006000
*       R1=ADDR(DIOPARM);           /* POINT TO PARM LIST            */ 01007000
         LA    R1,DIOPARM                                          0708 01008000
*       CALL ISTSC032;              /* CALL DIO MODULE               */ 01009000
         L     @15,@CV03939                                        0709 01010000
         BALR  @14,@15                                             0709 01011000
*S2FC1200:                                                         0710 01012000
*       R15=8;                      /* SET TIMEOUT RC                */ 01013000
S2FC1200 LA    R15,8                                               0710 01014000
*       GOTO S2FC9999;              /* RETURN                        */ 01015000
         B     S2FC9999                                            0711 01016000
*     END;                                                         0712 01017000
*   ELSE                                                           0713 01018000
*     GOTO S2FC9999;                /* KEEP WAITING                  */ 01019000
*S2FC1300:                                                         0714 01020000
*   $WAITFLG=OFF;                   /* WAITING FLAG OFF              */ 01021000
S2FC1300 NI    $WAITFLG(WAPTR),B'10111111'                         0714 01022000
*   IF $REMOTE(J)=OFF               /* IF A LOCAL DEVICE             */ 01023000
*     THEN                                                         0715 01024000
         LR    @07,J                                               0715 01025000
         MH    @07,@CH01252                                        0715 01026000
         ST    @07,@TF00001                                        0715 01027000
         ALR   @07,WAPTR                                           0715 01028000
         TM    $REMOTE-68(@07),B'01000000'                         0715 01029000
         BNZ   @RF00715                                            0715 01030000
*     DO;                                                          0716 01031000
*       IF $1STUSED(J)=ON           /* IF THIS WAS 1ST DEV           */ 01032000
*         THEN                                                     0717 01033000
         LR    @07,WAPTR                                           0717 01034000
         AL    @07,@TF00001                                        0717 01035000
         TM    $1STUSED-68(@07),B'00100000'                        0717 01036000
         BNO   @RF00717                                            0717 01037000
*         DO;                                                      0718 01038000
*           $1STUSED(J)=OFF;        /* TURN OFF 1ST FLAG             */ 01039000
         LR    @07,WAPTR                                           0719 01040000
         AL    @07,@TF00001                                        0719 01041000
         NI    $1STUSED-68(@07),B'11011111'                        0719 01042000
*           $1STDATA=OFF;           /* RELEASE 1ST CTL BLK SET       */ 01043000
         NI    $1STDATA(WAPTR),B'01111111'                         0720 01044000
*         END;                                                     0721 01045000
*       ELSE                        /* FOR 2ND DEV                   */ 01046000
*         DO;                                                      0722 01047000
         B     @RC00717                                            0722 01048000
@RF00717 DS    0H                                                  0723 01049000
*           $2NDUSED(J)=OFF;        /* 2ND DEV OFF                   */ 01050000
         LR    @07,J                                               0723 01051000
         MH    @07,@CH01252                                        0723 01052000
         ALR   @07,WAPTR                                           0723 01053000
         NI    $2NDUSED-68(@07),B'11101111'                        0723 01054000
*           $2NDDATA=OFF;           /* RELEASE 2ND CTL BLK SET       */ 01055000
         NI    $2NDDATA(WAPTR),B'10111111'                         0724 01056000
*         END;                                                     0725 01057000
*       $TESTMDE(J)=OFF;            /* TEST MODE TERMINATED          */ 01058000
@RC00717 LR    @07,J                                               0726 01059000
         MH    @07,@CH01252                                        0726 01060000
         ST    @07,@TF00001                                        0726 01061000
         ALR   @07,WAPTR                                           0726 01062000
         NI    $TESTMDE-68(@07),B'11111101'                        0726 01063000
*       IF $SYSMN(J)=$SYSMN(1)      /* IF CT = TT                    */ 01064000
*         THEN                      /* THEN                          */ 01065000
         LR    @07,WAPTR                                           0727 01066000
         AL    @07,@TF00001                                        0727 01067000
         CLC   $SYSMN-68(8,@07),$SYSMN(WAPTR)                      0727 01068000
         BNE   @RF00727                                            0727 01069000
*         DO;                                                      0728 01070000
*           $TESTMDE(1)=OFF;        /* TEST MODE ON CT OFF           */ 01071000
         NI    $TESTMDE(WAPTR),B'11111101'                         0729 01072000
*           $DISCREQ=ON;            /* DICOONN REQ BEFORE API REQ    */ 01073000
         OI    $DISCREQ(WAPTR),B'00001000'                         0730 01074000
*         END;                                                     0731 01075000
*       $DEVACT(J)=OFF;             /* DEV NO LONGER ACTIVE          */ 01076000
@RF00727 LR    @07,J                                               0732 01077000
         MH    @07,@CH01252                                        0732 01078000
         ALR   @07,WAPTR                                           0732 01079000
         NI    $DEVACT-68(@07),B'11111011'                         0732 01080000
*     END;                                                         0733 01081000
*   $EVNCPLT(J)=OFF;                /* EVENT COMPLETE OFF            */ 01082000
@RF00715 DS    0H                                                  0735 01083000
*   $ATTNEXP(J)=OFF;                /* ATTENTION EXPTED OFF          */ 01084000
*   $INTOCC(J)=OFF;                 /* INTERRUPT OCCURRED OFF        */ 01085000
         LR    @07,J                                               0736 01086000
         MH    @07,@CH01252                                        0736 01087000
         ST    @07,@TF00001                                        0736 01088000
         ALR   @07,WAPTR                                           0736 01089000
         NI    $EVNCPLT-68(@07),B'11100101'                        0736 01090000
*   $WTISUED(J)=OFF;                /* WAIT ISSUED OFF               */ 01091000
*   $REMWRIT(J)=OFF;                /* REMOTE WRITE OFF              */ 01092000
*   $EXIOLV3(J)=OFF;                /* EXIO LEVEL 3 OFF              */ 01093000
*   $IGLXIFB(J)=OFF;                /* IGNORE PURGE FEEDBK OFF       */ 01094000
*   $EXIOISD(J)=OFF;                /* EXIO ISSUED OFF               */ 01095000
         LR    @07,WAPTR                                           0741 01096000
         AL    @07,@TF00001                                        0741 01097000
         NI    $WTISUED-68(@07),B'00111000'                        0741 01098000
*   IF $REMOTE(J)=ON                /* IF A REMOTE DEV               */ 01099000
*     THEN                          /* THEN                          */ 01100000
         LR    @07,WAPTR                                           0742 01101000
         AL    @07,@TF00001                                        0742 01102000
         TM    $REMOTE-68(@07),B'01000000'                         0742 01103000
         BNO   @RF00742                                            0742 01104000
*     DO;                                                          0743 01105000
*       IF $REMDONE(J)=ON           /* IF REMOTE I/O DONE            */ 01106000
*         THEN                      /* THEN                          */ 01107000
         LR    @07,WAPTR                                           0744 01108000
         AL    @07,@TF00001                                        0744 01109000
         TM    $REMDONE-68(@07),B'00001000'                        0744 01110000
         BNO   @RF00744                                            0744 01111000
*         DO;                                                      0745 01112000
*           $DEVACT(J)=OFF;         /* DEVICE NO LONGER ACTIVE       */ 01113000
         LR    @07,WAPTR                                           0746 01114000
         AL    @07,@TF00001                                        0746 01115000
         NI    $DEVACT-68(@07),B'11111011'                         0746 01116000
*           $REMDONE(J)=OFF;        /* TURN OFF REMOTE FINISHED      */ 01117000
         LR    @07,WAPTR                                           0747 01118000
         AL    @07,@TF00001                                        0747 01119000
         NI    $REMDONE-68(@07),B'11110111'                        0747 01120000
*         END;                                                     0748 01121000
*     END;                                                         0749 01122000
*   GOTO S2FC9900;                  /* SET RC=00 AND RETURN          */ 01123000
         B     S2FC9900                                            0750 01124000
*                                                                  0751 01125000
*   /*****************************************************************/ 01126000
*   /*                                                               */ 01127000
*   /* ENTRY POINT FROM EXTERNAL MODULES FOR TIME CALCULATING ROUTINE*/ 01128000
*   /*                                                               */ 01129000
*   /*****************************************************************/ 01130000
*                                                                  0751 01131000
*S2FC2000:                                                         0751 01132000
*   ENTRY(IN,OUT);                                                 0751 01133000
@EP00751 MVC   @PC00001(8),0(@01)                                  0751 01134000
*   R14=R13;                        /* HOLD CALLER'S SVAREA PTR      */ 01135000
         LR    R14,R13                                             0752 01136000
*   R13=ADDR(SVESC02F);             /* PT TO MY SAVEAREA             */ 01137000
         LA    R13,SVESC02F(,WAPTR)                                0753 01138000
*   BACKSAVE(3)=R13;                /* PUT MY SVAPTR IN CALLER       */ 01139000
         STCM  R13,15,BACKSAVE+8(R14)                              0754 01140000
*   SVESC02F(2)=R14;                /* PUT CALLER'S SVAREA PTR IN MY    01141000
*                                      SAVEAREA                      */ 01142000
         ST    R14,SVESC02F+4(,WAPTR)                              0755 01143000
*   CALL S2FC2500(IN,OUT);          /* CALL TIME CALC ROUTINE        */ 01144000
         L     @03,@PC00001                                        0756 01145000
         ST    @03,@AL00001                                        0756 01146000
         L     @03,@PC00001+4                                      0756 01147000
         ST    @03,@AL00001+4                                      0756 01148000
         LA    @01,@AL00001                                        0756 01149000
         BAL   @14,S2FC2500                                        0756 01150000
*   GOTO S2FC9999;                  /* RETURN                        */ 01151000
*                                                                  0757 01152000
         B     S2FC9999                                            0757 01153000
*   /*****************************************************************/ 01154000
*   /*                                                               */ 01155000
*   /* TIME CALCULATING ROUTINE                                      */ 01156000
*   /*                                                               */ 01157000
*   /*****************************************************************/ 01158000
*                                                                  0758 01159000
*S2FC2500:                                                         0758 01160000
*   PROC(STTIME,OUTTIME) OPTIONS(NOSAVE,NOSAVEAREA);               0758 01161000
S2FC2500 MVC   @PC00003(8),0(@01)                                  0758 01162000
*   DCL                                                            0759 01163000
*     ENDTIME CHAR(4) DEF(OUTTIME);                                0759 01164000
*   DCL                                                            0760 01165000
*     TIME FIXED(15) DEF(STTIME);                                  0760 01166000
*   R14SAVE=R14;                    /* SAVE R14                      */ 01167000
         ST    R14,R14SAVE                                         0761 01168000
*/*                                                                  */ 01169000
*                                                                  0762 01170000
*   CALL ISTSC026;                  /* CALL $DTIME                   */ 01171000
         L     @15,@CV03986                                        0762 01172000
         BALR  @14,@15                                             0762 01173000
*/*                                                                  */ 01174000
*                                                                  0763 01175000
*   DTIME=R1;                       /* SAVE CURRENT TIME             */ 01176000
         ST    R1,DTIME(,WAPTR)                                    0763 01177000
*   TEMPTIME='00'X;                 /* ZERO OUTADDR WORK AREA        */ 01178000
         XC    TEMPTIME+1(5,WAPTR),TEMPTIME+1(WAPTR)               0764 01179000
         MVI   TEMPTIME(WAPTR),X'00'                               0764 01180000
*   CVD(TIME,TEMPTIME(4:6));        /* CONV WIO TIME REQ TO DEC      */ 01181000
         L     @07,@PC00003                                        0765 01182000
         LH    @07,TIME(,@07)                                      0765 01183000
         CVD   @07,@TS00001                                        0765 01184000
         MVC   TEMPTIME+3(3,WAPTR),@TS00001+5                      0765 01185000
*   TEMPSEC(2:2)=TEMPSEC(2:2)|'0F'X;/* PUT SIGN IN WORKAREA          */ 01186000
         OI    TEMPSEC+1(WAPTR),X'0F'                              0766 01187000
*   MVO(TEMPSEC,DTIME(3:3));        /* CURRENT SEC IN WORK AREA      */ 01188000
         MVO   TEMPSEC(2,WAPTR),DTIME+2(1,WAPTR)                   0767 01189000
*   AP(TEMPTIME(4:6),TEMPSEC);      /* ADD WIO REQ TO CURRENT        */ 01190000
         AP    TEMPTIME+3(3,WAPTR),TEMPSEC(2,WAPTR)                0768 01191000
*   DP(TEMPTIME(3:6),SIXTY);        /* DIVIDE SEC BY 60 DIVIDEND=MIN    01192000
*                                      REMAINDR=SEC                  */ 01193000
         DP    TEMPTIME+2(4,WAPTR),SIXTY(2)                        0769 01194000
*   MVO(TEMPMIN,DTIME(2:2));        /* CURRENT MIN IN WORK AREA      */ 01195000
         MVO   TEMPMIN(2,WAPTR),DTIME+1(1,WAPTR)                   0770 01196000
*   AP(TEMPTIME(3:4),TEMPMIN);      /* ADD CURRENT TO WIO REQ        */ 01197000
         AP    TEMPTIME+2(2,WAPTR),TEMPMIN(2,WAPTR)                0771 01198000
*   DP(TEMPTIME(1:4),SIXTY);        /* DIVIDE MIN BY 60 HRS=DIVIDEND    01199000
*                                      MIN=REMAINDR                  */ 01200000
         DP    TEMPTIME(4,WAPTR),SIXTY(2)                          0772 01201000
*   MVO(TEMPHR,DTIME(1:1));         /* MOVE CURRENT HRS TO WORK      */ 01202000
         MVO   TEMPHR(2,WAPTR),DTIME(1,WAPTR)                      0773 01203000
*   AP(TEMPTIME(1:2),TEMPHR);       /* ADD WIO REQ TO CURRENT        */ 01204000
         AP    TEMPTIME(2,WAPTR),TEMPHR(2,WAPTR)                   0774 01205000
*   MVO(ENDTIME(1:2),TEMPTIME(1:2));/* SAVE HRS IN COMMON            */ 01206000
         L     @07,@PC00003+4                                      0775 01207000
         MVO   ENDTIME(2,@07),TEMPTIME(2,WAPTR)                    0775 01208000
*   IF ENDTIME(1:1)>'24'X           /* IF HRS NOW MORE THAN 24       */ 01209000
*     THEN                                                         0776 01210000
         CLI   ENDTIME(@07),X'24'                                  0776 01211000
         BNH   @RF00776                                            0776 01212000
*     ENDTIME(1:1)=ENDTIME(1:1)-'24'X;/* SET TIME TO NEXT DAY        */ 01213000
         SLR   @03,@03                                             0777 01214000
         IC    @03,ENDTIME(,@07)                                   0777 01215000
         SL    @03,@CF04015                                        0777 01216000
         STC   @03,ENDTIME(,@07)                                   0777 01217000
*   MVO(ENDTIME(2:3),TEMPTIME(3:4));/* SAVE MIN IN COMMON            */ 01218000
@RF00776 L     @07,@PC00003+4                                      0778 01219000
         MVO   ENDTIME+1(2,@07),TEMPTIME+2(2,WAPTR)                0778 01220000
*   MVO(ENDTIME(3:4),TEMPTIME(5:6));/* SAVE SECS IN COMMON           */ 01221000
         MVO   ENDTIME+2(2,@07),TEMPTIME+4(2,WAPTR)                0779 01222000
*   ENDTIME(4:4)=0;                 /* GET RID OF SIGN               */ 01223000
         MVI   ENDTIME+3(@07),X'00'                                0780 01224000
*   R14=R14SAVE;                    /* RESTORE R14                   */ 01225000
         L     R14,R14SAVE                                         0781 01226000
*   END S2FC2500;                                                  0782 01227000
@EL00003 DS    0H                                                  0782 01228000
@EF00003 DS    0H                                                  0782 01229000
@ER00003 BR    @14                                                 0782 01230000
*S2FC3000:                                                         0783 01231000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0783 01232000
S2FC3000 DS    0H                                                  0784 01233000
*   R14SAVE=R14;                                                   0784 01234000
         ST    R14,R14SAVE                                         0784 01235000
*   IF IOSCC^=0 THEN                                               0785 01236000
         LR    @07,J                                               0785 01237000
         MH    @07,@CH01252                                        0785 01238000
         L     @03,$LDNCBPT-68(@07,WAPTR)                          0785 01239000
         CLI   IOSCC+412(@03),0                                    0785 01240000
         BE    @RF00785                                            0785 01241000
*     $SIOFLG(J)=ON;                /* SET SIO FLAG ON               */ 01242000
         ALR   @07,WAPTR                                           0786 01243000
         OI    $SIOFLG-68(@07),B'00010000'                         0786 01244000
*   R14=R14SAVE;                    /* RESTORE R14                   */ 01245000
@RF00785 L     R14,R14SAVE                                         0787 01246000
*   END S2FC3000;                                                  0788 01247000
@EL00004 DS    0H                                                  0788 01248000
@EF00004 DS    0H                                                  0788 01249000
@ER00004 BR    @14                                                 0788 01250000
*S2FC9900:                                                         0789 01251000
*   R15=0;                          /* SET RC=00                     */ 01252000
S2FC9900 SLR   R15,R15                                             0789 01253000
*S2FC9999:                                                         0790 01254000
*   R13=SVESC02F(2);                /* GET CALLER'S SVAREA PTR       */ 01255000
S2FC9999 L     R13,SVESC02F+4(,WAPTR)                              0790 01256000
*   DCL                                                            0791 01257000
*     1 IFGACB BASED,               /* LEVEL ONE DECLARE             */ 01258000
*      2 ACBCOMN,                   /* ACB COMMON SECTION X03004     */ 01259000
*        4 ACBID PTR(8),            /* ACB IDENTIFIER                */ 01260000
*        4 ACBSTYP PTR(8),          /* ACB SUBTYPE                   */ 01261000
*        4 ACBLENG FIXED(15),       /* ACB LENGTH IN BYTES           */ 01262000
*         5 ACBLENG2 FIXED(15),     /* ACB LENGTH IN BYTES           */ 01263000
*          6 ACBLEN2 FIXED(15),     /* ACB LENGTH IN BYTES X03004    */ 01264000
*        4 ACBAMBL PTR(31),         /* AMB LIST ADDRESS              */ 01265000
*         5 ACBJWA PTR(31),         /* JES WORKAREA ADDRESS          */ 01266000
*          6 ACBIBCT PTR(31),       /* IBCT ADDRESS                  */ 01267000
*        4 ACBINRTN PTR(31),        /* INTERFACE ROUTINE ADDRESS     */ 01268000
*        4 ACBMACRF BIT(16),        /* MACRF FLAGS                   */ 01269000
*         5 ACBMACR1 BIT(8),        /* MACRF FIRST BYTE              */ 01270000
*          6 ACBKEY BIT(1),         /* ACCESS DATA VIA INDEX         */ 01271000
*          6 ACBADR BIT(1),         /* ACCESS WITHOUT INDEX          */ 01272000
*           7 ACBADD BIT(1),        /* SAME AS ABOVE                 */ 01273000
*          6 ACBCNV BIT(1),         /* CONTROL INTERVAL PROCESSING   */ 01274000
*           7 ACBBLK BIT(1),        /* SAME AS ABOVE                 */ 01275000
*          6 ACBSEQ BIT(1),         /* SEQUENTIAL PROCESSING         */ 01276000
*          6 ACBDIR BIT(1),         /* DIRECT PROCESSING             */ 01277000
*          6 ACBIN BIT(1),          /* GET, READ                     */ 01278000
*          6 ACBOUT BIT(1),         /* PUT, WRITE                    */ 01279000
*          6 ACBUBF BIT(1),         /* USER BUFFERS                  */ 01280000
*         5 ACBMACR2 BIT(8),        /* MACRF SECOND BYTE             */ 01281000
*          6 * BIT(3),              /* RESERVED              @X04SVHS*/ 01282000
*          6 ACBSKP BIT(1),         /* SKIP SEQUENTIAL PROCESSING    */ 01283000
*          6 ACBLOGON BIT(1),       /* LOGON INDICATOR(VTAM) X03004  */ 01284000
*          6 ACBRST BIT(1),         /* SET DATA SET TO EMPTY STATE 0791 01285000
*                                                            @X04SVHS*/ 01286000
*          6 ACBDSN BIT(1),         /* BASIC SUBTASK SHARED CONTROL     01287000
*                                      BLOCK CONNECTION ON COMMON  0791 01288000
*                                      DSNAMES               @X04SVHS*/ 01289000
*          6 ACBAIX BIT(1),         /* ENTITY TO BE PROCESSED IS AIX    01290000
*                                      OF THE PATH SPECIFIED IN THE     01291000
*                                      GIVEN DDNAME          @X04SVHS*/ 01292000
*        4 ACBBSTNO PTR(8),         /* NO OF CONCURRENT STRINGS FOR     01293000
*                                      AIX PATH              @X04SVHS*/ 01294000
*        4 ACBSTRNO PTR(8),         /* NUMBER OF STRINGS     @X04SVHS*/ 01295000
*        4 ACBBUFND FIXED(15),      /* NUMBER OF BUFFERS REQUESTED 0791 01296000
*                                      FOR DATA                      */ 01297000
*        4 ACBBUFNI FIXED(15),      /* NUMBER OF BUFFERS REQUESTED 0791 01298000
*                                      FOR INDEX                     */ 01299000
*        4 ACBBUFPL PTR(31),        /* JES BUFFER POOL ADDR          */ 01300000
*         5 ACBMACR3 BIT(8),        /* MACRF THIRD BYTE      @X04SVHS*/ 01301000
*          6 * BIT(1),              /* RESERVED              @X04SVHS*/ 01302000
*          6 ACBLSR BIT(1),         /* LOCAL SHARED RESOURCE @X04SVHS*/ 01303000
*          6 ACBGSR BIT(1),         /* GLOBAL SHARED RESOURCE      0791 01304000
*                                                            @X04SVHS*/ 01305000
*          6 ACBICI BIT(1),         /* IMPROVED CONTROL INTERVAL   0791 01306000
*                                      PROCESSING            @X04SVHS*/ 01307000
*          6 ACBDFR BIT(1),         /* DEFER WRITES          @X04SVHS*/ 01308000
*          6 ACBSIS BIT(1),         /* SEQUENTIAL INSERT STRATEGY  0791 01309000
*                                                            @X04SVHS*/ 01310000
*          6 ACBNCFX BIT(1),        /* NFX=0/CFX=1           @X04SVHS*/ 01311000
*          6 * BIT(1),              /* RESERVED FOR VSAM             */ 01312000
*         5 ACBMACR4 BIT(8),        /* RESERVED FOR VSAM             */ 01313000
*         5 ACBJBUF FIXED(15),      /* NUMBER OF BUFFERS REQUESTED 0791 01314000
*                                      FOR JOURNAL                   */ 01315000
*        4 ACBRECFM BIT(8),         /* RECORD FORMAT                 */ 01316000
*          6 ACBRECAF BIT(1),       /* JES FORMAT                    */ 01317000
*          6 * BIT(6),              /* RESERVED                      */ 01318000
*        4 ACBCCTYP BIT(8),         /* CONTROL CHARACTER             */ 01319000
*         5 ACBTRCID BIT(2),        /* 3800 TRANSLATE TABLE  @Z40SVHS*/ 01320000
*         5 * BIT(2),               /* RESERVED                      */ 01321000
*         5 ACBASA BIT(4),          /* CONTROL CHARACTER TYPE        */ 01322000
*        4 ACBOPT BIT(16),          /* NON-USER OPTIONS              */ 01323000
*         5 ACBDSORG BIT(16),       /* MATCH ACBDORGA WITH DCBDSORG  */ 01324000
*          6 ACBCROPS BIT(2),       /* CHECKPOINT/RESTART OPTIONS    */ 01325000
*           7 ACBCRNCK BIT(1),      /* NO CHECK FOR MODIFY           */ 01326000
*           7 ACBCRNRE BIT(1),      /* NO DATA ERASE OR REPOSITION   */ 01327000
*          6 ACBDVIND BIT(1),       /* DEVICE INDICATOR      @Z40SVHS*/ 01328000
*           7 ACBOPTJ BIT(1),       /* 3800 CONTROL CHARACTER PRESENT   01329000
*                                                            @Z40SVHS*/ 01330000
*          6 * BIT(9),              /* RESERVED                      */ 01331000
*          6 ACBDORGA BIT(1),       /* ACB INDICATOR                 */ 01332000
*          6 * BIT(3),              /* RESERVED                      */ 01333000
*        4 ACBMSGAR PTR(31),        /* MSG AREA              @X04SVHS*/ 01334000
*        4 ACBPASSW PTR(31),        /* PASSWORD ADDRESS              */ 01335000
*        4 ACBEXLST PTR(31),        /* USER EXIT LIST ADDR           */ 01336000
*         5 ACBUEL PTR(31),         /* SAME AS ABOVE                 */ 01337000
*/*  BEFORE OPEN                                                     */ 01338000
*/*  (FOR VTAM, ACBDDNM INITIALIZED TO X'FF000000000000')     X03004 */ 01339000
*                                                                  0791 01340000
*        4 ACBDDNM CHAR(8) BDY(WORD),/* DDNAME                       */ 01341000
*/*  AFTER OPEN                                                      */ 01342000
*                                                                  0791 01343000
*         5 ACBTIOT FIXED(15),      /* TIOT OFFSET                   */ 01344000
*         5 ACBINFL PTR(8),         /* INDICATOR FLAGS               */ 01345000
*         5 ACBAMETH PTR(8),        /* ACCESS METHOD TYPE            */ 01346000
*          6 ACBAM PTR(8),          /* ACCESS METHOD TYPE X03004     */ 01347000
*         5 ACBERFL BIT(8),         /* ERROR FLAGS                   */ 01348000
*         5 ACBDEB PTR(24),         /* DEB ADDRESS                   */ 01349000
*/*  NOT MOVED BY OPEN                                               */ 01350000
*                                                                  0791 01351000
*        4 ACBOFLGS BIT(8),         /* OPEN / CLOSE FLAGS            */ 01352000
*         5 * BIT(2),               /* RESERVED                      */ 01353000
*         5 ACBEOV BIT(1),          /* EOV CONCATENATION             */ 01354000
*         5 ACBOPEN BIT(1),         /* ACB IS OPEN                   */ 01355000
*         5 ACBDSERR BIT(1),        /* NO FURTHER REQUESTS POSSIBLE     01356000
*                                      AGAINST ACB                   */ 01357000
*         5 * BIT(1),               /* RESERVED                      */ 01358000
*         5 ACBEXFG BIT(1),         /* USER EXIT FLAG                */ 01359000
*          6 ACBLOCK BIT(1),        /* ACB IS LOCKED X03004          */ 01360000
*         5 ACBIOSFG BIT(1),        /* OPEN/CLOSE IN CONTROL         */ 01361000
*          6 ACBBUSY BIT(1),        /* ACB IS BUSY X03004            */ 01362000
*        4 ACBERFLG BIT(8),         /* ERROR FLAGS                   */ 01363000
*        4 ACBINFLG BIT(16),        /* INDICATOR FLAGS               */ 01364000
*         5 * BIT(1),               /* RESERVED FOR EXCP             */ 01365000
*         5 ACBJEPS BIT(1),         /* JEPS PROCESSING               */ 01366000
*         5 ACBIJRQE BIT(1),        /* RQE BEING HELD BY JAM         */ 01367000
*         5 ACBCAT BIT(1),          /* ACB FOR VSAM CATALOG          */ 01368000
*         5 ACBSCRA BIT(1),         /* CATALOG CONTROL BLOCK SYSTEM     01369000
*                                      AREA                  @X04SVHS*/ 01370000
*         5 ACBUCRA BIT(1),         /* CATALOG CONTROL BLOCK USER  0791 01371000
*                                      AREA                  @X04SVHS*/ 01372000
*         5 ACBVVIC BIT(1),         /* DATA SET BEING OPENED IS    0791 01373000
*                                      SYS1.VVIC             @X04SVHS*/ 01374000
*          6 ACBSDS BIT(1),         /* OPEN AS SYSTEM DATA SET     0791 01375000
*                                                            @Z40SVUC*/ 01376000
*         5 ACBBYPSS BIT(1),        /* BYPASS SECURITY ON OPEN IF  0791 01377000
*                                      USER AUTH             @Z40RSUC*/ 01378000
*         5 * BIT(8),               /* RESERVED              @Z40RSUC*/ 01379000
*        4 ACBUJFCB PTR(31),        /* USER JFCB ADDRESS             */ 01380000
*         5 ACBOPTN BIT(8),         /* JAM UCS INDICATOR             */ 01381000
*         5 * PTR(24),              /* RESERVED                      */ 01382000
*        4 ACBBUFSP FIXED(31),      /* SIZE AVAILABLE FOR BUFFERS    */ 01383000
*        4 ACBBLKSZ FIXED(15),      /* BLOCKSIZE                     */ 01384000
*         5 ACBMSGLN FIXED(15),     /* LENGTH OF MSG AREA    @X04SVHS*/ 01385000
*        4 ACBLRECL FIXED(15),      /* LOGICAL RECORD LENGTH         */ 01386000
*        4 ACBUAPTR PTR(31),        /* USER WORKAREA ADDR CAXWA    0791 01387000
*                                      ADDRESS FOR CATALOG OPEN      */ 01388000
*        4 ACBCBMWA PTR(31),        /* CBM WORK AREA ADDRESS         */ 01389000
*        4 ACBAPID PTR(31);         /* APPLICATION ID ADDRESS X03004 */ 01390000
*/* ATDSPLY   INVOKED.                                               */ 01391000
*/********************************************************************/ 01392000
*/* THE FOLLOWING ATBUILD INCLUSIONS HAVE BEEN MADE IN THIS          */ 01393000
*/* COMPILATION:                                                     */ 01394000
*/*             ISTDEVCH                                             */ 01395000
*/*             ISTLOK                                               */ 01396000
*/*             ISTRPH                                               */ 01397000
*/*             ISTPAB                                               */ 01398000
*/*             ISTNCB                                               */ 01399000
*/*             ISTLDNCB                                             */ 01400000
*/*             ISTCCW                                               */ 01401000
*/*             ISTLCCW                                              */ 01402000
*/*             ISTPROCD                                             */ 01403000
*/*             ISTFMCB                                              */ 01404000
*/*             ISTFDB                                               */ 01405000
*/*             ISTFSB                                               */ 01406000
*/*             ISTRH                                                */ 01407000
*/*             ISTSRU                                               */ 01408000
*/*             ISTTH                                                */ 01409000
*/*             ISTNIR                                               */ 01410000
*/*             ISTPIU                                               */ 01411000
*/*             ISTDYPAB                                             */ 01412000
*/*             ISTATCVT                                             */ 01413000
*/*             ISTTIE                                               */ 01414000
*/********************************************************************/ 01415000
*/* END OF ATDSPLY.                                                  */ 01416000
*                                                                  0792 01417000
*   END ISTSC02F                                                   0792 01418000
*                                                                  0792 01419000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01420000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01421000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 01422000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 01423000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 01424000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 01425000
*                                                                  0792 01426000
*       ;                                                          0792 01427000
@EL00001 DS    0H                                                  0792 01428000
@EF00001 DS    0H                                                  0792 01429000
@ER00001 L     @14,12(,@13)                                        0792 01430000
         LM    @00,@12,20(@13)                                     0792 01431000
         BR    @14                                                 0792 01432000
@DATA    DS    0H                                                       01433000
@CH01060 DC    H'30'                                                    01434000
@CH01252 DC    H'68'                                                    01435000
@CH03975 DC    H'1800'                                                  01436000
         DS    0F                                                       01437000
@PC00001 DS    2F                                                       01438000
@PC00003 DS    2F                                                       01439000
@AL00001 DS    2A                                                       01440000
@TF00001 DS    F                                                        01441000
         DS    0F                                                       01442000
@CF00036 DC    F'0'                                                     01443000
@CF00061 DC    F'1'                                                     01444000
@CF04015 DC    XL4'24'                                                  01445000
@CV03939 DC    V(ISTSC032)                                              01446000
@CV03969 DC    V(I00C1000)                                              01447000
@CV03970 DC    V(I00C1002)                                              01448000
@CV03986 DC    V(ISTSC026)                                              01449000
         DS    0D                                                       01450000
IOSBPTR  DS    A                                                        01451000
SRBPTR   DS    A                                                        01452000
FMCBPTR  DS    A                                                        01453000
S2FGATE  DC    XL4'7FFFFFFF'                                            01454000
LCCWPTR  DS    A                                                        01455000
R14SAVE  DS    F                                                        01456000
ECB      DS    F                                                        01457000
BDUPTR   DS    A                                                        01458000
BTUPTR   DS    A                                                        01459000
R2SAVE   DS    F                                                        01460000
R3SAVE   DS    F                                                        01461000
SIOTIME  DC    H'30'                                                    01462000
I        DS    FL1                                                      01463000
         DS    0D                                                       01464000
@TS00001 DS    CL8                                                      01465000
SIXTY    DC    X'060F'                                                  01466000
         DS    CL2                                                      01467000
DIOPARM  DS    CL13                                                     01468000
         ORG   DIOPARM                                                  01469000
@NM00104 DC    F'0'                                                     01470000
DIOCDS   DS    AL4                                                      01471000
DIOTECB  DS    AL4                                                      01472000
DIOOPER  DC    XL1'01'                                                  01473000
         ORG   DIOOPER                                                  01474000
@NM00105 DS    BL1                                                      01475000
DIOHIO   EQU   DIOOPER+0                                                01476000
         ORG   DIOPARM+13                                               01477000
         DS    CL3                                                      01478000
WAITIE   DS    CL16                                                     01479000
         ORG   WAITIE                                                   01480000
@NM00106 DC    X'18'                                                    01481000
@NM00107 DC    AL1(16)                                                  01482000
@NM00108 DS    FL1                                                      01483000
@NM00109 DC    AL1(4)                                                   01484000
@NM00110 DS    CL12                                                     01485000
         ORG   WAITIE+16                                                01486000
S2FREP   DC    50F'0'                                                   01487000
C02FTPQS DS    16F                                                      01488000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01489000
@01      EQU   01                                                       01490000
@02      EQU   02                                                       01491000
@03      EQU   03                                                       01492000
@04      EQU   04                                                       01493000
@05      EQU   05                                                       01494000
@06      EQU   06                                                       01495000
@07      EQU   07                                                       01496000
@08      EQU   08                                                       01497000
@09      EQU   09                                                       01498000
@10      EQU   10                                                       01499000
@11      EQU   11                                                       01500000
@12      EQU   12                                                       01501000
@13      EQU   13                                                       01502000
@14      EQU   14                                                       01503000
@15      EQU   15                                                       01504000
TIEPTR   EQU   @07                                                      01505000
CCWPTR   EQU   @04                                                      01506000
FDBPTR   EQU   @07                                                      01507000
FBDATAPT EQU   @10                                                      01508000
READPTR  EQU   @08                                                      01509000
BFRPTR   EQU   @10                                                      01510000
CDSPTR   EQU   @03                                                      01511000
TECBPTR  EQU   @11                                                      01512000
FSBPTR   EQU   @03                                                      01513000
WAIPTR   EQU   @09                                                      01514000
J        EQU   @06                                                      01515000
CVTPTR   EQU   @08                                                      01516000
WAPTR    EQU   @02                                                      01517000
R0       EQU   @00                                                      01518000
R1       EQU   @01                                                      01519000
R13      EQU   @13                                                      01520000
R14      EQU   @14                                                      01521000
R15      EQU   @15                                                      01522000
RPHPTR   EQU   @01                                                      01523000
R10      EQU   @10                                                      01524000
R11      EQU   @11                                                      01525000
R12      EQU   @12                                                      01526000
R2       EQU   @02                                                      01527000
R3       EQU   @03                                                      01528000
R4       EQU   @04                                                      01529000
R5       EQU   @05                                                      01530000
R6       EQU   @06                                                      01531000
R7       EQU   @07                                                      01532000
R8       EQU   @08                                                      01533000
R9       EQU   @09                                                      01534000
ATCLCPTR EQU   1032                                                     01535000
CVTMAP   EQU   0                                                        01536000
CVTDAR   EQU   CVTMAP+72                                                01537000
CVTFLGS1 EQU   CVTDAR                                                   01538000
CVTDCB   EQU   CVTMAP+116                                               01539000
CVTIERLC EQU   CVTMAP+144                                               01540000
CVTOPTA  EQU   CVTMAP+182                                               01541000
CVTOPTB  EQU   CVTMAP+183                                               01542000
CVTGTF   EQU   CVTMAP+236                                               01543000
CVTGTFST EQU   CVTGTF                                                   01544000
CVTGTFS  EQU   CVTGTFST                                                 01545000
CVTSTATE EQU   CVTGTFST                                                 01546000
CVTTMODE EQU   CVTGTFST                                                 01547000
CVTFORM  EQU   CVTGTFST                                                 01548000
CVTAQAVT EQU   CVTMAP+240                                               01549000
CVTTCMFG EQU   CVTAQAVT                                                 01550000
CVTVOLM2 EQU   CVTMAP+244                                               01551000
CVTTATA  EQU   CVTVOLM2                                                 01552000
CVTTSKS  EQU   CVTTATA                                                  01553000
CVTVOLF2 EQU   CVTTSKS                                                  01554000
CVTTAT   EQU   CVTTATA+1                                                01555000
CVTATER  EQU   CVTMAP+248                                               01556000
CVTEXT1  EQU   CVTMAP+252                                               01557000
CVTPURG  EQU   CVTMAP+260                                               01558000
CVTQMSG  EQU   CVTMAP+268                                               01559000
CVTDMSR  EQU   CVTMAP+272                                               01560000
CVTERPV  EQU   CVTMAP+316                                               01561000
CVTINTLA EQU   CVTMAP+320                                               01562000
CVTAPF   EQU   CVTMAP+324                                               01563000
CVTEXT2  EQU   CVTMAP+328                                               01564000
CVTHJES  EQU   CVTMAP+332                                               01565000
CVTPGSIA EQU   CVTMAP+348                                               01566000
CVTA1F1  EQU   CVTMAP+356                                               01567000
CVTSYSK  EQU   CVTMAP+357                                               01568000
CVTVOLM1 EQU   CVTMAP+380                                               01569000
CVTVOLF1 EQU   CVTVOLM1                                                 01570000
CVTATMCT EQU   CVTMAP+388                                               01571000
CVTXTNT1 EQU   0                                                        01572000
CVTXTNT2 EQU   0                                                        01573000
CVTDSSV  EQU   CVTXTNT2                                                 01574000
CVTFLGBT EQU   CVTXTNT2+5                                               01575000
CVTQID   EQU   CVTXTNT2+24                                              01576000
CVTSHS   EQU   CVTXTNT2+40                                              01577000
CVTRV400 EQU   CVTXTNT2+52                                              01578000
CVTRV409 EQU   CVTXTNT2+53                                              01579000
CVTATCVT EQU   CVTXTNT2+64                                              01580000
CVTRV429 EQU   CVTXTNT2+84                                              01581000
CVTRV438 EQU   CVTXTNT2+85                                              01582000
CVTRV457 EQU   CVTXTNT2+112                                             01583000
CVTRV466 EQU   CVTXTNT2+113                                             01584000
CVTFIX   EQU   0                                                        01585000
CVTRELNO EQU   CVTFIX+252                                               01586000
IOSB     EQU   0                                                        01587000
IOSFLA   EQU   IOSB                                                     01588000
IOSACHN  EQU   IOSFLA                                                   01589000
IOSFLB   EQU   IOSB+1                                                   01590000
IOSFLC   EQU   IOSB+2                                                   01591000
IOSDVALT EQU   IOSFLC                                                   01592000
IOSPKEY  EQU   IOSB+12                                                  01593000
IOSOPT   EQU   IOSB+14                                                  01594000
IOSOPT2  EQU   IOSB+15                                                  01595000
@NM00004 EQU   IOSB+20                                                  01596000
IOSCC    EQU   @NM00004                                                 01597000
IOSCSW   EQU   @NM00004+1                                               01598000
IOSTATUS EQU   IOSCSW+3                                                 01599000
IOSIPIB  EQU   IOSB+44                                                  01600000
IOSPATH  EQU   IOSB+86                                                  01601000
IOSCHN   EQU   IOSPATH                                                  01602000
IOSCKEY  EQU   IOSB+89                                                  01603000
IOSEEKA  EQU   IOSB+100                                                 01604000
IOSCCHH  EQU   IOSEEKA+3                                                01605000
IOSSKHH  EQU   IOSCCHH+2                                                01606000
SRBSECT  EQU   0                                                        01607000
SRB      EQU   SRBSECT                                                  01608000
SRBFLC   EQU   SRB+12                                                   01609000
LDNCBPTR EQU   0                                                        01610000
$RCAAREA EQU   0                                                        01611000
$POINTER EQU   $RCAAREA+100                                             01612000
$CVTSAVE EQU   $POINTER+4                                               01613000
$TRTBLA  EQU   $POINTER+124                                             01614000
$CONSTNT EQU   $RCAAREA+244                                             01615000
$RCAFLG  EQU   $RCAAREA+604                                             01616000
TOLTEPWA EQU   0                                                        01617000
$SCTTBLE EQU   TOLTEPWA                                                 01618000
$TESTOPT EQU   $SCTTBLE+2                                               01619000
$ERROPT  EQU   $SCTTBLE+3                                               01620000
$PDEVFLG EQU   $SCTTBLE+10                                              01621000
$CDSFLGS EQU   $SCTTBLE+11                                              01622000
$PDEVADR EQU   $SCTTBLE+12                                              01623000
$CDS8T19 EQU   $SCTTBLE+20                                              01624000
$EXECFLG EQU   $SCTTBLE+33                                              01625000
$OLTFLGS EQU   $SCTTBLE+36                                              01626000
$OLTFLG2 EQU   $SCTTBLE+37                                              01627000
$TOTFLG1 EQU   $SCTTBLE+38                                              01628000
$ROUTMSK EQU   $SCTTBLE+40                                              01629000
$CDA     EQU   TOLTEPWA+100                                             01630000
$RCA     EQU   $CDA+44                                                  01631000
$OLTPTR  EQU   $CDA+52                                                  01632000
$HIMOREC EQU   $CDA+60                                                  01633000
$COMMFLG EQU   TOLTEPWA+224                                             01634000
$FLAG1   EQU   $COMMFLG                                                 01635000
$FLAG2   EQU   $COMMFLG+1                                               01636000
$FLAG3   EQU   $COMMFLG+2                                               01637000
$FLAG4   EQU   $COMMFLG+3                                               01638000
$FLAG5   EQU   $COMMFLG+4                                               01639000
$EOJ     EQU   $FLAG5                                                   01640000
$CANCEL  EQU   $EOJ                                                     01641000
$FLAG6   EQU   $COMMFLG+5                                               01642000
$DISCREQ EQU   $FLAG6                                                   01643000
$ABNDBIT EQU   $FLAG6                                                   01644000
$FLAG7   EQU   $COMMFLG+6                                               01645000
$1STDATA EQU   $FLAG7                                                   01646000
$2NDDATA EQU   $FLAG7                                                   01647000
$FLAG8   EQU   $COMMFLG+7                                               01648000
$FLAG9   EQU   $COMMFLG+8                                               01649000
$FLAG10  EQU   $COMMFLG+9                                               01650000
$WAITFLG EQU   $FLAG10                                                  01651000
$FLAG11  EQU   $COMMFLG+10                                              01652000
$FLAG12  EQU   $COMMFLG+11                                              01653000
$FLAG13  EQU   $COMMFLG+12                                              01654000
$DEVTBLE EQU   TOLTEPWA+240                                             01655000
$DEVCDS  EQU   $DEVTBLE                                                 01656000
$DEVUNAD EQU   $DEVCDS                                                  01657000
@NM00050 EQU   $DEVUNAD+2                                               01658000
$DEVFEAT EQU   $DEVCDS+4                                                01659000
$DEVCDSF EQU   $DEVCDS+9                                                01660000
$DEVSDCF EQU   $DEVCDS+10                                               01661000
$$SYMNME EQU   $DEVCDS+12                                               01662000
$DEVFLG1 EQU   $DEVTBLE+20                                              01663000
$EVNCPLT EQU   $DEVFLG1                                                 01664000
$ATTNEXP EQU   $DEVFLG1                                                 01665000
$DEVACT  EQU   $DEVFLG1                                                 01666000
$INTOCC  EQU   $DEVFLG1                                                 01667000
$DEVFLG2 EQU   $DEVTBLE+21                                              01668000
$DATAIN  EQU   $DEVFLG2                                                 01669000
$TESTMDE EQU   $DEVFLG2                                                 01670000
$DEVTECB EQU   $DEVTBLE+22                                              01671000
$OPIS    EQU   $DEVTECB                                                 01672000
$OPND    EQU   $DEVTECB+2                                               01673000
$DEVFLG3 EQU   $DEVTBLE+27                                              01674000
$NOTDEV  EQU   $DEVFLG3                                                 01675000
$SIOFLG  EQU   $DEVFLG3                                                 01676000
$SYSMN   EQU   $DEVTBLE+28                                              01677000
$IFTOUT  EQU   $DEVTBLE+36                                              01678000
$DEVSESP EQU   $IFTOUT                                                  01679000
$SSCPDAF EQU   $IFTOUT+6                                                01680000
$LDNCBPT EQU   $DEVTBLE+48                                              01681000
$RNINFO  EQU   $DEVTBLE+56                                              01682000
$DEVFLG5 EQU   $RNINFO+8                                                01683000
$REMOTE  EQU   $DEVFLG5                                                 01684000
$DEVFLG4 EQU   $DEVTBLE+65                                              01685000
$EXIOLV3 EQU   $DEVFLG4                                                 01686000
$IGLXIFB EQU   $DEVFLG4                                                 01687000
$1STUSED EQU   $DEVFLG4                                                 01688000
$2NDUSED EQU   $DEVFLG4                                                 01689000
$REMDONE EQU   $DEVFLG4                                                 01690000
$REMWRIT EQU   $DEVFLG4                                                 01691000
$EXIOISD EQU   $DEVFLG4                                                 01692000
$WTISUED EQU   $DEVFLG4                                                 01693000
$DEVCNTS EQU   TOLTEPWA+1464                                            01694000
$WORK    EQU   TOLTEPWA+2376                                            01695000
#EXITA   EQU   TOLTEPWA+2632                                            01696000
$CCOMDAT EQU   TOLTEPWA+2644                                            01697000
$CFLGS   EQU   $CCOMDAT+16                                              01698000
$24FEMSG EQU   TOLTEPWA+2681                                            01699000
$24CATMG EQU   $24FEMSG+11                                              01700000
@NM00058 EQU   TOLTEPWA+2776                                            01701000
$OUNTPTR EQU   @NM00058+4                                               01702000
$NSPTR   EQU   $OUNTPTR                                                 01703000
$NSCNT   EQU   @NM00058+10                                              01704000
$ENXX    EQU   @NM00058+15                                              01705000
$IMITX   EQU   $ENXX                                                    01706000
$WIODEV  EQU   TOLTEPWA+2814                                            01707000
$WAITIME EQU   TOLTEPWA+2816                                            01708000
$1STBFR1 EQU   TOLTEPWA+2824                                            01709000
$OLTCCW1 EQU   TOLTEPWA+2832                                            01710000
$RESID1  EQU   TOLTEPWA+2836                                            01711000
$BUFSZ1  EQU   TOLTEPWA+2840                                            01712000
$1STBFR2 EQU   TOLTEPWA+2848                                            01713000
$OLTCCW2 EQU   TOLTEPWA+2856                                            01714000
$RESID2  EQU   TOLTEPWA+2860                                            01715000
$BUFSZ2  EQU   TOLTEPWA+2864                                            01716000
$CEINT1  EQU   TOLTEPWA+2964                                            01717000
SVESC033 EQU   TOLTEPWA+3160                                            01718000
SVECC013 EQU   TOLTEPWA+3232                                            01719000
SVEIC003 EQU   TOLTEPWA+3592                                            01720000
SVESC022 EQU   TOLTEPWA+3736                                            01721000
SVECC011 EQU   TOLTEPWA+4024                                            01722000
TECBMAPS EQU   0                                                        01723000
TECBFDCT EQU   TECBMAPS                                                 01724000
TECBFDLN EQU   TECBMAPS+1                                               01725000
TECBSNLN EQU   TECBMAPS+2                                               01726000
TECBFLGS EQU   TECBMAPS+4                                               01727000
TECBSNOC EQU   TECBMAPS+6                                               01728000
TECBEVOC EQU   TECBMAPS+7                                               01729000
TECBEVT1 EQU   TECBMAPS+8                                               01730000
TECBFD01 EQU   0                                                        01731000
@NM00062 EQU   TECBFD01+4                                               01732000
TCBEVCSW EQU   @NM00062                                                 01733000
TECBSNS1 EQU   0                                                        01734000
TCBSENSE EQU   TECBSNS1+3                                               01735000
TECBSEND EQU   0                                                        01736000
TCBRESP  EQU   TECBSEND+4                                               01737000
TCBRTYPE EQU   TECBSEND+7                                               01738000
TCBRKCHG EQU   TECBSEND+8                                               01739000
WTIOMAP  EQU   0                                                        01740000
$WIOTECB EQU   WTIOMAP+4                                                01741000
$WIOCDS  EQU   WTIOMAP+8                                                01742000
$WIOFLAG EQU   WTIOMAP+12                                               01743000
$WIOYES  EQU   $WIOFLAG                                                 01744000
$WIOPOLL EQU   $WIOFLAG                                                 01745000
$WIOPURG EQU   $WIOFLAG                                                 01746000
$WIODE   EQU   $WIOFLAG                                                 01747000
$WIOANY  EQU   $WIOFLAG                                                 01748000
$WIOTIME EQU   WTIOMAP+13                                               01749000
CDSMAP   EQU   0                                                        01750000
CDSUA    EQU   CDSMAP                                                   01751000
CDSMFCT  EQU   CDSMAP+4                                                 01752000
CDSFEAT  EQU   CDSMFCT+1                                                01753000
CDSFLAG  EQU   CDSMAP+9                                                 01754000
CDSSYMB  EQU   CDSFLAG                                                  01755000
CDSSYMBN EQU   CDSMAP+12                                                01756000
ISTDEVCH EQU   0                                                        01757000
DEVSHCH  EQU   ISTDEVCH                                                 01758000
DEVCHAR  EQU   DEVSHCH                                                  01759000
DEVTCODE EQU   ISTDEVCH+1                                               01760000
DEVFLAGS EQU   ISTDEVCH+3                                               01761000
DEVFCCTL EQU   DEVFLAGS                                                 01762000
DEVCHAR3 EQU   DEVFLAGS                                                 01763000
ISTLOK   EQU   0                                                        01764000
LOKCHN   EQU   ISTLOK+1                                                 01765000
LOKCHNG  EQU   LOKCHN                                                   01766000
@NM00071 EQU   LOKCHNG+2                                                01767000
ISTRPH   EQU   0                                                        01768000
RPHFLAGS EQU   ISTRPH+2                                                 01769000
RPHAPTYP EQU   RPHFLAGS                                                 01770000
RPHFSTLC EQU   RPHFLAGS                                                 01771000
RPHFLGB  EQU   ISTRPH+3                                                 01772000
RPHRPHA  EQU   ISTRPH+4                                                 01773000
RPHTSKID EQU   ISTRPH+8                                                 01774000
RPHRESMA EQU   ISTRPH+16                                                01775000
RPHWPFLG EQU   RPHRESMA                                                 01776000
RPHWEA   EQU   ISTRPH+24                                                01777000
RPHCSPA  EQU   RPHWEA                                                   01778000
RPHSRPRM EQU   ISTRPH+28                                                01779000
RPHPABQA EQU   ISTRPH+36                                                01780000
RPHWORK  EQU   ISTRPH+40                                                01781000
RPHSAVE1 EQU   RPHWORK                                                  01782000
RPHSBITS EQU   RPHSAVE1+1                                               01783000
ISTPAB   EQU   0                                                        01784000
PABWQCHN EQU   ISTPAB                                                   01785000
PABWEQA  EQU   PABWQCHN                                                 01786000
PABCHAIN EQU   PABWQCHN+4                                               01787000
PABRPHFG EQU   ISTPAB+12                                                01788000
PABFLAGS EQU   PABRPHFG                                                 01789000
PABERLCK EQU   PABFLAGS                                                 01790000
PABERRLK EQU   PABERLCK                                                 01791000
ISTNCB   EQU   0                                                        01792000
NCBFLAGS EQU   ISTNCB+24                                                01793000
NCBFRAS  EQU   NCBFLAGS+1                                               01794000
NCBFTRIO EQU   NCBFRAS                                                  01795000
NCBFLAG1 EQU   NCBFLAGS+2                                               01796000
ISTLDNCB EQU   0                                                        01797000
LDNCFLAG EQU   ISTLDNCB+54                                              01798000
LDNFLAGS EQU   ISTLDNCB+107                                             01799000
LDNFLAG2 EQU   ISTLDNCB+110                                             01800000
LDNZIOLK EQU   ISTLDNCB+184                                             01801000
LDNZERPF EQU   ISTLDNCB+185                                             01802000
LDNZCPAN EQU   LDNZERPF                                                 01803000
LDNZEPIN EQU   LDNZERPF                                                 01804000
LDNZLPC  EQU   ISTLDNCB+186                                             01805000
LDNDCDEB EQU   ISTLDNCB+304                                             01806000
LDNZSAV3 EQU   ISTLDNCB+376                                             01807000
LDNZSAV4 EQU   LDNZSAV3+8                                               01808000
LDNIOSB  EQU   ISTLDNCB+412                                             01809000
LDNZH003 EQU   ISTLDNCB+577                                             01810000
ISTCCW   EQU   0                                                        01811000
CCWVADDR EQU   ISTCCW                                                   01812000
CCWADDR  EQU   CCWVADDR+1                                               01813000
CCWFLAGS EQU   ISTCCW+4                                                 01814000
CCWSPARE EQU   ISTCCW+5                                                 01815000
CCWCOUNT EQU   ISTCCW+6                                                 01816000
ISTLCCW  EQU   0                                                        01817000
LCCWOP   EQU   ISTLCCW                                                  01818000
LCCWRWOP EQU   LCCWOP                                                   01819000
LCCWCTL  EQU   LCCWRWOP                                                 01820000
LCCWFLAG EQU   ISTLCCW+1                                                01821000
LCCWLSI  EQU   LCCWFLAG                                                 01822000
ISTPROCD EQU   0                                                        01823000
PROPROC  EQU   ISTPROCD                                                 01824000
PROPROC1 EQU   PROPROC                                                  01825000
PROPROC2 EQU   PROPROC+1                                                01826000
PROPROC3 EQU   PROPROC+2                                                01827000
PROPROC4 EQU   PROPROC+3                                                01828000
PROPROCS EQU   0                                                        01829000
PROSETMS EQU   PROPROCS+1                                               01830000
PROSETM2 EQU   PROSETMS                                                 01831000
PROSETM3 EQU   PROSETMS+1                                               01832000
PROSETM4 EQU   PROSETMS+2                                               01833000
ISTFMCB  EQU   0                                                        01834000
FMCSTAT  EQU   ISTFMCB+28                                               01835000
FMCSTAT1 EQU   ISTFMCB+29                                               01836000
FMCCMDFL EQU   ISTFMCB+31                                               01837000
FMCCMPS1 EQU   ISTFMCB+36                                               01838000
FMCSIPA  EQU   ISTFMCB+148                                              01839000
FMCNXOSQ EQU   ISTFMCB+152                                              01840000
FMCNXCFM EQU   FMCNXOSQ                                                 01841000
FMCNXOSC EQU   FMCNXOSQ+2                                               01842000
FMCSSTAT EQU   ISTFMCB+159                                              01843000
FMCPACE  EQU   ISTFMCB+160                                              01844000
FMCPACEN EQU   FMCPACE                                                  01845000
FMCPACEM EQU   FMCPACE+1                                                01846000
FMCPACPC EQU   FMCPACE+2                                                01847000
FMCCVAL  EQU   FMCPACE+3                                                01848000
FMCOBCE  EQU   FMCCVAL                                                  01849000
FMCCLEXT EQU   ISTFMCB+164                                              01850000
FMCRPLA  EQU   FMCCLEXT                                                 01851000
FMCFBA   EQU   FMCCLEXT+4                                               01852000
FMCCMPS2 EQU   FMCCLEXT+16                                              01853000
FMCFLGA  EQU   FMCCMPS2                                                 01854000
FMCFLGCL EQU   FMCCMPS2+1                                               01855000
FMCPSCMD EQU   FMCCMPS2+2                                               01856000
FMCPSTAT EQU   FMCCMPS2+3                                               01857000
FMCSTAT2 EQU   ISTFMCB+186                                              01858000
FMCMODEB EQU   ISTFMCB+189                                              01859000
FMCCLSEQ EQU   ISTFMCB+190                                              01860000
FMCRRESP EQU   ISTFMCB+195                                              01861000
FMCSSEGQ EQU   ISTFMCB+200                                              01862000
FMCFBAS  EQU   ISTFMCB+216                                              01863000
FMCZV002 EQU   FMCFBAS                                                  01864000
FMCSNCTL EQU   ISTFMCB+224                                              01865000
FMCSCFLG EQU   FMCSNCTL                                                 01866000
FMCVS1   EQU   ISTFMCB+232                                              01867000
FMCZFLAG EQU   FMCVS1                                                   01868000
FMCZF006 EQU   FMCZFLAG                                                 01869000
FMCLBXM  EQU   FMCVS1+12                                                01870000
FMCSHEAQ EQU   FMCLBXM                                                  01871000
FMCLCPBQ EQU   FMCVS1+16                                                01872000
FMCLCPAQ EQU   FMCVS1+20                                                01873000
FMCSEQ1  EQU   FMCVS1+34                                                01874000
FMCZFLG2 EQU   FMCVS1+35                                                01875000
FMCCVFLG EQU   FMCVS1+44                                                01876000
FMCFLAG  EQU   0                                                        01877000
FMCFLGB  EQU   FMCFLAG                                                  01878000
ISTFDB   EQU   0                                                        01879000
FDBFDBA  EQU   ISTFDB                                                   01880000
FDBDATAA EQU   ISTFDB+4                                                 01881000
FDBDATCT EQU   ISTFDB+8                                                 01882000
ISTFSB   EQU   0                                                        01883000
FSBFSB   EQU   ISTFSB                                                   01884000
FSBMNRCD EQU   FSBFSB+2                                                 01885000
FSBSFLGS EQU   FSBFSB+3                                                 01886000
FSBFSBA  EQU   FSBFSB+4                                                 01887000
FSBBTH   EQU   FSBFSB+8                                                 01888000
FSBCID   EQU   FSBBTH                                                   01889000
FSBSAF   EQU   FSBCID                                                   01890000
FSBDAF   EQU   FSBCID+2                                                 01891000
FSBRQTAG EQU   FSBBTH+4                                                 01892000
FSBSEQID EQU   FSBRQTAG                                                 01893000
FSBFLAGS EQU   FSBSEQID                                                 01894000
FSBSEQ   EQU   FSBSEQID+1                                               01895000
FSBCSWST EQU   FSBBTH+6                                                 01896000
FSBTHFLD EQU   FSBCSWST                                                 01897000
FSBTH1   EQU   FSBTHFLD                                                 01898000
FSBSYSRS EQU   FSBTH1                                                   01899000
FSBTH2   EQU   FSBTHFLD+1                                               01900000
FSBEXTRS EQU   FSBTH2                                                   01901000
FSBXFSTS EQU   FSBEXTRS                                                 01902000
FSBXCODE EQU   FSBEXTRS                                                 01903000
FSBNETRS EQU   FSBFSB+16                                                01904000
FSBSRCAT EQU   FSBNETRS                                                 01905000
FSBERC   EQU   FSBNETRS+1                                               01906000
FSBFBMI  EQU   FSBERC                                                   01907000
FSBDMGRS EQU   FSBFSB+18                                                01908000
FSBSS1   EQU   FSBDMGRS                                                 01909000
FSBSS2   EQU   FSBDMGRS+1                                               01910000
FSBLCPB  EQU   FSBFSB+20                                                01911000
FSBMSGID EQU   FSBLCPB                                                  01912000
FSBLCCWA EQU   FSBFSB+24                                                01913000
FSBRLSTS EQU   FSBLCCWA                                                 01914000
FSBTHCNT EQU   FSBFSB+28                                                01915000
FSBFDB   EQU   ISTFSB+32                                                01916000
ISTRH    EQU   0                                                        01917000
RHFLAGS  EQU   ISTRH                                                    01918000
RH1      EQU   RHFLAGS                                                  01919000
RH2      EQU   RHFLAGS+1                                                01920000
RHRETRY  EQU   RH2                                                      01921000
RHRSVD1  EQU   RH2                                                      01922000
RH3      EQU   RHFLAGS+2                                                01923000
ISTSRU   EQU   0                                                        01924000
SRUTYPE  EQU   ISTSRU+1                                                 01925000
SRULDID  EQU   ISTSRU+2                                                 01926000
SRUSPSN  EQU   SRULDID                                                  01927000
ISTTH    EQU   0                                                        01928000
THFLAG1  EQU   ISTTH                                                    01929000
THFLGA   EQU   THFLAG1                                                  01930000
THMPF    EQU   THFLGA                                                   01931000
THFLGB   EQU   THFLAG1+1                                                01932000
THDAF    EQU   ISTTH+2                                                  01933000
THOAF    EQU   ISTTH+4                                                  01934000
THSNF    EQU   ISTTH+6                                                  01935000
THDCF    EQU   ISTTH+8                                                  01936000
ISTTH2   EQU   0                                                        01937000
TH2FLAG1 EQU   ISTTH2                                                   01938000
TH2MPF   EQU   TH2FLAG1                                                 01939000
ISTNIR   EQU   0                                                        01940000
NIRRH    EQU   ISTNIR                                                   01941000
NIRRU    EQU   ISTNIR+3                                                 01942000
ISTPIU   EQU   0                                                        01943000
PIUTH    EQU   ISTPIU                                                   01944000
PIUNIR   EQU   ISTPIU+10                                                01945000
ISTRUB   EQU   0                                                        01946000
ISTDYPAB EQU   0                                                        01947000
DYPPAB   EQU   ISTDYPAB+16                                              01948000
ISTATCVT EQU   0                                                        01949000
ATCCOM   EQU   ISTATCVT                                                 01950000
ATCSTAT  EQU   ATCCOM                                                   01951000
ATCSTAT1 EQU   ATCSTAT                                                  01952000
ATCSTFLG EQU   ATCSTAT+1                                                01953000
ATCPOFLG EQU   ATCSTAT+2                                                01954000
ATCSTAT4 EQU   ATCSTAT+3                                                01955000
ATCIOTRC EQU   ATCCOM+140                                               01956000
ATCTHTRC EQU   ATCIOTRC                                                 01957000
ATCCSMR  EQU   ISTATCVT+296                                             01958000
ATCSHRFG EQU   ISTATCVT+316                                             01959000
ATCHPGM  EQU   ISTATCVT+384                                             01960000
ATCTCIPB EQU   ISTATCVT+624                                             01961000
ATCVLCNT EQU   ISTATCVT+772                                             01962000
ATCRNO   EQU   ISTATCVT+788                                             01963000
ATCSOPD  EQU   ISTATCVT+792                                             01964000
ATCSIPD  EQU   ISTATCVT+800                                             01965000
ATCSECST EQU   ISTATCVT+812                                             01966000
ATCAOSM  EQU   ISTATCVT+912                                             01967000
ATCGSRBQ EQU   ATCAOSM+4                                                01968000
ATCGSRBG EQU   ATCGSRBQ                                                 01969000
ATCICAPP EQU   ATCAOSM+100                                              01970000
ATCLDAPP EQU   ATCAOSM+120                                              01971000
ATCDAPVT EQU   ATCAOSM+140                                              01972000
ATCVTFLG EQU   ATCAOSM+392                                              01973000
ATCZFLAG EQU   ATCAOSM+588                                              01974000
ISTTIE   EQU   0                                                        01975000
TIETIEA  EQU   ISTTIE+4                                                 01976000
TIESNA   EQU   ISTTIE+8                                                 01977000
TIEPTR1  EQU   TIESNA                                                   01978000
TIERPHA  EQU   ISTTIE+12                                                01979000
TIEPTR2  EQU   TIERPHA                                                  01980000
IFGRPL   EQU   0                                                        01981000
RPLCOMN  EQU   IFGRPL                                                   01982000
RPLIDWD  EQU   RPLCOMN                                                  01983000
RPLLEN   EQU   RPLIDWD+3                                                01984000
RPLECB   EQU   RPLCOMN+8                                                01985000
RPLFDBWD EQU   RPLCOMN+12                                               01986000
RPLFDBK  EQU   RPLFDBWD+1                                               01987000
RPLRTNCD EQU   RPLFDBK                                                  01988000
RPLCNDCD EQU   RPLFDBK+1                                                01989000
RPLCMPON EQU   RPLCNDCD                                                 01990000
RPLFDB2  EQU   RPLCMPON                                                 01991000
RPLERRCD EQU   RPLCNDCD+1                                               01992000
RPLFDB3  EQU   RPLERRCD                                                 01993000
RPLKEYLE EQU   RPLCOMN+16                                               01994000
RPLARG   EQU   RPLCOMN+36                                               01995000
RPLOPTCD EQU   RPLCOMN+40                                               01996000
RPLOPT1  EQU   RPLOPTCD                                                 01997000
RPLECBSW EQU   RPLOPT1                                                  01998000
RPLOPT2  EQU   RPLOPTCD+1                                               01999000
RPLADR   EQU   RPLOPT2                                                  02000000
RPLOPT3  EQU   RPLOPTCD+2                                               02001000
RPLOPT4  EQU   RPLOPTCD+3                                               02002000
RPLNXTRP EQU   RPLCOMN+44                                               02003000
RPLOPTC2 EQU   RPLCOMN+56                                               02004000
RPLOPT5  EQU   RPLOPTC2                                                 02005000
RPLWRTYP EQU   RPLOPT5                                                  02006000
RPLOPT6  EQU   RPLOPTC2+1                                               02007000
RPLUNTYP EQU   RPLOPT6                                                  02008000
RPLOPT7  EQU   RPLOPTC2+2                                               02009000
RPLCNOPT EQU   RPLOPT7                                                  02010000
RPLOPT8  EQU   RPLOPTC2+3                                               02011000
RPLRBAR  EQU   RPLCOMN+60                                               02012000
RPLAIXID EQU   RPLRBAR+2                                                02013000
RPLEXTDS EQU   RPLCOMN+68                                               02014000
RPLEXTD1 EQU   RPLEXTDS                                                 02015000
BACKSAVE EQU   0                                                        02016000
OLTBUFR  EQU   0                                                        02017000
FBDATA   EQU   0                                                        02018000
@NM00113 EQU   0                                                        02019000
BUFCHAIN EQU   @NM00113                                                 02020000
BUFWAPTR EQU   @NM00113+4                                               02021000
BUFJ     EQU   @NM00113+8                                               02022000
IFGACB   EQU   0                                                        02023000
ACBCOMN  EQU   IFGACB                                                   02024000
ACBLENG  EQU   ACBCOMN+2                                                02025000
ACBLENG2 EQU   ACBLENG                                                  02026000
ACBAMBL  EQU   ACBCOMN+4                                                02027000
ACBJWA   EQU   ACBAMBL                                                  02028000
ACBMACRF EQU   ACBCOMN+12                                               02029000
ACBMACR1 EQU   ACBMACRF                                                 02030000
ACBADR   EQU   ACBMACR1                                                 02031000
ACBCNV   EQU   ACBMACR1                                                 02032000
ACBMACR2 EQU   ACBMACRF+1                                               02033000
ACBBUFPL EQU   ACBCOMN+20                                               02034000
ACBMACR3 EQU   ACBBUFPL                                                 02035000
ACBRECFM EQU   ACBCOMN+24                                               02036000
ACBCCTYP EQU   ACBCOMN+25                                               02037000
ACBOPT   EQU   ACBCOMN+26                                               02038000
ACBDSORG EQU   ACBOPT                                                   02039000
ACBCROPS EQU   ACBDSORG                                                 02040000
ACBDVIND EQU   ACBDSORG                                                 02041000
ACBEXLST EQU   ACBCOMN+36                                               02042000
ACBDDNM  EQU   ACBCOMN+40                                               02043000
ACBAMETH EQU   ACBDDNM+3                                                02044000
ACBOFLGS EQU   ACBCOMN+48                                               02045000
ACBEXFG  EQU   ACBOFLGS                                                 02046000
ACBIOSFG EQU   ACBOFLGS                                                 02047000
ACBINFLG EQU   ACBCOMN+50                                               02048000
ACBVVIC  EQU   ACBINFLG                                                 02049000
ACBUJFCB EQU   ACBCOMN+52                                               02050000
ACBBLKSZ EQU   ACBCOMN+60                                               02051000
$TRTBL   EQU   0                                                        02052000
#EXIT    EQU   0                                                        02053000
IN       EQU   0                                                        02054000
OUT      EQU   0                                                        02055000
STTIME   EQU   0                                                        02056000
OUTTIME  EQU   0                                                        02057000
CVTS01   EQU   CVTPGSIA                                                 02058000
CVTLPDIA EQU   CVTS01+12                                                02059000
CVTDIRST EQU   CVTLPDIA                                                 02060000
CVTSLIDA EQU   CVTS01+24                                                02061000
CVTCTLFG EQU   CVTS01+50                                                02062000
CVTRV210 EQU   CVTS01+424                                               02063000
CVTRV219 EQU   CVTS01+425                                               02064000
CVTRV228 EQU   CVTS01+426                                               02065000
CVTRV237 EQU   CVTS01+427                                               02066000
CVTMFRTR EQU   CVTS01+452                                               02067000
CVTRV262 EQU   CVTS01+468                                               02068000
CVTRV271 EQU   CVTS01+469                                               02069000
CVTRV280 EQU   CVTS01+470                                               02070000
CVTRV289 EQU   CVTS01+471                                               02071000
CVTGSDA  EQU   CVTS01+600                                               02072000
IOSATTSC EQU   IOSIPIB                                                  02073000
IOSWTOWA EQU   IOSIPIB                                                  02074000
IOSPCISC EQU   IOSIPIB                                                  02075000
RCAPTR   EQU   $RCA                                                     02076000
SVESC02F EQU   SVECC013                                                 02077000
FSBCOMBN EQU   FSBNETRS                                                 02078000
FSBRHFLD EQU   FSBCOMBN+1                                               02079000
FSBRH3   EQU   FSBRHFLD+2                                               02080000
FSBLDFLG EQU   FSBRH3                                                   02081000
@NM00091 EQU   FSBRQTAG                                                 02082000
SRUSENSE EQU   ISTSRU                                                   02083000
SRURMS   EQU   ISTSRU                                                   02084000
SRUZIB   EQU   ISTSRU                                                   02085000
SRUNETS  EQU   SRUZIB                                                   02086000
ISTUNBRU EQU   SRUTYPE                                                  02087000
ISTMRU   EQU   ISTRUB                                                   02088000
MRURESP  EQU   ISTMRU+7                                                 02089000
MRUSYSRS EQU   MRURESP                                                  02090000
@NM00111 EQU   $WORK                                                    02091000
READSIZE EQU   @NM00111                                                 02092000
WAITIME  EQU   @NM00111+2                                               02093000
TEMPSIZE EQU   @NM00111+4                                               02094000
TEMPTR   EQU   @NM00111+8                                               02095000
TEMPTIME EQU   @NM00111+16                                              02096000
TEMPSEC  EQU   @NM00111+22                                              02097000
TEMPMIN  EQU   TEMPSEC                                                  02098000
TEMPHR   EQU   TEMPMIN                                                  02099000
CETIME   EQU   @NM00111+24                                              02100000
DTIME    EQU   @NM00111+28                                              02101000
ENDTIME  EQU   OUTTIME                                                  02102000
TIME     EQU   STTIME                                                   02103000
SVECC012 EQU   SVESC022                                                 02104000
SVEIC00A EQU   SVEIC003                                                 02105000
SVEIC004 EQU   SVEIC003                                                 02106000
SVEIC005 EQU   SVEIC003                                                 02107000
SVESC02A EQU   SVESC022                                                 02108000
SVESC02B EQU   SVESC022                                                 02109000
SVESC02D EQU   SVESC022                                                 02110000
SVESC02E EQU   SVESC022                                                 02111000
SVESC024 EQU   SVESC022                                                 02112000
SVESC027 EQU   SVESC022                                                 02113000
SVESC029 EQU   SVESC033                                                 02114000
SVESC031 EQU   SVECC013                                                 02115000
SVESC032 EQU   SVECC011                                                 02116000
SVETC037 EQU   SVEIC003                                                 02117000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02118000
@NM00112 EQU   @NM00111+26                                              02119000
TEMPFMCB EQU   @NM00111+12                                              02120000
MRUDATA  EQU   ISTMRU+9                                                 02121000
MRUEXTRS EQU   MRURESP+1                                                02122000
MRUSPHSE EQU   MRUSYSRS                                                 02123000
MRUSERR  EQU   MRUSYSRS                                                 02124000
MRUMODIF EQU   ISTMRU+6                                                 02125000
MRUCMND  EQU   ISTMRU+5                                                 02126000
MRUDAF   EQU   ISTMRU+3                                                 02127000
MRUREQ   EQU   ISTMRU+2                                                 02128000
MRUPREF  EQU   ISTMRU                                                   02129000
UNBTYPE  EQU   ISTUNBRU                                                 02130000
SRUNAF   EQU   SRUZIB+3                                                 02131000
SRUNSREQ EQU   SRUNETS+2                                                02132000
SRUNSUBC EQU   SRUNETS+1                                                02133000
SRUNSCAT EQU   SRUNETS                                                  02134000
SRUREQRE EQU   SRURMS+2                                                 02135000
SRUPFX2  EQU   SRURMS+1                                                 02136000
SRUPFX1  EQU   SRURMS                                                   02137000
SRUSENS2 EQU   SRUSENSE+2                                               02138000
SRUSNS2  EQU   SRUSENSE+1                                               02139000
SRUSNS1  EQU   SRUSENSE                                                 02140000
FSBRT0B  EQU   @NM00091+1                                               02141000
FSBRT0A  EQU   @NM00091+1                                               02142000
FSBRT09  EQU   @NM00091+1                                               02143000
FSBRT08  EQU   @NM00091+1                                               02144000
FSBRT07  EQU   @NM00091                                                 02145000
FSBRT06  EQU   @NM00091                                                 02146000
FSBRT05  EQU   @NM00091                                                 02147000
FSBRT04  EQU   @NM00091                                                 02148000
FSBRT03  EQU   @NM00091                                                 02149000
FSBRT02  EQU   @NM00091                                                 02150000
FSBRT01  EQU   @NM00091                                                 02151000
FSBRT00  EQU   @NM00091                                                 02152000
FSBLDCUF EQU   FSBLDFLG                                                 02153000
FSBLDSIF EQU   FSBLDFLG                                                 02154000
FSBLDSOF EQU   FSBLDFLG                                                 02155000
FSBLDEBF EQU   FSBLDFLG                                                 02156000
FSBLDBBF EQU   FSBLDFLG                                                 02157000
FSBLDFME EQU   FSBLDFLG                                                 02158000
FSBLDSCF EQU   FSBLDFLG                                                 02159000
FSBLDRMF EQU   FSBLDFLG                                                 02160000
FSBRH2   EQU   FSBRHFLD+1                                               02161000
FSBRH1   EQU   FSBRHFLD                                                 02162000
FSBALIGN EQU   FSBCOMBN                                                 02163000
IOSPCIWA EQU   IOSPCISC+44                                              02164000
IOSPCIRS EQU   IOSPCISC+8                                               02165000
@NM00009 EQU   IOSPCISC+4                                               02166000
@NM00008 EQU   IOSPCISC                                                 02167000
IOSWRNDR EQU   IOSWTOWA+4                                               02168000
IOSWTOPT EQU   IOSWTOWA+3                                               02169000
IOSWTOCP EQU   IOSWTOWA+2                                               02170000
IOSWTOCH EQU   IOSWTOWA                                                 02171000
IOSATTWA EQU   IOSATTSC+40                                              02172000
@NM00007 EQU   IOSATTSC+24                                              02173000
IOSATTSN EQU   IOSATTSC                                                 02174000
CVTRV628 EQU   CVTS01+728                                               02175000
CVTRV627 EQU   CVTS01+724                                               02176000
CVTRV626 EQU   CVTS01+720                                               02177000
CVTRV625 EQU   CVTS01+716                                               02178000
CVTRV624 EQU   CVTS01+712                                               02179000
CVTRV623 EQU   CVTS01+708                                               02180000
CVTRV622 EQU   CVTS01+704                                               02181000
CVTRV621 EQU   CVTS01+700                                               02182000
CVTRV620 EQU   CVTS01+696                                               02183000
CVTRV619 EQU   CVTS01+692                                               02184000
CVTRV618 EQU   CVTS01+688                                               02185000
CVTRV617 EQU   CVTS01+684                                               02186000
CVTRV616 EQU   CVTS01+680                                               02187000
CVTRV615 EQU   CVTS01+676                                               02188000
CVTRV614 EQU   CVTS01+672                                               02189000
CVTRV613 EQU   CVTS01+668                                               02190000
CVTTCASP EQU   CVTS01+664                                               02191000
CVT0PT03 EQU   CVTS01+660                                               02192000
CVT0PT0E EQU   CVTS01+656                                               02193000
CVTIRM   EQU   CVTS01+652                                               02194000
CVTCGK   EQU   CVTS01+648                                               02195000
CVTRV607 EQU   CVTS01+644                                               02196000
CVTRV606 EQU   CVTS01+640                                               02197000
CVTRV605 EQU   CVTS01+636                                               02198000
CVTRV604 EQU   CVTS01+632                                               02199000
CVTEFF02 EQU   CVTS01+628                                               02200000
CVTCBBR  EQU   CVTS01+624                                               02201000
CVTSSCR  EQU   CVTS01+620                                               02202000
CVTEVENT EQU   CVTS01+616                                               02203000
CVTCRCA  EQU   CVTS01+612                                               02204000
CVTTPIO  EQU   CVTS01+608                                               02205000
CVTADV   EQU   CVTS01+604                                               02206000
CVTGSDAB EQU   CVTGSDA                                                  02207000
CVTQV3   EQU   CVTS01+596                                               02208000
CVTQV2   EQU   CVTS01+592                                               02209000
CVTQV1   EQU   CVTS01+588                                               02210000
CVTRPT   EQU   CVTS01+584                                               02211000
CVTSSRB  EQU   CVTS01+580                                               02212000
CVTCSDRL EQU   CVTS01+576                                               02213000
CVTEXP1  EQU   CVTS01+572                                               02214000
CVTRMPMT EQU   CVTS01+568                                               02215000
CVTRMPTT EQU   CVTS01+564                                               02216000
CVTVPSA  EQU   CVTS01+560                                               02217000
CVTVSTOP EQU   CVTS01+556                                               02218000
CVTGTFR8 EQU   CVTS01+552                                               02219000
CVTQUIT  EQU   CVTS01+548                                               02220000
CVTVACR  EQU   CVTS01+544                                               02221000
CVTWTCB  EQU   CVTS01+540                                               02222000
CVTSTPRS EQU   CVTS01+536                                               02223000
CVT0PT02 EQU   CVTS01+532                                               02224000
CVTDARCM EQU   CVTS01+528                                               02225000
CVTIRECM EQU   CVTS01+524                                               02226000
CVTJRECM EQU   CVTS01+520                                               02227000
CVTVEMS0 EQU   CVTS01+516                                               02228000
CVTSPFRR EQU   CVTS01+512                                               02229000
CVTRLSTG EQU   CVTS01+508                                               02230000
CVT0TC0A EQU   CVTS01+504                                               02231000
CVTGMBR  EQU   CVTS01+500                                               02232000
CVTLFRM  EQU   CVTS01+496                                               02233000
CVTRMBR  EQU   CVTS01+492                                               02234000
CVTVIOP  EQU   CVTS01+488                                               02235000
CVTRV307 EQU   CVTS01+486                                               02236000
CVTRV306 EQU   CVTS01+484                                               02237000
CVTRV305 EQU   CVTS01+482                                               02238000
CVTRV304 EQU   CVTS01+480                                               02239000
CVTRV303 EQU   CVTS01+478                                               02240000
CVTRV302 EQU   CVTS01+476                                               02241000
CVTTRCA  EQU   CVTS01+472                                               02242000
CVTRV297 EQU   CVTRV289                                                 02243000
CVTRV296 EQU   CVTRV289                                                 02244000
CVTRV295 EQU   CVTRV289                                                 02245000
CVTRV294 EQU   CVTRV289                                                 02246000
CVTRV293 EQU   CVTRV289                                                 02247000
CVTRV292 EQU   CVTRV289                                                 02248000
CVTRV291 EQU   CVTRV289                                                 02249000
CVTRV290 EQU   CVTRV289                                                 02250000
CVTRV288 EQU   CVTRV280                                                 02251000
CVTRV287 EQU   CVTRV280                                                 02252000
CVTRV286 EQU   CVTRV280                                                 02253000
CVTRV285 EQU   CVTRV280                                                 02254000
CVTRV284 EQU   CVTRV280                                                 02255000
CVTRV283 EQU   CVTRV280                                                 02256000
CVTRV282 EQU   CVTRV280                                                 02257000
CVTRV281 EQU   CVTRV280                                                 02258000
CVTRV279 EQU   CVTRV271                                                 02259000
CVTRV278 EQU   CVTRV271                                                 02260000
CVTRV277 EQU   CVTRV271                                                 02261000
CVTRV276 EQU   CVTRV271                                                 02262000
CVTRV275 EQU   CVTRV271                                                 02263000
CVTRV274 EQU   CVTRV271                                                 02264000
CVTRV273 EQU   CVTRV271                                                 02265000
CVTRV272 EQU   CVTRV271                                                 02266000
CVTRV270 EQU   CVTRV262                                                 02267000
CVTRV269 EQU   CVTRV262                                                 02268000
CVTRV268 EQU   CVTRV262                                                 02269000
CVTRV267 EQU   CVTRV262                                                 02270000
CVTRV266 EQU   CVTRV262                                                 02271000
CVTRV265 EQU   CVTRV262                                                 02272000
CVTRV264 EQU   CVTRV262                                                 02273000
CVTRV263 EQU   CVTRV262                                                 02274000
CVTVFP   EQU   CVTS01+464                                               02275000
CVTVSI   EQU   CVTS01+460                                               02276000
CVTVPSIB EQU   CVTS01+456                                               02277000
CVTMFACT EQU   CVTMFRTR                                                 02278000
CVTMFCTL EQU   CVTS01+448                                               02279000
CVTPVBP  EQU   CVTS01+444                                               02280000
CVTPWI   EQU   CVTS01+440                                               02281000
CVTRV254 EQU   CVTS01+438                                               02282000
CVTRV253 EQU   CVTS01+436                                               02283000
CVTRV252 EQU   CVTS01+434                                               02284000
CVTRV251 EQU   CVTS01+433                                               02285000
CVTRV250 EQU   CVTS01+432                                               02286000
CVTRV249 EQU   CVTS01+431                                               02287000
CVTRV248 EQU   CVTS01+430                                               02288000
CVTRV247 EQU   CVTS01+429                                               02289000
CVTRV246 EQU   CVTS01+428                                               02290000
CVTRV245 EQU   CVTRV237                                                 02291000
CVTRV244 EQU   CVTRV237                                                 02292000
CVTRV243 EQU   CVTRV237                                                 02293000
CVTRV242 EQU   CVTRV237                                                 02294000
CVTRV241 EQU   CVTRV237                                                 02295000
CVTRV240 EQU   CVTRV237                                                 02296000
CVTRV239 EQU   CVTRV237                                                 02297000
CVTRV238 EQU   CVTRV237                                                 02298000
CVTRV236 EQU   CVTRV228                                                 02299000
CVTRV235 EQU   CVTRV228                                                 02300000
CVTRV234 EQU   CVTRV228                                                 02301000
CVTRV233 EQU   CVTRV228                                                 02302000
CVTRV232 EQU   CVTRV228                                                 02303000
CVTRV231 EQU   CVTRV228                                                 02304000
CVTRV230 EQU   CVTRV228                                                 02305000
CVTRV229 EQU   CVTRV228                                                 02306000
CVTRV227 EQU   CVTRV219                                                 02307000
CVTRV226 EQU   CVTRV219                                                 02308000
CVTRV225 EQU   CVTRV219                                                 02309000
CVTRV224 EQU   CVTRV219                                                 02310000
CVTRV223 EQU   CVTRV219                                                 02311000
CVTRV222 EQU   CVTRV219                                                 02312000
CVTRV221 EQU   CVTRV219                                                 02313000
CVTRV220 EQU   CVTRV219                                                 02314000
CVTRV218 EQU   CVTRV210                                                 02315000
CVTRV217 EQU   CVTRV210                                                 02316000
CVTRV216 EQU   CVTRV210                                                 02317000
CVTRV215 EQU   CVTRV210                                                 02318000
CVTRV214 EQU   CVTRV210                                                 02319000
CVTRV213 EQU   CVTRV210                                                 02320000
CVTRV212 EQU   CVTRV210                                                 02321000
CVTRV211 EQU   CVTRV210                                                 02322000
CVTLCCAT EQU   CVTS01+420                                               02323000
CVTPCCAT EQU   CVTS01+416                                               02324000
CVTIPCRP EQU   CVTS01+412                                               02325000
CVTIPCRI EQU   CVTS01+408                                               02326000
CVTIPCDS EQU   CVTS01+404                                               02327000
CVTAIDVT EQU   CVTS01+400                                               02328000
CVTSSAP  EQU   CVTS01+396                                               02329000
CVTEHCIR EQU   CVTS01+392                                               02330000
CVTEHDEF EQU   CVTS01+388                                               02331000
CVTDAIR  EQU   CVTS01+384                                               02332000
CVTPERFM EQU   CVTS01+380                                               02333000
CVT044R2 EQU   CVTS01+376                                               02334000
CVTFETCH EQU   CVTS01+372                                               02335000
CVTRSTWD EQU   CVTS01+368                                               02336000
CVTSPOST EQU   CVTS01+364                                               02337000
CVTIOBP  EQU   CVTS01+360                                               02338000
CVTASMVT EQU   CVTS01+356                                               02339000
CVTRECRQ EQU   CVTS01+352                                               02340000
CVTWSAC  EQU   CVTS01+348                                               02341000
CVTRV149 EQU   CVTS01+344                                               02342000
CVTWSAL  EQU   CVTS01+340                                               02343000
CVTSPSA  EQU   CVTS01+336                                               02344000
CVTGLMN  EQU   CVTS01+332                                               02345000
CVTVEAC0 EQU   CVTS01+328                                               02346000
CVT062R1 EQU   CVTS01+324                                               02347000
CVTRPOST EQU   CVTS01+320                                               02348000
CVTDQIQE EQU   CVTS01+316                                               02349000
CVTCSD   EQU   CVTS01+312                                               02350000
CVTLKRMA EQU   CVTS01+308                                               02351000
CVTRSPIE EQU   CVTS01+304                                               02352000
CVTRENQ  EQU   CVTS01+300                                               02353000
CVTLQCB  EQU   CVTS01+296                                               02354000
CVTFQCB  EQU   CVTS01+292                                               02355000
CVTQCS01 EQU   CVTS01+288                                               02356000
CVTAPFT  EQU   CVTS01+284                                               02357000
CVTPARRL EQU   CVTS01+280                                               02358000
CVTVWAIT EQU   CVTS01+276                                               02359000
CVTGSPL  EQU   CVTS01+272                                               02360000
CVTLSMQ  EQU   CVTS01+268                                               02361000
CVTGSMQ  EQU   CVTS01+264                                               02362000
CVTEXPRO EQU   CVTS01+260                                               02363000
CVTOPCTP EQU   CVTS01+256                                               02364000
CVTSIC   EQU   CVTS01+252                                               02365000
CVTTPIOS EQU   CVTS01+248                                               02366000
CVTRTMS  EQU   CVTS01+244                                               02367000
CVTSDBF  EQU   CVTS01+240                                               02368000
CVTSCBP  EQU   CVTS01+236                                               02369000
CVTSDMP  EQU   CVTS01+232                                               02370000
CVTSV60  EQU   CVTS01+228                                               02371000
CVTRTMCT EQU   CVTS01+224                                               02372000
CVTASCBL EQU   CVTS01+220                                               02373000
CVTASCBH EQU   CVTS01+216                                               02374000
CVTGDA   EQU   CVTS01+212                                               02375000
CVTASVT  EQU   CVTS01+208                                               02376000
CVTVVMDI EQU   CVTS01+204                                               02377000
CVTAQTOP EQU   CVTS01+200                                               02378000
CVTIOSCS EQU   CVTS01+196                                               02379000
CVTSDRM  EQU   CVTS01+192                                               02380000
CVTOPTE  EQU   CVTS01+188                                               02381000
CVTSTXU  EQU   CVTS01+184                                               02382000
CVTQUIS  EQU   CVTS01+180                                               02383000
CVTPARS  EQU   CVTS01+176                                               02384000
CVTS1EE  EQU   CVTS01+172                                               02385000
CVTFRAS  EQU   CVTS01+168                                               02386000
CVTQSAS  EQU   CVTS01+164                                               02387000
CVTCRAS  EQU   CVTS01+160                                               02388000
CVTCRMN  EQU   CVTS01+156                                               02389000
CVTDELCP EQU   CVTS01+152                                               02390000
CVTFRECL EQU   CVTS01+148                                               02391000
CVTGETCL EQU   CVTS01+144                                               02392000
CVTBLDCP EQU   CVTS01+140                                               02393000
CVTAUTHL EQU   CVTS01+136                                               02394000
CVTSCAN  EQU   CVTS01+132                                               02395000
CVTRV144 EQU   CVTS01+130                                               02396000
CVTMAXMP EQU   CVTS01+128                                               02397000
CVTSTCK  EQU   CVTS01+124                                               02398000
CVTRV139 EQU   CVTS01+123                                               02399000
CVTDSSAC EQU   CVTS01+122                                               02400000
CVTRV513 EQU   CVTS01+121                                               02401000
CVTIOSPL EQU   CVTS01+120                                               02402000
CVTPTGT  EQU   CVTS01+116                                               02403000
CVTCSPIE EQU   CVTS01+112                                               02404000
CVTSMFEX EQU   CVTS01+108                                               02405000
CVTOLT0A EQU   CVTS01+104                                               02406000
CVTSRBRT EQU   CVTS01+100                                               02407000
CVTPUTL  EQU   CVTS01+96                                                02408000
CVTASCRL EQU   CVTS01+92                                                02409000
CVTASCRF EQU   CVTS01+88                                                02410000
CVTRV326 EQU   CVTS01+84                                                02411000
CVTRV325 EQU   CVTS01+80                                                02412000
CVTRV324 EQU   CVTS01+76                                                02413000
CVT0VL01 EQU   CVTS01+72                                                02414000
CVTSHRVM EQU   CVTS01+68                                                02415000
CVTRV332 EQU   CVTS01+64                                                02416000
CVTTAS   EQU   CVTS01+60                                                02417000
CVTRSCN  EQU   CVTS01+56                                                02418000
CVTTRAC2 EQU   CVTS01+54                                                02419000
CVTTRACE EQU   CVTS01+52                                                02420000
CVTAPG   EQU   CVTS01+51                                                02421000
CVTSDTRC EQU   CVTCTLFG                                                 02422000
CVTGTRCE EQU   CVTCTLFG                                                 02423000
CVTNOMP  EQU   CVTCTLFG                                                 02424000
CVTRSV79 EQU   CVTCTLFG                                                 02425000
CVTDSTAT EQU   CVTCTLFG                                                 02426000
CVTRSV78 EQU   CVTCTLFG                                                 02427000
CVTRV333 EQU   CVTCTLFG                                                 02428000
CVTRV323 EQU   CVTCTLFG                                                 02429000
CVTSPVLK EQU   CVTS01+49                                                02430000
CVTRSV77 EQU   CVTS01+48                                                02431000
CVTRV331 EQU   CVTS01+44                                                02432000
CVTRV330 EQU   CVTS01+40                                                02433000
CVTRV329 EQU   CVTS01+36                                                02434000
CVTRV328 EQU   CVTS01+32                                                02435000
CVTRV322 EQU   CVTS01+28                                                02436000
CVTSLID  EQU   CVTSLIDA+1                                               02437000
CVTSYLK  EQU   CVTSLIDA                                                 02438000
CVTRV321 EQU   CVTS01+20                                                02439000
CVTRV320 EQU   CVTS01+16                                                02440000
CVTLPDIR EQU   CVTLPDIA+1                                               02441000
CVTRSV69 EQU   CVTDIRST                                                 02442000
CVTRSV68 EQU   CVTDIRST                                                 02443000
CVTRSV67 EQU   CVTDIRST                                                 02444000
CVTRSV66 EQU   CVTDIRST                                                 02445000
CVTRSV65 EQU   CVTDIRST                                                 02446000
CVTRSV64 EQU   CVTDIRST                                                 02447000
CVTRSV63 EQU   CVTDIRST                                                 02448000
CVTDICOM EQU   CVTDIRST                                                 02449000
CVTPVTP  EQU   CVTS01+8                                                 02450000
CVTLPDSR EQU   CVTS01+4                                                 02451000
CVTGETL  EQU   CVTS01                                                   02452000
ACBAPID  EQU   ACBCOMN+72                                               02453000
ACBCBMWA EQU   ACBCOMN+68                                               02454000
ACBUAPTR EQU   ACBCOMN+64                                               02455000
ACBLRECL EQU   ACBCOMN+62                                               02456000
ACBMSGLN EQU   ACBBLKSZ                                                 02457000
ACBBUFSP EQU   ACBCOMN+56                                               02458000
@NM00125 EQU   ACBUJFCB+1                                               02459000
ACBOPTN  EQU   ACBUJFCB                                                 02460000
@NM00124 EQU   ACBINFLG+1                                               02461000
ACBBYPSS EQU   ACBINFLG                                                 02462000
ACBSDS   EQU   ACBVVIC                                                  02463000
ACBUCRA  EQU   ACBINFLG                                                 02464000
ACBSCRA  EQU   ACBINFLG                                                 02465000
ACBCAT   EQU   ACBINFLG                                                 02466000
ACBIJRQE EQU   ACBINFLG                                                 02467000
ACBJEPS  EQU   ACBINFLG                                                 02468000
@NM00123 EQU   ACBINFLG                                                 02469000
ACBERFLG EQU   ACBCOMN+49                                               02470000
ACBBUSY  EQU   ACBIOSFG                                                 02471000
ACBLOCK  EQU   ACBEXFG                                                  02472000
@NM00122 EQU   ACBOFLGS                                                 02473000
ACBDSERR EQU   ACBOFLGS                                                 02474000
ACBOPEN  EQU   ACBOFLGS                                                 02475000
ACBEOV   EQU   ACBOFLGS                                                 02476000
@NM00121 EQU   ACBOFLGS                                                 02477000
ACBDEB   EQU   ACBDDNM+5                                                02478000
ACBERFL  EQU   ACBDDNM+4                                                02479000
ACBAM    EQU   ACBAMETH                                                 02480000
ACBINFL  EQU   ACBDDNM+2                                                02481000
ACBTIOT  EQU   ACBDDNM                                                  02482000
ACBUEL   EQU   ACBEXLST                                                 02483000
ACBPASSW EQU   ACBCOMN+32                                               02484000
ACBMSGAR EQU   ACBCOMN+28                                               02485000
@NM00120 EQU   ACBDSORG+1                                               02486000
ACBDORGA EQU   ACBDSORG+1                                               02487000
@NM00119 EQU   ACBDSORG                                                 02488000
ACBOPTJ  EQU   ACBDVIND                                                 02489000
ACBCRNRE EQU   ACBCROPS                                                 02490000
ACBCRNCK EQU   ACBCROPS                                                 02491000
ACBASA   EQU   ACBCCTYP                                                 02492000
@NM00118 EQU   ACBCCTYP                                                 02493000
ACBTRCID EQU   ACBCCTYP                                                 02494000
@NM00117 EQU   ACBRECFM                                                 02495000
ACBRECAF EQU   ACBRECFM                                                 02496000
ACBJBUF  EQU   ACBBUFPL+2                                               02497000
ACBMACR4 EQU   ACBBUFPL+1                                               02498000
@NM00116 EQU   ACBMACR3                                                 02499000
ACBNCFX  EQU   ACBMACR3                                                 02500000
ACBSIS   EQU   ACBMACR3                                                 02501000
ACBDFR   EQU   ACBMACR3                                                 02502000
ACBICI   EQU   ACBMACR3                                                 02503000
ACBGSR   EQU   ACBMACR3                                                 02504000
ACBLSR   EQU   ACBMACR3                                                 02505000
@NM00115 EQU   ACBMACR3                                                 02506000
ACBBUFNI EQU   ACBCOMN+18                                               02507000
ACBBUFND EQU   ACBCOMN+16                                               02508000
ACBSTRNO EQU   ACBCOMN+15                                               02509000
ACBBSTNO EQU   ACBCOMN+14                                               02510000
ACBAIX   EQU   ACBMACR2                                                 02511000
ACBDSN   EQU   ACBMACR2                                                 02512000
ACBRST   EQU   ACBMACR2                                                 02513000
ACBLOGON EQU   ACBMACR2                                                 02514000
ACBSKP   EQU   ACBMACR2                                                 02515000
@NM00114 EQU   ACBMACR2                                                 02516000
ACBUBF   EQU   ACBMACR1                                                 02517000
ACBOUT   EQU   ACBMACR1                                                 02518000
ACBIN    EQU   ACBMACR1                                                 02519000
ACBDIR   EQU   ACBMACR1                                                 02520000
ACBSEQ   EQU   ACBMACR1                                                 02521000
ACBBLK   EQU   ACBCNV                                                   02522000
ACBADD   EQU   ACBADR                                                   02523000
ACBKEY   EQU   ACBMACR1                                                 02524000
ACBINRTN EQU   ACBCOMN+8                                                02525000
ACBIBCT  EQU   ACBJWA                                                   02526000
ACBLEN2  EQU   ACBLENG2                                                 02527000
ACBSTYP  EQU   ACBCOMN+1                                                02528000
ACBID    EQU   ACBCOMN                                                  02529000
RPLERMSA EQU   RPLCOMN+72                                               02530000
RPLEMLEN EQU   RPLCOMN+70                                               02531000
RPLACTIV EQU   RPLCOMN+69                                               02532000
RPLBRANC EQU   RPLEXTD1                                                 02533000
RPLNIB   EQU   RPLEXTD1                                                 02534000
@NM00103 EQU   RPLEXTD1                                                 02535000
RPLEXIT  EQU   RPLEXTD1                                                 02536000
RPLNEXIT EQU   RPLEXTD1                                                 02537000
RPLEXSCH EQU   RPLEXTD1                                                 02538000
RPLDDDD  EQU   RPLRBAR+4                                                02539000
@NM00102 EQU   RPLRBAR+3                                                02540000
@NM00101 EQU   RPLAIXID                                                 02541000
RPLAXPKP EQU   RPLAIXID                                                 02542000
RPLAIXPC EQU   RPLRBAR                                                  02543000
RPLRSV88 EQU   RPLOPT8                                                  02544000
RPLUNCON EQU   RPLOPT8                                                  02545000
RPLACTV  EQU   RPLOPT8                                                  02546000
RPLSESS  EQU   RPLOPT8                                                  02547000
RPLPEND  EQU   RPLOPT8                                                  02548000
RPLODPRM EQU   RPLOPT8                                                  02549000
RPLODACP EQU   RPLOPT8                                                  02550000
RPLODACQ EQU   RPLOPT8                                                  02551000
RPLRSV78 EQU   RPLOPT7                                                  02552000
RPLRSV77 EQU   RPLOPT7                                                  02553000
RPLRLSOP EQU   RPLOPT7                                                  02554000
RPLTPOST EQU   RPLOPT7                                                  02555000
RPLQOPT  EQU   RPLOPT7                                                  02556000
RPLCNIMM EQU   RPLCNOPT                                                 02557000
RPLCNANY EQU   RPLCNOPT                                                 02558000
RPLCNALL EQU   RPLCNOPT                                                 02559000
RPLRSV68 EQU   RPLOPT6                                                  02560000
RPLRSV67 EQU   RPLOPT6                                                  02561000
RPLLOCK  EQU   RPLOPT6                                                  02562000
RPLNCOND EQU   RPLOPT6                                                  02563000
RPLCOND  EQU   RPLOPT6                                                  02564000
RPLEOT   EQU   RPLUNTYP                                                 02565000
RPLEOM   EQU   RPLUNTYP                                                 02566000
RPLEOB   EQU   RPLUNTYP                                                 02567000
RPLWROPT EQU   RPLOPT5                                                  02568000
RPLNODE  EQU   RPLOPT5                                                  02569000
RPLERACE EQU   RPLWRTYP                                                 02570000
RPLEAU   EQU   RPLWRTYP                                                 02571000
RPLNERAS EQU   RPLWRTYP                                                 02572000
RPLPSOPT EQU   RPLOPT5                                                  02573000
@NM00100 EQU   RPLOPT5                                                  02574000
RPLDLGIN EQU   RPLOPT5                                                  02575000
RPLBUFL  EQU   RPLCOMN+52                                               02576000
RPLRLEN  EQU   RPLCOMN+48                                               02577000
RPLCHAIN EQU   RPLNXTRP                                                 02578000
RPLBOP   EQU   RPLOPT4                                                  02579000
@NM00099 EQU   RPLOPT4                                                  02580000
RPLMKFRM EQU   RPLOPT4                                                  02581000
RPLENDTR EQU   RPLOPT4                                                  02582000
RPLALIGN EQU   RPLOPT3                                                  02583000
RPLFMT   EQU   RPLOPT3                                                  02584000
RPLFLD   EQU   RPLOPT3                                                  02585000
RPLVFY   EQU   RPLOPT3                                                  02586000
RPLBLK   EQU   RPLOPT3                                                  02587000
RPLSFORM EQU   RPLOPT3                                                  02588000
RPLEODS  EQU   RPLOPT3                                                  02589000
RPLNSP   EQU   RPLOPT2                                                  02590000
RPLUPD   EQU   RPLOPT2                                                  02591000
@NM00098 EQU   RPLOPT2                                                  02592000
RPLLRD   EQU   RPLOPT2                                                  02593000
RPLBWD   EQU   RPLOPT2                                                  02594000
RPLCNV   EQU   RPLOPT2                                                  02595000
RPLADD   EQU   RPLADR                                                   02596000
RPLKEY   EQU   RPLOPT2                                                  02597000
RPLECBIN EQU   RPLECBSW                                                 02598000
RPLGEN   EQU   RPLOPT1                                                  02599000
RPLKGE   EQU   RPLOPT1                                                  02600000
RPLASY   EQU   RPLOPT1                                                  02601000
RPLSKP   EQU   RPLOPT1                                                  02602000
RPLSEQ   EQU   RPLOPT1                                                  02603000
RPLDIR   EQU   RPLOPT1                                                  02604000
RPLLOC   EQU   RPLOPT1                                                  02605000
RPLDAF   EQU   RPLARG+2                                                 02606000
RPLSAF   EQU   RPLARG                                                   02607000
RPLAREA  EQU   RPLCOMN+32                                               02608000
RPLTCBPT EQU   RPLCOMN+28                                               02609000
RPLDACB  EQU   RPLCOMN+24                                               02610000
RPLCCHAR EQU   RPLCOMN+20                                               02611000
RPLSTRID EQU   RPLCOMN+18                                               02612000
RPLKEYL  EQU   RPLKEYLE                                                 02613000
RPLRDSOH EQU   RPLFDB3                                                  02614000
RPLRLG   EQU   RPLFDB3                                                  02615000
RPLLGFRC EQU   RPLFDB3                                                  02616000
RPLREOT  EQU   RPLFDB3                                                  02617000
RPLREOM  EQU   RPLFDB3                                                  02618000
RPLREOB  EQU   RPLFDB3                                                  02619000
RPLSV32  EQU   RPLFDB3                                                  02620000
RPLUINPT EQU   RPLFDB3                                                  02621000
RPLSTSAV EQU   RPLFDB2                                                  02622000
RPLCUERR EQU   RPLFDB2                                                  02623000
RPLDLGFL EQU   RPLFDB2                                                  02624000
RPLIOERR EQU   RPLFDB2                                                  02625000
RPLDVUNS EQU   RPLFDB2                                                  02626000
RPLATND  EQU   RPLFDB2                                                  02627000
RPLRVID  EQU   RPLFDB2                                                  02628000
RPLERLK  EQU   RPLFDB2                                                  02629000
RPLERREG EQU   RPLRTNCD                                                 02630000
RPLSTAT  EQU   RPLFDBWD                                                 02631000
RPLPOST  EQU   RPLECB                                                   02632000
RPLWAIT  EQU   RPLECB                                                   02633000
RPLPLHPT EQU   RPLCOMN+4                                                02634000
RPLLEN2  EQU   RPLLEN                                                   02635000
RPLREQ   EQU   RPLIDWD+2                                                02636000
RPLSTYP  EQU   RPLIDWD+1                                                02637000
RPLID    EQU   RPLIDWD                                                  02638000
TIEGATE  EQU   TIETIEA                                                  02639000
TIEREQ   EQU   ISTTIE+3                                                 02640000
TIERETCD EQU   ISTTIE+2                                                 02641000
TIELNGTH EQU   ISTTIE+1                                                 02642000
TIETYPE  EQU   ISTTIE                                                   02643000
ATCAOS   EQU   ISTATCVT+1584                                            02644000
ATCPOPAB EQU   ATCAOSM+640                                              02645000
ATCVIOPM EQU   ATCAOSM+636                                              02646000
ATCTPMMI EQU   ATCAOSM+632                                              02647000
ATCTPMPB EQU   ATCAOSM+600                                              02648000
ATCRPLCT EQU   ATCAOSM+594                                              02649000
ATCCRACT EQU   ATCAOSM+592                                              02650000
ATCSRBCT EQU   ATCAOSM+590                                              02651000
ATCRSV75 EQU   ATCAOSM+589                                              02652000
ATCRSV66 EQU   ATCZFLAG                                                 02653000
ATCZF001 EQU   ATCZFLAG                                                 02654000
ATCTPCP1 EQU   ATCAOSM+584                                              02655000
ATCTPCP0 EQU   ATCAOSM+580                                              02656000
ATCAICTN EQU   ATCAOSM+576                                              02657000
ATCZR01  EQU   ATCAOSM+572                                              02658000
ATCMPLTA EQU   ATCAOSM+568                                              02659000
ATCASCB  EQU   ATCAOSM+564                                              02660000
ATCAP86  EQU   ATCAOSM+560                                              02661000
ATCAP85  EQU   ATCAOSM+556                                              02662000
ATCAP84  EQU   ATCAOSM+552                                              02663000
ATCAP83  EQU   ATCAOSM+548                                              02664000
ATCAP82  EQU   ATCAOSM+544                                              02665000
ATCAP69  EQU   ATCAOSM+540                                              02666000
ATCAP66  EQU   ATCAOSM+536                                              02667000
ATCAP62  EQU   ATCAOSM+532                                              02668000
ATCAPC59 EQU   ATCAOSM+528                                              02669000
ATCAP56  EQU   ATCAOSM+524                                              02670000
ATCAP55  EQU   ATCAOSM+520                                              02671000
ATCRCFY0 EQU   ATCAOSM+516                                              02672000
ATCAP41  EQU   ATCAOSM+512                                              02673000
ATCAPC25 EQU   ATCAOSM+508                                              02674000
ATCAP23  EQU   ATCAOSM+504                                              02675000
ATCTPSPB EQU   ATCAOSM+472                                              02676000
ATCTRMPB EQU   ATCAOSM+440                                              02677000
ATCPSTA  EQU   ATCAOSM+432                                              02678000
ATCSMABF EQU   ATCAOSM+428                                              02679000
ATCSMAPR EQU   ATCAOSM+424                                              02680000
ATCTPWQA EQU   ATCAOSM+420                                              02681000
ATCSMAID EQU   ATCAOSM+416                                              02682000
ATCSMARA EQU   ATCAOSM+412                                              02683000
ATCCACXA EQU   ATCAOSM+408                                              02684000
ATCZLAAB EQU   ATCAOSM+404                                              02685000
ATCATA10 EQU   ATCAOSM+400                                              02686000
ATCHLTCB EQU   ATCAOSM+396                                              02687000
@NM00097 EQU   ATCVTFLG                                                 02688000
ATCVTACT EQU   ATCVTFLG                                                 02689000
ATCRPT40 EQU   ATCAOSM+388                                              02690000
ATCRPT39 EQU   ATCAOSM+384                                              02691000
ATCRPT38 EQU   ATCAOSM+380                                              02692000
ATCRPT37 EQU   ATCAOSM+376                                              02693000
ATCRPT36 EQU   ATCAOSM+372                                              02694000
ATCRPT35 EQU   ATCAOSM+368                                              02695000
ATCRPT34 EQU   ATCAOSM+364                                              02696000
ATCRPT33 EQU   ATCAOSM+360                                              02697000
ATCRPT32 EQU   ATCAOSM+356                                              02698000
ATCRPT31 EQU   ATCAOSM+352                                              02699000
ATCRPT30 EQU   ATCAOSM+348                                              02700000
ATCRPT29 EQU   ATCAOSM+344                                              02701000
ATCRPT28 EQU   ATCAOSM+340                                              02702000
ATCRPT27 EQU   ATCAOSM+336                                              02703000
ATCRPT26 EQU   ATCAOSM+332                                              02704000
ATCRPT25 EQU   ATCAOSM+328                                              02705000
ATCRPT24 EQU   ATCAOSM+324                                              02706000
ATCRPT23 EQU   ATCAOSM+320                                              02707000
ATCRPT22 EQU   ATCAOSM+316                                              02708000
ATCRPT21 EQU   ATCAOSM+312                                              02709000
ATCRPT20 EQU   ATCAOSM+308                                              02710000
ATCRPT19 EQU   ATCAOSM+304                                              02711000
ATCRPT18 EQU   ATCAOSM+300                                              02712000
ATCRPT17 EQU   ATCAOSM+296                                              02713000
ATCRPT16 EQU   ATCAOSM+292                                              02714000
ATCRPT15 EQU   ATCAOSM+288                                              02715000
ATCRPT14 EQU   ATCAOSM+284                                              02716000
ATCRPT13 EQU   ATCAOSM+280                                              02717000
ATCRPT12 EQU   ATCAOSM+276                                              02718000
ATCRPT11 EQU   ATCAOSM+272                                              02719000
ATCAP38  EQU   ATCAOSM+268                                              02720000
ATCAP37  EQU   ATCAOSM+264                                              02721000
ATCZDFJ0 EQU   ATCAOSM+260                                              02722000
ATCAP51  EQU   ATCAOSM+256                                              02723000
ATCZPAB2 EQU   ATCAOSM+224                                              02724000
ATCZPAB1 EQU   ATCAOSM+192                                              02725000
ATCZLFVT EQU   ATCAOSM+188                                              02726000
ATCZLPVT EQU   ATCAOSM+184                                              02727000
ATCZDVTX EQU   ATCAOSM+180                                              02728000
ATCZDVTA EQU   ATCAOSM+176                                              02729000
ATCZDVT9 EQU   ATCAOSM+172                                              02730000
ATCZDVT8 EQU   ATCAOSM+168                                              02731000
ATCZDVT7 EQU   ATCAOSM+164                                              02732000
ATCRSV56 EQU   ATCDAPVT+22                                              02733000
ATCDAPDG EQU   ATCDAPVT+20                                              02734000
ATCDXCEA EQU   ATCDAPVT+16                                              02735000
ATCDCEA  EQU   ATCDAPVT+12                                              02736000
ATCDPCIA EQU   ATCDAPVT+8                                               02737000
ATCDSIOA EQU   ATCDAPVT+4                                               02738000
ATCDEOEA EQU   ATCDAPVT                                                 02739000
ATCZLAEA EQU   ATCLDAPP+16                                              02740000
ATCZLCEA EQU   ATCLDAPP+12                                              02741000
ATCRSV17 EQU   ATCLDAPP+8                                               02742000
ATCSMFRR EQU   ATCLDAPP+4                                               02743000
ATCCDTID EQU   ATCLDAPP                                                 02744000
ATCZAEA  EQU   ATCICAPP+16                                              02745000
ATCZCEA  EQU   ATCICAPP+12                                              02746000
ATCCDTCB EQU   ATCICAPP+8                                               02747000
ATCZSIOA EQU   ATCICAPP+4                                               02748000
ATCCDRPH EQU   ATCICAPP                                                 02749000
ATCAP65  EQU   ATCAOSM+96                                               02750000
ATCZDVT6 EQU   ATCAOSM+92                                               02751000
ATCZDVT4 EQU   ATCAOSM+88                                               02752000
ATCZDVT3 EQU   ATCAOSM+84                                               02753000
ATCZDVT1 EQU   ATCAOSM+80                                               02754000
ATCICNCB EQU   ATCAOSM+76                                               02755000
ATCZPSVT EQU   ATCAOSM+72                                               02756000
ATCZFSVT EQU   ATCAOSM+68                                               02757000
ATCAP64  EQU   ATCAOSM+64                                               02758000
ATCAP63  EQU   ATCAOSM+60                                               02759000
ATCAP61  EQU   ATCAOSM+56                                               02760000
ATCAP58  EQU   ATCAOSM+52                                               02761000
ATCAP57  EQU   ATCAOSM+48                                               02762000
ATCAP54  EQU   ATCAOSM+44                                               02763000
ATCAP53  EQU   ATCAOSM+40                                               02764000
ATCAP52  EQU   ATCAOSM+36                                               02765000
ATCAP34  EQU   ATCAOSM+32                                               02766000
ATCAP32  EQU   ATCAOSM+28                                               02767000
ATCAP31  EQU   ATCAOSM+24                                               02768000
ATCAP12  EQU   ATCAOSM+20                                               02769000
ATCAP11  EQU   ATCAOSM+16                                               02770000
ATCCMTCB EQU   ATCAOSM+12                                               02771000
ATCPRPH  EQU   ATCAOSM+8                                                02772000
ATCGSRBF EQU   ATCGSRBG                                                 02773000
ATCSRBRT EQU   ATCAOSM                                                  02774000
ATCRSVBB EQU   ISTATCVT+908                                             02775000
ATCVDLOK EQU   ISTATCVT+904                                             02776000
ATCVFPAB EQU   ISTATCVT+872                                             02777000
ATCVDPAB EQU   ISTATCVT+840                                             02778000
ATCIOECB EQU   ISTATCVT+836                                             02779000
ATCINCW3 EQU   ISTATCVT+832                                             02780000
ATCMODTB EQU   ISTATCVT+828                                             02781000
ATCUSSPT EQU   ISTATCVT+824                                             02782000
ATCSRTAB EQU   ISTATCVT+820                                             02783000
@NM00096 EQU   ISTATCVT+818                                             02784000
ATCNMCTR EQU   ISTATCVT+816                                             02785000
ATCSEC51 EQU   ATCSECST                                                 02786000
ATCSEC40 EQU   ATCSIPD+8                                                02787000
ATCSEC30 EQU   ATCSIPD+4                                                02788000
ATCSEC21 EQU   ATCSIPD                                                  02789000
ATCSEC10 EQU   ATCSOPD+4                                                02790000
ATCSEC01 EQU   ATCSOPD                                                  02791000
ATCPOIA  EQU   ATCRNO+1                                                 02792000
@NM00095 EQU   ATCRNO                                                   02793000
ATCPODVT EQU   ISTATCVT+784                                             02794000
ATCS49XL EQU   ISTATCVT+780                                             02795000
ATCS49XI EQU   ISTATCVT+776                                             02796000
ATCLCLCT EQU   ATCVLCNT+2                                               02797000
ATCRNCNT EQU   ATCVLCNT                                                 02798000
ATCCFEAD EQU   ISTATCVT+768                                             02799000
ATCPTR00 EQU   ISTATCVT+736                                             02800000
ATCRSV10 EQU   ISTATCVT+704                                             02801000
ATCTACB  EQU   ISTATCVT+700                                             02802000
ATCVTINM EQU   ISTATCVT+696                                             02803000
ATCTCLIM EQU   ISTATCVT+692                                             02804000
ATCTCLOM EQU   ISTATCVT+688                                             02805000
ATCVTIPB EQU   ISTATCVT+656                                             02806000
ATCTIPAB EQU   ISTATCVT+592                                             02807000
ATCOCCCB EQU   ISTATCVT+588                                             02808000
ATCOCCOB EQU   ISTATCVT+584                                             02809000
ATCCDLAD EQU   ISTATCVT+580                                             02810000
ATCCCLAD EQU   ISTATCVT+576                                             02811000
ATCDLRPB EQU   ISTATCVT+544                                             02812000
ATCPGPAB EQU   ISTATCVT+512                                             02813000
ATCVPAB1 EQU   ISTATCVT+480                                             02814000
ATCRSV97 EQU   ISTATCVT+476                                             02815000
ATCRDTLK EQU   ISTATCVT+472                                             02816000
ATCVOCLK EQU   ISTATCVT+468                                             02817000
ATCCDFDN EQU   ISTATCVT+464                                             02818000
ATCCDFIN EQU   ISTATCVT+460                                             02819000
ATCDVTLK EQU   ISTATCVT+456                                             02820000
ATCAP36  EQU   ISTATCVT+452                                             02821000
ATCAP35  EQU   ISTATCVT+448                                             02822000
ATCAP33  EQU   ISTATCVT+444                                             02823000
ATCRSV99 EQU   ISTATCVT+412                                             02824000
ATCLDECB EQU   ISTATCVT+408                                             02825000
ATCLDNCS EQU   ISTATCVT+404                                             02826000
ATCCDPTR EQU   ISTATCVT+400                                             02827000
ATCADEL  EQU   ISTATCVT+396                                             02828000
ATCTODVT EQU   ISTATCVT+392                                             02829000
ATCDEBCH EQU   ISTATCVT+388                                             02830000
ATCHBSIZ EQU   ATCHPGM+2                                                02831000
ATCHBFNO EQU   ATCHPGM                                                  02832000
ATCCRME  EQU   ISTATCVT+380                                             02833000
ATCRVCHS EQU   ISTATCVT+372                                             02834000
ATCECTLP EQU   ISTATCVT+368                                             02835000
ATCZDVTB EQU   ISTATCVT+364                                             02836000
ATCECPRT EQU   ISTATCVT+360                                             02837000
ATCVTLOD EQU   ISTATCVT+356                                             02838000
ATCTRPAB EQU   ISTATCVT+352                                             02839000
ATCMSGM  EQU   ISTATCVT+348                                             02840000
ATCMSGP  EQU   ISTATCVT+344                                             02841000
ATCEPT   EQU   ISTATCVT+340                                             02842000
ATCDVT   EQU   ISTATCVT+336                                             02843000
ATCTRCPT EQU   ISTATCVT+332                                             02844000
ATCDVLOD EQU   ISTATCVT+328                                             02845000
ATCALERT EQU   ISTATCVT+324                                             02846000
ATCEPA   EQU   ISTATCVT+320                                             02847000
ATCSAF   EQU   ISTATCVT+318                                             02848000
ATCXRANG EQU   ISTATCVT+317                                             02849000
ATCLAST  EQU   ATCSHRFG                                                 02850000
ATCSHRTN EQU   ISTATCVT+308                                             02851000
ATCUEP   EQU   ISTATCVT+304                                             02852000
ATCOCRT  EQU   ISTATCVT+300                                             02853000
ATCCSMA  EQU   ATCCSMR                                                  02854000
ATCESC02 EQU   ISTATCVT+292                                             02855000
ATCESC01 EQU   ISTATCVT+288                                             02856000
ATCCDFND EQU   ISTATCVT+284                                             02857000
ATCCDDEL EQU   ISTATCVT+280                                             02858000
ATCCDADD EQU   ISTATCVT+276                                             02859000
ATCMNT   EQU   ISTATCVT+272                                             02860000
ATCRSV16 EQU   ISTATCVT+270                                             02861000
ATCMAXID EQU   ISTATCVT+269                                             02862000
ATCMSGSP EQU   ATCCOM+268                                               02863000
ATCCIDM  EQU   ATCCOM+266                                               02864000
ATCACTRM EQU   ATCCOM+264                                               02865000
ATCNERAP EQU   ATCCOM+260                                               02866000
ATCNESAL EQU   ATCCOM+256                                               02867000
ATCRCC65 EQU   ATCCOM+252                                               02868000
ATCRCC26 EQU   ATCCOM+248                                               02869000
ATCRCC63 EQU   ATCCOM+244                                               02870000
ATCRSV11 EQU   ATCCOM+242                                               02871000
ATCVTMID EQU   ATCCOM+240                                               02872000
ATCAPOST EQU   ATCCOM+236                                               02873000
ATCNERFN EQU   ATCCOM+232                                               02874000
ATCNERNE EQU   ATCCOM+228                                               02875000
ATCNERCV EQU   ATCCOM+224                                               02876000
ATCNERST EQU   ATCCOM+220                                               02877000
ATCDCC61 EQU   ATCCOM+216                                               02878000
ATCDCC60 EQU   ATCCOM+212                                               02879000
ATCSRTDF EQU   ATCCOM+208                                               02880000
ATCSRTAD EQU   ATCCOM+204                                               02881000
ATCFIRA  EQU   ATCCOM+200                                               02882000
ATCSMBQ  EQU   ATCCOM+196                                               02883000
ATCSMRC  EQU   ATCCOM+192                                               02884000
ATCSMRS  EQU   ATCCOM+188                                               02885000
ATCSMQU  EQU   ATCCOM+184                                               02886000
ATCSMRQ  EQU   ATCCOM+180                                               02887000
ATCACDA  EQU   ATCCOM+176                                               02888000
ATCSTMA  EQU   ATCCOM+172                                               02889000
ATCFRSTR EQU   ATCCOM+168                                               02890000
ATCGTSTR EQU   ATCCOM+164                                               02891000
ATCREADA EQU   ATCCOM+160                                               02892000
ATCALOAD EQU   ATCCOM+156                                               02893000
ATCBLDLA EQU   ATCCOM+152                                               02894000
ATCFBRPH EQU   ATCCOM+148                                               02895000
ATCBFTRC EQU   ATCCOM+144                                               02896000
ATCTPBUF EQU   ATCTHTRC                                                 02897000
ATCREMOV EQU   ATCCOM+136                                               02898000
ATCADD   EQU   ATCCOM+132                                               02899000
ATCBPDA  EQU   ATCCOM+128                                               02900000
ATCDVTPT EQU   ATCCOM+124                                               02901000
ATCFEPT  EQU   ATCCOM+120                                               02902000
ATCFDVT  EQU   ATCCOM+116                                               02903000
ATCCONFT EQU   ATCCOM+112                                               02904000
ATCPTCHA EQU   ATCCOM+108                                               02905000
ATCAUTHA EQU   ATCCOM+104                                               02906000
ATCACCTA EQU   ATCCOM+100                                               02907000
ATCRDTH  EQU   ATCCOM+96                                                02908000
ATCFRSCH EQU   ATCCOM+92                                                02909000
ATCFSB   EQU   ATCCOM+88                                                02910000
ATCHLTMS EQU   ATCCOM+84                                                02911000
ATCECPRM EQU   ATCCOM+80                                                02912000
ATCECNET EQU   ATCCOM+76                                                02913000
ATCECOPC EQU   ATCCOM+72                                                02914000
ATCVPARM EQU   ATCCOM+68                                                02915000
ATCECVRQ EQU   ATCCOM+64                                                02916000
ATCECSES EQU   ATCCOM+60                                                02917000
ATCOCHA  EQU   ATCCOM+56                                                02918000
ATCDSPLQ EQU   ATCCOM+52                                                02919000
ATCECDSP EQU   ATCCOM+48                                                02920000
ATCVARYQ EQU   ATCCOM+44                                                02921000
ATCECVRY EQU   ATCCOM+40                                                02922000
ATCHALTQ EQU   ATCCOM+36                                                02923000
ATCECHLT EQU   ATCCOM+32                                                02924000
ATCMODQ  EQU   ATCCOM+28                                                02925000
ATCECMOD EQU   ATCCOM+24                                                02926000
ATCASCHD EQU   ATCCOM+20                                                02927000
ATCSRT   EQU   ATCCOM+16                                                02928000
ATCRDT   EQU   ATCCOM+12                                                02929000
ATCDCFRR EQU   ATCCOM+8                                                 02930000
ATCAPI   EQU   ATCCOM+4                                                 02931000
ATCRSV04 EQU   ATCSTAT4                                                 02932000
ATCNCSD  EQU   ATCSTAT4                                                 02933000
ATCMTST  EQU   ATCSTAT4                                                 02934000
ATCTPRT  EQU   ATCSTAT4                                                 02935000
ATCPRTAT EQU   ATCSTAT4                                                 02936000
@NM00094 EQU   ATCPOFLG                                                 02937000
ATCPOUNS EQU   ATCPOFLG                                                 02938000
ATCHSDMF EQU   ATCSTFLG                                                 02939000
@NM00093 EQU   ATCSTAT1                                                 02940000
ATCINHLT EQU   ATCSTAT1                                                 02941000
ATCNETSL EQU   ATCSTAT1                                                 02942000
ATCQKHLT EQU   ATCSTAT1                                                 02943000
ATCSNHLT EQU   ATCSTAT1                                                 02944000
ATCACTIV EQU   ATCSTAT1                                                 02945000
ATCSTART EQU   ATCSTAT1                                                 02946000
DYPRSV01 EQU   ISTDYPAB+12                                              02947000
DYPTSKID EQU   ISTDYPAB+8                                               02948000
DYPCHAIN EQU   ISTDYPAB+4                                               02949000
DYPFLGS  EQU   ISTDYPAB+2                                               02950000
DYPLNGTH EQU   ISTDYPAB+1                                               02951000
DYPTYPE  EQU   ISTDYPAB                                                 02952000
TH2SNF   EQU   ISTTH2+4                                                 02953000
TH2OAF   EQU   ISTTH2+3                                                 02954000
TH2DAF   EQU   ISTTH2+2                                                 02955000
TH2CDF   EQU   TH2FLAG1+1                                               02956000
TH2SEF   EQU   TH2FLAG1+1                                               02957000
TH2PYF   EQU   TH2FLAG1+1                                               02958000
TH2AFI   EQU   TH2FLAG1                                                 02959000
TH2PSI   EQU   TH2FLAG1                                                 02960000
TH2CMPLI EQU   TH2MPF                                                   02961000
TH2RHI   EQU   TH2MPF                                                   02962000
TH2FID   EQU   TH2FLAG1                                                 02963000
THCDF    EQU   THFLGB                                                   02964000
THSEF    EQU   THFLGB                                                   02965000
THPYF    EQU   THFLGB                                                   02966000
THAFI    EQU   THFLGA                                                   02967000
THPSI    EQU   THFLGA                                                   02968000
THCMPLI  EQU   THMPF                                                    02969000
THRHI    EQU   THMPF                                                    02970000
THFID    EQU   THFLAG1                                                  02971000
SRURSV01 EQU   SRULDID+4                                                02972000
SRUPSSN  EQU   SRULDID+2                                                02973000
SRUDFCLV EQU   SRUSPSN                                                  02974000
@NM00092 EQU   SRUTYPE                                                  02975000
SRUPSAC  EQU   SRUTYPE                                                  02976000
SRUSPAC  EQU   SRUTYPE                                                  02977000
SRUQSREQ EQU   ISTSRU                                                   02978000
RHRSVD5  EQU   RH3                                                      02979000
RHRSVD4  EQU   RH3                                                      02980000
RHLOG    EQU   RH3                                                      02981000
RHRSVD3  EQU   RH3                                                      02982000
RHRCDIR  EQU   RH3                                                      02983000
RHCDIR   EQU   RH3                                                      02984000
RHEB     EQU   RH3                                                      02985000
RHBB     EQU   RH3                                                      02986000
RHPACE   EQU   RH2                                                      02987000
RHRSVD2  EQU   RH2                                                      02988000
RHINOP   EQU   RHRSVD1                                                  02989000
RHBUSY   EQU   RHRETRY                                                  02990000
RHEXCEPT EQU   RH2                                                      02991000
RHRRN    EQU   RH2                                                      02992000
RHPE     EQU   RH2                                                      02993000
RHFME    EQU   RH2                                                      02994000
RHCHAIN  EQU   RH1                                                      02995000
RHSENSE  EQU   RH1                                                      02996000
RHFORMAT EQU   RH1                                                      02997000
RHDIRI   EQU   RH1                                                      02998000
RHSCI    EQU   RH1                                                      02999000
RHTYPE   EQU   RH1                                                      03000000
RHQS     EQU   RH1                                                      03001000
FSBRSV01 EQU   FSBFSB+30                                                03002000
FSBRLRSV EQU   FSBRLSTS                                                 03003000
FSBCFTX  EQU   FSBRLSTS                                                 03004000
FSBICNCB EQU   FSBMSGID                                                 03005000
FSBSSOC  EQU   FSBSS2                                                   03006000
FSBSSCC  EQU   FSBSS2                                                   03007000
FSBSSDC  EQU   FSBSS2                                                   03008000
FSBSSEC  EQU   FSBSS2                                                   03009000
FSBSSIR  EQU   FSBSS2                                                   03010000
FSBSSCR  EQU   FSBSS2                                                   03011000
@NM00090 EQU   FSBSS2                                                   03012000
@NM00089 EQU   FSBSS1                                                   03013000
FSBSSDE  EQU   FSBSS1                                                   03014000
FSBSSUS  EQU   FSBSS1                                                   03015000
@NM00088 EQU   FSBSS1                                                   03016000
FSBSOHI  EQU   FSBERC                                                   03017000
FSBLGI   EQU   FSBERC                                                   03018000
FSBLMRI  EQU   FSBFBMI                                                  03019000
FSBETI   EQU   FSBERC                                                   03020000
FSBEMI   EQU   FSBERC                                                   03021000
FSBEBI   EQU   FSBERC                                                   03022000
FSBECI   EQU   FSBERC                                                   03023000
FSBELI   EQU   FSBERC                                                   03024000
FSBMJRCD EQU   FSBSRCAT                                                 03025000
FSBXLCI  EQU   FSBXCODE                                                 03026000
FSBXFINS EQU   FSBXCODE                                                 03027000
FSBXNORM EQU   FSBXFSTS                                                 03028000
FSBSCODE EQU   FSBSYSRS                                                 03029000
FSBSPHSE EQU   FSBSYSRS                                                 03030000
FSBSERR  EQU   FSBSYSRS                                                 03031000
FSBCMD   EQU   FSBSEQ                                                   03032000
FSBDTRCE EQU   FSBFLAGS                                                 03033000
FSBASBTU EQU   FSBFLAGS                                                 03034000
FSBINPET EQU   FSBFLAGS                                                 03035000
FSBNONCB EQU   FSBFLAGS                                                 03036000
FSBLBIND EQU   FSBFLAGS                                                 03037000
FSBFFIND EQU   FSBFLAGS                                                 03038000
FSBACIND EQU   FSBFLAGS                                                 03039000
FSBRFIND EQU   FSBFLAGS                                                 03040000
FSBGATE  EQU   FSBFSBA                                                  03041000
FSBRSV02 EQU   FSBSFLGS                                                 03042000
FSBPGBUF EQU   FSBSFLGS                                                 03043000
FSBMNSDA EQU   FSBMNRCD                                                 03044000
FSBMNOA  EQU   FSBMNRCD                                                 03045000
FSBMNDIF EQU   FSBMNRCD                                                 03046000
FSBMNEOP EQU   FSBMNRCD                                                 03047000
FSBMNDNU EQU   FSBMNRCD                                                 03048000
FSBMNATN EQU   FSBMNRCD                                                 03049000
FSBMNRVI EQU   FSBMNRCD                                                 03050000
FSBMNELI EQU   FSBMNRCD                                                 03051000
FSBLNGTH EQU   FSBFSB+1                                                 03052000
FSBTYPE  EQU   FSBFSB                                                   03053000
FDBOFSET EQU   ISTFDB+10                                                03054000
FMCFLRSV EQU   FMCFLGB                                                  03055000
FMCFLGA8 EQU   FMCFLGB                                                  03056000
FMCCLRPH EQU   FMCVS1+45                                                03057000
FMCRSV0X EQU   FMCCVFLG                                                 03058000
FMCVYRPH EQU   FMCCVFLG                                                 03059000
FMCZV004 EQU   FMCVS1+40                                                03060000
FMCLOCK2 EQU   FMCVS1+36                                                03061000
@NM00087 EQU   FMCZFLG2                                                 03062000
FMCZF027 EQU   FMCZFLG2                                                 03063000
FMCZF026 EQU   FMCZFLG2                                                 03064000
FMCSEQ1B EQU   FMCSEQ1                                                  03065000
FMCSEQ1T EQU   FMCSEQ1                                                  03066000
FMCZX006 EQU   FMCVS1+33                                                03067000
FMCZX005 EQU   FMCVS1+32                                                03068000
FMCZX004 EQU   FMCVS1+31                                                03069000
FMCZX003 EQU   FMCVS1+30                                                03070000
FMCZX002 EQU   FMCVS1+29                                                03071000
FMCZX001 EQU   FMCVS1+28                                                03072000
FMCZV001 EQU   FMCVS1+24                                                03073000
FMCAWATQ EQU   FMCLCPAQ+1                                               03074000
@NM00086 EQU   FMCLCPAQ                                                 03075000
FMCLCPB2 EQU   FMCLCPBQ+1                                               03076000
FMCLCPB1 EQU   FMCLCPBQ                                                 03077000
FMCASCDQ EQU   FMCSHEAQ+1                                               03078000
@NM00085 EQU   FMCSHEAQ                                                 03079000
FMCSHEDQ EQU   FMCVS1+8                                                 03080000
FMCZFCSQ EQU   FMCVS1+6                                                 03081000
FMCZH001 EQU   FMCVS1+4                                                 03082000
FMCZF025 EQU   FMCZFLAG+3                                               03083000
FMCZF024 EQU   FMCZFLAG+3                                               03084000
FMCZF023 EQU   FMCZFLAG+3                                               03085000
FMCZF022 EQU   FMCZFLAG+3                                               03086000
FMCZF021 EQU   FMCZFLAG+3                                               03087000
FMCZF020 EQU   FMCZFLAG+3                                               03088000
FMCZF019 EQU   FMCZFLAG+3                                               03089000
FMCZF018 EQU   FMCZFLAG+3                                               03090000
FMCZF017 EQU   FMCZFLAG+2                                               03091000
FMCZF016 EQU   FMCZFLAG+2                                               03092000
FMCZF015 EQU   FMCZFLAG+2                                               03093000
FMCZF014 EQU   FMCZFLAG+2                                               03094000
FMCZF013 EQU   FMCZFLAG+2                                               03095000
FMCZF012 EQU   FMCZFLAG+2                                               03096000
FMCZF011 EQU   FMCZFLAG+2                                               03097000
FMCZF010 EQU   FMCZFLAG+2                                               03098000
FMCZF00F EQU   FMCZFLAG+1                                               03099000
FMCZF00E EQU   FMCZFLAG+1                                               03100000
FMCZF00D EQU   FMCZFLAG+1                                               03101000
FMCZF00C EQU   FMCZFLAG+1                                               03102000
FMCZF00B EQU   FMCZFLAG+1                                               03103000
FMCRSV10 EQU   FMCZFLAG+1                                               03104000
FMCZF009 EQU   FMCZFLAG+1                                               03105000
FMCZFD06 EQU   FMCZF006+1                                               03106000
FMCZFC06 EQU   FMCZF006                                                 03107000
FMCZFB06 EQU   FMCZF006                                                 03108000
FMCZFA06 EQU   FMCZF006                                                 03109000
FMCZF005 EQU   FMCZFLAG                                                 03110000
FMCZF004 EQU   FMCZFLAG                                                 03111000
FMCZF003 EQU   FMCZFLAG                                                 03112000
FMCZF002 EQU   FMCZFLAG                                                 03113000
FMCZF001 EQU   FMCZFLAG                                                 03114000
FMCFRESA EQU   ISTFMCB+228                                              03115000
FMCSCSQN EQU   FMCSNCTL+2                                               03116000
FMCSCCTL EQU   FMCSNCTL+1                                               03117000
FMCSTCTL EQU   FMCSCFLG                                                 03118000
FMCSCCLO EQU   FMCSCFLG                                                 03119000
FMCAPRO  EQU   FMCSCFLG                                                 03120000
FMCLURO  EQU   FMCSCFLG                                                 03121000
FMCOBSAC EQU   FMCSCFLG                                                 03122000
FMCIBSAC EQU   FMCSCFLG                                                 03123000
FMCFBRE  EQU   ISTFMCB+220                                              03124000
FMCFBXM  EQU   FMCZV002                                                 03125000
FMCASEGQ EQU   ISTFMCB+212                                              03126000
FMCRDTPT EQU   ISTFMCB+208                                              03127000
FMCLOCK  EQU   ISTFMCB+204                                              03128000
FMCSEGD  EQU   FMCSSEGQ                                                 03129000
FMCRSPLM EQU   ISTFMCB+198                                              03130000
FMCPSTRS EQU   ISTFMCB+196                                              03131000
@NM00084 EQU   FMCRRESP                                                 03132000
FMCTSLHA EQU   FMCRRESP                                                 03133000
FMCFRRN  EQU   FMCRRESP                                                 03134000
FMCFME   EQU   FMCRRESP                                                 03135000
FMCFEX   EQU   FMCRRESP                                                 03136000
FMCFPE   EQU   FMCRRESP                                                 03137000
FMCCTLB  EQU   ISTFMCB+194                                              03138000
FMCBSQNO EQU   FMCCLSEQ+2                                               03139000
FMCTSQNO EQU   FMCCLSEQ                                                 03140000
FMCOBPRG EQU   FMCMODEB                                                 03141000
FMCIBPRG EQU   FMCMODEB                                                 03142000
FMCRESOT EQU   FMCMODEB                                                 03143000
FMCRSTSR EQU   FMCMODEB                                                 03144000
FMCLUQ   EQU   FMCMODEB                                                 03145000
FMCAPQ   EQU   FMCMODEB                                                 03146000
FMCCLEAR EQU   FMCMODEB                                                 03147000
FMCHOLD  EQU   FMCMODEB                                                 03148000
FMCIPSEQ EQU   ISTFMCB+188                                              03149000
FMCLUSTR EQU   ISTFMCB+187                                              03150000
FMCRSV87 EQU   FMCSTAT2                                                 03151000
FMCSEQI  EQU   FMCSTAT2                                                 03152000
FMCCPIP  EQU   FMCSTAT2                                                 03153000
FMCALIPR EQU   FMCSTAT2                                                 03154000
FMCIAIO  EQU   FMCSTAT2                                                 03155000
FMCZF00A EQU   FMCSTAT2                                                 03156000
FMCVPIP  EQU   FMCSTAT2                                                 03157000
FMCBHSET EQU   ISTFMCB+185                                              03158000
FMCPRMRC EQU   FMCCLEXT+20                                              03159000
FMCRSV89 EQU   FMCPSTAT                                                 03160000
FMCPCLSD EQU   FMCPSTAT                                                 03161000
FMCDDOCD EQU   FMCPSTAT                                                 03162000
FMCIDVFD EQU   FMCPSTAT                                                 03163000
FMCELKST EQU   FMCPSTAT                                                 03164000
FMCRSV88 EQU   FMCPSCMD                                                 03165000
FMCRDBLK EQU   FMCPSCMD                                                 03166000
FMCDSEOC EQU   FMCPSCMD                                                 03167000
FMCPURGE EQU   FMCPSCMD                                                 03168000
FMCRESTI EQU   FMCPSCMD                                                 03169000
FMCCNTCT EQU   FMCPSCMD                                                 03170000
FMCINVT  EQU   FMCPSCMD                                                 03171000
FMCFLGB7 EQU   FMCFLGCL                                                 03172000
FMCFLGB6 EQU   FMCFLGCL                                                 03173000
FMCFLGB5 EQU   FMCFLGCL                                                 03174000
FMCFLGB4 EQU   FMCFLGCL                                                 03175000
FMCFLGB3 EQU   FMCFLGCL                                                 03176000
FMCFLGB2 EQU   FMCFLGCL                                                 03177000
FMCFLGB1 EQU   FMCFLGCL                                                 03178000
FMCFLGB0 EQU   FMCFLGCL                                                 03179000
FMCFLGA7 EQU   FMCFLGA                                                  03180000
FMCFLGA6 EQU   FMCFLGA                                                  03181000
FMCFLGA5 EQU   FMCFLGA                                                  03182000
FMCFLGA4 EQU   FMCFLGA                                                  03183000
FMCFLGA3 EQU   FMCFLGA                                                  03184000
FMCFLGA2 EQU   FMCFLGA                                                  03185000
FMCFLGA1 EQU   FMCFLGA                                                  03186000
FMCFLGA0 EQU   FMCFLGA                                                  03187000
FMCDCLOK EQU   FMCCLEXT+12                                              03188000
FMCRAFM  EQU   FMCCLEXT+8                                               03189000
FMCFBPTR EQU   FMCFBA+1                                                 03190000
FMCFBRSV EQU   FMCFBA                                                   03191000
FMCRPLPT EQU   FMCRPLA+1                                                03192000
FMCRPLRS EQU   FMCRPLA                                                  03193000
FMCPRCLS EQU   FMCCVAL                                                  03194000
FMCIBCE  EQU   FMCCVAL                                                  03195000
FMCONLY  EQU   FMCOBCE                                                  03196000
FMCLAST  EQU   FMCOBCE                                                  03197000
FMCMIDLE EQU   FMCOBCE                                                  03198000
FMCFIRST EQU   FMCOBCE                                                  03199000
FMCCPCNT EQU   FMCPACPC                                                 03200000
FMCMPCNT EQU   FMCPACEM                                                 03201000
FMCNPCNT EQU   FMCPACEN                                                 03202000
FMCCONF  EQU   FMCSSTAT                                                 03203000
FMCPURCH EQU   FMCSSTAT                                                 03204000
FMCNSALU EQU   FMCSSTAT                                                 03205000
FMCBIP   EQU   FMCSSTAT                                                 03206000
FMCSDTR  EQU   FMCSSTAT                                                 03207000
FMCUIPI  EQU   FMCSSTAT                                                 03208000
FMCCIPI  EQU   FMCSSTAT                                                 03209000
FMCSNBI  EQU   FMCSSTAT                                                 03210000
FMCRVD01 EQU   ISTFMCB+158                                              03211000
FMCISSN  EQU   ISTFMCB+156                                              03212000
FMCOASN  EQU   FMCNXOSC                                                 03213000
FMCOSSN  EQU   FMCNXCFM                                                 03214000
FMCSIP   EQU   FMCSIPA                                                  03215000
FMCEXLST EQU   ISTFMCB+144                                              03216000
FMCPAB5  EQU   ISTFMCB+128                                              03217000
FMCPAB4  EQU   ISTFMCB+112                                              03218000
FMCPAB3  EQU   ISTFMCB+96                                               03219000
FMCPAB2  EQU   ISTFMCB+80                                               03220000
FMCPAB1  EQU   ISTFMCB+64                                               03221000
FMCFASYA EQU   ISTFMCB+60                                               03222000
FMCMODE  EQU   ISTFMCB+52                                               03223000
FMCPROCD EQU   ISTFMCB+48                                               03224000
FMCVWT   EQU   ISTFMCB+44                                               03225000
FMCRPLH  EQU   ISTFMCB+40                                               03226000
FMCBUFNB EQU   FMCCMPS1+2                                               03227000
FMCBUFLM EQU   FMCCMPS1                                                 03228000
FMCDEBA  EQU   ISTFMCB+32                                               03229000
@NM00083 EQU   FMCCMDFL                                                 03230000
FMCSNA   EQU   FMCCMDFL                                                 03231000
FMCVSNA  EQU   FMCCMDFL                                                 03232000
FMCCMDR  EQU   FMCCMDFL                                                 03233000
@NM00082 EQU   ISTFMCB+30                                               03234000
@NM00081 EQU   FMCSTAT1                                                 03235000
FMCHPURG EQU   FMCSTAT1                                                 03236000
FMCVSP2  EQU   FMCSTAT1                                                 03237000
FMCVSP1  EQU   FMCSTAT                                                  03238000
FMCLTEAS EQU   FMCSTAT                                                  03239000
FMCZF007 EQU   FMCSTAT                                                  03240000
FMCDEDSC EQU   FMCSTAT                                                  03241000
FMCDEVOF EQU   FMCSTAT                                                  03242000
FMCDAPT  EQU   FMCSTAT                                                  03243000
FMCPRMTE EQU   FMCSTAT                                                  03244000
FMCPRMTR EQU   FMCSTAT                                                  03245000
FMCUSFLD EQU   ISTFMCB+24                                               03246000
FMCFMCBA EQU   ISTFMCB+20                                               03247000
FMCDNCBA EQU   ISTFMCB+16                                               03248000
FMCDVTA  EQU   ISTFMCB+12                                               03249000
FMCTSKID EQU   ISTFMCB+8                                                03250000
FMCNXTCB EQU   ISTFMCB+4                                                03251000
FMCSAF   EQU   ISTFMCB+2                                                03252000
FMCLNGTH EQU   ISTFMCB+1                                                03253000
FMCTYPE  EQU   ISTFMCB                                                  03254000
PROSRDEF EQU   PROSETM4                                                 03255000
PRORSV47 EQU   PROSETM4                                                 03256000
PROSCON  EQU   PROSETM4                                                 03257000
PRORSV46 EQU   PROSETM3                                                 03258000
PROSMONT EQU   PROSETM3                                                 03259000
PRORSV45 EQU   PROSETM3                                                 03260000
PROSNTO  EQU   PROSETM3                                                 03261000
PRORSV44 EQU   PROSETM3                                                 03262000
PRORSV43 EQU   PROSETM2                                                 03263000
PROSNTFL EQU   PROSETM2                                                 03264000
PRORSV42 EQU   PROSETM2                                                 03265000
PRORSV41 EQU   PROPROCS                                                 03266000
PROMODC  EQU   PROPROC4                                                 03267000
PROMODT  EQU   PROPROC4                                                 03268000
PROMODM  EQU   PROPROC4                                                 03269000
PROMODB  EQU   PROPROC4                                                 03270000
PRORSV14 EQU   PROPROC4                                                 03271000
PRORSV13 EQU   PROPROC4                                                 03272000
PRORSV12 EQU   PROPROC4                                                 03273000
PROEIB   EQU   PROPROC4                                                 03274000
PRORSV11 EQU   PROPROC3                                                 03275000
PROMONT2 EQU   PROPROC3                                                 03276000
PROMONIT EQU   PROPROC3                                                 03277000
PROSUBLK EQU   PROPROC3                                                 03278000
PRONTO   EQU   PROPROC3                                                 03279000
PROLGIN  EQU   PROPROC3                                                 03280000
PROERPI  EQU   PROPROC3                                                 03281000
PRORSV07 EQU   PROPROC3                                                 03282000
PROCFTX  EQU   PROPROC2                                                 03283000
PROEMLC  EQU   PROPROC2                                                 03284000
PRONTFL  EQU   PROPROC2                                                 03285000
PRORSV05 EQU   PROPROC2                                                 03286000
PRORSV04 EQU   PROPROC2                                                 03287000
PROLGOT  EQU   PROPROC2                                                 03288000
PROERPO  EQU   PROPROC2                                                 03289000
PRORSV03 EQU   PROPROC2                                                 03290000
PRORPLC  EQU   PROPROC1                                                 03291000
PROCS    EQU   PROPROC1                                                 03292000
PROCA    EQU   PROPROC1                                                 03293000
PRORESPX EQU   PROPROC1                                                 03294000
PRODFASY EQU   PROPROC1                                                 03295000
PROXPOPT EQU   PROPROC1                                                 03296000
PROTRUNC EQU   PROPROC1                                                 03297000
PROASYIP EQU   PROPROC1                                                 03298000
LCCWDATA EQU   ISTLCCW+4                                                03299000
LCCWCNT  EQU   ISTLCCW+2                                                03300000
LCCWACI  EQU   LCCWFLAG                                                 03301000
LCCWRFI  EQU   LCCWFLAG                                                 03302000
LCCWPER  EQU   LCCWLSI                                                  03303000
LCCWIDAT EQU   LCCWFLAG                                                 03304000
LCCWNTVC EQU   LCCWFLAG                                                 03305000
LCCWCKPT EQU   LCCWFLAG                                                 03306000
LCCWCC   EQU   LCCWFLAG                                                 03307000
LCCWCD   EQU   LCCWFLAG                                                 03308000
LCCWTYPE EQU   LCCWCTL                                                  03309000
LCCWMODE EQU   LCCWCTL                                                  03310000
LCCWSOP  EQU   LCCWRWOP                                                 03311000
@NM00080 EQU   LCCWRWOP                                                 03312000
LCCWSD   EQU   LCCWOP                                                   03313000
LCCWSI   EQU   LCCWOP                                                   03314000
CCWSPRSV EQU   CCWSPARE                                                 03315000
CCWCFTX  EQU   CCWSPARE                                                 03316000
CCWTRCE  EQU   CCWSPARE                                                 03317000
CCWNULL  EQU   CCWFLAGS                                                 03318000
CCWPCI   EQU   CCWFLAGS                                                 03319000
CCWSKIP  EQU   CCWFLAGS                                                 03320000
CCWSLI   EQU   CCWFLAGS                                                 03321000
CCWCC    EQU   CCWFLAGS                                                 03322000
CCWCD    EQU   CCWFLAGS                                                 03323000
CCWCODE  EQU   CCWVADDR                                                 03324000
LDNZS00F EQU   LDNZH003+1                                               03325000
LDNZS00E EQU   LDNZH003+1                                               03326000
LDNZS00D EQU   LDNZH003+1                                               03327000
LDNZS00C EQU   LDNZH003+1                                               03328000
LDNZS00B EQU   LDNZH003+1                                               03329000
LDNZS007 EQU   LDNZH003                                                 03330000
LDNZS006 EQU   LDNZH003                                                 03331000
LDNZS005 EQU   LDNZH003                                                 03332000
LDNZS004 EQU   LDNZH003                                                 03333000
LDNZS003 EQU   LDNZH003                                                 03334000
LDNZS002 EQU   LDNZH003                                                 03335000
LDNZS001 EQU   LDNZH003                                                 03336000
LDNZS000 EQU   LDNZH003                                                 03337000
LDNZX006 EQU   ISTLDNCB+576                                             03338000
LDNZC001 EQU   ISTLDNCB+569                                             03339000
LDNZX005 EQU   ISTLDNCB+568                                             03340000
LDNZV006 EQU   ISTLDNCB+564                                             03341000
LDNSRB   EQU   ISTLDNCB+520                                             03342000
@NM00079 EQU   LDNZSAV3+28                                              03343000
LDNRSV06 EQU   LDNZSAV4+16                                              03344000
LDNZSAV6 EQU   LDNZSAV4+12                                              03345000
LDNZSAV5 EQU   LDNZSAV4                                                 03346000
LDNZSAVE EQU   LDNZSAV3                                                 03347000
LDNZSAV2 EQU   ISTLDNCB+368                                             03348000
LDNZSAV1 EQU   ISTLDNCB+352                                             03349000
LDNZ3RR  EQU   ISTLDNCB+348                                             03350000
LDNZ2RR  EQU   ISTLDNCB+344                                             03351000
LDNZ1RR  EQU   ISTLDNCB+340                                             03352000
LDNRSV0B EQU   ISTLDNCB+336                                             03353000
LDNRSV0A EQU   ISTLDNCB+332                                             03354000
LDNRSV09 EQU   ISTLDNCB+328                                             03355000
LDNRSV08 EQU   ISTLDNCB+324                                             03356000
LDNRSV07 EQU   ISTLDNCB+320                                             03357000
LDNDEAD  EQU   LDNDCDEB+12                                              03358000
LDNUCBAD EQU   LDNDCDEB+8                                               03359000
LDNAPPAD EQU   LDNDCDEB+5                                               03360000
LDNEXSCL EQU   LDNDCDEB+4                                               03361000
LDNDCBAD EQU   LDNDCDEB+1                                               03362000
LDNDEBID EQU   LDNDCDEB                                                 03363000
LDNZRIND EQU   ISTLDNCB+300                                             03364000
LDNRPH   EQU   ISTLDNCB+192                                             03365000
LDNZTCP  EQU   ISTLDNCB+188                                             03366000
LDNZCHNC EQU   ISTLDNCB+187                                             03367000
LDNZLPC7 EQU   LDNZLPC                                                  03368000
LDNZLPC6 EQU   LDNZLPC                                                  03369000
LDNZLPC5 EQU   LDNZLPC                                                  03370000
LDNZLPC4 EQU   LDNZLPC                                                  03371000
LDNZLPC3 EQU   LDNZLPC                                                  03372000
LDNZLPC2 EQU   LDNZLPC                                                  03373000
LDNZLPC1 EQU   LDNZLPC                                                  03374000
LDNZLPC0 EQU   LDNZLPC                                                  03375000
LDNRSV05 EQU   LDNZERPF                                                 03376000
LDNZCTOV EQU   LDNZEPIN                                                 03377000
LDNZF001 EQU   LDNZEPIN                                                 03378000
LDNZFRDW EQU   LDNZCPAN                                                 03379000
LDNZFRD  EQU   LDNZCPAN                                                 03380000
LDNZNARD EQU   LDNZCPAN                                                 03381000
LDNRSV04 EQU   LDNZIOLK                                                 03382000
LDNZATBF EQU   LDNZIOLK                                                 03383000
LDNZERLK EQU   LDNZIOLK                                                 03384000
LDNZDSIC EQU   LDNZIOLK                                                 03385000
LDNZPAB1 EQU   ISTLDNCB+168                                             03386000
LDNZV005 EQU   ISTLDNCB+160                                             03387000
LDNZS1VR EQU   ISTLDNCB+136                                             03388000
LDNZS1RR EQU   ISTLDNCB+132                                             03389000
LDNZS1FC EQU   ISTLDNCB+128                                             03390000
LDNZS1BC EQU   ISTLDNCB+124                                             03391000
LDNZLOCK EQU   ISTLDNCB+120                                             03392000
LDNZFBUF EQU   ISTLDNCB+116                                             03393000
LDNZLAST EQU   ISTLDNCB+112                                             03394000
LDNRSV02 EQU   LDNFLAG2                                                 03395000
LDNZFF04 EQU   LDNFLAG2                                                 03396000
LDNZFF69 EQU   LDNFLAGS+2                                               03397000
LDNTPBIO EQU   LDNFLAGS+2                                               03398000
LDNZFF03 EQU   LDNFLAGS+2                                               03399000
LDNZFF02 EQU   LDNFLAGS+2                                               03400000
LDNZFF01 EQU   LDNFLAGS+2                                               03401000
LDNZFF00 EQU   LDNFLAGS+2                                               03402000
LDNCLOSD EQU   LDNFLAGS+2                                               03403000
LDNZENTR EQU   LDNFLAGS+2                                               03404000
LDNZICCW EQU   LDNFLAGS+1                                               03405000
LDNZREC  EQU   LDNFLAGS+1                                               03406000
LDNZCTXT EQU   LDNFLAGS+1                                               03407000
LDNZATLK EQU   LDNFLAGS+1                                               03408000
LDNZCHNE EQU   LDNFLAGS+1                                               03409000
LDNZATTP EQU   LDNFLAGS+1                                               03410000
LDNZIOBY EQU   LDNFLAGS+1                                               03411000
LDNZF00A EQU   LDNFLAGS+1                                               03412000
LDNZF009 EQU   LDNFLAGS                                                 03413000
LDNZF008 EQU   LDNFLAGS                                                 03414000
LDNZF007 EQU   LDNFLAGS                                                 03415000
LDNZF006 EQU   LDNFLAGS                                                 03416000
LDNZF005 EQU   LDNFLAGS                                                 03417000
LDNZF004 EQU   LDNFLAGS                                                 03418000
LDNZF003 EQU   LDNFLAGS                                                 03419000
LDNZF002 EQU   LDNFLAGS                                                 03420000
LDNZHDCC EQU   ISTLDNCB+106                                             03421000
LDNZARM  EQU   ISTLDNCB+104                                             03422000
LDNZRM   EQU   ISTLDNCB+102                                             03423000
LDNZRB   EQU   ISTLDNCB+100                                             03424000
LDNCPQ   EQU   ISTLDNCB+96                                              03425000
LDNSIOQ  EQU   ISTLDNCB+92                                              03426000
LDNZX002 EQU   ISTLDNCB+91                                              03427000
LDNZX001 EQU   ISTLDNCB+90                                              03428000
LDNZH002 EQU   ISTLDNCB+88                                              03429000
LDNZV001 EQU   ISTLDNCB+84                                              03430000
LDNZACSW EQU   ISTLDNCB+76                                              03431000
LDNZC002 EQU   ISTLDNCB+68                                              03432000
LDNCSWSV EQU   ISTLDNCB+60                                              03433000
LDNCHFLD EQU   ISTLDNCB+56                                              03434000
LDNRESRV EQU   ISTLDNCB+55                                              03435000
@NM00078 EQU   LDNCFLAG                                                 03436000
LDNRMF   EQU   LDNCFLAG                                                 03437000
LDNIBI   EQU   LDNCFLAG                                                 03438000
LDNTSAF  EQU   ISTLDNCB+52                                              03439000
LDNCUUA  EQU   ISTLDNCB+48                                              03440000
LDNCB    EQU   ISTLDNCB                                                 03441000
NCBRSV01 EQU   ISTNCB+46                                                03442000
NCBSWDAF EQU   ISTNCB+44                                                03443000
NCBDEVCH EQU   ISTNCB+36                                                03444000
NCBFMCBP EQU   ISTNCB+32                                                03445000
NCBLTRC  EQU   ISTNCB+30                                                03446000
NCBRVPT1 EQU   ISTNCB+28                                                03447000
NCBNMLLN EQU   NCBFLAGS+3                                               03448000
@NM00077 EQU   NCBFLAG1                                                 03449000
@NM00076 EQU   NCBFLAG1                                                 03450000
NCBTTF   EQU   NCBFLAG1                                                 03451000
NCBRSYNC EQU   NCBFLAG1                                                 03452000
NCBRSTRT EQU   NCBFLAG1                                                 03453000
NCBCONF  EQU   NCBFLAG1                                                 03454000
NCBSNAI  EQU   NCBFLAG1                                                 03455000
NCBFLTIO EQU   NCBFTRIO                                                 03456000
NCBCSTAT EQU   NCBFLAGS                                                 03457000
NCBNCSL  EQU   ISTNCB+22                                                03458000
NCBNCBA  EQU   ISTNCB+20                                                03459000
NCBFMCBA EQU   ISTNCB+16                                                03460000
NCBNSNA  EQU   ISTNCB+12                                                03461000
NCBTSKID EQU   ISTNCB+8                                                 03462000
NCBRDTE  EQU   ISTNCB+4                                                 03463000
NCBDAF   EQU   ISTNCB+2                                                 03464000
NCBLNGTH EQU   ISTNCB+1                                                 03465000
NCBTYPE  EQU   ISTNCB                                                   03466000
PABRPHA  EQU   PABRPHFG+1                                               03467000
PABNODQ  EQU   PABFLAGS                                                 03468000
PABINHBT EQU   PABFLAGS                                                 03469000
PABERLOK EQU   PABERRLK                                                 03470000
PABSSN   EQU   PABFLAGS                                                 03471000
PABDYNAM EQU   PABFLAGS                                                 03472000
PABNORPR EQU   PABFLAGS                                                 03473000
PABPRIOR EQU   PABFLAGS                                                 03474000
PABAPYP  EQU   PABFLAGS                                                 03475000
PABDVTA  EQU   ISTPAB+9                                                 03476000
PABOFFST EQU   ISTPAB+8                                                 03477000
PABCHNGP EQU   PABCHAIN+1                                               03478000
PABRSV02 EQU   PABCHAIN                                                 03479000
PABRUNNG EQU   PABCHAIN                                                 03480000
PABRESET EQU   PABCHAIN                                                 03481000
PABUNCON EQU   PABCHAIN                                                 03482000
PABCDP   EQU   PABCHAIN                                                 03483000
PABRESCH EQU   PABCHAIN                                                 03484000
PABCHNG  EQU   PABCHAIN                                                 03485000
PABWEQP  EQU   PABWEQA+1                                                03486000
PABRSV01 EQU   PABWEQA                                                  03487000
PABWEQG  EQU   PABWEQA                                                  03488000
RPHNEXPO EQU   ISTRPH+104                                               03489000
RPHSAV16 EQU   RPHWORK+60                                               03490000
RPHSAV15 EQU   RPHWORK+56                                               03491000
RPHSAV14 EQU   RPHWORK+52                                               03492000
RPHSAV13 EQU   RPHWORK+48                                               03493000
RPHSAV12 EQU   RPHWORK+44                                               03494000
RPHSAV11 EQU   RPHWORK+40                                               03495000
RPHSAV10 EQU   RPHWORK+36                                               03496000
RPHSAVE9 EQU   RPHWORK+32                                               03497000
RPHSAVE8 EQU   RPHWORK+28                                               03498000
RPHSAVE7 EQU   RPHWORK+24                                               03499000
RPHSAVE6 EQU   RPHWORK+20                                               03500000
RPHSAVE5 EQU   RPHWORK+16                                               03501000
RPHSAVE4 EQU   RPHWORK+12                                               03502000
RPHSAVE3 EQU   RPHWORK+8                                                03503000
RPHSAVE2 EQU   RPHWORK+4                                                03504000
RPHSHALF EQU   RPHSAVE1+2                                               03505000
RPHSBIT8 EQU   RPHSBITS                                                 03506000
RPHSBIT7 EQU   RPHSBITS                                                 03507000
RPHSBIT6 EQU   RPHSBITS                                                 03508000
RPHSBIT5 EQU   RPHSBITS                                                 03509000
RPHSBIT4 EQU   RPHSBITS                                                 03510000
RPHSBIT3 EQU   RPHSBITS                                                 03511000
RPHSBIT2 EQU   RPHSBITS                                                 03512000
RPHSBIT1 EQU   RPHSBITS                                                 03513000
RPHSBYTE EQU   RPHSAVE1                                                 03514000
RPHPABQP EQU   RPHPABQA+1                                               03515000
RPHPABFG EQU   RPHPABQA                                                 03516000
RPHCRR   EQU   ISTRPH+32                                                03517000
RPHSRP34 EQU   RPHSRPRM+2                                               03518000
RPHSRP12 EQU   RPHSRPRM                                                 03519000
RPHWEGT  EQU   RPHCSPA                                                  03520000
RPHMAJCB EQU   ISTRPH+21                                                03521000
RPHPABOF EQU   ISTRPH+20                                                03522000
RPHRESUM EQU   RPHRESMA+1                                               03523000
RPHRSV01 EQU   RPHWPFLG                                                 03524000
RPHPURGE EQU   RPHWPFLG                                                 03525000
RPHPT    EQU   RPHWPFLG                                                 03526000
RPHWT    EQU   RPHWPFLG                                                 03527000
RPHRSKEY EQU   RPHWPFLG                                                 03528000
RPHDVTA  EQU   ISTRPH+12                                                03529000
RPHTIK   EQU   RPHTSKID+3                                               03530000
@NM00075 EQU   RPHTSKID                                                 03531000
RPHRPHAP EQU   RPHRPHA+1                                                03532000
@NM00074 EQU   RPHRPHA                                                  03533000
RPHGATE  EQU   RPHRPHA                                                  03534000
@NM00073 EQU   RPHFLGB                                                  03535000
RPHRLCRA EQU   RPHFLGB                                                  03536000
RPHNRSAV EQU   RPHFLGB                                                  03537000
RPHPGCMP EQU   RPHFLGB                                                  03538000
RPHFBAPS EQU   RPHFLGB                                                  03539000
RPHBSSP  EQU   RPHFLGB                                                  03540000
RPHLOCK  EQU   RPHFLGB                                                  03541000
RPHFNFLG EQU   RPHFSTLC                                                 03542000
RPHMLTCP EQU   RPHFLAGS                                                 03543000
RPHSMCLR EQU   RPHFLAGS                                                 03544000
RPHSMTYP EQU   RPHFLAGS                                                 03545000
RPHSMQ   EQU   RPHFLAGS                                                 03546000
RPHAUTEX EQU   RPHAPTYP                                                 03547000
RPHSPGIN EQU   RPHFLAGS                                                 03548000
RPHOGIND EQU   RPHFLAGS                                                 03549000
RPHLNGTH EQU   ISTRPH+1                                                 03550000
RPHTYPE  EQU   ISTRPH                                                   03551000
LOKXCL   EQU   @NM00071                                                 03552000
LOKPRY   EQU   @NM00071                                                 03553000
@NM00072 EQU   @NM00071                                                 03554000
@NM00070 EQU   LOKCHNG                                                  03555000
LOKCT    EQU   ISTLOK                                                   03556000
DEVRSV03 EQU   ISTDEVCH+5                                               03557000
DEVPHYSA EQU   ISTDEVCH+4                                               03558000
DEVCSLPN EQU   DEVCHAR3                                                 03559000
DEVCSTCL EQU   DEVCHAR3                                                 03560000
DEVCCHEK EQU   DEVCHAR3                                                 03561000
DEVCATTN EQU   DEVCHAR3                                                 03562000
DEVCSWL  EQU   DEVFCCTL                                                 03563000
DEVCRVB  EQU   DEVFCCTL                                                 03564000
DEVCSSL  EQU   DEVFCCTL                                                 03565000
DEVCBSC  EQU   DEVFCCTL                                                 03566000
DEVMCODE EQU   ISTDEVCH+2                                               03567000
DEVCHAR2 EQU   DEVTCODE                                                 03568000
DEVRSV01 EQU   DEVCHAR                                                  03569000
DEVCCTL  EQU   DEVCHAR                                                  03570000
DEVNNSPT EQU   DEVCHAR                                                  03571000
DEVSPS   EQU   DEVCHAR                                                  03572000
DEVSUBND EQU   DEVCHAR                                                  03573000
DEVCONVR EQU   DEVCHAR                                                  03574000
DEVOTPUT EQU   DEVCHAR                                                  03575000
DEVINPUT EQU   DEVCHAR                                                  03576000
CDSEXARA EQU   CDSMAP+20                                                03577000
CDSEXTM  EQU   CDSFLAG+2                                                03578000
CDSEXTB  EQU   CDSFLAG+2                                                03579000
CDSTMERB EQU   CDSFLAG+2                                                03580000
@NM00069 EQU   CDSFLAG+1                                                03581000
CDSDVPRO EQU   CDSFLAG+1                                                03582000
CDSNTPRI EQU   CDSFLAG+1                                                03583000
CDSLINCN EQU   CDSFLAG                                                  03584000
CDSREMSY EQU   CDSFLAG                                                  03585000
CDS2CHAN EQU   CDSFLAG                                                  03586000
CDSEXTPR EQU   CDSFLAG                                                  03587000
CDSFEVOL EQU   CDSFLAG                                                  03588000
CDSSHAR  EQU   CDSFLAG                                                  03589000
CDSFPMD  EQU   CDSFLAG                                                  03590000
CDSBYTCT EQU   CDSMAP+8                                                 03591000
CDSTYPE  EQU   CDSMFCT+3                                                03592000
CDSCLASS EQU   CDSMFCT+2                                                03593000
@NM00068 EQU   CDSFEAT                                                  03594000
CDSDEVM  EQU   CDSFEAT                                                  03595000
CDSDEVT  EQU   CDSFEAT                                                  03596000
CDSASCII EQU   CDSFEAT                                                  03597000
CDSMODEL EQU   CDSMFCT                                                  03598000
@NM00067 EQU   $WIOFLAG                                                 03599000
$WIOIDNT EQU   WTIOMAP+2                                                03600000
$WIOLEVL EQU   WTIOMAP+1                                                03601000
$WIOTRMG EQU   WTIOMAP                                                  03602000
TCBOBSQL EQU   TECBSEND+23                                              03603000
TCBOBSQ  EQU   TECBSEND+22                                              03604000
TCBIBSQL EQU   TECBSEND+20                                              03605000
TCBIBSQ  EQU   TECBSEND+19                                              03606000
TCBSIGDA EQU   TECBSEND+15                                              03607000
TCBSEQNO EQU   TECBSEND+13                                              03608000
TCBCNTRL EQU   TECBSEND+10                                              03609000
TCBCHAIN EQU   TECBSEND+9                                               03610000
@NM00066 EQU   TCBRKCHG                                                 03611000
TCBALT   EQU   TCBRKCHG                                                 03612000
TCBREQ   EQU   TCBRKCHG                                                 03613000
TCBCMD   EQU   TCBRKCHG                                                 03614000
TCBEB    EQU   TCBRKCHG                                                 03615000
TCBBB    EQU   TCBRKCHG                                                 03616000
@NM00065 EQU   TCBRTYPE                                                 03617000
TCBDFAS  EQU   TCBRTYPE                                                 03618000
TCBNDFS  EQU   TCBRTYPE                                                 03619000
TCBRSP   EQU   TCBRTYPE                                                 03620000
@NM00064 EQU   TCBRTYPE                                                 03621000
TCBRECLN EQU   TECBSEND+5                                               03622000
TCBRRN   EQU   TCBRESP                                                  03623000
TCBNFME  EQU   TCBRESP                                                  03624000
TCBEX    EQU   TCBRESP                                                  03625000
@NM00063 EQU   TCBRESP                                                  03626000
TCBUSEN  EQU   TECBSEND+2                                               03627000
TCBSSENM EQU   TECBSEND+1                                               03628000
TCBSSEN  EQU   TECBSEND                                                 03629000
TCBSNDEV EQU   TECBSNS1                                                 03630000
TCBEVDEV EQU   TECBFD01+1                                               03631000
TCBEVTYP EQU   TECBFD01                                                 03632000
TECBSNCT EQU   TECBMAPS+5                                               03633000
@NM00061 EQU   TECBFLGS                                                 03634000
TCBQUEUE EQU   TECBFLGS                                                 03635000
SVECC010 EQU   TOLTEPWA+3952                                            03636000
SVETC035 EQU   TOLTEPWA+3880                                            03637000
SVESC030 EQU   TOLTEPWA+3808                                            03638000
SVESC020 EQU   TOLTEPWA+3664                                            03639000
SVEIC002 EQU   TOLTEPWA+3520                                            03640000
SVECC014 EQU   TOLTEPWA+3376                                            03641000
SVESC120 EQU   TOLTEPWA+3304                                            03642000
SVESC025 EQU   TOLTEPWA+3088                                            03643000
@NM00060 EQU   TOLTEPWA+2980                                            03644000
$RPLERR  EQU   TOLTEPWA+2977                                            03645000
@NM00059 EQU   TOLTEPWA+2976                                            03646000
$R13PR3  EQU   TOLTEPWA+2972                                            03647000
$CEINT2  EQU   TOLTEPWA+2968                                            03648000
$MSGGET  EQU   TOLTEPWA+2960                                            03649000
$ACQLIST EQU   TOLTEPWA+2956                                            03650000
$R4SAVE1 EQU   TOLTEPWA+2952                                            03651000
$CLSISS  EQU   TOLTEPWA+2950                                            03652000
$CLSCNT  EQU   TOLTEPWA+2948                                            03653000
$CUTABLE EQU   TOLTEPWA+2868                                            03654000
$ENDBFR2 EQU   TOLTEPWA+2852                                            03655000
$TECB2   EQU   TOLTEPWA+2844                                            03656000
$ENDBFR1 EQU   TOLTEPWA+2828                                            03657000
$TECB1   EQU   TOLTEPWA+2820                                            03658000
$TRTN#   EQU   TOLTEPWA+2815                                            03659000
$RQSTSZE EQU   TOLTEPWA+2812                                            03660000
$RQSTPTR EQU   TOLTEPWA+2808                                            03661000
$R4SAVE  EQU   TOLTEPWA+2804                                            03662000
$PARTADR EQU   TOLTEPWA+2800                                            03663000
$TBSDATA EQU   TOLTEPWA+2796                                            03664000
$CTWIDTH EQU   TOLTEPWA+2795                                            03665000
$CTLINE  EQU   TOLTEPWA+2794                                            03666000
$APWIDTH EQU   TOLTEPWA+2793                                            03667000
$APLINE  EQU   TOLTEPWA+2792                                            03668000
$INDEX   EQU   $IMITX                                                   03669000
$UMXX    EQU   @NM00058+14                                              03670000
$NSXX    EQU   @NM00058+12                                              03671000
$ATACNT  EQU   $NSCNT                                                   03672000
$CTR     EQU   @NM00058+8                                               03673000
$ATAPTR  EQU   $NSPTR                                                   03674000
$DDRPTR  EQU   @NM00058                                                 03675000
$DTORESP EQU   TOLTEPWA+2712                                            03676000
$APNAME  EQU   TOLTEPWA+2704                                            03677000
$24SYMNE EQU   $24CATMG+4                                               03678000
$24DEVAD EQU   $24CATMG                                                 03679000
$24RTN#  EQU   $24FEMSG+8                                               03680000
$ESECTID EQU   $24FEMSG                                                 03681000
$24FLGS  EQU   TOLTEPWA+2680                                            03682000
$24SAVE2 EQU   TOLTEPWA+2676                                            03683000
$24SAVE1 EQU   TOLTEPWA+2672                                            03684000
$24UNADR EQU   TOLTEPWA+2668                                            03685000
$24SAV13 EQU   TOLTEPWA+2664                                            03686000
$24RETCD EQU   TOLTEPWA+2663                                            03687000
$MACID   EQU   TOLTEPWA+2661                                            03688000
$CSPARE  EQU   $CFLGS                                                   03689000
$C2WAY   EQU   $CFLGS                                                   03690000
$CINCT   EQU   $CCOMDAT+12                                              03691000
$CINADR  EQU   $CCOMDAT+8                                               03692000
$COUTCT  EQU   $CCOMDAT+4                                               03693000
$COUTAD  EQU   $CCOMDAT                                                 03694000
ROOTLOC  EQU   TOLTEPWA+2640                                            03695000
$RETREG  EQU   TOLTEPWA+2636                                            03696000
$EXTA    EQU   TOLTEPWA+2320                                            03697000
$PASSONA EQU   TOLTEPWA+2264                                            03698000
$TRMINPT EQU   TOLTEPWA+2184                                            03699000
$INBUFR  EQU   TOLTEPWA+2104                                            03700000
$BUFFER  EQU   TOLTEPWA+1976                                            03701000
$TLTRPL3 EQU   TOLTEPWA+1856                                            03702000
$TLTRPL2 EQU   TOLTEPWA+1736                                            03703000
$TLTRPL1 EQU   TOLTEPWA+1616                                            03704000
$SLTBL   EQU   TOLTEPWA+1468                                            03705000
$CDEVPT  EQU   TOLTEPWA+1466                                            03706000
$FEEDBCK EQU   $DEVTBLE+66                                              03707000
@NM00057 EQU   $DEVFLG5                                                 03708000
$ASCII   EQU   $DEVFLG5                                                 03709000
$DEVLU   EQU   $DEVFLG5                                                 03710000
$OPNDFAL EQU   $DEVFLG5                                                 03711000
$ACQNCB  EQU   $DEVFLG5                                                 03712000
$ENDNODE EQU   $DEVFLG5                                                 03713000
$LINENME EQU   $RNINFO                                                  03714000
$CID     EQU   $DEVTBLE+52                                              03715000
$DVCOL   EQU   $LDNCBPT+2                                               03716000
$DVROW   EQU   $LDNCBPT                                                 03717000
$NCSPLP  EQU   $DEVTBLE+44                                              03718000
$DVLN    EQU   $SSCPDAF                                                 03719000
$DAF     EQU   $DEVSESP+4                                               03720000
$VARYPAB EQU   $DEVSESP                                                 03721000
@NM00056 EQU   $DEVFLG3                                                 03722000
$CLRSNT  EQU   $DEVFLG3                                                 03723000
$OLTERR  EQU   $DEVFLG3                                                 03724000
$SRTEST  EQU   $DEVFLG3                                                 03725000
$DVSNDOK EQU   $SIOFLG                                                  03726000
$POLLREQ EQU   $DEVFLG3                                                 03727000
$ACQRED  EQU   $DEVFLG3                                                 03728000
$DVINCT  EQU   $DEVTBLE+26                                              03729000
$DVBRKST EQU   $OPND+1                                                  03730000
$DVBRKSN EQU   $OPND                                                    03731000
$DVSEQNO EQU   $OPIS                                                    03732000
$CEINTRP EQU   $DEVFLG2                                                 03733000
$DEVALOC EQU   $DEVFLG2                                                 03734000
$ALLDATA EQU   $DEVFLG2                                                 03735000
$ENDCNTL EQU   $DEVFLG2                                                 03736000
$CTLDEV  EQU   $DEVFLG2                                                 03737000
$NOCDS   EQU   $DEVFLG2                                                 03738000
$PRIMARY EQU   $DEVFLG1                                                 03739000
$DVCTBYT EQU   $INTOCC                                                  03740000
$DVLGMDE EQU   $ATTNEXP                                                 03741000
$DVSPRM  EQU   $EVNCPLT                                                 03742000
$GRABBED EQU   $DEVFLG1                                                 03743000
$CATASTR EQU   $DEVFLG1                                                 03744000
$LETGO   EQU   $DEVFLG1                                                 03745000
$CURELEM EQU   $$SYMNME+4                                               03746000
$MSGOTSD EQU   $$SYMNME                                                 03747000
$EXTDEV  EQU   $DEVCDS+11                                               03748000
@NM00055 EQU   $DEVSDCF                                                 03749000
$NOTPRIM EQU   $DEVSDCF                                                 03750000
@NM00054 EQU   $DEVCDSF                                                 03751000
@NM00053 EQU   $DEVCDSF                                                 03752000
@NM00052 EQU   $DEVCDSF                                                 03753000
$CDSNAME EQU   $DEVCDSF                                                 03754000
$EXTRN   EQU   $DEVCDSF                                                 03755000
$CEVOLUM EQU   $DEVCDSF                                                 03756000
$SHARD   EQU   $DEVCDSF                                                 03757000
$DEVFPM  EQU   $DEVCDSF                                                 03758000
$DEVCNT  EQU   $DEVCDS+8                                                03759000
$DEVTYPE EQU   $DEVFEAT+3                                               03760000
$DEVCLAS EQU   $DEVFEAT+2                                               03761000
$DEVFRRS EQU   $DEVFEAT+1                                               03762000
$DEVMOD  EQU   $DEVFEAT                                                 03763000
$DEVRDGT EQU   @NM00050+1                                               03764000
$DEVCTLU EQU   @NM00050+1                                               03765000
$DEVCHAN EQU   @NM00050                                                 03766000
@NM00051 EQU   @NM00050                                                 03767000
$CTINDX  EQU   $DEVUNAD                                                 03768000
$FLAG16  EQU   $COMMFLG+15                                              03769000
$FLAG15  EQU   $COMMFLG+14                                              03770000
$FLAG14  EQU   $COMMFLG+13                                              03771000
$TEP2ND  EQU   $FLAG13                                                  03772000
$TEP1ST  EQU   $FLAG13                                                  03773000
$CATMSG  EQU   $FLAG13                                                  03774000
$PRMPTSW EQU   $FLAG13                                                  03775000
$DEVENT  EQU   $FLAG13                                                  03776000
$OLTMACC EQU   $FLAG13                                                  03777000
$LGON    EQU   $FLAG13                                                  03778000
$CTLOGON EQU   $FLAG13                                                  03779000
@NM00049 EQU   $FLAG12                                                  03780000
$VARYINP EQU   $FLAG12                                                  03781000
$ENDTEST EQU   $FLAG12                                                  03782000
$VRYHRD  EQU   $FLAG12                                                  03783000
$VRYSFT  EQU   $FLAG12                                                  03784000
$POSTFLG EQU   $FLAG12                                                  03785000
$OPTMSG  EQU   $FLAG12                                                  03786000
$FEORCAT EQU   $FLAG11                                                  03787000
@NM00048 EQU   $FLAG11                                                  03788000
@NM00047 EQU   $FLAG10                                                  03789000
$INBND   EQU   $FLAG10                                                  03790000
$DPRINT  EQU   $FLAG10                                                  03791000
$HOLD    EQU   $FLAG9                                                   03792000
$NOTRRCH EQU   $FLAG9                                                   03793000
@NM00046 EQU   $FLAG9                                                   03794000
$COPY    EQU   $FLAG9                                                   03795000
$LSTLNSW EQU   $FLAG9                                                   03796000
$MULLNSW EQU   $FLAG9                                                   03797000
$REMSW   EQU   $FLAG9                                                   03798000
$IGRES   EQU   $FLAG9                                                   03799000
$TCECM   EQU   $FLAG8                                                   03800000
$VS2     EQU   $FLAG8                                                   03801000
$VS1     EQU   $FLAG8                                                   03802000
$EDOS    EQU   $FLAG8                                                   03803000
@NM00045 EQU   $FLAG8                                                   03804000
$TWOWAY  EQU   $FLAG8                                                   03805000
@NM00044 EQU   $FLAG8                                                   03806000
$RCVMSG  EQU   $FLAG7                                                   03807000
$RCVRFLG EQU   $FLAG7                                                   03808000
$SNDRFLG EQU   $FLAG7                                                   03809000
$LDOIS   EQU   $FLAG7                                                   03810000
$DCONTCT EQU   $FLAG7                                                   03811000
$EXIOWAT EQU   $FLAG7                                                   03812000
$CIREQ   EQU   $FLAG6                                                   03813000
$ABTERM  EQU   $ABNDBIT                                                 03814000
$FSTMCIS EQU   $FLAG6                                                   03815000
$DISCISS EQU   $FLAG6                                                   03816000
$CHANGE  EQU   $FLAG6                                                   03817000
$CTERROR EQU   $FLAG6                                                   03818000
$RECAL11 EQU   $FLAG6                                                   03819000
@NM00043 EQU   $FLAG5                                                   03820000
$PROGCK  EQU   $CANCEL                                                  03821000
$PRINTAP EQU   $FLAG5                                                   03822000
@NM00042 EQU   $FLAG5                                                   03823000
$MSG922  EQU   $FLAG5                                                   03824000
$CT924   EQU   $FLAG5                                                   03825000
$FSTCAT  EQU   $FLAG5                                                   03826000
$FSTFE   EQU   $FLAG5                                                   03827000
$ACTOPND EQU   $FLAG4                                                   03828000
$ACQCUTT EQU   $FLAG4                                                   03829000
$CLSSACT EQU   $FLAG4                                                   03830000
$BACKINT EQU   $FLAG4                                                   03831000
$DMSGSW  EQU   $FLAG4                                                   03832000
$TSTDEVP EQU   $FLAG4                                                   03833000
$APRQPER EQU   $FLAG4                                                   03834000
$OPCOM   EQU   $FLAG4                                                   03835000
$NEWAP   EQU   $FLAG3                                                   03836000
$ALTPRTR EQU   $FLAG3                                                   03837000
$OPTERR  EQU   $FLAG3                                                   03838000
$PRTONLY EQU   $FLAG3                                                   03839000
$REQSTOR EQU   $FLAG3                                                   03840000
$LOGOFFE EQU   $FLAG3                                                   03841000
$TSTERR  EQU   $FLAG3                                                   03842000
$DEVERR  EQU   $FLAG3                                                   03843000
$PARTIAL EQU   $FLAG2                                                   03844000
$NRMTERM EQU   $FLAG2                                                   03845000
$VALDTST EQU   $FLAG2                                                   03846000
$VALDDEV EQU   $FLAG2                                                   03847000
$DBLSLSH EQU   $FLAG2                                                   03848000
$NDR     EQU   $FLAG2                                                   03849000
@NM00041 EQU   $FLAG2                                                   03850000
$OLTACT  EQU   $FLAG1                                                   03851000
$NORELDV EQU   $FLAG1                                                   03852000
@NM00040 EQU   $FLAG1                                                   03853000
$OPTCHNG EQU   $FLAG1                                                   03854000
$DEVCHNG EQU   $FLAG1                                                   03855000
$TESTCNG EQU   $FLAG1                                                   03856000
$CNSLFG  EQU   $FLAG1                                                   03857000
$TEP3RD  EQU   $FLAG1                                                   03858000
@NM00039 EQU   $CDA+120                                                 03859000
$CUCNT   EQU   $CDA+118                                                 03860000
@NM00038 EQU   $CDA+117                                                 03861000
$PRTFORM EQU   $CDA+116                                                 03862000
$OPISCNT EQU   $CDA+114                                                 03863000
$OPNDCNT EQU   $CDA+112                                                 03864000
$GETMSZE EQU   $CDA+110                                                 03865000
$GRCNTS  EQU   $CDA+108                                                 03866000
$CTLCNT  EQU   $CDA+106                                                 03867000
$ACTLVL  EQU   $CDA+105                                                 03868000
$PRNTLVL EQU   $CDA+104                                                 03869000
$ERRCNTA EQU   $CDA+102                                                 03870000
$TLCNT   EQU   $CDA+100                                                 03871000
$TIMEALW EQU   $CDA+96                                                  03872000
$PTRAREA EQU   $CDA+92                                                  03873000
$GETMPTR EQU   $CDA+88                                                  03874000
$R13PTRT EQU   $CDA+84                                                  03875000
$R13PTR  EQU   $CDA+80                                                  03876000
$TEPEND  EQU   $CDA+76                                                  03877000
$PLINKDL EQU   $CDA+72                                                  03878000
$TEPBEGN EQU   $CDA+68                                                  03879000
$FRELPTR EQU   $CDA+64                                                  03880000
$HIGHADR EQU   $HIMOREC                                                 03881000
$LOMOREC EQU   $CDA+56                                                  03882000
$LOWADDR EQU   $OLTPTR                                                  03883000
$ENDCOMM EQU   $CDA+48                                                  03884000
$COMMON  EQU   $RCA                                                     03885000
$SLASHAD EQU   $CDA+32                                                  03886000
$PASSON  EQU   $CDA+28                                                  03887000
$TOLBRTB EQU   $CDA+24                                                  03888000
$SCTPTR8 EQU   $CDA+20                                                  03889000
$SCTPTR  EQU   $CDA+16                                                  03890000
$TBWDPTR EQU   $CDA+12                                                  03891000
$TFWDPTR EQU   $CDA+8                                                   03892000
@NM00037 EQU   $CDA                                                     03893000
@NM00036 EQU   $SCTTBLE+98                                              03894000
$SCTLWTC EQU   $SCTTBLE+96                                              03895000
$SCTLWTA EQU   $SCTTBLE+92                                              03896000
#EXT     EQU   $SCTTBLE+88                                              03897000
#PASS    EQU   $SCTTBLE+84                                              03898000
#TABLE   EQU   $SCTTBLE+80                                              03899000
#MSGIDAC EQU   $SCTTBLE+78                                              03900000
@NM00035 EQU   $SCTTBLE+71                                              03901000
$RETMASK EQU   $SCTTBLE+70                                              03902000
$R249255 EQU   $ROUTMSK+29                                              03903000
$R241248 EQU   $ROUTMSK+28                                              03904000
$R233240 EQU   $ROUTMSK+27                                              03905000
$R225232 EQU   $ROUTMSK+26                                              03906000
$R217224 EQU   $ROUTMSK+25                                              03907000
$R209216 EQU   $ROUTMSK+24                                              03908000
$R201208 EQU   $ROUTMSK+23                                              03909000
$R193200 EQU   $ROUTMSK+22                                              03910000
$R185192 EQU   $ROUTMSK+21                                              03911000
$R177184 EQU   $ROUTMSK+20                                              03912000
$R169176 EQU   $ROUTMSK+19                                              03913000
$R161168 EQU   $ROUTMSK+18                                              03914000
$R153160 EQU   $ROUTMSK+17                                              03915000
$R145152 EQU   $ROUTMSK+16                                              03916000
$R137144 EQU   $ROUTMSK+15                                              03917000
$R129136 EQU   $ROUTMSK+14                                              03918000
$R121128 EQU   $ROUTMSK+13                                              03919000
$R113120 EQU   $ROUTMSK+12                                              03920000
$R105112 EQU   $ROUTMSK+11                                              03921000
$R097104 EQU   $ROUTMSK+10                                              03922000
$R089096 EQU   $ROUTMSK+9                                               03923000
$R081088 EQU   $ROUTMSK+8                                               03924000
$R073080 EQU   $ROUTMSK+7                                               03925000
$R065072 EQU   $ROUTMSK+6                                               03926000
$R057064 EQU   $ROUTMSK+5                                               03927000
$R049056 EQU   $ROUTMSK+4                                               03928000
$R041048 EQU   $ROUTMSK+3                                               03929000
$R033040 EQU   $ROUTMSK+2                                               03930000
$R025032 EQU   $ROUTMSK+1                                               03931000
$R017024 EQU   $ROUTMSK                                                 03932000
$TOTFLG2 EQU   $SCTTBLE+39                                              03933000
@NM00034 EQU   $TOTFLG1                                                 03934000
@NM00033 EQU   $TOTFLG1                                                 03935000
@NM00032 EQU   $TOTFLG1                                                 03936000
$CURELOD EQU   $TOTFLG1                                                 03937000
$CTEQTT  EQU   $TOTFLG1                                                 03938000
@NM00031 EQU   $TOTFLG1                                                 03939000
@NM00030 EQU   $TOTFLG1                                                 03940000
$LINESHR EQU   $TOTFLG1                                                 03941000
@NM00029 EQU   $OLTFLG2                                                 03942000
@NM00028 EQU   $OLTFLG2                                                 03943000
@NM00027 EQU   $OLTFLG2                                                 03944000
@NM00026 EQU   $OLTFLG2                                                 03945000
@NM00025 EQU   $OLTFLG2                                                 03946000
@NM00024 EQU   $OLTFLG2                                                 03947000
@NM00023 EQU   $OLTFLG2                                                 03948000
$TALK    EQU   $OLTFLG2                                                 03949000
$DYCOM   EQU   $OLTFLGS                                                 03950000
@NM00022 EQU   $OLTFLGS                                                 03951000
$TRACE   EQU   $OLTFLGS                                                 03952000
$RETCODE EQU   $OLTFLGS                                                 03953000
$CONTCB  EQU   $OLTFLGS                                                 03954000
$RETAIN  EQU   $OLTFLGS                                                 03955000
$CLEANRT EQU   $OLTFLGS                                                 03956000
$MANINTV EQU   $OLTFLGS                                                 03957000
$OLTSIZE EQU   $SCTTBLE+34                                              03958000
$QSCTMOD EQU   $EXECFLG                                                 03959000
$CTRLMOD EQU   $EXECFLG                                                 03960000
$CLEANUP EQU   $EXECFLG                                                 03961000
$LSTPDEV EQU   $EXECFLG                                                 03962000
$ERRCNT  EQU   $EXECFLG                                                 03963000
$RTNSLCT EQU   $EXECFLG                                                 03964000
$MULTDEV EQU   $EXECFLG                                                 03965000
@NM00021 EQU   $EXECFLG                                                 03966000
$RMSKCNT EQU   $SCTTBLE+32                                              03967000
$SYNAME  EQU   $CDS8T19+4                                               03968000
$EXTSIG  EQU   $CDS8T19+3                                               03969000
$CDFLGS  EQU   $CDS8T19+1                                               03970000
$CDSCNT  EQU   $CDS8T19                                                 03971000
$PDEVDSC EQU   $SCTTBLE+16                                              03972000
$COMMCN  EQU   $CDSFLGS                                                 03973000
$CUSTSYM EQU   $CDSFLGS                                                 03974000
$TWOCHSW EQU   $CDSFLGS                                                 03975000
$SYMNAME EQU   $CDSFLGS                                                 03976000
$EXTINTC EQU   $CDSFLGS                                                 03977000
$CEVOL   EQU   $CDSFLGS                                                 03978000
$SHARED  EQU   $CDSFLGS                                                 03979000
$FPM     EQU   $CDSFLGS                                                 03980000
$LASTSUB EQU   $PDEVFLG                                                 03981000
@NM00020 EQU   $PDEVFLG                                                 03982000
@NM00019 EQU   $PDEVFLG                                                 03983000
@NM00018 EQU   $PDEVFLG                                                 03984000
$LASTDEV EQU   $PDEVFLG                                                 03985000
@NM00017 EQU   $PDEVFLG                                                 03986000
$EXFILPT EQU   $PDEVFLG                                                 03987000
$FPMOLD  EQU   $PDEVFLG                                                 03988000
$TSSSYM  EQU   $SCTTBLE+8                                               03989000
$SCTLEVL EQU   $SCTTBLE+7                                               03990000
$DRIVER  EQU   $SCTTBLE+6                                               03991000
$RT0916  EQU   $SCTTBLE+5                                               03992000
$RT0108  EQU   $SCTTBLE+4                                               03993000
$LOOPTST EQU   $ERROPT                                                  03994000
$LOOPERR EQU   $ERROPT                                                  03995000
$NERRPRT EQU   $ERROPT                                                  03996000
$NOCNTRL EQU   $ERROPT                                                  03997000
$ALTPRNT EQU   $ERROPT                                                  03998000
$CATERR  EQU   $ERROPT                                                  03999000
$ASTERIK EQU   $ERROPT                                                  04000000
$TESTERR EQU   $ERROPT                                                  04001000
$FSTCOMM EQU   $TESTOPT                                                 04002000
$INDEFLP EQU   $TESTOPT                                                 04003000
$NOPRT   EQU   $TESTOPT                                                 04004000
$PARAPRT EQU   $TESTOPT                                                 04005000
@NM00016 EQU   $TESTOPT                                                 04006000
$ERRLPCT EQU   $SCTTBLE                                                 04007000
$TLTEND  EQU   $RCAAREA+936                                             04008000
$EXITSAV EQU   $RCAAREA+864                                             04009000
$TRASCII EQU   $RCAAREA+608                                             04010000
@NM00015 EQU   $RCAAREA+605                                             04011000
$VTAMEND EQU   $RCAFLG                                                  04012000
$TPPOSTD EQU   $RCAFLG                                                  04013000
$NEWCT   EQU   $RCAFLG                                                  04014000
$ABNDALL EQU   $RCAFLG                                                  04015000
$CUTESTB EQU   $RCAFLG                                                  04016000
$CONSOLE EQU   $RCAFLG                                                  04017000
$TPLOGON EQU   $RCAFLG                                                  04018000
$UPDATE  EQU   $RCAFLG                                                  04019000
$DEVAREA EQU   $RCAAREA+600                                             04020000
$CTDVAR  EQU   $RCAAREA+596                                             04021000
$BUFFS   EQU   $RCAAREA+464                                             04022000
$TLTNIB  EQU   $CONSTNT+140                                             04023000
$TLTPRPL EQU   $CONSTNT+20                                              04024000
@NM00014 EQU   $CONSTNT+4                                               04025000
@NM00013 EQU   $CONSTNT+2                                               04026000
$USECNT  EQU   $CONSTNT                                                 04027000
$CURRTWA EQU   $POINTER+140                                             04028000
$CTNAME  EQU   $POINTER+132                                             04029000
$CTARGX  EQU   $POINTER+128                                             04030000
$COMINT  EQU   $POINTER+120                                             04031000
$QUEHNDL EQU   $POINTER+116                                             04032000
@NM00012 EQU   $POINTER+36                                              04033000
$RTNPTR  EQU   $POINTER+32                                              04034000
$TLTECB2 EQU   $POINTER+28                                              04035000
$TLTECB1 EQU   $POINTER+24                                              04036000
$CLEANP  EQU   $POINTER+20                                              04037000
$ABEND   EQU   $POINTER+16                                              04038000
$LSTAREA EQU   $POINTER+12                                              04039000
$FSTAREA EQU   $POINTER+8                                               04040000
$TOLTEP  EQU   $POINTER                                                 04041000
$TLTACB  EQU   $RCAAREA                                                 04042000
@NM00011 EQU   SRB+40                                                   04043000
@NM00010 EQU   SRB+38                                                   04044000
SRBPRIOR EQU   SRB+37                                                   04045000
SRBPKF   EQU   SRB+36                                                   04046000
SRBSAVE  EQU   SRB+32                                                   04047000
SRBPARM  EQU   SRB+28                                                   04048000
SRBRMTR  EQU   SRB+24                                                   04049000
SRBEP    EQU   SRB+20                                                   04050000
SRBPTCB  EQU   SRBFLC+4                                                 04051000
SRBPASID EQU   SRBFLC+2                                                 04052000
SRBCPAFF EQU   SRBFLC                                                   04053000
SRBASCB  EQU   SRB+8                                                    04054000
SRBFLNK  EQU   SRB+4                                                    04055000
SRBID    EQU   SRB                                                      04056000
IOSEND   EQU   IOSB+108                                                 04057000
IOSSKR   EQU   IOSEEKA+7                                                04058000
IOSSKH2  EQU   IOSSKHH+1                                                04059000
IOSSKH1  EQU   IOSSKHH                                                  04060000
IOSSKCC  EQU   IOSCCHH                                                  04061000
IOSSKBB  EQU   IOSEEKA+1                                                04062000
IOSSKM   EQU   IOSEEKA                                                  04063000
IOSEEK   EQU   IOSB+92                                                  04064000
IOSMDM   EQU   IOSB+91                                                  04065000
IOSMDB   EQU   IOSB+90                                                  04066000
IOSCKEY7 EQU   IOSCKEY                                                  04067000
IOSCKEY6 EQU   IOSCKEY                                                  04068000
IOSCKEY5 EQU   IOSCKEY                                                  04069000
IOSCKEY4 EQU   IOSCKEY                                                  04070000
@NM00006 EQU   IOSCKEY                                                  04071000
IOSFMSK  EQU   IOSB+88                                                  04072000
IOSCUDEV EQU   IOSPATH+1                                                04073000
@NM00005 EQU   IOSCHN                                                   04074000
IOSPATH3 EQU   IOSCHN                                                   04075000
IOSPATH2 EQU   IOSCHN                                                   04076000
IOSEXP   EQU   IOSCHN                                                   04077000
IOSGDP   EQU   IOSCHN                                                   04078000
IOSAFF   EQU   IOSB+85                                                  04079000
IOSRSS1B EQU   IOSB+84                                                  04080000
IOSDSID  EQU   IOSB+80                                                  04081000
IOSVST   EQU   IOSB+76                                                  04082000
IOSRST   EQU   IOSB+72                                                  04083000
IOSDIE   EQU   IOSB+68                                                  04084000
IOSABN   EQU   IOSB+64                                                  04085000
IOSNRM   EQU   IOSB+60                                                  04086000
IOSPCI   EQU   IOSB+56                                                  04087000
IOSERP   EQU   IOSB+52                                                  04088000
IOSPCHN  EQU   IOSB+48                                                  04089000
IOSSNS   EQU   IOSB+42                                                  04090000
IOSAPMSK EQU   IOSB+40                                                  04091000
IOSRES4A EQU   IOSB+36                                                  04092000
IOSUSE   EQU   IOSB+32                                                  04093000
IOSSRB   EQU   IOSB+28                                                  04094000
IOSCSWRC EQU   IOSCSW+5                                                 04095000
IOSTSB   EQU   IOSTATUS+1                                               04096000
IOSTSA   EQU   IOSTATUS                                                 04097000
IOSCSWCA EQU   IOSCSW                                                   04098000
IOSUCB   EQU   IOSB+16                                                  04099000
IOSOPT2X EQU   IOSOPT2                                                  04100000
IOSHTP   EQU   IOSOPT2                                                  04101000
IOSRELSE EQU   IOSOPT                                                   04102000
IOSAPR   EQU   IOSOPT                                                   04103000
IOSTSLL  EQU   IOSOPT                                                   04104000
IOSNERP  EQU   IOSOPT                                                   04105000
IOSPSLL  EQU   IOSOPT                                                   04106000
IOSQISCE EQU   IOSOPT                                                   04107000
IOSDEP   EQU   IOSOPT                                                   04108000
IOSBYP   EQU   IOSOPT                                                   04109000
IOSCOD   EQU   IOSB+13                                                  04110000
IOSPKY7  EQU   IOSPKEY                                                  04111000
IOSPGDPX EQU   IOSPKEY                                                  04112000
IOSIDR   EQU   IOSPKEY                                                  04113000
IOSLCL   EQU   IOSPKEY                                                  04114000
@NM00003 EQU   IOSPKEY                                                  04115000
IOSPGAD  EQU   IOSB+8                                                   04116000
IOSASID  EQU   IOSB+6                                                   04117000
IOSPRLVL EQU   IOSB+5                                                   04118000
IOSDVRID EQU   IOSB+4                                                   04119000
IOSPROC  EQU   IOSB+3                                                   04120000
IOSFLC7  EQU   IOSFLC                                                   04121000
IOSFLC6  EQU   IOSFLC                                                   04122000
IOSRWAIT EQU   IOSFLC                                                   04123000
IOSTP    EQU   IOSFLC                                                   04124000
IOSCC3WE EQU   IOSFLC                                                   04125000
IOSVERIF EQU   IOSDVALT                                                 04126000
IOSDVMNT EQU   IOSFLC                                                   04127000
IOSLOG   EQU   IOSFLB                                                   04128000
IOSBDCST EQU   IOSFLB                                                   04129000
IOSMSG   EQU   IOSFLB                                                   04130000
IOSFLB4  EQU   IOSFLB                                                   04131000
IOSFLB3  EQU   IOSFLB                                                   04132000
IOSFLB2  EQU   IOSFLB                                                   04133000
IOSSDR   EQU   IOSFLB                                                   04134000
IOSDIESE EQU   IOSFLB                                                   04135000
IOSIOSB  EQU   IOSFLA                                                   04136000
IOSDOM   EQU   IOSFLA                                                   04137000
IOSEX    EQU   IOSFLA                                                   04138000
IOSSMDB  EQU   IOSFLA                                                   04139000
IOSSMDA  EQU   IOSFLA                                                   04140000
IOSERR   EQU   IOSFLA                                                   04141000
IOSCCHN  EQU   IOSACHN                                                  04142000
IOSDCHN  EQU   IOSACHN                                                  04143000
CVTLEVL  EQU   CVTRELNO+2                                               04144000
CVTNUMB  EQU   CVTRELNO                                                 04145000
CVTMDL   EQU   CVTFIX+250                                               04146000
@NM00002 EQU   CVTFIX+248                                               04147000
@NM00001 EQU   CVTFIX                                                   04148000
CVTRV482 EQU   CVTXTNT2+128                                             04149000
CVTRV481 EQU   CVTXTNT2+124                                             04150000
CVTRV480 EQU   CVTXTNT2+120                                             04151000
CVTRV479 EQU   CVTXTNT2+118                                             04152000
CVTRV478 EQU   CVTXTNT2+117                                             04153000
CVTRV477 EQU   CVTXTNT2+116                                             04154000
CVTRV476 EQU   CVTXTNT2+115                                             04155000
CVTRV475 EQU   CVTXTNT2+114                                             04156000
CVTRV474 EQU   CVTRV466                                                 04157000
CVTRV473 EQU   CVTRV466                                                 04158000
CVTRV472 EQU   CVTRV466                                                 04159000
CVTRV471 EQU   CVTRV466                                                 04160000
CVTRV470 EQU   CVTRV466                                                 04161000
CVTRV469 EQU   CVTRV466                                                 04162000
CVTRV468 EQU   CVTRV466                                                 04163000
CVTRV467 EQU   CVTRV466                                                 04164000
CVTRV465 EQU   CVTRV457                                                 04165000
CVTRV464 EQU   CVTRV457                                                 04166000
CVTRV463 EQU   CVTRV457                                                 04167000
CVTRV462 EQU   CVTRV457                                                 04168000
CVTRV461 EQU   CVTRV457                                                 04169000
CVTRV460 EQU   CVTRV457                                                 04170000
CVTRV459 EQU   CVTRV457                                                 04171000
CVTRV458 EQU   CVTRV457                                                 04172000
CVTRV456 EQU   CVTXTNT2+108                                             04173000
CVTRV455 EQU   CVTXTNT2+104                                             04174000
CVTRV454 EQU   CVTXTNT2+100                                             04175000
CVTRV453 EQU   CVTXTNT2+96                                              04176000
CVTRV452 EQU   CVTXTNT2+94                                              04177000
CVTRV451 EQU   CVTXTNT2+92                                              04178000
CVTRV450 EQU   CVTXTNT2+90                                              04179000
CVTRV449 EQU   CVTXTNT2+88                                              04180000
CVTRV448 EQU   CVTXTNT2+87                                              04181000
CVTRV447 EQU   CVTXTNT2+86                                              04182000
CVTRV446 EQU   CVTRV438                                                 04183000
CVTRV445 EQU   CVTRV438                                                 04184000
CVTRV444 EQU   CVTRV438                                                 04185000
CVTRV443 EQU   CVTRV438                                                 04186000
CVTRV442 EQU   CVTRV438                                                 04187000
CVTRV441 EQU   CVTRV438                                                 04188000
CVTRV440 EQU   CVTRV438                                                 04189000
CVTRV439 EQU   CVTRV438                                                 04190000
CVTRV437 EQU   CVTRV429                                                 04191000
CVTRV436 EQU   CVTRV429                                                 04192000
CVTRV435 EQU   CVTRV429                                                 04193000
CVTRV434 EQU   CVTRV429                                                 04194000
CVTRV433 EQU   CVTRV429                                                 04195000
CVTRV432 EQU   CVTRV429                                                 04196000
CVTRV431 EQU   CVTRV429                                                 04197000
CVTRV430 EQU   CVTRV429                                                 04198000
CVTRV428 EQU   CVTXTNT2+80                                              04199000
CVTRV427 EQU   CVTXTNT2+76                                              04200000
CVTRV426 EQU   CVTXTNT2+72                                              04201000
CVTRV425 EQU   CVTXTNT2+68                                              04202000
CVTATACT EQU   CVTATCVT                                                 04203000
CVTRV423 EQU   CVTXTNT2+62                                              04204000
CVTRV422 EQU   CVTXTNT2+60                                              04205000
CVTRV421 EQU   CVTXTNT2+58                                              04206000
CVTRV420 EQU   CVTXTNT2+56                                              04207000
CVTRV419 EQU   CVTXTNT2+55                                              04208000
CVTRV418 EQU   CVTXTNT2+54                                              04209000
CVTRV417 EQU   CVTRV409                                                 04210000
CVTRV416 EQU   CVTRV409                                                 04211000
CVTRV415 EQU   CVTRV409                                                 04212000
CVTRV414 EQU   CVTRV409                                                 04213000
CVTRV413 EQU   CVTRV409                                                 04214000
CVTRV412 EQU   CVTRV409                                                 04215000
CVTRV411 EQU   CVTRV409                                                 04216000
CVTRV410 EQU   CVTRV409                                                 04217000
CVTRV408 EQU   CVTRV400                                                 04218000
CVTRV407 EQU   CVTRV400                                                 04219000
CVTRV406 EQU   CVTRV400                                                 04220000
CVTRV405 EQU   CVTRV400                                                 04221000
CVTRV404 EQU   CVTRV400                                                 04222000
CVTRV403 EQU   CVTRV400                                                 04223000
CVTRV402 EQU   CVTRV400                                                 04224000
CVTRV401 EQU   CVTRV400                                                 04225000
CVTICB   EQU   CVTXTNT2+48                                              04226000
CVTSKTA  EQU   CVTXTNT2+44                                              04227000
CVTSHSB  EQU   CVTSHS                                                   04228000
CVTRSV98 EQU   CVTXTNT2+36                                              04229000
CVTRSV97 EQU   CVTXTNT2+34                                              04230000
CVTRSV96 EQU   CVTXTNT2+32                                              04231000
CVTOLTEP EQU   CVTXTNT2+28                                              04232000
CVTQIDA  EQU   CVTQID+1                                                 04233000
CVTRSV95 EQU   CVTQID                                                   04234000
CVTRSV94 EQU   CVTXTNT2+20                                              04235000
CVTRSV93 EQU   CVTXTNT2+16                                              04236000
CVTRSV92 EQU   CVTXTNT2+12                                              04237000
CVTDEBVR EQU   CVTXTNT2+8                                               04238000
CVTRSV91 EQU   CVTXTNT2+6                                               04239000
CVTRSV9H EQU   CVTFLGBT                                                 04240000
CVTRSV9G EQU   CVTFLGBT                                                 04241000
CVTRSV9F EQU   CVTFLGBT                                                 04242000
CVTRSV9E EQU   CVTFLGBT                                                 04243000
CVTRSV9D EQU   CVTFLGBT                                                 04244000
CVTRSV9C EQU   CVTFLGBT                                                 04245000
CVTVME   EQU   CVTFLGBT                                                 04246000
CVTNPE   EQU   CVTFLGBT                                                 04247000
CVTNUCLS EQU   CVTXTNT2+4                                               04248000
CVTDSSVA EQU   CVTDSSV+1                                                04249000
CVTRSV89 EQU   CVTDSSV                                                  04250000
CVTRSV88 EQU   CVTXTNT1+8                                               04251000
CVTRSV87 EQU   CVTXTNT1+4                                               04252000
CVTFACHN EQU   CVTXTNT1                                                 04253000
CVTRV488 EQU   CVTMAP+412                                               04254000
CVTRV487 EQU   CVTMAP+408                                               04255000
CVTRV486 EQU   CVTMAP+404                                               04256000
CVTRV485 EQU   CVTMAP+400                                               04257000
CVTACTAP EQU   CVTMAP+396                                               04258000
CVTAUTH  EQU   CVTMAP+392                                               04259000
CVTATMCA EQU   CVTATMCT+1                                               04260000
CVTATMST EQU   CVTATMCT                                                 04261000
CVTRSV61 EQU   CVTMAP+384                                               04262000
CVTVOLT1 EQU   CVTVOLM1+1                                               04263000
CVTVOLI1 EQU   CVTVOLF1                                                 04264000
CVTSTOA  EQU   CVTMAP+376                                               04265000
CVTRSV58 EQU   CVTMAP+374                                               04266000
CVTRSV57 EQU   CVTMAP+372                                               04267000
CVTDDCE  EQU   CVTMAP+368                                               04268000
CVTPNWFR EQU   CVTMAP+364                                               04269000
CVTSMF   EQU   CVTMAP+360                                               04270000
CVTSULK  EQU   CVTMAP+358                                               04271000
CVTSLKO  EQU   CVTSYSK                                                  04272000
CVTSLKP  EQU   CVTSYSK                                                  04273000
CVTSLKQ  EQU   CVTSYSK                                                  04274000
CVTSLKR  EQU   CVTSYSK                                                  04275000
CVTRSV56 EQU   CVTSYSK                                                  04276000
CVTRSV55 EQU   CVTSYSK                                                  04277000
CVTRSV54 EQU   CVTSYSK                                                  04278000
CVTRSV53 EQU   CVTSYSK                                                  04279000
CVTRSV52 EQU   CVTA1F1                                                  04280000
CVTRSV51 EQU   CVTA1F1                                                  04281000
CVTRSV50 EQU   CVTA1F1                                                  04282000
CVTRSV49 EQU   CVTA1F1                                                  04283000
CVTRSV48 EQU   CVTA1F1                                                  04284000
CVTRSV47 EQU   CVTA1F1                                                  04285000
CVTSRSW  EQU   CVTA1F1                                                  04286000
CVTPFSW  EQU   CVTA1F1                                                  04287000
CVTPCVT  EQU   CVTMAP+352                                               04288000
CVTRSV46 EQU   CVTMAP+344                                               04289000
CVTRSV45 EQU   CVTMAP+340                                               04290000
CVTRSV44 EQU   CVTMAP+338                                               04291000
CVTRSV43 EQU   CVTMAP+336                                               04292000
CVTHJESA EQU   CVTHJES+1                                                04293000
CVTRSV42 EQU   CVTHJES                                                  04294000
CVTEXT2A EQU   CVTEXT2+1                                                04295000
CVTRSV41 EQU   CVTEXT2                                                  04296000
CVTAPFA  EQU   CVTAPF+1                                                 04297000
CVTRSV40 EQU   CVTAPF                                                   04298000
CVTRV518 EQU   CVTINTLA                                                 04299000
CVTRV517 EQU   CVTERPV                                                  04300000
CVTEORM  EQU   CVTMAP+312                                               04301000
CVTMCHPR EQU   CVTMAP+308                                               04302000
CVTTZ    EQU   CVTMAP+304                                               04303000
CVTJEPS  EQU   CVTMAP+300                                               04304000
CVTJESCT EQU   CVTMAP+296                                               04305000
CVTMODE  EQU   CVTMAP+292                                               04306000
CVTPTRV  EQU   CVTMAP+288                                               04307000
CVTREAL  EQU   CVTMAP+284                                               04308000
CVTRSV39 EQU   CVTMAP+280                                               04309000
CVTRSV38 EQU   CVTMAP+276                                               04310000
CVTDMSRA EQU   CVTDMSR+1                                                04311000
CVTRSV37 EQU   CVTDMSR                                                  04312000
CVTQMSGA EQU   CVTQMSG+1                                                04313000
CVTRSV36 EQU   CVTQMSG                                                  04314000
CVTAMFF  EQU   CVTMAP+264                                               04315000
CVTPURGA EQU   CVTPURG+1                                                04316000
CVTRSV35 EQU   CVTPURG                                                  04317000
CVTCBSP  EQU   CVTMAP+256                                               04318000
CVTATERA EQU   CVTATER+1                                                04319000
CVTSYST  EQU   CVTATER                                                  04320000
CVTVOLT2 EQU   CVTTAT                                                   04321000
CVTVOLI2 EQU   CVTVOLF2                                                 04322000
CVTAQAVB EQU   CVTAQAVT+1                                               04323000
CVTRSV34 EQU   CVTTCMFG                                                 04324000
CVTRSV33 EQU   CVTTCMFG                                                 04325000
CVTRSV32 EQU   CVTTCMFG                                                 04326000
CVTRSV31 EQU   CVTTCMFG                                                 04327000
CVTRSV30 EQU   CVTTCMFG                                                 04328000
CVTRSV29 EQU   CVTTCMFG                                                 04329000
CVTRSV28 EQU   CVTTCMFG                                                 04330000
CVTTCRDY EQU   CVTTCMFG                                                 04331000
CVTGTFA  EQU   CVTGTF+1                                                 04332000
CVTRSV27 EQU   CVTGTFST                                                 04333000
CVTRNIO  EQU   CVTGTFST                                                 04334000
CVTUSR   EQU   CVTGTFST                                                 04335000
CVTRV318 EQU   CVTFORM                                                  04336000
CVTRV317 EQU   CVTTMODE                                                 04337000
CVTRV316 EQU   CVTSTATE                                                 04338000
CVTRV315 EQU   CVTGTFS                                                  04339000
CVTGTFAV EQU   CVTGTFS                                                  04340000
CVT0SCR1 EQU   CVTMAP+232                                               04341000
CVTRV515 EQU   CVTMAP+228                                               04342000
CVTRMS   EQU   CVTMAP+224                                               04343000
CVTPATCH EQU   CVTMAP+220                                               04344000
CVTTSCE  EQU   CVTMAP+216                                               04345000
CVTLNKSC EQU   CVTMAP+214                                               04346000
CVTQABST EQU   CVTMAP+212                                               04347000
CVTMDLDS EQU   CVTMAP+208                                               04348000
CVTUSER  EQU   CVTMAP+204                                               04349000
CVTABEND EQU   CVTMAP+200                                               04350000
CVTSMCA  EQU   CVTMAP+196                                               04351000
CVTRSV18 EQU   CVTMAP+192                                               04352000
CVTQLPAQ EQU   CVTMAP+188                                               04353000
CVTQCDSR EQU   CVTMAP+184                                               04354000
CVTRSV17 EQU   CVTOPTB                                                  04355000
CVTRSV16 EQU   CVTOPTB                                                  04356000
CVTFP    EQU   CVTOPTB                                                  04357000
CVTAPTHR EQU   CVTOPTB                                                  04358000
CVTNLOG  EQU   CVTOPTB                                                  04359000
CVTTOD   EQU   CVTOPTB                                                  04360000
CVTCTIMS EQU   CVTOPTB                                                  04361000
CVTPROT  EQU   CVTOPTB                                                  04362000
CVTXPFP  EQU   CVTOPTA                                                  04363000
CVTASCII EQU   CVTOPTA                                                  04364000
CVTRSV13 EQU   CVTOPTA                                                  04365000
CVTRSV12 EQU   CVTOPTA                                                  04366000
CVTNIP   EQU   CVTOPTA                                                  04367000
CVTDDR   EQU   CVTOPTA                                                  04368000
CVTAPR   EQU   CVTOPTA                                                  04369000
CVTCCH   EQU   CVTOPTA                                                  04370000
CVTSNCTR EQU   CVTMAP+180                                               04371000
CVTQMWR  EQU   CVTMAP+176                                               04372000
CVTQOCR  EQU   CVTMAP+172                                               04373000
CVT1EF00 EQU   CVTMAP+168                                               04374000
CVTMZ00  EQU   CVTMAP+164                                               04375000
CVTHEAD  EQU   CVTMAP+160                                               04376000
CVTRSV11 EQU   CVTMAP+156                                               04377000
CVT0PT01 EQU   CVTMAP+152                                               04378000
CVTMSER  EQU   CVTMAP+148                                               04379000
CVTRV516 EQU   CVTIERLC                                                 04380000
CVTILCH  EQU   CVTMAP+140                                               04381000
CVT0DS   EQU   CVTMAP+136                                               04382000
CVTFBOSV EQU   CVTMAP+132                                               04383000
CVTNUCB  EQU   CVTMAP+128                                               04384000
CVTIXAVL EQU   CVTMAP+124                                               04385000
CVTIOQET EQU   CVTMAP+120                                               04386000
CVTDCBA  EQU   CVTMAP+117                                               04387000
CVTMVS2  EQU   CVTDCB                                                   04388000
CVT6DAT  EQU   CVTDCB                                                   04389000
CVT4MPS  EQU   CVTDCB                                                   04390000
CVTRSV09 EQU   CVTDCB                                                   04391000
CVT4MS1  EQU   CVTDCB                                                   04392000
CVT2SPS  EQU   CVTDCB                                                   04393000
CVT1SSS  EQU   CVTDCB                                                   04394000
CVTRSV08 EQU   CVTDCB                                                   04395000
CVTSTB   EQU   CVTMAP+112                                               04396000
CVTQTD00 EQU   CVTMAP+108                                               04397000
CVTQTE00 EQU   CVTMAP+104                                               04398000
CVTCUCB  EQU   CVTMAP+100                                               04399000
CVTSJQ   EQU   CVTMAP+96                                                04400000
CVTPBLDL EQU   CVTMAP+92                                                04401000
CVTTPC   EQU   CVTMAP+88                                                04402000
CVTSVDCB EQU   CVTMAP+84                                                04403000
CVTBRET  EQU   CVTMAP+82                                                04404000
CVTEXIT  EQU   CVTMAP+80                                                04405000
CVT0FN00 EQU   CVTMAP+76                                                04406000
CVTDARA  EQU   CVTDAR+1                                                 04407000
CVTRSV07 EQU   CVTFLGS1                                                 04408000
CVTRSV06 EQU   CVTFLGS1                                                 04409000
CVTRSV05 EQU   CVTFLGS1                                                 04410000
CVTRSV04 EQU   CVTFLGS1                                                 04411000
CVTRSV03 EQU   CVTFLGS1                                                 04412000
CVTRSV02 EQU   CVTFLGS1                                                 04413000
CVTRSV01 EQU   CVTFLGS1                                                 04414000
CVTDMPLK EQU   CVTFLGS1                                                 04415000
CVTXITP  EQU   CVTMAP+68                                                04416000
CVTZDTAB EQU   CVTMAP+64                                                04417000
CVTMSLT  EQU   CVTMAP+60                                                04418000
CVTDATE  EQU   CVTMAP+56                                                04419000
CVTBTERM EQU   CVTMAP+52                                                04420000
CVTSYSAD EQU   CVTMAP+48                                                04421000
CVTXTLER EQU   CVTMAP+44                                                04422000
CVTILK2  EQU   CVTMAP+40                                                04423000
CVTILK1  EQU   CVTMAP+36                                                04424000
CVTPRLTV EQU   CVTMAP+32                                                04425000
CVTPCNVT EQU   CVTMAP+28                                                04426000
CVT0VL00 EQU   CVTMAP+24                                                04427000
CVTXAPG  EQU   CVTMAP+20                                                04428000
CVTBUF   EQU   CVTMAP+16                                                04429000
CVTJOB   EQU   CVTMAP+12                                                04430000
CVTLINK  EQU   CVTMAP+8                                                 04431000
CVT0EF00 EQU   CVTMAP+4                                                 04432000
CVTTCBP  EQU   CVTMAP                                                   04433000
CVT      EQU   CVTMAP                                                   04434000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04435000
@RT00440 EQU   S2FC0200                                                 04436000
@RF00440 EQU   S2FC0250                                                 04437000
@RT00444 EQU   S2FC0250                                                 04438000
@RF00446 EQU   S2FC0260                                                 04439000
@RT00464 EQU   S2FC0900                                                 04440000
@RT00466 EQU   S2FC0770                                                 04441000
@RT00468 EQU   S2FC0800                                                 04442000
@RF00472 EQU   S2FC0770                                                 04443000
@RF00477 EQU   S2FC0770                                                 04444000
@RF00503 EQU   S2FC0400                                                 04445000
@RF00512 EQU   S2FC0400                                                 04446000
@RC00546 EQU   @RC00542                                                 04447000
@RF00562 EQU   S2FC0740                                                 04448000
@RC00565 EQU   S2FC0740                                                 04449000
@RF00661 EQU   S2FC0910                                                 04450000
@RT00682 EQU   S2FC1100                                                 04451000
@RT00688 EQU   S2FC1300                                                 04452000
@RT00703 EQU   S2FC1200                                                 04453000
@RF00700 EQU   S2FC9999                                                 04454000
@RF00742 EQU   S2FC9900                                                 04455000
@RF00744 EQU   S2FC9900                                                 04456000
@ENDDATA EQU   *                                                        04457000
         END   ISTSC02F,(C'PLS1814',0701,75225)                         04458000
