         TITLE 'ISTZIFOA/AOA-VS1/MOA-VS2: 3270 LOCAL CONTACT/DISCON COM*00001000
               MPLETION '                                               00002000
ISTZIFOA CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZIFOA  78.188'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
*                                                                  0587 00011000
*/********************************************************************/ 00012000
*/* MAIN PROCEDURE -                                                 */ 00013000
*/* DEQUEUE OLDEST ELEMENT FROM WAIT QUEUE                           */ 00014000
*/* IF ELEMENT IS AN LSCB AND FEEDBACK IS NOT REQUIRED               */ 00015000
*/*    DEALLOCATE LSCB                                               */ 00016000
*/* IF ELEMENT IS AN LCPB OR FEEDBACK IS REQUIRED                    */ 00017000
*/*    CALL PHASE IFNA00B TO PROCESS FSB (AND BUFFER)                */ 00018000
*/*    AND DEALLOCATE ELEMENT IF IT IS AN LSCB                       */ 00019000
*/* CALL PHASE IFNA00A TO PROCESS FMCB/DNCB FLAGS                    */ 00020000
*/********************************************************************/ 00021000
*                                                                  0587 00022000
*                                                                  0587 00023000
*/* TPZSAVE (7,12,14) BASE AC(ICOA)                                  */ 00024000
*                                                                  0587 00025000
*   DO;                                                            0587 00026000
*     RFY                                                          0588 00027000
*      (GPR01P,                                                    0588 00028000
*       GPR12P,                                                    0588 00029000
*       GPR13P,                                                    0588 00030000
*       GPR14P) RSTD;                                              0588 00031000
*     GEN(PRINT OFF);                                              0589 00032000
*                                                                  0589 00033000
         PRINT OFF                                                      00034000
*/* ATBUILD (ISTZSAVE)                                               */ 00035000
*/* END OF ATBUILD                                                   */ 00036000
*                                                                  0590 00037000
*     GEN(PRINT ON);                                               0590 00038000
         PRINT ON                                                       00039000
*     RFY                                                          0591 00040000
*       ISTZSAVE BASED(GPR13P);                                    0591 00041000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0592 00042000
         STM   7,12,ZSAZSVVR+0(13)                                      00043000
*     GEN SETS(GPR12P);                                            0593 00044000
         BALR  GPR12P,0                                                 00045000
@TSTART  DS    0H                                                       00046000
         USING @TSTART,GPR12P                                           00047000
*     GEN(PRINT OFF);                                              0594 00048000
*                                                                  0594 00049000
         PRINT OFF                                                      00050000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00051000
*/* END OF ATBUILD                                                   */ 00052000
*                                                                  0595 00053000
*     GEN(PRINT ON);                                               0595 00054000
         PRINT ON                                                       00055000
*     GPR01P->RPHCRR->CRACRR->ZCREICOA='1'B;                       0596 00056000
         L     @15,RPHCRR(,GPR01P)                                 0596 00057000
         L     @15,CRACRR(,@15)                                    0596 00058000
         OI    ZCREICOA(@15),B'00000010'                           0596 00059000
*     ZSAZACTV='1'B;                                               0597 00060000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0597 00061000
*     ZSAZTRAC='ICOA';                                             0598 00062000
         MVC   ZSAZTRAC(4,GPR13P),@CC04560                         0598 00063000
*     ZSAZSVRR=GPR14P;                                             0599 00064000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0599 00065000
*     GPR13P=ZSAZSVFC;                                             0600 00066000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0600 00067000
*     RFY                                                          0601 00068000
*      (GPR01P) UNRSTD;                                            0601 00069000
*     RFY                                                          0602 00070000
*      (GPR14P) UNRSTD;                                            0602 00071000
*   END;                                                           0603 00072000
*                                                                  0603 00073000
*/* END TPZSAVE                                                      */ 00074000
*                                                                  0604 00075000
*                                   /* SAVE REGS AND SET UP BASE     */ 00076000
*/* TPDEQ (,FMCLCPBQ) RETPTR(PTRLSC)                                 */ 00077000
*                                                                  0604 00078000
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */ 00079000
*     DCL                                                          0605 00080000
*       FMZCA024 BIT(32) CONSTANT('80000000'X);                    0605 00081000
*     DCL                                                          0606 00082000
*       FMZCB024 BIT(32) CONSTANT('7FFFFFFF'X);                    0606 00083000
*     RFY                                                          0607 00084000
*      (GPR00P,                                                    0607 00085000
*       GPR01P,                                                    0607 00086000
*       GPR14P,                                                    0607 00087000
*       GPR15P) RSTD;                                              0607 00088000
*     RFY                                                          0608 00089000
*       ISTWKE;                                                    0608 00090000
*     GPR15P=ADDR(FMCLCPBQ);        /* ADDRESS QUEUE POINTER         */ 00091000
         LA    GPR15P,FMCLCPBQ(,PTRFMC)                            0609 00092000
*     GPR14P=GPR15P->PABWEQA|FMZCA024;                             0610 00093000
         L     @11,@CF01262                                        0610 00094000
         L     GPR14P,PABWEQA(,GPR15P)                             0610 00095000
         OR    GPR14P,@11                                          0610 00096000
*     IF GPR14P=FMZCA024 THEN                                      0611 00097000
         CLR   GPR14P,@11                                          0611 00098000
         BE    @RT00611                                            0611 00099000
*       ;                                                          0612 00100000
*     ELSE                                                         0613 00101000
*       DO;                                                        0613 00102000
*FMZL1024:                                                         0614 00103000
*         ;                                                        0614 00104000
FMZL1024 DS    0H                                                  0615 00105000
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA024);                    0615 00106000
         B     @DE00615                                            0615 00107000
@DL00615 DS    0H                                                  0616 00108000
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0616 00109000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0616 00110000
*           GPR14P=GPR15P->PABWEQA;                                0617 00111000
         L     GPR14P,PABWEQA(,GPR15P)                             0617 00112000
*         END;                                                     0618 00113000
@DE00615 L     @11,@CF01262                                        0618 00114000
         CL    @11,WKECHAIN(,GPR14P)                               0618 00115000
         BNE   @DL00615                                            0618 00116000
*         GPR00P=FMZCA024;                                         0619 00117000
         LR    GPR00P,@11                                          0619 00118000
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0620 00119000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0620 00120000
*         BC(7,FMZL1024);                                          0621 00121000
         BC    7,FMZL1024                                          0621 00122000
*         GPR14P->WKECHAIN=0;                                      0622 00123000
         SLR   @11,@11                                             0622 00124000
         ST    @11,WKECHAIN(,GPR14P)                               0622 00125000
*       END;                                                       0623 00126000
*ISTA0024:                                                         0624 00127000
*     ;                                                            0624 00128000
@RT00611 DS    0H                                                  0624 00129000
ISTA0024 DS    0H                                                  0625 00130000
*     GPR14P=GPR14P&FMZCB024;                                      0625 00131000
         N     GPR14P,@CF02700                                     0625 00132000
*     PTRLSC=GPR14P;                                               0626 00133000
         LR    PTRLSC,GPR14P                                       0626 00134000
*     RFY                                                          0627 00135000
*      (GPR00P,                                                    0627 00136000
*       GPR01P,                                                    0627 00137000
*       GPR14P,                                                    0627 00138000
*       GPR15P) UNRSTD;                                            0627 00139000
*   END;                            /* END TPDEQ GENERATION REMOVE 0628 00140000
*                                      OLDEST ELEMENT FROM FMCLCPBQ  */ 00141000
*   RFY                                                            0629 00142000
*     PTRG08 RSTD;                  /* RESTRICT INTERNAL CONTACT   0629 00143000
*                                      DISCONNECT SWITCH             */ 00144000
*   IF PTRLSC=0 THEN                /* IF NO WAIT Q          @ZA16226*/ 00145000
         SLR   @09,@09                                             0630 00146000
         CR    PTRLSC,@09                                          0630 00147000
         BNE   @RF00630                                            0630 00148000
*     DO;                           /* OPERATION POSTED      @ZA16226*/ 00149000
*       IF PTRZLB>0 THEN            /* ANY FSB?              @ZA16226*/ 00150000
         CR    PTRZLB,@09                                          0632 00151000
         BNH   @RF00632                                            0632 00152000
*         DO;                       /* RELEASE IT            @ZA16226*/ 00153000
*           PTRG07=PTRZLB;          /* DFB0 PARM             @ZA16226*/ 00154000
         LR    PTRG07,PTRZLB                                       0634 00155000
*           ZCRPCOD1='00'B;         /* DFB0 PARM             @ZA16226*/ 00156000
         L     @09,RPHCRR(,PTRRPH)                                 0635 00157000
         L     @09,CRACRR(,@09)                                    0635 00158000
         MVI   ZCRPCOD1(@09),B'00000000'                           0635 00159000
*           ZCRPCOD1='1'B;          /* DFB0 PARM             @ZA16226*/ 00160000
         MVI   ZCRPCOD1(@09),B'10000000'                           0636 00161000
*           CALL ZPSZDFB0;          /* RELEASE BUFFER        @ZA16226*/ 00162000
         L     @09,ATCZPSVT(,PTRATC)                               0637 00163000
         L     @15,ZPSZDFB0(,@09)                                  0637 00164000
         BALR  @14,@15                                             0637 00165000
*         END;                      /*                       @ZA16226*/ 00166000
*       ELSE                                                       0639 00167000
*         ;                         /* NO BUFFER, EXIT       @ZA16226*/ 00168000
@RF00632 DS    0H                                                  0640 00169000
*     END;                          /*                       @ZA16226*/ 00170000
*   ELSE                            /* WAIT Q ELEMENT FND    @ZA16226*/ 00171000
*     DO;                           /*                       @ZA16226*/ 00172000
         B     @RC00630                                            0641 00173000
@RF00630 DS    0H                                                  0642 00174000
*       IF LSCZRT0B='1'B THEN       /* IF DISCONNECT ELEMENT         */ 00175000
         TM    LSCZRT0B(PTRLSC),B'00010000'                        0642 00176000
         BNO   @RF00642                                            0642 00177000
*         PTRG08=4;                 /* SET DISCONNECT SWITCH         */ 00178000
         LA    PTRG08,4                                            0643 00179000
*       ELSE                                                       0644 00180000
*         PTRG08=0;                 /* IF NOT DISCONNECT ELEMENT THEN   00181000
*                                      SET CONTACT SWITCH            */ 00182000
         B     @RC00642                                            0644 00183000
@RF00642 SLR   PTRG08,PTRG08                                       0644 00184000
*       IF PTRZLB>0 THEN            /* IF FSB PASSED                 */ 00185000
@RC00642 LTR   PTRZLB,PTRZLB                                       0645 00186000
         BNP   @RF00645                                            0645 00187000
*         LSCFDBA=ADDR(ZLBFSB);     /* POINT ELEMENT TO FSB          */ 00188000
         LA    @09,ZLBFSB(,PTRZLB)                                 0646 00189000
         ST    @09,LSCFDBA(,PTRLSC)                                0646 00190000
*       ELSE                                                       0647 00191000
*         ;                         /* NULL ELSE IF NO ZLB PASSED    */ 00192000
@RF00645 DS    0H                                                  0648 00193000
*       IF FMCMODE=FMCRCD THEN                                     0648 00194000
         CLC   FMCMODE(8,PTRFMC),@CC03795                          0648 00195000
         BNE   @RF00648                                            0648 00196000
*         DO;                       /* IF RECORD MODE        @XM08632*/ 00197000
*           FMCZFD06='0'B;          /* CLEAR DISCONNECT PENDING    0650 00198000
*                                                            @XM08632*/ 00199000
         NI    FMCZFD06(PTRFMC),B'01111111'                        0650 00200000
*           FMCZF002='0'B;          /* CLEAR I/O SCHEDULING SUSPENDED   00201000
*                                                            @XM08632*/ 00202000
         NI    FMCZF002(PTRFMC),B'10111111'                        0651 00203000
*         END;                      /* END RECORD MODE       @XM08632*/ 00204000
*       ELSE                                                       0653 00205000
*         ;                         /* NOT RECORD MODE       @XM08632*/ 00206000
@RF00648 DS    0H                                                  0654 00207000
*/* SEGMENT(IFOA00A)REQUEST                                          */ 00208000
*                                                                  0654 00209000
*       DO;                                                        0654 00210000
*         GOTO IFOA00A;                                            0655 00211000
         B     IFOA00A                                             0655 00212000
*IFOA00A#:                                                         0656 00213000
*       END;                        /* CALL PHASE TO PROCESS CONTACT    00214000
*                                      /DISCONNECT FLAGS     @ZM10887*/ 00215000
IFOA00A# DS    0H                                                  0657 00216000
*       RFY                                                        0657 00217000
*         PTRG10 RSTD;              /*                       @XM18668*/ 00218000
*       PTRG10=0;                   /*                       @XM18668*/ 00219000
         SLR   PTRG10,PTRG10                                       0658 00220000
*       IF LSCTYPE=LSTYPE           /* IF ELEMENT IS A LSCB          */ 00221000
*           &(LSCZRT04='0'B         /* & (FEEDBACK NOT REQUIRED      */ 00222000
*           |LSCEXRES='1'B|ZCRIF0E1='1'B)/* | EXCEPTION RESPONSE OR     00223000
*                                      SPECIAL CASE DISC,FREE LSCB 0659 00224000
*                                                            @ZA31248*/ 00225000
*         THEN                                                     0659 00226000
         CLI   LSCTYPE(PTRLSC),X'DF'                               0659 00227000
         BNE   @RF00659                                            0659 00228000
         TM    LSCZRT04(PTRLSC),B'00001000'                        0659 00229000
         BZ    @RT00659                                            0659 00230000
         TM    LSCEXRES(PTRLSC),B'00001000'                        0659 00231000
         BO    @RT00659                                            0659 00232000
         L     @11,RPHCRR(,PTRRPH)                                 0659 00233000
         L     @11,CRACRR(,@11)                                    0659 00234000
         TM    ZCRIF0E1(@11),B'00001000'                           0659 00235000
         BNO   @RF00659                                            0659 00236000
@RT00659 DS    0H                                                  0660 00237000
*         IF PTRZLB^>0              /* IF NO FSB PASSED      @XM18668*/ 00238000
*           THEN                                                   0660 00239000
         LTR   PTRZLB,PTRZLB                                       0660 00240000
         BP    @RF00660                                            0660 00241000
*           PTRG10=1;               /* IND DEALLOCATE LSCB   @XM18668*/ 00242000
         LA    PTRG10,1                                            0661 00243000
*         ELSE                                                     0662 00244000
*           IF ZLBCOMP^=ZLBCONRJ    /* IF NOT WR W/CONTACT FAIL      */ 00245000
*             THEN                                                 0662 00246000
         B     @RC00660                                            0662 00247000
@RF00660 CLI   ZLBCOMP(PTRZLB),X'10'                               0662 00248000
         BE    @RF00662                                            0662 00249000
*             PTRG10=1;             /* IND DEALLOCATE LSCB   @XM18668*/ 00250000
         LA    PTRG10,1                                            0663 00251000
*           ELSE                                                   0664 00252000
*             ;                     /*                       @XM18668*/ 00253000
@RF00662 DS    0H                                                  0665 00254000
*       ELSE                                                       0665 00255000
*         ;                         /*                       @XM18668*/ 00256000
@RF00659 DS    0H                                                  0666 00257000
*       IF PTRG10=1 THEN                                           0666 00258000
@RC00659 C     PTRG10,@CF00035                                     0666 00259000
         BNE   @RF00666                                            0666 00260000
*         DO;                       /*                       @XM18668*/ 00261000
*           IF LSCFDBA^=0 THEN      /* IF FSB ATTACHED TO LSCB       */ 00262000
         L     @11,LSCFDBA(,PTRLSC)                                0668 00263000
         LTR   @11,@11                                             0668 00264000
         BZ    @RF00668                                            0668 00265000
*             LSCFDBA=LSCFDBA-DISFSB;/* POINT LSCB TO BUFFER         */ 00266000
         SL    @11,DISFSB                                          0669 00267000
         ST    @11,LSCFDBA(,PTRLSC)                                0669 00268000
*           ELSE                                                   0670 00269000
*             ;                     /* NO POINTER TO DECREMENT       */ 00270000
@RF00668 DS    0H                                                  0671 00271000
*           ZCRPCOD1=0;             /* ZERO PARAMETER BYTE           */ 00272000
         L     @11,RPHCRR(,PTRRPH)                                 0671 00273000
         L     @11,CRACRR(,@11)                                    0671 00274000
         MVI   ZCRPCOD1(@11),X'00'                                 0671 00275000
*           ZCRPLSCB='1'B;          /* TURN ON PARAMETER BIT TO    0672 00276000
*                                      DEALLOCATE LSCB               */ 00277000
         OI    ZCRPLSCB(@11),B'00001000'                           0672 00278000
*           CALL ZPSZDFB0;          /* GO DEALLOCATE LSCB            */ 00279000
         L     @11,ATCZPSVT(,PTRATC)                               0673 00280000
         L     @15,ZPSZDFB0(,@11)                                  0673 00281000
         BALR  @14,@15                                             0673 00282000
*           ZCRIF0E1='0'B;          /* CLEAR SPECIAL CASE DISC. SW.     00283000
*                                                            @ZA31248*/ 00284000
         L     @11,RPHCRR(,PTRRPH)                                 0674 00285000
         L     @11,CRACRR(,@11)                                    0674 00286000
         NI    ZCRIF0E1(@11),B'11110111'                           0674 00287000
*         END;                      /* END DO FOR LSCB AND FDBK NOT     00288000
*                                      REQUIRED                      */ 00289000
*       ELSE                        /* IF ELEMENT IS NOT AN LSCB OR     00290000
*                                      FEEDBACK IS REQUIRED          */ 00291000
*CHKBUF:                                                           0676 00292000
*         DO;                                                      0676 00293000
*                                                                  0676 00294000
         B     @RC00666                                            0676 00295000
@RF00666 DS    0H                                                  0676 00296000
CHKBUF   DS    0H                                                  0677 00297000
*           /*********************************************************/ 00298000
*           /*                                                       */ 00299000
*           /* SEGMENT(IFOA00B)REQUEST                               */ 00300000
*           /*                                                       */ 00301000
*           /*********************************************************/ 00302000
*                                                                  0677 00303000
*           DO;                                                    0677 00304000
*             GOTO IFOA00B;                                        0678 00305000
         B     IFOA00B                                             0678 00306000
*IFOA00B#:                                                         0679 00307000
*           END;                    /* CALL PHASE TO PROCESS BUF     */ 00308000
IFOA00B# DS    0H                                                  0680 00309000
*           IF LSCTYPE=LSTYPE THEN  /* IF ELEMENT IS AN LSCB         */ 00310000
         CLI   LSCTYPE(PTRLSC),X'DF'                               0680 00311000
         BNE   @RF00680                                            0680 00312000
*DEALL2:                                                           0681 00313000
*             DO;                                                  0681 00314000
DEALL2   DS    0H                                                  0682 00315000
*               ZCRPCOD1=0;         /* ZERO PARAMETER BYTE           */ 00316000
         L     @11,RPHCRR(,PTRRPH)                                 0682 00317000
         L     @11,CRACRR(,@11)                                    0682 00318000
         MVI   ZCRPCOD1(@11),X'00'                                 0682 00319000
*               ZCRPLSCB='1'B;      /* TURN ON PARAMETER BIT TO    0683 00320000
*                                      DEALLOCATE LSCB               */ 00321000
         OI    ZCRPLSCB(@11),B'00001000'                           0683 00322000
*               CALL ZPSZDFB0;      /* GO TO DEALLOCATE LSCB         */ 00323000
         L     @11,ATCZPSVT(,PTRATC)                               0684 00324000
         L     @15,ZPSZDFB0(,@11)                                  0684 00325000
         BALR  @14,@15                                             0684 00326000
*             END DEALL2;           /* END DO FOR LSCB               */ 00327000
*           ELSE                                                   0686 00328000
*             ;                     /* NULL ELSE FOR ELEMENT NOT AN     00329000
*                                      LSCB                          */ 00330000
@RF00680 DS    0H                                                  0687 00331000
*         END CHKBUF;               /* END DO FOR ELEMENT NOT AN LSCB   00332000
*                                      OR FEEDBACK IS REQUIRED       */ 00333000
*       RFY                                                        0688 00334000
*         PTRG10 UNRSTD;            /*                       @XM18668*/ 00335000
@RC00666 DS    0H                                                  0689 00336000
*     END;                          /*                       @ZA16226*/ 00337000
*/* TPZRETN                                                          */ 00338000
*                                                                  0690 00339000
*   DO;                                                            0690 00340000
@RC00630 DS    0H                                                  0691 00341000
*     RFY                                                          0691 00342000
*      (GPR07P,                                                    0691 00343000
*       GPR14P,                                                    0691 00344000
*       GPR15P) RSTD;                                              0691 00345000
*     GPR13P=ZSAZSVBC;                                             0692 00346000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0692 00347000
*     IF GPR13P=0 THEN                                             0693 00348000
         LTR   GPR13P,GPR13P                                       0693 00349000
         BZ    @RT00693                                            0693 00350000
*       ;                           /* TPDVTS ISTZFARR               */ 00351000
*     ELSE                                                         0695 00352000
*       GPR14P=ZSAZSVRR;                                           0695 00353000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0695 00354000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0696 00355000
@RT00693 DS    0H                                                  0696 00356000
         LM    7,12,ZSAZSVVR+0(13)                                      00357000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0697 00358000
         BR    GPR14P                                                   00359000
*     RFY                                                          0698 00360000
*      (GPR07P,                                                    0698 00361000
*       GPR14P,                                                    0698 00362000
*       GPR15P) UNRSTD;                                            0698 00363000
*   END;                                                           0699 00364000
*                                                                  0699 00365000
*/* END TPZRETN                                                      */ 00366000
*                                                                  0700 00367000
*                                   /* RESTORE REGS AND RETURN TO  0700 00368000
*                                      CALLER                        */ 00369000
*                                                                  0700 00370000
*/********************************************************************/ 00371000
*/* PHASE IFOA00A -                                                  */ 00372000
*/* PROCESS FMCB/DNCB FLAGS                                          */ 00373000
*/* CALL DIALOG SCHEDULAR INBOUND PHASE 2 IF COMMAND IF CONTACT      */ 00374000
*/********************************************************************/ 00375000
*                                                                  0700 00376000
*                                                                  0700 00377000
*/* SEGMENT(IFOA00A)START                                            */ 00378000
*                                                                  0700 00379000
*   DO;                                                            0700 00380000
*     GOTO IFOA00A@;                                               0701 00381000
*IFOA00A:                                                          0702 00382000
*   END;                                                           0702 00383000
IFOA00A  DS    0H                                                  0703 00384000
*   IF PTRG08=0 THEN                /* IF CONTACT COMMAND            */ 00385000
         LTR   PTRG08,PTRG08                                       0703 00386000
         BNZ   @RF00703                                            0703 00387000
*     FMCZFA06='1'B;                /* SET FMCB IN DIALOG FLAG       */ 00388000
         OI    FMCZFA06(PTRFMC),B'00000100'                        0704 00389000
*   ELSE                            /* IF NOT CONTACT                */ 00390000
*DISC:                                                             0705 00391000
*     DO;                                                          0705 00392000
         B     @RC00703                                            0705 00393000
@RF00703 DS    0H                                                  0705 00394000
DISC     DS    0H                                                  0706 00395000
*       IF FMCZX001>1 THEN          /* SESS CNT > ONE ?      @ZA31248*/ 00396000
         CLI   FMCZX001(PTRFMC),1                                  0706 00397000
         BNH   @RF00706                                            0706 00398000
*         FMCZX001=FMCZX001-1;      /* DECREMENT FMCB SESSION CT     */ 00399000
         SLR   @09,@09                                             0707 00400000
         IC    @09,FMCZX001(,PTRFMC)                               0707 00401000
         BCTR  @09,0                                               0707 00402000
         STC   @09,FMCZX001(,PTRFMC)                               0707 00403000
*       ELSE                        /* ELSE SESSION COUNT EQUAL ONE     00404000
*                                      OR LESS               @ZA31248*/ 00405000
*         DO;                       /*                       @ZA31248*/ 00406000
         B     @RC00706                                            0708 00407000
@RF00706 DS    0H                                                  0709 00408000
*           FMCZX001=0;             /* ZERO SESSION COUNT    @ZA31248*/ 00409000
         MVI   FMCZX001(PTRFMC),X'00'                              0709 00410000
*           FMCZFD06='0'B;          /* TURN OFF FMCB DISC OUT FLAG   */ 00411000
         NI    FMCZFD06(PTRFMC),B'01111111'                        0710 00412000
*         END;                      /* END SESSION CNT ONE OR LESS 0711 00413000
*                                                            @ZA31248*/ 00414000
*       IF ZCRIF0E1='1'B THEN                                      0712 00415000
@RC00706 L     @09,RPHCRR(,PTRRPH)                                 0712 00416000
         L     @09,CRACRR(,@09)                                    0712 00417000
         TM    ZCRIF0E1(@09),B'00001000'                           0712 00418000
         BO    @RT00712                                            0712 00419000
*         ;                         /* IF SPECIAL CASE DISC SWITCH 0713 00420000
*                                      ON, LEAVE IN SESSION  @ZA31248*/ 00421000
*       ELSE                        /* SWITCH OFF            @ZA31248*/ 00422000
*         DO;                                                      0714 00423000
*           FMCZFA06='0'B;          /* TURN OFF FMCB IN DIALOG       */ 00424000
         NI    FMCZFA06(PTRFMC),B'11111011'                        0715 00425000
*           LDNZF007='0'B;          /* CLEAR ATTENTION RECVD FLAG    */ 00426000
         L     @09,LDNZF007-3(,PTRLDN)                             0716 00427000
@GL00004 LR    @00,@09                                             0716 00428000
         N     @00,@CF04625                                        0716 00429000
         CS    @09,@00,LDNZF007-3(PTRLDN)                          0716 00430000
         BNE   @GL00004                                            0716 00431000
*           CALL ADDR(FMCPAB4)->PABDVTA->ZRCZCFCI;/* CALL DIALOG   0717 00432000
*                                      SCHEDULER INBOUND-PHASE 2     */ 00433000
         L     @09,PABDVTA+111(,PTRFMC)                            0717 00434000
         LA    @09,0(,@09)                                         0717 00435000
         L     @15,ZRCZCFCI(,@09)                                  0717 00436000
         BALR  @14,@15                                             0717 00437000
*         END;                      /* END SWITCH OFF        @ZA31248*/ 00438000
*     END DISC;                     /* END DO FOR DISCONNECT CMD     */ 00439000
@RT00712 DS    0H                                                  0720 00440000
*/* SEGMENT(IFOA00A)FINISH                                           */ 00441000
*                                                                  0720 00442000
*   DO;                                                            0720 00443000
@RC00703 DS    0H                                                  0721 00444000
*     GOTO IFOA00A#;                                               0721 00445000
         B     IFOA00A#                                            0721 00446000
*IFOA00A@:                                                         0722 00447000
*   END;                            /* END PHASE                     */ 00448000
IFOA00A@ DS    0H                                                  0723 00449000
*                                                                  0723 00450000
*/********************************************************************/ 00451000
*/* PHASE IFOA00B -                                                  */ 00452000
*/* IF ELEMENT HAS NO BUFFER ALLOCATE AN FSB                         */ 00453000
*/* SET UP FSB FIELDS AND FLAGS                                      */ 00454000
*/* QUEUE FSB TO CLIP                                                */ 00455000
*/********************************************************************/ 00456000
*                                                                  0723 00457000
*                                                                  0723 00458000
*/* SEGMENT(IFOA00B)START                                            */ 00459000
*                                                                  0723 00460000
*   DO;                                                            0723 00461000
*     GOTO IFOA00B@;                                               0724 00462000
         B     IFOA00B@                                            0724 00463000
*IFOA00B:                                                          0725 00464000
*   END;                                                           0725 00465000
IFOA00B  DS    0H                                                  0726 00466000
*   RFY                                                            0726 00467000
*     PTRG09 RSTD;                  /* RESTRICT FSB REG              */ 00468000
*   RFY                                                            0727 00469000
*     ISTFSB BASED(PTRG09);         /* BASE FSB ON FSBPTR            */ 00470000
*   PTRG09=LSCFDBA;                 /* GET BUFFER POINTER            */ 00471000
         L     PTRG09,LSCFDBA(,PTRLSC)                             0728 00472000
*   PTRG09=PTRG09&MASKWORD;         /* CLEAR POSSIBLE GATEBIT        */ 00473000
         N     PTRG09,@CF04518                                     0729 00474000
*   IF PTRG09^=0 THEN               /* IF ELEMENT HAS A BUFFER       */ 00475000
         SLR   @15,@15                                             0730 00476000
         CR    PTRG09,@15                                          0730 00477000
         BE    @RF00730                                            0730 00478000
*     LSCFDBA=0;                    /* CLEAR ELEMENT PTR TO BUFFER   */ 00479000
         ST    @15,LSCFDBA(,PTRLSC)                                0731 00480000
*   ELSE                            /* IF ELEMENT HAS NO BUFFER      */ 00481000
*NOBUF:                                                            0732 00482000
*     DO;                                                          0732 00483000
         B     @RC00730                                            0732 00484000
@RF00730 DS    0H                                                  0732 00485000
NOBUF    DS    0H                                                  0733 00486000
*       ZCRPCOD1=0;                 /* ZERO PARAMETER BYTE           */ 00487000
         L     @15,RPHCRR(,PTRRPH)                                 0733 00488000
         L     @15,CRACRR(,@15)                                    0733 00489000
         MVI   ZCRPCOD1(@15),X'00'                                 0733 00490000
*       ZCRPPG='1'B;                /* SET PARAMETER BIT TO ALLOCATE    00491000
*                                      PAGEABLE BUF          @XM18668*/ 00492000
*       ZCRPBUF='1'B;               /* IND BUF ALLOCATION    @XM18668*/ 00493000
         OI    ZCRPPG(@15),B'10000100'                             0735 00494000
*       CALL ZPSZDFA0;              /* GO TO ALLOCATE FSB            */ 00495000
         L     @14,ATCZPSVT(,PTRATC)                               0736 00496000
         L     @15,ZPSZDFA0(,@14)                                  0736 00497000
         BALR  @14,@15                                             0736 00498000
*       PTRZLB=RPHSRPRM;            /* SET UP BUFF BASE      @XL03HFZ*/ 00499000
         L     PTRZLB,RPHSRPRM(,PTRRPH)                            0737 00500000
*       PTRG09=ADDR(ZLBFSB);        /* SET UP FSB BASE       @XL03HFZ*/ 00501000
         LA    PTRG09,ZLBFSB(,PTRZLB)                              0738 00502000
*       FSBTYPE=FSTYPE;             /* SET TYPE FIELD        @ZA19869*/ 00503000
         MVI   FSBTYPE(PTRG09),X'02'                               0739 00504000
*       FSBLNGTH=LENGTH(ISTFSB);    /* SET FSB LENGTH        @ZA19869*/ 00505000
         MVI   FSBLNGTH(PTRG09),X'2C'                              0740 00506000
*     END NOBUF;                    /* END DO FOR NO BUFFER          */ 00507000
*   IF LSCTYPE=LSTYPE THEN          /* IF ELEMENT IS AN LSCB         */ 00508000
@RC00730 CLI   LSCTYPE(PTRLSC),X'DF'                               0742 00509000
         BNE   @RF00742                                            0742 00510000
*ISLSC:                                                            0743 00511000
*     DO;                                                          0743 00512000
ISLSC    DS    0H                                                  0744 00513000
*       FSBCID=LSCLCPBA->LCPCID;    /* SET FSB CID                   */ 00514000
         L     @15,LSCLCPBA(,PTRLSC)                               0744 00515000
         MVC   FSBCID(4,PTRG09),LCPCID(@15)                        0744 00516000
*       FSBLCCWA=LSCLCCWA;          /* SET LCCW ADDR IN FSB          */ 00517000
         L     @00,LSCLCCWA(,PTRLSC)                               0745 00518000
         ST    @00,FSBLCCWA(,PTRG09)                               0745 00519000
*       FSBLCPB=LSCLCPBA;           /* SET LCPB ADDR IN FSB          */ 00520000
         ST    @15,FSBLCPB(,PTRG09)                                0746 00521000
*     END ISLSC;                    /* END DO FOR LSCB               */ 00522000
*   ELSE                            /* IF ELEMENT IS NOT AN LSCB     */ 00523000
*ISLCP:                                                            0748 00524000
*     DO;                                                          0748 00525000
         B     @RC00742                                            0748 00526000
@RF00742 DS    0H                                                  0748 00527000
ISLCP    DS    0H                                                  0749 00528000
*       FSBCID=LCPCID;              /* SET FSB CID                   */ 00529000
         MVC   FSBCID(4,PTRG09),LCPCID(PTRLCP)                     0749 00530000
*       FSBLCCWA=LSCLCCWA;          /* SET LCCW ADDR IN FSB          */ 00531000
         L     @00,LSCLCCWA(,PTRLSC)                               0750 00532000
         ST    @00,FSBLCCWA(,PTRG09)                               0750 00533000
*       FSBLCPB=PTRLCP;             /* SET LCPB ADDR IN FSB          */ 00534000
         ST    PTRLCP,FSBLCPB(,PTRG09)                             0751 00535000
*       FSBELI='1'B;                /* SET LAST FSB FOR LCPB FLAG    */ 00536000
         OI    FSBELI(PTRG09),B'10000000'                          0752 00537000
*     END ISLCP;                    /* END DO FOR LCPB               */ 00538000
*   FSBECI='1'B;                    /* SET LAST FSB FOR LCCW FLAG    */ 00539000
@RC00742 OI    FSBECI(PTRG09),B'01000000'                          0754 00540000
*   IF LCPZRT0B='1'B&FMCMODE=FMCRCD THEN/* IF DISCONNECT AND RECORD     00541000
*                                      MODE                  @ZA28604*/ 00542000
         TM    LCPZRT0B(PTRLCP),B'00010000'                        0755 00543000
         BNO   @RF00755                                            0755 00544000
         CLC   FMCMODE(8,PTRFMC),@CC03795                          0755 00545000
         BNE   @RF00755                                            0755 00546000
*     DO;                           /*                       @ZA28604*/ 00547000
*       CALL ATCZPSVT->ZPSZDFQR;    /* BLD FID1 RESPONSE     @ZA28604*/ 00548000
         L     @14,ATCZPSVT(,PTRATC)                               0757 00549000
         L     @15,ZPSZDFQR(,@14)                                  0757 00550000
         BALR  @14,@15                                             0757 00551000
*       IF LCPATOP='1'B THEN        /* IF ATOP LCPB          @XL03HFZ*/ 00552000
         TM    LCPATOP(PTRLCP),B'00000001'                         0758 00553000
         BNO   @RF00758                                            0758 00554000
*         DO;                       /*                       @XL03HFZ*/ 00555000
*           FSBMJRCD=FRCLRRSP;      /* MAJOR RC = CLEAR      @XL03HFZ*/ 00556000
         MVI   FSBMJRCD(PTRG09),X'31'                              0760 00557000
*           FSBATOP='1'B;           /* CHKED BY AC1R         @ZA25404*/ 00558000
         OI    FSBATOP(PTRG09),B'00000001'                         0761 00559000
*           FSBMNRCD=LCPZMIRC;      /* MINOR RC = CLEAR CODE @XM17957*/ 00560000
         MVC   FSBMNRCD(1,PTRG09),LCPZMIRC(PTRLCP)                 0762 00561000
*           FMCCLEAR='0'B;          /* CLEAR CLEAR IN PROGRES FLAG   */ 00562000
         NI    FMCCLEAR(PTRFMC),B'10111111'                        0763 00563000
*         END;                      /* END ATOP LCPB PROCESSING      */ 00564000
*       ELSE                                                       0765 00565000
*         ;                         /*                       @ZA28604*/ 00566000
@RF00758 DS    0H                                                  0766 00567000
*     END;                          /*                       @ZA28604*/ 00568000
*   ELSE                            /* NOT ATOP LCPB         @XL03HFZ*/ 00569000
*     IF ZLBCOMP=ZLBCONRJ THEN      /* IF WR W/CONTACT FAILURE       */ 00570000
*                                                                  0767 00571000
         B     @RC00755                                            0767 00572000
@RF00755 CLI   ZLBCOMP(PTRZLB),X'10'                               0767 00573000
         BNE   @RF00767                                            0767 00574000
*       /*************************************************************/ 00575000
*       /*                                                           */ 00576000
*       /* SEGMENT(WWCFAIL)REQUEST                                   */ 00577000
*       /*                                                           */ 00578000
*       /*************************************************************/ 00579000
*                                                                  0768 00580000
*       DO;                                                        0768 00581000
*         GOTO WWCFAIL;                                            0769 00582000
         B     WWCFAIL                                             0769 00583000
*WWCFAIL#:                                                         0770 00584000
*       END;                        /* PROCESS WR W/CONT. FAILURE    */ 00585000
*     ELSE                                                         0771 00586000
*       DO;                         /* OTHERWISE SET RETURN CODES    */ 00587000
         B     @RC00767                                            0771 00588000
@RF00767 DS    0H                                                  0772 00589000
*         FSBMJRCD=FRNORM;          /* SET FSB MAJOR RETURN CODE TO     00590000
*                                      NORMAL FEEDBACK               */ 00591000
         MVI   FSBMJRCD(PTRG09),X'00'                              0772 00592000
*         FSBMNRCD=FRMOK;           /* SET FSB MINOR RETURN CODE TO     00593000
*                                      OK SO FAR                     */ 00594000
         MVI   FSBMNRCD(PTRG09),X'00'                              0773 00595000
*       END;                        /* END NORMAL CASE       @XL03HFZ*/ 00596000
*   FDBOFSET=DISFDBS;               /* SET SYSTEM OFFSET IN FDB      */ 00597000
@RC00767 DS    0H                                                  0775 00598000
@RC00755 L     @00,DISFDBS                                         0775 00599000
         STH   @00,FDBOFSET(,PTRZLB)                               0775 00600000
*   ZLBFDBS=ZLBFDBZ;                /* MOVE FDB TO SYSTEM FDB AREA   */ 00601000
         MVC   ZLBFDBS(12,PTRZLB),ZLBFDBZ(PTRZLB)                  0776 00602000
*/*  TPQUE (PTRG09,FMCPAB2) NORM                                     */ 00603000
*                                                                  0777 00604000
*   DO;                                                            0777 00605000
*     RFY                                                          0778 00606000
*      (GPR00P,                                                    0778 00607000
*       GPR01P,                                                    0778 00608000
*       GPR04P,                                                    0778 00609000
*       GPR05P,                                                    0778 00610000
*       GPR15P) RSTD;                                              0778 00611000
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P)) 00612000
*         ;                                                        0779 00613000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00614000
*     GPR00P=0;                                                    0780 00615000
         SLR   GPR00P,GPR00P                                       0780 00616000
*     GPR15P=ADDR(FMCPAB2);         /* HOLD PAB PTR                  */ 00617000
         LA    GPR15P,FMCPAB2(,PTRFMC)                             0781 00618000
*     GPR04P=PTRG09;                /* WORK ELE PTR                  */ 00619000
         LR    GPR04P,PTRG09                                       0782 00620000
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */ 00621000
         LR    GPR05P,GPR15P                                       0783 00622000
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            0784 00623000
         L     @14,ATCLCPTR                                        0784 00624000
         L     @15,ATCAP37(,@14)                                   0784 00625000
         BALR  @14,@15                                             0784 00626000
*     GEN(NOPR  0)                                                 0785 00627000
*     NOSETS NOREFS;                                               0785 00628000
         NOPR  0                                                        00629000
*     RFY                                                          0786 00630000
*      (GPR00P,                                                    0786 00631000
*       GPR01P,                                                    0786 00632000
*       GPR04P,                                                    0786 00633000
*       GPR05P,                                                    0786 00634000
*       GPR15P) UNRSTD;                                            0786 00635000
*   END;                            /* *** END OF TPQUE GENERATION 0787 00636000
*                                      QUEUE FSB TO CLIP             */ 00637000
*/* SEGMENT(IFOA00B)FINISH                                           */ 00638000
*                                                                  0788 00639000
*   DO;                                                            0788 00640000
*     GOTO IFOA00B#;                                               0789 00641000
         B     IFOA00B#                                            0789 00642000
*IFOA00B@:                                                         0790 00643000
*   END;                            /* END PHASE                     */ 00644000
IFOA00B@ DS    0H                                                  0791 00645000
*                                                                  0791 00646000
*/********************************************************************/ 00647000
*/*                                                          @XL03HFZ*/ 00648000
*/* SEGMENT-                                                 @XL03HFZ*/ 00649000
*/*      WWCFAIL                                             @XL03HFZ*/ 00650000
*/*                                                          @XL03HFZ*/ 00651000
*/* FUNCTION-                                                @XL03HFZ*/ 00652000
*/*      PROCESS WRITE WITH CONTACT FAILURE.                 @XL03HFZ*/ 00653000
*/*      THIS IS ONLY ENTERED FOR 3270 IN RECORD MODE.       @XL03HFZ*/ 00654000
*/*      THE SENSE STATUS IS SET TO BRACKET ENTRY FAILURE, AND       */ 00655000
*/*      ALL EXTRA BUFFERS OBTAINED ARE DISCARDED.           @XL03HFZ*/ 00656000
*/*                                                          @XL03HFZ*/ 00657000
*/********************************************************************/ 00658000
*                                                                  0791 00659000
*   /*****************************************************************/ 00660000
*   /*                                                               */ 00661000
*   /* SEGMENT(WWCFAIL)START                                         */ 00662000
*   /*                                                               */ 00663000
*   /*****************************************************************/ 00664000
*                                                                  0791 00665000
*   DO;                                                            0791 00666000
*     GOTO WWCFAIL@;                                               0792 00667000
         B     WWCFAIL@                                            0792 00668000
*WWCFAIL:                                                          0793 00669000
*   END;                            /* WWCFAIL: SUBROUTINE           */ 00670000
WWCFAIL  DS    0H                                                  0794 00671000
*   RFY                                                            0794 00672000
*     PTRG11 RSTD;                  /* INTERNAL WORK REGISTER        */ 00673000
*   FDBDATAA=0;                     /* ZERO DATA ADDRESS FIELD       */ 00674000
         SLR   @10,@10                                             0795 00675000
         ST    @10,FDBDATAA(,PTRZLB)                               0795 00676000
*   FDBDATCT=0;                     /* ZERO DATA COUNT FIELD         */ 00677000
         STH   @10,FDBDATCT(,PTRZLB)                               0796 00678000
*   PTRG11=PTRLSC;                  /* SAVE WORK ELEMENT POINTER     */ 00679000
         LR    PTRG11,PTRLSC                                       0797 00680000
*   IF(FDBFDBA&MASKWORD)=0 THEN                                    0798 00681000
         L     @00,FDBFDBA(,PTRZLB)                                0798 00682000
         N     @00,@CF04518                                        0798 00683000
         CR    @00,@10                                             0798 00684000
         BE    @RT00798                                            0798 00685000
*     ;                             /* IF NULL BUFFER CHAIN          */ 00686000
*   ELSE                                                           0800 00687000
*     DO;                           /* NOT NULL CHAIN, FIX IT        */ 00688000
*       PTRG07=FDBFDBA;             /* SET POINTER TO BUFFER         */ 00689000
         L     PTRG07,FDBFDBA(,PTRZLB)                             0801 00690000
*       FDBFDBA=0;                  /* INDICATE ONLY BUFFER IN CHAIN    00691000
*                                                            @XL03HFZ*/ 00692000
         SLR   @10,@10                                             0802 00693000
         ST    @10,FDBFDBA(,PTRZLB)                                0802 00694000
*       ZCRPCOD1=ZCPBUF;            /* BUFFER RELEASE PARAMETER      */ 00695000
         L     @10,RPHCRR(,PTRRPH)                                 0803 00696000
         L     @10,CRACRR(,@10)                                    0803 00697000
         MVI   ZCRPCOD1(@10),X'04'                                 0803 00698000
*       CALL ATCZPSVT->ZPSZDFB0;    /* RELEASE BUFFER CHAIN          */ 00699000
         L     @10,ATCZPSVT(,PTRATC)                               0804 00700000
         L     @15,ZPSZDFB0(,@10)                                  0804 00701000
         BALR  @14,@15                                             0804 00702000
*     END;                          /* END NOT NULL BUFFER CHAIN     */ 00703000
*   DO WHILE(FMCLCPB2^=0);          /* CLEAR WAIT QUEUE      @XL03HFZ*/ 00704000
@RT00798 B     @DE00806                                            0806 00705000
@DL00806 DS    0H                                                  0807 00706000
*/* TPDEQ (,FMCLCPBQ) RETPTR(PTRG07)                                 */ 00707000
*                                                                  0807 00708000
*     DO;                           /* BEGIN TPDEQ CODE GENERATION   */ 00709000
*       RFY                                                        0808 00710000
*        (GPR00P,                                                  0808 00711000
*         GPR01P,                                                  0808 00712000
*         GPR14P,                                                  0808 00713000
*         GPR15P) RSTD;                                            0808 00714000
*       GPR15P=ADDR(FMCLCPBQ);      /* ADDRESS QUEUE POINTER         */ 00715000
         LA    GPR15P,FMCLCPBQ(,PTRFMC)                            0809 00716000
*       GPR14P=GPR15P->PABWEQA|FMZCA024;                           0810 00717000
         L     @10,@CF01262                                        0810 00718000
         L     GPR14P,PABWEQA(,GPR15P)                             0810 00719000
         OR    GPR14P,@10                                          0810 00720000
*       IF GPR14P=FMZCA024 THEN                                    0811 00721000
         CLR   GPR14P,@10                                          0811 00722000
         BE    @RT00811                                            0811 00723000
*         ;                                                        0812 00724000
*       ELSE                                                       0813 00725000
*         DO;                                                      0813 00726000
*FMZL1045:                                                         0814 00727000
*           ;                                                      0814 00728000
FMZL1045 DS    0H                                                  0815 00729000
*           DO WHILE(GPR14P->WKECHAIN^=FMZCA024);                  0815 00730000
         B     @DE00815                                            0815 00731000
@DL00815 DS    0H                                                  0816 00732000
*             GPR15P=ADDR(GPR14P->WKECHAIN);                       0816 00733000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0816 00734000
*             GPR14P=GPR15P->PABWEQA;                              0817 00735000
         L     GPR14P,PABWEQA(,GPR15P)                             0817 00736000
*           END;                                                   0818 00737000
@DE00815 L     @10,@CF01262                                        0818 00738000
         CL    @10,WKECHAIN(,GPR14P)                               0818 00739000
         BNE   @DL00815                                            0818 00740000
*           GPR00P=FMZCA024;                                       0819 00741000
         LR    GPR00P,@10                                          0819 00742000
*           CS(GPR14P,GPR00P,GPR15P->PABWEQA);                     0820 00743000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0820 00744000
*           BC(7,FMZL1045);                                        0821 00745000
         BC    7,FMZL1045                                          0821 00746000
*           GPR14P->WKECHAIN=0;                                    0822 00747000
         SLR   @10,@10                                             0822 00748000
         ST    @10,WKECHAIN(,GPR14P)                               0822 00749000
*         END;                                                     0823 00750000
*ISTA0045:                                                         0824 00751000
*       ;                                                          0824 00752000
@RT00811 DS    0H                                                  0824 00753000
ISTA0045 DS    0H                                                  0825 00754000
*       GPR14P=GPR14P&FMZCB024;                                    0825 00755000
         N     GPR14P,@CF02700                                     0825 00756000
*       PTRG07=GPR14P;                                             0826 00757000
         LR    PTRG07,GPR14P                                       0826 00758000
*       RFY                                                        0827 00759000
*        (GPR00P,                                                  0827 00760000
*         GPR01P,                                                  0827 00761000
*         GPR14P,                                                  0827 00762000
*         GPR15P) UNRSTD;                                          0827 00763000
*     END;                          /* END TPDEQ GENERATION  @XL03HFZ   00764000
*                                      REMOVE ELDEST ELEMENT         */ 00765000
*     ZCRPCOD1=ZCPLSCB;             /* INDICATE LSCB RELEASE         */ 00766000
         L     @10,RPHCRR(,PTRRPH)                                 0829 00767000
         L     @10,CRACRR(,@10)                                    0829 00768000
         MVI   ZCRPCOD1(@10),X'08'                                 0829 00769000
*     CALL ATCZPSVT->ZPSZDFB0;      /* RELEASE LSCB          @XL03HFZ*/ 00770000
         L     @10,ATCZPSVT(,PTRATC)                               0830 00771000
         L     @15,ZPSZDFB0(,@10)                                  0830 00772000
         BALR  @14,@15                                             0830 00773000
*   END;                            /* END DISCARDING EXTRA BUFFS    */ 00774000
@DE00806 L     @10,FMCLCPB2-1(,PTRFMC)                             0831 00775000
         LA    @10,0(,@10)                                         0831 00776000
         LTR   @10,@10                                             0831 00777000
         BNZ   @DL00806                                            0831 00778000
*   PTRLSC=PTRG11;                  /* RESTORE LSCB POINTER          */ 00779000
         LR    PTRLSC,PTRG11                                       0832 00780000
*   SRUSENSE=SRURRERR;              /* FLAG BRACKET ENTRY FAILURE    */ 00781000
         MVC   SRUSENSE+60(4,PTRZLB),@CB01112                      0833 00782000
*   FSBMJRCD=FRPHYSC;               /* SET PHYSICAL ERROR CODE       */ 00783000
         MVI   FSBMJRCD(PTRG09),X'0C'                              0834 00784000
*   FSBMNRCD=FRMLESNS;              /* SET ERROR, SENSE DATA AVAIL   */ 00785000
         MVI   FSBMNRCD(PTRG09),X'81'                              0835 00786000
*   CALL ATCZPSVT->ZPSZDFQR;        /* BUILD FID1 RESPONSE           */ 00787000
*                                                                  0836 00788000
         L     @10,ATCZPSVT(,PTRATC)                               0836 00789000
         L     @15,ZPSZDFQR(,@10)                                  0836 00790000
         BALR  @14,@15                                             0836 00791000
*   /*****************************************************************/ 00792000
*   /*                                                               */ 00793000
*   /* SEGMENT(WWCFAIL)FINISH                                        */ 00794000
*   /*                                                               */ 00795000
*   /*****************************************************************/ 00796000
*                                                                  0837 00797000
*   DO;                                                            0837 00798000
*     GOTO WWCFAIL#;                                               0838 00799000
         B     WWCFAIL#                                            0838 00800000
*WWCFAIL@:                                                         0839 00801000
*   END;                            /* END OF SEGMENT        @XL03HFZ*/ 00802000
WWCFAIL@ DS    0H                                                  0840 00803000
*/* TPEPILOG                                                         */ 00804000
*                                                                  0840 00805000
*   GEN(PRINT OFF);                                                0840 00806000
         PRINT OFF                                                      00807000
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0841 00808000
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0841 00809000
*        2  * CHAR(4),                 /* SPACE                       * 00810000
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               * 00811000
*           3 WKEFLAGS BIT(8),         /* FLAGS                       * 00812000
*             4 WKEGATE  BIT(1),       /* GATE BIT                    * 00813000
*             4 *        BIT(7),       /* RESERVED                    * 00814000
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 * 00815000
*   DCL                                                            0842 00816000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 00817000
*   DCL                                                            0843 00818000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 00819000
*   GEN(PRINT ON);                                                 0844 00820000
*                                                                  0844 00821000
         PRINT ON                                                       00822000
*/* END OF TPEPILOG                                                  */ 00823000
*                                                                  0845 00824000
*   END ISTZIFOA                    /* END PROCEDURE                 */ 00825000
*                                                                  0845 00826000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00827000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00828000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00829000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00830000
*                                                                  0845 00831000
*       ;                                                          0845 00832000
@EL00001 DS    0H                                                  0845 00833000
@EF00001 DS    0H                                                  0845 00834000
@ER00001 BR    @14                                                 0845 00835000
@DATA    DS    0H                                                       00836000
@DATD    DSECT                                                          00837000
         DS    0F                                                       00838000
ISTZIFOA CSECT                                                          00839000
         DS    0F                                                       00840000
@CF00035 DC    F'1'                                                     00841000
@CF01262 DC    XL4'80000000'                                            00842000
@CF02700 DC    XL4'7FFFFFFF'                                            00843000
@CF04518 DC    XL4'00FFFFFF'                                            00844000
@CF04625 DC    BL4'11111111111111111111111111111011'                    00845000
@DATD    DSECT                                                          00846000
         DS    0D                                                       00847000
IOSBPTR  DS    A                                                        00848000
SRBPTR   DS    A                                                        00849000
CVTPTR   DS    A                                                        00850000
LCPBPTR  DS    A                                                        00851000
LDNCBPTR DS    A                                                        00852000
DNCBPTR  DS    A                                                        00853000
FMCBPTR  DS    A                                                        00854000
FSBPTR   DS    A                                                        00855000
WKEPTR   DS    A                                                        00856000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00857000
@ENDDATD EQU   *                                                        00858000
ISTZIFOA CSECT                                                          00859000
         DS    0F                                                       00860000
@SIZDATD DC    AL1(0)                                                   00861000
         DC    AL3(@ENDDATD-@DATD)                                      00862000
         DS    0D                                                       00863000
DISFDBS  DC    AL4(ZLBFDBS-ISTZLBUF)                                    00864000
DISFSB   DC    AL4(ZLBFSB-ISTZLBUF)                                     00865000
@CC03795 DC    C'RECORD  '                                              00866000
@CC04560 DC    C'ICOA'                                                  00867000
@CB01112 DC    X'08000000'                                              00868000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00869000
@01      EQU   01                                                       00870000
@02      EQU   02                                                       00871000
@03      EQU   03                                                       00872000
@04      EQU   04                                                       00873000
@05      EQU   05                                                       00874000
@06      EQU   06                                                       00875000
@07      EQU   07                                                       00876000
@08      EQU   08                                                       00877000
@09      EQU   09                                                       00878000
@10      EQU   10                                                       00879000
@11      EQU   11                                                       00880000
@12      EQU   12                                                       00881000
@13      EQU   13                                                       00882000
@14      EQU   14                                                       00883000
@15      EQU   15                                                       00884000
RPHPTR   EQU   @01                                                      00885000
GPR00P   EQU   @00                                                      00886000
GPR01P   EQU   @01                                                      00887000
GPR04P   EQU   @04                                                      00888000
GPR05P   EQU   @05                                                      00889000
GPR07P   EQU   @07                                                      00890000
GPR12P   EQU   @12                                                      00891000
GPR13P   EQU   @13                                                      00892000
GPR14P   EQU   @14                                                      00893000
GPR15P   EQU   @15                                                      00894000
PTRRPH   EQU   @01                                                      00895000
PTRATC   EQU   @02                                                      00896000
PTRLDN   EQU   @03                                                      00897000
PTRDNC   EQU   @04                                                      00898000
PTRFMC   EQU   @05                                                      00899000
PTRZLB   EQU   @06                                                      00900000
PTRLCP   EQU   @07                                                      00901000
PTRLSC   EQU   @07                                                      00902000
PTRG07   EQU   @07                                                      00903000
PTRG08   EQU   @08                                                      00904000
PTRG09   EQU   @09                                                      00905000
PTRG10   EQU   @10                                                      00906000
PTRG11   EQU   @11                                                      00907000
PTRG12   EQU   @12                                                      00908000
PTRG13   EQU   @13                                                      00909000
GPR00F   EQU   @00                                                      00910000
GPR01F   EQU   @01                                                      00911000
GPR02F   EQU   @02                                                      00912000
GPR02P   EQU   @02                                                      00913000
GPR03F   EQU   @03                                                      00914000
GPR03P   EQU   @03                                                      00915000
GPR04F   EQU   @04                                                      00916000
GPR05F   EQU   @05                                                      00917000
GPR06F   EQU   @06                                                      00918000
GPR06P   EQU   @06                                                      00919000
GPR07F   EQU   @07                                                      00920000
GPR08F   EQU   @08                                                      00921000
GPR08P   EQU   @08                                                      00922000
GPR09F   EQU   @09                                                      00923000
GPR09P   EQU   @09                                                      00924000
GPR10F   EQU   @10                                                      00925000
GPR10P   EQU   @10                                                      00926000
GPR11F   EQU   @11                                                      00927000
GPR11P   EQU   @11                                                      00928000
GPR12F   EQU   @12                                                      00929000
GPR13F   EQU   @13                                                      00930000
GPR14F   EQU   @14                                                      00931000
GPR15F   EQU   @15                                                      00932000
PTRG00   EQU   @00                                                      00933000
PTRG14   EQU   @14                                                      00934000
PTRG15   EQU   @15                                                      00935000
ATCLCPTR EQU   1032                                                     00936000
IOSB     EQU   0                                                        00937000
IOSFLA   EQU   IOSB                                                     00938000
IOSACHN  EQU   IOSFLA                                                   00939000
IOSFLB   EQU   IOSB+1                                                   00940000
IOSFLC   EQU   IOSB+2                                                   00941000
IOSDVALT EQU   IOSFLC                                                   00942000
IOSPKEY  EQU   IOSB+12                                                  00943000
IOSOPT   EQU   IOSB+14                                                  00944000
IOSOPT2  EQU   IOSB+15                                                  00945000
@NM00002 EQU   IOSB+20                                                  00946000
IOSCSW   EQU   @NM00002+1                                               00947000
IOSTATUS EQU   IOSCSW+3                                                 00948000
IOSIPIB  EQU   IOSB+44                                                  00949000
IOSPATH  EQU   IOSB+86                                                  00950000
IOSCHN   EQU   IOSPATH                                                  00951000
IOSCKEY  EQU   IOSB+89                                                  00952000
IOSEEKA  EQU   IOSB+100                                                 00953000
IOSCCHH  EQU   IOSEEKA+3                                                00954000
IOSSKHH  EQU   IOSCCHH+2                                                00955000
SRBSECT  EQU   0                                                        00956000
SRBFLC   EQU   SRBSECT+12                                               00957000
CVTMAP   EQU   0                                                        00958000
CVTDAR   EQU   CVTMAP+72                                                00959000
CVTFLGS1 EQU   CVTDAR                                                   00960000
CVTDCB   EQU   CVTMAP+116                                               00961000
CVTIERLC EQU   CVTMAP+144                                               00962000
CVTOPTA  EQU   CVTMAP+182                                               00963000
CVTOPTB  EQU   CVTMAP+183                                               00964000
CVTGTF   EQU   CVTMAP+236                                               00965000
CVTGTFST EQU   CVTGTF                                                   00966000
CVTGTFS  EQU   CVTGTFST                                                 00967000
CVTSTATE EQU   CVTGTFST                                                 00968000
CVTTMODE EQU   CVTGTFST                                                 00969000
CVTFORM  EQU   CVTGTFST                                                 00970000
CVTAQAVT EQU   CVTMAP+240                                               00971000
CVTTCMFG EQU   CVTAQAVT                                                 00972000
CVTVOLM2 EQU   CVTMAP+244                                               00973000
CVTTATA  EQU   CVTVOLM2                                                 00974000
CVTTSKS  EQU   CVTTATA                                                  00975000
CVTVOLF2 EQU   CVTTSKS                                                  00976000
CVTTAT   EQU   CVTTATA+1                                                00977000
CVTATER  EQU   CVTMAP+248                                               00978000
CVTEXT1  EQU   CVTMAP+252                                               00979000
CVTPURG  EQU   CVTMAP+260                                               00980000
CVTQMSG  EQU   CVTMAP+268                                               00981000
CVTDMSR  EQU   CVTMAP+272                                               00982000
CVTRSV37 EQU   CVTDMSR                                                  00983000
CVTDMSRF EQU   CVTRSV37                                                 00984000
CVTERPV  EQU   CVTMAP+316                                               00985000
CVTINTLA EQU   CVTMAP+320                                               00986000
CVTAPF   EQU   CVTMAP+324                                               00987000
CVTEXT2  EQU   CVTMAP+328                                               00988000
CVTHJES  EQU   CVTMAP+332                                               00989000
CVTPGSIA EQU   CVTMAP+348                                               00990000
CVTA1F1  EQU   CVTMAP+356                                               00991000
CVTSYSK  EQU   CVTMAP+357                                               00992000
CVTVOLM1 EQU   CVTMAP+380                                               00993000
CVTVOLF1 EQU   CVTVOLM1                                                 00994000
CVTATMCT EQU   CVTMAP+388                                               00995000
CVTXTNT1 EQU   0                                                        00996000
CVTXTNT2 EQU   0                                                        00997000
CVTDSSV  EQU   CVTXTNT2                                                 00998000
CVTFLGBT EQU   CVTXTNT2+5                                               00999000
CVTQID   EQU   CVTXTNT2+24                                              01000000
CVTSHS   EQU   CVTXTNT2+40                                              01001000
CVTRV400 EQU   CVTXTNT2+52                                              01002000
CVTRV409 EQU   CVTXTNT2+53                                              01003000
CVTATCVT EQU   CVTXTNT2+64                                              01004000
CVTRV429 EQU   CVTXTNT2+84                                              01005000
CVTRV438 EQU   CVTXTNT2+85                                              01006000
CVTRV457 EQU   CVTXTNT2+112                                             01007000
CVTRV466 EQU   CVTXTNT2+113                                             01008000
CVTFIX   EQU   0                                                        01009000
CVTRELNO EQU   CVTFIX+252                                               01010000
ISTZRCVT EQU   0                                                        01011000
ZRCZCFCI EQU   ISTZRCVT+4                                               01012000
ISTZPSVT EQU   0                                                        01013000
ZPSZDFA0 EQU   ISTZPSVT                                                 01014000
ZPSZDFB0 EQU   ISTZPSVT+16                                              01015000
ZPSZDFQR EQU   ISTZPSVT+80                                              01016000
ISTZFSVT EQU   0                                                        01017000
ZFSZEFBB EQU   ISTZFSVT                                                 01018000
ZFSZEABB EQU   ZFSZEFBB                                                 01019000
ZFSZEFAB EQU   ISTZFSVT+4                                               01020000
ZFSZEAAB EQU   ZFSZEFAB                                                 01021000
ISTZLBVT EQU   0                                                        01022000
ISTRPH   EQU   0                                                        01023000
RPHCNTL  EQU   ISTRPH                                                   01024000
RPHFLAGS EQU   RPHCNTL+2                                                01025000
RPHAPTYP EQU   RPHFLAGS                                                 01026000
RPHFSTLC EQU   RPHFLAGS                                                 01027000
RPHFLGB  EQU   RPHCNTL+3                                                01028000
RPHRPHA  EQU   ISTRPH+4                                                 01029000
RPHCVFLG EQU   RPHRPHA                                                  01030000
RPHGATE  EQU   RPHCVFLG                                                 01031000
RPHTSKID EQU   ISTRPH+8                                                 01032000
RPHRESMA EQU   ISTRPH+16                                                01033000
RPHWPFLG EQU   RPHRESMA                                                 01034000
RPHWEA   EQU   ISTRPH+24                                                01035000
RPHCSPA  EQU   RPHWEA                                                   01036000
RPHSRPRM EQU   ISTRPH+28                                                01037000
RPHCRR   EQU   ISTRPH+32                                                01038000
RPHPABQA EQU   ISTRPH+36                                                01039000
RPHWORK  EQU   ISTRPH+40                                                01040000
RPHSAVE1 EQU   RPHWORK                                                  01041000
RPHSBITS EQU   RPHSAVE1+1                                               01042000
ISTRH    EQU   0                                                        01043000
RHFLAGS  EQU   ISTRH                                                    01044000
RH1      EQU   RHFLAGS                                                  01045000
RH2      EQU   RHFLAGS+1                                                01046000
RHRETRY  EQU   RH2                                                      01047000
RHRSVD1  EQU   RH2                                                      01048000
RH3      EQU   RHFLAGS+2                                                01049000
ISTSRU   EQU   0                                                        01050000
SRUTYPE  EQU   ISTSRU+1                                                 01051000
SRULDID  EQU   ISTSRU+2                                                 01052000
SRUSPSN  EQU   SRULDID                                                  01053000
ISTZSAVE EQU   0                                                        01054000
ZSAZSVBC EQU   ISTZSAVE                                                 01055000
ZSAZSVMS EQU   ZSAZSVBC                                                 01056000
ZSAZACTV EQU   ZSAZSVMS                                                 01057000
ZSAZSVFC EQU   ISTZSAVE+4                                               01058000
ZSAZSVRR EQU   ISTZSAVE+8                                               01059000
ZSAZSVVR EQU   ISTZSAVE+12                                              01060000
ZSAZTRAC EQU   ISTZSAVE+36                                              01061000
ISTLCCW  EQU   0                                                        01062000
LCCWOP   EQU   ISTLCCW                                                  01063000
LCCWRWOP EQU   LCCWOP                                                   01064000
LCCWCTL  EQU   LCCWRWOP                                                 01065000
LCCWFLAG EQU   ISTLCCW+1                                                01066000
LCCWLSI  EQU   LCCWFLAG                                                 01067000
ISTLCPB  EQU   0                                                        01068000
LCPREQTG EQU   ISTLCPB+2                                                01069000
LCPFLAGS EQU   LCPREQTG                                                 01070000
LCPZF001 EQU   LCPFLAGS                                                 01071000
LCPZRT02 EQU   LCPZF001                                                 01072000
LCPZF002 EQU   LCPFLAGS                                                 01073000
LCPZRT03 EQU   LCPZF002                                                 01074000
LCPZF003 EQU   LCPFLAGS                                                 01075000
LCPZRT04 EQU   LCPZF003                                                 01076000
LCPZF004 EQU   LCPFLAGS                                                 01077000
LCPZRT05 EQU   LCPZF004                                                 01078000
LCPZRT06 EQU   LCPFLAGS                                                 01079000
LCPZRT07 EQU   LCPFLAGS                                                 01080000
LCPMNRCD EQU   LCPREQTG+1                                               01081000
LCPZRT08 EQU   LCPMNRCD                                                 01082000
LCPZRT09 EQU   LCPMNRCD                                                 01083000
LCPZRT0B EQU   LCPMNRCD                                                 01084000
LCPCHAIN EQU   ISTLCPB+4                                                01085000
LCPCHAI1 EQU   LCPCHAIN                                                 01086000
LCPRUCNT EQU   ISTLCPB+8                                                01087000
LCPZMIRC EQU   LCPRUCNT                                                 01088000
LCPFLAG2 EQU   ISTLCPB+9                                                01089000
LCPTLBPI EQU   LCPFLAG2                                                 01090000
LCPFID0  EQU   LCPFLAG2                                                 01091000
LCPATOP  EQU   LCPFLAG2                                                 01092000
LCPSEQ   EQU   ISTLCPB+10                                               01093000
LCPCID   EQU   ISTLCPB+16                                               01094000
LCPFDBA  EQU   ISTLCPB+24                                               01095000
LCPFLG1  EQU   ISTLCPB+37                                               01096000
LCPFLCCW EQU   ISTLCPB+40                                               01097000
LCPLCCW  EQU   ISTLCPB+48                                               01098000
LCPPABA  EQU   LCPLCCW+4                                                01099000
LCPRPHA  EQU   LCPPABA                                                  01100000
ISTZCRR  EQU   0                                                        01101000
ZCRCRR   EQU   ISTZCRR                                                  01102000
ZCRFLGS1 EQU   ISTZCRR+12                                               01103000
ZCRFLGS2 EQU   ISTZCRR+13                                               01104000
ZCRIF0E1 EQU   ZCRFLGS2                                                 01105000
ZCRSWFLD EQU   ISTZCRR+14                                               01106000
ZCRENDSH EQU   ZCRSWFLD                                                 01107000
ZCRNDLCP EQU   ZCRSWFLD                                                 01108000
ZCRRESET EQU   ZCRSWFLD                                                 01109000
ZCRFLGS3 EQU   ISTZCRR+15                                               01110000
ZCRGENSW EQU   ISTZCRR+16                                               01111000
ZCRPFLGS EQU   ISTZCRR+17                                               01112000
ZCRIBPR  EQU   ISTZCRR+18                                               01113000
ZCRSCPSW EQU   ISTZCRR+19                                               01114000
ZCRPARMS EQU   ISTZCRR+24                                               01115000
ZCRFBPTR EQU   ZCRPARMS                                                 01116000
ZCRDFRDA EQU   ZCRPARMS+10                                              01117000
ZCRPCOD1 EQU   ZCRPARMS+12                                              01118000
ZCRPPG   EQU   ZCRPCOD1                                                 01119000
ZCRPLSBF EQU   ZCRPCOD1                                                 01120000
ZCRPLSCB EQU   ZCRPCOD1                                                 01121000
ZCRPBUF  EQU   ZCRPCOD1                                                 01122000
ZCRPCOD2 EQU   ZCRPARMS+13                                              01123000
ZCRSVRTN EQU   ISTZCRR+56                                               01124000
ZCRWKARA EQU   ISTZCRR+156                                              01125000
ZCRCIDSV EQU   ISTZCRR+192                                              01126000
ZCRAUDIT EQU   ISTZCRR+440                                              01127000
ZCRENTER EQU   ZCRAUDIT+5                                               01128000
ZCREICOA EQU   ZCRENTER+12                                              01129000
ZCRLCPB  EQU   ISTZCRR+480                                              01130000
ZCRRHRU  EQU   ZCRLCPB                                                  01131000
ISTPFCRR EQU   0                                                        01132000
PFCCRR   EQU   ISTPFCRR                                                 01133000
PFCCRRID EQU   PFCCRR                                                   01134000
PFCCRRLN EQU   PFCCRR+2                                                 01135000
PFCHDR   EQU   ISTPFCRR+4                                               01136000
PFCCRRO  EQU   PFCHDR                                                   01137000
PFCFRRO  EQU   PFCHDR+4                                                 01138000
ISTAPCRR EQU   0                                                        01139000
APCATFLG EQU   ISTAPCRR+16                                              01140000
APCRFLG  EQU   ISTAPCRR+18                                              01141000
APCSAVE  EQU   ISTAPCRR+44                                              01142000
APCCOMF  EQU   ISTAPCRR+116                                             01143000
APCCOMF1 EQU   APCCOMF                                                  01144000
APC31FLG EQU   ISTAPCRR+132                                             01145000
APC52FLG EQU   ISTAPCRR+133                                             01146000
APC53FLG EQU   ISTAPCRR+134                                             01147000
APC54FLG EQU   ISTAPCRR+135                                             01148000
APC57FLG EQU   ISTAPCRR+136                                             01149000
ISTDCCRR EQU   0                                                        01150000
CRRSPACE EQU   ISTDCCRR+12                                              01151000
CRRSAREA EQU   0                                                        01152000
CRRMAS   EQU   CRRSAREA+148                                             01153000
CRRMAS1  EQU   CRRMAS                                                   01154000
CRRMAS2  EQU   CRRMAS+1                                                 01155000
CRRMAS3  EQU   CRRMAS+2                                                 01156000
CRRMAS4  EQU   CRRMAS+3                                                 01157000
CRRRMAS1 EQU   CRRMAS+4                                                 01158000
CRRRMAS2 EQU   CRRMAS+5                                                 01159000
CRRRMAS3 EQU   CRRMAS+6                                                 01160000
CRRSMAS  EQU   CRRRMAS3                                                 01161000
CRRATS   EQU   CRRSAREA+156                                             01162000
CRRATS1  EQU   CRRATS                                                   01163000
CRRATS2  EQU   CRRATS+1                                                 01164000
CRRATS3  EQU   CRRATS+2                                                 01165000
CRRATS4  EQU   CRRATS+3                                                 01166000
CRRRATS1 EQU   CRRATS+4                                                 01167000
CRRRATS2 EQU   CRRATS+5                                                 01168000
CRRRATS3 EQU   CRRATS+6                                                 01169000
CRRSATS  EQU   CRRRATS3                                                 01170000
CRRFLGS1 EQU   CRRSAREA+164                                             01171000
CRRFLGS2 EQU   CRRSAREA+165                                             01172000
CRRFLGS3 EQU   CRRSAREA+166                                             01173000
CRRFLGS4 EQU   CRRSAREA+167                                             01174000
CRRFLGS  EQU   CRRSAREA+168                                             01175000
CRRRFLG1 EQU   CRRSAREA+169                                             01176000
CRRRTYPE EQU   CRRRFLG1                                                 01177000
CRRFDBK1 EQU   CRRSAREA+170                                             01178000
CRRFDB2  EQU   CRRFDBK1+1                                               01179000
CRRFDB3  EQU   CRRFDBK1+2                                               01180000
CRRFDBK2 EQU   CRRSAREA+176                                             01181000
CRRDSB   EQU   CRRFDBK2                                                 01182000
CRRESR   EQU   CRRFDBK2+2                                               01183000
CRRTRBUF EQU   CRRSAREA+204                                             01184000
CRRBFLGS EQU   CRRSAREA+280                                             01185000
ISTASCRR EQU   0                                                        01186000
ASCFLAGS EQU   ISTASCRR+16                                              01187000
ASCFLG1  EQU   ASCFLAGS                                                 01188000
ASCFLG2  EQU   ASCFLAGS+2                                               01189000
ASCFLG3  EQU   ASCFLAGS+4                                               01190000
ASCUSRGS EQU   ISTASCRR+28                                              01191000
ISTRIA   EQU   0                                                        01192000
RIAABRGS EQU   ISTRIA+16                                                01193000
RIAFLGS  EQU   ISTRIA+80                                                01194000
RIAFLG1  EQU   RIAFLGS                                                  01195000
RIAFLG2  EQU   RIAFLGS+1                                                01196000
ISTCFCRR EQU   0                                                        01197000
CFCAUDIT EQU   ISTCFCRR                                                 01198000
CFCNTRD  EQU   CFCAUDIT                                                 01199000
CFCCRT   EQU   CFCAUDIT+1                                               01200000
ISTCRA   EQU   0                                                        01201000
CRABASIC EQU   ISTCRA                                                   01202000
CRAHDR   EQU   CRABASIC                                                 01203000
CRACRR   EQU   CRAHDR                                                   01204000
CRALKACT EQU   CRABASIC+8                                               01205000
CRASVC   EQU   ISTCRA+848                                               01206000
CRABUFA  EQU   CRASVC+68                                                01207000
ISTPAB   EQU   0                                                        01208000
PABWQCHN EQU   ISTPAB                                                   01209000
PABWEQA  EQU   PABWQCHN                                                 01210000
PABCHAIN EQU   PABWQCHN+4                                               01211000
PABDVTA  EQU   ISTPAB+9                                                 01212000
PABRPHFG EQU   ISTPAB+12                                                01213000
PABFLAGS EQU   PABRPHFG                                                 01214000
PABERLCK EQU   PABFLAGS                                                 01215000
PABERRLK EQU   PABERLCK                                                 01216000
ISTDYPAB EQU   0                                                        01217000
ISTLOK   EQU   0                                                        01218000
LOKCHN   EQU   ISTLOK+1                                                 01219000
LOKCHNG  EQU   LOKCHN                                                   01220000
@NM00042 EQU   LOKCHNG+2                                                01221000
ISTATCVT EQU   0                                                        01222000
ATCCOM   EQU   ISTATCVT                                                 01223000
ATCSTAT  EQU   ATCCOM                                                   01224000
ATCSTAT1 EQU   ATCSTAT                                                  01225000
ATCSTFLG EQU   ATCSTAT+1                                                01226000
ATCPOFLG EQU   ATCSTAT+2                                                01227000
ATCSTAT4 EQU   ATCSTAT+3                                                01228000
ATCIOTRC EQU   ATCCOM+140                                               01229000
ATCTHTRC EQU   ATCIOTRC                                                 01230000
ATCCSMR  EQU   ISTATCVT+296                                             01231000
ATCSHRFG EQU   ISTATCVT+316                                             01232000
ATCHPGM  EQU   ISTATCVT+384                                             01233000
ATCVLCNT EQU   ISTATCVT+772                                             01234000
ATCRNO   EQU   ISTATCVT+788                                             01235000
ATCSOPD  EQU   ISTATCVT+792                                             01236000
ATCSIPD  EQU   ISTATCVT+800                                             01237000
ATCSECST EQU   ISTATCVT+812                                             01238000
ATCSTAT2 EQU   ISTATCVT+818                                             01239000
ATCVTBAM EQU   ISTATCVT+908                                             01240000
@NM00050 EQU   ATCVTBAM+3                                               01241000
ATCAOSM  EQU   ISTATCVT+912                                             01242000
ATCGSRBQ EQU   ATCAOSM+4                                                01243000
ATCGSRBG EQU   ATCGSRBQ                                                 01244000
ATCAP34  EQU   ATCAOSM+32                                               01245000
ATCZPSVT EQU   ATCAOSM+72                                               01246000
ATCICAPP EQU   ATCAOSM+100                                              01247000
ATCLDAPP EQU   ATCAOSM+120                                              01248000
ATCDAPVT EQU   ATCAOSM+140                                              01249000
ATCAP37  EQU   ATCAOSM+264                                              01250000
ATCCRA   EQU   ATCAOSM+280                                              01251000
ATCCRACN EQU   ATCCRA+4                                                 01252000
ATCSRB   EQU   ATCAOSM+288                                              01253000
ATCSRBCN EQU   ATCSRB+4                                                 01254000
ATCCRPL  EQU   ATCAOSM+296                                              01255000
ATCRPLCN EQU   ATCCRPL+4                                                01256000
ATCSQAFR EQU   ATCAOSM+304                                              01257000
ATCORTBC EQU   ATCSQAFR+4                                               01258000
ATCORSRB EQU   ATCORTBC                                                 01259000
@NM00052 EQU   ATCAOSM+332                                              01260000
ATCVTFLG EQU   ATCAOSM+392                                              01261000
ATCZFLAG EQU   ATCAOSM+588                                              01262000
ISTDEVCH EQU   0                                                        01263000
DEVSHCH  EQU   ISTDEVCH                                                 01264000
DEVCHAR  EQU   DEVSHCH                                                  01265000
DEVTCODE EQU   ISTDEVCH+1                                               01266000
DEVFLAGS EQU   ISTDEVCH+3                                               01267000
DEVFCCTL EQU   DEVFLAGS                                                 01268000
DEVCHAR3 EQU   DEVFLAGS                                                 01269000
ISTNCB   EQU   0                                                        01270000
NCBFLAGS EQU   ISTNCB+24                                                01271000
NCBFRAS  EQU   NCBFLAGS+1                                               01272000
NCBFTRIO EQU   NCBFRAS                                                  01273000
NCBFLAG1 EQU   NCBFLAGS+2                                               01274000
ISTLDNCB EQU   0                                                        01275000
LDNCFLAG EQU   ISTLDNCB+54                                              01276000
LDNFLAGS EQU   ISTLDNCB+107                                             01277000
LDNZF007 EQU   LDNFLAGS                                                 01278000
LDNFLAG2 EQU   ISTLDNCB+110                                             01279000
LDNZIOLK EQU   ISTLDNCB+184                                             01280000
LDNZERPF EQU   ISTLDNCB+185                                             01281000
LDNZCPAN EQU   LDNZERPF                                                 01282000
LDNZEPIN EQU   LDNZERPF                                                 01283000
LDNZLPC  EQU   ISTLDNCB+186                                             01284000
LDNDCDEB EQU   ISTLDNCB+304                                             01285000
LDNZSAV3 EQU   ISTLDNCB+376                                             01286000
LDNZSAV4 EQU   LDNZSAV3+8                                               01287000
LDNZH003 EQU   ISTLDNCB+577                                             01288000
ISTDNCB  EQU   0                                                        01289000
DNCOS    EQU   ISTDNCB+56                                               01290000
DNCZFLGS EQU   DNCOS                                                    01291000
DNCBSCED EQU   DNCOS+2                                                  01292000
ISTPROCD EQU   0                                                        01293000
PROPROC  EQU   ISTPROCD                                                 01294000
PROPROC1 EQU   PROPROC                                                  01295000
PROPROC2 EQU   PROPROC+1                                                01296000
PROPROC3 EQU   PROPROC+2                                                01297000
PROPROC4 EQU   PROPROC+3                                                01298000
PROPROCS EQU   0                                                        01299000
PROSETMS EQU   PROPROCS+1                                               01300000
PROSETM2 EQU   PROSETMS                                                 01301000
PROSETM3 EQU   PROSETMS+1                                               01302000
PROSETM4 EQU   PROSETMS+2                                               01303000
ISTFMCB  EQU   0                                                        01304000
FMCSTAT  EQU   ISTFMCB+28                                               01305000
FMCSTAT1 EQU   ISTFMCB+29                                               01306000
FMCCMDFL EQU   ISTFMCB+31                                               01307000
FMCCMPS1 EQU   ISTFMCB+36                                               01308000
FMCMODE  EQU   ISTFMCB+52                                               01309000
FMCPAB2  EQU   ISTFMCB+80                                               01310000
FMCPAB4  EQU   ISTFMCB+112                                              01311000
FMCSIPA  EQU   ISTFMCB+148                                              01312000
FMCNXOSQ EQU   ISTFMCB+152                                              01313000
FMCNXCFM EQU   FMCNXOSQ                                                 01314000
FMCNXOSC EQU   FMCNXOSQ+2                                               01315000
FMCSSTAT EQU   ISTFMCB+159                                              01316000
FMCPACE  EQU   ISTFMCB+160                                              01317000
FMCPACEN EQU   FMCPACE                                                  01318000
FMCPACEM EQU   FMCPACE+1                                                01319000
FMCPACPC EQU   FMCPACE+2                                                01320000
FMCCVAL  EQU   FMCPACE+3                                                01321000
FMCOBCE  EQU   FMCCVAL                                                  01322000
FMCCLEXT EQU   ISTFMCB+164                                              01323000
FMCRPLA  EQU   FMCCLEXT                                                 01324000
FMCFBA   EQU   FMCCLEXT+4                                               01325000
FMCCMPS2 EQU   FMCCLEXT+16                                              01326000
FMCFLGA  EQU   FMCCMPS2                                                 01327000
FMCFLGCL EQU   FMCCMPS2+1                                               01328000
FMCPSCMD EQU   FMCCMPS2+2                                               01329000
FMCPSTAT EQU   FMCCMPS2+3                                               01330000
FMCSTAT2 EQU   ISTFMCB+186                                              01331000
FMCMODEB EQU   ISTFMCB+189                                              01332000
FMCCLEAR EQU   FMCMODEB                                                 01333000
FMCCLSEQ EQU   ISTFMCB+190                                              01334000
FMCRRESP EQU   ISTFMCB+195                                              01335000
FMCSSEGQ EQU   ISTFMCB+200                                              01336000
FMCFBAS  EQU   ISTFMCB+216                                              01337000
FMCZV002 EQU   FMCFBAS                                                  01338000
FMCSNCTL EQU   ISTFMCB+224                                              01339000
FMCSCFLG EQU   FMCSNCTL                                                 01340000
FMCVS1   EQU   ISTFMCB+232                                              01341000
FMCZFLAG EQU   FMCVS1                                                   01342000
FMCZF002 EQU   FMCZFLAG                                                 01343000
FMCZF006 EQU   FMCZFLAG                                                 01344000
FMCZFA06 EQU   FMCZF006                                                 01345000
FMCZFD06 EQU   FMCZF006+1                                               01346000
FMCLBXM  EQU   FMCVS1+12                                                01347000
FMCSHEAQ EQU   FMCLBXM                                                  01348000
FMCLCPBQ EQU   FMCVS1+16                                                01349000
FMCLCPB2 EQU   FMCLCPBQ+1                                               01350000
FMCLCPAQ EQU   FMCVS1+20                                                01351000
FMCZX001 EQU   FMCVS1+28                                                01352000
FMCSEQ1  EQU   FMCVS1+34                                                01353000
FMCZFLG2 EQU   FMCVS1+35                                                01354000
FMCCVFLG EQU   FMCVS1+44                                                01355000
FMCFLAG  EQU   0                                                        01356000
FMCFLGB  EQU   FMCFLAG                                                  01357000
ISTFDB   EQU   0                                                        01358000
FDBFDBA  EQU   ISTFDB                                                   01359000
FDBDATAA EQU   ISTFDB+4                                                 01360000
FDBDATCT EQU   ISTFDB+8                                                 01361000
FDBOFSET EQU   ISTFDB+10                                                01362000
ISTFSB   EQU   0                                                        01363000
FSBFSB   EQU   ISTFSB                                                   01364000
FSBTYPE  EQU   FSBFSB                                                   01365000
FSBLNGTH EQU   FSBFSB+1                                                 01366000
FSBMNRCD EQU   FSBFSB+2                                                 01367000
FSBSFLGS EQU   FSBFSB+3                                                 01368000
FSBFSBA  EQU   FSBFSB+4                                                 01369000
FSBBTH   EQU   FSBFSB+8                                                 01370000
FSBCID   EQU   FSBBTH                                                   01371000
FSBRQTAG EQU   FSBBTH+4                                                 01372000
FSBSEQID EQU   FSBRQTAG                                                 01373000
FSBFLAGS EQU   FSBSEQID                                                 01374000
FSBSEQ   EQU   FSBSEQID+1                                               01375000
FSBCSWST EQU   FSBBTH+6                                                 01376000
FSBTHFLD EQU   FSBCSWST                                                 01377000
FSBTH1   EQU   FSBTHFLD                                                 01378000
FSBSYSRS EQU   FSBTH1                                                   01379000
FSBTH2   EQU   FSBTHFLD+1                                               01380000
FSBEXTRS EQU   FSBTH2                                                   01381000
FSBXFSTS EQU   FSBEXTRS                                                 01382000
FSBXCODE EQU   FSBEXTRS                                                 01383000
FSBNETRS EQU   FSBFSB+16                                                01384000
FSBSRCAT EQU   FSBNETRS                                                 01385000
FSBMJRCD EQU   FSBSRCAT                                                 01386000
FSBERC   EQU   FSBNETRS+1                                               01387000
FSBELI   EQU   FSBERC                                                   01388000
FSBECI   EQU   FSBERC                                                   01389000
FSBFBMI  EQU   FSBERC                                                   01390000
FSBDMGRS EQU   FSBFSB+18                                                01391000
FSBSS1   EQU   FSBDMGRS                                                 01392000
FSBSS2   EQU   FSBDMGRS+1                                               01393000
FSBLCPB  EQU   FSBFSB+20                                                01394000
FSBMSGID EQU   FSBLCPB                                                  01395000
FSBLCCWA EQU   FSBFSB+24                                                01396000
FSBRLSTS EQU   FSBLCCWA                                                 01397000
ISTZLBUF EQU   0                                                        01398000
ZLBFSM   EQU   ISTZLBUF+4                                               01399000
ISTLSCB  EQU   0                                                        01400000
LSC1WORD EQU   ISTLSCB                                                  01401000
LSCTYPE  EQU   LSC1WORD                                                 01402000
LSCREQTG EQU   LSC1WORD+2                                               01403000
LSCZRT02 EQU   LSCREQTG                                                 01404000
LSCZRT03 EQU   LSCREQTG                                                 01405000
LSCZRT04 EQU   LSCREQTG                                                 01406000
LSCZRT05 EQU   LSCREQTG                                                 01407000
LSCZRT06 EQU   LSCREQTG                                                 01408000
LSCZRT07 EQU   LSCREQTG                                                 01409000
LSCZMNRC EQU   LSCREQTG+1                                               01410000
LSCZRT08 EQU   LSCZMNRC                                                 01411000
LSCZRT09 EQU   LSCZMNRC                                                 01412000
LSCZRT0B EQU   LSCZMNRC                                                 01413000
LSCCHAIN EQU   ISTLSCB+4                                                01414000
LSCCHAI1 EQU   LSCCHAIN                                                 01415000
LSCRUCNT EQU   ISTLSCB+8                                                01416000
LSCFLGS  EQU   ISTLSCB+9                                                01417000
LSCEXRES EQU   LSCFLGS                                                  01418000
LSCSEQ   EQU   ISTLSCB+10                                               01419000
LSCLCPBA EQU   ISTLSCB+16                                               01420000
LSCLCCWA EQU   ISTLSCB+20                                               01421000
LSCFDBA  EQU   ISTLSCB+24                                               01422000
ISTWKE   EQU   0                                                        01423000
WKECHAIN EQU   ISTWKE+4                                                 01424000
WKEFLAGS EQU   WKECHAIN                                                 01425000
ISTAPC37 EQU   0                                                        01426000
ISTAPC34 EQU   0                                                        01427000
IOSATTSC EQU   IOSIPIB                                                  01428000
IOSWTOWA EQU   IOSIPIB                                                  01429000
IOSPCISC EQU   IOSIPIB                                                  01430000
CVTS01   EQU   CVTPGSIA                                                 01431000
CVTLPDIA EQU   CVTS01+12                                                01432000
CVTDIRST EQU   CVTLPDIA                                                 01433000
CVTSLIDA EQU   CVTS01+24                                                01434000
CVTCTLFG EQU   CVTS01+50                                                01435000
CVTRV210 EQU   CVTS01+424                                               01436000
CVTRV219 EQU   CVTS01+425                                               01437000
CVTRV228 EQU   CVTS01+426                                               01438000
CVTRV237 EQU   CVTS01+427                                               01439000
CVTMFRTR EQU   CVTS01+452                                               01440000
CVTRV262 EQU   CVTS01+468                                               01441000
CVTRV271 EQU   CVTS01+469                                               01442000
CVTRV280 EQU   CVTS01+470                                               01443000
CVTRV289 EQU   CVTS01+471                                               01444000
CVTGSDA  EQU   CVTS01+600                                               01445000
SRUSENSE EQU   ISTSRU                                                   01446000
SRURMS   EQU   ISTSRU                                                   01447000
SRUZIB   EQU   ISTSRU                                                   01448000
SRUNETS  EQU   SRUZIB                                                   01449000
ISTUNBRU EQU   SRUTYPE                                                  01450000
LCPZTIE  EQU   LCPCID                                                   01451000
LCPZSNAM EQU   LCPZTIE+8                                                01452000
FSBCOMBN EQU   FSBNETRS                                                 01453000
FSBRHFLD EQU   FSBCOMBN+1                                               01454000
FSBRH3   EQU   FSBRHFLD+2                                               01455000
FSBLDFLG EQU   FSBRH3                                                   01456000
@NM00069 EQU   FSBRQTAG                                                 01457000
ZLBBTRAN EQU   ISTZLBUF                                                 01458000
ZLBFDBZ  EQU   ZLBBTRAN                                                 01459000
ZLBAIO   EQU   ZLBBTRAN+16                                              01460000
ZLBDTIO  EQU   ZLBFSM                                                   01461000
ZLBCCW1  EQU   ZLBDTIO                                                  01462000
ZLBCCW2  EQU   ZLBDTIO+8                                                01463000
ZLBCCW3  EQU   ZLBDTIO+16                                               01464000
ZLBSNS   EQU   ZLBDTIO+28                                               01465000
ZLBERC   EQU   ZLBDTIO+29                                               01466000
ZLBCOMP  EQU   ZLBDTIO+31                                               01467000
ZLBSAF   EQU   ZLBDTIO+48                                               01468000
ZLBSTAT  EQU   ZLBSAF                                                   01469000
ZLBDEVST EQU   ZLBSTAT                                                  01470000
ZLBRQTG  EQU   ZLBDTIO+50                                               01471000
ZLBRQFLG EQU   ZLBRQTG                                                  01472000
ZLBFLAGS EQU   ZLBDTIO+56                                               01473000
ZLBTEXTA EQU   ZLBCCW3                                                  01474000
ZLBTEXTB EQU   ZLBFLAGS                                                 01475000
ZLBTEXT1 EQU   ZLBTEXTB                                                 01476000
ZLBTEXTC EQU   ZLBFLAGS                                                 01477000
ZLBPPL   EQU   ZLBTEXTC                                                 01478000
ZLBFAIO  EQU   ZLBAIO                                                   01479000
ZLBFSB   EQU   ZLBFAIO                                                  01480000
ZLBFDBS  EQU   ZLBFAIO+32                                               01481000
TEMPFLG  EQU   FSBSFLGS                                                 01482000
FSBATOP  EQU   TEMPFLG                                                  01483000
SRB      EQU   SRBSECT                                                  01484000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01485000
@NM00070 EQU   TEMPFLG                                                  01486000
ZLBPPCSC EQU   ZLBPPL+14                                                01487000
ZLBPPRS1 EQU   ZLBPPL+13                                                01488000
ZLBPPRSV EQU   ZLBPPL+12                                                01489000
ZLBPPCLG EQU   ZLBPPL+12                                                01490000
ZLBPPCC  EQU   ZLBPPL+12                                                01491000
ZLBPPINT EQU   ZLBPPL+12                                                01492000
ZLBPPHIO EQU   ZLBPPL+12                                                01493000
ZLBPP    EQU   ZLBPPL+4                                                 01494000
ZLBPPLDB EQU   ZLBPPL+1                                                 01495000
ZLBPPLF  EQU   ZLBPPL                                                   01496000
ZLBTEXT  EQU   ZLBTEXTA+8                                               01497000
ZLBRSV0A EQU   ZLBTEXTA                                                 01498000
ZLBTCP   EQU   ZLBFLAGS+8                                               01499000
ZLBTCSW  EQU   ZLBFLAGS+1                                               01500000
ZLBRSV09 EQU   ZLBFLAGS                                                 01501000
ZLBWCCSP EQU   ZLBFLAGS                                                 01502000
ZLBRSV07 EQU   ZLBFLAGS                                                 01503000
ZLBLSTST EQU   ZLBDTIO+52                                               01504000
ZLBRQSEQ EQU   ZLBRQTG+1                                                01505000
ZLBRT0B  EQU   ZLBRQFLG+1                                               01506000
ZLBRT0A  EQU   ZLBRQFLG+1                                               01507000
ZLBRT09  EQU   ZLBRQFLG+1                                               01508000
ZLBRT08  EQU   ZLBRQFLG+1                                               01509000
ZLBRT07  EQU   ZLBRQFLG                                                 01510000
ZLBRT06  EQU   ZLBRQFLG                                                 01511000
ZLBRT05  EQU   ZLBRQFLG                                                 01512000
ZLBRT04  EQU   ZLBRQFLG                                                 01513000
ZLBRT03  EQU   ZLBRQFLG                                                 01514000
ZLBRT02  EQU   ZLBRQFLG                                                 01515000
ZLBRT01  EQU   ZLBRQFLG                                                 01516000
ZLBRT00  EQU   ZLBRQFLG                                                 01517000
ZLBCHNST EQU   ZLBSTAT+1                                                01518000
ZLBUCST  EQU   ZLBDEVST                                                 01519000
ZLBDEST  EQU   ZLBDEVST                                                 01520000
ZLBRSV10 EQU   ZLBDEVST                                                 01521000
ZLBLSTBF EQU   ZLBDTIO+44                                               01522000
ZLBRSV11 EQU   ZLBDTIO+40                                               01523000
ZLBLCCWA EQU   ZLBDTIO+36                                               01524000
ZLBLCPBA EQU   ZLBDTIO+32                                               01525000
ZLBRSV08 EQU   ZLBDTIO+30                                               01526000
ZLBRSV05 EQU   ZLBERC                                                   01527000
ZLBFBMI  EQU   ZLBERC                                                   01528000
ZLBETI   EQU   ZLBERC                                                   01529000
ZLBEMI   EQU   ZLBERC                                                   01530000
ZLBEBI   EQU   ZLBERC                                                   01531000
ZLBECI   EQU   ZLBERC                                                   01532000
ZLBELI   EQU   ZLBERC                                                   01533000
ZLBSOC   EQU   ZLBSNS                                                   01534000
ZLBSCC   EQU   ZLBSNS                                                   01535000
ZLBSUS   EQU   ZLBSNS                                                   01536000
ZLBSDC   EQU   ZLBSNS                                                   01537000
ZLBSEQCK EQU   ZLBSNS                                                   01538000
ZLBSBOL  EQU   ZLBSNS                                                   01539000
ZLBSIR   EQU   ZLBSNS                                                   01540000
ZLBSCR   EQU   ZLBSNS                                                   01541000
ZLBRSV12 EQU   ZLBDTIO+24                                               01542000
ZLBCPTC3 EQU   ZLBCCW3+6                                                01543000
ZLBRSV04 EQU   ZLBCCW3+5                                                01544000
ZLBCPFL3 EQU   ZLBCCW3+4                                                01545000
ZLBCPAD3 EQU   ZLBCCW3+1                                                01546000
ZLBCPCF3 EQU   ZLBCCW3                                                  01547000
ZLBCPTC2 EQU   ZLBCCW2+6                                                01548000
ZLBRSV03 EQU   ZLBCCW2+5                                                01549000
ZLBCPFL2 EQU   ZLBCCW2+4                                                01550000
ZLBCPAD2 EQU   ZLBCCW2+1                                                01551000
ZLBCPCF2 EQU   ZLBCCW2                                                  01552000
ZLBCPTC1 EQU   ZLBCCW1+6                                                01553000
ZLBCMOD  EQU   ZLBCCW1+5                                                01554000
ZLBCPFL1 EQU   ZLBCCW1+4                                                01555000
ZLBCPAD1 EQU   ZLBCCW1+1                                                01556000
ZLBCPCF1 EQU   ZLBCCW1                                                  01557000
ZLBLNG2  EQU   ZLBBTRAN+14                                              01558000
ZLBRSV01 EQU   ZLBBTRAN+12                                              01559000
FSBRT0B  EQU   @NM00069+1                                               01560000
FSBRT0A  EQU   @NM00069+1                                               01561000
FSBRT09  EQU   @NM00069+1                                               01562000
FSBRT08  EQU   @NM00069+1                                               01563000
FSBRT07  EQU   @NM00069                                                 01564000
FSBRT06  EQU   @NM00069                                                 01565000
FSBRT05  EQU   @NM00069                                                 01566000
FSBRT04  EQU   @NM00069                                                 01567000
FSBRT03  EQU   @NM00069                                                 01568000
FSBRT02  EQU   @NM00069                                                 01569000
FSBRT01  EQU   @NM00069                                                 01570000
FSBRT00  EQU   @NM00069                                                 01571000
FSBLDCUF EQU   FSBLDFLG                                                 01572000
FSBLDSIF EQU   FSBLDFLG                                                 01573000
FSBLDSOF EQU   FSBLDFLG                                                 01574000
FSBLDEBF EQU   FSBLDFLG                                                 01575000
FSBLDBBF EQU   FSBLDFLG                                                 01576000
FSBLDFME EQU   FSBLDFLG                                                 01577000
FSBLDSCF EQU   FSBLDFLG                                                 01578000
FSBLDRMF EQU   FSBLDFLG                                                 01579000
FSBRH2   EQU   FSBRHFLD+1                                               01580000
FSBRH1   EQU   FSBRHFLD                                                 01581000
FSBALIGN EQU   FSBCOMBN                                                 01582000
LCPZTRV4 EQU   LCPZSNAM+4                                               01583000
LCPZTRV1 EQU   LCPZSNAM                                                 01584000
LCPZSNA  EQU   LCPZTIE+4                                                01585000
LCPZFMCA EQU   LCPZTIE                                                  01586000
UNBTYPE  EQU   ISTUNBRU                                                 01587000
SRUNAF   EQU   SRUZIB+3                                                 01588000
SRUNSREQ EQU   SRUNETS+2                                                01589000
SRUNSUBC EQU   SRUNETS+1                                                01590000
SRUNSCAT EQU   SRUNETS                                                  01591000
SRUREQRE EQU   SRURMS+2                                                 01592000
SRUPFX2  EQU   SRURMS+1                                                 01593000
SRUPFX1  EQU   SRURMS                                                   01594000
SRUSENS2 EQU   SRUSENSE+2                                               01595000
SRUSNS2  EQU   SRUSENSE+1                                               01596000
SRUSNS1  EQU   SRUSENSE                                                 01597000
CVTRV628 EQU   CVTS01+728                                               01598000
CVTRV627 EQU   CVTS01+724                                               01599000
CVTRV626 EQU   CVTS01+720                                               01600000
CVTRV625 EQU   CVTS01+716                                               01601000
CVTRV624 EQU   CVTS01+712                                               01602000
CVTRV623 EQU   CVTS01+708                                               01603000
CVTRV622 EQU   CVTS01+704                                               01604000
CVTRV621 EQU   CVTS01+700                                               01605000
CVTRV620 EQU   CVTS01+696                                               01606000
CVTRV619 EQU   CVTS01+692                                               01607000
CVTRV618 EQU   CVTS01+688                                               01608000
CVTRV617 EQU   CVTS01+684                                               01609000
CVTRV616 EQU   CVTS01+680                                               01610000
CVTRV615 EQU   CVTS01+676                                               01611000
CVTRV614 EQU   CVTS01+672                                               01612000
CVTRV613 EQU   CVTS01+668                                               01613000
CVTTCASP EQU   CVTS01+664                                               01614000
CVT0PT03 EQU   CVTS01+660                                               01615000
CVT0PT0E EQU   CVTS01+656                                               01616000
CVTIRM   EQU   CVTS01+652                                               01617000
CVTCGK   EQU   CVTS01+648                                               01618000
CVTRV607 EQU   CVTS01+644                                               01619000
CVTRV606 EQU   CVTS01+640                                               01620000
CVTRV605 EQU   CVTS01+636                                               01621000
CVTRV604 EQU   CVTS01+632                                               01622000
CVTEFF02 EQU   CVTS01+628                                               01623000
CVTCBBR  EQU   CVTS01+624                                               01624000
CVTSSCR  EQU   CVTS01+620                                               01625000
CVTEVENT EQU   CVTS01+616                                               01626000
CVTCRCA  EQU   CVTS01+612                                               01627000
CVTTPIO  EQU   CVTS01+608                                               01628000
CVTADV   EQU   CVTS01+604                                               01629000
CVTGSDAB EQU   CVTGSDA                                                  01630000
CVTQV3   EQU   CVTS01+596                                               01631000
CVTQV2   EQU   CVTS01+592                                               01632000
CVTQV1   EQU   CVTS01+588                                               01633000
CVTRPT   EQU   CVTS01+584                                               01634000
CVTSSRB  EQU   CVTS01+580                                               01635000
CVTCSDRL EQU   CVTS01+576                                               01636000
CVTEXP1  EQU   CVTS01+572                                               01637000
CVTRMPMT EQU   CVTS01+568                                               01638000
CVTRMPTT EQU   CVTS01+564                                               01639000
CVTVPSA  EQU   CVTS01+560                                               01640000
CVTVSTOP EQU   CVTS01+556                                               01641000
CVTGTFR8 EQU   CVTS01+552                                               01642000
CVTQUIT  EQU   CVTS01+548                                               01643000
CVTVACR  EQU   CVTS01+544                                               01644000
CVTWTCB  EQU   CVTS01+540                                               01645000
CVTSTPRS EQU   CVTS01+536                                               01646000
CVT0PT02 EQU   CVTS01+532                                               01647000
CVTDARCM EQU   CVTS01+528                                               01648000
CVTIRECM EQU   CVTS01+524                                               01649000
CVTJRECM EQU   CVTS01+520                                               01650000
CVTVEMS0 EQU   CVTS01+516                                               01651000
CVTSPFRR EQU   CVTS01+512                                               01652000
CVTRLSTG EQU   CVTS01+508                                               01653000
CVT0TC0A EQU   CVTS01+504                                               01654000
CVTGMBR  EQU   CVTS01+500                                               01655000
CVTLFRM  EQU   CVTS01+496                                               01656000
CVTRMBR  EQU   CVTS01+492                                               01657000
CVTVIOP  EQU   CVTS01+488                                               01658000
CVTRV307 EQU   CVTS01+486                                               01659000
CVTRV306 EQU   CVTS01+484                                               01660000
CVTRV305 EQU   CVTS01+482                                               01661000
CVTRV304 EQU   CVTS01+480                                               01662000
CVTRV303 EQU   CVTS01+478                                               01663000
CVTRV302 EQU   CVTS01+476                                               01664000
CVTTRCA  EQU   CVTS01+472                                               01665000
CVTRV297 EQU   CVTRV289                                                 01666000
CVTRV296 EQU   CVTRV289                                                 01667000
CVTRV295 EQU   CVTRV289                                                 01668000
CVTRV294 EQU   CVTRV289                                                 01669000
CVTRV293 EQU   CVTRV289                                                 01670000
CVTRV292 EQU   CVTRV289                                                 01671000
CVTRV291 EQU   CVTRV289                                                 01672000
CVTRV290 EQU   CVTRV289                                                 01673000
CVTRV288 EQU   CVTRV280                                                 01674000
CVTRV287 EQU   CVTRV280                                                 01675000
CVTRV286 EQU   CVTRV280                                                 01676000
CVTRV285 EQU   CVTRV280                                                 01677000
CVTRV284 EQU   CVTRV280                                                 01678000
CVTRV283 EQU   CVTRV280                                                 01679000
CVTRV282 EQU   CVTRV280                                                 01680000
CVTRV281 EQU   CVTRV280                                                 01681000
CVTRV279 EQU   CVTRV271                                                 01682000
CVTRV278 EQU   CVTRV271                                                 01683000
CVTRV277 EQU   CVTRV271                                                 01684000
CVTRV276 EQU   CVTRV271                                                 01685000
CVTRV275 EQU   CVTRV271                                                 01686000
CVTRV274 EQU   CVTRV271                                                 01687000
CVTRV273 EQU   CVTRV271                                                 01688000
CVTRV272 EQU   CVTRV271                                                 01689000
CVTRV270 EQU   CVTRV262                                                 01690000
CVTRV269 EQU   CVTRV262                                                 01691000
CVTRV268 EQU   CVTRV262                                                 01692000
CVTRV267 EQU   CVTRV262                                                 01693000
CVTRV266 EQU   CVTRV262                                                 01694000
CVTRV265 EQU   CVTRV262                                                 01695000
CVTRV264 EQU   CVTRV262                                                 01696000
CVTRV263 EQU   CVTRV262                                                 01697000
CVTVFP   EQU   CVTS01+464                                               01698000
CVTVSI   EQU   CVTS01+460                                               01699000
CVTVPSIB EQU   CVTS01+456                                               01700000
CVTMFACT EQU   CVTMFRTR                                                 01701000
CVTMFCTL EQU   CVTS01+448                                               01702000
CVTPVBP  EQU   CVTS01+444                                               01703000
CVTPWI   EQU   CVTS01+440                                               01704000
CVTRV254 EQU   CVTS01+438                                               01705000
CVTRV253 EQU   CVTS01+436                                               01706000
CVTRV252 EQU   CVTS01+434                                               01707000
CVTRV251 EQU   CVTS01+433                                               01708000
CVTRV250 EQU   CVTS01+432                                               01709000
CVTRV249 EQU   CVTS01+431                                               01710000
CVTRV248 EQU   CVTS01+430                                               01711000
CVTRV247 EQU   CVTS01+429                                               01712000
CVTRV246 EQU   CVTS01+428                                               01713000
CVTRV245 EQU   CVTRV237                                                 01714000
CVTRV244 EQU   CVTRV237                                                 01715000
CVTRV243 EQU   CVTRV237                                                 01716000
CVTRV242 EQU   CVTRV237                                                 01717000
CVTRV241 EQU   CVTRV237                                                 01718000
CVTRV240 EQU   CVTRV237                                                 01719000
CVTRV239 EQU   CVTRV237                                                 01720000
CVTRV238 EQU   CVTRV237                                                 01721000
CVTRV236 EQU   CVTRV228                                                 01722000
CVTRV235 EQU   CVTRV228                                                 01723000
CVTRV234 EQU   CVTRV228                                                 01724000
CVTRV233 EQU   CVTRV228                                                 01725000
CVTRV232 EQU   CVTRV228                                                 01726000
CVTRV231 EQU   CVTRV228                                                 01727000
CVTRV230 EQU   CVTRV228                                                 01728000
CVTRV229 EQU   CVTRV228                                                 01729000
CVTRV227 EQU   CVTRV219                                                 01730000
CVTRV226 EQU   CVTRV219                                                 01731000
CVTRV225 EQU   CVTRV219                                                 01732000
CVTRV224 EQU   CVTRV219                                                 01733000
CVTRV223 EQU   CVTRV219                                                 01734000
CVTRV222 EQU   CVTRV219                                                 01735000
CVTRV221 EQU   CVTRV219                                                 01736000
CVTRV220 EQU   CVTRV219                                                 01737000
CVTRV218 EQU   CVTRV210                                                 01738000
CVTRV217 EQU   CVTRV210                                                 01739000
CVTRV216 EQU   CVTRV210                                                 01740000
CVTRV215 EQU   CVTRV210                                                 01741000
CVTRV214 EQU   CVTRV210                                                 01742000
CVTRV213 EQU   CVTRV210                                                 01743000
CVTRV212 EQU   CVTRV210                                                 01744000
CVTRV211 EQU   CVTRV210                                                 01745000
CVTLCCAT EQU   CVTS01+420                                               01746000
CVTPCCAT EQU   CVTS01+416                                               01747000
CVTIPCRP EQU   CVTS01+412                                               01748000
CVTIPCRI EQU   CVTS01+408                                               01749000
CVTIPCDS EQU   CVTS01+404                                               01750000
CVTAIDVT EQU   CVTS01+400                                               01751000
CVTSSAP  EQU   CVTS01+396                                               01752000
CVTEHCIR EQU   CVTS01+392                                               01753000
CVTEHDEF EQU   CVTS01+388                                               01754000
CVTDAIR  EQU   CVTS01+384                                               01755000
CVTPERFM EQU   CVTS01+380                                               01756000
CVT044R2 EQU   CVTS01+376                                               01757000
CVTFETCH EQU   CVTS01+372                                               01758000
CVTRSTWD EQU   CVTS01+368                                               01759000
CVTSPOST EQU   CVTS01+364                                               01760000
CVTIOBP  EQU   CVTS01+360                                               01761000
CVTASMVT EQU   CVTS01+356                                               01762000
CVTRECRQ EQU   CVTS01+352                                               01763000
CVTWSAC  EQU   CVTS01+348                                               01764000
CVTRV149 EQU   CVTS01+344                                               01765000
CVTWSAL  EQU   CVTS01+340                                               01766000
CVTSPSA  EQU   CVTS01+336                                               01767000
CVTGLMN  EQU   CVTS01+332                                               01768000
CVTVEAC0 EQU   CVTS01+328                                               01769000
CVT062R1 EQU   CVTS01+324                                               01770000
CVTRPOST EQU   CVTS01+320                                               01771000
CVTDQIQE EQU   CVTS01+316                                               01772000
CVTCSD   EQU   CVTS01+312                                               01773000
CVTLKRMA EQU   CVTS01+308                                               01774000
CVTRSPIE EQU   CVTS01+304                                               01775000
CVTRENQ  EQU   CVTS01+300                                               01776000
CVTLQCB  EQU   CVTS01+296                                               01777000
CVTFQCB  EQU   CVTS01+292                                               01778000
CVTQCS01 EQU   CVTS01+288                                               01779000
CVTAPFT  EQU   CVTS01+284                                               01780000
CVTPARRL EQU   CVTS01+280                                               01781000
CVTVWAIT EQU   CVTS01+276                                               01782000
CVTGSPL  EQU   CVTS01+272                                               01783000
CVTLSMQ  EQU   CVTS01+268                                               01784000
CVTGSMQ  EQU   CVTS01+264                                               01785000
CVTEXPRO EQU   CVTS01+260                                               01786000
CVTOPCTP EQU   CVTS01+256                                               01787000
CVTSIC   EQU   CVTS01+252                                               01788000
CVTTPIOS EQU   CVTS01+248                                               01789000
CVTRTMS  EQU   CVTS01+244                                               01790000
CVTSDBF  EQU   CVTS01+240                                               01791000
CVTSCBP  EQU   CVTS01+236                                               01792000
CVTSDMP  EQU   CVTS01+232                                               01793000
CVTSV60  EQU   CVTS01+228                                               01794000
CVTRTMCT EQU   CVTS01+224                                               01795000
CVTASCBL EQU   CVTS01+220                                               01796000
CVTASCBH EQU   CVTS01+216                                               01797000
CVTGDA   EQU   CVTS01+212                                               01798000
CVTASVT  EQU   CVTS01+208                                               01799000
CVTVVMDI EQU   CVTS01+204                                               01800000
CVTAQTOP EQU   CVTS01+200                                               01801000
CVTIOSCS EQU   CVTS01+196                                               01802000
CVTSDRM  EQU   CVTS01+192                                               01803000
CVTOPTE  EQU   CVTS01+188                                               01804000
CVTSTXU  EQU   CVTS01+184                                               01805000
CVTQUIS  EQU   CVTS01+180                                               01806000
CVTPARS  EQU   CVTS01+176                                               01807000
CVTS1EE  EQU   CVTS01+172                                               01808000
CVTFRAS  EQU   CVTS01+168                                               01809000
CVTQSAS  EQU   CVTS01+164                                               01810000
CVTCRAS  EQU   CVTS01+160                                               01811000
CVTCRMN  EQU   CVTS01+156                                               01812000
CVTDELCP EQU   CVTS01+152                                               01813000
CVTFRECL EQU   CVTS01+148                                               01814000
CVTGETCL EQU   CVTS01+144                                               01815000
CVTBLDCP EQU   CVTS01+140                                               01816000
CVTAUTHL EQU   CVTS01+136                                               01817000
CVTSCAN  EQU   CVTS01+132                                               01818000
CVTRV144 EQU   CVTS01+130                                               01819000
CVTMAXMP EQU   CVTS01+128                                               01820000
CVTSTCK  EQU   CVTS01+124                                               01821000
CVTRV139 EQU   CVTS01+123                                               01822000
CVTDSSAC EQU   CVTS01+122                                               01823000
CVTRV513 EQU   CVTS01+121                                               01824000
CVTIOSPL EQU   CVTS01+120                                               01825000
CVTPTGT  EQU   CVTS01+116                                               01826000
CVTCSPIE EQU   CVTS01+112                                               01827000
CVTSMFEX EQU   CVTS01+108                                               01828000
CVTOLT0A EQU   CVTS01+104                                               01829000
CVTSRBRT EQU   CVTS01+100                                               01830000
CVTPUTL  EQU   CVTS01+96                                                01831000
CVTASCRL EQU   CVTS01+92                                                01832000
CVTASCRF EQU   CVTS01+88                                                01833000
CVTRV326 EQU   CVTS01+84                                                01834000
CVTRV325 EQU   CVTS01+80                                                01835000
CVTRV324 EQU   CVTS01+76                                                01836000
CVT0VL01 EQU   CVTS01+72                                                01837000
CVTSHRVM EQU   CVTS01+68                                                01838000
CVTRV332 EQU   CVTS01+64                                                01839000
CVTTAS   EQU   CVTS01+60                                                01840000
CVTRSCN  EQU   CVTS01+56                                                01841000
CVTTRAC2 EQU   CVTS01+54                                                01842000
CVTTRACE EQU   CVTS01+52                                                01843000
CVTAPG   EQU   CVTS01+51                                                01844000
CVTSDTRC EQU   CVTCTLFG                                                 01845000
CVTGTRCE EQU   CVTCTLFG                                                 01846000
CVTNOMP  EQU   CVTCTLFG                                                 01847000
CVTRSV79 EQU   CVTCTLFG                                                 01848000
CVTDSTAT EQU   CVTCTLFG                                                 01849000
CVTRSV78 EQU   CVTCTLFG                                                 01850000
CVTRV333 EQU   CVTCTLFG                                                 01851000
CVTRV323 EQU   CVTCTLFG                                                 01852000
CVTSPVLK EQU   CVTS01+49                                                01853000
CVTRSV77 EQU   CVTS01+48                                                01854000
CVTRV331 EQU   CVTS01+44                                                01855000
CVTRV330 EQU   CVTS01+40                                                01856000
CVTRV329 EQU   CVTS01+36                                                01857000
CVTRV328 EQU   CVTS01+32                                                01858000
CVTRV322 EQU   CVTS01+28                                                01859000
CVTSLID  EQU   CVTSLIDA+1                                               01860000
CVTSYLK  EQU   CVTSLIDA                                                 01861000
CVTRV321 EQU   CVTS01+20                                                01862000
CVTRV320 EQU   CVTS01+16                                                01863000
CVTLPDIR EQU   CVTLPDIA+1                                               01864000
CVTRSV69 EQU   CVTDIRST                                                 01865000
CVTRSV68 EQU   CVTDIRST                                                 01866000
CVTRSV67 EQU   CVTDIRST                                                 01867000
CVTRSV66 EQU   CVTDIRST                                                 01868000
CVTRSV65 EQU   CVTDIRST                                                 01869000
CVTRSV64 EQU   CVTDIRST                                                 01870000
CVTRSV63 EQU   CVTDIRST                                                 01871000
CVTDICOM EQU   CVTDIRST                                                 01872000
CVTPVTP  EQU   CVTS01+8                                                 01873000
CVTLPDSR EQU   CVTS01+4                                                 01874000
CVTGETL  EQU   CVTS01                                                   01875000
IOSPCIWA EQU   IOSPCISC+44                                              01876000
IOSPCIRS EQU   IOSPCISC+8                                               01877000
@NM00007 EQU   IOSPCISC+4                                               01878000
@NM00006 EQU   IOSPCISC                                                 01879000
IOSWRNDR EQU   IOSWTOWA+4                                               01880000
IOSWTOPT EQU   IOSWTOWA+3                                               01881000
IOSWTOCP EQU   IOSWTOWA+2                                               01882000
IOSWTOCH EQU   IOSWTOWA                                                 01883000
IOSATTWA EQU   IOSATTSC+40                                              01884000
@NM00005 EQU   IOSATTSC+24                                              01885000
IOSATTSN EQU   IOSATTSC                                                 01886000
WKECHNGP EQU   WKECHAIN+1                                               01887000
@NM00072 EQU   WKEFLAGS                                                 01888000
WKEGATE  EQU   WKEFLAGS                                                 01889000
@NM00071 EQU   ISTWKE                                                   01890000
LSCTLBAD EQU   ISTLSCB+28                                               01891000
LSCFDB2  EQU   LSCFDBA+1                                                01892000
LSCFDB1  EQU   LSCFDBA                                                  01893000
LSCLCCW1 EQU   ISTLSCB+12                                               01894000
LSCRRCNT EQU   LSCSEQ+1                                                 01895000
LSCRRCCT EQU   LSCSEQ                                                   01896000
LSCATOP  EQU   LSCFLGS                                                  01897000
LSCFREE  EQU   LSCFLGS                                                  01898000
LSCDSTAT EQU   LSCFLGS                                                  01899000
LSCZRIMM EQU   LSCFLGS                                                  01900000
LSCRSV01 EQU   LSCFLGS                                                  01901000
LSCSMODE EQU   LSCFLGS                                                  01902000
LSCZMIRC EQU   LSCRUCNT                                                 01903000
LSCCHAI2 EQU   LSCCHAIN+1                                               01904000
LSCCHNG  EQU   LSCCHAI1                                                 01905000
LSCZRTSC EQU   LSCZMNRC                                                 01906000
LSCZRT0A EQU   LSCZMNRC                                                 01907000
LSCZRTL9 EQU   LSCZRT09                                                 01908000
LSCZRTL8 EQU   LSCZRT08                                                 01909000
LSCZRTL7 EQU   LSCZRT07                                                 01910000
LSCZRTL6 EQU   LSCZRT06                                                 01911000
LSCZRTL5 EQU   LSCZRT05                                                 01912000
LSCZRTL4 EQU   LSCZRT04                                                 01913000
LSCZRTL3 EQU   LSCZRT03                                                 01914000
LSCZRTL2 EQU   LSCZRT02                                                 01915000
LSCZRT01 EQU   LSCREQTG                                                 01916000
LSCZRT00 EQU   LSCREQTG                                                 01917000
LSCLNGTH EQU   LSC1WORD+1                                               01918000
ZLBLNG1  EQU   ZLBFSM                                                   01919000
ZLBCHAIN EQU   ISTZLBUF                                                 01920000
FSBFDB   EQU   ISTFSB+32                                                01921000
FSBRSV01 EQU   FSBFSB+30                                                01922000
FSBTHCNT EQU   FSBFSB+28                                                01923000
FSBRLRSV EQU   FSBRLSTS                                                 01924000
FSBCFTX  EQU   FSBRLSTS                                                 01925000
FSBICNCB EQU   FSBMSGID                                                 01926000
FSBSSOC  EQU   FSBSS2                                                   01927000
FSBSSCC  EQU   FSBSS2                                                   01928000
FSBSSDC  EQU   FSBSS2                                                   01929000
FSBSSEC  EQU   FSBSS2                                                   01930000
FSBSSIR  EQU   FSBSS2                                                   01931000
FSBSSCR  EQU   FSBSS2                                                   01932000
@NM00068 EQU   FSBSS2                                                   01933000
@NM00067 EQU   FSBSS1                                                   01934000
FSBSSDE  EQU   FSBSS1                                                   01935000
FSBSSUS  EQU   FSBSS1                                                   01936000
@NM00066 EQU   FSBSS1                                                   01937000
FSBSOHI  EQU   FSBERC                                                   01938000
FSBLGI   EQU   FSBERC                                                   01939000
FSBLMRI  EQU   FSBFBMI                                                  01940000
FSBETI   EQU   FSBERC                                                   01941000
FSBEMI   EQU   FSBERC                                                   01942000
FSBEBI   EQU   FSBERC                                                   01943000
FSBXLCI  EQU   FSBXCODE                                                 01944000
FSBXFINS EQU   FSBXCODE                                                 01945000
FSBXNORM EQU   FSBXFSTS                                                 01946000
FSBSCODE EQU   FSBSYSRS                                                 01947000
FSBSPHSE EQU   FSBSYSRS                                                 01948000
FSBSERR  EQU   FSBSYSRS                                                 01949000
FSBCMD   EQU   FSBSEQ                                                   01950000
FSBDTRCE EQU   FSBFLAGS                                                 01951000
FSBASBTU EQU   FSBFLAGS                                                 01952000
FSBINPET EQU   FSBFLAGS                                                 01953000
FSBNONCB EQU   FSBFLAGS                                                 01954000
FSBLBIND EQU   FSBFLAGS                                                 01955000
FSBFFIND EQU   FSBFLAGS                                                 01956000
FSBACIND EQU   FSBFLAGS                                                 01957000
FSBRFIND EQU   FSBFLAGS                                                 01958000
FSBDAF   EQU   FSBCID+2                                                 01959000
FSBSAF   EQU   FSBCID                                                   01960000
FSBGATE  EQU   FSBFSBA                                                  01961000
FSBLATOP EQU   FSBSFLGS                                                 01962000
FSBRSV02 EQU   FSBSFLGS                                                 01963000
FSBPGBUF EQU   FSBSFLGS                                                 01964000
FSBMNSDA EQU   FSBMNRCD                                                 01965000
FSBMNOA  EQU   FSBMNRCD                                                 01966000
FSBMNDIF EQU   FSBMNRCD                                                 01967000
FSBMNEOP EQU   FSBMNRCD                                                 01968000
FSBMNDNU EQU   FSBMNRCD                                                 01969000
FSBMNATN EQU   FSBMNRCD                                                 01970000
FSBMNRVI EQU   FSBMNRCD                                                 01971000
FSBMNELI EQU   FSBMNRCD                                                 01972000
FMCFLRSV EQU   FMCFLGB                                                  01973000
FMCFLGA8 EQU   FMCFLGB                                                  01974000
FMCCLRPH EQU   FMCVS1+45                                                01975000
FMCRSV0X EQU   FMCCVFLG                                                 01976000
FMCFRRPH EQU   FMCCVFLG                                                 01977000
FMCOWRPH EQU   FMCCVFLG                                                 01978000
FMCCDRPH EQU   FMCCVFLG                                                 01979000
FMCPSRPH EQU   FMCCVFLG                                                 01980000
FMCVYRPH EQU   FMCCVFLG                                                 01981000
FMCZV004 EQU   FMCVS1+40                                                01982000
FMCLOCK2 EQU   FMCVS1+36                                                01983000
@NM00065 EQU   FMCZFLG2                                                 01984000
FMCZF027 EQU   FMCZFLG2                                                 01985000
FMCZF026 EQU   FMCZFLG2                                                 01986000
FMCSEQ1B EQU   FMCSEQ1                                                  01987000
FMCSEQ1T EQU   FMCSEQ1                                                  01988000
FMCZX006 EQU   FMCVS1+33                                                01989000
FMCZX005 EQU   FMCVS1+32                                                01990000
FMCZX004 EQU   FMCVS1+31                                                01991000
FMCZX003 EQU   FMCVS1+30                                                01992000
FMCZX002 EQU   FMCVS1+29                                                01993000
FMCZV001 EQU   FMCVS1+24                                                01994000
FMCAWATQ EQU   FMCLCPAQ+1                                               01995000
@NM00064 EQU   FMCLCPAQ                                                 01996000
FMCLCPB1 EQU   FMCLCPBQ                                                 01997000
FMCASCDQ EQU   FMCSHEAQ+1                                               01998000
@NM00063 EQU   FMCSHEAQ                                                 01999000
FMCSHEDQ EQU   FMCVS1+8                                                 02000000
FMCZFCSQ EQU   FMCVS1+6                                                 02001000
FMCZH001 EQU   FMCVS1+4                                                 02002000
FMCZF025 EQU   FMCZFLAG+3                                               02003000
FMCZF024 EQU   FMCZFLAG+3                                               02004000
FMCZF023 EQU   FMCZFLAG+3                                               02005000
FMCZF022 EQU   FMCZFLAG+3                                               02006000
FMCZF021 EQU   FMCZFLAG+3                                               02007000
FMCZF020 EQU   FMCZFLAG+3                                               02008000
FMCZF019 EQU   FMCZFLAG+3                                               02009000
FMCZF018 EQU   FMCZFLAG+3                                               02010000
FMCZF017 EQU   FMCZFLAG+2                                               02011000
FMCZF016 EQU   FMCZFLAG+2                                               02012000
FMCZF015 EQU   FMCZFLAG+2                                               02013000
FMCZF014 EQU   FMCZFLAG+2                                               02014000
FMCZF013 EQU   FMCZFLAG+2                                               02015000
FMCZF012 EQU   FMCZFLAG+2                                               02016000
FMCZF011 EQU   FMCZFLAG+2                                               02017000
FMCZF010 EQU   FMCZFLAG+2                                               02018000
FMCZF00F EQU   FMCZFLAG+1                                               02019000
FMCZF00E EQU   FMCZFLAG+1                                               02020000
FMCZF00D EQU   FMCZFLAG+1                                               02021000
FMCZF00C EQU   FMCZFLAG+1                                               02022000
FMCZF00B EQU   FMCZFLAG+1                                               02023000
FMCRSV10 EQU   FMCZFLAG+1                                               02024000
FMCZF009 EQU   FMCZFLAG+1                                               02025000
FMCZFC06 EQU   FMCZF006                                                 02026000
FMCZFB06 EQU   FMCZF006                                                 02027000
FMCZF005 EQU   FMCZFLAG                                                 02028000
FMCZF004 EQU   FMCZFLAG                                                 02029000
FMCZF003 EQU   FMCZFLAG                                                 02030000
FMCZF001 EQU   FMCZFLAG                                                 02031000
FMCFRESA EQU   ISTFMCB+228                                              02032000
FMCSCSQN EQU   FMCSNCTL+2                                               02033000
FMCSCCTL EQU   FMCSNCTL+1                                               02034000
FMCSTCTL EQU   FMCSCFLG                                                 02035000
FMCSCCLO EQU   FMCSCFLG                                                 02036000
FMCAPRO  EQU   FMCSCFLG                                                 02037000
FMCLURO  EQU   FMCSCFLG                                                 02038000
FMCOBSAC EQU   FMCSCFLG                                                 02039000
FMCIBSAC EQU   FMCSCFLG                                                 02040000
FMCFBRE  EQU   ISTFMCB+220                                              02041000
FMCFBXM  EQU   FMCZV002                                                 02042000
FMCASEGQ EQU   ISTFMCB+212                                              02043000
FMCRDTPT EQU   ISTFMCB+208                                              02044000
FMCLOCK  EQU   ISTFMCB+204                                              02045000
FMCSEGD  EQU   FMCSSEGQ                                                 02046000
FMCRSPLM EQU   ISTFMCB+198                                              02047000
FMCPSTRS EQU   ISTFMCB+196                                              02048000
@NM00062 EQU   FMCRRESP                                                 02049000
FMCTSLHA EQU   FMCRRESP                                                 02050000
FMCFRRN  EQU   FMCRRESP                                                 02051000
FMCFME   EQU   FMCRRESP                                                 02052000
FMCFEX   EQU   FMCRRESP                                                 02053000
FMCFPE   EQU   FMCRRESP                                                 02054000
FMCCTLB  EQU   ISTFMCB+194                                              02055000
FMCBSQNO EQU   FMCCLSEQ+2                                               02056000
FMCTSQNO EQU   FMCCLSEQ                                                 02057000
FMCOBPRG EQU   FMCMODEB                                                 02058000
FMCIBPRG EQU   FMCMODEB                                                 02059000
FMCRESOT EQU   FMCMODEB                                                 02060000
FMCRSTSR EQU   FMCMODEB                                                 02061000
FMCLUQ   EQU   FMCMODEB                                                 02062000
FMCAPQ   EQU   FMCMODEB                                                 02063000
FMCHOLD  EQU   FMCMODEB                                                 02064000
FMCIPSEQ EQU   ISTFMCB+188                                              02065000
FMCLUSTR EQU   ISTFMCB+187                                              02066000
FMCCDPIP EQU   FMCSTAT2                                                 02067000
FMCPSPIP EQU   FMCSTAT2                                                 02068000
FMCSEQI  EQU   FMCSTAT2                                                 02069000
FMCCPIP  EQU   FMCSTAT2                                                 02070000
FMCALIPR EQU   FMCSTAT2                                                 02071000
FMCIAIO  EQU   FMCSTAT2                                                 02072000
FMCZF00A EQU   FMCSTAT2                                                 02073000
FMCVPIP  EQU   FMCSTAT2                                                 02074000
FMCBHSET EQU   ISTFMCB+185                                              02075000
FMCPRMRC EQU   FMCCLEXT+20                                              02076000
FMCRSV89 EQU   FMCPSTAT                                                 02077000
FMCPCLSD EQU   FMCPSTAT                                                 02078000
FMCDDOCD EQU   FMCPSTAT                                                 02079000
FMCIDVFD EQU   FMCPSTAT                                                 02080000
FMCELKST EQU   FMCPSTAT                                                 02081000
FMCRSV88 EQU   FMCPSCMD                                                 02082000
FMCRDBLK EQU   FMCPSCMD                                                 02083000
FMCDSEOC EQU   FMCPSCMD                                                 02084000
FMCPURGE EQU   FMCPSCMD                                                 02085000
FMCRESTI EQU   FMCPSCMD                                                 02086000
FMCCNTCT EQU   FMCPSCMD                                                 02087000
FMCINVT  EQU   FMCPSCMD                                                 02088000
FMCFLGB7 EQU   FMCFLGCL                                                 02089000
FMCFLGB6 EQU   FMCFLGCL                                                 02090000
FMCFLGB5 EQU   FMCFLGCL                                                 02091000
FMCFLGB4 EQU   FMCFLGCL                                                 02092000
FMCFLGB3 EQU   FMCFLGCL                                                 02093000
FMCFLGB2 EQU   FMCFLGCL                                                 02094000
FMCFLGB1 EQU   FMCFLGCL                                                 02095000
FMCFLGB0 EQU   FMCFLGCL                                                 02096000
FMCFLGA7 EQU   FMCFLGA                                                  02097000
FMCFLGA6 EQU   FMCFLGA                                                  02098000
FMCFLGA5 EQU   FMCFLGA                                                  02099000
FMCFLGA4 EQU   FMCFLGA                                                  02100000
FMCFLGA3 EQU   FMCFLGA                                                  02101000
FMCFLGA2 EQU   FMCFLGA                                                  02102000
FMCFLGA1 EQU   FMCFLGA                                                  02103000
FMCFLGA0 EQU   FMCFLGA                                                  02104000
FMCDCLOK EQU   FMCCLEXT+12                                              02105000
FMCRAFM  EQU   FMCCLEXT+8                                               02106000
FMCFBPTR EQU   FMCFBA+1                                                 02107000
FMCFBRSV EQU   FMCFBA                                                   02108000
FMCRPLPT EQU   FMCRPLA+1                                                02109000
FMCRPLRS EQU   FMCRPLA                                                  02110000
FMCPRCLS EQU   FMCCVAL                                                  02111000
FMCIBCE  EQU   FMCCVAL                                                  02112000
FMCONLY  EQU   FMCOBCE                                                  02113000
FMCLAST  EQU   FMCOBCE                                                  02114000
FMCMIDLE EQU   FMCOBCE                                                  02115000
FMCFIRST EQU   FMCOBCE                                                  02116000
FMCCPCNT EQU   FMCPACPC                                                 02117000
FMCMPCNT EQU   FMCPACEM                                                 02118000
FMCNPCNT EQU   FMCPACEN                                                 02119000
FMCCONF  EQU   FMCSSTAT                                                 02120000
FMCPURCH EQU   FMCSSTAT                                                 02121000
FMCNSALU EQU   FMCSSTAT                                                 02122000
FMCBIP   EQU   FMCSSTAT                                                 02123000
FMCSDTR  EQU   FMCSSTAT                                                 02124000
FMCUIPI  EQU   FMCSSTAT                                                 02125000
FMCCIPI  EQU   FMCSSTAT                                                 02126000
FMCSNBI  EQU   FMCSSTAT                                                 02127000
FMCRVD01 EQU   ISTFMCB+158                                              02128000
FMCISSN  EQU   ISTFMCB+156                                              02129000
FMCOASN  EQU   FMCNXOSC                                                 02130000
FMCOSSN  EQU   FMCNXCFM                                                 02131000
FMCSIP   EQU   FMCSIPA                                                  02132000
FMCEXLST EQU   ISTFMCB+144                                              02133000
FMCPAB5  EQU   ISTFMCB+128                                              02134000
FMCPAB3  EQU   ISTFMCB+96                                               02135000
FMCPAB1  EQU   ISTFMCB+64                                               02136000
FMCFASYA EQU   ISTFMCB+60                                               02137000
FMCPROCD EQU   ISTFMCB+48                                               02138000
FMCVWT   EQU   ISTFMCB+44                                               02139000
FMCRPLH  EQU   ISTFMCB+40                                               02140000
FMCBUFNB EQU   FMCCMPS1+2                                               02141000
FMCBUFLM EQU   FMCCMPS1                                                 02142000
FMCDEBA  EQU   ISTFMCB+32                                               02143000
@NM00061 EQU   FMCCMDFL                                                 02144000
FMCSNA   EQU   FMCCMDFL                                                 02145000
FMCVSNA  EQU   FMCCMDFL                                                 02146000
FMCCMDR  EQU   FMCCMDFL                                                 02147000
@NM00060 EQU   ISTFMCB+30                                               02148000
@NM00059 EQU   FMCSTAT1                                                 02149000
FMCLTCLS EQU   FMCSTAT1                                                 02150000
FMCHPURG EQU   FMCSTAT1                                                 02151000
FMCVSP2  EQU   FMCSTAT1                                                 02152000
FMCVSP1  EQU   FMCSTAT                                                  02153000
FMCLTEAS EQU   FMCSTAT                                                  02154000
FMCZF007 EQU   FMCSTAT                                                  02155000
FMCDEDSC EQU   FMCSTAT                                                  02156000
FMCDEVOF EQU   FMCSTAT                                                  02157000
FMCDAPT  EQU   FMCSTAT                                                  02158000
FMCPRMTE EQU   FMCSTAT                                                  02159000
FMCPRMTR EQU   FMCSTAT                                                  02160000
FMCUSFLD EQU   ISTFMCB+24                                               02161000
FMCFMCBA EQU   ISTFMCB+20                                               02162000
FMCDNCBA EQU   ISTFMCB+16                                               02163000
FMCDVTA  EQU   ISTFMCB+12                                               02164000
FMCTSKID EQU   ISTFMCB+8                                                02165000
FMCNXTCB EQU   ISTFMCB+4                                                02166000
FMCSAF   EQU   ISTFMCB+2                                                02167000
FMCLNGTH EQU   ISTFMCB+1                                                02168000
FMCTYPE  EQU   ISTFMCB                                                  02169000
PROSRDEF EQU   PROSETM4                                                 02170000
PRORSV47 EQU   PROSETM4                                                 02171000
PROSCON  EQU   PROSETM4                                                 02172000
PRORSV46 EQU   PROSETM3                                                 02173000
PROSMONT EQU   PROSETM3                                                 02174000
PRORSV45 EQU   PROSETM3                                                 02175000
PROSNTO  EQU   PROSETM3                                                 02176000
PRORSV44 EQU   PROSETM3                                                 02177000
PROCPUID EQU   PROSETM3                                                 02178000
PRORSV43 EQU   PROSETM2                                                 02179000
PROSNTFL EQU   PROSETM2                                                 02180000
PRORSV42 EQU   PROSETM2                                                 02181000
PRORSV41 EQU   PROPROCS                                                 02182000
PROMODC  EQU   PROPROC4                                                 02183000
PROMODT  EQU   PROPROC4                                                 02184000
PROMODM  EQU   PROPROC4                                                 02185000
PROMODB  EQU   PROPROC4                                                 02186000
PRORSV14 EQU   PROPROC4                                                 02187000
PRORSV13 EQU   PROPROC4                                                 02188000
PRORSV12 EQU   PROPROC4                                                 02189000
PROEIB   EQU   PROPROC4                                                 02190000
PROMONT3 EQU   PROPROC3                                                 02191000
PROMONT2 EQU   PROPROC3                                                 02192000
PROMONIT EQU   PROPROC3                                                 02193000
PROSUBLK EQU   PROPROC3                                                 02194000
PRONTO   EQU   PROPROC3                                                 02195000
PROLGIN  EQU   PROPROC3                                                 02196000
PROERPI  EQU   PROPROC3                                                 02197000
PRORSV07 EQU   PROPROC3                                                 02198000
PROCFTX  EQU   PROPROC2                                                 02199000
PROEMLC  EQU   PROPROC2                                                 02200000
PRONTFL  EQU   PROPROC2                                                 02201000
PRORSV05 EQU   PROPROC2                                                 02202000
PRORSV04 EQU   PROPROC2                                                 02203000
PROLGOT  EQU   PROPROC2                                                 02204000
PROERPO  EQU   PROPROC2                                                 02205000
PRORSV03 EQU   PROPROC2                                                 02206000
PRORPLC  EQU   PROPROC1                                                 02207000
PROCS    EQU   PROPROC1                                                 02208000
PROCA    EQU   PROPROC1                                                 02209000
PRORESPX EQU   PROPROC1                                                 02210000
PRODFASY EQU   PROPROC1                                                 02211000
PROXPOPT EQU   PROPROC1                                                 02212000
PROTRUNC EQU   PROPROC1                                                 02213000
PROASYIP EQU   PROPROC1                                                 02214000
DNCZC001 EQU   DNCOS+40                                                 02215000
DNCLOCK  EQU   DNCOS+36                                                 02216000
DNCZV005 EQU   DNCOS+32                                                 02217000
DNCZV004 EQU   DNCOS+28                                                 02218000
DNCZV003 EQU   DNCOS+24                                                 02219000
DNCZV002 EQU   DNCOS+21                                                 02220000
DNCZX001 EQU   DNCOS+20                                                 02221000
DNCZV001 EQU   DNCOS+17                                                 02222000
DNCZX003 EQU   DNCOS+16                                                 02223000
DNCZV000 EQU   DNCOS+12                                                 02224000
DNCSESCQ EQU   DNCOS+8                                                  02225000
DNCSESIQ EQU   DNCOS+4                                                  02226000
DNCACIP  EQU   DNCBSCED+1                                               02227000
DNCLICP  EQU   DNCBSCED                                                 02228000
DNCZF008 EQU   DNCZFLGS+1                                               02229000
DNCZPSRD EQU   DNCZFLGS+1                                               02230000
DNCPSOL  EQU   DNCZFLGS+1                                               02231000
DNCZF007 EQU   DNCZFLGS+1                                               02232000
DNCZF006 EQU   DNCZFLGS+1                                               02233000
DNCZF005 EQU   DNCZFLGS+1                                               02234000
DNCZF004 EQU   DNCZFLGS+1                                               02235000
DNCZF003 EQU   DNCZFLGS                                                 02236000
DNCZF002 EQU   DNCZFLGS                                                 02237000
DNCZRSCH EQU   DNCZFLGS                                                 02238000
DNCDISC  EQU   DNCZFLGS                                                 02239000
DNCCONT  EQU   DNCZFLGS                                                 02240000
DNCINVIT EQU   DNCZFLGS                                                 02241000
DNCSESS  EQU   DNCZFLGS                                                 02242000
DNCZF001 EQU   DNCZFLGS                                                 02243000
DNCMODE  EQU   ISTDNCB+49                                               02244000
DNCBHSET EQU   ISTDNCB+48                                               02245000
DNCNCB   EQU   ISTDNCB                                                  02246000
LDNZS00F EQU   LDNZH003+1                                               02247000
LDNZS00E EQU   LDNZH003+1                                               02248000
LDNZS00D EQU   LDNZH003+1                                               02249000
LDNZS00C EQU   LDNZH003+1                                               02250000
LDNZS00B EQU   LDNZH003+1                                               02251000
LDNZS007 EQU   LDNZH003                                                 02252000
LDNZS006 EQU   LDNZH003                                                 02253000
LDNZS005 EQU   LDNZH003                                                 02254000
LDNZS004 EQU   LDNZH003                                                 02255000
LDNZS003 EQU   LDNZH003                                                 02256000
LDNZS002 EQU   LDNZH003                                                 02257000
LDNZS001 EQU   LDNZH003                                                 02258000
LDNZS000 EQU   LDNZH003                                                 02259000
LDNZX006 EQU   ISTLDNCB+576                                             02260000
LDNZC001 EQU   ISTLDNCB+569                                             02261000
LDNZX005 EQU   ISTLDNCB+568                                             02262000
LDNZV006 EQU   ISTLDNCB+564                                             02263000
LDNSRB   EQU   ISTLDNCB+520                                             02264000
LDNIOSB  EQU   ISTLDNCB+412                                             02265000
@NM00058 EQU   LDNZSAV3+28                                              02266000
LDNRSV06 EQU   LDNZSAV4+16                                              02267000
LDNZSAV6 EQU   LDNZSAV4+12                                              02268000
LDNZSAV5 EQU   LDNZSAV4                                                 02269000
LDNZSAVE EQU   LDNZSAV3                                                 02270000
LDNZSAV2 EQU   ISTLDNCB+368                                             02271000
LDNZSAV1 EQU   ISTLDNCB+352                                             02272000
LDNZ3RR  EQU   ISTLDNCB+348                                             02273000
LDNZ2RR  EQU   ISTLDNCB+344                                             02274000
LDNZ1RR  EQU   ISTLDNCB+340                                             02275000
LDNRSV0B EQU   ISTLDNCB+336                                             02276000
LDNRSV0A EQU   ISTLDNCB+332                                             02277000
LDNRSV09 EQU   ISTLDNCB+328                                             02278000
LDNRSV08 EQU   ISTLDNCB+324                                             02279000
LDNRSV07 EQU   ISTLDNCB+320                                             02280000
LDNDEAD  EQU   LDNDCDEB+12                                              02281000
LDNUCBAD EQU   LDNDCDEB+8                                               02282000
LDNAPPAD EQU   LDNDCDEB+5                                               02283000
LDNEXSCL EQU   LDNDCDEB+4                                               02284000
LDNDCBAD EQU   LDNDCDEB+1                                               02285000
LDNDEBID EQU   LDNDCDEB                                                 02286000
LDNZRIND EQU   ISTLDNCB+300                                             02287000
LDNRPH   EQU   ISTLDNCB+192                                             02288000
LDNZTCP  EQU   ISTLDNCB+188                                             02289000
LDNZCHNC EQU   ISTLDNCB+187                                             02290000
LDNZLPC7 EQU   LDNZLPC                                                  02291000
LDNZLPC6 EQU   LDNZLPC                                                  02292000
LDNZLPC5 EQU   LDNZLPC                                                  02293000
LDNZLPC4 EQU   LDNZLPC                                                  02294000
LDNZLPC3 EQU   LDNZLPC                                                  02295000
LDNZLPC2 EQU   LDNZLPC                                                  02296000
LDNZLPC1 EQU   LDNZLPC                                                  02297000
LDNZLPC0 EQU   LDNZLPC                                                  02298000
LDNRSV05 EQU   LDNZERPF                                                 02299000
LDNZCTOV EQU   LDNZEPIN                                                 02300000
LDNZF001 EQU   LDNZEPIN                                                 02301000
LDNZFRDW EQU   LDNZCPAN                                                 02302000
LDNZFRD  EQU   LDNZCPAN                                                 02303000
LDNZNARD EQU   LDNZCPAN                                                 02304000
LDNRSV04 EQU   LDNZIOLK                                                 02305000
LDNZATBF EQU   LDNZIOLK                                                 02306000
LDNZERLK EQU   LDNZIOLK                                                 02307000
LDNZDSIC EQU   LDNZIOLK                                                 02308000
LDNZPAB1 EQU   ISTLDNCB+168                                             02309000
LDNZV005 EQU   ISTLDNCB+160                                             02310000
LDNZS1VR EQU   ISTLDNCB+136                                             02311000
LDNZS1RR EQU   ISTLDNCB+132                                             02312000
LDNZS1FC EQU   ISTLDNCB+128                                             02313000
LDNZS1BC EQU   ISTLDNCB+124                                             02314000
LDNZLOCK EQU   ISTLDNCB+120                                             02315000
LDNZFBUF EQU   ISTLDNCB+116                                             02316000
LDNZLAST EQU   ISTLDNCB+112                                             02317000
LDNRSV02 EQU   LDNFLAG2                                                 02318000
LDNZFF04 EQU   LDNFLAG2                                                 02319000
LDNZFF69 EQU   LDNFLAGS+2                                               02320000
LDNTPBIO EQU   LDNFLAGS+2                                               02321000
LDNZFF03 EQU   LDNFLAGS+2                                               02322000
LDNZFF02 EQU   LDNFLAGS+2                                               02323000
LDNZFF01 EQU   LDNFLAGS+2                                               02324000
LDNZFF00 EQU   LDNFLAGS+2                                               02325000
LDNCLOSD EQU   LDNFLAGS+2                                               02326000
LDNZENTR EQU   LDNFLAGS+2                                               02327000
LDNZICCW EQU   LDNFLAGS+1                                               02328000
LDNZREC  EQU   LDNFLAGS+1                                               02329000
LDNZCTXT EQU   LDNFLAGS+1                                               02330000
LDNZATLK EQU   LDNFLAGS+1                                               02331000
LDNZCHNE EQU   LDNFLAGS+1                                               02332000
LDNZATTP EQU   LDNFLAGS+1                                               02333000
LDNZIOBY EQU   LDNFLAGS+1                                               02334000
LDNZF00A EQU   LDNFLAGS+1                                               02335000
LDNZF009 EQU   LDNFLAGS                                                 02336000
LDNZF008 EQU   LDNFLAGS                                                 02337000
LDNZF006 EQU   LDNFLAGS                                                 02338000
LDNZF005 EQU   LDNFLAGS                                                 02339000
LDNZF004 EQU   LDNFLAGS                                                 02340000
LDNZF003 EQU   LDNFLAGS                                                 02341000
LDNZF002 EQU   LDNFLAGS                                                 02342000
LDNZHDCC EQU   ISTLDNCB+106                                             02343000
LDNZARM  EQU   ISTLDNCB+104                                             02344000
LDNZRM   EQU   ISTLDNCB+102                                             02345000
LDNZRB   EQU   ISTLDNCB+100                                             02346000
LDNCPQ   EQU   ISTLDNCB+96                                              02347000
LDNSIOQ  EQU   ISTLDNCB+92                                              02348000
LDNZX002 EQU   ISTLDNCB+91                                              02349000
LDNZX001 EQU   ISTLDNCB+90                                              02350000
LDNZH002 EQU   ISTLDNCB+88                                              02351000
LDNZV001 EQU   ISTLDNCB+84                                              02352000
LDNZACSW EQU   ISTLDNCB+76                                              02353000
LDNZC002 EQU   ISTLDNCB+68                                              02354000
LDNCSWSV EQU   ISTLDNCB+60                                              02355000
LDNCHFLD EQU   ISTLDNCB+56                                              02356000
LDNRESRV EQU   ISTLDNCB+55                                              02357000
@NM00057 EQU   LDNCFLAG                                                 02358000
LDNRMF   EQU   LDNCFLAG                                                 02359000
LDNIBI   EQU   LDNCFLAG                                                 02360000
LDNTSAF  EQU   ISTLDNCB+52                                              02361000
LDNCUUA  EQU   ISTLDNCB+48                                              02362000
LDNCB    EQU   ISTLDNCB                                                 02363000
NCBRSV01 EQU   ISTNCB+46                                                02364000
NCBSWDAF EQU   ISTNCB+44                                                02365000
NCBDEVCH EQU   ISTNCB+36                                                02366000
NCBFMCBP EQU   ISTNCB+32                                                02367000
NCBLTRC  EQU   ISTNCB+30                                                02368000
NCBRVPT1 EQU   ISTNCB+28                                                02369000
NCBNMLLN EQU   NCBFLAGS+3                                               02370000
@NM00056 EQU   NCBFLAG1                                                 02371000
NCBFORCE EQU   NCBFLAG1                                                 02372000
NCBTTF   EQU   NCBFLAG1                                                 02373000
NCBRSYNC EQU   NCBFLAG1                                                 02374000
NCBRSTRT EQU   NCBFLAG1                                                 02375000
NCBCONF  EQU   NCBFLAG1                                                 02376000
NCBSNAI  EQU   NCBFLAG1                                                 02377000
NCBFLTIO EQU   NCBFTRIO                                                 02378000
NCBCSTAT EQU   NCBFLAGS                                                 02379000
NCBNCSL  EQU   ISTNCB+22                                                02380000
NCBNCBA  EQU   ISTNCB+20                                                02381000
NCBFMCBA EQU   ISTNCB+16                                                02382000
NCBNSNA  EQU   ISTNCB+12                                                02383000
NCBTSKID EQU   ISTNCB+8                                                 02384000
NCBRDTE  EQU   ISTNCB+4                                                 02385000
NCBDAF   EQU   ISTNCB+2                                                 02386000
NCBLNGTH EQU   ISTNCB+1                                                 02387000
NCBTYPE  EQU   ISTNCB                                                   02388000
DEVRSV03 EQU   ISTDEVCH+5                                               02389000
DEVPHYSA EQU   ISTDEVCH+4                                               02390000
DEVCSLPN EQU   DEVCHAR3                                                 02391000
DEVCSTCL EQU   DEVCHAR3                                                 02392000
DEVCCHEK EQU   DEVCHAR3                                                 02393000
DEVCATTN EQU   DEVCHAR3                                                 02394000
DEVCSWL  EQU   DEVFCCTL                                                 02395000
DEVCRVB  EQU   DEVFCCTL                                                 02396000
DEVCSSL  EQU   DEVFCCTL                                                 02397000
DEVCBSC  EQU   DEVFCCTL                                                 02398000
DEVMCODE EQU   ISTDEVCH+2                                               02399000
DEVCHAR2 EQU   DEVTCODE                                                 02400000
DEVRSV01 EQU   DEVCHAR                                                  02401000
DEVCCTL  EQU   DEVCHAR                                                  02402000
DEVNNSPT EQU   DEVCHAR                                                  02403000
DEVSPS   EQU   DEVCHAR                                                  02404000
DEVSUBND EQU   DEVCHAR                                                  02405000
DEVCONVR EQU   DEVCHAR                                                  02406000
DEVOTPUT EQU   DEVCHAR                                                  02407000
DEVINPUT EQU   DEVCHAR                                                  02408000
ATCAOS   EQU   ISTATCVT+1584                                            02409000
ATCPOPAB EQU   ATCAOSM+640                                              02410000
ATCVIOPM EQU   ATCAOSM+636                                              02411000
ATCTPMMI EQU   ATCAOSM+632                                              02412000
ATCTPMPB EQU   ATCAOSM+600                                              02413000
ATCRSV88 EQU   ATCAOSM+596                                              02414000
ATCRPLCT EQU   ATCAOSM+594                                              02415000
ATCCRACT EQU   ATCAOSM+592                                              02416000
ATCSRBCT EQU   ATCAOSM+590                                              02417000
ATCRSV75 EQU   ATCAOSM+589                                              02418000
ATCRSV66 EQU   ATCZFLAG                                                 02419000
ATCZF001 EQU   ATCZFLAG                                                 02420000
ATCTPCP1 EQU   ATCAOSM+584                                              02421000
ATCTPCP0 EQU   ATCAOSM+580                                              02422000
ATCAICTN EQU   ATCAOSM+576                                              02423000
ATCZR01  EQU   ATCAOSM+572                                              02424000
ATCMPLTA EQU   ATCAOSM+568                                              02425000
ATCASCB  EQU   ATCAOSM+564                                              02426000
ATCAP86  EQU   ATCAOSM+560                                              02427000
ATCAP85  EQU   ATCAOSM+556                                              02428000
ATCAP84  EQU   ATCAOSM+552                                              02429000
ATCAP83  EQU   ATCAOSM+548                                              02430000
ATCAP82  EQU   ATCAOSM+544                                              02431000
ATCAP69  EQU   ATCAOSM+540                                              02432000
ATCAP66  EQU   ATCAOSM+536                                              02433000
ATCAP62  EQU   ATCAOSM+532                                              02434000
ATCAPC59 EQU   ATCAOSM+528                                              02435000
ATCAP56  EQU   ATCAOSM+524                                              02436000
ATCAP55  EQU   ATCAOSM+520                                              02437000
ATCRCFY0 EQU   ATCAOSM+516                                              02438000
ATCAP41  EQU   ATCAOSM+512                                              02439000
ATCAPC25 EQU   ATCAOSM+508                                              02440000
ATCAP23  EQU   ATCAOSM+504                                              02441000
ATCTPSPB EQU   ATCAOSM+472                                              02442000
ATCTRMPB EQU   ATCAOSM+440                                              02443000
ATCAPBE  EQU   ATCAOSM+436                                              02444000
ATCPSTA  EQU   ATCAOSM+432                                              02445000
ATCSMABF EQU   ATCAOSM+428                                              02446000
ATCSMAPR EQU   ATCAOSM+424                                              02447000
ATCTPWQA EQU   ATCAOSM+420                                              02448000
ATCSMAID EQU   ATCAOSM+416                                              02449000
ATCSMARA EQU   ATCAOSM+412                                              02450000
ATCCACXA EQU   ATCAOSM+408                                              02451000
ATCZLAAB EQU   ATCAOSM+404                                              02452000
ATCATA10 EQU   ATCAOSM+400                                              02453000
ATCHLTCB EQU   ATCAOSM+396                                              02454000
@NM00055 EQU   ATCVTFLG                                                 02455000
ATCVTACT EQU   ATCVTFLG                                                 02456000
ATCRPT40 EQU   ATCAOSM+388                                              02457000
ATCRPT39 EQU   ATCAOSM+384                                              02458000
ATCRPT38 EQU   ATCAOSM+380                                              02459000
ATCRPT37 EQU   ATCAOSM+376                                              02460000
ATCRPT36 EQU   ATCAOSM+372                                              02461000
ATCRPT35 EQU   ATCAOSM+368                                              02462000
ATCRPT34 EQU   ATCAOSM+364                                              02463000
ATCRPT33 EQU   ATCAOSM+360                                              02464000
ATCRPT32 EQU   ATCAOSM+356                                              02465000
ATCRPT31 EQU   ATCAOSM+352                                              02466000
ATCRPT30 EQU   ATCAOSM+348                                              02467000
ATCOCWCB EQU   ATCAOSM+344                                              02468000
ATCOCWOB EQU   ATCAOSM+340                                              02469000
ATCRPT27 EQU   ATCAOSM+336                                              02470000
@NM00054 EQU   ATCAOSM+333                                              02471000
@NM00053 EQU   @NM00052                                                 02472000
ATCSNUF  EQU   @NM00052                                                 02473000
ATCOPKL  EQU   @NM00052                                                 02474000
ATCABEN  EQU   @NM00052                                                 02475000
ATCAIWT  EQU   ATCAOSM+328                                              02476000
ATCINFDD EQU   ATCAOSM+324                                              02477000
ATCORFMG EQU   ATCAOSM+320                                              02478000
ATCORFRL EQU   ATCAOSM+316                                              02479000
ATCOROBT EQU   ATCAOSM+312                                              02480000
ATCORQG  EQU   ATCORSRB                                                 02481000
ATCORTBF EQU   ATCSQAFR                                                 02482000
ATCRPLAC EQU   ATCRPLCN+2                                               02483000
ATCRPLRC EQU   ATCRPLCN                                                 02484000
ATCCRPLQ EQU   ATCCRPL                                                  02485000
ATCSRBAC EQU   ATCSRBCN+2                                               02486000
ATCSRBRC EQU   ATCSRBCN                                                 02487000
ATCSRBQ  EQU   ATCSRB                                                   02488000
ATCCRAAC EQU   ATCCRACN+2                                               02489000
ATCCRARC EQU   ATCCRACN                                                 02490000
ATCCRAQ  EQU   ATCCRA                                                   02491000
ATCRPT12 EQU   ATCAOSM+276                                              02492000
ATCDMAPP EQU   ATCAOSM+272                                              02493000
ATCAP38  EQU   ATCAOSM+268                                              02494000
ATCZDFJ0 EQU   ATCAOSM+260                                              02495000
ATCAP51  EQU   ATCAOSM+256                                              02496000
ATCZPAB2 EQU   ATCAOSM+224                                              02497000
ATCZPAB1 EQU   ATCAOSM+192                                              02498000
ATCZLFVT EQU   ATCAOSM+188                                              02499000
ATCZLPVT EQU   ATCAOSM+184                                              02500000
ATCZDVTX EQU   ATCAOSM+180                                              02501000
ATCZDVTA EQU   ATCAOSM+176                                              02502000
ATCZDVT9 EQU   ATCAOSM+172                                              02503000
ATCZDVT8 EQU   ATCAOSM+168                                              02504000
ATCZDVT7 EQU   ATCAOSM+164                                              02505000
ATCRSV56 EQU   ATCDAPVT+22                                              02506000
ATCDAPDG EQU   ATCDAPVT+20                                              02507000
ATCDXCEA EQU   ATCDAPVT+16                                              02508000
ATCDCEA  EQU   ATCDAPVT+12                                              02509000
ATCDPCIA EQU   ATCDAPVT+8                                               02510000
ATCDSIOA EQU   ATCDAPVT+4                                               02511000
ATCDEOEA EQU   ATCDAPVT                                                 02512000
ATCZLAEA EQU   ATCLDAPP+16                                              02513000
ATCZLCEA EQU   ATCLDAPP+12                                              02514000
ATCRSV17 EQU   ATCLDAPP+8                                               02515000
ATCSMFRR EQU   ATCLDAPP+4                                               02516000
ATCCDTID EQU   ATCLDAPP                                                 02517000
ATCZAEA  EQU   ATCICAPP+16                                              02518000
ATCZCEA  EQU   ATCICAPP+12                                              02519000
ATCCDTCB EQU   ATCICAPP+8                                               02520000
ATCZSIOA EQU   ATCICAPP+4                                               02521000
ATCCDRPH EQU   ATCICAPP                                                 02522000
ATCAP65  EQU   ATCAOSM+96                                               02523000
ATCZDVT6 EQU   ATCAOSM+92                                               02524000
ATCZDVT4 EQU   ATCAOSM+88                                               02525000
ATCZDVT3 EQU   ATCAOSM+84                                               02526000
ATCZDVT1 EQU   ATCAOSM+80                                               02527000
ATCICNCB EQU   ATCAOSM+76                                               02528000
ATCZFSVT EQU   ATCAOSM+68                                               02529000
ATCAP64  EQU   ATCAOSM+64                                               02530000
ATCAP63  EQU   ATCAOSM+60                                               02531000
ATCAP61  EQU   ATCAOSM+56                                               02532000
ATCAP58  EQU   ATCAOSM+52                                               02533000
ATCAP57  EQU   ATCAOSM+48                                               02534000
ATCAP54  EQU   ATCAOSM+44                                               02535000
ATCAP53  EQU   ATCAOSM+40                                               02536000
ATCAP52  EQU   ATCAOSM+36                                               02537000
ATCAP32  EQU   ATCAOSM+28                                               02538000
ATCAP31  EQU   ATCAOSM+24                                               02539000
ATCAP12  EQU   ATCAOSM+20                                               02540000
ATCAP11  EQU   ATCAOSM+16                                               02541000
ATCCMTCB EQU   ATCAOSM+12                                               02542000
ATCPRPH  EQU   ATCAOSM+8                                                02543000
ATCGSRBF EQU   ATCGSRBG                                                 02544000
ATCSRBRT EQU   ATCAOSM                                                  02545000
@NM00051 EQU   @NM00050                                                 02546000
ATCVTMAB EQU   @NM00050                                                 02547000
@NM00049 EQU   ATCVTBAM                                                 02548000
ATCVDLOK EQU   ISTATCVT+904                                             02549000
ATCVFPAB EQU   ISTATCVT+872                                             02550000
ATCVDPAB EQU   ISTATCVT+840                                             02551000
ATCIOECB EQU   ISTATCVT+836                                             02552000
ATCINCW3 EQU   ISTATCVT+832                                             02553000
ATCMODTB EQU   ISTATCVT+828                                             02554000
ATCUSSPT EQU   ISTATCVT+824                                             02555000
ATCSRTAB EQU   ISTATCVT+820                                             02556000
@NM00048 EQU   ISTATCVT+819                                             02557000
@NM00047 EQU   ATCSTAT2                                                 02558000
ATCTRSMS EQU   ATCSTAT2                                                 02559000
ATCTRLOK EQU   ATCSTAT2                                                 02560000
ATCTRPSS EQU   ATCSTAT2                                                 02561000
ATCTRESC EQU   ATCSTAT2                                                 02562000
ATCTRAPI EQU   ATCSTAT2                                                 02563000
ATCNMCTR EQU   ISTATCVT+816                                             02564000
ATCSEC51 EQU   ATCSECST                                                 02565000
ATCSEC40 EQU   ATCSIPD+8                                                02566000
ATCSEC30 EQU   ATCSIPD+4                                                02567000
ATCSEC21 EQU   ATCSIPD                                                  02568000
ATCSEC10 EQU   ATCSOPD+4                                                02569000
ATCSEC01 EQU   ATCSOPD                                                  02570000
ATCPOIA  EQU   ATCRNO+1                                                 02571000
@NM00046 EQU   ATCRNO                                                   02572000
ATCPODVT EQU   ISTATCVT+784                                             02573000
ATCS49XL EQU   ISTATCVT+780                                             02574000
ATCS49XI EQU   ISTATCVT+776                                             02575000
ATCLCLCT EQU   ATCVLCNT+2                                               02576000
ATCRNCNT EQU   ATCVLCNT                                                 02577000
ATCCFEAD EQU   ISTATCVT+768                                             02578000
ATCPTR00 EQU   ISTATCVT+736                                             02579000
ATCRSV10 EQU   ISTATCVT+704                                             02580000
ATCTACB  EQU   ISTATCVT+700                                             02581000
ATCVTINM EQU   ISTATCVT+696                                             02582000
ATCTCLIM EQU   ISTATCVT+692                                             02583000
ATCTCLOM EQU   ISTATCVT+688                                             02584000
ATCVTIPB EQU   ISTATCVT+656                                             02585000
ATCTCIPB EQU   ISTATCVT+624                                             02586000
ATCTIPAB EQU   ISTATCVT+592                                             02587000
ATCOCCCB EQU   ISTATCVT+588                                             02588000
ATCOCCOB EQU   ISTATCVT+584                                             02589000
ATCCDLAD EQU   ISTATCVT+580                                             02590000
ATCCCLAD EQU   ISTATCVT+576                                             02591000
ATCDLRPB EQU   ISTATCVT+544                                             02592000
ATCPGPAB EQU   ISTATCVT+512                                             02593000
ATCVPAB1 EQU   ISTATCVT+480                                             02594000
ATCRSV97 EQU   ISTATCVT+476                                             02595000
ATCRDTLK EQU   ISTATCVT+472                                             02596000
ATCVOCLK EQU   ISTATCVT+468                                             02597000
ATCCDFDN EQU   ISTATCVT+464                                             02598000
ATCCDFIN EQU   ISTATCVT+460                                             02599000
ATCDVTLK EQU   ISTATCVT+456                                             02600000
ATCAP36  EQU   ISTATCVT+452                                             02601000
ATCAP35  EQU   ISTATCVT+448                                             02602000
ATCAP33  EQU   ISTATCVT+444                                             02603000
ATCRSV99 EQU   ISTATCVT+440                                             02604000
ATCONFIG EQU   ISTATCVT+432                                             02605000
ATCNODDS EQU   ISTATCVT+428                                             02606000
ATCNODEL EQU   ISTATCVT+420                                             02607000
ATCRSV69 EQU   ISTATCVT+416                                             02608000
ATCAPCR5 EQU   ISTATCVT+412                                             02609000
ATCLDECB EQU   ISTATCVT+408                                             02610000
ATCLDNCS EQU   ISTATCVT+404                                             02611000
ATCCDPTR EQU   ISTATCVT+400                                             02612000
ATCADEL  EQU   ISTATCVT+396                                             02613000
ATCTODVT EQU   ISTATCVT+392                                             02614000
ATCDEBCH EQU   ISTATCVT+388                                             02615000
ATCHBSIZ EQU   ATCHPGM+2                                                02616000
ATCHBFNO EQU   ATCHPGM                                                  02617000
ATCCRME  EQU   ISTATCVT+380                                             02618000
ATCRVCHS EQU   ISTATCVT+372                                             02619000
ATCECTLP EQU   ISTATCVT+368                                             02620000
ATCZDVTB EQU   ISTATCVT+364                                             02621000
ATCECPRT EQU   ISTATCVT+360                                             02622000
ATCVTLOD EQU   ISTATCVT+356                                             02623000
ATCTRPAB EQU   ISTATCVT+352                                             02624000
ATCMSGM  EQU   ISTATCVT+348                                             02625000
ATCMSGP  EQU   ISTATCVT+344                                             02626000
ATCEPT   EQU   ISTATCVT+340                                             02627000
ATCDVT   EQU   ISTATCVT+336                                             02628000
ATCTRCPT EQU   ISTATCVT+332                                             02629000
ATCDVLOD EQU   ISTATCVT+328                                             02630000
ATCALERT EQU   ISTATCVT+324                                             02631000
ATCEPA   EQU   ISTATCVT+320                                             02632000
ATCSAF   EQU   ISTATCVT+318                                             02633000
ATCXRANG EQU   ISTATCVT+317                                             02634000
ATCLAST  EQU   ATCSHRFG                                                 02635000
ATCSHRTN EQU   ISTATCVT+308                                             02636000
ATCUEP   EQU   ISTATCVT+304                                             02637000
ATCOCRT  EQU   ISTATCVT+300                                             02638000
ATCCSMA  EQU   ATCCSMR                                                  02639000
ATCESC02 EQU   ISTATCVT+292                                             02640000
ATCESC01 EQU   ISTATCVT+288                                             02641000
ATCCDFND EQU   ISTATCVT+284                                             02642000
ATCCDDEL EQU   ISTATCVT+280                                             02643000
ATCCDADD EQU   ISTATCVT+276                                             02644000
ATCMNT   EQU   ISTATCVT+272                                             02645000
ATCRSV16 EQU   ISTATCVT+270                                             02646000
ATCMAXID EQU   ISTATCVT+269                                             02647000
ATCMSGSP EQU   ATCCOM+268                                               02648000
ATCCIDM  EQU   ATCCOM+266                                               02649000
ATCACTRM EQU   ATCCOM+264                                               02650000
ATCNERAP EQU   ATCCOM+260                                               02651000
ATCNESAL EQU   ATCCOM+256                                               02652000
ATCRCC65 EQU   ATCCOM+252                                               02653000
ATCRCC26 EQU   ATCCOM+248                                               02654000
ATCRCC63 EQU   ATCCOM+244                                               02655000
ATCRSV11 EQU   ATCCOM+242                                               02656000
ATCVTMID EQU   ATCCOM+240                                               02657000
ATCAPOST EQU   ATCCOM+236                                               02658000
ATCNERFN EQU   ATCCOM+232                                               02659000
ATCNERNE EQU   ATCCOM+228                                               02660000
ATCNERCV EQU   ATCCOM+224                                               02661000
ATCNERST EQU   ATCCOM+220                                               02662000
ATCDCC61 EQU   ATCCOM+216                                               02663000
ATCDCC60 EQU   ATCCOM+212                                               02664000
ATCSRTDF EQU   ATCCOM+208                                               02665000
ATCSRTAD EQU   ATCCOM+204                                               02666000
ATCFIRA  EQU   ATCCOM+200                                               02667000
ATCSMBQ  EQU   ATCCOM+196                                               02668000
ATCSMRC  EQU   ATCCOM+192                                               02669000
ATCSMRS  EQU   ATCCOM+188                                               02670000
ATCSMQU  EQU   ATCCOM+184                                               02671000
ATCSMRQ  EQU   ATCCOM+180                                               02672000
ATCACDA  EQU   ATCCOM+176                                               02673000
ATCSTMA  EQU   ATCCOM+172                                               02674000
ATCFRSTR EQU   ATCCOM+168                                               02675000
ATCGTSTR EQU   ATCCOM+164                                               02676000
ATCREADA EQU   ATCCOM+160                                               02677000
ATCALOAD EQU   ATCCOM+156                                               02678000
ATCBLDLA EQU   ATCCOM+152                                               02679000
ATCFBRPH EQU   ATCCOM+148                                               02680000
ATCBFTRC EQU   ATCCOM+144                                               02681000
ATCTPBUF EQU   ATCTHTRC                                                 02682000
ATCREMOV EQU   ATCCOM+136                                               02683000
ATCADD   EQU   ATCCOM+132                                               02684000
ATCBPDA  EQU   ATCCOM+128                                               02685000
ATCDVTPT EQU   ATCCOM+124                                               02686000
ATCFEPT  EQU   ATCCOM+120                                               02687000
ATCFDVT  EQU   ATCCOM+116                                               02688000
ATCCONFT EQU   ATCCOM+112                                               02689000
ATCPTCHA EQU   ATCCOM+108                                               02690000
ATCAUTHA EQU   ATCCOM+104                                               02691000
ATCACCTA EQU   ATCCOM+100                                               02692000
ATCRDTH  EQU   ATCCOM+96                                                02693000
ATCFRSCH EQU   ATCCOM+92                                                02694000
ATCFSB   EQU   ATCCOM+88                                                02695000
ATCHLTMS EQU   ATCCOM+84                                                02696000
ATCECPRM EQU   ATCCOM+80                                                02697000
ATCECNET EQU   ATCCOM+76                                                02698000
ATCECOPC EQU   ATCCOM+72                                                02699000
ATCVPARM EQU   ATCCOM+68                                                02700000
ATCECVRQ EQU   ATCCOM+64                                                02701000
ATCECSES EQU   ATCCOM+60                                                02702000
ATCOCHA  EQU   ATCCOM+56                                                02703000
ATCDSPLQ EQU   ATCCOM+52                                                02704000
ATCECDSP EQU   ATCCOM+48                                                02705000
ATCVARYQ EQU   ATCCOM+44                                                02706000
ATCECVRY EQU   ATCCOM+40                                                02707000
ATCHALTQ EQU   ATCCOM+36                                                02708000
ATCECHLT EQU   ATCCOM+32                                                02709000
ATCMODQ  EQU   ATCCOM+28                                                02710000
ATCECMOD EQU   ATCCOM+24                                                02711000
ATCASCHD EQU   ATCCOM+20                                                02712000
ATCSRT   EQU   ATCCOM+16                                                02713000
ATCRDT   EQU   ATCCOM+12                                                02714000
ATCDCFRR EQU   ATCCOM+8                                                 02715000
ATCAPI   EQU   ATCCOM+4                                                 02716000
ATCRSV04 EQU   ATCSTAT4                                                 02717000
ATCVTTRC EQU   ATCSTAT4                                                 02718000
ATCNCSD  EQU   ATCSTAT4                                                 02719000
ATCMTST  EQU   ATCSTAT4                                                 02720000
ATCTPRT  EQU   ATCSTAT4                                                 02721000
ATCPRTAT EQU   ATCSTAT4                                                 02722000
@NM00045 EQU   ATCPOFLG                                                 02723000
ATCPOUNS EQU   ATCPOFLG                                                 02724000
ATCHSDMF EQU   ATCSTFLG                                                 02725000
@NM00044 EQU   ATCSTAT1                                                 02726000
ATCMDHLT EQU   ATCSTAT1                                                 02727000
ATCINHLT EQU   ATCSTAT1                                                 02728000
ATCNETSL EQU   ATCSTAT1                                                 02729000
ATCQKHLT EQU   ATCSTAT1                                                 02730000
ATCSNHLT EQU   ATCSTAT1                                                 02731000
ATCACTIV EQU   ATCSTAT1                                                 02732000
ATCSTART EQU   ATCSTAT1                                                 02733000
LOKXCL   EQU   @NM00042                                                 02734000
LOKPRY   EQU   @NM00042                                                 02735000
@NM00043 EQU   @NM00042                                                 02736000
@NM00041 EQU   LOKCHNG                                                  02737000
LOKCT    EQU   ISTLOK                                                   02738000
DYPPAB   EQU   ISTDYPAB+16                                              02739000
DYPRSV01 EQU   ISTDYPAB+12                                              02740000
DYPTSKID EQU   ISTDYPAB+8                                               02741000
DYPCHAIN EQU   ISTDYPAB+4                                               02742000
DYPFLGS  EQU   ISTDYPAB+2                                               02743000
DYPLNGTH EQU   ISTDYPAB+1                                               02744000
DYPTYPE  EQU   ISTDYPAB                                                 02745000
PABRPHA  EQU   PABRPHFG+1                                               02746000
PABNODQ  EQU   PABFLAGS                                                 02747000
PABINHBT EQU   PABFLAGS                                                 02748000
PABERLOK EQU   PABERRLK                                                 02749000
PABSSN   EQU   PABFLAGS                                                 02750000
PABDYNAM EQU   PABFLAGS                                                 02751000
PABNORPR EQU   PABFLAGS                                                 02752000
PABPRIOR EQU   PABFLAGS                                                 02753000
PABAPYP  EQU   PABFLAGS                                                 02754000
PABOFFST EQU   ISTPAB+8                                                 02755000
PABCHNGP EQU   PABCHAIN+1                                               02756000
PABRSV02 EQU   PABCHAIN                                                 02757000
PABDELAY EQU   PABCHAIN                                                 02758000
PABRUNNG EQU   PABCHAIN                                                 02759000
PABRESET EQU   PABCHAIN                                                 02760000
PABUNCON EQU   PABCHAIN                                                 02761000
PABCDP   EQU   PABCHAIN                                                 02762000
PABRESCH EQU   PABCHAIN                                                 02763000
PABCHNG  EQU   PABCHAIN                                                 02764000
PABWEQP  EQU   PABWEQA+1                                                02765000
PABRSV01 EQU   PABWEQA                                                  02766000
PABWEQG  EQU   PABWEQA                                                  02767000
CRACHAIN EQU   ISTCRA+928                                               02768000
CRARSV02 EQU   ISTCRA+924                                               02769000
CRARSV01 EQU   ISTCRA+920                                               02770000
CRABFTBA EQU   CRABUFA                                                  02771000
CRAMASK  EQU   CRASVC+64                                                02772000
CRAHSIZ  EQU   CRASVC+60                                                02773000
CRAASCRR EQU   CRASVC                                                   02774000
CRAPROCR EQU   ISTCRA+312                                               02775000
CRAPSS   EQU   ISTCRA+160                                               02776000
CRARPH   EQU   ISTCRA+52                                                02777000
CRALAPTR EQU   CRABASIC+48                                              02778000
CRAL9PTR EQU   CRABASIC+44                                              02779000
CRAL8PTR EQU   CRABASIC+40                                              02780000
CRAL7PTR EQU   CRABASIC+36                                              02781000
CRAL6PTR EQU   CRABASIC+32                                              02782000
CRAL5PTR EQU   CRABASIC+28                                              02783000
CRAL4PTR EQU   CRABASIC+24                                              02784000
CRAL3PTR EQU   CRABASIC+20                                              02785000
CRAL2PTR EQU   CRABASIC+16                                              02786000
CRAL1PTR EQU   CRABASIC+12                                              02787000
CRALEV01 EQU   CRALKACT+3                                               02788000
CRALEV02 EQU   CRALKACT+3                                               02789000
CRALEV03 EQU   CRALKACT+3                                               02790000
CRALEV04 EQU   CRALKACT+3                                               02791000
CRALEV05 EQU   CRALKACT+3                                               02792000
CRALEV06 EQU   CRALKACT+3                                               02793000
CRALEV07 EQU   CRALKACT+3                                               02794000
CRALEV08 EQU   CRALKACT+3                                               02795000
CRALEV09 EQU   CRALKACT+2                                               02796000
CRALEV10 EQU   CRALKACT+2                                               02797000
CRALEV11 EQU   CRALKACT+2                                               02798000
CRALEV12 EQU   CRALKACT+2                                               02799000
CRALEV13 EQU   CRALKACT+2                                               02800000
CRALEV14 EQU   CRALKACT+2                                               02801000
CRALEV15 EQU   CRALKACT+2                                               02802000
CRALEV16 EQU   CRALKACT+2                                               02803000
CRALEV17 EQU   CRALKACT+1                                               02804000
CRALEV18 EQU   CRALKACT+1                                               02805000
CRALEV19 EQU   CRALKACT+1                                               02806000
CRALEV20 EQU   CRALKACT+1                                               02807000
CRALEV21 EQU   CRALKACT+1                                               02808000
CRALEV22 EQU   CRALKACT+1                                               02809000
CRALEV23 EQU   CRALKACT+1                                               02810000
CRALEV24 EQU   CRALKACT+1                                               02811000
CRALEV25 EQU   CRALKACT                                                 02812000
CRALEV26 EQU   CRALKACT                                                 02813000
CRALEV27 EQU   CRALKACT                                                 02814000
CRALEV28 EQU   CRALKACT                                                 02815000
CRALEV29 EQU   CRALKACT                                                 02816000
CRALEV30 EQU   CRALKACT                                                 02817000
CRALEV31 EQU   CRALKACT                                                 02818000
CRALEV32 EQU   CRALKACT                                                 02819000
CRAFRR   EQU   CRAHDR+4                                                 02820000
CCFRSVD1 EQU   CFCCRT                                                   02821000
CCFCR2   EQU   CFCCRT                                                   02822000
CCFCRP   EQU   CFCCRT                                                   02823000
CCFCR1   EQU   CFCCRT                                                   02824000
CCFCS2   EQU   CFCCRT                                                   02825000
CCFCS1   EQU   CFCCRT                                                   02826000
NCFRSVD  EQU   CFCNTRD                                                  02827000
NCFCR2   EQU   CFCNTRD                                                  02828000
NCFCRP   EQU   CFCNTRD                                                  02829000
NCFCR1   EQU   CFCNTRD                                                  02830000
NCFCS2   EQU   CFCNTRD                                                  02831000
NCFCS1   EQU   CFCNTRD                                                  02832000
RIARSV03 EQU   RIAFLGS+2                                                02833000
RIARSV02 EQU   RIAFLG2                                                  02834000
RIABR15  EQU   RIAFLG2                                                  02835000
RIARSPCC EQU   RIAFLG2                                                  02836000
RIARTPXT EQU   RIAFLG2                                                  02837000
RIACONT  EQU   RIAFLG2                                                  02838000
RIAFABN  EQU   RIAFLG2                                                  02839000
RIARSV01 EQU   RIAFLG1                                                  02840000
RIACTIVE EQU   RIAFLG1                                                  02841000
RIACTL   EQU   RIAFLG1                                                  02842000
RIAABR15 EQU   RIAABRGS+60                                              02843000
RIAABR14 EQU   RIAABRGS+56                                              02844000
RIAABR13 EQU   RIAABRGS+52                                              02845000
RIAABR12 EQU   RIAABRGS+48                                              02846000
RIAABR11 EQU   RIAABRGS+44                                              02847000
RIAABR10 EQU   RIAABRGS+40                                              02848000
RIAABR09 EQU   RIAABRGS+36                                              02849000
RIAABR08 EQU   RIAABRGS+32                                              02850000
RIAABR07 EQU   RIAABRGS+28                                              02851000
RIAABR06 EQU   RIAABRGS+24                                              02852000
RIAABR05 EQU   RIAABRGS+20                                              02853000
RIAABR04 EQU   RIAABRGS+16                                              02854000
RIAABR03 EQU   RIAABRGS+12                                              02855000
RIAABR02 EQU   RIAABRGS+8                                               02856000
RIAABR01 EQU   RIAABRGS+4                                               02857000
RIAABR00 EQU   RIAABRGS                                                 02858000
RIARSV04 EQU   ISTRIA+14                                                02859000
RIAABPSW EQU   ISTRIA+4                                                 02860000
RIAABCD  EQU   ISTRIA                                                   02861000
ASCPSREG EQU   ISTASCRR+44                                              02862000
ASCUSR01 EQU   ASCUSRGS+12                                              02863000
ASCUSR00 EQU   ASCUSRGS+8                                               02864000
ASCUSR15 EQU   ASCUSRGS+4                                               02865000
ASCUSR14 EQU   ASCUSRGS                                                 02866000
ASCETRYA EQU   ISTASCRR+24                                              02867000
ASCKEY   EQU   ISTASCRR+23                                              02868000
ASCAUDIT EQU   ASCFLG3                                                  02869000
ASCFBDUD EQU   ASCFLG3                                                  02870000
ASCLLKF  EQU   ASCFLG3                                                  02871000
ASCKEYF  EQU   ASCFLG3                                                  02872000
ASCFBDAL EQU   ASCFLG3                                                  02873000
ASCFSRGT EQU   ASCFLG3                                                  02874000
ASCICR   EQU   ASCFLG2                                                  02875000
ASCFSRIC EQU   ASCFLG2                                                  02876000
ASCFBDIC EQU   ASCFLG2                                                  02877000
ASCFBAIC EQU   ASCFLG2                                                  02878000
ASCPASTR EQU   ASCFLG1                                                  02879000
ASCFSR   EQU   ASCFLG1                                                  02880000
ASCFBD   EQU   ASCFLG1                                                  02881000
ASCFBA   EQU   ASCFLG1                                                  02882000
ASCPFCRR EQU   ISTASCRR                                                 02883000
CRRRVPT5 EQU   CRRSAREA+316                                             02884000
CRRRVPT4 EQU   CRRSAREA+312                                             02885000
CRRRVPT3 EQU   CRRSAREA+308                                             02886000
CRRRVPT2 EQU   CRRSAREA+304                                             02887000
CRRRVPT1 EQU   CRRSAREA+300                                             02888000
CRRRVCR2 EQU   CRRSAREA+292                                             02889000
CRRRVCR1 EQU   CRRSAREA+291                                             02890000
CRRXFNCD EQU   CRRSAREA+290                                             02891000
CRRLDOCT EQU   CRRSAREA+288                                             02892000
CRRBTLEN EQU   CRRSAREA+284                                             02893000
CRRBLEN  EQU   CRRSAREA+282                                             02894000
CRRBRTCD EQU   CRRSAREA+281                                             02895000
@NM00040 EQU   CRRBFLGS                                                 02896000
CRRDIRPT EQU   CRRBFLGS                                                 02897000
CRRBFLG1 EQU   CRRBFLGS                                                 02898000
CRRBLDAD EQU   CRRSAREA+276                                             02899000
CRRBARAD EQU   CRRSAREA+272                                             02900000
CRRRTN12 EQU   CRRSAREA+268                                             02901000
CRRRTN11 EQU   CRRSAREA+264                                             02902000
CRRRTN10 EQU   CRRSAREA+260                                             02903000
CRRRTN9  EQU   CRRSAREA+256                                             02904000
CRRRTN8  EQU   CRRSAREA+252                                             02905000
CRRRTN7  EQU   CRRSAREA+248                                             02906000
CRRRTN6  EQU   CRRSAREA+244                                             02907000
CRRRTN5  EQU   CRRSAREA+240                                             02908000
CRRRTN4  EQU   CRRSAREA+236                                             02909000
CRRRTN3  EQU   CRRSAREA+232                                             02910000
CRRRTN2  EQU   CRRSAREA+228                                             02911000
CRRRTN1  EQU   CRRSAREA+224                                             02912000
CRRRES1  EQU   CRRSAREA+222                                             02913000
CRRLCNT  EQU   CRRSAREA+220                                             02914000
CRRATCVT EQU   CRRSAREA+216                                             02915000
CRRVALCK EQU   CRRSAREA+212                                             02916000
CRRARPL  EQU   CRRTRBUF+4                                               02917000
CRRBIND  EQU   CRRTRBUF+3                                               02918000
CRRTRRES EQU   CRRTRBUF                                                 02919000
CRRCLDO  EQU   CRRSAREA+200                                             02920000
CRRUECB  EQU   CRRSAREA+196                                             02921000
CRRLCPB  EQU   CRRSAREA+192                                             02922000
CRRCMDAD EQU   CRRSAREA+188                                             02923000
CRRFMCB  EQU   CRRSAREA+184                                             02924000
CRRCLCCW EQU   CRRSAREA+180                                             02925000
CRRESR2  EQU   CRRESR+1                                                 02926000
CRRESR1  EQU   CRRESR                                                   02927000
CRRDSB2  EQU   CRRDSB+1                                                 02928000
CRRDSB1  EQU   CRRDSB                                                   02929000
CRRDTACT EQU   CRRSAREA+174                                             02930000
CRRRSV99 EQU   CRRSAREA+173                                             02931000
CRRRDSOH EQU   CRRFDB3                                                  02932000
CRRRLG   EQU   CRRFDB3                                                  02933000
CRRLGFRC EQU   CRRFDB3                                                  02934000
CRRRDEOT EQU   CRRFDB3                                                  02935000
CRRRDEOM EQU   CRRFDB3                                                  02936000
CRRRDEOB EQU   CRRFDB3                                                  02937000
CRRUNUSD EQU   CRRFDB3                                                  02938000
CRRUINPT EQU   CRRFDB3                                                  02939000
CRRSTSAV EQU   CRRFDB2                                                  02940000
CRRCUERR EQU   CRRFDB2                                                  02941000
CRRDLGFL EQU   CRRFDB2                                                  02942000
CRRIOERR EQU   CRRFDB2                                                  02943000
CRRDVUNS EQU   CRRFDB2                                                  02944000
CRRATND  EQU   CRRFDB2                                                  02945000
CRRRVID  EQU   CRRFDB2                                                  02946000
CRRERLK  EQU   CRRFDB2                                                  02947000
CRRRTNCD EQU   CRRFDBK1                                                 02948000
CRRNSNA  EQU   CRRRTYPE                                                 02949000
CRRDFSYN EQU   CRRRTYPE                                                 02950000
CRRRESP  EQU   CRRRTYPE                                                 02951000
CRRDFASY EQU   CRRRTYPE                                                 02952000
CRRDBLCK EQU   CRRRFLG1                                                 02953000
CRRRPSBD EQU   CRRRFLG1                                                 02954000
CRRRPLOQ EQU   CRRRFLG1                                                 02955000
CRRRPLS  EQU   CRRRFLG1                                                 02956000
CRRSW7   EQU   CRRFLGS                                                  02957000
CRRSW6   EQU   CRRFLGS                                                  02958000
CRRSW5   EQU   CRRFLGS                                                  02959000
CRRSW4   EQU   CRRFLGS                                                  02960000
CRRSW3   EQU   CRRFLGS                                                  02961000
CRRSW2   EQU   CRRFLGS                                                  02962000
CRRSW1   EQU   CRRFLGS                                                  02963000
CRRSW0   EQU   CRRFLGS                                                  02964000
CRRRSV04 EQU   CRRFLGS4                                                 02965000
CRRFMCLK EQU   CRRFLGS4                                                 02966000
CRRDLCCW EQU   CRRFLGS3                                                 02967000
CRRRESET EQU   CRRFLGS3                                                 02968000
CRRSUBBK EQU   CRRFLGS3                                                 02969000
CRRRSV08 EQU   CRRFLGS3                                                 02970000
CRRDEBQ  EQU   CRRFLGS3                                                 02971000
CRRSTSPR EQU   CRRFLGS3                                                 02972000
CRRDREQ  EQU   CRRFLGS3                                                 02973000
CRRDFDBK EQU   CRRFLGS3                                                 02974000
CRRDFSB  EQU   CRRFLGS2                                                 02975000
CRRDPROC EQU   CRRFLGS2                                                 02976000
CRREXTS  EQU   CRRFLGS2                                                 02977000
CRRELSRI EQU   CRRFLGS2                                                 02978000
CRRPOST  EQU   CRRFLGS2                                                 02979000
CRRENDLW EQU   CRRFLGS2                                                 02980000
CRRPRGIP EQU   CRRFLGS2                                                 02981000
CRRDEXP  EQU   CRRFLGS2                                                 02982000
CRRSOLRQ EQU   CRRFLGS1                                                 02983000
CRRREQP  EQU   CRRFLGS1                                                 02984000
CRRCPROC EQU   CRRFLGS1                                                 02985000
CRRFINI  EQU   CRRFLGS1                                                 02986000
CRRPREIO EQU   CRRFLGS1                                                 02987000
CRRINIO  EQU   CRRFLGS1                                                 02988000
CRRFLDOS EQU   CRRFLGS1                                                 02989000
CRRDOCUR EQU   CRRFLGS1                                                 02990000
CRRRATS4 EQU   CRRATS+7                                                 02991000
@NM00039 EQU   CRRSATS                                                  02992000
CRRASC51 EQU   CRRSATS                                                  02993000
CRRASC40 EQU   CRRSATS                                                  02994000
CRRASC30 EQU   CRRSATS                                                  02995000
CRRASC21 EQU   CRRSATS                                                  02996000
CRRASC10 EQU   CRRSATS                                                  02997000
CRRASC01 EQU   CRRSATS                                                  02998000
@NM00038 EQU   CRRRATS2                                                 02999000
CRRPLIC  EQU   CRRRATS2                                                 03000000
CRRRC81  EQU   CRRRATS2                                                 03001000
CRRRC80  EQU   CRRRATS2                                                 03002000
CRRRC65  EQU   CRRRATS2                                                 03003000
CRRRC63  EQU   CRRRATS2                                                 03004000
CRRRC55  EQU   CRRRATS2                                                 03005000
CRRRC54  EQU   CRRRATS2                                                 03006000
CRRRC53  EQU   CRRRATS1                                                 03007000
CRRRC52  EQU   CRRRATS1                                                 03008000
CRRRC51  EQU   CRRRATS1                                                 03009000
CRRRC30  EQU   CRRRATS1                                                 03010000
CRRRC26  EQU   CRRRATS1                                                 03011000
CRRRC23  EQU   CRRRATS1                                                 03012000
CRRRC22  EQU   CRRRATS1                                                 03013000
CRRRC21  EQU   CRRRATS1                                                 03014000
@NM00037 EQU   CRRATS4                                                  03015000
CRRC3X   EQU   CRRATS4                                                  03016000
CRRC85   EQU   CRRATS4                                                  03017000
CRRC83   EQU   CRRATS4                                                  03018000
CRRC82   EQU   CRRATS4                                                  03019000
CRRC61   EQU   CRRATS4                                                  03020000
CRRC60   EQU   CRRATS4                                                  03021000
CRRC81   EQU   CRRATS3                                                  03022000
CRRC80   EQU   CRRATS3                                                  03023000
CRRC75   EQU   CRRATS3                                                  03024000
CRRC51   EQU   CRRATS3                                                  03025000
CRRC50   EQU   CRRATS3                                                  03026000
CRRC42   EQU   CRRATS3                                                  03027000
CRRC41   EQU   CRRATS3                                                  03028000
CRRC40   EQU   CRRATS3                                                  03029000
CRRC32   EQU   CRRATS2                                                  03030000
CRRC31   EQU   CRRATS2                                                  03031000
CRRC30   EQU   CRRATS2                                                  03032000
CRRC25   EQU   CRRATS2                                                  03033000
CRRC24   EQU   CRRATS2                                                  03034000
CRRC23   EQU   CRRATS2                                                  03035000
CRRC22   EQU   CRRATS2                                                  03036000
CRRC21   EQU   CRRATS2                                                  03037000
CRRC20   EQU   CRRATS1                                                  03038000
CRRC13   EQU   CRRATS1                                                  03039000
CRRC12   EQU   CRRATS1                                                  03040000
CRRC11   EQU   CRRATS1                                                  03041000
CRRC10   EQU   CRRATS1                                                  03042000
CRRC02   EQU   CRRATS1                                                  03043000
CRRC01   EQU   CRRATS1                                                  03044000
CRRC00   EQU   CRRATS1                                                  03045000
CRRRMAS4 EQU   CRRMAS+7                                                 03046000
@NM00036 EQU   CRRSMAS                                                  03047000
CRRMSC51 EQU   CRRSMAS                                                  03048000
CRRMSC40 EQU   CRRSMAS                                                  03049000
CRRMSC30 EQU   CRRSMAS                                                  03050000
CRRMSC21 EQU   CRRSMAS                                                  03051000
CRRMSC10 EQU   CRRSMAS                                                  03052000
CRRMSC01 EQU   CRRSMAS                                                  03053000
@NM00035 EQU   CRRRMAS2                                                 03054000
CRRRM81  EQU   CRRRMAS2                                                 03055000
CRRRM80  EQU   CRRRMAS2                                                 03056000
CRRRM65  EQU   CRRRMAS2                                                 03057000
CRRRM63  EQU   CRRRMAS2                                                 03058000
CRRRM55  EQU   CRRRMAS2                                                 03059000
CRRRM54  EQU   CRRRMAS2                                                 03060000
CRRRM53  EQU   CRRRMAS1                                                 03061000
CRRRM52  EQU   CRRRMAS1                                                 03062000
CRRRM51  EQU   CRRRMAS1                                                 03063000
CRRRM30  EQU   CRRRMAS1                                                 03064000
CRRRM26  EQU   CRRRMAS1                                                 03065000
CRRRM23  EQU   CRRRMAS1                                                 03066000
CRRRM22  EQU   CRRRMAS1                                                 03067000
CRRRM21  EQU   CRRRMAS1                                                 03068000
@NM00034 EQU   CRRMAS4                                                  03069000
CRRM3X   EQU   CRRMAS4                                                  03070000
CRRM85   EQU   CRRMAS4                                                  03071000
CRRM83   EQU   CRRMAS4                                                  03072000
CRRM82   EQU   CRRMAS4                                                  03073000
CRRM61   EQU   CRRMAS4                                                  03074000
CRRM60   EQU   CRRMAS4                                                  03075000
CRRM81   EQU   CRRMAS3                                                  03076000
CRRM80   EQU   CRRMAS3                                                  03077000
CRRM75   EQU   CRRMAS3                                                  03078000
CRRM51   EQU   CRRMAS3                                                  03079000
CRRM50   EQU   CRRMAS3                                                  03080000
CRRM42   EQU   CRRMAS3                                                  03081000
CRRM41   EQU   CRRMAS3                                                  03082000
CRRM40   EQU   CRRMAS3                                                  03083000
CRRM32   EQU   CRRMAS2                                                  03084000
CRRM31   EQU   CRRMAS2                                                  03085000
CRRM30   EQU   CRRMAS2                                                  03086000
CRRM25   EQU   CRRMAS2                                                  03087000
CRRM24   EQU   CRRMAS2                                                  03088000
CRRM23   EQU   CRRMAS2                                                  03089000
CRRM22   EQU   CRRMAS2                                                  03090000
CRRM21   EQU   CRRMAS2                                                  03091000
CRRM20   EQU   CRRMAS1                                                  03092000
CRRM13   EQU   CRRMAS1                                                  03093000
CRRM12   EQU   CRRMAS1                                                  03094000
CRRM11   EQU   CRRMAS1                                                  03095000
CRRM10   EQU   CRRMAS1                                                  03096000
CRRM02   EQU   CRRMAS1                                                  03097000
CRRM01   EQU   CRRMAS1                                                  03098000
CRRM00   EQU   CRRMAS1                                                  03099000
CRRFSB   EQU   CRRSAREA+144                                             03100000
CRRSAVE1 EQU   CRRSAREA+72                                              03101000
CRRSAVE  EQU   CRRSAREA                                                 03102000
CRRRSV22 EQU   ISTDCCRR+4                                               03103000
CRRCRR   EQU   ISTDCCRR                                                 03104000
@NM00033 EQU   ISTAPCRR+137                                             03105000
@NM00032 EQU   APC57FLG                                                 03106000
APCNREL  EQU   APC57FLG                                                 03107000
APCRECRA EQU   APC57FLG                                                 03108000
@NM00031 EQU   APC54FLG                                                 03109000
APCRLST  EQU   APC54FLG                                                 03110000
APCPR153 EQU   APC53FLG                                                 03111000
@NM00030 EQU   APC52FLG                                                 03112000
APCWKF   EQU   APC52FLG                                                 03113000
APCNWF   EQU   APC52FLG                                                 03114000
APCRDQ   EQU   APC52FLG                                                 03115000
APCQENQ  EQU   APC52FLG                                                 03116000
APCSMSR  EQU   APC52FLG                                                 03117000
APCCKRQ  EQU   APC52FLG                                                 03118000
@NM00029 EQU   APC31FLG                                                 03119000
APCSORT  EQU   APC31FLG                                                 03120000
APCRESCH EQU   APC31FLG                                                 03121000
APCTPXIT EQU   APC31FLG                                                 03122000
APCSWTWD EQU   ISTAPCRR+128                                             03123000
APCSAV2  EQU   ISTAPCRR+124                                             03124000
APCSAV1  EQU   ISTAPCRR+120                                             03125000
APCRETCD EQU   APCCOMF+2                                                03126000
@NM00028 EQU   APCCOMF1+1                                               03127000
APCZLBER EQU   APCCOMF1                                                 03128000
APCEXIT  EQU   APCCOMF1                                                 03129000
APCRELR  EQU   APCCOMF1                                                 03130000
APCIRB2  EQU   APCCOMF1                                                 03131000
APCIRB1  EQU   APCCOMF1                                                 03132000
APCSMCR  EQU   APCCOMF1                                                 03133000
APCUETSK EQU   APCCOMF1                                                 03134000
APCSSTSK EQU   APCCOMF1                                                 03135000
APCESTAL EQU   APCSAVE                                                  03136000
APCFRRPM EQU   ISTAPCRR+40                                              03137000
APCQWFO  EQU   ISTAPCRR+36                                              03138000
APCPABSV EQU   ISTAPCRR+32                                              03139000
APCRTRN  EQU   ISTAPCRR+28                                              03140000
APCTCBA  EQU   ISTAPCRR+24                                              03141000
APCPSTA  EQU   ISTAPCRR+20                                              03142000
@NM00027 EQU   APCRFLG+1                                                03143000
APC31R   EQU   APCRFLG                                                  03144000
APC58R   EQU   APCRFLG                                                  03145000
APC57R   EQU   APCRFLG                                                  03146000
APC56R   EQU   APCRFLG                                                  03147000
APC54R   EQU   APCRFLG                                                  03148000
APC53R   EQU   APCRFLG                                                  03149000
APC52R   EQU   APCRFLG                                                  03150000
APC51R   EQU   APCRFLG                                                  03151000
@NM00026 EQU   APCATFLG+1                                               03152000
APC31E   EQU   APCATFLG                                                 03153000
APC58E   EQU   APCATFLG                                                 03154000
APC57E   EQU   APCATFLG                                                 03155000
APC56E   EQU   APCATFLG                                                 03156000
APC54E   EQU   APCATFLG                                                 03157000
APC53E   EQU   APCATFLG                                                 03158000
APC52E   EQU   APCATFLG                                                 03159000
APC51E   EQU   APCATFLG                                                 03160000
APCHDRSV EQU   ISTAPCRR                                                 03161000
PFCRSV01 EQU   ISTPFCRR+13                                              03162000
PFCFTA   EQU   ISTPFCRR+12                                              03163000
CRRFRR   EQU   PFCFRRO                                                  03164000
CRRCHAIN EQU   PFCCRRO                                                  03165000
CRRLEN   EQU   PFCCRRLN                                                 03166000
PFCRSV10 EQU   PFCCRR+1                                                 03167000
CRRID    EQU   PFCCRRID                                                 03168000
ZCRRU    EQU   ZCRRHRU+3                                                03169000
ZCRRH    EQU   ZCRRHRU                                                  03170000
ZCRWORDA EQU   ISTZCRR+477                                              03171000
ZCRCMNRC EQU   ISTZCRR+476                                              03172000
ZCRRSV97 EQU   ZCRENTER+18                                              03173000
ZCREIC2B EQU   ZCRENTER+18                                              03174000
ZCREAC2B EQU   ZCRENTER+18                                              03175000
ZCRELCAB EQU   ZCRENTER+18                                              03176000
ZCREDCMF EQU   ZCRENTER+18                                              03177000
ZCREBCIF EQU   ZCRENTER+18                                              03178000
ZCREICSG EQU   ZCRENTER+18                                              03179000
ZCREDCK0 EQU   ZCRENTER+18                                              03180000
ZCRECFY0 EQU   ZCRENTER+17                                              03181000
ZCREKCCB EQU   ZCRENTER+17                                              03182000
ZCREDCNB EQU   ZCRENTER+17                                              03183000
ZCREICOE EQU   ZCRENTER+17                                              03184000
ZCREBCNB EQU   ZCRENTER+17                                              03185000
ZCREBC0L EQU   ZCRENTER+17                                              03186000
ZCREBCAL EQU   ZCRENTER+17                                              03187000
ZCREDCQR EQU   ZCRENTER+17                                              03188000
ZCREDCPR EQU   ZCRENTER+16                                              03189000
ZCREBCSB EQU   ZCRENTER+16                                              03190000
ZCREAC1R EQU   ZCRENTER+16                                              03191000
ZCRECCCI EQU   ZCRENTER+16                                              03192000
ZCRECCAI EQU   ZCRENTER+16                                              03193000
ZCRECCBI EQU   ZCRENTER+16                                              03194000
ZCREBCAR EQU   ZCRENTER+16                                              03195000
ZCREBCDR EQU   ZCRENTER+16                                              03196000
ZCREBCBR EQU   ZCRENTER+15                                              03197000
ZCREDCXR EQU   ZCRENTER+15                                              03198000
ZCREDCWB EQU   ZCRENTER+15                                              03199000
ZCREDCWR EQU   ZCRENTER+15                                              03200000
ZCREKCCN EQU   ZCRENTER+15                                              03201000
ZCREKCBN EQU   ZCRENTER+15                                              03202000
ZCREKCBB EQU   ZCRENTER+15                                              03203000
ZCREJC0B EQU   ZCRENTER+15                                              03204000
ZCREJCDB EQU   ZCRENTER+14                                              03205000
ZCREJCCB EQU   ZCRENTER+14                                              03206000
ZCREJCBB EQU   ZCRENTER+14                                              03207000
ZCREJCAB EQU   ZCRENTER+14                                              03208000
ZCREIC1B EQU   ZCRENTER+14                                              03209000
ZCREIC0B EQU   ZCRENTER+14                                              03210000
ZCREICX0 EQU   ZCRENTER+14                                              03211000
ZCREICWB EQU   ZCRENTER+14                                              03212000
ZCREICVB EQU   ZCRENTER+13                                              03213000
ZCREICUB EQU   ZCRENTER+13                                              03214000
ZCREICTB EQU   ZCRENTER+13                                              03215000
ZCREICSC EQU   ZCRENTER+13                                              03216000
ZCREICSB EQU   ZCRENTER+13                                              03217000
ZCREICRB EQU   ZCRENTER+13                                              03218000
ZCREICQB EQU   ZCRENTER+13                                              03219000
ZCREICQA EQU   ZCRENTER+13                                              03220000
ZCREICOB EQU   ZCRENTER+12                                              03221000
ZCREICNB EQU   ZCRENTER+12                                              03222000
ZCREICNA EQU   ZCRENTER+12                                              03223000
ZCREICMB EQU   ZCRENTER+12                                              03224000
ZCREICLB EQU   ZCRENTER+12                                              03225000
ZCREICKG EQU   ZCRENTER+12                                              03226000
ZCREICKE EQU   ZCRENTER+12                                              03227000
ZCREICKB EQU   ZCRENTER+11                                              03228000
ZCREICJB EQU   ZCRENTER+11                                              03229000
ZCREICID EQU   ZCRENTER+11                                              03230000
ZCREICIB EQU   ZCRENTER+11                                              03231000
ZCREICHB EQU   ZCRENTER+11                                              03232000
ZCREICGB EQU   ZCRENTER+11                                              03233000
ZCREICEB EQU   ZCRENTER+11                                              03234000
ZCREICDB EQU   ZCRENTER+11                                              03235000
ZCREICCI EQU   ZCRENTER+10                                              03236000
ZCREICCB EQU   ZCRENTER+10                                              03237000
ZCREICBI EQU   ZCRENTER+10                                              03238000
ZCREICBB EQU   ZCRENTER+10                                              03239000
ZCREICAB EQU   ZCRENTER+10                                              03240000
ZCREICAA EQU   ZCRENTER+10                                              03241000
ZCREHCAN EQU   ZCRENTER+10                                              03242000
ZCREGC0B EQU   ZCRENTER+10                                              03243000
ZCREGC0A EQU   ZCRENTER+9                                               03244000
ZCREGCLA EQU   ZCRENTER+9                                               03245000
ZCREGCEB EQU   ZCRENTER+9                                               03246000
ZCREGCDB EQU   ZCRENTER+9                                               03247000
@NM00025 EQU   ZCRENTER+9                                               03248000
ZCREGCBB EQU   ZCRENTER+9                                               03249000
ZCREGCAB EQU   ZCRENTER+9                                               03250000
ZCREFCEB EQU   ZCRENTER+9                                               03251000
ZCREFCEA EQU   ZCRENTER+8                                               03252000
ZCREECTA EQU   ZCRENTER+8                                               03253000
ZCREECEA EQU   ZCRENTER+8                                               03254000
ZCREECDA EQU   ZCRENTER+8                                               03255000
ZCREECCB EQU   ZCRENTER+8                                               03256000
ZCREECCA EQU   ZCRENTER+8                                               03257000
ZCREECBB EQU   ZCRENTER+8                                               03258000
ZCREECBA EQU   ZCRENTER+8                                               03259000
ZCREDCMB EQU   ZCRENTER+7                                               03260000
ZCREDCL0 EQU   ZCRENTER+7                                               03261000
ZCREDCKB EQU   ZCRENTER+7                                               03262000
ZCREDCKA EQU   ZCRENTER+7                                               03263000
ZCREDCJ0 EQU   ZCRENTER+7                                               03264000
ZCREDCI0 EQU   ZCRENTER+7                                               03265000
ZCREDCH0 EQU   ZCRENTER+7                                               03266000
ZCREDCF0 EQU   ZCRENTER+7                                               03267000
ZCREDCE0 EQU   ZCRENTER+6                                               03268000
ZCREDCD0 EQU   ZCRENTER+6                                               03269000
ZCREDCC0 EQU   ZCRENTER+6                                               03270000
ZCREDCB0 EQU   ZCRENTER+6                                               03271000
ZCREDCA0 EQU   ZCRENTER+6                                               03272000
ZCRECC2B EQU   ZCRENTER+6                                               03273000
ZCRECC1B EQU   ZCRENTER+6                                               03274000
ZCRECC1A EQU   ZCRENTER+6                                               03275000
ZCRECC0B EQU   ZCRENTER+5                                               03276000
ZCRECC0A EQU   ZCRENTER+5                                               03277000
ZCREBC0B EQU   ZCRENTER+5                                               03278000
ZCREBC0A EQU   ZCRENTER+5                                               03279000
ZCREBCZ0 EQU   ZCRENTER+5                                               03280000
ZCREBCY0 EQU   ZCRENTER+5                                               03281000
ZCREBCX0 EQU   ZCRENTER+5                                               03282000
ZCREBCXA EQU   ZCRENTER+5                                               03283000
ZCREBCSC EQU   ZCRENTER+4                                               03284000
ZCREBCRB EQU   ZCRENTER+4                                               03285000
ZCREBCRA EQU   ZCRENTER+4                                               03286000
ZCREBCQB EQU   ZCRENTER+4                                               03287000
ZCREBCPB EQU   ZCRENTER+4                                               03288000
ZCREBCOB EQU   ZCRENTER+4                                               03289000
ZCREBCNE EQU   ZCRENTER+4                                               03290000
ZCREBCND EQU   ZCRENTER+4                                               03291000
ZCREBCMB EQU   ZCRENTER+3                                               03292000
ZCREBCLB EQU   ZCRENTER+3                                               03293000
ZCREBCLA EQU   ZCRENTER+3                                               03294000
ZCREBCKB EQU   ZCRENTER+3                                               03295000
ZCREBCKA EQU   ZCRENTER+3                                               03296000
ZCREBCJB EQU   ZCRENTER+3                                               03297000
ZCREBCJA EQU   ZCRENTER+3                                               03298000
ZCREBCID EQU   ZCRENTER+3                                               03299000
ZCREBCIB EQU   ZCRENTER+2                                               03300000
ZCREBCIA EQU   ZCRENTER+2                                               03301000
ZCREBCHB EQU   ZCRENTER+2                                               03302000
ZCREBCHA EQU   ZCRENTER+2                                               03303000
ZCREBCGB EQU   ZCRENTER+2                                               03304000
ZCREBCGA EQU   ZCRENTER+2                                               03305000
ZCREBCFB EQU   ZCRENTER+2                                               03306000
ZCREBCFA EQU   ZCRENTER+2                                               03307000
ZCREBCEB EQU   ZCRENTER+1                                               03308000
ZCREBCDI EQU   ZCRENTER+1                                               03309000
ZCREBCCB EQU   ZCRENTER+1                                               03310000
ZCREBCBI EQU   ZCRENTER+1                                               03311000
ZCREBCBB EQU   ZCRENTER+1                                               03312000
ZCREBCBA EQU   ZCRENTER+1                                               03313000
ZCREBCAM EQU   ZCRENTER+1                                               03314000
ZCREBCAI EQU   ZCRENTER+1                                               03315000
ZCREBCAG EQU   ZCRENTER                                                 03316000
ZCREBCAE EQU   ZCRENTER                                                 03317000
ZCREBCAB EQU   ZCRENTER                                                 03318000
ZCREBCAA EQU   ZCRENTER                                                 03319000
ZCREAC1B EQU   ZCRENTER                                                 03320000
ZCREAC0B EQU   ZCRENTER                                                 03321000
ZCREAC0A EQU   ZCRENTER                                                 03322000
ZCREAC1A EQU   ZCRENTER                                                 03323000
ZCRTNAME EQU   ZCRAUDIT+1                                               03324000
ZCRTID   EQU   ZCRAUDIT                                                 03325000
ZCRREMIC EQU   ISTZCRR+436                                              03326000
ZCRSAVEZ EQU   ISTZCRR+196                                              03327000
ZCRDAFSV EQU   ZCRCIDSV+2                                               03328000
ZCRSAFSV EQU   ZCRCIDSV                                                 03329000
ZCRR13SV EQU   ISTZCRR+188                                              03330000
ZCRR2SV  EQU   ISTZCRR+184                                              03331000
ZCROPCDE EQU   ISTZCRR+183                                              03332000
ZCRPRMTC EQU   ISTZCRR+182                                              03333000
ZCRRCDSV EQU   ISTZCRR+181                                              03334000
ZCRAWQSW EQU   ISTZCRR+180                                              03335000
ZCRTOPQ  EQU   ISTZCRR+180                                              03336000
ZCRLSTFB EQU   ISTZCRR+180                                              03337000
ZCRXSCHD EQU   ISTZCRR+180                                              03338000
ZCRNXTEL EQU   ISTZCRR+180                                              03339000
ZCRSCANQ EQU   ISTZCRR+180                                              03340000
ZCRMOREL EQU   ISTZCRR+180                                              03341000
ZCRFBPRC EQU   ISTZCRR+180                                              03342000
ZCRFSBSV EQU   ISTZCRR+176                                              03343000
ZCRSVWK5 EQU   ZCRWKARA+16                                              03344000
ZCRSVWK4 EQU   ZCRWKARA+12                                              03345000
ZCRSVWK3 EQU   ZCRWKARA+8                                               03346000
ZCRSVWK2 EQU   ZCRWKARA+4                                               03347000
ZCRSVWK1 EQU   ZCRWKARA                                                 03348000
ZCRSVF25 EQU   ZCRSVRTN+96                                              03349000
ZCRSVF24 EQU   ZCRSVRTN+92                                              03350000
ZCRSVF23 EQU   ZCRSVRTN+88                                              03351000
ZCRSVF22 EQU   ZCRSVRTN+84                                              03352000
ZCRSVF21 EQU   ZCRSVRTN+80                                              03353000
ZCRSVF20 EQU   ZCRSVRTN+76                                              03354000
ZCRSVF19 EQU   ZCRSVRTN+72                                              03355000
ZCRSVF18 EQU   ZCRSVRTN+68                                              03356000
ZCRSVF17 EQU   ZCRSVRTN+64                                              03357000
ZCRSVF16 EQU   ZCRSVRTN+60                                              03358000
ZCRSVF15 EQU   ZCRSVRTN+56                                              03359000
ZCRSVF14 EQU   ZCRSVRTN+52                                              03360000
ZCRSVF13 EQU   ZCRSVRTN+48                                              03361000
ZCRSVF12 EQU   ZCRSVRTN+44                                              03362000
ZCRSVF11 EQU   ZCRSVRTN+40                                              03363000
ZCRSVF10 EQU   ZCRSVRTN+36                                              03364000
ZCRSVF9  EQU   ZCRSVRTN+32                                              03365000
ZCRSVF8  EQU   ZCRSVRTN+28                                              03366000
ZCRSVF7  EQU   ZCRSVRTN+24                                              03367000
ZCRSVF6  EQU   ZCRSVRTN+20                                              03368000
ZCRSVF5  EQU   ZCRSVRTN+16                                              03369000
ZCRSVF4  EQU   ZCRSVRTN+12                                              03370000
ZCRSVF3  EQU   ZCRSVRTN+8                                               03371000
ZCRSVF2  EQU   ZCRSVRTN+4                                               03372000
ZCRSVF1  EQU   ZCRSVRTN                                                 03373000
ZCRPVZB  EQU   ISTZCRR+52                                               03374000
ZCRZLB   EQU   ISTZCRR+48                                               03375000
ZCRBFPTR EQU   ISTZCRR+44                                               03376000
ZCRCCWA  EQU   ISTZCRR+40                                               03377000
ZCRPSW   EQU   ZCRPARMS+15                                              03378000
ZCRPCHAR EQU   ZCRPARMS+14                                              03379000
ZCRPRES2 EQU   ZCRPCOD2                                                 03380000
ZCRPMFGF EQU   ZCRPCOD2                                                 03381000
ZCRPFHDR EQU   ZCRPCOD2                                                 03382000
ZCRPPG2  EQU   ZCRPCOD2                                                 03383000
ZCRPRES  EQU   ZCRPCOD1                                                 03384000
ZCRPCFTX EQU   ZCRPCOD1                                                 03385000
ZCRPLSBQ EQU   ZCRPLSBF                                                 03386000
ZCRPFSB  EQU   ZCRPCOD1                                                 03387000
ZCRPLNG  EQU   ZCRPCOD1                                                 03388000
ZCRDTODA EQU   ZCRDFRDA                                                 03389000
ZCRMLNG  EQU   ZCRPARMS+8                                               03390000
ZCRTBPTR EQU   ZCRPARMS+4                                               03391000
ZCRCBPTR EQU   ZCRFBPTR                                                 03392000
ZCRCRLCP EQU   ISTZCRR+20                                               03393000
ZCRMDATA EQU   ZCRSCPSW                                                 03394000
ZCRSKIPT EQU   ZCRSCPSW                                                 03395000
ZCRFSBWE EQU   ZCRSCPSW                                                 03396000
ZCRPRCMP EQU   ZCRSCPSW                                                 03397000
ZCRLREQ  EQU   ZCRSCPSW                                                 03398000
ZCRRJLCP EQU   ZCRSCPSW                                                 03399000
ZCRTPINV EQU   ZCRSCPSW                                                 03400000
ZCRTPEX  EQU   ZCRSCPSW                                                 03401000
@NM00024 EQU   ZCRIBPR                                                  03402000
ZCR3270R EQU   ZCRIBPR                                                  03403000
ZCR3270  EQU   ZCRIBPR                                                  03404000
ZCRLCPFD EQU   ZCRIBPR                                                  03405000
ZCRLCPFR EQU   ZCRIBPR                                                  03406000
ZCRRELK  EQU   ZCRIBPR                                                  03407000
ZCRERR   EQU   ZCRIBPR                                                  03408000
ZCRNOBUF EQU   ZCRIBPR                                                  03409000
@NM00023 EQU   ZCRPFLGS                                                 03410000
ZCRQAHED EQU   ZCRPFLGS                                                 03411000
ZCRF1RES EQU   ZCRGENSW                                                 03412000
ZCRBRIS  EQU   ZCRGENSW                                                 03413000
ZCRCLRBD EQU   ZCRGENSW                                                 03414000
ZCREXRES EQU   ZCRGENSW                                                 03415000
ZCRLCSYN EQU   ZCRGENSW                                                 03416000
ZCRRT06  EQU   ZCRGENSW                                                 03417000
ZCRTSW2  EQU   ZCRGENSW                                                 03418000
ZCRTSW1  EQU   ZCRGENSW                                                 03419000
ZCRINLCP EQU   ZCRFLGS3                                                 03420000
ZCRWRPTR EQU   ZCRFLGS3                                                 03421000
ZCRNOFRE EQU   ZCRFLGS3                                                 03422000
ZCREDRIV EQU   ZCRFLGS3                                                 03423000
ZCRDISC  EQU   ZCRFLGS3                                                 03424000
ZCRTPDIS EQU   ZCRFLGS3                                                 03425000
ZCRTPCON EQU   ZCRFLGS3                                                 03426000
ZCRTIC   EQU   ZCRFLGS3                                                 03427000
ZCRCNLXL EQU   ZCRRESET                                                 03428000
ZCRENDAN EQU   ZCRSWFLD                                                 03429000
ZCRENDXL EQU   ZCRSWFLD                                                 03430000
ZCRENDX  EQU   ZCRSWFLD                                                 03431000
ZCROB1   EQU   ZCRNDLCP                                                 03432000
ZCRENDPR EQU   ZCRSWFLD                                                 03433000
ZCREXTYP EQU   ZCRSWFLD                                                 03434000
ZCRSLCP  EQU   ZCRENDSH                                                 03435000
ZCRIF0E3 EQU   ZCRFLGS2                                                 03436000
ZCRIF0E2 EQU   ZCRFLGS2                                                 03437000
ZCROB    EQU   ZCRFLGS2                                                 03438000
ZCRFMSED EQU   ZCRFLGS2                                                 03439000
ZCRSHEDI EQU   ZCRFLGS2                                                 03440000
ZCRLOCAL EQU   ZCRFLGS2                                                 03441000
ZCRFEXIT EQU   ZCRFLGS1                                                 03442000
ZCRUNSOL EQU   ZCRFLGS1                                                 03443000
ZCRENDLP EQU   ZCRFLGS1                                                 03444000
ZCRNRMEX EQU   ZCRFLGS1                                                 03445000
ZCRWAIT  EQU   ZCRFLGS1                                                 03446000
ZCRDEQSW EQU   ZCRFLGS1                                                 03447000
ZCRQUESW EQU   ZCRFLGS1                                                 03448000
ZCREXSW  EQU   ZCRFLGS1                                                 03449000
ZCRFRRA  EQU   ISTZCRR+8                                                03450000
ZCRCHAIN EQU   ISTZCRR+4                                                03451000
ZCRFLAG  EQU   ZCRCRR+3                                                 03452000
ZCRLEN   EQU   ZCRCRR+1                                                 03453000
ZCRID    EQU   ZCRCRR                                                   03454000
LCPFTYPE EQU   LCPRPHA                                                  03455000
LCPRSTQH EQU   LCPLCCW                                                  03456000
LCPCLREP EQU   ISTLCPB+44                                               03457000
LCPUBFSB EQU   LCPFLCCW                                                 03458000
LCPRSV77 EQU   ISTLCPB+39                                               03459000
LCPLCCWC EQU   ISTLCPB+38                                               03460000
LCPRSV78 EQU   LCPFLG1                                                  03461000
LCPTRANS EQU   LCPFLG1                                                  03462000
LCPSTLB  EQU   LCPFLG1                                                  03463000
LCPREDRV EQU   LCPFLG1                                                  03464000
LCPDIRPT EQU   LCPFLG1                                                  03465000
LCPINTER EQU   LCPFLG1                                                  03466000
LCPRESET EQU   LCPFLG1                                                  03467000
LCPSTYPE EQU   ISTLCPB+36                                               03468000
LCPFSNCH EQU   ISTLCPB+34                                               03469000
LCPFOSN  EQU   ISTLCPB+32                                               03470000
LCPTLBAD EQU   ISTLCPB+28                                               03471000
LCPFDB2  EQU   LCPFDBA+1                                                03472000
LCPFDB1  EQU   LCPFDBA                                                  03473000
LCPNXLCW EQU   ISTLCPB+20                                               03474000
LCPDAF   EQU   LCPCID+2                                                 03475000
LCPSAF   EQU   LCPCID                                                   03476000
LCPLCCW1 EQU   ISTLCPB+12                                               03477000
LCPRRCNT EQU   LCPSEQ+1                                                 03478000
LCPRRCCT EQU   LCPSEQ                                                   03479000
LCPFREE  EQU   LCPFLAG2                                                 03480000
LCPDSTAT EQU   LCPFLAG2                                                 03481000
LCPEXRES EQU   LCPFID0                                                  03482000
LCPZRIMM EQU   LCPTLBPI                                                 03483000
LCPRSTRT EQU   LCPFLAG2                                                 03484000
LCPASYN  EQU   LCPFLAG2                                                 03485000
LCPPRFLG EQU   LCPFLAG2                                                 03486000
LCPCHAI2 EQU   LCPCHAIN+1                                               03487000
LCPCHNG  EQU   LCPCHAI1                                                 03488000
LCPZRT0A EQU   LCPMNRCD                                                 03489000
LCPZRTL9 EQU   LCPZRT09                                                 03490000
LCPZRTL8 EQU   LCPZRT08                                                 03491000
LCPZRTL7 EQU   LCPZRT07                                                 03492000
LCPZRTL6 EQU   LCPZRT06                                                 03493000
LCPZRTL5 EQU   LCPZRT05                                                 03494000
LCPZRTL4 EQU   LCPZRT04                                                 03495000
LCPZRTL3 EQU   LCPZRT03                                                 03496000
LCPZRTL2 EQU   LCPZRT02                                                 03497000
LCPZRT01 EQU   LCPFLAGS                                                 03498000
LCPZRT00 EQU   LCPFLAGS                                                 03499000
LCPLNGTH EQU   ISTLCPB+1                                                03500000
LCPTYPE  EQU   ISTLCPB                                                  03501000
LCCWDATA EQU   ISTLCCW+4                                                03502000
LCCWCNT  EQU   ISTLCCW+2                                                03503000
LCCWACI  EQU   LCCWFLAG                                                 03504000
LCCWRFI  EQU   LCCWFLAG                                                 03505000
LCCWPER  EQU   LCCWLSI                                                  03506000
LCCWIDAT EQU   LCCWFLAG                                                 03507000
LCCWNTVC EQU   LCCWFLAG                                                 03508000
LCCWCKPT EQU   LCCWFLAG                                                 03509000
LCCWCC   EQU   LCCWFLAG                                                 03510000
LCCWCD   EQU   LCCWFLAG                                                 03511000
LCCWTYPE EQU   LCCWCTL                                                  03512000
LCCWMODE EQU   LCCWCTL                                                  03513000
LCCWSOP  EQU   LCCWRWOP                                                 03514000
@NM00022 EQU   LCCWRWOP                                                 03515000
LCCWSD   EQU   LCCWOP                                                   03516000
LCCWSI   EQU   LCCWOP                                                   03517000
SRURSV01 EQU   SRULDID+4                                                03518000
SRUPSSN  EQU   SRULDID+2                                                03519000
SRUDFCLV EQU   SRUSPSN                                                  03520000
@NM00021 EQU   SRUTYPE                                                  03521000
SRUPSAC  EQU   SRUTYPE                                                  03522000
SRUSPAC  EQU   SRUTYPE                                                  03523000
SRUQSREQ EQU   ISTSRU                                                   03524000
RHRSVD5  EQU   RH3                                                      03525000
RHRSVD4  EQU   RH3                                                      03526000
RHLOG    EQU   RH3                                                      03527000
RHRSVD3  EQU   RH3                                                      03528000
RHRCDIR  EQU   RH3                                                      03529000
RHCDIR   EQU   RH3                                                      03530000
RHEB     EQU   RH3                                                      03531000
RHBB     EQU   RH3                                                      03532000
RHPACE   EQU   RH2                                                      03533000
RHRSVD2  EQU   RH2                                                      03534000
RHINOP   EQU   RHRSVD1                                                  03535000
RHBUSY   EQU   RHRETRY                                                  03536000
RHEXCEPT EQU   RH2                                                      03537000
RHRRN    EQU   RH2                                                      03538000
RHPE     EQU   RH2                                                      03539000
RHFME    EQU   RH2                                                      03540000
RHCHAIN  EQU   RH1                                                      03541000
RHSENSE  EQU   RH1                                                      03542000
RHFORMAT EQU   RH1                                                      03543000
RHDIRI   EQU   RH1                                                      03544000
RHSCI    EQU   RH1                                                      03545000
RHTYPE   EQU   RH1                                                      03546000
RHQS     EQU   RH1                                                      03547000
RPHNEXPO EQU   ISTRPH+104                                               03548000
RPHSAV16 EQU   RPHWORK+60                                               03549000
RPHSAV15 EQU   RPHWORK+56                                               03550000
RPHSAV14 EQU   RPHWORK+52                                               03551000
RPHSAV13 EQU   RPHWORK+48                                               03552000
RPHSAV12 EQU   RPHWORK+44                                               03553000
RPHSAV11 EQU   RPHWORK+40                                               03554000
RPHSAV10 EQU   RPHWORK+36                                               03555000
RPHSAVE9 EQU   RPHWORK+32                                               03556000
RPHSAVE8 EQU   RPHWORK+28                                               03557000
RPHSAVE7 EQU   RPHWORK+24                                               03558000
RPHSAVE6 EQU   RPHWORK+20                                               03559000
RPHSAVE5 EQU   RPHWORK+16                                               03560000
RPHSAVE4 EQU   RPHWORK+12                                               03561000
RPHSAVE3 EQU   RPHWORK+8                                                03562000
RPHSAVE2 EQU   RPHWORK+4                                                03563000
RPHSHALF EQU   RPHSAVE1+2                                               03564000
RPHSBIT8 EQU   RPHSBITS                                                 03565000
RPHSBIT7 EQU   RPHSBITS                                                 03566000
RPHSBIT6 EQU   RPHSBITS                                                 03567000
RPHSBIT5 EQU   RPHSBITS                                                 03568000
RPHSBIT4 EQU   RPHSBITS                                                 03569000
RPHSBIT3 EQU   RPHSBITS                                                 03570000
RPHSBIT2 EQU   RPHSBITS                                                 03571000
RPHSBIT1 EQU   RPHSBITS                                                 03572000
RPHSBYTE EQU   RPHSAVE1                                                 03573000
RPHPABQP EQU   RPHPABQA+1                                               03574000
RPHPABFG EQU   RPHPABQA                                                 03575000
RPHSRP34 EQU   RPHSRPRM+2                                               03576000
RPHSRP12 EQU   RPHSRPRM                                                 03577000
RPHWEGT  EQU   RPHCSPA                                                  03578000
RPHMAJCB EQU   ISTRPH+21                                                03579000
RPHPABOF EQU   ISTRPH+20                                                03580000
RPHRESUM EQU   RPHRESMA+1                                               03581000
RPHRSV01 EQU   RPHWPFLG                                                 03582000
RPHPURGE EQU   RPHWPFLG                                                 03583000
RPHPT    EQU   RPHWPFLG                                                 03584000
RPHWT    EQU   RPHWPFLG                                                 03585000
RPHRSKEY EQU   RPHWPFLG                                                 03586000
RPHDVTA  EQU   ISTRPH+12                                                03587000
RPHTIK   EQU   RPHTSKID+3                                               03588000
@NM00020 EQU   RPHTSKID                                                 03589000
RPHRPHAP EQU   RPHRPHA+1                                                03590000
@NM00019 EQU   RPHCVFLG                                                 03591000
RPHFRRPH EQU   RPHCVFLG                                                 03592000
RPHOWRPH EQU   RPHCVFLG                                                 03593000
RPHCDRPH EQU   RPHCVFLG                                                 03594000
RPHPSRPH EQU   RPHCVFLG                                                 03595000
RPHVYRPH EQU   RPHGATE                                                  03596000
@NM00018 EQU   RPHFLGB                                                  03597000
RPHRLCRA EQU   RPHFLGB                                                  03598000
RPHNRSAV EQU   RPHFLGB                                                  03599000
RPHPGCMP EQU   RPHFLGB                                                  03600000
RPHFBAPS EQU   RPHFLGB                                                  03601000
RPHBSSP  EQU   RPHFLGB                                                  03602000
RPHLOCK  EQU   RPHFLGB                                                  03603000
RPHFNFLG EQU   RPHFSTLC                                                 03604000
RPHMLTCP EQU   RPHFLAGS                                                 03605000
RPHSMCLR EQU   RPHFLAGS                                                 03606000
RPHSMTYP EQU   RPHFLAGS                                                 03607000
RPHSMQ   EQU   RPHFLAGS                                                 03608000
RPHAUTEX EQU   RPHAPTYP                                                 03609000
RPHSPGIN EQU   RPHFLAGS                                                 03610000
RPHOGIND EQU   RPHFLAGS                                                 03611000
RPHLNGTH EQU   RPHCNTL+1                                                03612000
RPHTYPE  EQU   RPHCNTL                                                  03613000
ZLBZBFSC EQU   ISTZLBVT+88                                              03614000
ZLBZIFVB EQU   ISTZLBVT+84                                              03615000
ZLBZIFUB EQU   ISTZLBVT+80                                              03616000
ZLBZIFSB EQU   ISTZLBVT+76                                              03617000
ZLBRSV22 EQU   ISTZLBVT+72                                              03618000
ZLBZBFID EQU   ISTZLBVT+68                                              03619000
ZLBZBFX0 EQU   ISTZLBVT+64                                              03620000
ZLBRSV02 EQU   ISTZLBVT+60                                              03621000
ZLBRSV21 EQU   ISTZLBVT+56                                              03622000
ZLBZBFJB EQU   ISTZLBVT+52                                              03623000
ZLBZBFIB EQU   ISTZLBVT+48                                              03624000
ZLBZBFHB EQU   ISTZLBVT+44                                              03625000
ZLBZBFGB EQU   ISTZLBVT+40                                              03626000
ZLBZBFFB EQU   ISTZLBVT+36                                              03627000
ZLBZBFEB EQU   ISTZLBVT+32                                              03628000
ZLBZBFDB EQU   ISTZLBVT+28                                              03629000
ZLBZBFCB EQU   ISTZLBVT+24                                              03630000
ZLBZBFBB EQU   ISTZLBVT+20                                              03631000
ZLBZBFAB EQU   ISTZLBVT+16                                              03632000
ZLBZBFNB EQU   ISTZLBVT+12                                              03633000
ZLBZCFAI EQU   ISTZLBVT+8                                               03634000
ZLBZBF0B EQU   ISTZLBVT+4                                               03635000
ZLBZAF0B EQU   ISTZLBVT                                                 03636000
ZFSZWRD4 EQU   ISTZFSVT+36                                              03637000
ZFSZWRD3 EQU   ISTZFSVT+32                                              03638000
ZFSZEFCB EQU   ISTZFSVT+28                                              03639000
ZFSZFFEB EQU   ISTZFSVT+24                                              03640000
ZFSZDFJ0 EQU   ISTZFSVT+20                                              03641000
ZFSZFFFB EQU   ISTZFSVT+16                                              03642000
ZFSZFFDB EQU   ISTZFSVT+12                                              03643000
ZFSZFFCB EQU   ISTZFSVT+8                                               03644000
ZFSZEMAB EQU   ZFSZEAAB                                                 03645000
ZFSZEMBB EQU   ZFSZEABB                                                 03646000
ZPSZDFPR EQU   ISTZPSVT+76                                              03647000
ZPSZDFXR EQU   ISTZPSVT+72                                              03648000
ZPSZWRD5 EQU   ISTZPSVT+68                                              03649000
ZPSZWRD4 EQU   ISTZPSVT+64                                              03650000
ZPSZDFMB EQU   ISTZPSVT+60                                              03651000
ZPSZDFMF EQU   ISTZPSVT+56                                              03652000
ZPSZDFNB EQU   ISTZPSVT+52                                              03653000
@NM00017 EQU   ISTZPSVT+48                                              03654000
ZPSZDFF0 EQU   ISTZPSVT+44                                              03655000
ZPSZTRTT EQU   ISTZPSVT+40                                              03656000
ZPSZBFOB EQU   ISTZPSVT+36                                              03657000
ZPSZBFMB EQU   ISTZPSVT+32                                              03658000
ZPSZBFZ0 EQU   ISTZPSVT+28                                              03659000
ZPSZBFY0 EQU   ISTZPSVT+24                                              03660000
ZPSZDFI0 EQU   ISTZPSVT+20                                              03661000
ZPSZDFH0 EQU   ISTZPSVT+12                                              03662000
ZPSZDFD0 EQU   ISTZPSVT+8                                               03663000
ZPSZDFC0 EQU   ISTZPSVT+4                                               03664000
ZRCZDFWB EQU   ISTZRCVT+120                                             03665000
ZRCZIFJB EQU   ISTZRCVT+116                                             03666000
ZRCZKFCB EQU   ISTZRCVT+112                                             03667000
ZRCZKFBB EQU   ISTZRCVT+108                                             03668000
ZRCZIFTB EQU   ISTZRCVT+104                                             03669000
ZRCZIFSB EQU   ISTZRCVT+100                                             03670000
ZRCZIFX0 EQU   ISTZRCVT+96                                              03671000
ZRCZIFIB EQU   ISTZRCVT+92                                              03672000
ZRCZIFAB EQU   ISTZRCVT+88                                              03673000
ZRCZIFGB EQU   ISTZRCVT+84                                              03674000
ZRCZIFHB EQU   ISTZRCVT+80                                              03675000
ZRCZIFBB EQU   ISTZRCVT+76                                              03676000
ZRCZIFCB EQU   ISTZRCVT+72                                              03677000
ZRCZIFDB EQU   ISTZRCVT+68                                              03678000
ZRCZIFEB EQU   ISTZRCVT+64                                              03679000
ZRCRSV01 EQU   ISTZRCVT+60                                              03680000
ZRCZGFBB EQU   ISTZRCVT+56                                              03681000
ZRCZIFQB EQU   ISTZRCVT+52                                              03682000
ZRCZIFNB EQU   ISTZRCVT+48                                              03683000
ZRCZIFOB EQU   ISTZRCVT+44                                              03684000
ZRCZIFMB EQU   ISTZRCVT+40                                              03685000
ZRCZIFKB EQU   ISTZRCVT+36                                              03686000
ZRCZIFLB EQU   ISTZRCVT+32                                              03687000
@NM00016 EQU   ISTZRCVT+28                                              03688000
@NM00015 EQU   ISTZRCVT+24                                              03689000
@NM00014 EQU   ISTZRCVT+20                                              03690000
@NM00013 EQU   ISTZRCVT+16                                              03691000
@NM00012 EQU   ISTZRCVT+12                                              03692000
ZRCZJF0B EQU   ISTZRCVT+8                                               03693000
ZRCZIF0B EQU   ISTZRCVT                                                 03694000
CVTLEVL  EQU   CVTRELNO+2                                               03695000
CVTNUMB  EQU   CVTRELNO                                                 03696000
CVTMDL   EQU   CVTFIX+250                                               03697000
@NM00011 EQU   CVTFIX+248                                               03698000
@NM00010 EQU   CVTFIX                                                   03699000
CVTRV482 EQU   CVTXTNT2+128                                             03700000
CVTRV481 EQU   CVTXTNT2+124                                             03701000
CVTRV480 EQU   CVTXTNT2+120                                             03702000
CVTRV479 EQU   CVTXTNT2+118                                             03703000
CVTRV478 EQU   CVTXTNT2+117                                             03704000
CVTRV477 EQU   CVTXTNT2+116                                             03705000
CVTRV476 EQU   CVTXTNT2+115                                             03706000
CVTRV475 EQU   CVTXTNT2+114                                             03707000
CVTRV474 EQU   CVTRV466                                                 03708000
CVTRV473 EQU   CVTRV466                                                 03709000
CVTRV472 EQU   CVTRV466                                                 03710000
CVTRV471 EQU   CVTRV466                                                 03711000
CVTRV470 EQU   CVTRV466                                                 03712000
CVTRV469 EQU   CVTRV466                                                 03713000
CVTRV468 EQU   CVTRV466                                                 03714000
CVTRV467 EQU   CVTRV466                                                 03715000
CVTRV465 EQU   CVTRV457                                                 03716000
CVTRV464 EQU   CVTRV457                                                 03717000
CVTRV463 EQU   CVTRV457                                                 03718000
CVTRV462 EQU   CVTRV457                                                 03719000
CVTRV461 EQU   CVTRV457                                                 03720000
CVTRV460 EQU   CVTRV457                                                 03721000
CVTRV459 EQU   CVTRV457                                                 03722000
CVTRV458 EQU   CVTRV457                                                 03723000
CVTRV456 EQU   CVTXTNT2+108                                             03724000
CVTRV455 EQU   CVTXTNT2+104                                             03725000
CVTRV454 EQU   CVTXTNT2+100                                             03726000
CVTRV453 EQU   CVTXTNT2+96                                              03727000
CVTRV452 EQU   CVTXTNT2+94                                              03728000
CVTRV451 EQU   CVTXTNT2+92                                              03729000
CVTRV450 EQU   CVTXTNT2+90                                              03730000
CVTRV449 EQU   CVTXTNT2+88                                              03731000
CVTRV448 EQU   CVTXTNT2+87                                              03732000
CVTRV447 EQU   CVTXTNT2+86                                              03733000
CVTRV446 EQU   CVTRV438                                                 03734000
CVTRV445 EQU   CVTRV438                                                 03735000
CVTRV444 EQU   CVTRV438                                                 03736000
CVTRV443 EQU   CVTRV438                                                 03737000
CVTRV442 EQU   CVTRV438                                                 03738000
CVTRV441 EQU   CVTRV438                                                 03739000
CVTRV440 EQU   CVTRV438                                                 03740000
CVTRV439 EQU   CVTRV438                                                 03741000
CVTRV437 EQU   CVTRV429                                                 03742000
CVTRV436 EQU   CVTRV429                                                 03743000
CVTRV435 EQU   CVTRV429                                                 03744000
CVTRV434 EQU   CVTRV429                                                 03745000
CVTRV433 EQU   CVTRV429                                                 03746000
CVTRV432 EQU   CVTRV429                                                 03747000
CVTRV431 EQU   CVTRV429                                                 03748000
CVTRV430 EQU   CVTRV429                                                 03749000
CVTRV428 EQU   CVTXTNT2+80                                              03750000
CVTRV427 EQU   CVTXTNT2+76                                              03751000
CVTRV426 EQU   CVTXTNT2+72                                              03752000
CVTRV425 EQU   CVTXTNT2+68                                              03753000
CVTATACT EQU   CVTATCVT                                                 03754000
CVTRV423 EQU   CVTXTNT2+62                                              03755000
CVTRV422 EQU   CVTXTNT2+60                                              03756000
CVTRV421 EQU   CVTXTNT2+58                                              03757000
CVTRV420 EQU   CVTXTNT2+56                                              03758000
CVTRV419 EQU   CVTXTNT2+55                                              03759000
CVTRV418 EQU   CVTXTNT2+54                                              03760000
CVTRV417 EQU   CVTRV409                                                 03761000
CVTRV416 EQU   CVTRV409                                                 03762000
CVTRV415 EQU   CVTRV409                                                 03763000
CVTRV414 EQU   CVTRV409                                                 03764000
CVTRV413 EQU   CVTRV409                                                 03765000
CVTRV412 EQU   CVTRV409                                                 03766000
CVTRV411 EQU   CVTRV409                                                 03767000
CVTRV410 EQU   CVTRV409                                                 03768000
CVTRV408 EQU   CVTRV400                                                 03769000
CVTRV407 EQU   CVTRV400                                                 03770000
CVTRV406 EQU   CVTRV400                                                 03771000
CVTRV405 EQU   CVTRV400                                                 03772000
CVTRV404 EQU   CVTRV400                                                 03773000
CVTRV403 EQU   CVTRV400                                                 03774000
CVTRV402 EQU   CVTRV400                                                 03775000
CVTRV401 EQU   CVTRV400                                                 03776000
CVTICB   EQU   CVTXTNT2+48                                              03777000
CVTSKTA  EQU   CVTXTNT2+44                                              03778000
CVTSHSB  EQU   CVTSHS                                                   03779000
CVTRSV98 EQU   CVTXTNT2+36                                              03780000
CVTRSV97 EQU   CVTXTNT2+34                                              03781000
CVTRSV96 EQU   CVTXTNT2+32                                              03782000
CVTOLTEP EQU   CVTXTNT2+28                                              03783000
CVTQIDA  EQU   CVTQID+1                                                 03784000
CVTRSV95 EQU   CVTQID                                                   03785000
CVTRSV94 EQU   CVTXTNT2+20                                              03786000
CVTRSV93 EQU   CVTXTNT2+16                                              03787000
CVTRSV92 EQU   CVTXTNT2+12                                              03788000
CVTDEBVR EQU   CVTXTNT2+8                                               03789000
CVTRSV91 EQU   CVTXTNT2+6                                               03790000
CVTRSV9H EQU   CVTFLGBT                                                 03791000
CVTRSV9G EQU   CVTFLGBT                                                 03792000
CVTRSV9F EQU   CVTFLGBT                                                 03793000
CVTRSV9E EQU   CVTFLGBT                                                 03794000
CVTRSV9D EQU   CVTFLGBT                                                 03795000
CVTRSV9C EQU   CVTFLGBT                                                 03796000
CVTVME   EQU   CVTFLGBT                                                 03797000
CVTNPE   EQU   CVTFLGBT                                                 03798000
CVTNUCLS EQU   CVTXTNT2+4                                               03799000
CVTDSSVA EQU   CVTDSSV+1                                                03800000
CVTRSV89 EQU   CVTDSSV                                                  03801000
CVTRSV88 EQU   CVTXTNT1+8                                               03802000
CVTRSV87 EQU   CVTXTNT1+4                                               03803000
CVTFACHN EQU   CVTXTNT1                                                 03804000
CVTRV488 EQU   CVTMAP+412                                               03805000
CVTRV487 EQU   CVTMAP+408                                               03806000
CVTRV486 EQU   CVTMAP+404                                               03807000
CVTRV485 EQU   CVTMAP+400                                               03808000
CVTACTAP EQU   CVTMAP+396                                               03809000
CVTAUTH  EQU   CVTMAP+392                                               03810000
CVTATMCA EQU   CVTATMCT+1                                               03811000
CVTATMST EQU   CVTATMCT                                                 03812000
CVTRSV61 EQU   CVTMAP+384                                               03813000
CVTVOLT1 EQU   CVTVOLM1+1                                               03814000
CVTVOLI1 EQU   CVTVOLF1                                                 03815000
CVTSTOA  EQU   CVTMAP+376                                               03816000
CVTRSV58 EQU   CVTMAP+374                                               03817000
CVTRSV57 EQU   CVTMAP+372                                               03818000
CVTDDCE  EQU   CVTMAP+368                                               03819000
CVTPNWFR EQU   CVTMAP+364                                               03820000
CVTSMF   EQU   CVTMAP+360                                               03821000
CVTSULK  EQU   CVTMAP+358                                               03822000
CVTSLKO  EQU   CVTSYSK                                                  03823000
CVTSLKP  EQU   CVTSYSK                                                  03824000
CVTSLKQ  EQU   CVTSYSK                                                  03825000
CVTSLKR  EQU   CVTSYSK                                                  03826000
CVTRSV56 EQU   CVTSYSK                                                  03827000
CVTRSV55 EQU   CVTSYSK                                                  03828000
CVTRSV54 EQU   CVTSYSK                                                  03829000
CVTRSV53 EQU   CVTSYSK                                                  03830000
CVTRSV52 EQU   CVTA1F1                                                  03831000
CVTRSV51 EQU   CVTA1F1                                                  03832000
CVTRSV50 EQU   CVTA1F1                                                  03833000
CVTRSV49 EQU   CVTA1F1                                                  03834000
CVTRSV48 EQU   CVTA1F1                                                  03835000
CVTRSV47 EQU   CVTA1F1                                                  03836000
CVTSRSW  EQU   CVTA1F1                                                  03837000
CVTPFSW  EQU   CVTA1F1                                                  03838000
CVTPCVT  EQU   CVTMAP+352                                               03839000
CVTRSV46 EQU   CVTMAP+344                                               03840000
CVTRSV45 EQU   CVTMAP+340                                               03841000
CVTRSV44 EQU   CVTMAP+338                                               03842000
CVTRSV43 EQU   CVTMAP+336                                               03843000
CVTHJESA EQU   CVTHJES+1                                                03844000
CVTRSV42 EQU   CVTHJES                                                  03845000
CVTEXT2A EQU   CVTEXT2+1                                                03846000
CVTRSV41 EQU   CVTEXT2                                                  03847000
CVTAPFA  EQU   CVTAPF+1                                                 03848000
CVTRSV40 EQU   CVTAPF                                                   03849000
CVTRV518 EQU   CVTINTLA                                                 03850000
CVTRV517 EQU   CVTERPV                                                  03851000
CVTEORM  EQU   CVTMAP+312                                               03852000
CVTMCHPR EQU   CVTMAP+308                                               03853000
CVTTZ    EQU   CVTMAP+304                                               03854000
CVTJEPS  EQU   CVTMAP+300                                               03855000
CVTJESCT EQU   CVTMAP+296                                               03856000
CVTMODE  EQU   CVTMAP+292                                               03857000
CVTPTRV  EQU   CVTMAP+288                                               03858000
CVTREAL  EQU   CVTMAP+284                                               03859000
CVTRSV39 EQU   CVTMAP+280                                               03860000
CVTRSV38 EQU   CVTMAP+276                                               03861000
CVTDMSRA EQU   CVTDMSR+1                                                03862000
CVTRV634 EQU   CVTDMSRF                                                 03863000
CVTRV633 EQU   CVTDMSRF                                                 03864000
CVTRV632 EQU   CVTDMSRF                                                 03865000
CVTRV631 EQU   CVTDMSRF                                                 03866000
CVTRV630 EQU   CVTDMSRF                                                 03867000
CVTRV629 EQU   CVTDMSRF                                                 03868000
CVTUDUMP EQU   CVTDMSRF                                                 03869000
CVTSDUMP EQU   CVTDMSRF                                                 03870000
CVTQMSGA EQU   CVTQMSG+1                                                03871000
CVTRSV36 EQU   CVTQMSG                                                  03872000
CVTAMFF  EQU   CVTMAP+264                                               03873000
CVTPURGA EQU   CVTPURG+1                                                03874000
CVTRSV35 EQU   CVTPURG                                                  03875000
CVTCBSP  EQU   CVTMAP+256                                               03876000
CVTATERA EQU   CVTATER+1                                                03877000
CVTSYST  EQU   CVTATER                                                  03878000
CVTVOLT2 EQU   CVTTAT                                                   03879000
CVTVOLI2 EQU   CVTVOLF2                                                 03880000
CVTAQAVB EQU   CVTAQAVT+1                                               03881000
CVTRSV34 EQU   CVTTCMFG                                                 03882000
CVTRSV33 EQU   CVTTCMFG                                                 03883000
CVTRSV32 EQU   CVTTCMFG                                                 03884000
CVTRSV31 EQU   CVTTCMFG                                                 03885000
CVTRSV30 EQU   CVTTCMFG                                                 03886000
CVTRSV29 EQU   CVTTCMFG                                                 03887000
CVTRSV28 EQU   CVTTCMFG                                                 03888000
CVTTCRDY EQU   CVTTCMFG                                                 03889000
CVTGTFA  EQU   CVTGTF+1                                                 03890000
CVTRSV27 EQU   CVTGTFST                                                 03891000
CVTRNIO  EQU   CVTGTFST                                                 03892000
CVTUSR   EQU   CVTGTFST                                                 03893000
CVTRV318 EQU   CVTFORM                                                  03894000
CVTRV317 EQU   CVTTMODE                                                 03895000
CVTRV316 EQU   CVTSTATE                                                 03896000
CVTRV315 EQU   CVTGTFS                                                  03897000
CVTGTFAV EQU   CVTGTFS                                                  03898000
CVT0SCR1 EQU   CVTMAP+232                                               03899000
CVTRV515 EQU   CVTMAP+228                                               03900000
CVTRMS   EQU   CVTMAP+224                                               03901000
CVTPATCH EQU   CVTMAP+220                                               03902000
CVTTSCE  EQU   CVTMAP+216                                               03903000
CVTLNKSC EQU   CVTMAP+214                                               03904000
CVTQABST EQU   CVTMAP+212                                               03905000
CVTMDLDS EQU   CVTMAP+208                                               03906000
CVTUSER  EQU   CVTMAP+204                                               03907000
CVTABEND EQU   CVTMAP+200                                               03908000
CVTSMCA  EQU   CVTMAP+196                                               03909000
CVTRSV18 EQU   CVTMAP+192                                               03910000
CVTQLPAQ EQU   CVTMAP+188                                               03911000
CVTQCDSR EQU   CVTMAP+184                                               03912000
CVTRSV17 EQU   CVTOPTB                                                  03913000
CVTRSV16 EQU   CVTOPTB                                                  03914000
CVTFP    EQU   CVTOPTB                                                  03915000
CVTAPTHR EQU   CVTOPTB                                                  03916000
CVTNLOG  EQU   CVTOPTB                                                  03917000
CVTTOD   EQU   CVTOPTB                                                  03918000
CVTCTIMS EQU   CVTOPTB                                                  03919000
CVTPROT  EQU   CVTOPTB                                                  03920000
CVTXPFP  EQU   CVTOPTA                                                  03921000
CVTASCII EQU   CVTOPTA                                                  03922000
CVTRSV13 EQU   CVTOPTA                                                  03923000
CVTRSV12 EQU   CVTOPTA                                                  03924000
CVTNIP   EQU   CVTOPTA                                                  03925000
CVTDDR   EQU   CVTOPTA                                                  03926000
CVTAPR   EQU   CVTOPTA                                                  03927000
CVTCCH   EQU   CVTOPTA                                                  03928000
CVTSNCTR EQU   CVTMAP+180                                               03929000
CVTQMWR  EQU   CVTMAP+176                                               03930000
CVTQOCR  EQU   CVTMAP+172                                               03931000
CVT1EF00 EQU   CVTMAP+168                                               03932000
CVTMZ00  EQU   CVTMAP+164                                               03933000
CVTHEAD  EQU   CVTMAP+160                                               03934000
CVTRSV11 EQU   CVTMAP+156                                               03935000
CVT0PT01 EQU   CVTMAP+152                                               03936000
CVTMSER  EQU   CVTMAP+148                                               03937000
CVTRV516 EQU   CVTIERLC                                                 03938000
CVTILCH  EQU   CVTMAP+140                                               03939000
CVT0DS   EQU   CVTMAP+136                                               03940000
CVTFBOSV EQU   CVTMAP+132                                               03941000
CVTNUCB  EQU   CVTMAP+128                                               03942000
CVTIXAVL EQU   CVTMAP+124                                               03943000
CVTIOQET EQU   CVTMAP+120                                               03944000
CVTDCBA  EQU   CVTMAP+117                                               03945000
CVTMVS2  EQU   CVTDCB                                                   03946000
CVT6DAT  EQU   CVTDCB                                                   03947000
CVT4MPS  EQU   CVTDCB                                                   03948000
CVTRSV09 EQU   CVTDCB                                                   03949000
CVT4MS1  EQU   CVTDCB                                                   03950000
CVT2SPS  EQU   CVTDCB                                                   03951000
CVT1SSS  EQU   CVTDCB                                                   03952000
CVTRSV08 EQU   CVTDCB                                                   03953000
CVTSTB   EQU   CVTMAP+112                                               03954000
CVTQTD00 EQU   CVTMAP+108                                               03955000
CVTQTE00 EQU   CVTMAP+104                                               03956000
CVTCUCB  EQU   CVTMAP+100                                               03957000
CVTSJQ   EQU   CVTMAP+96                                                03958000
CVTPBLDL EQU   CVTMAP+92                                                03959000
CVTTPC   EQU   CVTMAP+88                                                03960000
CVTSVDCB EQU   CVTMAP+84                                                03961000
CVTBRET  EQU   CVTMAP+82                                                03962000
CVTEXIT  EQU   CVTMAP+80                                                03963000
CVT0FN00 EQU   CVTMAP+76                                                03964000
CVTDARA  EQU   CVTDAR+1                                                 03965000
CVTRSV07 EQU   CVTFLGS1                                                 03966000
CVTRSV06 EQU   CVTFLGS1                                                 03967000
CVTRSV05 EQU   CVTFLGS1                                                 03968000
CVTRSV04 EQU   CVTFLGS1                                                 03969000
CVTRSV03 EQU   CVTFLGS1                                                 03970000
CVTRSV02 EQU   CVTFLGS1                                                 03971000
CVTRSV01 EQU   CVTFLGS1                                                 03972000
CVTDMPLK EQU   CVTFLGS1                                                 03973000
CVTXITP  EQU   CVTMAP+68                                                03974000
CVTZDTAB EQU   CVTMAP+64                                                03975000
CVTMSLT  EQU   CVTMAP+60                                                03976000
CVTDATE  EQU   CVTMAP+56                                                03977000
CVTBTERM EQU   CVTMAP+52                                                03978000
CVTSYSAD EQU   CVTMAP+48                                                03979000
CVTXTLER EQU   CVTMAP+44                                                03980000
CVTILK2  EQU   CVTMAP+40                                                03981000
CVTILK1  EQU   CVTMAP+36                                                03982000
CVTPRLTV EQU   CVTMAP+32                                                03983000
CVTPCNVT EQU   CVTMAP+28                                                03984000
CVT0VL00 EQU   CVTMAP+24                                                03985000
CVTXAPG  EQU   CVTMAP+20                                                03986000
CVTBUF   EQU   CVTMAP+16                                                03987000
CVTJOB   EQU   CVTMAP+12                                                03988000
CVTLINK  EQU   CVTMAP+8                                                 03989000
CVT0EF00 EQU   CVTMAP+4                                                 03990000
CVTTCBP  EQU   CVTMAP                                                   03991000
CVT      EQU   CVTMAP                                                   03992000
@NM00009 EQU   SRBSECT+40                                               03993000
@NM00008 EQU   SRBSECT+38                                               03994000
SRBPRIOR EQU   SRBSECT+37                                               03995000
SRBPKF   EQU   SRBSECT+36                                               03996000
SRBSAVE  EQU   SRBSECT+32                                               03997000
SRBPARM  EQU   SRBSECT+28                                               03998000
SRBRMTR  EQU   SRBSECT+24                                               03999000
SRBEP    EQU   SRBSECT+20                                               04000000
SRBPTCB  EQU   SRBFLC+4                                                 04001000
SRBPASID EQU   SRBFLC+2                                                 04002000
SRBCPAFF EQU   SRBFLC                                                   04003000
SRBASCB  EQU   SRBSECT+8                                                04004000
SRBFLNK  EQU   SRBSECT+4                                                04005000
SRBID    EQU   SRBSECT                                                  04006000
IOSEND   EQU   IOSB+108                                                 04007000
IOSSKR   EQU   IOSEEKA+7                                                04008000
IOSSKH2  EQU   IOSSKHH+1                                                04009000
IOSSKH1  EQU   IOSSKHH                                                  04010000
IOSSKCC  EQU   IOSCCHH                                                  04011000
IOSSKBB  EQU   IOSEEKA+1                                                04012000
IOSSKM   EQU   IOSEEKA                                                  04013000
IOSEEK   EQU   IOSB+92                                                  04014000
IOSMDM   EQU   IOSB+91                                                  04015000
IOSMDB   EQU   IOSB+90                                                  04016000
IOSCKEY7 EQU   IOSCKEY                                                  04017000
IOSCKEY6 EQU   IOSCKEY                                                  04018000
IOSCKEY5 EQU   IOSCKEY                                                  04019000
IOSCKEY4 EQU   IOSCKEY                                                  04020000
@NM00004 EQU   IOSCKEY                                                  04021000
IOSFMSK  EQU   IOSB+88                                                  04022000
IOSCUDEV EQU   IOSPATH+1                                                04023000
@NM00003 EQU   IOSCHN                                                   04024000
IOSPATH3 EQU   IOSCHN                                                   04025000
IOSPATH2 EQU   IOSCHN                                                   04026000
IOSEXP   EQU   IOSCHN                                                   04027000
IOSGDP   EQU   IOSCHN                                                   04028000
IOSAFF   EQU   IOSB+85                                                  04029000
IOSRSS1B EQU   IOSB+84                                                  04030000
IOSDSID  EQU   IOSB+80                                                  04031000
IOSVST   EQU   IOSB+76                                                  04032000
IOSRST   EQU   IOSB+72                                                  04033000
IOSDIE   EQU   IOSB+68                                                  04034000
IOSABN   EQU   IOSB+64                                                  04035000
IOSNRM   EQU   IOSB+60                                                  04036000
IOSPCI   EQU   IOSB+56                                                  04037000
IOSERP   EQU   IOSB+52                                                  04038000
IOSPCHN  EQU   IOSB+48                                                  04039000
IOSSNS   EQU   IOSB+42                                                  04040000
IOSAPMSK EQU   IOSB+40                                                  04041000
IOSRES4A EQU   IOSB+36                                                  04042000
IOSUSE   EQU   IOSB+32                                                  04043000
IOSSRB   EQU   IOSB+28                                                  04044000
IOSCSWRC EQU   IOSCSW+5                                                 04045000
IOSTSB   EQU   IOSTATUS+1                                               04046000
IOSTSA   EQU   IOSTATUS                                                 04047000
IOSCSWCA EQU   IOSCSW                                                   04048000
IOSCC    EQU   @NM00002                                                 04049000
IOSUCB   EQU   IOSB+16                                                  04050000
IOSOPT2X EQU   IOSOPT2                                                  04051000
IOSHTP   EQU   IOSOPT2                                                  04052000
IOSRELSE EQU   IOSOPT                                                   04053000
IOSAPR   EQU   IOSOPT                                                   04054000
IOSTSLL  EQU   IOSOPT                                                   04055000
IOSNERP  EQU   IOSOPT                                                   04056000
IOSPSLL  EQU   IOSOPT                                                   04057000
IOSQISCE EQU   IOSOPT                                                   04058000
IOSDEP   EQU   IOSOPT                                                   04059000
IOSBYP   EQU   IOSOPT                                                   04060000
IOSCOD   EQU   IOSB+13                                                  04061000
IOSPKY7  EQU   IOSPKEY                                                  04062000
IOSPGDPX EQU   IOSPKEY                                                  04063000
IOSIDR   EQU   IOSPKEY                                                  04064000
IOSLCL   EQU   IOSPKEY                                                  04065000
@NM00001 EQU   IOSPKEY                                                  04066000
IOSPGAD  EQU   IOSB+8                                                   04067000
IOSASID  EQU   IOSB+6                                                   04068000
IOSPRLVL EQU   IOSB+5                                                   04069000
IOSDVRID EQU   IOSB+4                                                   04070000
IOSPROC  EQU   IOSB+3                                                   04071000
IOSFLC7  EQU   IOSFLC                                                   04072000
IOSFLC6  EQU   IOSFLC                                                   04073000
IOSRWAIT EQU   IOSFLC                                                   04074000
IOSTP    EQU   IOSFLC                                                   04075000
IOSCC3WE EQU   IOSFLC                                                   04076000
IOSVERIF EQU   IOSDVALT                                                 04077000
IOSDVMNT EQU   IOSFLC                                                   04078000
IOSLOG   EQU   IOSFLB                                                   04079000
IOSBDCST EQU   IOSFLB                                                   04080000
IOSMSG   EQU   IOSFLB                                                   04081000
IOSFLB4  EQU   IOSFLB                                                   04082000
IOSFLB3  EQU   IOSFLB                                                   04083000
IOSFLB2  EQU   IOSFLB                                                   04084000
IOSSDR   EQU   IOSFLB                                                   04085000
IOSDIESE EQU   IOSFLB                                                   04086000
IOSIOSB  EQU   IOSFLA                                                   04087000
IOSDOM   EQU   IOSFLA                                                   04088000
IOSEX    EQU   IOSFLA                                                   04089000
IOSSMDB  EQU   IOSFLA                                                   04090000
IOSSMDA  EQU   IOSFLA                                                   04091000
IOSERR   EQU   IOSFLA                                                   04092000
IOSCCHN  EQU   IOSACHN                                                  04093000
IOSDCHN  EQU   IOSACHN                                                  04094000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04095000
@RC00660 EQU   @RC00659                                                 04096000
WWCFAIL# EQU   @RC00767                                                 04097000
@ENDDATA EQU   *                                                        04098000
         END   ISTZIFOA,(C'PLS2031',0603,78188)                         04099000
