         TITLE 'ISTZBFSC/ASC-VS1/MSC-VS2-SESSION CONTROL OUTBOUND      *00001000
                        '                                               00002000
ISTZBFSC CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZBFSC  78.052'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
*                                                                  0508 00011000
*/********************************************************************/ 00012000
*/*                                                                  */ 00013000
*/* SECTION-                                                         */ 00014000
*/*      MAINLINE                                                    */ 00015000
*/*                                                                  */ 00016000
*/* FUNCTION-                                                        */ 00017000
*/*      SESSION CONTROL OUTBOUND PROCESSOR.                         */ 00018000
*/*                                                                  */ 00019000
*/*      THIS ROUTINE HANDLES CONTROL ROUTING FOR LCCWS AND          */ 00020000
*/*      OUTBOUND FSBS.                                              */ 00021000
*/*                                                                  */ 00022000
*/*      THE FOLLOWING LCCW OPERATION CODES ARE HANDLED:             */ 00023000
*/*            SEND                                                  */ 00024000
*/*            CLEAR (,UNBIND (,NOTIFY))                             */ 00025000
*/*            NOTIFY                                                */ 00026000
*/*                                                                  */ 00027000
*/*      THIS ROUTINE ALSO HANDLES CONTROL ROUTING FOR A             */ 00028000
*/*      CLEAR OR SESSION TERMINATION FSB.                           */ 00029000
*/*                                                                  */ 00030000
*/********************************************************************/ 00031000
*/* TPZSAVE (7,12,14) AC(BCSC)BASE                                   */ 00032000
*                                                                  0508 00033000
*   DO;                                                            0508 00034000
*     DCL                                                          0509 00035000
*       GPR01F FIXED(31) REG(01);                                  0509 00036000
*     DCL                                                          0510 00037000
*       GPR01P PTR(31) REG(01);                                    0510 00038000
*     DCL                                                          0511 00039000
*       GPR12F FIXED(31) REG(12);                                  0511 00040000
*     DCL                                                          0512 00041000
*       GPR12P PTR(31) REG(12);                                    0512 00042000
*     DCL                                                          0513 00043000
*       GPR13F FIXED(31) REG(13);                                  0513 00044000
*     DCL                                                          0514 00045000
*       GPR13P PTR(31) REG(13);                                    0514 00046000
*     DCL                                                          0515 00047000
*       GPR14F FIXED(31) REG(14);                                  0515 00048000
*     DCL                                                          0516 00049000
*       GPR14P PTR(31) REG(14);                                    0516 00050000
*     RFY                                                          0517 00051000
*      (GPR01P,                                                    0517 00052000
*       GPR12P,                                                    0517 00053000
*       GPR13P,                                                    0517 00054000
*       GPR14P) RSTD;                                              0517 00055000
*     GEN(PRINT OFF);                                              0518 00056000
*                                                                  0518 00057000
         PRINT OFF                                                      00058000
*/* ATBUILD (ISTZSAVE)                                               */ 00059000
*/* END OF ATBUILD                                                   */ 00060000
*                                                                  0519 00061000
*     GEN(PRINT ON);                                               0519 00062000
         PRINT ON                                                       00063000
*     RFY                                                          0520 00064000
*       ISTZSAVE BASED(GPR13P);                                    0520 00065000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0521 00066000
         STM   7,12,ZSAZSVVR+0(13)                                      00067000
*     GEN SETS(GPR12P);                                            0522 00068000
         BALR  GPR12P,0                                                 00069000
@TSTART  DS    0H                                                       00070000
         USING @TSTART,GPR12P                                           00071000
*     GEN(PRINT OFF);                                              0523 00072000
*                                                                  0523 00073000
         PRINT OFF                                                      00074000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00075000
*/* END OF ATBUILD                                                   */ 00076000
*                                                                  0524 00077000
*     GEN(PRINT ON);                                               0524 00078000
         PRINT ON                                                       00079000
*     GPR01P->RPHCRR->CRACRR->ZCREBCSC='1'B;                       0525 00080000
         L     @15,RPHCRR(,GPR01P)                                 0525 00081000
         L     @15,CRACRR(,@15)                                    0525 00082000
         OI    ZCREBCSC(@15),B'00000001'                           0525 00083000
*     ZSAZACTV='1'B;                                               0526 00084000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0526 00085000
*     ZSAZTRAC='BCSC';                                             0527 00086000
         MVC   ZSAZTRAC(4,GPR13P),@CC04064                         0527 00087000
*     ZSAZSVRR=GPR14P;                                             0528 00088000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0528 00089000
*     GPR13P=ZSAZSVFC;                                             0529 00090000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0529 00091000
*     RFY                                                          0530 00092000
*      (GPR01P) UNRSTD;                                            0530 00093000
*     RFY                                                          0531 00094000
*      (GPR14P) UNRSTD;                                            0531 00095000
*   END;                                                           0532 00096000
*                                                                  0532 00097000
*/* END TPZSAVE                                                      */ 00098000
*                                                                  0533 00099000
*                                   /* TPIOS ENTRY LINKAGE           */ 00100000
*   ZCRRPTR=CRACRR;                 /* ADDRESS ZCRR                  */ 00101000
         L     @15,RPHCRR(,RPHPTR)                                 0533 00102000
         L     ZCRRPTR,CRACRR(,@15)                                0533 00103000
*   ZCRSCPSW=0;                     /* CLEAR BYTE OF INTERNAL FLAGS  */ 00104000
         MVI   ZCRSCPSW(ZCRRPTR),X'00'                             0534 00105000
*   IF R7->FSBTYPE=FSTYPE THEN                                     0535 00106000
         CLI   FSBTYPE(R7),X'02'                                   0535 00107000
         BNE   @RF00535                                            0535 00108000
*     DO;                           /* IF ELEMENT IS A FSB           */ 00109000
*       FSBPTR=R7;                  /* INITIALIZE PTR TO FSB         */ 00110000
         ST    R7,FSBPTR(,ZCRRPTR)                                 0537 00111000
*       LCPBPTR=FSBLCPB;            /* INITIALIZE PTR TO LCPB        */ 00112000
         L     @09,FSBPTR(,ZCRRPTR)                                0538 00113000
         L     @09,FSBLCPB(,@09)                                   0538 00114000
         ST    @09,LCPBPTR(,ZCRRPTR)                               0538 00115000
*       ZCRFSBWE=ON;                /* SET SWITCH INDICATING FSB     */ 00116000
         OI    ZCRFSBWE(ZCRRPTR),B'00000100'                       0539 00117000
*     END;                          /* END FSB PROCESSING            */ 00118000
*   ELSE                                                           0541 00119000
*     DO;                           /* NOT FSB, MUST BE LCPB         */ 00120000
         B     @RC00535                                            0541 00121000
@RF00535 DS    0H                                                  0542 00122000
*       LCPBPTR=R7;                 /* INITIALIZE LCPB PTR           */ 00123000
         ST    R7,LCPBPTR(,ZCRRPTR)                                0542 00124000
*       RFY                                                        0543 00125000
*        (R7) UNRSTD;               /* NOT REQUIRED                  */ 00126000
*       LCCWPTR=LCPNXLCW;           /* INITIALIZE LCCW POINTER       */ 00127000
         L     @09,LCPBPTR(,ZCRRPTR)                               0544 00128000
         L     @09,LCPNXLCW(,@09)                                  0544 00129000
         ST    @09,LCCWPTR(,ZCRRPTR)                               0544 00130000
         EJECT                                                          00131000
*                                                                  0545 00132000
*/********************************************************************/ 00133000
*/*                                                                  */ 00134000
*/* SEGMENT-                                                         */ 00135000
*/*      ISTZNSES                                                    */ 00136000
*/*                                                                  */ 00137000
*/* FUNCTION-                                                        */ 00138000
*/*      IF A SESSION REJECT REQUEST IS DETECTED,                    */ 00139000
*/*            ALLOCATE A FSB,                                       */ 00140000
*/*            SET MAJOR AND MINOR RETURN CODES TO                   */ 00141000
*/*              LOGIN ERROR - NO SESSION,                           */ 00142000
*/*            POST THE FSB BACK TO THE REQUESTOR,                   */ 00143000
*/*            SET UP FLAGS FOR EXIT.                                */ 00144000
*/*                                                                  */ 00145000
*/********************************************************************/ 00146000
*                                                                  0545 00147000
*ISTZNSES:                                                         0545 00148000
*       DO;                         /* SEGMENT ISTZNSES              */ 00149000
ISTZNSES DS    0H                                                  0546 00150000
*         IF FMCNSALU=ON THEN                                      0546 00151000
         TM    FMCNSALU(FMCBPTR),B'00000100'                       0546 00152000
         BNO   @RF00546                                            0546 00153000
*           DO;                     /* IF SESSION REJECT REQUEST     */ 00154000
*             ZCRPCOD1=0;           /* ZDFA0 PARAMETER               */ 00155000
         MVI   ZCRPCOD1(ZCRRPTR),X'00'                             0548 00156000
*             ZCRPFSB=ON;           /* ZDFA0 PARAMETER               */ 00157000
         OI    ZCRPFSB(ZCRRPTR),B'00100000'                        0549 00158000
*             CALL ISTZDFA0;        /* BUFFER ALLOCATION UTILITY     */ 00159000
         L     @09,ATCZPSVT(,ATCVTPTR)                             0550 00160000
         L     @15,ZPSZDFA0(,@09)                                  0550 00161000
         BALR  @14,@15                                             0550 00162000
*             FSBPTR=RPHSRPRM;      /* ADDRESS NEWLY OBTAINED FSB    */ 00163000
         L     @09,RPHSRPRM(,RPHPTR)                               0551 00164000
         ST    @09,FSBPTR(,ZCRRPTR)                                0551 00165000
*             FSBMJRCD=FRLOGICE;    /* MAJOR = LOGIC ERROR           */ 00166000
         MVI   FSBMJRCD(@09),X'08'                                 0552 00167000
*             FSBMNRCD=FRMUSELE;    /* MINOR = NO SESSION            */ 00168000
         MVI   FSBMNRCD(@09),X'A3'                                 0553 00169000
*             FSBLCPB=LCPBPTR;      /* SET LCPB POINTER IN FSB       */ 00170000
         L     @15,LCPBPTR(,ZCRRPTR)                               0554 00171000
         ST    @15,FSBLCPB(,@09)                                   0554 00172000
*             FSBLCCWA=LCPNXLCW;    /* SET LCCW POINTER IN FSB       */ 00173000
         L     @00,LCPNXLCW(,@15)                                  0555 00174000
         ST    @00,FSBLCCWA(,@09)                                  0555 00175000
*             CALL ISTZFDB;         /* FEEDBACK FSB TO REQUESTOR     */ 00176000
         BAL   @14,ISTZFDB                                         0556 00177000
*             ZCRTPEX='1'B;         /* SET TPEXIT FLAG FOR CALLER    */ 00178000
         OI    ZCRTPEX(ZCRRPTR),B'10000000'                        0557 00179000
*           END;                    /* END SESSION REJECT            */ 00180000
*         ELSE                                                     0559 00181000
*           ;                       /* NOT SESSION REJECT            */ 00182000
@RF00546 DS    0H                                                  0560 00183000
*       END ISTZNSES;               /* END OF SEGMENT                */ 00184000
*/********************************************************************/ 00185000
*/*      SEGMENT ISTZNSES END                                        */ 00186000
*/********************************************************************/ 00187000
*                                                                  0561 00188000
*     END;                          /* END LCPB PROCESSING   @XM00921*/ 00189000
*   IF ZCRTPEX=ON THEN                                             0562 00190000
@RC00535 TM    ZCRTPEX(ZCRRPTR),B'10000000'                        0562 00191000
         BO    @RT00562                                            0562 00192000
*     ;                             /* IF TPEXIT REQUIRED            */ 00193000
*   ELSE                            /* TPEXIT NOT REQUIRED           */ 00194000
*     IF ZCRFSBWE=OFF               /* IF INPUT WAS NOT FSB  @XM00921*/ 00195000
*         &LCCWOP=LSEND THEN        /* OPERATION CODE = SEND         */ 00196000
         TM    ZCRFSBWE(ZCRRPTR),B'00000100'                       0564 00197000
         BNZ   @RF00564                                            0564 00198000
         L     @09,LCCWPTR(,ZCRRPTR)                               0564 00199000
         CLI   LCCWOP(@09),X'F1'                                   0564 00200000
         BNE   @RF00564                                            0564 00201000
         EJECT                                                          00202000
*                                                                  0565 00203000
*/********************************************************************/ 00204000
*/*                                                                  */ 00205000
*/* SEGMENT-                                                         */ 00206000
*/*      ISTZSND                                                     */ 00207000
*/*                                                                  */ 00208000
*/* FUNCTION-                                                        */ 00209000
*/*      HANDLE SESSION CONTROL SEND LCCW OPERATION CODE.            */ 00210000
*/*                                                                  */ 00211000
*/*      FOR RESPONSES, NO ACTION IS TAKEN BY THIS SEGMENT.          */ 00212000
*/*                                                                  */ 00213000
*/*      SESSION INITIATION REQUESTS, (BIND, ACTPU, OR ACTLU)        */ 00214000
*/*            CAUSE THE PABINHBT FLAG SETTING TO BE MADE            */ 00215000
*/*            ACCORDING TO THE DATA FLOW CONTROL LEVEL SPECIFIED.   */ 00216000
*/*                                                                  */ 00217000
*/*      FOR SET AND TEST SEQUENCE NUMBERS,                          */ 00218000
*/*            THE FMCB SEQUENCE NUMBERS ARE UPDATED.                */ 00219000
*/*                                                                  */ 00220000
*/*      IF THE SESSION IS NOT BOUND,                                */ 00221000
*/*      OR IF IN 'PROCESSING CLEAR' STATE,                          */ 00222000
*/*      OR IF IN 'PROCESSING UNBIND' STATE,                         */ 00223000
*/*            THE REQUEST IS REJECTED.                              */ 00224000
*/*                                                                  */ 00225000
*/********************************************************************/ 00226000
*                                                                  0565 00227000
*ISTZSND:                                                          0565 00228000
*       DO;                         /* SEGMENT ISTZSND               */ 00229000
ISTZSND  DS    0H                                                  0566 00230000
*         IF LCCWIDAT=ON THEN       /* IF IMMEDIATE DATA FLAG ON     */ 00231000
         L     @09,LCCWPTR(,ZCRRPTR)                               0566 00232000
         TM    LCCWIDAT(@09),B'00001000'                           0566 00233000
         BNO   @RF00566                                            0566 00234000
*           RHPTR=ADDR(LCCWDATA);   /* LCCW CONTAINS RH DATA         */ 00235000
         LA    @09,LCCWDATA(,@09)                                  0567 00236000
         ST    @09,RHPTR(,ZCRRPTR)                                 0567 00237000
*         ELSE                      /* IF IMMEDIATE DATA FLAG OFF    */ 00238000
*           RHPTR=LCCWDATA;         /* LCCW ADDRESSES RH DATA        */ 00239000
         B     @RC00566                                            0568 00240000
@RF00566 L     @09,LCCWPTR(,ZCRRPTR)                               0568 00241000
         L     @09,LCCWDATA(,@09)                                  0568 00242000
         ST    @09,RHPTR(,ZCRRPTR)                                 0568 00243000
*         IF LCCWCD=OFF THEN        /* IF NOT DATA CHAINED           */ 00244000
@RC00566 L     @09,LCCWPTR(,ZCRRPTR)                               0569 00245000
         TM    LCCWCD(@09),B'10000000'                             0569 00246000
         BNZ   @RF00569                                            0569 00247000
*           SRUPTR=RHPTR+3;         /* SRU IS IMMEDIATELY ADDRESSABLE*/ 00248000
         LA    @09,3                                               0570 00249000
         AL    @09,RHPTR(,ZCRRPTR)                                 0570 00250000
         ST    @09,SRUPTR(,ZCRRPTR)                                0570 00251000
*         ELSE                                                     0571 00252000
*           DO;                     /* IF DATA CHAINED               */ 00253000
         B     @RC00569                                            0571 00254000
@RF00569 DS    0H                                                  0572 00255000
*             K=1;                  /* START AT BEGIN OF SRUCOPY     */ 00256000
         LA    @09,1                                               0572 00257000
         LR    K,@09                                               0572 00258000
*             SRUPTR=ADDR(SRUCOPY); /* SET RUPOINTER TO POINT TO   0573 00259000
*                                      COPIED RU                     */ 00260000
         LA    @00,SRUCOPY(,ZCRRPTR)                               0573 00261000
         ST    @00,SRUPTR(,ZCRRPTR)                                0573 00262000
*             IF LCCWIDAT=ON        /* IF IMMEDIATE DATA             */ 00263000
*                 &LCCWCNT=4 THEN                                  0574 00264000
         L     @15,LCCWPTR(,ZCRRPTR)                               0574 00265000
         TM    LCCWIDAT(@15),B'00001000'                           0574 00266000
         BNO   @RF00574                                            0574 00267000
         CLC   LCCWCNT(2,@15),@CH00052                             0574 00268000
         BNE   @RF00574                                            0574 00269000
*               DO;                 /* & LENGTH = 4                  */ 00270000
*                 RUPTRC=ADDR(LCCWDATA);/* SET RUPTR = FIRST RU BYTE */ 00271000
         LA    @00,LCCWDATA(,@15)                                  0576 00272000
         ST    @00,RUPTRC(,ZCRRPTR)                                0576 00273000
*                 SRUCOPY(K)=DATALCCW(4);/* COPY 1 BYTE OF RU        */ 00274000
         LR    @15,ZCRRPTR                                         0577 00275000
         ALR   @15,K                                               0577 00276000
         LR    @14,@00                                             0577 00277000
         MVC   SRUCOPY-1(1,@15),DATALCCW+3(@14)                    0577 00278000
*                 K=K+1;            /* UPDATE INDEX INTO SRUCOPY     */ 00279000
         ALR   K,@09                                               0578 00280000
*               END;                /* END IMMEDIATE 4 BYTE DATA     */ 00281000
*             ELSE                  /* NOT IMMEDIATE 4 BYTE DATA     */ 00282000
*               IF LCCWCNT>3 THEN                                  0580 00283000
         B     @RC00574                                            0580 00284000
@RF00574 L     @09,LCCWPTR(,ZCRRPTR)                               0580 00285000
         LH    @15,LCCWCNT(,@09)                                   0580 00286000
         N     @15,@CF04247                                        0580 00287000
         C     @15,@CF00287                                        0580 00288000
         BNH   @RF00580                                            0580 00289000
*                 DO;               /* IF LENGTH .GT. 3              */ 00290000
*                   RUPTRC=ADDR(LCCWDATA)+3;/* POINT TO PART OF RU IN   00291000
*                                      DATA AREA             @XM08890*/ 00292000
         LA    @14,3                                               0582 00293000
         LA    @09,LCCWDATA(,@09)                                  0582 00294000
         ALR   @09,@14                                             0582 00295000
         ST    @09,RUPTRC(,ZCRRPTR)                                0582 00296000
*                   SRUCOPY(1:MIN((LCCWCNT-3),6))=DATALCCW(1:(LCCWCNT-3 00297000
*                       ));         /* COPY LCCW DATA TO SRU         */ 00298000
         SLR   @15,@14                                             0583 00299000
         LA    @14,6                                               0583 00300000
         CR    @14,@15                                             0583 00301000
         BNH   *+6                                                      00302000
         LR    @14,@15                                             0583 00303000
         BCTR  @14,0                                               0583 00304000
         EX    @14,@SM04248                                        0583 00305000
*                   K=K+(LCCWCNT-3);/* DECREMENT DATA COUNTER        */ 00306000
         ALR   K,@15                                               0584 00307000
*                 END;              /* END LENGTH .GT. 3             */ 00308000
*               ELSE                                               0586 00309000
*                 ;                 /* IF LENGTH NOT .GT. 3          */ 00310000
@RF00580 DS    0H                                                  0587 00311000
*             DO WHILE(LCCWPTR^=0&K<7);/* COPY 6 BYTES OF RU DATA    */ 00312000
@RC00574 B     @DE00587                                            0587 00313000
@DL00587 DS    0H                                                  0588 00314000
*               LCCWPTR=LCCWPTR+LENGTH(ISTLCCW);/* INCREMENT TO NEXT    00315000
*                                      LCCW IN CHAIN                 */ 00316000
         LA    @09,8                                               0588 00317000
         AL    @09,LCCWPTR(,ZCRRPTR)                               0588 00318000
         ST    @09,LCCWPTR(,ZCRRPTR)                               0588 00319000
*               IF LCCWOP=LTIC THEN /* IF OPCODE = LTIC              */ 00320000
         CLI   LCCWOP(@09),X'08'                                   0589 00321000
         BNE   @RF00589                                            0589 00322000
*                 LCCWPTR=LCCWDATA; /* GET NEXT LCCW ADDRESS         */ 00323000
         L     @09,LCCWDATA(,@09)                                  0590 00324000
         ST    @09,LCCWPTR(,ZCRRPTR)                               0590 00325000
*               ELSE                                               0591 00326000
*                 ;                 /* OPCODE .NE. LTIC              */ 00327000
@RF00589 DS    0H                                                  0592 00328000
*               IF LCCWIDAT=ON THEN /* IF IMMEDIATE DATA             */ 00329000
         L     @09,LCCWPTR(,ZCRRPTR)                               0592 00330000
         TM    LCCWIDAT(@09),B'00001000'                           0592 00331000
         BNO   @RF00592                                            0592 00332000
*                 RUPTRC=ADDR(LCCWDATA);/* ADDRESS DATA IN LCCW      */ 00333000
         LA    @09,LCCWDATA(,@09)                                  0593 00334000
         ST    @09,RUPTRC(,ZCRRPTR)                                0593 00335000
*               ELSE                /* IF NOT IMMEDIATE DATA         */ 00336000
*                 RUPTRC=LCCWDATA;  /* ADDRESS DATA FROM LCCW        */ 00337000
         B     @RC00592                                            0594 00338000
@RF00592 L     @09,LCCWPTR(,ZCRRPTR)                               0594 00339000
         L     @09,LCCWDATA(,@09)                                  0594 00340000
         ST    @09,RUPTRC(,ZCRRPTR)                                0594 00341000
*               IF LCCWCNT>0        /* IF ANY ASSOCIATED DATA        */ 00342000
*                   &K<7 THEN                                      0595 00343000
@RC00592 L     @09,LCCWPTR(,ZCRRPTR)                               0595 00344000
         LH    @09,LCCWCNT(,@09)                                   0595 00345000
         N     @09,@CF04247                                        0595 00346000
         LTR   @09,@09                                             0595 00347000
         BNP   @RF00595                                            0595 00348000
         C     K,@CF00714                                          0595 00349000
         BNL   @RF00595                                            0595 00350000
*                 DO;               /* & STILL MOVING DATA           */ 00351000
*                   SRUCOPY(K:MIN((K+(LCCWCNT-1)),6))=DATALCCW(1:  0597 00352000
*                       LCCWCNT);   /* COPY NUMBER OF RU BYTES     0597 00353000
*                                      INDICATED BY COUNT            */ 00354000
         LR    @15,ZCRRPTR                                         0597 00355000
         ALR   @15,K                                               0597 00356000
         LR    @14,@09                                             0597 00357000
         BCTR  @14,0                                               0597 00358000
         ALR   @14,K                                               0597 00359000
         LA    @11,6                                               0597 00360000
         CR    @14,@11                                             0597 00361000
         BNH   *+6                                                      00362000
         LR    @14,@11                                             0597 00363000
         SLR   @14,K                                               0597 00364000
         L     @11,RUPTRC(,ZCRRPTR)                                0597 00365000
         EX    @14,@SM04250                                        0597 00366000
*                   K=K+LCCWCNT;    /* UPDATE INDEX INTO COPY FIELD  */ 00367000
         ALR   K,@09                                               0598 00368000
*                 END;              /* END DATA MOVE                 */ 00369000
*               ELSE                                               0600 00370000
*                 ;                 /* IF NOT MOVING DATA            */ 00371000
@RF00595 DS    0H                                                  0601 00372000
*               IF LCCWCD=OFF THEN  /* IF NOT DATA CHAINED           */ 00373000
         L     @09,LCCWPTR(,ZCRRPTR)                               0601 00374000
         TM    LCCWCD(@09),B'10000000'                             0601 00375000
         BNZ   @RF00601                                            0601 00376000
*                 LCCWPTR=0;        /* CLEAR LCCW POINTER            */ 00377000
         SLR   @09,@09                                             0602 00378000
         ST    @09,LCCWPTR(,ZCRRPTR)                               0602 00379000
*               ELSE                                               0603 00380000
*                 ;                 /* IF DATA CHAINED               */ 00381000
@RF00601 DS    0H                                                  0604 00382000
*             END;                  /* END DATA COPY LOOP            */ 00383000
@DE00587 L     @09,LCCWPTR(,ZCRRPTR)                               0604 00384000
         LTR   @09,@09                                             0604 00385000
         BZ    @DC00587                                            0604 00386000
         C     K,@CF00714                                          0604 00387000
         BL    @DL00587                                            0604 00388000
@DC00587 DS    0H                                                  0605 00389000
*             LCCWPTR=LCPNXLCW;     /* RESTORE LCCW POINTER          */ 00390000
         L     @09,LCPBPTR(,ZCRRPTR)                               0605 00391000
         L     @09,LCPNXLCW(,@09)                                  0605 00392000
         ST    @09,LCCWPTR(,ZCRRPTR)                               0605 00393000
*           END;                    /* END DATA CHAINING             */ 00394000
*         RFY                                                      0607 00395000
*           K UNRSTD;                                              0607 00396000
@RC00569 DS    0H                                                  0608 00397000
*         IF RHQS=OFF THEN          /* IF REQUEST                    */ 00398000
         L     @09,RHPTR(,ZCRRPTR)                                 0608 00399000
         TM    RHQS(@09),B'10000000'                               0608 00400000
         BNZ   @RF00608                                            0608 00401000
*           ZCRLREQ=ON;             /* SET REQUEST PROCESS FLAG      */ 00402000
         OI    ZCRLREQ(ZCRRPTR),B'00010000'                        0609 00403000
*         ELSE                                                     0610 00404000
*           ;                       /* IF RESPONSE                   */ 00405000
@RF00608 DS    0H                                                  0611 00406000
*         IF(SRUQSREQ=SRACTPU       /* IF ACTIVATE PHYSICAL          */ 00407000
*             |SRUQSREQ=SRBIND)     /* | BIND                        */ 00408000
*             &ZCRLREQ=ON THEN                                     0611 00409000
         L     @09,SRUPTR(,ZCRRPTR)                                0611 00410000
         CLI   SRUQSREQ(@09),X'11'                                 0611 00411000
         BE    @GL00005                                            0611 00412000
         CLI   SRUQSREQ(@09),X'31'                                 0611 00413000
         BNE   @RF00611                                            0611 00414000
@GL00005 TM    ZCRLREQ(ZCRRPTR),B'00010000'                        0611 00415000
         BNO   @RF00611                                            0611 00416000
*           DO;                     /* REQUEST                       */ 00417000
*             FMCOSSN=0;            /* ZERO OUTBOUND SYNCH COUNTER   */ 00418000
         SLR   @09,@09                                             0613 00419000
         STH   @09,FMCOSSN(,FMCBPTR)                               0613 00420000
*             FMCISSN=0;            /* ZERO INBOUND SYNCH COUNTER    */ 00421000
         STH   @09,FMCISSN(,FMCBPTR)                               0614 00422000
*             FMCOASN=0;            /* ZERO ASYNCHRONOUS COUNTER     */ 00423000
         STH   @09,FMCOASN(,FMCBPTR)                               0615 00424000
*           END;                    /* END ACTPU OR BIND REQUEST     */ 00425000
*         ELSE                                                     0617 00426000
*           ;                       /* NOT ACTPU OR BIND REQUEST     */ 00427000
@RF00611 DS    0H                                                  0618 00428000
*         IF SRUQSREQ=SRBIND        /* IF BIND REQUEST       @XM08711*/ 00429000
*             &ZCRLREQ=ON THEN                                     0618 00430000
         L     @09,SRUPTR(,ZCRRPTR)                                0618 00431000
         CLI   SRUQSREQ(@09),X'31'                                 0618 00432000
         BNE   @RF00618                                            0618 00433000
         TM    ZCRLREQ(ZCRRPTR),B'00010000'                        0618 00434000
         BNO   @RF00618                                            0618 00435000
*           DO;                                                    0619 00436000
*             IF FMCSNBI=OFF        /* IF SESSION BOUND              */ 00437000
*                 |FMCBIP=ON THEN                                  0620 00438000
         TM    FMCBIP(FMCBPTR),B'00001000'                         0620 00439000
         BNZ   @RT00620                                            0620 00440000
         TM    FMCSNBI(FMCBPTR),B'10000000'                        0620 00441000
         BO    @RF00620                                            0620 00442000
@RT00620 DS    0H                                                  0621 00443000
*               DO;                 /* | PROCESSING BIND             */ 00444000
*                 ZCRPCOD1=0;       /* ZDFBO PARAMETER               */ 00445000
         MVI   ZCRPCOD1(ZCRRPTR),X'00'                             0622 00446000
*                 ZCRPFSB=ON;       /* ZDFBO PARAMETER               */ 00447000
         OI    ZCRPFSB(ZCRRPTR),B'00100000'                        0623 00448000
*                 CALL ISTZDFA0;    /* BUFFER ALLOCATION UTILITY     */ 00449000
         L     @09,ATCZPSVT(,ATCVTPTR)                             0624 00450000
         L     @15,ZPSZDFA0(,@09)                                  0624 00451000
         BALR  @14,@15                                             0624 00452000
*                 FSBPTR=RPHSRPRM;  /* ADDRESS NEWLY OBTAINED FSB    */ 00453000
         L     @09,RPHSRPRM(,RPHPTR)                               0625 00454000
         ST    @09,FSBPTR(,ZCRRPTR)                                0625 00455000
*                 FSBMJRCD=FRLOGICE;/* LOGIC ERROR                   */ 00456000
         MVI   FSBMJRCD(@09),X'08'                                 0626 00457000
*                 FSBMNRCD=FRMUSELE;/* NO SESSION            @XM02224*/ 00458000
         MVI   FSBMNRCD(@09),X'A3'                                 0627 00459000
*                 FSBLCPB=LCPBPTR;  /* SET LCPB ADDRESS IN FSB       */ 00460000
         L     @07,LCPBPTR(,ZCRRPTR)                               0628 00461000
         ST    @07,FSBLCPB(,@09)                                   0628 00462000
*                 FSBLCCWA=LCPNXLCW;/* SET LCCW ADDRESS IN FSB       */ 00463000
         L     @07,LCPNXLCW(,@07)                                  0629 00464000
         ST    @07,FSBLCCWA(,@09)                                  0629 00465000
*                 CALL ISTZFDB;     /* FEEDBACK STATUS               */ 00466000
         BAL   @14,ISTZFDB                                         0630 00467000
*                 ZCRTPEX=ON;       /* SET EXIT FLAG                 */ 00468000
         OI    ZCRTPEX(ZCRRPTR),B'10000000'                        0631 00469000
*               END;                /* END BIND WHILE BOUND          */ 00470000
*             ELSE                                                 0633 00471000
*               DO;                 /* IF NOT INVALID BIND           */ 00472000
         B     @RC00620                                            0633 00473000
@RF00620 DS    0H                                                  0634 00474000
*SND001:                                                           0634 00475000
*                 FMCBIP=ON;        /* FLAG BIND IN PROGRESS         */ 00476000
SND001   OI    FMCBIP(FMCBPTR),B'00001000'                         0634 00477000
*                 IF SRUDFCLV=SRDFCL1/* IF DATA FLOW CNTRL LEVEL 1   */ 00478000
*                     |SRUDFCLV=SRDFCL2 THEN/* | DATA FLOW CNTRL   0635 00479000
*                                      LEVEL 2                       */ 00480000
         L     @09,SRUPTR(,ZCRRPTR)                                0635 00481000
         CLI   SRUDFCLV(@09),X'01'                                 0635 00482000
         BE    @RT00635                                            0635 00483000
         CLI   SRUDFCLV(@09),X'02'                                 0635 00484000
         BNE   @RF00635                                            0635 00485000
@RT00635 DS    0H                                                  0636 00486000
*                   CALL ISTZPBST;  /* PROHIBIT DATA FLOW    @X50BHEN*/ 00487000
         BAL   @14,ISTZPBST                                        0636 00488000
*                 ELSE                                             0637 00489000
*                   ;               /* IF TSL NOT 1 OR 2             */ 00490000
@RF00635 DS    0H                                                  0638 00491000
*                 IF BINTS>2 THEN   /* IF TSL NOT 0,1, OR 2  @X50BHEN*/ 00492000
         L     @09,SRUPTR(,ZCRRPTR)                                0638 00493000
         CLI   BINTS+1(@09),2                                      0638 00494000
         BNH   @RF00638                                            0638 00495000
*                   FMCSDTR=ON;     /* SDT REQUIRED          @X50BHEN*/ 00496000
         OI    FMCSDTR(FMCBPTR),B'00010000'                        0639 00497000
*                 ELSE                                             0640 00498000
*                   ;               /* IF TSL IS 0,1, OR 2   @X50BHEN*/ 00499000
@RF00638 DS    0H                                                  0641 00500000
*                 IF BINTS>1 THEN   /* IF TSL NOT 0 OR 1     @X50BHEN*/ 00501000
         L     @09,SRUPTR(,ZCRRPTR)                                0641 00502000
         CLI   BINTS+1(@09),1                                      0641 00503000
         BNH   @RF00641                                            0641 00504000
*                   FMCSEQI=ON;     /* SEQ CHECK REQUIRED    @X50BHEN*/ 00505000
         OI    FMCSEQI(FMCBPTR),B'00000100'                        0642 00506000
*                 ELSE                                             0643 00507000
*                   DO;             /* IF TSL IS 0 OR 1              */ 00508000
         B     @RC00641                                            0643 00509000
@RF00641 DS    0H                                                  0644 00510000
*                     FMCPACEM=0;   /* NO PACING REQUIRED    @XA07973*/ 00511000
         MVI   FMCPACEM(FMCBPTR),X'00'                             0644 00512000
*                     FMCPACEN=0;   /* NO PACING REQUIRED    @XA07973*/ 00513000
         MVI   FMCPACEN(FMCBPTR),X'00'                             0645 00514000
*                   END;            /* END TSL IS 0 OR 1     @XA07973*/ 00515000
*                 ZCRTPINV=ON;      /* SET INVOKE TPIOS FLAG ON      */ 00516000
@RC00641 OI    ZCRTPINV(ZCRRPTR),B'01000000'                       0647 00517000
*               END;                /* END NOT INVALID BIND          */ 00518000
*           END;                    /* END BIND PROCESSING           */ 00519000
*         ELSE                      /* NOT BIND PROCESS      @XL0BHEN*/ 00520000
*           IF(SRUQSREQ=SRACTPU     /* IF ACT PHYSICAL       @XM08711*/ 00521000
*               |SRUQSREQ=SRACTLU)  /* | ACT LOGICAL         @XM08711*/ 00522000
*               &ZCRLREQ=ON THEN                                   0650 00523000
         B     @RC00618                                            0650 00524000
@RF00618 L     @09,SRUPTR(,ZCRRPTR)                                0650 00525000
         CLI   SRUQSREQ(@09),X'11'                                 0650 00526000
         BE    @GL00009                                            0650 00527000
         CLI   SRUQSREQ(@09),X'0D'                                 0650 00528000
         BNE   @RF00650                                            0650 00529000
@GL00009 TM    ZCRLREQ(ZCRRPTR),B'00010000'                        0650 00530000
         BNO   @RF00650                                            0650 00531000
*             DO;                   /* REQUEST               @XM08711*/ 00532000
*               IF BINTS<=1 THEN                                   0652 00533000
         L     @09,SRUPTR(,ZCRRPTR)                                0652 00534000
         CLI   BINTS+1(@09),1                                      0652 00535000
         BH    @RF00652                                            0652 00536000
*                 DO;               /* IF TSL IS 0 OR 1      @XM10617*/ 00537000
*                   FMCPACEM=0;     /* NO PACING REQUIRED    @XM10617*/ 00538000
         MVI   FMCPACEM(FMCBPTR),X'00'                             0654 00539000
*                   FMCPACEN=0;     /* NO PACING REQUIRED    @XM10617*/ 00540000
         MVI   FMCPACEN(FMCBPTR),X'00'                             0655 00541000
*                 END;              /* END TSL IS 0 OR 1     @XM10617*/ 00542000
*               ELSE                                               0657 00543000
*                 ;                 /* TSL NOT 0 OR 1        @XM10617*/ 00544000
@RF00652 DS    0H                                                  0658 00545000
*               FMCBIP=ON;          /* FLAG BIND IN PROGRESS         */ 00546000
         OI    FMCBIP(FMCBPTR),B'00001000'                         0658 00547000
*               CALL ISTZPBST;      /* PROHIBIT DATA FLOW    @X50BHEN*/ 00548000
         BAL   @14,ISTZPBST                                        0659 00549000
*               IF SRUTSPRO=SRUTSP3 THEN/* IF TSL IS 3       @X50BHEN*/ 00550000
         L     @09,SRUPTR(,ZCRRPTR)                                0660 00551000
         TM    SRUTSPRO(@09),B'00000011'                           0660 00552000
         BNO   @RF00660                                            0660 00553000
         TM    SRUTSPRO(@09),B'00001100'                           0660 00554000
         BNZ   @RF00660                                            0660 00555000
*                 FMCSDTR=ON;       /* START DATA TRAFFIC REQUIRED 0661 00556000
*                                                            @X50BHEN*/ 00557000
         OI    FMCSDTR(FMCBPTR),B'00010000'                        0661 00558000
*               ELSE                                               0662 00559000
*                 ;                 /* IF TSL IS NOT 3       @X50BHEN*/ 00560000
@RF00660 DS    0H                                                  0663 00561000
*               IF SRUTSPRO^=SRUTSP0/* IF TSL NOT 0          @X50BHEN*/ 00562000
*                   &SRUTSPRO^=SRUTSP1 THEN/* & TSL NOT 1    @X50BHEN*/ 00563000
         L     @09,SRUPTR(,ZCRRPTR)                                0663 00564000
         TM    SRUTSPRO(@09),B'00001111'                           0663 00565000
         BZ    @RF00663                                            0663 00566000
         TM    SRUTSPRO(@09),B'00000001'                           0663 00567000
         BNO   @RT00663                                            0663 00568000
         TM    SRUTSPRO(@09),B'00001110'                           0663 00569000
         BZ    @RF00663                                            0663 00570000
@RT00663 DS    0H                                                  0664 00571000
*                 FMCSEQI=ON;       /* SEQUENCE NUMBER CHECK REQUIRED   00572000
*                                                            @X50BHEN*/ 00573000
         OI    FMCSEQI(FMCBPTR),B'00000100'                        0664 00574000
*               ELSE                                               0665 00575000
*                 ;                 /* IF TSL NOT 0 OR 1     @X50BHEN*/ 00576000
@RF00663 DS    0H                                                  0666 00577000
*               ZCRTPINV=ON;        /* SET INVOKE TPIOS FLAG ON      */ 00578000
         OI    ZCRTPINV(ZCRRPTR),B'01000000'                       0666 00579000
*             END;                  /* END ACTIVATE REQUEST          */ 00580000
*           ELSE                    /* IF NOT SESSION INITIATION   0668 00581000
*                                                            @X50BHEN*/ 00582000
*             IF FMCSNBI=ON         /* IF SESSION NOT BOUND          */ 00583000
*                 |(FMCCIPI=ON      /* | CLEAR IN PROGRESS           */ 00584000
*                 |FMCUIPI=ON) THEN                                0668 00585000
         B     @RC00650                                            0668 00586000
@RF00650 TM    FMCSNBI(FMCBPTR),B'11100000'                        0668 00587000
         BZ    @RF00668                                            0668 00588000
*               DO;                 /* | UNBIND IN PROGRESS          */ 00589000
*                 ZCRPCOD1=0;       /* ZDFA0 PARAMETER               */ 00590000
         MVI   ZCRPCOD1(ZCRRPTR),X'00'                             0670 00591000
*                 ZCRPFSB=ON;       /* ZDFA0 PARAMETER               */ 00592000
         OI    ZCRPFSB(ZCRRPTR),B'00100000'                        0671 00593000
*                 CALL ISTZDFA0;    /* BUFFER ALLOCATION UTILITY     */ 00594000
         L     @09,ATCZPSVT(,ATCVTPTR)                             0672 00595000
         L     @15,ZPSZDFA0(,@09)                                  0672 00596000
         BALR  @14,@15                                             0672 00597000
*                 FSBPTR=RPHSRPRM;  /* ADDRESS OBTAINED FSB          */ 00598000
         L     @09,RPHSRPRM(,RPHPTR)                               0673 00599000
         ST    @09,FSBPTR(,ZCRRPTR)                                0673 00600000
*                 FSBMJRCD=FRLOGICE;/* MAJOR=LOGIC ERROR             */ 00601000
         MVI   FSBMJRCD(@09),X'08'                                 0674 00602000
*                 IF FMCSNBI=ON THEN/* IF SESSION NOT BOUND          */ 00603000
         TM    FMCSNBI(FMCBPTR),B'10000000'                        0675 00604000
         BNO   @RF00675                                            0675 00605000
*                   FSBMNRCD=FRMUSELE;/* MINOR=USER LOGIC ERROR      */ 00606000
         MVI   FSBMNRCD(@09),X'A3'                                 0676 00607000
*                 ELSE              /* IF SESSION IS BOUND           */ 00608000
*                   FSBMNRCD=FRMRDIP;/* MINOR=DEACTIVATE IN PROCESS  */ 00609000
         B     @RC00675                                            0677 00610000
@RF00675 L     @09,FSBPTR(,ZCRRPTR)                                0677 00611000
         MVI   FSBMNRCD(@09),X'A2'                                 0677 00612000
*                 FSBLCPB=LCPBPTR;  /* SET LCPB PONITER IN FSB       */ 00613000
@RC00675 L     @09,FSBPTR(,ZCRRPTR)                                0678 00614000
         L     @07,LCPBPTR(,ZCRRPTR)                               0678 00615000
         ST    @07,FSBLCPB(,@09)                                   0678 00616000
*                 FSBLCCWA=LCPNXLCW;/* SET LCCW ADDRESS IN FSB       */ 00617000
         L     @07,LCPNXLCW(,@07)                                  0679 00618000
         ST    @07,FSBLCCWA(,@09)                                  0679 00619000
*                 CALL ISTZFDB;     /* CALL FEEDBACK ROUTINE         */ 00620000
         BAL   @14,ISTZFDB                                         0680 00621000
*                 ZCRTPEX=ON;       /* INDICATE TPEXIT               */ 00622000
         OI    ZCRTPEX(ZCRRPTR),B'10000000'                        0681 00623000
*               END;                /* END SESSION NOT BOUND         */ 00624000
*             ELSE                                                 0683 00625000
*               DO;                 /* NOT SESSION NOT BOUND         */ 00626000
         B     @RC00668                                            0683 00627000
@RF00668 DS    0H                                                  0684 00628000
*                 IF SRUQSREQ=SRSTSN/* IF SET AND TEST SEQ NUMBER    */ 00629000
*                     &ZCRLREQ=ON THEN                             0684 00630000
         L     @09,SRUPTR(,ZCRRPTR)                                0684 00631000
         CLI   SRUQSREQ(@09),X'A2'                                 0684 00632000
         BNE   @RF00684                                            0684 00633000
         TM    ZCRLREQ(ZCRRPTR),B'00010000'                        0684 00634000
         BNO   @RF00684                                            0684 00635000
*                   DO;             /* REQUEST                       */ 00636000
*                     IF SRUPSAC=SRSETAC/* IF PRIMARY TO SECONDARY 0686 00637000
*                                      SET                           */ 00638000
*                         |SRUPSAC=SRSTSAC THEN                    0686 00639000
         TM    SRUPSAC(@09),B'00010000'                            0686 00640000
         BNO   @GL00013                                            0686 00641000
         TM    SRUPSAC(@09),B'00100000'                            0686 00642000
         BZ    @RT00686                                            0686 00643000
@GL00013 L     @09,SRUPTR(,ZCRRPTR)                                0686 00644000
         TM    SRUPSAC(@09),B'00110000'                            0686 00645000
         BNO   @RF00686                                            0686 00646000
@RT00686 DS    0H                                                  0687 00647000
*                       FMCOSSN=SRUPSSN;/* SET PRIMARY TO SECONDARY  */ 00648000
         L     @09,SRUPTR(,ZCRRPTR)                                0687 00649000
         MVC   FMCOSSN(2,FMCBPTR),SRUPSSN(@09)                     0687 00650000
*                     ELSE                                         0688 00651000
*                       ;           /* NOT PRIMARY TO SECONDARY      */ 00652000
@RF00686 DS    0H                                                  0689 00653000
*                     IF SRUSPAC=SRSETAC/* IF SECONDARY TO PRIMARY   */ 00654000
*                         |SRUPSAC=SRSTSAC THEN                    0689 00655000
         L     @09,SRUPTR(,ZCRRPTR)                                0689 00656000
         TM    SRUSPAC(@09),B'01000000'                            0689 00657000
         BNO   @GL00014                                            0689 00658000
         TM    SRUSPAC(@09),B'10000000'                            0689 00659000
         BZ    @RT00689                                            0689 00660000
@GL00014 L     @09,SRUPTR(,ZCRRPTR)                                0689 00661000
         TM    SRUPSAC(@09),B'00110000'                            0689 00662000
         BNO   @RF00689                                            0689 00663000
@RT00689 DS    0H                                                  0690 00664000
*                       FMCISSN=SRUSPSN;/* SET INBOUND SEQUENCE ID 0690 00665000
*                                                            @XM10611*/ 00666000
         L     @09,SRUPTR(,ZCRRPTR)                                0690 00667000
         MVC   FMCISSN(2,FMCBPTR),SRUSPSN(@09)                     0690 00668000
*                     ELSE                                         0691 00669000
*                       ;           /* NOT SECONDARY TO PRIMARY      */ 00670000
@RF00689 DS    0H                                                  0692 00671000
*                   END;            /* END STSN REQUEST              */ 00672000
*                 ELSE                                             0693 00673000
*                   ;               /* NOT STSN REQUEST              */ 00674000
@RF00684 DS    0H                                                  0694 00675000
*                 ZCRTPINV=ON;      /* SET INVOKE TPIOS FLAG         */ 00676000
         OI    ZCRTPINV(ZCRRPTR),B'01000000'                       0694 00677000
*               END;                /* END NOT INVALID TERMINATION   */ 00678000
*       END ISTZSND;                /* END OF SEGMENT ISTZSND        */ 00679000
*/********************************************************************/ 00680000
*/*      SEGMENT ISTZSND END                                         */ 00681000
*/********************************************************************/ 00682000
*                                                                  0697 00683000
*     ELSE                          /* IF NOT SEND OPERATION CODE    */ 00684000
         EJECT                                                          00685000
*                                                                  0697 00686000
*/********************************************************************/ 00687000
*/*                                                                  */ 00688000
*/* SEGMENT-                                                         */ 00689000
*/*      ISTZTRM                                                     */ 00690000
*/*                                                                  */ 00691000
*/* FUNCTION-                                                        */ 00692000
*/*      THIS SEGMENT HANDLES REQUESTS OTHER THAN NORMAL SENDS.      */ 00693000
*/*                                                                  */ 00694000
*/*      IF THE WORK ELEMENT IS A FSB AND THE OPCODE IS CLEAR,       */ 00695000
*/*            THE FSB IS PASSED TO THE REQUESTOR.                   */ 00696000
*/*                                                                  */ 00697000
*/*            IF IT WAS A MULTIPLE REQUEST,                         */ 00698000
*/*            THE UNBIND FSB IS RETURNED,                           */ 00699000
*/*            NOTIFY IS DRIVEN (IF REQUIRED),               @XM19747*/ 00700000
*/*            AND THE CLEAR FSB IS FREED.                           */ 00701000
*/*                                                                  */ 00702000
*/*            OTHERWISE,                                            */ 00703000
*/*            NOTIFY IS DRIVEN (IF REQUIRED), AND           @XM19747*/ 00704000
*/*            THE CLEAR FSB IS PASSED BACK TO THE REQUESTOR.        */ 00705000
*/*                                                                  */ 00706000
*/*      IF IT WAS NOT A CLEAR FSB,                                  */ 00707000
*/*            A CHECK IS MADE TO SEE IF IT IS A CLSDEST FINISH      */ 00708000
*/*            REQUEST.                                              */ 00709000
*/*            IF IT IS A CLSDEST FINISH REQUEST,                    */ 00710000
*/*            A FSB IS OBTAINED AND FORMATTED BACK TO THE REQUESTOR.*/ 00711000
*/*                                                                  */ 00712000
*/*      IF IT IS NONE OF THE ABOVE CONDITIONS,                      */ 00713000
*/*            IF THE SESSION IS BOUND                               */ 00714000
*/*            AND NOT PROCESSING CLEAR OR UNBIND,                   */ 00715000
*/*            SEGMENT ISTZCLR IS INVOKED.                           */ 00716000
*/*                                                                  */ 00717000
*/********************************************************************/ 00718000
*                                                                  0697 00719000
*ISTZTRM:                                                          0697 00720000
*       DO;                         /* SEGMENT ISTZTRM               */ 00721000
         B     @RC00564                                            0697 00722000
@RF00564 DS    0H                                                  0697 00723000
ISTZTRM  DS    0H                                                  0698 00724000
*         IF ZCRFSBWE=ON THEN                                      0698 00725000
         TM    ZCRFSBWE(ZCRRPTR),B'00000100'                       0698 00726000
         BNO   @RF00698                                            0698 00727000
*           DO;                     /* IF FSB IS PRESENT             */ 00728000
*             IF LCPTLBPI=ON THEN                                  0700 00729000
         L     @09,LCPBPTR(,ZCRRPTR)                               0700 00730000
         TM    LCPTLBPI(@09),B'00010000'                           0700 00731000
         BNO   @RF00700                                            0700 00732000
*               DO;                 /* IF TLB IS PRESENT IT IS A   0701 00733000
*                                      MULTIPLE REQUEST              */ 00734000
*                 ZCRPCOD1=0;       /* ZDFB0 PARAMETER               */ 00735000
         MVI   ZCRPCOD1(ZCRRPTR),X'00'                             0702 00736000
*                 ZCRPBUF=ON;       /* ZDFB0 PARAMETER               */ 00737000
         OI    ZCRPBUF(ZCRRPTR),B'00000100'                        0703 00738000
*                 RFY                                              0704 00739000
*                  (R7) RSTD;       /* ZDFB0 PARAMETER REGISTER      */ 00740000
*                 R7=ADDR(FSBFDB)-FDBOFSET;/* ZDFB0 PARAMETER -    0705 00741000
*                                      ADDRESS                       */ 00742000
         L     @09,FSBPTR(,ZCRRPTR)                                0705 00743000
         LA    R7,FSBFDB(,@09)                                     0705 00744000
         SH    R7,FDBOFSET+32(,@09)                                0705 00745000
*                 R7->ZIBCHAIN=0;   /* ZERO BUFFER CHAIN POINTER     */ 00746000
         SLR   @09,@09                                             0706 00747000
         ST    @09,ZIBCHAIN(,R7)                                   0706 00748000
*                 CALL ISTZDFB0;    /* BUFFER RELEASE UTILITY        */ 00749000
         L     @09,ATCZPSVT(,ATCVTPTR)                             0707 00750000
         L     @15,ZPSZDFB0(,@09)                                  0707 00751000
         BALR  @14,@15                                             0707 00752000
*                 RFY                                              0708 00753000
*                  (R7) UNRSTD;     /* ZDFB0 PARAMETER REGISTER      */ 00754000
*                 TLBPTR=LCPTLBAD;  /* POINT TO BEGINNING OF TLB   0709 00755000
*                                                            @XM00921*/ 00756000
         L     @09,LCPBPTR(,ZCRRPTR)                               0709 00757000
         L     @07,LCPTLBAD(,@09)                                  0709 00758000
         ST    @07,TLBPTR(,ZCRRPTR)                                0709 00759000
*                 LCPNXLCW=TLBLCPA; /* RESTORE LCCW ADDRESS          */ 00760000
         L     @00,TLBLCPA(,@07)                                   0710 00761000
         ST    @00,LCPNXLCW(,@09)                                  0710 00762000
*                 FSBPTR=TLBFSBA;   /* POINT TO UNBIND FSB           */ 00763000
         L     @00,TLBFSBA(,@07)                                   0711 00764000
         ST    @00,FSBPTR(,ZCRRPTR)                                0711 00765000
*                 LCPTLBAD=0;       /* CLEAR TLB POINTER             */ 00766000
         SLR   @00,@00                                             0712 00767000
         ST    @00,LCPTLBAD(,@09)                                  0712 00768000
*                 LCPTLBPI=OFF;     /* CLEAR TLB FLAG                */ 00769000
         NI    LCPTLBPI(@09),B'11101111'                           0713 00770000
*                 TLBPTR=TLBPTR-LENGTH(ISTBFHDR);/* POINT BACK TO  0714 00771000
*                                      BUFFER ORIGIN                 */ 00772000
*                                                                  0714 00773000
         SL    @07,@CF00058                                        0714 00774000
         ST    @07,TLBPTR(,ZCRRPTR)                                0714 00775000
*                 /***************************************************/ 00776000
*                 /*                                                 */ 00777000
*                 /* RELSTORE BUFADDR(TLBPTR)                        */ 00778000
*                 /*                                                 */ 00779000
*                 /***************************************************/ 00780000
*                                                                  0715 00781000
*                 DO;                                              0715 00782000
*                                                                  0715 00783000
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */ 00784000
*/* END OF ATBUILD                                                   */ 00785000
*                                                                  0716 00786000
*                   DCL                                            0716 00787000
*                     GPR00F FIXED(31) REG(00);                    0716 00788000
*                   DCL                                            0717 00789000
*                     GPR00P PTR(31) REG(00);                      0717 00790000
*                   DCL                                            0718 00791000
*                     GPR02F FIXED(31) REG(02);                    0718 00792000
*                   DCL                                            0719 00793000
*                     GPR02P PTR(31) REG(02);                      0719 00794000
*                   DCL                                            0720 00795000
*                     GPR03F FIXED(31) REG(03);                    0720 00796000
*                   DCL                                            0721 00797000
*                     GPR03P PTR(31) REG(03);                      0721 00798000
*                   DCL                                            0722 00799000
*                     GPR04F FIXED(31) REG(04);                    0722 00800000
*                   DCL                                            0723 00801000
*                     GPR04P PTR(31) REG(04);                      0723 00802000
*                   DCL                                            0724 00803000
*                     GPR05F FIXED(31) REG(05);                    0724 00804000
*                   DCL                                            0725 00805000
*                     GPR05P PTR(31) REG(05);                      0725 00806000
*                   DCL                                            0726 00807000
*                     GPR06F FIXED(31) REG(06);                    0726 00808000
*                   DCL                                            0727 00809000
*                     GPR06P PTR(31) REG(06);                      0727 00810000
*                   DCL                                            0728 00811000
*                     GPR07F FIXED(31) REG(07);                    0728 00812000
*                   DCL                                            0729 00813000
*                     GPR07P PTR(31) REG(07);                      0729 00814000
*                   DCL                                            0730 00815000
*                     GPR08F FIXED(31) REG(08);                    0730 00816000
*                   DCL                                            0731 00817000
*                     GPR08P PTR(31) REG(08);                      0731 00818000
*                   DCL                                            0732 00819000
*                     GPR09F FIXED(31) REG(09);                    0732 00820000
*                   DCL                                            0733 00821000
*                     GPR09P PTR(31) REG(09);                      0733 00822000
*                   DCL                                            0734 00823000
*                     GPR10F FIXED(31) REG(10);                    0734 00824000
*                   DCL                                            0735 00825000
*                     GPR10P PTR(31) REG(10);                      0735 00826000
*                   DCL                                            0736 00827000
*                     GPR11F FIXED(31) REG(11);                    0736 00828000
*                   DCL                                            0737 00829000
*                     GPR11P PTR(31) REG(11);                      0737 00830000
*                   DCL                                            0738 00831000
*                     GPR15F FIXED(31) REG(15);                    0738 00832000
*                   DCL                                            0739 00833000
*                     GPR15P PTR(31) REG(15);                      0739 00834000
*                   RFY                                            0740 00835000
*                    (GPR02P,                                      0740 00836000
*                     GPR03P,                                      0740 00837000
*                     GPR04P,                                      0740 00838000
*                     GPR15P) RSTD;                                0740 00839000
*                   RFY                                            0741 00840000
*                    (GPR01P,                                      0741 00841000
*                     GPR13P) RSTD;                                0741 00842000
*                   GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);  00843000
          STM GPR02P,GPR13P,RPHWORK(GPR01P)                             00844000
*                   RFY                                            0743 00845000
*                     GPR13P UNRSTD;                               0743 00846000
*                   GPR04P=TLBPTR;                                 0744 00847000
         L     GPR04P,TLBPTR(,ZCRRPTR)                             0744 00848000
*                   DCL                                            0745 00849000
*                     1 FMZA0016 FIXED(31) STATIC LOCAL,           0745 00850000
*                      2 * FIXED(8) INIT(64),                      0745 00851000
*                      2 * PTR(24) INIT(0);                        0745 00852000
*                   GPR03F=FMZA0016;                               0746 00853000
         L     GPR03F,FMZA0016                                     0746 00854000
*                   DO;             /* LISATCVT                    0747 00855000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00856000
*                     GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER        */ 00857000
         L     GPR15P,ATCLCPTR                                     0748 00858000
*                   END;            /* LISATCVT                      */ 00859000
*                   GPR02P=GPR15P->ATCBPDA;                        0750 00860000
         L     GPR02P,ATCBPDA(,GPR15P)                             0750 00861000
*                   GPR15P=GPR15P->ATCSMRS;                        0751 00862000
         L     GPR15P,ATCSMRS(,GPR15P)                             0751 00863000
*                   DCL                                            0752 00864000
*                     FMZL0016 BASED(GPR15P) LABEL VALUERANGE(*);  0752 00865000
*                   CALL FMZL0016;                                 0753 00866000
         BALR  @14,@15                                             0753 00867000
*                   RFY                                            0754 00868000
*                     GPR13P RSTD;                                 0754 00869000
*                   GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);  00870000
          LM GPR02P,GPR13P,RPHWORK(GPR01P)                              00871000
*                   RFY                                            0756 00872000
*                    (GPR01P,                                      0756 00873000
*                     GPR13P) UNRSTD;                              0756 00874000
*                   RFY                                            0757 00875000
*                    (GPR02P,                                      0757 00876000
*                     GPR03P,                                      0757 00877000
*                     GPR04P,                                      0757 00878000
*                     GPR15P) UNRSTD;                              0757 00879000
*                 END;              /* *********END OF RELSTORE    0758 00880000
*                                      EXPANSION********* FREE TLB   */ 00881000
*               END;                /* END TLB PRESENT               */ 00882000
*             ELSE                                                 0760 00883000
*               ;                   /* IF TLB NOT PRESENT            */ 00884000
@RF00700 DS    0H                                                  0761 00885000
*             GO TO CHECKFLG;       /* CONTINUE PROCESSING           */ 00886000
         B     CHECKFLG                                            0761 00887000
*           END;                    /* END FSB PRESENT               */ 00888000
*         ELSE                                                     0763 00889000
*           DO;                     /* IF FSB IS NOT PRESENT         */ 00890000
@RF00698 DS    0H                                                  0764 00891000
*             LCPRUCNT=LCPMNRCD;    /* SAVE CLEAR REASON CODE      0764 00892000
*                                                            @XM19747*/ 00893000
         L     @09,LCPBPTR(,ZCRRPTR)                               0764 00894000
         MVC   LCPRUCNT(1,@09),LCPMNRCD(@09)                       0764 00895000
*             IF LCCWIDAT=ON THEN   /* IF IMMEDIATE DATA             */ 00896000
         L     @09,LCCWPTR(,ZCRRPTR)                               0765 00897000
         TM    LCCWIDAT(@09),B'00001000'                           0765 00898000
         BNO   @RF00765                                            0765 00899000
*               RHPTR=ADDR(LCCWDATA);/* ADDRESS RH IN LCCW           */ 00900000
         LA    @09,LCCWDATA(,@09)                                  0766 00901000
         ST    @09,RHPTR(,ZCRRPTR)                                 0766 00902000
*             ELSE                  /* IF NOT IMMEDIATE DATA         */ 00903000
*               RHPTR=LCCWDATA;     /* ADDRESS RH FROM LCCW          */ 00904000
         B     @RC00765                                            0767 00905000
@RF00765 L     @09,LCCWPTR(,ZCRRPTR)                               0767 00906000
         L     @09,LCCWDATA(,@09)                                  0767 00907000
         ST    @09,RHPTR(,ZCRRPTR)                                 0767 00908000
*             IF FMCSNBI=ON         /* IF SESSION NOT BOUND          */ 00909000
*                 &FMCBIP=OFF THEN                                 0768 00910000
@RC00765 TM    FMCSNBI(FMCBPTR),B'10000000'                        0768 00911000
         BNO   @RF00768                                            0768 00912000
         TM    FMCBIP(FMCBPTR),B'00001000'                         0768 00913000
         BNZ   @RF00768                                            0768 00914000
*               DO;                 /* & NOT BIND IN PROGRESS        */ 00915000
*                 IF LCCWOP=LCRUDNFY THEN                          0770 00916000
         L     @09,LCCWPTR(,ZCRRPTR)                               0770 00917000
         CLI   LCCWOP(@09),X'F4'                                   0770 00918000
         BNE   @RF00770                                            0770 00919000
*                   DO;             /* IF CLEAR UNBIND NOTIFY        */ 00920000
*                     CALL NOTIFY;  /* NOTIFY APPLICATION    @XM19747*/ 00921000
         BAL   @14,NOTIFY                                          0772 00922000
*                     FMCNSALU=ON;  /* NO SESSION EXISTS             */ 00923000
         OI    FMCNSALU(FMCBPTR),B'00000100'                       0773 00924000
*                   END;            /* END CLEAR UNBIND NOTIFY       */ 00925000
*                 ELSE                                             0775 00926000
*                   ;               /* NOT CLEAR UNBIND NOTIFY       */ 00927000
@RF00770 DS    0H                                                  0776 00928000
*                 GO TO GETFSB;     /* CONTINUE PROCESSING           */ 00929000
         B     GETFSB                                              0776 00930000
*               END;                /* END NOT IN SESSION            */ 00931000
*             ELSE                                                 0778 00932000
*               DO;                 /* IF BOUND OR BIND UP           */ 00933000
@RF00768 DS    0H                                                  0779 00934000
*                 IF FMCSNBI=ON THEN/* IF SESSION NOT BOUND          */ 00935000
         TM    FMCSNBI(FMCBPTR),B'10000000'                        0779 00936000
         BNO   @RF00779                                            0779 00937000
*                   IF LCCWOP=LCLEAR/* IF CLEAR              @XM10462*/ 00938000
*                       |LCCWOP=LCRUD/* | CLEAR UNBIND               */ 00939000
*                       |LCCWOP=LCRUDNFY/* | CLEAR UNBIND NOTIFY     */ 00940000
*                       |LCCWOP=LNFY/* | NOTIFY                      */ 00941000
*                       |LCCWOP=LCLRNFY THEN                       0780 00942000
         L     @09,LCCWPTR(,ZCRRPTR)                               0780 00943000
         CLI   LCCWOP(@09),X'F2'                                   0780 00944000
         BE    @RT00780                                            0780 00945000
         CLI   LCCWOP(@09),X'F3'                                   0780 00946000
         BE    @RT00780                                            0780 00947000
         CLI   LCCWOP(@09),X'F4'                                   0780 00948000
         BE    @RT00780                                            0780 00949000
         CLI   LCCWOP(@09),X'F5'                                   0780 00950000
         BE    @RT00780                                            0780 00951000
         CLI   LCCWOP(@09),X'F8'                                   0780 00952000
         BNE   @RF00780                                            0780 00953000
@RT00780 DS    0H                                                  0781 00954000
*                     ;             /* | CLEAR NOTIFY                */ 00955000
*                   ELSE            /* NONE OF THE ABOVE             */ 00956000
*                     GO TO GETFSB; /* CONTINUE FROM GETFSB          */ 00957000
*                 IF(FMCCIPI=ON     /* IF CLEAR IN PROGRESS          */ 00958000
*                     |FMCUIPI=ON)  /* | UNBIND IN PROGRESS          */ 00959000
*                     &LCCWOP=LCLEAR THEN/* & OPERATION CODE = CLEAR */ 00960000
@RF00779 TM    FMCCIPI(FMCBPTR),B'01100000'                        0783 00961000
         BZ    @RF00783                                            0783 00962000
         L     @09,LCCWPTR(,ZCRRPTR)                               0783 00963000
         CLI   LCCWOP(@09),X'F2'                                   0783 00964000
         BE    @RT00783                                            0783 00965000
*                   GO TO GETFSB;   /* CONTINUE FROM GETFSB          */ 00966000
*                 ELSE              /* OTHERWISE                     */ 00967000
*                   CALL ISTZCLR;   /* PROCESS OTHER POSSIBIITIES    */ 00968000
@RF00783 BAL   @14,ISTZCLR                                         0785 00969000
*                 GO TO CHECKFLG;   /* CONTINUE IN ANY CASE          */ 00970000
         B     CHECKFLG                                            0786 00971000
*               END;                /* END BOUND OR BIND UP          */ 00972000
*GETFSB:                                                           0788 00973000
*             ;                     /* BRANCH POINT                  */ 00974000
GETFSB   DS    0H                                                  0789 00975000
*             ZCRPCOD1=0;           /* ZDFA0 PARAMETER               */ 00976000
         MVI   ZCRPCOD1(ZCRRPTR),X'00'                             0789 00977000
*             ZCRPFSB=ON;           /* ZDFA0 PARAMETER               */ 00978000
         OI    ZCRPFSB(ZCRRPTR),B'00100000'                        0790 00979000
*             CALL ISTZDFA0;        /* BUFFER ALLOCATION UTILITY     */ 00980000
         L     @09,ATCZPSVT(,ATCVTPTR)                             0791 00981000
         L     @15,ZPSZDFA0(,@09)                                  0791 00982000
         BALR  @14,@15                                             0791 00983000
*             FSBPTR=RPHSRPRM;      /* ADDRESS ALLOCATED FSB         */ 00984000
         L     @09,RPHSRPRM(,RPHPTR)                               0792 00985000
         ST    @09,FSBPTR(,ZCRRPTR)                                0792 00986000
*             FSBMJRCD=FRLOGICE;    /* MAJOR=LOGIC ERROR             */ 00987000
         MVI   FSBMJRCD(@09),X'08'                                 0793 00988000
*             FSBMNRCD=FRMUSELE;    /* MINOR=USER LOGIC ERROR        */ 00989000
         MVI   FSBMNRCD(@09),X'A3'                                 0794 00990000
*             FSBLCPB=LCPBPTR;      /* SET ADDRESS OF LCPB IN FSB    */ 00991000
         L     @07,LCPBPTR(,ZCRRPTR)                               0795 00992000
         ST    @07,FSBLCPB(,@09)                                   0795 00993000
*             FSBLCCWA=LCPNXLCW;    /* ADDRESS FAILING LCCW          */ 00994000
         L     @07,LCPNXLCW(,@07)                                  0796 00995000
         ST    @07,FSBLCCWA(,@09)                                  0796 00996000
*             ZCRRJLCP=ON;          /* FLAG LCPB REJECTED            */ 00997000
         OI    ZCRRJLCP(ZCRRPTR),B'00100000'                       0797 00998000
*CHECKFLG:                                                         0798 00999000
*             ;                     /* BRANCH POINT                  */ 01000000
CHECKFLG DS    0H                                                  0799 01001000
*             IF ZCRTPINV=OFF       /* IF INVOKE TPIOS FLAG OFF      */ 01002000
*                 &ZCRTPEX=OFF THEN                                0799 01003000
         TM    ZCRTPINV(ZCRRPTR),B'11000000'                       0799 01004000
         BNZ   @RF00799                                            0799 01005000
*               DO;                 /* & EXIT FLAG OFF               */ 01006000
*                 CALL ISTZFDB;     /* FEED FSB BACK TO REQUESTOR    */ 01007000
         BAL   @14,ISTZFDB                                         0801 01008000
*                 ZCRTPEX=ON;       /* SET TPEXIT INDICATOR          */ 01009000
         OI    ZCRTPEX(ZCRRPTR),B'10000000'                        0802 01010000
*               END;                /* END FEEDBACK PROCESSING       */ 01011000
*             ELSE                                                 0804 01012000
*               ;                   /* NOT FEEDBACK PROCESSING       */ 01013000
@RF00799 DS    0H                                                  0805 01014000
*           END;                    /* END FSB NOT PRESENT           */ 01015000
*       END ISTZTRM;                /* END OF SEGMENT                */ 01016000
*/********************************************************************/ 01017000
*/*      ISTZTRM SEGMENT END                                         */ 01018000
*/********************************************************************/ 01019000
*                                                                  0807 01020000
*   RFY                                                            0807 01021000
*    (R15) RSTD;                    /* RETURN CODE REGISTER          */ 01022000
@RC00564 DS    0H                                                  0807 01023000
@RT00562 DS    0H                                                  0808 01024000
*   IF ZCRTPINV=ON THEN             /* IF INVOKE TPIOS FLAG ON       */ 01025000
         TM    ZCRTPINV(ZCRRPTR),B'01000000'                       0808 01026000
         BNO   @RF00808                                            0808 01027000
*     R15=00;                       /* SET RETURN CODE = 00          */ 01028000
         SLR   R15,R15                                             0809 01029000
*   ELSE                            /* IF INVOKE TPIOS FLAG OFF      */ 01030000
*     IF ZCRRJLCP=ON THEN           /* IF REJECT LCPB INDICATED      */ 01031000
         B     @RC00808                                            0810 01032000
@RF00808 TM    ZCRRJLCP(ZCRRPTR),B'00100000'                       0810 01033000
         BNO   @RF00810                                            0810 01034000
*       R15=08;                     /* SET RETURN CODE = 08          */ 01035000
         LA    R15,8                                               0811 01036000
*     ELSE                          /* IF LCPB REJECT OFF            */ 01037000
*       R15=04;                     /* SET RETURN CODE = 04          */ 01038000
         B     @RC00810                                            0812 01039000
@RF00810 LA    R15,4                                               0812 01040000
*/* TPZRETN                                                          */ 01041000
*                                                                  0813 01042000
*   DO;                                                            0813 01043000
@RC00810 DS    0H                                                  0813 01044000
@RC00808 DS    0H                                                  0814 01045000
*     RFY                                                          0814 01046000
*      (GPR07P,                                                    0814 01047000
*       GPR14P,                                                    0814 01048000
*       GPR15P) RSTD;                                              0814 01049000
*     GPR13P=ZSAZSVBC;                                             0815 01050000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0815 01051000
*     IF GPR13P=0 THEN                                             0816 01052000
         LTR   GPR13P,GPR13P                                       0816 01053000
         BZ    @RT00816                                            0816 01054000
*       ;                           /* TPDVTS ISTZFARR               */ 01055000
*     ELSE                                                         0818 01056000
*       GPR14P=ZSAZSVRR;                                           0818 01057000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0818 01058000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0819 01059000
@RT00816 DS    0H                                                  0819 01060000
         LM    7,12,ZSAZSVVR+0(13)                                      01061000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0820 01062000
         BR    GPR14P                                                   01063000
*     RFY                                                          0821 01064000
*      (GPR07P,                                                    0821 01065000
*       GPR14P,                                                    0821 01066000
*       GPR15P) UNRSTD;                                            0821 01067000
*   END;                                                           0822 01068000
*                                                                  0822 01069000
*/* END TPZRETN                                                      */ 01070000
*                                                                  0823 01071000
*                                   /* RETURN LINKAGE                */ 01072000
         EJECT                                                          01073000
*                                                                  0823 01074000
*/********************************************************************/ 01075000
*/*                                                                  */ 01076000
*/* SUBROUTINE-                                                      */ 01077000
*/*      ISTZCLR                                                     */ 01078000
*/*                                                                  */ 01079000
*/* FUNCTION-                                                        */ 01080000
*/*      PROCESS CLEAR (UNBIND,(NOTIFY)) OR NOTIFY ALONE REQUESTS.   */ 01081000
*/*                                                                  */ 01082000
*/*      UPON ENTRY, THE PROCESSING CLEAR FLAG IS SET UNLESS         */ 01083000
*/*      ENTERED TO PROCESS A NOTIFY ALONE.                          */ 01084000
*/*                                                                  */ 01085000
*/*      FOR A CLEAR TYPE REQUEST,                                   */ 01086000
*/*            TRAFFIC IS PROHIBITED ON THE TOP, ATOP, AND CLIP.     */ 01087000
*/*                                                                  */ 01088000
*/*      FOR CLEAR/UNBIND/NOTIFIY AND NOTIFY,                        */ 01089000
*/*            A FSB IS OBTAINED, FORMATTED, AND QUEUED TO THE SIP.  */ 01090000
*/*            FOR NOTIFY,                                           */ 01091000
*/*                THE RPH (ADDRESSED FROM THE LCPB) IS POSTED.      */ 01092000
*/*                                                                  */ 01093000
*/*      FOR MULTIPLE REQUESTS, (CLEAR/UNBIND OR CLEAR/UNBIND/NOTIFY)*/ 01094000
*/*            A TLB IS BUILT AND A POINTER TO IT IS SET IN THE LCPB.*/ 01095000
*/*            DATA TRAFFIC IS PROHIBITED ON THE TOP, ATOP, AND CLIP.*/ 01096000
*/*                                                                  */ 01097000
*/********************************************************************/ 01098000
*                                                                  0823 01099000
*ISTZCLR:                                                          0823 01100000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* ISTZCLR SUBROUTINE            */ 01101000
ISTZCLR  DS    0H                                                  0824 01102000
*   RFY                                                            0824 01103000
*     R14 RSTD;                     /* TO SAVE RETURN POINTER        */ 01104000
*   R14SAVE=R14;                    /* SAVE RETURN POINTER           */ 01105000
         ST    R14,R14SAVE(,ZCRRPTR)                               0825 01106000
*   RFY                                                            0826 01107000
*     R14 UNRSTD;                   /* SAVED                         */ 01108000
*   IF LCCWOP^=LNFY THEN            /* IF NOT NOTIFY OPERATION       */ 01109000
         L     @14,LCCWPTR(,ZCRRPTR)                               0827 01110000
         CLI   LCCWOP(@14),X'F5'                                   0827 01111000
         BE    @RF00827                                            0827 01112000
*     FMCCIPI=ON;                   /* FLAG CLEAR IN PROCESS         */ 01113000
         OI    FMCCIPI(FMCBPTR),B'01000000'                        0828 01114000
*   ELSE                                                           0829 01115000
*     ;                             /* IF NOTIFY OPERATION CODE      */ 01116000
@RF00827 DS    0H                                                  0830 01117000
*   IF LCCWOP=LCLEAR THEN                                          0830 01118000
         L     @14,LCCWPTR(,ZCRRPTR)                               0830 01119000
         CLI   LCCWOP(@14),X'F2'                                   0830 01120000
         BNE   @RF00830                                            0830 01121000
*     DO;                           /* IF HANDLING A CLEAR           */ 01122000
*       ZCRTPINV=ON;                /* SET INVOKE TPIOS BIT ON TO  0832 01123000
*                                      CAUSE RETURN CODE 0           */ 01124000
         OI    ZCRTPINV(ZCRRPTR),B'01000000'                       0832 01125000
*       CALL ISTZPBST;              /* INHIBIT DATA TRAFFIC          */ 01126000
         BAL   @14,ISTZPBST                                        0833 01127000
*     END;                          /* END CLEAR PROCESSING          */ 01128000
*   ELSE                                                           0835 01129000
*     DO;                           /* NOT CLEAR ALONE               */ 01130000
         B     @RC00830                                            0835 01131000
@RF00830 DS    0H                                                  0836 01132000
*       IF LCCWOP=LNFY THEN                                        0836 01133000
         L     @14,LCCWPTR(,ZCRRPTR)                               0836 01134000
         CLI   LCCWOP(@14),X'F5'                                   0836 01135000
         BNE   @RF00836                                            0836 01136000
*         DO;                       /* IF NOTIFY ALONE               */ 01137000
*           CALL NOTIFY;            /* PROCESS NOFIFY        @XM19747*/ 01138000
         BAL   @14,NOTIFY                                          0838 01139000
*/* TPDEQ (LCPBPTR,FMCPAB5) RESET(YES)                               */ 01140000
*                                                                  0839 01141000
*           DO;                     /* BEGIN TPDEQ CODE GENERATION   */ 01142000
*             DCL                                                  0840 01143000
*               FMZCA035 BIT(32) CONSTANT('80000000'X);            0840 01144000
*             DCL                                                  0841 01145000
*               FMZCB035 BIT(32) CONSTANT('7FFFFFFF'X);            0841 01146000
*             RFY                                                  0842 01147000
*              (GPR00P,                                            0842 01148000
*               GPR01P,                                            0842 01149000
*               GPR14P,                                            0842 01150000
*               GPR15P) RSTD;                                      0842 01151000
*             RFY                                                  0843 01152000
*               ISTWKE;                                            0843 01153000
*             GPR15P=ADDR(FMCPAB5); /* ADDRESS QUEUE POINTER         */ 01154000
         LA    GPR15P,FMCPAB5(,FMCBPTR)                            0844 01155000
*             RFY                                                  0845 01156000
*              (GPR02P,                                            0845 01157000
*               GPR03P) RSTD;                                      0845 01158000
*             STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));            0846 01159000
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0846 01160000
*             GPR03P=LCPBPTR|FMZCA035;                             0847 01161000
         L     @09,@CF00744                                        0847 01162000
         L     GPR03P,LCPBPTR(,ZCRRPTR)                            0847 01163000
         OR    GPR03P,@09                                          0847 01164000
*             GPR14P=FMZCA035;                                     0848 01165000
         LR    GPR14P,@09                                          0848 01166000
*             GPR15P=ADDR(GPR15P->PABWEQA);                        0849 01167000
*FMZL1035:                                                         0850 01168000
*             ;                                                    0850 01169000
FMZL1035 DS    0H                                                  0851 01170000
*             GPR02P=GPR15P->PABWEQA|FMZCA035;                     0851 01171000
         L     GPR02P,PABWEQA(,GPR15P)                             0851 01172000
         O     GPR02P,@CF00744                                     0851 01173000
*             DO WHILE(GPR02P^=GPR14P);                            0852 01174000
         B     @DE00852                                            0852 01175000
@DL00852 DS    0H                                                  0853 01176000
*FMZL2035:                                                         0853 01177000
*               ;                                                  0853 01178000
FMZL2035 DS    0H                                                  0854 01179000
*               IF GPR02P=GPR03P THEN                              0854 01180000
         CR    GPR02P,GPR03P                                       0854 01181000
         BNE   @RF00854                                            0854 01182000
*                 DO;                                              0855 01183000
*                   GPR00P=GPR02P->WKECHAIN;                       0856 01184000
         L     GPR00P,WKECHAIN(,GPR02P)                            0856 01185000
*                   CS(GPR02P,GPR00P,GPR15P->PABWEQA);             0857 01186000
         CS    GPR02P,@00,PABWEQA(GPR15P)                          0857 01187000
*                   BC(7,FMZL3035);                                0858 01188000
         BC    7,FMZL3035                                          0858 01189000
*                   GPR14P=GPR02P;                                 0859 01190000
         LR    GPR14P,GPR02P                                       0859 01191000
*                   GPR14P->WKECHAIN=0;                            0860 01192000
         SLR   @09,@09                                             0860 01193000
         ST    @09,WKECHAIN(,GPR14P)                               0860 01194000
*                 END;                                             0861 01195000
*               ELSE                                               0862 01196000
*                 DO;                                              0862 01197000
         B     @RC00854                                            0862 01198000
@RF00854 DS    0H                                                  0863 01199000
*                   IF(GPR02P->WKECHAIN)=GPR14P THEN               0863 01200000
         C     GPR14P,WKECHAIN(,GPR02P)                            0863 01201000
         BNE   @RF00863                                            0863 01202000
*                     DO;                                          0864 01203000
*                       IF GPR02P->FSBTYPE=FSTYPE THEN             0865 01204000
         CLI   FSBTYPE(GPR02P),X'02'                               0865 01205000
         BNE   @RF00865                                            0865 01206000
*                         DO;                                      0866 01207000
*                           GPR02P=GPR14P;                         0867 01208000
         LR    GPR02P,GPR14P                                       0867 01209000
*                           GOTO FMZL3035;                         0868 01210000
         B     FMZL3035                                            0868 01211000
*                         END;                                     0869 01212000
*                       GPR15P=ADDR(GPR02P->LCPRSTQH);             0870 01213000
@RF00865 LA    GPR15P,LCPRSTQH(,GPR02P)                            0870 01214000
*                       GOTO FMZL1035;                             0871 01215000
         B     FMZL1035                                            0871 01216000
*                     END;                                         0872 01217000
*                   ELSE                                           0873 01218000
*                     DO;                                          0873 01219000
@RF00863 DS    0H                                                  0874 01220000
*                       GPR15P=ADDR(GPR02P->WKECHAIN);             0874 01221000
         LA    GPR15P,WKECHAIN(,GPR02P)                            0874 01222000
*                       GPR02P=GPR02P->WKECHAIN;                   0875 01223000
         L     GPR02P,WKECHAIN(,GPR02P)                            0875 01224000
*                       GOTO FMZL2035;                             0876 01225000
         B     FMZL2035                                            0876 01226000
*                     END;                                         0877 01227000
*                 END;                                             0878 01228000
*FMZL3035:                                                         0879 01229000
*               ;                                                  0879 01230000
@RC00854 DS    0H                                                  0879 01231000
FMZL3035 DS    0H                                                  0880 01232000
*             END;                                                 0880 01233000
@DE00852 CR    GPR02P,GPR14P                                       0880 01234000
         BNE   @DL00852                                            0880 01235000
*ISTA0035:                                                         0881 01236000
*             ;                                                    0881 01237000
ISTA0035 DS    0H                                                  0882 01238000
*             LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));             0882 01239000
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0882 01240000
*             RFY                                                  0883 01241000
*              (GPR02P,                                            0883 01242000
*               GPR03P) UNRSTD;                                    0883 01243000
*             GPR14P=GPR14P&FMZCB035;                              0884 01244000
         N     GPR14P,@CF00742                                     0884 01245000
*             GPR01P->RPHWEA=GPR14P;                               0885 01246000
         ST    GPR14P,RPHWEA(,GPR01P)                              0885 01247000
*             RFY                                                  0886 01248000
*              (GPR00P,                                            0886 01249000
*               GPR01P,                                            0886 01250000
*               GPR14P,                                            0886 01251000
*               GPR15P) UNRSTD;                                    0886 01252000
*           END;                    /* END TPDEQ GENERATION DEQUE  0887 01253000
*                                      LCPB                  @ZA19522*/ 01254000
*/*TPPOST  (LCPRPHA)                                                 */ 01255000
*                                                                  0888 01256000
*           DO;                     /* DECLARE AND RESTRICT REGS     */ 01257000
*             RESPECIFY                                            0889 01258000
*              (GPR00F,                                            0889 01259000
*               GPR01F,                                            0889 01260000
*               GPR04F,                                            0889 01261000
*               GPR05F,                                            0889 01262000
*               GPR06F,                                            0889 01263000
*               GPR14F,                                            0889 01264000
*               GPR15F) RSTD;       /* 0,1,4,5,6,14, AND 15          */ 01265000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)                                 */ 01266000
*/* END OF ATBUILD                                                   */ 01267000
*                                                                  0890 01268000
*             GEN REFS(GPR01P,GPR02F,GPR06F) SETS(RPHWORK);        0890 01269000
        STM GPR02F,GPR06F,RPHWORK(GPR01P)                               01270000
*             GPR04F=LCPRPHA;       /* LOAD RPH PNTR INTO REG 4      */ 01271000
         L     @09,LCPBPTR(,ZCRRPTR)                               0891 01272000
         L     GPR04F,LCPRPHA(,@09)                                0891 01273000
*             RFY                                                  0892 01274000
*               GPR03F RSTD;                                       0892 01275000
*             GPR03F=0;                                            0893 01276000
         SLR   @09,@09                                             0893 01277000
         LR    GPR03F,@09                                          0893 01278000
*             DO;                   /* MODESET SAVEKEY(GPR06F)     0894 01279000
*                                      KEYADDR(GPR03F)             0894 01280000
*                                      WORKREG(GPR05F)               */ 01281000
*               RESPECIFY                                          0895 01282000
*                (GPR02F) RESTRICTED;                              0895 01283000
*               GPR05F=GPR02F;      /* SAVE REGISTER 2               */ 01284000
         LR    GPR05F,GPR02F                                       0896 01285000
*               IPK;                /* SAVE CURRENT PSW KEY          */ 01286000
         IPK                                                       0897 01287000
*               GPR06F=GPR02F;                                     0898 01288000
         LR    GPR06F,GPR02F                                       0898 01289000
*               GPR02F=GPR05F;      /* RESTORE REGISTER 2            */ 01290000
         LR    GPR02F,GPR05F                                       0899 01291000
*               SPKA(GPR03F);       /* SET PSW KEY                   */ 01292000
         SPKA  0(GPR03F)                                           0900 01293000
*               RESPECIFY                                          0901 01294000
*                (GPR02F) UNRESTRICTED;                            0901 01295000
*             END;                  /* MODESET SAVEKEY(GPR06F)     0902 01296000
*                                      KEYADDR(GPR03F)             0902 01297000
*                                      WORKREG(GPR05F)               */ 01298000
*             RFY                                                  0903 01299000
*               GPR03F UNRSTD;                                     0903 01300000
*             GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;/* LOAD REG 5    01301000
*                                      WITH ADDR OF MAJOR CONTROL  0904 01302000
*                                      BLOCK PLUS OFFSET OF PAB IN 0904 01303000
*                                      BLOCK                         */ 01304000
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          0904 01305000
         LA    GPR05P,0(,GPR05P)                                   0904 01306000
         SLR   @07,@07                                             0904 01307000
         IC    @07,RPHPABOF(,GPR04P)                               0904 01308000
         ALR   GPR05P,@07                                          0904 01309000
*             GPR14P=0;             /* LOAD 0 INTO REG 14            */ 01310000
         LR    GPR14P,@09                                          0905 01311000
*             GPR15P='FFFFFFFF'X;   /* LOAD REG 15 WITH DUMMY ADDRESS*/ 01312000
         SLR   GPR15P,GPR15P                                       0906 01313000
         BCTR  GPR15P,0                                            0906 01314000
*             CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE RESUME 0907 01315000
*                                      ADDRESS WITH 0 AND,IF EQUAL,     01316000
*                                      PUT DUMMY ADDRESS IN CONTROL     01317000
*                                      BLOCK RESUME ADDRESS          */ 01318000
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0907 01319000
*             BC(8,FMZT0042);       /* IF EQUAL, BYPASS REMAINDER OF    01320000
*                                      EXPANSION                     */ 01321000
         BC    8,FMZT0042                                          0908 01322000
*FMZL0042:                                                         0909 01323000
*             IF GPR04P->RPHWT='1'B THEN/* WT/EXT CONTENTION FLAG ON */ 01324000
FMZL0042 TM    RPHWT(GPR04P),B'00001000'                           0909 01325000
         BNO   @RF00909                                            0909 01326000
*               DO;                 /* IN RPH                        */ 01327000
*                 GPR14P=GPR04P->RPHRESMA|RPHWT1;/* LOAD REG 14 WITH    01328000
*                                      FLAG FIELD AND MAKE CERTAIN 0911 01329000
*                                      WT/EXT CONTENTION FLAG STILL     01330000
*                                      ON                            */ 01331000
         L     GPR14P,RPHRESMA(,GPR04P)                            0911 01332000
         O     GPR14P,@CF00768                                     0911 01333000
*                 GPR15P=GPR14P|RPHPT1;/* LOAD REG 15 WITH FLAG FIELD   01334000
*                                      AND TURN POST FLAG ON         */ 01335000
         LR    GPR15P,GPR14P                                       0912 01336000
         O     GPR15P,@CF00758                                     0912 01337000
*                 CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE REG     01338000
*                                      14 WITH FLAG FIELD--IF WT/EXT    01339000
*                                      BIT ON, TURN ON POST FLAG     */ 01340000
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         0913 01341000
*                 BC(4,FMZL0042);   /* IF WT/EXT BIT WAS OFF, LOOP TO   01342000
*                                      TEST CONTENTION FLAG          */ 01343000
         BC    4,FMZL0042                                          0914 01344000
*                 BC(8,FMZT0042);   /* IF WT/EXT BIT WAS OFF, BRANCH    01345000
*                                      TO BYPASS CODE GEN            */ 01346000
         BC    8,FMZT0042                                          0915 01347000
*               END;                /* IF POST FLAG IS ON, FALL THRU    01348000
*                                      BOTTOM OF LOOP                */ 01349000
*             ELSE                                                 0917 01350000
*               ;                   /* WT/EXT CONTENTION FLAG OFF    */ 01351000
@RF00909 DS    0H                                                  0918 01352000
*             IF GPR04P->RPHTSKID=GPR01P->RPHTSKID THEN            0918 01353000
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 0918 01354000
         BNE   @RF00918                                            0918 01355000
*               DO;                                                0919 01356000
*                 GPR05P->PABCHNGP=GPR01P->RPHPABQP;/* PUT PAB QUEUE    01357000
*                                      ADDRESS IN SECOND WORD OF PAB */ 01358000
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 0920 01359000
*                 GPR01P->RPHPABQP=GPR05P;/* PUT PAB ADDRESS (IN   0921 01360000
*                                      MAJOR CONTROL BLOCK) IN PAB 0921 01361000
*                                      QUEUE ADRESS IN RPH           */ 01362000
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           0921 01363000
*               END;                                               0922 01364000
*             ELSE                                                 0923 01365000
*               DO;                                                0923 01366000
         B     @RC00918                                            0923 01367000
@RF00918 DS    0H                                                  0924 01368000
*                 GPR00F=0;         /* SET REG 0 TO INDICATE ENA     */ 01369000
         SLR   GPR00F,GPR00F                                       0924 01370000
*                 DO;               /* LISATCVT                    0925 01371000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01372000
*                   GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER          */ 01373000
         L     GPR15P,ATCLCPTR                                     0926 01374000
*                 END;              /* LISATCVT PUT POINTER TO ATCVT    01375000
*                                      IN IN REG 15                  */ 01376000
*                 CALL GPR15P->ATCAP32;/* CALL ISTAPC32: TPSCHED     */ 01377000
         L     @09,ATCAP32(,GPR15P)                                0928 01378000
         LR    @15,@09                                             0928 01379000
         BALR  @14,@15                                             0928 01380000
*               END;                                               0929 01381000
*FMZT0042:                                                         0930 01382000
*             DO;                   /* MODESET KEYADDR(GPR06F)     0930 01383000
*                                      WORKREG(GPR05F)               */ 01384000
@RC00918 DS    0H                                                  0930 01385000
FMZT0042 DS    0H                                                  0931 01386000
*               GPR05F=GPR06F;      /* GET KEY FORM SAVE LOCATION    */ 01387000
         LR    GPR05F,GPR06F                                       0931 01388000
*               SPKA(GPR05F);       /* SET PSW KEY                   */ 01389000
         SPKA  0(GPR05F)                                           0932 01390000
*             END;                  /* MODESET KEYADDR(GPR06F)     0933 01391000
*                                      WORKREG(GPR05F)               */ 01392000
*             GEN REFS(GPR04P,RPHWORK) SETS(GPR02F,GPR03F,GPR04F,GPR05F 01393000
*                 ,GPR06F);                                        0934 01394000
        LM GPR02F,GPR06F,RPHWORK(GPR01P)                                01395000
*             RESPECIFY                                            0935 01396000
*              (GPR00F,                                            0935 01397000
*               GPR01F,                                            0935 01398000
*               GPR04F,                                            0935 01399000
*               GPR05F,                                            0935 01400000
*               GPR06F,                                            0935 01401000
*               GPR14F,                                            0935 01402000
*               GPR15F) UNRSTD;     /* UNRESTRICT REGS 0,1, 4,5,14,     01403000
*                                      AND 15                        */ 01404000
*           END;                    /* ***END OF TPPOST GENERATION***   01405000
*                                      POST THE RPH (FROM LCPB)      */ 01406000
*           ZCRTPEX=ON;             /* TURN ON TPEXIT FLAG           */ 01407000
         OI    ZCRTPEX(ZCRRPTR),B'10000000'                        0937 01408000
*         END;                      /* END NOTIFY ALONE              */ 01409000
*       ELSE                                                       0939 01410000
*         DO;                       /* NOT NOTIFY ALONE              */ 01411000
         B     @RC00836                                            0939 01412000
@RF00836 DS    0H                                                  0940 01413000
*/********************************************************************/ 01414000
*/*                                                                  */ 01415000
*/*      THIS CODE IS FOR GETTING AND FORMATTING A TLB TO HANDLE     */ 01416000
*/*      MULTIPLE REQUESTS . THIS IS NECESSARY FOR CLEAR/UNBIND      */ 01417000
*/*      AND CLEAR/UNBIND/NOTIFY. THE TLB IS OBTAINED AND THE        */ 01418000
*/*      LCCWS ARE BUILT BY PUTTING IN A CLEAR LCCW AND COPYING      */ 01419000
*/*      THE LCCWS POINTED TO BY LCPNXLCW IN THE LCPB INTO THE TLB.  */ 01420000
*/*                                                                  */ 01421000
*/********************************************************************/ 01422000
*                                                                  0940 01423000
*           IF LCCWOP=LCLRNFY THEN                                 0940 01424000
         L     @14,LCCWPTR(,ZCRRPTR)                               0940 01425000
         CLI   LCCWOP(@14),X'F8'                                   0940 01426000
         BE    @RT00940                                            0940 01427000
*             ;                     /* IF CLEAR/NOTIFY               */ 01428000
*           ELSE                                                   0942 01429000
*             DO;                   /* NOT CLEAR/NOTIFY              */ 01430000
*               RFY                                                0943 01431000
*                 COUNT RSTD;       /* WORK REGISTER         @XM08890*/ 01432000
*               COUNT=1;            /* INITIALIZE COUNT              */ 01433000
         LA    COUNT,1                                             0944 01434000
*ZCRL01:                                                           0945 01435000
*               DO WHILE LCCWOP=LTIC;/* IGNORE TICS          @XM08890*/ 01436000
ZCRL01   B     @DE00945                                            0945 01437000
@DL00945 DS    0H                                                  0946 01438000
*                 LCCWPTR=LCCWDATA; /* BYPASS TIC            @XM08890*/ 01439000
         L     @14,LCCWPTR(,ZCRRPTR)                               0946 01440000
         L     @14,LCCWDATA(,@14)                                  0946 01441000
         ST    @14,LCCWPTR(,ZCRRPTR)                               0946 01442000
*               END;                /* END TIC SLUFF         @XM08890*/ 01443000
@DE00945 L     @14,LCCWPTR(,ZCRRPTR)                               0947 01444000
         CLI   LCCWOP(@14),X'08'                                   0947 01445000
         BE    @DL00945                                            0947 01446000
*               COUNT=COUNT+1;      /* BUMP LCCW COUNT       @XM08890*/ 01447000
         AL    COUNT,@CF00060                                      0948 01448000
*               IF LCCWCD=ON        /* IF DATA CHAINED       @XM08890*/ 01449000
*                   |LCCWCC=ON THEN                                0949 01450000
         TM    LCCWCD(@14),B'11000000'                             0949 01451000
         BZ    @RF00949                                            0949 01452000
*                 DO;               /* | COMMAND CHAINED     @XM08890*/ 01453000
*                   LCCWPTR=LCCWPTR+LENGTH(ISTLCCW);/* ADDRESS NEXT     01454000
*                                      LCCW                  @XM08890*/ 01455000
         AL    @14,@CF00058                                        0951 01456000
         ST    @14,LCCWPTR(,ZCRRPTR)                               0951 01457000
*                   GO TO ZCRL01;   /* CONTINUE TIC SCAN     @XM08890*/ 01458000
         B     ZCRL01                                              0952 01459000
*                 END;              /* END CHAINING          @XM08890*/ 01460000
*               ELSE                                               0954 01461000
*                 ;                 /* IF NOT CHAINED        @XM08890*/ 01462000
@RF00949 DS    0H                                                  0955 01463000
*               LENTLB=LENGTH(ISTTLB)+(COUNT*8);/* TLB REQSTORE LNGTH   01464000
*                                                            @XM08890*/ 01465000
         LR    @14,COUNT                                           0955 01466000
         SLA   @14,3                                               0955 01467000
         AL    @14,@CF00058                                        0955 01468000
         ST    @14,LENTLB(,ZCRRPTR)                                0955 01469000
*               RFY                                                0956 01470000
*                 COUNT UNRSTD;     /* END USAGE             @XM08890*/ 01471000
*               LCCWPTR=LCPNXLCW;   /* RESTORE LCCW POINTER          */ 01472000
*                                                                  0957 01473000
         L     @14,LCPBPTR(,ZCRRPTR)                               0957 01474000
         L     @14,LCPNXLCW(,@14)                                  0957 01475000
         ST    @14,LCCWPTR(,ZCRRPTR)                               0957 01476000
*               /*****************************************************/ 01477000
*               /*                                                   */ 01478000
*               /* REQSTORE PGBUF(LENTLB)CLEAR(YES)RPH(RPHPTR)       */ 01479000
*               /*                                                   */ 01480000
*               /*****************************************************/ 01481000
*                                                                  0958 01482000
*               DO;                                                0958 01483000
*                                                                  0958 01484000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 01485000
*/* END OF ATBUILD                                                   */ 01486000
*                                                                  0959 01487000
*                 RFY                                              0959 01488000
*                  (GPR02P,                                        0959 01489000
*                   GPR03P,                                        0959 01490000
*                   GPR04P,                                        0959 01491000
*                   GPR15P) RSTD;                                  0959 01492000
*                 RFY                                              0960 01493000
*                  (GPR01P) RSTD;                                  0960 01494000
*                 GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);    01495000
           STM GPR02P,GPR13P,RPHWORK(GPR01P)                            01496000
*                 RFY                                              0962 01497000
*                  (GPR01P) UNRSTD;                                0962 01498000
*                 DO;               /* LISATCVT                    0963 01499000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01500000
*                   GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER          */ 01501000
         L     GPR15P,ATCLCPTR                                     0964 01502000
*                 END;              /* LISATCVT                      */ 01503000
*                 RFY                                              0966 01504000
*                   ISTBPENT;                                      0966 01505000
*                 RFY                                              0967 01506000
*                   ISTBPDTY;                                      0967 01507000
*                 GPR02P=GPR15P->ATCBPDA->BPDPGPCB;                0968 01508000
         L     @14,ATCBPDA(,GPR15P)                                0968 01509000
         L     GPR02P,BPDPGPCB(,@14)                               0968 01510000
*                 DCL                                              0969 01511000
*                   1 FMZA0054 FIXED(31) STATIC LOCAL,             0969 01512000
*                    2 * FIXED(8) INIT(168),                       0969 01513000
*                    2 * PTR(24) INIT(0);                          0969 01514000
*                 GPR03F=FMZA0054;                                 0970 01515000
         L     GPR03F,FMZA0054                                     0970 01516000
*                 GPR04F=LENTLB;                                   0971 01517000
         L     GPR04F,LENTLB(,ZCRRPTR)                             0971 01518000
*                 GPR15P=GPR15P->ATCSMRQ;                          0972 01519000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0972 01520000
*                 DCL                                              0973 01521000
*                   FMZL0054 BASED(GPR15P) LABEL VALUERANGE(*);    0973 01522000
*                 CALL FMZL0054;                                   0974 01523000
         BALR  @14,@15                                             0974 01524000
*                 GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);    01525000
           LM GPR02P,GPR13P,RPHWORK(GPR01P)                             01526000
*                 RFY                                              0976 01527000
*                  (GPR02P,                                        0976 01528000
*                   GPR03P,                                        0976 01529000
*                   GPR04P,                                        0976 01530000
*                   GPR15P) UNRSTD;                                0976 01531000
*               END;                                               0977 01532000
*                                                                  0977 01533000
*               /*****************************************************/ 01534000
*               /*                                                   */ 01535000
*               /* ******** END OF REQSTORE EXPANSION                */ 01536000
*               /*                                                   */ 01537000
*               /*****************************************************/ 01538000
*                                                                  0978 01539000
*                                   /* ALLOCATE TLB BUFFER           */ 01540000
*               RFY                                                0978 01541000
*                (R15) RSTD;        /* RETURN CODE REGISTER          */ 01542000
*               IF R15=8 THEN                                      0979 01543000
         C     R15,@CF00058                                        0979 01544000
         BNE   @RF00979                                            0979 01545000
*                 DO;               /* IF TPWAIT REQUIRED            */ 01546000
*                   RFY                                            0981 01547000
*                    (R15) UNRSTD;  /* NO LONGER REQUIRED            */ 01548000
*/*  TPWAIT                                                          */ 01549000
*                                                                  0982 01550000
*                   DO;             /* BEGIN TPWAIT GENERATION       */ 01551000
*                     RFY                                          0983 01552000
*                      (GPR01P,                                    0983 01553000
*                       GPR14P,                                    0983 01554000
*                       GPR15P) RSTD;                              0983 01555000
*                     RFY                                          0984 01556000
*                      (GPR00P) RSTD;                              0984 01557000
*                     GEN(STM   GPR00P,GPR15P,RPHWORK(GPR01P))     0985 01558000
*                     REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);    0985 01559000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            01560000
*                     RFY                                          0986 01561000
*                      (GPR00P) UNRSTD;                            0986 01562000
*                     GPR15P=ADDR(LHAA0074);                       0987 01563000
         LA    GPR15P,LHAA0074                                     0987 01564000
*                     GPR14P=0;                                    0988 01565000
         SLR   GPR14P,GPR14P                                       0988 01566000
*                     GPR15P=GPR15P&'00FFFFFF'X;                   0989 01567000
         N     GPR15P,@CF04147                                     0989 01568000
*                     GPR15P=GPR15P|RPHWT1;                        0990 01569000
         O     GPR15P,@CF00768                                     0990 01570000
*                     CS(GPR14P,GPR15P,GPR01P->RPHRESMA);          0991 01571000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         0991 01572000
*                     BC(7,LHAB0074);                              0992 01573000
*                                                                  0992 01574000
         BC    7,LHAB0074                                          0992 01575000
*/* TPEXIT  NONE                                                     */ 01576000
*                                                                  0993 01577000
*                     DO;                                          0993 01578000
*                       RESPECIFY                                  0994 01579000
*                         GPR15P RSTD;                             0994 01580000
*                                                                  0994 01581000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */ 01582000
*/* END OF ATBUILD                                                   */ 01583000
*                                                                  0995 01584000
*                       DO;         /* LISATCVT                    0995 01585000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 01586000
*                         GPR15P=ATCLCPTR;/* SET UP ATCVT POINTER    */ 01587000
         L     GPR15P,ATCLCPTR                                     0996 01588000
*                       END;        /* LISATCVT                      */ 01589000
*                       RESPECIFY                                  0998 01590000
*                         GPR00F RSTD;                             0998 01591000
*                       GPR00F=0;   /* SET PARAMETER REGISTER TO 0   */ 01592000
         SLR   GPR00F,GPR00F                                       0999 01593000
*                       GPR15P=GPR15P->ATCAP31;                    1000 01594000
         L     GPR15P,ATCAP31(,GPR15P)                             1000 01595000
*                       DCL                                        1001 01596000
*                         FMZL0079 BASED(GPR15P) LABEL VALUERANGE(*);   01597000
*                       CALL FMZL0079;                             1002 01598000
         BALR  @14,@15                                             1002 01599000
*                       RESPECIFY                                  1003 01600000
*                        (GPR00F,                                  1003 01601000
*                         GPR15P) UNRSTD;                          1003 01602000
*                     END;          /* **** END OF TPEXIT            */ 01603000
*LHAB0074:                                                         1005 01604000
*                     ;                                            1005 01605000
LHAB0074 DS    0H                                                  1006 01606000
*                     GPR01P->RPHRESMA=0;                          1006 01607000
         SLR   @15,@15                                             1006 01608000
         ST    @15,RPHRESMA(,GPR01P)                               1006 01609000
*                     RFY                                          1007 01610000
*                      (GPR00P) RSTD;                              1007 01611000
*LHAA0074:                                                         1008 01612000
*                     ;                                            1008 01613000
LHAA0074 DS    0H                                                  1009 01614000
*                     GEN(LM    GPR00P,GPR15P,RPHWORK(GPR01P))     1009 01615000
*                     REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);    1009 01616000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            01617000
*                     RFY                                          1010 01618000
*                      (GPR00P,                                    1010 01619000
*                       GPR01P,                                    1010 01620000
*                       GPR14P,                                    1010 01621000
*                       GPR15P) UNRSTD;                            1010 01622000
*                   END;            /* ****END OF TPWAIT WAIT FOR  1011 01623000
*                                      STORAGE                       */ 01624000
*                 END;              /* END STORAGE WAIT              */ 01625000
*               ELSE                                               1013 01626000
*                 ;                 /* WAIT NOT REQUIRED             */ 01627000
@RF00979 DS    0H                                                  1014 01628000
*               TLBPTR=RPHSRPRM+LENGTH(ISTBFHDR);/* ADDRESS TLB      */ 01629000
         LA    @09,8                                               1014 01630000
         AL    @09,RPHSRPRM(,RPHPTR)                               1014 01631000
         ST    @09,TLBPTR(,ZCRRPTR)                                1014 01632000
*               TLBLCCWS(1:8)=TLCLRLCW;/* PUT CLEAR LCCW IN TLB      */ 01633000
         MVC   TLBLCCWS(8,@09),@CB03023                            1015 01634000
*               IF LCCWOP=LCRUDNFY THEN/* IF CLEAR/UNBIND/NOTIFY   1016 01635000
*                                                            @XM19747*/ 01636000
         L     @07,LCCWPTR(,ZCRRPTR)                               1016 01637000
         CLI   LCCWOP(@07),X'F4'                                   1016 01638000
         BNE   @RF01016                                            1016 01639000
*                 TLBLCCWS(1)=LCLRNFY;/* MAKE LCCW=CLEAR/NOTIFY    1017 01640000
*                                                            @XM19747*/ 01641000
         MVI   TLBLCCWS(@09),X'F8'                                 1017 01642000
*               ELSE                                               1018 01643000
*                 ;                 /* NOT CLEAR/UNBIND/NOTIFY     1018 01644000
*                                                            @XM19747*/ 01645000
@RF01016 DS    0H                                                  1019 01646000
*               TLBLCPA=LCPNXLCW;   /* SAVE LCCW PTR FROM LCPB       */ 01647000
         L     @09,TLBPTR(,ZCRRPTR)                                1019 01648000
         L     @07,LCPBPTR(,ZCRRPTR)                               1019 01649000
         L     @07,LCPNXLCW(,@07)                                  1019 01650000
         ST    @07,TLBLCPA(,@09)                                   1019 01651000
*ZCRL00:                                                           1020 01652000
*               ;                   /* LOOP UNTIL ALL LCCWS COPIED   */ 01653000
ZCRL00   DS    0H                                                  1021 01654000
*               TLBPTR=TLBPTR+8;    /* UPDATE TLBLCCW POINTER        */ 01655000
         LA    @09,8                                               1021 01656000
         AL    @09,TLBPTR(,ZCRRPTR)                                1021 01657000
         ST    @09,TLBPTR(,ZCRRPTR)                                1021 01658000
*               DO WHILE LCCWOP=LTIC;/* IGNORE TICS                  */ 01659000
         B     @DE01022                                            1022 01660000
@DL01022 DS    0H                                                  1023 01661000
*                 LCCWPTR=LCCWDATA; /* ADDRESS NEXT LCCW FROM TIC    */ 01662000
         L     @09,LCCWPTR(,ZCRRPTR)                               1023 01663000
         L     @09,LCCWDATA(,@09)                                  1023 01664000
         ST    @09,LCCWPTR(,ZCRRPTR)                               1023 01665000
*               END;                /* TICS IGNORED                  */ 01666000
@DE01022 L     @09,LCCWPTR(,ZCRRPTR)                               1024 01667000
         CLI   LCCWOP(@09),X'08'                                   1024 01668000
         BE    @DL01022                                            1024 01669000
*               TLBLCCWS(1:8)=ISTLCCW;/* COPY THE LCCW               */ 01670000
         L     @07,TLBPTR(,ZCRRPTR)                                1025 01671000
         MVC   TLBLCCWS(8,@07),ISTLCCW(@09)                        1025 01672000
*               IF LCCWCD=ON        /* IF DATA CHAINED               */ 01673000
*                   |LCCWCC=ON THEN                                1026 01674000
         TM    LCCWCD(@09),B'11000000'                             1026 01675000
         BZ    @RF01026                                            1026 01676000
*                 DO;               /* | COMMAND CHAINED             */ 01677000
*                   LCCWPTR=LCCWPTR+LENGTH(ISTLCCW);               1028 01678000
         AL    @09,@CF00058                                        1028 01679000
         ST    @09,LCCWPTR(,ZCRRPTR)                               1028 01680000
*                   GO TO ZCRL00;   /* PROCESS NEXT LCCW             */ 01681000
         B     ZCRL00                                              1029 01682000
*                 END;              /* END LCCW LOOP                 */ 01683000
*               ELSE                                               1031 01684000
*                 DO;               /* NOT CHAINED LCCW              */ 01685000
@RF01026 DS    0H                                                  1032 01686000
*                   TLBPTR=RPHSRPRM+LENGTH(ISTBFHDR);/* RE-ADDRESS 1032 01687000
*                                      TLB BUFFER                    */ 01688000
         LA    @09,8                                               1032 01689000
         AL    @09,RPHSRPRM(,RPHPTR)                               1032 01690000
         ST    @09,TLBPTR(,ZCRRPTR)                                1032 01691000
*                   LCPNXLCW=ADDR(TLBLCCWS);/* ADDRESS LCCW FROM TLB */ 01692000
         L     @07,LCPBPTR(,ZCRRPTR)                               1033 01693000
         LA    @00,TLBLCCWS(,@09)                                  1033 01694000
         ST    @00,LCPNXLCW(,@07)                                  1033 01695000
*                   LCPTLBAD=TLBPTR;/* SAVE TLB POINTER              */ 01696000
         ST    @09,LCPTLBAD(,@07)                                  1034 01697000
*                   LCPTLBPI=ON;    /* FLAG TLB PRESENT              */ 01698000
         OI    LCPTLBPI(@07),B'00010000'                           1035 01699000
*                   LCCWPTR=LCPNXLCW;/* ADDRESS FIRST LCCW IN TLB  1036 01700000
*                                                            @XM08990*/ 01701000
         ST    @00,LCCWPTR(,ZCRRPTR)                               1036 01702000
*                 END;              /* END UNCHAINED LCCW            */ 01703000
*             END;                  /* END NOT CLEAR/NOTIFY          */ 01704000
*           ZCRTPINV=ON;            /* SET EXIT FLAG FOR RETURN CODE    01705000
*                                      ZERO                          */ 01706000
@RT00940 OI    ZCRTPINV(ZCRRPTR),B'01000000'                       1039 01707000
*           CALL ISTZPBST;          /* PROHIBIT DATA TRAFFIC         */ 01708000
         BAL   @14,ISTZPBST                                        1040 01709000
*         END;                      /* NOT NOTIFY ALONE              */ 01710000
*     END;                          /* NOT CLEAR ALONE               */ 01711000
@RC00836 DS    0H                                                  1043 01712000
*   RFY                                                            1043 01713000
*     R14 RSTD;                     /* TO RESTORE RETURN ADDRESS     */ 01714000
@RC00830 DS    0H                                                  1044 01715000
*   R14=R14SAVE;                    /* RESTORE RETURN ADDRESS        */ 01716000
         L     R14,R14SAVE(,ZCRRPTR)                               1044 01717000
*   RFY                                                            1045 01718000
*     R14 UNRSTD;                   /* RESTORED                      */ 01719000
*   END ISTZCLR;                    /* END OF SUBROUTINE             */ 01720000
@EL00002 DS    0H                                                  1046 01721000
@EF00002 DS    0H                                                  1046 01722000
@ER00002 BR    @14                                                 1046 01723000
*/********************************************************************/ 01724000
*/*      ISTZCLR SUBROUTINE END                                      */ 01725000
*/********************************************************************/ 01726000
*                                                                  1047 01727000
         EJECT                                                          01728000
*                                                                  1047 01729000
*/***********************************************************@XM19747*/ 01730000
*/*                                                          @XM19747*/ 01731000
*/* SUBROUTINE-                                              @XM19747*/ 01732000
*/*      NOTIFY                                              @XM19747*/ 01733000
*/*                                                          @XM19747*/ 01734000
*/* FUNCTION-                                                @XM19747*/ 01735000
*/*      PROCESS NOTIFY FUNCTION OF LCCW.                    @XM19747*/ 01736000
*/*                                                          @XM19747*/ 01737000
*/***********************************************************@XM19747*/ 01738000
*                                                                  1047 01739000
*   RFY                                                            1047 01740000
*     R14 RSTD;                     /* TO SAVE RETURN REG    @XM19747*/ 01741000
*NOTIFY:                                                           1048 01742000
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/* NOTIFY: SUBROUTINE     1048 01743000
*                                                            @XM19747*/ 01744000
NOTIFY   DS    0H                                                  1049 01745000
*   NFYSAVE=R14;                    /* SAVE RETURN REG       @XM19747*/ 01746000
         ST    R14,NFYSAVE(,ZCRRPTR)                               1049 01747000
*   RFY                                                            1050 01748000
*     R14 UNRSTD;                   /* SAVED                 @XM19747*/ 01749000
*   ZCRPCOD1=0;                     /* ZDFA0 PARAMETER       @XM19747*/ 01750000
         MVI   ZCRPCOD1(ZCRRPTR),X'00'                             1051 01751000
*   ZCRPFSB=ON;                     /* ZDFA0 PARAMETER       @XM19747*/ 01752000
         OI    ZCRPFSB(ZCRRPTR),B'00100000'                        1052 01753000
*   CALL ISTZDFA0;                  /* BUFFER ALLOCATION UTILITY   1053 01754000
*                                                            @XM19747*/ 01755000
         L     @09,ATCZPSVT(,ATCVTPTR)                             1053 01756000
         L     @15,ZPSZDFA0(,@09)                                  1053 01757000
         BALR  @14,@15                                             1053 01758000
*   RPHSRPRM->FSBSAF=FMCSAF;        /* SET SOURCE ADDRESS IN FSB   1054 01759000
*                                                            @XM19747*/ 01760000
         L     @09,RPHSRPRM(,RPHPTR)                               1054 01761000
         MVC   FSBSAF(2,@09),FMCSAF(FMCBPTR)                       1054 01762000
*   RPHSRPRM->FSBDAF=ADDR(FMCDNCBA->LUNCB)->NCBDAF;/* SET DESCINATION   01763000
*                                      ADDR IN FSB           @XM19747*/ 01764000
         L     @07,FMCDNCBA(,FMCBPTR)                              1055 01765000
         MVC   FSBDAF(2,@09),NCBDAF(@07)                           1055 01766000
*   RPHSRPRM->FSBMJRCD=FRNOTIFY;    /* MAJOR=NOTIFY          @XM19747*/ 01767000
         MVI   FSBMJRCD(@09),X'30'                                 1056 01768000
*   RPHSRPRM->FSBMNRCD=LCPRUCNT;    /* MINOR=LCPB CODE       @XM19747*/ 01769000
         L     @07,LCPBPTR(,ZCRRPTR)                               1057 01770000
         MVC   FSBMNRCD(1,@09),LCPRUCNT(@07)                       1057 01771000
*/*  TPQUE (RPHSRPRM,FMCSIPA->PABWEQA) NORM                          */ 01772000
*                                                                  1058 01773000
*   DO;                                                            1058 01774000
*     RFY                                                          1059 01775000
*      (GPR00P,                                                    1059 01776000
*       GPR01P,                                                    1059 01777000
*       GPR04P,                                                    1059 01778000
*       GPR05P,                                                    1059 01779000
*       GPR15P) RSTD;                                              1059 01780000
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P)) 01781000
*         ;                                                        1060 01782000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              01783000
*     GPR00P=0;                                                    1061 01784000
         SLR   GPR00P,GPR00P                                       1061 01785000
*     GPR15P=ADDR(FMCSIPA->PABWEQA);/* HOLD PAB PTR                  */ 01786000
         L     GPR15P,FMCSIPA(,FMCBPTR)                            1062 01787000
*     GPR04P=RPHSRPRM;              /* WORK ELE PTR                  */ 01788000
         L     GPR04P,RPHSRPRM(,RPHPTR)                            1063 01789000
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */ 01790000
         LR    GPR05P,GPR15P                                       1064 01791000
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            1065 01792000
         L     @09,ATCLCPTR                                        1065 01793000
         L     @15,ATCAP37(,@09)                                   1065 01794000
         BALR  @14,@15                                             1065 01795000
*     GEN(NOPR  0)                                                 1066 01796000
*     NOSETS NOREFS;                                               1066 01797000
         NOPR  0                                                        01798000
*     RFY                                                          1067 01799000
*      (GPR00P,                                                    1067 01800000
*       GPR01P,                                                    1067 01801000
*       GPR04P,                                                    1067 01802000
*       GPR05P,                                                    1067 01803000
*       GPR15P) UNRSTD;                                            1067 01804000
*   END;                            /* *** END OF TPQUE GENERATION 1068 01805000
*                                      QUEUE FSB TO SSCP PAB @XM19747*/ 01806000
*   RFY                                                            1069 01807000
*     R14 RSTD;                     /* TO RESTORE RETURN REG @XM19747*/ 01808000
*   R14=NFYSAVE;                    /* RESTORE RETURN REG    @XM19747*/ 01809000
         L     R14,NFYSAVE(,ZCRRPTR)                               1070 01810000
*   RFY                                                            1071 01811000
*     R14 UNRSTD;                   /* RESTORED              @XM19747*/ 01812000
*   END NOTIFY;                     /* END NOTIFY            @XM19747*/ 01813000
@EL00003 DS    0H                                                  1072 01814000
@EF00003 DS    0H                                                  1072 01815000
@ER00003 BR    @14                                                 1072 01816000
*/***********************************************************@XM19747*/ 01817000
*/*      NOTIFY SUBROUTINE END                               @XM19747*/ 01818000
*/***********************************************************@XM19747*/ 01819000
*                                                                  1073 01820000
         EJECT                                                          01821000
*                                                                  1073 01822000
*/********************************************************************/ 01823000
*/*                                                                  */ 01824000
*/* SUBROUTINE-                                                      */ 01825000
*/*      ISTFDB                                                      */ 01826000
*/*                                                                  */ 01827000
*/* FUNCTION-                                                        */ 01828000
*/*      RETURN STATUS TO REQUESTOR.                                 */ 01829000
*/*                                                                  */ 01830000
*/********************************************************************/ 01831000
*                                                                  1073 01832000
*   RFY                                                            1073 01833000
*    (R14) RSTD;                    /* TO SAVE RETURN REGISTER       */ 01834000
*ISTZFDB:                                                          1074 01835000
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/* ISTZFDB: SUBROUTINE      */ 01836000
ISTZFDB  DS    0H                                                  1075 01837000
*   R14SAVE=R14;                    /* SAVE RETURN ADDRESS           */ 01838000
         ST    R14,R14SAVE(,ZCRRPTR)                               1075 01839000
*   IF ZCRFSBWE=OFF THEN            /* IF INPUT WAS AN LCPB  @ZA09592*/ 01840000
         TM    ZCRFSBWE(ZCRRPTR),B'00000100'                       1076 01841000
         BNZ   @RF01076                                            1076 01842000
*     IF ZCRRJLCP=ON THEN           /* IF INPUT HAS BEEN REJECTED  1077 01843000
*                                                            @ZA09592*/ 01844000
         TM    ZCRRJLCP(ZCRRPTR),B'00100000'                       1077 01845000
         BNO   @RF01077                                            1077 01846000
*/* TPDEQ (LCPBPTR,FMCPAB5) RESET(RECON)                             */ 01847000
*                                                                  1078 01848000
*       DO;                         /* BEGIN TPDEQ CODE GENERATION   */ 01849000
*         RFY                                                      1079 01850000
*          (GPR00P,                                                1079 01851000
*           GPR01P,                                                1079 01852000
*           GPR14P,                                                1079 01853000
*           GPR15P) RSTD;                                          1079 01854000
*         GPR15P=ADDR(FMCPAB5);     /* ADDRESS QUEUE POINTER         */ 01855000
         LA    GPR15P,FMCPAB5(,FMCBPTR)                            1080 01856000
*         RFY                                                      1081 01857000
*          (GPR02P,                                                1081 01858000
*           GPR03P) RSTD;                                          1081 01859000
*         STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                1082 01860000
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1082 01861000
*         GPR03P=LCPBPTR|FMZCA035;                                 1083 01862000
         L     @09,@CF00744                                        1083 01863000
         L     GPR03P,LCPBPTR(,ZCRRPTR)                            1083 01864000
         OR    GPR03P,@09                                          1083 01865000
*         GPR14P=FMZCA035;                                         1084 01866000
         LR    GPR14P,@09                                          1084 01867000
*         GPR15P=ADDR(GPR15P->PABWEQA);                            1085 01868000
*FMZL1095:                                                         1086 01869000
*         ;                                                        1086 01870000
FMZL1095 DS    0H                                                  1087 01871000
*         GPR02P=GPR15P->PABWEQA|FMZCA035;                         1087 01872000
         L     GPR02P,PABWEQA(,GPR15P)                             1087 01873000
         O     GPR02P,@CF00744                                     1087 01874000
*         DO WHILE(GPR02P^=GPR14P);                                1088 01875000
         B     @DE01088                                            1088 01876000
@DL01088 DS    0H                                                  1089 01877000
*           DO WHILE((GPR02P->WKECHAIN)^=GPR14P);                  1089 01878000
         B     @DE01089                                            1089 01879000
@DL01089 DS    0H                                                  1090 01880000
*             GPR15P=ADDR(GPR02P->WKECHAIN);                       1090 01881000
         LA    GPR15P,WKECHAIN(,GPR02P)                            1090 01882000
*             GPR02P=GPR02P->WKECHAIN;                             1091 01883000
         L     GPR02P,WKECHAIN(,GPR02P)                            1091 01884000
*           END;                                                   1092 01885000
@DE01089 C     GPR14P,WKECHAIN(,GPR02P)                            1092 01886000
         BNE   @DL01089                                            1092 01887000
*           IF GPR02P=GPR03P THEN                                  1093 01888000
         CR    GPR02P,GPR03P                                       1093 01889000
         BNE   @RF01093                                            1093 01890000
*             DO;                                                  1094 01891000
*               GPR00P=GPR02P->LCPRSTQH;                           1095 01892000
         L     GPR00P,LCPRSTQH(,GPR02P)                            1095 01893000
*               CS(GPR02P,GPR00P,GPR15P->PABWEQA);                 1096 01894000
         CS    GPR02P,@00,PABWEQA(GPR15P)                          1096 01895000
*               BC(7,FMZL3095);                                    1097 01896000
         BC    7,FMZL3095                                          1097 01897000
*               GPR02P->LCPRSTQH='80000000'X;                      1098 01898000
         MVC   LCPRSTQH(4,GPR02P),@CF00744                         1098 01899000
*               GPR14P=GPR02P;                                     1099 01900000
         LR    GPR14P,GPR02P                                       1099 01901000
*               GPR14P->WKECHAIN=0;                                1100 01902000
         SLR   @09,@09                                             1100 01903000
         ST    @09,WKECHAIN(,GPR14P)                               1100 01904000
*             END;                                                 1101 01905000
*           ELSE                                                   1102 01906000
*             DO;                                                  1102 01907000
         B     @RC01093                                            1102 01908000
@RF01093 DS    0H                                                  1103 01909000
*               IF GPR02P->FSBTYPE=FSTYPE THEN                     1103 01910000
         CLI   FSBTYPE(GPR02P),X'02'                               1103 01911000
         BNE   @RF01103                                            1103 01912000
*                 DO;                                              1104 01913000
*                   GPR02P=GPR14P;                                 1105 01914000
         LR    GPR02P,GPR14P                                       1105 01915000
*                   GOTO FMZL3095;                                 1106 01916000
         B     FMZL3095                                            1106 01917000
*                 END;                                             1107 01918000
*               GPR15P=ADDR(GPR02P->LCPRSTQH);                     1108 01919000
@RF01103 LA    GPR15P,LCPRSTQH(,GPR02P)                            1108 01920000
*               GOTO FMZL1095;                                     1109 01921000
         B     FMZL1095                                            1109 01922000
*             END;                                                 1110 01923000
*FMZL3095:                                                         1111 01924000
*           ;                                                      1111 01925000
@RC01093 DS    0H                                                  1111 01926000
FMZL3095 DS    0H                                                  1112 01927000
*         END;                                                     1112 01928000
@DE01088 CR    GPR02P,GPR14P                                       1112 01929000
         BNE   @DL01088                                            1112 01930000
*ISTA0095:                                                         1113 01931000
*         ;                                                        1113 01932000
ISTA0095 DS    0H                                                  1114 01933000
*         LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                 1114 01934000
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1114 01935000
*         RFY                                                      1115 01936000
*          (GPR02P,                                                1115 01937000
*           GPR03P) UNRSTD;                                        1115 01938000
*         GPR14P=GPR14P&FMZCB035;                                  1116 01939000
         N     GPR14P,@CF00742                                     1116 01940000
*         GPR01P->RPHWEA=GPR14P;                                   1117 01941000
         ST    GPR14P,RPHWEA(,GPR01P)                              1117 01942000
*         RFY                                                      1118 01943000
*          (GPR00P,                                                1118 01944000
*           GPR01P,                                                1118 01945000
*           GPR14P,                                                1118 01946000
*           GPR15P) UNRSTD;                                        1118 01947000
*       END;                        /* END TPDEQ GENERATION        1119 01948000
*                                      RECONSTRUCT THE PAB   @ZA09592*/ 01949000
*     ELSE                          /* INPUT HAS NOT BEEN REJECTED 1120 01950000
*                                                            @ZA09592*/ 01951000
*/* TPDEQ (LCPBPTR,FMCPAB5)                                          */ 01952000
*                                                                  1120 01953000
*       DO;                         /* BEGIN TPDEQ CODE GENERATION   */ 01954000
         B     @RC01077                                            1120 01955000
@RF01077 DS    0H                                                  1121 01956000
*         RFY                                                      1121 01957000
*          (GPR00P,                                                1121 01958000
*           GPR01P,                                                1121 01959000
*           GPR14P,                                                1121 01960000
*           GPR15P) RSTD;                                          1121 01961000
*         GPR15P=ADDR(FMCPAB5);     /* ADDRESS QUEUE POINTER         */ 01962000
         LA    GPR15P,FMCPAB5(,FMCBPTR)                            1122 01963000
*         RFY                                                      1123 01964000
*          (GPR02P,                                                1123 01965000
*           GPR03P) RSTD;                                          1123 01966000
*         STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                1124 01967000
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1124 01968000
*         GPR03P=LCPBPTR|FMZCA035;                                 1125 01969000
         L     @09,@CF00744                                        1125 01970000
         L     GPR03P,LCPBPTR(,ZCRRPTR)                            1125 01971000
         OR    GPR03P,@09                                          1125 01972000
*         GPR14P=FMZCA035;                                         1126 01973000
         LR    GPR14P,@09                                          1126 01974000
*         GPR15P=ADDR(GPR15P->PABWEQA);                            1127 01975000
*         GPR02P=GPR15P->PABWEQA|FMZCA035;                         1128 01976000
         O     @09,PABWEQA(,GPR15P)                                1128 01977000
         LR    GPR02P,@09                                          1128 01978000
*         DO WHILE(GPR02P^=GPR14P);                                1129 01979000
         B     @DE01129                                            1129 01980000
@DL01129 DS    0H                                                  1130 01981000
*FMZL2102:                                                         1130 01982000
*           ;                                                      1130 01983000
FMZL2102 DS    0H                                                  1131 01984000
*           IF GPR02P=GPR03P THEN                                  1131 01985000
         CR    GPR02P,GPR03P                                       1131 01986000
         BNE   @RF01131                                            1131 01987000
*             DO;                                                  1132 01988000
*               GPR00P=GPR02P->WKECHAIN;                           1133 01989000
         L     GPR00P,WKECHAIN(,GPR02P)                            1133 01990000
*               CS(GPR02P,GPR00P,GPR15P->PABWEQA);                 1134 01991000
         CS    GPR02P,@00,PABWEQA(GPR15P)                          1134 01992000
*               BC(7,FMZL3102);                                    1135 01993000
         BC    7,FMZL3102                                          1135 01994000
*               GPR14P=GPR02P;                                     1136 01995000
         LR    GPR14P,GPR02P                                       1136 01996000
*               GPR14P->WKECHAIN=0;                                1137 01997000
         SLR   @09,@09                                             1137 01998000
         ST    @09,WKECHAIN(,GPR14P)                               1137 01999000
*             END;                                                 1138 02000000
*           ELSE                                                   1139 02001000
*             DO;                                                  1139 02002000
         B     @RC01131                                            1139 02003000
@RF01131 DS    0H                                                  1140 02004000
*               IF(GPR02P->WKECHAIN)=GPR14P THEN                   1140 02005000
         L     @09,WKECHAIN(,GPR02P)                               1140 02006000
         CR    @09,GPR14P                                          1140 02007000
         BE    @RT01140                                            1140 02008000
*                 GOTO ISTA0102;                                   1141 02009000
*               ELSE                                               1142 02010000
*                 DO;                                              1142 02011000
*                   GPR15P=ADDR(GPR02P->WKECHAIN);                 1143 02012000
         LA    GPR15P,WKECHAIN(,GPR02P)                            1143 02013000
*                   GPR02P=GPR02P->WKECHAIN;                       1144 02014000
         LR    GPR02P,@09                                          1144 02015000
*                   GOTO FMZL2102;                                 1145 02016000
         B     FMZL2102                                            1145 02017000
*                 END;                                             1146 02018000
*             END;                                                 1147 02019000
*FMZL3102:                                                         1148 02020000
*           ;                                                      1148 02021000
@RC01131 DS    0H                                                  1148 02022000
FMZL3102 DS    0H                                                  1149 02023000
*         END;                                                     1149 02024000
@DE01129 CR    GPR02P,GPR14P                                       1149 02025000
         BNE   @DL01129                                            1149 02026000
*ISTA0102:                                                         1150 02027000
*         ;                                                        1150 02028000
ISTA0102 DS    0H                                                  1151 02029000
*         LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                 1151 02030000
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     1151 02031000
*         RFY                                                      1152 02032000
*          (GPR02P,                                                1152 02033000
*           GPR03P) UNRSTD;                                        1152 02034000
*         GPR14P=GPR14P&FMZCB035;                                  1153 02035000
         N     GPR14P,@CF00742                                     1153 02036000
*         GPR01P->RPHWEA=GPR14P;                                   1154 02037000
         ST    GPR14P,RPHWEA(,GPR01P)                              1154 02038000
*         RFY                                                      1155 02039000
*          (GPR00P,                                                1155 02040000
*           GPR01P,                                                1155 02041000
*           GPR14P,                                                1155 02042000
*           GPR15P) UNRSTD;                                        1155 02043000
*       END;                        /* END TPDEQ GENERATION DEQUEUE     02044000
*                                      WORK ELEMENT          @ZA09592*/ 02045000
*   ELSE                                                           1157 02046000
*     ;                             /* INPUT NOT AN LCPB     @ZA09592*/ 02047000
@RF01076 DS    0H                                                  1158 02048000
*   IF FSBMJRCD=FRCLRRSP THEN                                      1158 02049000
@RC01076 L     @15,FSBPTR(,ZCRRPTR)                                1158 02050000
         CLI   FSBMJRCD(@15),X'31'                                 1158 02051000
         BNE   @RF01158                                            1158 02052000
*     DO;                           /* IF CLEAR RESPONSE FSB @XM17957*/ 02053000
*       FSBMJRCD=FRNORM;            /* MAJOR=NORMAL                  */ 02054000
         MVI   FSBMJRCD(@15),X'00'                                 1160 02055000
*       FSBMNRCD=FRMOK;             /* MINOR=NORMAL          @XM17957*/ 02056000
         MVI   FSBMNRCD(@15),X'00'                                 1161 02057000
*     END;                          /* END CLEAR RESPONSE    @XM17957*/ 02058000
*   ELSE                                                           1163 02059000
*     ;                             /* IF NOT CLEAR RESPONSE FSB     */ 02060000
@RF01158 DS    0H                                                  1164 02061000
*   IF LCPFTYPE=LCRPHFT THEN                                       1164 02062000
         L     @15,LCPBPTR(,ZCRRPTR)                               1164 02063000
         TM    LCPFTYPE(@15),B'10000000'                           1164 02064000
         BNO   @RF01164                                            1164 02065000
*     DO;                           /* IF TPPOST REQUIRED            */ 02066000
*       LCPRPHA->RPHWEA=FSBPTR;     /* PUT FSB ADDR IN RPH           */ 02067000
         L     @15,LCPRPHA(,@15)                                   1166 02068000
         L     @09,FSBPTR(,ZCRRPTR)                                1166 02069000
         ST    @09,RPHWEA(,@15)                                    1166 02070000
*/*TPPOST  (LCPRPHA)                                                 */ 02071000
*                                                                  1167 02072000
*       DO;                         /* DECLARE AND RESTRICT REGS     */ 02073000
*         RESPECIFY                                                1168 02074000
*          (GPR00F,                                                1168 02075000
*           GPR01F,                                                1168 02076000
*           GPR04F,                                                1168 02077000
*           GPR05F,                                                1168 02078000
*           GPR06F,                                                1168 02079000
*           GPR14F,                                                1168 02080000
*           GPR15F) RSTD;           /* 0,1,4,5,6,14, AND 15          */ 02081000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTRPH)                                 */ 02082000
*/* END OF ATBUILD                                                   */ 02083000
*                                                                  1169 02084000
*         GEN REFS(GPR01P,GPR02F,GPR06F) SETS(RPHWORK);            1169 02085000
        STM GPR02F,GPR06F,RPHWORK(GPR01P)                               02086000
*         GPR04F=LCPRPHA;           /* LOAD RPH PNTR INTO REG 4      */ 02087000
         L     @09,LCPBPTR(,ZCRRPTR)                               1170 02088000
         L     GPR04F,LCPRPHA(,@09)                                1170 02089000
*         RFY                                                      1171 02090000
*           GPR03F RSTD;                                           1171 02091000
*         GPR03F=0;                                                1172 02092000
         SLR   @09,@09                                             1172 02093000
         LR    GPR03F,@09                                          1172 02094000
*         DO;                       /* MODESET SAVEKEY(GPR06F)     1173 02095000
*                                      KEYADDR(GPR03F)             1173 02096000
*                                      WORKREG(GPR05F)               */ 02097000
*           RESPECIFY                                              1174 02098000
*            (GPR02F) RESTRICTED;                                  1174 02099000
*           GPR05F=GPR02F;          /* SAVE REGISTER 2               */ 02100000
         LR    GPR05F,GPR02F                                       1175 02101000
*           IPK;                    /* SAVE CURRENT PSW KEY          */ 02102000
         IPK                                                       1176 02103000
*           GPR06F=GPR02F;                                         1177 02104000
         LR    GPR06F,GPR02F                                       1177 02105000
*           GPR02F=GPR05F;          /* RESTORE REGISTER 2            */ 02106000
         LR    GPR02F,GPR05F                                       1178 02107000
*           SPKA(GPR03F);           /* SET PSW KEY                   */ 02108000
         SPKA  0(GPR03F)                                           1179 02109000
*           RESPECIFY                                              1180 02110000
*            (GPR02F) UNRESTRICTED;                                1180 02111000
*         END;                      /* MODESET SAVEKEY(GPR06F)     1181 02112000
*                                      KEYADDR(GPR03F)             1181 02113000
*                                      WORKREG(GPR05F)               */ 02114000
*         RFY                                                      1182 02115000
*           GPR03F UNRSTD;                                         1182 02116000
*         GPR05P=GPR04P->RPHMAJCB+GPR04P->RPHPABOF;/* LOAD REG 5 WITH   02117000
*                                      ADDR OF MAJOR CONTROL BLOCK 1183 02118000
*                                      PLUS OFFSET OF PAB IN BLOCK   */ 02119000
         L     GPR05P,RPHMAJCB-1(,GPR04P)                          1183 02120000
         LA    GPR05P,0(,GPR05P)                                   1183 02121000
         SLR   @07,@07                                             1183 02122000
         IC    @07,RPHPABOF(,GPR04P)                               1183 02123000
         ALR   GPR05P,@07                                          1183 02124000
*         GPR14P=0;                 /* LOAD 0 INTO REG 14            */ 02125000
         LR    GPR14P,@09                                          1184 02126000
*         GPR15P='FFFFFFFF'X;       /* LOAD REG 15 WITH DUMMY ADDRESS*/ 02127000
         SLR   GPR15P,GPR15P                                       1185 02128000
         BCTR  GPR15P,0                                            1185 02129000
*         CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE RESUME     1186 02130000
*                                      ADDRESS WITH 0 AND,IF EQUAL,     02131000
*                                      PUT DUMMY ADDRESS IN CONTROL     02132000
*                                      BLOCK RESUME ADDRESS          */ 02133000
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         1186 02134000
*         BC(8,FMZT0108);           /* IF EQUAL, BYPASS REMAINDER OF    02135000
*                                      EXPANSION                     */ 02136000
         BC    8,FMZT0108                                          1187 02137000
*FMZL0108:                                                         1188 02138000
*         IF GPR04P->RPHWT='1'B THEN/* WT/EXT CONTENTION FLAG ON     */ 02139000
FMZL0108 TM    RPHWT(GPR04P),B'00001000'                           1188 02140000
         BNO   @RF01188                                            1188 02141000
*           DO;                     /* IN RPH                        */ 02142000
*             GPR14P=GPR04P->RPHRESMA|RPHWT1;/* LOAD REG 14 WITH FLAG   02143000
*                                      FIELD AND MAKE CERTAIN WT/EXT    02144000
*                                      CONTENTION FLAG STILL ON      */ 02145000
         L     GPR14P,RPHRESMA(,GPR04P)                            1190 02146000
         O     GPR14P,@CF00768                                     1190 02147000
*             GPR15P=GPR14P|RPHPT1; /* LOAD REG 15 WITH FLAG FIELD 1191 02148000
*                                      AND TURN POST FLAG ON         */ 02149000
         LR    GPR15P,GPR14P                                       1191 02150000
         O     GPR15P,@CF00758                                     1191 02151000
*             CS(GPR14P,GPR15P,GPR04P->RPHRESMA);/* COMPARE REG 14 1192 02152000
*                                      WITH FLAG FIELD--IF WT/EXT BIT   02153000
*                                      ON, TURN ON POST FLAG         */ 02154000
         CS    GPR14P,@15,RPHRESMA(GPR04P)                         1192 02155000
*             BC(4,FMZL0108);       /* IF WT/EXT BIT WAS OFF, LOOP TO   02156000
*                                      TEST CONTENTION FLAG          */ 02157000
         BC    4,FMZL0108                                          1193 02158000
*             BC(8,FMZT0108);       /* IF WT/EXT BIT WAS OFF, BRANCH    02159000
*                                      TO BYPASS CODE GEN            */ 02160000
         BC    8,FMZT0108                                          1194 02161000
*           END;                    /* IF POST FLAG IS ON, FALL THRU    02162000
*                                      BOTTOM OF LOOP                */ 02163000
*         ELSE                                                     1196 02164000
*           ;                       /* WT/EXT CONTENTION FLAG OFF    */ 02165000
@RF01188 DS    0H                                                  1197 02166000
*         IF GPR04P->RPHTSKID=GPR01P->RPHTSKID THEN                1197 02167000
         CLC   RPHTSKID(4,GPR04P),RPHTSKID(GPR01P)                 1197 02168000
         BNE   @RF01197                                            1197 02169000
*           DO;                                                    1198 02170000
*             GPR05P->PABCHNGP=GPR01P->RPHPABQP;/* PUT PAB QUEUE   1199 02171000
*                                      ADDRESS IN SECOND WORD OF PAB */ 02172000
         MVC   PABCHNGP(3,GPR05P),RPHPABQP(GPR01P)                 1199 02173000
*             GPR01P->RPHPABQP=GPR05P;/* PUT PAB ADDRESS (IN MAJOR 1200 02174000
*                                      CONTROL BLOCK) IN PAB QUEUE 1200 02175000
*                                      ADRESS IN RPH                 */ 02176000
         STCM  GPR05P,7,RPHPABQP(GPR01P)                           1200 02177000
*           END;                                                   1201 02178000
*         ELSE                                                     1202 02179000
*           DO;                                                    1202 02180000
         B     @RC01197                                            1202 02181000
@RF01197 DS    0H                                                  1203 02182000
*             GPR00F=0;             /* SET REG 0 TO INDICATE ENA     */ 02183000
         SLR   GPR00F,GPR00F                                       1203 02184000
*             DO;                   /* LISATCVT                    1204 02185000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 02186000
*               GPR15P=ATCLCPTR;    /* SET UP ATCVT POINTER          */ 02187000
         L     GPR15P,ATCLCPTR                                     1205 02188000
*             END;                  /* LISATCVT PUT POINTER TO ATCVT    02189000
*                                      IN IN REG 15                  */ 02190000
*             CALL GPR15P->ATCAP32; /* CALL ISTAPC32: TPSCHED        */ 02191000
         L     @09,ATCAP32(,GPR15P)                                1207 02192000
         LR    @15,@09                                             1207 02193000
         BALR  @14,@15                                             1207 02194000
*           END;                                                   1208 02195000
*FMZT0108:                                                         1209 02196000
*         DO;                       /* MODESET KEYADDR(GPR06F)     1209 02197000
*                                      WORKREG(GPR05F)               */ 02198000
@RC01197 DS    0H                                                  1209 02199000
FMZT0108 DS    0H                                                  1210 02200000
*           GPR05F=GPR06F;          /* GET KEY FORM SAVE LOCATION    */ 02201000
         LR    GPR05F,GPR06F                                       1210 02202000
*           SPKA(GPR05F);           /* SET PSW KEY                   */ 02203000
         SPKA  0(GPR05F)                                           1211 02204000
*         END;                      /* MODESET KEYADDR(GPR06F)     1212 02205000
*                                      WORKREG(GPR05F)               */ 02206000
*         GEN REFS(GPR04P,RPHWORK) SETS(GPR02F,GPR03F,GPR04F,GPR05F,    02207000
*             GPR06F);                                             1213 02208000
        LM GPR02F,GPR06F,RPHWORK(GPR01P)                                02209000
*         RESPECIFY                                                1214 02210000
*          (GPR00F,                                                1214 02211000
*           GPR01F,                                                1214 02212000
*           GPR04F,                                                1214 02213000
*           GPR05F,                                                1214 02214000
*           GPR06F,                                                1214 02215000
*           GPR14F,                                                1214 02216000
*           GPR15F) UNRSTD;         /* UNRESTRICT REGS 0,1, 4,5,14,     02217000
*                                      AND 15                        */ 02218000
*       END;                        /* ***END OF TPPOST GENERATION***   02219000
*                                      TPPOST THE RPH                */ 02220000
*     END;                          /* END TPPOST REQUIRED           */ 02221000
*   ELSE                                                           1217 02222000
*     DO;                           /* TPPOST NOT REQUIRED           */ 02223000
         B     @RC01164                                            1217 02224000
@RF01164 DS    0H                                                  1218 02225000
*       RFY                                                        1218 02226000
*         R7 RSTD;                  /* TPQUE PARAMETER               */ 02227000
*       R7=LCPPABA;                 /* ADDRESS PAB                   */ 02228000
         L     @15,LCPBPTR(,ZCRRPTR)                               1219 02229000
         L     R7,LCPPABA(,@15)                                    1219 02230000
*/*  TPQUE (FSBPTR,R7->PABWEQA) NORM                                 */ 02231000
*                                                                  1220 02232000
*       DO;                                                        1220 02233000
*         RFY                                                      1221 02234000
*          (GPR00P,                                                1221 02235000
*           GPR01P,                                                1221 02236000
*           GPR04P,                                                1221 02237000
*           GPR05P,                                                1221 02238000
*           GPR15P) RSTD;                                          1221 02239000
*         GEN REFS(GPR01P) SETS(RPHWORK)                           1222 02240000
*             (STM GPR02P,GPR08P,RPHWORK(GPR01P));                 1222 02241000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              02242000
*         GPR00P=0;                                                1223 02243000
         SLR   GPR00P,GPR00P                                       1223 02244000
*         GPR15P=ADDR(R7->PABWEQA); /* HOLD PAB PTR                  */ 02245000
         LR    GPR15P,R7                                           1224 02246000
*         GPR04P=FSBPTR;            /* WORK ELE PTR                  */ 02247000
         L     GPR04P,FSBPTR(,ZCRRPTR)                             1225 02248000
*         GPR05P=GPR15P;            /* PASS PAB PTR                  */ 02249000
         LR    GPR05P,GPR15P                                       1226 02250000
*         CALL ATCLCPTR->ATCAP37->ISTAPC37;                        1227 02251000
         L     @09,ATCLCPTR                                        1227 02252000
         L     @15,ATCAP37(,@09)                                   1227 02253000
         BALR  @14,@15                                             1227 02254000
*         GEN(NOPR  0)                                             1228 02255000
*         NOSETS NOREFS;                                           1228 02256000
         NOPR  0                                                        02257000
*         RFY                                                      1229 02258000
*          (GPR00P,                                                1229 02259000
*           GPR01P,                                                1229 02260000
*           GPR04P,                                                1229 02261000
*           GPR05P,                                                1229 02262000
*           GPR15P) UNRSTD;                                        1229 02263000
*       END;                        /* *** END OF TPQUE GENERATION 1230 02264000
*                                      QUEUE FSB TO REQUESTOR        */ 02265000
*       RFY                                                        1231 02266000
*         R7 UNRSTD;                /* NO LONGER REQUIRED            */ 02267000
*     END;                          /* END TPQUE PROCESSING          */ 02268000
*   R14=R14SAVE;                    /* RESTORE RETURN REGISTER       */ 02269000
@RC01164 L     R14,R14SAVE(,ZCRRPTR)                               1233 02270000
*   END ISTZFDB;                    /* END OF SUBROUTINE             */ 02271000
@EL00004 DS    0H                                                  1234 02272000
@EF00004 DS    0H                                                  1234 02273000
@ER00004 BR    @14                                                 1234 02274000
*   RFY                                                            1235 02275000
*    (R14) UNRSTD;                  /* RESTORED                      */ 02276000
         EJECT                                                          02277000
*                                                                  1236 02278000
*/********************************************************************/ 02279000
*/*                                                                  */ 02280000
*/* SUBROUTINE-                                                      */ 02281000
*/*      ISTZPBST                                                    */ 02282000
*/*                                                                  */ 02283000
*/* FUNCTION-                                                        */ 02284000
*/*      INHIBIT DATA TRAFFIC ON THE CLIP, TOP, AND ATOP.            */ 02285000
*/*                                                                  */ 02286000
*/********************************************************************/ 02287000
*                                                                  1236 02288000
*   RFY                                                            1236 02289000
*    (R14) RSTD;                    /* TO SAVE RETURN REGISTER       */ 02290000
*ISTZPBST:                                                         1237 02291000
*   PROCEDURE OPTIONS(NOSAVE,NOSAVEAREA);/* ISTZPBST SUBROUTINE      */ 02292000
ISTZPBST DS    0H                                                  1238 02293000
*   IF FMCCIPI=ON&FMCMODE^='ISTYTCM3'&FMCSDTR=ON THEN/* IF CLEAR IN     02294000
*                                      PROGRESS              @ZA29843   02295000
*                                      AND NOT TCAM OPERATION@ZA29843   02296000
*                                      AND SDT FLAG IS ON    @ZA29963*/ 02297000
         TM    FMCCIPI(FMCBPTR),B'01000000'                        1238 02298000
         BNO   @RF01238                                            1238 02299000
         CLC   FMCMODE(8,FMCBPTR),@CC04180                         1238 02300000
         BE    @RF01238                                            1238 02301000
         TM    FMCSDTR(FMCBPTR),B'00010000'                        1238 02302000
         BNO   @RF01238                                            1238 02303000
*     ADDR(FMCPAB1)->PABINHBT=ON;   /* PROHIBIT CLOP TRAFFIC @ZA29843*/ 02304000
         L     @15,PABINHBT+64(,FMCBPTR)                           1239 02305000
@GL00022 LR    @09,@15                                             1239 02306000
         O     @09,@CF04256                                        1239 02307000
         CS    @15,@09,PABINHBT+64(FMCBPTR)                        1239 02308000
         BNE   @GL00022                                            1239 02309000
*   ELSE                                                           1240 02310000
*     ;                             /*                       @ZA29843*/ 02311000
@RF01238 DS    0H                                                  1241 02312000
*   ADDR(FMCPAB2)->PABINHBT=ON;     /* PROHIBIT TRAFFIC ON CLIP      */ 02313000
         L     @15,PABINHBT+80(,FMCBPTR)                           1241 02314000
@GL00023 LR    @09,@15                                             1241 02315000
         O     @09,@CF04256                                        1241 02316000
         CS    @15,@09,PABINHBT+80(FMCBPTR)                        1241 02317000
         BNE   @GL00023                                            1241 02318000
*   ADDR(FMCPAB3)->PABINHBT=ON;     /* PROHIBIT TRAFFIC ON TOP       */ 02319000
         L     @15,PABINHBT+96(,FMCBPTR)                           1242 02320000
@GL00024 LR    @09,@15                                             1242 02321000
         O     @09,@CF04256                                        1242 02322000
         CS    @15,@09,PABINHBT+96(FMCBPTR)                        1242 02323000
         BNE   @GL00024                                            1242 02324000
*   ADDR(FMCPAB5)->PABINHBT=ON;     /* PROHIBIT TRAFFIC ON ATOP      */ 02325000
         L     @15,PABINHBT+128(,FMCBPTR)                          1243 02326000
@GL00025 LR    @09,@15                                             1243 02327000
         O     @09,@CF04256                                        1243 02328000
         CS    @15,@09,PABINHBT+128(FMCBPTR)                       1243 02329000
         BNE   @GL00025                                            1243 02330000
*   END ISTZPBST;                   /* END OF SUBROUTINE             */ 02331000
@EL00005 DS    0H                                                  1244 02332000
@EF00005 DS    0H                                                  1244 02333000
@ER00005 BR    @14                                                 1244 02334000
*   RFY                                                            1245 02335000
*    (R14) UNRSTD;                  /* RETURN ADDRESS REGISTER       */ 02336000
*/* TPEPILOG                                                         */ 02337000
*                                                                  1246 02338000
*   GEN(PRINT OFF);                                                1246 02339000
         PRINT OFF                                                      02340000
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    1247 02341000
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           1247 02342000
*        2  * CHAR(4),                 /* SPACE                       * 02343000
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               * 02344000
*           3 WKEFLAGS BIT(8),         /* FLAGS                       * 02345000
*             4 WKEGATE  BIT(1),       /* GATE BIT                    * 02346000
*             4 *        BIT(7),       /* RESERVED                    * 02347000
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 * 02348000
*/* ***** POOL ENTRY  ***** */                                     1248 02349000
*/*  INITIAL LEVEL                                     001 12/20/74  */ 02350000
*DCL   1  ISTBPENT BDY(DWORD) BASED(BPEPTR),                       1248 02351000
*         2  BPEPID   CHAR(4),         /* POOL ID                    */ 02352000
*         2  BPEFLAGS BIT(16),         /* POOL FLAGS ZUP0589 @Z40GKDS*/ 02353000
*            3  BPEFM    BIT(1),       /* POOL FORMAT                */ 02354000
*            3  BPEDISP  BIT(1),       /* SHARED OR PRIVATE          */ 02355000
*            3  BPEFIXED BIT(1),       /* FIXED OR PAGEABLE          */ 02356000
*            3  BPENFCHP BIT(1),       /* NON-FETCH PROTECTION       */ 02357000
*            3  BPEAL48  BIT(1),       /* 4,8 ALIGNEMENT OF BUFFERS  */ 02358000
*            3  BPECBID  BIT(1),       /* CBID POOL                  */ 02359000
*            3  BPENWS   BIT(1),       /* NON-WORKING SET POOL       */ 02360000
*            3  BPERSV01 BIT(1),       /* RESERVED   ZUP0589 @Z40GKDS*/ 02361000
*            3  BPEUSRF  BIT(1),       /* USER REQUIRES FIXED BUF    */ 02362000
*            3  BPERSV02 BIT(7),       /* RESERVED   ZUP0589 @Z40GKDS*/ 02363000
*         2  BPEBFSIZ FIXED(15),       /* BUFFER SIZE IN BYTES       */ 02364000
*         2  BPEBPCB  PTR(31),         /* ADDRESS OF BPCB            */ 02365000
*         2  BPERSV03 CHAR(4);         /* RESERVED                   */ 02366000
*/* ***** POOL DIRECTORY  ***** */                                 1249 02367000
*/*  REVISIONS                                         002 03/20/75  */ 02368000
*DCL   1  ISTBPDTY BDY(DWORD) BASED(BPDPTR),                       1249 02369000
*         2  BPDHDR CHAR(144) BDY(WORD),/* DIRECTORY HEADER          */ 02370000
*            3  BPDBPENT FIXED(15),    /* CURRENT NUMBER OF ENTRIES  */ 02371000
*            3  BPDBPMAX FIXED(15),    /* MAXIMUN NUMBER OF ENTRIES  */ 02372000
*            3  BPDCHBNO FIXED(15),    /* NO. BUFFERS FOR CHPGM      */ 02373000
*            3  BPDCHBSZ FIXED(15),    /* BUFFER SIZE FOR CH PGM     */ 02374000
*            3  BPDCHPCB PTR(31),      /* BPCB ADDR FOR CHPGM        */ 02375000
*            3  BPDPGPCB PTR(31),      /* BPCB ADDR FOR PGBUF        */ 02376000
*            3  BPDADRS1 PTR(31),      /* BEGINNIG ADDR FOR POOLS    */ 02377000
*            3  BPDADRS2 PTR(31),      /* END ADDR FOR POOLS         */ 02378000
*            3  BPDFEXT  PTR(31),      /* ADDR OF 1ST FREE EXTENT    */ 02379000
*            3  BPDSMPCB PTR(31),      /* SMS WE BPCB ADDRESS        */ 02380000
*            3  BPDFBPE  PTR(31),      /* FIRST POOL ENTRY           */ 02381000
*            3  BPDATCVT PTR(31),      /* PTR BACK TO ATCVT          */ 02382000
*            3  BPDFLAG  FIXED(32),    /* FLAGS FIELD                */ 02383000
*               4 BPDGTR   BIT(1),     /* GTRACE REQUESTED           */ 02384000
*               4 BPDRSV01 BIT(31),    /* RESERVED                   */ 02385000
*            3  BPDREQCT FIXED(15),    /* COUNT OF REQSTORES         */ 02386000
*            3  BPDREQMX FIXED(15),    /* GTRACE REQ INTRVAL         */ 02387000
*            3  BPDPARM  CHAR(8) BDY(WORD),/* GTRACE PARM            */ 02388000
*               4 BPDTRLEN FIXED(15),  /* GTRACE DATA LENGTH         */ 02389000
*               4 *        CHAR(1),    /* RESERVED                   */ 02390000
*               4 BPDTRID  CHAR(1),    /* GTRACE FORMAT ID           */ 02391000
*               4 BPDTRADR PTR(31),    /* GTRACE DATA ADDR           */ 02392000
*            3  BPDTRACE (11) CHAR(8) BDY(WORD),/* GTRACE DATA       */ 02393000
*               4 BPDMUSE  FIXED(15),  /* MAX BUFFERS IN USE         */ 02394000
*               4 BPDMQUE  FIXED(15),  /* MAX REQUESTS QUEUED        */ 02395000
*               4 BPDAVNO  FIXED(15),  /* AVAIL NUMBER OF BUFFRS     */ 02396000
*               4 *        CHAR(2),    /* RESERVED                   */ 02397000
*         2  BPDENTRY (12)CHAR(LENGTH(ISTBPENT)), /* BEGIN POOL ENTRY*/ 02398000
*         2  BPDCBID  CHAR(*);         /* CBID TABLE SECTION         */ 02399000
*   DCL                                                            1250 02400000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 02401000
*   DCL                                                            1251 02402000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 02403000
*   GEN(PRINT ON);                                                 1252 02404000
*                                                                  1252 02405000
         PRINT ON                                                       02406000
*/* END OF TPEPILOG                                                  */ 02407000
*                                                                  1253 02408000
*   END ISTZBFSC                    /* END OF MODULE                 */ 02409000
*                                                                  1253 02410000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02411000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 02412000
*/*%INCLUDE SYSUT5  (DECLARES)                                       */ 02413000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02414000
*/*%INCLUDE SYSUT5  (MAINLINE)                                       */ 02415000
*/*%INCLUDE SYSUT5  (ISTZNSES)                                       */ 02416000
*/*%INCLUDE SYSUT5  (ISTZSND )                                       */ 02417000
*/*%INCLUDE SYSUT5  (ISTZTRM )                                       */ 02418000
*/*%INCLUDE SYSUT5  (ISTZCLR )                                       */ 02419000
*/*%INCLUDE SYSUT5  (NOTIFY  )                                       */ 02420000
*/*%INCLUDE SYSUT5  (ISTZFDB )                                       */ 02421000
*/*%INCLUDE SYSUT5  (ISTZPBST)                                       */ 02422000
*                                                                  1253 02423000
*       ;                                                          1253 02424000
@EL00001 DS    0H                                                  1253 02425000
@EF00001 DS    0H                                                  1253 02426000
@ER00001 BR    @14                                                 1253 02427000
@DATA    DS    0H                                                       02428000
@CH00052 DC    H'4'                                                     02429000
@SM04248 MVC   SRUCOPY(0,ZCRRPTR),DATALCCW(@09)                         02430000
@SM04250 MVC   SRUCOPY-1(0,@15),DATALCCW(@11)                           02431000
@DATD    DSECT                                                          02432000
         DS    0F                                                       02433000
ISTZBFSC CSECT                                                          02434000
         DS    0F                                                       02435000
@CF00060 DC    F'1'                                                     02436000
@CF00287 DC    F'3'                                                     02437000
@CF00714 DC    F'7'                                                     02438000
@CF00058 DC    F'8'                                                     02439000
@CF00742 DC    XL4'7FFFFFFF'                                            02440000
@CF00744 DC    XL4'80000000'                                            02441000
@CF00758 DC    XL4'04000000'                                            02442000
@CF00768 DC    XL4'08000000'                                            02443000
@CF04147 DC    XL4'00FFFFFF'                                            02444000
@CF04247 DC    XL4'0000FFFF'                                            02445000
@CF04256 DC    BL4'00000010000000000000000000000000'                    02446000
@DATD    DSECT                                                          02447000
         DS    0D                                                       02448000
WKEPTR   DS    A                                                        02449000
BPEPTR   DS    A                                                        02450000
BPDPTR   DS    A                                                        02451000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02452000
@ENDDATD EQU   *                                                        02453000
ISTZBFSC CSECT                                                          02454000
         DS    0F                                                       02455000
@SIZDATD DC    AL1(0)                                                   02456000
         DC    AL3(@ENDDATD-@DATD)                                      02457000
         DS    0D                                                       02458000
FMZA0016 DS    FL4                                                      02459000
         ORG   FMZA0016                                                 02460000
@NM00059 DC    AL1(64)                                                  02461000
@NM00060 DC    AL3(0)                                                   02462000
         ORG   FMZA0016+4                                               02463000
FMZA0054 DS    FL4                                                      02464000
         ORG   FMZA0054                                                 02465000
@NM00061 DC    AL1(168)                                                 02466000
@NM00062 DC    AL3(0)                                                   02467000
         ORG   FMZA0054+4                                               02468000
@CC04180 DC    C'ISTYTCM3'                                              02469000
@CC04064 DC    C'BCSC'                                                  02470000
@CB03023 DC    X'F24800046B8000A1'                                      02471000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02472000
@01      EQU   01                                                       02473000
@02      EQU   02                                                       02474000
@03      EQU   03                                                       02475000
@04      EQU   04                                                       02476000
@05      EQU   05                                                       02477000
@06      EQU   06                                                       02478000
@07      EQU   07                                                       02479000
@08      EQU   08                                                       02480000
@09      EQU   09                                                       02481000
@10      EQU   10                                                       02482000
@11      EQU   11                                                       02483000
@12      EQU   12                                                       02484000
@13      EQU   13                                                       02485000
@14      EQU   14                                                       02486000
@15      EQU   15                                                       02487000
FMCBPTR  EQU   @05                                                      02488000
RPHPTR   EQU   @01                                                      02489000
COUNT    EQU   @00                                                      02490000
ATCVTPTR EQU   @02                                                      02491000
R3       EQU   @03                                                      02492000
LUNCBPTR EQU   @04                                                      02493000
R6       EQU   @06                                                      02494000
K        EQU   @07                                                      02495000
R7       EQU   @07                                                      02496000
ZCRRPTR  EQU   @08                                                      02497000
R12      EQU   @12                                                      02498000
R13      EQU   @13                                                      02499000
R14      EQU   @14                                                      02500000
R15      EQU   @15                                                      02501000
GPR01F   EQU   @01                                                      02502000
GPR01P   EQU   @01                                                      02503000
GPR12P   EQU   @12                                                      02504000
GPR13P   EQU   @13                                                      02505000
GPR14F   EQU   @14                                                      02506000
GPR14P   EQU   @14                                                      02507000
GPR00F   EQU   @00                                                      02508000
GPR00P   EQU   @00                                                      02509000
GPR02F   EQU   @02                                                      02510000
GPR02P   EQU   @02                                                      02511000
GPR03F   EQU   @03                                                      02512000
GPR03P   EQU   @03                                                      02513000
GPR04F   EQU   @04                                                      02514000
GPR04P   EQU   @04                                                      02515000
GPR05F   EQU   @05                                                      02516000
GPR05P   EQU   @05                                                      02517000
GPR06F   EQU   @06                                                      02518000
GPR07P   EQU   @07                                                      02519000
GPR15F   EQU   @15                                                      02520000
GPR15P   EQU   @15                                                      02521000
GPR06P   EQU   @06                                                      02522000
GPR07F   EQU   @07                                                      02523000
GPR08F   EQU   @08                                                      02524000
GPR08P   EQU   @08                                                      02525000
GPR09F   EQU   @09                                                      02526000
GPR09P   EQU   @09                                                      02527000
GPR10F   EQU   @10                                                      02528000
GPR10P   EQU   @10                                                      02529000
GPR11F   EQU   @11                                                      02530000
GPR11P   EQU   @11                                                      02531000
GPR12F   EQU   @12                                                      02532000
GPR13F   EQU   @13                                                      02533000
ATCLCPTR EQU   1032                                                     02534000
CVTMAP   EQU   0                                                        02535000
CVTDAR   EQU   CVTMAP+72                                                02536000
CVTFLGS1 EQU   CVTDAR                                                   02537000
CVTDCB   EQU   CVTMAP+116                                               02538000
CVTIERLC EQU   CVTMAP+144                                               02539000
CVTOPTA  EQU   CVTMAP+182                                               02540000
CVTOPTB  EQU   CVTMAP+183                                               02541000
CVTGTF   EQU   CVTMAP+236                                               02542000
CVTGTFST EQU   CVTGTF                                                   02543000
CVTGTFS  EQU   CVTGTFST                                                 02544000
CVTSTATE EQU   CVTGTFST                                                 02545000
CVTTMODE EQU   CVTGTFST                                                 02546000
CVTFORM  EQU   CVTGTFST                                                 02547000
CVTAQAVT EQU   CVTMAP+240                                               02548000
CVTTCMFG EQU   CVTAQAVT                                                 02549000
CVTVOLM2 EQU   CVTMAP+244                                               02550000
CVTTATA  EQU   CVTVOLM2                                                 02551000
CVTTSKS  EQU   CVTTATA                                                  02552000
CVTVOLF2 EQU   CVTTSKS                                                  02553000
CVTTAT   EQU   CVTTATA+1                                                02554000
CVTATER  EQU   CVTMAP+248                                               02555000
CVTEXT1  EQU   CVTMAP+252                                               02556000
CVTPURG  EQU   CVTMAP+260                                               02557000
CVTQMSG  EQU   CVTMAP+268                                               02558000
CVTDMSR  EQU   CVTMAP+272                                               02559000
CVTRSV37 EQU   CVTDMSR                                                  02560000
CVTDMSRF EQU   CVTRSV37                                                 02561000
CVTERPV  EQU   CVTMAP+316                                               02562000
CVTINTLA EQU   CVTMAP+320                                               02563000
CVTAPF   EQU   CVTMAP+324                                               02564000
CVTEXT2  EQU   CVTMAP+328                                               02565000
CVTHJES  EQU   CVTMAP+332                                               02566000
CVTPGSIA EQU   CVTMAP+348                                               02567000
CVTA1F1  EQU   CVTMAP+356                                               02568000
CVTSYSK  EQU   CVTMAP+357                                               02569000
CVTVOLM1 EQU   CVTMAP+380                                               02570000
CVTVOLF1 EQU   CVTVOLM1                                                 02571000
CVTATMCT EQU   CVTMAP+388                                               02572000
CVTXTNT1 EQU   0                                                        02573000
CVTXTNT2 EQU   0                                                        02574000
CVTDSSV  EQU   CVTXTNT2                                                 02575000
CVTFLGBT EQU   CVTXTNT2+5                                               02576000
CVTQID   EQU   CVTXTNT2+24                                              02577000
CVTSHS   EQU   CVTXTNT2+40                                              02578000
CVTRV400 EQU   CVTXTNT2+52                                              02579000
CVTRV409 EQU   CVTXTNT2+53                                              02580000
CVTATCVT EQU   CVTXTNT2+64                                              02581000
CVTRV429 EQU   CVTXTNT2+84                                              02582000
CVTRV438 EQU   CVTXTNT2+85                                              02583000
CVTRV457 EQU   CVTXTNT2+112                                             02584000
CVTRV466 EQU   CVTXTNT2+113                                             02585000
CVTFIX   EQU   0                                                        02586000
CVTRELNO EQU   CVTFIX+252                                               02587000
ISTLOK   EQU   0                                                        02588000
LOKCHN   EQU   ISTLOK+1                                                 02589000
LOKCHNG  EQU   LOKCHN                                                   02590000
@NM00004 EQU   LOKCHNG+2                                                02591000
ISTPAB   EQU   0                                                        02592000
PABWQCHN EQU   ISTPAB                                                   02593000
PABWEQA  EQU   PABWQCHN                                                 02594000
PABCHAIN EQU   PABWQCHN+4                                               02595000
PABCHNGP EQU   PABCHAIN+1                                               02596000
PABRPHFG EQU   ISTPAB+12                                                02597000
PABFLAGS EQU   PABRPHFG                                                 02598000
PABERLCK EQU   PABFLAGS                                                 02599000
PABERRLK EQU   PABERLCK                                                 02600000
PABINHBT EQU   PABFLAGS                                                 02601000
ISTDEVCH EQU   0                                                        02602000
DEVSHCH  EQU   ISTDEVCH                                                 02603000
DEVCHAR  EQU   DEVSHCH                                                  02604000
DEVTCODE EQU   ISTDEVCH+1                                               02605000
DEVFLAGS EQU   ISTDEVCH+3                                               02606000
DEVFCCTL EQU   DEVFLAGS                                                 02607000
DEVCHAR3 EQU   DEVFLAGS                                                 02608000
ISTPROCD EQU   0                                                        02609000
PROPROC  EQU   ISTPROCD                                                 02610000
PROPROC1 EQU   PROPROC                                                  02611000
PROPROC2 EQU   PROPROC+1                                                02612000
PROPROC3 EQU   PROPROC+2                                                02613000
PROPROC4 EQU   PROPROC+3                                                02614000
PROPROCS EQU   0                                                        02615000
PROSETMS EQU   PROPROCS+1                                               02616000
PROSETM2 EQU   PROSETMS                                                 02617000
PROSETM3 EQU   PROSETMS+1                                               02618000
PROSETM4 EQU   PROSETMS+2                                               02619000
ISTFMCB  EQU   0                                                        02620000
FMCSAF   EQU   ISTFMCB+2                                                02621000
FMCDNCBA EQU   ISTFMCB+16                                               02622000
FMCSTAT  EQU   ISTFMCB+28                                               02623000
FMCSTAT1 EQU   ISTFMCB+29                                               02624000
FMCCMDFL EQU   ISTFMCB+31                                               02625000
FMCCMPS1 EQU   ISTFMCB+36                                               02626000
FMCMODE  EQU   ISTFMCB+52                                               02627000
FMCPAB1  EQU   ISTFMCB+64                                               02628000
FMCPAB2  EQU   ISTFMCB+80                                               02629000
FMCPAB3  EQU   ISTFMCB+96                                               02630000
FMCPAB5  EQU   ISTFMCB+128                                              02631000
FMCSIPA  EQU   ISTFMCB+148                                              02632000
FMCNXOSQ EQU   ISTFMCB+152                                              02633000
FMCNXCFM EQU   FMCNXOSQ                                                 02634000
FMCOSSN  EQU   FMCNXCFM                                                 02635000
FMCNXOSC EQU   FMCNXOSQ+2                                               02636000
FMCOASN  EQU   FMCNXOSC                                                 02637000
FMCISSN  EQU   ISTFMCB+156                                              02638000
FMCSSTAT EQU   ISTFMCB+159                                              02639000
FMCSNBI  EQU   FMCSSTAT                                                 02640000
FMCCIPI  EQU   FMCSSTAT                                                 02641000
FMCUIPI  EQU   FMCSSTAT                                                 02642000
FMCSDTR  EQU   FMCSSTAT                                                 02643000
FMCBIP   EQU   FMCSSTAT                                                 02644000
FMCNSALU EQU   FMCSSTAT                                                 02645000
FMCPACE  EQU   ISTFMCB+160                                              02646000
FMCPACEN EQU   FMCPACE                                                  02647000
FMCPACEM EQU   FMCPACE+1                                                02648000
FMCPACPC EQU   FMCPACE+2                                                02649000
FMCCVAL  EQU   FMCPACE+3                                                02650000
FMCOBCE  EQU   FMCCVAL                                                  02651000
FMCCLEXT EQU   ISTFMCB+164                                              02652000
FMCRPLA  EQU   FMCCLEXT                                                 02653000
FMCFBA   EQU   FMCCLEXT+4                                               02654000
FMCCMPS2 EQU   FMCCLEXT+16                                              02655000
FMCFLGA  EQU   FMCCMPS2                                                 02656000
FMCFLGCL EQU   FMCCMPS2+1                                               02657000
FMCPSCMD EQU   FMCCMPS2+2                                               02658000
FMCPSTAT EQU   FMCCMPS2+3                                               02659000
FMCSTAT2 EQU   ISTFMCB+186                                              02660000
FMCSEQI  EQU   FMCSTAT2                                                 02661000
FMCMODEB EQU   ISTFMCB+189                                              02662000
FMCCLSEQ EQU   ISTFMCB+190                                              02663000
FMCRRESP EQU   ISTFMCB+195                                              02664000
FMCSSEGQ EQU   ISTFMCB+200                                              02665000
FMCFBAS  EQU   ISTFMCB+216                                              02666000
FMCZV002 EQU   FMCFBAS                                                  02667000
FMCSNCTL EQU   ISTFMCB+224                                              02668000
FMCSCFLG EQU   FMCSNCTL                                                 02669000
FMCVS1   EQU   ISTFMCB+232                                              02670000
FMCZFLAG EQU   FMCVS1                                                   02671000
FMCZF006 EQU   FMCZFLAG                                                 02672000
FMCLBXM  EQU   FMCVS1+12                                                02673000
FMCSHEAQ EQU   FMCLBXM                                                  02674000
FMCLCPBQ EQU   FMCVS1+16                                                02675000
FMCLCPAQ EQU   FMCVS1+20                                                02676000
FMCSEQ1  EQU   FMCVS1+34                                                02677000
FMCZFLG2 EQU   FMCVS1+35                                                02678000
FMCCVFLG EQU   FMCVS1+44                                                02679000
FMCFLAG  EQU   0                                                        02680000
FMCFLGB  EQU   FMCFLAG                                                  02681000
ISTLCCW  EQU   0                                                        02682000
LCCWOP   EQU   ISTLCCW                                                  02683000
LCCWRWOP EQU   LCCWOP                                                   02684000
LCCWCTL  EQU   LCCWRWOP                                                 02685000
LCCWFLAG EQU   ISTLCCW+1                                                02686000
LCCWCD   EQU   LCCWFLAG                                                 02687000
LCCWCC   EQU   LCCWFLAG                                                 02688000
LCCWIDAT EQU   LCCWFLAG                                                 02689000
LCCWLSI  EQU   LCCWFLAG                                                 02690000
LCCWCNT  EQU   ISTLCCW+2                                                02691000
LCCWDATA EQU   ISTLCCW+4                                                02692000
ISTDYPAB EQU   0                                                        02693000
ISTRPH   EQU   0                                                        02694000
RPHCNTL  EQU   ISTRPH                                                   02695000
RPHFLAGS EQU   RPHCNTL+2                                                02696000
RPHAPTYP EQU   RPHFLAGS                                                 02697000
RPHFSTLC EQU   RPHFLAGS                                                 02698000
RPHFLGB  EQU   RPHCNTL+3                                                02699000
RPHRPHA  EQU   ISTRPH+4                                                 02700000
RPHTSKID EQU   ISTRPH+8                                                 02701000
RPHRESMA EQU   ISTRPH+16                                                02702000
RPHWPFLG EQU   RPHRESMA                                                 02703000
RPHWT    EQU   RPHWPFLG                                                 02704000
RPHPABOF EQU   ISTRPH+20                                                02705000
RPHMAJCB EQU   ISTRPH+21                                                02706000
RPHWEA   EQU   ISTRPH+24                                                02707000
RPHCSPA  EQU   RPHWEA                                                   02708000
RPHSRPRM EQU   ISTRPH+28                                                02709000
RPHCRR   EQU   ISTRPH+32                                                02710000
RPHPABQA EQU   ISTRPH+36                                                02711000
RPHPABQP EQU   RPHPABQA+1                                               02712000
RPHWORK  EQU   ISTRPH+40                                                02713000
RPHSAVE1 EQU   RPHWORK                                                  02714000
RPHSBITS EQU   RPHSAVE1+1                                               02715000
ISTATCVT EQU   0                                                        02716000
ATCCOM   EQU   ISTATCVT                                                 02717000
ATCSTAT  EQU   ATCCOM                                                   02718000
ATCSTAT1 EQU   ATCSTAT                                                  02719000
ATCSTFLG EQU   ATCSTAT+1                                                02720000
ATCPOFLG EQU   ATCSTAT+2                                                02721000
ATCSTAT4 EQU   ATCSTAT+3                                                02722000
ATCBPDA  EQU   ATCCOM+128                                               02723000
ATCIOTRC EQU   ATCCOM+140                                               02724000
ATCTHTRC EQU   ATCIOTRC                                                 02725000
ATCSMRQ  EQU   ATCCOM+180                                               02726000
ATCSMRS  EQU   ATCCOM+188                                               02727000
ATCCSMR  EQU   ISTATCVT+296                                             02728000
ATCSHRFG EQU   ISTATCVT+316                                             02729000
ATCHPGM  EQU   ISTATCVT+384                                             02730000
ATCVLCNT EQU   ISTATCVT+772                                             02731000
ATCRNO   EQU   ISTATCVT+788                                             02732000
ATCSOPD  EQU   ISTATCVT+792                                             02733000
ATCSIPD  EQU   ISTATCVT+800                                             02734000
ATCSECST EQU   ISTATCVT+812                                             02735000
ATCSTAT2 EQU   ISTATCVT+818                                             02736000
ATCVTBAM EQU   ISTATCVT+908                                             02737000
@NM00023 EQU   ATCVTBAM+3                                               02738000
ATCAOSM  EQU   ISTATCVT+912                                             02739000
ATCGSRBQ EQU   ATCAOSM+4                                                02740000
ATCGSRBG EQU   ATCGSRBQ                                                 02741000
ATCAP31  EQU   ATCAOSM+24                                               02742000
ATCAP32  EQU   ATCAOSM+28                                               02743000
ATCAP34  EQU   ATCAOSM+32                                               02744000
ATCZPSVT EQU   ATCAOSM+72                                               02745000
ATCICAPP EQU   ATCAOSM+100                                              02746000
ATCLDAPP EQU   ATCAOSM+120                                              02747000
ATCDAPVT EQU   ATCAOSM+140                                              02748000
ATCAP37  EQU   ATCAOSM+264                                              02749000
ATCCRA   EQU   ATCAOSM+280                                              02750000
ATCCRACN EQU   ATCCRA+4                                                 02751000
ATCSRB   EQU   ATCAOSM+288                                              02752000
ATCSRBCN EQU   ATCSRB+4                                                 02753000
ATCCRPL  EQU   ATCAOSM+296                                              02754000
ATCRPLCN EQU   ATCCRPL+4                                                02755000
ATCSQAFR EQU   ATCAOSM+304                                              02756000
ATCORTBC EQU   ATCSQAFR+4                                               02757000
ATCORSRB EQU   ATCORTBC                                                 02758000
@NM00025 EQU   ATCAOSM+332                                              02759000
ATCVTFLG EQU   ATCAOSM+392                                              02760000
ATCZFLAG EQU   ATCAOSM+588                                              02761000
ISTRH    EQU   0                                                        02762000
RHFLAGS  EQU   ISTRH                                                    02763000
RH1      EQU   RHFLAGS                                                  02764000
RHQS     EQU   RH1                                                      02765000
RH2      EQU   RHFLAGS+1                                                02766000
RHRETRY  EQU   RH2                                                      02767000
RHRSVD1  EQU   RH2                                                      02768000
RH3      EQU   RHFLAGS+2                                                02769000
ISTZSAVE EQU   0                                                        02770000
ZSAZSVBC EQU   ISTZSAVE                                                 02771000
ZSAZSVMS EQU   ZSAZSVBC                                                 02772000
ZSAZACTV EQU   ZSAZSVMS                                                 02773000
ZSAZSVFC EQU   ISTZSAVE+4                                               02774000
ZSAZSVRR EQU   ISTZSAVE+8                                               02775000
ZSAZSVVR EQU   ISTZSAVE+12                                              02776000
ZSAZTRAC EQU   ISTZSAVE+36                                              02777000
ISTLCPB  EQU   0                                                        02778000
LCPREQTG EQU   ISTLCPB+2                                                02779000
LCPFLAGS EQU   LCPREQTG                                                 02780000
LCPZF001 EQU   LCPFLAGS                                                 02781000
LCPZRT02 EQU   LCPZF001                                                 02782000
LCPZF002 EQU   LCPFLAGS                                                 02783000
LCPZRT03 EQU   LCPZF002                                                 02784000
LCPZF003 EQU   LCPFLAGS                                                 02785000
LCPZRT04 EQU   LCPZF003                                                 02786000
LCPZF004 EQU   LCPFLAGS                                                 02787000
LCPZRT05 EQU   LCPZF004                                                 02788000
LCPZRT06 EQU   LCPFLAGS                                                 02789000
LCPZRT07 EQU   LCPFLAGS                                                 02790000
LCPMNRCD EQU   LCPREQTG+1                                               02791000
LCPZRT08 EQU   LCPMNRCD                                                 02792000
LCPZRT09 EQU   LCPMNRCD                                                 02793000
LCPCHAIN EQU   ISTLCPB+4                                                02794000
LCPCHAI1 EQU   LCPCHAIN                                                 02795000
LCPRUCNT EQU   ISTLCPB+8                                                02796000
LCPFLAG2 EQU   ISTLCPB+9                                                02797000
LCPTLBPI EQU   LCPFLAG2                                                 02798000
LCPFID0  EQU   LCPFLAG2                                                 02799000
LCPSEQ   EQU   ISTLCPB+10                                               02800000
LCPCID   EQU   ISTLCPB+16                                               02801000
LCPNXLCW EQU   ISTLCPB+20                                               02802000
LCPFDBA  EQU   ISTLCPB+24                                               02803000
LCPTLBAD EQU   ISTLCPB+28                                               02804000
LCPFLG1  EQU   ISTLCPB+37                                               02805000
LCPFLCCW EQU   ISTLCPB+40                                               02806000
LCPLCCW  EQU   ISTLCPB+48                                               02807000
LCPRSTQH EQU   LCPLCCW                                                  02808000
LCPPABA  EQU   LCPLCCW+4                                                02809000
LCPRPHA  EQU   LCPPABA                                                  02810000
LCPFTYPE EQU   LCPRPHA                                                  02811000
ISTZCRR  EQU   0                                                        02812000
ZCRCRR   EQU   ISTZCRR                                                  02813000
ZCRFLGS1 EQU   ISTZCRR+12                                               02814000
ZCRFLGS2 EQU   ISTZCRR+13                                               02815000
ZCRSWFLD EQU   ISTZCRR+14                                               02816000
ZCRENDSH EQU   ZCRSWFLD                                                 02817000
ZCRNDLCP EQU   ZCRSWFLD                                                 02818000
ZCRRESET EQU   ZCRSWFLD                                                 02819000
ZCRFLGS3 EQU   ISTZCRR+15                                               02820000
ZCRGENSW EQU   ISTZCRR+16                                               02821000
ZCRPFLGS EQU   ISTZCRR+17                                               02822000
ZCRIBPR  EQU   ISTZCRR+18                                               02823000
ZCRSCPSW EQU   ISTZCRR+19                                               02824000
ZCRTPEX  EQU   ZCRSCPSW                                                 02825000
ZCRTPINV EQU   ZCRSCPSW                                                 02826000
ZCRRJLCP EQU   ZCRSCPSW                                                 02827000
ZCRLREQ  EQU   ZCRSCPSW                                                 02828000
ZCRFSBWE EQU   ZCRSCPSW                                                 02829000
ZCRPARMS EQU   ISTZCRR+24                                               02830000
ZCRFBPTR EQU   ZCRPARMS                                                 02831000
ZCRDFRDA EQU   ZCRPARMS+10                                              02832000
ZCRPCOD1 EQU   ZCRPARMS+12                                              02833000
ZCRPFSB  EQU   ZCRPCOD1                                                 02834000
ZCRPLSBF EQU   ZCRPCOD1                                                 02835000
ZCRPBUF  EQU   ZCRPCOD1                                                 02836000
ZCRPCOD2 EQU   ZCRPARMS+13                                              02837000
ZCRSVRTN EQU   ISTZCRR+56                                               02838000
ZCRSVF5  EQU   ZCRSVRTN+16                                              02839000
ZCRSVF9  EQU   ZCRSVRTN+32                                              02840000
ZCRSVF10 EQU   ZCRSVRTN+36                                              02841000
ZCRSVF11 EQU   ZCRSVRTN+40                                              02842000
ZCRSVF19 EQU   ZCRSVRTN+72                                              02843000
ZCRSVF21 EQU   ZCRSVRTN+80                                              02844000
ZCRSVF22 EQU   ZCRSVRTN+84                                              02845000
ZCRSVF23 EQU   ZCRSVRTN+88                                              02846000
ZCRSVF24 EQU   ZCRSVRTN+92                                              02847000
ZCRSVF25 EQU   ZCRSVRTN+96                                              02848000
ZCRWKARA EQU   ISTZCRR+156                                              02849000
ZCRCIDSV EQU   ISTZCRR+192                                              02850000
ZCRAUDIT EQU   ISTZCRR+440                                              02851000
ZCRENTER EQU   ZCRAUDIT+5                                               02852000
ZCREBCSC EQU   ZCRENTER+4                                               02853000
ZCRLCPB  EQU   ISTZCRR+480                                              02854000
ZCRRHRU  EQU   ZCRLCPB                                                  02855000
ZCRRU    EQU   ZCRRHRU+3                                                02856000
ISTPFCRR EQU   0                                                        02857000
PFCCRR   EQU   ISTPFCRR                                                 02858000
PFCCRRID EQU   PFCCRR                                                   02859000
PFCCRRLN EQU   PFCCRR+2                                                 02860000
PFCHDR   EQU   ISTPFCRR+4                                               02861000
PFCCRRO  EQU   PFCHDR                                                   02862000
PFCFRRO  EQU   PFCHDR+4                                                 02863000
ISTCFCRR EQU   0                                                        02864000
CFCAUDIT EQU   ISTCFCRR                                                 02865000
CFCNTRD  EQU   CFCAUDIT                                                 02866000
CFCCRT   EQU   CFCAUDIT+1                                               02867000
ISTASCRR EQU   0                                                        02868000
ASCFLAGS EQU   ISTASCRR+16                                              02869000
ASCFLG1  EQU   ASCFLAGS                                                 02870000
ASCFLG2  EQU   ASCFLAGS+2                                               02871000
ASCFLG3  EQU   ASCFLAGS+4                                               02872000
ASCUSRGS EQU   ISTASCRR+28                                              02873000
ISTAPCRR EQU   0                                                        02874000
APCATFLG EQU   ISTAPCRR+16                                              02875000
APCRFLG  EQU   ISTAPCRR+18                                              02876000
APCSAVE  EQU   ISTAPCRR+44                                              02877000
APCCOMF  EQU   ISTAPCRR+116                                             02878000
APCCOMF1 EQU   APCCOMF                                                  02879000
APC31FLG EQU   ISTAPCRR+132                                             02880000
APC52FLG EQU   ISTAPCRR+133                                             02881000
APC53FLG EQU   ISTAPCRR+134                                             02882000
APC54FLG EQU   ISTAPCRR+135                                             02883000
APC57FLG EQU   ISTAPCRR+136                                             02884000
ISTCRA   EQU   0                                                        02885000
CRABASIC EQU   ISTCRA                                                   02886000
CRAHDR   EQU   CRABASIC                                                 02887000
CRACRR   EQU   CRAHDR                                                   02888000
CRALKACT EQU   CRABASIC+8                                               02889000
CRASVC   EQU   ISTCRA+848                                               02890000
CRABUFA  EQU   CRASVC+68                                                02891000
ISTZPSVT EQU   0                                                        02892000
ZPSZDFA0 EQU   ISTZPSVT                                                 02893000
ZPSZDFB0 EQU   ISTZPSVT+16                                              02894000
ISTRU    EQU   0                                                        02895000
RUDATA   EQU   ISTRU                                                    02896000
ISTRUB   EQU   0                                                        02897000
NSRUNA5  EQU   0                                                        02898000
ISTTLB   EQU   0                                                        02899000
TLBLCPA  EQU   ISTTLB                                                   02900000
TLBFSBA  EQU   ISTTLB+4                                                 02901000
TLBLCCWS EQU   ISTTLB+8                                                 02902000
ISTFDB   EQU   0                                                        02903000
FDBOFSET EQU   ISTFDB+10                                                02904000
ISTFSB   EQU   0                                                        02905000
FSBFSB   EQU   ISTFSB                                                   02906000
FSBTYPE  EQU   FSBFSB                                                   02907000
FSBMNRCD EQU   FSBFSB+2                                                 02908000
FSBSFLGS EQU   FSBFSB+3                                                 02909000
FSBFSBA  EQU   FSBFSB+4                                                 02910000
FSBBTH   EQU   FSBFSB+8                                                 02911000
FSBCID   EQU   FSBBTH                                                   02912000
FSBSAF   EQU   FSBCID                                                   02913000
FSBDAF   EQU   FSBCID+2                                                 02914000
FSBRQTAG EQU   FSBBTH+4                                                 02915000
FSBSEQID EQU   FSBRQTAG                                                 02916000
FSBFLAGS EQU   FSBSEQID                                                 02917000
FSBSEQ   EQU   FSBSEQID+1                                               02918000
FSBCSWST EQU   FSBBTH+6                                                 02919000
FSBTHFLD EQU   FSBCSWST                                                 02920000
FSBTH1   EQU   FSBTHFLD                                                 02921000
FSBSYSRS EQU   FSBTH1                                                   02922000
FSBTH2   EQU   FSBTHFLD+1                                               02923000
FSBEXTRS EQU   FSBTH2                                                   02924000
FSBXFSTS EQU   FSBEXTRS                                                 02925000
FSBXCODE EQU   FSBEXTRS                                                 02926000
FSBNETRS EQU   FSBFSB+16                                                02927000
FSBSRCAT EQU   FSBNETRS                                                 02928000
FSBMJRCD EQU   FSBSRCAT                                                 02929000
FSBERC   EQU   FSBNETRS+1                                               02930000
FSBFBMI  EQU   FSBERC                                                   02931000
FSBDMGRS EQU   FSBFSB+18                                                02932000
FSBSS1   EQU   FSBDMGRS                                                 02933000
FSBSS2   EQU   FSBDMGRS+1                                               02934000
FSBLCPB  EQU   FSBFSB+20                                                02935000
FSBMSGID EQU   FSBLCPB                                                  02936000
FSBLCCWA EQU   FSBFSB+24                                                02937000
FSBRLSTS EQU   FSBLCCWA                                                 02938000
FSBFDB   EQU   ISTFSB+32                                                02939000
ISTNCB   EQU   0                                                        02940000
NCBDAF   EQU   ISTNCB+2                                                 02941000
NCBFLAGS EQU   ISTNCB+24                                                02942000
NCBFRAS  EQU   NCBFLAGS+1                                               02943000
NCBFTRIO EQU   NCBFRAS                                                  02944000
NCBFLAG1 EQU   NCBFLAGS+2                                               02945000
ISTNIR   EQU   0                                                        02946000
ISTTH    EQU   0                                                        02947000
THFLAG1  EQU   ISTTH                                                    02948000
THFLGA   EQU   THFLAG1                                                  02949000
THMPF    EQU   THFLGA                                                   02950000
THFLGB   EQU   THFLAG1+1                                                02951000
ISTTH2   EQU   0                                                        02952000
TH2FLAG1 EQU   ISTTH2                                                   02953000
TH2MPF   EQU   TH2FLAG1                                                 02954000
ISTPIU   EQU   0                                                        02955000
PIUTH    EQU   ISTPIU                                                   02956000
ISTBDU   EQU   0                                                        02957000
BDUMODIF EQU   ISTBDU+1                                                 02958000
BDUMOD1  EQU   BDUMODIF                                                 02959000
BDUDAF   EQU   ISTBDU+2                                                 02960000
BDUFUNC  EQU   BDUDAF                                                   02961000
BDUCHECK EQU   BDUFUNC                                                  02962000
BDUFLAGS EQU   BDUDAF+1                                                 02963000
ISTLH    EQU   0                                                        02964000
ISTBTU   EQU   0                                                        02965000
BTUBTH   EQU   ISTBTU                                                   02966000
BTUFID   EQU   BTUBTH                                                   02967000
BTUREQ   EQU   BTUBTH+6                                                 02968000
BTURQFLG EQU   BTUREQ                                                   02969000
BTURH    EQU   BTUBTH+10                                                02970000
BTUSYSTR EQU   ISTBTU+18                                                02971000
ISTZIBUF EQU   0                                                        02972000
ZIBCHAIN EQU   ISTZIBUF                                                 02973000
ZIBFSM   EQU   ISTZIBUF+4                                               02974000
ISTLUNCB EQU   0                                                        02975000
LUNCB    EQU   ISTLUNCB                                                 02976000
LUNZOS   EQU   ISTLUNCB+48                                              02977000
ISTBFHDR EQU   0                                                        02978000
ISTBIND  EQU   0                                                        02979000
BINFMTY  EQU   ISTBIND                                                  02980000
BINTS    EQU   ISTBIND+2                                                02981000
BINPRIP  EQU   ISTBIND+3                                                02982000
BINSECP  EQU   ISTBIND+4                                                02983000
BINCMNP  EQU   ISTBIND+5                                                02984000
BINCMNP2 EQU   ISTBIND+6                                                02985000
BINTSU   EQU   ISTBIND+7                                                02986000
BINRPACE EQU   BINTSU+1                                                 02987000
BINRUSZ  EQU   BINTSU+2                                                 02988000
BINSRUSZ EQU   BINRUSZ                                                  02989000
BINPRUSZ EQU   BINRUSZ+1                                                02990000
BINPRSVC EQU   ISTBIND+13                                               02991000
BINLUP   EQU   BINPRSVC                                                 02992000
BINPSCHR EQU   BINPRSVC+1                                               02993000
DATALCCW EQU   0                                                        02994000
ISTZDFA0 EQU   0                                                        02995000
ISTZDFB0 EQU   0                                                        02996000
FMZL0016 EQU   0                                                        02997000
ISTWKE   EQU   0                                                        02998000
WKECHAIN EQU   ISTWKE+4                                                 02999000
WKEFLAGS EQU   WKECHAIN                                                 03000000
ISTBPENT EQU   0                                                        03001000
BPEFLAGS EQU   ISTBPENT+4                                               03002000
ISTBPDTY EQU   0                                                        03003000
BPDHDR   EQU   ISTBPDTY                                                 03004000
BPDPGPCB EQU   BPDHDR+12                                                03005000
BPDFLAG  EQU   BPDHDR+40                                                03006000
BPDPARM  EQU   BPDHDR+48                                                03007000
BPDTRACE EQU   BPDHDR+56                                                03008000
FMZL0054 EQU   0                                                        03009000
FMZL0079 EQU   0                                                        03010000
ISTAPC37 EQU   0                                                        03011000
ISTAPC34 EQU   0                                                        03012000
ZIBSRB   EQU   0                                                        03013000
CVTS01   EQU   CVTPGSIA                                                 03014000
CVTLPDIA EQU   CVTS01+12                                                03015000
CVTDIRST EQU   CVTLPDIA                                                 03016000
CVTSLIDA EQU   CVTS01+24                                                03017000
CVTCTLFG EQU   CVTS01+50                                                03018000
CVTRV210 EQU   CVTS01+424                                               03019000
CVTRV219 EQU   CVTS01+425                                               03020000
CVTRV228 EQU   CVTS01+426                                               03021000
CVTRV237 EQU   CVTS01+427                                               03022000
CVTMFRTR EQU   CVTS01+452                                               03023000
CVTRV262 EQU   CVTS01+468                                               03024000
CVTRV271 EQU   CVTS01+469                                               03025000
CVTRV280 EQU   CVTS01+470                                               03026000
CVTRV289 EQU   CVTS01+471                                               03027000
CVTGSDA  EQU   CVTS01+600                                               03028000
LCPBPTR  EQU   ZCRSVF10                                                 03029000
LCPZTIE  EQU   LCPCID                                                   03030000
LCPZSNAM EQU   LCPZTIE+8                                                03031000
ISTSENRU EQU   RUDATA                                                   03032000
SRUSENSE EQU   ISTSENRU                                                 03033000
SRUSENS1 EQU   SRUSENSE                                                 03034000
SRUSENS2 EQU   SRUSENSE+2                                               03035000
ISTSRU   EQU   ISTRUB                                                   03036000
SRUQSREQ EQU   ISTSRU                                                   03037000
SRUDATA  EQU   ISTSRU+1                                                 03038000
SRUTYPE  EQU   SRUDATA                                                  03039000
SRUSPAC  EQU   SRUTYPE                                                  03040000
SRUPSAC  EQU   SRUTYPE                                                  03041000
SRULDID  EQU   SRUDATA+1                                                03042000
SRUSPSN  EQU   SRULDID                                                  03043000
SRUDFCLV EQU   SRUSPSN                                                  03044000
SRUPSSN  EQU   SRULDID+2                                                03045000
ISTNSRU  EQU   ISTRUB                                                   03046000
NSRUNETS EQU   ISTNSRU                                                  03047000
NSRUDATA EQU   ISTNSRU+3                                                03048000
NSRUHOOK EQU   NSRUDATA                                                 03049000
NSSSVRU  EQU   NSRUDATA                                                 03050000
NSSSVNOD EQU   NSSSVRU+3                                                03051000
NSSSVT3  EQU   NSSSVNOD                                                 03052000
NSSSVT3C EQU   NSSSVT3+2                                                03053000
NSSSVT3G EQU   NSSSVT3+5                                                03054000
NSSSVT4  EQU   NSSSVNOD                                                 03055000
NSSSVT5  EQU   NSSSVNOD                                                 03056000
NSRUDAT1 EQU   NSRUDATA                                                 03057000
NSRUDAT2 EQU   NSRUDAT1+2                                               03058000
ISTTRRU  EQU   NSRUDAT2                                                 03059000
TRRTYPE  EQU   ISTTRRU                                                  03060000
ISTCTDRU EQU   NSRUDAT2                                                 03061000
ISTINORU EQU   NSRUDAT2                                                 03062000
SRUDAT1  EQU   SRUDATA                                                  03063000
SRUDAT1L EQU   SRUDAT1+1                                                03064000
SRUTSPRO EQU   SRUDAT1L                                                 03065000
SRUDAT2  EQU   SRUDATA                                                  03066000
ISTMRU   EQU   ISTRUB                                                   03067000
SRUDATA3 EQU   SRUDATA                                                  03068000
SRUDATA4 EQU   SRUDATA                                                  03069000
NSRUDAT3 EQU   NSRUDAT2                                                 03070000
NSRUDAT4 EQU   NSRUDAT2                                                 03071000
NSRUDAT5 EQU   NSRUDAT2                                                 03072000
NSRUDAT6 EQU   NSRUDAT2                                                 03073000
NSRUDAT7 EQU   NSRUDAT2                                                 03074000
NSRUDIL  EQU   NSRUDAT2                                                 03075000
NSRUDILB EQU   NSRUDIL+1                                                03076000
NSRUNA   EQU   NSRUDAT2                                                 03077000
NSRUNA2  EQU   NSRUNA+1                                                 03078000
NSRUCLSP EQU   NSRUDAT2                                                 03079000
NSRUOH1  EQU   NSRUDAT2                                                 03080000
NSRUDAT8 EQU   NSRUDATA                                                 03081000
ISTUNBRU EQU   SRUTYPE                                                  03082000
FSBPTR   EQU   ZCRSVF9                                                  03083000
FSBCOMBN EQU   FSBNETRS                                                 03084000
FSBRHFLD EQU   FSBCOMBN+1                                               03085000
FSBRH3   EQU   FSBRHFLD+2                                               03086000
FSBLDFLG EQU   FSBRH3                                                   03087000
@NM00051 EQU   FSBRQTAG                                                 03088000
ZIBDIO   EQU   ZIBFSM                                                   03089000
ZIBCCW2  EQU   ZIBDIO+8                                                 03090000
ZIBCPTCC EQU   ZIBCCW2                                                  03091000
ZIBAIO   EQU   ISTZIBUF                                                 03092000
ZIBAIOCM EQU   ZIBAIO                                                   03093000
ZIBFIB   EQU   ZIBAIO+16                                                03094000
ZIBFSB   EQU   ZIBFIB                                                   03095000
ZIBMDREC EQU   ZIBFSB+4                                                 03096000
ZIBMDRIN EQU   ZIBFSB+28                                                03097000
ZIBBTU   EQU   ZIBFIB+32                                                03098000
@NM00056 EQU   ZIBBTU+12                                                03099000
ZIBFID1  EQU   @NM00056+1                                               03100000
ZIBFITXT EQU   ZIBFID1                                                  03101000
ZIBSIB   EQU   ZIBFIB                                                   03102000
ZIBREC   EQU   ZIBMDRIN                                                 03103000
ZIBRECPL EQU   ZIBREC                                                   03104000
ZIBRECHD EQU   ZIBRECPL                                                 03105000
ZIBRECRS EQU   ZIBREC+8                                                 03106000
ZIBRECDT EQU   ZIBREC+10                                                03107000
ZIBMDRRC EQU   ZIBMDREC                                                 03108000
ZIBRCPL  EQU   ZIBMDRRC                                                 03109000
ZIBRCDT  EQU   ZIBMDRRC+24                                              03110000
@NM00058 EQU   ZIBBTU                                                   03111000
BINLUP1  EQU   BINPSCHR                                                 03112000
BINLUS   EQU   BINPSCHR                                                 03113000
BINFMF1  EQU   BINLUS                                                   03114000
BINRSV09 EQU   BINFMF1                                                  03115000
BINDSPF1 EQU   BINLUS+2                                                 03116000
BINMEDIA EQU   BINLUS+4                                                 03117000
BINLUP2  EQU   BINPSCHR                                                 03118000
BINLUP3  EQU   BINPSCHR                                                 03119000
R14SAVE  EQU   ZCRSVF19                                                 03120000
NFYSAVE  EQU   ZCRSVF11                                                 03121000
TLBPTR   EQU   ZCRSVF5                                                  03122000
LCCWPTR  EQU   ZCRSVF21                                                 03123000
SRUPTR   EQU   ZCRSVF22                                                 03124000
RHPTR    EQU   ZCRSVF23                                                 03125000
LENTLB   EQU   ZCRSVF24                                                 03126000
RUPTRC   EQU   ZCRSVF25                                                 03127000
SRUCOPY  EQU   ZCRRU                                                    03128000
ZIBPTR   EQU   RPHSRPRM                                                 03129000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03130000
BINRSV26 EQU   BINLUP3                                                  03131000
BINRSV15 EQU   BINLUP2+10                                               03132000
BINPRESZ EQU   BINLUP2+9                                                03133000
BINRSV14 EQU   BINLUP2                                                  03134000
BINRSV13 EQU   BINMEDIA                                                 03135000
BINDISK  EQU   BINMEDIA                                                 03136000
BINXCHNG EQU   BINMEDIA                                                 03137000
BINCARD  EQU   BINMEDIA                                                 03138000
BINDOCMT EQU   BINMEDIA                                                 03139000
BINRSV17 EQU   BINDSPF1+1                                               03140000
BINTRNDS EQU   BINDSPF1                                                 03141000
BINRSV12 EQU   BINDSPF1                                                 03142000
BINVSDS  EQU   BINDSPF1                                                 03143000
BINVTDS  EQU   BINDSPF1                                                 03144000
BINHFDS  EQU   BINDSPF1                                                 03145000
BININTR  EQU   BINDSPF1                                                 03146000
BINRSV11 EQU   BINRSV09+1                                               03147000
BINXFPD  EQU   BINRSV09+1                                               03148000
BINCSDS  EQU   BINRSV09+1                                               03149000
BINQDSI  EQU   BINRSV09+1                                               03150000
BINRSV16 EQU   BINRSV09+1                                               03151000
BINARRR  EQU   BINRSV09                                                 03152000
BINSIDS  EQU   BINRSV09                                                 03153000
BINSAI   EQU   BINRSV09                                                 03154000
BINSDSI  EQU   BINRSV09                                                 03155000
BINKDDSI EQU   BINRSV09                                                 03156000
BINPDIR  EQU   BINFMF1                                                  03157000
BINCMPCT EQU   BINFMF1                                                  03158000
BINDESTS EQU   BINFMF1                                                  03159000
BINSLUS1 EQU   BINLUP1+6                                                03160000
BINPLUS1 EQU   BINLUP1+1                                                03161000
BINDSP1  EQU   BINLUP1                                                  03162000
BINFMHS1 EQU   BINLUP1                                                  03163000
ZIBTH2   EQU   @NM00058+4                                               03164000
ZIBLH    EQU   @NM00058                                                 03165000
ZIBRCTXT EQU   ZIBMDRRC+36                                              03166000
ZIBRCRID EQU   ZIBRCDT+10                                               03167000
ZIBRCNAM EQU   ZIBRCDT+2                                                03168000
ZIBRCUA  EQU   ZIBRCDT                                                  03169000
ZIBRCPUI EQU   ZIBRCPL+20                                               03170000
ZIBRCPUN EQU   ZIBRCPL+16                                               03171000
ZIBRCTIM EQU   ZIBRCPL+12                                               03172000
ZIBRCDAT EQU   ZIBRCPL+8                                                03173000
ZIBRCRS1 EQU   ZIBRCPL+6                                                03174000
ZIBRCSID EQU   ZIBRCPL+5                                                03175000
ZIBRCID  EQU   ZIBRCPL+4                                                03176000
ZIBRCSW  EQU   ZIBRCPL+2                                                03177000
ZIBRCSYR EQU   ZIBRCPL+1                                                03178000
ZIBRCL   EQU   ZIBRCPL                                                  03179000
ZIBRECTX EQU   ZIBREC+22                                                03180000
ZIBRECID EQU   ZIBRECDT+10                                              03181000
ZIBRECNA EQU   ZIBRECDT+2                                               03182000
ZIBRECUA EQU   ZIBRECDT                                                 03183000
ZIBRECSV EQU   ZIBRECRS                                                 03184000
ZIBRECDA EQU   ZIBRECPL+4                                               03185000
ZIBRECSI EQU   ZIBRECHD+3                                               03186000
ZIBRECDV EQU   ZIBRECHD+2                                               03187000
ZIBRECFL EQU   ZIBRECHD+1                                               03188000
ZIBRECTY EQU   ZIBRECHD                                                 03189000
ZIBTEXT  EQU   ZIBSIB+4                                                 03190000
ZIBRSV04 EQU   ZIBSIB                                                   03191000
ZIBTEXT2 EQU   ZIBFITXT                                                 03192000
ZIBTEXT1 EQU   ZIBFIB+52                                                03193000
@NM00057 EQU   @NM00056                                                 03194000
ZIBFDBS  EQU   ZIBBTU                                                   03195000
@NM00055 EQU   ZIBMDREC                                                 03196000
@NM00054 EQU   ZIBFSB                                                   03197000
ZIBLNG2  EQU   ZIBAIOCM+14                                              03198000
ZIBRSV03 EQU   ZIBAIOCM+13                                              03199000
ZIBWKBYT EQU   ZIBAIOCM+12                                              03200000
ZIBFDBZ  EQU   ZIBAIOCM                                                 03201000
ZIBCPNPK EQU   ZIBCCW2+6                                                03202000
ZIBRSV02 EQU   ZIBCCW2+5                                                03203000
ZIBCPTPF EQU   ZIBCCW2+4                                                03204000
ZIBCPTCA EQU   ZIBCCW2+1                                                03205000
ZIBCPNPC EQU   ZIBCPTCC                                                 03206000
ZIBCPRDK EQU   ZIBDIO+6                                                 03207000
ZIBRSV01 EQU   ZIBDIO+5                                                 03208000
ZIBCPRDF EQU   ZIBDIO+4                                                 03209000
ZIBCPTXA EQU   ZIBDIO+1                                                 03210000
ZIBCPRDC EQU   ZIBDIO                                                   03211000
FSBRT0B  EQU   @NM00051+1                                               03212000
FSBRT0A  EQU   @NM00051+1                                               03213000
FSBRT09  EQU   @NM00051+1                                               03214000
FSBRT08  EQU   @NM00051+1                                               03215000
FSBRT07  EQU   @NM00051                                                 03216000
FSBRT06  EQU   @NM00051                                                 03217000
FSBRT05  EQU   @NM00051                                                 03218000
FSBRT04  EQU   @NM00051                                                 03219000
FSBRT03  EQU   @NM00051                                                 03220000
FSBRT02  EQU   @NM00051                                                 03221000
FSBRT01  EQU   @NM00051                                                 03222000
FSBRT00  EQU   @NM00051                                                 03223000
FSBLDCUF EQU   FSBLDFLG                                                 03224000
FSBLDSIF EQU   FSBLDFLG                                                 03225000
FSBLDSOF EQU   FSBLDFLG                                                 03226000
FSBLDEBF EQU   FSBLDFLG                                                 03227000
FSBLDBBF EQU   FSBLDFLG                                                 03228000
FSBLDFME EQU   FSBLDFLG                                                 03229000
FSBLDSCF EQU   FSBLDFLG                                                 03230000
FSBLDRMF EQU   FSBLDFLG                                                 03231000
FSBRH2   EQU   FSBRHFLD+1                                               03232000
FSBRH1   EQU   FSBRHFLD                                                 03233000
FSBALIGN EQU   FSBCOMBN                                                 03234000
UNBTYPE  EQU   ISTUNBRU                                                 03235000
NSRUDA8T EQU   NSRUDAT8                                                 03236000
NSRUOHID EQU   NSRUOH1                                                  03237000
NSRULSV  EQU   NSRUCLSP                                                 03238000
NSRUNA4  EQU   NSRUNA+2                                                 03239000
NSRUNA3  EQU   NSRUNA2                                                  03240000
NSRUNA1  EQU   NSRUNA                                                   03241000
NSRUDILF EQU   NSRUDIL+4                                                03242000
NSRUDILE EQU   NSRUDIL+3                                                03243000
NSRUDILD EQU   NSRUDIL+2                                                03244000
NSRUDILC EQU   NSRUDILB                                                 03245000
@NM00047 EQU   NSRUDILB                                                 03246000
NSRUDILA EQU   NSRUDIL                                                  03247000
NSRUDA7T EQU   NSRUDAT7                                                 03248000
NSRUDA6L EQU   NSRUDAT6+4                                               03249000
NSRUDA6S EQU   NSRUDAT6                                                 03250000
NSRUDA5E EQU   NSRUDAT5                                                 03251000
NSRUDA4T EQU   NSRUDAT4                                                 03252000
NSRUDA3S EQU   NSRUDAT3                                                 03253000
SRUDAT4D EQU   SRUDATA4                                                 03254000
SRUDAT3I EQU   SRUDATA3                                                 03255000
MRUDATA  EQU   ISTMRU+9                                                 03256000
MRURESP  EQU   ISTMRU+7                                                 03257000
MRUMODIF EQU   ISTMRU+6                                                 03258000
MRUCMND  EQU   ISTMRU+5                                                 03259000
MRUDAF   EQU   ISTMRU+3                                                 03260000
MRUREQ   EQU   ISTMRU+2                                                 03261000
MRUPREF  EQU   ISTMRU                                                   03262000
SRUDAT2N EQU   SRUDAT2+1                                                03263000
SRUDAT2T EQU   SRUDAT2                                                  03264000
SRUDAT1I EQU   SRUDAT1+2                                                03265000
SRUFMPRO EQU   SRUDAT1L                                                 03266000
SRUDAT1T EQU   SRUDAT1                                                  03267000
INORUET  EQU   ISTINORU                                                 03268000
CTDRUSTA EQU   ISTCTDRU                                                 03269000
TRRDATA  EQU   ISTTRRU+4                                                03270000
TRRSTAT  EQU   ISTTRRU+3                                                03271000
TRRPEP   EQU   ISTTRRU+2                                                03272000
TRRTIME  EQU   ISTTRRU+1                                                03273000
@NM00046 EQU   TRRTYPE                                                  03274000
TRRFMT2  EQU   TRRTYPE                                                  03275000
@NM00045 EQU   TRRTYPE                                                  03276000
NSRUDAF  EQU   NSRUDAT1                                                 03277000
NSSSVT5A EQU   NSSSVT5                                                  03278000
NSSSVT4D EQU   NSSSVT4+3                                                03279000
NSSSVT4C EQU   NSSSVT4+2                                                03280000
NSSSVT4B EQU   NSSSVT4+1                                                03281000
NSSSVT4A EQU   NSSSVT4                                                  03282000
NSSSVT3K EQU   NSSSVT3+8                                                03283000
NSSSVT3J EQU   NSSSVT3+7                                                03284000
NSSSVT3I EQU   NSSSVT3+6                                                03285000
@NM00044 EQU   NSSSVT3G                                                 03286000
NSSSVT3H EQU   NSSSVT3G                                                 03287000
NSSSVT3F EQU   NSSSVT3+4                                                03288000
NSSSVT3E EQU   NSSSVT3+3                                                03289000
@NM00043 EQU   NSSSVT3C                                                 03290000
NSSSVT3D EQU   NSSSVT3C                                                 03291000
NSSSVT3B EQU   NSSSVT3+1                                                03292000
NSSSVT3A EQU   NSSSVT3                                                  03293000
NSSSVT   EQU   NSSSVRU+2                                                03294000
NSSSVDAF EQU   NSSSVRU                                                  03295000
NSRUHKTY EQU   NSRUHOOK                                                 03296000
NSRURCD  EQU   NSRUNETS+2                                               03297000
NSRUSUB  EQU   NSRUNETS+1                                               03298000
NSRUID   EQU   NSRUNETS                                                 03299000
SRURSV01 EQU   SRULDID+4                                                03300000
@NM00042 EQU   SRUTYPE                                                  03301000
SENRU    EQU   ISTSENRU+4                                               03302000
SRUSNS4  EQU   SRUSENS2+1                                               03303000
SRUSNS3  EQU   SRUSENS2                                                 03304000
SRUSNST  EQU   SRUSENS1+1                                               03305000
SRUSNS1  EQU   SRUSENS1                                                 03306000
LCPZTRV4 EQU   LCPZSNAM+4                                               03307000
LCPZTRV1 EQU   LCPZSNAM                                                 03308000
LCPZSNA  EQU   LCPZTIE+4                                                03309000
LCPZFMCA EQU   LCPZTIE                                                  03310000
CVTRV628 EQU   CVTS01+728                                               03311000
CVTRV627 EQU   CVTS01+724                                               03312000
CVTRV626 EQU   CVTS01+720                                               03313000
CVTRV625 EQU   CVTS01+716                                               03314000
CVTRV624 EQU   CVTS01+712                                               03315000
CVTRV623 EQU   CVTS01+708                                               03316000
CVTRV622 EQU   CVTS01+704                                               03317000
CVTRV621 EQU   CVTS01+700                                               03318000
CVTRV620 EQU   CVTS01+696                                               03319000
CVTRV619 EQU   CVTS01+692                                               03320000
CVTRV618 EQU   CVTS01+688                                               03321000
CVTRV617 EQU   CVTS01+684                                               03322000
CVTRV616 EQU   CVTS01+680                                               03323000
CVTRV615 EQU   CVTS01+676                                               03324000
CVTRV614 EQU   CVTS01+672                                               03325000
CVTRV613 EQU   CVTS01+668                                               03326000
CVTTCASP EQU   CVTS01+664                                               03327000
CVT0PT03 EQU   CVTS01+660                                               03328000
CVT0PT0E EQU   CVTS01+656                                               03329000
CVTIRM   EQU   CVTS01+652                                               03330000
CVTCGK   EQU   CVTS01+648                                               03331000
CVTRV607 EQU   CVTS01+644                                               03332000
CVTRV606 EQU   CVTS01+640                                               03333000
CVTRV605 EQU   CVTS01+636                                               03334000
CVTRV604 EQU   CVTS01+632                                               03335000
CVTEFF02 EQU   CVTS01+628                                               03336000
CVTCBBR  EQU   CVTS01+624                                               03337000
CVTSSCR  EQU   CVTS01+620                                               03338000
CVTEVENT EQU   CVTS01+616                                               03339000
CVTCRCA  EQU   CVTS01+612                                               03340000
CVTTPIO  EQU   CVTS01+608                                               03341000
CVTADV   EQU   CVTS01+604                                               03342000
CVTGSDAB EQU   CVTGSDA                                                  03343000
CVTQV3   EQU   CVTS01+596                                               03344000
CVTQV2   EQU   CVTS01+592                                               03345000
CVTQV1   EQU   CVTS01+588                                               03346000
CVTRPT   EQU   CVTS01+584                                               03347000
CVTSSRB  EQU   CVTS01+580                                               03348000
CVTCSDRL EQU   CVTS01+576                                               03349000
CVTEXP1  EQU   CVTS01+572                                               03350000
CVTRMPMT EQU   CVTS01+568                                               03351000
CVTRMPTT EQU   CVTS01+564                                               03352000
CVTVPSA  EQU   CVTS01+560                                               03353000
CVTVSTOP EQU   CVTS01+556                                               03354000
CVTGTFR8 EQU   CVTS01+552                                               03355000
CVTQUIT  EQU   CVTS01+548                                               03356000
CVTVACR  EQU   CVTS01+544                                               03357000
CVTWTCB  EQU   CVTS01+540                                               03358000
CVTSTPRS EQU   CVTS01+536                                               03359000
CVT0PT02 EQU   CVTS01+532                                               03360000
CVTDARCM EQU   CVTS01+528                                               03361000
CVTIRECM EQU   CVTS01+524                                               03362000
CVTJRECM EQU   CVTS01+520                                               03363000
CVTVEMS0 EQU   CVTS01+516                                               03364000
CVTSPFRR EQU   CVTS01+512                                               03365000
CVTRLSTG EQU   CVTS01+508                                               03366000
CVT0TC0A EQU   CVTS01+504                                               03367000
CVTGMBR  EQU   CVTS01+500                                               03368000
CVTLFRM  EQU   CVTS01+496                                               03369000
CVTRMBR  EQU   CVTS01+492                                               03370000
CVTVIOP  EQU   CVTS01+488                                               03371000
CVTRV307 EQU   CVTS01+486                                               03372000
CVTRV306 EQU   CVTS01+484                                               03373000
CVTRV305 EQU   CVTS01+482                                               03374000
CVTRV304 EQU   CVTS01+480                                               03375000
CVTRV303 EQU   CVTS01+478                                               03376000
CVTRV302 EQU   CVTS01+476                                               03377000
CVTTRCA  EQU   CVTS01+472                                               03378000
CVTRV297 EQU   CVTRV289                                                 03379000
CVTRV296 EQU   CVTRV289                                                 03380000
CVTRV295 EQU   CVTRV289                                                 03381000
CVTRV294 EQU   CVTRV289                                                 03382000
CVTRV293 EQU   CVTRV289                                                 03383000
CVTRV292 EQU   CVTRV289                                                 03384000
CVTRV291 EQU   CVTRV289                                                 03385000
CVTRV290 EQU   CVTRV289                                                 03386000
CVTRV288 EQU   CVTRV280                                                 03387000
CVTRV287 EQU   CVTRV280                                                 03388000
CVTRV286 EQU   CVTRV280                                                 03389000
CVTRV285 EQU   CVTRV280                                                 03390000
CVTRV284 EQU   CVTRV280                                                 03391000
CVTRV283 EQU   CVTRV280                                                 03392000
CVTRV282 EQU   CVTRV280                                                 03393000
CVTRV281 EQU   CVTRV280                                                 03394000
CVTRV279 EQU   CVTRV271                                                 03395000
CVTRV278 EQU   CVTRV271                                                 03396000
CVTRV277 EQU   CVTRV271                                                 03397000
CVTRV276 EQU   CVTRV271                                                 03398000
CVTRV275 EQU   CVTRV271                                                 03399000
CVTRV274 EQU   CVTRV271                                                 03400000
CVTRV273 EQU   CVTRV271                                                 03401000
CVTRV272 EQU   CVTRV271                                                 03402000
CVTRV270 EQU   CVTRV262                                                 03403000
CVTRV269 EQU   CVTRV262                                                 03404000
CVTRV268 EQU   CVTRV262                                                 03405000
CVTRV267 EQU   CVTRV262                                                 03406000
CVTRV266 EQU   CVTRV262                                                 03407000
CVTRV265 EQU   CVTRV262                                                 03408000
CVTRV264 EQU   CVTRV262                                                 03409000
CVTRV263 EQU   CVTRV262                                                 03410000
CVTVFP   EQU   CVTS01+464                                               03411000
CVTVSI   EQU   CVTS01+460                                               03412000
CVTVPSIB EQU   CVTS01+456                                               03413000
CVTMFACT EQU   CVTMFRTR                                                 03414000
CVTMFCTL EQU   CVTS01+448                                               03415000
CVTPVBP  EQU   CVTS01+444                                               03416000
CVTPWI   EQU   CVTS01+440                                               03417000
CVTRV254 EQU   CVTS01+438                                               03418000
CVTRV253 EQU   CVTS01+436                                               03419000
CVTRV252 EQU   CVTS01+434                                               03420000
CVTRV251 EQU   CVTS01+433                                               03421000
CVTRV250 EQU   CVTS01+432                                               03422000
CVTRV249 EQU   CVTS01+431                                               03423000
CVTRV248 EQU   CVTS01+430                                               03424000
CVTRV247 EQU   CVTS01+429                                               03425000
CVTRV246 EQU   CVTS01+428                                               03426000
CVTRV245 EQU   CVTRV237                                                 03427000
CVTRV244 EQU   CVTRV237                                                 03428000
CVTRV243 EQU   CVTRV237                                                 03429000
CVTRV242 EQU   CVTRV237                                                 03430000
CVTRV241 EQU   CVTRV237                                                 03431000
CVTRV240 EQU   CVTRV237                                                 03432000
CVTRV239 EQU   CVTRV237                                                 03433000
CVTRV238 EQU   CVTRV237                                                 03434000
CVTRV236 EQU   CVTRV228                                                 03435000
CVTRV235 EQU   CVTRV228                                                 03436000
CVTRV234 EQU   CVTRV228                                                 03437000
CVTRV233 EQU   CVTRV228                                                 03438000
CVTRV232 EQU   CVTRV228                                                 03439000
CVTRV231 EQU   CVTRV228                                                 03440000
CVTRV230 EQU   CVTRV228                                                 03441000
CVTRV229 EQU   CVTRV228                                                 03442000
CVTRV227 EQU   CVTRV219                                                 03443000
CVTRV226 EQU   CVTRV219                                                 03444000
CVTRV225 EQU   CVTRV219                                                 03445000
CVTRV224 EQU   CVTRV219                                                 03446000
CVTRV223 EQU   CVTRV219                                                 03447000
CVTRV222 EQU   CVTRV219                                                 03448000
CVTRV221 EQU   CVTRV219                                                 03449000
CVTRV220 EQU   CVTRV219                                                 03450000
CVTRV218 EQU   CVTRV210                                                 03451000
CVTRV217 EQU   CVTRV210                                                 03452000
CVTRV216 EQU   CVTRV210                                                 03453000
CVTRV215 EQU   CVTRV210                                                 03454000
CVTRV214 EQU   CVTRV210                                                 03455000
CVTRV213 EQU   CVTRV210                                                 03456000
CVTRV212 EQU   CVTRV210                                                 03457000
CVTRV211 EQU   CVTRV210                                                 03458000
CVTLCCAT EQU   CVTS01+420                                               03459000
CVTPCCAT EQU   CVTS01+416                                               03460000
CVTIPCRP EQU   CVTS01+412                                               03461000
CVTIPCRI EQU   CVTS01+408                                               03462000
CVTIPCDS EQU   CVTS01+404                                               03463000
CVTAIDVT EQU   CVTS01+400                                               03464000
CVTSSAP  EQU   CVTS01+396                                               03465000
CVTEHCIR EQU   CVTS01+392                                               03466000
CVTEHDEF EQU   CVTS01+388                                               03467000
CVTDAIR  EQU   CVTS01+384                                               03468000
CVTPERFM EQU   CVTS01+380                                               03469000
CVT044R2 EQU   CVTS01+376                                               03470000
CVTFETCH EQU   CVTS01+372                                               03471000
CVTRSTWD EQU   CVTS01+368                                               03472000
CVTSPOST EQU   CVTS01+364                                               03473000
CVTIOBP  EQU   CVTS01+360                                               03474000
CVTASMVT EQU   CVTS01+356                                               03475000
CVTRECRQ EQU   CVTS01+352                                               03476000
CVTWSAC  EQU   CVTS01+348                                               03477000
CVTRV149 EQU   CVTS01+344                                               03478000
CVTWSAL  EQU   CVTS01+340                                               03479000
CVTSPSA  EQU   CVTS01+336                                               03480000
CVTGLMN  EQU   CVTS01+332                                               03481000
CVTVEAC0 EQU   CVTS01+328                                               03482000
CVT062R1 EQU   CVTS01+324                                               03483000
CVTRPOST EQU   CVTS01+320                                               03484000
CVTDQIQE EQU   CVTS01+316                                               03485000
CVTCSD   EQU   CVTS01+312                                               03486000
CVTLKRMA EQU   CVTS01+308                                               03487000
CVTRSPIE EQU   CVTS01+304                                               03488000
CVTRENQ  EQU   CVTS01+300                                               03489000
CVTLQCB  EQU   CVTS01+296                                               03490000
CVTFQCB  EQU   CVTS01+292                                               03491000
CVTQCS01 EQU   CVTS01+288                                               03492000
CVTAPFT  EQU   CVTS01+284                                               03493000
CVTPARRL EQU   CVTS01+280                                               03494000
CVTVWAIT EQU   CVTS01+276                                               03495000
CVTGSPL  EQU   CVTS01+272                                               03496000
CVTLSMQ  EQU   CVTS01+268                                               03497000
CVTGSMQ  EQU   CVTS01+264                                               03498000
CVTEXPRO EQU   CVTS01+260                                               03499000
CVTOPCTP EQU   CVTS01+256                                               03500000
CVTSIC   EQU   CVTS01+252                                               03501000
CVTTPIOS EQU   CVTS01+248                                               03502000
CVTRTMS  EQU   CVTS01+244                                               03503000
CVTSDBF  EQU   CVTS01+240                                               03504000
CVTSCBP  EQU   CVTS01+236                                               03505000
CVTSDMP  EQU   CVTS01+232                                               03506000
CVTSV60  EQU   CVTS01+228                                               03507000
CVTRTMCT EQU   CVTS01+224                                               03508000
CVTASCBL EQU   CVTS01+220                                               03509000
CVTASCBH EQU   CVTS01+216                                               03510000
CVTGDA   EQU   CVTS01+212                                               03511000
CVTASVT  EQU   CVTS01+208                                               03512000
CVTVVMDI EQU   CVTS01+204                                               03513000
CVTAQTOP EQU   CVTS01+200                                               03514000
CVTIOSCS EQU   CVTS01+196                                               03515000
CVTSDRM  EQU   CVTS01+192                                               03516000
CVTOPTE  EQU   CVTS01+188                                               03517000
CVTSTXU  EQU   CVTS01+184                                               03518000
CVTQUIS  EQU   CVTS01+180                                               03519000
CVTPARS  EQU   CVTS01+176                                               03520000
CVTS1EE  EQU   CVTS01+172                                               03521000
CVTFRAS  EQU   CVTS01+168                                               03522000
CVTQSAS  EQU   CVTS01+164                                               03523000
CVTCRAS  EQU   CVTS01+160                                               03524000
CVTCRMN  EQU   CVTS01+156                                               03525000
CVTDELCP EQU   CVTS01+152                                               03526000
CVTFRECL EQU   CVTS01+148                                               03527000
CVTGETCL EQU   CVTS01+144                                               03528000
CVTBLDCP EQU   CVTS01+140                                               03529000
CVTAUTHL EQU   CVTS01+136                                               03530000
CVTSCAN  EQU   CVTS01+132                                               03531000
CVTRV144 EQU   CVTS01+130                                               03532000
CVTMAXMP EQU   CVTS01+128                                               03533000
CVTSTCK  EQU   CVTS01+124                                               03534000
CVTRV139 EQU   CVTS01+123                                               03535000
CVTDSSAC EQU   CVTS01+122                                               03536000
CVTRV513 EQU   CVTS01+121                                               03537000
CVTIOSPL EQU   CVTS01+120                                               03538000
CVTPTGT  EQU   CVTS01+116                                               03539000
CVTCSPIE EQU   CVTS01+112                                               03540000
CVTSMFEX EQU   CVTS01+108                                               03541000
CVTOLT0A EQU   CVTS01+104                                               03542000
CVTSRBRT EQU   CVTS01+100                                               03543000
CVTPUTL  EQU   CVTS01+96                                                03544000
CVTASCRL EQU   CVTS01+92                                                03545000
CVTASCRF EQU   CVTS01+88                                                03546000
CVTRV326 EQU   CVTS01+84                                                03547000
CVTRV325 EQU   CVTS01+80                                                03548000
CVTRV324 EQU   CVTS01+76                                                03549000
CVT0VL01 EQU   CVTS01+72                                                03550000
CVTSHRVM EQU   CVTS01+68                                                03551000
CVTRV332 EQU   CVTS01+64                                                03552000
CVTTAS   EQU   CVTS01+60                                                03553000
CVTRSCN  EQU   CVTS01+56                                                03554000
CVTTRAC2 EQU   CVTS01+54                                                03555000
CVTTRACE EQU   CVTS01+52                                                03556000
CVTAPG   EQU   CVTS01+51                                                03557000
CVTSDTRC EQU   CVTCTLFG                                                 03558000
CVTGTRCE EQU   CVTCTLFG                                                 03559000
CVTNOMP  EQU   CVTCTLFG                                                 03560000
CVTRSV79 EQU   CVTCTLFG                                                 03561000
CVTDSTAT EQU   CVTCTLFG                                                 03562000
CVTRSV78 EQU   CVTCTLFG                                                 03563000
CVTRV333 EQU   CVTCTLFG                                                 03564000
CVTRV323 EQU   CVTCTLFG                                                 03565000
CVTSPVLK EQU   CVTS01+49                                                03566000
CVTRSV77 EQU   CVTS01+48                                                03567000
CVTRV331 EQU   CVTS01+44                                                03568000
CVTRV330 EQU   CVTS01+40                                                03569000
CVTRV329 EQU   CVTS01+36                                                03570000
CVTRV328 EQU   CVTS01+32                                                03571000
CVTRV322 EQU   CVTS01+28                                                03572000
CVTSLID  EQU   CVTSLIDA+1                                               03573000
CVTSYLK  EQU   CVTSLIDA                                                 03574000
CVTRV321 EQU   CVTS01+20                                                03575000
CVTRV320 EQU   CVTS01+16                                                03576000
CVTLPDIR EQU   CVTLPDIA+1                                               03577000
CVTRSV69 EQU   CVTDIRST                                                 03578000
CVTRSV68 EQU   CVTDIRST                                                 03579000
CVTRSV67 EQU   CVTDIRST                                                 03580000
CVTRSV66 EQU   CVTDIRST                                                 03581000
CVTRSV65 EQU   CVTDIRST                                                 03582000
CVTRSV64 EQU   CVTDIRST                                                 03583000
CVTRSV63 EQU   CVTDIRST                                                 03584000
CVTDICOM EQU   CVTDIRST                                                 03585000
CVTPVTP  EQU   CVTS01+8                                                 03586000
CVTLPDSR EQU   CVTS01+4                                                 03587000
CVTGETL  EQU   CVTS01                                                   03588000
BPDCBID  EQU   ISTBPDTY+336                                             03589000
BPDENTRY EQU   ISTBPDTY+144                                             03590000
@NM00066 EQU   BPDTRACE+6                                               03591000
BPDAVNO  EQU   BPDTRACE+4                                               03592000
BPDMQUE  EQU   BPDTRACE+2                                               03593000
BPDMUSE  EQU   BPDTRACE                                                 03594000
BPDTRADR EQU   BPDPARM+4                                                03595000
BPDTRID  EQU   BPDPARM+3                                                03596000
@NM00065 EQU   BPDPARM+2                                                03597000
BPDTRLEN EQU   BPDPARM                                                  03598000
BPDREQMX EQU   BPDHDR+46                                                03599000
BPDREQCT EQU   BPDHDR+44                                                03600000
BPDRSV01 EQU   BPDFLAG                                                  03601000
BPDGTR   EQU   BPDFLAG                                                  03602000
BPDATCVT EQU   BPDHDR+36                                                03603000
BPDFBPE  EQU   BPDHDR+32                                                03604000
BPDSMPCB EQU   BPDHDR+28                                                03605000
BPDFEXT  EQU   BPDHDR+24                                                03606000
BPDADRS2 EQU   BPDHDR+20                                                03607000
BPDADRS1 EQU   BPDHDR+16                                                03608000
BPDCHPCB EQU   BPDHDR+8                                                 03609000
BPDCHBSZ EQU   BPDHDR+6                                                 03610000
BPDCHBNO EQU   BPDHDR+4                                                 03611000
BPDBPMAX EQU   BPDHDR+2                                                 03612000
BPDBPENT EQU   BPDHDR                                                   03613000
BPERSV03 EQU   ISTBPENT+12                                              03614000
BPEBPCB  EQU   ISTBPENT+8                                               03615000
BPEBFSIZ EQU   ISTBPENT+6                                               03616000
BPERSV02 EQU   BPEFLAGS+1                                               03617000
BPEUSRF  EQU   BPEFLAGS+1                                               03618000
BPERSV01 EQU   BPEFLAGS                                                 03619000
BPENWS   EQU   BPEFLAGS                                                 03620000
BPECBID  EQU   BPEFLAGS                                                 03621000
BPEAL48  EQU   BPEFLAGS                                                 03622000
BPENFCHP EQU   BPEFLAGS                                                 03623000
BPEFIXED EQU   BPEFLAGS                                                 03624000
BPEDISP  EQU   BPEFLAGS                                                 03625000
BPEFM    EQU   BPEFLAGS                                                 03626000
BPEPID   EQU   ISTBPENT                                                 03627000
WKECHNGP EQU   WKECHAIN+1                                               03628000
@NM00064 EQU   WKEFLAGS                                                 03629000
WKEGATE  EQU   WKEFLAGS                                                 03630000
@NM00063 EQU   ISTWKE                                                   03631000
BINUSE   EQU   ISTBIND+36                                               03632000
BINUSEL  EQU   ISTBIND+35                                               03633000
BINPRIM  EQU   ISTBIND+27                                               03634000
BINPRIML EQU   ISTBIND+26                                               03635000
BINRSV05 EQU   ISTBIND+25                                               03636000
BINLUTYP EQU   BINLUP                                                   03637000
BINRSV27 EQU   BINLUP                                                   03638000
BINRSV08 EQU   BINTSU+4                                                 03639000
BINPRUSE EQU   BINPRUSZ                                                 03640000
BINPRUSM EQU   BINPRUSZ                                                 03641000
BINSRUSE EQU   BINSRUSZ                                                 03642000
BINSRUSM EQU   BINSRUSZ                                                 03643000
BINRPACM EQU   BINRPACE                                                 03644000
BINRSV07 EQU   BINRPACE                                                 03645000
BINRSV06 EQU   BINTSU                                                   03646000
BINCONR  EQU   BINCMNP2                                                 03647000
BINRCHN  EQU   BINCMNP2                                                 03648000
BINMDIBK EQU   BINCMNP2                                                 03649000
BINBKFS  EQU   BINCMNP2                                                 03650000
BINRCVR  EQU   BINCMNP2                                                 03651000
BINFMTRM EQU   BINCMNP2                                                 03652000
BINRSV04 EQU   BINCMNP                                                  03653000
BINALT   EQU   BINCMNP                                                  03654000
BINBKTR  EQU   BINCMNP                                                  03655000
BINBRAK  EQU   BINCMNP                                                  03656000
BINFMHD  EQU   BINCMNP                                                  03657000
BINRSV03 EQU   BINCMNP                                                  03658000
BINSSEB  EQU   BINSECP                                                  03659000
BINSCMP  EQU   BINSECP                                                  03660000
BINRSV02 EQU   BINSECP                                                  03661000
BINSCHNR EQU   BINSECP                                                  03662000
BINSMCH  EQU   BINSECP                                                  03663000
BINSCHN  EQU   BINSECP                                                  03664000
BINPSEB  EQU   BINPRIP                                                  03665000
BINPCMP  EQU   BINPRIP                                                  03666000
BINRSV01 EQU   BINPRIP                                                  03667000
BINPCHNR EQU   BINPRIP                                                  03668000
BINPMCH  EQU   BINPRIP                                                  03669000
BINPCHN  EQU   BINPRIP                                                  03670000
BINFM    EQU   ISTBIND+1                                                03671000
BINTYPE  EQU   BINFMTY                                                  03672000
BINFMT   EQU   BINFMTY                                                  03673000
BFHDATA  EQU   ISTBFHDR+8                                               03674000
BFHUSED  EQU   ISTBFHDR+6                                               03675000
BFHSIZE  EQU   ISTBFHDR+4                                               03676000
BFHNXCHN EQU   ISTBFHDR                                                 03677000
LUNZC001 EQU   LUNZOS+8                                                 03678000
LUNLOCK  EQU   LUNZOS                                                   03679000
ZIBLNG1  EQU   ZIBFSM                                                   03680000
BTUTEXT  EQU   ISTBTU+20                                                03681000
BTUEXTR  EQU   ISTBTU+19                                                03682000
BTURSV02 EQU   BTUSYSTR                                                 03683000
BTUPHASE EQU   BTUSYSTR                                                 03684000
BTURSV01 EQU   BTUSYSTR                                                 03685000
BTUBDU   EQU   ISTBTU+14                                                03686000
BTUPAD   EQU   BTURH+3                                                  03687000
BTURH3   EQU   BTURH+2                                                  03688000
BTURH2   EQU   BTURH+1                                                  03689000
BTURH1   EQU   BTURH                                                    03690000
BTUDCF   EQU   BTUBTH+8                                                 03691000
BTUZRTSC EQU   BTURQFLG+1                                               03692000
BTUZRT0B EQU   BTURQFLG+1                                               03693000
BTUZRT0A EQU   BTURQFLG+1                                               03694000
BTUZRT09 EQU   BTURQFLG+1                                               03695000
BTUZRT08 EQU   BTURQFLG+1                                               03696000
BTUZRT07 EQU   BTURQFLG                                                 03697000
BTUZRT06 EQU   BTURQFLG                                                 03698000
BTUZRT05 EQU   BTURQFLG                                                 03699000
BTUZRT04 EQU   BTURQFLG                                                 03700000
BTUZRT03 EQU   BTURQFLG                                                 03701000
BTUZRT02 EQU   BTURQFLG                                                 03702000
BTUZRT01 EQU   BTURQFLG                                                 03703000
BTUZRT00 EQU   BTURQFLG                                                 03704000
BTUSORCE EQU   BTUBTH+4                                                 03705000
BTUDEST  EQU   BTUBTH+2                                                 03706000
BTUCDF   EQU   BTUFID+1                                                 03707000
BTUSCF   EQU   BTUFID+1                                                 03708000
BTUPRY   EQU   BTUFID+1                                                 03709000
BTUASFL  EQU   BTUFID                                                   03710000
BTUPSFL  EQU   BTUFID                                                   03711000
BTUMPF   EQU   BTUFID                                                   03712000
BTUFIDNO EQU   BTUFID                                                   03713000
LHVDATA  EQU   ISTLH+4                                                  03714000
LHFUNCT  EQU   ISTLH+3                                                  03715000
@NM00053 EQU   ISTLH+2                                                  03716000
LHLEN    EQU   ISTLH                                                    03717000
BDURSV04 EQU   BDUFLAGS                                                 03718000
BDURTOE  EQU   BDUFLAGS                                                 03719000
BDUSTPR  EQU   BDUFLAGS                                                 03720000
BDURSV03 EQU   BDUFLAGS                                                 03721000
BDUALT   EQU   BDUFUNC                                                  03722000
BDUNACK  EQU   BDUFUNC                                                  03723000
BDUACK   EQU   BDUFUNC                                                  03724000
BDUTRPM  EQU   BDUFUNC                                                  03725000
BDUFBMI  EQU   BDUFUNC                                                  03726000
BDULDGPH EQU   BDUFUNC                                                  03727000
BDUHEADP EQU   BDUFUNC                                                  03728000
BDUSOH   EQU   BDUCHECK                                                 03729000
BDURSV01 EQU   BDUMODIF                                                 03730000
BDUMOD0  EQU   BDUMOD1                                                  03731000
BDUCOMND EQU   ISTBDU                                                   03732000
PIUNIR   EQU   ISTPIU+10                                                03733000
TH2SNF   EQU   ISTTH2+4                                                 03734000
TH2OAF   EQU   ISTTH2+3                                                 03735000
TH2DAF   EQU   ISTTH2+2                                                 03736000
TH2CDF   EQU   TH2FLAG1+1                                               03737000
TH2SEF   EQU   TH2FLAG1+1                                               03738000
TH2PYF   EQU   TH2FLAG1+1                                               03739000
TH2AFI   EQU   TH2FLAG1                                                 03740000
TH2PSI   EQU   TH2FLAG1                                                 03741000
TH2CMPLI EQU   TH2MPF                                                   03742000
TH2RHI   EQU   TH2MPF                                                   03743000
TH2FID   EQU   TH2FLAG1                                                 03744000
THDCF    EQU   ISTTH+8                                                  03745000
THSNF    EQU   ISTTH+6                                                  03746000
THOAF    EQU   ISTTH+4                                                  03747000
THDAF    EQU   ISTTH+2                                                  03748000
THCDF    EQU   THFLGB                                                   03749000
THSEF    EQU   THFLGB                                                   03750000
THPYF    EQU   THFLGB                                                   03751000
THAFI    EQU   THFLGA                                                   03752000
THPSI    EQU   THFLGA                                                   03753000
THCMPLI  EQU   THMPF                                                    03754000
THRHI    EQU   THMPF                                                    03755000
THFID    EQU   THFLAG1                                                  03756000
NIRRU    EQU   ISTNIR+3                                                 03757000
NIRRH    EQU   ISTNIR                                                   03758000
NCBRSV01 EQU   ISTNCB+46                                                03759000
NCBSWDAF EQU   ISTNCB+44                                                03760000
NCBDEVCH EQU   ISTNCB+36                                                03761000
NCBFMCBP EQU   ISTNCB+32                                                03762000
NCBLTRC  EQU   ISTNCB+30                                                03763000
NCBRVPT1 EQU   ISTNCB+28                                                03764000
NCBNMLLN EQU   NCBFLAGS+3                                               03765000
@NM00052 EQU   NCBFLAG1                                                 03766000
NCBFORCE EQU   NCBFLAG1                                                 03767000
NCBTTF   EQU   NCBFLAG1                                                 03768000
NCBRSYNC EQU   NCBFLAG1                                                 03769000
NCBRSTRT EQU   NCBFLAG1                                                 03770000
NCBCONF  EQU   NCBFLAG1                                                 03771000
NCBSNAI  EQU   NCBFLAG1                                                 03772000
NCBFLTIO EQU   NCBFTRIO                                                 03773000
NCBCSTAT EQU   NCBFLAGS                                                 03774000
NCBNCSL  EQU   ISTNCB+22                                                03775000
NCBNCBA  EQU   ISTNCB+20                                                03776000
NCBFMCBA EQU   ISTNCB+16                                                03777000
NCBNSNA  EQU   ISTNCB+12                                                03778000
NCBTSKID EQU   ISTNCB+8                                                 03779000
NCBRDTE  EQU   ISTNCB+4                                                 03780000
NCBLNGTH EQU   ISTNCB+1                                                 03781000
NCBTYPE  EQU   ISTNCB                                                   03782000
FSBRSV01 EQU   FSBFSB+30                                                03783000
FSBTHCNT EQU   FSBFSB+28                                                03784000
FSBRLRSV EQU   FSBRLSTS                                                 03785000
FSBCFTX  EQU   FSBRLSTS                                                 03786000
FSBICNCB EQU   FSBMSGID                                                 03787000
FSBSSOC  EQU   FSBSS2                                                   03788000
FSBSSCC  EQU   FSBSS2                                                   03789000
FSBSSDC  EQU   FSBSS2                                                   03790000
FSBSSEC  EQU   FSBSS2                                                   03791000
FSBSSIR  EQU   FSBSS2                                                   03792000
FSBSSCR  EQU   FSBSS2                                                   03793000
@NM00050 EQU   FSBSS2                                                   03794000
@NM00049 EQU   FSBSS1                                                   03795000
FSBSSDE  EQU   FSBSS1                                                   03796000
FSBSSUS  EQU   FSBSS1                                                   03797000
@NM00048 EQU   FSBSS1                                                   03798000
FSBSOHI  EQU   FSBERC                                                   03799000
FSBLGI   EQU   FSBERC                                                   03800000
FSBLMRI  EQU   FSBFBMI                                                  03801000
FSBETI   EQU   FSBERC                                                   03802000
FSBEMI   EQU   FSBERC                                                   03803000
FSBEBI   EQU   FSBERC                                                   03804000
FSBECI   EQU   FSBERC                                                   03805000
FSBELI   EQU   FSBERC                                                   03806000
FSBXLCI  EQU   FSBXCODE                                                 03807000
FSBXFINS EQU   FSBXCODE                                                 03808000
FSBXNORM EQU   FSBXFSTS                                                 03809000
FSBSCODE EQU   FSBSYSRS                                                 03810000
FSBSPHSE EQU   FSBSYSRS                                                 03811000
FSBSERR  EQU   FSBSYSRS                                                 03812000
FSBCMD   EQU   FSBSEQ                                                   03813000
FSBDTRCE EQU   FSBFLAGS                                                 03814000
FSBASBTU EQU   FSBFLAGS                                                 03815000
FSBINPET EQU   FSBFLAGS                                                 03816000
FSBNONCB EQU   FSBFLAGS                                                 03817000
FSBLBIND EQU   FSBFLAGS                                                 03818000
FSBFFIND EQU   FSBFLAGS                                                 03819000
FSBACIND EQU   FSBFLAGS                                                 03820000
FSBRFIND EQU   FSBFLAGS                                                 03821000
FSBGATE  EQU   FSBFSBA                                                  03822000
FSBLATOP EQU   FSBSFLGS                                                 03823000
FSBRSV02 EQU   FSBSFLGS                                                 03824000
FSBPGBUF EQU   FSBSFLGS                                                 03825000
FSBMNSDA EQU   FSBMNRCD                                                 03826000
FSBMNOA  EQU   FSBMNRCD                                                 03827000
FSBMNDIF EQU   FSBMNRCD                                                 03828000
FSBMNEOP EQU   FSBMNRCD                                                 03829000
FSBMNDNU EQU   FSBMNRCD                                                 03830000
FSBMNATN EQU   FSBMNRCD                                                 03831000
FSBMNRVI EQU   FSBMNRCD                                                 03832000
FSBMNELI EQU   FSBMNRCD                                                 03833000
FSBLNGTH EQU   FSBFSB+1                                                 03834000
FDBDATCT EQU   ISTFDB+8                                                 03835000
FDBDATAA EQU   ISTFDB+4                                                 03836000
FDBFDBA  EQU   ISTFDB                                                   03837000
NSRUNA6  EQU   NSRUNA5                                                  03838000
RUBDATA  EQU   ISTRUB                                                   03839000
ZPSZDFQR EQU   ISTZPSVT+80                                              03840000
ZPSZDFPR EQU   ISTZPSVT+76                                              03841000
ZPSZDFXR EQU   ISTZPSVT+72                                              03842000
ZPSZWRD5 EQU   ISTZPSVT+68                                              03843000
ZPSZWRD4 EQU   ISTZPSVT+64                                              03844000
ZPSZDFMB EQU   ISTZPSVT+60                                              03845000
ZPSZDFMF EQU   ISTZPSVT+56                                              03846000
ZPSZDFNB EQU   ISTZPSVT+52                                              03847000
@NM00041 EQU   ISTZPSVT+48                                              03848000
ZPSZDFF0 EQU   ISTZPSVT+44                                              03849000
ZPSZTRTT EQU   ISTZPSVT+40                                              03850000
ZPSZBFOB EQU   ISTZPSVT+36                                              03851000
ZPSZBFMB EQU   ISTZPSVT+32                                              03852000
ZPSZBFZ0 EQU   ISTZPSVT+28                                              03853000
ZPSZBFY0 EQU   ISTZPSVT+24                                              03854000
ZPSZDFI0 EQU   ISTZPSVT+20                                              03855000
ZPSZDFH0 EQU   ISTZPSVT+12                                              03856000
ZPSZDFD0 EQU   ISTZPSVT+8                                               03857000
ZPSZDFC0 EQU   ISTZPSVT+4                                               03858000
CRACHAIN EQU   ISTCRA+928                                               03859000
CRARSV02 EQU   ISTCRA+924                                               03860000
CRARSV01 EQU   ISTCRA+920                                               03861000
CRABFTBA EQU   CRABUFA                                                  03862000
CRAMASK  EQU   CRASVC+64                                                03863000
CRAHSIZ  EQU   CRASVC+60                                                03864000
CRAASCRR EQU   CRASVC                                                   03865000
CRAPROCR EQU   ISTCRA+312                                               03866000
CRAPSS   EQU   ISTCRA+160                                               03867000
CRARPH   EQU   ISTCRA+52                                                03868000
CRALAPTR EQU   CRABASIC+48                                              03869000
CRAL9PTR EQU   CRABASIC+44                                              03870000
CRAL8PTR EQU   CRABASIC+40                                              03871000
CRAL7PTR EQU   CRABASIC+36                                              03872000
CRAL6PTR EQU   CRABASIC+32                                              03873000
CRAL5PTR EQU   CRABASIC+28                                              03874000
CRAL4PTR EQU   CRABASIC+24                                              03875000
CRAL3PTR EQU   CRABASIC+20                                              03876000
CRAL2PTR EQU   CRABASIC+16                                              03877000
CRAL1PTR EQU   CRABASIC+12                                              03878000
CRALEV01 EQU   CRALKACT+3                                               03879000
CRALEV02 EQU   CRALKACT+3                                               03880000
CRALEV03 EQU   CRALKACT+3                                               03881000
CRALEV04 EQU   CRALKACT+3                                               03882000
CRALEV05 EQU   CRALKACT+3                                               03883000
CRALEV06 EQU   CRALKACT+3                                               03884000
CRALEV07 EQU   CRALKACT+3                                               03885000
CRALEV08 EQU   CRALKACT+3                                               03886000
CRALEV09 EQU   CRALKACT+2                                               03887000
CRALEV10 EQU   CRALKACT+2                                               03888000
CRALEV11 EQU   CRALKACT+2                                               03889000
CRALEV12 EQU   CRALKACT+2                                               03890000
CRALEV13 EQU   CRALKACT+2                                               03891000
CRALEV14 EQU   CRALKACT+2                                               03892000
CRALEV15 EQU   CRALKACT+2                                               03893000
CRALEV16 EQU   CRALKACT+2                                               03894000
CRALEV17 EQU   CRALKACT+1                                               03895000
CRALEV18 EQU   CRALKACT+1                                               03896000
CRALEV19 EQU   CRALKACT+1                                               03897000
CRALEV20 EQU   CRALKACT+1                                               03898000
CRALEV21 EQU   CRALKACT+1                                               03899000
CRALEV22 EQU   CRALKACT+1                                               03900000
CRALEV23 EQU   CRALKACT+1                                               03901000
CRALEV24 EQU   CRALKACT+1                                               03902000
CRALEV25 EQU   CRALKACT                                                 03903000
CRALEV26 EQU   CRALKACT                                                 03904000
CRALEV27 EQU   CRALKACT                                                 03905000
CRALEV28 EQU   CRALKACT                                                 03906000
CRALEV29 EQU   CRALKACT                                                 03907000
CRALEV30 EQU   CRALKACT                                                 03908000
CRALEV31 EQU   CRALKACT                                                 03909000
CRALEV32 EQU   CRALKACT                                                 03910000
CRAFRR   EQU   CRAHDR+4                                                 03911000
@NM00040 EQU   ISTAPCRR+137                                             03912000
@NM00039 EQU   APC57FLG                                                 03913000
APCNREL  EQU   APC57FLG                                                 03914000
APCRECRA EQU   APC57FLG                                                 03915000
@NM00038 EQU   APC54FLG                                                 03916000
APCRLST  EQU   APC54FLG                                                 03917000
APCPR153 EQU   APC53FLG                                                 03918000
@NM00037 EQU   APC52FLG                                                 03919000
APCWKF   EQU   APC52FLG                                                 03920000
APCNWF   EQU   APC52FLG                                                 03921000
APCRDQ   EQU   APC52FLG                                                 03922000
APCQENQ  EQU   APC52FLG                                                 03923000
APCSMSR  EQU   APC52FLG                                                 03924000
APCCKRQ  EQU   APC52FLG                                                 03925000
@NM00036 EQU   APC31FLG                                                 03926000
APCSORT  EQU   APC31FLG                                                 03927000
APCRESCH EQU   APC31FLG                                                 03928000
APCTPXIT EQU   APC31FLG                                                 03929000
APCSWTWD EQU   ISTAPCRR+128                                             03930000
APCSAV2  EQU   ISTAPCRR+124                                             03931000
APCSAV1  EQU   ISTAPCRR+120                                             03932000
APCRETCD EQU   APCCOMF+2                                                03933000
@NM00035 EQU   APCCOMF1+1                                               03934000
APCZLBER EQU   APCCOMF1                                                 03935000
APCEXIT  EQU   APCCOMF1                                                 03936000
APCRELR  EQU   APCCOMF1                                                 03937000
APCIRB2  EQU   APCCOMF1                                                 03938000
APCIRB1  EQU   APCCOMF1                                                 03939000
APCSMCR  EQU   APCCOMF1                                                 03940000
APCUETSK EQU   APCCOMF1                                                 03941000
APCSSTSK EQU   APCCOMF1                                                 03942000
APCESTAL EQU   APCSAVE                                                  03943000
APCFRRPM EQU   ISTAPCRR+40                                              03944000
APCQWFO  EQU   ISTAPCRR+36                                              03945000
APCPABSV EQU   ISTAPCRR+32                                              03946000
APCRTRN  EQU   ISTAPCRR+28                                              03947000
APCTCBA  EQU   ISTAPCRR+24                                              03948000
APCPSTA  EQU   ISTAPCRR+20                                              03949000
@NM00034 EQU   APCRFLG+1                                                03950000
APC31R   EQU   APCRFLG                                                  03951000
APC58R   EQU   APCRFLG                                                  03952000
APC57R   EQU   APCRFLG                                                  03953000
APC56R   EQU   APCRFLG                                                  03954000
APC54R   EQU   APCRFLG                                                  03955000
APC53R   EQU   APCRFLG                                                  03956000
APC52R   EQU   APCRFLG                                                  03957000
APC51R   EQU   APCRFLG                                                  03958000
@NM00033 EQU   APCATFLG+1                                               03959000
APC31E   EQU   APCATFLG                                                 03960000
APC58E   EQU   APCATFLG                                                 03961000
APC57E   EQU   APCATFLG                                                 03962000
APC56E   EQU   APCATFLG                                                 03963000
APC54E   EQU   APCATFLG                                                 03964000
APC53E   EQU   APCATFLG                                                 03965000
APC52E   EQU   APCATFLG                                                 03966000
APC51E   EQU   APCATFLG                                                 03967000
APCHDRSV EQU   ISTAPCRR                                                 03968000
ASCPSREG EQU   ISTASCRR+44                                              03969000
ASCUSR01 EQU   ASCUSRGS+12                                              03970000
ASCUSR00 EQU   ASCUSRGS+8                                               03971000
ASCUSR15 EQU   ASCUSRGS+4                                               03972000
ASCUSR14 EQU   ASCUSRGS                                                 03973000
ASCETRYA EQU   ISTASCRR+24                                              03974000
ASCKEY   EQU   ISTASCRR+23                                              03975000
ASCAUDIT EQU   ASCFLG3                                                  03976000
ASCFBDUD EQU   ASCFLG3                                                  03977000
ASCLLKF  EQU   ASCFLG3                                                  03978000
ASCKEYF  EQU   ASCFLG3                                                  03979000
ASCFBDAL EQU   ASCFLG3                                                  03980000
ASCFSRGT EQU   ASCFLG3                                                  03981000
ASCICR   EQU   ASCFLG2                                                  03982000
ASCFSRIC EQU   ASCFLG2                                                  03983000
ASCFBDIC EQU   ASCFLG2                                                  03984000
ASCFBAIC EQU   ASCFLG2                                                  03985000
ASCPASTR EQU   ASCFLG1                                                  03986000
ASCFSR   EQU   ASCFLG1                                                  03987000
ASCFBD   EQU   ASCFLG1                                                  03988000
ASCFBA   EQU   ASCFLG1                                                  03989000
ASCPFCRR EQU   ISTASCRR                                                 03990000
CCFRSVD1 EQU   CFCCRT                                                   03991000
CCFCR2   EQU   CFCCRT                                                   03992000
CCFCRP   EQU   CFCCRT                                                   03993000
CCFCR1   EQU   CFCCRT                                                   03994000
CCFCS2   EQU   CFCCRT                                                   03995000
CCFCS1   EQU   CFCCRT                                                   03996000
NCFRSVD  EQU   CFCNTRD                                                  03997000
NCFCR2   EQU   CFCNTRD                                                  03998000
NCFCRP   EQU   CFCNTRD                                                  03999000
NCFCR1   EQU   CFCNTRD                                                  04000000
NCFCS2   EQU   CFCNTRD                                                  04001000
NCFCS1   EQU   CFCNTRD                                                  04002000
PFCRSV01 EQU   ISTPFCRR+13                                              04003000
PFCFTA   EQU   ISTPFCRR+12                                              04004000
CRRFRR   EQU   PFCFRRO                                                  04005000
CRRCHAIN EQU   PFCCRRO                                                  04006000
CRRLEN   EQU   PFCCRRLN                                                 04007000
PFCRSV10 EQU   PFCCRR+1                                                 04008000
CRRID    EQU   PFCCRRID                                                 04009000
ZCRRH    EQU   ZCRRHRU                                                  04010000
ZCRWORDA EQU   ISTZCRR+477                                              04011000
ZCRCMNRC EQU   ISTZCRR+476                                              04012000
ZCRRSV97 EQU   ZCRENTER+18                                              04013000
ZCREIC2B EQU   ZCRENTER+18                                              04014000
ZCREAC2B EQU   ZCRENTER+18                                              04015000
ZCRELCAB EQU   ZCRENTER+18                                              04016000
ZCREDCMF EQU   ZCRENTER+18                                              04017000
ZCREBCIF EQU   ZCRENTER+18                                              04018000
ZCREICSG EQU   ZCRENTER+18                                              04019000
ZCREDCK0 EQU   ZCRENTER+18                                              04020000
ZCRECFY0 EQU   ZCRENTER+17                                              04021000
ZCREKCCB EQU   ZCRENTER+17                                              04022000
ZCREDCNB EQU   ZCRENTER+17                                              04023000
ZCREICOE EQU   ZCRENTER+17                                              04024000
ZCREBCNB EQU   ZCRENTER+17                                              04025000
ZCREBC0L EQU   ZCRENTER+17                                              04026000
ZCREBCAL EQU   ZCRENTER+17                                              04027000
ZCREDCQR EQU   ZCRENTER+17                                              04028000
ZCREDCPR EQU   ZCRENTER+16                                              04029000
ZCREBCSB EQU   ZCRENTER+16                                              04030000
ZCREAC1R EQU   ZCRENTER+16                                              04031000
ZCRECCCI EQU   ZCRENTER+16                                              04032000
ZCRECCAI EQU   ZCRENTER+16                                              04033000
ZCRECCBI EQU   ZCRENTER+16                                              04034000
ZCREBCAR EQU   ZCRENTER+16                                              04035000
ZCREBCDR EQU   ZCRENTER+16                                              04036000
ZCREBCBR EQU   ZCRENTER+15                                              04037000
ZCREDCXR EQU   ZCRENTER+15                                              04038000
ZCREDCWB EQU   ZCRENTER+15                                              04039000
ZCREDCWR EQU   ZCRENTER+15                                              04040000
ZCREKCCN EQU   ZCRENTER+15                                              04041000
ZCREKCBN EQU   ZCRENTER+15                                              04042000
ZCREKCBB EQU   ZCRENTER+15                                              04043000
ZCREJC0B EQU   ZCRENTER+15                                              04044000
ZCREJCDB EQU   ZCRENTER+14                                              04045000
ZCREJCCB EQU   ZCRENTER+14                                              04046000
ZCREJCBB EQU   ZCRENTER+14                                              04047000
ZCREJCAB EQU   ZCRENTER+14                                              04048000
ZCREIC1B EQU   ZCRENTER+14                                              04049000
ZCREIC0B EQU   ZCRENTER+14                                              04050000
ZCREICX0 EQU   ZCRENTER+14                                              04051000
ZCREICWB EQU   ZCRENTER+14                                              04052000
ZCREICVB EQU   ZCRENTER+13                                              04053000
ZCREICUB EQU   ZCRENTER+13                                              04054000
ZCREICTB EQU   ZCRENTER+13                                              04055000
ZCREICSC EQU   ZCRENTER+13                                              04056000
ZCREICSB EQU   ZCRENTER+13                                              04057000
ZCREICRB EQU   ZCRENTER+13                                              04058000
ZCREICQB EQU   ZCRENTER+13                                              04059000
ZCREICQA EQU   ZCRENTER+13                                              04060000
ZCREICOB EQU   ZCRENTER+12                                              04061000
ZCREICOA EQU   ZCRENTER+12                                              04062000
ZCREICNB EQU   ZCRENTER+12                                              04063000
ZCREICNA EQU   ZCRENTER+12                                              04064000
ZCREICMB EQU   ZCRENTER+12                                              04065000
ZCREICLB EQU   ZCRENTER+12                                              04066000
ZCREICKG EQU   ZCRENTER+12                                              04067000
ZCREICKE EQU   ZCRENTER+12                                              04068000
ZCREICKB EQU   ZCRENTER+11                                              04069000
ZCREICJB EQU   ZCRENTER+11                                              04070000
ZCREICID EQU   ZCRENTER+11                                              04071000
ZCREICIB EQU   ZCRENTER+11                                              04072000
ZCREICHB EQU   ZCRENTER+11                                              04073000
ZCREICGB EQU   ZCRENTER+11                                              04074000
ZCREICEB EQU   ZCRENTER+11                                              04075000
ZCREICDB EQU   ZCRENTER+11                                              04076000
ZCREICCI EQU   ZCRENTER+10                                              04077000
ZCREICCB EQU   ZCRENTER+10                                              04078000
ZCREICBI EQU   ZCRENTER+10                                              04079000
ZCREICBB EQU   ZCRENTER+10                                              04080000
ZCREICAB EQU   ZCRENTER+10                                              04081000
ZCREICAA EQU   ZCRENTER+10                                              04082000
ZCREHCAN EQU   ZCRENTER+10                                              04083000
ZCREGC0B EQU   ZCRENTER+10                                              04084000
ZCREGC0A EQU   ZCRENTER+9                                               04085000
ZCREGCLA EQU   ZCRENTER+9                                               04086000
ZCREGCEB EQU   ZCRENTER+9                                               04087000
ZCREGCDB EQU   ZCRENTER+9                                               04088000
@NM00032 EQU   ZCRENTER+9                                               04089000
ZCREGCBB EQU   ZCRENTER+9                                               04090000
ZCREGCAB EQU   ZCRENTER+9                                               04091000
ZCREFCEB EQU   ZCRENTER+9                                               04092000
ZCREFCEA EQU   ZCRENTER+8                                               04093000
ZCREECTA EQU   ZCRENTER+8                                               04094000
ZCREECEA EQU   ZCRENTER+8                                               04095000
ZCREECDA EQU   ZCRENTER+8                                               04096000
ZCREECCB EQU   ZCRENTER+8                                               04097000
ZCREECCA EQU   ZCRENTER+8                                               04098000
ZCREECBB EQU   ZCRENTER+8                                               04099000
ZCREECBA EQU   ZCRENTER+8                                               04100000
ZCREDCMB EQU   ZCRENTER+7                                               04101000
ZCREDCL0 EQU   ZCRENTER+7                                               04102000
ZCREDCKB EQU   ZCRENTER+7                                               04103000
ZCREDCKA EQU   ZCRENTER+7                                               04104000
ZCREDCJ0 EQU   ZCRENTER+7                                               04105000
ZCREDCI0 EQU   ZCRENTER+7                                               04106000
ZCREDCH0 EQU   ZCRENTER+7                                               04107000
ZCREDCF0 EQU   ZCRENTER+7                                               04108000
ZCREDCE0 EQU   ZCRENTER+6                                               04109000
ZCREDCD0 EQU   ZCRENTER+6                                               04110000
ZCREDCC0 EQU   ZCRENTER+6                                               04111000
ZCREDCB0 EQU   ZCRENTER+6                                               04112000
ZCREDCA0 EQU   ZCRENTER+6                                               04113000
ZCRECC2B EQU   ZCRENTER+6                                               04114000
ZCRECC1B EQU   ZCRENTER+6                                               04115000
ZCRECC1A EQU   ZCRENTER+6                                               04116000
ZCRECC0B EQU   ZCRENTER+5                                               04117000
ZCRECC0A EQU   ZCRENTER+5                                               04118000
ZCREBC0B EQU   ZCRENTER+5                                               04119000
ZCREBC0A EQU   ZCRENTER+5                                               04120000
ZCREBCZ0 EQU   ZCRENTER+5                                               04121000
ZCREBCY0 EQU   ZCRENTER+5                                               04122000
ZCREBCX0 EQU   ZCRENTER+5                                               04123000
ZCREBCXA EQU   ZCRENTER+5                                               04124000
ZCREBCRB EQU   ZCRENTER+4                                               04125000
ZCREBCRA EQU   ZCRENTER+4                                               04126000
ZCREBCQB EQU   ZCRENTER+4                                               04127000
ZCREBCPB EQU   ZCRENTER+4                                               04128000
ZCREBCOB EQU   ZCRENTER+4                                               04129000
ZCREBCNE EQU   ZCRENTER+4                                               04130000
ZCREBCND EQU   ZCRENTER+4                                               04131000
ZCREBCMB EQU   ZCRENTER+3                                               04132000
ZCREBCLB EQU   ZCRENTER+3                                               04133000
ZCREBCLA EQU   ZCRENTER+3                                               04134000
ZCREBCKB EQU   ZCRENTER+3                                               04135000
ZCREBCKA EQU   ZCRENTER+3                                               04136000
ZCREBCJB EQU   ZCRENTER+3                                               04137000
ZCREBCJA EQU   ZCRENTER+3                                               04138000
ZCREBCID EQU   ZCRENTER+3                                               04139000
ZCREBCIB EQU   ZCRENTER+2                                               04140000
ZCREBCIA EQU   ZCRENTER+2                                               04141000
ZCREBCHB EQU   ZCRENTER+2                                               04142000
ZCREBCHA EQU   ZCRENTER+2                                               04143000
ZCREBCGB EQU   ZCRENTER+2                                               04144000
ZCREBCGA EQU   ZCRENTER+2                                               04145000
ZCREBCFB EQU   ZCRENTER+2                                               04146000
ZCREBCFA EQU   ZCRENTER+2                                               04147000
ZCREBCEB EQU   ZCRENTER+1                                               04148000
ZCREBCDI EQU   ZCRENTER+1                                               04149000
ZCREBCCB EQU   ZCRENTER+1                                               04150000
ZCREBCBI EQU   ZCRENTER+1                                               04151000
ZCREBCBB EQU   ZCRENTER+1                                               04152000
ZCREBCBA EQU   ZCRENTER+1                                               04153000
ZCREBCAM EQU   ZCRENTER+1                                               04154000
ZCREBCAI EQU   ZCRENTER+1                                               04155000
ZCREBCAG EQU   ZCRENTER                                                 04156000
ZCREBCAE EQU   ZCRENTER                                                 04157000
ZCREBCAB EQU   ZCRENTER                                                 04158000
ZCREBCAA EQU   ZCRENTER                                                 04159000
ZCREAC1B EQU   ZCRENTER                                                 04160000
ZCREAC0B EQU   ZCRENTER                                                 04161000
ZCREAC0A EQU   ZCRENTER                                                 04162000
ZCREAC1A EQU   ZCRENTER                                                 04163000
ZCRTNAME EQU   ZCRAUDIT+1                                               04164000
ZCRTID   EQU   ZCRAUDIT                                                 04165000
ZCRREMIC EQU   ISTZCRR+436                                              04166000
ZCRSAVEZ EQU   ISTZCRR+196                                              04167000
ZCRDAFSV EQU   ZCRCIDSV+2                                               04168000
ZCRSAFSV EQU   ZCRCIDSV                                                 04169000
ZCRR13SV EQU   ISTZCRR+188                                              04170000
ZCRR2SV  EQU   ISTZCRR+184                                              04171000
ZCROPCDE EQU   ISTZCRR+183                                              04172000
ZCRPRMTC EQU   ISTZCRR+182                                              04173000
ZCRRCDSV EQU   ISTZCRR+181                                              04174000
ZCRAWQSW EQU   ISTZCRR+180                                              04175000
ZCRTOPQ  EQU   ISTZCRR+180                                              04176000
ZCRLSTFB EQU   ISTZCRR+180                                              04177000
ZCRXSCHD EQU   ISTZCRR+180                                              04178000
ZCRNXTEL EQU   ISTZCRR+180                                              04179000
ZCRSCANQ EQU   ISTZCRR+180                                              04180000
ZCRMOREL EQU   ISTZCRR+180                                              04181000
ZCRFBPRC EQU   ISTZCRR+180                                              04182000
ZCRFSBSV EQU   ISTZCRR+176                                              04183000
ZCRSVWK5 EQU   ZCRWKARA+16                                              04184000
ZCRSVWK4 EQU   ZCRWKARA+12                                              04185000
ZCRSVWK3 EQU   ZCRWKARA+8                                               04186000
ZCRSVWK2 EQU   ZCRWKARA+4                                               04187000
ZCRSVWK1 EQU   ZCRWKARA                                                 04188000
ZCRSVF20 EQU   ZCRSVRTN+76                                              04189000
ZCRSVF18 EQU   ZCRSVRTN+68                                              04190000
ZCRSVF17 EQU   ZCRSVRTN+64                                              04191000
ZCRSVF16 EQU   ZCRSVRTN+60                                              04192000
ZCRSVF15 EQU   ZCRSVRTN+56                                              04193000
ZCRSVF14 EQU   ZCRSVRTN+52                                              04194000
ZCRSVF13 EQU   ZCRSVRTN+48                                              04195000
ZCRSVF12 EQU   ZCRSVRTN+44                                              04196000
ZCRSVF8  EQU   ZCRSVRTN+28                                              04197000
ZCRSVF7  EQU   ZCRSVRTN+24                                              04198000
ZCRSVF6  EQU   ZCRSVRTN+20                                              04199000
ZCRSVF4  EQU   ZCRSVRTN+12                                              04200000
ZCRSVF3  EQU   ZCRSVRTN+8                                               04201000
ZCRSVF2  EQU   ZCRSVRTN+4                                               04202000
ZCRSVF1  EQU   ZCRSVRTN                                                 04203000
ZCRPVZB  EQU   ISTZCRR+52                                               04204000
ZCRZLB   EQU   ISTZCRR+48                                               04205000
ZCRBFPTR EQU   ISTZCRR+44                                               04206000
ZCRCCWA  EQU   ISTZCRR+40                                               04207000
ZCRPSW   EQU   ZCRPARMS+15                                              04208000
ZCRPCHAR EQU   ZCRPARMS+14                                              04209000
ZCRPRES2 EQU   ZCRPCOD2                                                 04210000
ZCRPMFGF EQU   ZCRPCOD2                                                 04211000
ZCRPFHDR EQU   ZCRPCOD2                                                 04212000
ZCRPPG2  EQU   ZCRPCOD2                                                 04213000
ZCRPRES  EQU   ZCRPCOD1                                                 04214000
ZCRPCFTX EQU   ZCRPCOD1                                                 04215000
ZCRPLSCB EQU   ZCRPCOD1                                                 04216000
ZCRPLSBQ EQU   ZCRPLSBF                                                 04217000
ZCRPLNG  EQU   ZCRPCOD1                                                 04218000
ZCRPPG   EQU   ZCRPCOD1                                                 04219000
ZCRDTODA EQU   ZCRDFRDA                                                 04220000
ZCRMLNG  EQU   ZCRPARMS+8                                               04221000
ZCRTBPTR EQU   ZCRPARMS+4                                               04222000
ZCRCBPTR EQU   ZCRFBPTR                                                 04223000
ZCRCRLCP EQU   ISTZCRR+20                                               04224000
@NM00031 EQU   ZCRSCPSW                                                 04225000
ZCRSKIPT EQU   ZCRSCPSW                                                 04226000
ZCRPRCMP EQU   ZCRSCPSW                                                 04227000
@NM00030 EQU   ZCRIBPR                                                  04228000
ZCR3270R EQU   ZCRIBPR                                                  04229000
ZCR3270  EQU   ZCRIBPR                                                  04230000
ZCRLCPFD EQU   ZCRIBPR                                                  04231000
ZCRLCPFR EQU   ZCRIBPR                                                  04232000
ZCRRELK  EQU   ZCRIBPR                                                  04233000
ZCRERR   EQU   ZCRIBPR                                                  04234000
ZCRNOBUF EQU   ZCRIBPR                                                  04235000
@NM00029 EQU   ZCRPFLGS                                                 04236000
ZCRQAHED EQU   ZCRPFLGS                                                 04237000
ZCRF1RES EQU   ZCRGENSW                                                 04238000
ZCRBRIS  EQU   ZCRGENSW                                                 04239000
ZCRCLRBD EQU   ZCRGENSW                                                 04240000
ZCREXRES EQU   ZCRGENSW                                                 04241000
ZCRLCSYN EQU   ZCRGENSW                                                 04242000
ZCRRT06  EQU   ZCRGENSW                                                 04243000
ZCRTSW2  EQU   ZCRGENSW                                                 04244000
ZCRTSW1  EQU   ZCRGENSW                                                 04245000
ZCRINLCP EQU   ZCRFLGS3                                                 04246000
ZCRWRPTR EQU   ZCRFLGS3                                                 04247000
ZCRNOFRE EQU   ZCRFLGS3                                                 04248000
ZCREDRIV EQU   ZCRFLGS3                                                 04249000
ZCRDISC  EQU   ZCRFLGS3                                                 04250000
ZCRTPDIS EQU   ZCRFLGS3                                                 04251000
ZCRTPCON EQU   ZCRFLGS3                                                 04252000
ZCRTIC   EQU   ZCRFLGS3                                                 04253000
ZCRCNLXL EQU   ZCRRESET                                                 04254000
ZCRENDAN EQU   ZCRSWFLD                                                 04255000
ZCRENDXL EQU   ZCRSWFLD                                                 04256000
ZCRENDX  EQU   ZCRSWFLD                                                 04257000
ZCROB1   EQU   ZCRNDLCP                                                 04258000
ZCRENDPR EQU   ZCRSWFLD                                                 04259000
ZCREXTYP EQU   ZCRSWFLD                                                 04260000
ZCRSLCP  EQU   ZCRENDSH                                                 04261000
ZCRIF0E3 EQU   ZCRFLGS2                                                 04262000
ZCRIF0E2 EQU   ZCRFLGS2                                                 04263000
ZCRIF0E1 EQU   ZCRFLGS2                                                 04264000
ZCROB    EQU   ZCRFLGS2                                                 04265000
ZCRFMSED EQU   ZCRFLGS2                                                 04266000
ZCRSHEDI EQU   ZCRFLGS2                                                 04267000
ZCRLOCAL EQU   ZCRFLGS2                                                 04268000
ZCRFEXIT EQU   ZCRFLGS1                                                 04269000
ZCRUNSOL EQU   ZCRFLGS1                                                 04270000
ZCRENDLP EQU   ZCRFLGS1                                                 04271000
ZCRNRMEX EQU   ZCRFLGS1                                                 04272000
ZCRWAIT  EQU   ZCRFLGS1                                                 04273000
ZCRDEQSW EQU   ZCRFLGS1                                                 04274000
ZCRQUESW EQU   ZCRFLGS1                                                 04275000
ZCREXSW  EQU   ZCRFLGS1                                                 04276000
ZCRFRRA  EQU   ISTZCRR+8                                                04277000
ZCRCHAIN EQU   ISTZCRR+4                                                04278000
ZCRFLAG  EQU   ZCRCRR+3                                                 04279000
ZCRLEN   EQU   ZCRCRR+1                                                 04280000
ZCRID    EQU   ZCRCRR                                                   04281000
LCPCLREP EQU   ISTLCPB+44                                               04282000
LCPUBFSB EQU   LCPFLCCW                                                 04283000
LCPRSV77 EQU   ISTLCPB+39                                               04284000
LCPLCCWC EQU   ISTLCPB+38                                               04285000
LCPRSV78 EQU   LCPFLG1                                                  04286000
LCPTRANS EQU   LCPFLG1                                                  04287000
LCPSTLB  EQU   LCPFLG1                                                  04288000
LCPREDRV EQU   LCPFLG1                                                  04289000
LCPDIRPT EQU   LCPFLG1                                                  04290000
LCPINTER EQU   LCPFLG1                                                  04291000
LCPRESET EQU   LCPFLG1                                                  04292000
LCPSTYPE EQU   ISTLCPB+36                                               04293000
LCPFSNCH EQU   ISTLCPB+34                                               04294000
LCPFOSN  EQU   ISTLCPB+32                                               04295000
LCPFDB2  EQU   LCPFDBA+1                                                04296000
LCPFDB1  EQU   LCPFDBA                                                  04297000
LCPDAF   EQU   LCPCID+2                                                 04298000
LCPSAF   EQU   LCPCID                                                   04299000
LCPLCCW1 EQU   ISTLCPB+12                                               04300000
LCPRRCNT EQU   LCPSEQ+1                                                 04301000
LCPRRCCT EQU   LCPSEQ                                                   04302000
LCPATOP  EQU   LCPFLAG2                                                 04303000
LCPFREE  EQU   LCPFLAG2                                                 04304000
LCPDSTAT EQU   LCPFLAG2                                                 04305000
LCPEXRES EQU   LCPFID0                                                  04306000
LCPZRIMM EQU   LCPTLBPI                                                 04307000
LCPRSTRT EQU   LCPFLAG2                                                 04308000
LCPASYN  EQU   LCPFLAG2                                                 04309000
LCPPRFLG EQU   LCPFLAG2                                                 04310000
LCPZMIRC EQU   LCPRUCNT                                                 04311000
LCPCHAI2 EQU   LCPCHAIN+1                                               04312000
LCPCHNG  EQU   LCPCHAI1                                                 04313000
LCPZRT0B EQU   LCPMNRCD                                                 04314000
LCPZRT0A EQU   LCPMNRCD                                                 04315000
LCPZRTL9 EQU   LCPZRT09                                                 04316000
LCPZRTL8 EQU   LCPZRT08                                                 04317000
LCPZRTL7 EQU   LCPZRT07                                                 04318000
LCPZRTL6 EQU   LCPZRT06                                                 04319000
LCPZRTL5 EQU   LCPZRT05                                                 04320000
LCPZRTL4 EQU   LCPZRT04                                                 04321000
LCPZRTL3 EQU   LCPZRT03                                                 04322000
LCPZRTL2 EQU   LCPZRT02                                                 04323000
LCPZRT01 EQU   LCPFLAGS                                                 04324000
LCPZRT00 EQU   LCPFLAGS                                                 04325000
LCPLNGTH EQU   ISTLCPB+1                                                04326000
LCPTYPE  EQU   ISTLCPB                                                  04327000
RHRSVD5  EQU   RH3                                                      04328000
RHRSVD4  EQU   RH3                                                      04329000
RHLOG    EQU   RH3                                                      04330000
RHRSVD3  EQU   RH3                                                      04331000
RHRCDIR  EQU   RH3                                                      04332000
RHCDIR   EQU   RH3                                                      04333000
RHEB     EQU   RH3                                                      04334000
RHBB     EQU   RH3                                                      04335000
RHPACE   EQU   RH2                                                      04336000
RHRSVD2  EQU   RH2                                                      04337000
RHINOP   EQU   RHRSVD1                                                  04338000
RHBUSY   EQU   RHRETRY                                                  04339000
RHEXCEPT EQU   RH2                                                      04340000
RHRRN    EQU   RH2                                                      04341000
RHPE     EQU   RH2                                                      04342000
RHFME    EQU   RH2                                                      04343000
RHCHAIN  EQU   RH1                                                      04344000
RHSENSE  EQU   RH1                                                      04345000
RHFORMAT EQU   RH1                                                      04346000
RHDIRI   EQU   RH1                                                      04347000
RHSCI    EQU   RH1                                                      04348000
RHTYPE   EQU   RH1                                                      04349000
ATCAOS   EQU   ISTATCVT+1584                                            04350000
ATCPOPAB EQU   ATCAOSM+640                                              04351000
ATCVIOPM EQU   ATCAOSM+636                                              04352000
ATCTPMMI EQU   ATCAOSM+632                                              04353000
ATCTPMPB EQU   ATCAOSM+600                                              04354000
ATCRSV88 EQU   ATCAOSM+596                                              04355000
ATCRPLCT EQU   ATCAOSM+594                                              04356000
ATCCRACT EQU   ATCAOSM+592                                              04357000
ATCSRBCT EQU   ATCAOSM+590                                              04358000
ATCRSV75 EQU   ATCAOSM+589                                              04359000
ATCRSV66 EQU   ATCZFLAG                                                 04360000
ATCZF001 EQU   ATCZFLAG                                                 04361000
ATCTPCP1 EQU   ATCAOSM+584                                              04362000
ATCTPCP0 EQU   ATCAOSM+580                                              04363000
ATCAICTN EQU   ATCAOSM+576                                              04364000
ATCZR01  EQU   ATCAOSM+572                                              04365000
ATCMPLTA EQU   ATCAOSM+568                                              04366000
ATCASCB  EQU   ATCAOSM+564                                              04367000
ATCAP86  EQU   ATCAOSM+560                                              04368000
ATCAP85  EQU   ATCAOSM+556                                              04369000
ATCAP84  EQU   ATCAOSM+552                                              04370000
ATCAP83  EQU   ATCAOSM+548                                              04371000
ATCAP82  EQU   ATCAOSM+544                                              04372000
ATCAP69  EQU   ATCAOSM+540                                              04373000
ATCAP66  EQU   ATCAOSM+536                                              04374000
ATCAP62  EQU   ATCAOSM+532                                              04375000
ATCAPC59 EQU   ATCAOSM+528                                              04376000
ATCAP56  EQU   ATCAOSM+524                                              04377000
ATCAP55  EQU   ATCAOSM+520                                              04378000
ATCRCFY0 EQU   ATCAOSM+516                                              04379000
ATCAP41  EQU   ATCAOSM+512                                              04380000
ATCAPC25 EQU   ATCAOSM+508                                              04381000
ATCAP23  EQU   ATCAOSM+504                                              04382000
ATCTPSPB EQU   ATCAOSM+472                                              04383000
ATCTRMPB EQU   ATCAOSM+440                                              04384000
ATCAPBE  EQU   ATCAOSM+436                                              04385000
ATCPSTA  EQU   ATCAOSM+432                                              04386000
ATCSMABF EQU   ATCAOSM+428                                              04387000
ATCSMAPR EQU   ATCAOSM+424                                              04388000
ATCTPWQA EQU   ATCAOSM+420                                              04389000
ATCSMAID EQU   ATCAOSM+416                                              04390000
ATCSMARA EQU   ATCAOSM+412                                              04391000
ATCCACXA EQU   ATCAOSM+408                                              04392000
ATCZLAAB EQU   ATCAOSM+404                                              04393000
ATCATA10 EQU   ATCAOSM+400                                              04394000
ATCHLTCB EQU   ATCAOSM+396                                              04395000
@NM00028 EQU   ATCVTFLG                                                 04396000
ATCVTACT EQU   ATCVTFLG                                                 04397000
ATCRPT40 EQU   ATCAOSM+388                                              04398000
ATCRPT39 EQU   ATCAOSM+384                                              04399000
ATCRPT38 EQU   ATCAOSM+380                                              04400000
ATCRPT37 EQU   ATCAOSM+376                                              04401000
ATCRPT36 EQU   ATCAOSM+372                                              04402000
ATCRPT35 EQU   ATCAOSM+368                                              04403000
ATCRPT34 EQU   ATCAOSM+364                                              04404000
ATCRPT33 EQU   ATCAOSM+360                                              04405000
ATCRPT32 EQU   ATCAOSM+356                                              04406000
ATCRPT31 EQU   ATCAOSM+352                                              04407000
ATCRPT30 EQU   ATCAOSM+348                                              04408000
ATCRPT29 EQU   ATCAOSM+344                                              04409000
ATCRPT28 EQU   ATCAOSM+340                                              04410000
ATCRPT27 EQU   ATCAOSM+336                                              04411000
@NM00027 EQU   ATCAOSM+333                                              04412000
@NM00026 EQU   @NM00025                                                 04413000
ATCSNUF  EQU   @NM00025                                                 04414000
ATCOPKL  EQU   @NM00025                                                 04415000
ATCABEN  EQU   @NM00025                                                 04416000
ATCAIWT  EQU   ATCAOSM+328                                              04417000
ATCINFDD EQU   ATCAOSM+324                                              04418000
ATCORFMG EQU   ATCAOSM+320                                              04419000
ATCORFRL EQU   ATCAOSM+316                                              04420000
ATCOROBT EQU   ATCAOSM+312                                              04421000
ATCORQG  EQU   ATCORSRB                                                 04422000
ATCORTBF EQU   ATCSQAFR                                                 04423000
ATCRPLAC EQU   ATCRPLCN+2                                               04424000
ATCRPLRC EQU   ATCRPLCN                                                 04425000
ATCCRPLQ EQU   ATCCRPL                                                  04426000
ATCSRBAC EQU   ATCSRBCN+2                                               04427000
ATCSRBRC EQU   ATCSRBCN                                                 04428000
ATCSRBQ  EQU   ATCSRB                                                   04429000
ATCCRAAC EQU   ATCCRACN+2                                               04430000
ATCCRARC EQU   ATCCRACN                                                 04431000
ATCCRAQ  EQU   ATCCRA                                                   04432000
ATCRPT12 EQU   ATCAOSM+276                                              04433000
ATCDMAPP EQU   ATCAOSM+272                                              04434000
ATCAP38  EQU   ATCAOSM+268                                              04435000
ATCZDFJ0 EQU   ATCAOSM+260                                              04436000
ATCAP51  EQU   ATCAOSM+256                                              04437000
ATCZPAB2 EQU   ATCAOSM+224                                              04438000
ATCZPAB1 EQU   ATCAOSM+192                                              04439000
ATCZLFVT EQU   ATCAOSM+188                                              04440000
ATCZLPVT EQU   ATCAOSM+184                                              04441000
ATCZDVTX EQU   ATCAOSM+180                                              04442000
ATCZDVTA EQU   ATCAOSM+176                                              04443000
ATCZDVT9 EQU   ATCAOSM+172                                              04444000
ATCZDVT8 EQU   ATCAOSM+168                                              04445000
ATCZDVT7 EQU   ATCAOSM+164                                              04446000
ATCRSV56 EQU   ATCDAPVT+22                                              04447000
ATCDAPDG EQU   ATCDAPVT+20                                              04448000
ATCDXCEA EQU   ATCDAPVT+16                                              04449000
ATCDCEA  EQU   ATCDAPVT+12                                              04450000
ATCDPCIA EQU   ATCDAPVT+8                                               04451000
ATCDSIOA EQU   ATCDAPVT+4                                               04452000
ATCDEOEA EQU   ATCDAPVT                                                 04453000
ATCZLAEA EQU   ATCLDAPP+16                                              04454000
ATCZLCEA EQU   ATCLDAPP+12                                              04455000
ATCRSV17 EQU   ATCLDAPP+8                                               04456000
ATCSMFRR EQU   ATCLDAPP+4                                               04457000
ATCCDTID EQU   ATCLDAPP                                                 04458000
ATCZAEA  EQU   ATCICAPP+16                                              04459000
ATCZCEA  EQU   ATCICAPP+12                                              04460000
ATCCDTCB EQU   ATCICAPP+8                                               04461000
ATCZSIOA EQU   ATCICAPP+4                                               04462000
ATCCDRPH EQU   ATCICAPP                                                 04463000
ATCAP65  EQU   ATCAOSM+96                                               04464000
ATCZDVT6 EQU   ATCAOSM+92                                               04465000
ATCZDVT4 EQU   ATCAOSM+88                                               04466000
ATCZDVT3 EQU   ATCAOSM+84                                               04467000
ATCZDVT1 EQU   ATCAOSM+80                                               04468000
ATCICNCB EQU   ATCAOSM+76                                               04469000
ATCZFSVT EQU   ATCAOSM+68                                               04470000
ATCAP64  EQU   ATCAOSM+64                                               04471000
ATCAP63  EQU   ATCAOSM+60                                               04472000
ATCAP61  EQU   ATCAOSM+56                                               04473000
ATCAP58  EQU   ATCAOSM+52                                               04474000
ATCAP57  EQU   ATCAOSM+48                                               04475000
ATCAP54  EQU   ATCAOSM+44                                               04476000
ATCAP53  EQU   ATCAOSM+40                                               04477000
ATCAP52  EQU   ATCAOSM+36                                               04478000
ATCAP12  EQU   ATCAOSM+20                                               04479000
ATCAP11  EQU   ATCAOSM+16                                               04480000
ATCCMTCB EQU   ATCAOSM+12                                               04481000
ATCPRPH  EQU   ATCAOSM+8                                                04482000
ATCGSRBF EQU   ATCGSRBG                                                 04483000
ATCSRBRT EQU   ATCAOSM                                                  04484000
@NM00024 EQU   @NM00023                                                 04485000
ATCVTMAB EQU   @NM00023                                                 04486000
@NM00022 EQU   ATCVTBAM                                                 04487000
ATCVDLOK EQU   ISTATCVT+904                                             04488000
ATCVFPAB EQU   ISTATCVT+872                                             04489000
ATCVDPAB EQU   ISTATCVT+840                                             04490000
ATCIOECB EQU   ISTATCVT+836                                             04491000
ATCINCW3 EQU   ISTATCVT+832                                             04492000
ATCMODTB EQU   ISTATCVT+828                                             04493000
ATCUSSPT EQU   ISTATCVT+824                                             04494000
ATCSRTAB EQU   ISTATCVT+820                                             04495000
@NM00021 EQU   ISTATCVT+819                                             04496000
@NM00020 EQU   ATCSTAT2                                                 04497000
ATCTRSMS EQU   ATCSTAT2                                                 04498000
ATCTRLOK EQU   ATCSTAT2                                                 04499000
ATCTRPSS EQU   ATCSTAT2                                                 04500000
ATCTRESC EQU   ATCSTAT2                                                 04501000
ATCTRAPI EQU   ATCSTAT2                                                 04502000
ATCNMCTR EQU   ISTATCVT+816                                             04503000
ATCSEC51 EQU   ATCSECST                                                 04504000
ATCSEC40 EQU   ATCSIPD+8                                                04505000
ATCSEC30 EQU   ATCSIPD+4                                                04506000
ATCSEC21 EQU   ATCSIPD                                                  04507000
ATCSEC10 EQU   ATCSOPD+4                                                04508000
ATCSEC01 EQU   ATCSOPD                                                  04509000
ATCPOIA  EQU   ATCRNO+1                                                 04510000
@NM00019 EQU   ATCRNO                                                   04511000
ATCPODVT EQU   ISTATCVT+784                                             04512000
ATCS49XL EQU   ISTATCVT+780                                             04513000
ATCS49XI EQU   ISTATCVT+776                                             04514000
ATCLCLCT EQU   ATCVLCNT+2                                               04515000
ATCRNCNT EQU   ATCVLCNT                                                 04516000
ATCCFEAD EQU   ISTATCVT+768                                             04517000
ATCPTR00 EQU   ISTATCVT+736                                             04518000
ATCRSV10 EQU   ISTATCVT+704                                             04519000
ATCTACB  EQU   ISTATCVT+700                                             04520000
ATCVTINM EQU   ISTATCVT+696                                             04521000
ATCTCLIM EQU   ISTATCVT+692                                             04522000
ATCTCLOM EQU   ISTATCVT+688                                             04523000
ATCVTIPB EQU   ISTATCVT+656                                             04524000
ATCTCIPB EQU   ISTATCVT+624                                             04525000
ATCTIPAB EQU   ISTATCVT+592                                             04526000
ATCOCCCB EQU   ISTATCVT+588                                             04527000
ATCOCCOB EQU   ISTATCVT+584                                             04528000
ATCCDLAD EQU   ISTATCVT+580                                             04529000
ATCCCLAD EQU   ISTATCVT+576                                             04530000
ATCDLRPB EQU   ISTATCVT+544                                             04531000
ATCPGPAB EQU   ISTATCVT+512                                             04532000
ATCVPAB1 EQU   ISTATCVT+480                                             04533000
ATCRSV97 EQU   ISTATCVT+476                                             04534000
ATCRDTLK EQU   ISTATCVT+472                                             04535000
ATCVOCLK EQU   ISTATCVT+468                                             04536000
ATCCDFDN EQU   ISTATCVT+464                                             04537000
ATCCDFIN EQU   ISTATCVT+460                                             04538000
ATCDVTLK EQU   ISTATCVT+456                                             04539000
ATCAP36  EQU   ISTATCVT+452                                             04540000
ATCAP35  EQU   ISTATCVT+448                                             04541000
ATCAP33  EQU   ISTATCVT+444                                             04542000
ATCRSV99 EQU   ISTATCVT+440                                             04543000
ATCONFIG EQU   ISTATCVT+432                                             04544000
ATCNODDS EQU   ISTATCVT+428                                             04545000
ATCNODEL EQU   ISTATCVT+420                                             04546000
ATCRSV69 EQU   ISTATCVT+416                                             04547000
ATCAPCR5 EQU   ISTATCVT+412                                             04548000
ATCLDECB EQU   ISTATCVT+408                                             04549000
ATCLDNCS EQU   ISTATCVT+404                                             04550000
ATCCDPTR EQU   ISTATCVT+400                                             04551000
ATCADEL  EQU   ISTATCVT+396                                             04552000
ATCTODVT EQU   ISTATCVT+392                                             04553000
ATCDEBCH EQU   ISTATCVT+388                                             04554000
ATCHBSIZ EQU   ATCHPGM+2                                                04555000
ATCHBFNO EQU   ATCHPGM                                                  04556000
ATCCRME  EQU   ISTATCVT+380                                             04557000
ATCRVCHS EQU   ISTATCVT+372                                             04558000
ATCECTLP EQU   ISTATCVT+368                                             04559000
ATCZDVTB EQU   ISTATCVT+364                                             04560000
ATCECPRT EQU   ISTATCVT+360                                             04561000
ATCVTLOD EQU   ISTATCVT+356                                             04562000
ATCTRPAB EQU   ISTATCVT+352                                             04563000
ATCMSGM  EQU   ISTATCVT+348                                             04564000
ATCMSGP  EQU   ISTATCVT+344                                             04565000
ATCEPT   EQU   ISTATCVT+340                                             04566000
ATCDVT   EQU   ISTATCVT+336                                             04567000
ATCTRCPT EQU   ISTATCVT+332                                             04568000
ATCDVLOD EQU   ISTATCVT+328                                             04569000
ATCALERT EQU   ISTATCVT+324                                             04570000
ATCEPA   EQU   ISTATCVT+320                                             04571000
ATCSAF   EQU   ISTATCVT+318                                             04572000
ATCXRANG EQU   ISTATCVT+317                                             04573000
ATCLAST  EQU   ATCSHRFG                                                 04574000
ATCSHRTN EQU   ISTATCVT+308                                             04575000
ATCUEP   EQU   ISTATCVT+304                                             04576000
ATCOCRT  EQU   ISTATCVT+300                                             04577000
ATCCSMA  EQU   ATCCSMR                                                  04578000
ATCESC02 EQU   ISTATCVT+292                                             04579000
ATCESC01 EQU   ISTATCVT+288                                             04580000
ATCCDFND EQU   ISTATCVT+284                                             04581000
ATCCDDEL EQU   ISTATCVT+280                                             04582000
ATCCDADD EQU   ISTATCVT+276                                             04583000
ATCMNT   EQU   ISTATCVT+272                                             04584000
ATCRSV16 EQU   ISTATCVT+270                                             04585000
ATCMAXID EQU   ISTATCVT+269                                             04586000
ATCMSGSP EQU   ATCCOM+268                                               04587000
ATCCIDM  EQU   ATCCOM+266                                               04588000
ATCACTRM EQU   ATCCOM+264                                               04589000
ATCNERAP EQU   ATCCOM+260                                               04590000
ATCNESAL EQU   ATCCOM+256                                               04591000
ATCRCC65 EQU   ATCCOM+252                                               04592000
ATCRCC26 EQU   ATCCOM+248                                               04593000
ATCRCC63 EQU   ATCCOM+244                                               04594000
ATCRSV11 EQU   ATCCOM+242                                               04595000
ATCVTMID EQU   ATCCOM+240                                               04596000
ATCAPOST EQU   ATCCOM+236                                               04597000
ATCNERFN EQU   ATCCOM+232                                               04598000
ATCNERNE EQU   ATCCOM+228                                               04599000
ATCNERCV EQU   ATCCOM+224                                               04600000
ATCNERST EQU   ATCCOM+220                                               04601000
ATCDCC61 EQU   ATCCOM+216                                               04602000
ATCDCC60 EQU   ATCCOM+212                                               04603000
ATCSRTDF EQU   ATCCOM+208                                               04604000
ATCSRTAD EQU   ATCCOM+204                                               04605000
ATCFIRA  EQU   ATCCOM+200                                               04606000
ATCSMBQ  EQU   ATCCOM+196                                               04607000
ATCSMRC  EQU   ATCCOM+192                                               04608000
ATCSMQU  EQU   ATCCOM+184                                               04609000
ATCACDA  EQU   ATCCOM+176                                               04610000
ATCSTMA  EQU   ATCCOM+172                                               04611000
ATCFRSTR EQU   ATCCOM+168                                               04612000
ATCGTSTR EQU   ATCCOM+164                                               04613000
ATCREADA EQU   ATCCOM+160                                               04614000
ATCALOAD EQU   ATCCOM+156                                               04615000
ATCBLDLA EQU   ATCCOM+152                                               04616000
ATCFBRPH EQU   ATCCOM+148                                               04617000
ATCBFTRC EQU   ATCCOM+144                                               04618000
ATCTPBUF EQU   ATCTHTRC                                                 04619000
ATCREMOV EQU   ATCCOM+136                                               04620000
ATCADD   EQU   ATCCOM+132                                               04621000
ATCDVTPT EQU   ATCCOM+124                                               04622000
ATCFEPT  EQU   ATCCOM+120                                               04623000
ATCFDVT  EQU   ATCCOM+116                                               04624000
ATCCONFT EQU   ATCCOM+112                                               04625000
ATCPTCHA EQU   ATCCOM+108                                               04626000
ATCAUTHA EQU   ATCCOM+104                                               04627000
ATCACCTA EQU   ATCCOM+100                                               04628000
ATCRDTH  EQU   ATCCOM+96                                                04629000
ATCFRSCH EQU   ATCCOM+92                                                04630000
ATCFSB   EQU   ATCCOM+88                                                04631000
ATCHLTMS EQU   ATCCOM+84                                                04632000
ATCECPRM EQU   ATCCOM+80                                                04633000
ATCECNET EQU   ATCCOM+76                                                04634000
ATCECOPC EQU   ATCCOM+72                                                04635000
ATCVPARM EQU   ATCCOM+68                                                04636000
ATCECVRQ EQU   ATCCOM+64                                                04637000
ATCECSES EQU   ATCCOM+60                                                04638000
ATCOCHA  EQU   ATCCOM+56                                                04639000
ATCDSPLQ EQU   ATCCOM+52                                                04640000
ATCECDSP EQU   ATCCOM+48                                                04641000
ATCVARYQ EQU   ATCCOM+44                                                04642000
ATCECVRY EQU   ATCCOM+40                                                04643000
ATCHALTQ EQU   ATCCOM+36                                                04644000
ATCECHLT EQU   ATCCOM+32                                                04645000
ATCMODQ  EQU   ATCCOM+28                                                04646000
ATCECMOD EQU   ATCCOM+24                                                04647000
ATCASCHD EQU   ATCCOM+20                                                04648000
ATCSRT   EQU   ATCCOM+16                                                04649000
ATCRDT   EQU   ATCCOM+12                                                04650000
ATCDCFRR EQU   ATCCOM+8                                                 04651000
ATCAPI   EQU   ATCCOM+4                                                 04652000
ATCRSV04 EQU   ATCSTAT4                                                 04653000
ATCVTTRC EQU   ATCSTAT4                                                 04654000
ATCNCSD  EQU   ATCSTAT4                                                 04655000
ATCMTST  EQU   ATCSTAT4                                                 04656000
ATCTPRT  EQU   ATCSTAT4                                                 04657000
ATCPRTAT EQU   ATCSTAT4                                                 04658000
@NM00018 EQU   ATCPOFLG                                                 04659000
ATCPOUNS EQU   ATCPOFLG                                                 04660000
ATCHSDMF EQU   ATCSTFLG                                                 04661000
@NM00017 EQU   ATCSTAT1                                                 04662000
ATCMDHLT EQU   ATCSTAT1                                                 04663000
ATCINHLT EQU   ATCSTAT1                                                 04664000
ATCNETSL EQU   ATCSTAT1                                                 04665000
ATCQKHLT EQU   ATCSTAT1                                                 04666000
ATCSNHLT EQU   ATCSTAT1                                                 04667000
ATCACTIV EQU   ATCSTAT1                                                 04668000
ATCSTART EQU   ATCSTAT1                                                 04669000
RPHNEXPO EQU   ISTRPH+104                                               04670000
RPHSAV16 EQU   RPHWORK+60                                               04671000
RPHSAV15 EQU   RPHWORK+56                                               04672000
RPHSAV14 EQU   RPHWORK+52                                               04673000
RPHSAV13 EQU   RPHWORK+48                                               04674000
RPHSAV12 EQU   RPHWORK+44                                               04675000
RPHSAV11 EQU   RPHWORK+40                                               04676000
RPHSAV10 EQU   RPHWORK+36                                               04677000
RPHSAVE9 EQU   RPHWORK+32                                               04678000
RPHSAVE8 EQU   RPHWORK+28                                               04679000
RPHSAVE7 EQU   RPHWORK+24                                               04680000
RPHSAVE6 EQU   RPHWORK+20                                               04681000
RPHSAVE5 EQU   RPHWORK+16                                               04682000
RPHSAVE4 EQU   RPHWORK+12                                               04683000
RPHSAVE3 EQU   RPHWORK+8                                                04684000
RPHSAVE2 EQU   RPHWORK+4                                                04685000
RPHSHALF EQU   RPHSAVE1+2                                               04686000
RPHSBIT8 EQU   RPHSBITS                                                 04687000
RPHSBIT7 EQU   RPHSBITS                                                 04688000
RPHSBIT6 EQU   RPHSBITS                                                 04689000
RPHSBIT5 EQU   RPHSBITS                                                 04690000
RPHSBIT4 EQU   RPHSBITS                                                 04691000
RPHSBIT3 EQU   RPHSBITS                                                 04692000
RPHSBIT2 EQU   RPHSBITS                                                 04693000
RPHSBIT1 EQU   RPHSBITS                                                 04694000
RPHSBYTE EQU   RPHSAVE1                                                 04695000
RPHPABFG EQU   RPHPABQA                                                 04696000
RPHSRP34 EQU   RPHSRPRM+2                                               04697000
RPHSRP12 EQU   RPHSRPRM                                                 04698000
RPHWEGT  EQU   RPHCSPA                                                  04699000
RPHRESUM EQU   RPHRESMA+1                                               04700000
RPHRSV01 EQU   RPHWPFLG                                                 04701000
RPHPURGE EQU   RPHWPFLG                                                 04702000
RPHPT    EQU   RPHWPFLG                                                 04703000
RPHRSKEY EQU   RPHWPFLG                                                 04704000
RPHDVTA  EQU   ISTRPH+12                                                04705000
RPHTIK   EQU   RPHTSKID+3                                               04706000
@NM00016 EQU   RPHTSKID                                                 04707000
RPHRPHAP EQU   RPHRPHA+1                                                04708000
@NM00015 EQU   RPHRPHA                                                  04709000
RPHGATE  EQU   RPHRPHA                                                  04710000
@NM00014 EQU   RPHFLGB                                                  04711000
RPHRLCRA EQU   RPHFLGB                                                  04712000
RPHNRSAV EQU   RPHFLGB                                                  04713000
RPHPGCMP EQU   RPHFLGB                                                  04714000
RPHFBAPS EQU   RPHFLGB                                                  04715000
RPHBSSP  EQU   RPHFLGB                                                  04716000
RPHLOCK  EQU   RPHFLGB                                                  04717000
RPHFNFLG EQU   RPHFSTLC                                                 04718000
RPHMLTCP EQU   RPHFLAGS                                                 04719000
RPHSMCLR EQU   RPHFLAGS                                                 04720000
RPHSMTYP EQU   RPHFLAGS                                                 04721000
RPHSMQ   EQU   RPHFLAGS                                                 04722000
RPHAUTEX EQU   RPHAPTYP                                                 04723000
RPHSPGIN EQU   RPHFLAGS                                                 04724000
RPHOGIND EQU   RPHFLAGS                                                 04725000
RPHLNGTH EQU   RPHCNTL+1                                                04726000
RPHTYPE  EQU   RPHCNTL                                                  04727000
DYPPAB   EQU   ISTDYPAB+16                                              04728000
DYPRSV01 EQU   ISTDYPAB+12                                              04729000
DYPTSKID EQU   ISTDYPAB+8                                               04730000
DYPCHAIN EQU   ISTDYPAB+4                                               04731000
DYPFLGS  EQU   ISTDYPAB+2                                               04732000
DYPLNGTH EQU   ISTDYPAB+1                                               04733000
DYPTYPE  EQU   ISTDYPAB                                                 04734000
LCCWACI  EQU   LCCWFLAG                                                 04735000
LCCWRFI  EQU   LCCWFLAG                                                 04736000
LCCWPER  EQU   LCCWLSI                                                  04737000
LCCWNTVC EQU   LCCWFLAG                                                 04738000
LCCWCKPT EQU   LCCWFLAG                                                 04739000
LCCWTYPE EQU   LCCWCTL                                                  04740000
LCCWMODE EQU   LCCWCTL                                                  04741000
LCCWSOP  EQU   LCCWRWOP                                                 04742000
@NM00013 EQU   LCCWRWOP                                                 04743000
LCCWSD   EQU   LCCWOP                                                   04744000
LCCWSI   EQU   LCCWOP                                                   04745000
FMCFLRSV EQU   FMCFLGB                                                  04746000
FMCFLGA8 EQU   FMCFLGB                                                  04747000
FMCCLRPH EQU   FMCVS1+45                                                04748000
FMCRSV0X EQU   FMCCVFLG                                                 04749000
FMCVYRPH EQU   FMCCVFLG                                                 04750000
FMCZV004 EQU   FMCVS1+40                                                04751000
FMCLOCK2 EQU   FMCVS1+36                                                04752000
@NM00012 EQU   FMCZFLG2                                                 04753000
FMCZF027 EQU   FMCZFLG2                                                 04754000
FMCZF026 EQU   FMCZFLG2                                                 04755000
FMCSEQ1B EQU   FMCSEQ1                                                  04756000
FMCSEQ1T EQU   FMCSEQ1                                                  04757000
FMCZX006 EQU   FMCVS1+33                                                04758000
FMCZX005 EQU   FMCVS1+32                                                04759000
FMCZX004 EQU   FMCVS1+31                                                04760000
FMCZX003 EQU   FMCVS1+30                                                04761000
FMCZX002 EQU   FMCVS1+29                                                04762000
FMCZX001 EQU   FMCVS1+28                                                04763000
FMCZV001 EQU   FMCVS1+24                                                04764000
FMCAWATQ EQU   FMCLCPAQ+1                                               04765000
@NM00011 EQU   FMCLCPAQ                                                 04766000
FMCLCPB2 EQU   FMCLCPBQ+1                                               04767000
FMCLCPB1 EQU   FMCLCPBQ                                                 04768000
FMCASCDQ EQU   FMCSHEAQ+1                                               04769000
@NM00010 EQU   FMCSHEAQ                                                 04770000
FMCSHEDQ EQU   FMCVS1+8                                                 04771000
FMCZFCSQ EQU   FMCVS1+6                                                 04772000
FMCZH001 EQU   FMCVS1+4                                                 04773000
FMCZF025 EQU   FMCZFLAG+3                                               04774000
FMCZF024 EQU   FMCZFLAG+3                                               04775000
FMCZF023 EQU   FMCZFLAG+3                                               04776000
FMCZF022 EQU   FMCZFLAG+3                                               04777000
FMCZF021 EQU   FMCZFLAG+3                                               04778000
FMCZF020 EQU   FMCZFLAG+3                                               04779000
FMCZF019 EQU   FMCZFLAG+3                                               04780000
FMCZF018 EQU   FMCZFLAG+3                                               04781000
FMCZF017 EQU   FMCZFLAG+2                                               04782000
FMCZF016 EQU   FMCZFLAG+2                                               04783000
FMCZF015 EQU   FMCZFLAG+2                                               04784000
FMCZF014 EQU   FMCZFLAG+2                                               04785000
FMCZF013 EQU   FMCZFLAG+2                                               04786000
FMCZF012 EQU   FMCZFLAG+2                                               04787000
FMCZF011 EQU   FMCZFLAG+2                                               04788000
FMCZF010 EQU   FMCZFLAG+2                                               04789000
FMCZF00F EQU   FMCZFLAG+1                                               04790000
FMCZF00E EQU   FMCZFLAG+1                                               04791000
FMCZF00D EQU   FMCZFLAG+1                                               04792000
FMCZF00C EQU   FMCZFLAG+1                                               04793000
FMCZF00B EQU   FMCZFLAG+1                                               04794000
FMCRSV10 EQU   FMCZFLAG+1                                               04795000
FMCZF009 EQU   FMCZFLAG+1                                               04796000
FMCZFD06 EQU   FMCZF006+1                                               04797000
FMCZFC06 EQU   FMCZF006                                                 04798000
FMCZFB06 EQU   FMCZF006                                                 04799000
FMCZFA06 EQU   FMCZF006                                                 04800000
FMCZF005 EQU   FMCZFLAG                                                 04801000
FMCZF004 EQU   FMCZFLAG                                                 04802000
FMCZF003 EQU   FMCZFLAG                                                 04803000
FMCZF002 EQU   FMCZFLAG                                                 04804000
FMCZF001 EQU   FMCZFLAG                                                 04805000
FMCFRESA EQU   ISTFMCB+228                                              04806000
FMCSCSQN EQU   FMCSNCTL+2                                               04807000
FMCSCCTL EQU   FMCSNCTL+1                                               04808000
FMCSTCTL EQU   FMCSCFLG                                                 04809000
FMCSCCLO EQU   FMCSCFLG                                                 04810000
FMCAPRO  EQU   FMCSCFLG                                                 04811000
FMCLURO  EQU   FMCSCFLG                                                 04812000
FMCOBSAC EQU   FMCSCFLG                                                 04813000
FMCIBSAC EQU   FMCSCFLG                                                 04814000
FMCFBRE  EQU   ISTFMCB+220                                              04815000
FMCFBXM  EQU   FMCZV002                                                 04816000
FMCASEGQ EQU   ISTFMCB+212                                              04817000
FMCRDTPT EQU   ISTFMCB+208                                              04818000
FMCLOCK  EQU   ISTFMCB+204                                              04819000
FMCSEGD  EQU   FMCSSEGQ                                                 04820000
FMCRSPLM EQU   ISTFMCB+198                                              04821000
FMCPSTRS EQU   ISTFMCB+196                                              04822000
@NM00009 EQU   FMCRRESP                                                 04823000
FMCTSLHA EQU   FMCRRESP                                                 04824000
FMCFRRN  EQU   FMCRRESP                                                 04825000
FMCFME   EQU   FMCRRESP                                                 04826000
FMCFEX   EQU   FMCRRESP                                                 04827000
FMCFPE   EQU   FMCRRESP                                                 04828000
FMCCTLB  EQU   ISTFMCB+194                                              04829000
FMCBSQNO EQU   FMCCLSEQ+2                                               04830000
FMCTSQNO EQU   FMCCLSEQ                                                 04831000
FMCOBPRG EQU   FMCMODEB                                                 04832000
FMCIBPRG EQU   FMCMODEB                                                 04833000
FMCRESOT EQU   FMCMODEB                                                 04834000
FMCRSTSR EQU   FMCMODEB                                                 04835000
FMCLUQ   EQU   FMCMODEB                                                 04836000
FMCAPQ   EQU   FMCMODEB                                                 04837000
FMCCLEAR EQU   FMCMODEB                                                 04838000
FMCHOLD  EQU   FMCMODEB                                                 04839000
FMCIPSEQ EQU   ISTFMCB+188                                              04840000
FMCLUSTR EQU   ISTFMCB+187                                              04841000
FMCRSV87 EQU   FMCSTAT2                                                 04842000
FMCCPIP  EQU   FMCSTAT2                                                 04843000
FMCALIPR EQU   FMCSTAT2                                                 04844000
FMCIAIO  EQU   FMCSTAT2                                                 04845000
FMCZF00A EQU   FMCSTAT2                                                 04846000
FMCVPIP  EQU   FMCSTAT2                                                 04847000
FMCBHSET EQU   ISTFMCB+185                                              04848000
FMCPRMRC EQU   FMCCLEXT+20                                              04849000
FMCRSV89 EQU   FMCPSTAT                                                 04850000
FMCPCLSD EQU   FMCPSTAT                                                 04851000
FMCDDOCD EQU   FMCPSTAT                                                 04852000
FMCIDVFD EQU   FMCPSTAT                                                 04853000
FMCELKST EQU   FMCPSTAT                                                 04854000
FMCRSV88 EQU   FMCPSCMD                                                 04855000
FMCRDBLK EQU   FMCPSCMD                                                 04856000
FMCDSEOC EQU   FMCPSCMD                                                 04857000
FMCPURGE EQU   FMCPSCMD                                                 04858000
FMCRESTI EQU   FMCPSCMD                                                 04859000
FMCCNTCT EQU   FMCPSCMD                                                 04860000
FMCINVT  EQU   FMCPSCMD                                                 04861000
FMCFLGB7 EQU   FMCFLGCL                                                 04862000
FMCFLGB6 EQU   FMCFLGCL                                                 04863000
FMCFLGB5 EQU   FMCFLGCL                                                 04864000
FMCFLGB4 EQU   FMCFLGCL                                                 04865000
FMCFLGB3 EQU   FMCFLGCL                                                 04866000
FMCFLGB2 EQU   FMCFLGCL                                                 04867000
FMCFLGB1 EQU   FMCFLGCL                                                 04868000
FMCFLGB0 EQU   FMCFLGCL                                                 04869000
FMCFLGA7 EQU   FMCFLGA                                                  04870000
FMCFLGA6 EQU   FMCFLGA                                                  04871000
FMCFLGA5 EQU   FMCFLGA                                                  04872000
FMCFLGA4 EQU   FMCFLGA                                                  04873000
FMCFLGA3 EQU   FMCFLGA                                                  04874000
FMCFLGA2 EQU   FMCFLGA                                                  04875000
FMCFLGA1 EQU   FMCFLGA                                                  04876000
FMCFLGA0 EQU   FMCFLGA                                                  04877000
FMCDCLOK EQU   FMCCLEXT+12                                              04878000
FMCRAFM  EQU   FMCCLEXT+8                                               04879000
FMCFBPTR EQU   FMCFBA+1                                                 04880000
FMCFBRSV EQU   FMCFBA                                                   04881000
FMCRPLPT EQU   FMCRPLA+1                                                04882000
FMCRPLRS EQU   FMCRPLA                                                  04883000
FMCPRCLS EQU   FMCCVAL                                                  04884000
FMCIBCE  EQU   FMCCVAL                                                  04885000
FMCONLY  EQU   FMCOBCE                                                  04886000
FMCLAST  EQU   FMCOBCE                                                  04887000
FMCMIDLE EQU   FMCOBCE                                                  04888000
FMCFIRST EQU   FMCOBCE                                                  04889000
FMCCPCNT EQU   FMCPACPC                                                 04890000
FMCMPCNT EQU   FMCPACEM                                                 04891000
FMCNPCNT EQU   FMCPACEN                                                 04892000
FMCCONF  EQU   FMCSSTAT                                                 04893000
FMCPURCH EQU   FMCSSTAT                                                 04894000
FMCRVD01 EQU   ISTFMCB+158                                              04895000
FMCSIP   EQU   FMCSIPA                                                  04896000
FMCEXLST EQU   ISTFMCB+144                                              04897000
FMCPAB4  EQU   ISTFMCB+112                                              04898000
FMCFASYA EQU   ISTFMCB+60                                               04899000
FMCPROCD EQU   ISTFMCB+48                                               04900000
FMCVWT   EQU   ISTFMCB+44                                               04901000
FMCRPLH  EQU   ISTFMCB+40                                               04902000
FMCBUFNB EQU   FMCCMPS1+2                                               04903000
FMCBUFLM EQU   FMCCMPS1                                                 04904000
FMCDEBA  EQU   ISTFMCB+32                                               04905000
@NM00008 EQU   FMCCMDFL                                                 04906000
FMCSNA   EQU   FMCCMDFL                                                 04907000
FMCVSNA  EQU   FMCCMDFL                                                 04908000
FMCCMDR  EQU   FMCCMDFL                                                 04909000
@NM00007 EQU   ISTFMCB+30                                               04910000
@NM00006 EQU   FMCSTAT1                                                 04911000
FMCLTCLS EQU   FMCSTAT1                                                 04912000
FMCHPURG EQU   FMCSTAT1                                                 04913000
FMCVSP2  EQU   FMCSTAT1                                                 04914000
FMCVSP1  EQU   FMCSTAT                                                  04915000
FMCLTEAS EQU   FMCSTAT                                                  04916000
FMCZF007 EQU   FMCSTAT                                                  04917000
FMCDEDSC EQU   FMCSTAT                                                  04918000
FMCDEVOF EQU   FMCSTAT                                                  04919000
FMCDAPT  EQU   FMCSTAT                                                  04920000
FMCPRMTE EQU   FMCSTAT                                                  04921000
FMCPRMTR EQU   FMCSTAT                                                  04922000
FMCUSFLD EQU   ISTFMCB+24                                               04923000
FMCFMCBA EQU   ISTFMCB+20                                               04924000
FMCDVTA  EQU   ISTFMCB+12                                               04925000
FMCTSKID EQU   ISTFMCB+8                                                04926000
FMCNXTCB EQU   ISTFMCB+4                                                04927000
FMCLNGTH EQU   ISTFMCB+1                                                04928000
FMCTYPE  EQU   ISTFMCB                                                  04929000
PROSRDEF EQU   PROSETM4                                                 04930000
PRORSV47 EQU   PROSETM4                                                 04931000
PROSCON  EQU   PROSETM4                                                 04932000
PRORSV46 EQU   PROSETM3                                                 04933000
PROSMONT EQU   PROSETM3                                                 04934000
PRORSV45 EQU   PROSETM3                                                 04935000
PROSNTO  EQU   PROSETM3                                                 04936000
PRORSV44 EQU   PROSETM3                                                 04937000
PRORSV43 EQU   PROSETM2                                                 04938000
PROSNTFL EQU   PROSETM2                                                 04939000
PRORSV42 EQU   PROSETM2                                                 04940000
PRORSV41 EQU   PROPROCS                                                 04941000
PROMODC  EQU   PROPROC4                                                 04942000
PROMODT  EQU   PROPROC4                                                 04943000
PROMODM  EQU   PROPROC4                                                 04944000
PROMODB  EQU   PROPROC4                                                 04945000
PRORSV14 EQU   PROPROC4                                                 04946000
PRORSV13 EQU   PROPROC4                                                 04947000
PRORSV12 EQU   PROPROC4                                                 04948000
PROEIB   EQU   PROPROC4                                                 04949000
PROMONT3 EQU   PROPROC3                                                 04950000
PROMONT2 EQU   PROPROC3                                                 04951000
PROMONIT EQU   PROPROC3                                                 04952000
PROSUBLK EQU   PROPROC3                                                 04953000
PRONTO   EQU   PROPROC3                                                 04954000
PROLGIN  EQU   PROPROC3                                                 04955000
PROERPI  EQU   PROPROC3                                                 04956000
PRORSV07 EQU   PROPROC3                                                 04957000
PROCFTX  EQU   PROPROC2                                                 04958000
PROEMLC  EQU   PROPROC2                                                 04959000
PRONTFL  EQU   PROPROC2                                                 04960000
PRORSV05 EQU   PROPROC2                                                 04961000
PRORSV04 EQU   PROPROC2                                                 04962000
PROLGOT  EQU   PROPROC2                                                 04963000
PROERPO  EQU   PROPROC2                                                 04964000
PRORSV03 EQU   PROPROC2                                                 04965000
PRORPLC  EQU   PROPROC1                                                 04966000
PROCS    EQU   PROPROC1                                                 04967000
PROCA    EQU   PROPROC1                                                 04968000
PRORESPX EQU   PROPROC1                                                 04969000
PRODFASY EQU   PROPROC1                                                 04970000
PROXPOPT EQU   PROPROC1                                                 04971000
PROTRUNC EQU   PROPROC1                                                 04972000
PROASYIP EQU   PROPROC1                                                 04973000
DEVRSV03 EQU   ISTDEVCH+5                                               04974000
DEVPHYSA EQU   ISTDEVCH+4                                               04975000
DEVCSLPN EQU   DEVCHAR3                                                 04976000
DEVCSTCL EQU   DEVCHAR3                                                 04977000
DEVCCHEK EQU   DEVCHAR3                                                 04978000
DEVCATTN EQU   DEVCHAR3                                                 04979000
DEVCSWL  EQU   DEVFCCTL                                                 04980000
DEVCRVB  EQU   DEVFCCTL                                                 04981000
DEVCSSL  EQU   DEVFCCTL                                                 04982000
DEVCBSC  EQU   DEVFCCTL                                                 04983000
DEVMCODE EQU   ISTDEVCH+2                                               04984000
DEVCHAR2 EQU   DEVTCODE                                                 04985000
DEVRSV01 EQU   DEVCHAR                                                  04986000
DEVCCTL  EQU   DEVCHAR                                                  04987000
DEVNNSPT EQU   DEVCHAR                                                  04988000
DEVSPS   EQU   DEVCHAR                                                  04989000
DEVSUBND EQU   DEVCHAR                                                  04990000
DEVCONVR EQU   DEVCHAR                                                  04991000
DEVOTPUT EQU   DEVCHAR                                                  04992000
DEVINPUT EQU   DEVCHAR                                                  04993000
PABRPHA  EQU   PABRPHFG+1                                               04994000
PABNODQ  EQU   PABFLAGS                                                 04995000
PABERLOK EQU   PABERRLK                                                 04996000
PABSSN   EQU   PABFLAGS                                                 04997000
PABDYNAM EQU   PABFLAGS                                                 04998000
PABNORPR EQU   PABFLAGS                                                 04999000
PABPRIOR EQU   PABFLAGS                                                 05000000
PABAPYP  EQU   PABFLAGS                                                 05001000
PABDVTA  EQU   ISTPAB+9                                                 05002000
PABOFFST EQU   ISTPAB+8                                                 05003000
PABRSV02 EQU   PABCHAIN                                                 05004000
PABDELAY EQU   PABCHAIN                                                 05005000
PABRUNNG EQU   PABCHAIN                                                 05006000
PABRESET EQU   PABCHAIN                                                 05007000
PABUNCON EQU   PABCHAIN                                                 05008000
PABCDP   EQU   PABCHAIN                                                 05009000
PABRESCH EQU   PABCHAIN                                                 05010000
PABCHNG  EQU   PABCHAIN                                                 05011000
PABWEQP  EQU   PABWEQA+1                                                05012000
PABRSV01 EQU   PABWEQA                                                  05013000
PABWEQG  EQU   PABWEQA                                                  05014000
LOKXCL   EQU   @NM00004                                                 05015000
LOKPRY   EQU   @NM00004                                                 05016000
@NM00005 EQU   @NM00004                                                 05017000
@NM00003 EQU   LOKCHNG                                                  05018000
LOKCT    EQU   ISTLOK                                                   05019000
CVTLEVL  EQU   CVTRELNO+2                                               05020000
CVTNUMB  EQU   CVTRELNO                                                 05021000
CVTMDL   EQU   CVTFIX+250                                               05022000
@NM00002 EQU   CVTFIX+248                                               05023000
@NM00001 EQU   CVTFIX                                                   05024000
CVTRV482 EQU   CVTXTNT2+128                                             05025000
CVTRV481 EQU   CVTXTNT2+124                                             05026000
CVTRV480 EQU   CVTXTNT2+120                                             05027000
CVTRV479 EQU   CVTXTNT2+118                                             05028000
CVTRV478 EQU   CVTXTNT2+117                                             05029000
CVTRV477 EQU   CVTXTNT2+116                                             05030000
CVTRV476 EQU   CVTXTNT2+115                                             05031000
CVTRV475 EQU   CVTXTNT2+114                                             05032000
CVTRV474 EQU   CVTRV466                                                 05033000
CVTRV473 EQU   CVTRV466                                                 05034000
CVTRV472 EQU   CVTRV466                                                 05035000
CVTRV471 EQU   CVTRV466                                                 05036000
CVTRV470 EQU   CVTRV466                                                 05037000
CVTRV469 EQU   CVTRV466                                                 05038000
CVTRV468 EQU   CVTRV466                                                 05039000
CVTRV467 EQU   CVTRV466                                                 05040000
CVTRV465 EQU   CVTRV457                                                 05041000
CVTRV464 EQU   CVTRV457                                                 05042000
CVTRV463 EQU   CVTRV457                                                 05043000
CVTRV462 EQU   CVTRV457                                                 05044000
CVTRV461 EQU   CVTRV457                                                 05045000
CVTRV460 EQU   CVTRV457                                                 05046000
CVTRV459 EQU   CVTRV457                                                 05047000
CVTRV458 EQU   CVTRV457                                                 05048000
CVTRV456 EQU   CVTXTNT2+108                                             05049000
CVTRV455 EQU   CVTXTNT2+104                                             05050000
CVTRV454 EQU   CVTXTNT2+100                                             05051000
CVTRV453 EQU   CVTXTNT2+96                                              05052000
CVTRV452 EQU   CVTXTNT2+94                                              05053000
CVTRV451 EQU   CVTXTNT2+92                                              05054000
CVTRV450 EQU   CVTXTNT2+90                                              05055000
CVTRV449 EQU   CVTXTNT2+88                                              05056000
CVTRV448 EQU   CVTXTNT2+87                                              05057000
CVTRV447 EQU   CVTXTNT2+86                                              05058000
CVTRV446 EQU   CVTRV438                                                 05059000
CVTRV445 EQU   CVTRV438                                                 05060000
CVTRV444 EQU   CVTRV438                                                 05061000
CVTRV443 EQU   CVTRV438                                                 05062000
CVTRV442 EQU   CVTRV438                                                 05063000
CVTRV441 EQU   CVTRV438                                                 05064000
CVTRV440 EQU   CVTRV438                                                 05065000
CVTRV439 EQU   CVTRV438                                                 05066000
CVTRV437 EQU   CVTRV429                                                 05067000
CVTRV436 EQU   CVTRV429                                                 05068000
CVTRV435 EQU   CVTRV429                                                 05069000
CVTRV434 EQU   CVTRV429                                                 05070000
CVTRV433 EQU   CVTRV429                                                 05071000
CVTRV432 EQU   CVTRV429                                                 05072000
CVTRV431 EQU   CVTRV429                                                 05073000
CVTRV430 EQU   CVTRV429                                                 05074000
CVTRV428 EQU   CVTXTNT2+80                                              05075000
CVTRV427 EQU   CVTXTNT2+76                                              05076000
CVTRV426 EQU   CVTXTNT2+72                                              05077000
CVTRV425 EQU   CVTXTNT2+68                                              05078000
CVTATACT EQU   CVTATCVT                                                 05079000
CVTRV423 EQU   CVTXTNT2+62                                              05080000
CVTRV422 EQU   CVTXTNT2+60                                              05081000
CVTRV421 EQU   CVTXTNT2+58                                              05082000
CVTRV420 EQU   CVTXTNT2+56                                              05083000
CVTRV419 EQU   CVTXTNT2+55                                              05084000
CVTRV418 EQU   CVTXTNT2+54                                              05085000
CVTRV417 EQU   CVTRV409                                                 05086000
CVTRV416 EQU   CVTRV409                                                 05087000
CVTRV415 EQU   CVTRV409                                                 05088000
CVTRV414 EQU   CVTRV409                                                 05089000
CVTRV413 EQU   CVTRV409                                                 05090000
CVTRV412 EQU   CVTRV409                                                 05091000
CVTRV411 EQU   CVTRV409                                                 05092000
CVTRV410 EQU   CVTRV409                                                 05093000
CVTRV408 EQU   CVTRV400                                                 05094000
CVTRV407 EQU   CVTRV400                                                 05095000
CVTRV406 EQU   CVTRV400                                                 05096000
CVTRV405 EQU   CVTRV400                                                 05097000
CVTRV404 EQU   CVTRV400                                                 05098000
CVTRV403 EQU   CVTRV400                                                 05099000
CVTRV402 EQU   CVTRV400                                                 05100000
CVTRV401 EQU   CVTRV400                                                 05101000
CVTICB   EQU   CVTXTNT2+48                                              05102000
CVTSKTA  EQU   CVTXTNT2+44                                              05103000
CVTSHSB  EQU   CVTSHS                                                   05104000
CVTRSV98 EQU   CVTXTNT2+36                                              05105000
CVTRSV97 EQU   CVTXTNT2+34                                              05106000
CVTRSV96 EQU   CVTXTNT2+32                                              05107000
CVTOLTEP EQU   CVTXTNT2+28                                              05108000
CVTQIDA  EQU   CVTQID+1                                                 05109000
CVTRSV95 EQU   CVTQID                                                   05110000
CVTRSV94 EQU   CVTXTNT2+20                                              05111000
CVTRSV93 EQU   CVTXTNT2+16                                              05112000
CVTRSV92 EQU   CVTXTNT2+12                                              05113000
CVTDEBVR EQU   CVTXTNT2+8                                               05114000
CVTRSV91 EQU   CVTXTNT2+6                                               05115000
CVTRSV9H EQU   CVTFLGBT                                                 05116000
CVTRSV9G EQU   CVTFLGBT                                                 05117000
CVTRSV9F EQU   CVTFLGBT                                                 05118000
CVTRSV9E EQU   CVTFLGBT                                                 05119000
CVTRSV9D EQU   CVTFLGBT                                                 05120000
CVTRSV9C EQU   CVTFLGBT                                                 05121000
CVTVME   EQU   CVTFLGBT                                                 05122000
CVTNPE   EQU   CVTFLGBT                                                 05123000
CVTNUCLS EQU   CVTXTNT2+4                                               05124000
CVTDSSVA EQU   CVTDSSV+1                                                05125000
CVTRSV89 EQU   CVTDSSV                                                  05126000
CVTRSV88 EQU   CVTXTNT1+8                                               05127000
CVTRSV87 EQU   CVTXTNT1+4                                               05128000
CVTFACHN EQU   CVTXTNT1                                                 05129000
CVTRV488 EQU   CVTMAP+412                                               05130000
CVTRV487 EQU   CVTMAP+408                                               05131000
CVTRV486 EQU   CVTMAP+404                                               05132000
CVTRV485 EQU   CVTMAP+400                                               05133000
CVTACTAP EQU   CVTMAP+396                                               05134000
CVTAUTH  EQU   CVTMAP+392                                               05135000
CVTATMCA EQU   CVTATMCT+1                                               05136000
CVTATMST EQU   CVTATMCT                                                 05137000
CVTRSV61 EQU   CVTMAP+384                                               05138000
CVTVOLT1 EQU   CVTVOLM1+1                                               05139000
CVTVOLI1 EQU   CVTVOLF1                                                 05140000
CVTSTOA  EQU   CVTMAP+376                                               05141000
CVTRSV58 EQU   CVTMAP+374                                               05142000
CVTRSV57 EQU   CVTMAP+372                                               05143000
CVTDDCE  EQU   CVTMAP+368                                               05144000
CVTPNWFR EQU   CVTMAP+364                                               05145000
CVTSMF   EQU   CVTMAP+360                                               05146000
CVTSULK  EQU   CVTMAP+358                                               05147000
CVTSLKO  EQU   CVTSYSK                                                  05148000
CVTSLKP  EQU   CVTSYSK                                                  05149000
CVTSLKQ  EQU   CVTSYSK                                                  05150000
CVTSLKR  EQU   CVTSYSK                                                  05151000
CVTRSV56 EQU   CVTSYSK                                                  05152000
CVTRSV55 EQU   CVTSYSK                                                  05153000
CVTRSV54 EQU   CVTSYSK                                                  05154000
CVTRSV53 EQU   CVTSYSK                                                  05155000
CVTRSV52 EQU   CVTA1F1                                                  05156000
CVTRSV51 EQU   CVTA1F1                                                  05157000
CVTRSV50 EQU   CVTA1F1                                                  05158000
CVTRSV49 EQU   CVTA1F1                                                  05159000
CVTRSV48 EQU   CVTA1F1                                                  05160000
CVTRSV47 EQU   CVTA1F1                                                  05161000
CVTSRSW  EQU   CVTA1F1                                                  05162000
CVTPFSW  EQU   CVTA1F1                                                  05163000
CVTPCVT  EQU   CVTMAP+352                                               05164000
CVTRSV46 EQU   CVTMAP+344                                               05165000
CVTRSV45 EQU   CVTMAP+340                                               05166000
CVTRSV44 EQU   CVTMAP+338                                               05167000
CVTRSV43 EQU   CVTMAP+336                                               05168000
CVTHJESA EQU   CVTHJES+1                                                05169000
CVTRSV42 EQU   CVTHJES                                                  05170000
CVTEXT2A EQU   CVTEXT2+1                                                05171000
CVTRSV41 EQU   CVTEXT2                                                  05172000
CVTAPFA  EQU   CVTAPF+1                                                 05173000
CVTRSV40 EQU   CVTAPF                                                   05174000
CVTRV518 EQU   CVTINTLA                                                 05175000
CVTRV517 EQU   CVTERPV                                                  05176000
CVTEORM  EQU   CVTMAP+312                                               05177000
CVTMCHPR EQU   CVTMAP+308                                               05178000
CVTTZ    EQU   CVTMAP+304                                               05179000
CVTJEPS  EQU   CVTMAP+300                                               05180000
CVTJESCT EQU   CVTMAP+296                                               05181000
CVTMODE  EQU   CVTMAP+292                                               05182000
CVTPTRV  EQU   CVTMAP+288                                               05183000
CVTREAL  EQU   CVTMAP+284                                               05184000
CVTRSV39 EQU   CVTMAP+280                                               05185000
CVTRSV38 EQU   CVTMAP+276                                               05186000
CVTDMSRA EQU   CVTDMSR+1                                                05187000
CVTRV634 EQU   CVTDMSRF                                                 05188000
CVTRV633 EQU   CVTDMSRF                                                 05189000
CVTRV632 EQU   CVTDMSRF                                                 05190000
CVTRV631 EQU   CVTDMSRF                                                 05191000
CVTRV630 EQU   CVTDMSRF                                                 05192000
CVTRV629 EQU   CVTDMSRF                                                 05193000
CVTUDUMP EQU   CVTDMSRF                                                 05194000
CVTSDUMP EQU   CVTDMSRF                                                 05195000
CVTQMSGA EQU   CVTQMSG+1                                                05196000
CVTRSV36 EQU   CVTQMSG                                                  05197000
CVTAMFF  EQU   CVTMAP+264                                               05198000
CVTPURGA EQU   CVTPURG+1                                                05199000
CVTRSV35 EQU   CVTPURG                                                  05200000
CVTCBSP  EQU   CVTMAP+256                                               05201000
CVTATERA EQU   CVTATER+1                                                05202000
CVTSYST  EQU   CVTATER                                                  05203000
CVTVOLT2 EQU   CVTTAT                                                   05204000
CVTVOLI2 EQU   CVTVOLF2                                                 05205000
CVTAQAVB EQU   CVTAQAVT+1                                               05206000
CVTRSV34 EQU   CVTTCMFG                                                 05207000
CVTRSV33 EQU   CVTTCMFG                                                 05208000
CVTRSV32 EQU   CVTTCMFG                                                 05209000
CVTRSV31 EQU   CVTTCMFG                                                 05210000
CVTRSV30 EQU   CVTTCMFG                                                 05211000
CVTRSV29 EQU   CVTTCMFG                                                 05212000
CVTRSV28 EQU   CVTTCMFG                                                 05213000
CVTTCRDY EQU   CVTTCMFG                                                 05214000
CVTGTFA  EQU   CVTGTF+1                                                 05215000
CVTRSV27 EQU   CVTGTFST                                                 05216000
CVTRNIO  EQU   CVTGTFST                                                 05217000
CVTUSR   EQU   CVTGTFST                                                 05218000
CVTRV318 EQU   CVTFORM                                                  05219000
CVTRV317 EQU   CVTTMODE                                                 05220000
CVTRV316 EQU   CVTSTATE                                                 05221000
CVTRV315 EQU   CVTGTFS                                                  05222000
CVTGTFAV EQU   CVTGTFS                                                  05223000
CVT0SCR1 EQU   CVTMAP+232                                               05224000
CVTRV515 EQU   CVTMAP+228                                               05225000
CVTRMS   EQU   CVTMAP+224                                               05226000
CVTPATCH EQU   CVTMAP+220                                               05227000
CVTTSCE  EQU   CVTMAP+216                                               05228000
CVTLNKSC EQU   CVTMAP+214                                               05229000
CVTQABST EQU   CVTMAP+212                                               05230000
CVTMDLDS EQU   CVTMAP+208                                               05231000
CVTUSER  EQU   CVTMAP+204                                               05232000
CVTABEND EQU   CVTMAP+200                                               05233000
CVTSMCA  EQU   CVTMAP+196                                               05234000
CVTRSV18 EQU   CVTMAP+192                                               05235000
CVTQLPAQ EQU   CVTMAP+188                                               05236000
CVTQCDSR EQU   CVTMAP+184                                               05237000
CVTRSV17 EQU   CVTOPTB                                                  05238000
CVTRSV16 EQU   CVTOPTB                                                  05239000
CVTFP    EQU   CVTOPTB                                                  05240000
CVTAPTHR EQU   CVTOPTB                                                  05241000
CVTNLOG  EQU   CVTOPTB                                                  05242000
CVTTOD   EQU   CVTOPTB                                                  05243000
CVTCTIMS EQU   CVTOPTB                                                  05244000
CVTPROT  EQU   CVTOPTB                                                  05245000
CVTXPFP  EQU   CVTOPTA                                                  05246000
CVTASCII EQU   CVTOPTA                                                  05247000
CVTRSV13 EQU   CVTOPTA                                                  05248000
CVTRSV12 EQU   CVTOPTA                                                  05249000
CVTNIP   EQU   CVTOPTA                                                  05250000
CVTDDR   EQU   CVTOPTA                                                  05251000
CVTAPR   EQU   CVTOPTA                                                  05252000
CVTCCH   EQU   CVTOPTA                                                  05253000
CVTSNCTR EQU   CVTMAP+180                                               05254000
CVTQMWR  EQU   CVTMAP+176                                               05255000
CVTQOCR  EQU   CVTMAP+172                                               05256000
CVT1EF00 EQU   CVTMAP+168                                               05257000
CVTMZ00  EQU   CVTMAP+164                                               05258000
CVTHEAD  EQU   CVTMAP+160                                               05259000
CVTRSV11 EQU   CVTMAP+156                                               05260000
CVT0PT01 EQU   CVTMAP+152                                               05261000
CVTMSER  EQU   CVTMAP+148                                               05262000
CVTRV516 EQU   CVTIERLC                                                 05263000
CVTILCH  EQU   CVTMAP+140                                               05264000
CVT0DS   EQU   CVTMAP+136                                               05265000
CVTFBOSV EQU   CVTMAP+132                                               05266000
CVTNUCB  EQU   CVTMAP+128                                               05267000
CVTIXAVL EQU   CVTMAP+124                                               05268000
CVTIOQET EQU   CVTMAP+120                                               05269000
CVTDCBA  EQU   CVTMAP+117                                               05270000
CVTMVS2  EQU   CVTDCB                                                   05271000
CVT6DAT  EQU   CVTDCB                                                   05272000
CVT4MPS  EQU   CVTDCB                                                   05273000
CVTRSV09 EQU   CVTDCB                                                   05274000
CVT4MS1  EQU   CVTDCB                                                   05275000
CVT2SPS  EQU   CVTDCB                                                   05276000
CVT1SSS  EQU   CVTDCB                                                   05277000
CVTRSV08 EQU   CVTDCB                                                   05278000
CVTSTB   EQU   CVTMAP+112                                               05279000
CVTQTD00 EQU   CVTMAP+108                                               05280000
CVTQTE00 EQU   CVTMAP+104                                               05281000
CVTCUCB  EQU   CVTMAP+100                                               05282000
CVTSJQ   EQU   CVTMAP+96                                                05283000
CVTPBLDL EQU   CVTMAP+92                                                05284000
CVTTPC   EQU   CVTMAP+88                                                05285000
CVTSVDCB EQU   CVTMAP+84                                                05286000
CVTBRET  EQU   CVTMAP+82                                                05287000
CVTEXIT  EQU   CVTMAP+80                                                05288000
CVT0FN00 EQU   CVTMAP+76                                                05289000
CVTDARA  EQU   CVTDAR+1                                                 05290000
CVTRSV07 EQU   CVTFLGS1                                                 05291000
CVTRSV06 EQU   CVTFLGS1                                                 05292000
CVTRSV05 EQU   CVTFLGS1                                                 05293000
CVTRSV04 EQU   CVTFLGS1                                                 05294000
CVTRSV03 EQU   CVTFLGS1                                                 05295000
CVTRSV02 EQU   CVTFLGS1                                                 05296000
CVTRSV01 EQU   CVTFLGS1                                                 05297000
CVTDMPLK EQU   CVTFLGS1                                                 05298000
CVTXITP  EQU   CVTMAP+68                                                05299000
CVTZDTAB EQU   CVTMAP+64                                                05300000
CVTMSLT  EQU   CVTMAP+60                                                05301000
CVTDATE  EQU   CVTMAP+56                                                05302000
CVTBTERM EQU   CVTMAP+52                                                05303000
CVTSYSAD EQU   CVTMAP+48                                                05304000
CVTXTLER EQU   CVTMAP+44                                                05305000
CVTILK2  EQU   CVTMAP+40                                                05306000
CVTILK1  EQU   CVTMAP+36                                                05307000
CVTPRLTV EQU   CVTMAP+32                                                05308000
CVTPCNVT EQU   CVTMAP+28                                                05309000
CVT0VL00 EQU   CVTMAP+24                                                05310000
CVTXAPG  EQU   CVTMAP+20                                                05311000
CVTBUF   EQU   CVTMAP+16                                                05312000
CVTJOB   EQU   CVTMAP+12                                                05313000
CVTLINK  EQU   CVTMAP+8                                                 05314000
CVT0EF00 EQU   CVTMAP+4                                                 05315000
CVTTCBP  EQU   CVTMAP                                                   05316000
CVT      EQU   CVTMAP                                                   05317000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      05318000
@RC00668 EQU   @RC00564                                                 05319000
@RC00650 EQU   @RC00564                                                 05320000
@RC00618 EQU   @RC00564                                                 05321000
@RF00780 EQU   GETFSB                                                   05322000
@RT00783 EQU   GETFSB                                                   05323000
@RT01140 EQU   ISTA0102                                                 05324000
@RC01077 EQU   @RC01076                                                 05325000
@RC00620 EQU   @RC00618                                                 05326000
@ENDDATA EQU   *                                                        05327000
         END   ISTZBFSC,(C'PLS0103',0603,78052)                         05328000
