         TITLE 'ISTZFMFA - VS2 LOCAL I/O SCHEDULER                     *00001000
                        '                                               00002000
ISTZFMFA CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZFMFA  78.107'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
* * * * * * * * * * * * * * * * *                                       00011000
* GENERATED CODE TO ENSURE THAT *                                       00012000
* THE COMMON ENTRY POINT IS     *                                       00013000
* IDENTIFIED                    *                                       00014000
ISTZFMFA CSECT                  *                                       00015000
         ENTRY ISTZFCFA         *                                       00016000
ISTZFCFA EQU   ISTZFMFA         *                                       00017000
* * * * * * * * * * * * * * * * *                                       00018000
*                                                                  0212 00019000
*/* TPZSAVE (7,12) BASE                                              */ 00020000
*                                                                  0212 00021000
*   DO;                                                            0212 00022000
*     DCL                                                          0213 00023000
*       GPR01F FIXED(31) REG(01);                                  0213 00024000
*     DCL                                                          0214 00025000
*       GPR01P PTR(31) REG(01);                                    0214 00026000
*     DCL                                                          0215 00027000
*       GPR12F FIXED(31) REG(12);                                  0215 00028000
*     DCL                                                          0216 00029000
*       GPR12P PTR(31) REG(12);                                    0216 00030000
*     DCL                                                          0217 00031000
*       GPR13F FIXED(31) REG(13);                                  0217 00032000
*     DCL                                                          0218 00033000
*       GPR13P PTR(31) REG(13);                                    0218 00034000
*     DCL                                                          0219 00035000
*       GPR14F FIXED(31) REG(14);                                  0219 00036000
*     DCL                                                          0220 00037000
*       GPR14P PTR(31) REG(14);                                    0220 00038000
*     RFY                                                          0221 00039000
*      (GPR01P,                                                    0221 00040000
*       GPR12P,                                                    0221 00041000
*       GPR13P,                                                    0221 00042000
*       GPR14P) RSTD;                                              0221 00043000
*     GEN(PRINT OFF);                                              0222 00044000
*                                                                  0222 00045000
         PRINT OFF                                                      00046000
*/* ATBUILD (ISTZSAVE)                                               */ 00047000
*                                                                  0223 00048000
*/* VS1, VS2 TPIOS SAVEAREA FORMAT */                              0223 00049000
*DCL  1  ISTZSAVE BDY(WORD) BASED,                                 0223 00050000
*        2   ZSAZSVBC PTR(31),         /* SAVEAREA BACK CHAIN        */ 00051000
*            3   ZSAZSVMS CHAR(1),     /* MODULE TRACE CODE          */ 00052000
*                4 ZSAZACTV BIT(1),    /* ACTIVE SAVE AREA FLAG      */ 00053000
*        2   ZSAZSVFC PTR(31),         /* SAVEAREA FORWARD CHAIN     */ 00054000
*        2   ZSAZSVRR PTR(31),         /* RETURN REGISTER            */ 00055000
*        2   ZSAZSVVR (6) PTR(31),    /* VARIABLE REGS (7-12) SVEAREA*/ 00056000
*        2   ZSAZTRAC CHAR(4);        /* EBCDIC NAME OF OWNER        */ 00057000
*/*                                                                0224 00058000
*THE FOLLOWING EQUATES SHOULD READ ''FIXED(8) CONSTANT(LENGTH(X))'',    00059000
*WHERE X IS THE NAME OF THE VARIABLE CONTROL BLOCK OR FIELD OF WHICH    00060000
*LENGTH IS THE VALUE BEING EQUATED, SHOULD THE PLS COMPILER BE     0224 00061000
*BE ABLE TO TAKE IT.                                               0224 00062000
*                                                                    */ 00063000
*DCL ZSAZSVVA FIXED(8) CONSTANT(8);  /* DISPLACEMENT TO VARIABLE REGS*/ 00064000
*DCL ZSAZSVSZ FIXED(8) CONSTANT(40); /* LENGTH OF ISTZSAVE           */ 00065000
*                                                                  0226 00066000
*/* END OF ATBUILD                                                   */ 00067000
*                                                                  0226 00068000
*     GEN(PRINT ON);                                               0226 00069000
         PRINT ON                                                       00070000
*     RFY                                                          0227 00071000
*       ISTZSAVE BASED(GPR13P);                                    0227 00072000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0228 00073000
         STM   7,12,ZSAZSVVR+0(13)                                      00074000
*     GEN SETS(GPR12P);                                            0229 00075000
         BALR  GPR12P,0                                                 00076000
@TSTART  DS    0H                                                       00077000
         USING @TSTART,GPR12P                                           00078000
*     RFY                                                          0230 00079000
*      (GPR01P) UNRSTD;                                            0230 00080000
*   END;                                                           0231 00081000
*                                                                  0231 00082000
*/* END TPZSAVE                                                      */ 00083000
*                                                                  0232 00084000
*                                   /* SAVE REGS IN ISTZFSAV @ZM32243*/ 00085000
*                                                                  0232 00086000
*   /*****************************************************************/ 00087000
*   /*                                                               */ 00088000
*   /* CLEAR IOSB FLAGS                                      @ZM32243*/ 00089000
*   /*                                                               */ 00090000
*   /*****************************************************************/ 00091000
*                                                                  0232 00092000
*   IOSFLA=OFF;                     /* CLEAR IOSB FLAGS              */ 00093000
         LA    @15,412                                             0232 00094000
         ALR   @15,R03                                             0232 00095000
         MVI   IOSFLA(@15),B'00000000'                             0232 00096000
*   IOSFLB=OFF;                                                    0233 00097000
         MVI   IOSFLB(@15),B'00000000'                             0233 00098000
*   IOSFLC=OFF;                                                    0234 00099000
         MVI   IOSFLC(@15),B'00000000'                             0234 00100000
*   IOSAPR=OFF;                                                    0235 00101000
         NI    IOSAPR(@15),B'11111101'                             0235 00102000
*   IOSAPMSK=OFF;                                                  0236 00103000
         MVI   IOSAPMSK+1(@15),X'00'                               0236 00104000
         MVI   IOSAPMSK(@15),B'00000000'                           0236 00105000
*   IOSERP=OFF;                                                    0237 00106000
         SLR   @11,@11                                             0237 00107000
         ST    @11,IOSERP(,@15)                                    0237 00108000
*   IOSIPIB=OFF;                                                   0238 00109000
*                                                                  0238 00110000
         ST    @11,IOSIPIB(,@15)                                   0238 00111000
*   /*****************************************************************/ 00112000
*   /*                                                               */ 00113000
*   /* IF ONE OF UCBFLA FLAGS ON, UCB LOCK MUST BE RELEASED OR IOS   */ 00114000
*   /* WILL GET LOWER LEVEL LOCK, AND LATER A LOCK VIOLATION @ZM32911*/ 00115000
*   /*                                                               */ 00116000
*   /*****************************************************************/ 00117000
*                                                                  0239 00118000
*   IF UCBBSY=ON|                   /* IF DEVICE BUSY OR     @ZM32911*/ 00119000
*       UCBNRY=ON|                  /* DEVICE NOT READY OR   @ZM32911*/ 00120000
*       UCBPST=ON|                  /* POST FLAG ON OR       @ZM32911*/ 00121000
*       UCBPSNS=ON|                 /* PENDING SENSE OP OR   @ZM32911*/ 00122000
*       UCBCUB=ON|                  /* CONTROL UNIT BUSY OR  @ZM32911*/ 00123000
*       UCBSAP=ON|                  /* STD. ALONE PROC ON DEVICE OR     00124000
*                                                            @ZM32911*/ 00125000
*       UCBACTV=ON|                 /* CHAN. PROG ACTIVE ON DEVICE OR   00126000
*                                                            @ZM32911*/ 00127000
*       UCBQISCE=ON THEN            /* DEVICE QUIESCED       @ZM32911*/ 00128000
         L     @15,IOSUCB(,@15)                                    0239 00129000
         TM    UCBBSY(@15),B'11111111'                             0239 00130000
         BZ    @RF00239                                            0239 00131000
*     DO;                           /*                       @ZA26038*/ 00132000
*/*  ADD STATEMENTS TO SAVE THIS MODULE BASE REG.    MOVE  CALLERS   */ 00133000
*/*  REGS FROM THE SAVE AREA USED BY TPZSAVE TO A SAVE AREA IN LDNCB.*/ 00134000
*/*  TPZLOCK CAN NOW USE THAT SAVEAREA POINTED TO BY R13.    @ZA26038*/ 00135000
*                                                                  0241 00136000
*       R00=R12;                    /* SAVE BASE REG         @ZA26038*/ 00137000
         LR    R00,R12                                             0241 00138000
*       GEN CODE(LM  7,12,ZSAZSVVR+0(13))                          0242 00139000
*       REFS(ZSAZSVVR);                                            0242 00140000
         LM  7,12,ZSAZSVVR+0(13)                                        00141000
*       GEN CODE(STM   7,12,LDNZS1VR+0(3))                         0243 00142000
*       SETS(LDNZS1VR);                                            0243 00143000
         STM   7,12,LDNZS1VR+0(3)                                       00144000
*       R12=R00;                    /* RESTORE BASE REG      @ZA26038*/ 00145000
         LR    R12,R00                                             0244 00146000
*/*TPZLOCK  (RELEASE,(LDNCB,EFBAEMTA(FFEALOCK)),VTAM)   TYNCB(LDNCB) */ 00147000
*                                                                  0245 00148000
*       DO;                                                        0245 00149000
*                                                                  0245 00150000
*/* ATBUILD (ISTZFSAV,ISTZ19SV)                                      */ 00151000
*/* END OF ATBUILD                                                   */ 00152000
*                                                                  0246 00153000
*         DCL                                                      0246 00154000
*           GPR02F FIXED(31) REG(02);                              0246 00155000
*         DCL                                                      0247 00156000
*           GPR02P PTR(31) REG(02);                                0247 00157000
*         DCL                                                      0248 00158000
*           GPR03F FIXED(31) REG(03);                              0248 00159000
*         DCL                                                      0249 00160000
*           GPR03P PTR(31) REG(03);                                0249 00161000
*         DCL                                                      0250 00162000
*           GPR09F FIXED(31) REG(09);                              0250 00163000
*         DCL                                                      0251 00164000
*           GPR09P PTR(31) REG(09);                                0251 00165000
*         DCL                                                      0252 00166000
*           GPR10F FIXED(31) REG(10);                              0252 00167000
*         DCL                                                      0253 00168000
*           GPR10P PTR(31) REG(10);                                0253 00169000
*         DCL                                                      0254 00170000
*           GPR11F FIXED(31) REG(11);                              0254 00171000
*         DCL                                                      0255 00172000
*           GPR11P PTR(31) REG(11);                                0255 00173000
*         DCL                                                      0256 00174000
*           GPR15F FIXED(31) REG(15);                              0256 00175000
*         DCL                                                      0257 00176000
*           GPR15P PTR(31) REG(15);                                0257 00177000
*         RFY                                                      0258 00178000
*          (GPR01P,                                                0258 00179000
*           GPR02P,                                                0258 00180000
*           GPR03P,                                                0258 00181000
*           GPR09P,                                                0258 00182000
*           GPR10P,                                                0258 00183000
*           GPR11P,                                                0258 00184000
*           GPR15P) RSTD;                                          0258 00185000
*         GEN SETS(ZSAFSVVR)(STM   9,14,ZSAFSVVR+0(13));/* SAVE REGS */ 00186000
         STM   9,14,ZSAFSVVR+0(13)                                      00187000
*         GPR09P=GPR13P;            /* SAVE SAVEAREA PTR ACROSS    0260 00188000
*                                      MACROS                        */ 00189000
         LR    GPR09P,GPR13P                                       0260 00190000
*         GPR09P->ZSAFSVR2=GPR02P;  /* SAVE R2 ACROSS MODE SETS      */ 00191000
         ST    GPR02P,ZSAFSVR2(,GPR09P)                            0261 00192000
*         GEN(MODESET EXTKEY=ZERO,SAVEKEY=(2));                    0262 00193000
*                                                                  0262 00194000
         MODESET EXTKEY=ZERO,SAVEKEY=(2)                                00195000
*         /***********************************************************/ 00196000
*         /*                                                         */ 00197000
*         /* MODE SET TO KEY ZERO                                    */ 00198000
*         /*                                                         */ 00199000
*         /***********************************************************/ 00200000
*                                                                  0263 00201000
*         GEN REFS(GPR13P,GPR14P,PSACSTK,FRRSCURR,FRRS,FRRSEMP,FRRSELEN 00202000
*             ,PSA);                                               0263 00203000
         SETFRR D,WRKREGS=(GPR13P,GPR14P)                               00204000
*         IF GPR09P->ZSAFSV19->ZSAFLOCK='1'B/* CHECK OWNRSHIP FLG    */ 00205000
*           THEN                                                   0264 00206000
         L     @08,ZSAFSV19(,GPR09P)                               0264 00207000
         TM    ZSAFLOCK(@08),B'10000000'                           0264 00208000
         BNO   @RF00264                                            0264 00209000
*           DO;                     /* UCB LOCK OWNED - RELEASE IT   */ 00210000
*             GPR11P=LDNZLOCK;      /* GET UCBLOCK FROM LDNCB        */ 00211000
         L     GPR11P,LDNZLOCK(,R03)                               0266 00212000
*             GEN REFS(GPR11P,PSALITA,FLC);                        0267 00213000
         SETLOCK RELEASE,TYPE=IOSUCB,ADDR=(11),                        *00214000
               RELATED=(LDNCB,EFBAEMTA(FFEALOCK))                       00215000
*             GPR09P->ZSAFSV19->ZSAFLOCK='0'B;/* RESET OWNERSHIP FLAG*/ 00216000
         L     @08,ZSAFSV19(,GPR09P)                               0268 00217000
         NI    ZSAFLOCK(@08),B'01111111'                           0268 00218000
*           END;                    /* END RELEASE LOCK              */ 00219000
*         ELSE                                                     0270 00220000
*           ;                       /* LOCK NOT OWNED                */ 00221000
@RF00264 DS    0H                                                  0271 00222000
*         GEN(MODESET KEYADDR=(2)); /* RESTORE KEY FROM REG 2        */ 00223000
         MODESET KEYADDR=(2)                                            00224000
*         GPR02P=GPR09P->ZSAFSVR2;  /* RESTORE REG 2                 */ 00225000
         L     GPR02P,ZSAFSVR2(,GPR09P)                            0272 00226000
*         GEN REFS(ZSAFSVVR)(LM    9,14,ZSAFSVVR+0(9));/* RESTORE    */ 00227000
         LM    9,14,ZSAFSVVR+0(9)                                       00228000
*         RFY                                                      0274 00229000
*          (GPR01P,                                                0274 00230000
*           GPR02P,                                                0274 00231000
*           GPR03P,                                                0274 00232000
*           GPR09P,                                                0274 00233000
*           GPR10P,                                                0274 00234000
*           GPR11P,                                                0274 00235000
*           GPR15P) UNRSTD;                                        0274 00236000
*       END;                        /* *** END TPZLOCK *** RELEASE 0275 00237000
*                                      UCB LOCK              @ZM31972*/ 00238000
*                                                                  0275 00239000
*       /*************************************************************/ 00240000
*       /*                                                           */ 00241000
*       /* ADD CODE TO RESTORE CALLERS REGS TO THE SAVE      @ZA26038*/ 00242000
*       /* AREA INITIALLY USED BY TPZSAVE SO THAT TPZRETN    @ZA26038*/ 00243000
*       /* WILL PICK UP THE CORRECT REGS.                    @ZA26038*/ 00244000
*       /*                                                           */ 00245000
*       /*************************************************************/ 00246000
*                                                                  0276 00247000
*       R00=R12;                    /* SAVE BASE REG         @ZA26038*/ 00248000
         LR    R00,R12                                             0276 00249000
*       GEN CODE(LM  7,12,LDNZS1VR+0(3))                           0277 00250000
*       REFS(LDNZS1VR);                                            0277 00251000
         LM  7,12,LDNZS1VR+0(3)                                         00252000
*       GEN CODE(STM   7,12,ZSAZSVVR+0(13))                        0278 00253000
*       REFS(ZSAZSVVR);                                            0278 00254000
         STM   7,12,ZSAZSVVR+0(13)                                      00255000
*       R12=R00;                    /* RESTORE BASE REG      @ZA26038*/ 00256000
         LR    R12,R00                                             0279 00257000
*     END;                          /* END DEVICE BUSY ON    @ZA26038*/ 00258000
*   ELSE                                                           0281 00259000
*     ;                             /* CONTINUE              @ZM31972*/ 00260000
*                                                                  0281 00261000
@RF00239 DS    0H                                                  0282 00262000
*   /*****************************************************************/ 00263000
*   /*                                                               */ 00264000
*   /* ONLY R13 IS RETAINED THROUGH STARTIO. THEREFORE, SAVE ALL     */ 00265000
*   /* REGISTERS BEFORE ISSUING STARTIO. ALSO, CHANGE TO SUPERVISOR  */ 00266000
*   /* KEY.                                                  @ZM32243*/ 00267000
*   /*                                                               */ 00268000
*   /*****************************************************************/ 00269000
*                                                                  0282 00270000
*/*  FOLLOWING CODE RESULT OF VS32243                     @ZM32243   */ 00271000
*                                                                  0282 00272000
*   GEN SETS(R02,R08,R13,ZSAF19IO) REFS(R02,R00,R15,R08,R13,ZSAFSV19);  00273000
         MODESET EXTKEY=ZERO,SAVEKEY=(2)    SET PSW KEY TO ZERO         00274000
*                                           SAVES ORIGINAL KEY IN R2    00275000
         LR    R08,R13              SAVE PTR TO CHAINED SAVE AREA       00276000
         L     R13,ZSAFSV19(R13)    POINT TO 16 WORD SAVE AREA          00277000
         STM   R00,R15,ZSAF19IO(R13) SAVE ALL REGS BEFORE DESTUCTION    00278000
*   R01=ADDR(LDNSRB);               /* GET LDNSRB ADDRESS            */ 00279000
         LA    R01,LDNSRB(,R03)                                    0283 00280000
*   GEN REFS(CVTIXAVL,IOCSTIO,CVTMAP,IOCOM,R00,R15,R13,R0,ZSAF19IO);    00281000
         STARTIO SRB=(R01)         START I/O                            00282000
         LM    R00,R15,ZSAF19IO(R13) RESTORE ALL REGS                   00283000
         LR    R13,R08               RESTORE CHAINED SA POINTER         00284000
         MODESET KEYADDR=(2),WORKREG=2  RESTORE ORIGINAL PSW KEY        00285000
         STOSM 36(R13),3  ENABLE FOR I/O AND EXTERNAL INTERRUPTS        00286000
*   DO;                             /* LISATCVT                    0285 00287000
*                                      CVTBASE(PAGEABLE,(R02))       */ 00288000
*     RFY                                                          0286 00289000
*       ISTDYPAB;                                                  0286 00290000
*     RFY                                                          0287 00291000
*       ISTATCVT;                                                  0287 00292000
*     R02=ATCLCPTR;                 /* SET UP ATCVT POINTER          */ 00293000
         L     R02,ATCLCPTR                                        0288 00294000
*   END;                            /* LISATCVT RESTORE ATCVT POINTER   00295000
*                                                            @ZM32243*/ 00296000
*   ZSAFLOCK='0'B;                  /* UCB LOCK WAS RELEASED BY IOS,    00297000
*                                      SO TURN OFF OWNERSHIP FLAG  0290 00298000
*                                                            @ZM32243*/ 00299000
         L     @15,ZSAFSV19(,R13)                                  0290 00300000
         NI    ZSAFLOCK(@15),B'01111111'                           0290 00301000
*/* TPZRETN                                                          */ 00302000
*                                                                  0291 00303000
*   DO;                                                            0291 00304000
*     DCL                                                          0292 00305000
*       GPR07F FIXED(31) REG(07);                                  0292 00306000
*     DCL                                                          0293 00307000
*       GPR07P PTR(31) REG(07);                                    0293 00308000
*     RFY                                                          0294 00309000
*      (GPR07P,                                                    0294 00310000
*       GPR15P) RSTD;                                              0294 00311000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0295 00312000
         LM    7,12,ZSAZSVVR+0(13)                                      00313000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0296 00314000
         BR    GPR14P                                                   00315000
*     RFY                                                          0297 00316000
*      (GPR07P,                                                    0297 00317000
*       GPR15P) UNRSTD;                                            0297 00318000
*   END;                                                           0298 00319000
*                                                                  0298 00320000
*/* END TPZRETN                                                      */ 00321000
*                                                                  0299 00322000
*                                   /* RESTORE 7-12 AND RETURN     0299 00323000
*                                                            @ZM32243*/ 00324000
*/* TPEPILOG                                                         */ 00325000
*                                                                  0299 00326000
*   GEN(PRINT OFF);                                                0299 00327000
         PRINT OFF                                                      00328000
*              /* DYNAMIC PAB 1K633 */                             0300 00329000
* /* 1K0997 JAN 20, 1973  MB   */                                  0300 00330000
* /* 1K1142 MAR 03, 1973  MB   */                                  0300 00331000
* DCL 1 ISTDYPAB BDY(DWORD) BASED, /* LEVEL 1 DECLARE 1K633 */     0300 00332000
*       2  DYPTYPE CHAR(1), /* CONTROL BLOCK TYPE CODE 1K633 */    0300 00333000
*       2  DYPLNGTH PTR(8), /* CONTROL BLOCK LENGTH (BYTES)  1K633 */   00334000
*       2 DYPFLGS CHAR(2),     /* FLAGS 1K633 */                   0300 00335000
*       2 DYPCHAIN PTR(31),    /* CHAIN POINTER 1K633 */           0300 00336000
*       2 DYPTSKID PTR(31),    /* TASKID OR PTR TO PSS TABLES 1K633 */  00337000
*       2  DYPRSV01 PTR(31),   /* RESERVED TO PRESERVE ALIGNMENT   0300 00338000
*                                                             1K0997 */ 00339000
*       2 DYPPAB CHAR(LENGTH(ISTPAB)) BDY(DWORD); /* LENGTH OF 1K0997   00340000
*                                                    PAB         */     00341000
*DCL DYTYP   BIT(8) CONSTANT ('11'X);   /* TYPE           1K1142 */     00342000
*/*  REVISIONS                                             03/04/77   * 00343000
*DCL ATCLCPTR PTR LOCATION(1032);      /* POINTER TO ATCVT            * 00344000
*DCL  1  ISTATCVT BDY(DWORD) BASED,                                0303 00345000
*        2  ATCCOM BDY(WORD),          /* SYSTEM INDEPENDENT FIELDS   * 00346000
*           3  ATCSTAT CHAR(4),        /* VTAM  STATUS INDICATORS     * 00347000
*              4  ATCSTAT1 CHAR(1),    /* VTAM  STATUS BYTE 1         * 00348000
*                 5  ATCSTART BIT(1),  /* VTAM  IS STARTING           * 00349000
*                 5  ATCACTIV BIT(1),  /* VTAM  IS ACTIVE             * 00350000
*                 5  ATCSNHLT BIT(1),  /* VTAM  SESSION HALT          * 00351000
*                 5  ATCQKHLT BIT(1),  /* VTAM  QUICK HALT            * 00352000
*                 5  ATCNETSL BIT(1),  /* NETSOL=YES SPECIFIED ON CMD * 00353000
*                 5  ATCINHLT BIT(1),  /* INTERNAL VTAM HALT QUICK    * 00354000
*                 5  ATCMDHLT BIT(1),  /* VTAM CMD PROC HALTED        * 00355000
*                 5 * BIT(1),          /* RESERVED                    * 00356000
*              4  ATCSTFLG BIT(8),     /* STORAGE MANAGEMENT FLAGS    * 00357000
*                 5  ATCHSDMF BIT(1),  /* SYSTEM SLOW DOWN FLAG       * 00358000
*              4  ATCPOFLG BIT(8),     /* PROGRAM OPERATOR            * 00359000
*                                      /* INTERFACE FLAGS             * 00360000
*                 5 ATCPOUNS BIT(1),   /* APPLICATION AUTHORIZED TO   * 00361000
*                                      /* RECEIVE UNSOLICITED MESSAGES* 00362000
*                                      /* 1 = YES                     * 00363000
*                 5 *        BIT(7),   /* RESERVED                    * 00364000
*              4  ATCSTAT4 CHAR(1),    /* VTAM  STATUS BYTE 4         * 00365000
*                 5  ATCPRTAT BIT(1),  /* 1 = TRACE PRINT ACTIVE,  0303 00366000
*                                         0 = NOT ACTIVE              * 00367000
*                 5  ATCTPRT BIT(1),   /* WHEN 1, TPRINT IN PROCESS   * 00368000
*                 5  ATCMTST BIT(1),   /* WHEN 1, MODIFY TEST IN   0303 00369000
*                                         PROCESS                     * 00370000
*                 5  ATCNCSD BIT(1),   /* NCS QUIESCED DURING HALT    * 00371000
*                 5  ATCVTTRC BIT(1),  /* VTAM TRACE, 1=ACTIVE        * 00372000
*                 5  ATCRSV04 BIT(3),  /* RESERVED                    * 00373000
*           3  ATCAPI PTR(31),         /* ADDR OF API ROUTINE         * 00374000
*           3  ATCDCFRR PTR(31),       /* POINTER TO FRR OF CONTROL     00375000
*                                         LAYER,INITIALIZED BY OPENDST* 00376000
*           3  ATCRDT PTR(31),         /* POINTER TO FIRST RDT        * 00377000
*           3  ATCSRT PTR(31),         /* POINTER TO SRT DIRECTORY    * 00378000
*           3  ATCASCHD PTR(31),       /* POINTER TO AP SCHEDULER     * 00379000
*           3  ATCECMOD CHAR(4),       /* ECB FOR MODIFY COMMAND PROC.* 00380000
*           3  ATCMODQ PTR(31),        /* POINTER FOR OUTPUT QUEUE    * 00381000
*                                      /* FOR MODIFY COMMAND          * 00382000
*           3  ATCECHLT CHAR(4),       /* ECB FOR HALT COMMAND        * 00383000
*           3  ATCHALTQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 00384000
*                                      /* FOR HALT COMMAND            * 00385000
*           3  ATCECVRY CHAR(4),       /* ECB FOR VARY COMMAND PROC.  * 00386000
*           3  ATCVARYQ PTR(31),       /* POINTER TO OUTPUT QUEUE     * 00387000
*                                      /* FOR VARY COMMAND            * 00388000
*           3  ATCECDSP CHAR(4),       /* ECB FOR DISPLAY COMMAND     * 00389000
*           3  ATCDSPLQ PTR(31),       /*  POINTER TO OUTPUT QUEUE    * 00390000
*                                      /* FOR DISPLAY COMMAND         * 00391000
*           3  ATCOCHA PTR(31),        /* POINTER TO OCT HEADER       * 00392000
*           3  ATCECSES CHAR(4),       /* ECB TO HALT SESSION MODE    * 00393000
*           3  ATCECVRQ CHAR(4),       /* ERP ECB FOR VARY REQ. INFO. * 00394000
*                                      /* REQUEST NOTIFICATION        * 00395000
*           3  ATCVPARM PTR(31),       /* ADDR OF VARY PARAMETERS     * 00396000
*           3  ATCECOPC CHAR(4),       /* ECB TOINDICATE OPERATOR     * 00397000
*                                      /* CONTROL PROCESSING COMPLETE * 00398000
*           3  ATCECNET CHAR(4),       /* ERP ECB FOR NETWORK         * 00399000
*                                      /* CONFIGURATION REQUEST       * 00400000
*           3  ATCECPRM PTR(31),       /* POINTER TO QAB FOR ERP'S    * 00401000
*                                      /* ECB PARAMETERS              * 00402000
*           3  ATCHLTMS PTR(31),       /* POINTER TO HALT COMMAND     * 00403000
*                                      /* OR HALT RETURN MESSAGE      * 00404000
*           3  ATCFSB PTR(31),         /* PTR TO FEEDBACK STATUS      * 00405000
*                                      /* BLOCK                       * 00406000
*           3  ATCFRSCH PTR(31),       /* POINTER TO FEEDBACK         * 00407000
*                                      /* ROUTINE SCHEDULER           * 00408000
*           3  ATCRDTH PTR(31),        /*  POINTER RDT HEADER         * 00409000
*           3  ATCACCTA PTR(31),       /* POINTER TO INSTALLATION     * 00410000
*                                      /* ACCOUNTING ROUTINE          * 00411000
*           3  ATCAUTHA PTR(31),       /* POINTER TO INSTALLATION     * 00412000
*                                      /* AUTHORISATION ROUTINE       * 00413000
*           3  ATCPTCHA PTR(31),       /* PTR TO VTAM PATCH AREA      * 00414000
*           3  ATCCONFT PTR(31),       /* POINTER TO VTAM             * 00415000
*                                      /* CONFIGURATION TABLE         * 00416000
*           3  ATCFDVT PTR(31),        /* PTR TO FIRST DVT FOR O/C    * 00417000
*           3  ATCFEPT PTR(31),        /* PTR TO FIRST EPT FOR O/C    * 00418000
*           3  ATCDVTPT PTR(31),       /* ADDR OF LOAD MOD FOR        * 00419000
*                                      /* TYPE=VTAM TRACING           * 00420000
*           3  ATCBPDA PTR(31),        /* PTR TO BUFFER POOL DIRECTORY* 00421000
*           3  ATCADD PTR(31),         /* POINTER TO ADD PROCEDURE    * 00422000
*           3  ATCREMOV PTR(31),       /* POINTER TO REMOVE PROCEDURE * 00423000
*           3  ATCIOTRC PTR(31),       /*  POINTER TO I/O TRACE       * 00424000
*                                      /* PROCEDURE                   * 00425000
*              4 ATCTHTRC PTR(31),     /* ADDR OF TH TRACE ROUTINE    * 00426000
*                5 ATCTPBUF PTR(31),   /* TPIOS BUFFER TRACE(ISTRARTP)* 00427000
*           3  ATCBFTRC PTR(31),       /* PTR TO BUFFER TRACE         * 00428000
*                                      /* PROCEDURE                   * 00429000
*           3  ATCFBRPH PTR(31),       /* ADDR OF FEEDBACK PROC RPH   * 00430000
*           3  ATCBLDLA PTR(31),       /* ADDR OF BLDL ROUTINE        * 00431000
*           3  ATCALOAD PTR(31),       /* ADDR OF ALOAD ROUTINE       * 00432000
*           3  ATCREADA PTR(31),       /* ADDR OF SOURCE READ ROUTINE * 00433000
*           3  ATCGTSTR PTR(31),       /* ADDR OF GETSTOR ROUTINE     * 00434000
*           3  ATCFRSTR PTR(31),       /* ADDR OF FREESTOR ROUTINE    * 00435000
*           3  ATCSTMA PTR(31),        /* ADDR OF SM INITIALIZATION   * 00436000
*                                      /* ROUTINE                     * 00437000
*           3  ATCACDA PTR(31),        /* ADDR OF FIRST ACDEB         * 00438000
*           3  ATCSMRQ PTR(31),        /* ADDR OF REQUEST STORAGE     * 00439000
*                                      /* ROUTINE                     * 00440000
*           3  ATCSMQU PTR(31),        /* ADDR OF QUEUE REQUEST RTNE    00441000
*                                         - DOS ONLY                  * 00442000
*           3  ATCSMRS PTR(31),        /* ADDR OF RELEASE STORAGE     * 00443000
*                                      /* ROUTINE                     * 00444000
*           3  ATCSMRC PTR(31),        /* ADDR OF RECOVER STORAGE     * 00445000
*                                      /* ROUTINE  - DOS ONLY         * 00446000
*           3  ATCSMBQ PTR(31),        /* PTR TO Q'ED REQ. SMS RTN.   * 00447000
*           3  ATCFIRA PTR(31),        /* ADDR OF FEEDBACK INITIATION * 00448000
*                                      /* RPH                         * 00449000
*           3  ATCSRTAD PTR(31),       /* PTR TO SRTADD ROUTINE       * 00450000
*           3  ATCSRTDF PTR(31),       /* PTR TO SRTDELE ROUTN        * 00451000
*           3  ATCDCC60 PTR(31),       /* PTR TO ISTDCC60 - CTL. LAYER  00452000
*                                         MOVE TO USER AREA           * 00453000
*           3  ATCDCC61 PTR(31),       /* PTR TO ISTDCC61 - CTL. LAYER  00454000
*                                         MOVE FIXED TO PAGABLE       * 00455000
*/*  BEGIN 'ANY' DVT                                                  * 00456000
*           3  ATCNERST PTR(31),       /* PTR TO ISTDCC00 - REQUEST-ST* 00457000
*           3  ATCNERCV PTR(31),       /* PTR TO ISTRCC21-RECEIVE OB  * 00458000
*           3  ATCNERNE PTR(31),      /* PTR TO ISTDCC25 - READ-ANY   * 00459000
*           3  ATCNERFN PTR(31),      /* PTR TO ISTDCC02 - REQUEST-FN * 00460000
*/*  END 'ANY' DVT                                                    * 00461000
*           3  ATCAPOST PTR(31),      /* PTR TO VTAM  POST ROUTINE    * 00462000
*           3  ATCVTMID CHAR(2),      /* HOST MAJOR NODE I.D.         * 00463000
*           3  ATCRSV11 CHAR(2),      /* RESERVED                     * 00464000
*           3 ATCRCC63 PTR(31),  /* HSKPANYQ POINTER                  * 00465000
*           3 ATCRCC26 PTR(31),  /* SEND RESPONSE POINTER             * 00466000
*           3 ATCRCC65 PTR(31),  /* SET RPL POINTER                   * 00467000
*           3  ATCNESAL PTR(31),      /* PTR TO ISTDCC24 - SOLICIT-ALL* 00468000
*           3  ATCNERAP PTR(31),       /* PTR TO ISTDCC85 - READ ANY    00469000
*                                         PURGE                       * 00470000
*           3 ATCACTRM FIXED(15),     /* COUNT OF ACTIVE TERMINALS    * 00471000
*           3 ATCCIDM BIT(16),        /* CID MASK                     * 00472000
*           3 ATCMSGSP BIT(8), /* RESERVED FOR MESAGE SURPRESSION     * 00473000
*         2 ATCMAXID PTR(8),   /* MAXIMUM NUMBER OF MAJOR NODES, 0 =    00474000
*                                 NUMBER OF ENTRIES IN THE MNT        * 00475000
*         2 ATCRSV16 CHAR(2),  /* NOT USED                            * 00476000
*         2 ATCMNT PTR(31),    /*PTR TO MAJOR NODE TABLE -SET BY SYS.   00477000
*                                DEF. REF. BY ISTSDCCB (CBDEF),    0303 00478000
*                                ISTSDCCI (CINDEXY)                   * 00479000
*         2 ATCCDADD PTR(31),  /*PTR TO CIDADD ROUTINE ISTSDCCA    0303 00480000
*                                 REF. BY CIDCTL MACRO                * 00481000
*         2 ATCCDDEL PTR(31),  /*PTR TO CIDDEL ROUTINE ISTSDCCD    0303 00482000
*                                 REF. BY CIDCTL MACRO                * 00483000
*         2 ATCCDFND PTR(31),  /*PTR TO CIDFND ROUTINE IATSDCCF    0303 00484000
*                                 REF. BY CIDCTL MACRO                * 00485000
*         2 ATCESC01 PTR(31),  /*PTR TO ESC01                         * 00486000
*         2 ATCESC02 PTR(31),  /*PTR TO ESC02                         * 00487000
*         2 ATCCSMR PTR(31),        /* PTR TO CONNECTION SERVICES     * 00488000
*                                   /*  MASTER ROUTINE                * 00489000
*           3 ATCCSMA PTR(31),      /* PTR TO CONNECTION SERVICES  0303 00490000
*                                      MASTER ROUTINE                 * 00491000
*         2 ATCOCRT PTR(31),        /* PTR TO OPEN/CLOSE ROUTINE      * 00492000
*         2 ATCUEP  PTR(31),        /* POINTER TO USER EXIT           * 00493000
*         2 ATCSHRTN CHAR(8),       /* NAME OF VTAM  SHARED RTN       * 00494000
*                                   /*  TO BE LOADED                  * 00495000
*         2 ATCSHRFG BIT(8),        /* ATTRIBUTE FLAGS                * 00496000
*           3 ATCLAST BIT(1),       /* INDICATE HTIS IS LAST MODULE   * 00497000
*         2 ATCXRANG CHAR(1),       /* NUMBER OT BITS IN X-VALUE   0303 00498000
*                                       PORTION   OF CID              * 00499000
*         2 ATCSAF   CHAR(2),       /* SUB AREA ADDRESS FIELD         * 00500000
*         2 ATCEPA PTR(31),         /* ENTRY POINT ADDR OF LOADED     * 00501000
*         2 ATCALERT PTR(31),       /* POINTER TO ALERT-ROUTINE    0303 00502000
*                                      ISTSDCAL                       * 00503000
*         2 ATCDVLOD PTR(31),       /* PTR TO ISTSDCOD                * 00504000
*         2 ATCTRCPT PTR(31),       /* POINTER TO TRACE PARM LIST     * 00505000
*         2 ATCDVT   PTR(31),       /* POINTER TO FIRST DVT ON CHAIN  * 00506000
*         2 ATCEPT   PTR(31),       /* POINTER TO FIRST EPT ON CHAIN  * 00507000
*         2 ATCMSGP PTR(31),        /* POINTER TO TPMSG PROCESSOR     * 00508000
*         2 ATCMSGM PTR(31),        /* POINTER TO TPMSG - MESSAGE  0303 00509000
*                                      CSECT                          * 00510000
*         2 ATCTRPAB  PTR(31),      /* ADDRESS OF TRACE WRITER PAB    * 00511000
*         2 ATCVTLOD PTR(31),       /* ADDR OF VTAM LOAD LIST         * 00512000
*         2 ATCECPRT CHAR(4),       /* ECB FOR TRACE FILE PRINT       * 00513000
*         2 ATCZDVTB PTR(31),       /* ADDRESS OF ISTZCFBI            * 00514000
*         2 ATCECTLP CHAR(4),       /* TOLTEP ECB                     * 00515000
*         2 ATCRVCHS CHAR(8),       /* RESERVED                       * 00516000
*         2 ATCCRME  PTR(31),       /* VARY PSS CONTROL MECHANISM     * 00517000
*         2 ATCHPGM,                /* BUFFER INFORMATION            */ 00518000
*           3 ATCHBFNO FIXED(15),   /* NUMBER OF BUFFS FOR CHANNEL   */ 00519000
*           3 ATCHBSIZ FIXED(15),   /* BUFFER SIZE IN BYTES          */ 00520000
*         2 ATCDEBCH PTR(31),       /* CLOSE DEB CHAIN PTR           */ 00521000
*         2 ATCTODVT PTR(31),       /* THE TOLTEP DVT PTR POINTED  0303 00522000
*                                      TO BY 3RD WORD OF PAB         */ 00523000
*         2 ATCADEL  PTR(31),       /* A DELETE ROUTINE ADDRESS      */ 00524000
*         2 ATCCDPTR PTR(31),       /* PTR TO ISTOCCCD - DOS ONLY    */ 00525000
*         2 ATCLDNCS PTR(31),       /* PTR TO NCSPL FOR LOAD/DUMP    */ 00526000
*         2 ATCLDECB BIT(32),       /* ECB FOR LOAD/DUMP SUBTASK     */ 00527000
*         2 ATCAPCR5 PTR(31),       /* POINTER TO ISTINCR5           */ 00528000
*         2 ATCRSV69 PTR(31),       /* RESERVED TO SYNCH WITH DOS    */ 00529000
*         2 ATCNODEL CHAR(8),       /* VSAM DATA SET NAME            */ 00530000
*         2 ATCNODDS PTR(31),       /* POINTER TO RPL                */ 00531000
*         2 ATCONFIG CHAR(8),       /* START VTAM CONFIG = PARAMETER */ 00532000
*         2 ATCRSV99 CHAR(4),       /* RESERVED FOR LATER POINTERS   */ 00533000
*         2 ATCAP33 PTR(31),        /* PTR TO ISTAPC33               */ 00534000
*         2 ATCAP35 PTR(31),        /* PTR TO ISTAPC35               */ 00535000
*         2 ATCAP36 PTR(31),        /* PTR TO ISTAPC36               */ 00536000
*         2 ATCDVTLK CHAR(LENGTH(ISTLOK)), /* LOCK WORD FOR DVT LOCK */ 00537000
*         2 ATCCDFIN PTR(31),       /* POINTER TO ISTSDCRR           */ 00538000
*         2 ATCCDFDN PTR(31),       /* POINTER TO ISTSDCCN           */ 00539000
*         2 ATCVOCLK CHAR(LENGTH(ISTLOK)), /* VOCLOCK LOCK           */ 00540000
*         2 ATCRDTLK CHAR(LENGTH(ISTLOK)), /* RDTLOCK LOCK           */ 00541000
*         2 ATCRSV97 PTR(31),              /* DWORD ALIGNMENT        */ 00542000
*         2 ATCVPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR VARY 00543000
*                                           UNDER PSS CONTROL        */ 00544000
*         2 ATCPGPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* ERP PAB FOR  00545000
*                                      PURGE                         */ 00546000
*         2 ATCDLRPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* DUMP LOAD &  00547000
*                                           RESTART PAB              */ 00548000
*         2 ATCCCLAD PTR(31),       /* ADDRESS OF VARY ERP (ISTINCCL)*/ 00549000
*         2 ATCCDLAD PTR(31),       /* ADDRESS OF VARY DUMP,LD RSTRT    00550000
*                                      (ISTINCDL)                    */ 00551000
*         2 ATCOCCOB PTR(31),       /* ADDRESS ISTOCCOB              */ 00552000
*         2 ATCOCCCB PTR(31),       /* ADDRESS ISTOCCCB              */ 00553000
*         2 ATCTIPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0303 00554000
*                                           FOR ISTOLTP              */ 00555000
*         2 ATCTCIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0303 00556000
*                                           FOR TOLTEP CLIP          */ 00557000
*         2 ATCVTIPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB   0303 00558000
*                                           FOR TOLTEP-VTAM INTERFACE*/ 00559000
*         2 ATCTCLOM PTR(31),      /* ADDR TOLTEP CLOP PROC          */ 00560000
*         2 ATCTCLIM PTR(31),      /* ADDR TOLTEP CLIP PROC          */ 00561000
*         2 ATCVTINM PTR(31),      /* ADDR TOLTEP-VTAM INTF PROC     */ 00562000
*         2 ATCTACB  PTR(31),      /* TOLTEP ACB                     */ 00563000
*         2 ATCRSV10 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* RESERVED  */ 00564000
*         2 ATCPTR00 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* A PAB     */ 00565000
*         2 ATCCFEAD PTR(31),          /* ADDR OF ISTINCFE           */ 00566000
*         2 ATCVLCNT CHAR(4) BDY(HWORD), /* VARY DEVICE ONLINE COUNTS*/ 00567000
*           3 ATCRNCNT PTR(16),        /* 370X COUNT                 */ 00568000
*           3 ATCLCLCT PTR(16),        /* 3270 COUNT                 */ 00569000
*         2 ATCS49XI PTR(31),          /* ADDRESS OF ISTPICXI        */ 00570000
*         2 ATCS49XL PTR(31),          /* ADDRESS OF ISTPICXL        */ 00571000
*         2 ATCPODVT PTR(31),          /* PTR TO PROGRAM OPERATOR DVT*/ 00572000
*         2 ATCRNO,                                                0303 00573000
*           3 *        CHAR(1),                                    0303 00574000
*           3 ATCPOIA  PTR(24),        /* PTR TO PROGRAM OPERATOR    */ 00575000
*                                      /* INTERFACE AREA             */ 00576000
*         2 ATCSOPD CHAR(8) BDY(WORD), /* SESSION CONTROL            */ 00577000
*           3 ATCSEC01 PTR(31),        /* OUTBOUND PROCESSING        */ 00578000
*           3 ATCSEC10 PTR(31),        /* DVT                        */ 00579000
*         2 ATCSIPD CHAR(12) BDY(WORD),/* SESSION CONTROL            */ 00580000
*           3 ATCSEC21 PTR(31),        /* INBOUND PROCESSING         */ 00581000
*           3 ATCSEC30 PTR(31),        /* FEEDBACK                   */ 00582000
*           3 ATCSEC40 PTR(31),        /* DVT                        */ 00583000
*         2 ATCSECST CHAR(4) BDY(WORD),/* SESSION CONTROLSESS TERM   */ 00584000
*           3 ATCSEC51 PTR(31),        /* RECOVERY DVT               */ 00585000
*         2 ATCNMCTR FIXED(15),        /* NAME COUNTER               */ 00586000
*         2 ATCSTAT2 BIT(8),           /* TRACE FLAGS                */ 00587000
*           3 ATCTRAPI BIT(1),         /* API                        */ 00588000
*           3 ATCTRESC BIT(1),         /* ESC                        */ 00589000
*           3 ATCTRPSS BIT(1),         /* PSS                        */ 00590000
*           3 ATCTRLOK BIT(1),         /* LOCKS                      */ 00591000
*           3 ATCTRSMS BIT(1),         /* SMS                        */ 00592000
*           3 *        BIT(3),         /* RESERVED                   */ 00593000
*         2 *        BIT(8),           /* RESERVED                   */ 00594000
*         2 ATCSRTAB PTR(31),          /* SEARCH LOGON MODE TABLE    */ 00595000
*                                      /* RTN ADDRESS (ISTINCSH)     */ 00596000
*         2 ATCUSSPT PTR(31),          /* DEFAULT USS DEFINITION     */ 00597000
*                                      /* TABLE ADDRESS (ISTINCDT)   */ 00598000
*         2 ATCMODTB PTR(31),          /* DEFAULT SYSTEM LOGON MODE  */ 00599000
*                                      /* TABLE ADDRESS (ISTINCLM)   */ 00600000
*         2 ATCINCW3 PTR(31),          /* ADDRESS OF ISTINCW3        */ 00601000
*         2 ATCIOECB PTR(31),          /* ECB USED BY IOS -          */ 00602000
*                                      /* POINTED TO BY IOBECBPT     */ 00603000
* 2 ATCVDPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0303 00604000
*                                    /* SSCP COMMAND PROCESSING PAB  */ 00605000
* 2 ATCVFPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),                    0303 00606000
*                                    /* SSCP FRONT END PAB           */ 00607000
* 2 ATCVDLOK CHAR(LENGTH(ISTLOK)),   /* SSCP SERIALIZATION LOCK      */ 00608000
*/* END OF COMMON AREA                                               */ 00609000
*/* VS1/VS2 COMMON CODE.                                             */ 00610000
*        2  ATCVTBAM CHAR(4),                                      0303 00611000
*           3  *     CHAR(3),          /* RESERVED                    * 00612000
*           3  *     CHAR(1),          /* FLAGS                       * 00613000
*              4 ATCVTMAB BIT(1) ABNL, /* ABEND IN VTAM JOBSTEP       * 00614000
*              4 *        BIT(7),      /* RESERVED                    * 00615000
*        2  ATCAOSM BDY(DWORD),                                    0303 00616000
*/*                                                                   * 00617000
*           3  ATCSRBRT PTR(31),       /* POINTER TO ROUTINE UNDER    * 00618000
*                                      /* SRB CONTROL                 * 00619000
*           3  ATCGSRBQ PTR(31),       /* READY QUEUE FOR GLOBAL SRB'S* 00620000
*              4  ATCGSRBG BIT(8),     /* READY QUEUE GATE BYTE       * 00621000
*                 5  ATCGSRBF BIT(1),  /* READY QUEUE GATE BIT        * 00622000
*           3  ATCPRPH PTR(31),        /* PTR TO PREALLOCATED RPH     * 00623000
*           3  ATCCMTCB PTR(31),       /* PTR TO COMMUNICATIONS TASK  * 00624000
*                                      /* TCB                         * 00625000
*           3  ATCAP11 PTR(31),        /* PTR TO ISTAPC11             * 00626000
*           3  ATCAP12 PTR(31),        /* PTR TO ISTAPC12             * 00627000
*           3  ATCAP31 PTR(31),        /* PTR TO ISTAPC31             * 00628000
*           3  ATCAP32 PTR(31),        /* PTR TO ISTAPC32             * 00629000
*           3  ATCAP34 PTR(31),        /* PTR TO ISTAPC34             * 00630000
*           3  ATCAP52 PTR(31),        /* PTR TO ISTAPC52             * 00631000
*           3  ATCAP53 PTR(31),        /* PTR TO ISTAPC53             * 00632000
*           3  ATCAP54 PTR(31),        /* PTR TO ISTAPC54             * 00633000
*           3  ATCAP57 PTR(31),        /* PTR TO ISTAPC57             * 00634000
*           3  ATCAP58 PTR(31),        /* PTR TO ISTAPC58             * 00635000
*           3  ATCAP61 PTR(31),        /* PTR TO ISTAPC61             * 00636000
*           3  ATCAP63 PTR(31),        /* PTR TO ISTAPC63             * 00637000
*           3  ATCAP64 PTR(31),        /* PTR TO ISTAPC64             * 00638000
*           3  ATCZFSVT PTR(31),       /* TPIOS FIXED SRVICES VCTR TAB* 00639000
*           3  ATCZPSVT PTR(31),       /* TPIOS PAGBL SRVCES VCTR TABL* 00640000
*           3  ATCICNCB PTR(31),       /* HEAD OF ICNCB QUEUE         * 00641000
*           3  ATCZDVT1 PTR(31),       /* TPIOS SLODWN RECOVRY PRCSR  * 00642000
*           3  ATCZDVT3 PTR(31),       /* 370X FEEDBACK STAT CNTRL RTR* 00643000
*           3  ATCZDVT4 PTR(31),       /* OPERATOR MESSAGE SCHEDULER  * 00644000
*           3  ATCZDVT6 PTR(31),       /* DIALOGUE SCHEDULER (INBOUND)* 00645000
*           3  ATCAP65 PTR(31),        /* PTR TO ISTAPC65            */ 00646000
*           3  ATCICAPP CHAR(20) BDY(WORD), /* 3705 APPENDAGE VECTOR  * 00647000
*              4  ATCCDRPH PTR(31),    /* ADDR CLOSE DEB RPH       0303 00648000
*                                         (DUMMY EOA APP.)           */ 00649000
*              4  ATCZSIOA PTR(31),    /* ADDR 3705 SIO APPENDAGE    */ 00650000
*              4  ATCCDTCB PTR(31),    /* VTAM TCB (DUMMY PCI APP.)  */ 00651000
*              4  ATCZCEA PTR(31),     /* ADDR 3705 CHANNEL END    0303 00652000
*                                         APPENDAGE                  */ 00653000
*              4  ATCZAEA PTR(31),     /* ADDR 3705 CHANNEL END    0303 00654000
*                                         APPENDAGE                  */ 00655000
*           3  ATCLDAPP CHAR(20) BDY(WORD), /* LOCAL 3270 APPENDAGE     00656000
*                                         VECTOR                     */ 00657000
*              4  ATCCDTID PTR(31),    /* TASK ID OF VTAM          0303 00658000
*                                         (DUMP EOE)                 */ 00659000
*              4  ATCSMFRR PTR(31),    /* ADDR OF SMS FRR          0303 00660000
*                                         (DUMMY SIOA)               */ 00661000
*              4  ATCRSV17 PTR(31),    /* RESERVED FOR ALIGNMENT     */ 00662000
*              4  ATCZLCEA PTR(31),    /* ADDR 3270 CHANNEL END    0303 00663000
*                                         APPENDAGE                  */ 00664000
*              4  ATCZLAEA PTR(31),    /* ADDR 3270 CHANNEL END    0303 00665000
*                                         APPENDAGE                  */ 00666000
*           3  ATCDAPVT CHAR(24) BDY(WORD),  /* DUMMY APPENDAGE    0303 00667000
*                                         VECTOR TABLE FOR LOAD/DVMMY*/ 00668000
*              4  ATCDEOEA PTR(31),    /* ADDRESS OF DUMMY END     0303 00669000
*                                         OF EXTENT APPENDAGE        */ 00670000
*              4  ATCDSIOA PTR(31),    /* ADDRESS OF DUMMY END     0303 00671000
*                                         OF SIO APPENDAGE           */ 00672000
*              4  ATCDPCIA PTR(31),    /* ADDRESS OF DUMMY PCI     0303 00673000
*                                         APPENDAGE                  */ 00674000
*              4  ATCDCEA PTR(31),     /* ADDRESS OF CHANNEL END   0303 00675000
*                                         APPENDAGE                  */ 00676000
*              4  ATCDXCEA PTR(31),    /* ADDRESS OF ABNORMAL      0303 00677000
*                                         END APPENDAGE              */ 00678000
*              4  ATCDAPDG CHAR(2),    /* DUMMY APPENDAGE            */ 00679000
*              4  ATCRSV56 CHAR(2),    /* RESERVED                   */ 00680000
*           3  ATCZDVT7 PTR(31),       /* ADDR OF RESET CLEANUP    0303 00681000
*                                         (PHASE 1)                   * 00682000
*           3  ATCZDVT8 PTR(31),       /* 3270 LOCAL TEST AND CTL  0303 00683000
*                                         FEEDBACK ROUTER            */ 00684000
*           3  ATCZDVT9 PTR(31),       /* ADDRESS OF ISTZDFKA        */ 00685000
*           3  ATCZDVTA PTR(31),       /* ADDRESS OF ISTZCFIA        */ 00686000
*           3  ATCZDVTX PTR(31),       /* ADDRESS OF TRUNK LINE    0303 00687000
*                                         DEACTIVATE ROUTINE         */ 00688000
*           3  ATCZLPVT PTR(31),       /* ADDRESS OF ISTZPSVA        */ 00689000
*           3  ATCZLFVT PTR(31),       /* TPIOS 3270 LOCAL FIXED   0303 00690000
*                                         SERVICES VECTOR TABLE      */ 00691000
*           3  ATCZPAB1 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* PAB FOR   00692000
*                                         TEST AND CTL FEEDBACK ROUTER* 00693000
*           3  ATCZPAB2 CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /* 370X 0303 00694000
*                                         STATUS AND FEEDBACK ROUTER    00695000
*                                         DYNAMIC PAB                */ 00696000
*           3  ATCAP51  PTR(31),       /* PTR TO ISTAPC51            */ 00697000
*           3  ATCZDFJ0 PTR(31),       /* ADDR OF ISTZDFJ0           */ 00698000
*           3  ATCAP37  PTR(31),       /* PTR TO ISTAPC37            */ 00699000
*           3  ATCAP38  PTR(31),       /* PTR TO ISTAPC38            */ 00700000
*           3  ATCDMAPP PTR(31),       /* DUMMY APPENDAGE ROUTINE    */ 00701000
*                                      /* FOR ABEND                  */ 00702000
*           3  ATCRPT12 PTR(31),       /* RESERVED                   */ 00703000
*        3  ATCCRA   CHAR(8) BDY(DWORD), /* AVAILABLE CRA             * 00704000
*           4 ATCCRAQ  PTR(31),          /* QUEUE OF AVAILABLE CRAS   * 00705000
*           4 ATCCRACN FIXED(31),        /* COUNTS                    * 00706000
*             5 ATCCRARC FIXED(16),      /* ENQUEUE COUNT TO ALLOW    * 00707000
*                                        /* MULTIPLE SIMUALTANIOUS    * 00708000
*                                        /* ENQUEUES AND DEQUEUES     * 00709000
*             5 ATCCRAAC FIXED(16),      /* COUNT OF CRAS ON AVAIL Q  * 00710000
*        3  ATCSRB   CHAR(8) BDY(DWORD), /* AVAILABLE SRBS            * 00711000
*             4 ATCSRBQ  PTR(31),        /* QUE OF AVAILABLE SRBS     * 00712000
*             4 ATCSRBCN FIXED(31),      /* COUNTS                    * 00713000
*               5 ATCSRBRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    * 00714000
*                                        /* MULTIPLE SIMUALTANIOUS    * 00715000
*                                        /* ENQUEUES AND DEQUEUES     * 00716000
*               5 ATCSRBAC FIXED(16),    /* COUNT OF SRBS ON AVAIL Q  * 00717000
*        3  ATCCRPL  CHAR(8) BDY(DWORD), /* AVAILABLE CRPLS           * 00718000
*             4 ATCCRPLQ PTR(31),        /* QUE OF AVAILABLE CRPLS    * 00719000
*             4 ATCRPLCN FIXED(31),      /* COUNTS                    * 00720000
*               5 ATCRPLRC FIXED(16),    /* ENQUEUE COUNT TO ALLOW    * 00721000
*                                        /* MULTIPLE SIMUALTANIOUS    * 00722000
*                                        /* ENQUEUES AND DEQUEUES     * 00723000
*               5 ATCRPLAC FIXED(16),    /* COUNT OF CRPLS ON AVAIL Q * 00724000
*           3  ATCSQAFR BDY(DWORD),    /* DOUBLE WORD FOR CDS      0303 00725000
*                                          SQA RELEASE       @VSRIUBL*/ 00726000
*             4 ATCORTBF PTR(31),      /* ANCHOR FOR TO-BE-        0303 00727000
*                                          FREED STG Q       @VSRIUBL*/ 00728000
*             4 ATCORTBC PTR(31),      /* PTR TO TCB OF TASK       0303 00729000
*                                          OWNING STG Q      @VSRIUBL*/ 00730000
*               5 ATCORSRB PTR(31),    /* PTR TO SMS SRB     @VSRIUBL*/ 00731000
*                 6 ATCORQG  BIT(1)ABNL, /* SRB GATE FOR SMS @VSRIUBL*/ 00732000
*           3  ATCOROBT PTR(31),      /* ANCHOR FOR OBTAINED       0303 00733000
*                                         STAGE              @VSRIUBL*/ 00734000
*           3  ATCORFRL PTR(31),      /* ADDR OF ISTORFRL    @VSRIUBL*/ 00735000
*           3  ATCORFMG PTR(31),      /* ADDR OF ISTORFMG    @VSRIUBL*/ 00736000
*           3  ATCINFDD PTR(31),      /* ADDR OF ISTINFDD    @VSRIUBL*/ 00737000
*           3  ATCAIWT  PTR(31),      /* ADDRESS OF BYTE           0303 00738000
*                                         FOLLOWING WAIT IN        0303 00739000
*                                         ISTAICCK           @VSRIUBL*/ 00740000
*           3  *        BIT(8),       /* RESERVED            @VSRIUBL*/ 00741000
*             4 ATCABEN BIT(1)ABNL,   /* VTAM IS ABNORMALLY        0303 00742000
*                                         ENDING             @VSRIUBL*/ 00743000
*             4 ATCOPKL BIT(1)ABNL,   /* OPERATOR IS ENDING        0303 00744000
*                                         VTAM               @VSRIUBL*/ 00745000
*             4 ATCSNUF BIT(1)ABNL,   /* RECURSIVE VTAM ABEND      0303 00746000
*                                         DURING RSCE MGR          0303 00747000
*                                         OPERATION          @VSRIUBL*/ 00748000
*             4 *       BIT(5),       /* RESERVED            @VSRIUBL*/ 00749000
*           3  *        BIT(24),      /* RESERVED            @VSRIUBL*/ 00750000
*           3  ATCRPT27 PTR(31),       /* RESERVED                   */ 00751000
*           3  ATCRPT28 PTR(31),       /* RESERVED                   */ 00752000
*           3  ATCRPT29 PTR(31),       /* RESERVED                   */ 00753000
*           3  ATCRPT30 PTR(31),       /* RESERVED                   */ 00754000
*           3  ATCRPT31 PTR(31),       /* RESERVED                   */ 00755000
*           3  ATCRPT32 PTR(31),       /* RESERVED                   */ 00756000
*           3  ATCRPT33 PTR(31),       /* RESERVED                   */ 00757000
*           3  ATCRPT34 PTR(31),       /* RESERVED                   */ 00758000
*           3  ATCRPT35 PTR(31),       /* RESERVED                   */ 00759000
*           3  ATCRPT36 PTR(31),       /* RESERVED                   */ 00760000
*           3  ATCRPT37 PTR(31),       /* RESERVED                   */ 00761000
*           3  ATCRPT38 PTR(31),       /* RESERVED                   */ 00762000
*           3  ATCRPT39 PTR(31),       /* RESERVED                   */ 00763000
*           3  ATCRPT40 PTR(31),       /* RESERVED                   */ 00764000
*/* END OF VS1/VS2 COMMON CODE.                                      */ 00765000
*/* START OF VS2 UNIQUE CODE.                                        */ 00766000
*           3  ATCVTFLG BIT(32),                                   0303 00767000
*              4 ATCVTACT BIT(1),      /* VTT ACTIVE                 */ 00768000
*              4 *        BIT(31),     /* RESERVED                   */ 00769000
*           3  ATCHLTCB PTR(31),       /* ECB FOR HALTING VTAM       */ 00770000
*           3  ATCATA10 PTR(31),       /* PTR TO ISTATM10            */ 00771000
*           3  ATCZLAAB PTR(31),       /* PTR TO ISTZLFAB            */ 00772000
*           3  ATCCACXA PTR(31),       /* PTR TO ISTCFCXA            */ 00773000
*           3  ATCSMARA PTR(31),       /* PTR TO ISTORFRA            */ 00774000
*           3  ATCSMAID PTR(31),       /* PTR TO ISTORFID            */ 00775000
*           3  ATCTPWQA PTR(31),       /* WAIT Q ANCHOR FOR TPIOS    */ 00776000
*           3  ATCSMAPR PTR(31),       /* PTR TO ISTORFPR            */ 00777000
*           3  ATCSMABF PTR(31),       /* PTR TO ISTORFBF            */ 00778000
*           3  ATCPSTA  PTR(31),       /* ACTIVE PST QUEUE           */ 00779000
*           3  ATCAPBE  PTR(31),       /* POINTER TO ISTAICBE        */ 00780000
*           3  ATCTRMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0303 00781000
*                                      /* PAB FOR VTAM TERM TASK     */ 00782000
*           3  ATCTPSPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0303 00783000
*                                      /* PAB FOR TPIOS              */ 00784000
*           3  ATCAP23  PTR(31),       /* PTR TO ISTAPC23            */ 00785000
*           3  ATCAPC25 PTR(31),       /* PTR TO ISTAPC25            */ 00786000
*           3  ATCAP41  PTR(31),       /* PTR TO ISTAPC41            */ 00787000
*           3  ATCRCFY0 PTR(31),       /* PTR TO ISTRCFY0            */ 00788000
*           3  ATCAP55  PTR(31),       /* PTR TO ISTAPC55            */ 00789000
*           3  ATCAP56  PTR(31),       /* PTR TO ISTAPC56            */ 00790000
*           3  ATCAPC59 PTR(31),       /* PTR TO ISTAPC59            */ 00791000
*           3  ATCAP62  PTR(31),       /* PTR TO ISTAPC62            */ 00792000
*           3  ATCAP66  PTR(31),       /* PTR TO ISTAPC66            */ 00793000
*           3  ATCAP69  PTR(31),       /* PTR TO ISTAPM69            */ 00794000
*           3  ATCAP82  PTR(31),       /* PTR TO ISTAPC82            */ 00795000
*           3  ATCAP83  PTR(31),       /* PTR TO ISTAPC83            */ 00796000
*           3  ATCAP84  PTR(31),       /* PTR TO ISTAPC84            */ 00797000
*           3  ATCAP85  PTR(31),       /* PTR TO ISTAPC85            */ 00798000
*           3  ATCAP86  PTR(31),       /* PTR TO ISTAPC86            */ 00799000
*           3  ATCASCB  PTR(31),       /* PTR TO VTAM ASCB           */ 00800000
*           3  ATCMPLTA  PTR(31),      /* PTR TO MPST LIST TABLE     */ 00801000
*           3  ATCZR01  PTR(31),       /* PTR TO ISTZRM01            */ 00802000
*           3  ATCAICTN PTR(31),       /* PTR TO ISTAICTN            */ 00803000
*           3  ATCTPCP0 PTR(31),       /* PTR TO ISTZFSAV            */ 00804000
*           3  ATCTPCP1 PTR(31),       /* PTR TO ISTZ19SV            */ 00805000
*           3  ATCZFLAG BIT(8),        /* FLAG BYTE                  */ 00806000
*              4 ATCZF001 BIT(1),      /* MDR RECORDING SUSPENDED    */ 00807000
*              4 ATCRSV66 BIT(7),      /* RESERVED                   */ 00808000
*           3  ATCRSV75 BIT(8),        /* RESERVED                   */ 00809000
*           3  ATCSRBCT FIXED(16),     /* COUNT OF PREALLOCATED SRB'S*/ 00810000
*           3  ATCCRACT FIXED(16),     /* COUNT OF PREALLOCATED CRA'S*/ 00811000
*           3  ATCRPLCT FIXED(16),     /* COUNT OF PREALLOCATED CRPL */ 00812000
*           3  ATCRSV88 PTR(31),       /* RESERVED                   */ 00813000
*           3  ATCTPMPB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD), /*TP MSG PAB 00814000
*                                                         FOR VS2    */ 00815000
*           3  ATCTPMMI PTR(31),        /* PTR TO ISTCFMMI - MSG ISSUER 00816000
*                                          FOR SRB MODE ROUTINES     */ 00817000
*           3  ATCVIOPM PTR(31),       /* PTR TO ISTVIOPM            */ 00818000
*           3  ATCPOPAB CHAR(LENGTH(ISTDYPAB)) BDY(DWORD),         0303 00819000
*                   /* POPAB FOR REPLY PROCESSING, POI TERMINATION,  */ 00820000
*                   /* AND VTAM MESSAGE PROCESSOR                    */ 00821000
*        2  ATCAOS CHAR(0) BDY(WORD);  /* VS2 ONLY FIELDS            */ 00822000
*   GEN(PRINT ON);                                                 0304 00823000
*                                                                  0304 00824000
         PRINT ON                                                       00825000
*/* END OF TPEPILOG                                                  */ 00826000
*                                                                  0305 00827000
*   END ISTZFMFA                    /* END OF COMPILATION            */ 00828000
*                                                                  0305 00829000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00830000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00831000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 00832000
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */ 00833000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00834000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00835000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00836000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 00837000
*                                                                  0305 00838000
*       ;                                                          0305 00839000
@EL00001 DS    0H                                                  0305 00840000
@EF00001 DS    0H                                                  0305 00841000
@ER00001 BR    @14                                                 0305 00842000
@DATA    DS    0H                                                       00843000
@DATD    DSECT                                                          00844000
         DS    0F                                                       00845000
ISTZFMFA CSECT                                                          00846000
         DS    0F                                                       00847000
@DATD    DSECT                                                          00848000
         DS    0D                                                       00849000
IOSBPTR  DS    A                                                        00850000
UCBPTR   DS    A                                                        00851000
IOCOMPTR DS    A                                                        00852000
SRBPTR   DS    A                                                        00853000
FRRSPTR  DS    A                                                        00854000
FRREPTR  DS    A                                                        00855000
LDNCBPTR DS    A                                                        00856000
R0       DS    F                                                        00857000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00858000
@ENDDATD EQU   *                                                        00859000
ISTZFMFA CSECT                                                          00860000
         DS    0F                                                       00861000
@SIZDATD DC    AL1(0)                                                   00862000
         DC    AL3(@ENDDATD-@DATD)                                      00863000
         DS    0D                                                       00864000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00865000
@01      EQU   01                                                       00866000
@02      EQU   02                                                       00867000
@03      EQU   03                                                       00868000
@04      EQU   04                                                       00869000
@05      EQU   05                                                       00870000
@06      EQU   06                                                       00871000
@07      EQU   07                                                       00872000
@08      EQU   08                                                       00873000
@09      EQU   09                                                       00874000
@10      EQU   10                                                       00875000
@11      EQU   11                                                       00876000
@12      EQU   12                                                       00877000
@13      EQU   13                                                       00878000
@14      EQU   14                                                       00879000
@15      EQU   15                                                       00880000
RPHPTR   EQU   @01                                                      00881000
R00      EQU   @00                                                      00882000
R01      EQU   @01                                                      00883000
R02      EQU   @02                                                      00884000
R03      EQU   @03                                                      00885000
R04      EQU   @04                                                      00886000
R05      EQU   @05                                                      00887000
R06      EQU   @06                                                      00888000
R07      EQU   @07                                                      00889000
R08      EQU   @08                                                      00890000
R12      EQU   @12                                                      00891000
R13      EQU   @13                                                      00892000
R15      EQU   @15                                                      00893000
BASEREG  EQU   @12                                                      00894000
GPR01P   EQU   @01                                                      00895000
GPR12P   EQU   @12                                                      00896000
GPR13P   EQU   @13                                                      00897000
GPR14P   EQU   @14                                                      00898000
GPR02P   EQU   @02                                                      00899000
GPR03P   EQU   @03                                                      00900000
GPR09P   EQU   @09                                                      00901000
GPR10P   EQU   @10                                                      00902000
GPR11P   EQU   @11                                                      00903000
GPR15P   EQU   @15                                                      00904000
GPR07P   EQU   @07                                                      00905000
GPR01F   EQU   @01                                                      00906000
GPR02F   EQU   @02                                                      00907000
GPR03F   EQU   @03                                                      00908000
GPR07F   EQU   @07                                                      00909000
GPR09F   EQU   @09                                                      00910000
GPR10F   EQU   @10                                                      00911000
GPR11F   EQU   @11                                                      00912000
GPR12F   EQU   @12                                                      00913000
GPR13F   EQU   @13                                                      00914000
GPR14F   EQU   @14                                                      00915000
GPR15F   EQU   @15                                                      00916000
R09      EQU   @09                                                      00917000
R10      EQU   @10                                                      00918000
R11      EQU   @11                                                      00919000
R14      EQU   @14                                                      00920000
CVTPTR   EQU   16                                                       00921000
PSA      EQU   0                                                        00922000
FLCRNPSW EQU   PSA                                                      00923000
FLCROPSW EQU   PSA+8                                                    00924000
FLCICCW2 EQU   PSA+16                                                   00925000
PSAEEPSW EQU   PSA+132                                                  00926000
PSAESPSW EQU   PSA+136                                                  00927000
FLCSVILC EQU   PSAESPSW+1                                               00928000
PSAEPPSW EQU   PSA+140                                                  00929000
FLCPIILC EQU   PSAEPPSW+1                                               00930000
FLCPICOD EQU   PSAEPPSW+2                                               00931000
PSAPICOD EQU   FLCPICOD+1                                               00932000
FLCTEA   EQU   PSAEPPSW+4                                               00933000
FLCPER   EQU   PSA+152                                                  00934000
FLCMCLA  EQU   PSA+168                                                  00935000
FLCIOEL  EQU   FLCMCLA+4                                                00936000
FLCIOA   EQU   FLCMCLA+16                                               00937000
FLCFSA   EQU   FLCMCLA+80                                               00938000
PSASUPER EQU   PSA+552                                                  00939000
PSASUP1  EQU   PSASUPER                                                 00940000
PSASUP2  EQU   PSASUPER+1                                               00941000
PSASUP3  EQU   PSASUPER+2                                               00942000
PSASUP4  EQU   PSASUPER+3                                               00943000
PSACLHT  EQU   PSA+640                                                  00944000
PSALKSA  EQU   PSA+696                                                  00945000
PSAHLHI  EQU   PSA+760                                                  00946000
PSALITA  EQU   PSA+764                                                  00947000
PSADSSFL EQU   PSA+836                                                  00948000
PSADSSF1 EQU   PSADSSFL                                                 00949000
PSADSSF3 EQU   PSADSSFL+2                                               00950000
PSADSSF4 EQU   PSADSSFL+3                                               00951000
PSARSVT  EQU   PSA+896                                                  00952000
ATCLCPTR EQU   1032                                                     00953000
IOSB     EQU   0                                                        00954000
IOSFLA   EQU   IOSB                                                     00955000
IOSACHN  EQU   IOSFLA                                                   00956000
IOSFLB   EQU   IOSB+1                                                   00957000
IOSFLC   EQU   IOSB+2                                                   00958000
IOSDVALT EQU   IOSFLC                                                   00959000
IOSPKEY  EQU   IOSB+12                                                  00960000
IOSOPT   EQU   IOSB+14                                                  00961000
IOSAPR   EQU   IOSOPT                                                   00962000
IOSOPT2  EQU   IOSB+15                                                  00963000
IOSUCB   EQU   IOSB+16                                                  00964000
@NM00002 EQU   IOSB+20                                                  00965000
IOSCSW   EQU   @NM00002+1                                               00966000
IOSTATUS EQU   IOSCSW+3                                                 00967000
IOSAPMSK EQU   IOSB+40                                                  00968000
IOSIPIB  EQU   IOSB+44                                                  00969000
IOSERP   EQU   IOSB+52                                                  00970000
IOSPATH  EQU   IOSB+86                                                  00971000
IOSCHN   EQU   IOSPATH                                                  00972000
IOSCKEY  EQU   IOSB+89                                                  00973000
IOSEEKA  EQU   IOSB+100                                                 00974000
IOSCCHH  EQU   IOSEEKA+3                                                00975000
IOSSKHH  EQU   IOSCCHH+2                                                00976000
UCB      EQU   0                                                        00977000
UCBOB    EQU   0                                                        00978000
UCBJBNR  EQU   UCBOB                                                    00979000
UCBFL5   EQU   UCBOB+1                                                  00980000
UCBAF    EQU   UCBFL5                                                   00981000
UCBSTAT  EQU   UCBOB+3                                                  00982000
UCBCHAN  EQU   UCBOB+4                                                  00983000
UCBSFLS  EQU   UCBOB+6                                                  00984000
UCBFLA   EQU   UCBSFLS                                                  00985000
UCBFL1   EQU   UCBFLA                                                   00986000
UCBBSY   EQU   UCBFL1                                                   00987000
UCBNRY   EQU   UCBFL1                                                   00988000
UCBPST   EQU   UCBFL1                                                   00989000
UCBPSNS  EQU   UCBFL1                                                   00990000
UCBCUB   EQU   UCBFL1                                                   00991000
UCBSAP   EQU   UCBFL1                                                   00992000
UCBACTV  EQU   UCBFL1                                                   00993000
UCBQISCE EQU   UCBFL1                                                   00994000
UCBFLB   EQU   UCBSFLS+1                                                00995000
UCBCHM   EQU   UCBOB+8                                                  00996000
UCBCHM1  EQU   UCBCHM                                                   00997000
UCBPTH0  EQU   UCBCHM1                                                  00998000
UCBPTH1  EQU   UCBCHM1                                                  00999000
UCBWGT   EQU   UCBOB+12                                                 01000000
UCBTYP   EQU   UCBOB+16                                                 01001000
UCBTBYT1 EQU   UCBTYP                                                   01002000
UCB1FEA5 EQU   UCBTBYT1                                                 01003000
UCB1FEA6 EQU   UCBTBYT1                                                 01004000
UCBTBYT2 EQU   UCBTYP+1                                                 01005000
UCB2OPT2 EQU   UCBTBYT2                                                 01006000
UCBDUDN1 EQU   UCB2OPT2                                                 01007000
UCB2OPT3 EQU   UCBTBYT2                                                 01008000
UCBDUDN2 EQU   UCB2OPT3                                                 01009000
UCB2OPT4 EQU   UCBTBYT2                                                 01010000
UCBRWTAU EQU   UCB2OPT4                                                 01011000
UCB2OPT6 EQU   UCBTBYT2                                                 01012000
UCB2OPT7 EQU   UCBTBYT2                                                 01013000
UCBTBYT3 EQU   UCBTYP+2                                                 01014000
UCBDVCLS EQU   UCBTBYT3                                                 01015000
UCBTBYT4 EQU   UCBTYP+3                                                 01016000
UCBEXTPT EQU   UCBOB+20                                                 01017000
UCBFLC   EQU   UCBEXTPT                                                 01018000
UCBDEV   EQU   UCBOB+24                                                 01019000
UCBCMEXT EQU   0                                                        01020000
UCBATI   EQU   UCBCMEXT+3                                               01021000
@NM00011 EQU   UCBATI                                                   01022000
UCBFLP1  EQU   UCBCMEXT+5                                               01023000
UCBMT    EQU   0                                                        01024000
UCBOCR   EQU   0                                                        01025000
UCB3540X EQU   0                                                        01026000
UCBDKBYT EQU   UCB3540X+6                                               01027000
UCB3800X EQU   0                                                        01028000
UCBOPTNS EQU   UCB3800X                                                 01029000
UCBACTIV EQU   UCB3800X+3                                               01030000
UCBMDRBF EQU   UCB3800X+36                                              01031000
UCBUCS   EQU   0                                                        01032000
UCBUCSOP EQU   UCBUCS+4                                                 01033000
UCBFCBOP EQU   UCBUCS+5                                                 01034000
IOCOM    EQU   0                                                        01035000
IOCSTIO  EQU   IOCOM+28                                                 01036000
CVTMAP   EQU   0                                                        01037000
CVTDAR   EQU   CVTMAP+72                                                01038000
CVTFLGS1 EQU   CVTDAR                                                   01039000
CVTDCB   EQU   CVTMAP+116                                               01040000
CVTIXAVL EQU   CVTMAP+124                                               01041000
CVTIERLC EQU   CVTMAP+144                                               01042000
CVTOPTA  EQU   CVTMAP+182                                               01043000
CVTOPTB  EQU   CVTMAP+183                                               01044000
CVTGTF   EQU   CVTMAP+236                                               01045000
CVTGTFST EQU   CVTGTF                                                   01046000
CVTGTFS  EQU   CVTGTFST                                                 01047000
CVTSTATE EQU   CVTGTFST                                                 01048000
CVTTMODE EQU   CVTGTFST                                                 01049000
CVTFORM  EQU   CVTGTFST                                                 01050000
CVTAQAVT EQU   CVTMAP+240                                               01051000
CVTTCMFG EQU   CVTAQAVT                                                 01052000
CVTVOLM2 EQU   CVTMAP+244                                               01053000
CVTTATA  EQU   CVTVOLM2                                                 01054000
CVTTSKS  EQU   CVTTATA                                                  01055000
CVTVOLF2 EQU   CVTTSKS                                                  01056000
CVTTAT   EQU   CVTTATA+1                                                01057000
CVTATER  EQU   CVTMAP+248                                               01058000
CVTEXT1  EQU   CVTMAP+252                                               01059000
CVTPURG  EQU   CVTMAP+260                                               01060000
CVTQMSG  EQU   CVTMAP+268                                               01061000
CVTDMSR  EQU   CVTMAP+272                                               01062000
CVTRSV37 EQU   CVTDMSR                                                  01063000
CVTDMSRF EQU   CVTRSV37                                                 01064000
CVTERPV  EQU   CVTMAP+316                                               01065000
CVTINTLA EQU   CVTMAP+320                                               01066000
CVTAPF   EQU   CVTMAP+324                                               01067000
CVTEXT2  EQU   CVTMAP+328                                               01068000
CVTHJES  EQU   CVTMAP+332                                               01069000
CVTPGSIA EQU   CVTMAP+348                                               01070000
CVTA1F1  EQU   CVTMAP+356                                               01071000
CVTSYSK  EQU   CVTMAP+357                                               01072000
CVTVOLM1 EQU   CVTMAP+380                                               01073000
CVTVOLF1 EQU   CVTVOLM1                                                 01074000
CVTATMCT EQU   CVTMAP+388                                               01075000
CVTXTNT1 EQU   0                                                        01076000
CVTXTNT2 EQU   0                                                        01077000
CVTDSSV  EQU   CVTXTNT2                                                 01078000
CVTFLGBT EQU   CVTXTNT2+5                                               01079000
CVTQID   EQU   CVTXTNT2+24                                              01080000
CVTSHS   EQU   CVTXTNT2+40                                              01081000
CVTRV400 EQU   CVTXTNT2+52                                              01082000
CVTRV409 EQU   CVTXTNT2+53                                              01083000
CVTATCVT EQU   CVTXTNT2+64                                              01084000
CVTRV429 EQU   CVTXTNT2+84                                              01085000
CVTRV438 EQU   CVTXTNT2+85                                              01086000
CVTRV457 EQU   CVTXTNT2+112                                             01087000
CVTRV466 EQU   CVTXTNT2+113                                             01088000
CVTFIX   EQU   0                                                        01089000
CVTRELNO EQU   CVTFIX+252                                               01090000
SRBSECT  EQU   0                                                        01091000
SRBFLC   EQU   SRBSECT+12                                               01092000
FRRS     EQU   0                                                        01093000
FRRSHEAD EQU   FRRS                                                     01094000
FRRSEMP  EQU   FRRSHEAD                                                 01095000
FRRSELEN EQU   FRRSHEAD+8                                               01096000
FRRSCURR EQU   FRRSHEAD+12                                              01097000
FRRSENTR EQU   0                                                        01098000
FRRSFLGS EQU   FRRSENTR+4                                               01099000
FRRSFLG1 EQU   FRRSFLGS                                                 01100000
ISTDEVCH EQU   0                                                        01101000
DEVSHCH  EQU   ISTDEVCH                                                 01102000
DEVCHAR  EQU   DEVSHCH                                                  01103000
DEVTCODE EQU   ISTDEVCH+1                                               01104000
DEVFLAGS EQU   ISTDEVCH+3                                               01105000
DEVFCCTL EQU   DEVFLAGS                                                 01106000
DEVCHAR3 EQU   DEVFLAGS                                                 01107000
ISTNCB   EQU   0                                                        01108000
NCBFLAGS EQU   ISTNCB+24                                                01109000
NCBFRAS  EQU   NCBFLAGS+1                                               01110000
NCBFTRIO EQU   NCBFRAS                                                  01111000
NCBFLAG1 EQU   NCBFLAGS+2                                               01112000
ISTRPH   EQU   0                                                        01113000
RPHCNTL  EQU   ISTRPH                                                   01114000
RPHFLAGS EQU   RPHCNTL+2                                                01115000
RPHAPTYP EQU   RPHFLAGS                                                 01116000
RPHFSTLC EQU   RPHFLAGS                                                 01117000
RPHFLGB  EQU   RPHCNTL+3                                                01118000
RPHRPHA  EQU   ISTRPH+4                                                 01119000
RPHTSKID EQU   ISTRPH+8                                                 01120000
RPHRESMA EQU   ISTRPH+16                                                01121000
RPHWPFLG EQU   RPHRESMA                                                 01122000
RPHWEA   EQU   ISTRPH+24                                                01123000
RPHCSPA  EQU   RPHWEA                                                   01124000
RPHSRPRM EQU   ISTRPH+28                                                01125000
RPHPABQA EQU   ISTRPH+36                                                01126000
RPHWORK  EQU   ISTRPH+40                                                01127000
RPHSAVE1 EQU   RPHWORK                                                  01128000
RPHSBITS EQU   RPHSAVE1+1                                               01129000
ISTPAB   EQU   0                                                        01130000
PABWQCHN EQU   ISTPAB                                                   01131000
PABWEQA  EQU   PABWQCHN                                                 01132000
PABCHAIN EQU   PABWQCHN+4                                               01133000
PABRPHFG EQU   ISTPAB+12                                                01134000
PABFLAGS EQU   PABRPHFG                                                 01135000
PABERLCK EQU   PABFLAGS                                                 01136000
PABERRLK EQU   PABERLCK                                                 01137000
ISTLOK   EQU   0                                                        01138000
LOKCHN   EQU   ISTLOK+1                                                 01139000
LOKCHNG  EQU   LOKCHN                                                   01140000
@NM00049 EQU   LOKCHNG+2                                                01141000
ISTLDNCB EQU   0                                                        01142000
LDNCFLAG EQU   ISTLDNCB+54                                              01143000
LDNFLAGS EQU   ISTLDNCB+107                                             01144000
LDNFLAG2 EQU   ISTLDNCB+110                                             01145000
LDNZLOCK EQU   ISTLDNCB+120                                             01146000
LDNZS1VR EQU   ISTLDNCB+136                                             01147000
LDNZIOLK EQU   ISTLDNCB+184                                             01148000
LDNZERPF EQU   ISTLDNCB+185                                             01149000
LDNZCPAN EQU   LDNZERPF                                                 01150000
LDNZEPIN EQU   LDNZERPF                                                 01151000
LDNZLPC  EQU   ISTLDNCB+186                                             01152000
LDNRPH   EQU   ISTLDNCB+192                                             01153000
LDNDCDEB EQU   ISTLDNCB+304                                             01154000
LDNZSAV3 EQU   ISTLDNCB+376                                             01155000
LDNZSAV4 EQU   LDNZSAV3+8                                               01156000
LDNIOSB  EQU   ISTLDNCB+412                                             01157000
LDNSRB   EQU   ISTLDNCB+520                                             01158000
LDNZH003 EQU   ISTLDNCB+577                                             01159000
ISTZFSAV EQU   0                                                        01160000
ZSAFSVVR EQU   ISTZFSAV+12                                              01161000
ZSAFSVR2 EQU   ISTZFSAV+36                                              01162000
ZSAFSV19 EQU   ISTZFSAV+40                                              01163000
ISTZ19SV EQU   0                                                        01164000
ZSAF19FG EQU   ISTZ19SV                                                 01165000
ZSAFLOCK EQU   ZSAF19FG                                                 01166000
ZSAF19IO EQU   ISTZ19SV+12                                              01167000
ISTZSAVE EQU   0                                                        01168000
ZSAZSVBC EQU   ISTZSAVE                                                 01169000
ZSAZSVMS EQU   ZSAZSVBC                                                 01170000
ZSAZSVVR EQU   ISTZSAVE+12                                              01171000
ISTDYPAB EQU   0                                                        01172000
ISTATCVT EQU   0                                                        01173000
ATCCOM   EQU   ISTATCVT                                                 01174000
ATCSTAT  EQU   ATCCOM                                                   01175000
ATCSTAT1 EQU   ATCSTAT                                                  01176000
ATCSTFLG EQU   ATCSTAT+1                                                01177000
ATCPOFLG EQU   ATCSTAT+2                                                01178000
ATCSTAT4 EQU   ATCSTAT+3                                                01179000
ATCIOTRC EQU   ATCCOM+140                                               01180000
ATCTHTRC EQU   ATCIOTRC                                                 01181000
ATCCSMR  EQU   ISTATCVT+296                                             01182000
ATCSHRFG EQU   ISTATCVT+316                                             01183000
ATCHPGM  EQU   ISTATCVT+384                                             01184000
ATCVLCNT EQU   ISTATCVT+772                                             01185000
ATCRNO   EQU   ISTATCVT+788                                             01186000
ATCSOPD  EQU   ISTATCVT+792                                             01187000
ATCSIPD  EQU   ISTATCVT+800                                             01188000
ATCSECST EQU   ISTATCVT+812                                             01189000
ATCSTAT2 EQU   ISTATCVT+818                                             01190000
ATCVTBAM EQU   ISTATCVT+908                                             01191000
@NM00059 EQU   ATCVTBAM+3                                               01192000
ATCAOSM  EQU   ISTATCVT+912                                             01193000
ATCGSRBQ EQU   ATCAOSM+4                                                01194000
ATCGSRBG EQU   ATCGSRBQ                                                 01195000
ATCICAPP EQU   ATCAOSM+100                                              01196000
ATCLDAPP EQU   ATCAOSM+120                                              01197000
ATCDAPVT EQU   ATCAOSM+140                                              01198000
ATCCRA   EQU   ATCAOSM+280                                              01199000
ATCCRACN EQU   ATCCRA+4                                                 01200000
ATCSRB   EQU   ATCAOSM+288                                              01201000
ATCSRBCN EQU   ATCSRB+4                                                 01202000
ATCCRPL  EQU   ATCAOSM+296                                              01203000
ATCRPLCN EQU   ATCCRPL+4                                                01204000
ATCSQAFR EQU   ATCAOSM+304                                              01205000
ATCORTBC EQU   ATCSQAFR+4                                               01206000
ATCORSRB EQU   ATCORTBC                                                 01207000
@NM00061 EQU   ATCAOSM+332                                              01208000
ATCVTFLG EQU   ATCAOSM+392                                              01209000
ATCZFLAG EQU   ATCAOSM+588                                              01210000
UCBBGN   EQU   0                                                        01211000
IOSATTSC EQU   IOSIPIB                                                  01212000
IOSWTOWA EQU   IOSIPIB                                                  01213000
IOSPCISC EQU   IOSIPIB                                                  01214000
UCBOBS01 EQU   UCBDEV                                                   01215000
UCBSTAB  EQU   UCBOBS01+10                                              01216000
UCBBSVL  EQU   UCBSTAB                                                  01217000
UCBPRSRS EQU   UCBSTAB                                                  01218000
UCBDMCT  EQU   UCBOBS01+11                                              01219000
UCBFL4   EQU   UCBOBS01+13                                              01220000
UCBOBS02 EQU   UCBDEV                                                   01221000
UCBTFL1  EQU   UCBOBS02+19                                              01222000
UCBXTN   EQU   UCBOBS02+20                                              01223000
UCBVOPT  EQU   UCBXTN                                                   01224000
UCBOBS03 EQU   UCBDEV                                                   01225000
UCBXTADR EQU   UCBOBS03                                                 01226000
UCBOBS04 EQU   UCBDEV                                                   01227000
UCBBTA   EQU   UCBOBS04+12                                              01228000
UCBOBS06 EQU   UCBDEV                                                   01229000
UCBAOF   EQU   UCBOBS06                                                 01230000
UCBAOF1  EQU   UCBAOF                                                   01231000
UCBAOF2  EQU   UCBAOF+1                                                 01232000
@NM00010 EQU   UCBOBS06+3                                               01233000
UCBIRB   EQU   UCBOBS06+4                                               01234000
UCBGRAF  EQU   UCBIRB                                                   01235000
UCBLDNCA EQU   UCBOBS06+8                                               01236000
UCBRDYQ  EQU   UCBLDNCA                                                 01237000
UCBIRLN  EQU   UCBRDYQ                                                  01238000
UCBLDNCB EQU   UCBRDYQ+1                                                01239000
UCBCTLNK EQU   UCBOBS06+12                                              01240000
UCBOBS07 EQU   UCBDEV                                                   01241000
UCBOBS08 EQU   UCBDEV                                                   01242000
UCBCTCAD EQU   UCBOBS08                                                 01243000
UCBCTCF1 EQU   UCBOBS08+4                                               01244000
UCBOBS09 EQU   UCBDEV                                                   01245000
CVTS01   EQU   CVTPGSIA                                                 01246000
CVTLPDIA EQU   CVTS01+12                                                01247000
CVTDIRST EQU   CVTLPDIA                                                 01248000
CVTSLIDA EQU   CVTS01+24                                                01249000
CVTCTLFG EQU   CVTS01+50                                                01250000
CVTRV210 EQU   CVTS01+424                                               01251000
CVTRV219 EQU   CVTS01+425                                               01252000
CVTRV228 EQU   CVTS01+426                                               01253000
CVTRV237 EQU   CVTS01+427                                               01254000
CVTMFRTR EQU   CVTS01+452                                               01255000
CVTRV262 EQU   CVTS01+468                                               01256000
CVTRV271 EQU   CVTS01+469                                               01257000
CVTRV280 EQU   CVTS01+470                                               01258000
CVTRV289 EQU   CVTS01+471                                               01259000
CVTGSDA  EQU   CVTS01+600                                               01260000
FLC      EQU   PSA                                                      01261000
PSARSVTE EQU   PSARSVT                                                  01262000
PSACSTK  EQU   PSARSVTE                                                 01263000
SRB      EQU   SRBSECT                                                  01264000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01265000
PSARSAV  EQU   PSARSVTE+60                                              01266000
PSARSTK  EQU   PSARSVTE+56                                              01267000
PSAESAV3 EQU   PSARSVTE+52                                              01268000
PSAESTK3 EQU   PSARSVTE+48                                              01269000
PSAESAV2 EQU   PSARSVTE+44                                              01270000
PSAESTK2 EQU   PSARSVTE+40                                              01271000
PSAESAV1 EQU   PSARSVTE+36                                              01272000
PSAESTK1 EQU   PSARSVTE+32                                              01273000
PSAPSAV  EQU   PSARSVTE+28                                              01274000
PSAPSTK  EQU   PSARSVTE+24                                              01275000
PSAMSAV  EQU   PSARSVTE+20                                              01276000
PSAMSTK  EQU   PSARSVTE+16                                              01277000
PSASSAV  EQU   PSARSVTE+12                                              01278000
PSASSTK  EQU   PSARSVTE+8                                               01279000
PSANSTK  EQU   PSARSVTE+4                                               01280000
CVTRV628 EQU   CVTS01+728                                               01281000
CVTRV627 EQU   CVTS01+724                                               01282000
CVTRV626 EQU   CVTS01+720                                               01283000
CVTRV625 EQU   CVTS01+716                                               01284000
CVTRV624 EQU   CVTS01+712                                               01285000
CVTRV623 EQU   CVTS01+708                                               01286000
CVTRV622 EQU   CVTS01+704                                               01287000
CVTRV621 EQU   CVTS01+700                                               01288000
CVTRV620 EQU   CVTS01+696                                               01289000
CVTRV619 EQU   CVTS01+692                                               01290000
CVTRV618 EQU   CVTS01+688                                               01291000
CVTRV617 EQU   CVTS01+684                                               01292000
CVTRV616 EQU   CVTS01+680                                               01293000
CVTRV615 EQU   CVTS01+676                                               01294000
CVTRV614 EQU   CVTS01+672                                               01295000
CVTRV613 EQU   CVTS01+668                                               01296000
CVTTCASP EQU   CVTS01+664                                               01297000
CVT0PT03 EQU   CVTS01+660                                               01298000
CVT0PT0E EQU   CVTS01+656                                               01299000
CVTIRM   EQU   CVTS01+652                                               01300000
CVTCGK   EQU   CVTS01+648                                               01301000
CVTRV607 EQU   CVTS01+644                                               01302000
CVTRV606 EQU   CVTS01+640                                               01303000
CVTRV605 EQU   CVTS01+636                                               01304000
CVTRV604 EQU   CVTS01+632                                               01305000
CVTEFF02 EQU   CVTS01+628                                               01306000
CVTCBBR  EQU   CVTS01+624                                               01307000
CVTSSCR  EQU   CVTS01+620                                               01308000
CVTEVENT EQU   CVTS01+616                                               01309000
CVTCRCA  EQU   CVTS01+612                                               01310000
CVTTPIO  EQU   CVTS01+608                                               01311000
CVTADV   EQU   CVTS01+604                                               01312000
CVTGSDAB EQU   CVTGSDA                                                  01313000
CVTQV3   EQU   CVTS01+596                                               01314000
CVTQV2   EQU   CVTS01+592                                               01315000
CVTQV1   EQU   CVTS01+588                                               01316000
CVTRPT   EQU   CVTS01+584                                               01317000
CVTSSRB  EQU   CVTS01+580                                               01318000
CVTCSDRL EQU   CVTS01+576                                               01319000
CVTEXP1  EQU   CVTS01+572                                               01320000
CVTRMPMT EQU   CVTS01+568                                               01321000
CVTRMPTT EQU   CVTS01+564                                               01322000
CVTVPSA  EQU   CVTS01+560                                               01323000
CVTVSTOP EQU   CVTS01+556                                               01324000
CVTGTFR8 EQU   CVTS01+552                                               01325000
CVTQUIT  EQU   CVTS01+548                                               01326000
CVTVACR  EQU   CVTS01+544                                               01327000
CVTWTCB  EQU   CVTS01+540                                               01328000
CVTSTPRS EQU   CVTS01+536                                               01329000
CVT0PT02 EQU   CVTS01+532                                               01330000
CVTDARCM EQU   CVTS01+528                                               01331000
CVTIRECM EQU   CVTS01+524                                               01332000
CVTJRECM EQU   CVTS01+520                                               01333000
CVTVEMS0 EQU   CVTS01+516                                               01334000
CVTSPFRR EQU   CVTS01+512                                               01335000
CVTRLSTG EQU   CVTS01+508                                               01336000
CVT0TC0A EQU   CVTS01+504                                               01337000
CVTGMBR  EQU   CVTS01+500                                               01338000
CVTLFRM  EQU   CVTS01+496                                               01339000
CVTRMBR  EQU   CVTS01+492                                               01340000
CVTVIOP  EQU   CVTS01+488                                               01341000
CVTRV307 EQU   CVTS01+486                                               01342000
CVTRV306 EQU   CVTS01+484                                               01343000
CVTRV305 EQU   CVTS01+482                                               01344000
CVTRV304 EQU   CVTS01+480                                               01345000
CVTRV303 EQU   CVTS01+478                                               01346000
CVTRV302 EQU   CVTS01+476                                               01347000
CVTTRCA  EQU   CVTS01+472                                               01348000
CVTRV297 EQU   CVTRV289                                                 01349000
CVTRV296 EQU   CVTRV289                                                 01350000
CVTRV295 EQU   CVTRV289                                                 01351000
CVTRV294 EQU   CVTRV289                                                 01352000
CVTRV293 EQU   CVTRV289                                                 01353000
CVTRV292 EQU   CVTRV289                                                 01354000
CVTRV291 EQU   CVTRV289                                                 01355000
CVTRV290 EQU   CVTRV289                                                 01356000
CVTRV288 EQU   CVTRV280                                                 01357000
CVTRV287 EQU   CVTRV280                                                 01358000
CVTRV286 EQU   CVTRV280                                                 01359000
CVTRV285 EQU   CVTRV280                                                 01360000
CVTRV284 EQU   CVTRV280                                                 01361000
CVTRV283 EQU   CVTRV280                                                 01362000
CVTRV282 EQU   CVTRV280                                                 01363000
CVTRV281 EQU   CVTRV280                                                 01364000
CVTRV279 EQU   CVTRV271                                                 01365000
CVTRV278 EQU   CVTRV271                                                 01366000
CVTRV277 EQU   CVTRV271                                                 01367000
CVTRV276 EQU   CVTRV271                                                 01368000
CVTRV275 EQU   CVTRV271                                                 01369000
CVTRV274 EQU   CVTRV271                                                 01370000
CVTRV273 EQU   CVTRV271                                                 01371000
CVTRV272 EQU   CVTRV271                                                 01372000
CVTRV270 EQU   CVTRV262                                                 01373000
CVTRV269 EQU   CVTRV262                                                 01374000
CVTRV268 EQU   CVTRV262                                                 01375000
CVTRV267 EQU   CVTRV262                                                 01376000
CVTRV266 EQU   CVTRV262                                                 01377000
CVTRV265 EQU   CVTRV262                                                 01378000
CVTRV264 EQU   CVTRV262                                                 01379000
CVTRV263 EQU   CVTRV262                                                 01380000
CVTVFP   EQU   CVTS01+464                                               01381000
CVTVSI   EQU   CVTS01+460                                               01382000
CVTVPSIB EQU   CVTS01+456                                               01383000
CVTMFACT EQU   CVTMFRTR                                                 01384000
CVTMFCTL EQU   CVTS01+448                                               01385000
CVTPVBP  EQU   CVTS01+444                                               01386000
CVTPWI   EQU   CVTS01+440                                               01387000
CVTRV254 EQU   CVTS01+438                                               01388000
CVTRV253 EQU   CVTS01+436                                               01389000
CVTRV252 EQU   CVTS01+434                                               01390000
CVTRV251 EQU   CVTS01+433                                               01391000
CVTRV250 EQU   CVTS01+432                                               01392000
CVTRV249 EQU   CVTS01+431                                               01393000
CVTRV248 EQU   CVTS01+430                                               01394000
CVTRV247 EQU   CVTS01+429                                               01395000
CVTRV246 EQU   CVTS01+428                                               01396000
CVTRV245 EQU   CVTRV237                                                 01397000
CVTRV244 EQU   CVTRV237                                                 01398000
CVTRV243 EQU   CVTRV237                                                 01399000
CVTRV242 EQU   CVTRV237                                                 01400000
CVTRV241 EQU   CVTRV237                                                 01401000
CVTRV240 EQU   CVTRV237                                                 01402000
CVTRV239 EQU   CVTRV237                                                 01403000
CVTRV238 EQU   CVTRV237                                                 01404000
CVTRV236 EQU   CVTRV228                                                 01405000
CVTRV235 EQU   CVTRV228                                                 01406000
CVTRV234 EQU   CVTRV228                                                 01407000
CVTRV233 EQU   CVTRV228                                                 01408000
CVTRV232 EQU   CVTRV228                                                 01409000
CVTRV231 EQU   CVTRV228                                                 01410000
CVTRV230 EQU   CVTRV228                                                 01411000
CVTRV229 EQU   CVTRV228                                                 01412000
CVTRV227 EQU   CVTRV219                                                 01413000
CVTRV226 EQU   CVTRV219                                                 01414000
CVTRV225 EQU   CVTRV219                                                 01415000
CVTRV224 EQU   CVTRV219                                                 01416000
CVTRV223 EQU   CVTRV219                                                 01417000
CVTRV222 EQU   CVTRV219                                                 01418000
CVTRV221 EQU   CVTRV219                                                 01419000
CVTRV220 EQU   CVTRV219                                                 01420000
CVTRV218 EQU   CVTRV210                                                 01421000
CVTRV217 EQU   CVTRV210                                                 01422000
CVTRV216 EQU   CVTRV210                                                 01423000
CVTRV215 EQU   CVTRV210                                                 01424000
CVTRV214 EQU   CVTRV210                                                 01425000
CVTRV213 EQU   CVTRV210                                                 01426000
CVTRV212 EQU   CVTRV210                                                 01427000
CVTRV211 EQU   CVTRV210                                                 01428000
CVTLCCAT EQU   CVTS01+420                                               01429000
CVTPCCAT EQU   CVTS01+416                                               01430000
CVTIPCRP EQU   CVTS01+412                                               01431000
CVTIPCRI EQU   CVTS01+408                                               01432000
CVTIPCDS EQU   CVTS01+404                                               01433000
CVTAIDVT EQU   CVTS01+400                                               01434000
CVTSSAP  EQU   CVTS01+396                                               01435000
CVTEHCIR EQU   CVTS01+392                                               01436000
CVTEHDEF EQU   CVTS01+388                                               01437000
CVTDAIR  EQU   CVTS01+384                                               01438000
CVTPERFM EQU   CVTS01+380                                               01439000
CVT044R2 EQU   CVTS01+376                                               01440000
CVTFETCH EQU   CVTS01+372                                               01441000
CVTRSTWD EQU   CVTS01+368                                               01442000
CVTSPOST EQU   CVTS01+364                                               01443000
CVTIOBP  EQU   CVTS01+360                                               01444000
CVTASMVT EQU   CVTS01+356                                               01445000
CVTRECRQ EQU   CVTS01+352                                               01446000
CVTWSAC  EQU   CVTS01+348                                               01447000
CVTRV149 EQU   CVTS01+344                                               01448000
CVTWSAL  EQU   CVTS01+340                                               01449000
CVTSPSA  EQU   CVTS01+336                                               01450000
CVTGLMN  EQU   CVTS01+332                                               01451000
CVTVEAC0 EQU   CVTS01+328                                               01452000
CVT062R1 EQU   CVTS01+324                                               01453000
CVTRPOST EQU   CVTS01+320                                               01454000
CVTDQIQE EQU   CVTS01+316                                               01455000
CVTCSD   EQU   CVTS01+312                                               01456000
CVTLKRMA EQU   CVTS01+308                                               01457000
CVTRSPIE EQU   CVTS01+304                                               01458000
CVTRENQ  EQU   CVTS01+300                                               01459000
CVTLQCB  EQU   CVTS01+296                                               01460000
CVTFQCB  EQU   CVTS01+292                                               01461000
CVTQCS01 EQU   CVTS01+288                                               01462000
CVTAPFT  EQU   CVTS01+284                                               01463000
CVTPARRL EQU   CVTS01+280                                               01464000
CVTVWAIT EQU   CVTS01+276                                               01465000
CVTGSPL  EQU   CVTS01+272                                               01466000
CVTLSMQ  EQU   CVTS01+268                                               01467000
CVTGSMQ  EQU   CVTS01+264                                               01468000
CVTEXPRO EQU   CVTS01+260                                               01469000
CVTOPCTP EQU   CVTS01+256                                               01470000
CVTSIC   EQU   CVTS01+252                                               01471000
CVTTPIOS EQU   CVTS01+248                                               01472000
CVTRTMS  EQU   CVTS01+244                                               01473000
CVTSDBF  EQU   CVTS01+240                                               01474000
CVTSCBP  EQU   CVTS01+236                                               01475000
CVTSDMP  EQU   CVTS01+232                                               01476000
CVTSV60  EQU   CVTS01+228                                               01477000
CVTRTMCT EQU   CVTS01+224                                               01478000
CVTASCBL EQU   CVTS01+220                                               01479000
CVTASCBH EQU   CVTS01+216                                               01480000
CVTGDA   EQU   CVTS01+212                                               01481000
CVTASVT  EQU   CVTS01+208                                               01482000
CVTVVMDI EQU   CVTS01+204                                               01483000
CVTAQTOP EQU   CVTS01+200                                               01484000
CVTIOSCS EQU   CVTS01+196                                               01485000
CVTSDRM  EQU   CVTS01+192                                               01486000
CVTOPTE  EQU   CVTS01+188                                               01487000
CVTSTXU  EQU   CVTS01+184                                               01488000
CVTQUIS  EQU   CVTS01+180                                               01489000
CVTPARS  EQU   CVTS01+176                                               01490000
CVTS1EE  EQU   CVTS01+172                                               01491000
CVTFRAS  EQU   CVTS01+168                                               01492000
CVTQSAS  EQU   CVTS01+164                                               01493000
CVTCRAS  EQU   CVTS01+160                                               01494000
CVTCRMN  EQU   CVTS01+156                                               01495000
CVTDELCP EQU   CVTS01+152                                               01496000
CVTFRECL EQU   CVTS01+148                                               01497000
CVTGETCL EQU   CVTS01+144                                               01498000
CVTBLDCP EQU   CVTS01+140                                               01499000
CVTAUTHL EQU   CVTS01+136                                               01500000
CVTSCAN  EQU   CVTS01+132                                               01501000
CVTRV144 EQU   CVTS01+130                                               01502000
CVTMAXMP EQU   CVTS01+128                                               01503000
CVTSTCK  EQU   CVTS01+124                                               01504000
CVTRV139 EQU   CVTS01+123                                               01505000
CVTDSSAC EQU   CVTS01+122                                               01506000
CVTRV513 EQU   CVTS01+121                                               01507000
CVTIOSPL EQU   CVTS01+120                                               01508000
CVTPTGT  EQU   CVTS01+116                                               01509000
CVTCSPIE EQU   CVTS01+112                                               01510000
CVTSMFEX EQU   CVTS01+108                                               01511000
CVTOLT0A EQU   CVTS01+104                                               01512000
CVTSRBRT EQU   CVTS01+100                                               01513000
CVTPUTL  EQU   CVTS01+96                                                01514000
CVTASCRL EQU   CVTS01+92                                                01515000
CVTASCRF EQU   CVTS01+88                                                01516000
CVTRV326 EQU   CVTS01+84                                                01517000
CVTRV325 EQU   CVTS01+80                                                01518000
CVTRV324 EQU   CVTS01+76                                                01519000
CVT0VL01 EQU   CVTS01+72                                                01520000
CVTSHRVM EQU   CVTS01+68                                                01521000
CVTRV332 EQU   CVTS01+64                                                01522000
CVTTAS   EQU   CVTS01+60                                                01523000
CVTRSCN  EQU   CVTS01+56                                                01524000
CVTTRAC2 EQU   CVTS01+54                                                01525000
CVTTRACE EQU   CVTS01+52                                                01526000
CVTAPG   EQU   CVTS01+51                                                01527000
CVTSDTRC EQU   CVTCTLFG                                                 01528000
CVTGTRCE EQU   CVTCTLFG                                                 01529000
CVTNOMP  EQU   CVTCTLFG                                                 01530000
CVTRSV79 EQU   CVTCTLFG                                                 01531000
CVTDSTAT EQU   CVTCTLFG                                                 01532000
CVTRSV78 EQU   CVTCTLFG                                                 01533000
CVTRV333 EQU   CVTCTLFG                                                 01534000
CVTRV323 EQU   CVTCTLFG                                                 01535000
CVTSPVLK EQU   CVTS01+49                                                01536000
CVTRSV77 EQU   CVTS01+48                                                01537000
CVTRV331 EQU   CVTS01+44                                                01538000
CVTRV330 EQU   CVTS01+40                                                01539000
CVTRV329 EQU   CVTS01+36                                                01540000
CVTRV328 EQU   CVTS01+32                                                01541000
CVTRV322 EQU   CVTS01+28                                                01542000
CVTSLID  EQU   CVTSLIDA+1                                               01543000
CVTSYLK  EQU   CVTSLIDA                                                 01544000
CVTRV321 EQU   CVTS01+20                                                01545000
CVTRV320 EQU   CVTS01+16                                                01546000
CVTLPDIR EQU   CVTLPDIA+1                                               01547000
CVTRSV69 EQU   CVTDIRST                                                 01548000
CVTRSV68 EQU   CVTDIRST                                                 01549000
CVTRSV67 EQU   CVTDIRST                                                 01550000
CVTRSV66 EQU   CVTDIRST                                                 01551000
CVTRSV65 EQU   CVTDIRST                                                 01552000
CVTRSV64 EQU   CVTDIRST                                                 01553000
CVTRSV63 EQU   CVTDIRST                                                 01554000
CVTDICOM EQU   CVTDIRST                                                 01555000
CVTPVTP  EQU   CVTS01+8                                                 01556000
CVTLPDSR EQU   CVTS01+4                                                 01557000
CVTGETL  EQU   CVTS01                                                   01558000
UCBRV066 EQU   UCBOBS09+4                                               01559000
UCBIOSBA EQU   UCBOBS09                                                 01560000
UCBRV042 EQU   UCBOBS08+5                                               01561000
UCBRV082 EQU   UCBCTCF1                                                 01562000
UCBRV081 EQU   UCBCTCF1                                                 01563000
UCBRV080 EQU   UCBCTCF1                                                 01564000
UCBRV079 EQU   UCBCTCF1                                                 01565000
UCBRV078 EQU   UCBCTCF1                                                 01566000
UCBRV077 EQU   UCBCTCF1                                                 01567000
UCBRV076 EQU   UCBCTCF1                                                 01568000
UCBCTC80 EQU   UCBCTCF1                                                 01569000
UCBCTCAL EQU   UCBCTCAD                                                 01570000
UCBICNCB EQU   UCBOBS07+4                                               01571000
UCBRV040 EQU   UCBOBS07                                                 01572000
UCBCTLNA EQU   UCBCTLNK+1                                               01573000
UCBRLN   EQU   UCBCTLNK                                                 01574000
UCBRDYQA EQU   UCBLDNCB                                                 01575000
UCBINRLN EQU   UCBIRLN                                                  01576000
UCBIRBA  EQU   UCBIRB+1                                                 01577000
UCBRV039 EQU   UCBGRAF                                                  01578000
UCBDWNR  EQU   UCBGRAF                                                  01579000
UCBRPND  EQU   UCBGRAF                                                  01580000
UCBUPM   EQU   UCBGRAF                                                  01581000
UCBBTAM  EQU   UCBGRAF                                                  01582000
UCBDRNO  EQU   UCBGRAF                                                  01583000
UCBDRO   EQU   UCBGRAF                                                  01584000
UCBOIP   EQU   UCBGRAF                                                  01585000
UCBATRCD EQU   @NM00010                                                 01586000
UCBSKPFG EQU   @NM00010                                                 01587000
UCBRIPND EQU   @NM00010                                                 01588000
UCBRTIAC EQU   @NM00010                                                 01589000
UCBRSV79 EQU   @NM00010                                                 01590000
UCBRSV78 EQU   @NM00010                                                 01591000
UCBRSV77 EQU   @NM00010                                                 01592000
UCBOLTEP EQU   @NM00010                                                 01593000
UCBATNCT EQU   UCBOBS06+2                                               01594000
UCBRSV76 EQU   UCBAOF2                                                  01595000
UCBRSV75 EQU   UCBAOF2                                                  01596000
UCBRSV74 EQU   UCBAOF2                                                  01597000
UCBRSV73 EQU   UCBAOF2                                                  01598000
UCBRSV72 EQU   UCBAOF2                                                  01599000
UCBRSV71 EQU   UCBAOF2                                                  01600000
UCBRSV70 EQU   UCBAOF2                                                  01601000
UCBRSV69 EQU   UCBAOF2                                                  01602000
UCBRSV68 EQU   UCBAOF1                                                  01603000
UCBRSV67 EQU   UCBAOF1                                                  01604000
UCBRSV66 EQU   UCBAOF1                                                  01605000
UCBRSV65 EQU   UCBAOF1                                                  01606000
UCBRSV64 EQU   UCBAOF1                                                  01607000
UCBOFNL  EQU   UCBAOF1                                                  01608000
UCBOFSP  EQU   UCBAOF1                                                  01609000
UCBOFMCR EQU   UCBAOF1                                                  01610000
UCBBTB   EQU   UCBBTA+1                                                 01611000
UCBDI    EQU   UCBBTA                                                   01612000
UCBSNS   EQU   UCBOBS04+8                                               01613000
UCBTEB   EQU   UCBOBS04+4                                               01614000
UCBGCB   EQU   UCBOBS04+3                                               01615000
UCBOPEN  EQU   UCBOBS04+2                                               01616000
UCBSTART EQU   UCBOBS04                                                 01617000
UCBXTNB  EQU   UCBXTN+1                                                 01618000
UCBRSV22 EQU   UCBVOPT                                                  01619000
UCBRSV21 EQU   UCBVOPT                                                  01620000
UCBRSV20 EQU   UCBVOPT                                                  01621000
UCBESVE  EQU   UCBVOPT                                                  01622000
UCBERPC  EQU   UCBVOPT                                                  01623000
UCBESVC  EQU   UCBVOPT                                                  01624000
UCBEVA   EQU   UCBVOPT                                                  01625000
UCBESV   EQU   UCBVOPT                                                  01626000
UCBRV009 EQU   UCBTFL1                                                  01627000
UCBRV008 EQU   UCBTFL1                                                  01628000
UCBRV007 EQU   UCBTFL1                                                  01629000
UCBRV006 EQU   UCBTFL1                                                  01630000
UCBRV005 EQU   UCBTFL1                                                  01631000
UCBRV038 EQU   UCBTFL1                                                  01632000
UCBNSLTP EQU   UCBTFL1                                                  01633000
UCBNLTP  EQU   UCBTFL1                                                  01634000
UCBRES1B EQU   UCBOBS02+18                                              01635000
UCBFSER  EQU   UCBOBS02+12                                              01636000
@NM00009 EQU   UCBOBS02+4                                               01637000
UCBFSEQ  EQU   UCBOBS02+2                                               01638000
UCBFSCT  EQU   UCBOBS02                                                 01639000
UCBNEXP  EQU   UCBOBS01+20                                              01640000
UCBBASE  EQU   UCBOBS01+16                                              01641000
UCBRES1A EQU   UCBOBS01+15                                              01642000
UCBUSER  EQU   UCBOBS01+14                                              01643000
UCBFL47  EQU   UCBFL4                                                   01644000
UCBFL46  EQU   UCBFL4                                                   01645000
UCBFL45  EQU   UCBFL4                                                   01646000
UCBRV065 EQU   UCBFL4                                                   01647000
UCBDSS   EQU   UCBFL4                                                   01648000
UCBRV028 EQU   UCBFL4                                                   01649000
UCBWDAV  EQU   UCBFL4                                                   01650000
UCBDAVV  EQU   UCBFL4                                                   01651000
UCBSQC   EQU   UCBOBS01+12                                              01652000
UCBDATP  EQU   UCBOBS01+12                                              01653000
UCBDMC   EQU   UCBDMCT                                                  01654000
UCBMOUNT EQU   UCBDMCT                                                  01655000
UCBBNUL  EQU   UCBSTAB                                                  01656000
UCBSHAR  EQU   UCBSTAB                                                  01657000
UCBBSTR  EQU   UCBSTAB                                                  01658000
UCBBPUB  EQU   UCBSTAB                                                  01659000
UCBBPRV  EQU   UCBSTAB                                                  01660000
UCBBALB  EQU   UCBPRSRS                                                 01661000
UCBPGFL  EQU   UCBSTAB                                                  01662000
UCBDVSHR EQU   UCBBSVL                                                  01663000
UCBVOLI  EQU   UCBOBS01+4                                               01664000
UCBVTOC  EQU   UCBOBS01                                                 01665000
IOSPCIWA EQU   IOSPCISC+44                                              01666000
IOSPCIRS EQU   IOSPCISC+8                                               01667000
@NM00007 EQU   IOSPCISC+4                                               01668000
@NM00006 EQU   IOSPCISC                                                 01669000
IOSWRNDR EQU   IOSWTOWA+4                                               01670000
IOSWTOPT EQU   IOSWTOWA+3                                               01671000
IOSWTOCP EQU   IOSWTOWA+2                                               01672000
IOSWTOCH EQU   IOSWTOWA                                                 01673000
IOSATTWA EQU   IOSATTSC+40                                              01674000
@NM00005 EQU   IOSATTSC+24                                              01675000
IOSATTSN EQU   IOSATTSC                                                 01676000
ATCAOS   EQU   ISTATCVT+1584                                            01677000
ATCPOPAB EQU   ATCAOSM+640                                              01678000
ATCVIOPM EQU   ATCAOSM+636                                              01679000
ATCTPMMI EQU   ATCAOSM+632                                              01680000
ATCTPMPB EQU   ATCAOSM+600                                              01681000
ATCRSV88 EQU   ATCAOSM+596                                              01682000
ATCRPLCT EQU   ATCAOSM+594                                              01683000
ATCCRACT EQU   ATCAOSM+592                                              01684000
ATCSRBCT EQU   ATCAOSM+590                                              01685000
ATCRSV75 EQU   ATCAOSM+589                                              01686000
ATCRSV66 EQU   ATCZFLAG                                                 01687000
ATCZF001 EQU   ATCZFLAG                                                 01688000
ATCTPCP1 EQU   ATCAOSM+584                                              01689000
ATCTPCP0 EQU   ATCAOSM+580                                              01690000
ATCAICTN EQU   ATCAOSM+576                                              01691000
ATCZR01  EQU   ATCAOSM+572                                              01692000
ATCMPLTA EQU   ATCAOSM+568                                              01693000
ATCASCB  EQU   ATCAOSM+564                                              01694000
ATCAP86  EQU   ATCAOSM+560                                              01695000
ATCAP85  EQU   ATCAOSM+556                                              01696000
ATCAP84  EQU   ATCAOSM+552                                              01697000
ATCAP83  EQU   ATCAOSM+548                                              01698000
ATCAP82  EQU   ATCAOSM+544                                              01699000
ATCAP69  EQU   ATCAOSM+540                                              01700000
ATCAP66  EQU   ATCAOSM+536                                              01701000
ATCAP62  EQU   ATCAOSM+532                                              01702000
ATCAPC59 EQU   ATCAOSM+528                                              01703000
ATCAP56  EQU   ATCAOSM+524                                              01704000
ATCAP55  EQU   ATCAOSM+520                                              01705000
ATCRCFY0 EQU   ATCAOSM+516                                              01706000
ATCAP41  EQU   ATCAOSM+512                                              01707000
ATCAPC25 EQU   ATCAOSM+508                                              01708000
ATCAP23  EQU   ATCAOSM+504                                              01709000
ATCTPSPB EQU   ATCAOSM+472                                              01710000
ATCTRMPB EQU   ATCAOSM+440                                              01711000
ATCAPBE  EQU   ATCAOSM+436                                              01712000
ATCPSTA  EQU   ATCAOSM+432                                              01713000
ATCSMABF EQU   ATCAOSM+428                                              01714000
ATCSMAPR EQU   ATCAOSM+424                                              01715000
ATCTPWQA EQU   ATCAOSM+420                                              01716000
ATCSMAID EQU   ATCAOSM+416                                              01717000
ATCSMARA EQU   ATCAOSM+412                                              01718000
ATCCACXA EQU   ATCAOSM+408                                              01719000
ATCZLAAB EQU   ATCAOSM+404                                              01720000
ATCATA10 EQU   ATCAOSM+400                                              01721000
ATCHLTCB EQU   ATCAOSM+396                                              01722000
@NM00064 EQU   ATCVTFLG                                                 01723000
ATCVTACT EQU   ATCVTFLG                                                 01724000
ATCRPT40 EQU   ATCAOSM+388                                              01725000
ATCRPT39 EQU   ATCAOSM+384                                              01726000
ATCRPT38 EQU   ATCAOSM+380                                              01727000
ATCRPT37 EQU   ATCAOSM+376                                              01728000
ATCRPT36 EQU   ATCAOSM+372                                              01729000
ATCRPT35 EQU   ATCAOSM+368                                              01730000
ATCRPT34 EQU   ATCAOSM+364                                              01731000
ATCRPT33 EQU   ATCAOSM+360                                              01732000
ATCRPT32 EQU   ATCAOSM+356                                              01733000
ATCRPT31 EQU   ATCAOSM+352                                              01734000
ATCRPT30 EQU   ATCAOSM+348                                              01735000
ATCRPT29 EQU   ATCAOSM+344                                              01736000
ATCRPT28 EQU   ATCAOSM+340                                              01737000
ATCRPT27 EQU   ATCAOSM+336                                              01738000
@NM00063 EQU   ATCAOSM+333                                              01739000
@NM00062 EQU   @NM00061                                                 01740000
ATCSNUF  EQU   @NM00061                                                 01741000
ATCOPKL  EQU   @NM00061                                                 01742000
ATCABEN  EQU   @NM00061                                                 01743000
ATCAIWT  EQU   ATCAOSM+328                                              01744000
ATCINFDD EQU   ATCAOSM+324                                              01745000
ATCORFMG EQU   ATCAOSM+320                                              01746000
ATCORFRL EQU   ATCAOSM+316                                              01747000
ATCOROBT EQU   ATCAOSM+312                                              01748000
ATCORQG  EQU   ATCORSRB                                                 01749000
ATCORTBF EQU   ATCSQAFR                                                 01750000
ATCRPLAC EQU   ATCRPLCN+2                                               01751000
ATCRPLRC EQU   ATCRPLCN                                                 01752000
ATCCRPLQ EQU   ATCCRPL                                                  01753000
ATCSRBAC EQU   ATCSRBCN+2                                               01754000
ATCSRBRC EQU   ATCSRBCN                                                 01755000
ATCSRBQ  EQU   ATCSRB                                                   01756000
ATCCRAAC EQU   ATCCRACN+2                                               01757000
ATCCRARC EQU   ATCCRACN                                                 01758000
ATCCRAQ  EQU   ATCCRA                                                   01759000
ATCRPT12 EQU   ATCAOSM+276                                              01760000
ATCDMAPP EQU   ATCAOSM+272                                              01761000
ATCAP38  EQU   ATCAOSM+268                                              01762000
ATCAP37  EQU   ATCAOSM+264                                              01763000
ATCZDFJ0 EQU   ATCAOSM+260                                              01764000
ATCAP51  EQU   ATCAOSM+256                                              01765000
ATCZPAB2 EQU   ATCAOSM+224                                              01766000
ATCZPAB1 EQU   ATCAOSM+192                                              01767000
ATCZLFVT EQU   ATCAOSM+188                                              01768000
ATCZLPVT EQU   ATCAOSM+184                                              01769000
ATCZDVTX EQU   ATCAOSM+180                                              01770000
ATCZDVTA EQU   ATCAOSM+176                                              01771000
ATCZDVT9 EQU   ATCAOSM+172                                              01772000
ATCZDVT8 EQU   ATCAOSM+168                                              01773000
ATCZDVT7 EQU   ATCAOSM+164                                              01774000
ATCRSV56 EQU   ATCDAPVT+22                                              01775000
ATCDAPDG EQU   ATCDAPVT+20                                              01776000
ATCDXCEA EQU   ATCDAPVT+16                                              01777000
ATCDCEA  EQU   ATCDAPVT+12                                              01778000
ATCDPCIA EQU   ATCDAPVT+8                                               01779000
ATCDSIOA EQU   ATCDAPVT+4                                               01780000
ATCDEOEA EQU   ATCDAPVT                                                 01781000
ATCZLAEA EQU   ATCLDAPP+16                                              01782000
ATCZLCEA EQU   ATCLDAPP+12                                              01783000
ATCRSV17 EQU   ATCLDAPP+8                                               01784000
ATCSMFRR EQU   ATCLDAPP+4                                               01785000
ATCCDTID EQU   ATCLDAPP                                                 01786000
ATCZAEA  EQU   ATCICAPP+16                                              01787000
ATCZCEA  EQU   ATCICAPP+12                                              01788000
ATCCDTCB EQU   ATCICAPP+8                                               01789000
ATCZSIOA EQU   ATCICAPP+4                                               01790000
ATCCDRPH EQU   ATCICAPP                                                 01791000
ATCAP65  EQU   ATCAOSM+96                                               01792000
ATCZDVT6 EQU   ATCAOSM+92                                               01793000
ATCZDVT4 EQU   ATCAOSM+88                                               01794000
ATCZDVT3 EQU   ATCAOSM+84                                               01795000
ATCZDVT1 EQU   ATCAOSM+80                                               01796000
ATCICNCB EQU   ATCAOSM+76                                               01797000
ATCZPSVT EQU   ATCAOSM+72                                               01798000
ATCZFSVT EQU   ATCAOSM+68                                               01799000
ATCAP64  EQU   ATCAOSM+64                                               01800000
ATCAP63  EQU   ATCAOSM+60                                               01801000
ATCAP61  EQU   ATCAOSM+56                                               01802000
ATCAP58  EQU   ATCAOSM+52                                               01803000
ATCAP57  EQU   ATCAOSM+48                                               01804000
ATCAP54  EQU   ATCAOSM+44                                               01805000
ATCAP53  EQU   ATCAOSM+40                                               01806000
ATCAP52  EQU   ATCAOSM+36                                               01807000
ATCAP34  EQU   ATCAOSM+32                                               01808000
ATCAP32  EQU   ATCAOSM+28                                               01809000
ATCAP31  EQU   ATCAOSM+24                                               01810000
ATCAP12  EQU   ATCAOSM+20                                               01811000
ATCAP11  EQU   ATCAOSM+16                                               01812000
ATCCMTCB EQU   ATCAOSM+12                                               01813000
ATCPRPH  EQU   ATCAOSM+8                                                01814000
ATCGSRBF EQU   ATCGSRBG                                                 01815000
ATCSRBRT EQU   ATCAOSM                                                  01816000
@NM00060 EQU   @NM00059                                                 01817000
ATCVTMAB EQU   @NM00059                                                 01818000
@NM00058 EQU   ATCVTBAM                                                 01819000
ATCVDLOK EQU   ISTATCVT+904                                             01820000
ATCVFPAB EQU   ISTATCVT+872                                             01821000
ATCVDPAB EQU   ISTATCVT+840                                             01822000
ATCIOECB EQU   ISTATCVT+836                                             01823000
ATCINCW3 EQU   ISTATCVT+832                                             01824000
ATCMODTB EQU   ISTATCVT+828                                             01825000
ATCUSSPT EQU   ISTATCVT+824                                             01826000
ATCSRTAB EQU   ISTATCVT+820                                             01827000
@NM00057 EQU   ISTATCVT+819                                             01828000
@NM00056 EQU   ATCSTAT2                                                 01829000
ATCTRSMS EQU   ATCSTAT2                                                 01830000
ATCTRLOK EQU   ATCSTAT2                                                 01831000
ATCTRPSS EQU   ATCSTAT2                                                 01832000
ATCTRESC EQU   ATCSTAT2                                                 01833000
ATCTRAPI EQU   ATCSTAT2                                                 01834000
ATCNMCTR EQU   ISTATCVT+816                                             01835000
ATCSEC51 EQU   ATCSECST                                                 01836000
ATCSEC40 EQU   ATCSIPD+8                                                01837000
ATCSEC30 EQU   ATCSIPD+4                                                01838000
ATCSEC21 EQU   ATCSIPD                                                  01839000
ATCSEC10 EQU   ATCSOPD+4                                                01840000
ATCSEC01 EQU   ATCSOPD                                                  01841000
ATCPOIA  EQU   ATCRNO+1                                                 01842000
@NM00055 EQU   ATCRNO                                                   01843000
ATCPODVT EQU   ISTATCVT+784                                             01844000
ATCS49XL EQU   ISTATCVT+780                                             01845000
ATCS49XI EQU   ISTATCVT+776                                             01846000
ATCLCLCT EQU   ATCVLCNT+2                                               01847000
ATCRNCNT EQU   ATCVLCNT                                                 01848000
ATCCFEAD EQU   ISTATCVT+768                                             01849000
ATCPTR00 EQU   ISTATCVT+736                                             01850000
ATCRSV10 EQU   ISTATCVT+704                                             01851000
ATCTACB  EQU   ISTATCVT+700                                             01852000
ATCVTINM EQU   ISTATCVT+696                                             01853000
ATCTCLIM EQU   ISTATCVT+692                                             01854000
ATCTCLOM EQU   ISTATCVT+688                                             01855000
ATCVTIPB EQU   ISTATCVT+656                                             01856000
ATCTCIPB EQU   ISTATCVT+624                                             01857000
ATCTIPAB EQU   ISTATCVT+592                                             01858000
ATCOCCCB EQU   ISTATCVT+588                                             01859000
ATCOCCOB EQU   ISTATCVT+584                                             01860000
ATCCDLAD EQU   ISTATCVT+580                                             01861000
ATCCCLAD EQU   ISTATCVT+576                                             01862000
ATCDLRPB EQU   ISTATCVT+544                                             01863000
ATCPGPAB EQU   ISTATCVT+512                                             01864000
ATCVPAB1 EQU   ISTATCVT+480                                             01865000
ATCRSV97 EQU   ISTATCVT+476                                             01866000
ATCRDTLK EQU   ISTATCVT+472                                             01867000
ATCVOCLK EQU   ISTATCVT+468                                             01868000
ATCCDFDN EQU   ISTATCVT+464                                             01869000
ATCCDFIN EQU   ISTATCVT+460                                             01870000
ATCDVTLK EQU   ISTATCVT+456                                             01871000
ATCAP36  EQU   ISTATCVT+452                                             01872000
ATCAP35  EQU   ISTATCVT+448                                             01873000
ATCAP33  EQU   ISTATCVT+444                                             01874000
ATCRSV99 EQU   ISTATCVT+440                                             01875000
ATCONFIG EQU   ISTATCVT+432                                             01876000
ATCNODDS EQU   ISTATCVT+428                                             01877000
ATCNODEL EQU   ISTATCVT+420                                             01878000
ATCRSV69 EQU   ISTATCVT+416                                             01879000
ATCAPCR5 EQU   ISTATCVT+412                                             01880000
ATCLDECB EQU   ISTATCVT+408                                             01881000
ATCLDNCS EQU   ISTATCVT+404                                             01882000
ATCCDPTR EQU   ISTATCVT+400                                             01883000
ATCADEL  EQU   ISTATCVT+396                                             01884000
ATCTODVT EQU   ISTATCVT+392                                             01885000
ATCDEBCH EQU   ISTATCVT+388                                             01886000
ATCHBSIZ EQU   ATCHPGM+2                                                01887000
ATCHBFNO EQU   ATCHPGM                                                  01888000
ATCCRME  EQU   ISTATCVT+380                                             01889000
ATCRVCHS EQU   ISTATCVT+372                                             01890000
ATCECTLP EQU   ISTATCVT+368                                             01891000
ATCZDVTB EQU   ISTATCVT+364                                             01892000
ATCECPRT EQU   ISTATCVT+360                                             01893000
ATCVTLOD EQU   ISTATCVT+356                                             01894000
ATCTRPAB EQU   ISTATCVT+352                                             01895000
ATCMSGM  EQU   ISTATCVT+348                                             01896000
ATCMSGP  EQU   ISTATCVT+344                                             01897000
ATCEPT   EQU   ISTATCVT+340                                             01898000
ATCDVT   EQU   ISTATCVT+336                                             01899000
ATCTRCPT EQU   ISTATCVT+332                                             01900000
ATCDVLOD EQU   ISTATCVT+328                                             01901000
ATCALERT EQU   ISTATCVT+324                                             01902000
ATCEPA   EQU   ISTATCVT+320                                             01903000
ATCSAF   EQU   ISTATCVT+318                                             01904000
ATCXRANG EQU   ISTATCVT+317                                             01905000
ATCLAST  EQU   ATCSHRFG                                                 01906000
ATCSHRTN EQU   ISTATCVT+308                                             01907000
ATCUEP   EQU   ISTATCVT+304                                             01908000
ATCOCRT  EQU   ISTATCVT+300                                             01909000
ATCCSMA  EQU   ATCCSMR                                                  01910000
ATCESC02 EQU   ISTATCVT+292                                             01911000
ATCESC01 EQU   ISTATCVT+288                                             01912000
ATCCDFND EQU   ISTATCVT+284                                             01913000
ATCCDDEL EQU   ISTATCVT+280                                             01914000
ATCCDADD EQU   ISTATCVT+276                                             01915000
ATCMNT   EQU   ISTATCVT+272                                             01916000
ATCRSV16 EQU   ISTATCVT+270                                             01917000
ATCMAXID EQU   ISTATCVT+269                                             01918000
ATCMSGSP EQU   ATCCOM+268                                               01919000
ATCCIDM  EQU   ATCCOM+266                                               01920000
ATCACTRM EQU   ATCCOM+264                                               01921000
ATCNERAP EQU   ATCCOM+260                                               01922000
ATCNESAL EQU   ATCCOM+256                                               01923000
ATCRCC65 EQU   ATCCOM+252                                               01924000
ATCRCC26 EQU   ATCCOM+248                                               01925000
ATCRCC63 EQU   ATCCOM+244                                               01926000
ATCRSV11 EQU   ATCCOM+242                                               01927000
ATCVTMID EQU   ATCCOM+240                                               01928000
ATCAPOST EQU   ATCCOM+236                                               01929000
ATCNERFN EQU   ATCCOM+232                                               01930000
ATCNERNE EQU   ATCCOM+228                                               01931000
ATCNERCV EQU   ATCCOM+224                                               01932000
ATCNERST EQU   ATCCOM+220                                               01933000
ATCDCC61 EQU   ATCCOM+216                                               01934000
ATCDCC60 EQU   ATCCOM+212                                               01935000
ATCSRTDF EQU   ATCCOM+208                                               01936000
ATCSRTAD EQU   ATCCOM+204                                               01937000
ATCFIRA  EQU   ATCCOM+200                                               01938000
ATCSMBQ  EQU   ATCCOM+196                                               01939000
ATCSMRC  EQU   ATCCOM+192                                               01940000
ATCSMRS  EQU   ATCCOM+188                                               01941000
ATCSMQU  EQU   ATCCOM+184                                               01942000
ATCSMRQ  EQU   ATCCOM+180                                               01943000
ATCACDA  EQU   ATCCOM+176                                               01944000
ATCSTMA  EQU   ATCCOM+172                                               01945000
ATCFRSTR EQU   ATCCOM+168                                               01946000
ATCGTSTR EQU   ATCCOM+164                                               01947000
ATCREADA EQU   ATCCOM+160                                               01948000
ATCALOAD EQU   ATCCOM+156                                               01949000
ATCBLDLA EQU   ATCCOM+152                                               01950000
ATCFBRPH EQU   ATCCOM+148                                               01951000
ATCBFTRC EQU   ATCCOM+144                                               01952000
ATCTPBUF EQU   ATCTHTRC                                                 01953000
ATCREMOV EQU   ATCCOM+136                                               01954000
ATCADD   EQU   ATCCOM+132                                               01955000
ATCBPDA  EQU   ATCCOM+128                                               01956000
ATCDVTPT EQU   ATCCOM+124                                               01957000
ATCFEPT  EQU   ATCCOM+120                                               01958000
ATCFDVT  EQU   ATCCOM+116                                               01959000
ATCCONFT EQU   ATCCOM+112                                               01960000
ATCPTCHA EQU   ATCCOM+108                                               01961000
ATCAUTHA EQU   ATCCOM+104                                               01962000
ATCACCTA EQU   ATCCOM+100                                               01963000
ATCRDTH  EQU   ATCCOM+96                                                01964000
ATCFRSCH EQU   ATCCOM+92                                                01965000
ATCFSB   EQU   ATCCOM+88                                                01966000
ATCHLTMS EQU   ATCCOM+84                                                01967000
ATCECPRM EQU   ATCCOM+80                                                01968000
ATCECNET EQU   ATCCOM+76                                                01969000
ATCECOPC EQU   ATCCOM+72                                                01970000
ATCVPARM EQU   ATCCOM+68                                                01971000
ATCECVRQ EQU   ATCCOM+64                                                01972000
ATCECSES EQU   ATCCOM+60                                                01973000
ATCOCHA  EQU   ATCCOM+56                                                01974000
ATCDSPLQ EQU   ATCCOM+52                                                01975000
ATCECDSP EQU   ATCCOM+48                                                01976000
ATCVARYQ EQU   ATCCOM+44                                                01977000
ATCECVRY EQU   ATCCOM+40                                                01978000
ATCHALTQ EQU   ATCCOM+36                                                01979000
ATCECHLT EQU   ATCCOM+32                                                01980000
ATCMODQ  EQU   ATCCOM+28                                                01981000
ATCECMOD EQU   ATCCOM+24                                                01982000
ATCASCHD EQU   ATCCOM+20                                                01983000
ATCSRT   EQU   ATCCOM+16                                                01984000
ATCRDT   EQU   ATCCOM+12                                                01985000
ATCDCFRR EQU   ATCCOM+8                                                 01986000
ATCAPI   EQU   ATCCOM+4                                                 01987000
ATCRSV04 EQU   ATCSTAT4                                                 01988000
ATCVTTRC EQU   ATCSTAT4                                                 01989000
ATCNCSD  EQU   ATCSTAT4                                                 01990000
ATCMTST  EQU   ATCSTAT4                                                 01991000
ATCTPRT  EQU   ATCSTAT4                                                 01992000
ATCPRTAT EQU   ATCSTAT4                                                 01993000
@NM00054 EQU   ATCPOFLG                                                 01994000
ATCPOUNS EQU   ATCPOFLG                                                 01995000
ATCHSDMF EQU   ATCSTFLG                                                 01996000
@NM00053 EQU   ATCSTAT1                                                 01997000
ATCMDHLT EQU   ATCSTAT1                                                 01998000
ATCINHLT EQU   ATCSTAT1                                                 01999000
ATCNETSL EQU   ATCSTAT1                                                 02000000
ATCQKHLT EQU   ATCSTAT1                                                 02001000
ATCSNHLT EQU   ATCSTAT1                                                 02002000
ATCACTIV EQU   ATCSTAT1                                                 02003000
ATCSTART EQU   ATCSTAT1                                                 02004000
DYPPAB   EQU   ISTDYPAB+16                                              02005000
DYPRSV01 EQU   ISTDYPAB+12                                              02006000
DYPTSKID EQU   ISTDYPAB+8                                               02007000
DYPCHAIN EQU   ISTDYPAB+4                                               02008000
DYPFLGS  EQU   ISTDYPAB+2                                               02009000
DYPLNGTH EQU   ISTDYPAB+1                                               02010000
DYPTYPE  EQU   ISTDYPAB                                                 02011000
ZSAZTRAC EQU   ISTZSAVE+36                                              02012000
ZSAZSVRR EQU   ISTZSAVE+8                                               02013000
ZSAZSVFC EQU   ISTZSAVE+4                                               02014000
ZSAZACTV EQU   ZSAZSVMS                                                 02015000
ZSAF19RD EQU   ISTZ19SV+8                                               02016000
ZSAF19R1 EQU   ISTZ19SV+4                                               02017000
ZSAF19RV EQU   ISTZ19SV+1                                               02018000
ZSAFRSVS EQU   ZSAF19FG                                                 02019000
ZSAFSVRR EQU   ISTZFSAV+8                                               02020000
ZSAFSVFC EQU   ISTZFSAV+4                                               02021000
ZSAFSVBC EQU   ISTZFSAV                                                 02022000
LDNZS00F EQU   LDNZH003+1                                               02023000
LDNZS00E EQU   LDNZH003+1                                               02024000
LDNZS00D EQU   LDNZH003+1                                               02025000
LDNZS00C EQU   LDNZH003+1                                               02026000
LDNZS00B EQU   LDNZH003+1                                               02027000
LDNZS007 EQU   LDNZH003                                                 02028000
LDNZS006 EQU   LDNZH003                                                 02029000
LDNZS005 EQU   LDNZH003                                                 02030000
LDNZS004 EQU   LDNZH003                                                 02031000
LDNZS003 EQU   LDNZH003                                                 02032000
LDNZS002 EQU   LDNZH003                                                 02033000
LDNZS001 EQU   LDNZH003                                                 02034000
LDNZS000 EQU   LDNZH003                                                 02035000
LDNZX006 EQU   ISTLDNCB+576                                             02036000
LDNZC001 EQU   ISTLDNCB+569                                             02037000
LDNZX005 EQU   ISTLDNCB+568                                             02038000
LDNZV006 EQU   ISTLDNCB+564                                             02039000
@NM00052 EQU   LDNZSAV3+28                                              02040000
LDNRSV06 EQU   LDNZSAV4+16                                              02041000
LDNZSAV6 EQU   LDNZSAV4+12                                              02042000
LDNZSAV5 EQU   LDNZSAV4                                                 02043000
LDNZSAVE EQU   LDNZSAV3                                                 02044000
LDNZSAV2 EQU   ISTLDNCB+368                                             02045000
LDNZSAV1 EQU   ISTLDNCB+352                                             02046000
LDNZ3RR  EQU   ISTLDNCB+348                                             02047000
LDNZ2RR  EQU   ISTLDNCB+344                                             02048000
LDNZ1RR  EQU   ISTLDNCB+340                                             02049000
LDNRSV0B EQU   ISTLDNCB+336                                             02050000
LDNRSV0A EQU   ISTLDNCB+332                                             02051000
LDNRSV09 EQU   ISTLDNCB+328                                             02052000
LDNRSV08 EQU   ISTLDNCB+324                                             02053000
LDNRSV07 EQU   ISTLDNCB+320                                             02054000
LDNDEAD  EQU   LDNDCDEB+12                                              02055000
LDNUCBAD EQU   LDNDCDEB+8                                               02056000
LDNAPPAD EQU   LDNDCDEB+5                                               02057000
LDNEXSCL EQU   LDNDCDEB+4                                               02058000
LDNDCBAD EQU   LDNDCDEB+1                                               02059000
LDNDEBID EQU   LDNDCDEB                                                 02060000
LDNZRIND EQU   ISTLDNCB+300                                             02061000
LDNZTCP  EQU   ISTLDNCB+188                                             02062000
LDNZCHNC EQU   ISTLDNCB+187                                             02063000
LDNZLPC7 EQU   LDNZLPC                                                  02064000
LDNZLPC6 EQU   LDNZLPC                                                  02065000
LDNZLPC5 EQU   LDNZLPC                                                  02066000
LDNZLPC4 EQU   LDNZLPC                                                  02067000
LDNZLPC3 EQU   LDNZLPC                                                  02068000
LDNZLPC2 EQU   LDNZLPC                                                  02069000
LDNZLPC1 EQU   LDNZLPC                                                  02070000
LDNZLPC0 EQU   LDNZLPC                                                  02071000
LDNRSV05 EQU   LDNZERPF                                                 02072000
LDNZCTOV EQU   LDNZEPIN                                                 02073000
LDNZF001 EQU   LDNZEPIN                                                 02074000
LDNZFRDW EQU   LDNZCPAN                                                 02075000
LDNZFRD  EQU   LDNZCPAN                                                 02076000
LDNZNARD EQU   LDNZCPAN                                                 02077000
LDNRSV04 EQU   LDNZIOLK                                                 02078000
LDNZATBF EQU   LDNZIOLK                                                 02079000
LDNZERLK EQU   LDNZIOLK                                                 02080000
LDNZDSIC EQU   LDNZIOLK                                                 02081000
LDNZPAB1 EQU   ISTLDNCB+168                                             02082000
LDNZV005 EQU   ISTLDNCB+160                                             02083000
LDNZS1RR EQU   ISTLDNCB+132                                             02084000
LDNZS1FC EQU   ISTLDNCB+128                                             02085000
LDNZS1BC EQU   ISTLDNCB+124                                             02086000
LDNZFBUF EQU   ISTLDNCB+116                                             02087000
LDNZLAST EQU   ISTLDNCB+112                                             02088000
LDNRSV02 EQU   LDNFLAG2                                                 02089000
LDNZFF04 EQU   LDNFLAG2                                                 02090000
LDNZFF69 EQU   LDNFLAGS+2                                               02091000
LDNTPBIO EQU   LDNFLAGS+2                                               02092000
LDNZFF03 EQU   LDNFLAGS+2                                               02093000
LDNZFF02 EQU   LDNFLAGS+2                                               02094000
LDNZFF01 EQU   LDNFLAGS+2                                               02095000
LDNZFF00 EQU   LDNFLAGS+2                                               02096000
LDNCLOSD EQU   LDNFLAGS+2                                               02097000
LDNZENTR EQU   LDNFLAGS+2                                               02098000
LDNZICCW EQU   LDNFLAGS+1                                               02099000
LDNZREC  EQU   LDNFLAGS+1                                               02100000
LDNZCTXT EQU   LDNFLAGS+1                                               02101000
LDNZATLK EQU   LDNFLAGS+1                                               02102000
LDNZCHNE EQU   LDNFLAGS+1                                               02103000
LDNZATTP EQU   LDNFLAGS+1                                               02104000
LDNZIOBY EQU   LDNFLAGS+1                                               02105000
LDNZF00A EQU   LDNFLAGS+1                                               02106000
LDNZF009 EQU   LDNFLAGS                                                 02107000
LDNZF008 EQU   LDNFLAGS                                                 02108000
LDNZF007 EQU   LDNFLAGS                                                 02109000
LDNZF006 EQU   LDNFLAGS                                                 02110000
LDNZF005 EQU   LDNFLAGS                                                 02111000
LDNZF004 EQU   LDNFLAGS                                                 02112000
LDNZF003 EQU   LDNFLAGS                                                 02113000
LDNZF002 EQU   LDNFLAGS                                                 02114000
LDNZHDCC EQU   ISTLDNCB+106                                             02115000
LDNZARM  EQU   ISTLDNCB+104                                             02116000
LDNZRM   EQU   ISTLDNCB+102                                             02117000
LDNZRB   EQU   ISTLDNCB+100                                             02118000
LDNCPQ   EQU   ISTLDNCB+96                                              02119000
LDNSIOQ  EQU   ISTLDNCB+92                                              02120000
LDNZX002 EQU   ISTLDNCB+91                                              02121000
LDNZX001 EQU   ISTLDNCB+90                                              02122000
LDNZH002 EQU   ISTLDNCB+88                                              02123000
LDNZV001 EQU   ISTLDNCB+84                                              02124000
LDNZACSW EQU   ISTLDNCB+76                                              02125000
LDNZC002 EQU   ISTLDNCB+68                                              02126000
LDNCSWSV EQU   ISTLDNCB+60                                              02127000
LDNCHFLD EQU   ISTLDNCB+56                                              02128000
LDNRESRV EQU   ISTLDNCB+55                                              02129000
@NM00051 EQU   LDNCFLAG                                                 02130000
LDNRMF   EQU   LDNCFLAG                                                 02131000
LDNIBI   EQU   LDNCFLAG                                                 02132000
LDNTSAF  EQU   ISTLDNCB+52                                              02133000
LDNCUUA  EQU   ISTLDNCB+48                                              02134000
LDNCB    EQU   ISTLDNCB                                                 02135000
LOKXCL   EQU   @NM00049                                                 02136000
LOKPRY   EQU   @NM00049                                                 02137000
@NM00050 EQU   @NM00049                                                 02138000
@NM00048 EQU   LOKCHNG                                                  02139000
LOKCT    EQU   ISTLOK                                                   02140000
PABRPHA  EQU   PABRPHFG+1                                               02141000
PABNODQ  EQU   PABFLAGS                                                 02142000
PABINHBT EQU   PABFLAGS                                                 02143000
PABERLOK EQU   PABERRLK                                                 02144000
PABSSN   EQU   PABFLAGS                                                 02145000
PABDYNAM EQU   PABFLAGS                                                 02146000
PABNORPR EQU   PABFLAGS                                                 02147000
PABPRIOR EQU   PABFLAGS                                                 02148000
PABAPYP  EQU   PABFLAGS                                                 02149000
PABDVTA  EQU   ISTPAB+9                                                 02150000
PABOFFST EQU   ISTPAB+8                                                 02151000
PABCHNGP EQU   PABCHAIN+1                                               02152000
PABRSV02 EQU   PABCHAIN                                                 02153000
PABDELAY EQU   PABCHAIN                                                 02154000
PABRUNNG EQU   PABCHAIN                                                 02155000
PABRESET EQU   PABCHAIN                                                 02156000
PABUNCON EQU   PABCHAIN                                                 02157000
PABCDP   EQU   PABCHAIN                                                 02158000
PABRESCH EQU   PABCHAIN                                                 02159000
PABCHNG  EQU   PABCHAIN                                                 02160000
PABWEQP  EQU   PABWEQA+1                                                02161000
PABRSV01 EQU   PABWEQA                                                  02162000
PABWEQG  EQU   PABWEQA                                                  02163000
RPHNEXPO EQU   ISTRPH+104                                               02164000
RPHSAV16 EQU   RPHWORK+60                                               02165000
RPHSAV15 EQU   RPHWORK+56                                               02166000
RPHSAV14 EQU   RPHWORK+52                                               02167000
RPHSAV13 EQU   RPHWORK+48                                               02168000
RPHSAV12 EQU   RPHWORK+44                                               02169000
RPHSAV11 EQU   RPHWORK+40                                               02170000
RPHSAV10 EQU   RPHWORK+36                                               02171000
RPHSAVE9 EQU   RPHWORK+32                                               02172000
RPHSAVE8 EQU   RPHWORK+28                                               02173000
RPHSAVE7 EQU   RPHWORK+24                                               02174000
RPHSAVE6 EQU   RPHWORK+20                                               02175000
RPHSAVE5 EQU   RPHWORK+16                                               02176000
RPHSAVE4 EQU   RPHWORK+12                                               02177000
RPHSAVE3 EQU   RPHWORK+8                                                02178000
RPHSAVE2 EQU   RPHWORK+4                                                02179000
RPHSHALF EQU   RPHSAVE1+2                                               02180000
RPHSBIT8 EQU   RPHSBITS                                                 02181000
RPHSBIT7 EQU   RPHSBITS                                                 02182000
RPHSBIT6 EQU   RPHSBITS                                                 02183000
RPHSBIT5 EQU   RPHSBITS                                                 02184000
RPHSBIT4 EQU   RPHSBITS                                                 02185000
RPHSBIT3 EQU   RPHSBITS                                                 02186000
RPHSBIT2 EQU   RPHSBITS                                                 02187000
RPHSBIT1 EQU   RPHSBITS                                                 02188000
RPHSBYTE EQU   RPHSAVE1                                                 02189000
RPHPABQP EQU   RPHPABQA+1                                               02190000
RPHPABFG EQU   RPHPABQA                                                 02191000
RPHCRR   EQU   ISTRPH+32                                                02192000
RPHSRP34 EQU   RPHSRPRM+2                                               02193000
RPHSRP12 EQU   RPHSRPRM                                                 02194000
RPHWEGT  EQU   RPHCSPA                                                  02195000
RPHMAJCB EQU   ISTRPH+21                                                02196000
RPHPABOF EQU   ISTRPH+20                                                02197000
RPHRESUM EQU   RPHRESMA+1                                               02198000
RPHRSV01 EQU   RPHWPFLG                                                 02199000
RPHPURGE EQU   RPHWPFLG                                                 02200000
RPHPT    EQU   RPHWPFLG                                                 02201000
RPHWT    EQU   RPHWPFLG                                                 02202000
RPHRSKEY EQU   RPHWPFLG                                                 02203000
RPHDVTA  EQU   ISTRPH+12                                                02204000
RPHTIK   EQU   RPHTSKID+3                                               02205000
@NM00047 EQU   RPHTSKID                                                 02206000
RPHRPHAP EQU   RPHRPHA+1                                                02207000
@NM00046 EQU   RPHRPHA                                                  02208000
RPHGATE  EQU   RPHRPHA                                                  02209000
@NM00045 EQU   RPHFLGB                                                  02210000
RPHRLCRA EQU   RPHFLGB                                                  02211000
RPHNRSAV EQU   RPHFLGB                                                  02212000
RPHPGCMP EQU   RPHFLGB                                                  02213000
RPHFBAPS EQU   RPHFLGB                                                  02214000
RPHBSSP  EQU   RPHFLGB                                                  02215000
RPHLOCK  EQU   RPHFLGB                                                  02216000
RPHFNFLG EQU   RPHFSTLC                                                 02217000
RPHMLTCP EQU   RPHFLAGS                                                 02218000
RPHSMCLR EQU   RPHFLAGS                                                 02219000
RPHSMTYP EQU   RPHFLAGS                                                 02220000
RPHSMQ   EQU   RPHFLAGS                                                 02221000
RPHAUTEX EQU   RPHAPTYP                                                 02222000
RPHSPGIN EQU   RPHFLAGS                                                 02223000
RPHOGIND EQU   RPHFLAGS                                                 02224000
RPHLNGTH EQU   RPHCNTL+1                                                02225000
RPHTYPE  EQU   RPHCNTL                                                  02226000
NCBRSV01 EQU   ISTNCB+46                                                02227000
NCBSWDAF EQU   ISTNCB+44                                                02228000
NCBDEVCH EQU   ISTNCB+36                                                02229000
NCBFMCBP EQU   ISTNCB+32                                                02230000
NCBLTRC  EQU   ISTNCB+30                                                02231000
NCBRVPT1 EQU   ISTNCB+28                                                02232000
NCBNMLLN EQU   NCBFLAGS+3                                               02233000
@NM00044 EQU   NCBFLAG1                                                 02234000
NCBFORCE EQU   NCBFLAG1                                                 02235000
NCBTTF   EQU   NCBFLAG1                                                 02236000
NCBRSYNC EQU   NCBFLAG1                                                 02237000
NCBRSTRT EQU   NCBFLAG1                                                 02238000
NCBCONF  EQU   NCBFLAG1                                                 02239000
NCBSNAI  EQU   NCBFLAG1                                                 02240000
NCBFLTIO EQU   NCBFTRIO                                                 02241000
NCBCSTAT EQU   NCBFLAGS                                                 02242000
NCBNCSL  EQU   ISTNCB+22                                                02243000
NCBNCBA  EQU   ISTNCB+20                                                02244000
NCBFMCBA EQU   ISTNCB+16                                                02245000
NCBNSNA  EQU   ISTNCB+12                                                02246000
NCBTSKID EQU   ISTNCB+8                                                 02247000
NCBRDTE  EQU   ISTNCB+4                                                 02248000
NCBDAF   EQU   ISTNCB+2                                                 02249000
NCBLNGTH EQU   ISTNCB+1                                                 02250000
NCBTYPE  EQU   ISTNCB                                                   02251000
DEVRSV03 EQU   ISTDEVCH+5                                               02252000
DEVPHYSA EQU   ISTDEVCH+4                                               02253000
DEVCSLPN EQU   DEVCHAR3                                                 02254000
DEVCSTCL EQU   DEVCHAR3                                                 02255000
DEVCCHEK EQU   DEVCHAR3                                                 02256000
DEVCATTN EQU   DEVCHAR3                                                 02257000
DEVCSWL  EQU   DEVFCCTL                                                 02258000
DEVCRVB  EQU   DEVFCCTL                                                 02259000
DEVCSSL  EQU   DEVFCCTL                                                 02260000
DEVCBSC  EQU   DEVFCCTL                                                 02261000
DEVMCODE EQU   ISTDEVCH+2                                               02262000
DEVCHAR2 EQU   DEVTCODE                                                 02263000
DEVRSV01 EQU   DEVCHAR                                                  02264000
DEVCCTL  EQU   DEVCHAR                                                  02265000
DEVNNSPT EQU   DEVCHAR                                                  02266000
DEVSPS   EQU   DEVCHAR                                                  02267000
DEVSUBND EQU   DEVCHAR                                                  02268000
DEVCONVR EQU   DEVCHAR                                                  02269000
DEVOTPUT EQU   DEVCHAR                                                  02270000
DEVINPUT EQU   DEVCHAR                                                  02271000
FRRSPARM EQU   FRRSENTR+8                                               02272000
@NM00043 EQU   FRRSFLGS+1                                               02273000
@NM00042 EQU   FRRSFLG1                                                 02274000
FRRSRCUR EQU   FRRSFLG1                                                 02275000
FRRSFRRA EQU   FRRSENTR                                                 02276000
FRRSENTS EQU   FRRS+84                                                  02277000
FRRSRTMW EQU   FRRS+16                                                  02278000
FRRSLAST EQU   FRRSHEAD+4                                               02279000
@NM00017 EQU   SRBSECT+40                                               02280000
@NM00016 EQU   SRBSECT+38                                               02281000
SRBPRIOR EQU   SRBSECT+37                                               02282000
SRBPKF   EQU   SRBSECT+36                                               02283000
SRBSAVE  EQU   SRBSECT+32                                               02284000
SRBPARM  EQU   SRBSECT+28                                               02285000
SRBRMTR  EQU   SRBSECT+24                                               02286000
SRBEP    EQU   SRBSECT+20                                               02287000
SRBPTCB  EQU   SRBFLC+4                                                 02288000
SRBPASID EQU   SRBFLC+2                                                 02289000
SRBCPAFF EQU   SRBFLC                                                   02290000
SRBASCB  EQU   SRBSECT+8                                                02291000
SRBFLNK  EQU   SRBSECT+4                                                02292000
SRBID    EQU   SRBSECT                                                  02293000
CVTLEVL  EQU   CVTRELNO+2                                               02294000
CVTNUMB  EQU   CVTRELNO                                                 02295000
CVTMDL   EQU   CVTFIX+250                                               02296000
@NM00015 EQU   CVTFIX+248                                               02297000
@NM00014 EQU   CVTFIX                                                   02298000
CVTRV482 EQU   CVTXTNT2+128                                             02299000
CVTRV481 EQU   CVTXTNT2+124                                             02300000
CVTRV480 EQU   CVTXTNT2+120                                             02301000
CVTRV479 EQU   CVTXTNT2+118                                             02302000
CVTRV478 EQU   CVTXTNT2+117                                             02303000
CVTRV477 EQU   CVTXTNT2+116                                             02304000
CVTRV476 EQU   CVTXTNT2+115                                             02305000
CVTRV475 EQU   CVTXTNT2+114                                             02306000
CVTRV474 EQU   CVTRV466                                                 02307000
CVTRV473 EQU   CVTRV466                                                 02308000
CVTRV472 EQU   CVTRV466                                                 02309000
CVTRV471 EQU   CVTRV466                                                 02310000
CVTRV470 EQU   CVTRV466                                                 02311000
CVTRV469 EQU   CVTRV466                                                 02312000
CVTRV468 EQU   CVTRV466                                                 02313000
CVTRV467 EQU   CVTRV466                                                 02314000
CVTRV465 EQU   CVTRV457                                                 02315000
CVTRV464 EQU   CVTRV457                                                 02316000
CVTRV463 EQU   CVTRV457                                                 02317000
CVTRV462 EQU   CVTRV457                                                 02318000
CVTRV461 EQU   CVTRV457                                                 02319000
CVTRV460 EQU   CVTRV457                                                 02320000
CVTRV459 EQU   CVTRV457                                                 02321000
CVTRV458 EQU   CVTRV457                                                 02322000
CVTRV456 EQU   CVTXTNT2+108                                             02323000
CVTRV455 EQU   CVTXTNT2+104                                             02324000
CVTRV454 EQU   CVTXTNT2+100                                             02325000
CVTRV453 EQU   CVTXTNT2+96                                              02326000
CVTRV452 EQU   CVTXTNT2+94                                              02327000
CVTRV451 EQU   CVTXTNT2+92                                              02328000
CVTRV450 EQU   CVTXTNT2+90                                              02329000
CVTRV449 EQU   CVTXTNT2+88                                              02330000
CVTRV448 EQU   CVTXTNT2+87                                              02331000
CVTRV447 EQU   CVTXTNT2+86                                              02332000
CVTRV446 EQU   CVTRV438                                                 02333000
CVTRV445 EQU   CVTRV438                                                 02334000
CVTRV444 EQU   CVTRV438                                                 02335000
CVTRV443 EQU   CVTRV438                                                 02336000
CVTRV442 EQU   CVTRV438                                                 02337000
CVTRV441 EQU   CVTRV438                                                 02338000
CVTRV440 EQU   CVTRV438                                                 02339000
CVTRV439 EQU   CVTRV438                                                 02340000
CVTRV437 EQU   CVTRV429                                                 02341000
CVTRV436 EQU   CVTRV429                                                 02342000
CVTRV435 EQU   CVTRV429                                                 02343000
CVTRV434 EQU   CVTRV429                                                 02344000
CVTRV433 EQU   CVTRV429                                                 02345000
CVTRV432 EQU   CVTRV429                                                 02346000
CVTRV431 EQU   CVTRV429                                                 02347000
CVTRV430 EQU   CVTRV429                                                 02348000
CVTRV428 EQU   CVTXTNT2+80                                              02349000
CVTRV427 EQU   CVTXTNT2+76                                              02350000
CVTRV426 EQU   CVTXTNT2+72                                              02351000
CVTRV425 EQU   CVTXTNT2+68                                              02352000
CVTATACT EQU   CVTATCVT                                                 02353000
CVTRV423 EQU   CVTXTNT2+62                                              02354000
CVTRV422 EQU   CVTXTNT2+60                                              02355000
CVTRV421 EQU   CVTXTNT2+58                                              02356000
CVTRV420 EQU   CVTXTNT2+56                                              02357000
CVTRV419 EQU   CVTXTNT2+55                                              02358000
CVTRV418 EQU   CVTXTNT2+54                                              02359000
CVTRV417 EQU   CVTRV409                                                 02360000
CVTRV416 EQU   CVTRV409                                                 02361000
CVTRV415 EQU   CVTRV409                                                 02362000
CVTRV414 EQU   CVTRV409                                                 02363000
CVTRV413 EQU   CVTRV409                                                 02364000
CVTRV412 EQU   CVTRV409                                                 02365000
CVTRV411 EQU   CVTRV409                                                 02366000
CVTRV410 EQU   CVTRV409                                                 02367000
CVTRV408 EQU   CVTRV400                                                 02368000
CVTRV407 EQU   CVTRV400                                                 02369000
CVTRV406 EQU   CVTRV400                                                 02370000
CVTRV405 EQU   CVTRV400                                                 02371000
CVTRV404 EQU   CVTRV400                                                 02372000
CVTRV403 EQU   CVTRV400                                                 02373000
CVTRV402 EQU   CVTRV400                                                 02374000
CVTRV401 EQU   CVTRV400                                                 02375000
CVTICB   EQU   CVTXTNT2+48                                              02376000
CVTSKTA  EQU   CVTXTNT2+44                                              02377000
CVTSHSB  EQU   CVTSHS                                                   02378000
CVTRSV98 EQU   CVTXTNT2+36                                              02379000
CVTRSV97 EQU   CVTXTNT2+34                                              02380000
CVTRSV96 EQU   CVTXTNT2+32                                              02381000
CVTOLTEP EQU   CVTXTNT2+28                                              02382000
CVTQIDA  EQU   CVTQID+1                                                 02383000
CVTRSV95 EQU   CVTQID                                                   02384000
CVTRSV94 EQU   CVTXTNT2+20                                              02385000
CVTRSV93 EQU   CVTXTNT2+16                                              02386000
CVTRSV92 EQU   CVTXTNT2+12                                              02387000
CVTDEBVR EQU   CVTXTNT2+8                                               02388000
CVTRSV91 EQU   CVTXTNT2+6                                               02389000
CVTRSV9H EQU   CVTFLGBT                                                 02390000
CVTRSV9G EQU   CVTFLGBT                                                 02391000
CVTRSV9F EQU   CVTFLGBT                                                 02392000
CVTRSV9E EQU   CVTFLGBT                                                 02393000
CVTRSV9D EQU   CVTFLGBT                                                 02394000
CVTRSV9C EQU   CVTFLGBT                                                 02395000
CVTVME   EQU   CVTFLGBT                                                 02396000
CVTNPE   EQU   CVTFLGBT                                                 02397000
CVTNUCLS EQU   CVTXTNT2+4                                               02398000
CVTDSSVA EQU   CVTDSSV+1                                                02399000
CVTRSV89 EQU   CVTDSSV                                                  02400000
CVTRSV88 EQU   CVTXTNT1+8                                               02401000
CVTRSV87 EQU   CVTXTNT1+4                                               02402000
CVTFACHN EQU   CVTXTNT1                                                 02403000
CVTRV488 EQU   CVTMAP+412                                               02404000
CVTRV487 EQU   CVTMAP+408                                               02405000
CVTRV486 EQU   CVTMAP+404                                               02406000
CVTRV485 EQU   CVTMAP+400                                               02407000
CVTACTAP EQU   CVTMAP+396                                               02408000
CVTAUTH  EQU   CVTMAP+392                                               02409000
CVTATMCA EQU   CVTATMCT+1                                               02410000
CVTATMST EQU   CVTATMCT                                                 02411000
CVTRSV61 EQU   CVTMAP+384                                               02412000
CVTVOLT1 EQU   CVTVOLM1+1                                               02413000
CVTVOLI1 EQU   CVTVOLF1                                                 02414000
CVTSTOA  EQU   CVTMAP+376                                               02415000
CVTRSV58 EQU   CVTMAP+374                                               02416000
CVTRSV57 EQU   CVTMAP+372                                               02417000
CVTDDCE  EQU   CVTMAP+368                                               02418000
CVTPNWFR EQU   CVTMAP+364                                               02419000
CVTSMF   EQU   CVTMAP+360                                               02420000
CVTSULK  EQU   CVTMAP+358                                               02421000
CVTSLKO  EQU   CVTSYSK                                                  02422000
CVTSLKP  EQU   CVTSYSK                                                  02423000
CVTSLKQ  EQU   CVTSYSK                                                  02424000
CVTSLKR  EQU   CVTSYSK                                                  02425000
CVTRSV56 EQU   CVTSYSK                                                  02426000
CVTRSV55 EQU   CVTSYSK                                                  02427000
CVTRSV54 EQU   CVTSYSK                                                  02428000
CVTRSV53 EQU   CVTSYSK                                                  02429000
CVTRSV52 EQU   CVTA1F1                                                  02430000
CVTRSV51 EQU   CVTA1F1                                                  02431000
CVTRSV50 EQU   CVTA1F1                                                  02432000
CVTRSV49 EQU   CVTA1F1                                                  02433000
CVTRSV48 EQU   CVTA1F1                                                  02434000
CVTRSV47 EQU   CVTA1F1                                                  02435000
CVTSRSW  EQU   CVTA1F1                                                  02436000
CVTPFSW  EQU   CVTA1F1                                                  02437000
CVTPCVT  EQU   CVTMAP+352                                               02438000
CVTRSV46 EQU   CVTMAP+344                                               02439000
CVTRSV45 EQU   CVTMAP+340                                               02440000
CVTRSV44 EQU   CVTMAP+338                                               02441000
CVTRSV43 EQU   CVTMAP+336                                               02442000
CVTHJESA EQU   CVTHJES+1                                                02443000
CVTRSV42 EQU   CVTHJES                                                  02444000
CVTEXT2A EQU   CVTEXT2+1                                                02445000
CVTRSV41 EQU   CVTEXT2                                                  02446000
CVTAPFA  EQU   CVTAPF+1                                                 02447000
CVTRSV40 EQU   CVTAPF                                                   02448000
CVTRV518 EQU   CVTINTLA                                                 02449000
CVTRV517 EQU   CVTERPV                                                  02450000
CVTEORM  EQU   CVTMAP+312                                               02451000
CVTMCHPR EQU   CVTMAP+308                                               02452000
CVTTZ    EQU   CVTMAP+304                                               02453000
CVTJEPS  EQU   CVTMAP+300                                               02454000
CVTJESCT EQU   CVTMAP+296                                               02455000
CVTMODE  EQU   CVTMAP+292                                               02456000
CVTPTRV  EQU   CVTMAP+288                                               02457000
CVTREAL  EQU   CVTMAP+284                                               02458000
CVTRSV39 EQU   CVTMAP+280                                               02459000
CVTRSV38 EQU   CVTMAP+276                                               02460000
CVTDMSRA EQU   CVTDMSR+1                                                02461000
CVTRV634 EQU   CVTDMSRF                                                 02462000
CVTRV633 EQU   CVTDMSRF                                                 02463000
CVTRV632 EQU   CVTDMSRF                                                 02464000
CVTRV631 EQU   CVTDMSRF                                                 02465000
CVTRV630 EQU   CVTDMSRF                                                 02466000
CVTRV629 EQU   CVTDMSRF                                                 02467000
CVTUDUMP EQU   CVTDMSRF                                                 02468000
CVTSDUMP EQU   CVTDMSRF                                                 02469000
CVTQMSGA EQU   CVTQMSG+1                                                02470000
CVTRSV36 EQU   CVTQMSG                                                  02471000
CVTAMFF  EQU   CVTMAP+264                                               02472000
CVTPURGA EQU   CVTPURG+1                                                02473000
CVTRSV35 EQU   CVTPURG                                                  02474000
CVTCBSP  EQU   CVTMAP+256                                               02475000
CVTATERA EQU   CVTATER+1                                                02476000
CVTSYST  EQU   CVTATER                                                  02477000
CVTVOLT2 EQU   CVTTAT                                                   02478000
CVTVOLI2 EQU   CVTVOLF2                                                 02479000
CVTAQAVB EQU   CVTAQAVT+1                                               02480000
CVTRSV34 EQU   CVTTCMFG                                                 02481000
CVTRSV33 EQU   CVTTCMFG                                                 02482000
CVTRSV32 EQU   CVTTCMFG                                                 02483000
CVTRSV31 EQU   CVTTCMFG                                                 02484000
CVTRSV30 EQU   CVTTCMFG                                                 02485000
CVTRSV29 EQU   CVTTCMFG                                                 02486000
CVTRSV28 EQU   CVTTCMFG                                                 02487000
CVTTCRDY EQU   CVTTCMFG                                                 02488000
CVTGTFA  EQU   CVTGTF+1                                                 02489000
CVTRSV27 EQU   CVTGTFST                                                 02490000
CVTRNIO  EQU   CVTGTFST                                                 02491000
CVTUSR   EQU   CVTGTFST                                                 02492000
CVTRV318 EQU   CVTFORM                                                  02493000
CVTRV317 EQU   CVTTMODE                                                 02494000
CVTRV316 EQU   CVTSTATE                                                 02495000
CVTRV315 EQU   CVTGTFS                                                  02496000
CVTGTFAV EQU   CVTGTFS                                                  02497000
CVT0SCR1 EQU   CVTMAP+232                                               02498000
CVTRV515 EQU   CVTMAP+228                                               02499000
CVTRMS   EQU   CVTMAP+224                                               02500000
CVTPATCH EQU   CVTMAP+220                                               02501000
CVTTSCE  EQU   CVTMAP+216                                               02502000
CVTLNKSC EQU   CVTMAP+214                                               02503000
CVTQABST EQU   CVTMAP+212                                               02504000
CVTMDLDS EQU   CVTMAP+208                                               02505000
CVTUSER  EQU   CVTMAP+204                                               02506000
CVTABEND EQU   CVTMAP+200                                               02507000
CVTSMCA  EQU   CVTMAP+196                                               02508000
CVTRSV18 EQU   CVTMAP+192                                               02509000
CVTQLPAQ EQU   CVTMAP+188                                               02510000
CVTQCDSR EQU   CVTMAP+184                                               02511000
CVTRSV17 EQU   CVTOPTB                                                  02512000
CVTRSV16 EQU   CVTOPTB                                                  02513000
CVTFP    EQU   CVTOPTB                                                  02514000
CVTAPTHR EQU   CVTOPTB                                                  02515000
CVTNLOG  EQU   CVTOPTB                                                  02516000
CVTTOD   EQU   CVTOPTB                                                  02517000
CVTCTIMS EQU   CVTOPTB                                                  02518000
CVTPROT  EQU   CVTOPTB                                                  02519000
CVTXPFP  EQU   CVTOPTA                                                  02520000
CVTASCII EQU   CVTOPTA                                                  02521000
CVTRSV13 EQU   CVTOPTA                                                  02522000
CVTRSV12 EQU   CVTOPTA                                                  02523000
CVTNIP   EQU   CVTOPTA                                                  02524000
CVTDDR   EQU   CVTOPTA                                                  02525000
CVTAPR   EQU   CVTOPTA                                                  02526000
CVTCCH   EQU   CVTOPTA                                                  02527000
CVTSNCTR EQU   CVTMAP+180                                               02528000
CVTQMWR  EQU   CVTMAP+176                                               02529000
CVTQOCR  EQU   CVTMAP+172                                               02530000
CVT1EF00 EQU   CVTMAP+168                                               02531000
CVTMZ00  EQU   CVTMAP+164                                               02532000
CVTHEAD  EQU   CVTMAP+160                                               02533000
CVTRSV11 EQU   CVTMAP+156                                               02534000
CVT0PT01 EQU   CVTMAP+152                                               02535000
CVTMSER  EQU   CVTMAP+148                                               02536000
CVTRV516 EQU   CVTIERLC                                                 02537000
CVTILCH  EQU   CVTMAP+140                                               02538000
CVT0DS   EQU   CVTMAP+136                                               02539000
CVTFBOSV EQU   CVTMAP+132                                               02540000
CVTNUCB  EQU   CVTMAP+128                                               02541000
CVTIOQET EQU   CVTMAP+120                                               02542000
CVTDCBA  EQU   CVTMAP+117                                               02543000
CVTMVS2  EQU   CVTDCB                                                   02544000
CVT6DAT  EQU   CVTDCB                                                   02545000
CVT4MPS  EQU   CVTDCB                                                   02546000
CVTRSV09 EQU   CVTDCB                                                   02547000
CVT4MS1  EQU   CVTDCB                                                   02548000
CVT2SPS  EQU   CVTDCB                                                   02549000
CVT1SSS  EQU   CVTDCB                                                   02550000
CVTRSV08 EQU   CVTDCB                                                   02551000
CVTSTB   EQU   CVTMAP+112                                               02552000
CVTQTD00 EQU   CVTMAP+108                                               02553000
CVTQTE00 EQU   CVTMAP+104                                               02554000
CVTCUCB  EQU   CVTMAP+100                                               02555000
CVTSJQ   EQU   CVTMAP+96                                                02556000
CVTPBLDL EQU   CVTMAP+92                                                02557000
CVTTPC   EQU   CVTMAP+88                                                02558000
CVTSVDCB EQU   CVTMAP+84                                                02559000
CVTBRET  EQU   CVTMAP+82                                                02560000
CVTEXIT  EQU   CVTMAP+80                                                02561000
CVT0FN00 EQU   CVTMAP+76                                                02562000
CVTDARA  EQU   CVTDAR+1                                                 02563000
CVTRSV07 EQU   CVTFLGS1                                                 02564000
CVTRSV06 EQU   CVTFLGS1                                                 02565000
CVTRSV05 EQU   CVTFLGS1                                                 02566000
CVTRSV04 EQU   CVTFLGS1                                                 02567000
CVTRSV03 EQU   CVTFLGS1                                                 02568000
CVTRSV02 EQU   CVTFLGS1                                                 02569000
CVTRSV01 EQU   CVTFLGS1                                                 02570000
CVTDMPLK EQU   CVTFLGS1                                                 02571000
CVTXITP  EQU   CVTMAP+68                                                02572000
CVTZDTAB EQU   CVTMAP+64                                                02573000
CVTMSLT  EQU   CVTMAP+60                                                02574000
CVTDATE  EQU   CVTMAP+56                                                02575000
CVTBTERM EQU   CVTMAP+52                                                02576000
CVTSYSAD EQU   CVTMAP+48                                                02577000
CVTXTLER EQU   CVTMAP+44                                                02578000
CVTILK2  EQU   CVTMAP+40                                                02579000
CVTILK1  EQU   CVTMAP+36                                                02580000
CVTPRLTV EQU   CVTMAP+32                                                02581000
CVTPCNVT EQU   CVTMAP+28                                                02582000
CVT0VL00 EQU   CVTMAP+24                                                02583000
CVTXAPG  EQU   CVTMAP+20                                                02584000
CVTBUF   EQU   CVTMAP+16                                                02585000
CVTJOB   EQU   CVTMAP+12                                                02586000
CVTLINK  EQU   CVTMAP+8                                                 02587000
CVT0EF00 EQU   CVTMAP+4                                                 02588000
CVTTCBP  EQU   CVTMAP                                                   02589000
CVT      EQU   CVTMAP                                                   02590000
IOCOEND  EQU   IOCOM+128                                                02591000
IOCPATCH EQU   IOCOM+124                                                02592000
IOCUCBBM EQU   IOCOM+120                                                02593000
IOCQCNT  EQU   IOCOM+116                                                02594000
IOCIOSDQ EQU   IOCOM+112                                                02595000
IOCIOSEQ EQU   IOCOM+108                                                02596000
IOCSVCF  EQU   IOCOM+104                                                02597000
IOCTCCW  EQU   IOCOM+100                                                02598000
IOCRSVTB EQU   IOCOM+96                                                 02599000
IOCMFCNT EQU   IOCOM+92                                                 02600000
IOCMFHK  EQU   IOCOM+88                                                 02601000
IOCGENA  EQU   IOCOM+84                                                 02602000
IOCCCH   EQU   IOCOM+80                                                 02603000
IOCASYNQ EQU   IOCOM+76                                                 02604000
IOCLCHTB EQU   IOCOM+72                                                 02605000
IOCATTBL EQU   IOCOM+68                                                 02606000
IOCOMEX  EQU   IOCOM+64                                                 02607000
IOCSYNCH EQU   IOCOM+56                                                 02608000
IOCCATLK EQU   IOCOM+48                                                 02609000
IOCPRGID EQU   IOCOM+44                                                 02610000
IOCIOSCP EQU   IOCOM+40                                                 02611000
IOCORMGT EQU   IOCOM+36                                                 02612000
IOCVOID  EQU   IOCOM+32                                                 02613000
@NM00013 EQU   IOCOM+24                                                 02614000
@NM00012 EQU   IOCOM+20                                                 02615000
IOCINT   EQU   IOCOM+16                                                 02616000
IOCCTBL  EQU   IOCOM+12                                                 02617000
IOCHIO   EQU   IOCOM+8                                                  02618000
IOCPST   EQU   IOCOM+4                                                  02619000
IOCPGCT  EQU   IOCOM+2                                                  02620000
IOCVOICT EQU   IOCOM                                                    02621000
UCBERADR EQU   UCBUCS+12                                                02622000
UCBFCBID EQU   UCBUCS+8                                                 02623000
UCBERCNT EQU   UCBUCS+7                                                 02624000
UCBRSV51 EQU   UCBUCS+6                                                 02625000
UCBRSV50 EQU   UCBFCBOP                                                 02626000
UCBRSV49 EQU   UCBFCBOP                                                 02627000
UCBRSV48 EQU   UCBFCBOP                                                 02628000
UCBRSV47 EQU   UCBFCBOP                                                 02629000
UCBRSV46 EQU   UCBFCBOP                                                 02630000
UCBRSV45 EQU   UCBFCBOP                                                 02631000
UCBRSV44 EQU   UCBFCBOP                                                 02632000
UCBFCBO1 EQU   UCBFCBOP                                                 02633000
UCBUCSPE EQU   UCBUCSOP                                                 02634000
UCBRSV43 EQU   UCBUCSOP                                                 02635000
UCBRSV42 EQU   UCBUCSOP                                                 02636000
UCBRSV41 EQU   UCBUCSOP                                                 02637000
UCBRSV40 EQU   UCBUCSOP                                                 02638000
UCBRSV39 EQU   UCBUCSOP                                                 02639000
UCBUCSO2 EQU   UCBUCSOP                                                 02640000
UCBUCSO1 EQU   UCBUCSOP                                                 02641000
UCBUCSID EQU   UCBUCS                                                   02642000
UCBMDRBA EQU   UCBMDRBF+1                                               02643000
UCBRV075 EQU   UCBMDRBF                                                 02644000
UCBRV074 EQU   UCB3800X+32                                              02645000
UCBIMAGE EQU   UCB3800X+28                                              02646000
UCBFCBNM EQU   UCB3800X+24                                              02647000
UCBCHAR4 EQU   UCB3800X+20                                              02648000
UCBCHAR3 EQU   UCB3800X+16                                              02649000
UCBCHAR2 EQU   UCB3800X+12                                              02650000
UCBCHAR1 EQU   UCB3800X+8                                               02651000
UCBCGMID EQU   UCB3800X+4                                               02652000
UCBBRSTA EQU   UCBACTIV                                                 02653000
UCBRV063 EQU   UCBACTIV                                                 02654000
UCBRV062 EQU   UCBACTIV                                                 02655000
UCBRV061 EQU   UCBACTIV                                                 02656000
UCBRV060 EQU   UCBACTIV                                                 02657000
UCBRV059 EQU   UCBACTIV                                                 02658000
UCBRV058 EQU   UCBACTIV                                                 02659000
UCBRV057 EQU   UCBACTIV                                                 02660000
UCBRV050 EQU   UCB3800X+2                                               02661000
UCBCGMNO EQU   UCB3800X+1                                               02662000
UCBRV083 EQU   UCBOPTNS                                                 02663000
UCBBRSTR EQU   UCBOPTNS                                                 02664000
UCBRV056 EQU   UCBOPTNS                                                 02665000
UCBRV055 EQU   UCBOPTNS                                                 02666000
UCBRV054 EQU   UCBOPTNS                                                 02667000
UCBRV053 EQU   UCBOPTNS                                                 02668000
UCBRV052 EQU   UCBOPTNS                                                 02669000
UCBRV051 EQU   UCBOPTNS                                                 02670000
UCBRV073 EQU   UCB3540X+7                                               02671000
UCBRV072 EQU   UCBDKBYT                                                 02672000
UCBRV071 EQU   UCBDKBYT                                                 02673000
UCBRV070 EQU   UCBDKBYT                                                 02674000
UCBRV069 EQU   UCBDKBYT                                                 02675000
UCBRV068 EQU   UCBDKBYT                                                 02676000
UCBRV067 EQU   UCBDKBYT                                                 02677000
UCBVLVER EQU   UCBDKBYT                                                 02678000
UCBDKAMX EQU   UCBDKBYT                                                 02679000
UCBVLSER EQU   UCB3540X                                                 02680000
UCBRDATA EQU   UCBOCR+4                                                 02681000
UCBFRID  EQU   UCBOCR                                                   02682000
UCBCLN   EQU   UCBMT+14                                                 02683000
UCBERG   EQU   UCBMT+12                                                 02684000
UCBMS    EQU   UCBMT+11                                                 02685000
UCBNB    EQU   UCBMT+10                                                 02686000
UCBPW    EQU   UCBMT+9                                                  02687000
UCBPR    EQU   UCBMT+8                                                  02688000
UCBSIO   EQU   UCBMT+6                                                  02689000
UCBTW    EQU   UCBMT+5                                                  02690000
UCBTR    EQU   UCBMT+4                                                  02691000
UCBTWT   EQU   UCBMT+3                                                  02692000
UCBTRT   EQU   UCBMT+2                                                  02693000
UCBCTD   EQU   UCBMT                                                    02694000
UCBWTOID EQU   UCBCMEXT+17                                              02695000
UCBRV043 EQU   UCBCMEXT+16                                              02696000
UCBASID  EQU   UCBCMEXT+14                                              02697000
UCBMFCNT EQU   UCBCMEXT+12                                              02698000
UCBPMSK  EQU   UCBCMEXT+10                                              02699000
UCBCCWOF EQU   UCBCMEXT+8                                               02700000
UCBRV041 EQU   UCBCMEXT+6                                               02701000
UCBRV036 EQU   UCBFLP1                                                  02702000
UCBRV035 EQU   UCBFLP1                                                  02703000
UCBERLOG EQU   UCBFLP1                                                  02704000
UCBRV033 EQU   UCBFLP1                                                  02705000
UCBRV032 EQU   UCBFLP1                                                  02706000
UCBRV031 EQU   UCBFLP1                                                  02707000
UCBSHRUP EQU   UCBFLP1                                                  02708000
UCBNSRCH EQU   UCBFLP1                                                  02709000
UCBSNSCT EQU   UCBCMEXT+4                                               02710000
UCBHPDV  EQU   @NM00011                                                 02711000
UCBHALI  EQU   @NM00011                                                 02712000
UCBRSV09 EQU   @NM00011                                                 02713000
UCBRSV08 EQU   @NM00011                                                 02714000
UCBRSV07 EQU   @NM00011                                                 02715000
UCBRSV06 EQU   @NM00011                                                 02716000
UCBRSV05 EQU   @NM00011                                                 02717000
UCBRSV04 EQU   @NM00011                                                 02718000
UCBDTI   EQU   UCBCMEXT+2                                               02719000
UCBSTI   EQU   UCBCMEXT+1                                               02720000
UCBETI   EQU   UCBCMEXT                                                 02721000
UCBEXTP  EQU   UCBEXTPT+1                                               02722000
UCBDDRSW EQU   UCBFLC                                                   02723000
UCBTICBT EQU   UCBFLC                                                   02724000
UCBIVRR  EQU   UCBFLC                                                   02725000
UCBIVRS  EQU   UCBFLC                                                   02726000
UCBITF   EQU   UCBFLC                                                   02727000
UCBUDE   EQU   UCBFLC                                                   02728000
UCBWAA   EQU   UCBFLC                                                   02729000
UCBATTP  EQU   UCBFLC                                                   02730000
UCBUNTYP EQU   UCBTBYT4                                                 02731000
UCBRSV11 EQU   UCBDVCLS                                                 02732000
UCBRSV10 EQU   UCBDVCLS                                                 02733000
UCB3CHAR EQU   UCBDVCLS                                                 02734000
UCB3UREC EQU   UCBDVCLS                                                 02735000
UCB3DISP EQU   UCBDVCLS                                                 02736000
UCB3DACC EQU   UCBDVCLS                                                 02737000
UCB3COMM EQU   UCBDVCLS                                                 02738000
UCB3TAPE EQU   UCBDVCLS                                                 02739000
UCBDVPWR EQU   UCB2OPT7                                                 02740000
UCBVLPWR EQU   UCB2OPT6                                                 02741000
UCB2OPT5 EQU   UCBTBYT2                                                 02742000
UCBRVDEV EQU   UCBRWTAU                                                 02743000
UCBRPS   EQU   UCBDUDN2                                                 02744000
UCBRR    EQU   UCBDUDN1                                                 02745000
UCB2OPT1 EQU   UCBTBYT2                                                 02746000
UCB2OPT0 EQU   UCBTBYT2                                                 02747000
UCB1FEA7 EQU   UCBTBYT1                                                 02748000
UCBD6250 EQU   UCB1FEA6                                                 02749000
UCBD1600 EQU   UCB1FEA5                                                 02750000
UCB1FEA4 EQU   UCBTBYT1                                                 02751000
UCB1FEA3 EQU   UCBTBYT1                                                 02752000
UCB1FEA2 EQU   UCBTBYT1                                                 02753000
UCB1FEA1 EQU   UCBTBYT1                                                 02754000
UCB1FEA0 EQU   UCBTBYT1                                                 02755000
UCBNAME  EQU   UCBOB+13                                                 02756000
UCBRV029 EQU   UCBWGT                                                   02757000
UCBVHRSN EQU   UCBWGT                                                   02758000
UCBVORSN EQU   UCBWGT                                                   02759000
UCBMTPXP EQU   UCBWGT                                                   02760000
UCBREW   EQU   UCBWGT                                                   02761000
UCBPUB   EQU   UCBWGT                                                   02762000
UCBOUT   EQU   UCBWGT                                                   02763000
UCBIN    EQU   UCBWGT                                                   02764000
UCBCPU   EQU   UCBOB+11                                                 02765000
UCBLCI   EQU   UCBOB+10                                                 02766000
UCBCNT   EQU   UCBOB+9                                                  02767000
UCBRV017 EQU   UCBCHM1                                                  02768000
UCBRV016 EQU   UCBCHM1                                                  02769000
UCBRV015 EQU   UCBCHM1                                                  02770000
UCBRV014 EQU   UCBCHM1                                                  02771000
UCBSPB   EQU   UCBPTH1                                                  02772000
UCBPPB   EQU   UCBPTH1                                                  02773000
UCBSPA   EQU   UCBPTH0                                                  02774000
UCBPPA   EQU   UCBPTH0                                                  02775000
UCBSIGP  EQU   UCBFLB                                                   02776000
UCBVALPH EQU   UCBFLB                                                   02777000
UCBCRHSN EQU   UCBFLB                                                   02778000
UCBCRHRV EQU   UCBFLB                                                   02779000
UCBRESVH EQU   UCBFLB                                                   02780000
UCBSPST  EQU   UCBFLB                                                   02781000
UCBASNS  EQU   UCBFLB                                                   02782000
UCBIORST EQU   UCBFLB                                                   02783000
UCBNOTRC EQU   UCBCUB                                                   02784000
UCBUSING EQU   UCBPST                                                   02785000
UCBNOTRD EQU   UCBNRY                                                   02786000
UCBBUSYD EQU   UCBBSY                                                   02787000
UCBUA    EQU   UCBCHAN+1                                                02788000
UCBCHA   EQU   UCBCHAN                                                  02789000
UCBDADI  EQU   UCBSTAT                                                  02790000
UCBSYSR  EQU   UCBSTAT                                                  02791000
UCBPRES  EQU   UCBSTAT                                                  02792000
UCBALOC  EQU   UCBSTAT                                                  02793000
UCBUNLD  EQU   UCBSTAT                                                  02794000
UCBRESV  EQU   UCBSTAT                                                  02795000
UCBCHGS  EQU   UCBSTAT                                                  02796000
UCBONLI  EQU   UCBSTAT                                                  02797000
UCBID    EQU   UCBOB+2                                                  02798000
UCBALTPH EQU   UCBFL5                                                   02799000
UCBALTCU EQU   UCBFL5                                                   02800000
UCBNALOC EQU   UCBFL5                                                   02801000
UCBENVRD EQU   UCBFL5                                                   02802000
UCBVSDR  EQU   UCBFL5                                                   02803000
UCBSASK  EQU   UCBFL5                                                   02804000
UCBAMV   EQU   UCBAF                                                    02805000
UCBDCC   EQU   UCBFL5                                                   02806000
UCBMONT  EQU   UCBJBNR                                                  02807000
UCBRV011 EQU   UCBJBNR                                                  02808000
UCBRSV02 EQU   UCBJBNR                                                  02809000
UCBOLDSM EQU   UCBJBNR                                                  02810000
UCBRV003 EQU   UCBJBNR                                                  02811000
UCBDUC   EQU   UCBJBNR                                                  02812000
UCBJES3  EQU   UCBJBNR                                                  02813000
UCBVRDEV EQU   UCBJBNR                                                  02814000
UCBCMSEG EQU   UCBOB                                                    02815000
UCBPFXND EQU   UCB+512                                                  02816000
UCBIOQ   EQU   UCB+508                                                  02817000
UCBLOCK  EQU   UCB+504                                                  02818000
UCBPXST  EQU   UCB+504                                                  02819000
@NM00008 EQU   UCB                                                      02820000
IOSEND   EQU   IOSB+108                                                 02821000
IOSSKR   EQU   IOSEEKA+7                                                02822000
IOSSKH2  EQU   IOSSKHH+1                                                02823000
IOSSKH1  EQU   IOSSKHH                                                  02824000
IOSSKCC  EQU   IOSCCHH                                                  02825000
IOSSKBB  EQU   IOSEEKA+1                                                02826000
IOSSKM   EQU   IOSEEKA                                                  02827000
IOSEEK   EQU   IOSB+92                                                  02828000
IOSMDM   EQU   IOSB+91                                                  02829000
IOSMDB   EQU   IOSB+90                                                  02830000
IOSCKEY7 EQU   IOSCKEY                                                  02831000
IOSCKEY6 EQU   IOSCKEY                                                  02832000
IOSCKEY5 EQU   IOSCKEY                                                  02833000
IOSCKEY4 EQU   IOSCKEY                                                  02834000
@NM00004 EQU   IOSCKEY                                                  02835000
IOSFMSK  EQU   IOSB+88                                                  02836000
IOSCUDEV EQU   IOSPATH+1                                                02837000
@NM00003 EQU   IOSCHN                                                   02838000
IOSPATH3 EQU   IOSCHN                                                   02839000
IOSPATH2 EQU   IOSCHN                                                   02840000
IOSEXP   EQU   IOSCHN                                                   02841000
IOSGDP   EQU   IOSCHN                                                   02842000
IOSAFF   EQU   IOSB+85                                                  02843000
IOSRSS1B EQU   IOSB+84                                                  02844000
IOSDSID  EQU   IOSB+80                                                  02845000
IOSVST   EQU   IOSB+76                                                  02846000
IOSRST   EQU   IOSB+72                                                  02847000
IOSDIE   EQU   IOSB+68                                                  02848000
IOSABN   EQU   IOSB+64                                                  02849000
IOSNRM   EQU   IOSB+60                                                  02850000
IOSPCI   EQU   IOSB+56                                                  02851000
IOSPCHN  EQU   IOSB+48                                                  02852000
IOSSNS   EQU   IOSB+42                                                  02853000
IOSRES4A EQU   IOSB+36                                                  02854000
IOSUSE   EQU   IOSB+32                                                  02855000
IOSSRB   EQU   IOSB+28                                                  02856000
IOSCSWRC EQU   IOSCSW+5                                                 02857000
IOSTSB   EQU   IOSTATUS+1                                               02858000
IOSTSA   EQU   IOSTATUS                                                 02859000
IOSCSWCA EQU   IOSCSW                                                   02860000
IOSCC    EQU   @NM00002                                                 02861000
IOSOPT2X EQU   IOSOPT2                                                  02862000
IOSHTP   EQU   IOSOPT2                                                  02863000
IOSRELSE EQU   IOSOPT                                                   02864000
IOSTSLL  EQU   IOSOPT                                                   02865000
IOSNERP  EQU   IOSOPT                                                   02866000
IOSPSLL  EQU   IOSOPT                                                   02867000
IOSQISCE EQU   IOSOPT                                                   02868000
IOSDEP   EQU   IOSOPT                                                   02869000
IOSBYP   EQU   IOSOPT                                                   02870000
IOSCOD   EQU   IOSB+13                                                  02871000
IOSPKY7  EQU   IOSPKEY                                                  02872000
IOSPGDPX EQU   IOSPKEY                                                  02873000
IOSIDR   EQU   IOSPKEY                                                  02874000
IOSLCL   EQU   IOSPKEY                                                  02875000
@NM00001 EQU   IOSPKEY                                                  02876000
IOSPGAD  EQU   IOSB+8                                                   02877000
IOSASID  EQU   IOSB+6                                                   02878000
IOSPRLVL EQU   IOSB+5                                                   02879000
IOSDVRID EQU   IOSB+4                                                   02880000
IOSPROC  EQU   IOSB+3                                                   02881000
IOSFLC7  EQU   IOSFLC                                                   02882000
IOSFLC6  EQU   IOSFLC                                                   02883000
IOSRWAIT EQU   IOSFLC                                                   02884000
IOSTP    EQU   IOSFLC                                                   02885000
IOSCC3WE EQU   IOSFLC                                                   02886000
IOSVERIF EQU   IOSDVALT                                                 02887000
IOSDVMNT EQU   IOSFLC                                                   02888000
IOSLOG   EQU   IOSFLB                                                   02889000
IOSBDCST EQU   IOSFLB                                                   02890000
IOSMSG   EQU   IOSFLB                                                   02891000
IOSFLB4  EQU   IOSFLB                                                   02892000
IOSFLB3  EQU   IOSFLB                                                   02893000
IOSFLB2  EQU   IOSFLB                                                   02894000
IOSSDR   EQU   IOSFLB                                                   02895000
IOSDIESE EQU   IOSFLB                                                   02896000
IOSIOSB  EQU   IOSFLA                                                   02897000
IOSDOM   EQU   IOSFLA                                                   02898000
IOSEX    EQU   IOSFLA                                                   02899000
IOSSMDB  EQU   IOSFLA                                                   02900000
IOSSMDA  EQU   IOSFLA                                                   02901000
IOSERR   EQU   IOSFLA                                                   02902000
IOSCCHN  EQU   IOSACHN                                                  02903000
IOSDCHN  EQU   IOSACHN                                                  02904000
@NM00041 EQU   PSA+3668                                                 02905000
PSASTAK  EQU   PSA+3072                                                 02906000
@NM00040 EQU   PSA+1048                                                 02907000
PSAUSEND EQU   PSA+1048                                                 02908000
PSARV062 EQU   PSA+1044                                                 02909000
PSACDAL  EQU   PSA+1040                                                 02910000
PSAWTCOD EQU   PSA+1036                                                 02911000
PSAATCVT EQU   PSA+1032                                                 02912000
PSAPCPSW EQU   PSA+1024                                                 02913000
PSAPIR2  EQU   PSA+1020                                                 02914000
PSARV059 EQU   PSA+1018                                                 02915000
PSASVC13 EQU   PSA+1016                                                 02916000
PSALSFCC EQU   PSA+1012                                                 02917000
PSASFACC EQU   PSA+1008                                                 02918000
PSASTOP  EQU   PSA+992                                                  02919000
PSASTART EQU   PSA+976                                                  02920000
PSARSPSW EQU   PSA+968                                                  02921000
PSASRPSW EQU   PSA+960                                                  02922000
PSARV045 EQU   PSA+892                                                  02923000
PSARV044 EQU   PSA+888                                                  02924000
PSARV043 EQU   PSA+884                                                  02925000
PSARV042 EQU   PSA+880                                                  02926000
PSARV041 EQU   PSA+876                                                  02927000
PSARV040 EQU   PSA+872                                                  02928000
PSARV025 EQU   PSA+868                                                  02929000
PSADSSED EQU   PSA+868                                                  02930000
PSADSSPR EQU   PSA+864                                                  02931000
PSADSSFW EQU   PSA+860                                                  02932000
PSADSS14 EQU   PSA+856                                                  02933000
PSADSSPP EQU   PSA+848                                                  02934000
PSADSSRP EQU   PSA+840                                                  02935000
PSADSS05 EQU   PSADSSF4                                                 02936000
PSADSS10 EQU   PSADSSF4                                                 02937000
PSADSSVE EQU   PSADSSF4                                                 02938000
PSADSSDE EQU   PSADSSF4                                                 02939000
PSADSSC0 EQU   PSADSSF4                                                 02940000
PSADSSIE EQU   PSADSSF4                                                 02941000
PSADSS12 EQU   PSADSSF4                                                 02942000
PSADSSRC EQU   PSADSSF4                                                 02943000
PSARV057 EQU   PSADSSF3                                                 02944000
PSARV056 EQU   PSADSSF3                                                 02945000
PSARV055 EQU   PSADSSF3                                                 02946000
PSADSSMC EQU   PSADSSF3                                                 02947000
PSADSSRW EQU   PSADSSF3                                                 02948000
PSADSSNM EQU   PSADSSF3                                                 02949000
PSADSSES EQU   PSADSSF3                                                 02950000
PSADSSGP EQU   PSADSSF3                                                 02951000
PSADSSF2 EQU   PSADSSFL+1                                               02952000
PSADSSPI EQU   PSADSSF1                                                 02953000
PSADSSOI EQU   PSADSSF1                                                 02954000
PSADSSSP EQU   PSADSSF1                                                 02955000
PSADSSTP EQU   PSADSSF1                                                 02956000
PSADSSDW EQU   PSADSSF1                                                 02957000
PSADSSDD EQU   PSADSSF1                                                 02958000
PSADSSDM EQU   PSADSSF1                                                 02959000
PSADSSMV EQU   PSADSSF1                                                 02960000
PSADSSTS EQU   PSA+816                                                  02961000
PSADSSWK EQU   PSA+812                                                  02962000
PSADSSR3 EQU   PSA+808                                                  02963000
PSADSSR2 EQU   PSA+804                                                  02964000
PSADSSRS EQU   PSA+800                                                  02965000
PSASTOR  EQU   PSA+796                                                  02966000
PSACPUSA EQU   PSA+794                                                  02967000
PSAVSTAP EQU   PSA+792                                                  02968000
PSAWKVAP EQU   PSA+788                                                  02969000
PSAWKRAP EQU   PSA+784                                                  02970000
PSAMCHIC EQU   PSA+783                                                  02971000
PSARV061 EQU   PSA+782                                                  02972000
PSASYMSK EQU   PSA+781                                                  02973000
PSAMCHFL EQU   PSA+780                                                  02974000
PSACR0   EQU   PSA+776                                                  02975000
PSAPSWSV EQU   PSA+768                                                  02976000
PSACLHS  EQU   PSAHLHI                                                  02977000
PSALKR15 EQU   PSALKSA+60                                               02978000
PSALKR14 EQU   PSALKSA+56                                               02979000
PSALKR13 EQU   PSALKSA+52                                               02980000
PSALKR12 EQU   PSALKSA+48                                               02981000
PSALKR11 EQU   PSALKSA+44                                               02982000
PSALKR10 EQU   PSALKSA+40                                               02983000
PSALKR9  EQU   PSALKSA+36                                               02984000
PSALKR8  EQU   PSALKSA+32                                               02985000
PSALKR7  EQU   PSALKSA+28                                               02986000
PSALKR6  EQU   PSALKSA+24                                               02987000
PSALKR5  EQU   PSALKSA+20                                               02988000
PSALKR4  EQU   PSALKSA+16                                               02989000
PSALKR3  EQU   PSALKSA+12                                               02990000
PSALKR2  EQU   PSALKSA+8                                                02991000
PSALKR1  EQU   PSALKSA+4                                                02992000
PSALKR0  EQU   PSALKSA                                                  02993000
PSARV023 EQU   PSACLHT+52                                               02994000
PSALOCAL EQU   PSACLHT+48                                               02995000
PSACMSL  EQU   PSACLHT+44                                               02996000
PSAOPTL  EQU   PSACLHT+40                                               02997000
PSATPACL EQU   PSACLHT+36                                               02998000
PSATPDNL EQU   PSACLHT+32                                               02999000
PSATPNCL EQU   PSACLHT+28                                               03000000
PSAIOSLL EQU   PSACLHT+24                                               03001000
PSAIOSUL EQU   PSACLHT+20                                               03002000
PSAIOSCL EQU   PSACLHT+16                                               03003000
PSAIOSSL EQU   PSACLHT+12                                               03004000
PSASALCL EQU   PSACLHT+8                                                03005000
PSAASML  EQU   PSACLHT+4                                                03006000
PSADISPL EQU   PSACLHT                                                  03007000
PSASRSA  EQU   PSA+636                                                  03008000
PSARV050 EQU   PSA+634                                                  03009000
PSADSSGO EQU   PSA+633                                                  03010000
PSARECUR EQU   PSA+632                                                  03011000
PSAHLHIS EQU   PSA+628                                                  03012000
PSAIPCSA EQU   PSA+624                                                  03013000
@NM00039 EQU   PSA+621                                                  03014000
PSAIPCDM EQU   PSA+620                                                  03015000
PSAIPCD  EQU   PSA+616                                                  03016000
@NM00038 EQU   PSA+613                                                  03017000
PSAIPCRM EQU   PSA+612                                                  03018000
PSAIPCR  EQU   PSA+608                                                  03019000
PSAMCHEX EQU   PSA+600                                                  03020000
PSAMPSW  EQU   PSA+592                                                  03021000
PSAEXPS2 EQU   PSA+584                                                  03022000
PSAEXPS1 EQU   PSA+576                                                  03023000
PSAPIREG EQU   PSA+572                                                  03024000
PSARSREG EQU   PSA+568                                                  03025000
PSAGPREG EQU   PSA+556                                                  03026000
PSARV022 EQU   PSASUP4                                                  03027000
PSARV021 EQU   PSASUP4                                                  03028000
PSARV020 EQU   PSASUP4                                                  03029000
PSARV019 EQU   PSASUP4                                                  03030000
PSARV018 EQU   PSASUP4                                                  03031000
PSARV017 EQU   PSASUP4                                                  03032000
PSARV016 EQU   PSASUP4                                                  03033000
PSARV015 EQU   PSASUP4                                                  03034000
PSARV014 EQU   PSASUP3                                                  03035000
PSARV013 EQU   PSASUP3                                                  03036000
PSARV012 EQU   PSASUP3                                                  03037000
PSARV011 EQU   PSASUP3                                                  03038000
PSASPR   EQU   PSASUP3                                                  03039000
PSAPSREG EQU   PSASUP3                                                  03040000
PSAPI2   EQU   PSASUP3                                                  03041000
PSAIOSUP EQU   PSASUP3                                                  03042000
PSALCR   EQU   PSASUP2                                                  03043000
PSARTM   EQU   PSASUP2                                                  03044000
PSAACR   EQU   PSASUP2                                                  03045000
PSAIPCE2 EQU   PSASUP2                                                  03046000
PSAIPCES EQU   PSASUP2                                                  03047000
PSAIPCEC EQU   PSASUP2                                                  03048000
PSAGTF   EQU   PSASUP2                                                  03049000
PSAIPCRI EQU   PSASUP2                                                  03050000
PSARV063 EQU   PSASUP1                                                  03051000
PSATCTL  EQU   PSASUP1                                                  03052000
PSADISP  EQU   PSASUP1                                                  03053000
PSALOCK  EQU   PSASUP1                                                  03054000
PSAPI    EQU   PSASUP1                                                  03055000
PSAEXT   EQU   PSASUP1                                                  03056000
PSASVC   EQU   PSASUP1                                                  03057000
PSAIO    EQU   PSASUP1                                                  03058000
PSAAOLD  EQU   PSA+548                                                  03059000
PSAANEW  EQU   PSA+544                                                  03060000
PSATOLD  EQU   PSA+540                                                  03061000
PSATNEW  EQU   PSA+536                                                  03062000
PSALCCAR EQU   PSA+532                                                  03063000
PSALCCAV EQU   PSA+528                                                  03064000
PSAPCCAR EQU   PSA+524                                                  03065000
PSAPCCAV EQU   PSA+520                                                  03066000
PSACPULA EQU   PSA+518                                                  03067000
PSACPUPA EQU   PSA+516                                                  03068000
PSAPSA   EQU   PSA+512                                                  03069000
FLCHDEND EQU   PSA+512                                                  03070000
FLCCRSAV EQU   FLCMCLA+280                                              03071000
FLCGRSAV EQU   FLCMCLA+216                                              03072000
FLCFPSAV EQU   FLCMCLA+184                                              03073000
FLCFLA   EQU   FLCMCLA+88                                               03074000
FLCRGNCD EQU   FLCMCLA+84                                               03075000
FLCFSAA  EQU   FLCFSA+1                                                 03076000
@NM00037 EQU   FLCFSA                                                   03077000
@NM00036 EQU   FLCMCLA+72                                               03078000
FLCMCIC  EQU   FLCMCLA+64                                               03079000
@NM00035 EQU   FLCMCLA+20                                               03080000
FLCIOAA  EQU   FLCIOA+1                                                 03081000
@NM00034 EQU   FLCIOA                                                   03082000
@NM00033 EQU   FLCMCLA+15                                               03083000
@NM00032 EQU   FLCMCLA+14                                               03084000
@NM00031 EQU   FLCMCLA+12                                               03085000
FLCLCL   EQU   FLCMCLA+8                                                03086000
FLCIOELA EQU   FLCIOEL+1                                                03087000
@NM00030 EQU   FLCIOEL                                                  03088000
FLCCHNID EQU   FLCMCLA                                                  03089000
@NM00029 EQU   PSA+160                                                  03090000
FLCMTRCD EQU   PSA+157                                                  03091000
@NM00028 EQU   PSA+156                                                  03092000
FLCPERA  EQU   FLCPER+1                                                 03093000
@NM00027 EQU   FLCPER                                                   03094000
@NM00026 EQU   PSA+151                                                  03095000
FLCPERCD EQU   PSA+150                                                  03096000
FLCMCNUM EQU   PSA+149                                                  03097000
@NM00025 EQU   PSA+148                                                  03098000
FLCTEAA  EQU   FLCTEA+1                                                 03099000
@NM00024 EQU   FLCTEA                                                   03100000
PSAPIPC  EQU   PSAPICOD                                                 03101000
PSAPIMC  EQU   PSAPICOD                                                 03102000
PSAPIPER EQU   PSAPICOD                                                 03103000
PSARV049 EQU   FLCPICOD                                                 03104000
FLCPILCB EQU   FLCPIILC                                                 03105000
@NM00023 EQU   FLCPIILC                                                 03106000
@NM00022 EQU   PSAEPPSW                                                 03107000
FLCSVCN  EQU   PSAESPSW+2                                               03108000
FLCSILCB EQU   FLCSVILC                                                 03109000
@NM00021 EQU   FLCSVILC                                                 03110000
@NM00020 EQU   PSAESPSW                                                 03111000
FLCEICOD EQU   PSAEEPSW+2                                               03112000
PSASPAD  EQU   PSAEEPSW                                                 03113000
@NM00019 EQU   PSA+128                                                  03114000
FLCINPSW EQU   PSA+120                                                  03115000
FLCMNPSW EQU   PSA+112                                                  03116000
FLCPNPSW EQU   PSA+104                                                  03117000
FLCSNPSW EQU   PSA+96                                                   03118000
FLCENPSW EQU   PSA+88                                                   03119000
FLCTRACE EQU   PSA+84                                                   03120000
FLCTIMER EQU   PSA+80                                                   03121000
FLCCVT2  EQU   PSA+76                                                   03122000
FLCCAW   EQU   PSA+72                                                   03123000
FLCCSW   EQU   PSA+64                                                   03124000
FLCIOPSW EQU   PSA+56                                                   03125000
FLCMOPSW EQU   PSA+48                                                   03126000
FLCPOPSW EQU   PSA+40                                                   03127000
FLCSOPSW EQU   PSA+32                                                   03128000
FLCEOPSW EQU   PSA+24                                                   03129000
@NM00018 EQU   FLCICCW2+4                                               03130000
FLCCVT   EQU   FLCICCW2                                                 03131000
FLCICCW1 EQU   FLCROPSW                                                 03132000
FLCIPPSW EQU   FLCRNPSW                                                 03133000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03134000
@ENDDATA EQU   *                                                        03135000
         END   ISTZFMFA,(C'PLS2247',0603,78107)                         03136000
