         TITLE 'ISTZIFAB/AAB-VS1/MAB-VS2 - TPIOS COMMAND RESET PROCESSO*00001000
               OR       '                                               00002000
ISTZIFAB CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZIFAB  78.018'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
*                                                                  0406 00011000
*/* TPZSAVE (7,12,14) AC(ICAB)BASE                                   */ 00012000
*                                                                  0406 00013000
*   DO;                                                            0406 00014000
*     RFY                                                          0407 00015000
*      (GPR01P,                                                    0407 00016000
*       GPR12P,                                                    0407 00017000
*       GPR13P,                                                    0407 00018000
*       GPR14P) RSTD;                                              0407 00019000
*     GEN(PRINT OFF);                                              0408 00020000
*                                                                  0408 00021000
         PRINT OFF                                                      00022000
*/* ATBUILD (ISTZSAVE)                                               */ 00023000
*/* END OF ATBUILD                                                   */ 00024000
*                                                                  0409 00025000
*     GEN(PRINT ON);                                               0409 00026000
         PRINT ON                                                       00027000
*     RFY                                                          0410 00028000
*       ISTZSAVE BASED(GPR13P);                                    0410 00029000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0411 00030000
         STM   7,12,ZSAZSVVR+0(13)                                      00031000
*     GEN SETS(GPR12P);                                            0412 00032000
         BALR  GPR12P,0                                                 00033000
@TSTART  DS    0H                                                       00034000
         USING @TSTART,GPR12P                                           00035000
*     GEN(PRINT OFF);                                              0413 00036000
*                                                                  0413 00037000
         PRINT OFF                                                      00038000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00039000
*/* END OF ATBUILD                                                   */ 00040000
*                                                                  0414 00041000
*     GEN(PRINT ON);                                               0414 00042000
         PRINT ON                                                       00043000
*     GPR01P->RPHCRR->CRACRR->ZCREICAB='1'B;                       0415 00044000
         L     @09,RPHCRR(,GPR01P)                                 0415 00045000
         L     @09,CRACRR(,@09)                                    0415 00046000
         OI    ZCREICAB(@09),B'00010000'                           0415 00047000
*     ZSAZACTV='1'B;                                               0416 00048000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0416 00049000
*     ZSAZTRAC='ICAB';                                             0417 00050000
         MVC   ZSAZTRAC(4,GPR13P),@CC03706                         0417 00051000
*     ZSAZSVRR=GPR14P;                                             0418 00052000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0418 00053000
*     GPR13P=ZSAZSVFC;                                             0419 00054000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0419 00055000
*     RFY                                                          0420 00056000
*      (GPR01P) UNRSTD;                                            0420 00057000
*     RFY                                                          0421 00058000
*      (GPR14P) UNRSTD;                                            0421 00059000
*   END;                                                           0422 00060000
*                                                                  0422 00061000
*/* END TPZSAVE                                                      */ 00062000
*/* TPDEQ (,LSCFDBA)                                                 */ 00063000
*                                                                  0423 00064000
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */ 00065000
*     DCL                                                          0424 00066000
*       FMZCA020 BIT(32) CONSTANT('80000000'X);                    0424 00067000
*     DCL                                                          0425 00068000
*       FMZCB020 BIT(32) CONSTANT('7FFFFFFF'X);                    0425 00069000
*     RFY                                                          0426 00070000
*      (GPR00P,                                                    0426 00071000
*       GPR01P,                                                    0426 00072000
*       GPR14P,                                                    0426 00073000
*       GPR15P) RSTD;                                              0426 00074000
*     RFY                                                          0427 00075000
*       ISTWKE;                                                    0427 00076000
*     GPR15P=ADDR(LSCFDBA);         /* ADDRESS QUEUE POINTER         */ 00077000
         LA    GPR15P,LSCFDBA(,ELEMREG)                            0428 00078000
*     GPR14P=GPR15P->PABWEQA|FMZCA020;                             0429 00079000
         L     @09,@CF00850                                        0429 00080000
         L     GPR14P,PABWEQA(,GPR15P)                             0429 00081000
         OR    GPR14P,@09                                          0429 00082000
*     IF GPR14P=FMZCA020 THEN                                      0430 00083000
         CLR   GPR14P,@09                                          0430 00084000
         BE    @RT00430                                            0430 00085000
*       ;                                                          0431 00086000
*     ELSE                                                         0432 00087000
*       DO;                                                        0432 00088000
*FMZL1020:                                                         0433 00089000
*         ;                                                        0433 00090000
FMZL1020 DS    0H                                                  0434 00091000
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA020);                    0434 00092000
         B     @DE00434                                            0434 00093000
@DL00434 DS    0H                                                  0435 00094000
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0435 00095000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0435 00096000
*           GPR14P=GPR15P->PABWEQA;                                0436 00097000
         L     GPR14P,PABWEQA(,GPR15P)                             0436 00098000
*         END;                                                     0437 00099000
@DE00434 L     @09,@CF00850                                        0437 00100000
         CL    @09,WKECHAIN(,GPR14P)                               0437 00101000
         BNE   @DL00434                                            0437 00102000
*         GPR00P=FMZCA020;                                         0438 00103000
         LR    GPR00P,@09                                          0438 00104000
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0439 00105000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0439 00106000
*         BC(7,FMZL1020);                                          0440 00107000
         BC    7,FMZL1020                                          0440 00108000
*         GPR14P->WKECHAIN=0;                                      0441 00109000
         SLR   @09,@09                                             0441 00110000
         ST    @09,WKECHAIN(,GPR14P)                               0441 00111000
*       END;                                                       0442 00112000
*ISTA0020:                                                         0443 00113000
*     ;                                                            0443 00114000
@RT00430 DS    0H                                                  0443 00115000
ISTA0020 DS    0H                                                  0444 00116000
*     GPR14P=GPR14P&FMZCB020;                                      0444 00117000
         N     GPR14P,@CF00848                                     0444 00118000
*     GPR01P->RPHWEA=GPR14P;                                       0445 00119000
         ST    GPR14P,RPHWEA(,GPR01P)                              0445 00120000
*     RFY                                                          0446 00121000
*      (GPR00P,                                                    0446 00122000
*       GPR01P,                                                    0446 00123000
*       GPR14P,                                                    0446 00124000
*       GPR15P) UNRSTD;                                            0446 00125000
*   END;                            /* END TPDEQ GENERATION DEQ    0447 00126000
*                                      OLDEST FSB FROM WAITQ ELEMENT */ 00127000
*   IF(BDUCOMND=BCMDW&              /* IF A WRITE COMND      @ZA26355*/ 00128000
*       (BDUMODIF=BMODWC|           /* WITH                  @ZA26355*/ 00129000
*       BDUMODIF=BMODWCM|           /* ANY                   @ZA26355*/ 00130000
*       BDUMODIF=BMODWCT|           /* KIND                  @ZA26355*/ 00131000
*       BDUMODIF=BMODWCD|           /* OF CONTACT            @ZA26355*/ 00132000
*       BDUMODIF=BMODWCR)&          /* MODIFIER              @ZA26355*/ 00133000
*       FSBEXTRS^='00'X) THEN       /* &NON-ZERO EXT RESP    @ZA26355*/ 00134000
         LA    @14,62                                              0448 00135000
         ALR   @14,BFRREG                                          0448 00136000
         CLI   BDUCOMND(@14),X'02'                                 0448 00137000
         BNE   @RF00448                                            0448 00138000
         CLI   BDUMODIF(@14),X'08'                                 0448 00139000
         BE    @GL00001                                            0448 00140000
         CLI   BDUMODIF(@14),X'09'                                 0448 00141000
         BE    @GL00001                                            0448 00142000
         CLI   BDUMODIF(@14),X'0A'                                 0448 00143000
         BE    @GL00001                                            0448 00144000
         CLI   BDUMODIF(@14),X'0B'                                 0448 00145000
         BE    @GL00001                                            0448 00146000
         CLI   BDUMODIF(@14),X'0E'                                 0448 00147000
         BNE   @RF00448                                            0448 00148000
@GL00001 CLI   FSBEXTRS+16(BFRREG),X'00'                           0448 00149000
         BE    @RF00448                                            0448 00150000
*     FMCZFA06=ON;                  /* SET IN SESSION BIT    @ZA26355*/ 00151000
         OI    FMCZFA06(FMCBREG),B'00000100'                       0449 00152000
*   ELSE                                                           0450 00153000
*     ;                             /* OTHERWISE DON'T       @ZA26355*/ 00154000
@RF00448 DS    0H                                                  0451 00155000
*   IF FMCZH001=FMCZHF41 THEN       /* IF LINE STATE RESCHEDULE      */ 00156000
*                                                                  0451 00157000
         CLC   FMCZH001(2,FMCBREG),@CH02032                        0451 00158000
         BNE   @RF00451                                            0451 00159000
*     /***************************************************************/ 00160000
*     /*                                                             */ 00161000
*     /* SEGMENT(SEG000C)REQUEST                                     */ 00162000
*     /*                                                             */ 00163000
*     /***************************************************************/ 00164000
*                                                                  0452 00165000
*     DO;                                                          0452 00166000
*       GOTO SEG000C;                                              0453 00167000
         B     SEG000C                                             0453 00168000
*SEG000C#:                                                         0454 00169000
*     END;                                                         0454 00170000
*                                                                  0454 00171000
*   /*****************************************************************/ 00172000
*   /*                                                               */ 00173000
*   /*                                                       @XM09807*/ 00174000
*   /*                                                               */ 00175000
*   /*****************************************************************/ 00176000
*                                                                  0455 00177000
*                                   /* INITIALIZE FOR SHIPOUT AND SET   00178000
*                                      RETURN CODE           @XM09807*/ 00179000
*   ELSE                            /* FMCB LINE STATE NOT RESCHEDULE   00180000
*                                                            @XM09807*/ 00181000
*     DO;                           /* PROCESS COMND RESET@XM09807   */ 00182000
*                                                                  0455 00183000
         B     @RC00451                                            0455 00184000
@RF00451 DS    0H                                                  0456 00185000
*       /*************************************************************/ 00186000
*       /*                                                           */ 00187000
*       /* SEGMENT(SEG000J)REQUEST                                   */ 00188000
*       /*                                                           */ 00189000
*       /*************************************************************/ 00190000
*                                                                  0456 00191000
*       DO;                                                        0456 00192000
*         GOTO SEG000J;                                            0457 00193000
         B     SEG000J                                             0457 00194000
*SEG000J#:                                                         0458 00195000
*       END;                        /* CHECK FOR RESET ELEMENT TYPE     00196000
*                                                            @XL03HEK*/ 00197000
SEG000J# DS    0H                                                  0459 00198000
*       IF RCDREG=0 THEN            /* IF FEEDBACK TO BE SENT THEN   */ 00199000
*                                                                  0459 00200000
         LTR   RCDREG,RCDREG                                       0459 00201000
         BNZ   @RF00459                                            0459 00202000
*         /***********************************************************/ 00203000
*         /*                                                         */ 00204000
*         /* SEGMENT(SEG000D)REQUEST                                 */ 00205000
*         /*                                                         */ 00206000
*         /***********************************************************/ 00207000
*                                                                  0460 00208000
*         DO;                                                      0460 00209000
*           GOTO SEG000D;                                          0461 00210000
         B     SEG000D                                             0461 00211000
*SEG000D#:                                                         0462 00212000
*         END;                                                     0462 00213000
*                                                                  0462 00214000
*       /*************************************************************/ 00215000
*       /*                                                           */ 00216000
*       /*                                                   @XL03HCH*/ 00217000
*       /*                                                           */ 00218000
*       /*************************************************************/ 00219000
*                                                                  0463 00220000
*                                   /* SET UP FOR RESET FEEDBACK     */ 00221000
*       ELSE                                                       0463 00222000
*         ;                         /* RTN CD=4,NO FDBK      @XL03HCH*/ 00223000
@RF00459 DS    0H                                                  0464 00224000
*       IF FMCZF015=ON THEN         /* IS RESET CLEAN-UP PHASE-1   0464 00225000
*                                      COMPLETE?             @XL03HEK*/ 00226000
@RC00459 TM    FMCZF015(FMCBREG),B'00000100'                       0464 00227000
         BO    @RT00464                                            0464 00228000
*         ;                         /* YES, (NULL)           @XL03HEK*/ 00229000
*       ELSE                        /* NO                    @XL03HEK*/ 00230000
*         CALL ZRCZIFSB;            /* RESET CLEANUP PHASE-1 @XL03HEK*/ 00231000
         L     @15,ZRCZIFSB(,RCVTREG)                              0466 00232000
         BALR  @14,@15                                             0466 00233000
*       CALL IFAB000B;              /* CHECK END STATE AND SET RC    */ 00234000
@RT00464 BAL   @14,IFAB000B                                        0467 00235000
*     END;                          /* END COMND RESET PROCESS     0468 00236000
*                                                            @XM09807*/ 00237000
*/* TPZRETN                                                          */ 00238000
*                                                                  0469 00239000
*   DO;                                                            0469 00240000
@RC00451 DS    0H                                                  0470 00241000
*     RFY                                                          0470 00242000
*      (GPR07P,                                                    0470 00243000
*       GPR14P,                                                    0470 00244000
*       GPR15P) RSTD;                                              0470 00245000
*     GPR13P=ZSAZSVBC;                                             0471 00246000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0471 00247000
*     IF GPR13P=0 THEN                                             0472 00248000
         LTR   GPR13P,GPR13P                                       0472 00249000
         BZ    @RT00472                                            0472 00250000
*       ;                           /* TPDVTS ISTZFARR               */ 00251000
*     ELSE                                                         0474 00252000
*       GPR14P=ZSAZSVRR;                                           0474 00253000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0474 00254000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0475 00255000
@RT00472 DS    0H                                                  0475 00256000
         LM    7,12,ZSAZSVVR+0(13)                                      00257000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0476 00258000
         BR    GPR14P                                                   00259000
*     RFY                                                          0477 00260000
*      (GPR07P,                                                    0477 00261000
*       GPR14P,                                                    0477 00262000
*       GPR15P) UNRSTD;                                            0477 00263000
*   END;                                                           0478 00264000
*                                                                  0478 00265000
*/* END TPZRETN                                                      */ 00266000
*                                                                  0479 00267000
*                                                                  0479 00268000
*/********************************************************************/ 00269000
*/*                                                                  */ 00270000
*/* SUBROUTINE-                                                      */ 00271000
*/*      IFAB000A                                                    */ 00272000
*/*                                                                  */ 00273000
*/* FUNCTION-                                                        */ 00274000
*/*      1) THE FSB IS INITIALIZED                           @XL03HEK*/ 00275000
*/*      2) IF THE DEVICE IS A 3270 IN RECORD MODE, THEN     @XL03HEK*/ 00276000
*/*         ISTZDFQR IS CALLED TO BUILD A FID1 RESPONSE FSB, @XL03HEK*/ 00277000
*/*         AND THE FSB RETURN CODES ARE SET FOR PURGE.      @XL03HEK*/ 00278000
*/*      3) THE TPIOS FDB IS MOVED TO THE SYSTEM FDB.        @XL03HEK*/ 00279000
*/*                                                                  */ 00280000
*/********************************************************************/ 00281000
*                                                                  0479 00282000
*IFAB000A:                                                         0479 00283000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0479 00284000
IFAB000A DS    0H                                                  0480 00285000
*   RFY                                                            0480 00286000
*     LNKREG RSTD;                  /* TO SAVE RETURN ADDRESS        */ 00287000
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */ 00288000
         L     @09,RPHCRR(,RPHREG)                                 0481 00289000
         L     @09,CRACRR(,@09)                                    0481 00290000
         ST    LNKREG,ZCRSVF7(,@09)                                0481 00291000
*   RFY                                                            0482 00292000
*     LNKREG UNRSTD;                /* SAVED                         */ 00293000
*   IF LSCTYPE=LSTYPE THEN          /* IF ELEMENT IS A LSCB          */ 00294000
         CLI   LSCTYPE(ELEMREG),X'DF'                              0483 00295000
         BNE   @RF00483                                            0483 00296000
*     FSBLCPB=LSCLCPBA;             /* MOVE LCPB ADDRESS FROM LSCB   */ 00297000
         L     @14,LSCLCPBA(,ELEMREG)                              0484 00298000
         ST    @14,FSBLCPB+16(,BFRREG)                             0484 00299000
*   ELSE                            /* IF ELEMENT IS A LCPB          */ 00300000
*     FSBLCPB=ELEMREG;              /* SET ADDRESS IN FSB            */ 00301000
         B     @RC00483                                            0485 00302000
@RF00483 ST    ELEMREG,FSBLCPB+16(,BFRREG)                         0485 00303000
*   FSBLCCWA=LSCLCCWA;              /* SET LCCW ADDRESS IN FSB       */ 00304000
@RC00483 LA    @14,16                                              0486 00305000
         ALR   @14,BFRREG                                          0486 00306000
         L     @09,LSCLCCWA(,ELEMREG)                              0486 00307000
         ST    @09,FSBLCCWA(,@14)                                  0486 00308000
*   FSBSAF=BTUSORCE;                /* SET SOURCE ID IN FSB          */ 00309000
         LA    @09,48                                              0487 00310000
         ALR   @09,BFRREG                                          0487 00311000
         MVC   FSBSAF(2,@14),BTUSORCE(@09)                         0487 00312000
*   FSBDAF=BTUDEST;                 /* SET DESTINATION ID IN FSB     */ 00313000
         MVC   FSBDAF(2,@14),BTUDEST(@09)                          0488 00314000
*   IF FSBMJRCD=FRLOGICE THEN                                      0489 00315000
         CLI   FSBMJRCD(@14),X'08'                                 0489 00316000
         BE    @RT00489                                            0489 00317000
*     ;                             /* IF LOGIC ERROR IGNORE         */ 00318000
*   ELSE                            /* IF NOT LOGIC ERROR            */ 00319000
*     DO;                           /* INDICATE OPERATION COMPLETE   */ 00320000
*       FSBECI='1'B;                /* SET ON LAST FSB FOR LCCW      */ 00321000
*       FSBELI='1'B;                /* SET ON LAST FSB FOR LCPB      */ 00322000
         OI    FSBECI+16(BFRREG),B'11000000'                       0493 00323000
*     END;                          /* END OF FLAG SETTING           */ 00324000
*   IF ZCR3270R=ON THEN             /* 3270 IN RECORD MODE@XL03HEK   */ 00325000
@RT00489 L     @14,RPHCRR(,RPHREG)                                 0495 00326000
         L     @14,CRACRR(,@14)                                    0495 00327000
         TM    ZCR3270R(@14),B'00000010'                           0495 00328000
         BNO   @RF00495                                            0495 00329000
*     DO;                           /* YES                   @XL03HEK*/ 00330000
*       CALL ZPSZDFQR;              /* BUILD A FID1 RESPONSE FSB   0497 00331000
*                                                            @XL03HEK*/ 00332000
         L     @09,ATCZPSVT(,VTCVTREG)                             0497 00333000
         L     @15,ZPSZDFQR(,@09)                                  0497 00334000
         BALR  @14,@15                                             0497 00335000
*       FSBMJRCD=FRPURGE;           /* SET PURGE RC IN FSB@XL03HEK   */ 00336000
         LA    @14,16                                              0498 00337000
         ALR   @14,BFRREG                                          0498 00338000
         MVI   FSBMJRCD(@14),X'1C'                                 0498 00339000
*       FSBMNRCD=LSCZMIRC;          /* USE WQ ELEM MIN RC    @XL03HEK*/ 00340000
         MVC   FSBMNRCD(1,@14),LSCZMIRC(ELEMREG)                   0499 00341000
*     END;                          /*                       @XL03HEK*/ 00342000
*   ELSE                                                           0501 00343000
*     ;                             /* NOT RECORD 3270       @XL03HEK*/ 00344000
@RF00495 DS    0H                                                  0502 00345000
*   ZIBFDBS=ZIBFDBZ;                /* MOVE TPIOS FDB TO SYS FDB     */ 00346000
         MVC   ZIBFDBS(12,BFRREG),ZIBFDBZ(BFRREG)                  0502 00347000
*   ADDR(ZIBFDBS)->FDBOFSET=LENGTH(ZIBAIOCM)+LENGTH(ZIBFSB);/* SET 0503 00348000
*                                      BUFFER OFFSET IN FDB          */ 00349000
         LA    @14,48                                              0503 00350000
         LR    @09,BFRREG                                          0503 00351000
         ALR   @09,@14                                             0503 00352000
         STH   @14,FDBOFSET(,@09)                                  0503 00353000
*   RFY                                                            0504 00354000
*     LNKREG RSTD;                  /* TO RESTORE RETURN ADDRESS     */ 00355000
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */ 00356000
         L     @09,RPHCRR(,RPHREG)                                 0505 00357000
         L     @09,CRACRR(,@09)                                    0505 00358000
         L     LNKREG,ZCRSVF7(,@09)                                0505 00359000
*   RFY                                                            0506 00360000
*     LNKREG UNRSTD;                /* RESTORED                      */ 00361000
*   END IFAB000A;                   /* END OF SUBROUTINE             */ 00362000
@EL00002 DS    0H                                                  0507 00363000
@EF00002 DS    0H                                                  0507 00364000
@ER00002 BR    @14                                                 0507 00365000
*                                                                  0508 00366000
*/********************************************************************/ 00367000
*/*                                                                  */ 00368000
*/* SUBROUTINE-                                                      */ 00369000
*/*      IFAB000B                                                    */ 00370000
*/*                                                                  */ 00371000
*/* FUNCTION-                                                        */ 00372000
*/*      THIS ROUTINE DETERMINES IF THE CURRENT FEEDBACK BLOCK       */ 00373000
*/*      IS THE LAST ONE FOR THE ELEMENT.  IF IT IS, THE WAITQ       */ 00374000
*/*      ELEMENT IS DEQUEUED.  THE ELEMENT IS DISCARDED IF IT        */ 00375000
*/*      IS AN LSCB. AN LCPB MARKED FOR DEALLOCATION IS      @XL03HEK*/ 00376000
*/*      DISCARDED. IF NOT SO MARKED, AN LCPB IS LEFT FOR    @XL03HEK*/ 00377000
*/*      CONTROL LAYER.                                      @XL03HEK*/ 00378000
*/*      IF IT IS NOT THE LAST FSB FOR THE ELEMENT, THE ELEMENT'S    */ 00379000
*/*      FSB CHAIN IS SEARCHED FOR ANOTHER ELEMENT ALREADY THERE.    */ 00380000
*/*      AN APPROPRIATE RETURN CODE IS SET DEPENDING ON THE STATUS   */ 00381000
*/*      OF THE QUEUES.                                              */ 00382000
*/*                                                                  */ 00383000
*/********************************************************************/ 00384000
*                                                                  0508 00385000
*IFAB000B:                                                         0508 00386000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0508 00387000
IFAB000B DS    0H                                                  0509 00388000
*   RFY                                                            0509 00389000
*     LNKREG RSTD;                  /* TO SAVE RETURN ADDRESS        */ 00390000
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */ 00391000
         L     @09,RPHCRR(,RPHREG)                                 0510 00392000
         L     @09,CRACRR(,@09)                                    0510 00393000
         ST    LNKREG,ZCRSVF7(,@09)                                0510 00394000
*   RFY                                                            0511 00395000
*     LNKREG UNRSTD;                /* SAVED                         */ 00396000
*   IF ZCRLSTFB='1'B THEN           /* IF LAST FSB FOR ELEMENT       */ 00397000
         TM    ZCRLSTFB(@09),B'00000100'                           0512 00398000
         BNO   @RF00512                                            0512 00399000
*     DO;                           /* PROCESS LAST FSB              */ 00400000
*/*                                DEQUEUE OLDEST WAITQ ELEM @XL03HEK*/ 00401000
*                                                                  0514 00402000
*       CALL IFAB000G;              /*                       @XL03HEK*/ 00403000
         BAL   @14,IFAB000G                                        0514 00404000
*       IF LSCTYPE=LSTYPE THEN      /* IF ELEMENT IS A LSCB          */ 00405000
         CLI   LSCTYPE(ELEMREG),X'DF'                              0515 00406000
         BNE   @RF00515                                            0515 00407000
*         DO;                       /*                               */ 00408000
*           IF LSCSMODE=ON THEN     /* CHECK IF SET MODE WAS DONE  0517 00409000
*                                                            @XM08886*/ 00410000
         TM    LSCSMODE(ELEMREG),B'10000000'                       0517 00411000
         BNO   @RF00517                                            0517 00412000
*             ZCRSCANQ=ON;          /*                       @XM08886*/ 00413000
         L     @14,RPHCRR(,RPHREG)                                 0518 00414000
         L     @14,CRACRR(,@14)                                    0518 00415000
         OI    ZCRSCANQ(@14),B'00100000'                           0518 00416000
*           ELSE                                                   0519 00417000
*             ;                     /* DISCARD LSCB                  */ 00418000
@RF00517 DS    0H                                                  0520 00419000
*           ZCRPCOD1=0;             /* SET UP PARAMETERS             */ 00420000
         L     @14,RPHCRR(,RPHREG)                                 0520 00421000
         L     @14,CRACRR(,@14)                                    0520 00422000
         MVI   ZCRPCOD1(@14),X'00'                                 0520 00423000
*           ZCRPLSCB='1'B;          /* TO FREE LSCB                  */ 00424000
         OI    ZCRPLSCB(@14),B'00001000'                           0521 00425000
*           CALL ATCZPSVT->ZPSZDFB0;/* CALL BUFFER DEALLOCATION      */ 00426000
         L     @09,ATCZPSVT(,VTCVTREG)                             0522 00427000
         L     @15,ZPSZDFB0(,@09)                                  0522 00428000
         BALR  @14,@15                                             0522 00429000
*         END;                      /* LSCB DISCARDED                */ 00430000
*       ELSE                        /* ELEMENT IS A LCPB     @XL03HEK*/ 00431000
*         IF ZCRNXTEL=ON THEN       /* LCPB DEALLOC ON?      @XL03HEK*/ 00432000
*                                                                  0524 00433000
         B     @RC00515                                            0524 00434000
@RF00515 L     @14,RPHCRR(,RPHREG)                                 0524 00435000
         L     @14,CRACRR(,@14)                                    0524 00436000
         TM    ZCRNXTEL(@14),B'00010000'                           0524 00437000
         BNO   @RF00524                                            0524 00438000
*           /*********************************************************/ 00439000
*           /*                                                       */ 00440000
*           /* RELSTORE BUFADDR(ELEMREG)                             */ 00441000
*           /*                                                       */ 00442000
*           /*********************************************************/ 00443000
*                                                                  0525 00444000
*           DO;                                                    0525 00445000
*                                                                  0525 00446000
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */ 00447000
*/* END OF ATBUILD                                                   */ 00448000
*                                                                  0526 00449000
*             RFY                                                  0526 00450000
*              (GPR02P,                                            0526 00451000
*               GPR03P,                                            0526 00452000
*               GPR04P,                                            0526 00453000
*               GPR15P) RSTD;                                      0526 00454000
*             RFY                                                  0527 00455000
*              (GPR01P,                                            0527 00456000
*               GPR13P) RSTD;                                      0527 00457000
*             GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);   0528 00458000
          STM GPR02P,GPR13P,RPHWORK(GPR01P)                             00459000
*             RFY                                                  0529 00460000
*               GPR13P UNRSTD;                                     0529 00461000
*             GPR04P=ELEMREG;                                      0530 00462000
         LR    GPR04P,ELEMREG                                      0530 00463000
*             DCL                                                  0531 00464000
*               1 FMZA0030 FIXED(31) STATIC LOCAL,                 0531 00465000
*                2 * FIXED(8) INIT(64),                            0531 00466000
*                2 * PTR(24) INIT(0);                              0531 00467000
*             GPR03F=FMZA0030;                                     0532 00468000
         L     GPR03F,FMZA0030                                     0532 00469000
*             DO;                   /* LISATCVT                    0533 00470000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00471000
*               GPR15P=ATCLCPTR;    /* SET UP ATCVT POINTER          */ 00472000
         L     GPR15P,ATCLCPTR                                     0534 00473000
*             END;                  /* LISATCVT                      */ 00474000
*             GPR02P=GPR15P->ATCBPDA;                              0536 00475000
         L     GPR02P,ATCBPDA(,GPR15P)                             0536 00476000
*             GPR15P=GPR15P->ATCSMRS;                              0537 00477000
         L     GPR15P,ATCSMRS(,GPR15P)                             0537 00478000
*             DCL                                                  0538 00479000
*               FMZL0030 BASED(GPR15P) LABEL VALUERANGE(*);        0538 00480000
*             CALL FMZL0030;                                       0539 00481000
         BALR  @14,@15                                             0539 00482000
*             RFY                                                  0540 00483000
*               GPR13P RSTD;                                       0540 00484000
*             GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);   0541 00485000
          LM GPR02P,GPR13P,RPHWORK(GPR01P)                              00486000
*             RFY                                                  0542 00487000
*              (GPR01P,                                            0542 00488000
*               GPR13P) UNRSTD;                                    0542 00489000
*             RFY                                                  0543 00490000
*              (GPR02P,                                            0543 00491000
*               GPR03P,                                            0543 00492000
*               GPR04P,                                            0543 00493000
*               GPR15P) UNRSTD;                                    0543 00494000
*           END;                    /* *********END OF RELSTORE    0544 00495000
*                                      EXPANSION********* YES,     0544 00496000
*                                      DISCARD THE LCPB      @XL03HEK*/ 00497000
*         ELSE                                                     0545 00498000
*           ;                       /* KEEP LCPB             @XL03HEK*/ 00499000
@RF00524 DS    0H                                                  0546 00500000
*/*                                    CHK IF SCHED CNT HAS TO BE  0546 00501000
*                                     DECREMENTED            @XM08886*/ 00502000
*                                                                  0546 00503000
*       IF ZCRSCANQ=ON THEN                                        0546 00504000
@RC00515 L     @14,RPHCRR(,RPHREG)                                 0546 00505000
         L     @14,CRACRR(,@14)                                    0546 00506000
         TM    ZCRSCANQ(@14),B'00100000'                           0546 00507000
         BO    @RT00546                                            0546 00508000
*         ;                         /* IF CNTL CMND RESET DON'T    0547 00509000
*                                      DECRMT DNCB REQ CNT@XM08886   */ 00510000
*       ELSE                                                       0548 00511000
*         DNCACIP=DNCACIP-1;        /* DECRMT DNCB REQ CNT@XL03HCH   */ 00512000
         SLR   @14,@14                                             0548 00513000
         IC    @14,DNCACIP(,DNCBREG)                               0548 00514000
         BCTR  @14,0                                               0548 00515000
         STC   @14,DNCACIP(,DNCBREG)                               0548 00516000
*       RCDREG=ZCRSRCHQ;            /* SET RETURN CODE TO SEARCH   0549 00517000
*                                      WAITQ FOR WORK                */ 00518000
@RT00546 LA    RCDREG,16                                           0549 00519000
*     END;                          /* END LAST FSB PROCESSOR        */ 00520000
*   ELSE                            /* NOT LAST FSB FOR ELEMENT      */ 00521000
*     IF(LSCFDBA&MASKWORD)^=0 THEN  /* IF MORE FSB'S ON ELEMENT      */ 00522000
         B     @RC00512                                            0551 00523000
@RF00512 L     @14,LSCFDBA(,ELEMREG)                               0551 00524000
         N     @14,@CF03660                                        0551 00525000
         LTR   @14,@14                                             0551 00526000
         BZ    @RF00551                                            0551 00527000
*       DO;                         /* SET UP TO PROCESS NEXT ONE    */ 00528000
*/* TPFEL (,LSCFDBA) RETPTR(BFRREG)                                  */ 00529000
*                                                                  0553 00530000
*         DO;                       /* BEGIN TPFEL CODE GENERATION   */ 00531000
*           RFY                                                    0554 00532000
*            (GPR00P,                                              0554 00533000
*             GPR01P,                                              0554 00534000
*             GPR14P,                                              0554 00535000
*             GPR15P) RSTD;                                        0554 00536000
*           GPR15P=ADDR(LSCFDBA);   /* ADDRESS QUEUE POINTER         */ 00537000
         LA    GPR15P,LSCFDBA(,ELEMREG)                            0555 00538000
*           GPR14P=GPR15P->PABWEQA|FMZCA020;                       0556 00539000
         L     @09,@CF00850                                        0556 00540000
         L     GPR14P,PABWEQA(,GPR15P)                             0556 00541000
         OR    GPR14P,@09                                          0556 00542000
*           IF GPR14P=FMZCA020 THEN                                0557 00543000
         CLR   GPR14P,@09                                          0557 00544000
         BE    @RT00557                                            0557 00545000
*             ;                                                    0558 00546000
*           ELSE                                                   0559 00547000
*             DO;                                                  0559 00548000
*               GPR00P=FMZCA020;    /* INITIALIZE QUIT FLAG          */ 00549000
         L     GPR00P,@CF00850                                     0560 00550000
*               DO WHILE(GPR00P^=GPR14P->WKECHAIN);                0561 00551000
         B     @DE00561                                            0561 00552000
@DL00561 DS    0H                                                  0562 00553000
*                 GPR14P=GPR14P->WKECHAIN;/* SEARCH FOR END OF CHAIN */ 00554000
         L     GPR14P,WKECHAIN(,GPR14P)                            0562 00555000
*               END;                                               0563 00556000
@DE00561 C     GPR00P,WKECHAIN(,GPR14P)                            0563 00557000
         BNE   @DL00561                                            0563 00558000
*             END;                                                 0564 00559000
*           GPR14P=GPR14P&FMZCB020;                                0565 00560000
@RT00557 N     GPR14P,@CF00848                                     0565 00561000
*           BFRREG=GPR14P;                                         0566 00562000
         LR    BFRREG,GPR14P                                       0566 00563000
*           RFY                                                    0567 00564000
*            (GPR00P,                                              0567 00565000
*             GPR01P,                                              0567 00566000
*             GPR14P,                                              0567 00567000
*             GPR15P) UNRSTD;                                      0567 00568000
*         END;                      /* END TPFEL GENERATION ADDRESS     00569000
*                                      NEXT ELEMENT                  */ 00570000
*         BFRREG=BFRREG-LENGTH(ZIBAIOCM);/* POINT TO ELEMENT         */ 00571000
         SL    BFRREG,@CF01002                                     0569 00572000
*         RCDREG=ZCRMRFSB;          /* SET RETURN CODE TO PROCESS  0570 00573000
*                                      NEXT FSB                      */ 00574000
         LA    RCDREG,12                                           0570 00575000
*       END;                        /* END NEXT FSB PROCESS          */ 00576000
*     ELSE                          /* NO MORE FSB'S ON QUEUE        */ 00577000
*       RCDREG=ZCREXIT;             /* SET RETURN CODE TO EXIT       */ 00578000
         B     @RC00551                                            0572 00579000
@RF00551 LA    RCDREG,20                                           0572 00580000
*   RFY                                                            0573 00581000
*     LNKREG RSTD;                  /* TO RESTORE RETURN REGISTER    */ 00582000
@RC00551 DS    0H                                                  0573 00583000
@RC00512 DS    0H                                                  0574 00584000
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */ 00585000
         L     @09,RPHCRR(,RPHREG)                                 0574 00586000
         L     @09,CRACRR(,@09)                                    0574 00587000
         L     LNKREG,ZCRSVF7(,@09)                                0574 00588000
*   RFY                                                            0575 00589000
*     LNKREG UNRSTD;                /* RESTORED                      */ 00590000
*   END IFAB000B;                   /* END OF SUBROUTINE             */ 00591000
@EL00003 DS    0H                                                  0576 00592000
@EF00003 DS    0H                                                  0576 00593000
@ER00003 BR    @14                                                 0576 00594000
*                                                                  0577 00595000
*/********************************************************************/ 00596000
*/*                                                                  */ 00597000
*/* SEGMENT-                                                         */ 00598000
*/*      SEG000C                                                     */ 00599000
*/*                                                                  */ 00600000
*/* FUNCTION-                                                        */ 00601000
*/*      THIS SUBROUTINE RESCHEDULES REQUESTS THAT WERE              */ 00602000
*/*      UNINTENTIONALLY CANCELLED DUE TO A RESET BEING ISSUED.      */ 00603000
*/*                                                                  */ 00604000
*/********************************************************************/ 00605000
*                                                                  0577 00606000
*   /*****************************************************************/ 00607000
*   /*                                                               */ 00608000
*   /* SEGMENT(SEG000C)START                                         */ 00609000
*   /*                                                               */ 00610000
*   /*****************************************************************/ 00611000
*                                                                  0577 00612000
*   DO;                                                            0577 00613000
*     GOTO SEG000C@;                                               0578 00614000
*SEG000C:                                                          0579 00615000
*   END;                                                           0579 00616000
SEG000C  DS    0H                                                  0580 00617000
*   FDBDATAA=ADDR(ZIBBTU);          /* SET DATA ADDRESS IN FDB       */ 00618000
         LA    @14,ZIBBTU(,BFRREG)                                 0580 00619000
         ST    @14,FDBDATAA(,BFRREG)                               0580 00620000
*   FDBDATCT=FDBDATCT+LENGTH(ISTBTU);/* SET DATA LENGTH IN FDB       */ 00621000
         LA    @14,20                                              0581 00622000
         AH    @14,FDBDATCT(,BFRREG)                               0581 00623000
         STH   @14,FDBDATCT(,BFRREG)                               0581 00624000
*   BTUSYSTR=0;                     /* CLEAR SYSTEM RESPONSE FIELD   */ 00625000
         LA    @14,48                                              0582 00626000
         ALR   @14,BFRREG                                          0582 00627000
         MVI   BTUSYSTR(@14),X'00'                                 0582 00628000
*   BTUEXTR=0;                      /* CLEAR EXTENDED RESPONSE FLD   */ 00629000
         MVI   BTUEXTR(@14),X'00'                                  0583 00630000
*   BTUFID=THSET;                   /* INIT TH BYTES 1&2     @XL03HAH*/ 00631000
         MVC   BTUFID(2,@14),@CB03658                              0584 00632000
*   BTURH=0;                        /* INIT REQUEST HEADR    @XL03HAH*/ 00633000
         SLR   @09,@09                                             0585 00634000
         STCM  @09,15,BTURH(@14)                                   0585 00635000
*   BTUDCF=LENGTH(BTURH)+LENGTH(BTUSYSTR)+LENGTH(BTUEXTR)+LENGTH(ISTBDU 00636000
*       );                          /* INITIALIZE COUNT      @XL03HAH*/ 00637000
         MVC   BTUDCF(2,@14),@CH02866                              0586 00638000
*   CALL ATCZFSVT->ZFSZEFBB;        /* CALL SHIPOUT                  */ 00639000
         L     @09,ATCZFSVT(,VTCVTREG)                             0587 00640000
         L     @15,ZFSZEFBB(,@09)                                  0587 00641000
         BALR  @14,@15                                             0587 00642000
*   LSCZRT03='0'B;                  /* TURN OFF LINE STATE ANALYSIS     00643000
*                                      FLAG                          */ 00644000
         NI    LSCZRT03(ELEMREG),B'11101111'                       0588 00645000
*   IF(FMCLCPBQ&MASKWORD)=ELEMREG THEN/* IF ONLY ONE ELEM ON WAITQ   */ 00646000
         L     @14,FMCLCPBQ(,FMCBREG)                              0589 00647000
         N     @14,@CF03660                                        0589 00648000
         CR    @14,ELEMREG                                         0589 00649000
         BNE   @RF00589                                            0589 00650000
*     FMCZH001=FMCZHF31;            /* SET LINE STATE TO NULL        */ 00651000
         SLR   @14,@14                                             0590 00652000
         STH   @14,FMCZH001(,FMCBREG)                              0590 00653000
*   ELSE                                                           0591 00654000
*     ;                             /* OTHERWISE DON'T               */ 00655000
@RF00589 DS    0H                                                  0592 00656000
*   RCDREG=ZCREXIT;                 /* SET RETURN CODE TO EXIT       */ 00657000
*                                                                  0592 00658000
         LA    RCDREG,20                                           0592 00659000
*   /*****************************************************************/ 00660000
*   /*                                                               */ 00661000
*   /* SEGMENT(SEG000C)FINISH                                        */ 00662000
*   /*                                                               */ 00663000
*   /*****************************************************************/ 00664000
*                                                                  0593 00665000
*   DO;                                                            0593 00666000
*     GOTO SEG000C#;                                               0594 00667000
         B     SEG000C#                                            0594 00668000
*SEG000C@:                                                         0595 00669000
*   END;                                                           0595 00670000
SEG000C@ DS    0H                                                  0596 00671000
*                                                                  0596 00672000
*/********************************************************************/ 00673000
*/*                                                                  */ 00674000
*/* SEGMENT-                                                         */ 00675000
*/*      SEG000D                                                     */ 00676000
*/*                                                                  */ 00677000
*/* FUNCTION-                                                        */ 00678000
*/*      THIS SUBROUTINE INSURES THAT FEEDBACK IS ONLY SHIPPED       */ 00679000
*/*      FOR THE FIRST ELEMENT ENCOUNTERED THAT HAS BEEN RESET FOR   */ 00680000
*/*      A LCPB.  THE FIRST ELEMENT ENCOUNTERED IS FED BACK TO THE   */ 00681000
*/*      CONTROL LAYER, AND ALL OTHERS ARE DISCARDED UNTIL A         */ 00682000
*/*      LCPB IS ENCOUNTERED.                                        */ 00683000
*/*        IF AN LCPB ON THE ATOP IS ENCOUNTERED, THE LCPB   @XL03HEK*/ 00684000
*/*      DEALLOCATION SWITCH (IN THE ZCR) IS SET ON.         @XL03HEK*/ 00685000
*/*                                                                  */ 00686000
*/********************************************************************/ 00687000
*                                                                  0596 00688000
*   /*****************************************************************/ 00689000
*   /*                                                               */ 00690000
*   /* SEGMENT(SEG000D)START                                         */ 00691000
*   /*                                                               */ 00692000
*   /*****************************************************************/ 00693000
*                                                                  0596 00694000
*   DO;                                                            0596 00695000
*     GOTO SEG000D@;                                               0597 00696000
         B     SEG000D@                                            0597 00697000
*SEG000D:                                                          0598 00698000
*   END;                                                           0598 00699000
SEG000D  DS    0H                                                  0599 00700000
*   ZCRLSTFB='1'B;                  /* INDICATE LAST FSB FOR ELEM    */ 00701000
*   ZCRNXTEL=OFF;                   /* SET OFF DEALLOCATE LCPB SWITCH   00702000
*                                                            @XL03HEK*/ 00703000
         L     @14,RPHCRR(,RPHREG)                                 0600 00704000
         L     @14,CRACRR(,@14)                                    0600 00705000
         OI    ZCRLSTFB(@14),B'00000100'                           0600 00706000
         NI    ZCRNXTEL(@14),B'11101111'                           0600 00707000
*   IF FMCZF014='1'B THEN           /* IF RESET ALREADY REPORTED     */ 00708000
         TM    FMCZF014(FMCBREG),B'00001000'                       0601 00709000
         BNO   @RF00601                                            0601 00710000
*     DO;                           /* CLEAR ANY FLUKY FEEDBACK      */ 00711000
*       CALL IFAB000I;              /* DEALLOC BUFFERS       @XL03HEK*/ 00712000
         BAL   @14,IFAB000I                                        0603 00713000
*       IF LCPATOP=ON THEN          /* LCPB ON ATOP?         @XL03HEK*/ 00714000
         TM    LCPATOP(ELEMREG),B'00000001'                        0604 00715000
         BNO   @RF00604                                            0604 00716000
*         ZCRNXTEL=ON;              /* YES, SET ON LCPB DEALLOC FLAG    00717000
*                                                            @XL03HEK*/ 00718000
         L     @14,RPHCRR(,RPHREG)                                 0605 00719000
         L     @14,CRACRR(,@14)                                    0605 00720000
         OI    ZCRNXTEL(@14),B'00010000'                           0605 00721000
*       ELSE                        /* LCPB NOT ON ATOP      @XL03HEK*/ 00722000
*         IF LSCTYPE=LSTYPE THEN                                   0606 00723000
         B     @RC00604                                            0606 00724000
@RF00604 CLI   LSCTYPE(ELEMREG),X'DF'                              0606 00725000
         BE    @RT00606                                            0606 00726000
*           ;                       /* IGNORE LSCB                   */ 00727000
*         ELSE                      /* PROCESS FEEDBACK              */ 00728000
*           DO;                     /* SAVED IN FMCZV004             */ 00729000
*             FMCZF014='0'B;        /* CLEAR RESET REPORT FLAG       */ 00730000
         NI    FMCZF014(FMCBREG),B'11110111'                       0609 00731000
*             BFRREG=FMCZV004;      /* ADDRESS SAVED BUFFER          */ 00732000
         L     BFRREG,FMCZV004(,FMCBREG)                           0610 00733000
*             FMCZV004=0;           /* CLEAR SAVED ZOB POINTER       */ 00734000
         SLR   @14,@14                                             0611 00735000
         ST    @14,FMCZV004(,FMCBREG)                              0611 00736000
*/*                                        QUEUE FSB TO CLIP @XL03HEK*/ 00737000
*/*  TPQUE (BFRREG,FMCPAB2) NORM                                     */ 00738000
*                                                                  0612 00739000
*             DO;                                                  0612 00740000
*               RFY                                                0613 00741000
*                (GPR00P,                                          0613 00742000
*                 GPR01P,                                          0613 00743000
*                 GPR04P,                                          0613 00744000
*                 GPR05P,                                          0613 00745000
*                 GPR15P) RSTD;                                    0613 00746000
*               GEN REFS(GPR01P) SETS(RPHWORK)                     0614 00747000
*                   (STM GPR02P,GPR08P,RPHWORK(GPR01P));           0614 00748000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00749000
*               GPR00P=0;                                          0615 00750000
         SLR   GPR00P,GPR00P                                       0615 00751000
*               GPR15P=ADDR(FMCPAB2);/* HOLD PAB PTR                 */ 00752000
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0616 00753000
*               GPR04P=BFRREG;      /* WORK ELE PTR                  */ 00754000
         LR    GPR04P,BFRREG                                       0617 00755000
*               GPR05P=GPR15P;      /* PASS PAB PTR                  */ 00756000
         LR    GPR05P,GPR15P                                       0618 00757000
*               CALL ATCLCPTR->ATCAP37->ISTAPC37;                  0619 00758000
         L     @09,ATCLCPTR                                        0619 00759000
         L     @15,ATCAP37(,@09)                                   0619 00760000
         BALR  @14,@15                                             0619 00761000
*               GEN(NOPR  0)                                       0620 00762000
*               NOSETS NOREFS;                                     0620 00763000
         NOPR  0                                                        00764000
*               RFY                                                0621 00765000
*                (GPR00P,                                          0621 00766000
*                 GPR01P,                                          0621 00767000
*                 GPR04P,                                          0621 00768000
*                 GPR05P,                                          0621 00769000
*                 GPR15P) UNRSTD;                                  0621 00770000
*             END;                  /* *** END OF TPQUE GENERATION 0622 00771000
*                                                            @XL03HEK*/ 00772000
*           END;                    /* END FEEDBACK PROCESS          */ 00773000
*     END;                          /* END FEEDBACK DISCARD          */ 00774000
*   ELSE                            /* IF FEEDBACK NOT REPORTED      */ 00775000
*     DO;                           /* REPORT FEEDBACK TO CTL LAYR   */ 00776000
         B     @RC00601                                            0625 00777000
@RF00601 DS    0H                                                  0626 00778000
*       IF LSCTYPE=LSTYPE THEN      /* IS THIS AN LSCB?              */ 00779000
         CLI   LSCTYPE(ELEMREG),X'DF'                              0626 00780000
         BNE   @RF00626                                            0626 00781000
*         DO;                       /* YES, SAVE BUFFER              */ 00782000
*           FMCZF014='1'B;          /* SET RESET REPORT FLAG         */ 00783000
         OI    FMCZF014(FMCBREG),B'00001000'                       0628 00784000
*           CALL IFAB000A;          /* INITIALIZE FSB                */ 00785000
         BAL   @14,IFAB000A                                        0629 00786000
*           FMCZV004=ADDR(ZIBFSB);  /* SAVE RESET FSB ADDR@XL03HEK   */ 00787000
         LA    @14,ZIBFSB(,BFRREG)                                 0630 00788000
         ST    @14,FMCZV004(,FMCBREG)                              0630 00789000
*         END;                      /* FEEDBACK SAVED                */ 00790000
*       ELSE                        /* NOT A LSCB                    */ 00791000
*         IF LCPATOP=ON THEN        /* LCPB ON ATOP?         @XL03HEK*/ 00792000
         B     @RC00626                                            0632 00793000
@RF00626 TM    LCPATOP(ELEMREG),B'00000001'                        0632 00794000
         BNO   @RF00632                                            0632 00795000
*           DO;                     /* YES                   @XL03HEK*/ 00796000
*             CALL IFAB000I;        /* DEALLOC BUFFERS       @XL03HEK*/ 00797000
         BAL   @14,IFAB000I                                        0634 00798000
*             ZCRNXTEL=ON;          /* SET ON LCPB DEALL     @XL03HEK*/ 00799000
         L     @14,RPHCRR(,RPHREG)                                 0635 00800000
         L     @14,CRACRR(,@14)                                    0635 00801000
         OI    ZCRNXTEL(@14),B'00010000'                           0635 00802000
*           END;                    /*                       @XL03HEK*/ 00803000
*         ELSE                      /* LCPB NOT ON ATOP      @XL03HEK*/ 00804000
*           DO;                     /* PROCESS FEEDBACK NOW          */ 00805000
         B     @RC00632                                            0637 00806000
@RF00632 DS    0H                                                  0638 00807000
*             CALL IFAB000A;        /* INITIALIZE FSB                */ 00808000
         BAL   @14,IFAB000A                                        0638 00809000
*             CALL IFAB000F;        /* QUEUE FSB TO CLIP             */ 00810000
         BAL   @14,IFAB000F                                        0639 00811000
*           END;                    /* FEEDBACK PROCESSED            */ 00812000
*     END;                          /* END FEEDBACK REPORTER         */ 00813000
*                                                                  0641 00814000
@RC00632 DS    0H                                                  0641 00815000
@RC00626 DS    0H                                                  0642 00816000
*   /*****************************************************************/ 00817000
*   /*                                                               */ 00818000
*   /* SEGMENT(SEG000D)FINISH                                        */ 00819000
*   /*                                                               */ 00820000
*   /*****************************************************************/ 00821000
*                                                                  0642 00822000
*   DO;                                                            0642 00823000
@RC00601 DS    0H                                                  0643 00824000
*     GOTO SEG000D#;                                               0643 00825000
         B     SEG000D#                                            0643 00826000
*SEG000D@:                                                         0644 00827000
*   END;                                                           0644 00828000
*                                                                  0645 00829000
*/********************************************************************/ 00830000
*/*                                                                  */ 00831000
*/* SUBROUTINE-                                                      */ 00832000
*/*      IFAB000F                                                    */ 00833000
*/*                                                                  */ 00834000
*/* FUNCTION-                                                        */ 00835000
*/*      QUEUE FSB TO CONTROL LAYER INBOUND PAB.                     */ 00836000
*/*                                                                  */ 00837000
*/********************************************************************/ 00838000
*                                                                  0645 00839000
*IFAB000F:                                                         0645 00840000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0645 00841000
         B     @PB00004                                            0645 00842000
IFAB000F DS    0H                                                  0646 00843000
*   RFY                                                            0646 00844000
*     LNKREG RSTD;                  /* TO SAVE RETURN ADDRESS        */ 00845000
*   ZCRSVF7=LNKREG;                 /* SAVE RETURN ADDRESS           */ 00846000
         L     @09,RPHCRR(,RPHREG)                                 0647 00847000
         L     @09,CRACRR(,@09)                                    0647 00848000
         ST    LNKREG,ZCRSVF7(,@09)                                0647 00849000
*   RFY                                                            0648 00850000
*     LNKREG UNRSTD;                /* SAVED                         */ 00851000
*/*  TPQUE (ADDR(ZIBFSB),FMCPAB2) NORM                               */ 00852000
*                                                                  0649 00853000
*   DO;                                                            0649 00854000
*     RFY                                                          0650 00855000
*      (GPR00P,                                                    0650 00856000
*       GPR01P,                                                    0650 00857000
*       GPR04P,                                                    0650 00858000
*       GPR05P,                                                    0650 00859000
*       GPR15P) RSTD;                                              0650 00860000
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P)) 00861000
*         ;                                                        0651 00862000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00863000
*     GPR00P=0;                                                    0652 00864000
         SLR   GPR00P,GPR00P                                       0652 00865000
*     GPR15P=ADDR(FMCPAB2);         /* HOLD PAB PTR                  */ 00866000
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0653 00867000
*     GPR04P=ADDR(ZIBFSB);          /* WORK ELE PTR                  */ 00868000
         LA    GPR04P,ZIBFSB(,BFRREG)                              0654 00869000
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */ 00870000
         LR    GPR05P,GPR15P                                       0655 00871000
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            0656 00872000
         L     @09,ATCLCPTR                                        0656 00873000
         L     @15,ATCAP37(,@09)                                   0656 00874000
         BALR  @14,@15                                             0656 00875000
*     GEN(NOPR  0)                                                 0657 00876000
*     NOSETS NOREFS;                                               0657 00877000
         NOPR  0                                                        00878000
*     RFY                                                          0658 00879000
*      (GPR00P,                                                    0658 00880000
*       GPR01P,                                                    0658 00881000
*       GPR04P,                                                    0658 00882000
*       GPR05P,                                                    0658 00883000
*       GPR15P) UNRSTD;                                            0658 00884000
*   END;                            /* *** END OF TPQUE GENERATION   */ 00885000
*   RFY                                                            0660 00886000
*     LNKREG RSTD;                  /* TO RESTORE RETURN ADDRESS     */ 00887000
*   LNKREG=ZCRSVF7;                 /* RESTORE RETURN ADDRESS        */ 00888000
         L     @09,RPHCRR(,RPHREG)                                 0661 00889000
         L     @09,CRACRR(,@09)                                    0661 00890000
         L     LNKREG,ZCRSVF7(,@09)                                0661 00891000
*   RFY                                                            0662 00892000
*     LNKREG UNRSTD;                /* RESTORED                      */ 00893000
*   END IFAB000F;                   /* END SUBROUTINE                */ 00894000
@EL00004 DS    0H                                                  0663 00895000
@EF00004 DS    0H                                                  0663 00896000
@ER00004 BR    @14                                                 0663 00897000
@PB00004 DS    0H                                                  0664 00898000
*   GEN NODEFS NOREFS NOSETS(EJECT);/*                       @XL03HEK*/ 00899000
         EJECT                                                          00900000
*                                                                  0665 00901000
*/********************************************************************/ 00902000
*/*                                                                  */ 00903000
*/* IFAB000G: THIS ROUTINE DEQUEUES THE NEXT (OLDEST) ELEMENT FROM   */ 00904000
*/*           THE FMCB WAITQ. THE ELEMENT ADDRESS IS RETURNED IN     */ 00905000
*/*           ELEMREG.                                               */ 00906000
*/*           NOTE: THE S/D CODE FOR IFAB000G IS: -------->  @XL03HEK*/ 00907000
*/*                                                                  */ 00908000
*/********************************************************************/ 00909000
*                                                                  0665 00910000
*IFAB000G:                                                         0665 00911000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0665 00912000
         B     @PB00005                                            0665 00913000
IFAB000G DS    0H                                                  0666 00914000
*   RFY                                                            0666 00915000
*     LNKREG RSTD;                                                 0666 00916000
*   ZCRSVF8=LNKREG;                 /* SAVE RETURN ADDRESS           */ 00917000
         L     @09,RPHCRR(,RPHREG)                                 0667 00918000
         L     @09,CRACRR(,@09)                                    0667 00919000
         ST    LNKREG,ZCRSVF8(,@09)                                0667 00920000
*   RFY                                                            0668 00921000
*     LNKREG UNRSTD;                                               0668 00922000
*                                                                  0668 00923000
*/*      REMOVE OLDEST ELEMENT FROM FMCB WAITQ                       */ 00924000
*/* TPDEQ (,FMCLCPBQ) RETPTR(ELEMREG)                                */ 00925000
*                                                                  0669 00926000
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */ 00927000
*     RFY                                                          0670 00928000
*      (GPR00P,                                                    0670 00929000
*       GPR01P,                                                    0670 00930000
*       GPR14P,                                                    0670 00931000
*       GPR15P) RSTD;                                              0670 00932000
*     GPR15P=ADDR(FMCLCPBQ);        /* ADDRESS QUEUE POINTER         */ 00933000
         LA    GPR15P,FMCLCPBQ(,FMCBREG)                           0671 00934000
*     GPR14P=GPR15P->PABWEQA|FMZCA020;                             0672 00935000
         L     @09,@CF00850                                        0672 00936000
         L     GPR14P,PABWEQA(,GPR15P)                             0672 00937000
         OR    GPR14P,@09                                          0672 00938000
*     IF GPR14P=FMZCA020 THEN                                      0673 00939000
         CLR   GPR14P,@09                                          0673 00940000
         BE    @RT00673                                            0673 00941000
*       ;                                                          0674 00942000
*     ELSE                                                         0675 00943000
*       DO;                                                        0675 00944000
*FMZL1066:                                                         0676 00945000
*         ;                                                        0676 00946000
FMZL1066 DS    0H                                                  0677 00947000
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA020);                    0677 00948000
         B     @DE00677                                            0677 00949000
@DL00677 DS    0H                                                  0678 00950000
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0678 00951000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0678 00952000
*           GPR14P=GPR15P->PABWEQA;                                0679 00953000
         L     GPR14P,PABWEQA(,GPR15P)                             0679 00954000
*         END;                                                     0680 00955000
@DE00677 L     @09,@CF00850                                        0680 00956000
         CL    @09,WKECHAIN(,GPR14P)                               0680 00957000
         BNE   @DL00677                                            0680 00958000
*         GPR00P=FMZCA020;                                         0681 00959000
         LR    GPR00P,@09                                          0681 00960000
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0682 00961000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0682 00962000
*         BC(7,FMZL1066);                                          0683 00963000
         BC    7,FMZL1066                                          0683 00964000
*         GPR14P->WKECHAIN=0;                                      0684 00965000
         SLR   @09,@09                                             0684 00966000
         ST    @09,WKECHAIN(,GPR14P)                               0684 00967000
*       END;                                                       0685 00968000
*ISTA0066:                                                         0686 00969000
*     ;                                                            0686 00970000
@RT00673 DS    0H                                                  0686 00971000
ISTA0066 DS    0H                                                  0687 00972000
*     GPR14P=GPR14P&FMZCB020;                                      0687 00973000
         N     GPR14P,@CF00848                                     0687 00974000
*     ELEMREG=GPR14P;                                              0688 00975000
         LR    ELEMREG,GPR14P                                      0688 00976000
*     RFY                                                          0689 00977000
*      (GPR00P,                                                    0689 00978000
*       GPR01P,                                                    0689 00979000
*       GPR14P,                                                    0689 00980000
*       GPR15P) UNRSTD;                                            0689 00981000
*   END;                            /* END TPDEQ GENERATION          */ 00982000
*   RFY                                                            0691 00983000
*     LNKREG RSTD;                                                 0691 00984000
*   LNKREG=ZCRSVF8;                 /* RESTORE RETURN ADDRESS        */ 00985000
         L     @09,RPHCRR(,RPHREG)                                 0692 00986000
         L     @09,CRACRR(,@09)                                    0692 00987000
         L     LNKREG,ZCRSVF8(,@09)                                0692 00988000
*   RFY                                                            0693 00989000
*     LNKREG UNRSTD;                                               0693 00990000
*   END IFAB000G;                                                  0694 00991000
@EL00005 DS    0H                                                  0694 00992000
@EF00005 DS    0H                                                  0694 00993000
@ER00005 BR    @14                                                 0694 00994000
*                                                                  0695 00995000
*/********************************************************************/ 00996000
*/*                                                                  */ 00997000
*/* PROCEDURE-                                               @XL03HEK*/ 00998000
*/*      IFAB000H                                            @XL03HEK*/ 00999000
*/*                                                                  */ 01000000
*/* FUNCTION-                                                        */ 01001000
*/*      THIS ROUTINE PROCESSES THE SITUATION WHEN A RESET   @XL03HEK*/ 01002000
*/*      COMMAND IS RESET OR WHEN DISCONNECT IS IN PROGRESS  @XL03HEK*/ 01003000
*/*      AND FEEDBACK FOR A DISCONNECT IS RECEIVED.          @XL03HEK*/ 01004000
*/*      (1) IF A RESET COMMAND IS BEING RESET, THEN THE     @XL03HEK*/ 01005000
*/*          RESET COUNT IN THE FMCB IS DECREMENTED, AND     @XL03HEK*/ 01006000
*/*          THE RESET LCPB IS CHECKED TO DETERMINE IF IT    @XL03HEK*/ 01007000
*/*          IS ON THE ATOP. IF SO, THE LCPB IS MARKED FOR   @XL03HEK*/ 01008000
*/*          DEALLOCATION AND ITS BUFFERS ARE DEALLOCATED.   @XL03HEK*/ 01009000
*/*          OTHERWISE, A FSB FOR A RESET OF A RESET IS      @XL03HEK*/ 01010000
*/*          BUILT AND QUEUED TO THERESET LCPB FSB CHAIN. IN @XL03HEK*/ 01011000
*/*          EITHER CASE, THE ZCR IS MARKED FOR LAST FSB     @XL03HEK*/ 01012000
*/*          AND RETURN CODE 4 (SEND NO FEEDBACK) IS SET.    @XL03HEK*/ 01013000
*/*      (2) IF DISCONNECT IS IN PROGRESS AND THE PRESENT    @XL03HEK*/ 01014000
*/*          COMMAND IS DISCONNECT, THE RESET LCPB IS MARKED @XL03HEK*/ 01015000
*/*          FOR DEALLOCATION IF IT IS ON THE ATOP. ITS      @XL03HEK*/ 01016000
*/*          BUFFERS ARE DEALLOCATED, THE ZCR IS MARKED LAST @XL03HEK*/ 01017000
*/*          FSB, AND RETURN CODE 4 IS SET.                  @XL03HEK*/ 01018000
*/*      IN ANY OTHER CONDITION, RETURN CODE 0 (SEND         @XL03HEK*/ 01019000
*/*      FEEDBACK) IS SET.                                   @XL03HEK*/ 01020000
*/*                                                                  */ 01021000
*/********************************************************************/ 01022000
*                                                                  0695 01023000
*IFAB000H:                                                         0695 01024000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @XL03HEK*/ 01025000
IFAB000H DS    0H                                                  0696 01026000
*   RFY                                                            0696 01027000
*     LNKREG RSTD;                  /*                       @XL03HEK*/ 01028000
*   ZCRSVF8=LNKREG;                 /* SAVE RETURN ADDR      @XL03HEK*/ 01029000
         L     @09,RPHCRR(,RPHREG)                                 0697 01030000
         L     @09,CRACRR(,@09)                                    0697 01031000
         ST    LNKREG,ZCRSVF8(,@09)                                0697 01032000
*   RFY                                                            0698 01033000
*     LNKREG UNRSTD;                /*                       @XL03HEK*/ 01034000
*   IF BDUCOMND=BCMDZ THEN                                         0699 01035000
         CLI   BDUCOMND+62(BFRREG),X'08'                           0699 01036000
         BNE   @RF00699                                            0699 01037000
*CNTLCMD:                                                          0700 01038000
*     DO;                                                          0700 01039000
CNTLCMD  DS    0H                                                  0701 01040000
*       ZCRSCANQ=ON;                /* SET CNTL CMND RESET FLAG      */ 01041000
         L     @14,RPHCRR(,RPHREG)                                 0701 01042000
         L     @14,CRACRR(,@14)                                    0701 01043000
         OI    ZCRSCANQ(@14),B'00100000'                           0701 01044000
*       IF BDUMODIF=BMODZEM|        /* IF                            */ 01045000
*           BDUMODIF=BMODZQM|       /* COMMAND                       */ 01046000
*           BDUMODIF=BMODZIM|       /* IS                            */ 01047000
*           BDUMODIF=BMODZOM|       /* A                             */ 01048000
*           BDUMODIF=BMODZXO|       /* RESET                         */ 01049000
*           BDUMODIF=BMODZCM|       /*                               */ 01050000
*           BDUMODIF=BMODZECM THEN  /* THEN                          */ 01051000
         LA    @14,62                                              0702 01052000
         ALR   @14,BFRREG                                          0702 01053000
         CLI   BDUMODIF(@14),X'41'                                 0702 01054000
         BE    @RT00702                                            0702 01055000
         CLI   BDUMODIF(@14),X'42'                                 0702 01056000
         BE    @RT00702                                            0702 01057000
         CLI   BDUMODIF(@14),X'44'                                 0702 01058000
         BE    @RT00702                                            0702 01059000
         CLI   BDUMODIF(@14),X'48'                                 0702 01060000
         BE    @RT00702                                            0702 01061000
         CLI   BDUMODIF(@14),X'43'                                 0702 01062000
         BE    @RT00702                                            0702 01063000
         CLI   BDUMODIF(@14),X'50'                                 0702 01064000
         BE    @RT00702                                            0702 01065000
         CLI   BDUMODIF(@14),X'60'                                 0702 01066000
         BNE   @RF00702                                            0702 01067000
@RT00702 DS    0H                                                  0703 01068000
*         DO;                                                      0703 01069000
*           FMCZX006=FMCZX006-1;    /* DECREMENT RESET COUNT         */ 01070000
         SLR   @14,@14                                             0704 01071000
         IC    @14,FMCZX006(,FMCBREG)                              0704 01072000
         BCTR  @14,0                                               0704 01073000
         STC   @14,FMCZX006(,FMCBREG)                              0704 01074000
*           IF LCPATOP=ON THEN      /* RESET LCPB ON ATOP    @XL03HEK*/ 01075000
         TM    LCPATOP(ELEMREG),B'00000001'                        0705 01076000
         BNO   @RF00705                                            0705 01077000
*             DO;                   /* YES                   @XL03HEK*/ 01078000
*               LCPFREE=ON;         /* SET ON LCPB DEALL     @XL03HEK*/ 01079000
         OI    LCPFREE(ELEMREG),B'00000010'                        0707 01080000
*               CALL IFAB000I;      /* DEALLOC BUFFERS       @XL03HEK*/ 01081000
         BAL   @14,IFAB000I                                        0708 01082000
*               ZCRLSTFB=ON;        /* SET LAST FSB ON       @XL03HEK*/ 01083000
         L     @14,RPHCRR(,RPHREG)                                 0709 01084000
         L     @14,CRACRR(,@14)                                    0709 01085000
         OI    ZCRLSTFB(@14),B'00000100'                           0709 01086000
*               RCDREG=4;           /* RC=SEND NO FEEDBACK@XL03HEK   */ 01087000
         LA    RCDREG,4                                            0710 01088000
*             END;                  /*                       @XL03HEK*/ 01089000
*           ELSE                    /* LCPB NOT ON ATOP      @XL03HEK*/ 01090000
*             DO;                   /*                       @XL03HEK*/ 01091000
         B     @RC00705                                            0712 01092000
@RF00705 DS    0H                                                  0713 01093000
*               CALL IFAB000A;      /* GO INIT FSB                   */ 01094000
         BAL   @14,IFAB000A                                        0713 01095000
*/*  TPQUE (ADDR(ZIBFSB),FSBLCPB->LSCFDBA)                           */ 01096000
*                                                                  0714 01097000
*               DO;                                                0714 01098000
*                 RFY                                              0715 01099000
*                  (GPR00P,                                        0715 01100000
*                   GPR01P,                                        0715 01101000
*                   GPR02P,                                        0715 01102000
*                   GPR14P,                                        0715 01103000
*                   GPR15P) RSTD;                                  0715 01104000
*                 GEN REFS(GPR01P) SETS(RPHWORK)                   0716 01105000
*                     (STM GPR02P,GPR08P,RPHWORK(GPR01P));         0716 01106000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              01107000
*                 GPR15P=ADDR(ZIBFSB);/* GET WORK ELEM POINTER       */ 01108000
         LA    GPR15P,ZIBFSB(,BFRREG)                              0717 01109000
*                 GPR14P=ADDR(FSBLCPB->LSCFDBA);/* ADDRESS PAB/QUEUE    01110000
*                                      POINTER                       */ 01111000
         L     GPR14P,FSBLCPB+16(,BFRREG)                          0718 01112000
         LA    GPR14P,LSCFDBA(,GPR14P)                             0718 01113000
*                 GPR15P=GPR15P|PABWEQG1;                          0719 01114000
         O     GPR15P,@CF00850                                     0719 01115000
*                 GPR02P=GPR14P->PABWEQA;/* INITIALIZE WITH QUEUE  0720 01116000
*                                      HEADER                        */ 01117000
         L     GPR02P,PABWEQA(,GPR14P)                             0720 01118000
*CMZA0070:                                                         0721 01119000
*                 ;                 /* CS FAIL TARGET                */ 01120000
CMZA0070 DS    0H                                                  0722 01121000
*                 GPR00P=GPR02P;    /* SAVE QUEUE CONTENTS           */ 01122000
         LR    GPR00P,GPR02P                                       0722 01123000
*                 GPR15P->PABCHAIN=GPR02P|PABWEQG1;/* FORWARD CHAIN     01124000
*                                      WORK ELEMENT                  */ 01125000
         LR    @09,GPR02P                                          0723 01126000
         O     @09,@CF00850                                        0723 01127000
         ST    @09,PABCHAIN(,GPR15P)                               0723 01128000
*                 CS(GPR02P,GPR15P,GPR14P->PABWEQA);/* CHECK FOR END    01129000
*                                      OF QUEUE                      */ 01130000
         CS    GPR02P,@15,PABWEQA(GPR14P)                          0724 01131000
*                 BC(7,CMZA0070);                                  0725 01132000
         BC    7,CMZA0070                                          0725 01133000
*                 GEN REFS(RPHWORK,GPR01P) NOSETS                  0726 01134000
*                     (LM    GPR02P,GPR08P,RPHWORK(GPR01P));       0726 01135000
         LM    GPR02P,GPR08P,RPHWORK(GPR01P)                            01136000
*                 RFY                                              0727 01137000
*                  (GPR00P,                                        0727 01138000
*                   GPR01P,                                        0727 01139000
*                   GPR02P,                                        0727 01140000
*                   GPR14P,                                        0727 01141000
*                   GPR15P) UNRSTD;                                0727 01142000
*               END;                /* *** END OF TPQUE GENERATION 0728 01143000
*                                      SAVE ADDR FSB IN RESET LCPB 0728 01144000
*                                      FSB CHAIN                     */ 01145000
*               ZCRLSTFB=ON;        /* SET ON LAST FSB FLAG          */ 01146000
         L     @14,RPHCRR(,RPHREG)                                 0729 01147000
         L     @14,CRACRR(,@14)                                    0729 01148000
         OI    ZCRLSTFB(@14),B'00000100'                           0729 01149000
*               RCDREG=4;           /* RC= DONT SEND FEEDBACK        */ 01150000
         LA    RCDREG,4                                            0730 01151000
*             END;                  /*                       @XL03HEK*/ 01152000
*         END;                                                     0732 01153000
*       ELSE                                                       0733 01154000
*         RCDREG=0;                 /* CNTL COMMAND ^=RESET CMND     */ 01155000
         B     @RC00702                                            0733 01156000
@RF00702 SLR   RCDREG,RCDREG                                       0733 01157000
*     END CNTLCMD;                                                 0734 01158000
*   ELSE                                                           0735 01159000
*NOTCNTL:                                                          0735 01160000
*     DO;                                                          0735 01161000
         B     @RC00699                                            0735 01162000
@RF00699 DS    0H                                                  0735 01163000
NOTCNTL  DS    0H                                                  0736 01164000
*       IF(BDUCOMND=BCMDI|          /* COMMAND AN INVITE     @ZA05266*/ 01165000
*           BDUCOMND=BCMDC)&        /* OR A CONTACT, AND     @ZA05266*/ 01166000
*           NCBNSNA->NCBTYPE=DNTYPE&/* NEXT SCHEDULABLE NODE IS A  0736 01167000
*                                      DNCB AND              @ZA05266*/ 01168000
*           NCBNSNA->DNCZX003>0     /* SESSION CNT>0         @ZA05266*/ 01169000
*         THEN                                                     0736 01170000
         LA    @14,62                                              0736 01171000
         ALR   @14,BFRREG                                          0736 01172000
         CLI   BDUCOMND(@14),X'05'                                 0736 01173000
         BE    @GL00014                                            0736 01174000
         CLI   BDUCOMND(@14),X'06'                                 0736 01175000
         BNE   @RF00736                                            0736 01176000
@GL00014 L     @14,NCBNSNA(,DNCBREG)                               0736 01177000
         CLI   NCBTYPE(@14),X'05'                                  0736 01178000
         BNE   @RF00736                                            0736 01179000
         CLI   DNCZX003(@14),0                                     0736 01180000
         BNH   @RF00736                                            0736 01181000
*         NCBNSNA->DNCZX003=NCBNSNA->DNCZX003-1;/* DECREMENT SESSION    01182000
*                                      COUNT                 @ZA05266*/ 01183000
         SLR   @09,@09                                             0737 01184000
         IC    @09,DNCZX003(,@14)                                  0737 01185000
         BCTR  @09,0                                               0737 01186000
         STC   @09,DNCZX003(,@14)                                  0737 01187000
*       ELSE                                                       0738 01188000
*         ;                         /*                       @ZA05266*/ 01189000
@RF00736 DS    0H                                                  0739 01190000
*       ZCRSCANQ=OFF;               /* OFF RESET CMND = CNTL         */ 01191000
         L     @14,RPHCRR(,RPHREG)                                 0739 01192000
         L     @14,CRACRR(,@14)                                    0739 01193000
         NI    ZCRSCANQ(@14),B'11011111'                           0739 01194000
*       IF FMCZF021=ON&             /* IF TPIOS GENERATED            */ 01195000
*           BDUCOMND=BCMDD THEN     /* DISCONNECT CMND WAS RESET     */ 01196000
         TM    FMCZF021(FMCBREG),B'00010000'                       0740 01197000
         BNO   @RF00740                                            0740 01198000
         CLI   BDUCOMND+62(BFRREG),X'07'                           0740 01199000
         BNE   @RF00740                                            0740 01200000
*         DO;                                                      0741 01201000
*           IF LCPATOP=ON THEN      /* LCPB ON ATOP?         @XL03HEK*/ 01202000
         TM    LCPATOP(ELEMREG),B'00000001'                        0742 01203000
         BNO   @RF00742                                            0742 01204000
*             LCPFREE=ON;           /* SET ON LCPB DEALL     @XL03HEK*/ 01205000
         OI    LCPFREE(ELEMREG),B'00000010'                        0743 01206000
*           ELSE                                                   0744 01207000
*             ;                     /* LCPB NOT ON ATOP      @XL03HEK*/ 01208000
@RF00742 DS    0H                                                  0745 01209000
*           CALL IFAB000I;          /* DEALLOC BUFFERS       @XL03HEK*/ 01210000
         BAL   @14,IFAB000I                                        0745 01211000
*           ZCRLSTFB=ON;            /* SET ON LAST FSB FLAG          */ 01212000
         L     @14,RPHCRR(,RPHREG)                                 0746 01213000
         L     @14,CRACRR(,@14)                                    0746 01214000
         OI    ZCRLSTFB(@14),B'00000100'                           0746 01215000
*           RCDREG=4;               /* RC= DONT SEND FEEDBACK        */ 01216000
         LA    RCDREG,4                                            0747 01217000
*         END;                                                     0748 01218000
*       ELSE                                                       0749 01219000
*         RCDREG=0;                 /* COMND ^= TPIOS GEN DISCONN    */ 01220000
         B     @RC00740                                            0749 01221000
@RF00740 SLR   RCDREG,RCDREG                                       0749 01222000
*     END NOTCNTL;                                                 0750 01223000
@RC00740 DS    0H                                                  0751 01224000
*   RFY                                                            0751 01225000
*     LNKREG RSTD;                  /*                       @XL03HEK*/ 01226000
@RC00699 DS    0H                                                  0752 01227000
*   LNKREG=ZCRSVF8;                 /* GET RETURN ADDR       @XL03HEK*/ 01228000
         L     @09,RPHCRR(,RPHREG)                                 0752 01229000
         L     @09,CRACRR(,@09)                                    0752 01230000
         L     LNKREG,ZCRSVF8(,@09)                                0752 01231000
*   RFY                                                            0753 01232000
*     LNKREG UNRSTD;                /*                       @XL03HEK*/ 01233000
*   END IFAB000H;                   /*                       @XL03HEK*/ 01234000
@EL00006 DS    0H                                                  0754 01235000
@EF00006 DS    0H                                                  0754 01236000
@ER00006 BR    @14                                                 0754 01237000
*                                                                  0755 01238000
*/********************************************************************/ 01239000
*/*                                                                  */ 01240000
*/* PROCEDURE-                                                       */ 01241000
*/*      IFAB000I                                                    */ 01242000
*/*                                                                  */ 01243000
*/* FUNCTION-                                                        */ 01244000
*/*        THIS ROUTINE DEALLOCATES THE BUFFER POINTED TO            */ 01245000
*/*        BY BFRREG THROUGH A CALL TO ISTZDFB0.                     */ 01246000
*/*                                                                  */ 01247000
*/*        THE S/D CODE FOR THIS ROUTINE IS: ------->        @XL03HEK*/ 01248000
*/*                                                                  */ 01249000
*/********************************************************************/ 01250000
*                                                                  0755 01251000
*IFAB000I:                                                         0755 01252000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0755 01253000
IFAB000I DS    0H                                                  0756 01254000
*   RFY                                                            0756 01255000
*     LNKREG RSTD;                                                 0756 01256000
*FAB000I1:                                                         0757 01257000
*   ZCRSVF9=LNKREG;                 /* SAVE RETURN ADDRESS           */ 01258000
FAB000I1 L     @09,RPHCRR(,RPHREG)                                 0757 01259000
         L     @09,CRACRR(,@09)                                    0757 01260000
         ST    LNKREG,ZCRSVF9(,@09)                                0757 01261000
*   RFY                                                            0758 01262000
*     LNKREG UNRSTD;                                               0758 01263000
*   RFY                                                            0759 01264000
*     WKREGB RSTD;                  /* WORK REGISTER IN USE          */ 01265000
*FAB000I2:                                                         0760 01266000
*   WKREGB=ELEMREG;                 /* SAVE POINTER TO ELEMENT       */ 01267000
FAB000I2 LR    WKREGB,ELEMREG                                      0760 01268000
*   ZCRPCOD1=0;                     /* CLEAR ZCR PARAMETER FLAGS     */ 01269000
         L     @14,RPHCRR(,RPHREG)                                 0761 01270000
         L     @14,CRACRR(,@14)                                    0761 01271000
         MVI   ZCRPCOD1(@14),X'00'                                 0761 01272000
*   ZCRPBUF='1'B;                   /* INDICATE BUFFER RELEASE       */ 01273000
         OI    ZCRPBUF(@14),B'00000100'                            0762 01274000
*   ELEMREG=BFRREG;                 /* POINT AT BUFFER TO RELEASE    */ 01275000
         LR    ELEMREG,BFRREG                                      0763 01276000
*   CALL ATCZPSVT->ZPSZDFB0;        /* CALL BUFFER RELEASE           */ 01277000
         L     @14,ATCZPSVT(,VTCVTREG)                             0764 01278000
         L     @15,ZPSZDFB0(,@14)                                  0764 01279000
         BALR  @14,@15                                             0764 01280000
*   ELEMREG=WKREGB;                 /* RESTORE ELEMENT POINTER       */ 01281000
         LR    ELEMREG,WKREGB                                      0765 01282000
*   RFY                                                            0766 01283000
*     WKREGB UNRSTD;                /* WORK REGISTER AVAILABLE       */ 01284000
*   RFY                                                            0767 01285000
*     LNKREG RSTD;                                                 0767 01286000
*   LNKREG=ZCRSVF9;                 /* RESTORE RETURN ADDRESS        */ 01287000
         L     @09,RPHCRR(,RPHREG)                                 0768 01288000
         L     @09,CRACRR(,@09)                                    0768 01289000
         L     LNKREG,ZCRSVF9(,@09)                                0768 01290000
*   RFY                                                            0769 01291000
*     LNKREG UNRSTD;                                               0769 01292000
*   END IFAB000I;                                                  0770 01293000
@EL00007 DS    0H                                                  0770 01294000
@EF00007 DS    0H                                                  0770 01295000
@ER00007 BR    @14                                                 0770 01296000
@PB00007 DS    0H                                                  0771 01297000
*                                                                  0771 01298000
*/********************************************************************/ 01299000
*/*                                                                  */ 01300000
*/* SEGMENT - SEG000J                                                */ 01301000
*/*                                                                  */ 01302000
*/* FUNCTION-                                                        */ 01303000
*/*     THIS ROUTINE CHECKS FOR THE TYPE OF RESET ELEMENT.           */ 01304000
*/*     IF THE ELEMENT RESET IS AN LSCB WITH A ZERO LCPB ADDRESS,    */ 01305000
*/*     A FSB IS BUILT AND QUEUED TO THE CLIP. OTHERWISE, IFAB000H   */ 01306000
*/*     IS CALLED TO PROCESS RESET OF A RESET OR DISCONNECT IN       */ 01307000
*/*     PROGRESS WITH PRESENT COMMAND A DISCONNECT.                  */ 01308000
*/*                                                                  */ 01309000
*/*     THE S/D CODE FOR SEG000J IS:                         @XL03HEK*/ 01310000
*/*                                                                  */ 01311000
*/********************************************************************/ 01312000
*/* SEGMENT(SEG000J)START                                            */ 01313000
*                                                                  0771 01314000
*   DO;                                                            0771 01315000
*     GOTO SEG000J@;                                               0772 01316000
         B     SEG000J@                                            0772 01317000
*SEG000J:                                                          0773 01318000
*   END;                                                           0773 01319000
SEG000J  DS    0H                                                  0774 01320000
*   IF LSCTYPE=LSTYPE               /* IS ELEMENT A LSCB?            */ 01321000
*       &LSCLCPBA=0 THEN            /* YES, IS LCPB ADDR NULL?       */ 01322000
         CLI   LSCTYPE(ELEMREG),X'DF'                              0774 01323000
         BNE   @RF00774                                            0774 01324000
         L     @14,LSCLCPBA(,ELEMREG)                              0774 01325000
         LTR   @14,@14                                             0774 01326000
         BNZ   @RF00774                                            0774 01327000
*     DO;                           /* YES                           */ 01328000
*       CALL IFAB000I;              /* DEALLOCATE FSB        @XM09613*/ 01329000
         BAL   @14,IFAB000I                                        0776 01330000
*       ZCRLSTFB=ON;                /* MARK ZCR FOR LAST FSB COND    */ 01331000
         L     @14,RPHCRR(,RPHREG)                                 0777 01332000
         L     @14,CRACRR(,@14)                                    0777 01333000
         OI    ZCRLSTFB(@14),B'00000100'                           0777 01334000
*       RCDREG=4;                   /* SET RC FOR SEND NO FEEDBACK   */ 01335000
         LA    RCDREG,4                                            0778 01336000
*     END;                                                         0779 01337000
*   ELSE                            /* LCPB ADDR NOT 0               */ 01338000
*     CALL IFAB000H;                /* CHECK FOR RESET CNTRL CMND    */ 01339000
         B     @RC00774                                            0780 01340000
@RF00774 BAL   @14,IFAB000H                                        0780 01341000
*/* SEGMENT(SEG000J)FINISH                                           */ 01342000
*                                                                  0781 01343000
*   DO;                                                            0781 01344000
@RC00774 DS    0H                                                  0782 01345000
*     GOTO SEG000J#;                                               0782 01346000
         B     SEG000J#                                            0782 01347000
*SEG000J@:                                                         0783 01348000
*   END;                                                           0783 01349000
*                                                                  0783 01350000
SEG000J@ DS    0H                                                  0784 01351000
*/* TPEPILOG                                                         */ 01352000
*                                                                  0784 01353000
*   GEN(PRINT OFF);                                                0784 01354000
         PRINT OFF                                                      01355000
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0785 01356000
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0785 01357000
*        2  * CHAR(4),                 /* SPACE                       * 01358000
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               * 01359000
*           3 WKEFLAGS BIT(8),         /* FLAGS                       * 01360000
*             4 WKEGATE  BIT(1),       /* GATE BIT                    * 01361000
*             4 *        BIT(7),       /* RESERVED                    * 01362000
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 * 01363000
*   DCL                                                            0786 01364000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 01365000
*   DCL                                                            0787 01366000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 01367000
*   GEN(PRINT ON);                                                 0788 01368000
*                                                                  0788 01369000
         PRINT ON                                                       01370000
*/* END OF TPEPILOG                                                  */ 01371000
*                                                                  0789 01372000
*   END ISTZIFAB                    /*                       @XL03HEK*/ 01373000
*                                                                  0789 01374000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01375000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01376000
*                                                                  0789 01377000
*       ;                                                          0789 01378000
@EL00001 DS    0H                                                  0789 01379000
@EF00001 DS    0H                                                  0789 01380000
@ER00001 BR    @14                                                 0789 01381000
@DATA    DS    0H                                                       01382000
@CH02866 DC    H'10'                                                    01383000
@CH02032 DC    XL2'0007'                                                01384000
@DATD    DSECT                                                          01385000
         DS    0F                                                       01386000
ISTZIFAB CSECT                                                          01387000
         DS    0F                                                       01388000
@CF01002 DC    F'16'                                                    01389000
@CF00848 DC    XL4'7FFFFFFF'                                            01390000
@CF00850 DC    XL4'80000000'                                            01391000
@CF03660 DC    XL4'00FFFFFF'                                            01392000
@DATD    DSECT                                                          01393000
         DS    0D                                                       01394000
CVTPTR   DS    A                                                        01395000
LCPBPTR  DS    A                                                        01396000
FMCBPTR  DS    A                                                        01397000
FSBPTR   DS    A                                                        01398000
BDUPTR   DS    A                                                        01399000
BTUPTR   DS    A                                                        01400000
DNCBPTR  DS    A                                                        01401000
WKEPTR   DS    A                                                        01402000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01403000
@ENDDATD EQU   *                                                        01404000
ISTZIFAB CSECT                                                          01405000
         DS    0F                                                       01406000
@SIZDATD DC    AL1(0)                                                   01407000
         DC    AL3(@ENDDATD-@DATD)                                      01408000
         DS    0D                                                       01409000
FMZA0030 DS    FL4                                                      01410000
         ORG   FMZA0030                                                 01411000
@NM00058 DC    AL1(64)                                                  01412000
@NM00059 DC    AL3(0)                                                   01413000
         ORG   FMZA0030+4                                               01414000
@CC03706 DC    C'ICAB'                                                  01415000
@CB03658 DC    X'0E00'                                                  01416000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01417000
@01      EQU   01                                                       01418000
@02      EQU   02                                                       01419000
@03      EQU   03                                                       01420000
@04      EQU   04                                                       01421000
@05      EQU   05                                                       01422000
@06      EQU   06                                                       01423000
@07      EQU   07                                                       01424000
@08      EQU   08                                                       01425000
@09      EQU   09                                                       01426000
@10      EQU   10                                                       01427000
@11      EQU   11                                                       01428000
@12      EQU   12                                                       01429000
@13      EQU   13                                                       01430000
@14      EQU   14                                                       01431000
@15      EQU   15                                                       01432000
GPR00P   EQU   @00                                                      01433000
GPR01P   EQU   @01                                                      01434000
GPR02P   EQU   @02                                                      01435000
GPR03F   EQU   @03                                                      01436000
GPR03P   EQU   @03                                                      01437000
GPR04P   EQU   @04                                                      01438000
GPR05P   EQU   @05                                                      01439000
GPR07P   EQU   @07                                                      01440000
GPR12P   EQU   @12                                                      01441000
GPR13P   EQU   @13                                                      01442000
GPR14P   EQU   @14                                                      01443000
GPR15P   EQU   @15                                                      01444000
RPHPTR   EQU   @01                                                      01445000
RPHREG   EQU   @01                                                      01446000
VTCVTREG EQU   @02                                                      01447000
ICNCBREG EQU   @03                                                      01448000
DNCBREG  EQU   @04                                                      01449000
FMCBREG  EQU   @05                                                      01450000
BFRREG   EQU   @06                                                      01451000
ELEMREG  EQU   @07                                                      01452000
RCVTREG  EQU   @08                                                      01453000
WKREGB   EQU   @09                                                      01454000
CDREG    EQU   @12                                                      01455000
SVREG    EQU   @13                                                      01456000
LNKREG   EQU   @14                                                      01457000
RCDREG   EQU   @15                                                      01458000
GPR00F   EQU   @00                                                      01459000
GPR01F   EQU   @01                                                      01460000
GPR02F   EQU   @02                                                      01461000
GPR04F   EQU   @04                                                      01462000
GPR05F   EQU   @05                                                      01463000
GPR06F   EQU   @06                                                      01464000
GPR06P   EQU   @06                                                      01465000
GPR07F   EQU   @07                                                      01466000
GPR08F   EQU   @08                                                      01467000
GPR08P   EQU   @08                                                      01468000
GPR09F   EQU   @09                                                      01469000
GPR09P   EQU   @09                                                      01470000
GPR10F   EQU   @10                                                      01471000
GPR10P   EQU   @10                                                      01472000
GPR11F   EQU   @11                                                      01473000
GPR11P   EQU   @11                                                      01474000
GPR12F   EQU   @12                                                      01475000
GPR13F   EQU   @13                                                      01476000
GPR14F   EQU   @14                                                      01477000
GPR15F   EQU   @15                                                      01478000
WKREGA   EQU   @00                                                      01479000
ATCLCPTR EQU   1032                                                     01480000
CVTMAP   EQU   0                                                        01481000
CVTDAR   EQU   CVTMAP+72                                                01482000
CVTFLGS1 EQU   CVTDAR                                                   01483000
CVTDCB   EQU   CVTMAP+116                                               01484000
CVTIERLC EQU   CVTMAP+144                                               01485000
CVTOPTA  EQU   CVTMAP+182                                               01486000
CVTOPTB  EQU   CVTMAP+183                                               01487000
CVTGTF   EQU   CVTMAP+236                                               01488000
CVTGTFST EQU   CVTGTF                                                   01489000
CVTGTFS  EQU   CVTGTFST                                                 01490000
CVTSTATE EQU   CVTGTFST                                                 01491000
CVTTMODE EQU   CVTGTFST                                                 01492000
CVTFORM  EQU   CVTGTFST                                                 01493000
CVTAQAVT EQU   CVTMAP+240                                               01494000
CVTTCMFG EQU   CVTAQAVT                                                 01495000
CVTVOLM2 EQU   CVTMAP+244                                               01496000
CVTTATA  EQU   CVTVOLM2                                                 01497000
CVTTSKS  EQU   CVTTATA                                                  01498000
CVTVOLF2 EQU   CVTTSKS                                                  01499000
CVTTAT   EQU   CVTTATA+1                                                01500000
CVTATER  EQU   CVTMAP+248                                               01501000
CVTEXT1  EQU   CVTMAP+252                                               01502000
CVTPURG  EQU   CVTMAP+260                                               01503000
CVTQMSG  EQU   CVTMAP+268                                               01504000
CVTDMSR  EQU   CVTMAP+272                                               01505000
CVTRSV37 EQU   CVTDMSR                                                  01506000
CVTDMSRF EQU   CVTRSV37                                                 01507000
CVTERPV  EQU   CVTMAP+316                                               01508000
CVTINTLA EQU   CVTMAP+320                                               01509000
CVTAPF   EQU   CVTMAP+324                                               01510000
CVTEXT2  EQU   CVTMAP+328                                               01511000
CVTHJES  EQU   CVTMAP+332                                               01512000
CVTPGSIA EQU   CVTMAP+348                                               01513000
CVTA1F1  EQU   CVTMAP+356                                               01514000
CVTSYSK  EQU   CVTMAP+357                                               01515000
CVTVOLM1 EQU   CVTMAP+380                                               01516000
CVTVOLF1 EQU   CVTVOLM1                                                 01517000
CVTATMCT EQU   CVTMAP+388                                               01518000
CVTXTNT1 EQU   0                                                        01519000
CVTXTNT2 EQU   0                                                        01520000
CVTDSSV  EQU   CVTXTNT2                                                 01521000
CVTFLGBT EQU   CVTXTNT2+5                                               01522000
CVTQID   EQU   CVTXTNT2+24                                              01523000
CVTSHS   EQU   CVTXTNT2+40                                              01524000
CVTRV400 EQU   CVTXTNT2+52                                              01525000
CVTRV409 EQU   CVTXTNT2+53                                              01526000
CVTATCVT EQU   CVTXTNT2+64                                              01527000
CVTRV429 EQU   CVTXTNT2+84                                              01528000
CVTRV438 EQU   CVTXTNT2+85                                              01529000
CVTRV457 EQU   CVTXTNT2+112                                             01530000
CVTRV466 EQU   CVTXTNT2+113                                             01531000
CVTFIX   EQU   0                                                        01532000
CVTRELNO EQU   CVTFIX+252                                               01533000
ISTRPH   EQU   0                                                        01534000
RPHCNTL  EQU   ISTRPH                                                   01535000
RPHFLAGS EQU   RPHCNTL+2                                                01536000
RPHAPTYP EQU   RPHFLAGS                                                 01537000
RPHFSTLC EQU   RPHFLAGS                                                 01538000
RPHFLGB  EQU   RPHCNTL+3                                                01539000
RPHRPHA  EQU   ISTRPH+4                                                 01540000
RPHTSKID EQU   ISTRPH+8                                                 01541000
RPHRESMA EQU   ISTRPH+16                                                01542000
RPHWPFLG EQU   RPHRESMA                                                 01543000
RPHWEA   EQU   ISTRPH+24                                                01544000
RPHCSPA  EQU   RPHWEA                                                   01545000
RPHSRPRM EQU   ISTRPH+28                                                01546000
RPHCRR   EQU   ISTRPH+32                                                01547000
RPHPABQA EQU   ISTRPH+36                                                01548000
RPHWORK  EQU   ISTRPH+40                                                01549000
RPHSAVE1 EQU   RPHWORK                                                  01550000
RPHSBITS EQU   RPHSAVE1+1                                               01551000
ISTPAB   EQU   0                                                        01552000
PABWQCHN EQU   ISTPAB                                                   01553000
PABWEQA  EQU   PABWQCHN                                                 01554000
PABCHAIN EQU   PABWQCHN+4                                               01555000
PABRPHFG EQU   ISTPAB+12                                                01556000
PABFLAGS EQU   PABRPHFG                                                 01557000
PABERLCK EQU   PABFLAGS                                                 01558000
PABERRLK EQU   PABERLCK                                                 01559000
ISTDYPAB EQU   0                                                        01560000
ISTLOK   EQU   0                                                        01561000
LOKCHN   EQU   ISTLOK+1                                                 01562000
LOKCHNG  EQU   LOKCHN                                                   01563000
@NM00007 EQU   LOKCHNG+2                                                01564000
ISTATCVT EQU   0                                                        01565000
ATCCOM   EQU   ISTATCVT                                                 01566000
ATCSTAT  EQU   ATCCOM                                                   01567000
ATCSTAT1 EQU   ATCSTAT                                                  01568000
ATCSTFLG EQU   ATCSTAT+1                                                01569000
ATCPOFLG EQU   ATCSTAT+2                                                01570000
ATCSTAT4 EQU   ATCSTAT+3                                                01571000
ATCBPDA  EQU   ATCCOM+128                                               01572000
ATCIOTRC EQU   ATCCOM+140                                               01573000
ATCTHTRC EQU   ATCIOTRC                                                 01574000
ATCSMRS  EQU   ATCCOM+188                                               01575000
ATCCSMR  EQU   ISTATCVT+296                                             01576000
ATCSHRFG EQU   ISTATCVT+316                                             01577000
ATCHPGM  EQU   ISTATCVT+384                                             01578000
ATCVLCNT EQU   ISTATCVT+772                                             01579000
ATCRNO   EQU   ISTATCVT+788                                             01580000
ATCSOPD  EQU   ISTATCVT+792                                             01581000
ATCSIPD  EQU   ISTATCVT+800                                             01582000
ATCSECST EQU   ISTATCVT+812                                             01583000
ATCSTAT2 EQU   ISTATCVT+818                                             01584000
ATCVTBAM EQU   ISTATCVT+908                                             01585000
@NM00015 EQU   ATCVTBAM+3                                               01586000
ATCAOSM  EQU   ISTATCVT+912                                             01587000
ATCGSRBQ EQU   ATCAOSM+4                                                01588000
ATCGSRBG EQU   ATCGSRBQ                                                 01589000
ATCAP34  EQU   ATCAOSM+32                                               01590000
ATCZFSVT EQU   ATCAOSM+68                                               01591000
ATCZPSVT EQU   ATCAOSM+72                                               01592000
ATCICAPP EQU   ATCAOSM+100                                              01593000
ATCLDAPP EQU   ATCAOSM+120                                              01594000
ATCDAPVT EQU   ATCAOSM+140                                              01595000
ATCAP37  EQU   ATCAOSM+264                                              01596000
ATCCRA   EQU   ATCAOSM+280                                              01597000
ATCCRACN EQU   ATCCRA+4                                                 01598000
ATCSRB   EQU   ATCAOSM+288                                              01599000
ATCSRBCN EQU   ATCSRB+4                                                 01600000
ATCCRPL  EQU   ATCAOSM+296                                              01601000
ATCRPLCN EQU   ATCCRPL+4                                                01602000
ATCSQAFR EQU   ATCAOSM+304                                              01603000
ATCORTBC EQU   ATCSQAFR+4                                               01604000
ATCORSRB EQU   ATCORTBC                                                 01605000
@NM00017 EQU   ATCAOSM+332                                              01606000
ATCVTFLG EQU   ATCAOSM+392                                              01607000
ATCZFLAG EQU   ATCAOSM+588                                              01608000
ISTLCCW  EQU   0                                                        01609000
LCCWOP   EQU   ISTLCCW                                                  01610000
LCCWRWOP EQU   LCCWOP                                                   01611000
LCCWCTL  EQU   LCCWRWOP                                                 01612000
LCCWFLAG EQU   ISTLCCW+1                                                01613000
LCCWLSI  EQU   LCCWFLAG                                                 01614000
ISTLSCB  EQU   0                                                        01615000
LSC1WORD EQU   ISTLSCB                                                  01616000
LSCTYPE  EQU   LSC1WORD                                                 01617000
LSCREQTG EQU   LSC1WORD+2                                               01618000
LSCZRT02 EQU   LSCREQTG                                                 01619000
LSCZRT03 EQU   LSCREQTG                                                 01620000
LSCZRT04 EQU   LSCREQTG                                                 01621000
LSCZRT05 EQU   LSCREQTG                                                 01622000
LSCZRT06 EQU   LSCREQTG                                                 01623000
LSCZRT07 EQU   LSCREQTG                                                 01624000
LSCZMNRC EQU   LSCREQTG+1                                               01625000
LSCZRT08 EQU   LSCZMNRC                                                 01626000
LSCZRT09 EQU   LSCZMNRC                                                 01627000
LSCCHAIN EQU   ISTLSCB+4                                                01628000
LSCCHAI1 EQU   LSCCHAIN                                                 01629000
LSCRUCNT EQU   ISTLSCB+8                                                01630000
LSCZMIRC EQU   LSCRUCNT                                                 01631000
LSCFLGS  EQU   ISTLSCB+9                                                01632000
LSCSMODE EQU   LSCFLGS                                                  01633000
LSCSEQ   EQU   ISTLSCB+10                                               01634000
LSCLCPBA EQU   ISTLSCB+16                                               01635000
LSCLCCWA EQU   ISTLSCB+20                                               01636000
LSCFDBA  EQU   ISTLSCB+24                                               01637000
ISTLCPB  EQU   0                                                        01638000
LCPREQTG EQU   ISTLCPB+2                                                01639000
LCPFLAGS EQU   LCPREQTG                                                 01640000
LCPZF001 EQU   LCPFLAGS                                                 01641000
LCPZRT02 EQU   LCPZF001                                                 01642000
LCPZF002 EQU   LCPFLAGS                                                 01643000
LCPZRT03 EQU   LCPZF002                                                 01644000
LCPZF003 EQU   LCPFLAGS                                                 01645000
LCPZRT04 EQU   LCPZF003                                                 01646000
LCPZF004 EQU   LCPFLAGS                                                 01647000
LCPZRT05 EQU   LCPZF004                                                 01648000
LCPZRT06 EQU   LCPFLAGS                                                 01649000
LCPZRT07 EQU   LCPFLAGS                                                 01650000
LCPMNRCD EQU   LCPREQTG+1                                               01651000
LCPZRT08 EQU   LCPMNRCD                                                 01652000
LCPZRT09 EQU   LCPMNRCD                                                 01653000
LCPCHAIN EQU   ISTLCPB+4                                                01654000
LCPCHAI1 EQU   LCPCHAIN                                                 01655000
LCPRUCNT EQU   ISTLCPB+8                                                01656000
LCPFLAG2 EQU   ISTLCPB+9                                                01657000
LCPTLBPI EQU   LCPFLAG2                                                 01658000
LCPFID0  EQU   LCPFLAG2                                                 01659000
LCPFREE  EQU   LCPFLAG2                                                 01660000
LCPATOP  EQU   LCPFLAG2                                                 01661000
LCPSEQ   EQU   ISTLCPB+10                                               01662000
LCPCID   EQU   ISTLCPB+16                                               01663000
LCPFDBA  EQU   ISTLCPB+24                                               01664000
LCPFLG1  EQU   ISTLCPB+37                                               01665000
LCPFLCCW EQU   ISTLCPB+40                                               01666000
LCPLCCW  EQU   ISTLCPB+48                                               01667000
LCPPABA  EQU   LCPLCCW+4                                                01668000
LCPRPHA  EQU   LCPPABA                                                  01669000
ISTDEVCH EQU   0                                                        01670000
DEVSHCH  EQU   ISTDEVCH                                                 01671000
DEVCHAR  EQU   DEVSHCH                                                  01672000
DEVTCODE EQU   ISTDEVCH+1                                               01673000
DEVFLAGS EQU   ISTDEVCH+3                                               01674000
DEVFCCTL EQU   DEVFLAGS                                                 01675000
DEVCHAR3 EQU   DEVFLAGS                                                 01676000
ISTPROCD EQU   0                                                        01677000
PROPROC  EQU   ISTPROCD                                                 01678000
PROPROC1 EQU   PROPROC                                                  01679000
PROPROC2 EQU   PROPROC+1                                                01680000
PROPROC3 EQU   PROPROC+2                                                01681000
PROPROC4 EQU   PROPROC+3                                                01682000
PROPROCS EQU   0                                                        01683000
PROSETMS EQU   PROPROCS+1                                               01684000
PROSETM2 EQU   PROSETMS                                                 01685000
PROSETM3 EQU   PROSETMS+1                                               01686000
PROSETM4 EQU   PROSETMS+2                                               01687000
ISTFMCB  EQU   0                                                        01688000
FMCSTAT  EQU   ISTFMCB+28                                               01689000
FMCSTAT1 EQU   ISTFMCB+29                                               01690000
FMCCMDFL EQU   ISTFMCB+31                                               01691000
FMCCMPS1 EQU   ISTFMCB+36                                               01692000
FMCPAB2  EQU   ISTFMCB+80                                               01693000
FMCSIPA  EQU   ISTFMCB+148                                              01694000
FMCNXOSQ EQU   ISTFMCB+152                                              01695000
FMCNXCFM EQU   FMCNXOSQ                                                 01696000
FMCNXOSC EQU   FMCNXOSQ+2                                               01697000
FMCSSTAT EQU   ISTFMCB+159                                              01698000
FMCPACE  EQU   ISTFMCB+160                                              01699000
FMCPACEN EQU   FMCPACE                                                  01700000
FMCPACEM EQU   FMCPACE+1                                                01701000
FMCPACPC EQU   FMCPACE+2                                                01702000
FMCCVAL  EQU   FMCPACE+3                                                01703000
FMCOBCE  EQU   FMCCVAL                                                  01704000
FMCCLEXT EQU   ISTFMCB+164                                              01705000
FMCRPLA  EQU   FMCCLEXT                                                 01706000
FMCFBA   EQU   FMCCLEXT+4                                               01707000
FMCCMPS2 EQU   FMCCLEXT+16                                              01708000
FMCFLGA  EQU   FMCCMPS2                                                 01709000
FMCFLGCL EQU   FMCCMPS2+1                                               01710000
FMCPSCMD EQU   FMCCMPS2+2                                               01711000
FMCPSTAT EQU   FMCCMPS2+3                                               01712000
FMCSTAT2 EQU   ISTFMCB+186                                              01713000
FMCMODEB EQU   ISTFMCB+189                                              01714000
FMCCLSEQ EQU   ISTFMCB+190                                              01715000
FMCRRESP EQU   ISTFMCB+195                                              01716000
FMCSSEGQ EQU   ISTFMCB+200                                              01717000
FMCFBAS  EQU   ISTFMCB+216                                              01718000
FMCZV002 EQU   FMCFBAS                                                  01719000
FMCSNCTL EQU   ISTFMCB+224                                              01720000
FMCSCFLG EQU   FMCSNCTL                                                 01721000
FMCVS1   EQU   ISTFMCB+232                                              01722000
FMCZFLAG EQU   FMCVS1                                                   01723000
FMCZF006 EQU   FMCZFLAG                                                 01724000
FMCZFA06 EQU   FMCZF006                                                 01725000
FMCZF014 EQU   FMCZFLAG+2                                               01726000
FMCZF015 EQU   FMCZFLAG+2                                               01727000
FMCZF021 EQU   FMCZFLAG+3                                               01728000
FMCZH001 EQU   FMCVS1+4                                                 01729000
FMCLBXM  EQU   FMCVS1+12                                                01730000
FMCSHEAQ EQU   FMCLBXM                                                  01731000
FMCLCPBQ EQU   FMCVS1+16                                                01732000
FMCLCPAQ EQU   FMCVS1+20                                                01733000
FMCZX006 EQU   FMCVS1+33                                                01734000
FMCSEQ1  EQU   FMCVS1+34                                                01735000
FMCZFLG2 EQU   FMCVS1+35                                                01736000
FMCZV004 EQU   FMCVS1+40                                                01737000
FMCCVFLG EQU   FMCVS1+44                                                01738000
FMCFLAG  EQU   0                                                        01739000
FMCFLGB  EQU   FMCFLAG                                                  01740000
ISTFDB   EQU   0                                                        01741000
FDBDATAA EQU   ISTFDB+4                                                 01742000
FDBDATCT EQU   ISTFDB+8                                                 01743000
FDBOFSET EQU   ISTFDB+10                                                01744000
ISTFSB   EQU   0                                                        01745000
FSBFSB   EQU   ISTFSB                                                   01746000
FSBMNRCD EQU   FSBFSB+2                                                 01747000
FSBSFLGS EQU   FSBFSB+3                                                 01748000
FSBFSBA  EQU   FSBFSB+4                                                 01749000
FSBBTH   EQU   FSBFSB+8                                                 01750000
FSBCID   EQU   FSBBTH                                                   01751000
FSBSAF   EQU   FSBCID                                                   01752000
FSBDAF   EQU   FSBCID+2                                                 01753000
FSBRQTAG EQU   FSBBTH+4                                                 01754000
FSBSEQID EQU   FSBRQTAG                                                 01755000
FSBFLAGS EQU   FSBSEQID                                                 01756000
FSBSEQ   EQU   FSBSEQID+1                                               01757000
FSBCSWST EQU   FSBBTH+6                                                 01758000
FSBTHFLD EQU   FSBCSWST                                                 01759000
FSBTH1   EQU   FSBTHFLD                                                 01760000
FSBSYSRS EQU   FSBTH1                                                   01761000
FSBTH2   EQU   FSBTHFLD+1                                               01762000
FSBEXTRS EQU   FSBTH2                                                   01763000
FSBXFSTS EQU   FSBEXTRS                                                 01764000
FSBXCODE EQU   FSBEXTRS                                                 01765000
FSBNETRS EQU   FSBFSB+16                                                01766000
FSBSRCAT EQU   FSBNETRS                                                 01767000
FSBMJRCD EQU   FSBSRCAT                                                 01768000
FSBERC   EQU   FSBNETRS+1                                               01769000
FSBELI   EQU   FSBERC                                                   01770000
FSBECI   EQU   FSBERC                                                   01771000
FSBFBMI  EQU   FSBERC                                                   01772000
FSBDMGRS EQU   FSBFSB+18                                                01773000
FSBSS1   EQU   FSBDMGRS                                                 01774000
FSBSS2   EQU   FSBDMGRS+1                                               01775000
FSBLCPB  EQU   FSBFSB+20                                                01776000
FSBMSGID EQU   FSBLCPB                                                  01777000
FSBLCCWA EQU   FSBFSB+24                                                01778000
FSBRLSTS EQU   FSBLCCWA                                                 01779000
ISTBDU   EQU   0                                                        01780000
BDUCOMND EQU   ISTBDU                                                   01781000
BDUMODIF EQU   ISTBDU+1                                                 01782000
BDUMOD1  EQU   BDUMODIF                                                 01783000
BDUDAF   EQU   ISTBDU+2                                                 01784000
BDUFUNC  EQU   BDUDAF                                                   01785000
BDUCHECK EQU   BDUFUNC                                                  01786000
BDUFLAGS EQU   BDUDAF+1                                                 01787000
ISTBTU   EQU   0                                                        01788000
BTUBTH   EQU   ISTBTU                                                   01789000
BTUFID   EQU   BTUBTH                                                   01790000
BTUDEST  EQU   BTUBTH+2                                                 01791000
BTUSORCE EQU   BTUBTH+4                                                 01792000
BTUREQ   EQU   BTUBTH+6                                                 01793000
BTURQFLG EQU   BTUREQ                                                   01794000
BTUDCF   EQU   BTUBTH+8                                                 01795000
BTURH    EQU   BTUBTH+10                                                01796000
BTUBDU   EQU   ISTBTU+14                                                01797000
BTUSYSTR EQU   ISTBTU+18                                                01798000
BTUEXTR  EQU   ISTBTU+19                                                01799000
ISTLH    EQU   0                                                        01800000
ISTTH    EQU   0                                                        01801000
THFLAG1  EQU   ISTTH                                                    01802000
THFLGA   EQU   THFLAG1                                                  01803000
THMPF    EQU   THFLGA                                                   01804000
THFLGB   EQU   THFLAG1+1                                                01805000
ISTTH2   EQU   0                                                        01806000
TH2FLAG1 EQU   ISTTH2                                                   01807000
TH2MPF   EQU   TH2FLAG1                                                 01808000
ISTZIBUF EQU   0                                                        01809000
ZIBFSM   EQU   ISTZIBUF+4                                               01810000
ISTZSAVE EQU   0                                                        01811000
ZSAZSVBC EQU   ISTZSAVE                                                 01812000
ZSAZSVMS EQU   ZSAZSVBC                                                 01813000
ZSAZACTV EQU   ZSAZSVMS                                                 01814000
ZSAZSVFC EQU   ISTZSAVE+4                                               01815000
ZSAZSVRR EQU   ISTZSAVE+8                                               01816000
ZSAZSVVR EQU   ISTZSAVE+12                                              01817000
ZSAZTRAC EQU   ISTZSAVE+36                                              01818000
ISTZCRR  EQU   0                                                        01819000
ZCRCRR   EQU   ISTZCRR                                                  01820000
ZCRFLGS1 EQU   ISTZCRR+12                                               01821000
ZCRFLGS2 EQU   ISTZCRR+13                                               01822000
ZCRSWFLD EQU   ISTZCRR+14                                               01823000
ZCRENDSH EQU   ZCRSWFLD                                                 01824000
ZCRNDLCP EQU   ZCRSWFLD                                                 01825000
ZCRRESET EQU   ZCRSWFLD                                                 01826000
ZCRFLGS3 EQU   ISTZCRR+15                                               01827000
ZCRGENSW EQU   ISTZCRR+16                                               01828000
ZCRPFLGS EQU   ISTZCRR+17                                               01829000
ZCRIBPR  EQU   ISTZCRR+18                                               01830000
ZCR3270R EQU   ZCRIBPR                                                  01831000
ZCRSCPSW EQU   ISTZCRR+19                                               01832000
ZCRPARMS EQU   ISTZCRR+24                                               01833000
ZCRFBPTR EQU   ZCRPARMS                                                 01834000
ZCRDFRDA EQU   ZCRPARMS+10                                              01835000
ZCRPCOD1 EQU   ZCRPARMS+12                                              01836000
ZCRPLSBF EQU   ZCRPCOD1                                                 01837000
ZCRPLSCB EQU   ZCRPCOD1                                                 01838000
ZCRPBUF  EQU   ZCRPCOD1                                                 01839000
ZCRPCOD2 EQU   ZCRPARMS+13                                              01840000
ZCRSVRTN EQU   ISTZCRR+56                                               01841000
ZCRSVF7  EQU   ZCRSVRTN+24                                              01842000
ZCRSVF8  EQU   ZCRSVRTN+28                                              01843000
ZCRSVF9  EQU   ZCRSVRTN+32                                              01844000
ZCRWKARA EQU   ISTZCRR+156                                              01845000
ZCRSCANQ EQU   ISTZCRR+180                                              01846000
ZCRNXTEL EQU   ISTZCRR+180                                              01847000
ZCRLSTFB EQU   ISTZCRR+180                                              01848000
ZCRCIDSV EQU   ISTZCRR+192                                              01849000
ZCRAUDIT EQU   ISTZCRR+440                                              01850000
ZCRENTER EQU   ZCRAUDIT+5                                               01851000
ZCREICAB EQU   ZCRENTER+10                                              01852000
ZCRLCPB  EQU   ISTZCRR+480                                              01853000
ZCRRHRU  EQU   ZCRLCPB                                                  01854000
ISTPFCRR EQU   0                                                        01855000
PFCCRR   EQU   ISTPFCRR                                                 01856000
PFCCRRID EQU   PFCCRR                                                   01857000
PFCCRRLN EQU   PFCCRR+2                                                 01858000
PFCHDR   EQU   ISTPFCRR+4                                               01859000
PFCCRRO  EQU   PFCHDR                                                   01860000
PFCFRRO  EQU   PFCHDR+4                                                 01861000
ISTCFCRR EQU   0                                                        01862000
CFCAUDIT EQU   ISTCFCRR                                                 01863000
CFCNTRD  EQU   CFCAUDIT                                                 01864000
CFCCRT   EQU   CFCAUDIT+1                                               01865000
ISTASCRR EQU   0                                                        01866000
ASCFLAGS EQU   ISTASCRR+16                                              01867000
ASCFLG1  EQU   ASCFLAGS                                                 01868000
ASCFLG2  EQU   ASCFLAGS+2                                               01869000
ASCFLG3  EQU   ASCFLAGS+4                                               01870000
ASCUSRGS EQU   ISTASCRR+28                                              01871000
ISTAPCRR EQU   0                                                        01872000
APCATFLG EQU   ISTAPCRR+16                                              01873000
APCRFLG  EQU   ISTAPCRR+18                                              01874000
APCSAVE  EQU   ISTAPCRR+44                                              01875000
APCCOMF  EQU   ISTAPCRR+116                                             01876000
APCCOMF1 EQU   APCCOMF                                                  01877000
APC31FLG EQU   ISTAPCRR+132                                             01878000
APC52FLG EQU   ISTAPCRR+133                                             01879000
APC53FLG EQU   ISTAPCRR+134                                             01880000
APC54FLG EQU   ISTAPCRR+135                                             01881000
APC57FLG EQU   ISTAPCRR+136                                             01882000
ISTCRA   EQU   0                                                        01883000
CRABASIC EQU   ISTCRA                                                   01884000
CRAHDR   EQU   CRABASIC                                                 01885000
CRACRR   EQU   CRAHDR                                                   01886000
CRALKACT EQU   CRABASIC+8                                               01887000
CRASVC   EQU   ISTCRA+848                                               01888000
CRABUFA  EQU   CRASVC+68                                                01889000
ISTNCB   EQU   0                                                        01890000
NCBTYPE  EQU   ISTNCB                                                   01891000
NCBNSNA  EQU   ISTNCB+12                                                01892000
NCBFLAGS EQU   ISTNCB+24                                                01893000
NCBFRAS  EQU   NCBFLAGS+1                                               01894000
NCBFTRIO EQU   NCBFRAS                                                  01895000
NCBFLAG1 EQU   NCBFLAGS+2                                               01896000
NCBDEVCH EQU   ISTNCB+36                                                01897000
ISTDNCB  EQU   0                                                        01898000
DNCNCB   EQU   ISTDNCB                                                  01899000
DNCOS    EQU   ISTDNCB+56                                               01900000
DNCZFLGS EQU   DNCOS                                                    01901000
DNCBSCED EQU   DNCOS+2                                                  01902000
DNCACIP  EQU   DNCBSCED+1                                               01903000
DNCZX003 EQU   DNCOS+16                                                 01904000
ISTZPSVT EQU   0                                                        01905000
ZPSZDFB0 EQU   ISTZPSVT+16                                              01906000
ZPSZDFQR EQU   ISTZPSVT+80                                              01907000
ISTZFSVT EQU   0                                                        01908000
ZFSZEFBB EQU   ISTZFSVT                                                 01909000
ZFSZEABB EQU   ZFSZEFBB                                                 01910000
ZFSZEFAB EQU   ISTZFSVT+4                                               01911000
ZFSZEAAB EQU   ZFSZEFAB                                                 01912000
ISTZRCVT EQU   0                                                        01913000
ZRCZIFIB EQU   ISTZRCVT+92                                              01914000
ZRCZIFSB EQU   ISTZRCVT+100                                             01915000
ISTWKE   EQU   0                                                        01916000
WKECHAIN EQU   ISTWKE+4                                                 01917000
WKEFLAGS EQU   WKECHAIN                                                 01918000
FMZL0030 EQU   0                                                        01919000
ISTAPC37 EQU   0                                                        01920000
ISTAPC34 EQU   0                                                        01921000
ISTZDFB0 EQU   0                                                        01922000
ISTZDFQR EQU   0                                                        01923000
ISTZEFBB EQU   0                                                        01924000
ISTZIFIB EQU   0                                                        01925000
ISTZIFSB EQU   0                                                        01926000
ZIBSRB   EQU   0                                                        01927000
CVTS01   EQU   CVTPGSIA                                                 01928000
CVTLPDIA EQU   CVTS01+12                                                01929000
CVTDIRST EQU   CVTLPDIA                                                 01930000
CVTSLIDA EQU   CVTS01+24                                                01931000
CVTCTLFG EQU   CVTS01+50                                                01932000
CVTRV210 EQU   CVTS01+424                                               01933000
CVTRV219 EQU   CVTS01+425                                               01934000
CVTRV228 EQU   CVTS01+426                                               01935000
CVTRV237 EQU   CVTS01+427                                               01936000
CVTMFRTR EQU   CVTS01+452                                               01937000
CVTRV262 EQU   CVTS01+468                                               01938000
CVTRV271 EQU   CVTS01+469                                               01939000
CVTRV280 EQU   CVTS01+470                                               01940000
CVTRV289 EQU   CVTS01+471                                               01941000
CVTGSDA  EQU   CVTS01+600                                               01942000
LCPZTIE  EQU   LCPCID                                                   01943000
LCPZSNAM EQU   LCPZTIE+8                                                01944000
FSBCOMBN EQU   FSBNETRS                                                 01945000
FSBRHFLD EQU   FSBCOMBN+1                                               01946000
FSBRH3   EQU   FSBRHFLD+2                                               01947000
FSBLDFLG EQU   FSBRH3                                                   01948000
@NM00032 EQU   FSBRQTAG                                                 01949000
ZIBDIO   EQU   ZIBFSM                                                   01950000
ZIBCCW2  EQU   ZIBDIO+8                                                 01951000
ZIBCPTCC EQU   ZIBCCW2                                                  01952000
ZIBAIO   EQU   ISTZIBUF                                                 01953000
ZIBAIOCM EQU   ZIBAIO                                                   01954000
ZIBFDBZ  EQU   ZIBAIOCM                                                 01955000
ZIBFIB   EQU   ZIBAIO+16                                                01956000
ZIBFSB   EQU   ZIBFIB                                                   01957000
ZIBMDREC EQU   ZIBFSB+4                                                 01958000
ZIBMDRIN EQU   ZIBFSB+28                                                01959000
ZIBBTU   EQU   ZIBFIB+32                                                01960000
ZIBFDBS  EQU   ZIBBTU                                                   01961000
@NM00036 EQU   ZIBBTU+12                                                01962000
ZIBFID1  EQU   @NM00036+1                                               01963000
ZIBFITXT EQU   ZIBFID1                                                  01964000
ZIBSIB   EQU   ZIBFIB                                                   01965000
ZIBREC   EQU   ZIBMDRIN                                                 01966000
ZIBRECPL EQU   ZIBREC                                                   01967000
ZIBRECHD EQU   ZIBRECPL                                                 01968000
ZIBRECRS EQU   ZIBREC+8                                                 01969000
ZIBRECDT EQU   ZIBREC+10                                                01970000
ZIBMDRRC EQU   ZIBMDREC                                                 01971000
ZIBRCPL  EQU   ZIBMDRRC                                                 01972000
ZIBRCDT  EQU   ZIBMDRRC+24                                              01973000
@NM00038 EQU   ZIBBTU                                                   01974000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01975000
ZIBTH2   EQU   @NM00038+4                                               01976000
ZIBLH    EQU   @NM00038                                                 01977000
ZIBRCTXT EQU   ZIBMDRRC+36                                              01978000
ZIBRCRID EQU   ZIBRCDT+10                                               01979000
ZIBRCNAM EQU   ZIBRCDT+2                                                01980000
ZIBRCUA  EQU   ZIBRCDT                                                  01981000
ZIBRCPUI EQU   ZIBRCPL+20                                               01982000
ZIBRCPUN EQU   ZIBRCPL+16                                               01983000
ZIBRCTIM EQU   ZIBRCPL+12                                               01984000
ZIBRCDAT EQU   ZIBRCPL+8                                                01985000
ZIBRCRS1 EQU   ZIBRCPL+6                                                01986000
ZIBRCSID EQU   ZIBRCPL+5                                                01987000
ZIBRCID  EQU   ZIBRCPL+4                                                01988000
ZIBRCSW  EQU   ZIBRCPL+2                                                01989000
ZIBRCSYR EQU   ZIBRCPL+1                                                01990000
ZIBRCL   EQU   ZIBRCPL                                                  01991000
ZIBRECTX EQU   ZIBREC+22                                                01992000
ZIBRECID EQU   ZIBRECDT+10                                              01993000
ZIBRECNA EQU   ZIBRECDT+2                                               01994000
ZIBRECUA EQU   ZIBRECDT                                                 01995000
ZIBRECSV EQU   ZIBRECRS                                                 01996000
ZIBRECDA EQU   ZIBRECPL+4                                               01997000
ZIBRECSI EQU   ZIBRECHD+3                                               01998000
ZIBRECDV EQU   ZIBRECHD+2                                               01999000
ZIBRECFL EQU   ZIBRECHD+1                                               02000000
ZIBRECTY EQU   ZIBRECHD                                                 02001000
ZIBTEXT  EQU   ZIBSIB+4                                                 02002000
ZIBRSV04 EQU   ZIBSIB                                                   02003000
ZIBTEXT2 EQU   ZIBFITXT                                                 02004000
ZIBTEXT1 EQU   ZIBFIB+52                                                02005000
@NM00037 EQU   @NM00036                                                 02006000
@NM00035 EQU   ZIBMDREC                                                 02007000
@NM00034 EQU   ZIBFSB                                                   02008000
ZIBLNG2  EQU   ZIBAIOCM+14                                              02009000
ZIBRSV03 EQU   ZIBAIOCM+13                                              02010000
ZIBWKBYT EQU   ZIBAIOCM+12                                              02011000
ZIBCPNPK EQU   ZIBCCW2+6                                                02012000
ZIBRSV02 EQU   ZIBCCW2+5                                                02013000
ZIBCPTPF EQU   ZIBCCW2+4                                                02014000
ZIBCPTCA EQU   ZIBCCW2+1                                                02015000
ZIBCPNPC EQU   ZIBCPTCC                                                 02016000
ZIBCPRDK EQU   ZIBDIO+6                                                 02017000
ZIBRSV01 EQU   ZIBDIO+5                                                 02018000
ZIBCPRDF EQU   ZIBDIO+4                                                 02019000
ZIBCPTXA EQU   ZIBDIO+1                                                 02020000
ZIBCPRDC EQU   ZIBDIO                                                   02021000
FSBRT0B  EQU   @NM00032+1                                               02022000
FSBRT0A  EQU   @NM00032+1                                               02023000
FSBRT09  EQU   @NM00032+1                                               02024000
FSBRT08  EQU   @NM00032+1                                               02025000
FSBRT07  EQU   @NM00032                                                 02026000
FSBRT06  EQU   @NM00032                                                 02027000
FSBRT05  EQU   @NM00032                                                 02028000
FSBRT04  EQU   @NM00032                                                 02029000
FSBRT03  EQU   @NM00032                                                 02030000
FSBRT02  EQU   @NM00032                                                 02031000
FSBRT01  EQU   @NM00032                                                 02032000
FSBRT00  EQU   @NM00032                                                 02033000
FSBLDCUF EQU   FSBLDFLG                                                 02034000
FSBLDSIF EQU   FSBLDFLG                                                 02035000
FSBLDSOF EQU   FSBLDFLG                                                 02036000
FSBLDEBF EQU   FSBLDFLG                                                 02037000
FSBLDBBF EQU   FSBLDFLG                                                 02038000
FSBLDFME EQU   FSBLDFLG                                                 02039000
FSBLDSCF EQU   FSBLDFLG                                                 02040000
FSBLDRMF EQU   FSBLDFLG                                                 02041000
FSBRH2   EQU   FSBRHFLD+1                                               02042000
FSBRH1   EQU   FSBRHFLD                                                 02043000
FSBALIGN EQU   FSBCOMBN                                                 02044000
LCPZTRV4 EQU   LCPZSNAM+4                                               02045000
LCPZTRV1 EQU   LCPZSNAM                                                 02046000
LCPZSNA  EQU   LCPZTIE+4                                                02047000
LCPZFMCA EQU   LCPZTIE                                                  02048000
CVTRV628 EQU   CVTS01+728                                               02049000
CVTRV627 EQU   CVTS01+724                                               02050000
CVTRV626 EQU   CVTS01+720                                               02051000
CVTRV625 EQU   CVTS01+716                                               02052000
CVTRV624 EQU   CVTS01+712                                               02053000
CVTRV623 EQU   CVTS01+708                                               02054000
CVTRV622 EQU   CVTS01+704                                               02055000
CVTRV621 EQU   CVTS01+700                                               02056000
CVTRV620 EQU   CVTS01+696                                               02057000
CVTRV619 EQU   CVTS01+692                                               02058000
CVTRV618 EQU   CVTS01+688                                               02059000
CVTRV617 EQU   CVTS01+684                                               02060000
CVTRV616 EQU   CVTS01+680                                               02061000
CVTRV615 EQU   CVTS01+676                                               02062000
CVTRV614 EQU   CVTS01+672                                               02063000
CVTRV613 EQU   CVTS01+668                                               02064000
CVTTCASP EQU   CVTS01+664                                               02065000
CVT0PT03 EQU   CVTS01+660                                               02066000
CVT0PT0E EQU   CVTS01+656                                               02067000
CVTIRM   EQU   CVTS01+652                                               02068000
CVTCGK   EQU   CVTS01+648                                               02069000
CVTRV607 EQU   CVTS01+644                                               02070000
CVTRV606 EQU   CVTS01+640                                               02071000
CVTRV605 EQU   CVTS01+636                                               02072000
CVTRV604 EQU   CVTS01+632                                               02073000
CVTEFF02 EQU   CVTS01+628                                               02074000
CVTCBBR  EQU   CVTS01+624                                               02075000
CVTSSCR  EQU   CVTS01+620                                               02076000
CVTEVENT EQU   CVTS01+616                                               02077000
CVTCRCA  EQU   CVTS01+612                                               02078000
CVTTPIO  EQU   CVTS01+608                                               02079000
CVTADV   EQU   CVTS01+604                                               02080000
CVTGSDAB EQU   CVTGSDA                                                  02081000
CVTQV3   EQU   CVTS01+596                                               02082000
CVTQV2   EQU   CVTS01+592                                               02083000
CVTQV1   EQU   CVTS01+588                                               02084000
CVTRPT   EQU   CVTS01+584                                               02085000
CVTSSRB  EQU   CVTS01+580                                               02086000
CVTCSDRL EQU   CVTS01+576                                               02087000
CVTEXP1  EQU   CVTS01+572                                               02088000
CVTRMPMT EQU   CVTS01+568                                               02089000
CVTRMPTT EQU   CVTS01+564                                               02090000
CVTVPSA  EQU   CVTS01+560                                               02091000
CVTVSTOP EQU   CVTS01+556                                               02092000
CVTGTFR8 EQU   CVTS01+552                                               02093000
CVTQUIT  EQU   CVTS01+548                                               02094000
CVTVACR  EQU   CVTS01+544                                               02095000
CVTWTCB  EQU   CVTS01+540                                               02096000
CVTSTPRS EQU   CVTS01+536                                               02097000
CVT0PT02 EQU   CVTS01+532                                               02098000
CVTDARCM EQU   CVTS01+528                                               02099000
CVTIRECM EQU   CVTS01+524                                               02100000
CVTJRECM EQU   CVTS01+520                                               02101000
CVTVEMS0 EQU   CVTS01+516                                               02102000
CVTSPFRR EQU   CVTS01+512                                               02103000
CVTRLSTG EQU   CVTS01+508                                               02104000
CVT0TC0A EQU   CVTS01+504                                               02105000
CVTGMBR  EQU   CVTS01+500                                               02106000
CVTLFRM  EQU   CVTS01+496                                               02107000
CVTRMBR  EQU   CVTS01+492                                               02108000
CVTVIOP  EQU   CVTS01+488                                               02109000
CVTRV307 EQU   CVTS01+486                                               02110000
CVTRV306 EQU   CVTS01+484                                               02111000
CVTRV305 EQU   CVTS01+482                                               02112000
CVTRV304 EQU   CVTS01+480                                               02113000
CVTRV303 EQU   CVTS01+478                                               02114000
CVTRV302 EQU   CVTS01+476                                               02115000
CVTTRCA  EQU   CVTS01+472                                               02116000
CVTRV297 EQU   CVTRV289                                                 02117000
CVTRV296 EQU   CVTRV289                                                 02118000
CVTRV295 EQU   CVTRV289                                                 02119000
CVTRV294 EQU   CVTRV289                                                 02120000
CVTRV293 EQU   CVTRV289                                                 02121000
CVTRV292 EQU   CVTRV289                                                 02122000
CVTRV291 EQU   CVTRV289                                                 02123000
CVTRV290 EQU   CVTRV289                                                 02124000
CVTRV288 EQU   CVTRV280                                                 02125000
CVTRV287 EQU   CVTRV280                                                 02126000
CVTRV286 EQU   CVTRV280                                                 02127000
CVTRV285 EQU   CVTRV280                                                 02128000
CVTRV284 EQU   CVTRV280                                                 02129000
CVTRV283 EQU   CVTRV280                                                 02130000
CVTRV282 EQU   CVTRV280                                                 02131000
CVTRV281 EQU   CVTRV280                                                 02132000
CVTRV279 EQU   CVTRV271                                                 02133000
CVTRV278 EQU   CVTRV271                                                 02134000
CVTRV277 EQU   CVTRV271                                                 02135000
CVTRV276 EQU   CVTRV271                                                 02136000
CVTRV275 EQU   CVTRV271                                                 02137000
CVTRV274 EQU   CVTRV271                                                 02138000
CVTRV273 EQU   CVTRV271                                                 02139000
CVTRV272 EQU   CVTRV271                                                 02140000
CVTRV270 EQU   CVTRV262                                                 02141000
CVTRV269 EQU   CVTRV262                                                 02142000
CVTRV268 EQU   CVTRV262                                                 02143000
CVTRV267 EQU   CVTRV262                                                 02144000
CVTRV266 EQU   CVTRV262                                                 02145000
CVTRV265 EQU   CVTRV262                                                 02146000
CVTRV264 EQU   CVTRV262                                                 02147000
CVTRV263 EQU   CVTRV262                                                 02148000
CVTVFP   EQU   CVTS01+464                                               02149000
CVTVSI   EQU   CVTS01+460                                               02150000
CVTVPSIB EQU   CVTS01+456                                               02151000
CVTMFACT EQU   CVTMFRTR                                                 02152000
CVTMFCTL EQU   CVTS01+448                                               02153000
CVTPVBP  EQU   CVTS01+444                                               02154000
CVTPWI   EQU   CVTS01+440                                               02155000
CVTRV254 EQU   CVTS01+438                                               02156000
CVTRV253 EQU   CVTS01+436                                               02157000
CVTRV252 EQU   CVTS01+434                                               02158000
CVTRV251 EQU   CVTS01+433                                               02159000
CVTRV250 EQU   CVTS01+432                                               02160000
CVTRV249 EQU   CVTS01+431                                               02161000
CVTRV248 EQU   CVTS01+430                                               02162000
CVTRV247 EQU   CVTS01+429                                               02163000
CVTRV246 EQU   CVTS01+428                                               02164000
CVTRV245 EQU   CVTRV237                                                 02165000
CVTRV244 EQU   CVTRV237                                                 02166000
CVTRV243 EQU   CVTRV237                                                 02167000
CVTRV242 EQU   CVTRV237                                                 02168000
CVTRV241 EQU   CVTRV237                                                 02169000
CVTRV240 EQU   CVTRV237                                                 02170000
CVTRV239 EQU   CVTRV237                                                 02171000
CVTRV238 EQU   CVTRV237                                                 02172000
CVTRV236 EQU   CVTRV228                                                 02173000
CVTRV235 EQU   CVTRV228                                                 02174000
CVTRV234 EQU   CVTRV228                                                 02175000
CVTRV233 EQU   CVTRV228                                                 02176000
CVTRV232 EQU   CVTRV228                                                 02177000
CVTRV231 EQU   CVTRV228                                                 02178000
CVTRV230 EQU   CVTRV228                                                 02179000
CVTRV229 EQU   CVTRV228                                                 02180000
CVTRV227 EQU   CVTRV219                                                 02181000
CVTRV226 EQU   CVTRV219                                                 02182000
CVTRV225 EQU   CVTRV219                                                 02183000
CVTRV224 EQU   CVTRV219                                                 02184000
CVTRV223 EQU   CVTRV219                                                 02185000
CVTRV222 EQU   CVTRV219                                                 02186000
CVTRV221 EQU   CVTRV219                                                 02187000
CVTRV220 EQU   CVTRV219                                                 02188000
CVTRV218 EQU   CVTRV210                                                 02189000
CVTRV217 EQU   CVTRV210                                                 02190000
CVTRV216 EQU   CVTRV210                                                 02191000
CVTRV215 EQU   CVTRV210                                                 02192000
CVTRV214 EQU   CVTRV210                                                 02193000
CVTRV213 EQU   CVTRV210                                                 02194000
CVTRV212 EQU   CVTRV210                                                 02195000
CVTRV211 EQU   CVTRV210                                                 02196000
CVTLCCAT EQU   CVTS01+420                                               02197000
CVTPCCAT EQU   CVTS01+416                                               02198000
CVTIPCRP EQU   CVTS01+412                                               02199000
CVTIPCRI EQU   CVTS01+408                                               02200000
CVTIPCDS EQU   CVTS01+404                                               02201000
CVTAIDVT EQU   CVTS01+400                                               02202000
CVTSSAP  EQU   CVTS01+396                                               02203000
CVTEHCIR EQU   CVTS01+392                                               02204000
CVTEHDEF EQU   CVTS01+388                                               02205000
CVTDAIR  EQU   CVTS01+384                                               02206000
CVTPERFM EQU   CVTS01+380                                               02207000
CVT044R2 EQU   CVTS01+376                                               02208000
CVTFETCH EQU   CVTS01+372                                               02209000
CVTRSTWD EQU   CVTS01+368                                               02210000
CVTSPOST EQU   CVTS01+364                                               02211000
CVTIOBP  EQU   CVTS01+360                                               02212000
CVTASMVT EQU   CVTS01+356                                               02213000
CVTRECRQ EQU   CVTS01+352                                               02214000
CVTWSAC  EQU   CVTS01+348                                               02215000
CVTRV149 EQU   CVTS01+344                                               02216000
CVTWSAL  EQU   CVTS01+340                                               02217000
CVTSPSA  EQU   CVTS01+336                                               02218000
CVTGLMN  EQU   CVTS01+332                                               02219000
CVTVEAC0 EQU   CVTS01+328                                               02220000
CVT062R1 EQU   CVTS01+324                                               02221000
CVTRPOST EQU   CVTS01+320                                               02222000
CVTDQIQE EQU   CVTS01+316                                               02223000
CVTCSD   EQU   CVTS01+312                                               02224000
CVTLKRMA EQU   CVTS01+308                                               02225000
CVTRSPIE EQU   CVTS01+304                                               02226000
CVTRENQ  EQU   CVTS01+300                                               02227000
CVTLQCB  EQU   CVTS01+296                                               02228000
CVTFQCB  EQU   CVTS01+292                                               02229000
CVTQCS01 EQU   CVTS01+288                                               02230000
CVTAPFT  EQU   CVTS01+284                                               02231000
CVTPARRL EQU   CVTS01+280                                               02232000
CVTVWAIT EQU   CVTS01+276                                               02233000
CVTGSPL  EQU   CVTS01+272                                               02234000
CVTLSMQ  EQU   CVTS01+268                                               02235000
CVTGSMQ  EQU   CVTS01+264                                               02236000
CVTEXPRO EQU   CVTS01+260                                               02237000
CVTOPCTP EQU   CVTS01+256                                               02238000
CVTSIC   EQU   CVTS01+252                                               02239000
CVTTPIOS EQU   CVTS01+248                                               02240000
CVTRTMS  EQU   CVTS01+244                                               02241000
CVTSDBF  EQU   CVTS01+240                                               02242000
CVTSCBP  EQU   CVTS01+236                                               02243000
CVTSDMP  EQU   CVTS01+232                                               02244000
CVTSV60  EQU   CVTS01+228                                               02245000
CVTRTMCT EQU   CVTS01+224                                               02246000
CVTASCBL EQU   CVTS01+220                                               02247000
CVTASCBH EQU   CVTS01+216                                               02248000
CVTGDA   EQU   CVTS01+212                                               02249000
CVTASVT  EQU   CVTS01+208                                               02250000
CVTVVMDI EQU   CVTS01+204                                               02251000
CVTAQTOP EQU   CVTS01+200                                               02252000
CVTIOSCS EQU   CVTS01+196                                               02253000
CVTSDRM  EQU   CVTS01+192                                               02254000
CVTOPTE  EQU   CVTS01+188                                               02255000
CVTSTXU  EQU   CVTS01+184                                               02256000
CVTQUIS  EQU   CVTS01+180                                               02257000
CVTPARS  EQU   CVTS01+176                                               02258000
CVTS1EE  EQU   CVTS01+172                                               02259000
CVTFRAS  EQU   CVTS01+168                                               02260000
CVTQSAS  EQU   CVTS01+164                                               02261000
CVTCRAS  EQU   CVTS01+160                                               02262000
CVTCRMN  EQU   CVTS01+156                                               02263000
CVTDELCP EQU   CVTS01+152                                               02264000
CVTFRECL EQU   CVTS01+148                                               02265000
CVTGETCL EQU   CVTS01+144                                               02266000
CVTBLDCP EQU   CVTS01+140                                               02267000
CVTAUTHL EQU   CVTS01+136                                               02268000
CVTSCAN  EQU   CVTS01+132                                               02269000
CVTRV144 EQU   CVTS01+130                                               02270000
CVTMAXMP EQU   CVTS01+128                                               02271000
CVTSTCK  EQU   CVTS01+124                                               02272000
CVTRV139 EQU   CVTS01+123                                               02273000
CVTDSSAC EQU   CVTS01+122                                               02274000
CVTRV513 EQU   CVTS01+121                                               02275000
CVTIOSPL EQU   CVTS01+120                                               02276000
CVTPTGT  EQU   CVTS01+116                                               02277000
CVTCSPIE EQU   CVTS01+112                                               02278000
CVTSMFEX EQU   CVTS01+108                                               02279000
CVTOLT0A EQU   CVTS01+104                                               02280000
CVTSRBRT EQU   CVTS01+100                                               02281000
CVTPUTL  EQU   CVTS01+96                                                02282000
CVTASCRL EQU   CVTS01+92                                                02283000
CVTASCRF EQU   CVTS01+88                                                02284000
CVTRV326 EQU   CVTS01+84                                                02285000
CVTRV325 EQU   CVTS01+80                                                02286000
CVTRV324 EQU   CVTS01+76                                                02287000
CVT0VL01 EQU   CVTS01+72                                                02288000
CVTSHRVM EQU   CVTS01+68                                                02289000
CVTRV332 EQU   CVTS01+64                                                02290000
CVTTAS   EQU   CVTS01+60                                                02291000
CVTRSCN  EQU   CVTS01+56                                                02292000
CVTTRAC2 EQU   CVTS01+54                                                02293000
CVTTRACE EQU   CVTS01+52                                                02294000
CVTAPG   EQU   CVTS01+51                                                02295000
CVTSDTRC EQU   CVTCTLFG                                                 02296000
CVTGTRCE EQU   CVTCTLFG                                                 02297000
CVTNOMP  EQU   CVTCTLFG                                                 02298000
CVTRSV79 EQU   CVTCTLFG                                                 02299000
CVTDSTAT EQU   CVTCTLFG                                                 02300000
CVTRSV78 EQU   CVTCTLFG                                                 02301000
CVTRV333 EQU   CVTCTLFG                                                 02302000
CVTRV323 EQU   CVTCTLFG                                                 02303000
CVTSPVLK EQU   CVTS01+49                                                02304000
CVTRSV77 EQU   CVTS01+48                                                02305000
CVTRV331 EQU   CVTS01+44                                                02306000
CVTRV330 EQU   CVTS01+40                                                02307000
CVTRV329 EQU   CVTS01+36                                                02308000
CVTRV328 EQU   CVTS01+32                                                02309000
CVTRV322 EQU   CVTS01+28                                                02310000
CVTSLID  EQU   CVTSLIDA+1                                               02311000
CVTSYLK  EQU   CVTSLIDA                                                 02312000
CVTRV321 EQU   CVTS01+20                                                02313000
CVTRV320 EQU   CVTS01+16                                                02314000
CVTLPDIR EQU   CVTLPDIA+1                                               02315000
CVTRSV69 EQU   CVTDIRST                                                 02316000
CVTRSV68 EQU   CVTDIRST                                                 02317000
CVTRSV67 EQU   CVTDIRST                                                 02318000
CVTRSV66 EQU   CVTDIRST                                                 02319000
CVTRSV65 EQU   CVTDIRST                                                 02320000
CVTRSV64 EQU   CVTDIRST                                                 02321000
CVTRSV63 EQU   CVTDIRST                                                 02322000
CVTDICOM EQU   CVTDIRST                                                 02323000
CVTPVTP  EQU   CVTS01+8                                                 02324000
CVTLPDSR EQU   CVTS01+4                                                 02325000
CVTGETL  EQU   CVTS01                                                   02326000
WKECHNGP EQU   WKECHAIN+1                                               02327000
@NM00061 EQU   WKEFLAGS                                                 02328000
WKEGATE  EQU   WKEFLAGS                                                 02329000
@NM00060 EQU   ISTWKE                                                   02330000
ZRCZDFWB EQU   ISTZRCVT+120                                             02331000
ZRCZIFJB EQU   ISTZRCVT+116                                             02332000
ZRCZKFCB EQU   ISTZRCVT+112                                             02333000
ZRCZKFBB EQU   ISTZRCVT+108                                             02334000
ZRCZIFTB EQU   ISTZRCVT+104                                             02335000
ZRCZIFX0 EQU   ISTZRCVT+96                                              02336000
ZRCZIFAB EQU   ISTZRCVT+88                                              02337000
ZRCZIFGB EQU   ISTZRCVT+84                                              02338000
ZRCZIFHB EQU   ISTZRCVT+80                                              02339000
ZRCZIFBB EQU   ISTZRCVT+76                                              02340000
ZRCZIFCB EQU   ISTZRCVT+72                                              02341000
ZRCZIFDB EQU   ISTZRCVT+68                                              02342000
ZRCZIFEB EQU   ISTZRCVT+64                                              02343000
ZRCRSV01 EQU   ISTZRCVT+60                                              02344000
ZRCZGFBB EQU   ISTZRCVT+56                                              02345000
ZRCZIFQB EQU   ISTZRCVT+52                                              02346000
ZRCZIFNB EQU   ISTZRCVT+48                                              02347000
ZRCZIFOB EQU   ISTZRCVT+44                                              02348000
ZRCZIFMB EQU   ISTZRCVT+40                                              02349000
ZRCZIFKB EQU   ISTZRCVT+36                                              02350000
ZRCZIFLB EQU   ISTZRCVT+32                                              02351000
@NM00057 EQU   ISTZRCVT+28                                              02352000
@NM00056 EQU   ISTZRCVT+24                                              02353000
@NM00055 EQU   ISTZRCVT+20                                              02354000
@NM00054 EQU   ISTZRCVT+16                                              02355000
@NM00053 EQU   ISTZRCVT+12                                              02356000
ZRCZJF0B EQU   ISTZRCVT+8                                               02357000
ZRCZCFCI EQU   ISTZRCVT+4                                               02358000
ZRCZIF0B EQU   ISTZRCVT                                                 02359000
ZFSZWRD4 EQU   ISTZFSVT+36                                              02360000
ZFSZWRD3 EQU   ISTZFSVT+32                                              02361000
ZFSZEFCB EQU   ISTZFSVT+28                                              02362000
ZFSZFFEB EQU   ISTZFSVT+24                                              02363000
ZFSZDFJ0 EQU   ISTZFSVT+20                                              02364000
ZFSZFFFB EQU   ISTZFSVT+16                                              02365000
ZFSZFFDB EQU   ISTZFSVT+12                                              02366000
ZFSZFFCB EQU   ISTZFSVT+8                                               02367000
ZFSZEMAB EQU   ZFSZEAAB                                                 02368000
ZFSZEMBB EQU   ZFSZEABB                                                 02369000
ZPSZDFPR EQU   ISTZPSVT+76                                              02370000
ZPSZDFXR EQU   ISTZPSVT+72                                              02371000
ZPSZWRD5 EQU   ISTZPSVT+68                                              02372000
ZPSZWRD4 EQU   ISTZPSVT+64                                              02373000
ZPSZDFMB EQU   ISTZPSVT+60                                              02374000
ZPSZDFMF EQU   ISTZPSVT+56                                              02375000
ZPSZDFNB EQU   ISTZPSVT+52                                              02376000
@NM00052 EQU   ISTZPSVT+48                                              02377000
ZPSZDFF0 EQU   ISTZPSVT+44                                              02378000
ZPSZTRTT EQU   ISTZPSVT+40                                              02379000
ZPSZBFOB EQU   ISTZPSVT+36                                              02380000
ZPSZBFMB EQU   ISTZPSVT+32                                              02381000
ZPSZBFZ0 EQU   ISTZPSVT+28                                              02382000
ZPSZBFY0 EQU   ISTZPSVT+24                                              02383000
ZPSZDFI0 EQU   ISTZPSVT+20                                              02384000
ZPSZDFH0 EQU   ISTZPSVT+12                                              02385000
ZPSZDFD0 EQU   ISTZPSVT+8                                               02386000
ZPSZDFC0 EQU   ISTZPSVT+4                                               02387000
ZPSZDFA0 EQU   ISTZPSVT                                                 02388000
DNCZC001 EQU   DNCOS+40                                                 02389000
DNCLOCK  EQU   DNCOS+36                                                 02390000
DNCZV005 EQU   DNCOS+32                                                 02391000
DNCZV004 EQU   DNCOS+28                                                 02392000
DNCZV003 EQU   DNCOS+24                                                 02393000
DNCZV002 EQU   DNCOS+21                                                 02394000
DNCZX001 EQU   DNCOS+20                                                 02395000
DNCZV001 EQU   DNCOS+17                                                 02396000
DNCZV000 EQU   DNCOS+12                                                 02397000
DNCSESCQ EQU   DNCOS+8                                                  02398000
DNCSESIQ EQU   DNCOS+4                                                  02399000
DNCLICP  EQU   DNCBSCED                                                 02400000
DNCZF008 EQU   DNCZFLGS+1                                               02401000
DNCZPSRD EQU   DNCZFLGS+1                                               02402000
DNCPSOL  EQU   DNCZFLGS+1                                               02403000
DNCZF007 EQU   DNCZFLGS+1                                               02404000
DNCZF006 EQU   DNCZFLGS+1                                               02405000
DNCZF005 EQU   DNCZFLGS+1                                               02406000
DNCZF004 EQU   DNCZFLGS+1                                               02407000
DNCZF003 EQU   DNCZFLGS                                                 02408000
DNCZF002 EQU   DNCZFLGS                                                 02409000
DNCZRSCH EQU   DNCZFLGS                                                 02410000
DNCDISC  EQU   DNCZFLGS                                                 02411000
DNCCONT  EQU   DNCZFLGS                                                 02412000
DNCINVIT EQU   DNCZFLGS                                                 02413000
DNCSESS  EQU   DNCZFLGS                                                 02414000
DNCZF001 EQU   DNCZFLGS                                                 02415000
DNCMODE  EQU   ISTDNCB+49                                               02416000
DNCBHSET EQU   ISTDNCB+48                                               02417000
NCBRSV01 EQU   ISTNCB+46                                                02418000
NCBSWDAF EQU   ISTNCB+44                                                02419000
NCBFMCBP EQU   ISTNCB+32                                                02420000
NCBLTRC  EQU   ISTNCB+30                                                02421000
NCBRVPT1 EQU   ISTNCB+28                                                02422000
NCBNMLLN EQU   NCBFLAGS+3                                               02423000
@NM00051 EQU   NCBFLAG1                                                 02424000
NCBFORCE EQU   NCBFLAG1                                                 02425000
NCBTTF   EQU   NCBFLAG1                                                 02426000
NCBRSYNC EQU   NCBFLAG1                                                 02427000
NCBRSTRT EQU   NCBFLAG1                                                 02428000
NCBCONF  EQU   NCBFLAG1                                                 02429000
NCBSNAI  EQU   NCBFLAG1                                                 02430000
NCBFLTIO EQU   NCBFTRIO                                                 02431000
NCBCSTAT EQU   NCBFLAGS                                                 02432000
NCBNCSL  EQU   ISTNCB+22                                                02433000
NCBNCBA  EQU   ISTNCB+20                                                02434000
NCBFMCBA EQU   ISTNCB+16                                                02435000
NCBTSKID EQU   ISTNCB+8                                                 02436000
NCBRDTE  EQU   ISTNCB+4                                                 02437000
NCBDAF   EQU   ISTNCB+2                                                 02438000
NCBLNGTH EQU   ISTNCB+1                                                 02439000
CRACHAIN EQU   ISTCRA+928                                               02440000
CRARSV02 EQU   ISTCRA+924                                               02441000
CRARSV01 EQU   ISTCRA+920                                               02442000
CRABFTBA EQU   CRABUFA                                                  02443000
CRAMASK  EQU   CRASVC+64                                                02444000
CRAHSIZ  EQU   CRASVC+60                                                02445000
CRAASCRR EQU   CRASVC                                                   02446000
CRAPROCR EQU   ISTCRA+312                                               02447000
CRAPSS   EQU   ISTCRA+160                                               02448000
CRARPH   EQU   ISTCRA+52                                                02449000
CRALAPTR EQU   CRABASIC+48                                              02450000
CRAL9PTR EQU   CRABASIC+44                                              02451000
CRAL8PTR EQU   CRABASIC+40                                              02452000
CRAL7PTR EQU   CRABASIC+36                                              02453000
CRAL6PTR EQU   CRABASIC+32                                              02454000
CRAL5PTR EQU   CRABASIC+28                                              02455000
CRAL4PTR EQU   CRABASIC+24                                              02456000
CRAL3PTR EQU   CRABASIC+20                                              02457000
CRAL2PTR EQU   CRABASIC+16                                              02458000
CRAL1PTR EQU   CRABASIC+12                                              02459000
CRALEV01 EQU   CRALKACT+3                                               02460000
CRALEV02 EQU   CRALKACT+3                                               02461000
CRALEV03 EQU   CRALKACT+3                                               02462000
CRALEV04 EQU   CRALKACT+3                                               02463000
CRALEV05 EQU   CRALKACT+3                                               02464000
CRALEV06 EQU   CRALKACT+3                                               02465000
CRALEV07 EQU   CRALKACT+3                                               02466000
CRALEV08 EQU   CRALKACT+3                                               02467000
CRALEV09 EQU   CRALKACT+2                                               02468000
CRALEV10 EQU   CRALKACT+2                                               02469000
CRALEV11 EQU   CRALKACT+2                                               02470000
CRALEV12 EQU   CRALKACT+2                                               02471000
CRALEV13 EQU   CRALKACT+2                                               02472000
CRALEV14 EQU   CRALKACT+2                                               02473000
CRALEV15 EQU   CRALKACT+2                                               02474000
CRALEV16 EQU   CRALKACT+2                                               02475000
CRALEV17 EQU   CRALKACT+1                                               02476000
CRALEV18 EQU   CRALKACT+1                                               02477000
CRALEV19 EQU   CRALKACT+1                                               02478000
CRALEV20 EQU   CRALKACT+1                                               02479000
CRALEV21 EQU   CRALKACT+1                                               02480000
CRALEV22 EQU   CRALKACT+1                                               02481000
CRALEV23 EQU   CRALKACT+1                                               02482000
CRALEV24 EQU   CRALKACT+1                                               02483000
CRALEV25 EQU   CRALKACT                                                 02484000
CRALEV26 EQU   CRALKACT                                                 02485000
CRALEV27 EQU   CRALKACT                                                 02486000
CRALEV28 EQU   CRALKACT                                                 02487000
CRALEV29 EQU   CRALKACT                                                 02488000
CRALEV30 EQU   CRALKACT                                                 02489000
CRALEV31 EQU   CRALKACT                                                 02490000
CRALEV32 EQU   CRALKACT                                                 02491000
CRAFRR   EQU   CRAHDR+4                                                 02492000
@NM00050 EQU   ISTAPCRR+137                                             02493000
@NM00049 EQU   APC57FLG                                                 02494000
APCNREL  EQU   APC57FLG                                                 02495000
APCRECRA EQU   APC57FLG                                                 02496000
@NM00048 EQU   APC54FLG                                                 02497000
APCRLST  EQU   APC54FLG                                                 02498000
APCPR153 EQU   APC53FLG                                                 02499000
@NM00047 EQU   APC52FLG                                                 02500000
APCWKF   EQU   APC52FLG                                                 02501000
APCNWF   EQU   APC52FLG                                                 02502000
APCRDQ   EQU   APC52FLG                                                 02503000
APCQENQ  EQU   APC52FLG                                                 02504000
APCSMSR  EQU   APC52FLG                                                 02505000
APCCKRQ  EQU   APC52FLG                                                 02506000
@NM00046 EQU   APC31FLG                                                 02507000
APCSORT  EQU   APC31FLG                                                 02508000
APCRESCH EQU   APC31FLG                                                 02509000
APCTPXIT EQU   APC31FLG                                                 02510000
APCSWTWD EQU   ISTAPCRR+128                                             02511000
APCSAV2  EQU   ISTAPCRR+124                                             02512000
APCSAV1  EQU   ISTAPCRR+120                                             02513000
APCRETCD EQU   APCCOMF+2                                                02514000
@NM00045 EQU   APCCOMF1+1                                               02515000
APCZLBER EQU   APCCOMF1                                                 02516000
APCEXIT  EQU   APCCOMF1                                                 02517000
APCRELR  EQU   APCCOMF1                                                 02518000
APCIRB2  EQU   APCCOMF1                                                 02519000
APCIRB1  EQU   APCCOMF1                                                 02520000
APCSMCR  EQU   APCCOMF1                                                 02521000
APCUETSK EQU   APCCOMF1                                                 02522000
APCSSTSK EQU   APCCOMF1                                                 02523000
APCESTAL EQU   APCSAVE                                                  02524000
APCFRRPM EQU   ISTAPCRR+40                                              02525000
APCQWFO  EQU   ISTAPCRR+36                                              02526000
APCPABSV EQU   ISTAPCRR+32                                              02527000
APCRTRN  EQU   ISTAPCRR+28                                              02528000
APCTCBA  EQU   ISTAPCRR+24                                              02529000
APCPSTA  EQU   ISTAPCRR+20                                              02530000
@NM00044 EQU   APCRFLG+1                                                02531000
APC31R   EQU   APCRFLG                                                  02532000
APC58R   EQU   APCRFLG                                                  02533000
APC57R   EQU   APCRFLG                                                  02534000
APC56R   EQU   APCRFLG                                                  02535000
APC54R   EQU   APCRFLG                                                  02536000
APC53R   EQU   APCRFLG                                                  02537000
APC52R   EQU   APCRFLG                                                  02538000
APC51R   EQU   APCRFLG                                                  02539000
@NM00043 EQU   APCATFLG+1                                               02540000
APC31E   EQU   APCATFLG                                                 02541000
APC58E   EQU   APCATFLG                                                 02542000
APC57E   EQU   APCATFLG                                                 02543000
APC56E   EQU   APCATFLG                                                 02544000
APC54E   EQU   APCATFLG                                                 02545000
APC53E   EQU   APCATFLG                                                 02546000
APC52E   EQU   APCATFLG                                                 02547000
APC51E   EQU   APCATFLG                                                 02548000
APCHDRSV EQU   ISTAPCRR                                                 02549000
ASCPSREG EQU   ISTASCRR+44                                              02550000
ASCUSR01 EQU   ASCUSRGS+12                                              02551000
ASCUSR00 EQU   ASCUSRGS+8                                               02552000
ASCUSR15 EQU   ASCUSRGS+4                                               02553000
ASCUSR14 EQU   ASCUSRGS                                                 02554000
ASCETRYA EQU   ISTASCRR+24                                              02555000
ASCKEY   EQU   ISTASCRR+23                                              02556000
ASCAUDIT EQU   ASCFLG3                                                  02557000
ASCFBDUD EQU   ASCFLG3                                                  02558000
ASCLLKF  EQU   ASCFLG3                                                  02559000
ASCKEYF  EQU   ASCFLG3                                                  02560000
ASCFBDAL EQU   ASCFLG3                                                  02561000
ASCFSRGT EQU   ASCFLG3                                                  02562000
ASCICR   EQU   ASCFLG2                                                  02563000
ASCFSRIC EQU   ASCFLG2                                                  02564000
ASCFBDIC EQU   ASCFLG2                                                  02565000
ASCFBAIC EQU   ASCFLG2                                                  02566000
ASCPASTR EQU   ASCFLG1                                                  02567000
ASCFSR   EQU   ASCFLG1                                                  02568000
ASCFBD   EQU   ASCFLG1                                                  02569000
ASCFBA   EQU   ASCFLG1                                                  02570000
ASCPFCRR EQU   ISTASCRR                                                 02571000
CCFRSVD1 EQU   CFCCRT                                                   02572000
CCFCR2   EQU   CFCCRT                                                   02573000
CCFCRP   EQU   CFCCRT                                                   02574000
CCFCR1   EQU   CFCCRT                                                   02575000
CCFCS2   EQU   CFCCRT                                                   02576000
CCFCS1   EQU   CFCCRT                                                   02577000
NCFRSVD  EQU   CFCNTRD                                                  02578000
NCFCR2   EQU   CFCNTRD                                                  02579000
NCFCRP   EQU   CFCNTRD                                                  02580000
NCFCR1   EQU   CFCNTRD                                                  02581000
NCFCS2   EQU   CFCNTRD                                                  02582000
NCFCS1   EQU   CFCNTRD                                                  02583000
PFCRSV01 EQU   ISTPFCRR+13                                              02584000
PFCFTA   EQU   ISTPFCRR+12                                              02585000
CRRFRR   EQU   PFCFRRO                                                  02586000
CRRCHAIN EQU   PFCCRRO                                                  02587000
CRRLEN   EQU   PFCCRRLN                                                 02588000
PFCRSV10 EQU   PFCCRR+1                                                 02589000
CRRID    EQU   PFCCRRID                                                 02590000
ZCRRU    EQU   ZCRRHRU+3                                                02591000
ZCRRH    EQU   ZCRRHRU                                                  02592000
ZCRWORDA EQU   ISTZCRR+477                                              02593000
ZCRCMNRC EQU   ISTZCRR+476                                              02594000
ZCRRSV97 EQU   ZCRENTER+18                                              02595000
ZCREIC2B EQU   ZCRENTER+18                                              02596000
ZCREAC2B EQU   ZCRENTER+18                                              02597000
ZCRELCAB EQU   ZCRENTER+18                                              02598000
ZCREDCMF EQU   ZCRENTER+18                                              02599000
ZCREBCIF EQU   ZCRENTER+18                                              02600000
ZCREICSG EQU   ZCRENTER+18                                              02601000
ZCREDCK0 EQU   ZCRENTER+18                                              02602000
ZCRECFY0 EQU   ZCRENTER+17                                              02603000
ZCREKCCB EQU   ZCRENTER+17                                              02604000
ZCREDCNB EQU   ZCRENTER+17                                              02605000
ZCREICOE EQU   ZCRENTER+17                                              02606000
ZCREBCNB EQU   ZCRENTER+17                                              02607000
ZCREBC0L EQU   ZCRENTER+17                                              02608000
ZCREBCAL EQU   ZCRENTER+17                                              02609000
ZCREDCQR EQU   ZCRENTER+17                                              02610000
ZCREDCPR EQU   ZCRENTER+16                                              02611000
ZCREBCSB EQU   ZCRENTER+16                                              02612000
ZCREAC1R EQU   ZCRENTER+16                                              02613000
ZCRECCCI EQU   ZCRENTER+16                                              02614000
ZCRECCAI EQU   ZCRENTER+16                                              02615000
ZCRECCBI EQU   ZCRENTER+16                                              02616000
ZCREBCAR EQU   ZCRENTER+16                                              02617000
ZCREBCDR EQU   ZCRENTER+16                                              02618000
ZCREBCBR EQU   ZCRENTER+15                                              02619000
ZCREDCXR EQU   ZCRENTER+15                                              02620000
ZCREDCWB EQU   ZCRENTER+15                                              02621000
ZCREDCWR EQU   ZCRENTER+15                                              02622000
ZCREKCCN EQU   ZCRENTER+15                                              02623000
ZCREKCBN EQU   ZCRENTER+15                                              02624000
ZCREKCBB EQU   ZCRENTER+15                                              02625000
ZCREJC0B EQU   ZCRENTER+15                                              02626000
ZCREJCDB EQU   ZCRENTER+14                                              02627000
ZCREJCCB EQU   ZCRENTER+14                                              02628000
ZCREJCBB EQU   ZCRENTER+14                                              02629000
ZCREJCAB EQU   ZCRENTER+14                                              02630000
ZCREIC1B EQU   ZCRENTER+14                                              02631000
ZCREIC0B EQU   ZCRENTER+14                                              02632000
ZCREICX0 EQU   ZCRENTER+14                                              02633000
ZCREICWB EQU   ZCRENTER+14                                              02634000
ZCREICVB EQU   ZCRENTER+13                                              02635000
ZCREICUB EQU   ZCRENTER+13                                              02636000
ZCREICTB EQU   ZCRENTER+13                                              02637000
ZCREICSC EQU   ZCRENTER+13                                              02638000
ZCREICSB EQU   ZCRENTER+13                                              02639000
ZCREICRB EQU   ZCRENTER+13                                              02640000
ZCREICQB EQU   ZCRENTER+13                                              02641000
ZCREICQA EQU   ZCRENTER+13                                              02642000
ZCREICOB EQU   ZCRENTER+12                                              02643000
ZCREICOA EQU   ZCRENTER+12                                              02644000
ZCREICNB EQU   ZCRENTER+12                                              02645000
ZCREICNA EQU   ZCRENTER+12                                              02646000
ZCREICMB EQU   ZCRENTER+12                                              02647000
ZCREICLB EQU   ZCRENTER+12                                              02648000
ZCREICKG EQU   ZCRENTER+12                                              02649000
ZCREICKE EQU   ZCRENTER+12                                              02650000
ZCREICKB EQU   ZCRENTER+11                                              02651000
ZCREICJB EQU   ZCRENTER+11                                              02652000
ZCREICID EQU   ZCRENTER+11                                              02653000
ZCREICIB EQU   ZCRENTER+11                                              02654000
ZCREICHB EQU   ZCRENTER+11                                              02655000
ZCREICGB EQU   ZCRENTER+11                                              02656000
ZCREICEB EQU   ZCRENTER+11                                              02657000
ZCREICDB EQU   ZCRENTER+11                                              02658000
ZCREICCI EQU   ZCRENTER+10                                              02659000
ZCREICCB EQU   ZCRENTER+10                                              02660000
ZCREICBI EQU   ZCRENTER+10                                              02661000
ZCREICBB EQU   ZCRENTER+10                                              02662000
ZCREICAA EQU   ZCRENTER+10                                              02663000
ZCREHCAN EQU   ZCRENTER+10                                              02664000
ZCREGC0B EQU   ZCRENTER+10                                              02665000
ZCREGC0A EQU   ZCRENTER+9                                               02666000
ZCREGCLA EQU   ZCRENTER+9                                               02667000
ZCREGCEB EQU   ZCRENTER+9                                               02668000
ZCREGCDB EQU   ZCRENTER+9                                               02669000
@NM00042 EQU   ZCRENTER+9                                               02670000
ZCREGCBB EQU   ZCRENTER+9                                               02671000
ZCREGCAB EQU   ZCRENTER+9                                               02672000
ZCREFCEB EQU   ZCRENTER+9                                               02673000
ZCREFCEA EQU   ZCRENTER+8                                               02674000
ZCREECTA EQU   ZCRENTER+8                                               02675000
ZCREECEA EQU   ZCRENTER+8                                               02676000
ZCREECDA EQU   ZCRENTER+8                                               02677000
ZCREECCB EQU   ZCRENTER+8                                               02678000
ZCREECCA EQU   ZCRENTER+8                                               02679000
ZCREECBB EQU   ZCRENTER+8                                               02680000
ZCREECBA EQU   ZCRENTER+8                                               02681000
ZCREDCMB EQU   ZCRENTER+7                                               02682000
ZCREDCL0 EQU   ZCRENTER+7                                               02683000
ZCREDCKB EQU   ZCRENTER+7                                               02684000
ZCREDCKA EQU   ZCRENTER+7                                               02685000
ZCREDCJ0 EQU   ZCRENTER+7                                               02686000
ZCREDCI0 EQU   ZCRENTER+7                                               02687000
ZCREDCH0 EQU   ZCRENTER+7                                               02688000
ZCREDCF0 EQU   ZCRENTER+7                                               02689000
ZCREDCE0 EQU   ZCRENTER+6                                               02690000
ZCREDCD0 EQU   ZCRENTER+6                                               02691000
ZCREDCC0 EQU   ZCRENTER+6                                               02692000
ZCREDCB0 EQU   ZCRENTER+6                                               02693000
ZCREDCA0 EQU   ZCRENTER+6                                               02694000
ZCRECC2B EQU   ZCRENTER+6                                               02695000
ZCRECC1B EQU   ZCRENTER+6                                               02696000
ZCRECC1A EQU   ZCRENTER+6                                               02697000
ZCRECC0B EQU   ZCRENTER+5                                               02698000
ZCRECC0A EQU   ZCRENTER+5                                               02699000
ZCREBC0B EQU   ZCRENTER+5                                               02700000
ZCREBC0A EQU   ZCRENTER+5                                               02701000
ZCREBCZ0 EQU   ZCRENTER+5                                               02702000
ZCREBCY0 EQU   ZCRENTER+5                                               02703000
ZCREBCX0 EQU   ZCRENTER+5                                               02704000
ZCREBCXA EQU   ZCRENTER+5                                               02705000
ZCREBCSC EQU   ZCRENTER+4                                               02706000
ZCREBCRB EQU   ZCRENTER+4                                               02707000
ZCREBCRA EQU   ZCRENTER+4                                               02708000
ZCREBCQB EQU   ZCRENTER+4                                               02709000
ZCREBCPB EQU   ZCRENTER+4                                               02710000
ZCREBCOB EQU   ZCRENTER+4                                               02711000
ZCREBCNE EQU   ZCRENTER+4                                               02712000
ZCREBCND EQU   ZCRENTER+4                                               02713000
ZCREBCMB EQU   ZCRENTER+3                                               02714000
ZCREBCLB EQU   ZCRENTER+3                                               02715000
ZCREBCLA EQU   ZCRENTER+3                                               02716000
ZCREBCKB EQU   ZCRENTER+3                                               02717000
ZCREBCKA EQU   ZCRENTER+3                                               02718000
ZCREBCJB EQU   ZCRENTER+3                                               02719000
ZCREBCJA EQU   ZCRENTER+3                                               02720000
ZCREBCID EQU   ZCRENTER+3                                               02721000
ZCREBCIB EQU   ZCRENTER+2                                               02722000
ZCREBCIA EQU   ZCRENTER+2                                               02723000
ZCREBCHB EQU   ZCRENTER+2                                               02724000
ZCREBCHA EQU   ZCRENTER+2                                               02725000
ZCREBCGB EQU   ZCRENTER+2                                               02726000
ZCREBCGA EQU   ZCRENTER+2                                               02727000
ZCREBCFB EQU   ZCRENTER+2                                               02728000
ZCREBCFA EQU   ZCRENTER+2                                               02729000
ZCREBCEB EQU   ZCRENTER+1                                               02730000
ZCREBCDI EQU   ZCRENTER+1                                               02731000
ZCREBCCB EQU   ZCRENTER+1                                               02732000
ZCREBCBI EQU   ZCRENTER+1                                               02733000
ZCREBCBB EQU   ZCRENTER+1                                               02734000
ZCREBCBA EQU   ZCRENTER+1                                               02735000
ZCREBCAM EQU   ZCRENTER+1                                               02736000
ZCREBCAI EQU   ZCRENTER+1                                               02737000
ZCREBCAG EQU   ZCRENTER                                                 02738000
ZCREBCAE EQU   ZCRENTER                                                 02739000
ZCREBCAB EQU   ZCRENTER                                                 02740000
ZCREBCAA EQU   ZCRENTER                                                 02741000
ZCREAC1B EQU   ZCRENTER                                                 02742000
ZCREAC0B EQU   ZCRENTER                                                 02743000
ZCREAC0A EQU   ZCRENTER                                                 02744000
ZCREAC1A EQU   ZCRENTER                                                 02745000
ZCRTNAME EQU   ZCRAUDIT+1                                               02746000
ZCRTID   EQU   ZCRAUDIT                                                 02747000
ZCRREMIC EQU   ISTZCRR+436                                              02748000
ZCRSAVEZ EQU   ISTZCRR+196                                              02749000
ZCRDAFSV EQU   ZCRCIDSV+2                                               02750000
ZCRSAFSV EQU   ZCRCIDSV                                                 02751000
ZCRR13SV EQU   ISTZCRR+188                                              02752000
ZCRR2SV  EQU   ISTZCRR+184                                              02753000
ZCROPCDE EQU   ISTZCRR+183                                              02754000
ZCRPRMTC EQU   ISTZCRR+182                                              02755000
ZCRRCDSV EQU   ISTZCRR+181                                              02756000
ZCRAWQSW EQU   ISTZCRR+180                                              02757000
ZCRTOPQ  EQU   ISTZCRR+180                                              02758000
ZCRXSCHD EQU   ISTZCRR+180                                              02759000
ZCRMOREL EQU   ISTZCRR+180                                              02760000
ZCRFBPRC EQU   ISTZCRR+180                                              02761000
ZCRFSBSV EQU   ISTZCRR+176                                              02762000
ZCRSVWK5 EQU   ZCRWKARA+16                                              02763000
ZCRSVWK4 EQU   ZCRWKARA+12                                              02764000
ZCRSVWK3 EQU   ZCRWKARA+8                                               02765000
ZCRSVWK2 EQU   ZCRWKARA+4                                               02766000
ZCRSVWK1 EQU   ZCRWKARA                                                 02767000
ZCRSVF25 EQU   ZCRSVRTN+96                                              02768000
ZCRSVF24 EQU   ZCRSVRTN+92                                              02769000
ZCRSVF23 EQU   ZCRSVRTN+88                                              02770000
ZCRSVF22 EQU   ZCRSVRTN+84                                              02771000
ZCRSVF21 EQU   ZCRSVRTN+80                                              02772000
ZCRSVF20 EQU   ZCRSVRTN+76                                              02773000
ZCRSVF19 EQU   ZCRSVRTN+72                                              02774000
ZCRSVF18 EQU   ZCRSVRTN+68                                              02775000
ZCRSVF17 EQU   ZCRSVRTN+64                                              02776000
ZCRSVF16 EQU   ZCRSVRTN+60                                              02777000
ZCRSVF15 EQU   ZCRSVRTN+56                                              02778000
ZCRSVF14 EQU   ZCRSVRTN+52                                              02779000
ZCRSVF13 EQU   ZCRSVRTN+48                                              02780000
ZCRSVF12 EQU   ZCRSVRTN+44                                              02781000
ZCRSVF11 EQU   ZCRSVRTN+40                                              02782000
ZCRSVF10 EQU   ZCRSVRTN+36                                              02783000
ZCRSVF6  EQU   ZCRSVRTN+20                                              02784000
ZCRSVF5  EQU   ZCRSVRTN+16                                              02785000
ZCRSVF4  EQU   ZCRSVRTN+12                                              02786000
ZCRSVF3  EQU   ZCRSVRTN+8                                               02787000
ZCRSVF2  EQU   ZCRSVRTN+4                                               02788000
ZCRSVF1  EQU   ZCRSVRTN                                                 02789000
ZCRPVZB  EQU   ISTZCRR+52                                               02790000
ZCRZLB   EQU   ISTZCRR+48                                               02791000
ZCRBFPTR EQU   ISTZCRR+44                                               02792000
ZCRCCWA  EQU   ISTZCRR+40                                               02793000
ZCRPSW   EQU   ZCRPARMS+15                                              02794000
ZCRPCHAR EQU   ZCRPARMS+14                                              02795000
ZCRPRES2 EQU   ZCRPCOD2                                                 02796000
ZCRPMFGF EQU   ZCRPCOD2                                                 02797000
ZCRPFHDR EQU   ZCRPCOD2                                                 02798000
ZCRPPG2  EQU   ZCRPCOD2                                                 02799000
ZCRPRES  EQU   ZCRPCOD1                                                 02800000
ZCRPCFTX EQU   ZCRPCOD1                                                 02801000
ZCRPLSBQ EQU   ZCRPLSBF                                                 02802000
ZCRPFSB  EQU   ZCRPCOD1                                                 02803000
ZCRPLNG  EQU   ZCRPCOD1                                                 02804000
ZCRPPG   EQU   ZCRPCOD1                                                 02805000
ZCRDTODA EQU   ZCRDFRDA                                                 02806000
ZCRMLNG  EQU   ZCRPARMS+8                                               02807000
ZCRTBPTR EQU   ZCRPARMS+4                                               02808000
ZCRCBPTR EQU   ZCRFBPTR                                                 02809000
ZCRCRLCP EQU   ISTZCRR+20                                               02810000
@NM00041 EQU   ZCRSCPSW                                                 02811000
ZCRSKIPT EQU   ZCRSCPSW                                                 02812000
ZCRFSBWE EQU   ZCRSCPSW                                                 02813000
ZCRPRCMP EQU   ZCRSCPSW                                                 02814000
ZCRLREQ  EQU   ZCRSCPSW                                                 02815000
ZCRRJLCP EQU   ZCRSCPSW                                                 02816000
ZCRTPINV EQU   ZCRSCPSW                                                 02817000
ZCRTPEX  EQU   ZCRSCPSW                                                 02818000
@NM00040 EQU   ZCRIBPR                                                  02819000
ZCR3270  EQU   ZCRIBPR                                                  02820000
ZCRLCPFD EQU   ZCRIBPR                                                  02821000
ZCRLCPFR EQU   ZCRIBPR                                                  02822000
ZCRRELK  EQU   ZCRIBPR                                                  02823000
ZCRERR   EQU   ZCRIBPR                                                  02824000
ZCRNOBUF EQU   ZCRIBPR                                                  02825000
@NM00039 EQU   ZCRPFLGS                                                 02826000
ZCRQAHED EQU   ZCRPFLGS                                                 02827000
ZCRF1RES EQU   ZCRGENSW                                                 02828000
ZCRBRIS  EQU   ZCRGENSW                                                 02829000
ZCRCLRBD EQU   ZCRGENSW                                                 02830000
ZCREXRES EQU   ZCRGENSW                                                 02831000
ZCRLCSYN EQU   ZCRGENSW                                                 02832000
ZCRRT06  EQU   ZCRGENSW                                                 02833000
ZCRTSW2  EQU   ZCRGENSW                                                 02834000
ZCRTSW1  EQU   ZCRGENSW                                                 02835000
ZCRINLCP EQU   ZCRFLGS3                                                 02836000
ZCRWRPTR EQU   ZCRFLGS3                                                 02837000
ZCRNOFRE EQU   ZCRFLGS3                                                 02838000
ZCREDRIV EQU   ZCRFLGS3                                                 02839000
ZCRDISC  EQU   ZCRFLGS3                                                 02840000
ZCRTPDIS EQU   ZCRFLGS3                                                 02841000
ZCRTPCON EQU   ZCRFLGS3                                                 02842000
ZCRTIC   EQU   ZCRFLGS3                                                 02843000
ZCRCNLXL EQU   ZCRRESET                                                 02844000
ZCRENDAN EQU   ZCRSWFLD                                                 02845000
ZCRENDXL EQU   ZCRSWFLD                                                 02846000
ZCRENDX  EQU   ZCRSWFLD                                                 02847000
ZCROB1   EQU   ZCRNDLCP                                                 02848000
ZCRENDPR EQU   ZCRSWFLD                                                 02849000
ZCREXTYP EQU   ZCRSWFLD                                                 02850000
ZCRSLCP  EQU   ZCRENDSH                                                 02851000
ZCRIF0E3 EQU   ZCRFLGS2                                                 02852000
ZCRIF0E2 EQU   ZCRFLGS2                                                 02853000
ZCRIF0E1 EQU   ZCRFLGS2                                                 02854000
ZCROB    EQU   ZCRFLGS2                                                 02855000
ZCRFMSED EQU   ZCRFLGS2                                                 02856000
ZCRSHEDI EQU   ZCRFLGS2                                                 02857000
ZCRLOCAL EQU   ZCRFLGS2                                                 02858000
ZCRFEXIT EQU   ZCRFLGS1                                                 02859000
ZCRUNSOL EQU   ZCRFLGS1                                                 02860000
ZCRENDLP EQU   ZCRFLGS1                                                 02861000
ZCRNRMEX EQU   ZCRFLGS1                                                 02862000
ZCRWAIT  EQU   ZCRFLGS1                                                 02863000
ZCRDEQSW EQU   ZCRFLGS1                                                 02864000
ZCRQUESW EQU   ZCRFLGS1                                                 02865000
ZCREXSW  EQU   ZCRFLGS1                                                 02866000
ZCRFRRA  EQU   ISTZCRR+8                                                02867000
ZCRCHAIN EQU   ISTZCRR+4                                                02868000
ZCRFLAG  EQU   ZCRCRR+3                                                 02869000
ZCRLEN   EQU   ZCRCRR+1                                                 02870000
ZCRID    EQU   ZCRCRR                                                   02871000
ZIBLNG1  EQU   ZIBFSM                                                   02872000
ZIBCHAIN EQU   ISTZIBUF                                                 02873000
TH2SNF   EQU   ISTTH2+4                                                 02874000
TH2OAF   EQU   ISTTH2+3                                                 02875000
TH2DAF   EQU   ISTTH2+2                                                 02876000
TH2CDF   EQU   TH2FLAG1+1                                               02877000
TH2SEF   EQU   TH2FLAG1+1                                               02878000
TH2PYF   EQU   TH2FLAG1+1                                               02879000
TH2AFI   EQU   TH2FLAG1                                                 02880000
TH2PSI   EQU   TH2FLAG1                                                 02881000
TH2CMPLI EQU   TH2MPF                                                   02882000
TH2RHI   EQU   TH2MPF                                                   02883000
TH2FID   EQU   TH2FLAG1                                                 02884000
THDCF    EQU   ISTTH+8                                                  02885000
THSNF    EQU   ISTTH+6                                                  02886000
THOAF    EQU   ISTTH+4                                                  02887000
THDAF    EQU   ISTTH+2                                                  02888000
THCDF    EQU   THFLGB                                                   02889000
THSEF    EQU   THFLGB                                                   02890000
THPYF    EQU   THFLGB                                                   02891000
THAFI    EQU   THFLGA                                                   02892000
THPSI    EQU   THFLGA                                                   02893000
THCMPLI  EQU   THMPF                                                    02894000
THRHI    EQU   THMPF                                                    02895000
THFID    EQU   THFLAG1                                                  02896000
LHVDATA  EQU   ISTLH+4                                                  02897000
LHFUNCT  EQU   ISTLH+3                                                  02898000
@NM00033 EQU   ISTLH+2                                                  02899000
LHLEN    EQU   ISTLH                                                    02900000
BTUTEXT  EQU   ISTBTU+20                                                02901000
BTURSV02 EQU   BTUSYSTR                                                 02902000
BTUPHASE EQU   BTUSYSTR                                                 02903000
BTURSV01 EQU   BTUSYSTR                                                 02904000
BTUPAD   EQU   BTURH+3                                                  02905000
BTURH3   EQU   BTURH+2                                                  02906000
BTURH2   EQU   BTURH+1                                                  02907000
BTURH1   EQU   BTURH                                                    02908000
BTUZRTSC EQU   BTURQFLG+1                                               02909000
BTUZRT0B EQU   BTURQFLG+1                                               02910000
BTUZRT0A EQU   BTURQFLG+1                                               02911000
BTUZRT09 EQU   BTURQFLG+1                                               02912000
BTUZRT08 EQU   BTURQFLG+1                                               02913000
BTUZRT07 EQU   BTURQFLG                                                 02914000
BTUZRT06 EQU   BTURQFLG                                                 02915000
BTUZRT05 EQU   BTURQFLG                                                 02916000
BTUZRT04 EQU   BTURQFLG                                                 02917000
BTUZRT03 EQU   BTURQFLG                                                 02918000
BTUZRT02 EQU   BTURQFLG                                                 02919000
BTUZRT01 EQU   BTURQFLG                                                 02920000
BTUZRT00 EQU   BTURQFLG                                                 02921000
BTUCDF   EQU   BTUFID+1                                                 02922000
BTUSCF   EQU   BTUFID+1                                                 02923000
BTUPRY   EQU   BTUFID+1                                                 02924000
BTUASFL  EQU   BTUFID                                                   02925000
BTUPSFL  EQU   BTUFID                                                   02926000
BTUMPF   EQU   BTUFID                                                   02927000
BTUFIDNO EQU   BTUFID                                                   02928000
BDURSV04 EQU   BDUFLAGS                                                 02929000
BDURTOE  EQU   BDUFLAGS                                                 02930000
BDUSTPR  EQU   BDUFLAGS                                                 02931000
BDURSV03 EQU   BDUFLAGS                                                 02932000
BDUALT   EQU   BDUFUNC                                                  02933000
BDUNACK  EQU   BDUFUNC                                                  02934000
BDUACK   EQU   BDUFUNC                                                  02935000
BDUTRPM  EQU   BDUFUNC                                                  02936000
BDUFBMI  EQU   BDUFUNC                                                  02937000
BDULDGPH EQU   BDUFUNC                                                  02938000
BDUHEADP EQU   BDUFUNC                                                  02939000
BDUSOH   EQU   BDUCHECK                                                 02940000
BDURSV01 EQU   BDUMODIF                                                 02941000
BDUMOD0  EQU   BDUMOD1                                                  02942000
FSBFDB   EQU   ISTFSB+32                                                02943000
FSBRSV01 EQU   FSBFSB+30                                                02944000
FSBTHCNT EQU   FSBFSB+28                                                02945000
FSBRLRSV EQU   FSBRLSTS                                                 02946000
FSBCFTX  EQU   FSBRLSTS                                                 02947000
FSBICNCB EQU   FSBMSGID                                                 02948000
FSBSSOC  EQU   FSBSS2                                                   02949000
FSBSSCC  EQU   FSBSS2                                                   02950000
FSBSSDC  EQU   FSBSS2                                                   02951000
FSBSSEC  EQU   FSBSS2                                                   02952000
FSBSSIR  EQU   FSBSS2                                                   02953000
FSBSSCR  EQU   FSBSS2                                                   02954000
@NM00031 EQU   FSBSS2                                                   02955000
@NM00030 EQU   FSBSS1                                                   02956000
FSBSSDE  EQU   FSBSS1                                                   02957000
FSBSSUS  EQU   FSBSS1                                                   02958000
@NM00029 EQU   FSBSS1                                                   02959000
FSBSOHI  EQU   FSBERC                                                   02960000
FSBLGI   EQU   FSBERC                                                   02961000
FSBLMRI  EQU   FSBFBMI                                                  02962000
FSBETI   EQU   FSBERC                                                   02963000
FSBEMI   EQU   FSBERC                                                   02964000
FSBEBI   EQU   FSBERC                                                   02965000
FSBXLCI  EQU   FSBXCODE                                                 02966000
FSBXFINS EQU   FSBXCODE                                                 02967000
FSBXNORM EQU   FSBXFSTS                                                 02968000
FSBSCODE EQU   FSBSYSRS                                                 02969000
FSBSPHSE EQU   FSBSYSRS                                                 02970000
FSBSERR  EQU   FSBSYSRS                                                 02971000
FSBCMD   EQU   FSBSEQ                                                   02972000
FSBDTRCE EQU   FSBFLAGS                                                 02973000
FSBASBTU EQU   FSBFLAGS                                                 02974000
FSBINPET EQU   FSBFLAGS                                                 02975000
FSBNONCB EQU   FSBFLAGS                                                 02976000
FSBLBIND EQU   FSBFLAGS                                                 02977000
FSBFFIND EQU   FSBFLAGS                                                 02978000
FSBACIND EQU   FSBFLAGS                                                 02979000
FSBRFIND EQU   FSBFLAGS                                                 02980000
FSBGATE  EQU   FSBFSBA                                                  02981000
FSBLATOP EQU   FSBSFLGS                                                 02982000
FSBRSV02 EQU   FSBSFLGS                                                 02983000
FSBPGBUF EQU   FSBSFLGS                                                 02984000
FSBMNSDA EQU   FSBMNRCD                                                 02985000
FSBMNOA  EQU   FSBMNRCD                                                 02986000
FSBMNDIF EQU   FSBMNRCD                                                 02987000
FSBMNEOP EQU   FSBMNRCD                                                 02988000
FSBMNDNU EQU   FSBMNRCD                                                 02989000
FSBMNATN EQU   FSBMNRCD                                                 02990000
FSBMNRVI EQU   FSBMNRCD                                                 02991000
FSBMNELI EQU   FSBMNRCD                                                 02992000
FSBLNGTH EQU   FSBFSB+1                                                 02993000
FSBTYPE  EQU   FSBFSB                                                   02994000
FDBFDBA  EQU   ISTFDB                                                   02995000
FMCFLRSV EQU   FMCFLGB                                                  02996000
FMCFLGA8 EQU   FMCFLGB                                                  02997000
FMCCLRPH EQU   FMCVS1+45                                                02998000
FMCRSV0X EQU   FMCCVFLG                                                 02999000
FMCVYRPH EQU   FMCCVFLG                                                 03000000
FMCLOCK2 EQU   FMCVS1+36                                                03001000
@NM00028 EQU   FMCZFLG2                                                 03002000
FMCZF027 EQU   FMCZFLG2                                                 03003000
FMCZF026 EQU   FMCZFLG2                                                 03004000
FMCSEQ1B EQU   FMCSEQ1                                                  03005000
FMCSEQ1T EQU   FMCSEQ1                                                  03006000
FMCZX005 EQU   FMCVS1+32                                                03007000
FMCZX004 EQU   FMCVS1+31                                                03008000
FMCZX003 EQU   FMCVS1+30                                                03009000
FMCZX002 EQU   FMCVS1+29                                                03010000
FMCZX001 EQU   FMCVS1+28                                                03011000
FMCZV001 EQU   FMCVS1+24                                                03012000
FMCAWATQ EQU   FMCLCPAQ+1                                               03013000
@NM00027 EQU   FMCLCPAQ                                                 03014000
FMCLCPB2 EQU   FMCLCPBQ+1                                               03015000
FMCLCPB1 EQU   FMCLCPBQ                                                 03016000
FMCASCDQ EQU   FMCSHEAQ+1                                               03017000
@NM00026 EQU   FMCSHEAQ                                                 03018000
FMCSHEDQ EQU   FMCVS1+8                                                 03019000
FMCZFCSQ EQU   FMCVS1+6                                                 03020000
FMCZF025 EQU   FMCZFLAG+3                                               03021000
FMCZF024 EQU   FMCZFLAG+3                                               03022000
FMCZF023 EQU   FMCZFLAG+3                                               03023000
FMCZF022 EQU   FMCZFLAG+3                                               03024000
FMCZF020 EQU   FMCZFLAG+3                                               03025000
FMCZF019 EQU   FMCZFLAG+3                                               03026000
FMCZF018 EQU   FMCZFLAG+3                                               03027000
FMCZF017 EQU   FMCZFLAG+2                                               03028000
FMCZF016 EQU   FMCZFLAG+2                                               03029000
FMCZF013 EQU   FMCZFLAG+2                                               03030000
FMCZF012 EQU   FMCZFLAG+2                                               03031000
FMCZF011 EQU   FMCZFLAG+2                                               03032000
FMCZF010 EQU   FMCZFLAG+2                                               03033000
FMCZF00F EQU   FMCZFLAG+1                                               03034000
FMCZF00E EQU   FMCZFLAG+1                                               03035000
FMCZF00D EQU   FMCZFLAG+1                                               03036000
FMCZF00C EQU   FMCZFLAG+1                                               03037000
FMCZF00B EQU   FMCZFLAG+1                                               03038000
FMCRSV10 EQU   FMCZFLAG+1                                               03039000
FMCZF009 EQU   FMCZFLAG+1                                               03040000
FMCZFD06 EQU   FMCZF006+1                                               03041000
FMCZFC06 EQU   FMCZF006                                                 03042000
FMCZFB06 EQU   FMCZF006                                                 03043000
FMCZF005 EQU   FMCZFLAG                                                 03044000
FMCZF004 EQU   FMCZFLAG                                                 03045000
FMCZF003 EQU   FMCZFLAG                                                 03046000
FMCZF002 EQU   FMCZFLAG                                                 03047000
FMCZF001 EQU   FMCZFLAG                                                 03048000
FMCFRESA EQU   ISTFMCB+228                                              03049000
FMCSCSQN EQU   FMCSNCTL+2                                               03050000
FMCSCCTL EQU   FMCSNCTL+1                                               03051000
FMCSTCTL EQU   FMCSCFLG                                                 03052000
FMCSCCLO EQU   FMCSCFLG                                                 03053000
FMCAPRO  EQU   FMCSCFLG                                                 03054000
FMCLURO  EQU   FMCSCFLG                                                 03055000
FMCOBSAC EQU   FMCSCFLG                                                 03056000
FMCIBSAC EQU   FMCSCFLG                                                 03057000
FMCFBRE  EQU   ISTFMCB+220                                              03058000
FMCFBXM  EQU   FMCZV002                                                 03059000
FMCASEGQ EQU   ISTFMCB+212                                              03060000
FMCRDTPT EQU   ISTFMCB+208                                              03061000
FMCLOCK  EQU   ISTFMCB+204                                              03062000
FMCSEGD  EQU   FMCSSEGQ                                                 03063000
FMCRSPLM EQU   ISTFMCB+198                                              03064000
FMCPSTRS EQU   ISTFMCB+196                                              03065000
@NM00025 EQU   FMCRRESP                                                 03066000
FMCTSLHA EQU   FMCRRESP                                                 03067000
FMCFRRN  EQU   FMCRRESP                                                 03068000
FMCFME   EQU   FMCRRESP                                                 03069000
FMCFEX   EQU   FMCRRESP                                                 03070000
FMCFPE   EQU   FMCRRESP                                                 03071000
FMCCTLB  EQU   ISTFMCB+194                                              03072000
FMCBSQNO EQU   FMCCLSEQ+2                                               03073000
FMCTSQNO EQU   FMCCLSEQ                                                 03074000
FMCOBPRG EQU   FMCMODEB                                                 03075000
FMCIBPRG EQU   FMCMODEB                                                 03076000
FMCRESOT EQU   FMCMODEB                                                 03077000
FMCRSTSR EQU   FMCMODEB                                                 03078000
FMCLUQ   EQU   FMCMODEB                                                 03079000
FMCAPQ   EQU   FMCMODEB                                                 03080000
FMCCLEAR EQU   FMCMODEB                                                 03081000
FMCHOLD  EQU   FMCMODEB                                                 03082000
FMCIPSEQ EQU   ISTFMCB+188                                              03083000
FMCLUSTR EQU   ISTFMCB+187                                              03084000
FMCRSV87 EQU   FMCSTAT2                                                 03085000
FMCSEQI  EQU   FMCSTAT2                                                 03086000
FMCCPIP  EQU   FMCSTAT2                                                 03087000
FMCALIPR EQU   FMCSTAT2                                                 03088000
FMCIAIO  EQU   FMCSTAT2                                                 03089000
FMCZF00A EQU   FMCSTAT2                                                 03090000
FMCVPIP  EQU   FMCSTAT2                                                 03091000
FMCBHSET EQU   ISTFMCB+185                                              03092000
FMCPRMRC EQU   FMCCLEXT+20                                              03093000
FMCRSV89 EQU   FMCPSTAT                                                 03094000
FMCPCLSD EQU   FMCPSTAT                                                 03095000
FMCDDOCD EQU   FMCPSTAT                                                 03096000
FMCIDVFD EQU   FMCPSTAT                                                 03097000
FMCELKST EQU   FMCPSTAT                                                 03098000
FMCRSV88 EQU   FMCPSCMD                                                 03099000
FMCRDBLK EQU   FMCPSCMD                                                 03100000
FMCDSEOC EQU   FMCPSCMD                                                 03101000
FMCPURGE EQU   FMCPSCMD                                                 03102000
FMCRESTI EQU   FMCPSCMD                                                 03103000
FMCCNTCT EQU   FMCPSCMD                                                 03104000
FMCINVT  EQU   FMCPSCMD                                                 03105000
FMCFLGB7 EQU   FMCFLGCL                                                 03106000
FMCFLGB6 EQU   FMCFLGCL                                                 03107000
FMCFLGB5 EQU   FMCFLGCL                                                 03108000
FMCFLGB4 EQU   FMCFLGCL                                                 03109000
FMCFLGB3 EQU   FMCFLGCL                                                 03110000
FMCFLGB2 EQU   FMCFLGCL                                                 03111000
FMCFLGB1 EQU   FMCFLGCL                                                 03112000
FMCFLGB0 EQU   FMCFLGCL                                                 03113000
FMCFLGA7 EQU   FMCFLGA                                                  03114000
FMCFLGA6 EQU   FMCFLGA                                                  03115000
FMCFLGA5 EQU   FMCFLGA                                                  03116000
FMCFLGA4 EQU   FMCFLGA                                                  03117000
FMCFLGA3 EQU   FMCFLGA                                                  03118000
FMCFLGA2 EQU   FMCFLGA                                                  03119000
FMCFLGA1 EQU   FMCFLGA                                                  03120000
FMCFLGA0 EQU   FMCFLGA                                                  03121000
FMCDCLOK EQU   FMCCLEXT+12                                              03122000
FMCRAFM  EQU   FMCCLEXT+8                                               03123000
FMCFBPTR EQU   FMCFBA+1                                                 03124000
FMCFBRSV EQU   FMCFBA                                                   03125000
FMCRPLPT EQU   FMCRPLA+1                                                03126000
FMCRPLRS EQU   FMCRPLA                                                  03127000
FMCPRCLS EQU   FMCCVAL                                                  03128000
FMCIBCE  EQU   FMCCVAL                                                  03129000
FMCONLY  EQU   FMCOBCE                                                  03130000
FMCLAST  EQU   FMCOBCE                                                  03131000
FMCMIDLE EQU   FMCOBCE                                                  03132000
FMCFIRST EQU   FMCOBCE                                                  03133000
FMCCPCNT EQU   FMCPACPC                                                 03134000
FMCMPCNT EQU   FMCPACEM                                                 03135000
FMCNPCNT EQU   FMCPACEN                                                 03136000
FMCCONF  EQU   FMCSSTAT                                                 03137000
FMCPURCH EQU   FMCSSTAT                                                 03138000
FMCNSALU EQU   FMCSSTAT                                                 03139000
FMCBIP   EQU   FMCSSTAT                                                 03140000
FMCSDTR  EQU   FMCSSTAT                                                 03141000
FMCUIPI  EQU   FMCSSTAT                                                 03142000
FMCCIPI  EQU   FMCSSTAT                                                 03143000
FMCSNBI  EQU   FMCSSTAT                                                 03144000
FMCRVD01 EQU   ISTFMCB+158                                              03145000
FMCISSN  EQU   ISTFMCB+156                                              03146000
FMCOASN  EQU   FMCNXOSC                                                 03147000
FMCOSSN  EQU   FMCNXCFM                                                 03148000
FMCSIP   EQU   FMCSIPA                                                  03149000
FMCEXLST EQU   ISTFMCB+144                                              03150000
FMCPAB5  EQU   ISTFMCB+128                                              03151000
FMCPAB4  EQU   ISTFMCB+112                                              03152000
FMCPAB3  EQU   ISTFMCB+96                                               03153000
FMCPAB1  EQU   ISTFMCB+64                                               03154000
FMCFASYA EQU   ISTFMCB+60                                               03155000
FMCMODE  EQU   ISTFMCB+52                                               03156000
FMCPROCD EQU   ISTFMCB+48                                               03157000
FMCVWT   EQU   ISTFMCB+44                                               03158000
FMCRPLH  EQU   ISTFMCB+40                                               03159000
FMCBUFNB EQU   FMCCMPS1+2                                               03160000
FMCBUFLM EQU   FMCCMPS1                                                 03161000
FMCDEBA  EQU   ISTFMCB+32                                               03162000
@NM00024 EQU   FMCCMDFL                                                 03163000
FMCSNA   EQU   FMCCMDFL                                                 03164000
FMCVSNA  EQU   FMCCMDFL                                                 03165000
FMCCMDR  EQU   FMCCMDFL                                                 03166000
@NM00023 EQU   ISTFMCB+30                                               03167000
@NM00022 EQU   FMCSTAT1                                                 03168000
FMCLTCLS EQU   FMCSTAT1                                                 03169000
FMCHPURG EQU   FMCSTAT1                                                 03170000
FMCVSP2  EQU   FMCSTAT1                                                 03171000
FMCVSP1  EQU   FMCSTAT                                                  03172000
FMCLTEAS EQU   FMCSTAT                                                  03173000
FMCZF007 EQU   FMCSTAT                                                  03174000
FMCDEDSC EQU   FMCSTAT                                                  03175000
FMCDEVOF EQU   FMCSTAT                                                  03176000
FMCDAPT  EQU   FMCSTAT                                                  03177000
FMCPRMTE EQU   FMCSTAT                                                  03178000
FMCPRMTR EQU   FMCSTAT                                                  03179000
FMCUSFLD EQU   ISTFMCB+24                                               03180000
FMCFMCBA EQU   ISTFMCB+20                                               03181000
FMCDNCBA EQU   ISTFMCB+16                                               03182000
FMCDVTA  EQU   ISTFMCB+12                                               03183000
FMCTSKID EQU   ISTFMCB+8                                                03184000
FMCNXTCB EQU   ISTFMCB+4                                                03185000
FMCSAF   EQU   ISTFMCB+2                                                03186000
FMCLNGTH EQU   ISTFMCB+1                                                03187000
FMCTYPE  EQU   ISTFMCB                                                  03188000
PROSRDEF EQU   PROSETM4                                                 03189000
PRORSV47 EQU   PROSETM4                                                 03190000
PROSCON  EQU   PROSETM4                                                 03191000
PRORSV46 EQU   PROSETM3                                                 03192000
PROSMONT EQU   PROSETM3                                                 03193000
PRORSV45 EQU   PROSETM3                                                 03194000
PROSNTO  EQU   PROSETM3                                                 03195000
PRORSV44 EQU   PROSETM3                                                 03196000
PRORSV43 EQU   PROSETM2                                                 03197000
PROSNTFL EQU   PROSETM2                                                 03198000
PRORSV42 EQU   PROSETM2                                                 03199000
PRORSV41 EQU   PROPROCS                                                 03200000
PROMODC  EQU   PROPROC4                                                 03201000
PROMODT  EQU   PROPROC4                                                 03202000
PROMODM  EQU   PROPROC4                                                 03203000
PROMODB  EQU   PROPROC4                                                 03204000
PRORSV14 EQU   PROPROC4                                                 03205000
PRORSV13 EQU   PROPROC4                                                 03206000
PRORSV12 EQU   PROPROC4                                                 03207000
PROEIB   EQU   PROPROC4                                                 03208000
PROMONT3 EQU   PROPROC3                                                 03209000
PROMONT2 EQU   PROPROC3                                                 03210000
PROMONIT EQU   PROPROC3                                                 03211000
PROSUBLK EQU   PROPROC3                                                 03212000
PRONTO   EQU   PROPROC3                                                 03213000
PROLGIN  EQU   PROPROC3                                                 03214000
PROERPI  EQU   PROPROC3                                                 03215000
PRORSV07 EQU   PROPROC3                                                 03216000
PROCFTX  EQU   PROPROC2                                                 03217000
PROEMLC  EQU   PROPROC2                                                 03218000
PRONTFL  EQU   PROPROC2                                                 03219000
PRORSV05 EQU   PROPROC2                                                 03220000
PRORSV04 EQU   PROPROC2                                                 03221000
PROLGOT  EQU   PROPROC2                                                 03222000
PROERPO  EQU   PROPROC2                                                 03223000
PRORSV03 EQU   PROPROC2                                                 03224000
PRORPLC  EQU   PROPROC1                                                 03225000
PROCS    EQU   PROPROC1                                                 03226000
PROCA    EQU   PROPROC1                                                 03227000
PRORESPX EQU   PROPROC1                                                 03228000
PRODFASY EQU   PROPROC1                                                 03229000
PROXPOPT EQU   PROPROC1                                                 03230000
PROTRUNC EQU   PROPROC1                                                 03231000
PROASYIP EQU   PROPROC1                                                 03232000
DEVRSV03 EQU   ISTDEVCH+5                                               03233000
DEVPHYSA EQU   ISTDEVCH+4                                               03234000
DEVCSLPN EQU   DEVCHAR3                                                 03235000
DEVCSTCL EQU   DEVCHAR3                                                 03236000
DEVCCHEK EQU   DEVCHAR3                                                 03237000
DEVCATTN EQU   DEVCHAR3                                                 03238000
DEVCSWL  EQU   DEVFCCTL                                                 03239000
DEVCRVB  EQU   DEVFCCTL                                                 03240000
DEVCSSL  EQU   DEVFCCTL                                                 03241000
DEVCBSC  EQU   DEVFCCTL                                                 03242000
DEVMCODE EQU   ISTDEVCH+2                                               03243000
DEVCHAR2 EQU   DEVTCODE                                                 03244000
DEVRSV01 EQU   DEVCHAR                                                  03245000
DEVCCTL  EQU   DEVCHAR                                                  03246000
DEVNNSPT EQU   DEVCHAR                                                  03247000
DEVSPS   EQU   DEVCHAR                                                  03248000
DEVSUBND EQU   DEVCHAR                                                  03249000
DEVCONVR EQU   DEVCHAR                                                  03250000
DEVOTPUT EQU   DEVCHAR                                                  03251000
DEVINPUT EQU   DEVCHAR                                                  03252000
LCPFTYPE EQU   LCPRPHA                                                  03253000
LCPRSTQH EQU   LCPLCCW                                                  03254000
LCPCLREP EQU   ISTLCPB+44                                               03255000
LCPUBFSB EQU   LCPFLCCW                                                 03256000
LCPRSV77 EQU   ISTLCPB+39                                               03257000
LCPLCCWC EQU   ISTLCPB+38                                               03258000
LCPRSV78 EQU   LCPFLG1                                                  03259000
LCPTRANS EQU   LCPFLG1                                                  03260000
LCPSTLB  EQU   LCPFLG1                                                  03261000
LCPREDRV EQU   LCPFLG1                                                  03262000
LCPDIRPT EQU   LCPFLG1                                                  03263000
LCPINTER EQU   LCPFLG1                                                  03264000
LCPRESET EQU   LCPFLG1                                                  03265000
LCPSTYPE EQU   ISTLCPB+36                                               03266000
LCPFSNCH EQU   ISTLCPB+34                                               03267000
LCPFOSN  EQU   ISTLCPB+32                                               03268000
LCPTLBAD EQU   ISTLCPB+28                                               03269000
LCPFDB2  EQU   LCPFDBA+1                                                03270000
LCPFDB1  EQU   LCPFDBA                                                  03271000
LCPNXLCW EQU   ISTLCPB+20                                               03272000
LCPDAF   EQU   LCPCID+2                                                 03273000
LCPSAF   EQU   LCPCID                                                   03274000
LCPLCCW1 EQU   ISTLCPB+12                                               03275000
LCPRRCNT EQU   LCPSEQ+1                                                 03276000
LCPRRCCT EQU   LCPSEQ                                                   03277000
LCPDSTAT EQU   LCPFLAG2                                                 03278000
LCPEXRES EQU   LCPFID0                                                  03279000
LCPZRIMM EQU   LCPTLBPI                                                 03280000
LCPRSTRT EQU   LCPFLAG2                                                 03281000
LCPASYN  EQU   LCPFLAG2                                                 03282000
LCPPRFLG EQU   LCPFLAG2                                                 03283000
LCPZMIRC EQU   LCPRUCNT                                                 03284000
LCPCHAI2 EQU   LCPCHAIN+1                                               03285000
LCPCHNG  EQU   LCPCHAI1                                                 03286000
LCPZRT0B EQU   LCPMNRCD                                                 03287000
LCPZRT0A EQU   LCPMNRCD                                                 03288000
LCPZRTL9 EQU   LCPZRT09                                                 03289000
LCPZRTL8 EQU   LCPZRT08                                                 03290000
LCPZRTL7 EQU   LCPZRT07                                                 03291000
LCPZRTL6 EQU   LCPZRT06                                                 03292000
LCPZRTL5 EQU   LCPZRT05                                                 03293000
LCPZRTL4 EQU   LCPZRT04                                                 03294000
LCPZRTL3 EQU   LCPZRT03                                                 03295000
LCPZRTL2 EQU   LCPZRT02                                                 03296000
LCPZRT01 EQU   LCPFLAGS                                                 03297000
LCPZRT00 EQU   LCPFLAGS                                                 03298000
LCPLNGTH EQU   ISTLCPB+1                                                03299000
LCPTYPE  EQU   ISTLCPB                                                  03300000
LSCTLBAD EQU   ISTLSCB+28                                               03301000
LSCFDB2  EQU   LSCFDBA+1                                                03302000
LSCFDB1  EQU   LSCFDBA                                                  03303000
LSCLCCW1 EQU   ISTLSCB+12                                               03304000
LSCRRCNT EQU   LSCSEQ+1                                                 03305000
LSCRRCCT EQU   LSCSEQ                                                   03306000
LSCATOP  EQU   LSCFLGS                                                  03307000
LSCFREE  EQU   LSCFLGS                                                  03308000
LSCDSTAT EQU   LSCFLGS                                                  03309000
LSCEXRES EQU   LSCFLGS                                                  03310000
LSCZRIMM EQU   LSCFLGS                                                  03311000
LSCRSV01 EQU   LSCFLGS                                                  03312000
LSCCHAI2 EQU   LSCCHAIN+1                                               03313000
LSCCHNG  EQU   LSCCHAI1                                                 03314000
LSCZRTSC EQU   LSCZMNRC                                                 03315000
LSCZRT0B EQU   LSCZMNRC                                                 03316000
LSCZRT0A EQU   LSCZMNRC                                                 03317000
LSCZRTL9 EQU   LSCZRT09                                                 03318000
LSCZRTL8 EQU   LSCZRT08                                                 03319000
LSCZRTL7 EQU   LSCZRT07                                                 03320000
LSCZRTL6 EQU   LSCZRT06                                                 03321000
LSCZRTL5 EQU   LSCZRT05                                                 03322000
LSCZRTL4 EQU   LSCZRT04                                                 03323000
LSCZRTL3 EQU   LSCZRT03                                                 03324000
LSCZRTL2 EQU   LSCZRT02                                                 03325000
LSCZRT01 EQU   LSCREQTG                                                 03326000
LSCZRT00 EQU   LSCREQTG                                                 03327000
LSCLNGTH EQU   LSC1WORD+1                                               03328000
LCCWDATA EQU   ISTLCCW+4                                                03329000
LCCWCNT  EQU   ISTLCCW+2                                                03330000
LCCWACI  EQU   LCCWFLAG                                                 03331000
LCCWRFI  EQU   LCCWFLAG                                                 03332000
LCCWPER  EQU   LCCWLSI                                                  03333000
LCCWIDAT EQU   LCCWFLAG                                                 03334000
LCCWNTVC EQU   LCCWFLAG                                                 03335000
LCCWCKPT EQU   LCCWFLAG                                                 03336000
LCCWCC   EQU   LCCWFLAG                                                 03337000
LCCWCD   EQU   LCCWFLAG                                                 03338000
LCCWTYPE EQU   LCCWCTL                                                  03339000
LCCWMODE EQU   LCCWCTL                                                  03340000
LCCWSOP  EQU   LCCWRWOP                                                 03341000
@NM00021 EQU   LCCWRWOP                                                 03342000
LCCWSD   EQU   LCCWOP                                                   03343000
LCCWSI   EQU   LCCWOP                                                   03344000
ATCAOS   EQU   ISTATCVT+1584                                            03345000
ATCPOPAB EQU   ATCAOSM+640                                              03346000
ATCVIOPM EQU   ATCAOSM+636                                              03347000
ATCTPMMI EQU   ATCAOSM+632                                              03348000
ATCTPMPB EQU   ATCAOSM+600                                              03349000
ATCRSV88 EQU   ATCAOSM+596                                              03350000
ATCRPLCT EQU   ATCAOSM+594                                              03351000
ATCCRACT EQU   ATCAOSM+592                                              03352000
ATCSRBCT EQU   ATCAOSM+590                                              03353000
ATCRSV75 EQU   ATCAOSM+589                                              03354000
ATCRSV66 EQU   ATCZFLAG                                                 03355000
ATCZF001 EQU   ATCZFLAG                                                 03356000
ATCTPCP1 EQU   ATCAOSM+584                                              03357000
ATCTPCP0 EQU   ATCAOSM+580                                              03358000
ATCAICTN EQU   ATCAOSM+576                                              03359000
ATCZR01  EQU   ATCAOSM+572                                              03360000
ATCMPLTA EQU   ATCAOSM+568                                              03361000
ATCASCB  EQU   ATCAOSM+564                                              03362000
ATCAP86  EQU   ATCAOSM+560                                              03363000
ATCAP85  EQU   ATCAOSM+556                                              03364000
ATCAP84  EQU   ATCAOSM+552                                              03365000
ATCAP83  EQU   ATCAOSM+548                                              03366000
ATCAP82  EQU   ATCAOSM+544                                              03367000
ATCAP69  EQU   ATCAOSM+540                                              03368000
ATCAP66  EQU   ATCAOSM+536                                              03369000
ATCAP62  EQU   ATCAOSM+532                                              03370000
ATCAPC59 EQU   ATCAOSM+528                                              03371000
ATCAP56  EQU   ATCAOSM+524                                              03372000
ATCAP55  EQU   ATCAOSM+520                                              03373000
ATCRCFY0 EQU   ATCAOSM+516                                              03374000
ATCAP41  EQU   ATCAOSM+512                                              03375000
ATCAPC25 EQU   ATCAOSM+508                                              03376000
ATCAP23  EQU   ATCAOSM+504                                              03377000
ATCTPSPB EQU   ATCAOSM+472                                              03378000
ATCTRMPB EQU   ATCAOSM+440                                              03379000
ATCAPBE  EQU   ATCAOSM+436                                              03380000
ATCPSTA  EQU   ATCAOSM+432                                              03381000
ATCSMABF EQU   ATCAOSM+428                                              03382000
ATCSMAPR EQU   ATCAOSM+424                                              03383000
ATCTPWQA EQU   ATCAOSM+420                                              03384000
ATCSMAID EQU   ATCAOSM+416                                              03385000
ATCSMARA EQU   ATCAOSM+412                                              03386000
ATCCACXA EQU   ATCAOSM+408                                              03387000
ATCZLAAB EQU   ATCAOSM+404                                              03388000
ATCATA10 EQU   ATCAOSM+400                                              03389000
ATCHLTCB EQU   ATCAOSM+396                                              03390000
@NM00020 EQU   ATCVTFLG                                                 03391000
ATCVTACT EQU   ATCVTFLG                                                 03392000
ATCRPT40 EQU   ATCAOSM+388                                              03393000
ATCRPT39 EQU   ATCAOSM+384                                              03394000
ATCRPT38 EQU   ATCAOSM+380                                              03395000
ATCRPT37 EQU   ATCAOSM+376                                              03396000
ATCRPT36 EQU   ATCAOSM+372                                              03397000
ATCRPT35 EQU   ATCAOSM+368                                              03398000
ATCRPT34 EQU   ATCAOSM+364                                              03399000
ATCRPT33 EQU   ATCAOSM+360                                              03400000
ATCRPT32 EQU   ATCAOSM+356                                              03401000
ATCRPT31 EQU   ATCAOSM+352                                              03402000
ATCRPT30 EQU   ATCAOSM+348                                              03403000
ATCRPT29 EQU   ATCAOSM+344                                              03404000
ATCRPT28 EQU   ATCAOSM+340                                              03405000
ATCRPT27 EQU   ATCAOSM+336                                              03406000
@NM00019 EQU   ATCAOSM+333                                              03407000
@NM00018 EQU   @NM00017                                                 03408000
ATCSNUF  EQU   @NM00017                                                 03409000
ATCOPKL  EQU   @NM00017                                                 03410000
ATCABEN  EQU   @NM00017                                                 03411000
ATCAIWT  EQU   ATCAOSM+328                                              03412000
ATCINFDD EQU   ATCAOSM+324                                              03413000
ATCORFMG EQU   ATCAOSM+320                                              03414000
ATCORFRL EQU   ATCAOSM+316                                              03415000
ATCOROBT EQU   ATCAOSM+312                                              03416000
ATCORQG  EQU   ATCORSRB                                                 03417000
ATCORTBF EQU   ATCSQAFR                                                 03418000
ATCRPLAC EQU   ATCRPLCN+2                                               03419000
ATCRPLRC EQU   ATCRPLCN                                                 03420000
ATCCRPLQ EQU   ATCCRPL                                                  03421000
ATCSRBAC EQU   ATCSRBCN+2                                               03422000
ATCSRBRC EQU   ATCSRBCN                                                 03423000
ATCSRBQ  EQU   ATCSRB                                                   03424000
ATCCRAAC EQU   ATCCRACN+2                                               03425000
ATCCRARC EQU   ATCCRACN                                                 03426000
ATCCRAQ  EQU   ATCCRA                                                   03427000
ATCRPT12 EQU   ATCAOSM+276                                              03428000
ATCDMAPP EQU   ATCAOSM+272                                              03429000
ATCAP38  EQU   ATCAOSM+268                                              03430000
ATCZDFJ0 EQU   ATCAOSM+260                                              03431000
ATCAP51  EQU   ATCAOSM+256                                              03432000
ATCZPAB2 EQU   ATCAOSM+224                                              03433000
ATCZPAB1 EQU   ATCAOSM+192                                              03434000
ATCZLFVT EQU   ATCAOSM+188                                              03435000
ATCZLPVT EQU   ATCAOSM+184                                              03436000
ATCZDVTX EQU   ATCAOSM+180                                              03437000
ATCZDVTA EQU   ATCAOSM+176                                              03438000
ATCZDVT9 EQU   ATCAOSM+172                                              03439000
ATCZDVT8 EQU   ATCAOSM+168                                              03440000
ATCZDVT7 EQU   ATCAOSM+164                                              03441000
ATCRSV56 EQU   ATCDAPVT+22                                              03442000
ATCDAPDG EQU   ATCDAPVT+20                                              03443000
ATCDXCEA EQU   ATCDAPVT+16                                              03444000
ATCDCEA  EQU   ATCDAPVT+12                                              03445000
ATCDPCIA EQU   ATCDAPVT+8                                               03446000
ATCDSIOA EQU   ATCDAPVT+4                                               03447000
ATCDEOEA EQU   ATCDAPVT                                                 03448000
ATCZLAEA EQU   ATCLDAPP+16                                              03449000
ATCZLCEA EQU   ATCLDAPP+12                                              03450000
ATCRSV17 EQU   ATCLDAPP+8                                               03451000
ATCSMFRR EQU   ATCLDAPP+4                                               03452000
ATCCDTID EQU   ATCLDAPP                                                 03453000
ATCZAEA  EQU   ATCICAPP+16                                              03454000
ATCZCEA  EQU   ATCICAPP+12                                              03455000
ATCCDTCB EQU   ATCICAPP+8                                               03456000
ATCZSIOA EQU   ATCICAPP+4                                               03457000
ATCCDRPH EQU   ATCICAPP                                                 03458000
ATCAP65  EQU   ATCAOSM+96                                               03459000
ATCZDVT6 EQU   ATCAOSM+92                                               03460000
ATCZDVT4 EQU   ATCAOSM+88                                               03461000
ATCZDVT3 EQU   ATCAOSM+84                                               03462000
ATCZDVT1 EQU   ATCAOSM+80                                               03463000
ATCICNCB EQU   ATCAOSM+76                                               03464000
ATCAP64  EQU   ATCAOSM+64                                               03465000
ATCAP63  EQU   ATCAOSM+60                                               03466000
ATCAP61  EQU   ATCAOSM+56                                               03467000
ATCAP58  EQU   ATCAOSM+52                                               03468000
ATCAP57  EQU   ATCAOSM+48                                               03469000
ATCAP54  EQU   ATCAOSM+44                                               03470000
ATCAP53  EQU   ATCAOSM+40                                               03471000
ATCAP52  EQU   ATCAOSM+36                                               03472000
ATCAP32  EQU   ATCAOSM+28                                               03473000
ATCAP31  EQU   ATCAOSM+24                                               03474000
ATCAP12  EQU   ATCAOSM+20                                               03475000
ATCAP11  EQU   ATCAOSM+16                                               03476000
ATCCMTCB EQU   ATCAOSM+12                                               03477000
ATCPRPH  EQU   ATCAOSM+8                                                03478000
ATCGSRBF EQU   ATCGSRBG                                                 03479000
ATCSRBRT EQU   ATCAOSM                                                  03480000
@NM00016 EQU   @NM00015                                                 03481000
ATCVTMAB EQU   @NM00015                                                 03482000
@NM00014 EQU   ATCVTBAM                                                 03483000
ATCVDLOK EQU   ISTATCVT+904                                             03484000
ATCVFPAB EQU   ISTATCVT+872                                             03485000
ATCVDPAB EQU   ISTATCVT+840                                             03486000
ATCIOECB EQU   ISTATCVT+836                                             03487000
ATCINCW3 EQU   ISTATCVT+832                                             03488000
ATCMODTB EQU   ISTATCVT+828                                             03489000
ATCUSSPT EQU   ISTATCVT+824                                             03490000
ATCSRTAB EQU   ISTATCVT+820                                             03491000
@NM00013 EQU   ISTATCVT+819                                             03492000
@NM00012 EQU   ATCSTAT2                                                 03493000
ATCTRSMS EQU   ATCSTAT2                                                 03494000
ATCTRLOK EQU   ATCSTAT2                                                 03495000
ATCTRPSS EQU   ATCSTAT2                                                 03496000
ATCTRESC EQU   ATCSTAT2                                                 03497000
ATCTRAPI EQU   ATCSTAT2                                                 03498000
ATCNMCTR EQU   ISTATCVT+816                                             03499000
ATCSEC51 EQU   ATCSECST                                                 03500000
ATCSEC40 EQU   ATCSIPD+8                                                03501000
ATCSEC30 EQU   ATCSIPD+4                                                03502000
ATCSEC21 EQU   ATCSIPD                                                  03503000
ATCSEC10 EQU   ATCSOPD+4                                                03504000
ATCSEC01 EQU   ATCSOPD                                                  03505000
ATCPOIA  EQU   ATCRNO+1                                                 03506000
@NM00011 EQU   ATCRNO                                                   03507000
ATCPODVT EQU   ISTATCVT+784                                             03508000
ATCS49XL EQU   ISTATCVT+780                                             03509000
ATCS49XI EQU   ISTATCVT+776                                             03510000
ATCLCLCT EQU   ATCVLCNT+2                                               03511000
ATCRNCNT EQU   ATCVLCNT                                                 03512000
ATCCFEAD EQU   ISTATCVT+768                                             03513000
ATCPTR00 EQU   ISTATCVT+736                                             03514000
ATCRSV10 EQU   ISTATCVT+704                                             03515000
ATCTACB  EQU   ISTATCVT+700                                             03516000
ATCVTINM EQU   ISTATCVT+696                                             03517000
ATCTCLIM EQU   ISTATCVT+692                                             03518000
ATCTCLOM EQU   ISTATCVT+688                                             03519000
ATCVTIPB EQU   ISTATCVT+656                                             03520000
ATCTCIPB EQU   ISTATCVT+624                                             03521000
ATCTIPAB EQU   ISTATCVT+592                                             03522000
ATCOCCCB EQU   ISTATCVT+588                                             03523000
ATCOCCOB EQU   ISTATCVT+584                                             03524000
ATCCDLAD EQU   ISTATCVT+580                                             03525000
ATCCCLAD EQU   ISTATCVT+576                                             03526000
ATCDLRPB EQU   ISTATCVT+544                                             03527000
ATCPGPAB EQU   ISTATCVT+512                                             03528000
ATCVPAB1 EQU   ISTATCVT+480                                             03529000
ATCRSV97 EQU   ISTATCVT+476                                             03530000
ATCRDTLK EQU   ISTATCVT+472                                             03531000
ATCVOCLK EQU   ISTATCVT+468                                             03532000
ATCCDFDN EQU   ISTATCVT+464                                             03533000
ATCCDFIN EQU   ISTATCVT+460                                             03534000
ATCDVTLK EQU   ISTATCVT+456                                             03535000
ATCAP36  EQU   ISTATCVT+452                                             03536000
ATCAP35  EQU   ISTATCVT+448                                             03537000
ATCAP33  EQU   ISTATCVT+444                                             03538000
ATCRSV99 EQU   ISTATCVT+440                                             03539000
ATCONFIG EQU   ISTATCVT+432                                             03540000
ATCNODDS EQU   ISTATCVT+428                                             03541000
ATCNODEL EQU   ISTATCVT+420                                             03542000
ATCRSV69 EQU   ISTATCVT+416                                             03543000
ATCAPCR5 EQU   ISTATCVT+412                                             03544000
ATCLDECB EQU   ISTATCVT+408                                             03545000
ATCLDNCS EQU   ISTATCVT+404                                             03546000
ATCCDPTR EQU   ISTATCVT+400                                             03547000
ATCADEL  EQU   ISTATCVT+396                                             03548000
ATCTODVT EQU   ISTATCVT+392                                             03549000
ATCDEBCH EQU   ISTATCVT+388                                             03550000
ATCHBSIZ EQU   ATCHPGM+2                                                03551000
ATCHBFNO EQU   ATCHPGM                                                  03552000
ATCCRME  EQU   ISTATCVT+380                                             03553000
ATCRVCHS EQU   ISTATCVT+372                                             03554000
ATCECTLP EQU   ISTATCVT+368                                             03555000
ATCZDVTB EQU   ISTATCVT+364                                             03556000
ATCECPRT EQU   ISTATCVT+360                                             03557000
ATCVTLOD EQU   ISTATCVT+356                                             03558000
ATCTRPAB EQU   ISTATCVT+352                                             03559000
ATCMSGM  EQU   ISTATCVT+348                                             03560000
ATCMSGP  EQU   ISTATCVT+344                                             03561000
ATCEPT   EQU   ISTATCVT+340                                             03562000
ATCDVT   EQU   ISTATCVT+336                                             03563000
ATCTRCPT EQU   ISTATCVT+332                                             03564000
ATCDVLOD EQU   ISTATCVT+328                                             03565000
ATCALERT EQU   ISTATCVT+324                                             03566000
ATCEPA   EQU   ISTATCVT+320                                             03567000
ATCSAF   EQU   ISTATCVT+318                                             03568000
ATCXRANG EQU   ISTATCVT+317                                             03569000
ATCLAST  EQU   ATCSHRFG                                                 03570000
ATCSHRTN EQU   ISTATCVT+308                                             03571000
ATCUEP   EQU   ISTATCVT+304                                             03572000
ATCOCRT  EQU   ISTATCVT+300                                             03573000
ATCCSMA  EQU   ATCCSMR                                                  03574000
ATCESC02 EQU   ISTATCVT+292                                             03575000
ATCESC01 EQU   ISTATCVT+288                                             03576000
ATCCDFND EQU   ISTATCVT+284                                             03577000
ATCCDDEL EQU   ISTATCVT+280                                             03578000
ATCCDADD EQU   ISTATCVT+276                                             03579000
ATCMNT   EQU   ISTATCVT+272                                             03580000
ATCRSV16 EQU   ISTATCVT+270                                             03581000
ATCMAXID EQU   ISTATCVT+269                                             03582000
ATCMSGSP EQU   ATCCOM+268                                               03583000
ATCCIDM  EQU   ATCCOM+266                                               03584000
ATCACTRM EQU   ATCCOM+264                                               03585000
ATCNERAP EQU   ATCCOM+260                                               03586000
ATCNESAL EQU   ATCCOM+256                                               03587000
ATCRCC65 EQU   ATCCOM+252                                               03588000
ATCRCC26 EQU   ATCCOM+248                                               03589000
ATCRCC63 EQU   ATCCOM+244                                               03590000
ATCRSV11 EQU   ATCCOM+242                                               03591000
ATCVTMID EQU   ATCCOM+240                                               03592000
ATCAPOST EQU   ATCCOM+236                                               03593000
ATCNERFN EQU   ATCCOM+232                                               03594000
ATCNERNE EQU   ATCCOM+228                                               03595000
ATCNERCV EQU   ATCCOM+224                                               03596000
ATCNERST EQU   ATCCOM+220                                               03597000
ATCDCC61 EQU   ATCCOM+216                                               03598000
ATCDCC60 EQU   ATCCOM+212                                               03599000
ATCSRTDF EQU   ATCCOM+208                                               03600000
ATCSRTAD EQU   ATCCOM+204                                               03601000
ATCFIRA  EQU   ATCCOM+200                                               03602000
ATCSMBQ  EQU   ATCCOM+196                                               03603000
ATCSMRC  EQU   ATCCOM+192                                               03604000
ATCSMQU  EQU   ATCCOM+184                                               03605000
ATCSMRQ  EQU   ATCCOM+180                                               03606000
ATCACDA  EQU   ATCCOM+176                                               03607000
ATCSTMA  EQU   ATCCOM+172                                               03608000
ATCFRSTR EQU   ATCCOM+168                                               03609000
ATCGTSTR EQU   ATCCOM+164                                               03610000
ATCREADA EQU   ATCCOM+160                                               03611000
ATCALOAD EQU   ATCCOM+156                                               03612000
ATCBLDLA EQU   ATCCOM+152                                               03613000
ATCFBRPH EQU   ATCCOM+148                                               03614000
ATCBFTRC EQU   ATCCOM+144                                               03615000
ATCTPBUF EQU   ATCTHTRC                                                 03616000
ATCREMOV EQU   ATCCOM+136                                               03617000
ATCADD   EQU   ATCCOM+132                                               03618000
ATCDVTPT EQU   ATCCOM+124                                               03619000
ATCFEPT  EQU   ATCCOM+120                                               03620000
ATCFDVT  EQU   ATCCOM+116                                               03621000
ATCCONFT EQU   ATCCOM+112                                               03622000
ATCPTCHA EQU   ATCCOM+108                                               03623000
ATCAUTHA EQU   ATCCOM+104                                               03624000
ATCACCTA EQU   ATCCOM+100                                               03625000
ATCRDTH  EQU   ATCCOM+96                                                03626000
ATCFRSCH EQU   ATCCOM+92                                                03627000
ATCFSB   EQU   ATCCOM+88                                                03628000
ATCHLTMS EQU   ATCCOM+84                                                03629000
ATCECPRM EQU   ATCCOM+80                                                03630000
ATCECNET EQU   ATCCOM+76                                                03631000
ATCECOPC EQU   ATCCOM+72                                                03632000
ATCVPARM EQU   ATCCOM+68                                                03633000
ATCECVRQ EQU   ATCCOM+64                                                03634000
ATCECSES EQU   ATCCOM+60                                                03635000
ATCOCHA  EQU   ATCCOM+56                                                03636000
ATCDSPLQ EQU   ATCCOM+52                                                03637000
ATCECDSP EQU   ATCCOM+48                                                03638000
ATCVARYQ EQU   ATCCOM+44                                                03639000
ATCECVRY EQU   ATCCOM+40                                                03640000
ATCHALTQ EQU   ATCCOM+36                                                03641000
ATCECHLT EQU   ATCCOM+32                                                03642000
ATCMODQ  EQU   ATCCOM+28                                                03643000
ATCECMOD EQU   ATCCOM+24                                                03644000
ATCASCHD EQU   ATCCOM+20                                                03645000
ATCSRT   EQU   ATCCOM+16                                                03646000
ATCRDT   EQU   ATCCOM+12                                                03647000
ATCDCFRR EQU   ATCCOM+8                                                 03648000
ATCAPI   EQU   ATCCOM+4                                                 03649000
ATCRSV04 EQU   ATCSTAT4                                                 03650000
ATCVTTRC EQU   ATCSTAT4                                                 03651000
ATCNCSD  EQU   ATCSTAT4                                                 03652000
ATCMTST  EQU   ATCSTAT4                                                 03653000
ATCTPRT  EQU   ATCSTAT4                                                 03654000
ATCPRTAT EQU   ATCSTAT4                                                 03655000
@NM00010 EQU   ATCPOFLG                                                 03656000
ATCPOUNS EQU   ATCPOFLG                                                 03657000
ATCHSDMF EQU   ATCSTFLG                                                 03658000
@NM00009 EQU   ATCSTAT1                                                 03659000
ATCMDHLT EQU   ATCSTAT1                                                 03660000
ATCINHLT EQU   ATCSTAT1                                                 03661000
ATCNETSL EQU   ATCSTAT1                                                 03662000
ATCQKHLT EQU   ATCSTAT1                                                 03663000
ATCSNHLT EQU   ATCSTAT1                                                 03664000
ATCACTIV EQU   ATCSTAT1                                                 03665000
ATCSTART EQU   ATCSTAT1                                                 03666000
LOKXCL   EQU   @NM00007                                                 03667000
LOKPRY   EQU   @NM00007                                                 03668000
@NM00008 EQU   @NM00007                                                 03669000
@NM00006 EQU   LOKCHNG                                                  03670000
LOKCT    EQU   ISTLOK                                                   03671000
DYPPAB   EQU   ISTDYPAB+16                                              03672000
DYPRSV01 EQU   ISTDYPAB+12                                              03673000
DYPTSKID EQU   ISTDYPAB+8                                               03674000
DYPCHAIN EQU   ISTDYPAB+4                                               03675000
DYPFLGS  EQU   ISTDYPAB+2                                               03676000
DYPLNGTH EQU   ISTDYPAB+1                                               03677000
DYPTYPE  EQU   ISTDYPAB                                                 03678000
PABRPHA  EQU   PABRPHFG+1                                               03679000
PABNODQ  EQU   PABFLAGS                                                 03680000
PABINHBT EQU   PABFLAGS                                                 03681000
PABERLOK EQU   PABERRLK                                                 03682000
PABSSN   EQU   PABFLAGS                                                 03683000
PABDYNAM EQU   PABFLAGS                                                 03684000
PABNORPR EQU   PABFLAGS                                                 03685000
PABPRIOR EQU   PABFLAGS                                                 03686000
PABAPYP  EQU   PABFLAGS                                                 03687000
PABDVTA  EQU   ISTPAB+9                                                 03688000
PABOFFST EQU   ISTPAB+8                                                 03689000
PABCHNGP EQU   PABCHAIN+1                                               03690000
PABRSV02 EQU   PABCHAIN                                                 03691000
PABDELAY EQU   PABCHAIN                                                 03692000
PABRUNNG EQU   PABCHAIN                                                 03693000
PABRESET EQU   PABCHAIN                                                 03694000
PABUNCON EQU   PABCHAIN                                                 03695000
PABCDP   EQU   PABCHAIN                                                 03696000
PABRESCH EQU   PABCHAIN                                                 03697000
PABCHNG  EQU   PABCHAIN                                                 03698000
PABWEQP  EQU   PABWEQA+1                                                03699000
PABRSV01 EQU   PABWEQA                                                  03700000
PABWEQG  EQU   PABWEQA                                                  03701000
RPHNEXPO EQU   ISTRPH+104                                               03702000
RPHSAV16 EQU   RPHWORK+60                                               03703000
RPHSAV15 EQU   RPHWORK+56                                               03704000
RPHSAV14 EQU   RPHWORK+52                                               03705000
RPHSAV13 EQU   RPHWORK+48                                               03706000
RPHSAV12 EQU   RPHWORK+44                                               03707000
RPHSAV11 EQU   RPHWORK+40                                               03708000
RPHSAV10 EQU   RPHWORK+36                                               03709000
RPHSAVE9 EQU   RPHWORK+32                                               03710000
RPHSAVE8 EQU   RPHWORK+28                                               03711000
RPHSAVE7 EQU   RPHWORK+24                                               03712000
RPHSAVE6 EQU   RPHWORK+20                                               03713000
RPHSAVE5 EQU   RPHWORK+16                                               03714000
RPHSAVE4 EQU   RPHWORK+12                                               03715000
RPHSAVE3 EQU   RPHWORK+8                                                03716000
RPHSAVE2 EQU   RPHWORK+4                                                03717000
RPHSHALF EQU   RPHSAVE1+2                                               03718000
RPHSBIT8 EQU   RPHSBITS                                                 03719000
RPHSBIT7 EQU   RPHSBITS                                                 03720000
RPHSBIT6 EQU   RPHSBITS                                                 03721000
RPHSBIT5 EQU   RPHSBITS                                                 03722000
RPHSBIT4 EQU   RPHSBITS                                                 03723000
RPHSBIT3 EQU   RPHSBITS                                                 03724000
RPHSBIT2 EQU   RPHSBITS                                                 03725000
RPHSBIT1 EQU   RPHSBITS                                                 03726000
RPHSBYTE EQU   RPHSAVE1                                                 03727000
RPHPABQP EQU   RPHPABQA+1                                               03728000
RPHPABFG EQU   RPHPABQA                                                 03729000
RPHSRP34 EQU   RPHSRPRM+2                                               03730000
RPHSRP12 EQU   RPHSRPRM                                                 03731000
RPHWEGT  EQU   RPHCSPA                                                  03732000
RPHMAJCB EQU   ISTRPH+21                                                03733000
RPHPABOF EQU   ISTRPH+20                                                03734000
RPHRESUM EQU   RPHRESMA+1                                               03735000
RPHRSV01 EQU   RPHWPFLG                                                 03736000
RPHPURGE EQU   RPHWPFLG                                                 03737000
RPHPT    EQU   RPHWPFLG                                                 03738000
RPHWT    EQU   RPHWPFLG                                                 03739000
RPHRSKEY EQU   RPHWPFLG                                                 03740000
RPHDVTA  EQU   ISTRPH+12                                                03741000
RPHTIK   EQU   RPHTSKID+3                                               03742000
@NM00005 EQU   RPHTSKID                                                 03743000
RPHRPHAP EQU   RPHRPHA+1                                                03744000
@NM00004 EQU   RPHRPHA                                                  03745000
RPHGATE  EQU   RPHRPHA                                                  03746000
@NM00003 EQU   RPHFLGB                                                  03747000
RPHRLCRA EQU   RPHFLGB                                                  03748000
RPHNRSAV EQU   RPHFLGB                                                  03749000
RPHPGCMP EQU   RPHFLGB                                                  03750000
RPHFBAPS EQU   RPHFLGB                                                  03751000
RPHBSSP  EQU   RPHFLGB                                                  03752000
RPHLOCK  EQU   RPHFLGB                                                  03753000
RPHFNFLG EQU   RPHFSTLC                                                 03754000
RPHMLTCP EQU   RPHFLAGS                                                 03755000
RPHSMCLR EQU   RPHFLAGS                                                 03756000
RPHSMTYP EQU   RPHFLAGS                                                 03757000
RPHSMQ   EQU   RPHFLAGS                                                 03758000
RPHAUTEX EQU   RPHAPTYP                                                 03759000
RPHSPGIN EQU   RPHFLAGS                                                 03760000
RPHOGIND EQU   RPHFLAGS                                                 03761000
RPHLNGTH EQU   RPHCNTL+1                                                03762000
RPHTYPE  EQU   RPHCNTL                                                  03763000
CVTLEVL  EQU   CVTRELNO+2                                               03764000
CVTNUMB  EQU   CVTRELNO                                                 03765000
CVTMDL   EQU   CVTFIX+250                                               03766000
@NM00002 EQU   CVTFIX+248                                               03767000
@NM00001 EQU   CVTFIX                                                   03768000
CVTRV482 EQU   CVTXTNT2+128                                             03769000
CVTRV481 EQU   CVTXTNT2+124                                             03770000
CVTRV480 EQU   CVTXTNT2+120                                             03771000
CVTRV479 EQU   CVTXTNT2+118                                             03772000
CVTRV478 EQU   CVTXTNT2+117                                             03773000
CVTRV477 EQU   CVTXTNT2+116                                             03774000
CVTRV476 EQU   CVTXTNT2+115                                             03775000
CVTRV475 EQU   CVTXTNT2+114                                             03776000
CVTRV474 EQU   CVTRV466                                                 03777000
CVTRV473 EQU   CVTRV466                                                 03778000
CVTRV472 EQU   CVTRV466                                                 03779000
CVTRV471 EQU   CVTRV466                                                 03780000
CVTRV470 EQU   CVTRV466                                                 03781000
CVTRV469 EQU   CVTRV466                                                 03782000
CVTRV468 EQU   CVTRV466                                                 03783000
CVTRV467 EQU   CVTRV466                                                 03784000
CVTRV465 EQU   CVTRV457                                                 03785000
CVTRV464 EQU   CVTRV457                                                 03786000
CVTRV463 EQU   CVTRV457                                                 03787000
CVTRV462 EQU   CVTRV457                                                 03788000
CVTRV461 EQU   CVTRV457                                                 03789000
CVTRV460 EQU   CVTRV457                                                 03790000
CVTRV459 EQU   CVTRV457                                                 03791000
CVTRV458 EQU   CVTRV457                                                 03792000
CVTRV456 EQU   CVTXTNT2+108                                             03793000
CVTRV455 EQU   CVTXTNT2+104                                             03794000
CVTRV454 EQU   CVTXTNT2+100                                             03795000
CVTRV453 EQU   CVTXTNT2+96                                              03796000
CVTRV452 EQU   CVTXTNT2+94                                              03797000
CVTRV451 EQU   CVTXTNT2+92                                              03798000
CVTRV450 EQU   CVTXTNT2+90                                              03799000
CVTRV449 EQU   CVTXTNT2+88                                              03800000
CVTRV448 EQU   CVTXTNT2+87                                              03801000
CVTRV447 EQU   CVTXTNT2+86                                              03802000
CVTRV446 EQU   CVTRV438                                                 03803000
CVTRV445 EQU   CVTRV438                                                 03804000
CVTRV444 EQU   CVTRV438                                                 03805000
CVTRV443 EQU   CVTRV438                                                 03806000
CVTRV442 EQU   CVTRV438                                                 03807000
CVTRV441 EQU   CVTRV438                                                 03808000
CVTRV440 EQU   CVTRV438                                                 03809000
CVTRV439 EQU   CVTRV438                                                 03810000
CVTRV437 EQU   CVTRV429                                                 03811000
CVTRV436 EQU   CVTRV429                                                 03812000
CVTRV435 EQU   CVTRV429                                                 03813000
CVTRV434 EQU   CVTRV429                                                 03814000
CVTRV433 EQU   CVTRV429                                                 03815000
CVTRV432 EQU   CVTRV429                                                 03816000
CVTRV431 EQU   CVTRV429                                                 03817000
CVTRV430 EQU   CVTRV429                                                 03818000
CVTRV428 EQU   CVTXTNT2+80                                              03819000
CVTRV427 EQU   CVTXTNT2+76                                              03820000
CVTRV426 EQU   CVTXTNT2+72                                              03821000
CVTRV425 EQU   CVTXTNT2+68                                              03822000
CVTATACT EQU   CVTATCVT                                                 03823000
CVTRV423 EQU   CVTXTNT2+62                                              03824000
CVTRV422 EQU   CVTXTNT2+60                                              03825000
CVTRV421 EQU   CVTXTNT2+58                                              03826000
CVTRV420 EQU   CVTXTNT2+56                                              03827000
CVTRV419 EQU   CVTXTNT2+55                                              03828000
CVTRV418 EQU   CVTXTNT2+54                                              03829000
CVTRV417 EQU   CVTRV409                                                 03830000
CVTRV416 EQU   CVTRV409                                                 03831000
CVTRV415 EQU   CVTRV409                                                 03832000
CVTRV414 EQU   CVTRV409                                                 03833000
CVTRV413 EQU   CVTRV409                                                 03834000
CVTRV412 EQU   CVTRV409                                                 03835000
CVTRV411 EQU   CVTRV409                                                 03836000
CVTRV410 EQU   CVTRV409                                                 03837000
CVTRV408 EQU   CVTRV400                                                 03838000
CVTRV407 EQU   CVTRV400                                                 03839000
CVTRV406 EQU   CVTRV400                                                 03840000
CVTRV405 EQU   CVTRV400                                                 03841000
CVTRV404 EQU   CVTRV400                                                 03842000
CVTRV403 EQU   CVTRV400                                                 03843000
CVTRV402 EQU   CVTRV400                                                 03844000
CVTRV401 EQU   CVTRV400                                                 03845000
CVTICB   EQU   CVTXTNT2+48                                              03846000
CVTSKTA  EQU   CVTXTNT2+44                                              03847000
CVTSHSB  EQU   CVTSHS                                                   03848000
CVTRSV98 EQU   CVTXTNT2+36                                              03849000
CVTRSV97 EQU   CVTXTNT2+34                                              03850000
CVTRSV96 EQU   CVTXTNT2+32                                              03851000
CVTOLTEP EQU   CVTXTNT2+28                                              03852000
CVTQIDA  EQU   CVTQID+1                                                 03853000
CVTRSV95 EQU   CVTQID                                                   03854000
CVTRSV94 EQU   CVTXTNT2+20                                              03855000
CVTRSV93 EQU   CVTXTNT2+16                                              03856000
CVTRSV92 EQU   CVTXTNT2+12                                              03857000
CVTDEBVR EQU   CVTXTNT2+8                                               03858000
CVTRSV91 EQU   CVTXTNT2+6                                               03859000
CVTRSV9H EQU   CVTFLGBT                                                 03860000
CVTRSV9G EQU   CVTFLGBT                                                 03861000
CVTRSV9F EQU   CVTFLGBT                                                 03862000
CVTRSV9E EQU   CVTFLGBT                                                 03863000
CVTRSV9D EQU   CVTFLGBT                                                 03864000
CVTRSV9C EQU   CVTFLGBT                                                 03865000
CVTVME   EQU   CVTFLGBT                                                 03866000
CVTNPE   EQU   CVTFLGBT                                                 03867000
CVTNUCLS EQU   CVTXTNT2+4                                               03868000
CVTDSSVA EQU   CVTDSSV+1                                                03869000
CVTRSV89 EQU   CVTDSSV                                                  03870000
CVTRSV88 EQU   CVTXTNT1+8                                               03871000
CVTRSV87 EQU   CVTXTNT1+4                                               03872000
CVTFACHN EQU   CVTXTNT1                                                 03873000
CVTRV488 EQU   CVTMAP+412                                               03874000
CVTRV487 EQU   CVTMAP+408                                               03875000
CVTRV486 EQU   CVTMAP+404                                               03876000
CVTRV485 EQU   CVTMAP+400                                               03877000
CVTACTAP EQU   CVTMAP+396                                               03878000
CVTAUTH  EQU   CVTMAP+392                                               03879000
CVTATMCA EQU   CVTATMCT+1                                               03880000
CVTATMST EQU   CVTATMCT                                                 03881000
CVTRSV61 EQU   CVTMAP+384                                               03882000
CVTVOLT1 EQU   CVTVOLM1+1                                               03883000
CVTVOLI1 EQU   CVTVOLF1                                                 03884000
CVTSTOA  EQU   CVTMAP+376                                               03885000
CVTRSV58 EQU   CVTMAP+374                                               03886000
CVTRSV57 EQU   CVTMAP+372                                               03887000
CVTDDCE  EQU   CVTMAP+368                                               03888000
CVTPNWFR EQU   CVTMAP+364                                               03889000
CVTSMF   EQU   CVTMAP+360                                               03890000
CVTSULK  EQU   CVTMAP+358                                               03891000
CVTSLKO  EQU   CVTSYSK                                                  03892000
CVTSLKP  EQU   CVTSYSK                                                  03893000
CVTSLKQ  EQU   CVTSYSK                                                  03894000
CVTSLKR  EQU   CVTSYSK                                                  03895000
CVTRSV56 EQU   CVTSYSK                                                  03896000
CVTRSV55 EQU   CVTSYSK                                                  03897000
CVTRSV54 EQU   CVTSYSK                                                  03898000
CVTRSV53 EQU   CVTSYSK                                                  03899000
CVTRSV52 EQU   CVTA1F1                                                  03900000
CVTRSV51 EQU   CVTA1F1                                                  03901000
CVTRSV50 EQU   CVTA1F1                                                  03902000
CVTRSV49 EQU   CVTA1F1                                                  03903000
CVTRSV48 EQU   CVTA1F1                                                  03904000
CVTRSV47 EQU   CVTA1F1                                                  03905000
CVTSRSW  EQU   CVTA1F1                                                  03906000
CVTPFSW  EQU   CVTA1F1                                                  03907000
CVTPCVT  EQU   CVTMAP+352                                               03908000
CVTRSV46 EQU   CVTMAP+344                                               03909000
CVTRSV45 EQU   CVTMAP+340                                               03910000
CVTRSV44 EQU   CVTMAP+338                                               03911000
CVTRSV43 EQU   CVTMAP+336                                               03912000
CVTHJESA EQU   CVTHJES+1                                                03913000
CVTRSV42 EQU   CVTHJES                                                  03914000
CVTEXT2A EQU   CVTEXT2+1                                                03915000
CVTRSV41 EQU   CVTEXT2                                                  03916000
CVTAPFA  EQU   CVTAPF+1                                                 03917000
CVTRSV40 EQU   CVTAPF                                                   03918000
CVTRV518 EQU   CVTINTLA                                                 03919000
CVTRV517 EQU   CVTERPV                                                  03920000
CVTEORM  EQU   CVTMAP+312                                               03921000
CVTMCHPR EQU   CVTMAP+308                                               03922000
CVTTZ    EQU   CVTMAP+304                                               03923000
CVTJEPS  EQU   CVTMAP+300                                               03924000
CVTJESCT EQU   CVTMAP+296                                               03925000
CVTMODE  EQU   CVTMAP+292                                               03926000
CVTPTRV  EQU   CVTMAP+288                                               03927000
CVTREAL  EQU   CVTMAP+284                                               03928000
CVTRSV39 EQU   CVTMAP+280                                               03929000
CVTRSV38 EQU   CVTMAP+276                                               03930000
CVTDMSRA EQU   CVTDMSR+1                                                03931000
CVTRV634 EQU   CVTDMSRF                                                 03932000
CVTRV633 EQU   CVTDMSRF                                                 03933000
CVTRV632 EQU   CVTDMSRF                                                 03934000
CVTRV631 EQU   CVTDMSRF                                                 03935000
CVTRV630 EQU   CVTDMSRF                                                 03936000
CVTRV629 EQU   CVTDMSRF                                                 03937000
CVTUDUMP EQU   CVTDMSRF                                                 03938000
CVTSDUMP EQU   CVTDMSRF                                                 03939000
CVTQMSGA EQU   CVTQMSG+1                                                03940000
CVTRSV36 EQU   CVTQMSG                                                  03941000
CVTAMFF  EQU   CVTMAP+264                                               03942000
CVTPURGA EQU   CVTPURG+1                                                03943000
CVTRSV35 EQU   CVTPURG                                                  03944000
CVTCBSP  EQU   CVTMAP+256                                               03945000
CVTATERA EQU   CVTATER+1                                                03946000
CVTSYST  EQU   CVTATER                                                  03947000
CVTVOLT2 EQU   CVTTAT                                                   03948000
CVTVOLI2 EQU   CVTVOLF2                                                 03949000
CVTAQAVB EQU   CVTAQAVT+1                                               03950000
CVTRSV34 EQU   CVTTCMFG                                                 03951000
CVTRSV33 EQU   CVTTCMFG                                                 03952000
CVTRSV32 EQU   CVTTCMFG                                                 03953000
CVTRSV31 EQU   CVTTCMFG                                                 03954000
CVTRSV30 EQU   CVTTCMFG                                                 03955000
CVTRSV29 EQU   CVTTCMFG                                                 03956000
CVTRSV28 EQU   CVTTCMFG                                                 03957000
CVTTCRDY EQU   CVTTCMFG                                                 03958000
CVTGTFA  EQU   CVTGTF+1                                                 03959000
CVTRSV27 EQU   CVTGTFST                                                 03960000
CVTRNIO  EQU   CVTGTFST                                                 03961000
CVTUSR   EQU   CVTGTFST                                                 03962000
CVTRV318 EQU   CVTFORM                                                  03963000
CVTRV317 EQU   CVTTMODE                                                 03964000
CVTRV316 EQU   CVTSTATE                                                 03965000
CVTRV315 EQU   CVTGTFS                                                  03966000
CVTGTFAV EQU   CVTGTFS                                                  03967000
CVT0SCR1 EQU   CVTMAP+232                                               03968000
CVTRV515 EQU   CVTMAP+228                                               03969000
CVTRMS   EQU   CVTMAP+224                                               03970000
CVTPATCH EQU   CVTMAP+220                                               03971000
CVTTSCE  EQU   CVTMAP+216                                               03972000
CVTLNKSC EQU   CVTMAP+214                                               03973000
CVTQABST EQU   CVTMAP+212                                               03974000
CVTMDLDS EQU   CVTMAP+208                                               03975000
CVTUSER  EQU   CVTMAP+204                                               03976000
CVTABEND EQU   CVTMAP+200                                               03977000
CVTSMCA  EQU   CVTMAP+196                                               03978000
CVTRSV18 EQU   CVTMAP+192                                               03979000
CVTQLPAQ EQU   CVTMAP+188                                               03980000
CVTQCDSR EQU   CVTMAP+184                                               03981000
CVTRSV17 EQU   CVTOPTB                                                  03982000
CVTRSV16 EQU   CVTOPTB                                                  03983000
CVTFP    EQU   CVTOPTB                                                  03984000
CVTAPTHR EQU   CVTOPTB                                                  03985000
CVTNLOG  EQU   CVTOPTB                                                  03986000
CVTTOD   EQU   CVTOPTB                                                  03987000
CVTCTIMS EQU   CVTOPTB                                                  03988000
CVTPROT  EQU   CVTOPTB                                                  03989000
CVTXPFP  EQU   CVTOPTA                                                  03990000
CVTASCII EQU   CVTOPTA                                                  03991000
CVTRSV13 EQU   CVTOPTA                                                  03992000
CVTRSV12 EQU   CVTOPTA                                                  03993000
CVTNIP   EQU   CVTOPTA                                                  03994000
CVTDDR   EQU   CVTOPTA                                                  03995000
CVTAPR   EQU   CVTOPTA                                                  03996000
CVTCCH   EQU   CVTOPTA                                                  03997000
CVTSNCTR EQU   CVTMAP+180                                               03998000
CVTQMWR  EQU   CVTMAP+176                                               03999000
CVTQOCR  EQU   CVTMAP+172                                               04000000
CVT1EF00 EQU   CVTMAP+168                                               04001000
CVTMZ00  EQU   CVTMAP+164                                               04002000
CVTHEAD  EQU   CVTMAP+160                                               04003000
CVTRSV11 EQU   CVTMAP+156                                               04004000
CVT0PT01 EQU   CVTMAP+152                                               04005000
CVTMSER  EQU   CVTMAP+148                                               04006000
CVTRV516 EQU   CVTIERLC                                                 04007000
CVTILCH  EQU   CVTMAP+140                                               04008000
CVT0DS   EQU   CVTMAP+136                                               04009000
CVTFBOSV EQU   CVTMAP+132                                               04010000
CVTNUCB  EQU   CVTMAP+128                                               04011000
CVTIXAVL EQU   CVTMAP+124                                               04012000
CVTIOQET EQU   CVTMAP+120                                               04013000
CVTDCBA  EQU   CVTMAP+117                                               04014000
CVTMVS2  EQU   CVTDCB                                                   04015000
CVT6DAT  EQU   CVTDCB                                                   04016000
CVT4MPS  EQU   CVTDCB                                                   04017000
CVTRSV09 EQU   CVTDCB                                                   04018000
CVT4MS1  EQU   CVTDCB                                                   04019000
CVT2SPS  EQU   CVTDCB                                                   04020000
CVT1SSS  EQU   CVTDCB                                                   04021000
CVTRSV08 EQU   CVTDCB                                                   04022000
CVTSTB   EQU   CVTMAP+112                                               04023000
CVTQTD00 EQU   CVTMAP+108                                               04024000
CVTQTE00 EQU   CVTMAP+104                                               04025000
CVTCUCB  EQU   CVTMAP+100                                               04026000
CVTSJQ   EQU   CVTMAP+96                                                04027000
CVTPBLDL EQU   CVTMAP+92                                                04028000
CVTTPC   EQU   CVTMAP+88                                                04029000
CVTSVDCB EQU   CVTMAP+84                                                04030000
CVTBRET  EQU   CVTMAP+82                                                04031000
CVTEXIT  EQU   CVTMAP+80                                                04032000
CVT0FN00 EQU   CVTMAP+76                                                04033000
CVTDARA  EQU   CVTDAR+1                                                 04034000
CVTRSV07 EQU   CVTFLGS1                                                 04035000
CVTRSV06 EQU   CVTFLGS1                                                 04036000
CVTRSV05 EQU   CVTFLGS1                                                 04037000
CVTRSV04 EQU   CVTFLGS1                                                 04038000
CVTRSV03 EQU   CVTFLGS1                                                 04039000
CVTRSV02 EQU   CVTFLGS1                                                 04040000
CVTRSV01 EQU   CVTFLGS1                                                 04041000
CVTDMPLK EQU   CVTFLGS1                                                 04042000
CVTXITP  EQU   CVTMAP+68                                                04043000
CVTZDTAB EQU   CVTMAP+64                                                04044000
CVTMSLT  EQU   CVTMAP+60                                                04045000
CVTDATE  EQU   CVTMAP+56                                                04046000
CVTBTERM EQU   CVTMAP+52                                                04047000
CVTSYSAD EQU   CVTMAP+48                                                04048000
CVTXTLER EQU   CVTMAP+44                                                04049000
CVTILK2  EQU   CVTMAP+40                                                04050000
CVTILK1  EQU   CVTMAP+36                                                04051000
CVTPRLTV EQU   CVTMAP+32                                                04052000
CVTPCNVT EQU   CVTMAP+28                                                04053000
CVT0VL00 EQU   CVTMAP+24                                                04054000
CVTXAPG  EQU   CVTMAP+20                                                04055000
CVTBUF   EQU   CVTMAP+16                                                04056000
CVTJOB   EQU   CVTMAP+12                                                04057000
CVTLINK  EQU   CVTMAP+8                                                 04058000
CVT0EF00 EQU   CVTMAP+4                                                 04059000
CVTTCBP  EQU   CVTMAP                                                   04060000
CVT      EQU   CVTMAP                                                   04061000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04062000
SEG000C# EQU   @RC00451                                                 04063000
SEG000D# EQU   @RC00459                                                 04064000
@RT00606 EQU   @RC00601                                                 04065000
@RC00604 EQU   @RC00601                                                 04066000
SEG000D@ EQU   @PB00004                                                 04067000
@RC00702 EQU   @RC00699                                                 04068000
@PB00006 EQU   @PB00007                                                 04069000
@PB00005 EQU   @PB00006                                                 04070000
@RC00705 EQU   @RC00702                                                 04071000
@ENDDATA EQU   *                                                        04072000
         END   ISTZIFAB,(C'PLS1955',0603,78018)                         04073000
