         TITLE 'ISTZGFBB/ABB-VS1/MBB-VS2 - CONTROL COMPLETION PROCESSOR*00001000
               R        '                                               00002000
ISTZGFBB CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZGFBB  77.279'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
*                                                                  0453 00011000
*   /*****************************************************************/ 00012000
*   /*                                                               */ 00013000
*   /* SAVE REGISTERS AND SET MODULE BASE                            */ 00014000
*   /*                                                               */ 00015000
*   /*****************************************************************/ 00016000
*                                                                  0453 00017000
*/* TPZSAVE (7,12,14) BASE AC(GCBB)                                  */ 00018000
*                                                                  0453 00019000
*   DO;                                                            0453 00020000
*     DCL                                                          0454 00021000
*       GPR01F FIXED(31) REG(01);                                  0454 00022000
*     DCL                                                          0455 00023000
*       GPR01P PTR(31) REG(01);                                    0455 00024000
*     DCL                                                          0456 00025000
*       GPR12F FIXED(31) REG(12);                                  0456 00026000
*     DCL                                                          0457 00027000
*       GPR12P PTR(31) REG(12);                                    0457 00028000
*     DCL                                                          0458 00029000
*       GPR13F FIXED(31) REG(13);                                  0458 00030000
*     DCL                                                          0459 00031000
*       GPR13P PTR(31) REG(13);                                    0459 00032000
*     DCL                                                          0460 00033000
*       GPR14F FIXED(31) REG(14);                                  0460 00034000
*     DCL                                                          0461 00035000
*       GPR14P PTR(31) REG(14);                                    0461 00036000
*     RFY                                                          0462 00037000
*      (GPR01P,                                                    0462 00038000
*       GPR12P,                                                    0462 00039000
*       GPR13P,                                                    0462 00040000
*       GPR14P) RSTD;                                              0462 00041000
*     GEN(PRINT OFF);                                              0463 00042000
*                                                                  0463 00043000
         PRINT OFF                                                      00044000
*/* ATBUILD (ISTZSAVE)                                               */ 00045000
*/* END OF ATBUILD                                                   */ 00046000
*                                                                  0464 00047000
*     GEN(PRINT ON);                                               0464 00048000
         PRINT ON                                                       00049000
*     RFY                                                          0465 00050000
*       ISTZSAVE BASED(GPR13P);                                    0465 00051000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0466 00052000
         STM   7,12,ZSAZSVVR+0(13)                                      00053000
*     GEN SETS(GPR12P);                                            0467 00054000
         BALR  GPR12P,0                                                 00055000
@TSTART  DS    0H                                                       00056000
         USING @TSTART,GPR12P                                           00057000
*     GEN(PRINT OFF);                                              0468 00058000
*                                                                  0468 00059000
         PRINT OFF                                                      00060000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00061000
*/* END OF ATBUILD                                                   */ 00062000
*                                                                  0469 00063000
*     GEN(PRINT ON);                                               0469 00064000
         PRINT ON                                                       00065000
*     GPR01P->RPHCRR->CRACRR->ZCREGCBB='1'B;                       0470 00066000
         L     @15,RPHCRR(,GPR01P)                                 0470 00067000
         L     @15,CRACRR(,@15)                                    0470 00068000
         OI    ZCREGCBB(@15),B'00100000'                           0470 00069000
*     ZSAZACTV='1'B;                                               0471 00070000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0471 00071000
*     ZSAZTRAC='GCBB';                                             0472 00072000
         MVC   ZSAZTRAC(4,GPR13P),@CC04088                         0472 00073000
*     ZSAZSVRR=GPR14P;                                             0473 00074000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0473 00075000
*     GPR13P=ZSAZSVFC;                                             0474 00076000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0474 00077000
*     RFY                                                          0475 00078000
*      (GPR01P) UNRSTD;                                            0475 00079000
*     RFY                                                          0476 00080000
*      (GPR14P) UNRSTD;                                            0476 00081000
*   END;                                                           0477 00082000
*                                                                  0477 00083000
*/* END TPZSAVE                                                      */ 00084000
*                                                                  0478 00085000
*   /*****************************************************************/ 00086000
*   /*                                                               */ 00087000
*   /* IF ENTERED WITHOUT AN LSCB/LCPB ADDRESS, INVOKE LOGICAL ERROR */ 00088000
*   /* RECOVERY ROUTINE AND EXIT                                     */ 00089000
*   /*                                                               */ 00090000
*   /*****************************************************************/ 00091000
*                                                                  0478 00092000
*   IF ELEMREG=0&                   /* NO ELEMENT ON ENTRY   @XM03HDP*/ 00093000
*       ZCR3270R=OFF THEN           /* AND NOT 3270 RECORD   @XM03HDP*/ 00094000
         LTR   ELEMREG,ELEMREG                                     0478 00095000
         BNZ   @RF00478                                            0478 00096000
         L     @15,RPHCRR(,RPHREG)                                 0478 00097000
         L     @15,CRACRR(,@15)                                    0478 00098000
         TM    ZCR3270R(@15),B'00000010'                           0478 00099000
         BNZ   @RF00478                                            0478 00100000
*     CALL ISTZIFIB;                /* CALL LOGICAL ERROR RECOVERY 0479 00101000
*                                      RTN                           */ 00102000
         L     @15,ZRCZIFIB(,RCVTREG)                              0479 00103000
         BALR  @14,@15                                             0479 00104000
*   ELSE                                                           0480 00105000
*     DO;                           /* NOT LOGIC ERROR - CONTINUE    */ 00106000
         B     @RC00478                                            0480 00107000
@RF00478 DS    0H                                                  0481 00108000
*       IF BDUMODIF=BMODZEM|BDUMODIF=BMODZQM|BDUMODIF=BMODZIM|BDUMODIF= 00109000
*           BMODZOM|BDUMODIF=BMODZXO|BDUMODIF=BMODZCM|BDUMODIF=BMODZECM 00110000
*         THEN                      /* RESET BDU MODIF?      @XL03HEK*/ 00111000
         LA    @15,62                                              0481 00112000
         ALR   @15,BFRREG                                          0481 00113000
         CLI   BDUMODIF(@15),X'41'                                 0481 00114000
         BE    @RT00481                                            0481 00115000
         CLI   BDUMODIF(@15),X'42'                                 0481 00116000
         BE    @RT00481                                            0481 00117000
         CLI   BDUMODIF(@15),X'44'                                 0481 00118000
         BE    @RT00481                                            0481 00119000
         CLI   BDUMODIF(@15),X'48'                                 0481 00120000
         BE    @RT00481                                            0481 00121000
         CLI   BDUMODIF(@15),X'43'                                 0481 00122000
         BE    @RT00481                                            0481 00123000
         CLI   BDUMODIF(@15),X'50'                                 0481 00124000
         BE    @RT00481                                            0481 00125000
         CLI   BDUMODIF(@15),X'60'                                 0481 00126000
         BNE   @RF00481                                            0481 00127000
@RT00481 DS    0H                                                  0482 00128000
*FBBDO010:                                                         0482 00129000
*         DO;                       /* YES,                  @XL03HEK*/ 00130000
FBBDO010 DS    0H                                                  0483 00131000
*           CALL ISTZIFNB;          /* RESET COMMAND COMPLETION    0483 00132000
*                                      PROCESSOR             @XL03HEK*/ 00133000
         L     @15,ZRCZIFNB(,RCVTREG)                              0483 00134000
         BALR  @14,@15                                             0483 00135000
*           RFY                                                    0484 00136000
*             RCDREG RSTD;          /*                       @XL03HEK*/ 00137000
*           RCDREG=ZCRSRCHQ;        /* SET RC: CHECK PAB WEQ FOR FSBS   00138000
*                                                            @XL03HDP*/ 00139000
         LA    RCDREG,16                                           0485 00140000
*           RFY                                                    0486 00141000
*             RCDREG UNRSTD;        /*                       @XL03HEK*/ 00142000
*         END FBBDO010;             /*                       @XL03HEK*/ 00143000
*       ELSE                        /* NOT RESET MODIF       @XL03HEK*/ 00144000
*FBBDO020:                                                         0488 00145000
*         DO;                       /*                       @XL03HEK*/ 00146000
         B     @RC00481                                            0488 00147000
@RF00481 DS    0H                                                  0488 00148000
FBBDO020 DS    0H                                                  0489 00149000
*           IF ELEMREG=0&           /* IF NO LCPB            @ZA20821*/ 00150000
*               (BDUMODIF=BMODZSMM| /* COMMAND IS SETMODE@ZA20821    */ 00151000
*               BDUMODIF=BMODZBHM)  /* OR MODIFY BHSET       @ZA20821*/ 00152000
*             THEN                                                 0489 00153000
         LTR   ELEMREG,ELEMREG                                     0489 00154000
         BNZ   @RF00489                                            0489 00155000
         LA    @15,62                                              0489 00156000
         ALR   @15,BFRREG                                          0489 00157000
         CLI   BDUMODIF(@15),X'9A'                                 0489 00158000
         BE    @RT00489                                            0489 00159000
         CLI   BDUMODIF(@15),X'8D'                                 0489 00160000
         BNE   @RF00489                                            0489 00161000
@RT00489 DS    0H                                                  0490 00162000
*             DO;                   /* THEN DO THIS          @ZA20821*/ 00163000
*               IF BDUMODIF=BMODZSMM/* IF SETMODE            @ZA20821*/ 00164000
*                 THEN                                             0491 00165000
         CLI   BDUMODIF+62(BFRREG),X'9A'                           0491 00166000
         BNE   @RF00491                                            0491 00167000
*                 DNCMODE=ADDR(FMCPROCD)->PROSETMS;/*        @ZA20821   00168000
*                                      COPY SETMODE BYTES FROM FMCB     00169000
*                                      TO DNCB               @ZA20821*/ 00170000
         MVC   DNCMODE(3,DNCBREG),PROSETMS+48(FMCBREG)             0492 00171000
*               ELSE                                               0493 00172000
*                 DNCBHSET=FMCBHSET;/* COPY BHSET FROM FMCB TO DNCB     00173000
*                                                            @ZA20821*/ 00174000
         B     @RC00491                                            0493 00175000
@RF00491 MVC   DNCBHSET(1,DNCBREG),FMCBHSET(FMCBREG)               0493 00176000
*               ZCRPCOD1='00'X;     /* CLEAR ZDFBO PARM BYTE @ZA20821*/ 00177000
@RC00491 L     @15,RPHCRR(,RPHREG)                                 0494 00178000
         L     @15,CRACRR(,@15)                                    0494 00179000
         MVI   ZCRPCOD1(@15),X'00'                                 0494 00180000
*               ZCRPBUF=ON;         /* INDICATE REL BUF      @ZA20821*/ 00181000
         OI    ZCRPBUF(@15),B'00000100'                            0495 00182000
*               ELEMREG=BFRREG;     /* PASS BUFFER ADDR TO ZDFB0   0496 00183000
*                                                            @ZA20821*/ 00184000
         LR    ELEMREG,BFRREG                                      0496 00185000
*               CALL ISTZDFB0;      /* RELEASE BUFFER        @ZA20821*/ 00186000
         L     @14,ATCZPSVT(,ATCVTREG)                             0497 00187000
         L     @15,ZPSZDFB0(,@14)                                  0497 00188000
         BALR  @14,@15                                             0497 00189000
*               ELEMREG=0;          /* RESTORE ELEM PTR      @ZA20821*/ 00190000
         SLR   ELEMREG,ELEMREG                                     0498 00191000
*             END;                  /*                       @ZA20821*/ 00192000
*           ELSE                                                   0500 00193000
*             DO;                   /* NOT SETMODE OR MODIFY BHSET 0500 00194000
*                                      WITH NO LCPB@ZA20821          */ 00195000
*                                                                  0500 00196000
         B     @RC00489                                            0500 00197000
@RF00489 DS    0H                                                  0501 00198000
*               /*****************************************************/ 00199000
*               /*                                                   */ 00200000
*               /* DEQUE THE FSB FROM LSCB FSB QUEUE                 */ 00201000
*               /*                                                   */ 00202000
*               /*****************************************************/ 00203000
*                                                                  0501 00204000
*/* TPDEQ (,LSCFDBA)                                                 */ 00205000
*                                                                  0501 00206000
*               DO;                 /* BEGIN TPDEQ CODE GENERATION   */ 00207000
*                 DCL                                              0502 00208000
*                   FMZCA013 BIT(32) CONSTANT('80000000'X);        0502 00209000
*                 DCL                                              0503 00210000
*                   FMZCB013 BIT(32) CONSTANT('7FFFFFFF'X);        0503 00211000
*                 DCL                                              0504 00212000
*                   GPR00F FIXED(31) REG(00);                      0504 00213000
*                 DCL                                              0505 00214000
*                   GPR00P PTR(31) REG(00);                        0505 00215000
*                 DCL                                              0506 00216000
*                   GPR15F FIXED(31) REG(15);                      0506 00217000
*                 DCL                                              0507 00218000
*                   GPR15P PTR(31) REG(15);                        0507 00219000
*                 RFY                                              0508 00220000
*                  (GPR00P,                                        0508 00221000
*                   GPR01P,                                        0508 00222000
*                   GPR14P,                                        0508 00223000
*                   GPR15P) RSTD;                                  0508 00224000
*                 RFY                                              0509 00225000
*                   ISTWKE;                                        0509 00226000
*                 GPR15P=ADDR(LSCFDBA);/* ADDRESS QUEUE POINTER      */ 00227000
         LA    GPR15P,LSCFDBA(,ELEMREG)                            0510 00228000
*                 GPR14P=GPR15P->PABWEQA|FMZCA013;                 0511 00229000
         L     @11,@CF01797                                        0511 00230000
         L     GPR14P,PABWEQA(,GPR15P)                             0511 00231000
         OR    GPR14P,@11                                          0511 00232000
*                 IF GPR14P=FMZCA013 THEN                          0512 00233000
         CLR   GPR14P,@11                                          0512 00234000
         BE    @RT00512                                            0512 00235000
*                   ;                                              0513 00236000
*                 ELSE                                             0514 00237000
*                   DO;                                            0514 00238000
*FMZL1013:                                                         0515 00239000
*                     ;                                            0515 00240000
FMZL1013 DS    0H                                                  0516 00241000
*                     DO WHILE(GPR14P->WKECHAIN^=FMZCA013);        0516 00242000
         B     @DE00516                                            0516 00243000
@DL00516 DS    0H                                                  0517 00244000
*                       GPR15P=ADDR(GPR14P->WKECHAIN);             0517 00245000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0517 00246000
*                       GPR14P=GPR15P->PABWEQA;                    0518 00247000
         L     GPR14P,PABWEQA(,GPR15P)                             0518 00248000
*                     END;                                         0519 00249000
@DE00516 L     @11,@CF01797                                        0519 00250000
         CL    @11,WKECHAIN(,GPR14P)                               0519 00251000
         BNE   @DL00516                                            0519 00252000
*                     GPR00P=FMZCA013;                             0520 00253000
         LR    GPR00P,@11                                          0520 00254000
*                     CS(GPR14P,GPR00P,GPR15P->PABWEQA);           0521 00255000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0521 00256000
*                     BC(7,FMZL1013);                              0522 00257000
         BC    7,FMZL1013                                          0522 00258000
*                     GPR14P->WKECHAIN=0;                          0523 00259000
         SLR   @11,@11                                             0523 00260000
         ST    @11,WKECHAIN(,GPR14P)                               0523 00261000
*                   END;                                           0524 00262000
*ISTA0013:                                                         0525 00263000
*                 ;                                                0525 00264000
@RT00512 DS    0H                                                  0525 00265000
ISTA0013 DS    0H                                                  0526 00266000
*                 GPR14P=GPR14P&FMZCB013;                          0526 00267000
         N     GPR14P,@CF01795                                     0526 00268000
*                 GPR01P->RPHWEA=GPR14P;                           0527 00269000
         ST    GPR14P,RPHWEA(,GPR01P)                              0527 00270000
*                 RFY                                              0528 00271000
*                  (GPR00P,                                        0528 00272000
*                   GPR01P,                                        0528 00273000
*                   GPR14P,                                        0528 00274000
*                   GPR15P) UNRSTD;                                0528 00275000
*               END;                /* END TPDEQ GENERATION          */ 00276000
*                                                                  0529 00277000
*               /*****************************************************/ 00278000
*               /*                                                   */ 00279000
*               /* CALL FSB INITIALIZATION SUBROUTINE                */ 00280000
*               /* SEGMENT(GFBB00A)REQUEST                           */ 00281000
*               /*                                                   */ 00282000
*               /*****************************************************/ 00283000
*                                                                  0530 00284000
*               DO;                                                0530 00285000
*                 GOTO GFBB00A;                                    0531 00286000
         B     GFBB00A                                             0531 00287000
*GFBB00A#:                                                         0532 00288000
*               END;                                               0532 00289000
*                                                                  0532 00290000
GFBB00A# DS    0H                                                  0533 00291000
*               /*****************************************************/ 00292000
*               /*                                                   */ 00293000
*               /* IS LOGICAL ERROR INDICATED IN FSB MAJOR RETURN    */ 00294000
*               /* CODE                                              */ 00295000
*               /*                                                   */ 00296000
*               /*****************************************************/ 00297000
*                                                                  0533 00298000
*               IF FSBMJRCD=FRLOGICE THEN/* LOGICAL ERROR            */ 00299000
*                                                                  0533 00300000
         CLI   FSBMJRCD+16(BFRREG),X'08'                           0533 00301000
         BNE   @RF00533                                            0533 00302000
*                 /***************************************************/ 00303000
*                 /*                                                 */ 00304000
*                 /* CALL LOGICAL ERROR RECOVERY ROUTINE             */ 00305000
*                 /*                                                 */ 00306000
*                 /***************************************************/ 00307000
*                                                                  0534 00308000
*                 CALL ISTZIFIB;                                   0534 00309000
         L     @15,ZRCZIFIB(,RCVTREG)                              0534 00310000
         BALR  @14,@15                                             0534 00311000
*               ELSE                                               0535 00312000
*                 ;                 /* NOT LOGICAL ERROR     @XL03HDP*/ 00313000
*                                                                  0535 00314000
@RF00533 DS    0H                                                  0536 00315000
*               /*****************************************************/ 00316000
*               /*                                                   */ 00317000
*               /* IF LOGICAL ERROR IS NOT INDICATED AND LCCW IS     */ 00318000
*               /* COMMAND CHAINED WITH NO FEEDBACK REQUESTED,       */ 00319000
*               /* RELEASE BUFFER VIA BUFFER DEALLOCATION. ELSE QUEUE*/ 00320000
*               /* THE FSB TO THE CONTROL LAYER INBOUND PAB (CLIP).  */ 00321000
*               /*                                                   */ 00322000
*               /*****************************************************/ 00323000
*                                                                  0536 00324000
*               IF(FSBMJRCD^=FRLOGICE)/* NOT LOGICAL ERROR           */ 00325000
*                   &(LCCWCC=ON)    /* COMMAND CHAINED               */ 00326000
*                   &(LCCWRFI=OFF)  /* NO FEEDBACK REQUESTED         */ 00327000
*                 THEN                                             0536 00328000
         CLI   FSBMJRCD+16(BFRREG),X'08'                           0536 00329000
         BE    @RF00536                                            0536 00330000
         L     @15,LSCLCCWA(,ELEMREG)                              0536 00331000
         TM    LCCWCC(@15),B'01000000'                             0536 00332000
         BNO   @RF00536                                            0536 00333000
         TM    LCCWRFI(@15),B'00000010'                            0536 00334000
         BNZ   @RF00536                                            0536 00335000
*                 DO;               /* RELEASE THE BUFFER            */ 00336000
*                   WKREGB=ELEMREG; /* SAVE ELEMENT ADDRESS          */ 00337000
         LR    WKREGB,ELEMREG                                      0538 00338000
*                   ZCRPCOD1='00'X; /* ZERO REQUEST BITS             */ 00339000
         L     @15,RPHCRR(,RPHREG)                                 0539 00340000
         L     @15,CRACRR(,@15)                                    0539 00341000
         MVI   ZCRPCOD1(@15),X'00'                                 0539 00342000
*                   ZCRPBUF=ON;     /* REQUEST BUFFER RELEASE        */ 00343000
         OI    ZCRPBUF(@15),B'00000100'                            0540 00344000
*                   ELEMREG=BFRREG; /* LOAD BUFFER ADDRESS           */ 00345000
*                                                                  0541 00346000
         LR    ELEMREG,BFRREG                                      0541 00347000
*                   /*************************************************/ 00348000
*                   /*                                               */ 00349000
*                   /* CALL TPIOS BUFFER DEALLOCATION ROUTINE        */ 00350000
*                   /*                                               */ 00351000
*                   /*************************************************/ 00352000
*                                                                  0542 00353000
*                   CALL ISTZDFB0;                                 0542 00354000
         L     @14,ATCZPSVT(,ATCVTREG)                             0542 00355000
         L     @15,ZPSZDFB0(,@14)                                  0542 00356000
         BALR  @14,@15                                             0542 00357000
*                   ELEMREG=WKREGB; /* RESTORE ELEMENT ADDRESS       */ 00358000
         LR    ELEMREG,WKREGB                                      0543 00359000
*                 END;                                             0544 00360000
*               ELSE                /* CANT RELEASE BUFFER           */ 00361000
*                 DO;               /* QUEUE FSB TO CLIP             */ 00362000
         B     @RC00536                                            0545 00363000
@RF00536 DS    0H                                                  0546 00364000
*                   ZIBFDBS=ZIBFDBZ;/* MOVE TPIOS FDB TO SYSTEM FDB  */ 00365000
         MVC   ZIBFDBS(12,BFRREG),ZIBFDBZ(BFRREG)                  0546 00366000
*                   ADDR(ZIBFDBS)->FDBOFSET=LENGTH(ZIBAIOCM)+LENGTH(    00367000
*                       ZIBFSB);    /* UPDATE FDB OFFSET             */ 00368000
*                                                                  0547 00369000
         LA    @15,48                                              0547 00370000
         LR    @14,BFRREG                                          0547 00371000
         ALR   @14,@15                                             0547 00372000
         STH   @15,FDBOFSET(,@14)                                  0547 00373000
*                   /*************************************************/ 00374000
*                   /*                                               */ 00375000
*                   /* QUEUE FSB TO CONTROL LAYER INBOUND PAB        */ 00376000
*                   /*                                               */ 00377000
*                   /*************************************************/ 00378000
*                                                                  0548 00379000
*/*  TPQUE (ADDR(ZIBFSB),FMCPAB2) NORM                               */ 00380000
*                                                                  0548 00381000
*                   DO;                                            0548 00382000
*                     DCL                                          0549 00383000
*                       GPR04F FIXED(31) REG(04);                  0549 00384000
*                     DCL                                          0550 00385000
*                       GPR04P PTR(31) REG(04);                    0550 00386000
*                     DCL                                          0551 00387000
*                       GPR05F FIXED(31) REG(05);                  0551 00388000
*                     DCL                                          0552 00389000
*                       GPR05P PTR(31) REG(05);                    0552 00390000
*                     RFY                                          0553 00391000
*                      (GPR00P,                                    0553 00392000
*                       GPR01P,                                    0553 00393000
*                       GPR04P,                                    0553 00394000
*                       GPR05P,                                    0553 00395000
*                       GPR15P) RSTD;                              0553 00396000
*                     DCL                                          0554 00397000
*                       GPR02F FIXED(31) REG(02);                  0554 00398000
*                     DCL                                          0555 00399000
*                       GPR02P PTR(31) REG(02);                    0555 00400000
*                     DCL                                          0556 00401000
*                       GPR08F FIXED(31) REG(08);                  0556 00402000
*                     DCL                                          0557 00403000
*                       GPR08P PTR(31) REG(08);                    0557 00404000
*                     GEN REFS(GPR01P) SETS(RPHWORK)               0558 00405000
*                         (STM GPR02P,GPR08P,RPHWORK(GPR01P));     0558 00406000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00407000
*                     GPR00P=0;                                    0559 00408000
         SLR   GPR00P,GPR00P                                       0559 00409000
*                     GPR15P=ADDR(FMCPAB2);/* HOLD PAB PTR           */ 00410000
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0560 00411000
*                     GPR04P=ADDR(ZIBFSB);/* WORK ELE PTR            */ 00412000
         LA    GPR04P,ZIBFSB(,BFRREG)                              0561 00413000
*                     GPR05P=GPR15P;/* PASS PAB PTR                  */ 00414000
         LR    GPR05P,GPR15P                                       0562 00415000
*                     CALL ATCLCPTR->ATCAP37->ISTAPC37;            0563 00416000
         L     @14,ATCLCPTR                                        0563 00417000
         L     @15,ATCAP37(,@14)                                   0563 00418000
         BALR  @14,@15                                             0563 00419000
*                     GEN(NOPR  0)                                 0564 00420000
*                     NOSETS NOREFS;                               0564 00421000
         NOPR  0                                                        00422000
*                     RFY                                          0565 00423000
*                      (GPR00P,                                    0565 00424000
*                       GPR01P,                                    0565 00425000
*                       GPR04P,                                    0565 00426000
*                       GPR05P,                                    0565 00427000
*                       GPR15P) UNRSTD;                            0565 00428000
*                   END;            /* *** END OF TPQUE GENERATION   */ 00429000
*                 END;                                             0567 00430000
*                                                                  0567 00431000
*               /*****************************************************/ 00432000
*               /*                                                   */ 00433000
*               /* CALL SUBROUTINE TO ANALYZE END STATE AND SET      */ 00434000
*               /* RETURN CODE SEGMENT(GFBB00C)REQUEST               */ 00435000
*               /*                                                   */ 00436000
*               /*****************************************************/ 00437000
*                                                                  0568 00438000
*               DO;                                                0568 00439000
@RC00536 DS    0H                                                  0569 00440000
*                 GOTO GFBB00C;                                    0569 00441000
         B     GFBB00C                                             0569 00442000
*GFBB00C#:                                                         0570 00443000
*               END;                                               0570 00444000
GFBB00C# DS    0H                                                  0571 00445000
*             END;                  /*                       @ZA20821*/ 00446000
*         END FBBDO020;             /*                       @XL03HEK*/ 00447000
@RC00489 DS    0H                                                  0573 00448000
*     END;                                                         0573 00449000
@RC00481 DS    0H                                                  0574 00450000
*   RFY                                                            0574 00451000
*     RCDREG RSTD;                  /* RESTRICT RETURNED CODE        */ 00452000
*                                                                  0574 00453000
@RC00478 DS    0H                                                  0575 00454000
*   /*****************************************************************/ 00455000
*   /*                                                               */ 00456000
*   /* RESTORE REGISTERS AND RETURN TO CALLER                        */ 00457000
*   /*                                                               */ 00458000
*   /*****************************************************************/ 00459000
*                                                                  0575 00460000
*/* TPZRETN                                                          */ 00461000
*                                                                  0575 00462000
*   DO;                                                            0575 00463000
*     DCL                                                          0576 00464000
*       GPR07F FIXED(31) REG(07);                                  0576 00465000
*     DCL                                                          0577 00466000
*       GPR07P PTR(31) REG(07);                                    0577 00467000
*     RFY                                                          0578 00468000
*      (GPR07P,                                                    0578 00469000
*       GPR14P,                                                    0578 00470000
*       GPR15P) RSTD;                                              0578 00471000
*     GPR13P=ZSAZSVBC;                                             0579 00472000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0579 00473000
*     IF GPR13P=0 THEN                                             0580 00474000
         LTR   GPR13P,GPR13P                                       0580 00475000
         BZ    @RT00580                                            0580 00476000
*       ;                           /* TPDVTS ISTZFARR               */ 00477000
*     ELSE                                                         0582 00478000
*       GPR14P=ZSAZSVRR;                                           0582 00479000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0582 00480000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0583 00481000
@RT00580 DS    0H                                                  0583 00482000
         LM    7,12,ZSAZSVVR+0(13)                                      00483000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0584 00484000
         BR    GPR14P                                                   00485000
*     RFY                                                          0585 00486000
*      (GPR07P,                                                    0585 00487000
*       GPR14P,                                                    0585 00488000
*       GPR15P) UNRSTD;                                            0585 00489000
*   END;                                                           0586 00490000
*                                                                  0586 00491000
*/* END TPZRETN                                                      */ 00492000
*                                                                  0587 00493000
*   RFY                                                            0587 00494000
*     RCDREG UNRSTD;                /* FREE REG 15                   */ 00495000
*                                                                  0588 00496000
*   /*****************************************************************/ 00497000
*   /*                                                               */ 00498000
*   /* GFBB000A - INITIALIZE FSB . . . THE FSB JUST DEQUEUED FROM THE*/ 00499000
*   /* ELEMENT FSB QUEUE IS INITIALIZED BY THIS ROUTINE PRIOR TO     */ 00500000
*   /* FURTHER MAINLINE PROCESSING                                   */ 00501000
*   /*                                                               */ 00502000
*   /*****************************************************************/ 00503000
*                                                                  0588 00504000
*GFBB000A:                                                         0588 00505000
*   ;                                                              0588 00506000
*                                                                  0588 00507000
GFBB000A DS    0H                                                  0589 00508000
*   /*****************************************************************/ 00509000
*   /*                                                               */ 00510000
*   /* SEGMENT(GFBB00A)START                                         */ 00511000
*   /*                                                               */ 00512000
*   /*****************************************************************/ 00513000
*                                                                  0589 00514000
*   DO;                                                            0589 00515000
*     GOTO GFBB00A@;                                               0590 00516000
         B     GFBB00A@                                            0590 00517000
*GFBB00A:                                                          0591 00518000
*   END;                                                           0591 00519000
*                                                                  0591 00520000
GFBB00A  DS    0H                                                  0592 00521000
*   /*****************************************************************/ 00522000
*   /*                                                               */ 00523000
*   /* SET LCPB ADDRESS IN FSB                                       */ 00524000
*   /*                                                               */ 00525000
*   /*****************************************************************/ 00526000
*                                                                  0592 00527000
*   IF LSCTYPE=LSTYPE THEN          /* IF ELEMENT IS LSCB -          */ 00528000
         CLI   LSCTYPE(ELEMREG),X'DF'                              0592 00529000
         BNE   @RF00592                                            0592 00530000
*     FSBLCPB=LSCLCPBA;             /* MOVE LCPB ADDRESS             */ 00531000
         MVC   FSBLCPB+16(4,BFRREG),LSCLCPBA(ELEMREG)              0593 00532000
*   ELSE                            /* ELEMENT IS AN LCPB -          */ 00533000
*     FSBLCPB=ELEMREG;              /* STORE LCPB ADDRESS            */ 00534000
         B     @RC00592                                            0594 00535000
@RF00592 ST    ELEMREG,FSBLCPB+16(,BFRREG)                         0594 00536000
*   FSBLCCWA=LSCLCCWA;              /* SET LCCW ADDR IN FSB          */ 00537000
@RC00592 LA    @15,16                                              0595 00538000
         ALR   @15,BFRREG                                          0595 00539000
         MVC   FSBLCCWA(4,@15),LSCLCCWA(ELEMREG)                   0595 00540000
*   FSBSAF=BTUSORCE;                /* SET SOURCE ADDR IN FSB        */ 00541000
         LA    @14,48                                              0596 00542000
         ALR   @14,BFRREG                                          0596 00543000
         MVC   FSBSAF(2,@15),BTUSORCE(@14)                         0596 00544000
*   FSBDAF=BTUDEST;                 /* SET DESTINATION ADDR IN FSB   */ 00545000
*                                                                  0597 00546000
         MVC   FSBDAF(2,@15),BTUDEST(@14)                          0597 00547000
*   /*****************************************************************/ 00548000
*   /*                                                               */ 00549000
*   /* IF FSB INDICATES ERROR OR PHASE 3 RESPONSE, INDICATE LAST FSB */ 00550000
*   /* FOR ELEMENT                                                   */ 00551000
*   /*                                                               */ 00552000
*   /*****************************************************************/ 00553000
*                                                                  0598 00554000
*   IF FSBSERR=ON                   /* ERROR RESPONSE                */ 00555000
*       |FSBSPHSE=NCPPHSE3          /* PHASE 3 RESPONSE              */ 00556000
*     THEN                                                         0598 00557000
         TM    FSBSERR(@15),B'10000000'                            0598 00558000
         BO    @RT00598                                            0598 00559000
         TM    FSBSPHSE(@15),B'01100000'                           0598 00560000
         BNO   @RF00598                                            0598 00561000
@RT00598 DS    0H                                                  0599 00562000
*     ZCRLSTFB=ON;                  /* INDICATE LAST FSB FOR ELEM    */ 00563000
         L     @15,RPHCRR(,RPHREG)                                 0599 00564000
         L     @15,CRACRR(,@15)                                    0599 00565000
         OI    ZCRLSTFB(@15),B'00000100'                           0599 00566000
*   ELSE                            /* NOT ERROR OR PHASE 3          */ 00567000
*     ZCRLSTFB=OFF;                 /* INDICATE NOT LAST FSB         */ 00568000
*                                                                  0600 00569000
         B     @RC00598                                            0600 00570000
@RF00598 L     @15,RPHCRR(,RPHREG)                                 0600 00571000
         L     @15,CRACRR(,@15)                                    0600 00572000
         NI    ZCRLSTFB(@15),B'11111011'                           0600 00573000
*   /*****************************************************************/ 00574000
*   /*                                                               */ 00575000
*   /* IF MAJOR RETURN CODE INDICATES NO LOGICAL ERROR AND FSB IS    */ 00576000
*   /* LAST FSB FOR ELEMENT, COMPLETE INITIALIZATION                 */ 00577000
*   /*                                                               */ 00578000
*   /*****************************************************************/ 00579000
*                                                                  0601 00580000
*   IF FSBMJRCD=FRLOGICE            /* LOGICAL ERROR -               */ 00581000
*       |ZCRLSTFB=OFF THEN                                         0601 00582000
@RC00598 CLI   FSBMJRCD+16(BFRREG),X'08'                           0601 00583000
         BE    @RT00601                                            0601 00584000
         L     @15,RPHCRR(,RPHREG)                                 0601 00585000
         L     @15,CRACRR(,@15)                                    0601 00586000
         TM    ZCRLSTFB(@15),B'00000100'                           0601 00587000
         BZ    @RT00601                                            0601 00588000
*     ;                             /* OR NOT LAST - NULL            */ 00589000
*   ELSE                                                           0603 00590000
*     DO;                           /* NO ERROR AND NOT LAST         */ 00591000
*       FSBECI=ON;                  /* LAST FSB FOR LCCW             */ 00592000
*                                                                  0604 00593000
         OI    FSBECI+16(BFRREG),B'01000000'                       0604 00594000
*       /*************************************************************/ 00595000
*       /*                                                           */ 00596000
*       /* IF ELEMENT IS AN LCPB OR ELEMENT IS AN LSCB AND LCCW IS   */ 00597000
*       /* NOT COMMAND CHAINED, INDICATE LAST FSB FOR LCP            */ 00598000
*       /*                                                           */ 00599000
*       /*************************************************************/ 00600000
*                                                                  0605 00601000
*       IF LSCTYPE=LSTYPE THEN      /* ELEMENT IS AN LSCB            */ 00602000
*                                                                  0605 00603000
         CLI   LSCTYPE(ELEMREG),X'DF'                              0605 00604000
         BNE   @RF00605                                            0605 00605000
*         /***********************************************************/ 00606000
*         /*                                                         */ 00607000
*         /* SET FSB AS LAST FOR LCP IF LCCW IS NOT COMMAND CHAINED  */ 00608000
*         /*                                                         */ 00609000
*         /***********************************************************/ 00610000
*                                                                  0606 00611000
*         IF LCCWCC=ON THEN                                        0606 00612000
         L     @15,LSCLCCWA(,ELEMREG)                              0606 00613000
         TM    LCCWCC(@15),B'01000000'                             0606 00614000
         BO    @RT00606                                            0606 00615000
*           ;                       /* COMMAND CHAINED - NULL        */ 00616000
*         ELSE                      /* NOT COMMAND CHAINED -         */ 00617000
*           FSBELI=ON;              /* LAST FSB FOR LCP              */ 00618000
         OI    FSBELI+16(BFRREG),B'10000000'                       0608 00619000
*       ELSE                        /* ELEMENT IS AN LCPB            */ 00620000
*         FSBELI=ON;                /* LAST FSB FOR LCP              */ 00621000
         B     @RC00605                                            0609 00622000
@RF00605 OI    FSBELI+16(BFRREG),B'10000000'                       0609 00623000
*     END;                                                         0610 00624000
*                                                                  0610 00625000
@RC00605 DS    0H                                                  0611 00626000
*   /*****************************************************************/ 00627000
*   /*                                                               */ 00628000
*   /* SEGMENT(GFBB00A)FINISH                                        */ 00629000
*   /*                                                               */ 00630000
*   /*****************************************************************/ 00631000
*                                                                  0611 00632000
*   DO;                                                            0611 00633000
@RT00601 DS    0H                                                  0612 00634000
*     GOTO GFBB00A#;                                               0612 00635000
         B     GFBB00A#                                            0612 00636000
*GFBB00A@:                                                         0613 00637000
*   END;                                                           0613 00638000
GFBB00A@ DS    0H                                                  0614 00639000
*                                                                  0614 00640000
*/*  SUBRTN GFBB000B DELETED                    @XL03HDP             */ 00641000
*                                                                  0614 00642000
*   /*****************************************************************/ 00643000
*   /*                                                               */ 00644000
*   /* GFBB000C - ANALYZE END STATE AND SET RETURN CODE              */ 00645000
*   /*                                                               */ 00646000
*   /*****************************************************************/ 00647000
*                                                                  0614 00648000
*GFBB000C:                                                         0614 00649000
*   ;                                                              0614 00650000
*                                                                  0614 00651000
GFBB000C DS    0H                                                  0615 00652000
*   /*****************************************************************/ 00653000
*   /*                                                               */ 00654000
*   /* SEGMENT(GFBB00C)START                                         */ 00655000
*   /*                                                               */ 00656000
*   /*****************************************************************/ 00657000
*                                                                  0615 00658000
*   DO;                                                            0615 00659000
*     GOTO GFBB00C@;                                               0616 00660000
         B     GFBB00C@                                            0616 00661000
*GFBB00C:                                                          0617 00662000
*   END;                                                           0617 00663000
GFBB00C  DS    0H                                                  0618 00664000
*   RFY                                                            0618 00665000
*     RCDREG RSTD;                  /* RESTRICT RETURN CODE REG      */ 00666000
*                                                                  0618 00667000
*   /*****************************************************************/ 00668000
*   /*                                                               */ 00669000
*   /* IF LAST FSB FOR ELEMENT, DEQUEUE ELEMENT FROM FMCB WAIT QUEUE.*/ 00670000
*   /* IF ELEMENT IS AN LSCB, DEALLOCATE VIA LSCB DEALLOCATION       */ 00671000
*   /* ROUTINE                                                       */ 00672000
*   /*                                                               */ 00673000
*   /*****************************************************************/ 00674000
*                                                                  0619 00675000
*   IF ZCRLSTFB=ON THEN             /* LAST FSB FOR ELEMENT          */ 00676000
         L     @14,RPHCRR(,RPHREG)                                 0619 00677000
         L     @14,CRACRR(,@14)                                    0619 00678000
         TM    ZCRLSTFB(@14),B'00000100'                           0619 00679000
         BNO   @RF00619                                            0619 00680000
*     DO;                                                          0620 00681000
*                                                                  0620 00682000
*       /*************************************************************/ 00683000
*       /*                                                           */ 00684000
*       /* DEQUEUE ELEMENT FROM FMCB WAIT QUEUE                      */ 00685000
*       /*                                                           */ 00686000
*       /*************************************************************/ 00687000
*                                                                  0621 00688000
*/* TPDEQ (,FMCLCPBQ)                                                */ 00689000
*                                                                  0621 00690000
*       DO;                         /* BEGIN TPDEQ CODE GENERATION   */ 00691000
*         RFY                                                      0622 00692000
*          (GPR00P,                                                0622 00693000
*           GPR01P,                                                0622 00694000
*           GPR14P,                                                0622 00695000
*           GPR15P) RSTD;                                          0622 00696000
*         GPR15P=ADDR(FMCLCPBQ);    /* ADDRESS QUEUE POINTER         */ 00697000
         LA    GPR15P,FMCLCPBQ(,FMCBREG)                           0623 00698000
*         GPR14P=GPR15P->PABWEQA|FMZCA013;                         0624 00699000
         L     @11,@CF01797                                        0624 00700000
         L     GPR14P,PABWEQA(,GPR15P)                             0624 00701000
         OR    GPR14P,@11                                          0624 00702000
*         IF GPR14P=FMZCA013 THEN                                  0625 00703000
         CLR   GPR14P,@11                                          0625 00704000
         BE    @RT00625                                            0625 00705000
*           ;                                                      0626 00706000
*         ELSE                                                     0627 00707000
*           DO;                                                    0627 00708000
*FMZL1031:                                                         0628 00709000
*             ;                                                    0628 00710000
FMZL1031 DS    0H                                                  0629 00711000
*             DO WHILE(GPR14P->WKECHAIN^=FMZCA013);                0629 00712000
         B     @DE00629                                            0629 00713000
@DL00629 DS    0H                                                  0630 00714000
*               GPR15P=ADDR(GPR14P->WKECHAIN);                     0630 00715000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0630 00716000
*               GPR14P=GPR15P->PABWEQA;                            0631 00717000
         L     GPR14P,PABWEQA(,GPR15P)                             0631 00718000
*             END;                                                 0632 00719000
@DE00629 L     @11,@CF01797                                        0632 00720000
         CL    @11,WKECHAIN(,GPR14P)                               0632 00721000
         BNE   @DL00629                                            0632 00722000
*             GPR00P=FMZCA013;                                     0633 00723000
         LR    GPR00P,@11                                          0633 00724000
*             CS(GPR14P,GPR00P,GPR15P->PABWEQA);                   0634 00725000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0634 00726000
*             BC(7,FMZL1031);                                      0635 00727000
         BC    7,FMZL1031                                          0635 00728000
*             GPR14P->WKECHAIN=0;                                  0636 00729000
         SLR   @11,@11                                             0636 00730000
         ST    @11,WKECHAIN(,GPR14P)                               0636 00731000
*           END;                                                   0637 00732000
*ISTA0031:                                                         0638 00733000
*         ;                                                        0638 00734000
@RT00625 DS    0H                                                  0638 00735000
ISTA0031 DS    0H                                                  0639 00736000
*         GPR14P=GPR14P&FMZCB013;                                  0639 00737000
         N     GPR14P,@CF01795                                     0639 00738000
*         GPR01P->RPHWEA=GPR14P;                                   0640 00739000
         ST    GPR14P,RPHWEA(,GPR01P)                              0640 00740000
*         RFY                                                      0641 00741000
*          (GPR00P,                                                0641 00742000
*           GPR01P,                                                0641 00743000
*           GPR14P,                                                0641 00744000
*           GPR15P) UNRSTD;                                        0641 00745000
*       END;                        /* END TPDEQ GENERATION          */ 00746000
*                                                                  0642 00747000
*       /*************************************************************/ 00748000
*       /*                                                           */ 00749000
*       /* IF ELEMENT IS AN LSCB, DEALLOCATE                         */ 00750000
*       /*                                                           */ 00751000
*       /*************************************************************/ 00752000
*                                                                  0643 00753000
*       IF LSCTYPE=LSTYPE THEN      /* ELEMENT IS LSCB               */ 00754000
         CLI   LSCTYPE(ELEMREG),X'DF'                              0643 00755000
         BNE   @RF00643                                            0643 00756000
*         DO;                                                      0644 00757000
*           ZCRPCOD1='00'X;         /* ZERO REQUEST FLAGS            */ 00758000
         L     @14,RPHCRR(,RPHREG)                                 0645 00759000
         L     @14,CRACRR(,@14)                                    0645 00760000
         MVI   ZCRPCOD1(@14),X'00'                                 0645 00761000
*           ZCRPLSCB=ON;            /* REQUEST LSCB DEALLOCATION     */ 00762000
         OI    ZCRPLSCB(@14),B'00001000'                           0646 00763000
*           CALL ISTZDFB0;          /* CALL LSCB DEALLOCATION ROUTINE*/ 00764000
         L     @14,ATCZPSVT(,ATCVTREG)                             0647 00765000
         L     @15,ZPSZDFB0(,@14)                                  0647 00766000
         BALR  @14,@15                                             0647 00767000
*         END;                                                     0648 00768000
*       ELSE                                                       0649 00769000
*         ;                         /* NOT AN LSCB - NULL            */ 00770000
@RF00643 DS    0H                                                  0650 00771000
*       RCDREG=SERCHQ;              /* RETURN - SEARCH QUEUE FOR WORK*/ 00772000
         LA    RCDREG,16                                           0650 00773000
*     END;                                                         0651 00774000
*   ELSE                            /* NOT LAST FSB FOR ELEMENT      */ 00775000
*                                                                  0652 00776000
*     /***************************************************************/ 00777000
*     /*                                                             */ 00778000
*     /* IF MORE FSBS ON THIS FSB CHAIN, FIND OLDEST VIA TPFEL       */ 00779000
*     /*                                                             */ 00780000
*     /***************************************************************/ 00781000
*                                                                  0652 00782000
*     IF(LSCFDBA&'7FFFFFFF'X)^=0 THEN/* MORE ON THIS QUEUE           */ 00783000
         B     @RC00619                                            0652 00784000
@RF00619 L     @14,LSCFDBA(,ELEMREG)                               0652 00785000
         N     @14,@CF01795                                        0652 00786000
         LTR   @14,@14                                             0652 00787000
         BZ    @RF00652                                            0652 00788000
*       DO;                                                        0653 00789000
*                                                                  0653 00790000
*         /***********************************************************/ 00791000
*         /*                                                         */ 00792000
*         /* FIND OLDSET FSB ON QUEUE                                */ 00793000
*         /*                                                         */ 00794000
*         /***********************************************************/ 00795000
*                                                                  0654 00796000
*/* TPFEL (,LSCFDBA) RETPTR(BFRREG)                                  */ 00797000
*                                                                  0654 00798000
*         DO;                       /* BEGIN TPFEL CODE GENERATION   */ 00799000
*           RFY                                                    0655 00800000
*            (GPR00P,                                              0655 00801000
*             GPR01P,                                              0655 00802000
*             GPR14P,                                              0655 00803000
*             GPR15P) RSTD;                                        0655 00804000
*           GPR15P=ADDR(LSCFDBA);   /* ADDRESS QUEUE POINTER         */ 00805000
         LA    GPR15P,LSCFDBA(,ELEMREG)                            0656 00806000
*           GPR14P=GPR15P->PABWEQA|FMZCA013;                       0657 00807000
         L     @11,@CF01797                                        0657 00808000
         L     GPR14P,PABWEQA(,GPR15P)                             0657 00809000
         OR    GPR14P,@11                                          0657 00810000
*           IF GPR14P=FMZCA013 THEN                                0658 00811000
         CLR   GPR14P,@11                                          0658 00812000
         BE    @RT00658                                            0658 00813000
*             ;                                                    0659 00814000
*           ELSE                                                   0660 00815000
*             DO;                                                  0660 00816000
*               GPR00P=FMZCA013;    /* INITIALIZE QUIT FLAG          */ 00817000
         L     GPR00P,@CF01797                                     0661 00818000
*               DO WHILE(GPR00P^=GPR14P->WKECHAIN);                0662 00819000
         B     @DE00662                                            0662 00820000
@DL00662 DS    0H                                                  0663 00821000
*                 GPR14P=GPR14P->WKECHAIN;/* SEARCH FOR END OF CHAIN */ 00822000
         L     GPR14P,WKECHAIN(,GPR14P)                            0663 00823000
*               END;                                               0664 00824000
@DE00662 C     GPR00P,WKECHAIN(,GPR14P)                            0664 00825000
         BNE   @DL00662                                            0664 00826000
*             END;                                                 0665 00827000
*           GPR14P=GPR14P&FMZCB013;                                0666 00828000
@RT00658 N     GPR14P,@CF01795                                     0666 00829000
*           BFRREG=GPR14P;                                         0667 00830000
         LR    BFRREG,GPR14P                                       0667 00831000
*           RFY                                                    0668 00832000
*            (GPR00P,                                              0668 00833000
*             GPR01P,                                              0668 00834000
*             GPR14P,                                              0668 00835000
*             GPR15P) UNRSTD;                                      0668 00836000
*         END;                      /* END TPFEL GENERATION          */ 00837000
*         BFRREG=BFRREG-LENGTH(ZIBAIOCM);/* POINT TO BUFFER START    */ 00838000
         SH    BFRREG,@CH00057                                     0670 00839000
*         RCDREG=PROCFSB;           /* RETURN - PROCESS FSB          */ 00840000
         LA    RCDREG,12                                           0671 00841000
*       END;                                                       0672 00842000
*     ELSE                          /* NO MORE FSBS ON QUEUE         */ 00843000
*       RCDREG=TIPFSB;              /* RETURN - CHECK TIP WEQ FOR  0673 00844000
*                                      FSBS                          */ 00845000
*                                                                  0673 00846000
         B     @RC00652                                            0673 00847000
@RF00652 LA    RCDREG,20                                           0673 00848000
*   /*****************************************************************/ 00849000
*   /*                                                               */ 00850000
*   /* SEGMENT(GFBB00C)FINISH                                        */ 00851000
*   /*                                                               */ 00852000
*   /*****************************************************************/ 00853000
*                                                                  0674 00854000
*   DO;                                                            0674 00855000
@RC00652 DS    0H                                                  0674 00856000
@RC00619 DS    0H                                                  0675 00857000
*     GOTO GFBB00C#;                                               0675 00858000
         B     GFBB00C#                                            0675 00859000
*GFBB00C@:                                                         0676 00860000
*   END;                                                           0676 00861000
*                                                                  0676 00862000
GFBB00C@ DS    0H                                                  0677 00863000
*/* TPEPILOG                                                         */ 00864000
*                                                                  0677 00865000
*   GEN(PRINT OFF);                                                0677 00866000
         PRINT OFF                                                      00867000
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0678 00868000
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0678 00869000
*        2  * CHAR(4),                 /* SPACE                       * 00870000
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               * 00871000
*           3 WKEFLAGS BIT(8),         /* FLAGS                       * 00872000
*             4 WKEGATE  BIT(1),       /* GATE BIT                    * 00873000
*             4 *        BIT(7),       /* RESERVED                    * 00874000
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 * 00875000
*   DCL                                                            0679 00876000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 00877000
*   DCL                                                            0680 00878000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 00879000
*   GEN(PRINT ON);                                                 0681 00880000
*                                                                  0681 00881000
         PRINT ON                                                       00882000
*/* END OF TPEPILOG                                                  */ 00883000
*                                                                  0682 00884000
*   END ISTZGFBB                    /* END OF MODULE                 */ 00885000
*                                                                  0682 00886000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00887000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00888000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00889000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00890000
*                                                                  0682 00891000
*       ;                                                          0682 00892000
@EL00001 DS    0H                                                  0682 00893000
@EF00001 DS    0H                                                  0682 00894000
@ER00001 BR    @14                                                 0682 00895000
@DATA    DS    0H                                                       00896000
@CH00057 DC    H'16'                                                    00897000
@DATD    DSECT                                                          00898000
         DS    0F                                                       00899000
ISTZGFBB CSECT                                                          00900000
         DS    0F                                                       00901000
@CF01795 DC    XL4'7FFFFFFF'                                            00902000
@CF01797 DC    XL4'80000000'                                            00903000
@DATD    DSECT                                                          00904000
         DS    0D                                                       00905000
CVTPTR   DS    A                                                        00906000
IOSBPTR  DS    A                                                        00907000
SRBPTR   DS    A                                                        00908000
BDUPTR   DS    A                                                        00909000
BTUPTR   DS    A                                                        00910000
FSBPTR   DS    A                                                        00911000
FMCBPTR  DS    A                                                        00912000
LCPBPTR  DS    A                                                        00913000
DNCBPTR  DS    A                                                        00914000
WKEPTR   DS    A                                                        00915000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00916000
@ENDDATD EQU   *                                                        00917000
ISTZGFBB CSECT                                                          00918000
         DS    0F                                                       00919000
@SIZDATD DC    AL1(0)                                                   00920000
         DC    AL3(@ENDDATD-@DATD)                                      00921000
         DS    0D                                                       00922000
@CC04088 DC    C'GCBB'                                                  00923000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00924000
@01      EQU   01                                                       00925000
@02      EQU   02                                                       00926000
@03      EQU   03                                                       00927000
@04      EQU   04                                                       00928000
@05      EQU   05                                                       00929000
@06      EQU   06                                                       00930000
@07      EQU   07                                                       00931000
@08      EQU   08                                                       00932000
@09      EQU   09                                                       00933000
@10      EQU   10                                                       00934000
@11      EQU   11                                                       00935000
@12      EQU   12                                                       00936000
@13      EQU   13                                                       00937000
@14      EQU   14                                                       00938000
@15      EQU   15                                                       00939000
RPHREG   EQU   @01                                                      00940000
ATCVTREG EQU   @02                                                      00941000
ICNCBREG EQU   @03                                                      00942000
DNCBREG  EQU   @04                                                      00943000
FMCBREG  EQU   @05                                                      00944000
BFRREG   EQU   @06                                                      00945000
ELEMREG  EQU   @07                                                      00946000
RCVTREG  EQU   @08                                                      00947000
WKREGA   EQU   @00                                                      00948000
WKREGB   EQU   @09                                                      00949000
R12      EQU   @12                                                      00950000
R13      EQU   @13                                                      00951000
RCDREG   EQU   @15                                                      00952000
RPHPTR   EQU   @01                                                      00953000
GPR01P   EQU   @01                                                      00954000
GPR12P   EQU   @12                                                      00955000
GPR13P   EQU   @13                                                      00956000
GPR14P   EQU   @14                                                      00957000
GPR00P   EQU   @00                                                      00958000
GPR15P   EQU   @15                                                      00959000
GPR04P   EQU   @04                                                      00960000
GPR05P   EQU   @05                                                      00961000
GPR07P   EQU   @07                                                      00962000
GPR00F   EQU   @00                                                      00963000
GPR01F   EQU   @01                                                      00964000
GPR02F   EQU   @02                                                      00965000
GPR02P   EQU   @02                                                      00966000
GPR04F   EQU   @04                                                      00967000
GPR05F   EQU   @05                                                      00968000
GPR07F   EQU   @07                                                      00969000
GPR08F   EQU   @08                                                      00970000
GPR08P   EQU   @08                                                      00971000
GPR12F   EQU   @12                                                      00972000
GPR13F   EQU   @13                                                      00973000
GPR14F   EQU   @14                                                      00974000
GPR15F   EQU   @15                                                      00975000
LNKREG   EQU   @14                                                      00976000
RETNREG  EQU   @14                                                      00977000
ATCLCPTR EQU   1032                                                     00978000
ISTZIFIB EQU   0                                                        00979000
ISTZIFNB EQU   0                                                        00980000
ISTZDFB0 EQU   0                                                        00981000
CVTMAP   EQU   0                                                        00982000
CVTDAR   EQU   CVTMAP+72                                                00983000
CVTFLGS1 EQU   CVTDAR                                                   00984000
CVTDCB   EQU   CVTMAP+116                                               00985000
CVTIERLC EQU   CVTMAP+144                                               00986000
CVTOPTA  EQU   CVTMAP+182                                               00987000
CVTOPTB  EQU   CVTMAP+183                                               00988000
CVTGTF   EQU   CVTMAP+236                                               00989000
CVTGTFST EQU   CVTGTF                                                   00990000
CVTGTFS  EQU   CVTGTFST                                                 00991000
CVTSTATE EQU   CVTGTFST                                                 00992000
CVTTMODE EQU   CVTGTFST                                                 00993000
CVTFORM  EQU   CVTGTFST                                                 00994000
CVTAQAVT EQU   CVTMAP+240                                               00995000
CVTTCMFG EQU   CVTAQAVT                                                 00996000
CVTVOLM2 EQU   CVTMAP+244                                               00997000
CVTTATA  EQU   CVTVOLM2                                                 00998000
CVTTSKS  EQU   CVTTATA                                                  00999000
CVTVOLF2 EQU   CVTTSKS                                                  01000000
CVTTAT   EQU   CVTTATA+1                                                01001000
CVTATER  EQU   CVTMAP+248                                               01002000
CVTEXT1  EQU   CVTMAP+252                                               01003000
CVTPURG  EQU   CVTMAP+260                                               01004000
CVTQMSG  EQU   CVTMAP+268                                               01005000
CVTDMSR  EQU   CVTMAP+272                                               01006000
CVTRSV37 EQU   CVTDMSR                                                  01007000
CVTDMSRF EQU   CVTRSV37                                                 01008000
CVTERPV  EQU   CVTMAP+316                                               01009000
CVTINTLA EQU   CVTMAP+320                                               01010000
CVTAPF   EQU   CVTMAP+324                                               01011000
CVTEXT2  EQU   CVTMAP+328                                               01012000
CVTHJES  EQU   CVTMAP+332                                               01013000
CVTPGSIA EQU   CVTMAP+348                                               01014000
CVTA1F1  EQU   CVTMAP+356                                               01015000
CVTSYSK  EQU   CVTMAP+357                                               01016000
CVTVOLM1 EQU   CVTMAP+380                                               01017000
CVTVOLF1 EQU   CVTVOLM1                                                 01018000
CVTATMCT EQU   CVTMAP+388                                               01019000
CVTXTNT1 EQU   0                                                        01020000
CVTXTNT2 EQU   0                                                        01021000
CVTDSSV  EQU   CVTXTNT2                                                 01022000
CVTFLGBT EQU   CVTXTNT2+5                                               01023000
CVTQID   EQU   CVTXTNT2+24                                              01024000
CVTSHS   EQU   CVTXTNT2+40                                              01025000
CVTRV400 EQU   CVTXTNT2+52                                              01026000
CVTRV409 EQU   CVTXTNT2+53                                              01027000
CVTATCVT EQU   CVTXTNT2+64                                              01028000
CVTRV429 EQU   CVTXTNT2+84                                              01029000
CVTRV438 EQU   CVTXTNT2+85                                              01030000
CVTRV457 EQU   CVTXTNT2+112                                             01031000
CVTRV466 EQU   CVTXTNT2+113                                             01032000
CVTFIX   EQU   0                                                        01033000
CVTRELNO EQU   CVTFIX+252                                               01034000
IOSB     EQU   0                                                        01035000
IOSFLA   EQU   IOSB                                                     01036000
IOSACHN  EQU   IOSFLA                                                   01037000
IOSFLB   EQU   IOSB+1                                                   01038000
IOSFLC   EQU   IOSB+2                                                   01039000
IOSDVALT EQU   IOSFLC                                                   01040000
IOSPKEY  EQU   IOSB+12                                                  01041000
IOSOPT   EQU   IOSB+14                                                  01042000
IOSOPT2  EQU   IOSB+15                                                  01043000
@NM00004 EQU   IOSB+20                                                  01044000
IOSCSW   EQU   @NM00004+1                                               01045000
IOSTATUS EQU   IOSCSW+3                                                 01046000
IOSIPIB  EQU   IOSB+44                                                  01047000
IOSPATH  EQU   IOSB+86                                                  01048000
IOSCHN   EQU   IOSPATH                                                  01049000
IOSCKEY  EQU   IOSB+89                                                  01050000
IOSEEKA  EQU   IOSB+100                                                 01051000
IOSCCHH  EQU   IOSEEKA+3                                                01052000
IOSSKHH  EQU   IOSCCHH+2                                                01053000
SRBSECT  EQU   0                                                        01054000
SRBFLC   EQU   SRBSECT+12                                               01055000
ISTBDU   EQU   0                                                        01056000
BDUMODIF EQU   ISTBDU+1                                                 01057000
BDUMOD1  EQU   BDUMODIF                                                 01058000
BDUDAF   EQU   ISTBDU+2                                                 01059000
BDUFUNC  EQU   BDUDAF                                                   01060000
BDUCHECK EQU   BDUFUNC                                                  01061000
BDUFLAGS EQU   BDUDAF+1                                                 01062000
ISTBTU   EQU   0                                                        01063000
BTUBTH   EQU   ISTBTU                                                   01064000
BTUFID   EQU   BTUBTH                                                   01065000
BTUDEST  EQU   BTUBTH+2                                                 01066000
BTUSORCE EQU   BTUBTH+4                                                 01067000
BTUREQ   EQU   BTUBTH+6                                                 01068000
BTURQFLG EQU   BTUREQ                                                   01069000
BTURH    EQU   BTUBTH+10                                                01070000
BTUBDU   EQU   ISTBTU+14                                                01071000
BTUSYSTR EQU   ISTBTU+18                                                01072000
ISTFDB   EQU   0                                                        01073000
FDBOFSET EQU   ISTFDB+10                                                01074000
ISTFSB   EQU   0                                                        01075000
FSBFSB   EQU   ISTFSB                                                   01076000
FSBMNRCD EQU   FSBFSB+2                                                 01077000
FSBSFLGS EQU   FSBFSB+3                                                 01078000
FSBFSBA  EQU   FSBFSB+4                                                 01079000
FSBBTH   EQU   FSBFSB+8                                                 01080000
FSBCID   EQU   FSBBTH                                                   01081000
FSBSAF   EQU   FSBCID                                                   01082000
FSBDAF   EQU   FSBCID+2                                                 01083000
FSBRQTAG EQU   FSBBTH+4                                                 01084000
FSBSEQID EQU   FSBRQTAG                                                 01085000
FSBFLAGS EQU   FSBSEQID                                                 01086000
FSBSEQ   EQU   FSBSEQID+1                                               01087000
FSBCSWST EQU   FSBBTH+6                                                 01088000
FSBTHFLD EQU   FSBCSWST                                                 01089000
FSBTH1   EQU   FSBTHFLD                                                 01090000
FSBSYSRS EQU   FSBTH1                                                   01091000
FSBSERR  EQU   FSBSYSRS                                                 01092000
FSBSPHSE EQU   FSBSYSRS                                                 01093000
FSBTH2   EQU   FSBTHFLD+1                                               01094000
FSBEXTRS EQU   FSBTH2                                                   01095000
FSBXFSTS EQU   FSBEXTRS                                                 01096000
FSBXCODE EQU   FSBEXTRS                                                 01097000
FSBNETRS EQU   FSBFSB+16                                                01098000
FSBSRCAT EQU   FSBNETRS                                                 01099000
FSBMJRCD EQU   FSBSRCAT                                                 01100000
FSBERC   EQU   FSBNETRS+1                                               01101000
FSBELI   EQU   FSBERC                                                   01102000
FSBECI   EQU   FSBERC                                                   01103000
FSBFBMI  EQU   FSBERC                                                   01104000
FSBDMGRS EQU   FSBFSB+18                                                01105000
FSBSS1   EQU   FSBDMGRS                                                 01106000
FSBSS2   EQU   FSBDMGRS+1                                               01107000
FSBLCPB  EQU   FSBFSB+20                                                01108000
FSBMSGID EQU   FSBLCPB                                                  01109000
FSBLCCWA EQU   FSBFSB+24                                                01110000
FSBRLSTS EQU   FSBLCCWA                                                 01111000
ISTLCCW  EQU   0                                                        01112000
LCCWOP   EQU   ISTLCCW                                                  01113000
LCCWRWOP EQU   LCCWOP                                                   01114000
LCCWCTL  EQU   LCCWRWOP                                                 01115000
LCCWFLAG EQU   ISTLCCW+1                                                01116000
LCCWCC   EQU   LCCWFLAG                                                 01117000
LCCWLSI  EQU   LCCWFLAG                                                 01118000
LCCWRFI  EQU   LCCWFLAG                                                 01119000
ISTPAB   EQU   0                                                        01120000
PABWQCHN EQU   ISTPAB                                                   01121000
PABWEQA  EQU   PABWQCHN                                                 01122000
PABCHAIN EQU   PABWQCHN+4                                               01123000
PABRPHFG EQU   ISTPAB+12                                                01124000
PABFLAGS EQU   PABRPHFG                                                 01125000
PABERLCK EQU   PABFLAGS                                                 01126000
PABERRLK EQU   PABERLCK                                                 01127000
ISTLH    EQU   0                                                        01128000
ISTTH    EQU   0                                                        01129000
THFLAG1  EQU   ISTTH                                                    01130000
THFLGA   EQU   THFLAG1                                                  01131000
THMPF    EQU   THFLGA                                                   01132000
THFLGB   EQU   THFLAG1+1                                                01133000
ISTTH2   EQU   0                                                        01134000
TH2FLAG1 EQU   ISTTH2                                                   01135000
TH2MPF   EQU   TH2FLAG1                                                 01136000
ISTZIBUF EQU   0                                                        01137000
ZIBFSM   EQU   ISTZIBUF+4                                               01138000
ISTDEVCH EQU   0                                                        01139000
DEVSHCH  EQU   ISTDEVCH                                                 01140000
DEVCHAR  EQU   DEVSHCH                                                  01141000
DEVTCODE EQU   ISTDEVCH+1                                               01142000
DEVFLAGS EQU   ISTDEVCH+3                                               01143000
DEVFCCTL EQU   DEVFLAGS                                                 01144000
DEVCHAR3 EQU   DEVFLAGS                                                 01145000
ISTPROCD EQU   0                                                        01146000
PROPROC  EQU   ISTPROCD                                                 01147000
PROPROC1 EQU   PROPROC                                                  01148000
PROPROC2 EQU   PROPROC+1                                                01149000
PROPROC3 EQU   PROPROC+2                                                01150000
PROPROC4 EQU   PROPROC+3                                                01151000
PROPROCS EQU   0                                                        01152000
PROSETMS EQU   PROPROCS+1                                               01153000
PROSETM2 EQU   PROSETMS                                                 01154000
PROSETM3 EQU   PROSETMS+1                                               01155000
PROSETM4 EQU   PROSETMS+2                                               01156000
ISTLOK   EQU   0                                                        01157000
LOKCHN   EQU   ISTLOK+1                                                 01158000
LOKCHNG  EQU   LOKCHN                                                   01159000
@NM00024 EQU   LOKCHNG+2                                                01160000
ISTFMCB  EQU   0                                                        01161000
FMCSTAT  EQU   ISTFMCB+28                                               01162000
FMCSTAT1 EQU   ISTFMCB+29                                               01163000
FMCCMDFL EQU   ISTFMCB+31                                               01164000
FMCCMPS1 EQU   ISTFMCB+36                                               01165000
FMCPROCD EQU   ISTFMCB+48                                               01166000
FMCPAB2  EQU   ISTFMCB+80                                               01167000
FMCSIPA  EQU   ISTFMCB+148                                              01168000
FMCNXOSQ EQU   ISTFMCB+152                                              01169000
FMCNXCFM EQU   FMCNXOSQ                                                 01170000
FMCNXOSC EQU   FMCNXOSQ+2                                               01171000
FMCSSTAT EQU   ISTFMCB+159                                              01172000
FMCPACE  EQU   ISTFMCB+160                                              01173000
FMCPACEN EQU   FMCPACE                                                  01174000
FMCPACEM EQU   FMCPACE+1                                                01175000
FMCPACPC EQU   FMCPACE+2                                                01176000
FMCCVAL  EQU   FMCPACE+3                                                01177000
FMCOBCE  EQU   FMCCVAL                                                  01178000
FMCCLEXT EQU   ISTFMCB+164                                              01179000
FMCRPLA  EQU   FMCCLEXT                                                 01180000
FMCFBA   EQU   FMCCLEXT+4                                               01181000
FMCCMPS2 EQU   FMCCLEXT+16                                              01182000
FMCFLGA  EQU   FMCCMPS2                                                 01183000
FMCFLGCL EQU   FMCCMPS2+1                                               01184000
FMCPSCMD EQU   FMCCMPS2+2                                               01185000
FMCPSTAT EQU   FMCCMPS2+3                                               01186000
FMCBHSET EQU   ISTFMCB+185                                              01187000
FMCSTAT2 EQU   ISTFMCB+186                                              01188000
FMCMODEB EQU   ISTFMCB+189                                              01189000
FMCCLSEQ EQU   ISTFMCB+190                                              01190000
FMCRRESP EQU   ISTFMCB+195                                              01191000
FMCSSEGQ EQU   ISTFMCB+200                                              01192000
FMCFBAS  EQU   ISTFMCB+216                                              01193000
FMCZV002 EQU   FMCFBAS                                                  01194000
FMCSNCTL EQU   ISTFMCB+224                                              01195000
FMCSCFLG EQU   FMCSNCTL                                                 01196000
FMCVS1   EQU   ISTFMCB+232                                              01197000
FMCZFLAG EQU   FMCVS1                                                   01198000
FMCZF006 EQU   FMCZFLAG                                                 01199000
FMCLBXM  EQU   FMCVS1+12                                                01200000
FMCSHEAQ EQU   FMCLBXM                                                  01201000
FMCLCPBQ EQU   FMCVS1+16                                                01202000
FMCLCPAQ EQU   FMCVS1+20                                                01203000
FMCSEQ1  EQU   FMCVS1+34                                                01204000
FMCZFLG2 EQU   FMCVS1+35                                                01205000
FMCCVFLG EQU   FMCVS1+44                                                01206000
FMCFLAG  EQU   0                                                        01207000
FMCFLGB  EQU   FMCFLAG                                                  01208000
ISTZSAVE EQU   0                                                        01209000
ZSAZSVBC EQU   ISTZSAVE                                                 01210000
ZSAZSVMS EQU   ZSAZSVBC                                                 01211000
ZSAZACTV EQU   ZSAZSVMS                                                 01212000
ZSAZSVFC EQU   ISTZSAVE+4                                               01213000
ZSAZSVRR EQU   ISTZSAVE+8                                               01214000
ZSAZSVVR EQU   ISTZSAVE+12                                              01215000
ZSAZTRAC EQU   ISTZSAVE+36                                              01216000
ISTLCPB  EQU   0                                                        01217000
LCPREQTG EQU   ISTLCPB+2                                                01218000
LCPFLAGS EQU   LCPREQTG                                                 01219000
LCPZF001 EQU   LCPFLAGS                                                 01220000
LCPZRT02 EQU   LCPZF001                                                 01221000
LCPZF002 EQU   LCPFLAGS                                                 01222000
LCPZRT03 EQU   LCPZF002                                                 01223000
LCPZF003 EQU   LCPFLAGS                                                 01224000
LCPZRT04 EQU   LCPZF003                                                 01225000
LCPZF004 EQU   LCPFLAGS                                                 01226000
LCPZRT05 EQU   LCPZF004                                                 01227000
LCPZRT06 EQU   LCPFLAGS                                                 01228000
LCPZRT07 EQU   LCPFLAGS                                                 01229000
LCPMNRCD EQU   LCPREQTG+1                                               01230000
LCPZRT08 EQU   LCPMNRCD                                                 01231000
LCPZRT09 EQU   LCPMNRCD                                                 01232000
LCPCHAIN EQU   ISTLCPB+4                                                01233000
LCPCHAI1 EQU   LCPCHAIN                                                 01234000
LCPRUCNT EQU   ISTLCPB+8                                                01235000
LCPFLAG2 EQU   ISTLCPB+9                                                01236000
LCPTLBPI EQU   LCPFLAG2                                                 01237000
LCPFID0  EQU   LCPFLAG2                                                 01238000
LCPSEQ   EQU   ISTLCPB+10                                               01239000
LCPCID   EQU   ISTLCPB+16                                               01240000
LCPFDBA  EQU   ISTLCPB+24                                               01241000
LCPFLG1  EQU   ISTLCPB+37                                               01242000
LCPFLCCW EQU   ISTLCPB+40                                               01243000
LCPLCCW  EQU   ISTLCPB+48                                               01244000
LCPPABA  EQU   LCPLCCW+4                                                01245000
LCPRPHA  EQU   LCPPABA                                                  01246000
ISTZCRR  EQU   0                                                        01247000
ZCRCRR   EQU   ISTZCRR                                                  01248000
ZCRFLGS1 EQU   ISTZCRR+12                                               01249000
ZCRFLGS2 EQU   ISTZCRR+13                                               01250000
ZCRSWFLD EQU   ISTZCRR+14                                               01251000
ZCRENDSH EQU   ZCRSWFLD                                                 01252000
ZCRNDLCP EQU   ZCRSWFLD                                                 01253000
ZCRRESET EQU   ZCRSWFLD                                                 01254000
ZCRFLGS3 EQU   ISTZCRR+15                                               01255000
ZCRGENSW EQU   ISTZCRR+16                                               01256000
ZCRPFLGS EQU   ISTZCRR+17                                               01257000
ZCRIBPR  EQU   ISTZCRR+18                                               01258000
ZCR3270R EQU   ZCRIBPR                                                  01259000
ZCRSCPSW EQU   ISTZCRR+19                                               01260000
ZCRPARMS EQU   ISTZCRR+24                                               01261000
ZCRFBPTR EQU   ZCRPARMS                                                 01262000
ZCRDFRDA EQU   ZCRPARMS+10                                              01263000
ZCRPCOD1 EQU   ZCRPARMS+12                                              01264000
ZCRPLSBF EQU   ZCRPCOD1                                                 01265000
ZCRPLSCB EQU   ZCRPCOD1                                                 01266000
ZCRPBUF  EQU   ZCRPCOD1                                                 01267000
ZCRPCOD2 EQU   ZCRPARMS+13                                              01268000
ZCRSVRTN EQU   ISTZCRR+56                                               01269000
ZCRWKARA EQU   ISTZCRR+156                                              01270000
ZCRLSTFB EQU   ISTZCRR+180                                              01271000
ZCRCIDSV EQU   ISTZCRR+192                                              01272000
ZCRAUDIT EQU   ISTZCRR+440                                              01273000
ZCRENTER EQU   ZCRAUDIT+5                                               01274000
ZCREGCBB EQU   ZCRENTER+9                                               01275000
ZCRLCPB  EQU   ISTZCRR+480                                              01276000
ZCRRHRU  EQU   ZCRLCPB                                                  01277000
ISTRPH   EQU   0                                                        01278000
RPHCNTL  EQU   ISTRPH                                                   01279000
RPHFLAGS EQU   RPHCNTL+2                                                01280000
RPHAPTYP EQU   RPHFLAGS                                                 01281000
RPHFSTLC EQU   RPHFLAGS                                                 01282000
RPHFLGB  EQU   RPHCNTL+3                                                01283000
RPHRPHA  EQU   ISTRPH+4                                                 01284000
RPHTSKID EQU   ISTRPH+8                                                 01285000
RPHRESMA EQU   ISTRPH+16                                                01286000
RPHWPFLG EQU   RPHRESMA                                                 01287000
RPHWEA   EQU   ISTRPH+24                                                01288000
RPHCSPA  EQU   RPHWEA                                                   01289000
RPHSRPRM EQU   ISTRPH+28                                                01290000
RPHCRR   EQU   ISTRPH+32                                                01291000
RPHPABQA EQU   ISTRPH+36                                                01292000
RPHWORK  EQU   ISTRPH+40                                                01293000
RPHSAVE1 EQU   RPHWORK                                                  01294000
RPHSBITS EQU   RPHSAVE1+1                                               01295000
ISTLSCB  EQU   0                                                        01296000
LSC1WORD EQU   ISTLSCB                                                  01297000
LSCTYPE  EQU   LSC1WORD                                                 01298000
LSCREQTG EQU   LSC1WORD+2                                               01299000
LSCZRT02 EQU   LSCREQTG                                                 01300000
LSCZRT03 EQU   LSCREQTG                                                 01301000
LSCZRT04 EQU   LSCREQTG                                                 01302000
LSCZRT05 EQU   LSCREQTG                                                 01303000
LSCZRT06 EQU   LSCREQTG                                                 01304000
LSCZRT07 EQU   LSCREQTG                                                 01305000
LSCZMNRC EQU   LSCREQTG+1                                               01306000
LSCZRT08 EQU   LSCZMNRC                                                 01307000
LSCZRT09 EQU   LSCZMNRC                                                 01308000
LSCCHAIN EQU   ISTLSCB+4                                                01309000
LSCCHAI1 EQU   LSCCHAIN                                                 01310000
LSCRUCNT EQU   ISTLSCB+8                                                01311000
LSCFLGS  EQU   ISTLSCB+9                                                01312000
LSCSEQ   EQU   ISTLSCB+10                                               01313000
LSCLCPBA EQU   ISTLSCB+16                                               01314000
LSCLCCWA EQU   ISTLSCB+20                                               01315000
LSCFDBA  EQU   ISTLSCB+24                                               01316000
ISTDYPAB EQU   0                                                        01317000
ISTATCVT EQU   0                                                        01318000
ATCCOM   EQU   ISTATCVT                                                 01319000
ATCSTAT  EQU   ATCCOM                                                   01320000
ATCSTAT1 EQU   ATCSTAT                                                  01321000
ATCSTFLG EQU   ATCSTAT+1                                                01322000
ATCPOFLG EQU   ATCSTAT+2                                                01323000
ATCSTAT4 EQU   ATCSTAT+3                                                01324000
ATCIOTRC EQU   ATCCOM+140                                               01325000
ATCTHTRC EQU   ATCIOTRC                                                 01326000
ATCCSMR  EQU   ISTATCVT+296                                             01327000
ATCSHRFG EQU   ISTATCVT+316                                             01328000
ATCHPGM  EQU   ISTATCVT+384                                             01329000
ATCVLCNT EQU   ISTATCVT+772                                             01330000
ATCRNO   EQU   ISTATCVT+788                                             01331000
ATCSOPD  EQU   ISTATCVT+792                                             01332000
ATCSIPD  EQU   ISTATCVT+800                                             01333000
ATCSECST EQU   ISTATCVT+812                                             01334000
ATCSTAT2 EQU   ISTATCVT+818                                             01335000
ATCVTBAM EQU   ISTATCVT+908                                             01336000
@NM00046 EQU   ATCVTBAM+3                                               01337000
ATCAOSM  EQU   ISTATCVT+912                                             01338000
ATCGSRBQ EQU   ATCAOSM+4                                                01339000
ATCGSRBG EQU   ATCGSRBQ                                                 01340000
ATCAP34  EQU   ATCAOSM+32                                               01341000
ATCZPSVT EQU   ATCAOSM+72                                               01342000
ATCICAPP EQU   ATCAOSM+100                                              01343000
ATCLDAPP EQU   ATCAOSM+120                                              01344000
ATCDAPVT EQU   ATCAOSM+140                                              01345000
ATCAP37  EQU   ATCAOSM+264                                              01346000
ATCCRA   EQU   ATCAOSM+280                                              01347000
ATCCRACN EQU   ATCCRA+4                                                 01348000
ATCSRB   EQU   ATCAOSM+288                                              01349000
ATCSRBCN EQU   ATCSRB+4                                                 01350000
ATCCRPL  EQU   ATCAOSM+296                                              01351000
ATCRPLCN EQU   ATCCRPL+4                                                01352000
ATCSQAFR EQU   ATCAOSM+304                                              01353000
ATCORTBC EQU   ATCSQAFR+4                                               01354000
ATCORSRB EQU   ATCORTBC                                                 01355000
@NM00048 EQU   ATCAOSM+332                                              01356000
ATCVTFLG EQU   ATCAOSM+392                                              01357000
ATCZFLAG EQU   ATCAOSM+588                                              01358000
ISTNCB   EQU   0                                                        01359000
NCBFLAGS EQU   ISTNCB+24                                                01360000
NCBFRAS  EQU   NCBFLAGS+1                                               01361000
NCBFTRIO EQU   NCBFRAS                                                  01362000
NCBFLAG1 EQU   NCBFLAGS+2                                               01363000
ISTDNCB  EQU   0                                                        01364000
DNCBHSET EQU   ISTDNCB+48                                               01365000
DNCMODE  EQU   ISTDNCB+49                                               01366000
DNCOS    EQU   ISTDNCB+56                                               01367000
DNCZFLGS EQU   DNCOS                                                    01368000
DNCBSCED EQU   DNCOS+2                                                  01369000
ISTPFCRR EQU   0                                                        01370000
PFCCRR   EQU   ISTPFCRR                                                 01371000
PFCCRRID EQU   PFCCRR                                                   01372000
PFCCRRLN EQU   PFCCRR+2                                                 01373000
PFCHDR   EQU   ISTPFCRR+4                                               01374000
PFCCRRO  EQU   PFCHDR                                                   01375000
PFCFRRO  EQU   PFCHDR+4                                                 01376000
ISTCFCRR EQU   0                                                        01377000
CFCAUDIT EQU   ISTCFCRR                                                 01378000
CFCNTRD  EQU   CFCAUDIT                                                 01379000
CFCCRT   EQU   CFCAUDIT+1                                               01380000
ISTASCRR EQU   0                                                        01381000
ASCFLAGS EQU   ISTASCRR+16                                              01382000
ASCFLG1  EQU   ASCFLAGS                                                 01383000
ASCFLG2  EQU   ASCFLAGS+2                                               01384000
ASCFLG3  EQU   ASCFLAGS+4                                               01385000
ASCUSRGS EQU   ISTASCRR+28                                              01386000
ISTAPCRR EQU   0                                                        01387000
APCATFLG EQU   ISTAPCRR+16                                              01388000
APCRFLG  EQU   ISTAPCRR+18                                              01389000
APCSAVE  EQU   ISTAPCRR+44                                              01390000
APCCOMF  EQU   ISTAPCRR+116                                             01391000
APCCOMF1 EQU   APCCOMF                                                  01392000
APC31FLG EQU   ISTAPCRR+132                                             01393000
APC52FLG EQU   ISTAPCRR+133                                             01394000
APC53FLG EQU   ISTAPCRR+134                                             01395000
APC54FLG EQU   ISTAPCRR+135                                             01396000
APC57FLG EQU   ISTAPCRR+136                                             01397000
ISTCRA   EQU   0                                                        01398000
CRABASIC EQU   ISTCRA                                                   01399000
CRAHDR   EQU   CRABASIC                                                 01400000
CRACRR   EQU   CRAHDR                                                   01401000
CRALKACT EQU   CRABASIC+8                                               01402000
CRASVC   EQU   ISTCRA+848                                               01403000
CRABUFA  EQU   CRASVC+68                                                01404000
ISTICNCB EQU   0                                                        01405000
@NM00061 EQU   ISTICNCB+53                                              01406000
ICNCKFLD EQU   ISTICNCB+96                                              01407000
ICNFLAG  EQU   ISTICNCB+100                                             01408000
ICNZF006 EQU   ICNFLAG                                                  01409000
ICNFFLAG EQU   ISTICNCB+101                                             01410000
ICNZSWS  EQU   ISTICNCB+102                                             01411000
ICNFLAG2 EQU   ISTICNCB+236                                             01412000
ICNZD001 EQU   ISTICNCB+288                                             01413000
ICNWSCCW EQU   ICNZD001                                                 01414000
ICNZD002 EQU   ISTICNCB+296                                             01415000
ICNZD003 EQU   ISTICNCB+320                                             01416000
ICNRSCCW EQU   ICNZD003                                                 01417000
ICNZD004 EQU   ISTICNCB+328                                             01418000
ICNZS1VR EQU   ISTICNCB+348                                             01419000
ICNSRV02 EQU   ICNZS1VR                                                 01420000
ICNDIEWA EQU   ICNSRV02                                                 01421000
ICNDCDEB EQU   ISTICNCB+480                                             01422000
ICNDIDEB EQU   ICNDCDEB+12                                              01423000
ICNZFLAG EQU   ISTICNCB+508                                             01424000
ICNZH002 EQU   ISTICNCB+509                                             01425000
ICNZS002 EQU   ICNZH002                                                 01426000
ICNZS003 EQU   ICNZH002                                                 01427000
ICNZS004 EQU   ICNZH002                                                 01428000
ICNZS006 EQU   ICNZH002                                                 01429000
ICNZS007 EQU   ICNZH002                                                 01430000
ICNZS008 EQU   ICNZH002                                                 01431000
ICNZS009 EQU   ICNZH002+1                                               01432000
ICNZS00A EQU   ICNZH002+1                                               01433000
ICNZCONS EQU   ISTICNCB+680                                             01434000
ISTZRCVT EQU   0                                                        01435000
ZRCZIFNB EQU   ISTZRCVT+48                                              01436000
ZRCZIFIB EQU   ISTZRCVT+92                                              01437000
ISTZPSVT EQU   0                                                        01438000
ZPSZDFB0 EQU   ISTZPSVT+16                                              01439000
ISTWKE   EQU   0                                                        01440000
WKECHAIN EQU   ISTWKE+4                                                 01441000
WKEFLAGS EQU   WKECHAIN                                                 01442000
ISTAPC37 EQU   0                                                        01443000
ISTAPC34 EQU   0                                                        01444000
ZIBSRB   EQU   0                                                        01445000
CVTS01   EQU   CVTPGSIA                                                 01446000
CVTLPDIA EQU   CVTS01+12                                                01447000
CVTDIRST EQU   CVTLPDIA                                                 01448000
CVTSLIDA EQU   CVTS01+24                                                01449000
CVTCTLFG EQU   CVTS01+50                                                01450000
CVTRV210 EQU   CVTS01+424                                               01451000
CVTRV219 EQU   CVTS01+425                                               01452000
CVTRV228 EQU   CVTS01+426                                               01453000
CVTRV237 EQU   CVTS01+427                                               01454000
CVTMFRTR EQU   CVTS01+452                                               01455000
CVTRV262 EQU   CVTS01+468                                               01456000
CVTRV271 EQU   CVTS01+469                                               01457000
CVTRV280 EQU   CVTS01+470                                               01458000
CVTRV289 EQU   CVTS01+471                                               01459000
CVTGSDA  EQU   CVTS01+600                                               01460000
IOSATTSC EQU   IOSIPIB                                                  01461000
IOSWTOWA EQU   IOSIPIB                                                  01462000
IOSPCISC EQU   IOSIPIB                                                  01463000
FSBCOMBN EQU   FSBNETRS                                                 01464000
FSBRHFLD EQU   FSBCOMBN+1                                               01465000
FSBRH3   EQU   FSBRHFLD+2                                               01466000
FSBLDFLG EQU   FSBRH3                                                   01467000
@NM00015 EQU   FSBRQTAG                                                 01468000
ZIBDIO   EQU   ZIBFSM                                                   01469000
ZIBCCW2  EQU   ZIBDIO+8                                                 01470000
ZIBCPTCC EQU   ZIBCCW2                                                  01471000
ZIBAIO   EQU   ISTZIBUF                                                 01472000
ZIBAIOCM EQU   ZIBAIO                                                   01473000
ZIBFDBZ  EQU   ZIBAIOCM                                                 01474000
ZIBFIB   EQU   ZIBAIO+16                                                01475000
ZIBFSB   EQU   ZIBFIB                                                   01476000
ZIBMDREC EQU   ZIBFSB+4                                                 01477000
ZIBMDRIN EQU   ZIBFSB+28                                                01478000
ZIBBTU   EQU   ZIBFIB+32                                                01479000
ZIBFDBS  EQU   ZIBBTU                                                   01480000
@NM00020 EQU   ZIBBTU+12                                                01481000
ZIBFID1  EQU   @NM00020+1                                               01482000
ZIBFITXT EQU   ZIBFID1                                                  01483000
ZIBSIB   EQU   ZIBFIB                                                   01484000
ZIBREC   EQU   ZIBMDRIN                                                 01485000
ZIBRECPL EQU   ZIBREC                                                   01486000
ZIBRECHD EQU   ZIBRECPL                                                 01487000
ZIBRECRS EQU   ZIBREC+8                                                 01488000
ZIBRECDT EQU   ZIBREC+10                                                01489000
ZIBMDRRC EQU   ZIBMDREC                                                 01490000
ZIBRCPL  EQU   ZIBMDRRC                                                 01491000
ZIBRCDT  EQU   ZIBMDRRC+24                                              01492000
@NM00022 EQU   ZIBBTU                                                   01493000
LCPZTIE  EQU   LCPCID                                                   01494000
LCPZSNAM EQU   LCPZTIE+8                                                01495000
SRB      EQU   SRBSECT                                                  01496000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01497000
LCPZTRV4 EQU   LCPZSNAM+4                                               01498000
LCPZTRV1 EQU   LCPZSNAM                                                 01499000
LCPZSNA  EQU   LCPZTIE+4                                                01500000
LCPZFMCA EQU   LCPZTIE                                                  01501000
ZIBTH2   EQU   @NM00022+4                                               01502000
ZIBLH    EQU   @NM00022                                                 01503000
ZIBRCTXT EQU   ZIBMDRRC+36                                              01504000
ZIBRCRID EQU   ZIBRCDT+10                                               01505000
ZIBRCNAM EQU   ZIBRCDT+2                                                01506000
ZIBRCUA  EQU   ZIBRCDT                                                  01507000
ZIBRCPUI EQU   ZIBRCPL+20                                               01508000
ZIBRCPUN EQU   ZIBRCPL+16                                               01509000
ZIBRCTIM EQU   ZIBRCPL+12                                               01510000
ZIBRCDAT EQU   ZIBRCPL+8                                                01511000
ZIBRCRS1 EQU   ZIBRCPL+6                                                01512000
ZIBRCSID EQU   ZIBRCPL+5                                                01513000
ZIBRCID  EQU   ZIBRCPL+4                                                01514000
ZIBRCSW  EQU   ZIBRCPL+2                                                01515000
ZIBRCSYR EQU   ZIBRCPL+1                                                01516000
ZIBRCL   EQU   ZIBRCPL                                                  01517000
ZIBRECTX EQU   ZIBREC+22                                                01518000
ZIBRECID EQU   ZIBRECDT+10                                              01519000
ZIBRECNA EQU   ZIBRECDT+2                                               01520000
ZIBRECUA EQU   ZIBRECDT                                                 01521000
ZIBRECSV EQU   ZIBRECRS                                                 01522000
ZIBRECDA EQU   ZIBRECPL+4                                               01523000
ZIBRECSI EQU   ZIBRECHD+3                                               01524000
ZIBRECDV EQU   ZIBRECHD+2                                               01525000
ZIBRECFL EQU   ZIBRECHD+1                                               01526000
ZIBRECTY EQU   ZIBRECHD                                                 01527000
ZIBTEXT  EQU   ZIBSIB+4                                                 01528000
ZIBRSV04 EQU   ZIBSIB                                                   01529000
ZIBTEXT2 EQU   ZIBFITXT                                                 01530000
ZIBTEXT1 EQU   ZIBFIB+52                                                01531000
@NM00021 EQU   @NM00020                                                 01532000
@NM00019 EQU   ZIBMDREC                                                 01533000
@NM00018 EQU   ZIBFSB                                                   01534000
ZIBLNG2  EQU   ZIBAIOCM+14                                              01535000
ZIBRSV03 EQU   ZIBAIOCM+13                                              01536000
ZIBWKBYT EQU   ZIBAIOCM+12                                              01537000
ZIBCPNPK EQU   ZIBCCW2+6                                                01538000
ZIBRSV02 EQU   ZIBCCW2+5                                                01539000
ZIBCPTPF EQU   ZIBCCW2+4                                                01540000
ZIBCPTCA EQU   ZIBCCW2+1                                                01541000
ZIBCPNPC EQU   ZIBCPTCC                                                 01542000
ZIBCPRDK EQU   ZIBDIO+6                                                 01543000
ZIBRSV01 EQU   ZIBDIO+5                                                 01544000
ZIBCPRDF EQU   ZIBDIO+4                                                 01545000
ZIBCPTXA EQU   ZIBDIO+1                                                 01546000
ZIBCPRDC EQU   ZIBDIO                                                   01547000
FSBRT0B  EQU   @NM00015+1                                               01548000
FSBRT0A  EQU   @NM00015+1                                               01549000
FSBRT09  EQU   @NM00015+1                                               01550000
FSBRT08  EQU   @NM00015+1                                               01551000
FSBRT07  EQU   @NM00015                                                 01552000
FSBRT06  EQU   @NM00015                                                 01553000
FSBRT05  EQU   @NM00015                                                 01554000
FSBRT04  EQU   @NM00015                                                 01555000
FSBRT03  EQU   @NM00015                                                 01556000
FSBRT02  EQU   @NM00015                                                 01557000
FSBRT01  EQU   @NM00015                                                 01558000
FSBRT00  EQU   @NM00015                                                 01559000
FSBLDCUF EQU   FSBLDFLG                                                 01560000
FSBLDSIF EQU   FSBLDFLG                                                 01561000
FSBLDSOF EQU   FSBLDFLG                                                 01562000
FSBLDEBF EQU   FSBLDFLG                                                 01563000
FSBLDBBF EQU   FSBLDFLG                                                 01564000
FSBLDFME EQU   FSBLDFLG                                                 01565000
FSBLDSCF EQU   FSBLDFLG                                                 01566000
FSBLDRMF EQU   FSBLDFLG                                                 01567000
FSBRH2   EQU   FSBRHFLD+1                                               01568000
FSBRH1   EQU   FSBRHFLD                                                 01569000
FSBALIGN EQU   FSBCOMBN                                                 01570000
IOSPCIWA EQU   IOSPCISC+44                                              01571000
IOSPCIRS EQU   IOSPCISC+8                                               01572000
@NM00009 EQU   IOSPCISC+4                                               01573000
@NM00008 EQU   IOSPCISC                                                 01574000
IOSWRNDR EQU   IOSWTOWA+4                                               01575000
IOSWTOPT EQU   IOSWTOWA+3                                               01576000
IOSWTOCP EQU   IOSWTOWA+2                                               01577000
IOSWTOCH EQU   IOSWTOWA                                                 01578000
IOSATTWA EQU   IOSATTSC+40                                              01579000
@NM00007 EQU   IOSATTSC+24                                              01580000
IOSATTSN EQU   IOSATTSC                                                 01581000
CVTRV628 EQU   CVTS01+728                                               01582000
CVTRV627 EQU   CVTS01+724                                               01583000
CVTRV626 EQU   CVTS01+720                                               01584000
CVTRV625 EQU   CVTS01+716                                               01585000
CVTRV624 EQU   CVTS01+712                                               01586000
CVTRV623 EQU   CVTS01+708                                               01587000
CVTRV622 EQU   CVTS01+704                                               01588000
CVTRV621 EQU   CVTS01+700                                               01589000
CVTRV620 EQU   CVTS01+696                                               01590000
CVTRV619 EQU   CVTS01+692                                               01591000
CVTRV618 EQU   CVTS01+688                                               01592000
CVTRV617 EQU   CVTS01+684                                               01593000
CVTRV616 EQU   CVTS01+680                                               01594000
CVTRV615 EQU   CVTS01+676                                               01595000
CVTRV614 EQU   CVTS01+672                                               01596000
CVTRV613 EQU   CVTS01+668                                               01597000
CVTTCASP EQU   CVTS01+664                                               01598000
CVT0PT03 EQU   CVTS01+660                                               01599000
CVT0PT0E EQU   CVTS01+656                                               01600000
CVTIRM   EQU   CVTS01+652                                               01601000
CVTCGK   EQU   CVTS01+648                                               01602000
CVTRV607 EQU   CVTS01+644                                               01603000
CVTRV606 EQU   CVTS01+640                                               01604000
CVTRV605 EQU   CVTS01+636                                               01605000
CVTRV604 EQU   CVTS01+632                                               01606000
CVTEFF02 EQU   CVTS01+628                                               01607000
CVTCBBR  EQU   CVTS01+624                                               01608000
CVTSSCR  EQU   CVTS01+620                                               01609000
CVTEVENT EQU   CVTS01+616                                               01610000
CVTCRCA  EQU   CVTS01+612                                               01611000
CVTTPIO  EQU   CVTS01+608                                               01612000
CVTADV   EQU   CVTS01+604                                               01613000
CVTGSDAB EQU   CVTGSDA                                                  01614000
CVTQV3   EQU   CVTS01+596                                               01615000
CVTQV2   EQU   CVTS01+592                                               01616000
CVTQV1   EQU   CVTS01+588                                               01617000
CVTRPT   EQU   CVTS01+584                                               01618000
CVTSSRB  EQU   CVTS01+580                                               01619000
CVTCSDRL EQU   CVTS01+576                                               01620000
CVTEXP1  EQU   CVTS01+572                                               01621000
CVTRMPMT EQU   CVTS01+568                                               01622000
CVTRMPTT EQU   CVTS01+564                                               01623000
CVTVPSA  EQU   CVTS01+560                                               01624000
CVTVSTOP EQU   CVTS01+556                                               01625000
CVTGTFR8 EQU   CVTS01+552                                               01626000
CVTQUIT  EQU   CVTS01+548                                               01627000
CVTVACR  EQU   CVTS01+544                                               01628000
CVTWTCB  EQU   CVTS01+540                                               01629000
CVTSTPRS EQU   CVTS01+536                                               01630000
CVT0PT02 EQU   CVTS01+532                                               01631000
CVTDARCM EQU   CVTS01+528                                               01632000
CVTIRECM EQU   CVTS01+524                                               01633000
CVTJRECM EQU   CVTS01+520                                               01634000
CVTVEMS0 EQU   CVTS01+516                                               01635000
CVTSPFRR EQU   CVTS01+512                                               01636000
CVTRLSTG EQU   CVTS01+508                                               01637000
CVT0TC0A EQU   CVTS01+504                                               01638000
CVTGMBR  EQU   CVTS01+500                                               01639000
CVTLFRM  EQU   CVTS01+496                                               01640000
CVTRMBR  EQU   CVTS01+492                                               01641000
CVTVIOP  EQU   CVTS01+488                                               01642000
CVTRV307 EQU   CVTS01+486                                               01643000
CVTRV306 EQU   CVTS01+484                                               01644000
CVTRV305 EQU   CVTS01+482                                               01645000
CVTRV304 EQU   CVTS01+480                                               01646000
CVTRV303 EQU   CVTS01+478                                               01647000
CVTRV302 EQU   CVTS01+476                                               01648000
CVTTRCA  EQU   CVTS01+472                                               01649000
CVTRV297 EQU   CVTRV289                                                 01650000
CVTRV296 EQU   CVTRV289                                                 01651000
CVTRV295 EQU   CVTRV289                                                 01652000
CVTRV294 EQU   CVTRV289                                                 01653000
CVTRV293 EQU   CVTRV289                                                 01654000
CVTRV292 EQU   CVTRV289                                                 01655000
CVTRV291 EQU   CVTRV289                                                 01656000
CVTRV290 EQU   CVTRV289                                                 01657000
CVTRV288 EQU   CVTRV280                                                 01658000
CVTRV287 EQU   CVTRV280                                                 01659000
CVTRV286 EQU   CVTRV280                                                 01660000
CVTRV285 EQU   CVTRV280                                                 01661000
CVTRV284 EQU   CVTRV280                                                 01662000
CVTRV283 EQU   CVTRV280                                                 01663000
CVTRV282 EQU   CVTRV280                                                 01664000
CVTRV281 EQU   CVTRV280                                                 01665000
CVTRV279 EQU   CVTRV271                                                 01666000
CVTRV278 EQU   CVTRV271                                                 01667000
CVTRV277 EQU   CVTRV271                                                 01668000
CVTRV276 EQU   CVTRV271                                                 01669000
CVTRV275 EQU   CVTRV271                                                 01670000
CVTRV274 EQU   CVTRV271                                                 01671000
CVTRV273 EQU   CVTRV271                                                 01672000
CVTRV272 EQU   CVTRV271                                                 01673000
CVTRV270 EQU   CVTRV262                                                 01674000
CVTRV269 EQU   CVTRV262                                                 01675000
CVTRV268 EQU   CVTRV262                                                 01676000
CVTRV267 EQU   CVTRV262                                                 01677000
CVTRV266 EQU   CVTRV262                                                 01678000
CVTRV265 EQU   CVTRV262                                                 01679000
CVTRV264 EQU   CVTRV262                                                 01680000
CVTRV263 EQU   CVTRV262                                                 01681000
CVTVFP   EQU   CVTS01+464                                               01682000
CVTVSI   EQU   CVTS01+460                                               01683000
CVTVPSIB EQU   CVTS01+456                                               01684000
CVTMFACT EQU   CVTMFRTR                                                 01685000
CVTMFCTL EQU   CVTS01+448                                               01686000
CVTPVBP  EQU   CVTS01+444                                               01687000
CVTPWI   EQU   CVTS01+440                                               01688000
CVTRV254 EQU   CVTS01+438                                               01689000
CVTRV253 EQU   CVTS01+436                                               01690000
CVTRV252 EQU   CVTS01+434                                               01691000
CVTRV251 EQU   CVTS01+433                                               01692000
CVTRV250 EQU   CVTS01+432                                               01693000
CVTRV249 EQU   CVTS01+431                                               01694000
CVTRV248 EQU   CVTS01+430                                               01695000
CVTRV247 EQU   CVTS01+429                                               01696000
CVTRV246 EQU   CVTS01+428                                               01697000
CVTRV245 EQU   CVTRV237                                                 01698000
CVTRV244 EQU   CVTRV237                                                 01699000
CVTRV243 EQU   CVTRV237                                                 01700000
CVTRV242 EQU   CVTRV237                                                 01701000
CVTRV241 EQU   CVTRV237                                                 01702000
CVTRV240 EQU   CVTRV237                                                 01703000
CVTRV239 EQU   CVTRV237                                                 01704000
CVTRV238 EQU   CVTRV237                                                 01705000
CVTRV236 EQU   CVTRV228                                                 01706000
CVTRV235 EQU   CVTRV228                                                 01707000
CVTRV234 EQU   CVTRV228                                                 01708000
CVTRV233 EQU   CVTRV228                                                 01709000
CVTRV232 EQU   CVTRV228                                                 01710000
CVTRV231 EQU   CVTRV228                                                 01711000
CVTRV230 EQU   CVTRV228                                                 01712000
CVTRV229 EQU   CVTRV228                                                 01713000
CVTRV227 EQU   CVTRV219                                                 01714000
CVTRV226 EQU   CVTRV219                                                 01715000
CVTRV225 EQU   CVTRV219                                                 01716000
CVTRV224 EQU   CVTRV219                                                 01717000
CVTRV223 EQU   CVTRV219                                                 01718000
CVTRV222 EQU   CVTRV219                                                 01719000
CVTRV221 EQU   CVTRV219                                                 01720000
CVTRV220 EQU   CVTRV219                                                 01721000
CVTRV218 EQU   CVTRV210                                                 01722000
CVTRV217 EQU   CVTRV210                                                 01723000
CVTRV216 EQU   CVTRV210                                                 01724000
CVTRV215 EQU   CVTRV210                                                 01725000
CVTRV214 EQU   CVTRV210                                                 01726000
CVTRV213 EQU   CVTRV210                                                 01727000
CVTRV212 EQU   CVTRV210                                                 01728000
CVTRV211 EQU   CVTRV210                                                 01729000
CVTLCCAT EQU   CVTS01+420                                               01730000
CVTPCCAT EQU   CVTS01+416                                               01731000
CVTIPCRP EQU   CVTS01+412                                               01732000
CVTIPCRI EQU   CVTS01+408                                               01733000
CVTIPCDS EQU   CVTS01+404                                               01734000
CVTAIDVT EQU   CVTS01+400                                               01735000
CVTSSAP  EQU   CVTS01+396                                               01736000
CVTEHCIR EQU   CVTS01+392                                               01737000
CVTEHDEF EQU   CVTS01+388                                               01738000
CVTDAIR  EQU   CVTS01+384                                               01739000
CVTPERFM EQU   CVTS01+380                                               01740000
CVT044R2 EQU   CVTS01+376                                               01741000
CVTFETCH EQU   CVTS01+372                                               01742000
CVTRSTWD EQU   CVTS01+368                                               01743000
CVTSPOST EQU   CVTS01+364                                               01744000
CVTIOBP  EQU   CVTS01+360                                               01745000
CVTASMVT EQU   CVTS01+356                                               01746000
CVTRECRQ EQU   CVTS01+352                                               01747000
CVTWSAC  EQU   CVTS01+348                                               01748000
CVTRV149 EQU   CVTS01+344                                               01749000
CVTWSAL  EQU   CVTS01+340                                               01750000
CVTSPSA  EQU   CVTS01+336                                               01751000
CVTGLMN  EQU   CVTS01+332                                               01752000
CVTVEAC0 EQU   CVTS01+328                                               01753000
CVT062R1 EQU   CVTS01+324                                               01754000
CVTRPOST EQU   CVTS01+320                                               01755000
CVTDQIQE EQU   CVTS01+316                                               01756000
CVTCSD   EQU   CVTS01+312                                               01757000
CVTLKRMA EQU   CVTS01+308                                               01758000
CVTRSPIE EQU   CVTS01+304                                               01759000
CVTRENQ  EQU   CVTS01+300                                               01760000
CVTLQCB  EQU   CVTS01+296                                               01761000
CVTFQCB  EQU   CVTS01+292                                               01762000
CVTQCS01 EQU   CVTS01+288                                               01763000
CVTAPFT  EQU   CVTS01+284                                               01764000
CVTPARRL EQU   CVTS01+280                                               01765000
CVTVWAIT EQU   CVTS01+276                                               01766000
CVTGSPL  EQU   CVTS01+272                                               01767000
CVTLSMQ  EQU   CVTS01+268                                               01768000
CVTGSMQ  EQU   CVTS01+264                                               01769000
CVTEXPRO EQU   CVTS01+260                                               01770000
CVTOPCTP EQU   CVTS01+256                                               01771000
CVTSIC   EQU   CVTS01+252                                               01772000
CVTTPIOS EQU   CVTS01+248                                               01773000
CVTRTMS  EQU   CVTS01+244                                               01774000
CVTSDBF  EQU   CVTS01+240                                               01775000
CVTSCBP  EQU   CVTS01+236                                               01776000
CVTSDMP  EQU   CVTS01+232                                               01777000
CVTSV60  EQU   CVTS01+228                                               01778000
CVTRTMCT EQU   CVTS01+224                                               01779000
CVTASCBL EQU   CVTS01+220                                               01780000
CVTASCBH EQU   CVTS01+216                                               01781000
CVTGDA   EQU   CVTS01+212                                               01782000
CVTASVT  EQU   CVTS01+208                                               01783000
CVTVVMDI EQU   CVTS01+204                                               01784000
CVTAQTOP EQU   CVTS01+200                                               01785000
CVTIOSCS EQU   CVTS01+196                                               01786000
CVTSDRM  EQU   CVTS01+192                                               01787000
CVTOPTE  EQU   CVTS01+188                                               01788000
CVTSTXU  EQU   CVTS01+184                                               01789000
CVTQUIS  EQU   CVTS01+180                                               01790000
CVTPARS  EQU   CVTS01+176                                               01791000
CVTS1EE  EQU   CVTS01+172                                               01792000
CVTFRAS  EQU   CVTS01+168                                               01793000
CVTQSAS  EQU   CVTS01+164                                               01794000
CVTCRAS  EQU   CVTS01+160                                               01795000
CVTCRMN  EQU   CVTS01+156                                               01796000
CVTDELCP EQU   CVTS01+152                                               01797000
CVTFRECL EQU   CVTS01+148                                               01798000
CVTGETCL EQU   CVTS01+144                                               01799000
CVTBLDCP EQU   CVTS01+140                                               01800000
CVTAUTHL EQU   CVTS01+136                                               01801000
CVTSCAN  EQU   CVTS01+132                                               01802000
CVTRV144 EQU   CVTS01+130                                               01803000
CVTMAXMP EQU   CVTS01+128                                               01804000
CVTSTCK  EQU   CVTS01+124                                               01805000
CVTRV139 EQU   CVTS01+123                                               01806000
CVTDSSAC EQU   CVTS01+122                                               01807000
CVTRV513 EQU   CVTS01+121                                               01808000
CVTIOSPL EQU   CVTS01+120                                               01809000
CVTPTGT  EQU   CVTS01+116                                               01810000
CVTCSPIE EQU   CVTS01+112                                               01811000
CVTSMFEX EQU   CVTS01+108                                               01812000
CVTOLT0A EQU   CVTS01+104                                               01813000
CVTSRBRT EQU   CVTS01+100                                               01814000
CVTPUTL  EQU   CVTS01+96                                                01815000
CVTASCRL EQU   CVTS01+92                                                01816000
CVTASCRF EQU   CVTS01+88                                                01817000
CVTRV326 EQU   CVTS01+84                                                01818000
CVTRV325 EQU   CVTS01+80                                                01819000
CVTRV324 EQU   CVTS01+76                                                01820000
CVT0VL01 EQU   CVTS01+72                                                01821000
CVTSHRVM EQU   CVTS01+68                                                01822000
CVTRV332 EQU   CVTS01+64                                                01823000
CVTTAS   EQU   CVTS01+60                                                01824000
CVTRSCN  EQU   CVTS01+56                                                01825000
CVTTRAC2 EQU   CVTS01+54                                                01826000
CVTTRACE EQU   CVTS01+52                                                01827000
CVTAPG   EQU   CVTS01+51                                                01828000
CVTSDTRC EQU   CVTCTLFG                                                 01829000
CVTGTRCE EQU   CVTCTLFG                                                 01830000
CVTNOMP  EQU   CVTCTLFG                                                 01831000
CVTRSV79 EQU   CVTCTLFG                                                 01832000
CVTDSTAT EQU   CVTCTLFG                                                 01833000
CVTRSV78 EQU   CVTCTLFG                                                 01834000
CVTRV333 EQU   CVTCTLFG                                                 01835000
CVTRV323 EQU   CVTCTLFG                                                 01836000
CVTSPVLK EQU   CVTS01+49                                                01837000
CVTRSV77 EQU   CVTS01+48                                                01838000
CVTRV331 EQU   CVTS01+44                                                01839000
CVTRV330 EQU   CVTS01+40                                                01840000
CVTRV329 EQU   CVTS01+36                                                01841000
CVTRV328 EQU   CVTS01+32                                                01842000
CVTRV322 EQU   CVTS01+28                                                01843000
CVTSLID  EQU   CVTSLIDA+1                                               01844000
CVTSYLK  EQU   CVTSLIDA                                                 01845000
CVTRV321 EQU   CVTS01+20                                                01846000
CVTRV320 EQU   CVTS01+16                                                01847000
CVTLPDIR EQU   CVTLPDIA+1                                               01848000
CVTRSV69 EQU   CVTDIRST                                                 01849000
CVTRSV68 EQU   CVTDIRST                                                 01850000
CVTRSV67 EQU   CVTDIRST                                                 01851000
CVTRSV66 EQU   CVTDIRST                                                 01852000
CVTRSV65 EQU   CVTDIRST                                                 01853000
CVTRSV64 EQU   CVTDIRST                                                 01854000
CVTRSV63 EQU   CVTDIRST                                                 01855000
CVTDICOM EQU   CVTDIRST                                                 01856000
CVTPVTP  EQU   CVTS01+8                                                 01857000
CVTLPDSR EQU   CVTS01+4                                                 01858000
CVTGETL  EQU   CVTS01                                                   01859000
WKECHNGP EQU   WKECHAIN+1                                               01860000
@NM00076 EQU   WKEFLAGS                                                 01861000
WKEGATE  EQU   WKEFLAGS                                                 01862000
@NM00075 EQU   ISTWKE                                                   01863000
ZPSZDFQR EQU   ISTZPSVT+80                                              01864000
ZPSZDFPR EQU   ISTZPSVT+76                                              01865000
ZPSZDFXR EQU   ISTZPSVT+72                                              01866000
ZPSZWRD5 EQU   ISTZPSVT+68                                              01867000
ZPSZWRD4 EQU   ISTZPSVT+64                                              01868000
ZPSZDFMB EQU   ISTZPSVT+60                                              01869000
ZPSZDFMF EQU   ISTZPSVT+56                                              01870000
ZPSZDFNB EQU   ISTZPSVT+52                                              01871000
@NM00074 EQU   ISTZPSVT+48                                              01872000
ZPSZDFF0 EQU   ISTZPSVT+44                                              01873000
ZPSZTRTT EQU   ISTZPSVT+40                                              01874000
ZPSZBFOB EQU   ISTZPSVT+36                                              01875000
ZPSZBFMB EQU   ISTZPSVT+32                                              01876000
ZPSZBFZ0 EQU   ISTZPSVT+28                                              01877000
ZPSZBFY0 EQU   ISTZPSVT+24                                              01878000
ZPSZDFI0 EQU   ISTZPSVT+20                                              01879000
ZPSZDFH0 EQU   ISTZPSVT+12                                              01880000
ZPSZDFD0 EQU   ISTZPSVT+8                                               01881000
ZPSZDFC0 EQU   ISTZPSVT+4                                               01882000
ZPSZDFA0 EQU   ISTZPSVT                                                 01883000
ZRCZDFWB EQU   ISTZRCVT+120                                             01884000
ZRCZIFJB EQU   ISTZRCVT+116                                             01885000
ZRCZKFCB EQU   ISTZRCVT+112                                             01886000
ZRCZKFBB EQU   ISTZRCVT+108                                             01887000
ZRCZIFTB EQU   ISTZRCVT+104                                             01888000
ZRCZIFSB EQU   ISTZRCVT+100                                             01889000
ZRCZIFX0 EQU   ISTZRCVT+96                                              01890000
ZRCZIFAB EQU   ISTZRCVT+88                                              01891000
ZRCZIFGB EQU   ISTZRCVT+84                                              01892000
ZRCZIFHB EQU   ISTZRCVT+80                                              01893000
ZRCZIFBB EQU   ISTZRCVT+76                                              01894000
ZRCZIFCB EQU   ISTZRCVT+72                                              01895000
ZRCZIFDB EQU   ISTZRCVT+68                                              01896000
ZRCZIFEB EQU   ISTZRCVT+64                                              01897000
ZRCRSV01 EQU   ISTZRCVT+60                                              01898000
ZRCZGFBB EQU   ISTZRCVT+56                                              01899000
ZRCZIFQB EQU   ISTZRCVT+52                                              01900000
ZRCZIFOB EQU   ISTZRCVT+44                                              01901000
ZRCZIFMB EQU   ISTZRCVT+40                                              01902000
ZRCZIFKB EQU   ISTZRCVT+36                                              01903000
ZRCZIFLB EQU   ISTZRCVT+32                                              01904000
@NM00073 EQU   ISTZRCVT+28                                              01905000
@NM00072 EQU   ISTZRCVT+24                                              01906000
@NM00071 EQU   ISTZRCVT+20                                              01907000
@NM00070 EQU   ISTZRCVT+16                                              01908000
@NM00069 EQU   ISTZRCVT+12                                              01909000
ZRCZJF0B EQU   ISTZRCVT+8                                               01910000
ZRCZCFCI EQU   ISTZRCVT+4                                               01911000
ZRCZIF0B EQU   ISTZRCVT                                                 01912000
ICNZCON6 EQU   ICNZCONS+10                                              01913000
ICNZCON5 EQU   ICNZCONS+8                                               01914000
ICNZCON4 EQU   ICNZCONS+6                                               01915000
ICNZCON3 EQU   ICNZCONS+4                                               01916000
ICNZCON2 EQU   ICNZCONS+2                                               01917000
ICNZCON1 EQU   ICNZCONS                                                 01918000
ICNZATSA EQU   ISTICNCB+676                                             01919000
ICNZX012 EQU   ISTICNCB+675                                             01920000
ICNZX011 EQU   ISTICNCB+674                                             01921000
ICNZX010 EQU   ISTICNCB+672                                             01922000
ICNSRB   EQU   ISTICNCB+628                                             01923000
ICNIOSB  EQU   ISTICNCB+520                                             01924000
ICNZC001 EQU   ISTICNCB+512                                             01925000
ICNZX013 EQU   ISTICNCB+511                                             01926000
ICNZS010 EQU   ICNZH002+1                                               01927000
ICNZS00F EQU   ICNZH002+1                                               01928000
ICNZS00E EQU   ICNZH002+1                                               01929000
ICNZS00D EQU   ICNZH002+1                                               01930000
ICNZS00C EQU   ICNZH002+1                                               01931000
ICNZS00B EQU   ICNZH002+1                                               01932000
ICNZS01A EQU   ICNZS00A                                                 01933000
ICNZS019 EQU   ICNZS009                                                 01934000
ICNZS018 EQU   ICNZS008                                                 01935000
ICNZS017 EQU   ICNZS007                                                 01936000
ICNZS016 EQU   ICNZS006                                                 01937000
ICNZS005 EQU   ICNZH002                                                 01938000
ICNZS014 EQU   ICNZS004                                                 01939000
ICNZS013 EQU   ICNZS003                                                 01940000
ICNZS012 EQU   ICNZS002                                                 01941000
ICNZS001 EQU   ICNZH002                                                 01942000
ICNZF028 EQU   ICNZFLAG                                                 01943000
ICNZF027 EQU   ICNZFLAG                                                 01944000
ICNZF026 EQU   ICNZFLAG                                                 01945000
ICNZF025 EQU   ICNZFLAG                                                 01946000
ICNZF024 EQU   ICNZFLAG                                                 01947000
ICNZF023 EQU   ICNZFLAG                                                 01948000
ICNZF022 EQU   ICNZFLAG                                                 01949000
ICNZF021 EQU   ICNZFLAG                                                 01950000
ICNWORD5 EQU   ISTICNCB+504                                             01951000
ICNMSIZE EQU   ISTICNCB+500                                             01952000
ICNLCVTA EQU   ISTICNCB+496                                             01953000
ICNDEBAD EQU   ICNDIDEB+1                                               01954000
ICNDCBIF EQU   ICNDIDEB                                                 01955000
ICNUCBAD EQU   ICNDCDEB+8                                               01956000
ICNAPPAD EQU   ICNDCDEB+5                                               01957000
ICNEXSCL EQU   ICNDCDEB+4                                               01958000
ICNDCBAD EQU   ICNDCDEB+1                                               01959000
ICNDEBID EQU   ICNDCDEB                                                 01960000
@NM00068 EQU   ISTICNCB+477                                             01961000
ICNERCNT EQU   ISTICNCB+476                                             01962000
ICNZX002 EQU   ISTICNCB+475                                             01963000
ICNZX001 EQU   ISTICNCB+474                                             01964000
ICNZH001 EQU   ISTICNCB+472                                             01965000
ICNZSW3R EQU   ISTICNCB+468                                             01966000
ICNZSW2R EQU   ISTICNCB+464                                             01967000
ICNZSW1R EQU   ISTICNCB+460                                             01968000
ICNZS4VR EQU   ISTICNCB+436                                             01969000
ICNZS4RR EQU   ISTICNCB+432                                             01970000
ICNZS4FC EQU   ISTICNCB+428                                             01971000
ICNZS4BC EQU   ISTICNCB+424                                             01972000
ICNZS3VR EQU   ISTICNCB+400                                             01973000
ICNZS3RR EQU   ISTICNCB+396                                             01974000
ICNZS3FC EQU   ISTICNCB+392                                             01975000
ICNZS3BC EQU   ISTICNCB+388                                             01976000
ICNZS1RC EQU   ICNZS1VR+36                                              01977000
ICNDIEW3 EQU   ICNDIEWA+8                                               01978000
ICNDIEW2 EQU   ICNDIEWA+4                                               01979000
ICNDIEW1 EQU   ICNDIEWA                                                 01980000
ICNZS1RR EQU   ISTICNCB+344                                             01981000
ICNZS1FC EQU   ISTICNCB+340                                             01982000
ICNZS1BC EQU   ISTICNCB+336                                             01983000
ICNRSTIC EQU   ICNZD004                                                 01984000
ICNRDCOD EQU   ICNRSCCW                                                 01985000
ICNZD006 EQU   ISTICNCB+312                                             01986000
ICNZD005 EQU   ISTICNCB+304                                             01987000
ICNWSTIC EQU   ICNZD002                                                 01988000
ICNWRCOD EQU   ICNWSCCW                                                 01989000
ICNZV008 EQU   ISTICNCB+284                                             01990000
ICNZV007 EQU   ISTICNCB+280                                             01991000
ICNZV006 EQU   ISTICNCB+276                                             01992000
ICNZV005 EQU   ISTICNCB+272                                             01993000
ICNZV004 EQU   ISTICNCB+268                                             01994000
ICNLSTIT EQU   ISTICNCB+264                                             01995000
ICNLSTIF EQU   ISTICNCB+260                                             01996000
ICNZV002 EQU   ISTICNCB+256                                             01997000
ICNZV001 EQU   ISTICNCB+252                                             01998000
ICNZV00A EQU   ISTICNCB+249                                             01999000
ICNBUFF  EQU   ISTICNCB+248                                             02000000
ICNCPQ   EQU   ISTICNCB+244                                             02001000
ICNNICNA EQU   ISTICNCB+240                                             02002000
@NM00067 EQU   ICNFLAG2+2                                               02003000
ICNZF019 EQU   ICNFLAG2+2                                               02004000
ICNZF018 EQU   ICNFLAG2+2                                               02005000
ICNZF017 EQU   ICNFLAG2+2                                               02006000
ICNZF016 EQU   ICNFLAG2+2                                               02007000
ICNZF015 EQU   ICNFLAG2+2                                               02008000
ICNMSG   EQU   ICNFLAG2+1                                               02009000
ICNCLOSE EQU   ICNFLAG2+1                                               02010000
ICNZF014 EQU   ICNFLAG2+1                                               02011000
ICNZF013 EQU   ICNFLAG2+1                                               02012000
ICNZF012 EQU   ICNFLAG2+1                                               02013000
ICNZF011 EQU   ICNFLAG2+1                                               02014000
ICNZF00D EQU   ICNFLAG2+1                                               02015000
ICNZF00B EQU   ICNFLAG2+1                                               02016000
ICNZF00A EQU   ICNFLAG2                                                 02017000
ICNZF008 EQU   ICNFLAG2                                                 02018000
ICNZF007 EQU   ICNFLAG2                                                 02019000
ICNZF005 EQU   ICNFLAG2                                                 02020000
ICNZF004 EQU   ICNFLAG2                                                 02021000
ICNZF003 EQU   ICNFLAG2                                                 02022000
ICNZF002 EQU   ICNFLAG2                                                 02023000
ICNZF001 EQU   ICNFLAG2                                                 02024000
ICNLOCK  EQU   ISTICNCB+232                                             02025000
ICNLICNA EQU   ISTICNCB+228                                             02026000
ICNRPH   EQU   ISTICNCB+120                                             02027000
ICNZV003 EQU   ISTICNCB+116                                             02028000
ICNLAST  EQU   ISTICNCB+112                                             02029000
ICNLSTBT EQU   ISTICNCB+108                                             02030000
ICNSIOQ  EQU   ISTICNCB+104                                             02031000
ICNFLAG1 EQU   ISTICNCB+103                                             02032000
ICNZSW08 EQU   ICNZSWS                                                  02033000
ICNZSW07 EQU   ICNZSWS                                                  02034000
ICNZSW06 EQU   ICNZSWS                                                  02035000
ICNZSW05 EQU   ICNZSWS                                                  02036000
ICNZSW04 EQU   ICNZSWS                                                  02037000
ICNZSW03 EQU   ICNZSWS                                                  02038000
ICNZSW02 EQU   ICNZSWS                                                  02039000
ICNZSW01 EQU   ICNZSWS                                                  02040000
ICNZFF69 EQU   ICNFFLAG                                                 02041000
@NM00066 EQU   ICNFFLAG                                                 02042000
ICNZFF05 EQU   ICNFFLAG                                                 02043000
ICNZFF04 EQU   ICNFFLAG                                                 02044000
ICNZFF03 EQU   ICNFFLAG                                                 02045000
ICNZFF02 EQU   ICNFFLAG                                                 02046000
ICNZFF01 EQU   ICNFFLAG                                                 02047000
ICNZFF00 EQU   ICNFFLAG                                                 02048000
@NM00065 EQU   ICNFLAG                                                  02049000
ICNZCRIT EQU   ICNFLAG                                                  02050000
ICNSTART EQU   ICNFLAG                                                  02051000
ICNSLOW  EQU   ICNFLAG                                                  02052000
ICNZF010 EQU   ICNFLAG                                                  02053000
ICNZF00F EQU   ICNFLAG                                                  02054000
ICNZF00E EQU   ICNFLAG                                                  02055000
ICNCONF  EQU   ICNZF006                                                 02056000
ICNCKPAB EQU   ICNCKFLD+1                                               02057000
ICNRSV07 EQU   ICNCKFLD                                                 02058000
ICNCKBIT EQU   ICNCKFLD                                                 02059000
ICNZPAB4 EQU   ISTICNCB+80                                              02060000
ICNZPAB1 EQU   ISTICNCB+64                                              02061000
ICNRSV01 EQU   ISTICNCB+60                                              02062000
@NM00064 EQU   ISTICNCB+56                                              02063000
@NM00063 EQU   ISTICNCB+54                                              02064000
@NM00062 EQU   @NM00061                                                 02065000
ICNRRY   EQU   @NM00061                                                 02066000
ICNLCLUS EQU   @NM00061                                                 02067000
ICNROLN  EQU   @NM00061                                                 02068000
ICNRNRY  EQU   @NM00061                                                 02069000
ICNLNKMD EQU   ISTICNCB+52                                              02070000
ICNCUUA  EQU   ISTICNCB+48                                              02071000
ICNCB    EQU   ISTICNCB                                                 02072000
CRACHAIN EQU   ISTCRA+928                                               02073000
CRARSV02 EQU   ISTCRA+924                                               02074000
CRARSV01 EQU   ISTCRA+920                                               02075000
CRABFTBA EQU   CRABUFA                                                  02076000
CRAMASK  EQU   CRASVC+64                                                02077000
CRAHSIZ  EQU   CRASVC+60                                                02078000
CRAASCRR EQU   CRASVC                                                   02079000
CRAPROCR EQU   ISTCRA+312                                               02080000
CRAPSS   EQU   ISTCRA+160                                               02081000
CRARPH   EQU   ISTCRA+52                                                02082000
CRALAPTR EQU   CRABASIC+48                                              02083000
CRAL9PTR EQU   CRABASIC+44                                              02084000
CRAL8PTR EQU   CRABASIC+40                                              02085000
CRAL7PTR EQU   CRABASIC+36                                              02086000
CRAL6PTR EQU   CRABASIC+32                                              02087000
CRAL5PTR EQU   CRABASIC+28                                              02088000
CRAL4PTR EQU   CRABASIC+24                                              02089000
CRAL3PTR EQU   CRABASIC+20                                              02090000
CRAL2PTR EQU   CRABASIC+16                                              02091000
CRAL1PTR EQU   CRABASIC+12                                              02092000
CRALEV01 EQU   CRALKACT+3                                               02093000
CRALEV02 EQU   CRALKACT+3                                               02094000
CRALEV03 EQU   CRALKACT+3                                               02095000
CRALEV04 EQU   CRALKACT+3                                               02096000
CRALEV05 EQU   CRALKACT+3                                               02097000
CRALEV06 EQU   CRALKACT+3                                               02098000
CRALEV07 EQU   CRALKACT+3                                               02099000
CRALEV08 EQU   CRALKACT+3                                               02100000
CRALEV09 EQU   CRALKACT+2                                               02101000
CRALEV10 EQU   CRALKACT+2                                               02102000
CRALEV11 EQU   CRALKACT+2                                               02103000
CRALEV12 EQU   CRALKACT+2                                               02104000
CRALEV13 EQU   CRALKACT+2                                               02105000
CRALEV14 EQU   CRALKACT+2                                               02106000
CRALEV15 EQU   CRALKACT+2                                               02107000
CRALEV16 EQU   CRALKACT+2                                               02108000
CRALEV17 EQU   CRALKACT+1                                               02109000
CRALEV18 EQU   CRALKACT+1                                               02110000
CRALEV19 EQU   CRALKACT+1                                               02111000
CRALEV20 EQU   CRALKACT+1                                               02112000
CRALEV21 EQU   CRALKACT+1                                               02113000
CRALEV22 EQU   CRALKACT+1                                               02114000
CRALEV23 EQU   CRALKACT+1                                               02115000
CRALEV24 EQU   CRALKACT+1                                               02116000
CRALEV25 EQU   CRALKACT                                                 02117000
CRALEV26 EQU   CRALKACT                                                 02118000
CRALEV27 EQU   CRALKACT                                                 02119000
CRALEV28 EQU   CRALKACT                                                 02120000
CRALEV29 EQU   CRALKACT                                                 02121000
CRALEV30 EQU   CRALKACT                                                 02122000
CRALEV31 EQU   CRALKACT                                                 02123000
CRALEV32 EQU   CRALKACT                                                 02124000
CRAFRR   EQU   CRAHDR+4                                                 02125000
@NM00060 EQU   ISTAPCRR+137                                             02126000
@NM00059 EQU   APC57FLG                                                 02127000
APCNREL  EQU   APC57FLG                                                 02128000
APCRECRA EQU   APC57FLG                                                 02129000
@NM00058 EQU   APC54FLG                                                 02130000
APCRLST  EQU   APC54FLG                                                 02131000
APCPR153 EQU   APC53FLG                                                 02132000
@NM00057 EQU   APC52FLG                                                 02133000
APCWKF   EQU   APC52FLG                                                 02134000
APCNWF   EQU   APC52FLG                                                 02135000
APCRDQ   EQU   APC52FLG                                                 02136000
APCQENQ  EQU   APC52FLG                                                 02137000
APCSMSR  EQU   APC52FLG                                                 02138000
APCCKRQ  EQU   APC52FLG                                                 02139000
@NM00056 EQU   APC31FLG                                                 02140000
APCSORT  EQU   APC31FLG                                                 02141000
APCRESCH EQU   APC31FLG                                                 02142000
APCTPXIT EQU   APC31FLG                                                 02143000
APCSWTWD EQU   ISTAPCRR+128                                             02144000
APCSAV2  EQU   ISTAPCRR+124                                             02145000
APCSAV1  EQU   ISTAPCRR+120                                             02146000
APCRETCD EQU   APCCOMF+2                                                02147000
@NM00055 EQU   APCCOMF1+1                                               02148000
APCZLBER EQU   APCCOMF1                                                 02149000
APCEXIT  EQU   APCCOMF1                                                 02150000
APCRELR  EQU   APCCOMF1                                                 02151000
APCIRB2  EQU   APCCOMF1                                                 02152000
APCIRB1  EQU   APCCOMF1                                                 02153000
APCSMCR  EQU   APCCOMF1                                                 02154000
APCUETSK EQU   APCCOMF1                                                 02155000
APCSSTSK EQU   APCCOMF1                                                 02156000
APCESTAL EQU   APCSAVE                                                  02157000
APCFRRPM EQU   ISTAPCRR+40                                              02158000
APCQWFO  EQU   ISTAPCRR+36                                              02159000
APCPABSV EQU   ISTAPCRR+32                                              02160000
APCRTRN  EQU   ISTAPCRR+28                                              02161000
APCTCBA  EQU   ISTAPCRR+24                                              02162000
APCPSTA  EQU   ISTAPCRR+20                                              02163000
@NM00054 EQU   APCRFLG+1                                                02164000
APC31R   EQU   APCRFLG                                                  02165000
APC58R   EQU   APCRFLG                                                  02166000
APC57R   EQU   APCRFLG                                                  02167000
APC56R   EQU   APCRFLG                                                  02168000
APC54R   EQU   APCRFLG                                                  02169000
APC53R   EQU   APCRFLG                                                  02170000
APC52R   EQU   APCRFLG                                                  02171000
APC51R   EQU   APCRFLG                                                  02172000
@NM00053 EQU   APCATFLG+1                                               02173000
APC31E   EQU   APCATFLG                                                 02174000
APC58E   EQU   APCATFLG                                                 02175000
APC57E   EQU   APCATFLG                                                 02176000
APC56E   EQU   APCATFLG                                                 02177000
APC54E   EQU   APCATFLG                                                 02178000
APC53E   EQU   APCATFLG                                                 02179000
APC52E   EQU   APCATFLG                                                 02180000
APC51E   EQU   APCATFLG                                                 02181000
APCHDRSV EQU   ISTAPCRR                                                 02182000
ASCPSREG EQU   ISTASCRR+44                                              02183000
ASCUSR01 EQU   ASCUSRGS+12                                              02184000
ASCUSR00 EQU   ASCUSRGS+8                                               02185000
ASCUSR15 EQU   ASCUSRGS+4                                               02186000
ASCUSR14 EQU   ASCUSRGS                                                 02187000
ASCETRYA EQU   ISTASCRR+24                                              02188000
ASCKEY   EQU   ISTASCRR+23                                              02189000
ASCAUDIT EQU   ASCFLG3                                                  02190000
ASCFBDUD EQU   ASCFLG3                                                  02191000
ASCLLKF  EQU   ASCFLG3                                                  02192000
ASCKEYF  EQU   ASCFLG3                                                  02193000
ASCFBDAL EQU   ASCFLG3                                                  02194000
ASCFSRGT EQU   ASCFLG3                                                  02195000
ASCICR   EQU   ASCFLG2                                                  02196000
ASCFSRIC EQU   ASCFLG2                                                  02197000
ASCFBDIC EQU   ASCFLG2                                                  02198000
ASCFBAIC EQU   ASCFLG2                                                  02199000
ASCPASTR EQU   ASCFLG1                                                  02200000
ASCFSR   EQU   ASCFLG1                                                  02201000
ASCFBD   EQU   ASCFLG1                                                  02202000
ASCFBA   EQU   ASCFLG1                                                  02203000
ASCPFCRR EQU   ISTASCRR                                                 02204000
CCFRSVD1 EQU   CFCCRT                                                   02205000
CCFCR2   EQU   CFCCRT                                                   02206000
CCFCRP   EQU   CFCCRT                                                   02207000
CCFCR1   EQU   CFCCRT                                                   02208000
CCFCS2   EQU   CFCCRT                                                   02209000
CCFCS1   EQU   CFCCRT                                                   02210000
NCFRSVD  EQU   CFCNTRD                                                  02211000
NCFCR2   EQU   CFCNTRD                                                  02212000
NCFCRP   EQU   CFCNTRD                                                  02213000
NCFCR1   EQU   CFCNTRD                                                  02214000
NCFCS2   EQU   CFCNTRD                                                  02215000
NCFCS1   EQU   CFCNTRD                                                  02216000
PFCRSV01 EQU   ISTPFCRR+13                                              02217000
PFCFTA   EQU   ISTPFCRR+12                                              02218000
CRRFRR   EQU   PFCFRRO                                                  02219000
CRRCHAIN EQU   PFCCRRO                                                  02220000
CRRLEN   EQU   PFCCRRLN                                                 02221000
PFCRSV10 EQU   PFCCRR+1                                                 02222000
CRRID    EQU   PFCCRRID                                                 02223000
DNCZC001 EQU   DNCOS+40                                                 02224000
DNCLOCK  EQU   DNCOS+36                                                 02225000
DNCZV005 EQU   DNCOS+32                                                 02226000
DNCZV004 EQU   DNCOS+28                                                 02227000
DNCZV003 EQU   DNCOS+24                                                 02228000
DNCZV002 EQU   DNCOS+21                                                 02229000
DNCZX001 EQU   DNCOS+20                                                 02230000
DNCZV001 EQU   DNCOS+17                                                 02231000
DNCZX003 EQU   DNCOS+16                                                 02232000
DNCZV000 EQU   DNCOS+12                                                 02233000
DNCSESCQ EQU   DNCOS+8                                                  02234000
DNCSESIQ EQU   DNCOS+4                                                  02235000
DNCACIP  EQU   DNCBSCED+1                                               02236000
DNCLICP  EQU   DNCBSCED                                                 02237000
DNCZF008 EQU   DNCZFLGS+1                                               02238000
DNCZPSRD EQU   DNCZFLGS+1                                               02239000
DNCPSOL  EQU   DNCZFLGS+1                                               02240000
DNCZF007 EQU   DNCZFLGS+1                                               02241000
DNCZF006 EQU   DNCZFLGS+1                                               02242000
DNCZF005 EQU   DNCZFLGS+1                                               02243000
DNCZF004 EQU   DNCZFLGS+1                                               02244000
DNCZF003 EQU   DNCZFLGS                                                 02245000
DNCZF002 EQU   DNCZFLGS                                                 02246000
DNCZRSCH EQU   DNCZFLGS                                                 02247000
DNCDISC  EQU   DNCZFLGS                                                 02248000
DNCCONT  EQU   DNCZFLGS                                                 02249000
DNCINVIT EQU   DNCZFLGS                                                 02250000
DNCSESS  EQU   DNCZFLGS                                                 02251000
DNCZF001 EQU   DNCZFLGS                                                 02252000
DNCNCB   EQU   ISTDNCB                                                  02253000
NCBRSV01 EQU   ISTNCB+46                                                02254000
NCBSWDAF EQU   ISTNCB+44                                                02255000
NCBDEVCH EQU   ISTNCB+36                                                02256000
NCBFMCBP EQU   ISTNCB+32                                                02257000
NCBLTRC  EQU   ISTNCB+30                                                02258000
NCBRVPT1 EQU   ISTNCB+28                                                02259000
NCBNMLLN EQU   NCBFLAGS+3                                               02260000
@NM00052 EQU   NCBFLAG1                                                 02261000
NCBFORCE EQU   NCBFLAG1                                                 02262000
NCBTTF   EQU   NCBFLAG1                                                 02263000
NCBRSYNC EQU   NCBFLAG1                                                 02264000
NCBRSTRT EQU   NCBFLAG1                                                 02265000
NCBCONF  EQU   NCBFLAG1                                                 02266000
NCBSNAI  EQU   NCBFLAG1                                                 02267000
NCBFLTIO EQU   NCBFTRIO                                                 02268000
NCBCSTAT EQU   NCBFLAGS                                                 02269000
NCBNCSL  EQU   ISTNCB+22                                                02270000
NCBNCBA  EQU   ISTNCB+20                                                02271000
NCBFMCBA EQU   ISTNCB+16                                                02272000
NCBNSNA  EQU   ISTNCB+12                                                02273000
NCBTSKID EQU   ISTNCB+8                                                 02274000
NCBRDTE  EQU   ISTNCB+4                                                 02275000
NCBDAF   EQU   ISTNCB+2                                                 02276000
NCBLNGTH EQU   ISTNCB+1                                                 02277000
NCBTYPE  EQU   ISTNCB                                                   02278000
ATCAOS   EQU   ISTATCVT+1584                                            02279000
ATCPOPAB EQU   ATCAOSM+640                                              02280000
ATCVIOPM EQU   ATCAOSM+636                                              02281000
ATCTPMMI EQU   ATCAOSM+632                                              02282000
ATCTPMPB EQU   ATCAOSM+600                                              02283000
ATCRSV88 EQU   ATCAOSM+596                                              02284000
ATCRPLCT EQU   ATCAOSM+594                                              02285000
ATCCRACT EQU   ATCAOSM+592                                              02286000
ATCSRBCT EQU   ATCAOSM+590                                              02287000
ATCRSV75 EQU   ATCAOSM+589                                              02288000
ATCRSV66 EQU   ATCZFLAG                                                 02289000
ATCZF001 EQU   ATCZFLAG                                                 02290000
ATCTPCP1 EQU   ATCAOSM+584                                              02291000
ATCTPCP0 EQU   ATCAOSM+580                                              02292000
ATCAICTN EQU   ATCAOSM+576                                              02293000
ATCZR01  EQU   ATCAOSM+572                                              02294000
ATCMPLTA EQU   ATCAOSM+568                                              02295000
ATCASCB  EQU   ATCAOSM+564                                              02296000
ATCAP86  EQU   ATCAOSM+560                                              02297000
ATCAP85  EQU   ATCAOSM+556                                              02298000
ATCAP84  EQU   ATCAOSM+552                                              02299000
ATCAP83  EQU   ATCAOSM+548                                              02300000
ATCAP82  EQU   ATCAOSM+544                                              02301000
ATCAP69  EQU   ATCAOSM+540                                              02302000
ATCAP66  EQU   ATCAOSM+536                                              02303000
ATCAP62  EQU   ATCAOSM+532                                              02304000
ATCAPC59 EQU   ATCAOSM+528                                              02305000
ATCAP56  EQU   ATCAOSM+524                                              02306000
ATCAP55  EQU   ATCAOSM+520                                              02307000
ATCRCFY0 EQU   ATCAOSM+516                                              02308000
ATCAP41  EQU   ATCAOSM+512                                              02309000
ATCAPC25 EQU   ATCAOSM+508                                              02310000
ATCAP23  EQU   ATCAOSM+504                                              02311000
ATCTPSPB EQU   ATCAOSM+472                                              02312000
ATCTRMPB EQU   ATCAOSM+440                                              02313000
ATCAPBE  EQU   ATCAOSM+436                                              02314000
ATCPSTA  EQU   ATCAOSM+432                                              02315000
ATCSMABF EQU   ATCAOSM+428                                              02316000
ATCSMAPR EQU   ATCAOSM+424                                              02317000
ATCTPWQA EQU   ATCAOSM+420                                              02318000
ATCSMAID EQU   ATCAOSM+416                                              02319000
ATCSMARA EQU   ATCAOSM+412                                              02320000
ATCCACXA EQU   ATCAOSM+408                                              02321000
ATCZLAAB EQU   ATCAOSM+404                                              02322000
ATCATA10 EQU   ATCAOSM+400                                              02323000
ATCHLTCB EQU   ATCAOSM+396                                              02324000
@NM00051 EQU   ATCVTFLG                                                 02325000
ATCVTACT EQU   ATCVTFLG                                                 02326000
ATCRPT40 EQU   ATCAOSM+388                                              02327000
ATCRPT39 EQU   ATCAOSM+384                                              02328000
ATCRPT38 EQU   ATCAOSM+380                                              02329000
ATCRPT37 EQU   ATCAOSM+376                                              02330000
ATCRPT36 EQU   ATCAOSM+372                                              02331000
ATCRPT35 EQU   ATCAOSM+368                                              02332000
ATCRPT34 EQU   ATCAOSM+364                                              02333000
ATCRPT33 EQU   ATCAOSM+360                                              02334000
ATCRPT32 EQU   ATCAOSM+356                                              02335000
ATCRPT31 EQU   ATCAOSM+352                                              02336000
ATCRPT30 EQU   ATCAOSM+348                                              02337000
ATCRPT29 EQU   ATCAOSM+344                                              02338000
ATCRPT28 EQU   ATCAOSM+340                                              02339000
ATCRPT27 EQU   ATCAOSM+336                                              02340000
@NM00050 EQU   ATCAOSM+333                                              02341000
@NM00049 EQU   @NM00048                                                 02342000
ATCSNUF  EQU   @NM00048                                                 02343000
ATCOPKL  EQU   @NM00048                                                 02344000
ATCABEN  EQU   @NM00048                                                 02345000
ATCAIWT  EQU   ATCAOSM+328                                              02346000
ATCINFDD EQU   ATCAOSM+324                                              02347000
ATCORFMG EQU   ATCAOSM+320                                              02348000
ATCORFRL EQU   ATCAOSM+316                                              02349000
ATCOROBT EQU   ATCAOSM+312                                              02350000
ATCORQG  EQU   ATCORSRB                                                 02351000
ATCORTBF EQU   ATCSQAFR                                                 02352000
ATCRPLAC EQU   ATCRPLCN+2                                               02353000
ATCRPLRC EQU   ATCRPLCN                                                 02354000
ATCCRPLQ EQU   ATCCRPL                                                  02355000
ATCSRBAC EQU   ATCSRBCN+2                                               02356000
ATCSRBRC EQU   ATCSRBCN                                                 02357000
ATCSRBQ  EQU   ATCSRB                                                   02358000
ATCCRAAC EQU   ATCCRACN+2                                               02359000
ATCCRARC EQU   ATCCRACN                                                 02360000
ATCCRAQ  EQU   ATCCRA                                                   02361000
ATCRPT12 EQU   ATCAOSM+276                                              02362000
ATCDMAPP EQU   ATCAOSM+272                                              02363000
ATCAP38  EQU   ATCAOSM+268                                              02364000
ATCZDFJ0 EQU   ATCAOSM+260                                              02365000
ATCAP51  EQU   ATCAOSM+256                                              02366000
ATCZPAB2 EQU   ATCAOSM+224                                              02367000
ATCZPAB1 EQU   ATCAOSM+192                                              02368000
ATCZLFVT EQU   ATCAOSM+188                                              02369000
ATCZLPVT EQU   ATCAOSM+184                                              02370000
ATCZDVTX EQU   ATCAOSM+180                                              02371000
ATCZDVTA EQU   ATCAOSM+176                                              02372000
ATCZDVT9 EQU   ATCAOSM+172                                              02373000
ATCZDVT8 EQU   ATCAOSM+168                                              02374000
ATCZDVT7 EQU   ATCAOSM+164                                              02375000
ATCRSV56 EQU   ATCDAPVT+22                                              02376000
ATCDAPDG EQU   ATCDAPVT+20                                              02377000
ATCDXCEA EQU   ATCDAPVT+16                                              02378000
ATCDCEA  EQU   ATCDAPVT+12                                              02379000
ATCDPCIA EQU   ATCDAPVT+8                                               02380000
ATCDSIOA EQU   ATCDAPVT+4                                               02381000
ATCDEOEA EQU   ATCDAPVT                                                 02382000
ATCZLAEA EQU   ATCLDAPP+16                                              02383000
ATCZLCEA EQU   ATCLDAPP+12                                              02384000
ATCRSV17 EQU   ATCLDAPP+8                                               02385000
ATCSMFRR EQU   ATCLDAPP+4                                               02386000
ATCCDTID EQU   ATCLDAPP                                                 02387000
ATCZAEA  EQU   ATCICAPP+16                                              02388000
ATCZCEA  EQU   ATCICAPP+12                                              02389000
ATCCDTCB EQU   ATCICAPP+8                                               02390000
ATCZSIOA EQU   ATCICAPP+4                                               02391000
ATCCDRPH EQU   ATCICAPP                                                 02392000
ATCAP65  EQU   ATCAOSM+96                                               02393000
ATCZDVT6 EQU   ATCAOSM+92                                               02394000
ATCZDVT4 EQU   ATCAOSM+88                                               02395000
ATCZDVT3 EQU   ATCAOSM+84                                               02396000
ATCZDVT1 EQU   ATCAOSM+80                                               02397000
ATCICNCB EQU   ATCAOSM+76                                               02398000
ATCZFSVT EQU   ATCAOSM+68                                               02399000
ATCAP64  EQU   ATCAOSM+64                                               02400000
ATCAP63  EQU   ATCAOSM+60                                               02401000
ATCAP61  EQU   ATCAOSM+56                                               02402000
ATCAP58  EQU   ATCAOSM+52                                               02403000
ATCAP57  EQU   ATCAOSM+48                                               02404000
ATCAP54  EQU   ATCAOSM+44                                               02405000
ATCAP53  EQU   ATCAOSM+40                                               02406000
ATCAP52  EQU   ATCAOSM+36                                               02407000
ATCAP32  EQU   ATCAOSM+28                                               02408000
ATCAP31  EQU   ATCAOSM+24                                               02409000
ATCAP12  EQU   ATCAOSM+20                                               02410000
ATCAP11  EQU   ATCAOSM+16                                               02411000
ATCCMTCB EQU   ATCAOSM+12                                               02412000
ATCPRPH  EQU   ATCAOSM+8                                                02413000
ATCGSRBF EQU   ATCGSRBG                                                 02414000
ATCSRBRT EQU   ATCAOSM                                                  02415000
@NM00047 EQU   @NM00046                                                 02416000
ATCVTMAB EQU   @NM00046                                                 02417000
@NM00045 EQU   ATCVTBAM                                                 02418000
ATCVDLOK EQU   ISTATCVT+904                                             02419000
ATCVFPAB EQU   ISTATCVT+872                                             02420000
ATCVDPAB EQU   ISTATCVT+840                                             02421000
ATCIOECB EQU   ISTATCVT+836                                             02422000
ATCINCW3 EQU   ISTATCVT+832                                             02423000
ATCMODTB EQU   ISTATCVT+828                                             02424000
ATCUSSPT EQU   ISTATCVT+824                                             02425000
ATCSRTAB EQU   ISTATCVT+820                                             02426000
@NM00044 EQU   ISTATCVT+819                                             02427000
@NM00043 EQU   ATCSTAT2                                                 02428000
ATCTRSMS EQU   ATCSTAT2                                                 02429000
ATCTRLOK EQU   ATCSTAT2                                                 02430000
ATCTRPSS EQU   ATCSTAT2                                                 02431000
ATCTRESC EQU   ATCSTAT2                                                 02432000
ATCTRAPI EQU   ATCSTAT2                                                 02433000
ATCNMCTR EQU   ISTATCVT+816                                             02434000
ATCSEC51 EQU   ATCSECST                                                 02435000
ATCSEC40 EQU   ATCSIPD+8                                                02436000
ATCSEC30 EQU   ATCSIPD+4                                                02437000
ATCSEC21 EQU   ATCSIPD                                                  02438000
ATCSEC10 EQU   ATCSOPD+4                                                02439000
ATCSEC01 EQU   ATCSOPD                                                  02440000
ATCPOIA  EQU   ATCRNO+1                                                 02441000
@NM00042 EQU   ATCRNO                                                   02442000
ATCPODVT EQU   ISTATCVT+784                                             02443000
ATCS49XL EQU   ISTATCVT+780                                             02444000
ATCS49XI EQU   ISTATCVT+776                                             02445000
ATCLCLCT EQU   ATCVLCNT+2                                               02446000
ATCRNCNT EQU   ATCVLCNT                                                 02447000
ATCCFEAD EQU   ISTATCVT+768                                             02448000
ATCPTR00 EQU   ISTATCVT+736                                             02449000
ATCRSV10 EQU   ISTATCVT+704                                             02450000
ATCTACB  EQU   ISTATCVT+700                                             02451000
ATCVTINM EQU   ISTATCVT+696                                             02452000
ATCTCLIM EQU   ISTATCVT+692                                             02453000
ATCTCLOM EQU   ISTATCVT+688                                             02454000
ATCVTIPB EQU   ISTATCVT+656                                             02455000
ATCTCIPB EQU   ISTATCVT+624                                             02456000
ATCTIPAB EQU   ISTATCVT+592                                             02457000
ATCOCCCB EQU   ISTATCVT+588                                             02458000
ATCOCCOB EQU   ISTATCVT+584                                             02459000
ATCCDLAD EQU   ISTATCVT+580                                             02460000
ATCCCLAD EQU   ISTATCVT+576                                             02461000
ATCDLRPB EQU   ISTATCVT+544                                             02462000
ATCPGPAB EQU   ISTATCVT+512                                             02463000
ATCVPAB1 EQU   ISTATCVT+480                                             02464000
ATCRSV97 EQU   ISTATCVT+476                                             02465000
ATCRDTLK EQU   ISTATCVT+472                                             02466000
ATCVOCLK EQU   ISTATCVT+468                                             02467000
ATCCDFDN EQU   ISTATCVT+464                                             02468000
ATCCDFIN EQU   ISTATCVT+460                                             02469000
ATCDVTLK EQU   ISTATCVT+456                                             02470000
ATCAP36  EQU   ISTATCVT+452                                             02471000
ATCAP35  EQU   ISTATCVT+448                                             02472000
ATCAP33  EQU   ISTATCVT+444                                             02473000
ATCRSV99 EQU   ISTATCVT+440                                             02474000
ATCONFIG EQU   ISTATCVT+432                                             02475000
ATCNODDS EQU   ISTATCVT+428                                             02476000
ATCNODEL EQU   ISTATCVT+420                                             02477000
ATCRSV69 EQU   ISTATCVT+416                                             02478000
ATCAPCR5 EQU   ISTATCVT+412                                             02479000
ATCLDECB EQU   ISTATCVT+408                                             02480000
ATCLDNCS EQU   ISTATCVT+404                                             02481000
ATCCDPTR EQU   ISTATCVT+400                                             02482000
ATCADEL  EQU   ISTATCVT+396                                             02483000
ATCTODVT EQU   ISTATCVT+392                                             02484000
ATCDEBCH EQU   ISTATCVT+388                                             02485000
ATCHBSIZ EQU   ATCHPGM+2                                                02486000
ATCHBFNO EQU   ATCHPGM                                                  02487000
ATCCRME  EQU   ISTATCVT+380                                             02488000
ATCRVCHS EQU   ISTATCVT+372                                             02489000
ATCECTLP EQU   ISTATCVT+368                                             02490000
ATCZDVTB EQU   ISTATCVT+364                                             02491000
ATCECPRT EQU   ISTATCVT+360                                             02492000
ATCVTLOD EQU   ISTATCVT+356                                             02493000
ATCTRPAB EQU   ISTATCVT+352                                             02494000
ATCMSGM  EQU   ISTATCVT+348                                             02495000
ATCMSGP  EQU   ISTATCVT+344                                             02496000
ATCEPT   EQU   ISTATCVT+340                                             02497000
ATCDVT   EQU   ISTATCVT+336                                             02498000
ATCTRCPT EQU   ISTATCVT+332                                             02499000
ATCDVLOD EQU   ISTATCVT+328                                             02500000
ATCALERT EQU   ISTATCVT+324                                             02501000
ATCEPA   EQU   ISTATCVT+320                                             02502000
ATCSAF   EQU   ISTATCVT+318                                             02503000
ATCXRANG EQU   ISTATCVT+317                                             02504000
ATCLAST  EQU   ATCSHRFG                                                 02505000
ATCSHRTN EQU   ISTATCVT+308                                             02506000
ATCUEP   EQU   ISTATCVT+304                                             02507000
ATCOCRT  EQU   ISTATCVT+300                                             02508000
ATCCSMA  EQU   ATCCSMR                                                  02509000
ATCESC02 EQU   ISTATCVT+292                                             02510000
ATCESC01 EQU   ISTATCVT+288                                             02511000
ATCCDFND EQU   ISTATCVT+284                                             02512000
ATCCDDEL EQU   ISTATCVT+280                                             02513000
ATCCDADD EQU   ISTATCVT+276                                             02514000
ATCMNT   EQU   ISTATCVT+272                                             02515000
ATCRSV16 EQU   ISTATCVT+270                                             02516000
ATCMAXID EQU   ISTATCVT+269                                             02517000
ATCMSGSP EQU   ATCCOM+268                                               02518000
ATCCIDM  EQU   ATCCOM+266                                               02519000
ATCACTRM EQU   ATCCOM+264                                               02520000
ATCNERAP EQU   ATCCOM+260                                               02521000
ATCNESAL EQU   ATCCOM+256                                               02522000
ATCRCC65 EQU   ATCCOM+252                                               02523000
ATCRCC26 EQU   ATCCOM+248                                               02524000
ATCRCC63 EQU   ATCCOM+244                                               02525000
ATCRSV11 EQU   ATCCOM+242                                               02526000
ATCVTMID EQU   ATCCOM+240                                               02527000
ATCAPOST EQU   ATCCOM+236                                               02528000
ATCNERFN EQU   ATCCOM+232                                               02529000
ATCNERNE EQU   ATCCOM+228                                               02530000
ATCNERCV EQU   ATCCOM+224                                               02531000
ATCNERST EQU   ATCCOM+220                                               02532000
ATCDCC61 EQU   ATCCOM+216                                               02533000
ATCDCC60 EQU   ATCCOM+212                                               02534000
ATCSRTDF EQU   ATCCOM+208                                               02535000
ATCSRTAD EQU   ATCCOM+204                                               02536000
ATCFIRA  EQU   ATCCOM+200                                               02537000
ATCSMBQ  EQU   ATCCOM+196                                               02538000
ATCSMRC  EQU   ATCCOM+192                                               02539000
ATCSMRS  EQU   ATCCOM+188                                               02540000
ATCSMQU  EQU   ATCCOM+184                                               02541000
ATCSMRQ  EQU   ATCCOM+180                                               02542000
ATCACDA  EQU   ATCCOM+176                                               02543000
ATCSTMA  EQU   ATCCOM+172                                               02544000
ATCFRSTR EQU   ATCCOM+168                                               02545000
ATCGTSTR EQU   ATCCOM+164                                               02546000
ATCREADA EQU   ATCCOM+160                                               02547000
ATCALOAD EQU   ATCCOM+156                                               02548000
ATCBLDLA EQU   ATCCOM+152                                               02549000
ATCFBRPH EQU   ATCCOM+148                                               02550000
ATCBFTRC EQU   ATCCOM+144                                               02551000
ATCTPBUF EQU   ATCTHTRC                                                 02552000
ATCREMOV EQU   ATCCOM+136                                               02553000
ATCADD   EQU   ATCCOM+132                                               02554000
ATCBPDA  EQU   ATCCOM+128                                               02555000
ATCDVTPT EQU   ATCCOM+124                                               02556000
ATCFEPT  EQU   ATCCOM+120                                               02557000
ATCFDVT  EQU   ATCCOM+116                                               02558000
ATCCONFT EQU   ATCCOM+112                                               02559000
ATCPTCHA EQU   ATCCOM+108                                               02560000
ATCAUTHA EQU   ATCCOM+104                                               02561000
ATCACCTA EQU   ATCCOM+100                                               02562000
ATCRDTH  EQU   ATCCOM+96                                                02563000
ATCFRSCH EQU   ATCCOM+92                                                02564000
ATCFSB   EQU   ATCCOM+88                                                02565000
ATCHLTMS EQU   ATCCOM+84                                                02566000
ATCECPRM EQU   ATCCOM+80                                                02567000
ATCECNET EQU   ATCCOM+76                                                02568000
ATCECOPC EQU   ATCCOM+72                                                02569000
ATCVPARM EQU   ATCCOM+68                                                02570000
ATCECVRQ EQU   ATCCOM+64                                                02571000
ATCECSES EQU   ATCCOM+60                                                02572000
ATCOCHA  EQU   ATCCOM+56                                                02573000
ATCDSPLQ EQU   ATCCOM+52                                                02574000
ATCECDSP EQU   ATCCOM+48                                                02575000
ATCVARYQ EQU   ATCCOM+44                                                02576000
ATCECVRY EQU   ATCCOM+40                                                02577000
ATCHALTQ EQU   ATCCOM+36                                                02578000
ATCECHLT EQU   ATCCOM+32                                                02579000
ATCMODQ  EQU   ATCCOM+28                                                02580000
ATCECMOD EQU   ATCCOM+24                                                02581000
ATCASCHD EQU   ATCCOM+20                                                02582000
ATCSRT   EQU   ATCCOM+16                                                02583000
ATCRDT   EQU   ATCCOM+12                                                02584000
ATCDCFRR EQU   ATCCOM+8                                                 02585000
ATCAPI   EQU   ATCCOM+4                                                 02586000
ATCRSV04 EQU   ATCSTAT4                                                 02587000
ATCVTTRC EQU   ATCSTAT4                                                 02588000
ATCNCSD  EQU   ATCSTAT4                                                 02589000
ATCMTST  EQU   ATCSTAT4                                                 02590000
ATCTPRT  EQU   ATCSTAT4                                                 02591000
ATCPRTAT EQU   ATCSTAT4                                                 02592000
@NM00041 EQU   ATCPOFLG                                                 02593000
ATCPOUNS EQU   ATCPOFLG                                                 02594000
ATCHSDMF EQU   ATCSTFLG                                                 02595000
@NM00040 EQU   ATCSTAT1                                                 02596000
ATCMDHLT EQU   ATCSTAT1                                                 02597000
ATCINHLT EQU   ATCSTAT1                                                 02598000
ATCNETSL EQU   ATCSTAT1                                                 02599000
ATCQKHLT EQU   ATCSTAT1                                                 02600000
ATCSNHLT EQU   ATCSTAT1                                                 02601000
ATCACTIV EQU   ATCSTAT1                                                 02602000
ATCSTART EQU   ATCSTAT1                                                 02603000
DYPPAB   EQU   ISTDYPAB+16                                              02604000
DYPRSV01 EQU   ISTDYPAB+12                                              02605000
DYPTSKID EQU   ISTDYPAB+8                                               02606000
DYPCHAIN EQU   ISTDYPAB+4                                               02607000
DYPFLGS  EQU   ISTDYPAB+2                                               02608000
DYPLNGTH EQU   ISTDYPAB+1                                               02609000
DYPTYPE  EQU   ISTDYPAB                                                 02610000
LSCTLBAD EQU   ISTLSCB+28                                               02611000
LSCFDB2  EQU   LSCFDBA+1                                                02612000
LSCFDB1  EQU   LSCFDBA                                                  02613000
LSCLCCW1 EQU   ISTLSCB+12                                               02614000
LSCRRCNT EQU   LSCSEQ+1                                                 02615000
LSCRRCCT EQU   LSCSEQ                                                   02616000
LSCATOP  EQU   LSCFLGS                                                  02617000
LSCFREE  EQU   LSCFLGS                                                  02618000
LSCDSTAT EQU   LSCFLGS                                                  02619000
LSCEXRES EQU   LSCFLGS                                                  02620000
LSCZRIMM EQU   LSCFLGS                                                  02621000
LSCRSV01 EQU   LSCFLGS                                                  02622000
LSCSMODE EQU   LSCFLGS                                                  02623000
LSCZMIRC EQU   LSCRUCNT                                                 02624000
LSCCHAI2 EQU   LSCCHAIN+1                                               02625000
LSCCHNG  EQU   LSCCHAI1                                                 02626000
LSCZRTSC EQU   LSCZMNRC                                                 02627000
LSCZRT0B EQU   LSCZMNRC                                                 02628000
LSCZRT0A EQU   LSCZMNRC                                                 02629000
LSCZRTL9 EQU   LSCZRT09                                                 02630000
LSCZRTL8 EQU   LSCZRT08                                                 02631000
LSCZRTL7 EQU   LSCZRT07                                                 02632000
LSCZRTL6 EQU   LSCZRT06                                                 02633000
LSCZRTL5 EQU   LSCZRT05                                                 02634000
LSCZRTL4 EQU   LSCZRT04                                                 02635000
LSCZRTL3 EQU   LSCZRT03                                                 02636000
LSCZRTL2 EQU   LSCZRT02                                                 02637000
LSCZRT01 EQU   LSCREQTG                                                 02638000
LSCZRT00 EQU   LSCREQTG                                                 02639000
LSCLNGTH EQU   LSC1WORD+1                                               02640000
RPHNEXPO EQU   ISTRPH+104                                               02641000
RPHSAV16 EQU   RPHWORK+60                                               02642000
RPHSAV15 EQU   RPHWORK+56                                               02643000
RPHSAV14 EQU   RPHWORK+52                                               02644000
RPHSAV13 EQU   RPHWORK+48                                               02645000
RPHSAV12 EQU   RPHWORK+44                                               02646000
RPHSAV11 EQU   RPHWORK+40                                               02647000
RPHSAV10 EQU   RPHWORK+36                                               02648000
RPHSAVE9 EQU   RPHWORK+32                                               02649000
RPHSAVE8 EQU   RPHWORK+28                                               02650000
RPHSAVE7 EQU   RPHWORK+24                                               02651000
RPHSAVE6 EQU   RPHWORK+20                                               02652000
RPHSAVE5 EQU   RPHWORK+16                                               02653000
RPHSAVE4 EQU   RPHWORK+12                                               02654000
RPHSAVE3 EQU   RPHWORK+8                                                02655000
RPHSAVE2 EQU   RPHWORK+4                                                02656000
RPHSHALF EQU   RPHSAVE1+2                                               02657000
RPHSBIT8 EQU   RPHSBITS                                                 02658000
RPHSBIT7 EQU   RPHSBITS                                                 02659000
RPHSBIT6 EQU   RPHSBITS                                                 02660000
RPHSBIT5 EQU   RPHSBITS                                                 02661000
RPHSBIT4 EQU   RPHSBITS                                                 02662000
RPHSBIT3 EQU   RPHSBITS                                                 02663000
RPHSBIT2 EQU   RPHSBITS                                                 02664000
RPHSBIT1 EQU   RPHSBITS                                                 02665000
RPHSBYTE EQU   RPHSAVE1                                                 02666000
RPHPABQP EQU   RPHPABQA+1                                               02667000
RPHPABFG EQU   RPHPABQA                                                 02668000
RPHSRP34 EQU   RPHSRPRM+2                                               02669000
RPHSRP12 EQU   RPHSRPRM                                                 02670000
RPHWEGT  EQU   RPHCSPA                                                  02671000
RPHMAJCB EQU   ISTRPH+21                                                02672000
RPHPABOF EQU   ISTRPH+20                                                02673000
RPHRESUM EQU   RPHRESMA+1                                               02674000
RPHRSV01 EQU   RPHWPFLG                                                 02675000
RPHPURGE EQU   RPHWPFLG                                                 02676000
RPHPT    EQU   RPHWPFLG                                                 02677000
RPHWT    EQU   RPHWPFLG                                                 02678000
RPHRSKEY EQU   RPHWPFLG                                                 02679000
RPHDVTA  EQU   ISTRPH+12                                                02680000
RPHTIK   EQU   RPHTSKID+3                                               02681000
@NM00039 EQU   RPHTSKID                                                 02682000
RPHRPHAP EQU   RPHRPHA+1                                                02683000
@NM00038 EQU   RPHRPHA                                                  02684000
RPHGATE  EQU   RPHRPHA                                                  02685000
@NM00037 EQU   RPHFLGB                                                  02686000
RPHRLCRA EQU   RPHFLGB                                                  02687000
RPHNRSAV EQU   RPHFLGB                                                  02688000
RPHPGCMP EQU   RPHFLGB                                                  02689000
RPHFBAPS EQU   RPHFLGB                                                  02690000
RPHBSSP  EQU   RPHFLGB                                                  02691000
RPHLOCK  EQU   RPHFLGB                                                  02692000
RPHFNFLG EQU   RPHFSTLC                                                 02693000
RPHMLTCP EQU   RPHFLAGS                                                 02694000
RPHSMCLR EQU   RPHFLAGS                                                 02695000
RPHSMTYP EQU   RPHFLAGS                                                 02696000
RPHSMQ   EQU   RPHFLAGS                                                 02697000
RPHAUTEX EQU   RPHAPTYP                                                 02698000
RPHSPGIN EQU   RPHFLAGS                                                 02699000
RPHOGIND EQU   RPHFLAGS                                                 02700000
RPHLNGTH EQU   RPHCNTL+1                                                02701000
RPHTYPE  EQU   RPHCNTL                                                  02702000
ZCRRU    EQU   ZCRRHRU+3                                                02703000
ZCRRH    EQU   ZCRRHRU                                                  02704000
ZCRWORDA EQU   ISTZCRR+477                                              02705000
ZCRCMNRC EQU   ISTZCRR+476                                              02706000
ZCRRSV97 EQU   ZCRENTER+18                                              02707000
ZCREIC2B EQU   ZCRENTER+18                                              02708000
ZCREAC2B EQU   ZCRENTER+18                                              02709000
ZCRELCAB EQU   ZCRENTER+18                                              02710000
ZCREDCMF EQU   ZCRENTER+18                                              02711000
ZCREBCIF EQU   ZCRENTER+18                                              02712000
ZCREICSG EQU   ZCRENTER+18                                              02713000
ZCREDCK0 EQU   ZCRENTER+18                                              02714000
ZCRECFY0 EQU   ZCRENTER+17                                              02715000
ZCREKCCB EQU   ZCRENTER+17                                              02716000
ZCREDCNB EQU   ZCRENTER+17                                              02717000
ZCREICOE EQU   ZCRENTER+17                                              02718000
ZCREBCNB EQU   ZCRENTER+17                                              02719000
ZCREBC0L EQU   ZCRENTER+17                                              02720000
ZCREBCAL EQU   ZCRENTER+17                                              02721000
ZCREDCQR EQU   ZCRENTER+17                                              02722000
ZCREDCPR EQU   ZCRENTER+16                                              02723000
ZCREBCSB EQU   ZCRENTER+16                                              02724000
ZCREAC1R EQU   ZCRENTER+16                                              02725000
ZCRECCCI EQU   ZCRENTER+16                                              02726000
ZCRECCAI EQU   ZCRENTER+16                                              02727000
ZCRECCBI EQU   ZCRENTER+16                                              02728000
ZCREBCAR EQU   ZCRENTER+16                                              02729000
ZCREBCDR EQU   ZCRENTER+16                                              02730000
ZCREBCBR EQU   ZCRENTER+15                                              02731000
ZCREDCXR EQU   ZCRENTER+15                                              02732000
ZCREDCWB EQU   ZCRENTER+15                                              02733000
ZCREDCWR EQU   ZCRENTER+15                                              02734000
ZCREKCCN EQU   ZCRENTER+15                                              02735000
ZCREKCBN EQU   ZCRENTER+15                                              02736000
ZCREKCBB EQU   ZCRENTER+15                                              02737000
ZCREJC0B EQU   ZCRENTER+15                                              02738000
ZCREJCDB EQU   ZCRENTER+14                                              02739000
ZCREJCCB EQU   ZCRENTER+14                                              02740000
ZCREJCBB EQU   ZCRENTER+14                                              02741000
ZCREJCAB EQU   ZCRENTER+14                                              02742000
ZCREIC1B EQU   ZCRENTER+14                                              02743000
ZCREIC0B EQU   ZCRENTER+14                                              02744000
ZCREICX0 EQU   ZCRENTER+14                                              02745000
ZCREICWB EQU   ZCRENTER+14                                              02746000
ZCREICVB EQU   ZCRENTER+13                                              02747000
ZCREICUB EQU   ZCRENTER+13                                              02748000
ZCREICTB EQU   ZCRENTER+13                                              02749000
ZCREICSC EQU   ZCRENTER+13                                              02750000
ZCREICSB EQU   ZCRENTER+13                                              02751000
ZCREICRB EQU   ZCRENTER+13                                              02752000
ZCREICQB EQU   ZCRENTER+13                                              02753000
ZCREICQA EQU   ZCRENTER+13                                              02754000
ZCREICOB EQU   ZCRENTER+12                                              02755000
ZCREICOA EQU   ZCRENTER+12                                              02756000
ZCREICNB EQU   ZCRENTER+12                                              02757000
ZCREICNA EQU   ZCRENTER+12                                              02758000
ZCREICMB EQU   ZCRENTER+12                                              02759000
ZCREICLB EQU   ZCRENTER+12                                              02760000
ZCREICKG EQU   ZCRENTER+12                                              02761000
ZCREICKE EQU   ZCRENTER+12                                              02762000
ZCREICKB EQU   ZCRENTER+11                                              02763000
ZCREICJB EQU   ZCRENTER+11                                              02764000
ZCREICID EQU   ZCRENTER+11                                              02765000
ZCREICIB EQU   ZCRENTER+11                                              02766000
ZCREICHB EQU   ZCRENTER+11                                              02767000
ZCREICGB EQU   ZCRENTER+11                                              02768000
ZCREICEB EQU   ZCRENTER+11                                              02769000
ZCREICDB EQU   ZCRENTER+11                                              02770000
ZCREICCI EQU   ZCRENTER+10                                              02771000
ZCREICCB EQU   ZCRENTER+10                                              02772000
ZCREICBI EQU   ZCRENTER+10                                              02773000
ZCREICBB EQU   ZCRENTER+10                                              02774000
ZCREICAB EQU   ZCRENTER+10                                              02775000
ZCREICAA EQU   ZCRENTER+10                                              02776000
ZCREHCAN EQU   ZCRENTER+10                                              02777000
ZCREGC0B EQU   ZCRENTER+10                                              02778000
ZCREGC0A EQU   ZCRENTER+9                                               02779000
ZCREGCLA EQU   ZCRENTER+9                                               02780000
ZCREGCEB EQU   ZCRENTER+9                                               02781000
ZCREGCDB EQU   ZCRENTER+9                                               02782000
@NM00036 EQU   ZCRENTER+9                                               02783000
ZCREGCAB EQU   ZCRENTER+9                                               02784000
ZCREFCEB EQU   ZCRENTER+9                                               02785000
ZCREFCEA EQU   ZCRENTER+8                                               02786000
ZCREECTA EQU   ZCRENTER+8                                               02787000
ZCREECEA EQU   ZCRENTER+8                                               02788000
ZCREECDA EQU   ZCRENTER+8                                               02789000
ZCREECCB EQU   ZCRENTER+8                                               02790000
ZCREECCA EQU   ZCRENTER+8                                               02791000
ZCREECBB EQU   ZCRENTER+8                                               02792000
ZCREECBA EQU   ZCRENTER+8                                               02793000
ZCREDCMB EQU   ZCRENTER+7                                               02794000
ZCREDCL0 EQU   ZCRENTER+7                                               02795000
ZCREDCKB EQU   ZCRENTER+7                                               02796000
ZCREDCKA EQU   ZCRENTER+7                                               02797000
ZCREDCJ0 EQU   ZCRENTER+7                                               02798000
ZCREDCI0 EQU   ZCRENTER+7                                               02799000
ZCREDCH0 EQU   ZCRENTER+7                                               02800000
ZCREDCF0 EQU   ZCRENTER+7                                               02801000
ZCREDCE0 EQU   ZCRENTER+6                                               02802000
ZCREDCD0 EQU   ZCRENTER+6                                               02803000
ZCREDCC0 EQU   ZCRENTER+6                                               02804000
ZCREDCB0 EQU   ZCRENTER+6                                               02805000
ZCREDCA0 EQU   ZCRENTER+6                                               02806000
ZCRECC2B EQU   ZCRENTER+6                                               02807000
ZCRECC1B EQU   ZCRENTER+6                                               02808000
ZCRECC1A EQU   ZCRENTER+6                                               02809000
ZCRECC0B EQU   ZCRENTER+5                                               02810000
ZCRECC0A EQU   ZCRENTER+5                                               02811000
ZCREBC0B EQU   ZCRENTER+5                                               02812000
ZCREBC0A EQU   ZCRENTER+5                                               02813000
ZCREBCZ0 EQU   ZCRENTER+5                                               02814000
ZCREBCY0 EQU   ZCRENTER+5                                               02815000
ZCREBCX0 EQU   ZCRENTER+5                                               02816000
ZCREBCXA EQU   ZCRENTER+5                                               02817000
ZCREBCSC EQU   ZCRENTER+4                                               02818000
ZCREBCRB EQU   ZCRENTER+4                                               02819000
ZCREBCRA EQU   ZCRENTER+4                                               02820000
ZCREBCQB EQU   ZCRENTER+4                                               02821000
ZCREBCPB EQU   ZCRENTER+4                                               02822000
ZCREBCOB EQU   ZCRENTER+4                                               02823000
ZCREBCNE EQU   ZCRENTER+4                                               02824000
ZCREBCND EQU   ZCRENTER+4                                               02825000
ZCREBCMB EQU   ZCRENTER+3                                               02826000
ZCREBCLB EQU   ZCRENTER+3                                               02827000
ZCREBCLA EQU   ZCRENTER+3                                               02828000
ZCREBCKB EQU   ZCRENTER+3                                               02829000
ZCREBCKA EQU   ZCRENTER+3                                               02830000
ZCREBCJB EQU   ZCRENTER+3                                               02831000
ZCREBCJA EQU   ZCRENTER+3                                               02832000
ZCREBCID EQU   ZCRENTER+3                                               02833000
ZCREBCIB EQU   ZCRENTER+2                                               02834000
ZCREBCIA EQU   ZCRENTER+2                                               02835000
ZCREBCHB EQU   ZCRENTER+2                                               02836000
ZCREBCHA EQU   ZCRENTER+2                                               02837000
ZCREBCGB EQU   ZCRENTER+2                                               02838000
ZCREBCGA EQU   ZCRENTER+2                                               02839000
ZCREBCFB EQU   ZCRENTER+2                                               02840000
ZCREBCFA EQU   ZCRENTER+2                                               02841000
ZCREBCEB EQU   ZCRENTER+1                                               02842000
ZCREBCDI EQU   ZCRENTER+1                                               02843000
ZCREBCCB EQU   ZCRENTER+1                                               02844000
ZCREBCBI EQU   ZCRENTER+1                                               02845000
ZCREBCBB EQU   ZCRENTER+1                                               02846000
ZCREBCBA EQU   ZCRENTER+1                                               02847000
ZCREBCAM EQU   ZCRENTER+1                                               02848000
ZCREBCAI EQU   ZCRENTER+1                                               02849000
ZCREBCAG EQU   ZCRENTER                                                 02850000
ZCREBCAE EQU   ZCRENTER                                                 02851000
ZCREBCAB EQU   ZCRENTER                                                 02852000
ZCREBCAA EQU   ZCRENTER                                                 02853000
ZCREAC1B EQU   ZCRENTER                                                 02854000
ZCREAC0B EQU   ZCRENTER                                                 02855000
ZCREAC0A EQU   ZCRENTER                                                 02856000
ZCREAC1A EQU   ZCRENTER                                                 02857000
ZCRTNAME EQU   ZCRAUDIT+1                                               02858000
ZCRTID   EQU   ZCRAUDIT                                                 02859000
ZCRREMIC EQU   ISTZCRR+436                                              02860000
ZCRSAVEZ EQU   ISTZCRR+196                                              02861000
ZCRDAFSV EQU   ZCRCIDSV+2                                               02862000
ZCRSAFSV EQU   ZCRCIDSV                                                 02863000
ZCRR13SV EQU   ISTZCRR+188                                              02864000
ZCRR2SV  EQU   ISTZCRR+184                                              02865000
ZCROPCDE EQU   ISTZCRR+183                                              02866000
ZCRPRMTC EQU   ISTZCRR+182                                              02867000
ZCRRCDSV EQU   ISTZCRR+181                                              02868000
ZCRAWQSW EQU   ISTZCRR+180                                              02869000
ZCRTOPQ  EQU   ISTZCRR+180                                              02870000
ZCRXSCHD EQU   ISTZCRR+180                                              02871000
ZCRNXTEL EQU   ISTZCRR+180                                              02872000
ZCRSCANQ EQU   ISTZCRR+180                                              02873000
ZCRMOREL EQU   ISTZCRR+180                                              02874000
ZCRFBPRC EQU   ISTZCRR+180                                              02875000
ZCRFSBSV EQU   ISTZCRR+176                                              02876000
ZCRSVWK5 EQU   ZCRWKARA+16                                              02877000
ZCRSVWK4 EQU   ZCRWKARA+12                                              02878000
ZCRSVWK3 EQU   ZCRWKARA+8                                               02879000
ZCRSVWK2 EQU   ZCRWKARA+4                                               02880000
ZCRSVWK1 EQU   ZCRWKARA                                                 02881000
ZCRSVF25 EQU   ZCRSVRTN+96                                              02882000
ZCRSVF24 EQU   ZCRSVRTN+92                                              02883000
ZCRSVF23 EQU   ZCRSVRTN+88                                              02884000
ZCRSVF22 EQU   ZCRSVRTN+84                                              02885000
ZCRSVF21 EQU   ZCRSVRTN+80                                              02886000
ZCRSVF20 EQU   ZCRSVRTN+76                                              02887000
ZCRSVF19 EQU   ZCRSVRTN+72                                              02888000
ZCRSVF18 EQU   ZCRSVRTN+68                                              02889000
ZCRSVF17 EQU   ZCRSVRTN+64                                              02890000
ZCRSVF16 EQU   ZCRSVRTN+60                                              02891000
ZCRSVF15 EQU   ZCRSVRTN+56                                              02892000
ZCRSVF14 EQU   ZCRSVRTN+52                                              02893000
ZCRSVF13 EQU   ZCRSVRTN+48                                              02894000
ZCRSVF12 EQU   ZCRSVRTN+44                                              02895000
ZCRSVF11 EQU   ZCRSVRTN+40                                              02896000
ZCRSVF10 EQU   ZCRSVRTN+36                                              02897000
ZCRSVF9  EQU   ZCRSVRTN+32                                              02898000
ZCRSVF8  EQU   ZCRSVRTN+28                                              02899000
ZCRSVF7  EQU   ZCRSVRTN+24                                              02900000
ZCRSVF6  EQU   ZCRSVRTN+20                                              02901000
ZCRSVF5  EQU   ZCRSVRTN+16                                              02902000
ZCRSVF4  EQU   ZCRSVRTN+12                                              02903000
ZCRSVF3  EQU   ZCRSVRTN+8                                               02904000
ZCRSVF2  EQU   ZCRSVRTN+4                                               02905000
ZCRSVF1  EQU   ZCRSVRTN                                                 02906000
ZCRPVZB  EQU   ISTZCRR+52                                               02907000
ZCRZLB   EQU   ISTZCRR+48                                               02908000
ZCRBFPTR EQU   ISTZCRR+44                                               02909000
ZCRCCWA  EQU   ISTZCRR+40                                               02910000
ZCRPSW   EQU   ZCRPARMS+15                                              02911000
ZCRPCHAR EQU   ZCRPARMS+14                                              02912000
ZCRPRES2 EQU   ZCRPCOD2                                                 02913000
ZCRPMFGF EQU   ZCRPCOD2                                                 02914000
ZCRPFHDR EQU   ZCRPCOD2                                                 02915000
ZCRPPG2  EQU   ZCRPCOD2                                                 02916000
ZCRPRES  EQU   ZCRPCOD1                                                 02917000
ZCRPCFTX EQU   ZCRPCOD1                                                 02918000
ZCRPLSBQ EQU   ZCRPLSBF                                                 02919000
ZCRPFSB  EQU   ZCRPCOD1                                                 02920000
ZCRPLNG  EQU   ZCRPCOD1                                                 02921000
ZCRPPG   EQU   ZCRPCOD1                                                 02922000
ZCRDTODA EQU   ZCRDFRDA                                                 02923000
ZCRMLNG  EQU   ZCRPARMS+8                                               02924000
ZCRTBPTR EQU   ZCRPARMS+4                                               02925000
ZCRCBPTR EQU   ZCRFBPTR                                                 02926000
ZCRCRLCP EQU   ISTZCRR+20                                               02927000
@NM00035 EQU   ZCRSCPSW                                                 02928000
ZCRSKIPT EQU   ZCRSCPSW                                                 02929000
ZCRFSBWE EQU   ZCRSCPSW                                                 02930000
ZCRPRCMP EQU   ZCRSCPSW                                                 02931000
ZCRLREQ  EQU   ZCRSCPSW                                                 02932000
ZCRRJLCP EQU   ZCRSCPSW                                                 02933000
ZCRTPINV EQU   ZCRSCPSW                                                 02934000
ZCRTPEX  EQU   ZCRSCPSW                                                 02935000
@NM00034 EQU   ZCRIBPR                                                  02936000
ZCR3270  EQU   ZCRIBPR                                                  02937000
ZCRLCPFD EQU   ZCRIBPR                                                  02938000
ZCRLCPFR EQU   ZCRIBPR                                                  02939000
ZCRRELK  EQU   ZCRIBPR                                                  02940000
ZCRERR   EQU   ZCRIBPR                                                  02941000
ZCRNOBUF EQU   ZCRIBPR                                                  02942000
@NM00033 EQU   ZCRPFLGS                                                 02943000
ZCRQAHED EQU   ZCRPFLGS                                                 02944000
ZCRF1RES EQU   ZCRGENSW                                                 02945000
ZCRBRIS  EQU   ZCRGENSW                                                 02946000
ZCRCLRBD EQU   ZCRGENSW                                                 02947000
ZCREXRES EQU   ZCRGENSW                                                 02948000
ZCRLCSYN EQU   ZCRGENSW                                                 02949000
ZCRRT06  EQU   ZCRGENSW                                                 02950000
ZCRTSW2  EQU   ZCRGENSW                                                 02951000
ZCRTSW1  EQU   ZCRGENSW                                                 02952000
ZCRINLCP EQU   ZCRFLGS3                                                 02953000
ZCRWRPTR EQU   ZCRFLGS3                                                 02954000
ZCRNOFRE EQU   ZCRFLGS3                                                 02955000
ZCREDRIV EQU   ZCRFLGS3                                                 02956000
ZCRDISC  EQU   ZCRFLGS3                                                 02957000
ZCRTPDIS EQU   ZCRFLGS3                                                 02958000
ZCRTPCON EQU   ZCRFLGS3                                                 02959000
ZCRTIC   EQU   ZCRFLGS3                                                 02960000
ZCRCNLXL EQU   ZCRRESET                                                 02961000
ZCRENDAN EQU   ZCRSWFLD                                                 02962000
ZCRENDXL EQU   ZCRSWFLD                                                 02963000
ZCRENDX  EQU   ZCRSWFLD                                                 02964000
ZCROB1   EQU   ZCRNDLCP                                                 02965000
ZCRENDPR EQU   ZCRSWFLD                                                 02966000
ZCREXTYP EQU   ZCRSWFLD                                                 02967000
ZCRSLCP  EQU   ZCRENDSH                                                 02968000
ZCRIF0E3 EQU   ZCRFLGS2                                                 02969000
ZCRIF0E2 EQU   ZCRFLGS2                                                 02970000
ZCRIF0E1 EQU   ZCRFLGS2                                                 02971000
ZCROB    EQU   ZCRFLGS2                                                 02972000
ZCRFMSED EQU   ZCRFLGS2                                                 02973000
ZCRSHEDI EQU   ZCRFLGS2                                                 02974000
ZCRLOCAL EQU   ZCRFLGS2                                                 02975000
ZCRFEXIT EQU   ZCRFLGS1                                                 02976000
ZCRUNSOL EQU   ZCRFLGS1                                                 02977000
ZCRENDLP EQU   ZCRFLGS1                                                 02978000
ZCRNRMEX EQU   ZCRFLGS1                                                 02979000
ZCRWAIT  EQU   ZCRFLGS1                                                 02980000
ZCRDEQSW EQU   ZCRFLGS1                                                 02981000
ZCRQUESW EQU   ZCRFLGS1                                                 02982000
ZCREXSW  EQU   ZCRFLGS1                                                 02983000
ZCRFRRA  EQU   ISTZCRR+8                                                02984000
ZCRCHAIN EQU   ISTZCRR+4                                                02985000
ZCRFLAG  EQU   ZCRCRR+3                                                 02986000
ZCRLEN   EQU   ZCRCRR+1                                                 02987000
ZCRID    EQU   ZCRCRR                                                   02988000
LCPFTYPE EQU   LCPRPHA                                                  02989000
LCPRSTQH EQU   LCPLCCW                                                  02990000
LCPCLREP EQU   ISTLCPB+44                                               02991000
LCPUBFSB EQU   LCPFLCCW                                                 02992000
LCPRSV77 EQU   ISTLCPB+39                                               02993000
LCPLCCWC EQU   ISTLCPB+38                                               02994000
LCPRSV78 EQU   LCPFLG1                                                  02995000
LCPTRANS EQU   LCPFLG1                                                  02996000
LCPSTLB  EQU   LCPFLG1                                                  02997000
LCPREDRV EQU   LCPFLG1                                                  02998000
LCPDIRPT EQU   LCPFLG1                                                  02999000
LCPINTER EQU   LCPFLG1                                                  03000000
LCPRESET EQU   LCPFLG1                                                  03001000
LCPSTYPE EQU   ISTLCPB+36                                               03002000
LCPFSNCH EQU   ISTLCPB+34                                               03003000
LCPFOSN  EQU   ISTLCPB+32                                               03004000
LCPTLBAD EQU   ISTLCPB+28                                               03005000
LCPFDB2  EQU   LCPFDBA+1                                                03006000
LCPFDB1  EQU   LCPFDBA                                                  03007000
LCPNXLCW EQU   ISTLCPB+20                                               03008000
LCPDAF   EQU   LCPCID+2                                                 03009000
LCPSAF   EQU   LCPCID                                                   03010000
LCPLCCW1 EQU   ISTLCPB+12                                               03011000
LCPRRCNT EQU   LCPSEQ+1                                                 03012000
LCPRRCCT EQU   LCPSEQ                                                   03013000
LCPATOP  EQU   LCPFLAG2                                                 03014000
LCPFREE  EQU   LCPFLAG2                                                 03015000
LCPDSTAT EQU   LCPFLAG2                                                 03016000
LCPEXRES EQU   LCPFID0                                                  03017000
LCPZRIMM EQU   LCPTLBPI                                                 03018000
LCPRSTRT EQU   LCPFLAG2                                                 03019000
LCPASYN  EQU   LCPFLAG2                                                 03020000
LCPPRFLG EQU   LCPFLAG2                                                 03021000
LCPZMIRC EQU   LCPRUCNT                                                 03022000
LCPCHAI2 EQU   LCPCHAIN+1                                               03023000
LCPCHNG  EQU   LCPCHAI1                                                 03024000
LCPZRT0B EQU   LCPMNRCD                                                 03025000
LCPZRT0A EQU   LCPMNRCD                                                 03026000
LCPZRTL9 EQU   LCPZRT09                                                 03027000
LCPZRTL8 EQU   LCPZRT08                                                 03028000
LCPZRTL7 EQU   LCPZRT07                                                 03029000
LCPZRTL6 EQU   LCPZRT06                                                 03030000
LCPZRTL5 EQU   LCPZRT05                                                 03031000
LCPZRTL4 EQU   LCPZRT04                                                 03032000
LCPZRTL3 EQU   LCPZRT03                                                 03033000
LCPZRTL2 EQU   LCPZRT02                                                 03034000
LCPZRT01 EQU   LCPFLAGS                                                 03035000
LCPZRT00 EQU   LCPFLAGS                                                 03036000
LCPLNGTH EQU   ISTLCPB+1                                                03037000
LCPTYPE  EQU   ISTLCPB                                                  03038000
FMCFLRSV EQU   FMCFLGB                                                  03039000
FMCFLGA8 EQU   FMCFLGB                                                  03040000
FMCCLRPH EQU   FMCVS1+45                                                03041000
FMCRSV0X EQU   FMCCVFLG                                                 03042000
FMCVYRPH EQU   FMCCVFLG                                                 03043000
FMCZV004 EQU   FMCVS1+40                                                03044000
FMCLOCK2 EQU   FMCVS1+36                                                03045000
@NM00032 EQU   FMCZFLG2                                                 03046000
FMCZF027 EQU   FMCZFLG2                                                 03047000
FMCZF026 EQU   FMCZFLG2                                                 03048000
FMCSEQ1B EQU   FMCSEQ1                                                  03049000
FMCSEQ1T EQU   FMCSEQ1                                                  03050000
FMCZX006 EQU   FMCVS1+33                                                03051000
FMCZX005 EQU   FMCVS1+32                                                03052000
FMCZX004 EQU   FMCVS1+31                                                03053000
FMCZX003 EQU   FMCVS1+30                                                03054000
FMCZX002 EQU   FMCVS1+29                                                03055000
FMCZX001 EQU   FMCVS1+28                                                03056000
FMCZV001 EQU   FMCVS1+24                                                03057000
FMCAWATQ EQU   FMCLCPAQ+1                                               03058000
@NM00031 EQU   FMCLCPAQ                                                 03059000
FMCLCPB2 EQU   FMCLCPBQ+1                                               03060000
FMCLCPB1 EQU   FMCLCPBQ                                                 03061000
FMCASCDQ EQU   FMCSHEAQ+1                                               03062000
@NM00030 EQU   FMCSHEAQ                                                 03063000
FMCSHEDQ EQU   FMCVS1+8                                                 03064000
FMCZFCSQ EQU   FMCVS1+6                                                 03065000
FMCZH001 EQU   FMCVS1+4                                                 03066000
FMCZF025 EQU   FMCZFLAG+3                                               03067000
FMCZF024 EQU   FMCZFLAG+3                                               03068000
FMCZF023 EQU   FMCZFLAG+3                                               03069000
FMCZF022 EQU   FMCZFLAG+3                                               03070000
FMCZF021 EQU   FMCZFLAG+3                                               03071000
FMCZF020 EQU   FMCZFLAG+3                                               03072000
FMCZF019 EQU   FMCZFLAG+3                                               03073000
FMCZF018 EQU   FMCZFLAG+3                                               03074000
FMCZF017 EQU   FMCZFLAG+2                                               03075000
FMCZF016 EQU   FMCZFLAG+2                                               03076000
FMCZF015 EQU   FMCZFLAG+2                                               03077000
FMCZF014 EQU   FMCZFLAG+2                                               03078000
FMCZF013 EQU   FMCZFLAG+2                                               03079000
FMCZF012 EQU   FMCZFLAG+2                                               03080000
FMCZF011 EQU   FMCZFLAG+2                                               03081000
FMCZF010 EQU   FMCZFLAG+2                                               03082000
FMCZF00F EQU   FMCZFLAG+1                                               03083000
FMCZF00E EQU   FMCZFLAG+1                                               03084000
FMCZF00D EQU   FMCZFLAG+1                                               03085000
FMCZF00C EQU   FMCZFLAG+1                                               03086000
FMCZF00B EQU   FMCZFLAG+1                                               03087000
FMCRSV10 EQU   FMCZFLAG+1                                               03088000
FMCZF009 EQU   FMCZFLAG+1                                               03089000
FMCZFD06 EQU   FMCZF006+1                                               03090000
FMCZFC06 EQU   FMCZF006                                                 03091000
FMCZFB06 EQU   FMCZF006                                                 03092000
FMCZFA06 EQU   FMCZF006                                                 03093000
FMCZF005 EQU   FMCZFLAG                                                 03094000
FMCZF004 EQU   FMCZFLAG                                                 03095000
FMCZF003 EQU   FMCZFLAG                                                 03096000
FMCZF002 EQU   FMCZFLAG                                                 03097000
FMCZF001 EQU   FMCZFLAG                                                 03098000
FMCFRESA EQU   ISTFMCB+228                                              03099000
FMCSCSQN EQU   FMCSNCTL+2                                               03100000
FMCSCCTL EQU   FMCSNCTL+1                                               03101000
FMCSTCTL EQU   FMCSCFLG                                                 03102000
FMCSCCLO EQU   FMCSCFLG                                                 03103000
FMCAPRO  EQU   FMCSCFLG                                                 03104000
FMCLURO  EQU   FMCSCFLG                                                 03105000
FMCOBSAC EQU   FMCSCFLG                                                 03106000
FMCIBSAC EQU   FMCSCFLG                                                 03107000
FMCFBRE  EQU   ISTFMCB+220                                              03108000
FMCFBXM  EQU   FMCZV002                                                 03109000
FMCASEGQ EQU   ISTFMCB+212                                              03110000
FMCRDTPT EQU   ISTFMCB+208                                              03111000
FMCLOCK  EQU   ISTFMCB+204                                              03112000
FMCSEGD  EQU   FMCSSEGQ                                                 03113000
FMCRSPLM EQU   ISTFMCB+198                                              03114000
FMCPSTRS EQU   ISTFMCB+196                                              03115000
@NM00029 EQU   FMCRRESP                                                 03116000
FMCTSLHA EQU   FMCRRESP                                                 03117000
FMCFRRN  EQU   FMCRRESP                                                 03118000
FMCFME   EQU   FMCRRESP                                                 03119000
FMCFEX   EQU   FMCRRESP                                                 03120000
FMCFPE   EQU   FMCRRESP                                                 03121000
FMCCTLB  EQU   ISTFMCB+194                                              03122000
FMCBSQNO EQU   FMCCLSEQ+2                                               03123000
FMCTSQNO EQU   FMCCLSEQ                                                 03124000
FMCOBPRG EQU   FMCMODEB                                                 03125000
FMCIBPRG EQU   FMCMODEB                                                 03126000
FMCRESOT EQU   FMCMODEB                                                 03127000
FMCRSTSR EQU   FMCMODEB                                                 03128000
FMCLUQ   EQU   FMCMODEB                                                 03129000
FMCAPQ   EQU   FMCMODEB                                                 03130000
FMCCLEAR EQU   FMCMODEB                                                 03131000
FMCHOLD  EQU   FMCMODEB                                                 03132000
FMCIPSEQ EQU   ISTFMCB+188                                              03133000
FMCLUSTR EQU   ISTFMCB+187                                              03134000
FMCRSV87 EQU   FMCSTAT2                                                 03135000
FMCSEQI  EQU   FMCSTAT2                                                 03136000
FMCCPIP  EQU   FMCSTAT2                                                 03137000
FMCALIPR EQU   FMCSTAT2                                                 03138000
FMCIAIO  EQU   FMCSTAT2                                                 03139000
FMCZF00A EQU   FMCSTAT2                                                 03140000
FMCVPIP  EQU   FMCSTAT2                                                 03141000
FMCPRMRC EQU   FMCCLEXT+20                                              03142000
FMCRSV89 EQU   FMCPSTAT                                                 03143000
FMCPCLSD EQU   FMCPSTAT                                                 03144000
FMCDDOCD EQU   FMCPSTAT                                                 03145000
FMCIDVFD EQU   FMCPSTAT                                                 03146000
FMCELKST EQU   FMCPSTAT                                                 03147000
FMCRSV88 EQU   FMCPSCMD                                                 03148000
FMCRDBLK EQU   FMCPSCMD                                                 03149000
FMCDSEOC EQU   FMCPSCMD                                                 03150000
FMCPURGE EQU   FMCPSCMD                                                 03151000
FMCRESTI EQU   FMCPSCMD                                                 03152000
FMCCNTCT EQU   FMCPSCMD                                                 03153000
FMCINVT  EQU   FMCPSCMD                                                 03154000
FMCFLGB7 EQU   FMCFLGCL                                                 03155000
FMCFLGB6 EQU   FMCFLGCL                                                 03156000
FMCFLGB5 EQU   FMCFLGCL                                                 03157000
FMCFLGB4 EQU   FMCFLGCL                                                 03158000
FMCFLGB3 EQU   FMCFLGCL                                                 03159000
FMCFLGB2 EQU   FMCFLGCL                                                 03160000
FMCFLGB1 EQU   FMCFLGCL                                                 03161000
FMCFLGB0 EQU   FMCFLGCL                                                 03162000
FMCFLGA7 EQU   FMCFLGA                                                  03163000
FMCFLGA6 EQU   FMCFLGA                                                  03164000
FMCFLGA5 EQU   FMCFLGA                                                  03165000
FMCFLGA4 EQU   FMCFLGA                                                  03166000
FMCFLGA3 EQU   FMCFLGA                                                  03167000
FMCFLGA2 EQU   FMCFLGA                                                  03168000
FMCFLGA1 EQU   FMCFLGA                                                  03169000
FMCFLGA0 EQU   FMCFLGA                                                  03170000
FMCDCLOK EQU   FMCCLEXT+12                                              03171000
FMCRAFM  EQU   FMCCLEXT+8                                               03172000
FMCFBPTR EQU   FMCFBA+1                                                 03173000
FMCFBRSV EQU   FMCFBA                                                   03174000
FMCRPLPT EQU   FMCRPLA+1                                                03175000
FMCRPLRS EQU   FMCRPLA                                                  03176000
FMCPRCLS EQU   FMCCVAL                                                  03177000
FMCIBCE  EQU   FMCCVAL                                                  03178000
FMCONLY  EQU   FMCOBCE                                                  03179000
FMCLAST  EQU   FMCOBCE                                                  03180000
FMCMIDLE EQU   FMCOBCE                                                  03181000
FMCFIRST EQU   FMCOBCE                                                  03182000
FMCCPCNT EQU   FMCPACPC                                                 03183000
FMCMPCNT EQU   FMCPACEM                                                 03184000
FMCNPCNT EQU   FMCPACEN                                                 03185000
FMCCONF  EQU   FMCSSTAT                                                 03186000
FMCPURCH EQU   FMCSSTAT                                                 03187000
FMCNSALU EQU   FMCSSTAT                                                 03188000
FMCBIP   EQU   FMCSSTAT                                                 03189000
FMCSDTR  EQU   FMCSSTAT                                                 03190000
FMCUIPI  EQU   FMCSSTAT                                                 03191000
FMCCIPI  EQU   FMCSSTAT                                                 03192000
FMCSNBI  EQU   FMCSSTAT                                                 03193000
FMCRVD01 EQU   ISTFMCB+158                                              03194000
FMCISSN  EQU   ISTFMCB+156                                              03195000
FMCOASN  EQU   FMCNXOSC                                                 03196000
FMCOSSN  EQU   FMCNXCFM                                                 03197000
FMCSIP   EQU   FMCSIPA                                                  03198000
FMCEXLST EQU   ISTFMCB+144                                              03199000
FMCPAB5  EQU   ISTFMCB+128                                              03200000
FMCPAB4  EQU   ISTFMCB+112                                              03201000
FMCPAB3  EQU   ISTFMCB+96                                               03202000
FMCPAB1  EQU   ISTFMCB+64                                               03203000
FMCFASYA EQU   ISTFMCB+60                                               03204000
FMCMODE  EQU   ISTFMCB+52                                               03205000
FMCVWT   EQU   ISTFMCB+44                                               03206000
FMCRPLH  EQU   ISTFMCB+40                                               03207000
FMCBUFNB EQU   FMCCMPS1+2                                               03208000
FMCBUFLM EQU   FMCCMPS1                                                 03209000
FMCDEBA  EQU   ISTFMCB+32                                               03210000
@NM00028 EQU   FMCCMDFL                                                 03211000
FMCSNA   EQU   FMCCMDFL                                                 03212000
FMCVSNA  EQU   FMCCMDFL                                                 03213000
FMCCMDR  EQU   FMCCMDFL                                                 03214000
@NM00027 EQU   ISTFMCB+30                                               03215000
@NM00026 EQU   FMCSTAT1                                                 03216000
FMCLTCLS EQU   FMCSTAT1                                                 03217000
FMCHPURG EQU   FMCSTAT1                                                 03218000
FMCVSP2  EQU   FMCSTAT1                                                 03219000
FMCVSP1  EQU   FMCSTAT                                                  03220000
FMCLTEAS EQU   FMCSTAT                                                  03221000
FMCZF007 EQU   FMCSTAT                                                  03222000
FMCDEDSC EQU   FMCSTAT                                                  03223000
FMCDEVOF EQU   FMCSTAT                                                  03224000
FMCDAPT  EQU   FMCSTAT                                                  03225000
FMCPRMTE EQU   FMCSTAT                                                  03226000
FMCPRMTR EQU   FMCSTAT                                                  03227000
FMCUSFLD EQU   ISTFMCB+24                                               03228000
FMCFMCBA EQU   ISTFMCB+20                                               03229000
FMCDNCBA EQU   ISTFMCB+16                                               03230000
FMCDVTA  EQU   ISTFMCB+12                                               03231000
FMCTSKID EQU   ISTFMCB+8                                                03232000
FMCNXTCB EQU   ISTFMCB+4                                                03233000
FMCSAF   EQU   ISTFMCB+2                                                03234000
FMCLNGTH EQU   ISTFMCB+1                                                03235000
FMCTYPE  EQU   ISTFMCB                                                  03236000
LOKXCL   EQU   @NM00024                                                 03237000
LOKPRY   EQU   @NM00024                                                 03238000
@NM00025 EQU   @NM00024                                                 03239000
@NM00023 EQU   LOKCHNG                                                  03240000
LOKCT    EQU   ISTLOK                                                   03241000
PROSRDEF EQU   PROSETM4                                                 03242000
PRORSV47 EQU   PROSETM4                                                 03243000
PROSCON  EQU   PROSETM4                                                 03244000
PRORSV46 EQU   PROSETM3                                                 03245000
PROSMONT EQU   PROSETM3                                                 03246000
PRORSV45 EQU   PROSETM3                                                 03247000
PROSNTO  EQU   PROSETM3                                                 03248000
PRORSV44 EQU   PROSETM3                                                 03249000
PRORSV43 EQU   PROSETM2                                                 03250000
PROSNTFL EQU   PROSETM2                                                 03251000
PRORSV42 EQU   PROSETM2                                                 03252000
PRORSV41 EQU   PROPROCS                                                 03253000
PROMODC  EQU   PROPROC4                                                 03254000
PROMODT  EQU   PROPROC4                                                 03255000
PROMODM  EQU   PROPROC4                                                 03256000
PROMODB  EQU   PROPROC4                                                 03257000
PRORSV14 EQU   PROPROC4                                                 03258000
PRORSV13 EQU   PROPROC4                                                 03259000
PRORSV12 EQU   PROPROC4                                                 03260000
PROEIB   EQU   PROPROC4                                                 03261000
PROMONT3 EQU   PROPROC3                                                 03262000
PROMONT2 EQU   PROPROC3                                                 03263000
PROMONIT EQU   PROPROC3                                                 03264000
PROSUBLK EQU   PROPROC3                                                 03265000
PRONTO   EQU   PROPROC3                                                 03266000
PROLGIN  EQU   PROPROC3                                                 03267000
PROERPI  EQU   PROPROC3                                                 03268000
PRORSV07 EQU   PROPROC3                                                 03269000
PROCFTX  EQU   PROPROC2                                                 03270000
PROEMLC  EQU   PROPROC2                                                 03271000
PRONTFL  EQU   PROPROC2                                                 03272000
PRORSV05 EQU   PROPROC2                                                 03273000
PRORSV04 EQU   PROPROC2                                                 03274000
PROLGOT  EQU   PROPROC2                                                 03275000
PROERPO  EQU   PROPROC2                                                 03276000
PRORSV03 EQU   PROPROC2                                                 03277000
PRORPLC  EQU   PROPROC1                                                 03278000
PROCS    EQU   PROPROC1                                                 03279000
PROCA    EQU   PROPROC1                                                 03280000
PRORESPX EQU   PROPROC1                                                 03281000
PRODFASY EQU   PROPROC1                                                 03282000
PROXPOPT EQU   PROPROC1                                                 03283000
PROTRUNC EQU   PROPROC1                                                 03284000
PROASYIP EQU   PROPROC1                                                 03285000
DEVRSV03 EQU   ISTDEVCH+5                                               03286000
DEVPHYSA EQU   ISTDEVCH+4                                               03287000
DEVCSLPN EQU   DEVCHAR3                                                 03288000
DEVCSTCL EQU   DEVCHAR3                                                 03289000
DEVCCHEK EQU   DEVCHAR3                                                 03290000
DEVCATTN EQU   DEVCHAR3                                                 03291000
DEVCSWL  EQU   DEVFCCTL                                                 03292000
DEVCRVB  EQU   DEVFCCTL                                                 03293000
DEVCSSL  EQU   DEVFCCTL                                                 03294000
DEVCBSC  EQU   DEVFCCTL                                                 03295000
DEVMCODE EQU   ISTDEVCH+2                                               03296000
DEVCHAR2 EQU   DEVTCODE                                                 03297000
DEVRSV01 EQU   DEVCHAR                                                  03298000
DEVCCTL  EQU   DEVCHAR                                                  03299000
DEVNNSPT EQU   DEVCHAR                                                  03300000
DEVSPS   EQU   DEVCHAR                                                  03301000
DEVSUBND EQU   DEVCHAR                                                  03302000
DEVCONVR EQU   DEVCHAR                                                  03303000
DEVOTPUT EQU   DEVCHAR                                                  03304000
DEVINPUT EQU   DEVCHAR                                                  03305000
ZIBLNG1  EQU   ZIBFSM                                                   03306000
ZIBCHAIN EQU   ISTZIBUF                                                 03307000
TH2SNF   EQU   ISTTH2+4                                                 03308000
TH2OAF   EQU   ISTTH2+3                                                 03309000
TH2DAF   EQU   ISTTH2+2                                                 03310000
TH2CDF   EQU   TH2FLAG1+1                                               03311000
TH2SEF   EQU   TH2FLAG1+1                                               03312000
TH2PYF   EQU   TH2FLAG1+1                                               03313000
TH2AFI   EQU   TH2FLAG1                                                 03314000
TH2PSI   EQU   TH2FLAG1                                                 03315000
TH2CMPLI EQU   TH2MPF                                                   03316000
TH2RHI   EQU   TH2MPF                                                   03317000
TH2FID   EQU   TH2FLAG1                                                 03318000
THDCF    EQU   ISTTH+8                                                  03319000
THSNF    EQU   ISTTH+6                                                  03320000
THOAF    EQU   ISTTH+4                                                  03321000
THDAF    EQU   ISTTH+2                                                  03322000
THCDF    EQU   THFLGB                                                   03323000
THSEF    EQU   THFLGB                                                   03324000
THPYF    EQU   THFLGB                                                   03325000
THAFI    EQU   THFLGA                                                   03326000
THPSI    EQU   THFLGA                                                   03327000
THCMPLI  EQU   THMPF                                                    03328000
THRHI    EQU   THMPF                                                    03329000
THFID    EQU   THFLAG1                                                  03330000
LHVDATA  EQU   ISTLH+4                                                  03331000
LHFUNCT  EQU   ISTLH+3                                                  03332000
@NM00017 EQU   ISTLH+2                                                  03333000
LHLEN    EQU   ISTLH                                                    03334000
PABRPHA  EQU   PABRPHFG+1                                               03335000
PABNODQ  EQU   PABFLAGS                                                 03336000
PABINHBT EQU   PABFLAGS                                                 03337000
PABERLOK EQU   PABERRLK                                                 03338000
PABSSN   EQU   PABFLAGS                                                 03339000
PABDYNAM EQU   PABFLAGS                                                 03340000
PABNORPR EQU   PABFLAGS                                                 03341000
PABPRIOR EQU   PABFLAGS                                                 03342000
PABAPYP  EQU   PABFLAGS                                                 03343000
PABDVTA  EQU   ISTPAB+9                                                 03344000
PABOFFST EQU   ISTPAB+8                                                 03345000
PABCHNGP EQU   PABCHAIN+1                                               03346000
PABRSV02 EQU   PABCHAIN                                                 03347000
PABDELAY EQU   PABCHAIN                                                 03348000
PABRUNNG EQU   PABCHAIN                                                 03349000
PABRESET EQU   PABCHAIN                                                 03350000
PABUNCON EQU   PABCHAIN                                                 03351000
PABCDP   EQU   PABCHAIN                                                 03352000
PABRESCH EQU   PABCHAIN                                                 03353000
PABCHNG  EQU   PABCHAIN                                                 03354000
PABWEQP  EQU   PABWEQA+1                                                03355000
PABRSV01 EQU   PABWEQA                                                  03356000
PABWEQG  EQU   PABWEQA                                                  03357000
LCCWDATA EQU   ISTLCCW+4                                                03358000
LCCWCNT  EQU   ISTLCCW+2                                                03359000
LCCWACI  EQU   LCCWFLAG                                                 03360000
LCCWPER  EQU   LCCWLSI                                                  03361000
LCCWIDAT EQU   LCCWFLAG                                                 03362000
LCCWNTVC EQU   LCCWFLAG                                                 03363000
LCCWCKPT EQU   LCCWFLAG                                                 03364000
LCCWCD   EQU   LCCWFLAG                                                 03365000
LCCWTYPE EQU   LCCWCTL                                                  03366000
LCCWMODE EQU   LCCWCTL                                                  03367000
LCCWSOP  EQU   LCCWRWOP                                                 03368000
@NM00016 EQU   LCCWRWOP                                                 03369000
LCCWSD   EQU   LCCWOP                                                   03370000
LCCWSI   EQU   LCCWOP                                                   03371000
FSBFDB   EQU   ISTFSB+32                                                03372000
FSBRSV01 EQU   FSBFSB+30                                                03373000
FSBTHCNT EQU   FSBFSB+28                                                03374000
FSBRLRSV EQU   FSBRLSTS                                                 03375000
FSBCFTX  EQU   FSBRLSTS                                                 03376000
FSBICNCB EQU   FSBMSGID                                                 03377000
FSBSSOC  EQU   FSBSS2                                                   03378000
FSBSSCC  EQU   FSBSS2                                                   03379000
FSBSSDC  EQU   FSBSS2                                                   03380000
FSBSSEC  EQU   FSBSS2                                                   03381000
FSBSSIR  EQU   FSBSS2                                                   03382000
FSBSSCR  EQU   FSBSS2                                                   03383000
@NM00014 EQU   FSBSS2                                                   03384000
@NM00013 EQU   FSBSS1                                                   03385000
FSBSSDE  EQU   FSBSS1                                                   03386000
FSBSSUS  EQU   FSBSS1                                                   03387000
@NM00012 EQU   FSBSS1                                                   03388000
FSBSOHI  EQU   FSBERC                                                   03389000
FSBLGI   EQU   FSBERC                                                   03390000
FSBLMRI  EQU   FSBFBMI                                                  03391000
FSBETI   EQU   FSBERC                                                   03392000
FSBEMI   EQU   FSBERC                                                   03393000
FSBEBI   EQU   FSBERC                                                   03394000
FSBXLCI  EQU   FSBXCODE                                                 03395000
FSBXFINS EQU   FSBXCODE                                                 03396000
FSBXNORM EQU   FSBXFSTS                                                 03397000
FSBSCODE EQU   FSBSYSRS                                                 03398000
FSBCMD   EQU   FSBSEQ                                                   03399000
FSBDTRCE EQU   FSBFLAGS                                                 03400000
FSBASBTU EQU   FSBFLAGS                                                 03401000
FSBINPET EQU   FSBFLAGS                                                 03402000
FSBNONCB EQU   FSBFLAGS                                                 03403000
FSBLBIND EQU   FSBFLAGS                                                 03404000
FSBFFIND EQU   FSBFLAGS                                                 03405000
FSBACIND EQU   FSBFLAGS                                                 03406000
FSBRFIND EQU   FSBFLAGS                                                 03407000
FSBGATE  EQU   FSBFSBA                                                  03408000
FSBLATOP EQU   FSBSFLGS                                                 03409000
FSBRSV02 EQU   FSBSFLGS                                                 03410000
FSBPGBUF EQU   FSBSFLGS                                                 03411000
FSBMNSDA EQU   FSBMNRCD                                                 03412000
FSBMNOA  EQU   FSBMNRCD                                                 03413000
FSBMNDIF EQU   FSBMNRCD                                                 03414000
FSBMNEOP EQU   FSBMNRCD                                                 03415000
FSBMNDNU EQU   FSBMNRCD                                                 03416000
FSBMNATN EQU   FSBMNRCD                                                 03417000
FSBMNRVI EQU   FSBMNRCD                                                 03418000
FSBMNELI EQU   FSBMNRCD                                                 03419000
FSBLNGTH EQU   FSBFSB+1                                                 03420000
FSBTYPE  EQU   FSBFSB                                                   03421000
FDBDATCT EQU   ISTFDB+8                                                 03422000
FDBDATAA EQU   ISTFDB+4                                                 03423000
FDBFDBA  EQU   ISTFDB                                                   03424000
BTUTEXT  EQU   ISTBTU+20                                                03425000
BTUEXTR  EQU   ISTBTU+19                                                03426000
BTURSV02 EQU   BTUSYSTR                                                 03427000
BTUPHASE EQU   BTUSYSTR                                                 03428000
BTURSV01 EQU   BTUSYSTR                                                 03429000
BTUPAD   EQU   BTURH+3                                                  03430000
BTURH3   EQU   BTURH+2                                                  03431000
BTURH2   EQU   BTURH+1                                                  03432000
BTURH1   EQU   BTURH                                                    03433000
BTUDCF   EQU   BTUBTH+8                                                 03434000
BTUZRTSC EQU   BTURQFLG+1                                               03435000
BTUZRT0B EQU   BTURQFLG+1                                               03436000
BTUZRT0A EQU   BTURQFLG+1                                               03437000
BTUZRT09 EQU   BTURQFLG+1                                               03438000
BTUZRT08 EQU   BTURQFLG+1                                               03439000
BTUZRT07 EQU   BTURQFLG                                                 03440000
BTUZRT06 EQU   BTURQFLG                                                 03441000
BTUZRT05 EQU   BTURQFLG                                                 03442000
BTUZRT04 EQU   BTURQFLG                                                 03443000
BTUZRT03 EQU   BTURQFLG                                                 03444000
BTUZRT02 EQU   BTURQFLG                                                 03445000
BTUZRT01 EQU   BTURQFLG                                                 03446000
BTUZRT00 EQU   BTURQFLG                                                 03447000
BTUCDF   EQU   BTUFID+1                                                 03448000
BTUSCF   EQU   BTUFID+1                                                 03449000
BTUPRY   EQU   BTUFID+1                                                 03450000
BTUASFL  EQU   BTUFID                                                   03451000
BTUPSFL  EQU   BTUFID                                                   03452000
BTUMPF   EQU   BTUFID                                                   03453000
BTUFIDNO EQU   BTUFID                                                   03454000
BDURSV04 EQU   BDUFLAGS                                                 03455000
BDURTOE  EQU   BDUFLAGS                                                 03456000
BDUSTPR  EQU   BDUFLAGS                                                 03457000
BDURSV03 EQU   BDUFLAGS                                                 03458000
BDUALT   EQU   BDUFUNC                                                  03459000
BDUNACK  EQU   BDUFUNC                                                  03460000
BDUACK   EQU   BDUFUNC                                                  03461000
BDUTRPM  EQU   BDUFUNC                                                  03462000
BDUFBMI  EQU   BDUFUNC                                                  03463000
BDULDGPH EQU   BDUFUNC                                                  03464000
BDUHEADP EQU   BDUFUNC                                                  03465000
BDUSOH   EQU   BDUCHECK                                                 03466000
BDURSV01 EQU   BDUMODIF                                                 03467000
BDUMOD0  EQU   BDUMOD1                                                  03468000
BDUCOMND EQU   ISTBDU                                                   03469000
@NM00011 EQU   SRBSECT+40                                               03470000
@NM00010 EQU   SRBSECT+38                                               03471000
SRBPRIOR EQU   SRBSECT+37                                               03472000
SRBPKF   EQU   SRBSECT+36                                               03473000
SRBSAVE  EQU   SRBSECT+32                                               03474000
SRBPARM  EQU   SRBSECT+28                                               03475000
SRBRMTR  EQU   SRBSECT+24                                               03476000
SRBEP    EQU   SRBSECT+20                                               03477000
SRBPTCB  EQU   SRBFLC+4                                                 03478000
SRBPASID EQU   SRBFLC+2                                                 03479000
SRBCPAFF EQU   SRBFLC                                                   03480000
SRBASCB  EQU   SRBSECT+8                                                03481000
SRBFLNK  EQU   SRBSECT+4                                                03482000
SRBID    EQU   SRBSECT                                                  03483000
IOSEND   EQU   IOSB+108                                                 03484000
IOSSKR   EQU   IOSEEKA+7                                                03485000
IOSSKH2  EQU   IOSSKHH+1                                                03486000
IOSSKH1  EQU   IOSSKHH                                                  03487000
IOSSKCC  EQU   IOSCCHH                                                  03488000
IOSSKBB  EQU   IOSEEKA+1                                                03489000
IOSSKM   EQU   IOSEEKA                                                  03490000
IOSEEK   EQU   IOSB+92                                                  03491000
IOSMDM   EQU   IOSB+91                                                  03492000
IOSMDB   EQU   IOSB+90                                                  03493000
IOSCKEY7 EQU   IOSCKEY                                                  03494000
IOSCKEY6 EQU   IOSCKEY                                                  03495000
IOSCKEY5 EQU   IOSCKEY                                                  03496000
IOSCKEY4 EQU   IOSCKEY                                                  03497000
@NM00006 EQU   IOSCKEY                                                  03498000
IOSFMSK  EQU   IOSB+88                                                  03499000
IOSCUDEV EQU   IOSPATH+1                                                03500000
@NM00005 EQU   IOSCHN                                                   03501000
IOSPATH3 EQU   IOSCHN                                                   03502000
IOSPATH2 EQU   IOSCHN                                                   03503000
IOSEXP   EQU   IOSCHN                                                   03504000
IOSGDP   EQU   IOSCHN                                                   03505000
IOSAFF   EQU   IOSB+85                                                  03506000
IOSRSS1B EQU   IOSB+84                                                  03507000
IOSDSID  EQU   IOSB+80                                                  03508000
IOSVST   EQU   IOSB+76                                                  03509000
IOSRST   EQU   IOSB+72                                                  03510000
IOSDIE   EQU   IOSB+68                                                  03511000
IOSABN   EQU   IOSB+64                                                  03512000
IOSNRM   EQU   IOSB+60                                                  03513000
IOSPCI   EQU   IOSB+56                                                  03514000
IOSERP   EQU   IOSB+52                                                  03515000
IOSPCHN  EQU   IOSB+48                                                  03516000
IOSSNS   EQU   IOSB+42                                                  03517000
IOSAPMSK EQU   IOSB+40                                                  03518000
IOSRES4A EQU   IOSB+36                                                  03519000
IOSUSE   EQU   IOSB+32                                                  03520000
IOSSRB   EQU   IOSB+28                                                  03521000
IOSCSWRC EQU   IOSCSW+5                                                 03522000
IOSTSB   EQU   IOSTATUS+1                                               03523000
IOSTSA   EQU   IOSTATUS                                                 03524000
IOSCSWCA EQU   IOSCSW                                                   03525000
IOSCC    EQU   @NM00004                                                 03526000
IOSUCB   EQU   IOSB+16                                                  03527000
IOSOPT2X EQU   IOSOPT2                                                  03528000
IOSHTP   EQU   IOSOPT2                                                  03529000
IOSRELSE EQU   IOSOPT                                                   03530000
IOSAPR   EQU   IOSOPT                                                   03531000
IOSTSLL  EQU   IOSOPT                                                   03532000
IOSNERP  EQU   IOSOPT                                                   03533000
IOSPSLL  EQU   IOSOPT                                                   03534000
IOSQISCE EQU   IOSOPT                                                   03535000
IOSDEP   EQU   IOSOPT                                                   03536000
IOSBYP   EQU   IOSOPT                                                   03537000
IOSCOD   EQU   IOSB+13                                                  03538000
IOSPKY7  EQU   IOSPKEY                                                  03539000
IOSPGDPX EQU   IOSPKEY                                                  03540000
IOSIDR   EQU   IOSPKEY                                                  03541000
IOSLCL   EQU   IOSPKEY                                                  03542000
@NM00003 EQU   IOSPKEY                                                  03543000
IOSPGAD  EQU   IOSB+8                                                   03544000
IOSASID  EQU   IOSB+6                                                   03545000
IOSPRLVL EQU   IOSB+5                                                   03546000
IOSDVRID EQU   IOSB+4                                                   03547000
IOSPROC  EQU   IOSB+3                                                   03548000
IOSFLC7  EQU   IOSFLC                                                   03549000
IOSFLC6  EQU   IOSFLC                                                   03550000
IOSRWAIT EQU   IOSFLC                                                   03551000
IOSTP    EQU   IOSFLC                                                   03552000
IOSCC3WE EQU   IOSFLC                                                   03553000
IOSVERIF EQU   IOSDVALT                                                 03554000
IOSDVMNT EQU   IOSFLC                                                   03555000
IOSLOG   EQU   IOSFLB                                                   03556000
IOSBDCST EQU   IOSFLB                                                   03557000
IOSMSG   EQU   IOSFLB                                                   03558000
IOSFLB4  EQU   IOSFLB                                                   03559000
IOSFLB3  EQU   IOSFLB                                                   03560000
IOSFLB2  EQU   IOSFLB                                                   03561000
IOSSDR   EQU   IOSFLB                                                   03562000
IOSDIESE EQU   IOSFLB                                                   03563000
IOSIOSB  EQU   IOSFLA                                                   03564000
IOSDOM   EQU   IOSFLA                                                   03565000
IOSEX    EQU   IOSFLA                                                   03566000
IOSSMDB  EQU   IOSFLA                                                   03567000
IOSSMDA  EQU   IOSFLA                                                   03568000
IOSERR   EQU   IOSFLA                                                   03569000
IOSCCHN  EQU   IOSACHN                                                  03570000
IOSDCHN  EQU   IOSACHN                                                  03571000
CVTLEVL  EQU   CVTRELNO+2                                               03572000
CVTNUMB  EQU   CVTRELNO                                                 03573000
CVTMDL   EQU   CVTFIX+250                                               03574000
@NM00002 EQU   CVTFIX+248                                               03575000
@NM00001 EQU   CVTFIX                                                   03576000
CVTRV482 EQU   CVTXTNT2+128                                             03577000
CVTRV481 EQU   CVTXTNT2+124                                             03578000
CVTRV480 EQU   CVTXTNT2+120                                             03579000
CVTRV479 EQU   CVTXTNT2+118                                             03580000
CVTRV478 EQU   CVTXTNT2+117                                             03581000
CVTRV477 EQU   CVTXTNT2+116                                             03582000
CVTRV476 EQU   CVTXTNT2+115                                             03583000
CVTRV475 EQU   CVTXTNT2+114                                             03584000
CVTRV474 EQU   CVTRV466                                                 03585000
CVTRV473 EQU   CVTRV466                                                 03586000
CVTRV472 EQU   CVTRV466                                                 03587000
CVTRV471 EQU   CVTRV466                                                 03588000
CVTRV470 EQU   CVTRV466                                                 03589000
CVTRV469 EQU   CVTRV466                                                 03590000
CVTRV468 EQU   CVTRV466                                                 03591000
CVTRV467 EQU   CVTRV466                                                 03592000
CVTRV465 EQU   CVTRV457                                                 03593000
CVTRV464 EQU   CVTRV457                                                 03594000
CVTRV463 EQU   CVTRV457                                                 03595000
CVTRV462 EQU   CVTRV457                                                 03596000
CVTRV461 EQU   CVTRV457                                                 03597000
CVTRV460 EQU   CVTRV457                                                 03598000
CVTRV459 EQU   CVTRV457                                                 03599000
CVTRV458 EQU   CVTRV457                                                 03600000
CVTRV456 EQU   CVTXTNT2+108                                             03601000
CVTRV455 EQU   CVTXTNT2+104                                             03602000
CVTRV454 EQU   CVTXTNT2+100                                             03603000
CVTRV453 EQU   CVTXTNT2+96                                              03604000
CVTRV452 EQU   CVTXTNT2+94                                              03605000
CVTRV451 EQU   CVTXTNT2+92                                              03606000
CVTRV450 EQU   CVTXTNT2+90                                              03607000
CVTRV449 EQU   CVTXTNT2+88                                              03608000
CVTRV448 EQU   CVTXTNT2+87                                              03609000
CVTRV447 EQU   CVTXTNT2+86                                              03610000
CVTRV446 EQU   CVTRV438                                                 03611000
CVTRV445 EQU   CVTRV438                                                 03612000
CVTRV444 EQU   CVTRV438                                                 03613000
CVTRV443 EQU   CVTRV438                                                 03614000
CVTRV442 EQU   CVTRV438                                                 03615000
CVTRV441 EQU   CVTRV438                                                 03616000
CVTRV440 EQU   CVTRV438                                                 03617000
CVTRV439 EQU   CVTRV438                                                 03618000
CVTRV437 EQU   CVTRV429                                                 03619000
CVTRV436 EQU   CVTRV429                                                 03620000
CVTRV435 EQU   CVTRV429                                                 03621000
CVTRV434 EQU   CVTRV429                                                 03622000
CVTRV433 EQU   CVTRV429                                                 03623000
CVTRV432 EQU   CVTRV429                                                 03624000
CVTRV431 EQU   CVTRV429                                                 03625000
CVTRV430 EQU   CVTRV429                                                 03626000
CVTRV428 EQU   CVTXTNT2+80                                              03627000
CVTRV427 EQU   CVTXTNT2+76                                              03628000
CVTRV426 EQU   CVTXTNT2+72                                              03629000
CVTRV425 EQU   CVTXTNT2+68                                              03630000
CVTATACT EQU   CVTATCVT                                                 03631000
CVTRV423 EQU   CVTXTNT2+62                                              03632000
CVTRV422 EQU   CVTXTNT2+60                                              03633000
CVTRV421 EQU   CVTXTNT2+58                                              03634000
CVTRV420 EQU   CVTXTNT2+56                                              03635000
CVTRV419 EQU   CVTXTNT2+55                                              03636000
CVTRV418 EQU   CVTXTNT2+54                                              03637000
CVTRV417 EQU   CVTRV409                                                 03638000
CVTRV416 EQU   CVTRV409                                                 03639000
CVTRV415 EQU   CVTRV409                                                 03640000
CVTRV414 EQU   CVTRV409                                                 03641000
CVTRV413 EQU   CVTRV409                                                 03642000
CVTRV412 EQU   CVTRV409                                                 03643000
CVTRV411 EQU   CVTRV409                                                 03644000
CVTRV410 EQU   CVTRV409                                                 03645000
CVTRV408 EQU   CVTRV400                                                 03646000
CVTRV407 EQU   CVTRV400                                                 03647000
CVTRV406 EQU   CVTRV400                                                 03648000
CVTRV405 EQU   CVTRV400                                                 03649000
CVTRV404 EQU   CVTRV400                                                 03650000
CVTRV403 EQU   CVTRV400                                                 03651000
CVTRV402 EQU   CVTRV400                                                 03652000
CVTRV401 EQU   CVTRV400                                                 03653000
CVTICB   EQU   CVTXTNT2+48                                              03654000
CVTSKTA  EQU   CVTXTNT2+44                                              03655000
CVTSHSB  EQU   CVTSHS                                                   03656000
CVTRSV98 EQU   CVTXTNT2+36                                              03657000
CVTRSV97 EQU   CVTXTNT2+34                                              03658000
CVTRSV96 EQU   CVTXTNT2+32                                              03659000
CVTOLTEP EQU   CVTXTNT2+28                                              03660000
CVTQIDA  EQU   CVTQID+1                                                 03661000
CVTRSV95 EQU   CVTQID                                                   03662000
CVTRSV94 EQU   CVTXTNT2+20                                              03663000
CVTRSV93 EQU   CVTXTNT2+16                                              03664000
CVTRSV92 EQU   CVTXTNT2+12                                              03665000
CVTDEBVR EQU   CVTXTNT2+8                                               03666000
CVTRSV91 EQU   CVTXTNT2+6                                               03667000
CVTRSV9H EQU   CVTFLGBT                                                 03668000
CVTRSV9G EQU   CVTFLGBT                                                 03669000
CVTRSV9F EQU   CVTFLGBT                                                 03670000
CVTRSV9E EQU   CVTFLGBT                                                 03671000
CVTRSV9D EQU   CVTFLGBT                                                 03672000
CVTRSV9C EQU   CVTFLGBT                                                 03673000
CVTVME   EQU   CVTFLGBT                                                 03674000
CVTNPE   EQU   CVTFLGBT                                                 03675000
CVTNUCLS EQU   CVTXTNT2+4                                               03676000
CVTDSSVA EQU   CVTDSSV+1                                                03677000
CVTRSV89 EQU   CVTDSSV                                                  03678000
CVTRSV88 EQU   CVTXTNT1+8                                               03679000
CVTRSV87 EQU   CVTXTNT1+4                                               03680000
CVTFACHN EQU   CVTXTNT1                                                 03681000
CVTRV488 EQU   CVTMAP+412                                               03682000
CVTRV487 EQU   CVTMAP+408                                               03683000
CVTRV486 EQU   CVTMAP+404                                               03684000
CVTRV485 EQU   CVTMAP+400                                               03685000
CVTACTAP EQU   CVTMAP+396                                               03686000
CVTAUTH  EQU   CVTMAP+392                                               03687000
CVTATMCA EQU   CVTATMCT+1                                               03688000
CVTATMST EQU   CVTATMCT                                                 03689000
CVTRSV61 EQU   CVTMAP+384                                               03690000
CVTVOLT1 EQU   CVTVOLM1+1                                               03691000
CVTVOLI1 EQU   CVTVOLF1                                                 03692000
CVTSTOA  EQU   CVTMAP+376                                               03693000
CVTRSV58 EQU   CVTMAP+374                                               03694000
CVTRSV57 EQU   CVTMAP+372                                               03695000
CVTDDCE  EQU   CVTMAP+368                                               03696000
CVTPNWFR EQU   CVTMAP+364                                               03697000
CVTSMF   EQU   CVTMAP+360                                               03698000
CVTSULK  EQU   CVTMAP+358                                               03699000
CVTSLKO  EQU   CVTSYSK                                                  03700000
CVTSLKP  EQU   CVTSYSK                                                  03701000
CVTSLKQ  EQU   CVTSYSK                                                  03702000
CVTSLKR  EQU   CVTSYSK                                                  03703000
CVTRSV56 EQU   CVTSYSK                                                  03704000
CVTRSV55 EQU   CVTSYSK                                                  03705000
CVTRSV54 EQU   CVTSYSK                                                  03706000
CVTRSV53 EQU   CVTSYSK                                                  03707000
CVTRSV52 EQU   CVTA1F1                                                  03708000
CVTRSV51 EQU   CVTA1F1                                                  03709000
CVTRSV50 EQU   CVTA1F1                                                  03710000
CVTRSV49 EQU   CVTA1F1                                                  03711000
CVTRSV48 EQU   CVTA1F1                                                  03712000
CVTRSV47 EQU   CVTA1F1                                                  03713000
CVTSRSW  EQU   CVTA1F1                                                  03714000
CVTPFSW  EQU   CVTA1F1                                                  03715000
CVTPCVT  EQU   CVTMAP+352                                               03716000
CVTRSV46 EQU   CVTMAP+344                                               03717000
CVTRSV45 EQU   CVTMAP+340                                               03718000
CVTRSV44 EQU   CVTMAP+338                                               03719000
CVTRSV43 EQU   CVTMAP+336                                               03720000
CVTHJESA EQU   CVTHJES+1                                                03721000
CVTRSV42 EQU   CVTHJES                                                  03722000
CVTEXT2A EQU   CVTEXT2+1                                                03723000
CVTRSV41 EQU   CVTEXT2                                                  03724000
CVTAPFA  EQU   CVTAPF+1                                                 03725000
CVTRSV40 EQU   CVTAPF                                                   03726000
CVTRV518 EQU   CVTINTLA                                                 03727000
CVTRV517 EQU   CVTERPV                                                  03728000
CVTEORM  EQU   CVTMAP+312                                               03729000
CVTMCHPR EQU   CVTMAP+308                                               03730000
CVTTZ    EQU   CVTMAP+304                                               03731000
CVTJEPS  EQU   CVTMAP+300                                               03732000
CVTJESCT EQU   CVTMAP+296                                               03733000
CVTMODE  EQU   CVTMAP+292                                               03734000
CVTPTRV  EQU   CVTMAP+288                                               03735000
CVTREAL  EQU   CVTMAP+284                                               03736000
CVTRSV39 EQU   CVTMAP+280                                               03737000
CVTRSV38 EQU   CVTMAP+276                                               03738000
CVTDMSRA EQU   CVTDMSR+1                                                03739000
CVTRV634 EQU   CVTDMSRF                                                 03740000
CVTRV633 EQU   CVTDMSRF                                                 03741000
CVTRV632 EQU   CVTDMSRF                                                 03742000
CVTRV631 EQU   CVTDMSRF                                                 03743000
CVTRV630 EQU   CVTDMSRF                                                 03744000
CVTRV629 EQU   CVTDMSRF                                                 03745000
CVTUDUMP EQU   CVTDMSRF                                                 03746000
CVTSDUMP EQU   CVTDMSRF                                                 03747000
CVTQMSGA EQU   CVTQMSG+1                                                03748000
CVTRSV36 EQU   CVTQMSG                                                  03749000
CVTAMFF  EQU   CVTMAP+264                                               03750000
CVTPURGA EQU   CVTPURG+1                                                03751000
CVTRSV35 EQU   CVTPURG                                                  03752000
CVTCBSP  EQU   CVTMAP+256                                               03753000
CVTATERA EQU   CVTATER+1                                                03754000
CVTSYST  EQU   CVTATER                                                  03755000
CVTVOLT2 EQU   CVTTAT                                                   03756000
CVTVOLI2 EQU   CVTVOLF2                                                 03757000
CVTAQAVB EQU   CVTAQAVT+1                                               03758000
CVTRSV34 EQU   CVTTCMFG                                                 03759000
CVTRSV33 EQU   CVTTCMFG                                                 03760000
CVTRSV32 EQU   CVTTCMFG                                                 03761000
CVTRSV31 EQU   CVTTCMFG                                                 03762000
CVTRSV30 EQU   CVTTCMFG                                                 03763000
CVTRSV29 EQU   CVTTCMFG                                                 03764000
CVTRSV28 EQU   CVTTCMFG                                                 03765000
CVTTCRDY EQU   CVTTCMFG                                                 03766000
CVTGTFA  EQU   CVTGTF+1                                                 03767000
CVTRSV27 EQU   CVTGTFST                                                 03768000
CVTRNIO  EQU   CVTGTFST                                                 03769000
CVTUSR   EQU   CVTGTFST                                                 03770000
CVTRV318 EQU   CVTFORM                                                  03771000
CVTRV317 EQU   CVTTMODE                                                 03772000
CVTRV316 EQU   CVTSTATE                                                 03773000
CVTRV315 EQU   CVTGTFS                                                  03774000
CVTGTFAV EQU   CVTGTFS                                                  03775000
CVT0SCR1 EQU   CVTMAP+232                                               03776000
CVTRV515 EQU   CVTMAP+228                                               03777000
CVTRMS   EQU   CVTMAP+224                                               03778000
CVTPATCH EQU   CVTMAP+220                                               03779000
CVTTSCE  EQU   CVTMAP+216                                               03780000
CVTLNKSC EQU   CVTMAP+214                                               03781000
CVTQABST EQU   CVTMAP+212                                               03782000
CVTMDLDS EQU   CVTMAP+208                                               03783000
CVTUSER  EQU   CVTMAP+204                                               03784000
CVTABEND EQU   CVTMAP+200                                               03785000
CVTSMCA  EQU   CVTMAP+196                                               03786000
CVTRSV18 EQU   CVTMAP+192                                               03787000
CVTQLPAQ EQU   CVTMAP+188                                               03788000
CVTQCDSR EQU   CVTMAP+184                                               03789000
CVTRSV17 EQU   CVTOPTB                                                  03790000
CVTRSV16 EQU   CVTOPTB                                                  03791000
CVTFP    EQU   CVTOPTB                                                  03792000
CVTAPTHR EQU   CVTOPTB                                                  03793000
CVTNLOG  EQU   CVTOPTB                                                  03794000
CVTTOD   EQU   CVTOPTB                                                  03795000
CVTCTIMS EQU   CVTOPTB                                                  03796000
CVTPROT  EQU   CVTOPTB                                                  03797000
CVTXPFP  EQU   CVTOPTA                                                  03798000
CVTASCII EQU   CVTOPTA                                                  03799000
CVTRSV13 EQU   CVTOPTA                                                  03800000
CVTRSV12 EQU   CVTOPTA                                                  03801000
CVTNIP   EQU   CVTOPTA                                                  03802000
CVTDDR   EQU   CVTOPTA                                                  03803000
CVTAPR   EQU   CVTOPTA                                                  03804000
CVTCCH   EQU   CVTOPTA                                                  03805000
CVTSNCTR EQU   CVTMAP+180                                               03806000
CVTQMWR  EQU   CVTMAP+176                                               03807000
CVTQOCR  EQU   CVTMAP+172                                               03808000
CVT1EF00 EQU   CVTMAP+168                                               03809000
CVTMZ00  EQU   CVTMAP+164                                               03810000
CVTHEAD  EQU   CVTMAP+160                                               03811000
CVTRSV11 EQU   CVTMAP+156                                               03812000
CVT0PT01 EQU   CVTMAP+152                                               03813000
CVTMSER  EQU   CVTMAP+148                                               03814000
CVTRV516 EQU   CVTIERLC                                                 03815000
CVTILCH  EQU   CVTMAP+140                                               03816000
CVT0DS   EQU   CVTMAP+136                                               03817000
CVTFBOSV EQU   CVTMAP+132                                               03818000
CVTNUCB  EQU   CVTMAP+128                                               03819000
CVTIXAVL EQU   CVTMAP+124                                               03820000
CVTIOQET EQU   CVTMAP+120                                               03821000
CVTDCBA  EQU   CVTMAP+117                                               03822000
CVTMVS2  EQU   CVTDCB                                                   03823000
CVT6DAT  EQU   CVTDCB                                                   03824000
CVT4MPS  EQU   CVTDCB                                                   03825000
CVTRSV09 EQU   CVTDCB                                                   03826000
CVT4MS1  EQU   CVTDCB                                                   03827000
CVT2SPS  EQU   CVTDCB                                                   03828000
CVT1SSS  EQU   CVTDCB                                                   03829000
CVTRSV08 EQU   CVTDCB                                                   03830000
CVTSTB   EQU   CVTMAP+112                                               03831000
CVTQTD00 EQU   CVTMAP+108                                               03832000
CVTQTE00 EQU   CVTMAP+104                                               03833000
CVTCUCB  EQU   CVTMAP+100                                               03834000
CVTSJQ   EQU   CVTMAP+96                                                03835000
CVTPBLDL EQU   CVTMAP+92                                                03836000
CVTTPC   EQU   CVTMAP+88                                                03837000
CVTSVDCB EQU   CVTMAP+84                                                03838000
CVTBRET  EQU   CVTMAP+82                                                03839000
CVTEXIT  EQU   CVTMAP+80                                                03840000
CVT0FN00 EQU   CVTMAP+76                                                03841000
CVTDARA  EQU   CVTDAR+1                                                 03842000
CVTRSV07 EQU   CVTFLGS1                                                 03843000
CVTRSV06 EQU   CVTFLGS1                                                 03844000
CVTRSV05 EQU   CVTFLGS1                                                 03845000
CVTRSV04 EQU   CVTFLGS1                                                 03846000
CVTRSV03 EQU   CVTFLGS1                                                 03847000
CVTRSV02 EQU   CVTFLGS1                                                 03848000
CVTRSV01 EQU   CVTFLGS1                                                 03849000
CVTDMPLK EQU   CVTFLGS1                                                 03850000
CVTXITP  EQU   CVTMAP+68                                                03851000
CVTZDTAB EQU   CVTMAP+64                                                03852000
CVTMSLT  EQU   CVTMAP+60                                                03853000
CVTDATE  EQU   CVTMAP+56                                                03854000
CVTBTERM EQU   CVTMAP+52                                                03855000
CVTSYSAD EQU   CVTMAP+48                                                03856000
CVTXTLER EQU   CVTMAP+44                                                03857000
CVTILK2  EQU   CVTMAP+40                                                03858000
CVTILK1  EQU   CVTMAP+36                                                03859000
CVTPRLTV EQU   CVTMAP+32                                                03860000
CVTPCNVT EQU   CVTMAP+28                                                03861000
CVT0VL00 EQU   CVTMAP+24                                                03862000
CVTXAPG  EQU   CVTMAP+20                                                03863000
CVTBUF   EQU   CVTMAP+16                                                03864000
CVTJOB   EQU   CVTMAP+12                                                03865000
CVTLINK  EQU   CVTMAP+8                                                 03866000
CVT0EF00 EQU   CVTMAP+4                                                 03867000
CVTTCBP  EQU   CVTMAP                                                   03868000
CVT      EQU   CVTMAP                                                   03869000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03870000
@RT00606 EQU   @RC00605                                                 03871000
@ENDDATA EQU   *                                                        03872000
         END   ISTZGFBB,(C'PLS1821',0603,77279)                         03873000
