         TITLE 'ISTZFFDF/ADF-VS1/MDF-VS2 - FID2 WRITE BUFFERS DE-ALLOCA*00001000
               ATION    '                                               00002000
ISTZFFDF CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZFFDF  75.231'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
         EJECT                                                          00011000
*                                                                  0488 00012000
*/********************************************************************/ 00013000
*/*                                                                  */ 00014000
*/* TITLE-                                                           */ 00015000
*/*      ISTZFFDF                                                    */ 00016000
*/*                                                                  */ 00017000
*/* FUNCTION-                                                        */ 00018000
*/*      WRITE BUFFER DEALLOCATION ROUTINE                           */ 00019000
*/*                                                                  */ 00020000
*/********************************************************************/ 00021000
*/* TPZSAVE (7,12,14) BASE                                           */ 00022000
*                                                                  0488 00023000
*   DO;                                                            0488 00024000
*     RFY                                                          0489 00025000
*      (GPR01P,                                                    0489 00026000
*       GPR12P,                                                    0489 00027000
*       GPR13P,                                                    0489 00028000
*       GPR14P) RSTD;                                              0489 00029000
*     GEN(PRINT OFF);                                              0490 00030000
*                                                                  0490 00031000
         PRINT OFF                                                      00032000
*/* ATBUILD (ISTZSAVE)                                               */ 00033000
*/* END OF ATBUILD                                                   */ 00034000
*                                                                  0491 00035000
*     GEN(PRINT ON);                                               0491 00036000
         PRINT ON                                                       00037000
*     RFY                                                          0492 00038000
*       ISTZSAVE BASED(GPR13P);                                    0492 00039000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0493 00040000
         STM   7,12,ZSAZSVVR+0(13)                                      00041000
*     GEN SETS(GPR12P);                                            0494 00042000
         BALR  GPR12P,0                                                 00043000
@TSTART  DS    0H                                                       00044000
         USING @TSTART,GPR12P                                           00045000
*     ZSAZSVRR=GPR14P;                                             0495 00046000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0495 00047000
*     GPR13P=ZSAZSVFC;                                             0496 00048000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0496 00049000
*     RFY                                                          0497 00050000
*      (GPR01P) UNRSTD;                                            0497 00051000
*     RFY                                                          0498 00052000
*      (GPR14P) UNRSTD;                                            0498 00053000
*   END;                                                           0499 00054000
*                                                                  0499 00055000
*/* END TPZSAVE                                                      */ 00056000
*                                                                  0500 00057000
*   WORKBUFF=ICNCPQ-ZOBCPOFS;       /* GET FIRST BUFFER IN CHANNEL   */ 00058000
         L     WORKBUFF,ICNCPQ(,R3)                                0500 00059000
         SL    WORKBUFF,@CF00073                                   0500 00060000
*FFDF1:                                                            0501 00061000
*   BUFREG=WORKBUFF;                /* ADDRESS CURRENT BUFFER        */ 00062000
*                                                                  0501 00063000
FFDF1    LR    BUFREG,WORKBUFF                                     0501 00064000
*   /*****************************************************************/ 00065000
*   /*                                                               */ 00066000
*   /* SEGMENT(DEALLO1)REQUEST                                       */ 00067000
*   /*                                                               */ 00068000
*   /*****************************************************************/ 00069000
*                                                                  0502 00070000
*   DO;                                                            0502 00071000
*     GOTO DEALLO1;                                                0503 00072000
         B     DEALLO1                                             0503 00073000
*DEALLO1#:                                                         0504 00074000
*   END;                                                           0504 00075000
DEALLO1# DS    0H                                                  0505 00076000
*   DO WHILE(ZOBCPWTF^=ZOBCC+ZOBSLI);/* GET LAST BUFFER OF PIU       */ 00077000
         B     @DE00505                                            0505 00078000
@DL00505 DS    0H                                                  0506 00079000
*     BUFREG=ZOBCHAIN;                                             0506 00080000
         L     BUFREG,ZOBCHAIN(,BUFREG)                            0506 00081000
*   END;                                                           0507 00082000
@DE00505 CLI   ZOBCPWTF(BUFREG),96                                 0507 00083000
         BNE   @DL00505                                            0507 00084000
*   R1=ADDR(ICNRPH);                /* REINIT RPH REG                */ 00085000
         LA    R1,ICNRPH(,R3)                                      0508 00086000
*   WORKBUFF=ZOBCHAIN;              /* NEXT CHANNEL PROGRAM GROUP    */ 00087000
         L     WORKBUFF,ZOBCHAIN(,BUFREG)                          0509 00088000
*   IF BUFREG=ICNLSTIF THEN         /* IF LAST WRITE                 */ 00089000
         C     BUFREG,ICNLSTIF(,R3)                                0510 00090000
         BNE   @RF00510                                            0510 00091000
*     ;                             /* EXIT FROM LOOP                */ 00092000
*   ELSE                            /* NO, CONTINUE TO LOOP          */ 00093000
*     GOTO FFDF1;                                                  0512 00094000
*   ZOBCHAIN=0;                     /* SET END OF CHAIN ON LST PIU   */ 00095000
*                                                                  0513 00096000
         SLR   @15,@15                                             0513 00097000
         ST    @15,ZOBCHAIN(,BUFREG)                               0513 00098000
*   /*****************************************************************/ 00099000
*   /*                                                               */ 00100000
*   /* SEGMENT(DEALLO2)REQUEST                                       */ 00101000
*   /*                                                               */ 00102000
*   /*****************************************************************/ 00103000
*                                                                  0514 00104000
*   DO;                                                            0514 00105000
*     GOTO DEALLO2;                                                0515 00106000
         B     DEALLO2                                             0515 00107000
*DEALLO2#:                                                         0516 00108000
*   END;                            /* GO FREE BUFF CHAINS           */ 00109000
DEALLO2# DS    0H                                                  0517 00110000
*/* TPZRETN                                                          */ 00111000
*                                                                  0517 00112000
*   DO;                                                            0517 00113000
*     RFY                                                          0518 00114000
*      (GPR07P,                                                    0518 00115000
*       GPR14P,                                                    0518 00116000
*       GPR15P) RSTD;                                              0518 00117000
*     GPR13P=ZSAZSVBC;                                             0519 00118000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0519 00119000
*     IF GPR13P=0 THEN                                             0520 00120000
         LTR   GPR13P,GPR13P                                       0520 00121000
         BZ    @RT00520                                            0520 00122000
*       ;                           /* TPDVTS ISTZFARR               */ 00123000
*     ELSE                                                         0522 00124000
*       GPR14P=ZSAZSVRR;                                           0522 00125000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0522 00126000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0523 00127000
@RT00520 DS    0H                                                  0523 00128000
         LM    7,12,ZSAZSVVR+0(13)                                      00129000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0524 00130000
         BR    GPR14P                                                   00131000
*     RFY                                                          0525 00132000
*      (GPR07P,                                                    0525 00133000
*       GPR14P,                                                    0525 00134000
*       GPR15P) UNRSTD;                                            0525 00135000
*   END;                                                           0526 00136000
*                                                                  0526 00137000
*/* END TPZRETN                                                      */ 00138000
*                                                                  0527 00139000
         EJECT                                                          00140000
*                                                                  0527 00141000
*/********************************************************************/ 00142000
*/*                                                                  */ 00143000
*/* SEGMENT-                                                         */ 00144000
*/*      DEALLO1                                                     */ 00145000
*/*                                                                  */ 00146000
*/* FUNCTION-                                                        */ 00147000
*/*      OUTBOUND FID2 BUFFER TRACE                                  */ 00148000
*/*                                                                  */ 00149000
*/********************************************************************/ 00150000
*                                                                  0527 00151000
*   /*****************************************************************/ 00152000
*   /*                                                               */ 00153000
*   /* SEGMENT(DEALLO1)START                                         */ 00154000
*   /*                                                               */ 00155000
*   /*****************************************************************/ 00156000
*                                                                  0527 00157000
*   DO;                                                            0527 00158000
*     GOTO DEALLO1@;                                               0528 00159000
*DEALLO1:                                                          0529 00160000
*   END;                                                           0529 00161000
DEALLO1  DS    0H                                                  0530 00162000
*   IF CVTRNIO='1'B THEN            /* IF I/O TRACE ACTIVE           */ 00163000
         L     @15,PTRCVT                                          0530 00164000
         TM    CVTRNIO(@15),B'00000010'                            0530 00165000
         BNO   @RF00530                                            0530 00166000
*FFDFRNIO:                          /* THEN                          */ 00167000
*     DO;                           /* DO                            */ 00168000
FFDFRNIO DS    0H                                                  0532 00169000
*       IF ZOBRT08='1'B THEN        /* IF I/O TRACE ACTIVE FOR NODE  */ 00170000
         TM    ZOBRT08(BUFREG),B'01000000'                         0532 00171000
         BNO   @RF00532                                            0532 00172000
*FFDFACTR:                                                         0533 00173000
*         DO;                                                      0533 00174000
FFDFACTR DS    0H                                                  0534 00175000
*           RFY                                                    0534 00176000
*             WORKREG RSTD;         /*                               */ 00177000
*           WORKREG=R2;             /* SAVE R2                       */ 00178000
         LR    WORKREG,R2                                          0535 00179000
*           R2=TH2DAF+R3->NCBNCBA;  /* GET DAF                       */ 00180000
         SLR   R2,R2                                               0536 00181000
         IC    R2,TH2DAF+32(,BUFREG)                               0536 00182000
         LH    @15,NCBNCBA(,R3)                                    0536 00183000
         N     @15,@CF03728                                        0536 00184000
         ALR   R2,@15                                              0536 00185000
*           RFY                                                    0537 00186000
*            (R15,                                                 0537 00187000
*             R0) RSTD;             /*                               */ 00188000
*           DO;                     /* CIDCTL(FINDNCB)               */ 00189000
*             RFY                                                  0539 00190000
*              (EMCR2,                                             0539 00191000
*               EMCR3) RSTD;                                       0539 00192000
*             GEN SETS(RPHWORK)                                    0540 00193000
*                 (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);  00194000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              00195000
*             EMCR3='00'X;          /* CLEAR EXTRA BITS              */ 00196000
         SLR   EMCR3,EMCR3                                         0541 00197000
*             CALL ATCLCPTR->ATCCDFDN->ISTSDCCN;/* PROCESS REQUEST   */ 00198000
         L     @11,ATCLCPTR                                        0542 00199000
         L     @15,ATCCDFDN(,@11)                                  0542 00200000
         BALR  @14,@15                                             0542 00201000
*             RFY                                                  0543 00202000
*              (EMCR2,                                             0543 00203000
*               EMCR3) UNRSTD;                                     0543 00204000
*           END;                    /* CIDCTL                        */ 00205000
*           IF R15^=0 THEN          /* IF NCB NOT FOUND              */ 00206000
         LTR   R15,R15                                             0545 00207000
         BZ    @RF00545                                            0545 00208000
*             R2=WORKREG->ATCCDTID; /* ADDRESS VTAM PST      @ZM10840*/ 00209000
         L     R2,ATCCDTID(,WORKREG)                               0546 00210000
*           ELSE                                                   0547 00211000
*             DO;                   /* DNCB FOUND                    */ 00212000
         B     @RC00545                                            0547 00213000
@RF00545 DS    0H                                                  0548 00214000
*               R15=R0;             /* ESTAB DNCB BASE               */ 00215000
         LR    R15,R0                                              0548 00216000
*               R2=NCBTSKID;        /* ADDRESS TASK PST      @ZM10840*/ 00217000
         L     R2,NCBTSKID(,R15)                                   0549 00218000
*             END;                  /* END DNCB FOUND                */ 00219000
*           R0=LENGTH(ISTTH2)+LENGTH(ISTRH);/* NORMAL FM DATA LENGTH    00220000
*                                                            @XM19461*/ 00221000
@RC00545 LA    R0,9                                                0551 00222000
*           IF TH2RHI='0'B THEN     /* IF RH OMITTED         @XM19461*/ 00223000
         TM    TH2RHI+32(BUFREG),B'00001000'                       0552 00224000
         BNZ   @RF00552                                            0552 00225000
*             R0=LENGTH(ISTTH2);    /* TRACE TH ONLY         @XM19461*/ 00226000
         LA    R0,6                                                0553 00227000
*           ELSE                                                   0554 00228000
*             DO;                   /* IF RH PRESENT         @XM19461*/ 00229000
         B     @RC00552                                            0554 00230000
@RF00552 DS    0H                                                  0555 00231000
*               IF RHSENSE='1'B THEN/* IF SENSE INCLUDED     @XM19461*/ 00232000
         LA    @11,ZOBTH2(,BUFREG)                                 0555 00233000
         TM    RHSENSE+6(@11),B'00000100'                          0555 00234000
         BNO   @RF00555                                            0555 00235000
*                 R0=LENGTH(ISTTH2)+LENGTH(ISTRH)+LENGTH(SRUSENSE);/*   00236000
*                                      LENGTH FOR GTF        @XM19461*/ 00237000
         LA    R0,13                                               0556 00238000
*               ELSE                                               0557 00239000
*                 ;                 /* NO SENSE DATA         @XM19461*/ 00240000
@RF00555 DS    0H                                                  0558 00241000
*               IF TH2OAF=0         /* IF SSCP DATA          @XM19461*/ 00242000
*                   |(RHTYPE='1'B|RHSCI='1'B) THEN/* | NOT USER DATA    00243000
*                                                            @XM19461*/ 00244000
         CLI   TH2OAF+32(BUFREG),0                                 0558 00245000
         BE    @RT00558                                            0558 00246000
         LA    @11,ZOBTH2(,BUFREG)                                 0558 00247000
         TM    RHTYPE+6(@11),B'01100000'                           0558 00248000
         BZ    @RF00558                                            0558 00249000
@RT00558 DS    0H                                                  0559 00250000
*                 R0=MIN(20,LHLEN-LENGTH(ISTLH));/* SET TRACE LENGTH    00251000
*                                                            @XM19461*/ 00252000
         LH    R0,LHLEN+28(,BUFREG)                                0559 00253000
         N     R0,@CF03728                                         0559 00254000
         SL    R0,@CF00073                                         0559 00255000
         LA    @11,20                                              0559 00256000
         CR    R0,@11                                              0559 00257000
         BNH   *+6                                                      00258000
         LR    R0,@11                                              0559 00259000
*               ELSE                                               0560 00260000
*                 ;                 /* IF FM USER DATA       @XM19461*/ 00261000
@RF00558 DS    0H                                                  0561 00262000
*             END;                  /* END RH INCLUDED       @XD04019*/ 00263000
*           R1=ADDR(ZOBTH2);        /* PIU POINTER                   */ 00264000
@RC00552 LA    R1,ZOBTH2(,BUFREG)                                  0562 00265000
*           IF R2->PSTABINP='1'B THEN/* IF ABEND IN PROGRESS @ZM10840*/ 00266000
         TM    PSTABINP(R2),B'00000001'                            0563 00267000
         BNO   @RF00563                                            0563 00268000
*             R2=WORKREG->ATCCDTID; /* ADDRESS VTAM PST      @ZM10840*/ 00269000
         L     R2,ATCCDTID(,WORKREG)                               0564 00270000
*           ELSE                                                   0565 00271000
*             ;                     /* ELSE LEAVE TASK PST   @ZM10840*/ 00272000
@RF00563 DS    0H                                                  0566 00273000
*           R2=ADDR(R2->PSTMPSTP->MPSASID);/* ASID FOR GTF           */ 00274000
         L     @11,PSTMPSTP(,R2)                                   0566 00275000
         LA    @11,MPSASID(,@11)                                   0566 00276000
         LR    R2,@11                                              0566 00277000
*           GEN(HOOK EID=ISPTPIO2,TYPE=P);                         0567 00278000
         HOOK EID=ISPTPIO2,TYPE=P                                       00279000
*           RFY                                                    0568 00280000
*            (R15,                                                 0568 00281000
*             R0) UNRSTD;           /*                               */ 00282000
*           R2=WORKREG;             /* RESTORE REG2                  */ 00283000
         LR    R2,WORKREG                                          0569 00284000
*           RFY                                                    0570 00285000
*             WORKREG UNRSTD;       /*                               */ 00286000
*         END FFDFACTR;                                            0571 00287000
*       ELSE                                                       0572 00288000
*         ;                         /* I/O TRACE NOT ACTIV FOR NODE  */ 00289000
@RF00532 DS    0H                                                  0573 00290000
*     END FFDFRNIO;                 /*                               */ 00291000
*   ELSE                                                           0574 00292000
*     ;                             /*                               */ 00293000
*                                                                  0574 00294000
@RF00530 DS    0H                                                  0575 00295000
*   /*****************************************************************/ 00296000
*   /*                                                               */ 00297000
*   /* SEGMENT(DEALLO1)FINISH                                        */ 00298000
*   /*                                                               */ 00299000
*   /*****************************************************************/ 00300000
*                                                                  0575 00301000
*   DO;                                                            0575 00302000
*     GOTO DEALLO1#;                                               0576 00303000
         B     DEALLO1#                                            0576 00304000
*DEALLO1@:                                                         0577 00305000
*   END;                                                           0577 00306000
DEALLO1@ DS    0H                                                  0578 00307000
         EJECT                                                          00308000
*                                                                  0578 00309000
*/********************************************************************/ 00310000
*/*                                                                  */ 00311000
*/* SEGMENT-                                                         */ 00312000
*/*      DEALLO2                                                     */ 00313000
*/*                                                                  */ 00314000
*/* FUNCTION-                                                        */ 00315000
*/*      RELEASE WRITE BUFFERS                                       */ 00316000
*/*                                                                  */ 00317000
*/********************************************************************/ 00318000
*                                                                  0578 00319000
*   /*****************************************************************/ 00320000
*   /*                                                               */ 00321000
*   /* SEGMENT(DEALLO2)START                                         */ 00322000
*   /*                                                               */ 00323000
*   /*****************************************************************/ 00324000
*                                                                  0578 00325000
*   DO;                                                            0578 00326000
*     GOTO DEALLO2@;                                               0579 00327000
         B     DEALLO2@                                            0579 00328000
*DEALLO2:                                                          0580 00329000
*   END;                                                           0580 00330000
DEALLO2  DS    0H                                                  0581 00331000
*   BUFREG=ICNCPQ-ZOBCPOFS;         /* ADDRESS FIRST WRITE BUFFER    */ 00332000
*                                                                  0581 00333000
         L     BUFREG,ICNCPQ(,R3)                                  0581 00334000
         SL    BUFREG,@CF00073                                     0581 00335000
*   /*****************************************************************/ 00336000
*   /*                                                               */ 00337000
*   /* RELSTORE BUFADDR(BUFREG)DISABLE(YES)CLEAR(YES)                */ 00338000
*   /*                                                               */ 00339000
*   /*****************************************************************/ 00340000
*                                                                  0582 00341000
*   DO;                                                            0582 00342000
*                                                                  0582 00343000
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */ 00344000
*/* END OF ATBUILD                                                   */ 00345000
*                                                                  0583 00346000
*     RFY                                                          0583 00347000
*      (GPR02P,                                                    0583 00348000
*       GPR03P,                                                    0583 00349000
*       GPR04P,                                                    0583 00350000
*       GPR15P) RSTD;                                              0583 00351000
*     RFY                                                          0584 00352000
*      (GPR01P,                                                    0584 00353000
*       GPR13P) RSTD;                                              0584 00354000
*     GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);           0585 00355000
          STM GPR02P,GPR13P,RPHWORK(GPR01P)                             00356000
*     RFY                                                          0586 00357000
*       GPR13P UNRSTD;                                             0586 00358000
*     GPR04P=BUFREG|'80000000'X;                                   0587 00359000
         LR    GPR04P,BUFREG                                       0587 00360000
         O     GPR04P,@CF01594                                     0587 00361000
*     DCL                                                          0588 00362000
*       1 FMZA0025 FIXED(31) STATIC LOCAL,                         0588 00363000
*        2 * FIXED(8) INIT(192),                                   0588 00364000
*        2 * PTR(24) INIT(0);                                      0588 00365000
*     GPR03F=FMZA0025;                                             0589 00366000
         L     GPR03F,FMZA0025                                     0589 00367000
*     DO;                           /* LISATCVT                    0590 00368000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00369000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 00370000
         L     GPR15P,ATCLCPTR                                     0591 00371000
*     END;                          /* LISATCVT                      */ 00372000
*     GPR02P=GPR15P->ATCBPDA;                                      0593 00373000
         L     GPR02P,ATCBPDA(,GPR15P)                             0593 00374000
*     GPR15P=GPR15P->ATCSMRS;                                      0594 00375000
         L     GPR15P,ATCSMRS(,GPR15P)                             0594 00376000
*     DCL                                                          0595 00377000
*       FMZL0025 BASED(GPR15P) LABEL VALUERANGE(*);                0595 00378000
*     CALL FMZL0025;                                               0596 00379000
         BALR  @14,@15                                             0596 00380000
*     RFY                                                          0597 00381000
*       GPR13P RSTD;                                               0597 00382000
*     GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);           0598 00383000
          LM GPR02P,GPR13P,RPHWORK(GPR01P)                              00384000
*     RFY                                                          0599 00385000
*      (GPR01P,                                                    0599 00386000
*       GPR13P) UNRSTD;                                            0599 00387000
*     RFY                                                          0600 00388000
*      (GPR02P,                                                    0600 00389000
*       GPR03P,                                                    0600 00390000
*       GPR04P,                                                    0600 00391000
*       GPR15P) UNRSTD;                                            0600 00392000
*   END;                            /* *********END OF RELSTORE    0601 00393000
*                                      EXPANSION*********            */ 00394000
*   RFY                                                            0602 00395000
*     R15 RSTD;                                                    0602 00396000
*   IF R15=BUFFSLOW THEN            /* IF RTNCD = '14'X              */ 00397000
         C     R15,@CF00176                                        0603 00398000
         BNE   @RF00603                                            0603 00399000
*     IF ICNZFF69='1'B THEN                                        0604 00400000
         TM    ICNZFF69(R3),B'00000001'                            0604 00401000
         BO    @RT00604                                            0604 00402000
*       ;                           /* IF DEACT IN PROCESS           */ 00403000
*     ELSE                                                         0606 00404000
*       DO;                                                        0606 00405000
*         ICNZFF05='1'B;            /* TPIOS POOL MAY BE IN INTERLOCK   00406000
*                                      STATE                         */ 00407000
         L     @00,ICNZFF05-1(,R3)                                 0607 00408000
@GL00002 LR    @11,@00                                             0607 00409000
         O     @11,@CF03829                                        0607 00410000
         CS    @00,@11,ICNZFF05-1(R3)                              0607 00411000
         BNE   @GL00002                                            0607 00412000
*/* TPSCHED (ADDR(ICNZPAB4)) DIS UNCOND                              */ 00413000
*                                                                  0608 00414000
*         DO;                                                      0608 00415000
*           RFY                                                    0609 00416000
*            (GPR00P,                                              0609 00417000
*             GPR01P,                                              0609 00418000
*             GPR05P) RSTD;                                        0609 00419000
*           GEN REFS(GPR01P) SETS(RPHWORK)                         0610 00420000
*               (STM   GPR02P,GPR08P,RPHWORK(GPR01P));             0610 00421000
         STM   GPR02P,GPR08P,RPHWORK(GPR01P)                            00422000
*           GPR00P=0;                                              0611 00423000
         SLR   GPR00P,GPR00P                                       0611 00424000
*           GPR05P=ADDR(ICNZPAB4);                                 0612 00425000
         LA    GPR05P,ICNZPAB4(,R3)                                0612 00426000
*           CALL ATCLCPTR->ATCAP38->ISTAPC38;                      0613 00427000
         L     @11,ATCLCPTR                                        0613 00428000
         L     @15,ATCAP38(,@11)                                   0613 00429000
         BALR  @14,@15                                             0613 00430000
*           GEN(NOPR 3)                                            0614 00431000
*           NOSETS NOREFS;                                         0614 00432000
         NOPR 3                                                         00433000
*           RFY                                                    0615 00434000
*            (GPR00P,                                              0615 00435000
*             GPR01P,                                              0615 00436000
*             GPR05P) UNRSTD;                                      0615 00437000
*         END;                      /* **** END TPSCHED              */ 00438000
*       END;                                                       0617 00439000
*   ELSE                                                           0618 00440000
*     ;                                                            0618 00441000
@RF00603 DS    0H                                                  0619 00442000
*   RFY                                                            0619 00443000
*     R15 UNRSTD;                                                  0619 00444000
@RC00603 DS    0H                                                  0620 00445000
*   BUFREG=WORKBUFF;                /* OUTPUT=@ OF 1ST RD BUFF IF ANY*/ 00446000
         LR    BUFREG,WORKBUFF                                     0620 00447000
*   ICNLSTIF=0;                     /* CLEAR LAST WRITE BUFFER       */ 00448000
         SLR   @15,@15                                             0621 00449000
         ST    @15,ICNLSTIF(,R3)                                   0621 00450000
*   ICNLSTIT=0;                     /* CLEAR LAST PIU                */ 00451000
*                                                                  0622 00452000
         ST    @15,ICNLSTIT(,R3)                                   0622 00453000
*   /*****************************************************************/ 00454000
*   /*                                                               */ 00455000
*   /* SEGMENT(DEALLO2)FINISH                                        */ 00456000
*   /*                                                               */ 00457000
*   /*****************************************************************/ 00458000
*                                                                  0623 00459000
*   DO;                                                            0623 00460000
*     GOTO DEALLO2#;                                               0624 00461000
         B     DEALLO2#                                            0624 00462000
*DEALLO2@:                                                         0625 00463000
*   END;                                                           0625 00464000
*                                                                  0625 00465000
DEALLO2@ DS    0H                                                  0626 00466000
*/* TPEPILOG                                                         */ 00467000
*                                                                  0626 00468000
*   GEN(PRINT OFF);                                                0626 00469000
         PRINT OFF                                                      00470000
*   DECLARE                                                        0627 00471000
*     EMCR0 PTR REG(0),                                            0627 00472000
*     EMCR1 PTR REG(1),                                            0627 00473000
*     EMCR2 PTR REG(2),                                            0627 00474000
*     EMCR3 PTR REG(3),                                            0627 00475000
*     EMCR4 PTR REG(4),                                            0627 00476000
*     EMCR5 PTR REG(5),                                            0627 00477000
*     EMCR6 PTR REG(6),                                            0627 00478000
*     EMCR7 PTR REG(7),                                            0627 00479000
*     EMCR8 PTR REG(8),                                            0627 00480000
*     EMCR9 PTR REG(9),                                            0627 00481000
*     EMCR10 PTR REG(10),                                          0627 00482000
*     EMCR11 PTR REG(11),                                          0627 00483000
*     EMCR12 PTR REG(12),                                          0627 00484000
*     EMCR13 PTR REG(13),                                          0627 00485000
*     EMCR14 PTR REG(14),                                          0627 00486000
*     EMCR15 PTR REG(15);                                          0627 00487000
*   DECLARE                                                        0628 00488000
*     ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*),/* CIDCTL ADD ROUTINE  */ 00489000
*     ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*),/* CIDCTL DELETE     0628 00490000
*                                      ROUTINE                       */ 00491000
*     ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*),/* CIDCTL FIND ROUTINE */ 00492000
*     ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*),/* CIDCTL FIND NCB   0628 00493000
*                                      ROUTINE                       */ 00494000
*     ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*);/* CIDCTL FINISH     0628 00495000
*                                      ROUTINE                       */ 00496000
*   DCL                                                            0629 00497000
*     CMZCIDM FIXED(15) DEFINED(ATCCIDM);/* CIDMASK ALIAS            */ 00498000
*   DCL                                                            0630 00499000
*     ISTAPC38 ENTRY BASED(ATCAP38) VALRG(*);/* TPSCHED ROUTINE      */ 00500000
*   GEN(PRINT ON);                                                 0631 00501000
*                                                                  0631 00502000
         PRINT ON                                                       00503000
*/* END OF TPEPILOG                                                  */ 00504000
*                                                                  0632 00505000
*   END ISTZFFDF                                                   0632 00506000
*                                                                  0632 00507000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00508000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00509000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00510000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00511000
*                                                                  0632 00512000
*       ;                                                          0632 00513000
@EL00001 DS    0H                                                  0632 00514000
@EF00001 DS    0H                                                  0632 00515000
@ER00001 BR    @14                                                 0632 00516000
@DATA    DS    0H                                                       00517000
@DATD    DSECT                                                          00518000
         DS    0F                                                       00519000
ISTZFFDF CSECT                                                          00520000
         DS    0F                                                       00521000
@CF00073 DC    F'4'                                                     00522000
@CF01594 DC    XL4'80000000'                                            00523000
@CF03728 DC    XL4'0000FFFF'                                            00524000
@CF00176 DC    XL4'14'                                                  00525000
@CF03829 DC    BL4'00000000000001000000000000000000'                    00526000
@DATD    DSECT                                                          00527000
         DS    0D                                                       00528000
IOSBPTR  DS    A                                                        00529000
SRBPTR   DS    A                                                        00530000
CVTPTR   DS    A                                                        00531000
LCPBPTR  DS    A                                                        00532000
BDUPTR   DS    A                                                        00533000
BTUPTR   DS    A                                                        00534000
FSBPTR   DS    A                                                        00535000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00536000
@ENDDATD EQU   *                                                        00537000
ISTZFFDF CSECT                                                          00538000
         DS    0F                                                       00539000
@SIZDATD DC    AL1(0)                                                   00540000
         DC    AL3(@ENDDATD-@DATD)                                      00541000
         DS    0D                                                       00542000
FMZA0025 DS    FL4                                                      00543000
         ORG   FMZA0025                                                 00544000
@NM00053 DC    AL1(192)                                                 00545000
@NM00054 DC    AL3(0)                                                   00546000
         ORG   FMZA0025+4                                               00547000
NOTOP    DC    X'0000FFFF'                                              00548000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00549000
@01      EQU   01                                                       00550000
@02      EQU   02                                                       00551000
@03      EQU   03                                                       00552000
@04      EQU   04                                                       00553000
@05      EQU   05                                                       00554000
@06      EQU   06                                                       00555000
@07      EQU   07                                                       00556000
@08      EQU   08                                                       00557000
@09      EQU   09                                                       00558000
@10      EQU   10                                                       00559000
@11      EQU   11                                                       00560000
@12      EQU   12                                                       00561000
@13      EQU   13                                                       00562000
@14      EQU   14                                                       00563000
@15      EQU   15                                                       00564000
RPHPTR   EQU   @01                                                      00565000
R0       EQU   @00                                                      00566000
R1       EQU   @01                                                      00567000
R2       EQU   @02                                                      00568000
R3       EQU   @03                                                      00569000
R4       EQU   @04                                                      00570000
R5       EQU   @05                                                      00571000
BUFREG   EQU   @06                                                      00572000
WORKBUFF EQU   @07                                                      00573000
WORKREG  EQU   @10                                                      00574000
R12      EQU   @12                                                      00575000
R13      EQU   @13                                                      00576000
R14      EQU   @14                                                      00577000
R15      EQU   @15                                                      00578000
GPR00P   EQU   @00                                                      00579000
GPR01P   EQU   @01                                                      00580000
GPR02P   EQU   @02                                                      00581000
GPR03F   EQU   @03                                                      00582000
GPR03P   EQU   @03                                                      00583000
GPR04P   EQU   @04                                                      00584000
GPR05P   EQU   @05                                                      00585000
GPR07P   EQU   @07                                                      00586000
GPR12P   EQU   @12                                                      00587000
GPR13P   EQU   @13                                                      00588000
GPR14P   EQU   @14                                                      00589000
GPR15P   EQU   @15                                                      00590000
EMCR2    EQU   @02                                                      00591000
EMCR3    EQU   @03                                                      00592000
EMCR0    EQU   @00                                                      00593000
EMCR1    EQU   @01                                                      00594000
EMCR10   EQU   @10                                                      00595000
EMCR11   EQU   @11                                                      00596000
EMCR12   EQU   @12                                                      00597000
EMCR13   EQU   @13                                                      00598000
EMCR14   EQU   @14                                                      00599000
EMCR15   EQU   @15                                                      00600000
EMCR4    EQU   @04                                                      00601000
EMCR5    EQU   @05                                                      00602000
EMCR6    EQU   @06                                                      00603000
EMCR7    EQU   @07                                                      00604000
EMCR8    EQU   @08                                                      00605000
EMCR9    EQU   @09                                                      00606000
GPR00F   EQU   @00                                                      00607000
GPR01F   EQU   @01                                                      00608000
GPR02F   EQU   @02                                                      00609000
GPR04F   EQU   @04                                                      00610000
GPR05F   EQU   @05                                                      00611000
GPR06F   EQU   @06                                                      00612000
GPR06P   EQU   @06                                                      00613000
GPR07F   EQU   @07                                                      00614000
GPR08F   EQU   @08                                                      00615000
GPR08P   EQU   @08                                                      00616000
GPR09F   EQU   @09                                                      00617000
GPR09P   EQU   @09                                                      00618000
GPR10F   EQU   @10                                                      00619000
GPR10P   EQU   @10                                                      00620000
GPR11F   EQU   @11                                                      00621000
GPR11P   EQU   @11                                                      00622000
GPR12F   EQU   @12                                                      00623000
GPR13F   EQU   @13                                                      00624000
GPR14F   EQU   @14                                                      00625000
GPR15F   EQU   @15                                                      00626000
ATCLCPTR EQU   1032                                                     00627000
PTRCVT   EQU   16                                                       00628000
IOSB     EQU   0                                                        00629000
IOSFLA   EQU   IOSB                                                     00630000
IOSACHN  EQU   IOSFLA                                                   00631000
IOSFLB   EQU   IOSB+1                                                   00632000
IOSFLC   EQU   IOSB+2                                                   00633000
IOSDVALT EQU   IOSFLC                                                   00634000
IOSPKEY  EQU   IOSB+12                                                  00635000
IOSOPT   EQU   IOSB+14                                                  00636000
IOSOPT2  EQU   IOSB+15                                                  00637000
@NM00002 EQU   IOSB+20                                                  00638000
IOSCSW   EQU   @NM00002+1                                               00639000
IOSTATUS EQU   IOSCSW+3                                                 00640000
IOSIPIB  EQU   IOSB+44                                                  00641000
IOSPATH  EQU   IOSB+86                                                  00642000
IOSCHN   EQU   IOSPATH                                                  00643000
IOSCKEY  EQU   IOSB+89                                                  00644000
IOSEEKA  EQU   IOSB+100                                                 00645000
IOSCCHH  EQU   IOSEEKA+3                                                00646000
IOSSKHH  EQU   IOSCCHH+2                                                00647000
SRBSECT  EQU   0                                                        00648000
SRBFLC   EQU   SRBSECT+12                                               00649000
CVTMAP   EQU   0                                                        00650000
CVTDAR   EQU   CVTMAP+72                                                00651000
CVTFLGS1 EQU   CVTDAR                                                   00652000
CVTDCB   EQU   CVTMAP+116                                               00653000
CVTIERLC EQU   CVTMAP+144                                               00654000
CVTOPTA  EQU   CVTMAP+182                                               00655000
CVTOPTB  EQU   CVTMAP+183                                               00656000
CVTGTF   EQU   CVTMAP+236                                               00657000
CVTGTFST EQU   CVTGTF                                                   00658000
CVTGTFS  EQU   CVTGTFST                                                 00659000
CVTSTATE EQU   CVTGTFST                                                 00660000
CVTTMODE EQU   CVTGTFST                                                 00661000
CVTFORM  EQU   CVTGTFST                                                 00662000
CVTRNIO  EQU   CVTGTFST                                                 00663000
CVTAQAVT EQU   CVTMAP+240                                               00664000
CVTTCMFG EQU   CVTAQAVT                                                 00665000
CVTVOLM2 EQU   CVTMAP+244                                               00666000
CVTTATA  EQU   CVTVOLM2                                                 00667000
CVTTSKS  EQU   CVTTATA                                                  00668000
CVTVOLF2 EQU   CVTTSKS                                                  00669000
CVTTAT   EQU   CVTTATA+1                                                00670000
CVTATER  EQU   CVTMAP+248                                               00671000
CVTEXT1  EQU   CVTMAP+252                                               00672000
CVTPURG  EQU   CVTMAP+260                                               00673000
CVTQMSG  EQU   CVTMAP+268                                               00674000
CVTDMSR  EQU   CVTMAP+272                                               00675000
CVTERPV  EQU   CVTMAP+316                                               00676000
CVTINTLA EQU   CVTMAP+320                                               00677000
CVTAPF   EQU   CVTMAP+324                                               00678000
CVTEXT2  EQU   CVTMAP+328                                               00679000
CVTHJES  EQU   CVTMAP+332                                               00680000
CVTPGSIA EQU   CVTMAP+348                                               00681000
CVTA1F1  EQU   CVTMAP+356                                               00682000
CVTSYSK  EQU   CVTMAP+357                                               00683000
CVTVOLM1 EQU   CVTMAP+380                                               00684000
CVTVOLF1 EQU   CVTVOLM1                                                 00685000
CVTATMCT EQU   CVTMAP+388                                               00686000
CVTXTNT1 EQU   0                                                        00687000
CVTXTNT2 EQU   0                                                        00688000
CVTDSSV  EQU   CVTXTNT2                                                 00689000
CVTFLGBT EQU   CVTXTNT2+5                                               00690000
CVTQID   EQU   CVTXTNT2+24                                              00691000
CVTSHS   EQU   CVTXTNT2+40                                              00692000
CVTRV400 EQU   CVTXTNT2+52                                              00693000
CVTRV409 EQU   CVTXTNT2+53                                              00694000
CVTATCVT EQU   CVTXTNT2+64                                              00695000
CVTRV429 EQU   CVTXTNT2+84                                              00696000
CVTRV438 EQU   CVTXTNT2+85                                              00697000
CVTRV457 EQU   CVTXTNT2+112                                             00698000
CVTRV466 EQU   CVTXTNT2+113                                             00699000
CVTFIX   EQU   0                                                        00700000
CVTRELNO EQU   CVTFIX+252                                               00701000
ISTZSAVE EQU   0                                                        00702000
ZSAZSVBC EQU   ISTZSAVE                                                 00703000
ZSAZSVMS EQU   ZSAZSVBC                                                 00704000
ZSAZSVFC EQU   ISTZSAVE+4                                               00705000
ZSAZSVRR EQU   ISTZSAVE+8                                               00706000
ZSAZSVVR EQU   ISTZSAVE+12                                              00707000
ISTLCCW  EQU   0                                                        00708000
LCCWOP   EQU   ISTLCCW                                                  00709000
LCCWRWOP EQU   LCCWOP                                                   00710000
LCCWCTL  EQU   LCCWRWOP                                                 00711000
LCCWFLAG EQU   ISTLCCW+1                                                00712000
LCCWLSI  EQU   LCCWFLAG                                                 00713000
ISTLCPB  EQU   0                                                        00714000
LCPREQTG EQU   ISTLCPB+2                                                00715000
LCPFLAGS EQU   LCPREQTG                                                 00716000
LCPZF001 EQU   LCPFLAGS                                                 00717000
LCPZRT02 EQU   LCPZF001                                                 00718000
LCPZF002 EQU   LCPFLAGS                                                 00719000
LCPZRT03 EQU   LCPZF002                                                 00720000
LCPZF003 EQU   LCPFLAGS                                                 00721000
LCPZRT04 EQU   LCPZF003                                                 00722000
LCPZF004 EQU   LCPFLAGS                                                 00723000
LCPZRT05 EQU   LCPZF004                                                 00724000
LCPZRT06 EQU   LCPFLAGS                                                 00725000
LCPZRT07 EQU   LCPFLAGS                                                 00726000
LCPMNRCD EQU   LCPREQTG+1                                               00727000
LCPZRT08 EQU   LCPMNRCD                                                 00728000
LCPZRT09 EQU   LCPMNRCD                                                 00729000
LCPCHAIN EQU   ISTLCPB+4                                                00730000
LCPCHAI1 EQU   LCPCHAIN                                                 00731000
LCPRUCNT EQU   ISTLCPB+8                                                00732000
LCPFLAG2 EQU   ISTLCPB+9                                                00733000
LCPTLBPI EQU   LCPFLAG2                                                 00734000
LCPFID0  EQU   LCPFLAG2                                                 00735000
LCPSEQ   EQU   ISTLCPB+10                                               00736000
LCPCID   EQU   ISTLCPB+16                                               00737000
LCPFDBA  EQU   ISTLCPB+24                                               00738000
LCPFLG1  EQU   ISTLCPB+37                                               00739000
LCPFLCCW EQU   ISTLCPB+40                                               00740000
LCPLCCW  EQU   ISTLCPB+48                                               00741000
LCPPABA  EQU   LCPLCCW+4                                                00742000
LCPRPHA  EQU   LCPPABA                                                  00743000
ISTZCRR  EQU   0                                                        00744000
ZCRCRR   EQU   ISTZCRR                                                  00745000
ZCRFLGS1 EQU   ISTZCRR+12                                               00746000
ZCRFLGS2 EQU   ISTZCRR+13                                               00747000
ZCRSWFLD EQU   ISTZCRR+14                                               00748000
ZCRENDSH EQU   ZCRSWFLD                                                 00749000
ZCRNDLCP EQU   ZCRSWFLD                                                 00750000
ZCRRESET EQU   ZCRSWFLD                                                 00751000
ZCRFLGS3 EQU   ISTZCRR+15                                               00752000
ZCRGENSW EQU   ISTZCRR+16                                               00753000
ZCRPFLGS EQU   ISTZCRR+17                                               00754000
ZCRIBPR  EQU   ISTZCRR+18                                               00755000
ZCRSCPSW EQU   ISTZCRR+19                                               00756000
ZCRPARMS EQU   ISTZCRR+24                                               00757000
ZCRFBPTR EQU   ZCRPARMS                                                 00758000
ZCRDFRDA EQU   ZCRPARMS+10                                              00759000
ZCRPCOD1 EQU   ZCRPARMS+12                                              00760000
ZCRPLSBF EQU   ZCRPCOD1                                                 00761000
ZCRPCOD2 EQU   ZCRPARMS+13                                              00762000
ZCRSVRTN EQU   ISTZCRR+56                                               00763000
ZCRWKARA EQU   ISTZCRR+156                                              00764000
ZCRCIDSV EQU   ISTZCRR+192                                              00765000
ZCRAUDIT EQU   ISTZCRR+440                                              00766000
ZCRENTER EQU   ZCRAUDIT+5                                               00767000
ZCRLCPB  EQU   ISTZCRR+480                                              00768000
ZCRRHRU  EQU   ZCRLCPB                                                  00769000
ISTAVT   EQU   0                                                        00770000
ISTAS49  EQU   ISTAVT+4                                                 00771000
ISTPAB   EQU   0                                                        00772000
PABWQCHN EQU   ISTPAB                                                   00773000
PABWEQA  EQU   PABWQCHN                                                 00774000
PABCHAIN EQU   PABWQCHN+4                                               00775000
PABRPHFG EQU   ISTPAB+12                                                00776000
PABFLAGS EQU   PABRPHFG                                                 00777000
PABERLCK EQU   PABFLAGS                                                 00778000
PABERRLK EQU   PABERLCK                                                 00779000
ISTDYPAB EQU   0                                                        00780000
ISTLOK   EQU   0                                                        00781000
LOKCHN   EQU   ISTLOK+1                                                 00782000
LOKCHNG  EQU   LOKCHN                                                   00783000
@NM00018 EQU   LOKCHNG+2                                                00784000
ISTRPH   EQU   0                                                        00785000
RPHCNTL  EQU   ISTRPH                                                   00786000
RPHFLAGS EQU   RPHCNTL+2                                                00787000
RPHAPTYP EQU   RPHFLAGS                                                 00788000
RPHFSTLC EQU   RPHFLAGS                                                 00789000
RPHFLGB  EQU   RPHCNTL+3                                                00790000
RPHRPHA  EQU   ISTRPH+4                                                 00791000
RPHTSKID EQU   ISTRPH+8                                                 00792000
RPHRESMA EQU   ISTRPH+16                                                00793000
RPHWPFLG EQU   RPHRESMA                                                 00794000
RPHWEA   EQU   ISTRPH+24                                                00795000
RPHCSPA  EQU   RPHWEA                                                   00796000
RPHSRPRM EQU   ISTRPH+28                                                00797000
RPHPABQA EQU   ISTRPH+36                                                00798000
RPHWORK  EQU   ISTRPH+40                                                00799000
RPHSAVE1 EQU   RPHWORK                                                  00800000
RPHSBITS EQU   RPHSAVE1+1                                               00801000
ISTATCVT EQU   0                                                        00802000
ATCCOM   EQU   ISTATCVT                                                 00803000
ATCSTAT  EQU   ATCCOM                                                   00804000
ATCSTAT1 EQU   ATCSTAT                                                  00805000
ATCSTFLG EQU   ATCSTAT+1                                                00806000
ATCPOFLG EQU   ATCSTAT+2                                                00807000
ATCSTAT4 EQU   ATCSTAT+3                                                00808000
ATCBPDA  EQU   ATCCOM+128                                               00809000
ATCIOTRC EQU   ATCCOM+140                                               00810000
ATCTHTRC EQU   ATCIOTRC                                                 00811000
ATCSMRS  EQU   ATCCOM+188                                               00812000
ATCCIDM  EQU   ATCCOM+266                                               00813000
ATCCDADD EQU   ISTATCVT+276                                             00814000
ATCCDDEL EQU   ISTATCVT+280                                             00815000
ATCCDFND EQU   ISTATCVT+284                                             00816000
ATCCSMR  EQU   ISTATCVT+296                                             00817000
ATCSHRFG EQU   ISTATCVT+316                                             00818000
ATCHPGM  EQU   ISTATCVT+384                                             00819000
ATCCDFIN EQU   ISTATCVT+460                                             00820000
ATCCDFDN EQU   ISTATCVT+464                                             00821000
ATCVLCNT EQU   ISTATCVT+772                                             00822000
ATCRNO   EQU   ISTATCVT+788                                             00823000
ATCSOPD  EQU   ISTATCVT+792                                             00824000
ATCSIPD  EQU   ISTATCVT+800                                             00825000
ATCSECST EQU   ISTATCVT+812                                             00826000
ATCAOSM  EQU   ISTATCVT+912                                             00827000
ATCGSRBQ EQU   ATCAOSM+4                                                00828000
ATCGSRBG EQU   ATCGSRBQ                                                 00829000
ATCICAPP EQU   ATCAOSM+100                                              00830000
ATCLDAPP EQU   ATCAOSM+120                                              00831000
ATCCDTID EQU   ATCLDAPP                                                 00832000
ATCDAPVT EQU   ATCAOSM+140                                              00833000
ATCAP38  EQU   ATCAOSM+268                                              00834000
ATCVTFLG EQU   ATCAOSM+392                                              00835000
ATCZFLAG EQU   ATCAOSM+588                                              00836000
ISTBDU   EQU   0                                                        00837000
BDUMODIF EQU   ISTBDU+1                                                 00838000
BDUMOD1  EQU   BDUMODIF                                                 00839000
BDUDAF   EQU   ISTBDU+2                                                 00840000
BDUFUNC  EQU   BDUDAF                                                   00841000
BDUCHECK EQU   BDUFUNC                                                  00842000
BDUFLAGS EQU   BDUDAF+1                                                 00843000
ISTBTU   EQU   0                                                        00844000
BTUBTH   EQU   ISTBTU                                                   00845000
BTUFID   EQU   BTUBTH                                                   00846000
BTUREQ   EQU   BTUBTH+6                                                 00847000
BTURQFLG EQU   BTUREQ                                                   00848000
BTURH    EQU   BTUBTH+10                                                00849000
BTUSYSTR EQU   ISTBTU+18                                                00850000
ISTDEVCH EQU   0                                                        00851000
DEVSHCH  EQU   ISTDEVCH                                                 00852000
DEVCHAR  EQU   DEVSHCH                                                  00853000
DEVTCODE EQU   ISTDEVCH+1                                               00854000
DEVFLAGS EQU   ISTDEVCH+3                                               00855000
DEVFCCTL EQU   DEVFLAGS                                                 00856000
DEVCHAR3 EQU   DEVFLAGS                                                 00857000
ISTTH    EQU   0                                                        00858000
THFLAG1  EQU   ISTTH                                                    00859000
THFLGA   EQU   THFLAG1                                                  00860000
THMPF    EQU   THFLGA                                                   00861000
THFLGB   EQU   THFLAG1+1                                                00862000
ISTTH2   EQU   0                                                        00863000
TH2FLAG1 EQU   ISTTH2                                                   00864000
TH2MPF   EQU   TH2FLAG1                                                 00865000
TH2RHI   EQU   TH2MPF                                                   00866000
TH2DAF   EQU   ISTTH2+2                                                 00867000
TH2OAF   EQU   ISTTH2+3                                                 00868000
ISTRH    EQU   0                                                        00869000
RHFLAGS  EQU   ISTRH                                                    00870000
RH1      EQU   RHFLAGS                                                  00871000
RHTYPE   EQU   RH1                                                      00872000
RHSCI    EQU   RH1                                                      00873000
RHSENSE  EQU   RH1                                                      00874000
RH2      EQU   RHFLAGS+1                                                00875000
RHRETRY  EQU   RH2                                                      00876000
RHRSVD1  EQU   RH2                                                      00877000
RH3      EQU   RHFLAGS+2                                                00878000
ISTRU    EQU   0                                                        00879000
RUDATA   EQU   ISTRU                                                    00880000
ISTRUB   EQU   0                                                        00881000
NSRUNA5  EQU   0                                                        00882000
ISTFDB   EQU   0                                                        00883000
ISTFSB   EQU   0                                                        00884000
FSBFSB   EQU   ISTFSB                                                   00885000
FSBMNRCD EQU   FSBFSB+2                                                 00886000
FSBSFLGS EQU   FSBFSB+3                                                 00887000
FSBFSBA  EQU   FSBFSB+4                                                 00888000
FSBBTH   EQU   FSBFSB+8                                                 00889000
FSBCID   EQU   FSBBTH                                                   00890000
FSBRQTAG EQU   FSBBTH+4                                                 00891000
FSBSEQID EQU   FSBRQTAG                                                 00892000
FSBFLAGS EQU   FSBSEQID                                                 00893000
FSBSEQ   EQU   FSBSEQID+1                                               00894000
FSBCSWST EQU   FSBBTH+6                                                 00895000
FSBTHFLD EQU   FSBCSWST                                                 00896000
FSBTH1   EQU   FSBTHFLD                                                 00897000
FSBSYSRS EQU   FSBTH1                                                   00898000
FSBTH2   EQU   FSBTHFLD+1                                               00899000
FSBEXTRS EQU   FSBTH2                                                   00900000
FSBXFSTS EQU   FSBEXTRS                                                 00901000
FSBXCODE EQU   FSBEXTRS                                                 00902000
FSBNETRS EQU   FSBFSB+16                                                00903000
FSBSRCAT EQU   FSBNETRS                                                 00904000
FSBERC   EQU   FSBNETRS+1                                               00905000
FSBFBMI  EQU   FSBERC                                                   00906000
FSBDMGRS EQU   FSBFSB+18                                                00907000
FSBSS1   EQU   FSBDMGRS                                                 00908000
FSBSS2   EQU   FSBDMGRS+1                                               00909000
FSBLCPB  EQU   FSBFSB+20                                                00910000
FSBMSGID EQU   FSBLCPB                                                  00911000
FSBLCCWA EQU   FSBFSB+24                                                00912000
FSBRLSTS EQU   FSBLCCWA                                                 00913000
ISTLH    EQU   0                                                        00914000
LHLEN    EQU   ISTLH                                                    00915000
ISTZOBUF EQU   0                                                        00916000
ZOBCHAIN EQU   ISTZOBUF                                                 00917000
ZOBFSM   EQU   ISTZOBUF+4                                               00918000
ISTNCB   EQU   0                                                        00919000
NCBTSKID EQU   ISTNCB+8                                                 00920000
NCBNCBA  EQU   ISTNCB+20                                                00921000
NCBFLAGS EQU   ISTNCB+24                                                00922000
NCBFRAS  EQU   NCBFLAGS+1                                               00923000
NCBFTRIO EQU   NCBFRAS                                                  00924000
NCBFLAG1 EQU   NCBFLAGS+2                                               00925000
ISTPST   EQU   0                                                        00926000
PSTRQFGA EQU   ISTPST+8                                                 00927000
PSTRQUE  EQU   PSTRQFGA                                                 00928000
PSTFLGA  EQU   PSTRQFGA+4                                               00929000
PSTABINP EQU   PSTFLGA                                                  00930000
PSTMPSTP EQU   ISTPST+20                                                00931000
PSTDMPS  EQU   ISTPST+132                                               00932000
ISTICNCB EQU   0                                                        00933000
@NM00045 EQU   ISTICNCB+53                                              00934000
ICNZPAB4 EQU   ISTICNCB+80                                              00935000
ICNCKFLD EQU   ISTICNCB+96                                              00936000
ICNFLAG  EQU   ISTICNCB+100                                             00937000
ICNZF006 EQU   ICNFLAG                                                  00938000
ICNFFLAG EQU   ISTICNCB+101                                             00939000
ICNZFF05 EQU   ICNFFLAG                                                 00940000
ICNZFF69 EQU   ICNFFLAG                                                 00941000
ICNZSWS  EQU   ISTICNCB+102                                             00942000
ICNRPH   EQU   ISTICNCB+120                                             00943000
ICNFLAG2 EQU   ISTICNCB+236                                             00944000
ICNCPQ   EQU   ISTICNCB+244                                             00945000
ICNLSTIF EQU   ISTICNCB+260                                             00946000
ICNLSTIT EQU   ISTICNCB+264                                             00947000
ICNZD001 EQU   ISTICNCB+288                                             00948000
ICNWSCCW EQU   ICNZD001                                                 00949000
ICNZD002 EQU   ISTICNCB+296                                             00950000
ICNZD003 EQU   ISTICNCB+320                                             00951000
ICNRSCCW EQU   ICNZD003                                                 00952000
ICNZD004 EQU   ISTICNCB+328                                             00953000
ICNZS1VR EQU   ISTICNCB+348                                             00954000
ICNSRV02 EQU   ICNZS1VR                                                 00955000
ICNDIEWA EQU   ICNSRV02                                                 00956000
ICNDCDEB EQU   ISTICNCB+480                                             00957000
ICNDIDEB EQU   ICNDCDEB+12                                              00958000
ICNZFLAG EQU   ISTICNCB+508                                             00959000
ICNZH002 EQU   ISTICNCB+509                                             00960000
ICNZS002 EQU   ICNZH002                                                 00961000
ICNZS003 EQU   ICNZH002                                                 00962000
ICNZS004 EQU   ICNZH002                                                 00963000
ICNZS006 EQU   ICNZH002                                                 00964000
ICNZS007 EQU   ICNZH002                                                 00965000
ICNZS008 EQU   ICNZH002                                                 00966000
ICNZS009 EQU   ICNZH002+1                                               00967000
ICNZS00A EQU   ICNZH002+1                                               00968000
ICNZCONS EQU   ISTICNCB+680                                             00969000
ISTMPST  EQU   0                                                        00970000
MPSRQUE  EQU   ISTMPST+8                                                00971000
MPSFLGA  EQU   ISTMPST+12                                               00972000
MPSASID  EQU   MPSFLGA+2                                                00973000
MPSCRA   EQU   ISTMPST+24                                               00974000
MPSCRACT EQU   MPSCRA+4                                                 00975000
MPSSRB   EQU   ISTMPST+32                                               00976000
MPSSRBCT EQU   MPSSRB+4                                                 00977000
MPSCRPL  EQU   ISTMPST+40                                               00978000
MPSRPLCT EQU   MPSCRPL+4                                                00979000
ISTSDCCN EQU   0                                                        00980000
FMZL0025 EQU   0                                                        00981000
ISTAPC38 EQU   0                                                        00982000
ISTSDCCA EQU   0                                                        00983000
ISTSDCCD EQU   0                                                        00984000
ISTSDCCF EQU   0                                                        00985000
ISTSDCCR EQU   0                                                        00986000
IOSATTSC EQU   IOSIPIB                                                  00987000
IOSWTOWA EQU   IOSIPIB                                                  00988000
IOSPCISC EQU   IOSIPIB                                                  00989000
CVTS01   EQU   CVTPGSIA                                                 00990000
CVTLPDIA EQU   CVTS01+12                                                00991000
CVTDIRST EQU   CVTLPDIA                                                 00992000
CVTSLIDA EQU   CVTS01+24                                                00993000
CVTCTLFG EQU   CVTS01+50                                                00994000
CVTRV210 EQU   CVTS01+424                                               00995000
CVTRV219 EQU   CVTS01+425                                               00996000
CVTRV228 EQU   CVTS01+426                                               00997000
CVTRV237 EQU   CVTS01+427                                               00998000
CVTMFRTR EQU   CVTS01+452                                               00999000
CVTRV262 EQU   CVTS01+468                                               01000000
CVTRV271 EQU   CVTS01+469                                               01001000
CVTRV280 EQU   CVTS01+470                                               01002000
CVTRV289 EQU   CVTS01+471                                               01003000
CVTGSDA  EQU   CVTS01+600                                               01004000
LCPZTIE  EQU   LCPCID                                                   01005000
LCPZSNAM EQU   LCPZTIE+8                                                01006000
ISTSENRU EQU   RUDATA                                                   01007000
SRUSENSE EQU   ISTSENRU                                                 01008000
SRUSENS1 EQU   SRUSENSE                                                 01009000
SRUSENS2 EQU   SRUSENSE+2                                               01010000
ISTSRU   EQU   ISTRUB                                                   01011000
SRUDATA  EQU   ISTSRU+1                                                 01012000
SRUTYPE  EQU   SRUDATA                                                  01013000
SRULDID  EQU   SRUDATA+1                                                01014000
SRUSPSN  EQU   SRULDID                                                  01015000
ISTNSRU  EQU   ISTRUB                                                   01016000
NSRUNETS EQU   ISTNSRU                                                  01017000
NSRUDATA EQU   ISTNSRU+3                                                01018000
NSRUHOOK EQU   NSRUDATA                                                 01019000
NSSSVRU  EQU   NSRUDATA                                                 01020000
NSSSVNOD EQU   NSSSVRU+3                                                01021000
NSSSVT3  EQU   NSSSVNOD                                                 01022000
NSSSVT3C EQU   NSSSVT3+2                                                01023000
NSSSVT3G EQU   NSSSVT3+5                                                01024000
NSSSVT4  EQU   NSSSVNOD                                                 01025000
NSSSVT5  EQU   NSSSVNOD                                                 01026000
NSRUDAT1 EQU   NSRUDATA                                                 01027000
NSRUDAT2 EQU   NSRUDAT1+2                                               01028000
ISTTRRU  EQU   NSRUDAT2                                                 01029000
ISTCTDRU EQU   NSRUDAT2                                                 01030000
ISTINORU EQU   NSRUDAT2                                                 01031000
SRUDAT1  EQU   SRUDATA                                                  01032000
SRUDAT1L EQU   SRUDAT1+1                                                01033000
SRUDAT2  EQU   SRUDATA                                                  01034000
ISTMRU   EQU   ISTRUB                                                   01035000
SRUDATA3 EQU   SRUDATA                                                  01036000
SRUDATA4 EQU   SRUDATA                                                  01037000
NSRUDAT3 EQU   NSRUDAT2                                                 01038000
NSRUDAT4 EQU   NSRUDAT2                                                 01039000
NSRUDAT5 EQU   NSRUDAT2                                                 01040000
NSRUDAT6 EQU   NSRUDAT2                                                 01041000
NSRUDAT7 EQU   NSRUDAT2                                                 01042000
NSRUDIL  EQU   NSRUDAT2                                                 01043000
NSRUDILB EQU   NSRUDIL+1                                                01044000
NSRUNA   EQU   NSRUDAT2                                                 01045000
NSRUNA2  EQU   NSRUNA+1                                                 01046000
NSRUCLSP EQU   NSRUDAT2                                                 01047000
NSRUOH1  EQU   NSRUDAT2                                                 01048000
NSRUDAT8 EQU   NSRUDATA                                                 01049000
ISTUNBRU EQU   SRUTYPE                                                  01050000
FSBCOMBN EQU   FSBNETRS                                                 01051000
FSBRHFLD EQU   FSBCOMBN+1                                               01052000
FSBRH3   EQU   FSBRHFLD+2                                               01053000
FSBLDFLG EQU   FSBRH3                                                   01054000
@NM00035 EQU   FSBRQTAG                                                 01055000
ZOBDLBT  EQU   ISTZOBUF                                                 01056000
ZOBDLBCM EQU   ZOBDLBT                                                  01057000
ZOBFDB   EQU   ZOBDLBCM                                                 01058000
@NM00037 EQU   ZOBDLBCM+25                                              01059000
ZOBBTU   EQU   ZOBDLBT+28                                               01060000
ZOBWCC   EQU   ZOBDLBT+48                                               01061000
ZOBECCC  EQU   ZOBDLBT+50                                               01062000
ZOBDIO   EQU   ZOBFSM                                                   01063000
ZOBCPWTF EQU   ZOBDIO+4                                                 01064000
ZOBCCW2  EQU   ZOBDIO+8                                                 01065000
ZOBCPTCC EQU   ZOBCCW2                                                  01066000
ZOBFLAGS EQU   ZOBCCW2+5                                                01067000
ZOBRT08  EQU   ZOBFLAGS                                                 01068000
ZOBCCW3  EQU   ZOBDIO+16                                                01069000
ZOBCPTRC EQU   ZOBCCW3                                                  01070000
ZOBCPN2C EQU   ZOBCPTRC                                                 01071000
ZOBCPTRA EQU   ZOBCCW3+1                                                01072000
@NM00041 EQU   ZOBBTU                                                   01073000
ZOBLH    EQU   @NM00041                                                 01074000
ZOBTH2   EQU   @NM00041+4                                               01075000
CMZCIDM  EQU   ATCCIDM                                                  01076000
SRB      EQU   SRBSECT                                                  01077000
ZOBTEXT  EQU   ZOBBTU                                                   01078000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01079000
ZOBCPN2K EQU   ZOBCCW3+6                                                01080000
ZOBRSV99 EQU   ZOBCCW3+5                                                01081000
ZOBCPN2F EQU   ZOBCCW3+4                                                01082000
ZOBCPTC2 EQU   ZOBCPTRA                                                 01083000
ZOBCPTC1 EQU   ZOBCPN2C                                                 01084000
ZOBCPNPK EQU   ZOBCCW2+6                                                01085000
ZOBRSV03 EQU   ZOBFLAGS                                                 01086000
ZOBRT06  EQU   ZOBFLAGS                                                 01087000
ZOBCPNPF EQU   ZOBCCW2+4                                                01088000
ZOBCPTCA EQU   ZOBCCW2+1                                                01089000
ZOBCPNPC EQU   ZOBCPTCC                                                 01090000
ZOBCPWTK EQU   ZOBDIO+6                                                 01091000
ZOBRSV02 EQU   ZOBDIO+5                                                 01092000
ZOBCPTXA EQU   ZOBDIO+1                                                 01093000
ZOBCPWTC EQU   ZOBDIO                                                   01094000
ZOBRSV09 EQU   ZOBECCC                                                  01095000
ZOBECSP  EQU   ZOBECCC                                                  01096000
ZOBRSV08 EQU   ZOBECCC                                                  01097000
ZOBRSV07 EQU   ZOBDLBT+49                                               01098000
ZOBRSV06 EQU   ZOBWCC                                                   01099000
ZOBWCSP  EQU   ZOBWCC                                                   01100000
ZOBRSV05 EQU   ZOBWCC                                                   01101000
ZOBRSV10 EQU   ZOBDLBCM+26                                              01102000
@NM00040 EQU   @NM00037                                                 01103000
@NM00039 EQU   @NM00037                                                 01104000
@NM00038 EQU   @NM00037                                                 01105000
ZOBRSV04 EQU   ZOBDLBCM+16                                              01106000
ZOBLNG2  EQU   ZOBDLBCM+14                                              01107000
ZOBRSV01 EQU   ZOBDLBCM+12                                              01108000
FSBRT0B  EQU   @NM00035+1                                               01109000
FSBRT0A  EQU   @NM00035+1                                               01110000
FSBRT09  EQU   @NM00035+1                                               01111000
FSBRT08  EQU   @NM00035+1                                               01112000
FSBRT07  EQU   @NM00035                                                 01113000
FSBRT06  EQU   @NM00035                                                 01114000
FSBRT05  EQU   @NM00035                                                 01115000
FSBRT04  EQU   @NM00035                                                 01116000
FSBRT03  EQU   @NM00035                                                 01117000
FSBRT02  EQU   @NM00035                                                 01118000
FSBRT01  EQU   @NM00035                                                 01119000
FSBRT00  EQU   @NM00035                                                 01120000
FSBLDCUF EQU   FSBLDFLG                                                 01121000
FSBLDSIF EQU   FSBLDFLG                                                 01122000
FSBLDSOF EQU   FSBLDFLG                                                 01123000
FSBLDEBF EQU   FSBLDFLG                                                 01124000
FSBLDBBF EQU   FSBLDFLG                                                 01125000
FSBLDFME EQU   FSBLDFLG                                                 01126000
FSBLDSCF EQU   FSBLDFLG                                                 01127000
FSBLDRMF EQU   FSBLDFLG                                                 01128000
FSBRH2   EQU   FSBRHFLD+1                                               01129000
FSBRH1   EQU   FSBRHFLD                                                 01130000
FSBALIGN EQU   FSBCOMBN                                                 01131000
UNBTYPE  EQU   ISTUNBRU                                                 01132000
NSRUDA8T EQU   NSRUDAT8                                                 01133000
NSRUOHID EQU   NSRUOH1                                                  01134000
NSRULSV  EQU   NSRUCLSP                                                 01135000
NSRUNA4  EQU   NSRUNA+2                                                 01136000
NSRUNA3  EQU   NSRUNA2                                                  01137000
NSRUNA1  EQU   NSRUNA                                                   01138000
NSRUDILF EQU   NSRUDIL+4                                                01139000
NSRUDILE EQU   NSRUDIL+3                                                01140000
NSRUDILD EQU   NSRUDIL+2                                                01141000
NSRUDILC EQU   NSRUDILB                                                 01142000
@NM00031 EQU   NSRUDILB                                                 01143000
NSRUDILA EQU   NSRUDIL                                                  01144000
NSRUDA7T EQU   NSRUDAT7                                                 01145000
NSRUDA6L EQU   NSRUDAT6+4                                               01146000
NSRUDA6S EQU   NSRUDAT6                                                 01147000
NSRUDA5E EQU   NSRUDAT5                                                 01148000
NSRUDA4T EQU   NSRUDAT4                                                 01149000
NSRUDA3S EQU   NSRUDAT3                                                 01150000
SRUDAT4D EQU   SRUDATA4                                                 01151000
SRUDAT3I EQU   SRUDATA3                                                 01152000
MRUDATA  EQU   ISTMRU+9                                                 01153000
MRURESP  EQU   ISTMRU+7                                                 01154000
MRUMODIF EQU   ISTMRU+6                                                 01155000
MRUCMND  EQU   ISTMRU+5                                                 01156000
MRUDAF   EQU   ISTMRU+3                                                 01157000
MRUREQ   EQU   ISTMRU+2                                                 01158000
MRUPREF  EQU   ISTMRU                                                   01159000
SRUDAT2N EQU   SRUDAT2+1                                                01160000
SRUDAT2T EQU   SRUDAT2                                                  01161000
SRUDAT1I EQU   SRUDAT1+2                                                01162000
SRUTSPRO EQU   SRUDAT1L                                                 01163000
SRUFMPRO EQU   SRUDAT1L                                                 01164000
SRUDAT1T EQU   SRUDAT1                                                  01165000
INORUET  EQU   ISTINORU                                                 01166000
CTDRUSTA EQU   ISTCTDRU                                                 01167000
TRRDATA  EQU   ISTTRRU+4                                                01168000
TRRSTAT  EQU   ISTTRRU+3                                                01169000
TRRPEP   EQU   ISTTRRU+2                                                01170000
TRRTIME  EQU   ISTTRRU+1                                                01171000
TRRTYPE  EQU   ISTTRRU                                                  01172000
NSRUDAF  EQU   NSRUDAT1                                                 01173000
NSSSVT5A EQU   NSSSVT5                                                  01174000
NSSSVT4D EQU   NSSSVT4+3                                                01175000
NSSSVT4C EQU   NSSSVT4+2                                                01176000
NSSSVT4B EQU   NSSSVT4+1                                                01177000
NSSSVT4A EQU   NSSSVT4                                                  01178000
NSSSVT3K EQU   NSSSVT3+8                                                01179000
NSSSVT3J EQU   NSSSVT3+7                                                01180000
NSSSVT3I EQU   NSSSVT3+6                                                01181000
@NM00030 EQU   NSSSVT3G                                                 01182000
NSSSVT3H EQU   NSSSVT3G                                                 01183000
NSSSVT3F EQU   NSSSVT3+4                                                01184000
NSSSVT3E EQU   NSSSVT3+3                                                01185000
@NM00029 EQU   NSSSVT3C                                                 01186000
NSSSVT3D EQU   NSSSVT3C                                                 01187000
NSSSVT3B EQU   NSSSVT3+1                                                01188000
NSSSVT3A EQU   NSSSVT3                                                  01189000
NSSSVT   EQU   NSSSVRU+2                                                01190000
NSSSVDAF EQU   NSSSVRU                                                  01191000
NSRUHKTY EQU   NSRUHOOK                                                 01192000
NSRURCD  EQU   NSRUNETS+2                                               01193000
NSRUSUB  EQU   NSRUNETS+1                                               01194000
NSRUID   EQU   NSRUNETS                                                 01195000
SRURSV01 EQU   SRULDID+4                                                01196000
SRUPSSN  EQU   SRULDID+2                                                01197000
SRUDFCLV EQU   SRUSPSN                                                  01198000
@NM00028 EQU   SRUTYPE                                                  01199000
SRUPSAC  EQU   SRUTYPE                                                  01200000
SRUSPAC  EQU   SRUTYPE                                                  01201000
SRUQSREQ EQU   ISTSRU                                                   01202000
SENRU    EQU   ISTSENRU+4                                               01203000
SRUSNS4  EQU   SRUSENS2+1                                               01204000
SRUSNS3  EQU   SRUSENS2                                                 01205000
SRUSNST  EQU   SRUSENS1+1                                               01206000
SRUSNS1  EQU   SRUSENS1                                                 01207000
LCPZTRV4 EQU   LCPZSNAM+4                                               01208000
LCPZTRV1 EQU   LCPZSNAM                                                 01209000
LCPZSNA  EQU   LCPZTIE+4                                                01210000
LCPZFMCA EQU   LCPZTIE                                                  01211000
CVTRV628 EQU   CVTS01+728                                               01212000
CVTRV627 EQU   CVTS01+724                                               01213000
CVTRV626 EQU   CVTS01+720                                               01214000
CVTRV625 EQU   CVTS01+716                                               01215000
CVTRV624 EQU   CVTS01+712                                               01216000
CVTRV623 EQU   CVTS01+708                                               01217000
CVTRV622 EQU   CVTS01+704                                               01218000
CVTRV621 EQU   CVTS01+700                                               01219000
CVTRV620 EQU   CVTS01+696                                               01220000
CVTRV619 EQU   CVTS01+692                                               01221000
CVTRV618 EQU   CVTS01+688                                               01222000
CVTRV617 EQU   CVTS01+684                                               01223000
CVTRV616 EQU   CVTS01+680                                               01224000
CVTRV615 EQU   CVTS01+676                                               01225000
CVTRV614 EQU   CVTS01+672                                               01226000
CVTRV613 EQU   CVTS01+668                                               01227000
CVTTCASP EQU   CVTS01+664                                               01228000
CVT0PT03 EQU   CVTS01+660                                               01229000
CVT0PT0E EQU   CVTS01+656                                               01230000
CVTIRM   EQU   CVTS01+652                                               01231000
CVTCGK   EQU   CVTS01+648                                               01232000
CVTRV607 EQU   CVTS01+644                                               01233000
CVTRV606 EQU   CVTS01+640                                               01234000
CVTRV605 EQU   CVTS01+636                                               01235000
CVTRV604 EQU   CVTS01+632                                               01236000
CVTEFF02 EQU   CVTS01+628                                               01237000
CVTCBBR  EQU   CVTS01+624                                               01238000
CVTSSCR  EQU   CVTS01+620                                               01239000
CVTEVENT EQU   CVTS01+616                                               01240000
CVTCRCA  EQU   CVTS01+612                                               01241000
CVTTPIO  EQU   CVTS01+608                                               01242000
CVTADV   EQU   CVTS01+604                                               01243000
CVTGSDAB EQU   CVTGSDA                                                  01244000
CVTQV3   EQU   CVTS01+596                                               01245000
CVTQV2   EQU   CVTS01+592                                               01246000
CVTQV1   EQU   CVTS01+588                                               01247000
CVTRPT   EQU   CVTS01+584                                               01248000
CVTSSRB  EQU   CVTS01+580                                               01249000
CVTCSDRL EQU   CVTS01+576                                               01250000
CVTEXP1  EQU   CVTS01+572                                               01251000
CVTRMPMT EQU   CVTS01+568                                               01252000
CVTRMPTT EQU   CVTS01+564                                               01253000
CVTVPSA  EQU   CVTS01+560                                               01254000
CVTVSTOP EQU   CVTS01+556                                               01255000
CVTGTFR8 EQU   CVTS01+552                                               01256000
CVTQUIT  EQU   CVTS01+548                                               01257000
CVTVACR  EQU   CVTS01+544                                               01258000
CVTWTCB  EQU   CVTS01+540                                               01259000
CVTSTPRS EQU   CVTS01+536                                               01260000
CVT0PT02 EQU   CVTS01+532                                               01261000
CVTDARCM EQU   CVTS01+528                                               01262000
CVTIRECM EQU   CVTS01+524                                               01263000
CVTJRECM EQU   CVTS01+520                                               01264000
CVTVEMS0 EQU   CVTS01+516                                               01265000
CVTSPFRR EQU   CVTS01+512                                               01266000
CVTRLSTG EQU   CVTS01+508                                               01267000
CVT0TC0A EQU   CVTS01+504                                               01268000
CVTGMBR  EQU   CVTS01+500                                               01269000
CVTLFRM  EQU   CVTS01+496                                               01270000
CVTRMBR  EQU   CVTS01+492                                               01271000
CVTVIOP  EQU   CVTS01+488                                               01272000
CVTRV307 EQU   CVTS01+486                                               01273000
CVTRV306 EQU   CVTS01+484                                               01274000
CVTRV305 EQU   CVTS01+482                                               01275000
CVTRV304 EQU   CVTS01+480                                               01276000
CVTRV303 EQU   CVTS01+478                                               01277000
CVTRV302 EQU   CVTS01+476                                               01278000
CVTTRCA  EQU   CVTS01+472                                               01279000
CVTRV297 EQU   CVTRV289                                                 01280000
CVTRV296 EQU   CVTRV289                                                 01281000
CVTRV295 EQU   CVTRV289                                                 01282000
CVTRV294 EQU   CVTRV289                                                 01283000
CVTRV293 EQU   CVTRV289                                                 01284000
CVTRV292 EQU   CVTRV289                                                 01285000
CVTRV291 EQU   CVTRV289                                                 01286000
CVTRV290 EQU   CVTRV289                                                 01287000
CVTRV288 EQU   CVTRV280                                                 01288000
CVTRV287 EQU   CVTRV280                                                 01289000
CVTRV286 EQU   CVTRV280                                                 01290000
CVTRV285 EQU   CVTRV280                                                 01291000
CVTRV284 EQU   CVTRV280                                                 01292000
CVTRV283 EQU   CVTRV280                                                 01293000
CVTRV282 EQU   CVTRV280                                                 01294000
CVTRV281 EQU   CVTRV280                                                 01295000
CVTRV279 EQU   CVTRV271                                                 01296000
CVTRV278 EQU   CVTRV271                                                 01297000
CVTRV277 EQU   CVTRV271                                                 01298000
CVTRV276 EQU   CVTRV271                                                 01299000
CVTRV275 EQU   CVTRV271                                                 01300000
CVTRV274 EQU   CVTRV271                                                 01301000
CVTRV273 EQU   CVTRV271                                                 01302000
CVTRV272 EQU   CVTRV271                                                 01303000
CVTRV270 EQU   CVTRV262                                                 01304000
CVTRV269 EQU   CVTRV262                                                 01305000
CVTRV268 EQU   CVTRV262                                                 01306000
CVTRV267 EQU   CVTRV262                                                 01307000
CVTRV266 EQU   CVTRV262                                                 01308000
CVTRV265 EQU   CVTRV262                                                 01309000
CVTRV264 EQU   CVTRV262                                                 01310000
CVTRV263 EQU   CVTRV262                                                 01311000
CVTVFP   EQU   CVTS01+464                                               01312000
CVTVSI   EQU   CVTS01+460                                               01313000
CVTVPSIB EQU   CVTS01+456                                               01314000
CVTMFACT EQU   CVTMFRTR                                                 01315000
CVTMFCTL EQU   CVTS01+448                                               01316000
CVTPVBP  EQU   CVTS01+444                                               01317000
CVTPWI   EQU   CVTS01+440                                               01318000
CVTRV254 EQU   CVTS01+438                                               01319000
CVTRV253 EQU   CVTS01+436                                               01320000
CVTRV252 EQU   CVTS01+434                                               01321000
CVTRV251 EQU   CVTS01+433                                               01322000
CVTRV250 EQU   CVTS01+432                                               01323000
CVTRV249 EQU   CVTS01+431                                               01324000
CVTRV248 EQU   CVTS01+430                                               01325000
CVTRV247 EQU   CVTS01+429                                               01326000
CVTRV246 EQU   CVTS01+428                                               01327000
CVTRV245 EQU   CVTRV237                                                 01328000
CVTRV244 EQU   CVTRV237                                                 01329000
CVTRV243 EQU   CVTRV237                                                 01330000
CVTRV242 EQU   CVTRV237                                                 01331000
CVTRV241 EQU   CVTRV237                                                 01332000
CVTRV240 EQU   CVTRV237                                                 01333000
CVTRV239 EQU   CVTRV237                                                 01334000
CVTRV238 EQU   CVTRV237                                                 01335000
CVTRV236 EQU   CVTRV228                                                 01336000
CVTRV235 EQU   CVTRV228                                                 01337000
CVTRV234 EQU   CVTRV228                                                 01338000
CVTRV233 EQU   CVTRV228                                                 01339000
CVTRV232 EQU   CVTRV228                                                 01340000
CVTRV231 EQU   CVTRV228                                                 01341000
CVTRV230 EQU   CVTRV228                                                 01342000
CVTRV229 EQU   CVTRV228                                                 01343000
CVTRV227 EQU   CVTRV219                                                 01344000
CVTRV226 EQU   CVTRV219                                                 01345000
CVTRV225 EQU   CVTRV219                                                 01346000
CVTRV224 EQU   CVTRV219                                                 01347000
CVTRV223 EQU   CVTRV219                                                 01348000
CVTRV222 EQU   CVTRV219                                                 01349000
CVTRV221 EQU   CVTRV219                                                 01350000
CVTRV220 EQU   CVTRV219                                                 01351000
CVTRV218 EQU   CVTRV210                                                 01352000
CVTRV217 EQU   CVTRV210                                                 01353000
CVTRV216 EQU   CVTRV210                                                 01354000
CVTRV215 EQU   CVTRV210                                                 01355000
CVTRV214 EQU   CVTRV210                                                 01356000
CVTRV213 EQU   CVTRV210                                                 01357000
CVTRV212 EQU   CVTRV210                                                 01358000
CVTRV211 EQU   CVTRV210                                                 01359000
CVTLCCAT EQU   CVTS01+420                                               01360000
CVTPCCAT EQU   CVTS01+416                                               01361000
CVTIPCRP EQU   CVTS01+412                                               01362000
CVTIPCRI EQU   CVTS01+408                                               01363000
CVTIPCDS EQU   CVTS01+404                                               01364000
CVTAIDVT EQU   CVTS01+400                                               01365000
CVTSSAP  EQU   CVTS01+396                                               01366000
CVTEHCIR EQU   CVTS01+392                                               01367000
CVTEHDEF EQU   CVTS01+388                                               01368000
CVTDAIR  EQU   CVTS01+384                                               01369000
CVTPERFM EQU   CVTS01+380                                               01370000
CVT044R2 EQU   CVTS01+376                                               01371000
CVTFETCH EQU   CVTS01+372                                               01372000
CVTRSTWD EQU   CVTS01+368                                               01373000
CVTSPOST EQU   CVTS01+364                                               01374000
CVTIOBP  EQU   CVTS01+360                                               01375000
CVTASMVT EQU   CVTS01+356                                               01376000
CVTRECRQ EQU   CVTS01+352                                               01377000
CVTWSAC  EQU   CVTS01+348                                               01378000
CVTRV149 EQU   CVTS01+344                                               01379000
CVTWSAL  EQU   CVTS01+340                                               01380000
CVTSPSA  EQU   CVTS01+336                                               01381000
CVTGLMN  EQU   CVTS01+332                                               01382000
CVTVEAC0 EQU   CVTS01+328                                               01383000
CVT062R1 EQU   CVTS01+324                                               01384000
CVTRPOST EQU   CVTS01+320                                               01385000
CVTDQIQE EQU   CVTS01+316                                               01386000
CVTCSD   EQU   CVTS01+312                                               01387000
CVTLKRMA EQU   CVTS01+308                                               01388000
CVTRSPIE EQU   CVTS01+304                                               01389000
CVTRENQ  EQU   CVTS01+300                                               01390000
CVTLQCB  EQU   CVTS01+296                                               01391000
CVTFQCB  EQU   CVTS01+292                                               01392000
CVTQCS01 EQU   CVTS01+288                                               01393000
CVTAPFT  EQU   CVTS01+284                                               01394000
CVTPARRL EQU   CVTS01+280                                               01395000
CVTVWAIT EQU   CVTS01+276                                               01396000
CVTGSPL  EQU   CVTS01+272                                               01397000
CVTLSMQ  EQU   CVTS01+268                                               01398000
CVTGSMQ  EQU   CVTS01+264                                               01399000
CVTEXPRO EQU   CVTS01+260                                               01400000
CVTOPCTP EQU   CVTS01+256                                               01401000
CVTSIC   EQU   CVTS01+252                                               01402000
CVTTPIOS EQU   CVTS01+248                                               01403000
CVTRTMS  EQU   CVTS01+244                                               01404000
CVTSDBF  EQU   CVTS01+240                                               01405000
CVTSCBP  EQU   CVTS01+236                                               01406000
CVTSDMP  EQU   CVTS01+232                                               01407000
CVTSV60  EQU   CVTS01+228                                               01408000
CVTRTMCT EQU   CVTS01+224                                               01409000
CVTASCBL EQU   CVTS01+220                                               01410000
CVTASCBH EQU   CVTS01+216                                               01411000
CVTGDA   EQU   CVTS01+212                                               01412000
CVTASVT  EQU   CVTS01+208                                               01413000
CVTVVMDI EQU   CVTS01+204                                               01414000
CVTAQTOP EQU   CVTS01+200                                               01415000
CVTIOSCS EQU   CVTS01+196                                               01416000
CVTSDRM  EQU   CVTS01+192                                               01417000
CVTOPTE  EQU   CVTS01+188                                               01418000
CVTSTXU  EQU   CVTS01+184                                               01419000
CVTQUIS  EQU   CVTS01+180                                               01420000
CVTPARS  EQU   CVTS01+176                                               01421000
CVTS1EE  EQU   CVTS01+172                                               01422000
CVTFRAS  EQU   CVTS01+168                                               01423000
CVTQSAS  EQU   CVTS01+164                                               01424000
CVTCRAS  EQU   CVTS01+160                                               01425000
CVTCRMN  EQU   CVTS01+156                                               01426000
CVTDELCP EQU   CVTS01+152                                               01427000
CVTFRECL EQU   CVTS01+148                                               01428000
CVTGETCL EQU   CVTS01+144                                               01429000
CVTBLDCP EQU   CVTS01+140                                               01430000
CVTAUTHL EQU   CVTS01+136                                               01431000
CVTSCAN  EQU   CVTS01+132                                               01432000
CVTRV144 EQU   CVTS01+130                                               01433000
CVTMAXMP EQU   CVTS01+128                                               01434000
CVTSTCK  EQU   CVTS01+124                                               01435000
CVTRV139 EQU   CVTS01+123                                               01436000
CVTDSSAC EQU   CVTS01+122                                               01437000
CVTRV513 EQU   CVTS01+121                                               01438000
CVTIOSPL EQU   CVTS01+120                                               01439000
CVTPTGT  EQU   CVTS01+116                                               01440000
CVTCSPIE EQU   CVTS01+112                                               01441000
CVTSMFEX EQU   CVTS01+108                                               01442000
CVTOLT0A EQU   CVTS01+104                                               01443000
CVTSRBRT EQU   CVTS01+100                                               01444000
CVTPUTL  EQU   CVTS01+96                                                01445000
CVTASCRL EQU   CVTS01+92                                                01446000
CVTASCRF EQU   CVTS01+88                                                01447000
CVTRV326 EQU   CVTS01+84                                                01448000
CVTRV325 EQU   CVTS01+80                                                01449000
CVTRV324 EQU   CVTS01+76                                                01450000
CVT0VL01 EQU   CVTS01+72                                                01451000
CVTSHRVM EQU   CVTS01+68                                                01452000
CVTRV332 EQU   CVTS01+64                                                01453000
CVTTAS   EQU   CVTS01+60                                                01454000
CVTRSCN  EQU   CVTS01+56                                                01455000
CVTTRAC2 EQU   CVTS01+54                                                01456000
CVTTRACE EQU   CVTS01+52                                                01457000
CVTAPG   EQU   CVTS01+51                                                01458000
CVTSDTRC EQU   CVTCTLFG                                                 01459000
CVTGTRCE EQU   CVTCTLFG                                                 01460000
CVTNOMP  EQU   CVTCTLFG                                                 01461000
CVTRSV79 EQU   CVTCTLFG                                                 01462000
CVTDSTAT EQU   CVTCTLFG                                                 01463000
CVTRSV78 EQU   CVTCTLFG                                                 01464000
CVTRV333 EQU   CVTCTLFG                                                 01465000
CVTRV323 EQU   CVTCTLFG                                                 01466000
CVTSPVLK EQU   CVTS01+49                                                01467000
CVTRSV77 EQU   CVTS01+48                                                01468000
CVTRV331 EQU   CVTS01+44                                                01469000
CVTRV330 EQU   CVTS01+40                                                01470000
CVTRV329 EQU   CVTS01+36                                                01471000
CVTRV328 EQU   CVTS01+32                                                01472000
CVTRV322 EQU   CVTS01+28                                                01473000
CVTSLID  EQU   CVTSLIDA+1                                               01474000
CVTSYLK  EQU   CVTSLIDA                                                 01475000
CVTRV321 EQU   CVTS01+20                                                01476000
CVTRV320 EQU   CVTS01+16                                                01477000
CVTLPDIR EQU   CVTLPDIA+1                                               01478000
CVTRSV69 EQU   CVTDIRST                                                 01479000
CVTRSV68 EQU   CVTDIRST                                                 01480000
CVTRSV67 EQU   CVTDIRST                                                 01481000
CVTRSV66 EQU   CVTDIRST                                                 01482000
CVTRSV65 EQU   CVTDIRST                                                 01483000
CVTRSV64 EQU   CVTDIRST                                                 01484000
CVTRSV63 EQU   CVTDIRST                                                 01485000
CVTDICOM EQU   CVTDIRST                                                 01486000
CVTPVTP  EQU   CVTS01+8                                                 01487000
CVTLPDSR EQU   CVTS01+4                                                 01488000
CVTGETL  EQU   CVTS01                                                   01489000
IOSPCIWA EQU   IOSPCISC+44                                              01490000
IOSPCIRS EQU   IOSPCISC+8                                               01491000
@NM00007 EQU   IOSPCISC+4                                               01492000
@NM00006 EQU   IOSPCISC                                                 01493000
IOSWRNDR EQU   IOSWTOWA+4                                               01494000
IOSWTOPT EQU   IOSWTOWA+3                                               01495000
IOSWTOCP EQU   IOSWTOWA+2                                               01496000
IOSWTOCH EQU   IOSWTOWA                                                 01497000
IOSATTWA EQU   IOSATTSC+40                                              01498000
@NM00005 EQU   IOSATTSC+24                                              01499000
IOSATTSN EQU   IOSATTSC                                                 01500000
MPSSRB1  EQU   ISTMPST+172                                              01501000
MPSSAVE  EQU   ISTMPST+140                                              01502000
MPSMQLBP EQU   ISTMPST+136                                              01503000
MPSSYSRT EQU   ISTMPST+132                                              01504000
MPSQEL   EQU   ISTMPST+128                                              01505000
MPSDBTBL EQU   ISTMPST+124                                              01506000
MPSASCB  EQU   ISTMPST+120                                              01507000
MPSTPPAB EQU   ISTMPST+88                                               01508000
MPSSMPAB EQU   ISTMPST+56                                               01509000
MPSSMRPH EQU   ISTMPST+52                                               01510000
MPSSRB55 EQU   ISTMPST+48                                               01511000
MPSRPLAC EQU   MPSRPLCT+2                                               01512000
MPSRPLRC EQU   MPSRPLCT                                                 01513000
MPSCRPLQ EQU   MPSCRPL                                                  01514000
MPSSRBAC EQU   MPSSRBCT+2                                               01515000
MPSSRBRC EQU   MPSSRBCT                                                 01516000
MPSSRBQ  EQU   MPSSRB                                                   01517000
MPSCRAAC EQU   MPSCRACT+2                                               01518000
MPSCRARC EQU   MPSCRACT                                                 01519000
MPSCRAQ  EQU   MPSCRA                                                   01520000
MPSMPSTP EQU   ISTMPST+20                                               01521000
MPSPSTCT EQU   ISTMPST+16                                               01522000
MPSRSV02 EQU   MPSFLGA+1                                                01523000
MPSPSTAB EQU   MPSFLGA                                                  01524000
MPSRSV01 EQU   MPSFLGA                                                  01525000
MPSTPBU  EQU   MPSFLGA                                                  01526000
MPMEMTRM EQU   MPSFLGA                                                  01527000
MPSAUTH  EQU   MPSFLGA                                                  01528000
MPSCRAO  EQU   MPSFLGA                                                  01529000
MPSSRBO  EQU   MPSFLGA                                                  01530000
MPSRQUEG EQU   MPSRQUE                                                  01531000
MPSRSV07 EQU   ISTMPST+4                                                01532000
MPSID    EQU   ISTMPST                                                  01533000
ICNZCON6 EQU   ICNZCONS+10                                              01534000
ICNZCON5 EQU   ICNZCONS+8                                               01535000
ICNZCON4 EQU   ICNZCONS+6                                               01536000
ICNZCON3 EQU   ICNZCONS+4                                               01537000
ICNZCON2 EQU   ICNZCONS+2                                               01538000
ICNZCON1 EQU   ICNZCONS                                                 01539000
ICNZATSA EQU   ISTICNCB+676                                             01540000
ICNZX012 EQU   ISTICNCB+675                                             01541000
ICNZX011 EQU   ISTICNCB+674                                             01542000
ICNZX010 EQU   ISTICNCB+672                                             01543000
ICNSRB   EQU   ISTICNCB+628                                             01544000
ICNIOSB  EQU   ISTICNCB+520                                             01545000
ICNZC001 EQU   ISTICNCB+512                                             01546000
ICNZX013 EQU   ISTICNCB+511                                             01547000
ICNZS010 EQU   ICNZH002+1                                               01548000
ICNZS00F EQU   ICNZH002+1                                               01549000
ICNZS00E EQU   ICNZH002+1                                               01550000
ICNZS00D EQU   ICNZH002+1                                               01551000
ICNZS00C EQU   ICNZH002+1                                               01552000
ICNZS00B EQU   ICNZH002+1                                               01553000
ICNZS01A EQU   ICNZS00A                                                 01554000
ICNZS019 EQU   ICNZS009                                                 01555000
ICNZS018 EQU   ICNZS008                                                 01556000
ICNZS017 EQU   ICNZS007                                                 01557000
ICNZS016 EQU   ICNZS006                                                 01558000
ICNZS005 EQU   ICNZH002                                                 01559000
ICNZS014 EQU   ICNZS004                                                 01560000
ICNZS013 EQU   ICNZS003                                                 01561000
ICNZS012 EQU   ICNZS002                                                 01562000
ICNZS001 EQU   ICNZH002                                                 01563000
ICNZF028 EQU   ICNZFLAG                                                 01564000
ICNZF027 EQU   ICNZFLAG                                                 01565000
ICNZF026 EQU   ICNZFLAG                                                 01566000
ICNZF025 EQU   ICNZFLAG                                                 01567000
ICNZF024 EQU   ICNZFLAG                                                 01568000
ICNZF023 EQU   ICNZFLAG                                                 01569000
ICNZF022 EQU   ICNZFLAG                                                 01570000
ICNZF021 EQU   ICNZFLAG                                                 01571000
ICNWORD5 EQU   ISTICNCB+504                                             01572000
ICNMSIZE EQU   ISTICNCB+500                                             01573000
ICNLCVTA EQU   ISTICNCB+496                                             01574000
ICNDEBAD EQU   ICNDIDEB+1                                               01575000
ICNDCBIF EQU   ICNDIDEB                                                 01576000
ICNUCBAD EQU   ICNDCDEB+8                                               01577000
ICNAPPAD EQU   ICNDCDEB+5                                               01578000
ICNEXSCL EQU   ICNDCDEB+4                                               01579000
ICNDCBAD EQU   ICNDCDEB+1                                               01580000
ICNDEBID EQU   ICNDCDEB                                                 01581000
@NM00052 EQU   ISTICNCB+477                                             01582000
ICNERCNT EQU   ISTICNCB+476                                             01583000
ICNZX002 EQU   ISTICNCB+475                                             01584000
ICNZX001 EQU   ISTICNCB+474                                             01585000
ICNZH001 EQU   ISTICNCB+472                                             01586000
ICNZSW3R EQU   ISTICNCB+468                                             01587000
ICNZSW2R EQU   ISTICNCB+464                                             01588000
ICNZSW1R EQU   ISTICNCB+460                                             01589000
ICNZS4VR EQU   ISTICNCB+436                                             01590000
ICNZS4RR EQU   ISTICNCB+432                                             01591000
ICNZS4FC EQU   ISTICNCB+428                                             01592000
ICNZS4BC EQU   ISTICNCB+424                                             01593000
ICNZS3VR EQU   ISTICNCB+400                                             01594000
ICNZS3RR EQU   ISTICNCB+396                                             01595000
ICNZS3FC EQU   ISTICNCB+392                                             01596000
ICNZS3BC EQU   ISTICNCB+388                                             01597000
ICNZS1RC EQU   ICNZS1VR+36                                              01598000
ICNDIEW3 EQU   ICNDIEWA+8                                               01599000
ICNDIEW2 EQU   ICNDIEWA+4                                               01600000
ICNDIEW1 EQU   ICNDIEWA                                                 01601000
ICNZS1RR EQU   ISTICNCB+344                                             01602000
ICNZS1FC EQU   ISTICNCB+340                                             01603000
ICNZS1BC EQU   ISTICNCB+336                                             01604000
ICNRSTIC EQU   ICNZD004                                                 01605000
ICNRDCOD EQU   ICNRSCCW                                                 01606000
ICNZD006 EQU   ISTICNCB+312                                             01607000
ICNZD005 EQU   ISTICNCB+304                                             01608000
ICNWSTIC EQU   ICNZD002                                                 01609000
ICNWRCOD EQU   ICNWSCCW                                                 01610000
ICNZV008 EQU   ISTICNCB+284                                             01611000
ICNZV007 EQU   ISTICNCB+280                                             01612000
ICNZV006 EQU   ISTICNCB+276                                             01613000
ICNZV005 EQU   ISTICNCB+272                                             01614000
ICNZV004 EQU   ISTICNCB+268                                             01615000
ICNZV002 EQU   ISTICNCB+256                                             01616000
ICNZV001 EQU   ISTICNCB+252                                             01617000
ICNZV00A EQU   ISTICNCB+249                                             01618000
ICNBUFF  EQU   ISTICNCB+248                                             01619000
ICNNICNA EQU   ISTICNCB+240                                             01620000
@NM00051 EQU   ICNFLAG2+2                                               01621000
ICNZF019 EQU   ICNFLAG2+2                                               01622000
ICNZF018 EQU   ICNFLAG2+2                                               01623000
ICNZF017 EQU   ICNFLAG2+2                                               01624000
ICNZF016 EQU   ICNFLAG2+2                                               01625000
ICNZF015 EQU   ICNFLAG2+2                                               01626000
ICNMSG   EQU   ICNFLAG2+1                                               01627000
ICNCLOSE EQU   ICNFLAG2+1                                               01628000
ICNZF014 EQU   ICNFLAG2+1                                               01629000
ICNZF013 EQU   ICNFLAG2+1                                               01630000
ICNZF012 EQU   ICNFLAG2+1                                               01631000
ICNZF011 EQU   ICNFLAG2+1                                               01632000
ICNZF00D EQU   ICNFLAG2+1                                               01633000
ICNZF00B EQU   ICNFLAG2+1                                               01634000
ICNZF00A EQU   ICNFLAG2                                                 01635000
ICNZF008 EQU   ICNFLAG2                                                 01636000
ICNZF007 EQU   ICNFLAG2                                                 01637000
ICNZF005 EQU   ICNFLAG2                                                 01638000
ICNZF004 EQU   ICNFLAG2                                                 01639000
ICNZF003 EQU   ICNFLAG2                                                 01640000
ICNZF002 EQU   ICNFLAG2                                                 01641000
ICNZF001 EQU   ICNFLAG2                                                 01642000
ICNLOCK  EQU   ISTICNCB+232                                             01643000
ICNLICNA EQU   ISTICNCB+228                                             01644000
ICNZV003 EQU   ISTICNCB+116                                             01645000
ICNLAST  EQU   ISTICNCB+112                                             01646000
ICNLSTBT EQU   ISTICNCB+108                                             01647000
ICNSIOQ  EQU   ISTICNCB+104                                             01648000
ICNFLAG1 EQU   ISTICNCB+103                                             01649000
ICNZSW08 EQU   ICNZSWS                                                  01650000
ICNZSW07 EQU   ICNZSWS                                                  01651000
ICNZSW06 EQU   ICNZSWS                                                  01652000
ICNZSW05 EQU   ICNZSWS                                                  01653000
ICNZSW04 EQU   ICNZSWS                                                  01654000
ICNZSW03 EQU   ICNZSWS                                                  01655000
ICNZSW02 EQU   ICNZSWS                                                  01656000
ICNZSW01 EQU   ICNZSWS                                                  01657000
@NM00050 EQU   ICNFFLAG                                                 01658000
ICNZFF04 EQU   ICNFFLAG                                                 01659000
ICNZFF03 EQU   ICNFFLAG                                                 01660000
ICNZFF02 EQU   ICNFFLAG                                                 01661000
ICNZFF01 EQU   ICNFFLAG                                                 01662000
ICNZFF00 EQU   ICNFFLAG                                                 01663000
@NM00049 EQU   ICNFLAG                                                  01664000
ICNZCRIT EQU   ICNFLAG                                                  01665000
ICNSTART EQU   ICNFLAG                                                  01666000
ICNSLOW  EQU   ICNFLAG                                                  01667000
ICNZF010 EQU   ICNFLAG                                                  01668000
ICNZF00F EQU   ICNFLAG                                                  01669000
ICNZF00E EQU   ICNFLAG                                                  01670000
ICNCONF  EQU   ICNZF006                                                 01671000
ICNCKPAB EQU   ICNCKFLD+1                                               01672000
ICNRSV07 EQU   ICNCKFLD                                                 01673000
ICNCKBIT EQU   ICNCKFLD                                                 01674000
ICNZPAB1 EQU   ISTICNCB+64                                              01675000
ICNRSV01 EQU   ISTICNCB+60                                              01676000
@NM00048 EQU   ISTICNCB+56                                              01677000
@NM00047 EQU   ISTICNCB+54                                              01678000
@NM00046 EQU   @NM00045                                                 01679000
ICNRRY   EQU   @NM00045                                                 01680000
ICNLCLUS EQU   @NM00045                                                 01681000
ICNROLN  EQU   @NM00045                                                 01682000
ICNRNRY  EQU   @NM00045                                                 01683000
ICNLNKMD EQU   ISTICNCB+52                                              01684000
ICNCUUA  EQU   ISTICNCB+48                                              01685000
ICNCB    EQU   ISTICNCB                                                 01686000
PSTDRDYQ EQU   PSTDMPS+1                                                01687000
@NM00044 EQU   PSTDMPS                                                  01688000
PSTDGATE EQU   PSTDMPS                                                  01689000
PSTDEBP  EQU   ISTPST+128                                               01690000
PSTSAVE  EQU   ISTPST+96                                                01691000
PSTSMDYP EQU   ISTPST+64                                                01692000
PSTCRRS  EQU   ISTPST+60                                                01693000
PSTCRR1  EQU   ISTPST+56                                                01694000
PSTIQE22 EQU   ISTPST+52                                                01695000
PSTIQE21 EQU   ISTPST+48                                                01696000
PSTIQE12 EQU   ISTPST+44                                                01697000
PSTIQE11 EQU   ISTPST+40                                                01698000
PSTUEQ   EQU   ISTPST+36                                                01699000
PSTNSSQ  EQU   ISTPST+32                                                01700000
PSTPSSQ  EQU   ISTPST+28                                                01701000
PSTACBCT EQU   ISTPST+24                                                01702000
PSTTCBA  EQU   ISTPST+16                                                01703000
PSTRSV08 EQU   PSTFLGA+1                                                01704000
PSTDMPC  EQU   PSTFLGA+1                                                01705000
PSTABEND EQU   PSTABINP                                                 01706000
PSTAUTH  EQU   PSTFLGA                                                  01707000
PSTSMCU  EQU   PSTFLGA                                                  01708000
PSTSMQR  EQU   PSTFLGA                                                  01709000
PSTIRBU2 EQU   PSTFLGA                                                  01710000
PSTIRBU1 EQU   PSTFLGA                                                  01711000
PSTUERN  EQU   PSTFLGA                                                  01712000
PSTSSRN  EQU   PSTFLGA                                                  01713000
PSTRQUEA EQU   PSTRQUE+1                                                01714000
PSTRSV07 EQU   PSTRQUE                                                  01715000
PSTRSV06 EQU   PSTRQUE                                                  01716000
PSTRSV05 EQU   PSTRQUE                                                  01717000
PSTRSV04 EQU   PSTRQUE                                                  01718000
PSTRSV03 EQU   PSTRQUE                                                  01719000
PSTRSV02 EQU   PSTRQUE                                                  01720000
PSTRSV01 EQU   PSTRQUE                                                  01721000
PSTRQFLG EQU   PSTRQUE                                                  01722000
PSTCHAIN EQU   ISTPST+4                                                 01723000
@NM00043 EQU   ISTPST+2                                                 01724000
PSTLNGTH EQU   ISTPST+1                                                 01725000
PSTTYPE  EQU   ISTPST                                                   01726000
NCBRSV01 EQU   ISTNCB+46                                                01727000
NCBSWDAF EQU   ISTNCB+44                                                01728000
NCBDEVCH EQU   ISTNCB+36                                                01729000
NCBFMCBP EQU   ISTNCB+32                                                01730000
NCBLTRC  EQU   ISTNCB+30                                                01731000
NCBRVPT1 EQU   ISTNCB+28                                                01732000
NCBNMLLN EQU   NCBFLAGS+3                                               01733000
@NM00042 EQU   NCBFLAG1                                                 01734000
NCBFORCE EQU   NCBFLAG1                                                 01735000
NCBTTF   EQU   NCBFLAG1                                                 01736000
NCBRSYNC EQU   NCBFLAG1                                                 01737000
NCBRSTRT EQU   NCBFLAG1                                                 01738000
NCBCONF  EQU   NCBFLAG1                                                 01739000
NCBSNAI  EQU   NCBFLAG1                                                 01740000
NCBFLTIO EQU   NCBFTRIO                                                 01741000
NCBCSTAT EQU   NCBFLAGS                                                 01742000
NCBNCSL  EQU   ISTNCB+22                                                01743000
NCBFMCBA EQU   ISTNCB+16                                                01744000
NCBNSNA  EQU   ISTNCB+12                                                01745000
NCBRDTE  EQU   ISTNCB+4                                                 01746000
NCBDAF   EQU   ISTNCB+2                                                 01747000
NCBLNGTH EQU   ISTNCB+1                                                 01748000
NCBTYPE  EQU   ISTNCB                                                   01749000
ZOBLNG1  EQU   ZOBFSM                                                   01750000
LHVDATA  EQU   ISTLH+4                                                  01751000
LHFUNCT  EQU   ISTLH+3                                                  01752000
@NM00036 EQU   ISTLH+2                                                  01753000
FSBFDB   EQU   ISTFSB+32                                                01754000
FSBRSV01 EQU   FSBFSB+30                                                01755000
FSBTHCNT EQU   FSBFSB+28                                                01756000
FSBRLRSV EQU   FSBRLSTS                                                 01757000
FSBCFTX  EQU   FSBRLSTS                                                 01758000
FSBICNCB EQU   FSBMSGID                                                 01759000
FSBSSOC  EQU   FSBSS2                                                   01760000
FSBSSCC  EQU   FSBSS2                                                   01761000
FSBSSDC  EQU   FSBSS2                                                   01762000
FSBSSEC  EQU   FSBSS2                                                   01763000
FSBSSIR  EQU   FSBSS2                                                   01764000
FSBSSCR  EQU   FSBSS2                                                   01765000
@NM00034 EQU   FSBSS2                                                   01766000
@NM00033 EQU   FSBSS1                                                   01767000
FSBSSDE  EQU   FSBSS1                                                   01768000
FSBSSUS  EQU   FSBSS1                                                   01769000
@NM00032 EQU   FSBSS1                                                   01770000
FSBSOHI  EQU   FSBERC                                                   01771000
FSBLGI   EQU   FSBERC                                                   01772000
FSBLMRI  EQU   FSBFBMI                                                  01773000
FSBETI   EQU   FSBERC                                                   01774000
FSBEMI   EQU   FSBERC                                                   01775000
FSBEBI   EQU   FSBERC                                                   01776000
FSBECI   EQU   FSBERC                                                   01777000
FSBELI   EQU   FSBERC                                                   01778000
FSBMJRCD EQU   FSBSRCAT                                                 01779000
FSBXLCI  EQU   FSBXCODE                                                 01780000
FSBXFINS EQU   FSBXCODE                                                 01781000
FSBXNORM EQU   FSBXFSTS                                                 01782000
FSBSCODE EQU   FSBSYSRS                                                 01783000
FSBSPHSE EQU   FSBSYSRS                                                 01784000
FSBSERR  EQU   FSBSYSRS                                                 01785000
FSBCMD   EQU   FSBSEQ                                                   01786000
FSBDTRCE EQU   FSBFLAGS                                                 01787000
FSBASBTU EQU   FSBFLAGS                                                 01788000
FSBINPET EQU   FSBFLAGS                                                 01789000
FSBNONCB EQU   FSBFLAGS                                                 01790000
FSBLBIND EQU   FSBFLAGS                                                 01791000
FSBFFIND EQU   FSBFLAGS                                                 01792000
FSBACIND EQU   FSBFLAGS                                                 01793000
FSBRFIND EQU   FSBFLAGS                                                 01794000
FSBDAF   EQU   FSBCID+2                                                 01795000
FSBSAF   EQU   FSBCID                                                   01796000
FSBGATE  EQU   FSBFSBA                                                  01797000
FSBRSV02 EQU   FSBSFLGS                                                 01798000
FSBPGBUF EQU   FSBSFLGS                                                 01799000
FSBMNSDA EQU   FSBMNRCD                                                 01800000
FSBMNOA  EQU   FSBMNRCD                                                 01801000
FSBMNDIF EQU   FSBMNRCD                                                 01802000
FSBMNEOP EQU   FSBMNRCD                                                 01803000
FSBMNDNU EQU   FSBMNRCD                                                 01804000
FSBMNATN EQU   FSBMNRCD                                                 01805000
FSBMNRVI EQU   FSBMNRCD                                                 01806000
FSBMNELI EQU   FSBMNRCD                                                 01807000
FSBLNGTH EQU   FSBFSB+1                                                 01808000
FSBTYPE  EQU   FSBFSB                                                   01809000
FDBOFSET EQU   ISTFDB+10                                                01810000
FDBDATCT EQU   ISTFDB+8                                                 01811000
FDBDATAA EQU   ISTFDB+4                                                 01812000
FDBFDBA  EQU   ISTFDB                                                   01813000
NSRUNA6  EQU   NSRUNA5                                                  01814000
RUBDATA  EQU   ISTRUB                                                   01815000
RHRSVD5  EQU   RH3                                                      01816000
RHRSVD4  EQU   RH3                                                      01817000
RHLOG    EQU   RH3                                                      01818000
RHRSVD3  EQU   RH3                                                      01819000
RHRCDIR  EQU   RH3                                                      01820000
RHCDIR   EQU   RH3                                                      01821000
RHEB     EQU   RH3                                                      01822000
RHBB     EQU   RH3                                                      01823000
RHPACE   EQU   RH2                                                      01824000
RHRSVD2  EQU   RH2                                                      01825000
RHINOP   EQU   RHRSVD1                                                  01826000
RHBUSY   EQU   RHRETRY                                                  01827000
RHEXCEPT EQU   RH2                                                      01828000
RHRRN    EQU   RH2                                                      01829000
RHPE     EQU   RH2                                                      01830000
RHFME    EQU   RH2                                                      01831000
RHCHAIN  EQU   RH1                                                      01832000
RHFORMAT EQU   RH1                                                      01833000
RHDIRI   EQU   RH1                                                      01834000
RHQS     EQU   RH1                                                      01835000
TH2SNF   EQU   ISTTH2+4                                                 01836000
TH2CDF   EQU   TH2FLAG1+1                                               01837000
TH2SEF   EQU   TH2FLAG1+1                                               01838000
TH2PYF   EQU   TH2FLAG1+1                                               01839000
TH2AFI   EQU   TH2FLAG1                                                 01840000
TH2PSI   EQU   TH2FLAG1                                                 01841000
TH2CMPLI EQU   TH2MPF                                                   01842000
TH2FID   EQU   TH2FLAG1                                                 01843000
THDCF    EQU   ISTTH+8                                                  01844000
THSNF    EQU   ISTTH+6                                                  01845000
THOAF    EQU   ISTTH+4                                                  01846000
THDAF    EQU   ISTTH+2                                                  01847000
THCDF    EQU   THFLGB                                                   01848000
THSEF    EQU   THFLGB                                                   01849000
THPYF    EQU   THFLGB                                                   01850000
THAFI    EQU   THFLGA                                                   01851000
THPSI    EQU   THFLGA                                                   01852000
THCMPLI  EQU   THMPF                                                    01853000
THRHI    EQU   THMPF                                                    01854000
THFID    EQU   THFLAG1                                                  01855000
DEVRSV03 EQU   ISTDEVCH+5                                               01856000
DEVPHYSA EQU   ISTDEVCH+4                                               01857000
DEVCSLPN EQU   DEVCHAR3                                                 01858000
DEVCSTCL EQU   DEVCHAR3                                                 01859000
DEVCCHEK EQU   DEVCHAR3                                                 01860000
DEVCATTN EQU   DEVCHAR3                                                 01861000
DEVCSWL  EQU   DEVFCCTL                                                 01862000
DEVCRVB  EQU   DEVFCCTL                                                 01863000
DEVCSSL  EQU   DEVFCCTL                                                 01864000
DEVCBSC  EQU   DEVFCCTL                                                 01865000
DEVMCODE EQU   ISTDEVCH+2                                               01866000
DEVCHAR2 EQU   DEVTCODE                                                 01867000
DEVRSV01 EQU   DEVCHAR                                                  01868000
DEVCCTL  EQU   DEVCHAR                                                  01869000
DEVNNSPT EQU   DEVCHAR                                                  01870000
DEVSPS   EQU   DEVCHAR                                                  01871000
DEVSUBND EQU   DEVCHAR                                                  01872000
DEVCONVR EQU   DEVCHAR                                                  01873000
DEVOTPUT EQU   DEVCHAR                                                  01874000
DEVINPUT EQU   DEVCHAR                                                  01875000
BTUTEXT  EQU   ISTBTU+20                                                01876000
BTUEXTR  EQU   ISTBTU+19                                                01877000
BTURSV02 EQU   BTUSYSTR                                                 01878000
BTUPHASE EQU   BTUSYSTR                                                 01879000
BTURSV01 EQU   BTUSYSTR                                                 01880000
BTUBDU   EQU   ISTBTU+14                                                01881000
BTUPAD   EQU   BTURH+3                                                  01882000
BTURH3   EQU   BTURH+2                                                  01883000
BTURH2   EQU   BTURH+1                                                  01884000
BTURH1   EQU   BTURH                                                    01885000
BTUDCF   EQU   BTUBTH+8                                                 01886000
BTUZRTSC EQU   BTURQFLG+1                                               01887000
BTUZRT0B EQU   BTURQFLG+1                                               01888000
BTUZRT0A EQU   BTURQFLG+1                                               01889000
BTUZRT09 EQU   BTURQFLG+1                                               01890000
BTUZRT08 EQU   BTURQFLG+1                                               01891000
BTUZRT07 EQU   BTURQFLG                                                 01892000
BTUZRT06 EQU   BTURQFLG                                                 01893000
BTUZRT05 EQU   BTURQFLG                                                 01894000
BTUZRT04 EQU   BTURQFLG                                                 01895000
BTUZRT03 EQU   BTURQFLG                                                 01896000
BTUZRT02 EQU   BTURQFLG                                                 01897000
BTUZRT01 EQU   BTURQFLG                                                 01898000
BTUZRT00 EQU   BTURQFLG                                                 01899000
BTUSORCE EQU   BTUBTH+4                                                 01900000
BTUDEST  EQU   BTUBTH+2                                                 01901000
BTUCDF   EQU   BTUFID+1                                                 01902000
BTUSCF   EQU   BTUFID+1                                                 01903000
BTUPRY   EQU   BTUFID+1                                                 01904000
BTUASFL  EQU   BTUFID                                                   01905000
BTUPSFL  EQU   BTUFID                                                   01906000
BTUMPF   EQU   BTUFID                                                   01907000
BTUFIDNO EQU   BTUFID                                                   01908000
BDURSV04 EQU   BDUFLAGS                                                 01909000
BDURTOE  EQU   BDUFLAGS                                                 01910000
BDUSTPR  EQU   BDUFLAGS                                                 01911000
BDURSV03 EQU   BDUFLAGS                                                 01912000
BDUALT   EQU   BDUFUNC                                                  01913000
BDUNACK  EQU   BDUFUNC                                                  01914000
BDUACK   EQU   BDUFUNC                                                  01915000
BDUTRPM  EQU   BDUFUNC                                                  01916000
BDUFBMI  EQU   BDUFUNC                                                  01917000
BDULDGPH EQU   BDUFUNC                                                  01918000
BDUHEADP EQU   BDUFUNC                                                  01919000
BDUSOH   EQU   BDUCHECK                                                 01920000
BDURSV01 EQU   BDUMODIF                                                 01921000
BDUMOD0  EQU   BDUMOD1                                                  01922000
BDUCOMND EQU   ISTBDU                                                   01923000
ATCAOS   EQU   ISTATCVT+1584                                            01924000
ATCPOPAB EQU   ATCAOSM+640                                              01925000
ATCVIOPM EQU   ATCAOSM+636                                              01926000
ATCTPMMI EQU   ATCAOSM+632                                              01927000
ATCTPMPB EQU   ATCAOSM+600                                              01928000
ATCRSV88 EQU   ATCAOSM+596                                              01929000
ATCRPLCT EQU   ATCAOSM+594                                              01930000
ATCCRACT EQU   ATCAOSM+592                                              01931000
ATCSRBCT EQU   ATCAOSM+590                                              01932000
ATCRSV75 EQU   ATCAOSM+589                                              01933000
ATCRSV66 EQU   ATCZFLAG                                                 01934000
ATCZF001 EQU   ATCZFLAG                                                 01935000
ATCTPCP1 EQU   ATCAOSM+584                                              01936000
ATCTPCP0 EQU   ATCAOSM+580                                              01937000
ATCAICTN EQU   ATCAOSM+576                                              01938000
ATCZR01  EQU   ATCAOSM+572                                              01939000
ATCMPLTA EQU   ATCAOSM+568                                              01940000
ATCASCB  EQU   ATCAOSM+564                                              01941000
ATCAP86  EQU   ATCAOSM+560                                              01942000
ATCAP85  EQU   ATCAOSM+556                                              01943000
ATCAP84  EQU   ATCAOSM+552                                              01944000
ATCAP83  EQU   ATCAOSM+548                                              01945000
ATCAP82  EQU   ATCAOSM+544                                              01946000
ATCAP69  EQU   ATCAOSM+540                                              01947000
ATCAP66  EQU   ATCAOSM+536                                              01948000
ATCAP62  EQU   ATCAOSM+532                                              01949000
ATCAPC59 EQU   ATCAOSM+528                                              01950000
ATCAP56  EQU   ATCAOSM+524                                              01951000
ATCAP55  EQU   ATCAOSM+520                                              01952000
ATCRCFY0 EQU   ATCAOSM+516                                              01953000
ATCAP41  EQU   ATCAOSM+512                                              01954000
ATCAPC25 EQU   ATCAOSM+508                                              01955000
ATCAP23  EQU   ATCAOSM+504                                              01956000
ATCTPSPB EQU   ATCAOSM+472                                              01957000
ATCTRMPB EQU   ATCAOSM+440                                              01958000
ATCAPBE  EQU   ATCAOSM+436                                              01959000
ATCPSTA  EQU   ATCAOSM+432                                              01960000
ATCSMABF EQU   ATCAOSM+428                                              01961000
ATCSMAPR EQU   ATCAOSM+424                                              01962000
ATCTPWQA EQU   ATCAOSM+420                                              01963000
ATCSMAID EQU   ATCAOSM+416                                              01964000
ATCSMARA EQU   ATCAOSM+412                                              01965000
ATCCACXA EQU   ATCAOSM+408                                              01966000
ATCZLAAB EQU   ATCAOSM+404                                              01967000
ATCATA10 EQU   ATCAOSM+400                                              01968000
ATCHLTCB EQU   ATCAOSM+396                                              01969000
@NM00027 EQU   ATCVTFLG                                                 01970000
ATCVTACT EQU   ATCVTFLG                                                 01971000
ATCRPT40 EQU   ATCAOSM+388                                              01972000
ATCRPT39 EQU   ATCAOSM+384                                              01973000
ATCRPT38 EQU   ATCAOSM+380                                              01974000
ATCRPT37 EQU   ATCAOSM+376                                              01975000
ATCRPT36 EQU   ATCAOSM+372                                              01976000
ATCRPT35 EQU   ATCAOSM+368                                              01977000
ATCRPT34 EQU   ATCAOSM+364                                              01978000
ATCRPT33 EQU   ATCAOSM+360                                              01979000
ATCRPT32 EQU   ATCAOSM+356                                              01980000
ATCRPT31 EQU   ATCAOSM+352                                              01981000
ATCRPT30 EQU   ATCAOSM+348                                              01982000
ATCRPT29 EQU   ATCAOSM+344                                              01983000
ATCRPT28 EQU   ATCAOSM+340                                              01984000
ATCRPT27 EQU   ATCAOSM+336                                              01985000
ATCRPT26 EQU   ATCAOSM+332                                              01986000
ATCRPT25 EQU   ATCAOSM+328                                              01987000
ATCRPT24 EQU   ATCAOSM+324                                              01988000
ATCRPT23 EQU   ATCAOSM+320                                              01989000
ATCRPT22 EQU   ATCAOSM+316                                              01990000
ATCRPT21 EQU   ATCAOSM+312                                              01991000
ATCRPT20 EQU   ATCAOSM+308                                              01992000
ATCRPT19 EQU   ATCAOSM+304                                              01993000
ATCRPT18 EQU   ATCAOSM+300                                              01994000
ATCRPT17 EQU   ATCAOSM+296                                              01995000
ATCRPT16 EQU   ATCAOSM+292                                              01996000
ATCRPT15 EQU   ATCAOSM+288                                              01997000
ATCRPT14 EQU   ATCAOSM+284                                              01998000
ATCRPT13 EQU   ATCAOSM+280                                              01999000
ATCRPT12 EQU   ATCAOSM+276                                              02000000
ATCRPT11 EQU   ATCAOSM+272                                              02001000
ATCAP37  EQU   ATCAOSM+264                                              02002000
ATCZDFJ0 EQU   ATCAOSM+260                                              02003000
ATCAP51  EQU   ATCAOSM+256                                              02004000
ATCZPAB2 EQU   ATCAOSM+224                                              02005000
ATCZPAB1 EQU   ATCAOSM+192                                              02006000
ATCZLFVT EQU   ATCAOSM+188                                              02007000
ATCZLPVT EQU   ATCAOSM+184                                              02008000
ATCZDVTX EQU   ATCAOSM+180                                              02009000
ATCZDVTA EQU   ATCAOSM+176                                              02010000
ATCZDVT9 EQU   ATCAOSM+172                                              02011000
ATCZDVT8 EQU   ATCAOSM+168                                              02012000
ATCZDVT7 EQU   ATCAOSM+164                                              02013000
ATCRSV56 EQU   ATCDAPVT+22                                              02014000
ATCDAPDG EQU   ATCDAPVT+20                                              02015000
ATCDXCEA EQU   ATCDAPVT+16                                              02016000
ATCDCEA  EQU   ATCDAPVT+12                                              02017000
ATCDPCIA EQU   ATCDAPVT+8                                               02018000
ATCDSIOA EQU   ATCDAPVT+4                                               02019000
ATCDEOEA EQU   ATCDAPVT                                                 02020000
ATCZLAEA EQU   ATCLDAPP+16                                              02021000
ATCZLCEA EQU   ATCLDAPP+12                                              02022000
ATCRSV17 EQU   ATCLDAPP+8                                               02023000
ATCSMFRR EQU   ATCLDAPP+4                                               02024000
ATCZAEA  EQU   ATCICAPP+16                                              02025000
ATCZCEA  EQU   ATCICAPP+12                                              02026000
ATCCDTCB EQU   ATCICAPP+8                                               02027000
ATCZSIOA EQU   ATCICAPP+4                                               02028000
ATCCDRPH EQU   ATCICAPP                                                 02029000
ATCAP65  EQU   ATCAOSM+96                                               02030000
ATCZDVT6 EQU   ATCAOSM+92                                               02031000
ATCZDVT4 EQU   ATCAOSM+88                                               02032000
ATCZDVT3 EQU   ATCAOSM+84                                               02033000
ATCZDVT1 EQU   ATCAOSM+80                                               02034000
ATCICNCB EQU   ATCAOSM+76                                               02035000
ATCZPSVT EQU   ATCAOSM+72                                               02036000
ATCZFSVT EQU   ATCAOSM+68                                               02037000
ATCAP64  EQU   ATCAOSM+64                                               02038000
ATCAP63  EQU   ATCAOSM+60                                               02039000
ATCAP61  EQU   ATCAOSM+56                                               02040000
ATCAP58  EQU   ATCAOSM+52                                               02041000
ATCAP57  EQU   ATCAOSM+48                                               02042000
ATCAP54  EQU   ATCAOSM+44                                               02043000
ATCAP53  EQU   ATCAOSM+40                                               02044000
ATCAP52  EQU   ATCAOSM+36                                               02045000
ATCAP34  EQU   ATCAOSM+32                                               02046000
ATCAP32  EQU   ATCAOSM+28                                               02047000
ATCAP31  EQU   ATCAOSM+24                                               02048000
ATCAP12  EQU   ATCAOSM+20                                               02049000
ATCAP11  EQU   ATCAOSM+16                                               02050000
ATCCMTCB EQU   ATCAOSM+12                                               02051000
ATCPRPH  EQU   ATCAOSM+8                                                02052000
ATCGSRBF EQU   ATCGSRBG                                                 02053000
ATCSRBRT EQU   ATCAOSM                                                  02054000
ATCRSVBB EQU   ISTATCVT+908                                             02055000
ATCVDLOK EQU   ISTATCVT+904                                             02056000
ATCVFPAB EQU   ISTATCVT+872                                             02057000
ATCVDPAB EQU   ISTATCVT+840                                             02058000
ATCIOECB EQU   ISTATCVT+836                                             02059000
ATCINCW3 EQU   ISTATCVT+832                                             02060000
ATCMODTB EQU   ISTATCVT+828                                             02061000
ATCUSSPT EQU   ISTATCVT+824                                             02062000
ATCSRTAB EQU   ISTATCVT+820                                             02063000
@NM00026 EQU   ISTATCVT+819                                             02064000
ATCSTAT2 EQU   ISTATCVT+818                                             02065000
ATCNMCTR EQU   ISTATCVT+816                                             02066000
ATCSEC51 EQU   ATCSECST                                                 02067000
ATCSEC40 EQU   ATCSIPD+8                                                02068000
ATCSEC30 EQU   ATCSIPD+4                                                02069000
ATCSEC21 EQU   ATCSIPD                                                  02070000
ATCSEC10 EQU   ATCSOPD+4                                                02071000
ATCSEC01 EQU   ATCSOPD                                                  02072000
ATCPOIA  EQU   ATCRNO+1                                                 02073000
@NM00025 EQU   ATCRNO                                                   02074000
ATCPODVT EQU   ISTATCVT+784                                             02075000
ATCS49XL EQU   ISTATCVT+780                                             02076000
ATCS49XI EQU   ISTATCVT+776                                             02077000
ATCLCLCT EQU   ATCVLCNT+2                                               02078000
ATCRNCNT EQU   ATCVLCNT                                                 02079000
ATCCFEAD EQU   ISTATCVT+768                                             02080000
ATCPTR00 EQU   ISTATCVT+736                                             02081000
ATCRSV10 EQU   ISTATCVT+704                                             02082000
ATCTACB  EQU   ISTATCVT+700                                             02083000
ATCVTINM EQU   ISTATCVT+696                                             02084000
ATCTCLIM EQU   ISTATCVT+692                                             02085000
ATCTCLOM EQU   ISTATCVT+688                                             02086000
ATCVTIPB EQU   ISTATCVT+656                                             02087000
ATCTCIPB EQU   ISTATCVT+624                                             02088000
ATCTIPAB EQU   ISTATCVT+592                                             02089000
ATCOCCCB EQU   ISTATCVT+588                                             02090000
ATCOCCOB EQU   ISTATCVT+584                                             02091000
ATCCDLAD EQU   ISTATCVT+580                                             02092000
ATCCCLAD EQU   ISTATCVT+576                                             02093000
ATCDLRPB EQU   ISTATCVT+544                                             02094000
ATCPGPAB EQU   ISTATCVT+512                                             02095000
ATCVPAB1 EQU   ISTATCVT+480                                             02096000
ATCRSV97 EQU   ISTATCVT+476                                             02097000
ATCRDTLK EQU   ISTATCVT+472                                             02098000
ATCVOCLK EQU   ISTATCVT+468                                             02099000
ATCDVTLK EQU   ISTATCVT+456                                             02100000
ATCAP36  EQU   ISTATCVT+452                                             02101000
ATCAP35  EQU   ISTATCVT+448                                             02102000
ATCAP33  EQU   ISTATCVT+444                                             02103000
ATCRSV99 EQU   ISTATCVT+440                                             02104000
ATCONFIG EQU   ISTATCVT+432                                             02105000
ATCNODDS EQU   ISTATCVT+428                                             02106000
ATCNODEL EQU   ISTATCVT+420                                             02107000
ATCRSV69 EQU   ISTATCVT+416                                             02108000
ATCAPCR5 EQU   ISTATCVT+412                                             02109000
ATCLDECB EQU   ISTATCVT+408                                             02110000
ATCLDNCS EQU   ISTATCVT+404                                             02111000
ATCCDPTR EQU   ISTATCVT+400                                             02112000
ATCADEL  EQU   ISTATCVT+396                                             02113000
ATCTODVT EQU   ISTATCVT+392                                             02114000
ATCDEBCH EQU   ISTATCVT+388                                             02115000
ATCHBSIZ EQU   ATCHPGM+2                                                02116000
ATCHBFNO EQU   ATCHPGM                                                  02117000
ATCCRME  EQU   ISTATCVT+380                                             02118000
ATCRVCHS EQU   ISTATCVT+372                                             02119000
ATCECTLP EQU   ISTATCVT+368                                             02120000
ATCZDVTB EQU   ISTATCVT+364                                             02121000
ATCECPRT EQU   ISTATCVT+360                                             02122000
ATCVTLOD EQU   ISTATCVT+356                                             02123000
ATCTRPAB EQU   ISTATCVT+352                                             02124000
ATCMSGM  EQU   ISTATCVT+348                                             02125000
ATCMSGP  EQU   ISTATCVT+344                                             02126000
ATCEPT   EQU   ISTATCVT+340                                             02127000
ATCDVT   EQU   ISTATCVT+336                                             02128000
ATCTRCPT EQU   ISTATCVT+332                                             02129000
ATCDVLOD EQU   ISTATCVT+328                                             02130000
ATCALERT EQU   ISTATCVT+324                                             02131000
ATCEPA   EQU   ISTATCVT+320                                             02132000
ATCSAF   EQU   ISTATCVT+318                                             02133000
ATCXRANG EQU   ISTATCVT+317                                             02134000
ATCLAST  EQU   ATCSHRFG                                                 02135000
ATCSHRTN EQU   ISTATCVT+308                                             02136000
ATCUEP   EQU   ISTATCVT+304                                             02137000
ATCOCRT  EQU   ISTATCVT+300                                             02138000
ATCCSMA  EQU   ATCCSMR                                                  02139000
ATCESC02 EQU   ISTATCVT+292                                             02140000
ATCESC01 EQU   ISTATCVT+288                                             02141000
ATCMNT   EQU   ISTATCVT+272                                             02142000
ATCRSV16 EQU   ISTATCVT+270                                             02143000
ATCMAXID EQU   ISTATCVT+269                                             02144000
ATCMSGSP EQU   ATCCOM+268                                               02145000
ATCACTRM EQU   ATCCOM+264                                               02146000
ATCNERAP EQU   ATCCOM+260                                               02147000
ATCNESAL EQU   ATCCOM+256                                               02148000
ATCRCC65 EQU   ATCCOM+252                                               02149000
ATCRCC26 EQU   ATCCOM+248                                               02150000
ATCRCC63 EQU   ATCCOM+244                                               02151000
ATCRSV11 EQU   ATCCOM+242                                               02152000
ATCVTMID EQU   ATCCOM+240                                               02153000
ATCAPOST EQU   ATCCOM+236                                               02154000
ATCNERFN EQU   ATCCOM+232                                               02155000
ATCNERNE EQU   ATCCOM+228                                               02156000
ATCNERCV EQU   ATCCOM+224                                               02157000
ATCNERST EQU   ATCCOM+220                                               02158000
ATCDCC61 EQU   ATCCOM+216                                               02159000
ATCDCC60 EQU   ATCCOM+212                                               02160000
ATCSRTDF EQU   ATCCOM+208                                               02161000
ATCSRTAD EQU   ATCCOM+204                                               02162000
ATCFIRA  EQU   ATCCOM+200                                               02163000
ATCSMBQ  EQU   ATCCOM+196                                               02164000
ATCSMRC  EQU   ATCCOM+192                                               02165000
ATCSMQU  EQU   ATCCOM+184                                               02166000
ATCSMRQ  EQU   ATCCOM+180                                               02167000
ATCACDA  EQU   ATCCOM+176                                               02168000
ATCSTMA  EQU   ATCCOM+172                                               02169000
ATCFRSTR EQU   ATCCOM+168                                               02170000
ATCGTSTR EQU   ATCCOM+164                                               02171000
ATCREADA EQU   ATCCOM+160                                               02172000
ATCALOAD EQU   ATCCOM+156                                               02173000
ATCBLDLA EQU   ATCCOM+152                                               02174000
ATCFBRPH EQU   ATCCOM+148                                               02175000
ATCBFTRC EQU   ATCCOM+144                                               02176000
ATCTPBUF EQU   ATCTHTRC                                                 02177000
ATCREMOV EQU   ATCCOM+136                                               02178000
ATCADD   EQU   ATCCOM+132                                               02179000
ATCDVTPT EQU   ATCCOM+124                                               02180000
ATCFEPT  EQU   ATCCOM+120                                               02181000
ATCFDVT  EQU   ATCCOM+116                                               02182000
ATCCONFT EQU   ATCCOM+112                                               02183000
ATCPTCHA EQU   ATCCOM+108                                               02184000
ATCAUTHA EQU   ATCCOM+104                                               02185000
ATCACCTA EQU   ATCCOM+100                                               02186000
ATCRDTH  EQU   ATCCOM+96                                                02187000
ATCFRSCH EQU   ATCCOM+92                                                02188000
ATCFSB   EQU   ATCCOM+88                                                02189000
ATCHLTMS EQU   ATCCOM+84                                                02190000
ATCECPRM EQU   ATCCOM+80                                                02191000
ATCECNET EQU   ATCCOM+76                                                02192000
ATCECOPC EQU   ATCCOM+72                                                02193000
ATCVPARM EQU   ATCCOM+68                                                02194000
ATCECVRQ EQU   ATCCOM+64                                                02195000
ATCECSES EQU   ATCCOM+60                                                02196000
ATCOCHA  EQU   ATCCOM+56                                                02197000
ATCDSPLQ EQU   ATCCOM+52                                                02198000
ATCECDSP EQU   ATCCOM+48                                                02199000
ATCVARYQ EQU   ATCCOM+44                                                02200000
ATCECVRY EQU   ATCCOM+40                                                02201000
ATCHALTQ EQU   ATCCOM+36                                                02202000
ATCECHLT EQU   ATCCOM+32                                                02203000
ATCMODQ  EQU   ATCCOM+28                                                02204000
ATCECMOD EQU   ATCCOM+24                                                02205000
ATCASCHD EQU   ATCCOM+20                                                02206000
ATCSRT   EQU   ATCCOM+16                                                02207000
ATCRDT   EQU   ATCCOM+12                                                02208000
ATCDCFRR EQU   ATCCOM+8                                                 02209000
ATCAPI   EQU   ATCCOM+4                                                 02210000
ATCRSV04 EQU   ATCSTAT4                                                 02211000
ATCNCSD  EQU   ATCSTAT4                                                 02212000
ATCMTST  EQU   ATCSTAT4                                                 02213000
ATCTPRT  EQU   ATCSTAT4                                                 02214000
ATCPRTAT EQU   ATCSTAT4                                                 02215000
@NM00024 EQU   ATCPOFLG                                                 02216000
ATCPOUNS EQU   ATCPOFLG                                                 02217000
ATCHSDMF EQU   ATCSTFLG                                                 02218000
@NM00023 EQU   ATCSTAT1                                                 02219000
ATCMDHLT EQU   ATCSTAT1                                                 02220000
ATCINHLT EQU   ATCSTAT1                                                 02221000
ATCNETSL EQU   ATCSTAT1                                                 02222000
ATCQKHLT EQU   ATCSTAT1                                                 02223000
ATCSNHLT EQU   ATCSTAT1                                                 02224000
ATCACTIV EQU   ATCSTAT1                                                 02225000
ATCSTART EQU   ATCSTAT1                                                 02226000
RPHNEXPO EQU   ISTRPH+104                                               02227000
RPHSAV16 EQU   RPHWORK+60                                               02228000
RPHSAV15 EQU   RPHWORK+56                                               02229000
RPHSAV14 EQU   RPHWORK+52                                               02230000
RPHSAV13 EQU   RPHWORK+48                                               02231000
RPHSAV12 EQU   RPHWORK+44                                               02232000
RPHSAV11 EQU   RPHWORK+40                                               02233000
RPHSAV10 EQU   RPHWORK+36                                               02234000
RPHSAVE9 EQU   RPHWORK+32                                               02235000
RPHSAVE8 EQU   RPHWORK+28                                               02236000
RPHSAVE7 EQU   RPHWORK+24                                               02237000
RPHSAVE6 EQU   RPHWORK+20                                               02238000
RPHSAVE5 EQU   RPHWORK+16                                               02239000
RPHSAVE4 EQU   RPHWORK+12                                               02240000
RPHSAVE3 EQU   RPHWORK+8                                                02241000
RPHSAVE2 EQU   RPHWORK+4                                                02242000
RPHSHALF EQU   RPHSAVE1+2                                               02243000
RPHSBIT8 EQU   RPHSBITS                                                 02244000
RPHSBIT7 EQU   RPHSBITS                                                 02245000
RPHSBIT6 EQU   RPHSBITS                                                 02246000
RPHSBIT5 EQU   RPHSBITS                                                 02247000
RPHSBIT4 EQU   RPHSBITS                                                 02248000
RPHSBIT3 EQU   RPHSBITS                                                 02249000
RPHSBIT2 EQU   RPHSBITS                                                 02250000
RPHSBIT1 EQU   RPHSBITS                                                 02251000
RPHSBYTE EQU   RPHSAVE1                                                 02252000
RPHPABQP EQU   RPHPABQA+1                                               02253000
RPHPABFG EQU   RPHPABQA                                                 02254000
RPHCRR   EQU   ISTRPH+32                                                02255000
RPHSRP34 EQU   RPHSRPRM+2                                               02256000
RPHSRP12 EQU   RPHSRPRM                                                 02257000
RPHWEGT  EQU   RPHCSPA                                                  02258000
RPHMAJCB EQU   ISTRPH+21                                                02259000
RPHPABOF EQU   ISTRPH+20                                                02260000
RPHRESUM EQU   RPHRESMA+1                                               02261000
RPHRSV01 EQU   RPHWPFLG                                                 02262000
RPHPURGE EQU   RPHWPFLG                                                 02263000
RPHPT    EQU   RPHWPFLG                                                 02264000
RPHWT    EQU   RPHWPFLG                                                 02265000
RPHRSKEY EQU   RPHWPFLG                                                 02266000
RPHDVTA  EQU   ISTRPH+12                                                02267000
RPHTIK   EQU   RPHTSKID+3                                               02268000
@NM00022 EQU   RPHTSKID                                                 02269000
RPHRPHAP EQU   RPHRPHA+1                                                02270000
@NM00021 EQU   RPHRPHA                                                  02271000
RPHGATE  EQU   RPHRPHA                                                  02272000
@NM00020 EQU   RPHFLGB                                                  02273000
RPHRLCRA EQU   RPHFLGB                                                  02274000
RPHNRSAV EQU   RPHFLGB                                                  02275000
RPHPGCMP EQU   RPHFLGB                                                  02276000
RPHFBAPS EQU   RPHFLGB                                                  02277000
RPHBSSP  EQU   RPHFLGB                                                  02278000
RPHLOCK  EQU   RPHFLGB                                                  02279000
RPHFNFLG EQU   RPHFSTLC                                                 02280000
RPHMLTCP EQU   RPHFLAGS                                                 02281000
RPHSMCLR EQU   RPHFLAGS                                                 02282000
RPHSMTYP EQU   RPHFLAGS                                                 02283000
RPHSMQ   EQU   RPHFLAGS                                                 02284000
RPHAUTEX EQU   RPHAPTYP                                                 02285000
RPHSPGIN EQU   RPHFLAGS                                                 02286000
RPHOGIND EQU   RPHFLAGS                                                 02287000
RPHLNGTH EQU   RPHCNTL+1                                                02288000
RPHTYPE  EQU   RPHCNTL                                                  02289000
LOKXCL   EQU   @NM00018                                                 02290000
LOKPRY   EQU   @NM00018                                                 02291000
@NM00019 EQU   @NM00018                                                 02292000
@NM00017 EQU   LOKCHNG                                                  02293000
LOKCT    EQU   ISTLOK                                                   02294000
DYPPAB   EQU   ISTDYPAB+16                                              02295000
DYPRSV01 EQU   ISTDYPAB+12                                              02296000
DYPTSKID EQU   ISTDYPAB+8                                               02297000
DYPCHAIN EQU   ISTDYPAB+4                                               02298000
DYPFLGS  EQU   ISTDYPAB+2                                               02299000
DYPLNGTH EQU   ISTDYPAB+1                                               02300000
DYPTYPE  EQU   ISTDYPAB                                                 02301000
PABRPHA  EQU   PABRPHFG+1                                               02302000
PABNODQ  EQU   PABFLAGS                                                 02303000
PABINHBT EQU   PABFLAGS                                                 02304000
PABERLOK EQU   PABERRLK                                                 02305000
PABSSN   EQU   PABFLAGS                                                 02306000
PABDYNAM EQU   PABFLAGS                                                 02307000
PABNORPR EQU   PABFLAGS                                                 02308000
PABPRIOR EQU   PABFLAGS                                                 02309000
PABAPYP  EQU   PABFLAGS                                                 02310000
PABDVTA  EQU   ISTPAB+9                                                 02311000
PABOFFST EQU   ISTPAB+8                                                 02312000
PABCHNGP EQU   PABCHAIN+1                                               02313000
PABRSV02 EQU   PABCHAIN                                                 02314000
PABRUNNG EQU   PABCHAIN                                                 02315000
PABRESET EQU   PABCHAIN                                                 02316000
PABUNCON EQU   PABCHAIN                                                 02317000
PABCDP   EQU   PABCHAIN                                                 02318000
PABRESCH EQU   PABCHAIN                                                 02319000
PABCHNG  EQU   PABCHAIN                                                 02320000
PABWEQP  EQU   PABWEQA+1                                                02321000
PABRSV01 EQU   PABWEQA                                                  02322000
PABWEQG  EQU   PABWEQA                                                  02323000
ISTPDAVP EQU   ISTAVT+40                                                02324000
ISTAVR01 EQU   ISTAVT+38                                                02325000
ISTVTTP  EQU   ISTAVT+36                                                02326000
ISTAGTWT EQU   ISTAVT+34                                                02327000
ISTATRT  EQU   ISTAVT+32                                                02328000
ISTARID  EQU   ISTAVT+30                                                02329000
ISTX1    EQU   ISTAVT+29                                                02330000
ISTPHNM  EQU   ISTAVT+24                                                02331000
ISTAPSEX EQU   ISTAVT+20                                                02332000
ISTVTTIK EQU   ISTAVT+18                                                02333000
AVTASID  EQU   ISTAVT+16                                                02334000
ISTAPSTA EQU   ISTAVT+12                                                02335000
ISTAS53  EQU   ISTAVT+8                                                 02336000
ISTAHIP  EQU   ISTAS49                                                  02337000
ISTACVT  EQU   ISTAVT                                                   02338000
ZCRRU    EQU   ZCRRHRU+3                                                02339000
ZCRRH    EQU   ZCRRHRU                                                  02340000
ZCRWORDA EQU   ISTZCRR+477                                              02341000
ZCRCMNRC EQU   ISTZCRR+476                                              02342000
ZCRRSV97 EQU   ZCRENTER+18                                              02343000
ZCREIC2B EQU   ZCRENTER+18                                              02344000
ZCREAC2B EQU   ZCRENTER+18                                              02345000
ZCRELCAB EQU   ZCRENTER+18                                              02346000
ZCREDCMF EQU   ZCRENTER+18                                              02347000
ZCREBCIF EQU   ZCRENTER+18                                              02348000
ZCREICSG EQU   ZCRENTER+18                                              02349000
ZCREDCK0 EQU   ZCRENTER+18                                              02350000
ZCRECFY0 EQU   ZCRENTER+17                                              02351000
ZCREKCCB EQU   ZCRENTER+17                                              02352000
ZCREDCNB EQU   ZCRENTER+17                                              02353000
ZCREICOE EQU   ZCRENTER+17                                              02354000
ZCREBCNB EQU   ZCRENTER+17                                              02355000
ZCREBC0L EQU   ZCRENTER+17                                              02356000
ZCREBCAL EQU   ZCRENTER+17                                              02357000
ZCREDCQR EQU   ZCRENTER+17                                              02358000
ZCREDCPR EQU   ZCRENTER+16                                              02359000
ZCREBCSB EQU   ZCRENTER+16                                              02360000
ZCREAC1R EQU   ZCRENTER+16                                              02361000
ZCRECCCI EQU   ZCRENTER+16                                              02362000
ZCRECCAI EQU   ZCRENTER+16                                              02363000
ZCRECCBI EQU   ZCRENTER+16                                              02364000
ZCREBCAR EQU   ZCRENTER+16                                              02365000
ZCREBCDR EQU   ZCRENTER+16                                              02366000
ZCREBCBR EQU   ZCRENTER+15                                              02367000
ZCREDCXR EQU   ZCRENTER+15                                              02368000
ZCREDCWB EQU   ZCRENTER+15                                              02369000
ZCREDCWR EQU   ZCRENTER+15                                              02370000
ZCREKCCN EQU   ZCRENTER+15                                              02371000
ZCREKCBN EQU   ZCRENTER+15                                              02372000
ZCREKCBB EQU   ZCRENTER+15                                              02373000
ZCREJC0B EQU   ZCRENTER+15                                              02374000
ZCREJCDB EQU   ZCRENTER+14                                              02375000
ZCREJCCB EQU   ZCRENTER+14                                              02376000
ZCREJCBB EQU   ZCRENTER+14                                              02377000
ZCREJCAB EQU   ZCRENTER+14                                              02378000
ZCREIC1B EQU   ZCRENTER+14                                              02379000
ZCREIC0B EQU   ZCRENTER+14                                              02380000
ZCREICX0 EQU   ZCRENTER+14                                              02381000
ZCREICWB EQU   ZCRENTER+14                                              02382000
ZCREICVB EQU   ZCRENTER+13                                              02383000
ZCREICUB EQU   ZCRENTER+13                                              02384000
ZCREICTB EQU   ZCRENTER+13                                              02385000
ZCREICSC EQU   ZCRENTER+13                                              02386000
ZCREICSB EQU   ZCRENTER+13                                              02387000
ZCREICRB EQU   ZCRENTER+13                                              02388000
ZCREICQB EQU   ZCRENTER+13                                              02389000
ZCREICQA EQU   ZCRENTER+13                                              02390000
ZCREICOB EQU   ZCRENTER+12                                              02391000
ZCREICOA EQU   ZCRENTER+12                                              02392000
ZCREICNB EQU   ZCRENTER+12                                              02393000
ZCREICNA EQU   ZCRENTER+12                                              02394000
ZCREICMB EQU   ZCRENTER+12                                              02395000
ZCREICLB EQU   ZCRENTER+12                                              02396000
ZCREICKG EQU   ZCRENTER+12                                              02397000
ZCREICKE EQU   ZCRENTER+12                                              02398000
ZCREICKB EQU   ZCRENTER+11                                              02399000
ZCREICJB EQU   ZCRENTER+11                                              02400000
ZCREICID EQU   ZCRENTER+11                                              02401000
ZCREICIB EQU   ZCRENTER+11                                              02402000
ZCREICHB EQU   ZCRENTER+11                                              02403000
ZCREICGB EQU   ZCRENTER+11                                              02404000
ZCREICEB EQU   ZCRENTER+11                                              02405000
ZCREICDB EQU   ZCRENTER+11                                              02406000
ZCREICCI EQU   ZCRENTER+10                                              02407000
ZCREICCB EQU   ZCRENTER+10                                              02408000
ZCREICBI EQU   ZCRENTER+10                                              02409000
ZCREICBB EQU   ZCRENTER+10                                              02410000
ZCREICAB EQU   ZCRENTER+10                                              02411000
ZCREICAA EQU   ZCRENTER+10                                              02412000
ZCREHCAN EQU   ZCRENTER+10                                              02413000
ZCREGC0B EQU   ZCRENTER+10                                              02414000
ZCREGC0A EQU   ZCRENTER+9                                               02415000
ZCREGCLA EQU   ZCRENTER+9                                               02416000
ZCREGCEB EQU   ZCRENTER+9                                               02417000
ZCREGCDB EQU   ZCRENTER+9                                               02418000
@NM00016 EQU   ZCRENTER+9                                               02419000
ZCREGCBB EQU   ZCRENTER+9                                               02420000
ZCREGCAB EQU   ZCRENTER+9                                               02421000
ZCREFCEB EQU   ZCRENTER+9                                               02422000
ZCREFCEA EQU   ZCRENTER+8                                               02423000
ZCREECTA EQU   ZCRENTER+8                                               02424000
ZCREECEA EQU   ZCRENTER+8                                               02425000
ZCREECDA EQU   ZCRENTER+8                                               02426000
ZCREECCB EQU   ZCRENTER+8                                               02427000
ZCREECCA EQU   ZCRENTER+8                                               02428000
ZCREECBB EQU   ZCRENTER+8                                               02429000
ZCREECBA EQU   ZCRENTER+8                                               02430000
ZCREDCMB EQU   ZCRENTER+7                                               02431000
ZCREDCL0 EQU   ZCRENTER+7                                               02432000
ZCREDCKB EQU   ZCRENTER+7                                               02433000
ZCREDCKA EQU   ZCRENTER+7                                               02434000
ZCREDCJ0 EQU   ZCRENTER+7                                               02435000
ZCREDCI0 EQU   ZCRENTER+7                                               02436000
ZCREDCH0 EQU   ZCRENTER+7                                               02437000
ZCREDCF0 EQU   ZCRENTER+7                                               02438000
ZCREDCE0 EQU   ZCRENTER+6                                               02439000
ZCREDCD0 EQU   ZCRENTER+6                                               02440000
ZCREDCC0 EQU   ZCRENTER+6                                               02441000
ZCREDCB0 EQU   ZCRENTER+6                                               02442000
ZCREDCA0 EQU   ZCRENTER+6                                               02443000
ZCRECC2B EQU   ZCRENTER+6                                               02444000
ZCRECC1B EQU   ZCRENTER+6                                               02445000
ZCRECC1A EQU   ZCRENTER+6                                               02446000
ZCRECC0B EQU   ZCRENTER+5                                               02447000
ZCRECC0A EQU   ZCRENTER+5                                               02448000
ZCREBC0B EQU   ZCRENTER+5                                               02449000
ZCREBC0A EQU   ZCRENTER+5                                               02450000
ZCREBCZ0 EQU   ZCRENTER+5                                               02451000
ZCREBCY0 EQU   ZCRENTER+5                                               02452000
ZCREBCX0 EQU   ZCRENTER+5                                               02453000
ZCREBCXA EQU   ZCRENTER+5                                               02454000
ZCREBCSC EQU   ZCRENTER+4                                               02455000
ZCREBCRB EQU   ZCRENTER+4                                               02456000
ZCREBCRA EQU   ZCRENTER+4                                               02457000
ZCREBCQB EQU   ZCRENTER+4                                               02458000
ZCREBCPB EQU   ZCRENTER+4                                               02459000
ZCREBCOB EQU   ZCRENTER+4                                               02460000
ZCREBCNE EQU   ZCRENTER+4                                               02461000
ZCREBCND EQU   ZCRENTER+4                                               02462000
ZCREBCMB EQU   ZCRENTER+3                                               02463000
ZCREBCLB EQU   ZCRENTER+3                                               02464000
ZCREBCLA EQU   ZCRENTER+3                                               02465000
ZCREBCKB EQU   ZCRENTER+3                                               02466000
ZCREBCKA EQU   ZCRENTER+3                                               02467000
ZCREBCJB EQU   ZCRENTER+3                                               02468000
ZCREBCJA EQU   ZCRENTER+3                                               02469000
ZCREBCID EQU   ZCRENTER+3                                               02470000
ZCREBCIB EQU   ZCRENTER+2                                               02471000
ZCREBCIA EQU   ZCRENTER+2                                               02472000
ZCREBCHB EQU   ZCRENTER+2                                               02473000
ZCREBCHA EQU   ZCRENTER+2                                               02474000
ZCREBCGB EQU   ZCRENTER+2                                               02475000
ZCREBCGA EQU   ZCRENTER+2                                               02476000
ZCREBCFB EQU   ZCRENTER+2                                               02477000
ZCREBCFA EQU   ZCRENTER+2                                               02478000
ZCREBCEB EQU   ZCRENTER+1                                               02479000
ZCREBCDI EQU   ZCRENTER+1                                               02480000
ZCREBCCB EQU   ZCRENTER+1                                               02481000
ZCREBCBI EQU   ZCRENTER+1                                               02482000
ZCREBCBB EQU   ZCRENTER+1                                               02483000
ZCREBCBA EQU   ZCRENTER+1                                               02484000
ZCREBCAM EQU   ZCRENTER+1                                               02485000
ZCREBCAI EQU   ZCRENTER+1                                               02486000
ZCREBCAG EQU   ZCRENTER                                                 02487000
ZCREBCAE EQU   ZCRENTER                                                 02488000
ZCREBCAB EQU   ZCRENTER                                                 02489000
ZCREBCAA EQU   ZCRENTER                                                 02490000
ZCREAC1B EQU   ZCRENTER                                                 02491000
ZCREAC0B EQU   ZCRENTER                                                 02492000
ZCREAC0A EQU   ZCRENTER                                                 02493000
ZCREAC1A EQU   ZCRENTER                                                 02494000
ZCRTNAME EQU   ZCRAUDIT+1                                               02495000
ZCRTID   EQU   ZCRAUDIT                                                 02496000
ZCRREMIC EQU   ISTZCRR+436                                              02497000
ZCRSAVEZ EQU   ISTZCRR+196                                              02498000
ZCRDAFSV EQU   ZCRCIDSV+2                                               02499000
ZCRSAFSV EQU   ZCRCIDSV                                                 02500000
ZCRR13SV EQU   ISTZCRR+188                                              02501000
ZCRR2SV  EQU   ISTZCRR+184                                              02502000
ZCROPCDE EQU   ISTZCRR+183                                              02503000
ZCRPRMTC EQU   ISTZCRR+182                                              02504000
ZCRRCDSV EQU   ISTZCRR+181                                              02505000
ZCRAWQSW EQU   ISTZCRR+180                                              02506000
ZCRTOPQ  EQU   ISTZCRR+180                                              02507000
ZCRLSTFB EQU   ISTZCRR+180                                              02508000
ZCRXSCHD EQU   ISTZCRR+180                                              02509000
ZCRNXTEL EQU   ISTZCRR+180                                              02510000
ZCRSCANQ EQU   ISTZCRR+180                                              02511000
ZCRMOREL EQU   ISTZCRR+180                                              02512000
ZCRFBPRC EQU   ISTZCRR+180                                              02513000
ZCRFSBSV EQU   ISTZCRR+176                                              02514000
ZCRSVWK5 EQU   ZCRWKARA+16                                              02515000
ZCRSVWK4 EQU   ZCRWKARA+12                                              02516000
ZCRSVWK3 EQU   ZCRWKARA+8                                               02517000
ZCRSVWK2 EQU   ZCRWKARA+4                                               02518000
ZCRSVWK1 EQU   ZCRWKARA                                                 02519000
ZCRSVF25 EQU   ZCRSVRTN+96                                              02520000
ZCRSVF24 EQU   ZCRSVRTN+92                                              02521000
ZCRSVF23 EQU   ZCRSVRTN+88                                              02522000
ZCRSVF22 EQU   ZCRSVRTN+84                                              02523000
ZCRSVF21 EQU   ZCRSVRTN+80                                              02524000
ZCRSVF20 EQU   ZCRSVRTN+76                                              02525000
ZCRSVF19 EQU   ZCRSVRTN+72                                              02526000
ZCRSVF18 EQU   ZCRSVRTN+68                                              02527000
ZCRSVF17 EQU   ZCRSVRTN+64                                              02528000
ZCRSVF16 EQU   ZCRSVRTN+60                                              02529000
ZCRSVF15 EQU   ZCRSVRTN+56                                              02530000
ZCRSVF14 EQU   ZCRSVRTN+52                                              02531000
ZCRSVF13 EQU   ZCRSVRTN+48                                              02532000
ZCRSVF12 EQU   ZCRSVRTN+44                                              02533000
ZCRSVF11 EQU   ZCRSVRTN+40                                              02534000
ZCRSVF10 EQU   ZCRSVRTN+36                                              02535000
ZCRSVF9  EQU   ZCRSVRTN+32                                              02536000
ZCRSVF8  EQU   ZCRSVRTN+28                                              02537000
ZCRSVF7  EQU   ZCRSVRTN+24                                              02538000
ZCRSVF6  EQU   ZCRSVRTN+20                                              02539000
ZCRSVF5  EQU   ZCRSVRTN+16                                              02540000
ZCRSVF4  EQU   ZCRSVRTN+12                                              02541000
ZCRSVF3  EQU   ZCRSVRTN+8                                               02542000
ZCRSVF2  EQU   ZCRSVRTN+4                                               02543000
ZCRSVF1  EQU   ZCRSVRTN                                                 02544000
ZCRPVZB  EQU   ISTZCRR+52                                               02545000
ZCRZLB   EQU   ISTZCRR+48                                               02546000
ZCRBFPTR EQU   ISTZCRR+44                                               02547000
ZCRCCWA  EQU   ISTZCRR+40                                               02548000
ZCRPSW   EQU   ZCRPARMS+15                                              02549000
ZCRPCHAR EQU   ZCRPARMS+14                                              02550000
ZCRPRES2 EQU   ZCRPCOD2                                                 02551000
ZCRPMFGF EQU   ZCRPCOD2                                                 02552000
ZCRPFHDR EQU   ZCRPCOD2                                                 02553000
ZCRPPG2  EQU   ZCRPCOD2                                                 02554000
ZCRPRES  EQU   ZCRPCOD1                                                 02555000
ZCRPCFTX EQU   ZCRPCOD1                                                 02556000
ZCRPBUF  EQU   ZCRPCOD1                                                 02557000
ZCRPLSCB EQU   ZCRPCOD1                                                 02558000
ZCRPLSBQ EQU   ZCRPLSBF                                                 02559000
ZCRPFSB  EQU   ZCRPCOD1                                                 02560000
ZCRPLNG  EQU   ZCRPCOD1                                                 02561000
ZCRPPG   EQU   ZCRPCOD1                                                 02562000
ZCRDTODA EQU   ZCRDFRDA                                                 02563000
ZCRMLNG  EQU   ZCRPARMS+8                                               02564000
ZCRTBPTR EQU   ZCRPARMS+4                                               02565000
ZCRCBPTR EQU   ZCRFBPTR                                                 02566000
ZCRCRLCP EQU   ISTZCRR+20                                               02567000
@NM00015 EQU   ZCRSCPSW                                                 02568000
ZCRSKIPT EQU   ZCRSCPSW                                                 02569000
ZCRFSBWE EQU   ZCRSCPSW                                                 02570000
ZCRPRCMP EQU   ZCRSCPSW                                                 02571000
ZCRLREQ  EQU   ZCRSCPSW                                                 02572000
ZCRRJLCP EQU   ZCRSCPSW                                                 02573000
ZCRTPINV EQU   ZCRSCPSW                                                 02574000
ZCRTPEX  EQU   ZCRSCPSW                                                 02575000
@NM00014 EQU   ZCRIBPR                                                  02576000
ZCR3270R EQU   ZCRIBPR                                                  02577000
ZCR3270  EQU   ZCRIBPR                                                  02578000
ZCRLCPFD EQU   ZCRIBPR                                                  02579000
ZCRLCPFR EQU   ZCRIBPR                                                  02580000
ZCRRELK  EQU   ZCRIBPR                                                  02581000
ZCRERR   EQU   ZCRIBPR                                                  02582000
ZCRNOBUF EQU   ZCRIBPR                                                  02583000
@NM00013 EQU   ZCRPFLGS                                                 02584000
ZCRQAHED EQU   ZCRPFLGS                                                 02585000
ZCRF1RES EQU   ZCRGENSW                                                 02586000
ZCRBRIS  EQU   ZCRGENSW                                                 02587000
ZCRCLRBD EQU   ZCRGENSW                                                 02588000
ZCREXRES EQU   ZCRGENSW                                                 02589000
ZCRLCSYN EQU   ZCRGENSW                                                 02590000
ZCRRT06  EQU   ZCRGENSW                                                 02591000
ZCRTSW2  EQU   ZCRGENSW                                                 02592000
ZCRTSW1  EQU   ZCRGENSW                                                 02593000
ZCRINLCP EQU   ZCRFLGS3                                                 02594000
ZCRWRPTR EQU   ZCRFLGS3                                                 02595000
ZCRNOFRE EQU   ZCRFLGS3                                                 02596000
ZCREDRIV EQU   ZCRFLGS3                                                 02597000
ZCRDISC  EQU   ZCRFLGS3                                                 02598000
ZCRTPDIS EQU   ZCRFLGS3                                                 02599000
ZCRTPCON EQU   ZCRFLGS3                                                 02600000
ZCRTIC   EQU   ZCRFLGS3                                                 02601000
ZCRCNLXL EQU   ZCRRESET                                                 02602000
ZCRENDAN EQU   ZCRSWFLD                                                 02603000
ZCRENDXL EQU   ZCRSWFLD                                                 02604000
ZCRENDX  EQU   ZCRSWFLD                                                 02605000
ZCROB1   EQU   ZCRNDLCP                                                 02606000
ZCRENDPR EQU   ZCRSWFLD                                                 02607000
ZCREXTYP EQU   ZCRSWFLD                                                 02608000
ZCRSLCP  EQU   ZCRENDSH                                                 02609000
ZCRIF0E3 EQU   ZCRFLGS2                                                 02610000
ZCRIF0E2 EQU   ZCRFLGS2                                                 02611000
ZCRIF0E1 EQU   ZCRFLGS2                                                 02612000
ZCROB    EQU   ZCRFLGS2                                                 02613000
ZCRFMSED EQU   ZCRFLGS2                                                 02614000
ZCRSHEDI EQU   ZCRFLGS2                                                 02615000
ZCRLOCAL EQU   ZCRFLGS2                                                 02616000
ZCRFEXIT EQU   ZCRFLGS1                                                 02617000
ZCRUNSOL EQU   ZCRFLGS1                                                 02618000
ZCRENDLP EQU   ZCRFLGS1                                                 02619000
ZCRNRMEX EQU   ZCRFLGS1                                                 02620000
ZCRWAIT  EQU   ZCRFLGS1                                                 02621000
ZCRDEQSW EQU   ZCRFLGS1                                                 02622000
ZCRQUESW EQU   ZCRFLGS1                                                 02623000
ZCREXSW  EQU   ZCRFLGS1                                                 02624000
ZCRFRRA  EQU   ISTZCRR+8                                                02625000
ZCRCHAIN EQU   ISTZCRR+4                                                02626000
ZCRFLAG  EQU   ZCRCRR+3                                                 02627000
ZCRLEN   EQU   ZCRCRR+1                                                 02628000
ZCRID    EQU   ZCRCRR                                                   02629000
LCPFTYPE EQU   LCPRPHA                                                  02630000
LCPRSTQH EQU   LCPLCCW                                                  02631000
LCPCLREP EQU   ISTLCPB+44                                               02632000
LCPUBFSB EQU   LCPFLCCW                                                 02633000
LCPRSV77 EQU   ISTLCPB+39                                               02634000
LCPLCCWC EQU   ISTLCPB+38                                               02635000
LCPRSV78 EQU   LCPFLG1                                                  02636000
LCPTRANS EQU   LCPFLG1                                                  02637000
LCPSTLB  EQU   LCPFLG1                                                  02638000
LCPREDRV EQU   LCPFLG1                                                  02639000
LCPDIRPT EQU   LCPFLG1                                                  02640000
LCPINTER EQU   LCPFLG1                                                  02641000
LCPRESET EQU   LCPFLG1                                                  02642000
LCPSTYPE EQU   ISTLCPB+36                                               02643000
LCPFSNCH EQU   ISTLCPB+34                                               02644000
LCPFOSN  EQU   ISTLCPB+32                                               02645000
LCPTLBAD EQU   ISTLCPB+28                                               02646000
LCPFDB2  EQU   LCPFDBA+1                                                02647000
LCPFDB1  EQU   LCPFDBA                                                  02648000
LCPNXLCW EQU   ISTLCPB+20                                               02649000
LCPDAF   EQU   LCPCID+2                                                 02650000
LCPSAF   EQU   LCPCID                                                   02651000
LCPLCCW1 EQU   ISTLCPB+12                                               02652000
LCPRRCNT EQU   LCPSEQ+1                                                 02653000
LCPRRCCT EQU   LCPSEQ                                                   02654000
LCPATOP  EQU   LCPFLAG2                                                 02655000
LCPFREE  EQU   LCPFLAG2                                                 02656000
LCPDSTAT EQU   LCPFLAG2                                                 02657000
LCPEXRES EQU   LCPFID0                                                  02658000
LCPZRIMM EQU   LCPTLBPI                                                 02659000
LCPRSTRT EQU   LCPFLAG2                                                 02660000
LCPASYN  EQU   LCPFLAG2                                                 02661000
LCPPRFLG EQU   LCPFLAG2                                                 02662000
LCPZMIRC EQU   LCPRUCNT                                                 02663000
LCPCHAI2 EQU   LCPCHAIN+1                                               02664000
LCPCHNG  EQU   LCPCHAI1                                                 02665000
LCPZRT0B EQU   LCPMNRCD                                                 02666000
LCPZRT0A EQU   LCPMNRCD                                                 02667000
LCPZRTL9 EQU   LCPZRT09                                                 02668000
LCPZRTL8 EQU   LCPZRT08                                                 02669000
LCPZRTL7 EQU   LCPZRT07                                                 02670000
LCPZRTL6 EQU   LCPZRT06                                                 02671000
LCPZRTL5 EQU   LCPZRT05                                                 02672000
LCPZRTL4 EQU   LCPZRT04                                                 02673000
LCPZRTL3 EQU   LCPZRT03                                                 02674000
LCPZRTL2 EQU   LCPZRT02                                                 02675000
LCPZRT01 EQU   LCPFLAGS                                                 02676000
LCPZRT00 EQU   LCPFLAGS                                                 02677000
LCPLNGTH EQU   ISTLCPB+1                                                02678000
LCPTYPE  EQU   ISTLCPB                                                  02679000
LCCWDATA EQU   ISTLCCW+4                                                02680000
LCCWCNT  EQU   ISTLCCW+2                                                02681000
LCCWACI  EQU   LCCWFLAG                                                 02682000
LCCWRFI  EQU   LCCWFLAG                                                 02683000
LCCWPER  EQU   LCCWLSI                                                  02684000
LCCWIDAT EQU   LCCWFLAG                                                 02685000
LCCWNTVC EQU   LCCWFLAG                                                 02686000
LCCWCKPT EQU   LCCWFLAG                                                 02687000
LCCWCC   EQU   LCCWFLAG                                                 02688000
LCCWCD   EQU   LCCWFLAG                                                 02689000
LCCWTYPE EQU   LCCWCTL                                                  02690000
LCCWMODE EQU   LCCWCTL                                                  02691000
LCCWSOP  EQU   LCCWRWOP                                                 02692000
@NM00012 EQU   LCCWRWOP                                                 02693000
LCCWSD   EQU   LCCWOP                                                   02694000
LCCWSI   EQU   LCCWOP                                                   02695000
ZSAZTRAC EQU   ISTZSAVE+36                                              02696000
ZSAZACTV EQU   ZSAZSVMS                                                 02697000
CVTLEVL  EQU   CVTRELNO+2                                               02698000
CVTNUMB  EQU   CVTRELNO                                                 02699000
CVTMDL   EQU   CVTFIX+250                                               02700000
@NM00011 EQU   CVTFIX+248                                               02701000
@NM00010 EQU   CVTFIX                                                   02702000
CVTRV482 EQU   CVTXTNT2+128                                             02703000
CVTRV481 EQU   CVTXTNT2+124                                             02704000
CVTRV480 EQU   CVTXTNT2+120                                             02705000
CVTRV479 EQU   CVTXTNT2+118                                             02706000
CVTRV478 EQU   CVTXTNT2+117                                             02707000
CVTRV477 EQU   CVTXTNT2+116                                             02708000
CVTRV476 EQU   CVTXTNT2+115                                             02709000
CVTRV475 EQU   CVTXTNT2+114                                             02710000
CVTRV474 EQU   CVTRV466                                                 02711000
CVTRV473 EQU   CVTRV466                                                 02712000
CVTRV472 EQU   CVTRV466                                                 02713000
CVTRV471 EQU   CVTRV466                                                 02714000
CVTRV470 EQU   CVTRV466                                                 02715000
CVTRV469 EQU   CVTRV466                                                 02716000
CVTRV468 EQU   CVTRV466                                                 02717000
CVTRV467 EQU   CVTRV466                                                 02718000
CVTRV465 EQU   CVTRV457                                                 02719000
CVTRV464 EQU   CVTRV457                                                 02720000
CVTRV463 EQU   CVTRV457                                                 02721000
CVTRV462 EQU   CVTRV457                                                 02722000
CVTRV461 EQU   CVTRV457                                                 02723000
CVTRV460 EQU   CVTRV457                                                 02724000
CVTRV459 EQU   CVTRV457                                                 02725000
CVTRV458 EQU   CVTRV457                                                 02726000
CVTRV456 EQU   CVTXTNT2+108                                             02727000
CVTRV455 EQU   CVTXTNT2+104                                             02728000
CVTRV454 EQU   CVTXTNT2+100                                             02729000
CVTRV453 EQU   CVTXTNT2+96                                              02730000
CVTRV452 EQU   CVTXTNT2+94                                              02731000
CVTRV451 EQU   CVTXTNT2+92                                              02732000
CVTRV450 EQU   CVTXTNT2+90                                              02733000
CVTRV449 EQU   CVTXTNT2+88                                              02734000
CVTRV448 EQU   CVTXTNT2+87                                              02735000
CVTRV447 EQU   CVTXTNT2+86                                              02736000
CVTRV446 EQU   CVTRV438                                                 02737000
CVTRV445 EQU   CVTRV438                                                 02738000
CVTRV444 EQU   CVTRV438                                                 02739000
CVTRV443 EQU   CVTRV438                                                 02740000
CVTRV442 EQU   CVTRV438                                                 02741000
CVTRV441 EQU   CVTRV438                                                 02742000
CVTRV440 EQU   CVTRV438                                                 02743000
CVTRV439 EQU   CVTRV438                                                 02744000
CVTRV437 EQU   CVTRV429                                                 02745000
CVTRV436 EQU   CVTRV429                                                 02746000
CVTRV435 EQU   CVTRV429                                                 02747000
CVTRV434 EQU   CVTRV429                                                 02748000
CVTRV433 EQU   CVTRV429                                                 02749000
CVTRV432 EQU   CVTRV429                                                 02750000
CVTRV431 EQU   CVTRV429                                                 02751000
CVTRV430 EQU   CVTRV429                                                 02752000
CVTRV428 EQU   CVTXTNT2+80                                              02753000
CVTRV427 EQU   CVTXTNT2+76                                              02754000
CVTRV426 EQU   CVTXTNT2+72                                              02755000
CVTRV425 EQU   CVTXTNT2+68                                              02756000
CVTATACT EQU   CVTATCVT                                                 02757000
CVTRV423 EQU   CVTXTNT2+62                                              02758000
CVTRV422 EQU   CVTXTNT2+60                                              02759000
CVTRV421 EQU   CVTXTNT2+58                                              02760000
CVTRV420 EQU   CVTXTNT2+56                                              02761000
CVTRV419 EQU   CVTXTNT2+55                                              02762000
CVTRV418 EQU   CVTXTNT2+54                                              02763000
CVTRV417 EQU   CVTRV409                                                 02764000
CVTRV416 EQU   CVTRV409                                                 02765000
CVTRV415 EQU   CVTRV409                                                 02766000
CVTRV414 EQU   CVTRV409                                                 02767000
CVTRV413 EQU   CVTRV409                                                 02768000
CVTRV412 EQU   CVTRV409                                                 02769000
CVTRV411 EQU   CVTRV409                                                 02770000
CVTRV410 EQU   CVTRV409                                                 02771000
CVTRV408 EQU   CVTRV400                                                 02772000
CVTRV407 EQU   CVTRV400                                                 02773000
CVTRV406 EQU   CVTRV400                                                 02774000
CVTRV405 EQU   CVTRV400                                                 02775000
CVTRV404 EQU   CVTRV400                                                 02776000
CVTRV403 EQU   CVTRV400                                                 02777000
CVTRV402 EQU   CVTRV400                                                 02778000
CVTRV401 EQU   CVTRV400                                                 02779000
CVTICB   EQU   CVTXTNT2+48                                              02780000
CVTSKTA  EQU   CVTXTNT2+44                                              02781000
CVTSHSB  EQU   CVTSHS                                                   02782000
CVTRSV98 EQU   CVTXTNT2+36                                              02783000
CVTRSV97 EQU   CVTXTNT2+34                                              02784000
CVTRSV96 EQU   CVTXTNT2+32                                              02785000
CVTOLTEP EQU   CVTXTNT2+28                                              02786000
CVTQIDA  EQU   CVTQID+1                                                 02787000
CVTRSV95 EQU   CVTQID                                                   02788000
CVTRSV94 EQU   CVTXTNT2+20                                              02789000
CVTRSV93 EQU   CVTXTNT2+16                                              02790000
CVTRSV92 EQU   CVTXTNT2+12                                              02791000
CVTDEBVR EQU   CVTXTNT2+8                                               02792000
CVTRSV91 EQU   CVTXTNT2+6                                               02793000
CVTRSV9H EQU   CVTFLGBT                                                 02794000
CVTRSV9G EQU   CVTFLGBT                                                 02795000
CVTRSV9F EQU   CVTFLGBT                                                 02796000
CVTRSV9E EQU   CVTFLGBT                                                 02797000
CVTRSV9D EQU   CVTFLGBT                                                 02798000
CVTRSV9C EQU   CVTFLGBT                                                 02799000
CVTVME   EQU   CVTFLGBT                                                 02800000
CVTNPE   EQU   CVTFLGBT                                                 02801000
CVTNUCLS EQU   CVTXTNT2+4                                               02802000
CVTDSSVA EQU   CVTDSSV+1                                                02803000
CVTRSV89 EQU   CVTDSSV                                                  02804000
CVTRSV88 EQU   CVTXTNT1+8                                               02805000
CVTRSV87 EQU   CVTXTNT1+4                                               02806000
CVTFACHN EQU   CVTXTNT1                                                 02807000
CVTRV488 EQU   CVTMAP+412                                               02808000
CVTRV487 EQU   CVTMAP+408                                               02809000
CVTRV486 EQU   CVTMAP+404                                               02810000
CVTRV485 EQU   CVTMAP+400                                               02811000
CVTACTAP EQU   CVTMAP+396                                               02812000
CVTAUTH  EQU   CVTMAP+392                                               02813000
CVTATMCA EQU   CVTATMCT+1                                               02814000
CVTATMST EQU   CVTATMCT                                                 02815000
CVTRSV61 EQU   CVTMAP+384                                               02816000
CVTVOLT1 EQU   CVTVOLM1+1                                               02817000
CVTVOLI1 EQU   CVTVOLF1                                                 02818000
CVTSTOA  EQU   CVTMAP+376                                               02819000
CVTRSV58 EQU   CVTMAP+374                                               02820000
CVTRSV57 EQU   CVTMAP+372                                               02821000
CVTDDCE  EQU   CVTMAP+368                                               02822000
CVTPNWFR EQU   CVTMAP+364                                               02823000
CVTSMF   EQU   CVTMAP+360                                               02824000
CVTSULK  EQU   CVTMAP+358                                               02825000
CVTSLKO  EQU   CVTSYSK                                                  02826000
CVTSLKP  EQU   CVTSYSK                                                  02827000
CVTSLKQ  EQU   CVTSYSK                                                  02828000
CVTSLKR  EQU   CVTSYSK                                                  02829000
CVTRSV56 EQU   CVTSYSK                                                  02830000
CVTRSV55 EQU   CVTSYSK                                                  02831000
CVTRSV54 EQU   CVTSYSK                                                  02832000
CVTRSV53 EQU   CVTSYSK                                                  02833000
CVTRSV52 EQU   CVTA1F1                                                  02834000
CVTRSV51 EQU   CVTA1F1                                                  02835000
CVTRSV50 EQU   CVTA1F1                                                  02836000
CVTRSV49 EQU   CVTA1F1                                                  02837000
CVTRSV48 EQU   CVTA1F1                                                  02838000
CVTRSV47 EQU   CVTA1F1                                                  02839000
CVTSRSW  EQU   CVTA1F1                                                  02840000
CVTPFSW  EQU   CVTA1F1                                                  02841000
CVTPCVT  EQU   CVTMAP+352                                               02842000
CVTRSV46 EQU   CVTMAP+344                                               02843000
CVTRSV45 EQU   CVTMAP+340                                               02844000
CVTRSV44 EQU   CVTMAP+338                                               02845000
CVTRSV43 EQU   CVTMAP+336                                               02846000
CVTHJESA EQU   CVTHJES+1                                                02847000
CVTRSV42 EQU   CVTHJES                                                  02848000
CVTEXT2A EQU   CVTEXT2+1                                                02849000
CVTRSV41 EQU   CVTEXT2                                                  02850000
CVTAPFA  EQU   CVTAPF+1                                                 02851000
CVTRSV40 EQU   CVTAPF                                                   02852000
CVTRV518 EQU   CVTINTLA                                                 02853000
CVTRV517 EQU   CVTERPV                                                  02854000
CVTEORM  EQU   CVTMAP+312                                               02855000
CVTMCHPR EQU   CVTMAP+308                                               02856000
CVTTZ    EQU   CVTMAP+304                                               02857000
CVTJEPS  EQU   CVTMAP+300                                               02858000
CVTJESCT EQU   CVTMAP+296                                               02859000
CVTMODE  EQU   CVTMAP+292                                               02860000
CVTPTRV  EQU   CVTMAP+288                                               02861000
CVTREAL  EQU   CVTMAP+284                                               02862000
CVTRSV39 EQU   CVTMAP+280                                               02863000
CVTRSV38 EQU   CVTMAP+276                                               02864000
CVTDMSRA EQU   CVTDMSR+1                                                02865000
CVTRSV37 EQU   CVTDMSR                                                  02866000
CVTQMSGA EQU   CVTQMSG+1                                                02867000
CVTRSV36 EQU   CVTQMSG                                                  02868000
CVTAMFF  EQU   CVTMAP+264                                               02869000
CVTPURGA EQU   CVTPURG+1                                                02870000
CVTRSV35 EQU   CVTPURG                                                  02871000
CVTCBSP  EQU   CVTMAP+256                                               02872000
CVTATERA EQU   CVTATER+1                                                02873000
CVTSYST  EQU   CVTATER                                                  02874000
CVTVOLT2 EQU   CVTTAT                                                   02875000
CVTVOLI2 EQU   CVTVOLF2                                                 02876000
CVTAQAVB EQU   CVTAQAVT+1                                               02877000
CVTRSV34 EQU   CVTTCMFG                                                 02878000
CVTRSV33 EQU   CVTTCMFG                                                 02879000
CVTRSV32 EQU   CVTTCMFG                                                 02880000
CVTRSV31 EQU   CVTTCMFG                                                 02881000
CVTRSV30 EQU   CVTTCMFG                                                 02882000
CVTRSV29 EQU   CVTTCMFG                                                 02883000
CVTRSV28 EQU   CVTTCMFG                                                 02884000
CVTTCRDY EQU   CVTTCMFG                                                 02885000
CVTGTFA  EQU   CVTGTF+1                                                 02886000
CVTRSV27 EQU   CVTGTFST                                                 02887000
CVTUSR   EQU   CVTGTFST                                                 02888000
CVTRV318 EQU   CVTFORM                                                  02889000
CVTRV317 EQU   CVTTMODE                                                 02890000
CVTRV316 EQU   CVTSTATE                                                 02891000
CVTRV315 EQU   CVTGTFS                                                  02892000
CVTGTFAV EQU   CVTGTFS                                                  02893000
CVT0SCR1 EQU   CVTMAP+232                                               02894000
CVTRV515 EQU   CVTMAP+228                                               02895000
CVTRMS   EQU   CVTMAP+224                                               02896000
CVTPATCH EQU   CVTMAP+220                                               02897000
CVTTSCE  EQU   CVTMAP+216                                               02898000
CVTLNKSC EQU   CVTMAP+214                                               02899000
CVTQABST EQU   CVTMAP+212                                               02900000
CVTMDLDS EQU   CVTMAP+208                                               02901000
CVTUSER  EQU   CVTMAP+204                                               02902000
CVTABEND EQU   CVTMAP+200                                               02903000
CVTSMCA  EQU   CVTMAP+196                                               02904000
CVTRSV18 EQU   CVTMAP+192                                               02905000
CVTQLPAQ EQU   CVTMAP+188                                               02906000
CVTQCDSR EQU   CVTMAP+184                                               02907000
CVTRSV17 EQU   CVTOPTB                                                  02908000
CVTRSV16 EQU   CVTOPTB                                                  02909000
CVTFP    EQU   CVTOPTB                                                  02910000
CVTAPTHR EQU   CVTOPTB                                                  02911000
CVTNLOG  EQU   CVTOPTB                                                  02912000
CVTTOD   EQU   CVTOPTB                                                  02913000
CVTCTIMS EQU   CVTOPTB                                                  02914000
CVTPROT  EQU   CVTOPTB                                                  02915000
CVTXPFP  EQU   CVTOPTA                                                  02916000
CVTASCII EQU   CVTOPTA                                                  02917000
CVTRSV13 EQU   CVTOPTA                                                  02918000
CVTRSV12 EQU   CVTOPTA                                                  02919000
CVTNIP   EQU   CVTOPTA                                                  02920000
CVTDDR   EQU   CVTOPTA                                                  02921000
CVTAPR   EQU   CVTOPTA                                                  02922000
CVTCCH   EQU   CVTOPTA                                                  02923000
CVTSNCTR EQU   CVTMAP+180                                               02924000
CVTQMWR  EQU   CVTMAP+176                                               02925000
CVTQOCR  EQU   CVTMAP+172                                               02926000
CVT1EF00 EQU   CVTMAP+168                                               02927000
CVTMZ00  EQU   CVTMAP+164                                               02928000
CVTHEAD  EQU   CVTMAP+160                                               02929000
CVTRSV11 EQU   CVTMAP+156                                               02930000
CVT0PT01 EQU   CVTMAP+152                                               02931000
CVTMSER  EQU   CVTMAP+148                                               02932000
CVTRV516 EQU   CVTIERLC                                                 02933000
CVTILCH  EQU   CVTMAP+140                                               02934000
CVT0DS   EQU   CVTMAP+136                                               02935000
CVTFBOSV EQU   CVTMAP+132                                               02936000
CVTNUCB  EQU   CVTMAP+128                                               02937000
CVTIXAVL EQU   CVTMAP+124                                               02938000
CVTIOQET EQU   CVTMAP+120                                               02939000
CVTDCBA  EQU   CVTMAP+117                                               02940000
CVTMVS2  EQU   CVTDCB                                                   02941000
CVT6DAT  EQU   CVTDCB                                                   02942000
CVT4MPS  EQU   CVTDCB                                                   02943000
CVTRSV09 EQU   CVTDCB                                                   02944000
CVT4MS1  EQU   CVTDCB                                                   02945000
CVT2SPS  EQU   CVTDCB                                                   02946000
CVT1SSS  EQU   CVTDCB                                                   02947000
CVTRSV08 EQU   CVTDCB                                                   02948000
CVTSTB   EQU   CVTMAP+112                                               02949000
CVTQTD00 EQU   CVTMAP+108                                               02950000
CVTQTE00 EQU   CVTMAP+104                                               02951000
CVTCUCB  EQU   CVTMAP+100                                               02952000
CVTSJQ   EQU   CVTMAP+96                                                02953000
CVTPBLDL EQU   CVTMAP+92                                                02954000
CVTTPC   EQU   CVTMAP+88                                                02955000
CVTSVDCB EQU   CVTMAP+84                                                02956000
CVTBRET  EQU   CVTMAP+82                                                02957000
CVTEXIT  EQU   CVTMAP+80                                                02958000
CVT0FN00 EQU   CVTMAP+76                                                02959000
CVTDARA  EQU   CVTDAR+1                                                 02960000
CVTRSV07 EQU   CVTFLGS1                                                 02961000
CVTRSV06 EQU   CVTFLGS1                                                 02962000
CVTRSV05 EQU   CVTFLGS1                                                 02963000
CVTRSV04 EQU   CVTFLGS1                                                 02964000
CVTRSV03 EQU   CVTFLGS1                                                 02965000
CVTRSV02 EQU   CVTFLGS1                                                 02966000
CVTRSV01 EQU   CVTFLGS1                                                 02967000
CVTDMPLK EQU   CVTFLGS1                                                 02968000
CVTXITP  EQU   CVTMAP+68                                                02969000
CVTZDTAB EQU   CVTMAP+64                                                02970000
CVTMSLT  EQU   CVTMAP+60                                                02971000
CVTDATE  EQU   CVTMAP+56                                                02972000
CVTBTERM EQU   CVTMAP+52                                                02973000
CVTSYSAD EQU   CVTMAP+48                                                02974000
CVTXTLER EQU   CVTMAP+44                                                02975000
CVTILK2  EQU   CVTMAP+40                                                02976000
CVTILK1  EQU   CVTMAP+36                                                02977000
CVTPRLTV EQU   CVTMAP+32                                                02978000
CVTPCNVT EQU   CVTMAP+28                                                02979000
CVT0VL00 EQU   CVTMAP+24                                                02980000
CVTXAPG  EQU   CVTMAP+20                                                02981000
CVTBUF   EQU   CVTMAP+16                                                02982000
CVTJOB   EQU   CVTMAP+12                                                02983000
CVTLINK  EQU   CVTMAP+8                                                 02984000
CVT0EF00 EQU   CVTMAP+4                                                 02985000
CVTTCBP  EQU   CVTMAP                                                   02986000
CVT      EQU   CVTMAP                                                   02987000
@NM00009 EQU   SRBSECT+40                                               02988000
@NM00008 EQU   SRBSECT+38                                               02989000
SRBPRIOR EQU   SRBSECT+37                                               02990000
SRBPKF   EQU   SRBSECT+36                                               02991000
SRBSAVE  EQU   SRBSECT+32                                               02992000
SRBPARM  EQU   SRBSECT+28                                               02993000
SRBRMTR  EQU   SRBSECT+24                                               02994000
SRBEP    EQU   SRBSECT+20                                               02995000
SRBPTCB  EQU   SRBFLC+4                                                 02996000
SRBPASID EQU   SRBFLC+2                                                 02997000
SRBCPAFF EQU   SRBFLC                                                   02998000
SRBASCB  EQU   SRBSECT+8                                                02999000
SRBFLNK  EQU   SRBSECT+4                                                03000000
SRBID    EQU   SRBSECT                                                  03001000
IOSEND   EQU   IOSB+108                                                 03002000
IOSSKR   EQU   IOSEEKA+7                                                03003000
IOSSKH2  EQU   IOSSKHH+1                                                03004000
IOSSKH1  EQU   IOSSKHH                                                  03005000
IOSSKCC  EQU   IOSCCHH                                                  03006000
IOSSKBB  EQU   IOSEEKA+1                                                03007000
IOSSKM   EQU   IOSEEKA                                                  03008000
IOSEEK   EQU   IOSB+92                                                  03009000
IOSMDM   EQU   IOSB+91                                                  03010000
IOSMDB   EQU   IOSB+90                                                  03011000
IOSCKEY7 EQU   IOSCKEY                                                  03012000
IOSCKEY6 EQU   IOSCKEY                                                  03013000
IOSCKEY5 EQU   IOSCKEY                                                  03014000
IOSCKEY4 EQU   IOSCKEY                                                  03015000
@NM00004 EQU   IOSCKEY                                                  03016000
IOSFMSK  EQU   IOSB+88                                                  03017000
IOSCUDEV EQU   IOSPATH+1                                                03018000
@NM00003 EQU   IOSCHN                                                   03019000
IOSPATH3 EQU   IOSCHN                                                   03020000
IOSPATH2 EQU   IOSCHN                                                   03021000
IOSEXP   EQU   IOSCHN                                                   03022000
IOSGDP   EQU   IOSCHN                                                   03023000
IOSAFF   EQU   IOSB+85                                                  03024000
IOSRSS1B EQU   IOSB+84                                                  03025000
IOSDSID  EQU   IOSB+80                                                  03026000
IOSVST   EQU   IOSB+76                                                  03027000
IOSRST   EQU   IOSB+72                                                  03028000
IOSDIE   EQU   IOSB+68                                                  03029000
IOSABN   EQU   IOSB+64                                                  03030000
IOSNRM   EQU   IOSB+60                                                  03031000
IOSPCI   EQU   IOSB+56                                                  03032000
IOSERP   EQU   IOSB+52                                                  03033000
IOSPCHN  EQU   IOSB+48                                                  03034000
IOSSNS   EQU   IOSB+42                                                  03035000
IOSAPMSK EQU   IOSB+40                                                  03036000
IOSRES4A EQU   IOSB+36                                                  03037000
IOSUSE   EQU   IOSB+32                                                  03038000
IOSSRB   EQU   IOSB+28                                                  03039000
IOSCSWRC EQU   IOSCSW+5                                                 03040000
IOSTSB   EQU   IOSTATUS+1                                               03041000
IOSTSA   EQU   IOSTATUS                                                 03042000
IOSCSWCA EQU   IOSCSW                                                   03043000
IOSCC    EQU   @NM00002                                                 03044000
IOSUCB   EQU   IOSB+16                                                  03045000
IOSOPT2X EQU   IOSOPT2                                                  03046000
IOSHTP   EQU   IOSOPT2                                                  03047000
IOSRELSE EQU   IOSOPT                                                   03048000
IOSAPR   EQU   IOSOPT                                                   03049000
IOSTSLL  EQU   IOSOPT                                                   03050000
IOSNERP  EQU   IOSOPT                                                   03051000
IOSPSLL  EQU   IOSOPT                                                   03052000
IOSQISCE EQU   IOSOPT                                                   03053000
IOSDEP   EQU   IOSOPT                                                   03054000
IOSBYP   EQU   IOSOPT                                                   03055000
IOSCOD   EQU   IOSB+13                                                  03056000
IOSPKY7  EQU   IOSPKEY                                                  03057000
IOSPGDPX EQU   IOSPKEY                                                  03058000
IOSIDR   EQU   IOSPKEY                                                  03059000
IOSLCL   EQU   IOSPKEY                                                  03060000
@NM00001 EQU   IOSPKEY                                                  03061000
IOSPGAD  EQU   IOSB+8                                                   03062000
IOSASID  EQU   IOSB+6                                                   03063000
IOSPRLVL EQU   IOSB+5                                                   03064000
IOSDVRID EQU   IOSB+4                                                   03065000
IOSPROC  EQU   IOSB+3                                                   03066000
IOSFLC7  EQU   IOSFLC                                                   03067000
IOSFLC6  EQU   IOSFLC                                                   03068000
IOSRWAIT EQU   IOSFLC                                                   03069000
IOSTP    EQU   IOSFLC                                                   03070000
IOSCC3WE EQU   IOSFLC                                                   03071000
IOSVERIF EQU   IOSDVALT                                                 03072000
IOSDVMNT EQU   IOSFLC                                                   03073000
IOSLOG   EQU   IOSFLB                                                   03074000
IOSBDCST EQU   IOSFLB                                                   03075000
IOSMSG   EQU   IOSFLB                                                   03076000
IOSFLB4  EQU   IOSFLB                                                   03077000
IOSFLB3  EQU   IOSFLB                                                   03078000
IOSFLB2  EQU   IOSFLB                                                   03079000
IOSSDR   EQU   IOSFLB                                                   03080000
IOSDIESE EQU   IOSFLB                                                   03081000
IOSIOSB  EQU   IOSFLA                                                   03082000
IOSDOM   EQU   IOSFLA                                                   03083000
IOSEX    EQU   IOSFLA                                                   03084000
IOSSMDB  EQU   IOSFLA                                                   03085000
IOSSMDA  EQU   IOSFLA                                                   03086000
IOSERR   EQU   IOSFLA                                                   03087000
IOSCCHN  EQU   IOSACHN                                                  03088000
IOSDCHN  EQU   IOSACHN                                                  03089000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03090000
@RF00510 EQU   FFDF1                                                    03091000
@RT00604 EQU   @RC00603                                                 03092000
@ENDDATA EQU   *                                                        03093000
         END   ISTZFFDF,(C'PLS2213',0603,75231)                         03094000
