         TITLE 'ISTZIFOE/AOE-VS1/MOE-VS2: CONTACT COMPLETION           *00001000
                        '                                               00002000
ISTZIFOE CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZIFOE  75.336'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
         EJECT                                                          00011000
*                                                                  0461 00012000
*/* TPZSAVE (7,12,14) BASE AC(ICOE)                                  */ 00013000
*                                                                  0461 00014000
*   DO;                                                            0461 00015000
*     RFY                                                          0462 00016000
*      (GPR01P,                                                    0462 00017000
*       GPR12P,                                                    0462 00018000
*       GPR13P,                                                    0462 00019000
*       GPR14P) RSTD;                                              0462 00020000
*     GEN(PRINT OFF);                                              0463 00021000
*                                                                  0463 00022000
         PRINT OFF                                                      00023000
*/* ATBUILD (ISTZSAVE)                                               */ 00024000
*/* END OF ATBUILD                                                   */ 00025000
*                                                                  0464 00026000
*     GEN(PRINT ON);                                               0464 00027000
         PRINT ON                                                       00028000
*     RFY                                                          0465 00029000
*       ISTZSAVE BASED(GPR13P);                                    0465 00030000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0466 00031000
         STM   7,12,ZSAZSVVR+0(13)                                      00032000
*     GEN SETS(GPR12P);                                            0467 00033000
         BALR  GPR12P,0                                                 00034000
@TSTART  DS    0H                                                       00035000
         USING @TSTART,GPR12P                                           00036000
*     GEN(PRINT OFF);                                              0468 00037000
*                                                                  0468 00038000
         PRINT OFF                                                      00039000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00040000
*/* END OF ATBUILD                                                   */ 00041000
*                                                                  0469 00042000
*     GEN(PRINT ON);                                               0469 00043000
         PRINT ON                                                       00044000
*     GPR01P->RPHCRR->CRACRR->ZCREICOE='1'B;                       0470 00045000
         L     @11,RPHCRR(,GPR01P)                                 0470 00046000
         L     @11,CRACRR(,@11)                                    0470 00047000
         OI    ZCREICOE(@11),B'00001000'                           0470 00048000
*     ZSAZACTV='1'B;                                               0471 00049000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0471 00050000
*     ZSAZTRAC='ICOE';                                             0472 00051000
         MVC   ZSAZTRAC(4,GPR13P),@CC03757                         0472 00052000
*     ZSAZSVRR=GPR14P;                                             0473 00053000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0473 00054000
*     GPR13P=ZSAZSVFC;                                             0474 00055000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0474 00056000
*     RFY                                                          0475 00057000
*      (GPR01P) UNRSTD;                                            0475 00058000
*     RFY                                                          0476 00059000
*      (GPR14P) UNRSTD;                                            0476 00060000
*   END;                                                           0477 00061000
*                                                                  0477 00062000
*/* END TPZSAVE                                                      */ 00063000
*                                                                  0478 00064000
*   IF ELEMREG=0 THEN               /* IF NO ELEMENT GIVEN   @ZM12128*/ 00065000
         LTR   ELEMREG,ELEMREG                                     0478 00066000
         BNZ   @RF00478                                            0478 00067000
*     CALL ISTZIFIB;                /* PROCESS VTAM ERROR    @ZM12128*/ 00068000
         SLR   @11,@11                                             0479 00069000
         ICM   @11,7,PABDVTA+112(FMCBREG)                          0479 00070000
         L     @15,ZRCZIFIB(,@11)                                  0479 00071000
         BALR  @14,@15                                             0479 00072000
*   ELSE                            /* IF ELEMENT RETURNED   @ZM12128*/ 00073000
*     DO;                           /* PROCESS NORMAL CASE   @ZM12128*/ 00074000
         B     @RC00478                                            0480 00075000
@RF00478 DS    0H                                                  0481 00076000
*       ZCRIF0E1=OFF;               /* INITIALIZE INTERNAL SWITCH    */ 00077000
         L     @11,RPHCRR(,RPHREG)                                 0481 00078000
         L     @11,CRACRR(,@11)                                    0481 00079000
         NI    ZCRIF0E1(@11),B'11110111'                           0481 00080000
*       FSBREG=ADDR(ZIBFSB);        /* SET FSB BASE                  */ 00081000
         LA    FSBREG,ZIBFSB(,BFRREG)                              0482 00082000
*       IF FSBMJRCD=FRLOGICE THEN   /* LOGIC ERROR ?                 */ 00083000
         CLI   FSBMJRCD(FSBREG),X'08'                              0483 00084000
         BNE   @RF00483                                            0483 00085000
*         CALL ISTZIFIB;            /* LOGICAL ERROR RECOVERY        */ 00086000
         SLR   @11,@11                                             0484 00087000
         ICM   @11,7,PABDVTA+112(FMCBREG)                          0484 00088000
         L     @15,ZRCZIFIB(,@11)                                  0484 00089000
         BALR  @14,@15                                             0484 00090000
*       ELSE                        /* NO, NOT LOGIC ERROR           */ 00091000
*         IF FSBMJRCD=FRPHYSC THEN  /* PHYSICAL ERROR?               */ 00092000
         B     @RC00483                                            0485 00093000
@RF00483 CLI   FSBMJRCD(FSBREG),X'0C'                              0485 00094000
         BNE   @RF00485                                            0485 00095000
*           CALL ISTZIFGB;          /* CONTACT ERROR ANALYSIS AND  0486 00096000
*                                      RECOVERY                      */ 00097000
         SLR   @11,@11                                             0486 00098000
         ICM   @11,7,PABDVTA+112(FMCBREG)                          0486 00099000
         L     @15,ZRCZIFGB(,@11)                                  0486 00100000
         BALR  @14,@15                                             0486 00101000
*         ELSE                      /* NOT PHYSICAL ERROR            */ 00102000
*           DO;                     /*                       @XL03HDP*/ 00103000
         B     @RC00485                                            0487 00104000
@RF00485 DS    0H                                                  0488 00105000
*             IF FSBSPHSE=NCPPHSE3 THEN/* PHASE 3 RESPONSE?  @XL03HDP*/ 00106000
         TM    FSBSPHSE(FSBREG),B'01100000'                        0488 00107000
         BNO   @RF00488                                            0488 00108000
*               DNCZRSCH=ON;        /* SET DEVICE RESCHEDABLE      0489 00109000
*                                                            @XL03HDP*/ 00110000
         OI    DNCZRSCH(DNCBREG),B'00000100'                       0489 00111000
*             ELSE                                                 0490 00112000
*               ;                   /* NOT PHASE 3           @XL03HDP*/ 00113000
@RF00488 DS    0H                                                  0491 00114000
*             IF BDUCOMND=BCMDD THEN/* COMND=DISCONNECT?     @XL03HDP*/ 00115000
         CLI   BDUCOMND+62(BFRREG),X'07'                           0491 00116000
         BNE   @RF00491                                            0491 00117000
*               CALL ISTZIFHB;      /* DISCONNECT COMPLETION       0492 00118000
*                                      PROCESSOR             @XL03HDP*/ 00119000
         SLR   @11,@11                                             0492 00120000
         ICM   @11,7,PABDVTA+112(FMCBREG)                          0492 00121000
         L     @15,ZRCZIFHB(,@11)                                  0492 00122000
         BALR  @14,@15                                             0492 00123000
*             ELSE                  /* COMND NOT DISCONNECT  @XL03HDP*/ 00124000
*               IF FSBMJRCD=FRNETP THEN/* NETWORK PROCESSING?        */ 00125000
*                                                                  0493 00126000
         B     @RC00491                                            0493 00127000
@RF00491 CLI   FSBMJRCD(FSBREG),X'80'                              0493 00128000
         BNE   @RF00493                                            0493 00129000
*                 /***************************************************/ 00130000
*                 /*                                                 */ 00131000
*                 /* SEGMENT(IFOE00A)REQUEST                         */ 00132000
*                 /*                                                 */ 00133000
*                 /***************************************************/ 00134000
*                                                                  0494 00135000
*                 DO;                                              0494 00136000
*                   GOTO IFOE00A;                                  0495 00137000
         B     IFOE00A                                             0495 00138000
*IFOE00A#:                                                         0496 00139000
*                 END;              /* YES, PERFORM DEVICE         0496 00140000
*                                      ASSOCIATION                   */ 00141000
*               ELSE                                               0497 00142000
*                                                                  0497 00143000
*                 /***************************************************/ 00144000
*                 /*                                                 */ 00145000
*                 /* SEGMENT(IFOE00B)REQUEST                         */ 00146000
*                 /*                                                 */ 00147000
*                 /***************************************************/ 00148000
*                                                                  0497 00149000
*                 DO;                                              0497 00150000
         B     @RC00493                                            0497 00151000
@RF00493 DS    0H                                                  0498 00152000
*                   GOTO IFOE00B;                                  0498 00153000
         B     IFOE00B                                             0498 00154000
*IFOE00B#:                                                         0499 00155000
*                 END;              /* NO, PROCESS ASSUMING NO ID    */ 00156000
IFOE00B# DS    0H                                                  0500 00157000
*           END;                    /*                       @XL03HDP*/ 00158000
@RC00493 DS    0H                                                  0500 00159000
@RC00491 DS    0H                                                  0501 00160000
*/* TPDEQ (,LCPFDBA)                                                 */ 00161000
*                                                                  0501 00162000
*       DO;                         /* BEGIN TPDEQ CODE GENERATION   */ 00163000
@RC00485 DS    0H                                                  0501 00164000
@RC00483 DS    0H                                                  0502 00165000
*         DCL                                                      0502 00166000
*           FMZCA017 BIT(32) CONSTANT('80000000'X);                0502 00167000
*         DCL                                                      0503 00168000
*           FMZCB017 BIT(32) CONSTANT('7FFFFFFF'X);                0503 00169000
*         RFY                                                      0504 00170000
*          (GPR00P,                                                0504 00171000
*           GPR01P,                                                0504 00172000
*           GPR14P,                                                0504 00173000
*           GPR15P) RSTD;                                          0504 00174000
*         RFY                                                      0505 00175000
*           ISTWKE;                                                0505 00176000
*         GPR15P=ADDR(LCPFDBA);     /* ADDRESS QUEUE POINTER         */ 00177000
         LA    GPR15P,LCPFDBA(,ELEMREG)                            0506 00178000
*         GPR14P=GPR15P->PABWEQA|FMZCA017;                         0507 00179000
         L     @11,@CF00072                                        0507 00180000
         L     GPR14P,PABWEQA(,GPR15P)                             0507 00181000
         OR    GPR14P,@11                                          0507 00182000
*         IF GPR14P=FMZCA017 THEN                                  0508 00183000
         CLR   GPR14P,@11                                          0508 00184000
         BE    @RT00508                                            0508 00185000
*           ;                                                      0509 00186000
*         ELSE                                                     0510 00187000
*           DO;                                                    0510 00188000
*FMZL1017:                                                         0511 00189000
*             ;                                                    0511 00190000
FMZL1017 DS    0H                                                  0512 00191000
*             DO WHILE(GPR14P->WKECHAIN^=FMZCA017);                0512 00192000
         B     @DE00512                                            0512 00193000
@DL00512 DS    0H                                                  0513 00194000
*               GPR15P=ADDR(GPR14P->WKECHAIN);                     0513 00195000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0513 00196000
*               GPR14P=GPR15P->PABWEQA;                            0514 00197000
         L     GPR14P,PABWEQA(,GPR15P)                             0514 00198000
*             END;                                                 0515 00199000
@DE00512 L     @11,@CF00072                                        0515 00200000
         CL    @11,WKECHAIN(,GPR14P)                               0515 00201000
         BNE   @DL00512                                            0515 00202000
*             GPR00P=FMZCA017;                                     0516 00203000
         LR    GPR00P,@11                                          0516 00204000
*             CS(GPR14P,GPR00P,GPR15P->PABWEQA);                   0517 00205000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0517 00206000
*             BC(7,FMZL1017);                                      0518 00207000
         BC    7,FMZL1017                                          0518 00208000
*             GPR14P->WKECHAIN=0;                                  0519 00209000
         SLR   @11,@11                                             0519 00210000
         ST    @11,WKECHAIN(,GPR14P)                               0519 00211000
*           END;                                                   0520 00212000
*ISTA0017:                                                         0521 00213000
*         ;                                                        0521 00214000
@RT00508 DS    0H                                                  0521 00215000
ISTA0017 DS    0H                                                  0522 00216000
*         GPR14P=GPR14P&FMZCB017;                                  0522 00217000
         N     GPR14P,@CF00070                                     0522 00218000
*         GPR01P->RPHWEA=GPR14P;                                   0523 00219000
         ST    GPR14P,RPHWEA(,GPR01P)                              0523 00220000
*         RFY                                                      0524 00221000
*          (GPR00P,                                                0524 00222000
*           GPR01P,                                                0524 00223000
*           GPR14P,                                                0524 00224000
*           GPR15P) UNRSTD;                                        0524 00225000
*       END;                        /* END TPDEQ GENERATION DEQUEUE     00226000
*                                      FSB FROM LCPB WAITQ ELEMENT   */ 00227000
*       IF ZCRIF0E1=ON THEN                                        0526 00228000
         L     @11,RPHCRR(,RPHREG)                                 0526 00229000
         L     @11,CRACRR(,@11)                                    0526 00230000
         TM    ZCRIF0E1(@11),B'00001000'                           0526 00231000
         BNO   @RF00526                                            0526 00232000
*         DO;                                                      0527 00233000
*           ZCRPCOD1='00'X;         /* CLEAR FLAGS                   */ 00234000
         MVI   ZCRPCOD1(@11),X'00'                                 0528 00235000
*           ZCRPBUF=ON;             /* INDICATE DEALLOCATION OF ZIB  */ 00236000
         OI    ZCRPBUF(@11),B'00000100'                            0529 00237000
*           ELEMREG=BFRREG;         /* BFR ADDR FOR DEALLOC   @X03DHP*/ 00238000
         LR    ELEMREG,BFRREG                                      0530 00239000
*           CALL ISTZDFB0;          /* RELEASE INBOUND BUFFER (ZIB)  */ 00240000
         L     @11,ATCZPSVT(,CVTREG)                               0531 00241000
         L     @15,ZPSZDFB0(,@11)                                  0531 00242000
         BALR  @14,@15                                             0531 00243000
*           RCREG=ZCREXIT;          /* RETURN CODE = CHECK TIP FOR 0532 00244000
*                                      MORE FSBS             @XL03HEK*/ 00245000
         LA    RCREG,20                                            0532 00246000
*         END;                                                     0533 00247000
*       ELSE                        /* ZCR FLAG NOT ON               */ 00248000
*         DO;                                                      0534 00249000
*                                                                  0534 00250000
         B     @RC00526                                            0534 00251000
@RF00526 DS    0H                                                  0535 00252000
*           /*********************************************************/ 00253000
*           /*                                                       */ 00254000
*           /* SEGMENT(IFOE00C)REQUEST                               */ 00255000
*           /*                                                       */ 00256000
*           /*********************************************************/ 00257000
*                                                                  0535 00258000
*           DO;                                                    0535 00259000
*             GOTO IFOE00C;                                        0536 00260000
         B     IFOE00C                                             0536 00261000
*IFOE00C#:                                                         0537 00262000
*           END;                    /* INIT FSB AND Q TO CLIP      0537 00263000
*                                                            @XL03HEK*/ 00264000
*                                                                  0537 00265000
IFOE00C# DS    0H                                                  0538 00266000
*           /*********************************************************/ 00267000
*           /*                                                       */ 00268000
*           /* SEGMENT(IFOE00D)REQUEST                               */ 00269000
*           /*                                                       */ 00270000
*           /*********************************************************/ 00271000
*                                                                  0538 00272000
*           DO;                                                    0538 00273000
*             GOTO IFOE00D;                                        0539 00274000
         B     IFOE00D                                             0539 00275000
*IFOE00D#:                                                         0540 00276000
*           END;                    /* DEQUEUE WAITQ ELEMENT @XL03HEK*/ 00277000
IFOE00D# DS    0H                                                  0541 00278000
*           IF FMCZH001=FMCZHF61|   /* DID LOGICAL OR        @XL03HDP*/ 00279000
*               FMCZH001=FMCZHF71 THEN/* PHYSICAL ERROR OCCUR ?    0541 00280000
*                                                            @XL03HDP*/ 00281000
         CLC   FMCZH001(2,FMCBREG),@CH02928                        0541 00282000
         BE    @RT00541                                            0541 00283000
         CLC   FMCZH001(2,FMCBREG),@CH02930                        0541 00284000
         BE    @RT00541                                            0541 00285000
*             ;                     /* YES                           */ 00286000
*           ELSE                    /* NO PHYS OR LOGCL ERROR      0543 00287000
*                                                            @XL03HEK*/ 00288000
*             DNCZRSCH=ON;          /* MARK DEVICE RE-SHED   @XL03HDP*/ 00289000
         OI    DNCZRSCH(DNCBREG),B'00000100'                       0543 00290000
*           RCREG=ZCRSRCHQ;         /* RETURN CODE = SEARCH WAITQ AND   00291000
*                                      SCHED TOP             @XL03HEK*/ 00292000
@RT00541 LA    RCREG,16                                            0544 00293000
*         END;                                                     0545 00294000
*     END;                          /* END ELEMENT RETURNED  @ZM12128*/ 00295000
@RC00526 DS    0H                                                  0547 00296000
*/* TPZRETN                                                          */ 00297000
*                                                                  0547 00298000
*   DO;                                                            0547 00299000
@RC00478 DS    0H                                                  0548 00300000
*     RFY                                                          0548 00301000
*      (GPR07P,                                                    0548 00302000
*       GPR14P,                                                    0548 00303000
*       GPR15P) RSTD;                                              0548 00304000
*     GPR13P=ZSAZSVBC;                                             0549 00305000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0549 00306000
*     IF GPR13P=0 THEN                                             0550 00307000
         LTR   GPR13P,GPR13P                                       0550 00308000
         BZ    @RT00550                                            0550 00309000
*       ;                           /* TPDVTS ISTZFARR               */ 00310000
*     ELSE                                                         0552 00311000
*       GPR14P=ZSAZSVRR;                                           0552 00312000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0552 00313000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0553 00314000
@RT00550 DS    0H                                                  0553 00315000
         LM    7,12,ZSAZSVVR+0(13)                                      00316000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0554 00317000
         BR    GPR14P                                                   00318000
*     RFY                                                          0555 00319000
*      (GPR07P,                                                    0555 00320000
*       GPR14P,                                                    0555 00321000
*       GPR15P) UNRSTD;                                            0555 00322000
*   END;                                                           0556 00323000
*                                                                  0556 00324000
*/* END TPZRETN                                                      */ 00325000
*                                                                  0557 00326000
         EJECT                                                          00327000
*                                                                  0557 00328000
*/********************************************************************/ 00329000
*/*                                                                  */ 00330000
*/* SEGMENT-                                                         */ 00331000
*/*      IFOE00A                                                     */ 00332000
*/*                                                                  */ 00333000
*/* FUNCTION-                                                        */ 00334000
*/*      ASSOCIATE TERMINAL WITH PORT.                               */ 00335000
*/*                                                                  */ 00336000
*/********************************************************************/ 00337000
*                                                                  0557 00338000
*   /*****************************************************************/ 00339000
*   /*                                                               */ 00340000
*   /* SEGMENT(IFOE00A)START                                         */ 00341000
*   /*                                                               */ 00342000
*   /*****************************************************************/ 00343000
*                                                                  0557 00344000
*   DO;                                                            0557 00345000
*     GOTO IFOE00A@;                                               0558 00346000
*IFOE00A:                                                          0559 00347000
*   END;                                                           0559 00348000
IFOE00A  DS    0H                                                  0560 00349000
*   WORKREG1=NCBRDTE;               /* GET RDTE ADDRESS      @XL03HDP*/ 00350000
         L     WORKREG1,NCBRDTE(,DNCBREG)                          0560 00351000
*   WORKREG2=RPTDITT;               /* ADDRESS DITT TABLE            */ 00352000
         L     WORKREG2,RPTDITT(,WORKREG1)                         0561 00353000
*   IF WORKREG2=0 THEN              /* IS THERE A DITT TABLE ?       */ 00354000
         LTR   WORKREG2,WORKREG2                                   0562 00355000
         BNZ   @RF00562                                            0562 00356000
*     ZCRIF0E2=ON;                  /* NO, SET SWITCH FOR NO DITT    */ 00357000
         L     @11,RPHCRR(,RPHREG)                                 0563 00358000
         L     @11,CRACRR(,@11)                                    0563 00359000
         OI    ZCRIF0E2(@11),B'00000100'                           0563 00360000
*   ELSE                            /* YES, THERE IS A DITT          */ 00361000
*     DO;                                                          0564 00362000
         B     @RC00562                                            0564 00363000
@RF00562 DS    0H                                                  0565 00364000
*       ZCRIF0E3=ON;                /* SET LOOP SWITCH               */ 00365000
*       ZCRIF0E2=OFF;               /* INITIALIZE SEARCH RESULT      */ 00366000
         L     @11,RPHCRR(,RPHREG)                                 0566 00367000
         L     @11,CRACRR(,@11)                                    0566 00368000
         OI    ZCRIF0E3(@11),B'00000010'                           0566 00369000
         NI    ZCRIF0E2(@11),B'11111011'                           0566 00370000
*       DO WHILE ZCRIF0E3=ON;                                      0567 00371000
         B     @DE00567                                            0567 00372000
@DL00567 DS    0H                                                  0568 00373000
*         ZCRIF0E3=OFF;             /* SET DFAULT LOOP EXIT          */ 00374000
         L     @11,RPHCRR(,RPHREG)                                 0568 00375000
         L     @11,CRACRR(,@11)                                    0568 00376000
         NI    ZCRIF0E3(@11),B'11111101'                           0568 00377000
*         IF DTELCTI=BTUTEXT(1:1) THEN/* SEARCH FOR MATCH ON DEVICE  */ 00378000
         CLC   DTELCTI(1,WORKREG2),BTUTEXT+48(BFRREG)              0569 00379000
         BNE   @RF00569                                            0569 00380000
*           IF DTERDTEA=0 THEN      /* IS THERE AN ASSOCIATED RDTE ? */ 00381000
         ICM   @00,15,DTERDTEA(WORKREG2)                           0570 00382000
         BNZ   @RF00570                                            0570 00383000
*             ZCRIF0E2=ON;          /* NO, SET SEARCH FAILURE FLAG   */ 00384000
         OI    ZCRIF0E2(@11),B'00000100'                           0571 00385000
*           ELSE                    /* YES, SET ASSOCIATED TERMINAL     00386000
*                                      ENTRY IN PORT RDTE            */ 00387000
*             RPTATERM=DTERDTEA;                                   0572 00388000
         B     @RC00570                                            0572 00389000
@RF00570 MVC   RPTATERM(4,WORKREG1),DTERDTEA(WORKREG2)             0572 00390000
*         ELSE                                                     0573 00391000
*           IF DTELCTI=DITTEND THEN /* IF END OF TABLE REACHED       */ 00392000
         B     @RC00569                                            0573 00393000
@RF00569 CLI   DTELCTI(WORKREG2),X'FF'                             0573 00394000
         BNE   @RF00573                                            0573 00395000
*             ZCRIF0E2=ON;          /* SET SEARCH FAILURE FLAG       */ 00396000
         L     @11,RPHCRR(,RPHREG)                                 0574 00397000
         L     @11,CRACRR(,@11)                                    0574 00398000
         OI    ZCRIF0E2(@11),B'00000100'                           0574 00399000
*           ELSE                    /* NOT END OF TABLE              */ 00400000
*             DO;                                                  0575 00401000
         B     @RC00573                                            0575 00402000
@RF00573 DS    0H                                                  0576 00403000
*               WORKREG2=WORKREG2+LENGTH(ISTDTE);/* ADDRESS NEXT DITT   00404000
*                                      ENTRY                         */ 00405000
         AH    WORKREG2,@CH00529                                   0576 00406000
*               ZCRIF0E3=ON;        /* CONTINUE TO LOOP              */ 00407000
         L     @11,RPHCRR(,RPHREG)                                 0577 00408000
         L     @11,CRACRR(,@11)                                    0577 00409000
         OI    ZCRIF0E3(@11),B'00000010'                           0577 00410000
*             END;                                                 0578 00411000
*       END;                        /* END OF DO WHILE               */ 00412000
@RC00573 DS    0H                                                  0579 00413000
@RC00569 DS    0H                                                  0579 00414000
@DE00567 L     @11,RPHCRR(,RPHREG)                                 0579 00415000
         L     @11,CRACRR(,@11)                                    0579 00416000
         TM    ZCRIF0E3(@11),B'00000010'                           0579 00417000
         BO    @DL00567                                            0579 00418000
*     END;                                                         0580 00419000
*   IF ZCRIF0E2=ON THEN             /* WAS SEARCH SUCCESSFUL ?       */ 00420000
@RC00562 L     @11,RPHCRR(,RPHREG)                                 0581 00421000
         L     @11,CRACRR(,@11)                                    0581 00422000
         TM    ZCRIF0E2(@11),B'00000100'                           0581 00423000
         BNO   @RF00581                                            0581 00424000
*     IF RPTUTERM=0 THEN            /* NO, ANY UNIDENTIFIED TERMINAL?*/ 00425000
         ICM   @00,15,RPTUTERM(WORKREG1)                           0582 00426000
         BZ    @RT00582                                            0582 00427000
*       ;                           /* NO, EXIT                      */ 00428000
*     ELSE                          /* YES, UNIDENTIFIED TERMINAL    */ 00429000
*       DO;                                                        0584 00430000
*         RPTATERM=RPTUTERM;        /* SET ASSOCIATED TERMINAL ENTRY    00431000
*                                      IN PORT RDTE TO UTERM ENTRY   */ 00432000
         L     @11,RPTUTERM(,WORKREG1)                             0585 00433000
         ST    @11,RPTATERM(,WORKREG1)                             0585 00434000
*         RPTUTERM->RTRLCTI=BTUTEXT(1:1);/* MOVE TERMINAL TYPE TO  0586 00435000
*                                      UTERM ENTRY                   */ 00436000
         MVC   RTRLCTI(1,@11),BTUTEXT+48(BFRREG)                   0586 00437000
*       END;                                                       0587 00438000
*   ZCRIF0E1=ON;                    /* SET OUTPUT SWITCH FOR DRIVER  */ 00439000
*                                                                  0588 00440000
@RT00582 DS    0H                                                  0588 00441000
@RF00581 L     @11,RPHCRR(,RPHREG)                                 0588 00442000
         L     @11,CRACRR(,@11)                                    0588 00443000
         OI    ZCRIF0E1(@11),B'00001000'                           0588 00444000
*   /*****************************************************************/ 00445000
*   /*                                                               */ 00446000
*   /* SEGMENT(IFOE00A)FINISH                                        */ 00447000
*   /*                                                               */ 00448000
*   /*****************************************************************/ 00449000
*                                                                  0589 00450000
*   DO;                                                            0589 00451000
*     GOTO IFOE00A#;                                               0590 00452000
         B     IFOE00A#                                            0590 00453000
*IFOE00A@:                                                         0591 00454000
*   END;                                                           0591 00455000
IFOE00A@ DS    0H                                                  0592 00456000
         EJECT                                                          00457000
*                                                                  0592 00458000
*/********************************************************************/ 00459000
*/*                                                                  */ 00460000
*/* SEGMENT-                                                         */ 00461000
*/*      IFOE00B                                                     */ 00462000
*/*                                                                  */ 00463000
*/* FUNCTION-                                                        */ 00464000
*/*      TAKE PORTSOL OUT OF SESSION, AND PUT THE APPLICATION        */ 00465000
*/*      IN SESSION WITH THE TERMINAL.                               */ 00466000
*/*                                                                  */ 00467000
*/********************************************************************/ 00468000
*                                                                  0592 00469000
*   /*****************************************************************/ 00470000
*   /*                                                               */ 00471000
*   /* SEGMENT(IFOE00B)START                                         */ 00472000
*   /*                                                               */ 00473000
*   /*****************************************************************/ 00474000
*                                                                  0592 00475000
*   DO;                                                            0592 00476000
*     GOTO IFOE00B@;                                               0593 00477000
         B     IFOE00B@                                            0593 00478000
*IFOE00B:                                                          0594 00479000
*   END;                                                           0594 00480000
IFOE00B  DS    0H                                                  0595 00481000
*   DNCSESS=ON;                     /* SET NCP SESSION FLAG  @XM8859K*/ 00482000
         OI    DNCSESS(DNCBREG),B'01000000'                        0595 00483000
*   FMCZFC06=OFF;                   /* TURN OFF CONTACT OUTSTANDING     00484000
*                                      FLAG                  @XL03HDP*/ 00485000
         NI    FMCZFC06(FMCBREG),B'11111110'                       0596 00486000
*   DNCCONT=OFF;                    /* TURN OFF CONTACT OUTSTANDING     00487000
*                                      FLAG                  @XL03HEK*/ 00488000
         NI    DNCCONT(DNCBREG),B'11101111'                        0597 00489000
*   FMCZX001=FMCZX001-1;            /* DECR SESSION COUNT    @XL03HDP*/ 00490000
         SLR   @00,@00                                             0598 00491000
         IC    @00,FMCZX001(,FMCBREG)                              0598 00492000
         BCTR  @00,0                                               0598 00493000
         STC   @00,FMCZX001(,FMCBREG)                              0598 00494000
*   CALL ISTZCF2B;                  /* DIALOG SCHEDULER INBOUND - 2  */ 00495000
         SLR   @11,@11                                             0599 00496000
         ICM   @11,7,PABDVTA+112(FMCBREG)                          0599 00497000
         L     @15,ZRCZCFCI(,@11)                                  0599 00498000
         BALR  @14,@15                                             0599 00499000
*   WORKREG1=NCBRDTE;               /* ADDRESS PORT RDTE     @XL03HDP*/ 00500000
         L     WORKREG1,NCBRDTE(,DNCBREG)                          0600 00501000
*   IF RPTATERM=0 THEN              /* IS THERE A TERMINAL ADDRESS?  */ 00502000
         SLR   @11,@11                                             0601 00503000
         C     @11,RPTATERM(,WORKREG1)                             0601 00504000
         BNE   @RF00601                                            0601 00505000
*     IF RPTUTERM=0 THEN            /* NO, IS THERE AN UNIDENTIFIED     00506000
*                                      TERMINAL ENTRY?               */ 00507000
         C     @11,RPTUTERM(,WORKREG1)                             0602 00508000
         BNE   @RF00602                                            0602 00509000
*       DO;                         /* NO                            */ 00510000
*         FSBMNRCD=FRMNUTRM;        /* RC= RESOLUTION IMPOSSIBLE     */ 00511000
         MVI   FSBMNRCD(FSBREG),X'94'                              0604 00512000
*         FMCZH001=FMCZHF61;        /* LINE STATE= LOGIC ERROR       */ 00513000
         MVC   FMCZH001(2,FMCBREG),@CH02928                        0605 00514000
*         ADDR(FMCPAB3)->PABERLOK=ON;/* SET ON TOP ERROR LOCK        */ 00515000
         OI    PABERLOK+96(FMCBREG),B'00000100'                    0606 00516000
*       END;                                                       0607 00517000
*     ELSE                          /* YES, THERE IS AN UNIDENTIFIED    00518000
*                                      TERMINAL                      */ 00519000
*       DO;                                                        0608 00520000
         B     @RC00602                                            0608 00521000
@RF00602 DS    0H                                                  0609 00522000
*         RPTATERM=RPTUTERM;        /* TERMINAL ENTRY IN PORT RDTE   */ 00523000
         L     @11,RPTUTERM(,WORKREG1)                             0609 00524000
         ST    @11,RPTATERM(,WORKREG1)                             0609 00525000
*         RPTUTERM->RTRLCTI=BTUTEXT(1:1);/* SET TERMINAL TYPE INTO 0610 00526000
*                                      ATERM RDTE                    */ 00527000
         MVC   RTRLCTI(1,@11),BTUTEXT+48(BFRREG)                   0610 00528000
*         FSBMNRCD=FRMMTABS;        /* INDICATE MTA VERIFICATION DONE   00529000
*                                      IN 370X                       */ 00530000
         MVI   FSBMNRCD(FSBREG),X'18'                              0611 00531000
*       END;                                                       0612 00532000
*   ELSE                            /* YES, THERE IS A TERMINAL PTR     00533000
*                                      IN THE PORT RDTE              */ 00534000
*     FSBMNRCD=FRMMTABS;            /* INDICATE MTA VERIFICATION DONE   00535000
*                                      IN 370X                       */ 00536000
         B     @RC00601                                            0613 00537000
@RF00601 MVI   FSBMNRCD(FSBREG),X'18'                              0613 00538000
*   FSBECI=ON;                      /* FLAG AS LAST FSB FOR LCCW     */ 00539000
@RC00601 DS    0H                                                  0615 00540000
*   FSBELI=ON;                      /* FLAG AS LAST FSB FOR LCPB     */ 00541000
         OI    FSBECI(FSBREG),B'11000000'                          0615 00542000
*   FSBMJRCD=FRNETP;                /* RC= NETWORK PROCESSING        */ 00543000
*                                                                  0616 00544000
         MVI   FSBMJRCD(FSBREG),X'80'                              0616 00545000
*   /*****************************************************************/ 00546000
*   /*                                                               */ 00547000
*   /* SEGMENT(IFOE00B)FINISH                                        */ 00548000
*   /*                                                               */ 00549000
*   /*****************************************************************/ 00550000
*                                                                  0617 00551000
*   DO;                                                            0617 00552000
*     GOTO IFOE00B#;                                               0618 00553000
         B     IFOE00B#                                            0618 00554000
*IFOE00B@:                                                         0619 00555000
*   END;                                                           0619 00556000
IFOE00B@ DS    0H                                                  0620 00557000
         EJECT                                                          00558000
*                                                                  0620 00559000
*/********************************************************************/ 00560000
*/*                                                                  */ 00561000
*/* SEGMENT-                                                         */ 00562000
*/*      IFOE00C                                                     */ 00563000
*/*                                                                  */ 00564000
*/* FUNCTION-                                                        */ 00565000
*/*      COMPLETE THE FSB, AND QUEUE IT TO THE CLIP.                 */ 00566000
*/*                                                                  */ 00567000
*/********************************************************************/ 00568000
*                                                                  0620 00569000
*   /*****************************************************************/ 00570000
*   /*                                                               */ 00571000
*   /* SEGMENT(IFOE00C)START                                         */ 00572000
*   /*                                                               */ 00573000
*   /*****************************************************************/ 00574000
*                                                                  0620 00575000
*   DO;                                                            0620 00576000
*     GOTO IFOE00C@;                                               0621 00577000
         B     IFOE00C@                                            0621 00578000
*IFOE00C:                                                          0622 00579000
*   END;                                                           0622 00580000
IFOE00C  DS    0H                                                  0623 00581000
*   IF LSCTYPE=LSTYPE THEN          /* WAITQ ELEMENT AN LSCB?        */ 00582000
         CLI   LSCTYPE(ELEMREG),X'DF'                              0623 00583000
         BNE   @RF00623                                            0623 00584000
*     FSBLCPB=LSCLCPBA;             /* YES, SET FSB LCPB PTR FROM  0624 00585000
*                                      LSCB                          */ 00586000
         MVC   FSBLCPB(4,FSBREG),LSCLCPBA(ELEMREG)                 0624 00587000
*   ELSE                            /* NOT AN LSCB                   */ 00588000
*     FSBLCPB=ELEMREG;              /* SET FSB LCPB PTR DIRECTLY     */ 00589000
         B     @RC00623                                            0625 00590000
@RF00623 ST    ELEMREG,FSBLCPB(,FSBREG)                            0625 00591000
*   FSBLCCWA=LSCLCCWA;              /* LCCW ADDRESS IN FSB           */ 00592000
@RC00623 MVC   FSBLCCWA(4,FSBREG),LSCLCCWA(ELEMREG)                0626 00593000
*   FSBSAF=FMCSAF;                  /* SAF IN FSB                    */ 00594000
         MVC   FSBSAF(2,FSBREG),FMCSAF(FMCBREG)                    0627 00595000
*   FSBDAF=BTUDEST;                 /* DAF IN FSB                    */ 00596000
         LA    @11,48                                              0628 00597000
         ALR   @11,BFRREG                                          0628 00598000
         MVC   FSBDAF(2,FSBREG),BTUDEST(@11)                       0628 00599000
*   ZIBFDBS=ZIBFDBZ;                /* MOVE TPIOS FDB TO SYSTEM FDB  */ 00600000
         MVC   ZIBFDBS(12,BFRREG),ZIBFDBZ(BFRREG)                  0629 00601000
*   FDBOFSET=ADDR(ZIBFDBS)-BFRREG;  /* SET SYSTEM FDB OFFSET         */ 00602000
         LA    @00,ZIBFDBS(,BFRREG)                                0630 00603000
         SLR   @00,BFRREG                                          0630 00604000
         STH   @00,FDBOFSET(,@11)                                  0630 00605000
*/*  TPQUE (FSBREG,FMCPAB2) NORM                                     */ 00606000
*                                                                  0631 00607000
*   DO;                                                            0631 00608000
*     RFY                                                          0632 00609000
*      (GPR00P,                                                    0632 00610000
*       GPR01P,                                                    0632 00611000
*       GPR04P,                                                    0632 00612000
*       GPR05P,                                                    0632 00613000
*       GPR15P) RSTD;                                              0632 00614000
*     GEN REFS(GPR01P) SETS(RPHWORK)(STM GPR02P,GPR08P,RPHWORK(GPR01P)) 00615000
*         ;                                                        0633 00616000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00617000
*     GPR00P=0;                                                    0634 00618000
         SLR   GPR00P,GPR00P                                       0634 00619000
*     GPR15P=ADDR(FMCPAB2);         /* HOLD PAB PTR                  */ 00620000
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0635 00621000
*     GPR04P=FSBREG;                /* WORK ELE PTR                  */ 00622000
         LR    GPR04P,FSBREG                                       0636 00623000
*     GPR05P=GPR15P;                /* PASS PAB PTR                  */ 00624000
         LR    GPR05P,GPR15P                                       0637 00625000
*     CALL ATCLCPTR->ATCAP37->ISTAPC37;                            0638 00626000
         L     @11,ATCLCPTR                                        0638 00627000
         L     @15,ATCAP37(,@11)                                   0638 00628000
         BALR  @14,@15                                             0638 00629000
*     GEN(NOPR  0)                                                 0639 00630000
*     NOSETS NOREFS;                                               0639 00631000
         NOPR  0                                                        00632000
*     RFY                                                          0640 00633000
*      (GPR00P,                                                    0640 00634000
*       GPR01P,                                                    0640 00635000
*       GPR04P,                                                    0640 00636000
*       GPR05P,                                                    0640 00637000
*       GPR15P) UNRSTD;                                            0640 00638000
*   END;                            /* *** END OF TPQUE GENERATION 0641 00639000
*                                      QUEUE THE FSB TO THE CLIP     */ 00640000
*                                                                  0641 00641000
*   /*****************************************************************/ 00642000
*   /*                                                               */ 00643000
*   /* SEGMENT(IFOE00C)FINISH                                        */ 00644000
*   /*                                                               */ 00645000
*   /*****************************************************************/ 00646000
*                                                                  0642 00647000
*   DO;                                                            0642 00648000
*     GOTO IFOE00C#;                                               0643 00649000
         B     IFOE00C#                                            0643 00650000
*IFOE00C@:                                                         0644 00651000
*   END;                                                           0644 00652000
IFOE00C@ DS    0H                                                  0645 00653000
         EJECT                                                          00654000
*                                                                  0645 00655000
*/********************************************************************/ 00656000
*/*                                                                  */ 00657000
*/* SEGMENT-                                                         */ 00658000
*/*      IFOE00D                                                     */ 00659000
*/*                                                                  */ 00660000
*/* FUNCTION-                                                        */ 00661000
*/*      DEQUEUE THE LCPB FROM THE FMCB WAIT QUEUE.                  */ 00662000
*/*                                                                  */ 00663000
*/********************************************************************/ 00664000
*                                                                  0645 00665000
*   /*****************************************************************/ 00666000
*   /*                                                               */ 00667000
*   /* SEGMENT(IFOE00D)START                                         */ 00668000
*   /*                                                               */ 00669000
*   /*****************************************************************/ 00670000
*                                                                  0645 00671000
*   DO;                                                            0645 00672000
*     GOTO IFOE00D@;                                               0646 00673000
         B     IFOE00D@                                            0646 00674000
*IFOE00D:                                                          0647 00675000
*   END;                                                           0647 00676000
IFOE00D  DS    0H                                                  0648 00677000
*   DNCACIP=DNCACIP-1;              /* DECREMENT REQUEST COUNT       */ 00678000
         SLR   @00,@00                                             0648 00679000
         IC    @00,DNCACIP(,DNCBREG)                               0648 00680000
         BCTR  @00,0                                               0648 00681000
         STC   @00,DNCACIP(,DNCBREG)                               0648 00682000
*/* TPDEQ (,FMCLCPBQ)                                                */ 00683000
*                                                                  0649 00684000
*   DO;                             /* BEGIN TPDEQ CODE GENERATION   */ 00685000
*     RFY                                                          0650 00686000
*      (GPR00P,                                                    0650 00687000
*       GPR01P,                                                    0650 00688000
*       GPR14P,                                                    0650 00689000
*       GPR15P) RSTD;                                              0650 00690000
*     GPR15P=ADDR(FMCLCPBQ);        /* ADDRESS QUEUE POINTER         */ 00691000
         LA    GPR15P,FMCLCPBQ(,FMCBREG)                           0651 00692000
*     GPR14P=GPR15P->PABWEQA|FMZCA017;                             0652 00693000
         L     @11,@CF00072                                        0652 00694000
         L     GPR14P,PABWEQA(,GPR15P)                             0652 00695000
         OR    GPR14P,@11                                          0652 00696000
*     IF GPR14P=FMZCA017 THEN                                      0653 00697000
         CLR   GPR14P,@11                                          0653 00698000
         BE    @RT00653                                            0653 00699000
*       ;                                                          0654 00700000
*     ELSE                                                         0655 00701000
*       DO;                                                        0655 00702000
*FMZL1039:                                                         0656 00703000
*         ;                                                        0656 00704000
FMZL1039 DS    0H                                                  0657 00705000
*         DO WHILE(GPR14P->WKECHAIN^=FMZCA017);                    0657 00706000
         B     @DE00657                                            0657 00707000
@DL00657 DS    0H                                                  0658 00708000
*           GPR15P=ADDR(GPR14P->WKECHAIN);                         0658 00709000
         LA    GPR15P,WKECHAIN(,GPR14P)                            0658 00710000
*           GPR14P=GPR15P->PABWEQA;                                0659 00711000
         L     GPR14P,PABWEQA(,GPR15P)                             0659 00712000
*         END;                                                     0660 00713000
@DE00657 L     @11,@CF00072                                        0660 00714000
         CL    @11,WKECHAIN(,GPR14P)                               0660 00715000
         BNE   @DL00657                                            0660 00716000
*         GPR00P=FMZCA017;                                         0661 00717000
         LR    GPR00P,@11                                          0661 00718000
*         CS(GPR14P,GPR00P,GPR15P->PABWEQA);                       0662 00719000
         CS    GPR14P,@00,PABWEQA(GPR15P)                          0662 00720000
*         BC(7,FMZL1039);                                          0663 00721000
         BC    7,FMZL1039                                          0663 00722000
*         GPR14P->WKECHAIN=0;                                      0664 00723000
         SLR   @11,@11                                             0664 00724000
         ST    @11,WKECHAIN(,GPR14P)                               0664 00725000
*       END;                                                       0665 00726000
*ISTA0039:                                                         0666 00727000
*     ;                                                            0666 00728000
@RT00653 DS    0H                                                  0666 00729000
ISTA0039 DS    0H                                                  0667 00730000
*     GPR14P=GPR14P&FMZCB017;                                      0667 00731000
         N     GPR14P,@CF00070                                     0667 00732000
*     GPR01P->RPHWEA=GPR14P;                                       0668 00733000
         ST    GPR14P,RPHWEA(,GPR01P)                              0668 00734000
*     RFY                                                          0669 00735000
*      (GPR00P,                                                    0669 00736000
*       GPR01P,                                                    0669 00737000
*       GPR14P,                                                    0669 00738000
*       GPR15P) UNRSTD;                                            0669 00739000
*   END;                            /* END TPDEQ GENERATION DEQUEUE     00740000
*                                      THE LCPB FROM THE FMCB WAIT 0670 00741000
*                                      QUEUE                         */ 00742000
*   IF LSCTYPE=LSTYPE THEN          /* WAITQ ELEMENT AN LSCB?        */ 00743000
         CLI   LSCTYPE(ELEMREG),X'DF'                              0671 00744000
         BNE   @RF00671                                            0671 00745000
*     DO;                           /* YES                           */ 00746000
*       ZCRPCOD1='00'X;             /* CLEAR PARAMETER FLAGS         */ 00747000
         L     @11,RPHCRR(,RPHREG)                                 0673 00748000
         L     @11,CRACRR(,@11)                                    0673 00749000
         MVI   ZCRPCOD1(@11),X'00'                                 0673 00750000
*       ZCRPLSCB=ON;                /* SET FLAG ON FOR LSCB DEALLOC  */ 00751000
         OI    ZCRPLSCB(@11),B'00001000'                           0674 00752000
*       CALL ISTZDFB0;              /* LSCB DEALLOCATION             */ 00753000
         L     @11,ATCZPSVT(,CVTREG)                               0675 00754000
         L     @15,ZPSZDFB0(,@11)                                  0675 00755000
         BALR  @14,@15                                             0675 00756000
*       ELEMREG=0;                  /* CLEAR FORMER LSCB POINTER     */ 00757000
         SLR   ELEMREG,ELEMREG                                     0676 00758000
*     END;                                                         0677 00759000
*   ELSE                                                           0678 00760000
*     ;                             /* WAITQ ELEMENT NOT AN LSCB     */ 00761000
*                                                                  0678 00762000
@RF00671 DS    0H                                                  0679 00763000
*   /*****************************************************************/ 00764000
*   /*                                                               */ 00765000
*   /* SEGMENT(IFOE00D)FINISH                                        */ 00766000
*   /*                                                               */ 00767000
*   /*****************************************************************/ 00768000
*                                                                  0679 00769000
*   DO;                                                            0679 00770000
*     GOTO IFOE00D#;                                               0680 00771000
         B     IFOE00D#                                            0680 00772000
*IFOE00D@:                                                         0681 00773000
*   END;                                                           0681 00774000
*                                                                  0681 00775000
IFOE00D@ DS    0H                                                  0682 00776000
*/* TPEPILOG                                                         */ 00777000
*                                                                  0682 00778000
*   GEN(PRINT OFF);                                                0682 00779000
         PRINT OFF                                                      00780000
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0683 00781000
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0683 00782000
*        2  * CHAR(4),                 /* SPACE                       * 00783000
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               * 00784000
*           3 WKEFLAGS BIT(8),         /* FLAGS                       * 00785000
*             4 WKEGATE  BIT(1),       /* GATE BIT                    * 00786000
*             4 *        BIT(7),       /* RESERVED                    * 00787000
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 * 00788000
*   DCL                                                            0684 00789000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 00790000
*   DCL                                                            0685 00791000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 00792000
*   GEN(PRINT ON);                                                 0686 00793000
*                                                                  0686 00794000
         PRINT ON                                                       00795000
*/* END OF TPEPILOG                                                  */ 00796000
*                                                                  0687 00797000
*   END ISTZIFOE;                                                  0687 00798000
@EL00001 DS    0H                                                  0687 00799000
@EF00001 DS    0H                                                  0687 00800000
@ER00001 BR    @14                                                 0687 00801000
@DATA    DS    0H                                                       00802000
@CH00529 DC    H'5'                                                     00803000
@CH02928 DC    XL2'9007'                                                00804000
@CH02930 DC    XL2'A007'                                                00805000
@DATD    DSECT                                                          00806000
         DS    0F                                                       00807000
ISTZIFOE CSECT                                                          00808000
         DS    0F                                                       00809000
@CF00070 DC    XL4'7FFFFFFF'                                            00810000
@CF00072 DC    XL4'80000000'                                            00811000
@DATD    DSECT                                                          00812000
         DS    0D                                                       00813000
LCPBPTR  DS    A                                                        00814000
DNCBPTR  DS    A                                                        00815000
BDUPTR   DS    A                                                        00816000
BTUPTR   DS    A                                                        00817000
FSBPTR   DS    A                                                        00818000
FMCBPTR  DS    A                                                        00819000
WKEPTR   DS    A                                                        00820000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00821000
@ENDDATD EQU   *                                                        00822000
ISTZIFOE CSECT                                                          00823000
         DS    0F                                                       00824000
@SIZDATD DC    AL1(0)                                                   00825000
         DC    AL3(@ENDDATD-@DATD)                                      00826000
         DS    0D                                                       00827000
@CC03757 DC    C'ICOE'                                                  00828000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00829000
@01      EQU   01                                                       00830000
@02      EQU   02                                                       00831000
@03      EQU   03                                                       00832000
@04      EQU   04                                                       00833000
@05      EQU   05                                                       00834000
@06      EQU   06                                                       00835000
@07      EQU   07                                                       00836000
@08      EQU   08                                                       00837000
@09      EQU   09                                                       00838000
@10      EQU   10                                                       00839000
@11      EQU   11                                                       00840000
@12      EQU   12                                                       00841000
@13      EQU   13                                                       00842000
@14      EQU   14                                                       00843000
@15      EQU   15                                                       00844000
RPHPTR   EQU   @01                                                      00845000
GPR00P   EQU   @00                                                      00846000
GPR01P   EQU   @01                                                      00847000
GPR04P   EQU   @04                                                      00848000
GPR05P   EQU   @05                                                      00849000
GPR07P   EQU   @07                                                      00850000
GPR12P   EQU   @12                                                      00851000
GPR13P   EQU   @13                                                      00852000
GPR14P   EQU   @14                                                      00853000
GPR15P   EQU   @15                                                      00854000
RPHREG   EQU   @01                                                      00855000
R2       EQU   @02                                                      00856000
CVTREG   EQU   @02                                                      00857000
R3       EQU   @03                                                      00858000
DNCBREG  EQU   @04                                                      00859000
FMCBREG  EQU   @05                                                      00860000
BFRREG   EQU   @06                                                      00861000
ELEMREG  EQU   @07                                                      00862000
WORKREG1 EQU   @08                                                      00863000
WORKREG  EQU   @08                                                      00864000
FSBREG   EQU   @09                                                      00865000
R12      EQU   @12                                                      00866000
R13      EQU   @13                                                      00867000
WORKREG2 EQU   @14                                                      00868000
R14      EQU   @14                                                      00869000
RCREG    EQU   @15                                                      00870000
GPR00F   EQU   @00                                                      00871000
GPR01F   EQU   @01                                                      00872000
GPR02F   EQU   @02                                                      00873000
GPR02P   EQU   @02                                                      00874000
GPR03F   EQU   @03                                                      00875000
GPR03P   EQU   @03                                                      00876000
GPR04F   EQU   @04                                                      00877000
GPR05F   EQU   @05                                                      00878000
GPR06F   EQU   @06                                                      00879000
GPR06P   EQU   @06                                                      00880000
GPR07F   EQU   @07                                                      00881000
GPR08F   EQU   @08                                                      00882000
GPR08P   EQU   @08                                                      00883000
GPR09F   EQU   @09                                                      00884000
GPR09P   EQU   @09                                                      00885000
GPR10F   EQU   @10                                                      00886000
GPR10P   EQU   @10                                                      00887000
GPR11F   EQU   @11                                                      00888000
GPR11P   EQU   @11                                                      00889000
GPR12F   EQU   @12                                                      00890000
GPR13F   EQU   @13                                                      00891000
GPR14F   EQU   @14                                                      00892000
GPR15F   EQU   @15                                                      00893000
R0       EQU   @00                                                      00894000
ATCLCPTR EQU   1032                                                     00895000
ISTPAB   EQU   0                                                        00896000
PABWQCHN EQU   ISTPAB                                                   00897000
PABWEQA  EQU   PABWQCHN                                                 00898000
PABCHAIN EQU   PABWQCHN+4                                               00899000
PABDVTA  EQU   ISTPAB+9                                                 00900000
PABRPHFG EQU   ISTPAB+12                                                00901000
PABFLAGS EQU   PABRPHFG                                                 00902000
PABERLCK EQU   PABFLAGS                                                 00903000
PABERRLK EQU   PABERLCK                                                 00904000
PABERLOK EQU   PABERRLK                                                 00905000
ISTLCCW  EQU   0                                                        00906000
LCCWOP   EQU   ISTLCCW                                                  00907000
LCCWRWOP EQU   LCCWOP                                                   00908000
LCCWCTL  EQU   LCCWRWOP                                                 00909000
LCCWFLAG EQU   ISTLCCW+1                                                00910000
LCCWLSI  EQU   LCCWFLAG                                                 00911000
ISTLCPB  EQU   0                                                        00912000
LCPREQTG EQU   ISTLCPB+2                                                00913000
LCPFLAGS EQU   LCPREQTG                                                 00914000
LCPZF001 EQU   LCPFLAGS                                                 00915000
LCPZRT02 EQU   LCPZF001                                                 00916000
LCPZF002 EQU   LCPFLAGS                                                 00917000
LCPZRT03 EQU   LCPZF002                                                 00918000
LCPZF003 EQU   LCPFLAGS                                                 00919000
LCPZRT04 EQU   LCPZF003                                                 00920000
LCPZF004 EQU   LCPFLAGS                                                 00921000
LCPZRT05 EQU   LCPZF004                                                 00922000
LCPZRT06 EQU   LCPFLAGS                                                 00923000
LCPZRT07 EQU   LCPFLAGS                                                 00924000
LCPMNRCD EQU   LCPREQTG+1                                               00925000
LCPZRT08 EQU   LCPMNRCD                                                 00926000
LCPZRT09 EQU   LCPMNRCD                                                 00927000
LCPCHAIN EQU   ISTLCPB+4                                                00928000
LCPCHAI1 EQU   LCPCHAIN                                                 00929000
LCPRUCNT EQU   ISTLCPB+8                                                00930000
LCPFLAG2 EQU   ISTLCPB+9                                                00931000
LCPTLBPI EQU   LCPFLAG2                                                 00932000
LCPFID0  EQU   LCPFLAG2                                                 00933000
LCPSEQ   EQU   ISTLCPB+10                                               00934000
LCPCID   EQU   ISTLCPB+16                                               00935000
LCPFDBA  EQU   ISTLCPB+24                                               00936000
LCPFLG1  EQU   ISTLCPB+37                                               00937000
LCPFLCCW EQU   ISTLCPB+40                                               00938000
LCPLCCW  EQU   ISTLCPB+48                                               00939000
LCPPABA  EQU   LCPLCCW+4                                                00940000
LCPRPHA  EQU   LCPPABA                                                  00941000
ISTLSCB  EQU   0                                                        00942000
LSC1WORD EQU   ISTLSCB                                                  00943000
LSCTYPE  EQU   LSC1WORD                                                 00944000
LSCREQTG EQU   LSC1WORD+2                                               00945000
LSCZRT02 EQU   LSCREQTG                                                 00946000
LSCZRT03 EQU   LSCREQTG                                                 00947000
LSCZRT04 EQU   LSCREQTG                                                 00948000
LSCZRT05 EQU   LSCREQTG                                                 00949000
LSCZRT06 EQU   LSCREQTG                                                 00950000
LSCZRT07 EQU   LSCREQTG                                                 00951000
LSCZMNRC EQU   LSCREQTG+1                                               00952000
LSCZRT08 EQU   LSCZMNRC                                                 00953000
LSCZRT09 EQU   LSCZMNRC                                                 00954000
LSCCHAIN EQU   ISTLSCB+4                                                00955000
LSCCHAI1 EQU   LSCCHAIN                                                 00956000
LSCRUCNT EQU   ISTLSCB+8                                                00957000
LSCFLGS  EQU   ISTLSCB+9                                                00958000
LSCSEQ   EQU   ISTLSCB+10                                               00959000
LSCLCPBA EQU   ISTLSCB+16                                               00960000
LSCLCCWA EQU   ISTLSCB+20                                               00961000
LSCFDBA  EQU   ISTLSCB+24                                               00962000
ISTZSAVE EQU   0                                                        00963000
ZSAZSVBC EQU   ISTZSAVE                                                 00964000
ZSAZSVMS EQU   ZSAZSVBC                                                 00965000
ZSAZACTV EQU   ZSAZSVMS                                                 00966000
ZSAZSVFC EQU   ISTZSAVE+4                                               00967000
ZSAZSVRR EQU   ISTZSAVE+8                                               00968000
ZSAZSVVR EQU   ISTZSAVE+12                                              00969000
ZSAZTRAC EQU   ISTZSAVE+36                                              00970000
ISTZCRR  EQU   0                                                        00971000
ZCRCRR   EQU   ISTZCRR                                                  00972000
ZCRFLGS1 EQU   ISTZCRR+12                                               00973000
ZCRFLGS2 EQU   ISTZCRR+13                                               00974000
ZCRIF0E1 EQU   ZCRFLGS2                                                 00975000
ZCRIF0E2 EQU   ZCRFLGS2                                                 00976000
ZCRIF0E3 EQU   ZCRFLGS2                                                 00977000
ZCRSWFLD EQU   ISTZCRR+14                                               00978000
ZCRENDSH EQU   ZCRSWFLD                                                 00979000
ZCRNDLCP EQU   ZCRSWFLD                                                 00980000
ZCRRESET EQU   ZCRSWFLD                                                 00981000
ZCRFLGS3 EQU   ISTZCRR+15                                               00982000
ZCRGENSW EQU   ISTZCRR+16                                               00983000
ZCRPFLGS EQU   ISTZCRR+17                                               00984000
ZCRIBPR  EQU   ISTZCRR+18                                               00985000
ZCRSCPSW EQU   ISTZCRR+19                                               00986000
ZCRPARMS EQU   ISTZCRR+24                                               00987000
ZCRFBPTR EQU   ZCRPARMS                                                 00988000
ZCRDFRDA EQU   ZCRPARMS+10                                              00989000
ZCRPCOD1 EQU   ZCRPARMS+12                                              00990000
ZCRPLSBF EQU   ZCRPCOD1                                                 00991000
ZCRPLSCB EQU   ZCRPCOD1                                                 00992000
ZCRPBUF  EQU   ZCRPCOD1                                                 00993000
ZCRPCOD2 EQU   ZCRPARMS+13                                              00994000
ZCRSVRTN EQU   ISTZCRR+56                                               00995000
ZCRWKARA EQU   ISTZCRR+156                                              00996000
ZCRCIDSV EQU   ISTZCRR+192                                              00997000
ZCRAUDIT EQU   ISTZCRR+440                                              00998000
ZCRENTER EQU   ZCRAUDIT+5                                               00999000
ZCREICOE EQU   ZCRENTER+17                                              01000000
ZCRLCPB  EQU   ISTZCRR+480                                              01001000
ZCRRHRU  EQU   ZCRLCPB                                                  01002000
ISTRPH   EQU   0                                                        01003000
RPHCNTL  EQU   ISTRPH                                                   01004000
RPHFLAGS EQU   RPHCNTL+2                                                01005000
RPHAPTYP EQU   RPHFLAGS                                                 01006000
RPHFSTLC EQU   RPHFLAGS                                                 01007000
RPHFLGB  EQU   RPHCNTL+3                                                01008000
RPHRPHA  EQU   ISTRPH+4                                                 01009000
RPHTSKID EQU   ISTRPH+8                                                 01010000
RPHRESMA EQU   ISTRPH+16                                                01011000
RPHWPFLG EQU   RPHRESMA                                                 01012000
RPHWEA   EQU   ISTRPH+24                                                01013000
RPHCSPA  EQU   RPHWEA                                                   01014000
RPHSRPRM EQU   ISTRPH+28                                                01015000
RPHCRR   EQU   ISTRPH+32                                                01016000
RPHPABQA EQU   ISTRPH+36                                                01017000
RPHWORK  EQU   ISTRPH+40                                                01018000
RPHSAVE1 EQU   RPHWORK                                                  01019000
RPHSBITS EQU   RPHSAVE1+1                                               01020000
ISTPFCRR EQU   0                                                        01021000
PFCCRR   EQU   ISTPFCRR                                                 01022000
PFCCRRID EQU   PFCCRR                                                   01023000
PFCCRRLN EQU   PFCCRR+2                                                 01024000
PFCHDR   EQU   ISTPFCRR+4                                               01025000
PFCCRRO  EQU   PFCHDR                                                   01026000
PFCFRRO  EQU   PFCHDR+4                                                 01027000
ISTCFCRR EQU   0                                                        01028000
CFCAUDIT EQU   ISTCFCRR                                                 01029000
CFCNTRD  EQU   CFCAUDIT                                                 01030000
CFCCRT   EQU   CFCAUDIT+1                                               01031000
ISTASCRR EQU   0                                                        01032000
ASCFLAGS EQU   ISTASCRR+16                                              01033000
ASCFLG1  EQU   ASCFLAGS                                                 01034000
ASCFLG2  EQU   ASCFLAGS+2                                               01035000
ASCFLG3  EQU   ASCFLAGS+4                                               01036000
ASCUSRGS EQU   ISTASCRR+28                                              01037000
ISTAPCRR EQU   0                                                        01038000
APCATFLG EQU   ISTAPCRR+16                                              01039000
APCRFLG  EQU   ISTAPCRR+18                                              01040000
APCSAVE  EQU   ISTAPCRR+44                                              01041000
APCCOMF  EQU   ISTAPCRR+116                                             01042000
APCCOMF1 EQU   APCCOMF                                                  01043000
APC31FLG EQU   ISTAPCRR+132                                             01044000
APC52FLG EQU   ISTAPCRR+133                                             01045000
APC53FLG EQU   ISTAPCRR+134                                             01046000
APC54FLG EQU   ISTAPCRR+135                                             01047000
APC57FLG EQU   ISTAPCRR+136                                             01048000
ISTCRA   EQU   0                                                        01049000
CRABASIC EQU   ISTCRA                                                   01050000
CRAHDR   EQU   CRABASIC                                                 01051000
CRACRR   EQU   CRAHDR                                                   01052000
CRALKACT EQU   CRABASIC+8                                               01053000
CRASVC   EQU   ISTCRA+848                                               01054000
CRABUFA  EQU   CRASVC+68                                                01055000
ISTLOK   EQU   0                                                        01056000
LOKCHN   EQU   ISTLOK+1                                                 01057000
LOKCHNG  EQU   LOKCHN                                                   01058000
@NM00018 EQU   LOKCHNG+2                                                01059000
ISTDYPAB EQU   0                                                        01060000
ISTATCVT EQU   0                                                        01061000
ATCCOM   EQU   ISTATCVT                                                 01062000
ATCSTAT  EQU   ATCCOM                                                   01063000
ATCSTAT1 EQU   ATCSTAT                                                  01064000
ATCSTFLG EQU   ATCSTAT+1                                                01065000
ATCPOFLG EQU   ATCSTAT+2                                                01066000
ATCSTAT4 EQU   ATCSTAT+3                                                01067000
ATCIOTRC EQU   ATCCOM+140                                               01068000
ATCTHTRC EQU   ATCIOTRC                                                 01069000
ATCCSMR  EQU   ISTATCVT+296                                             01070000
ATCSHRFG EQU   ISTATCVT+316                                             01071000
ATCHPGM  EQU   ISTATCVT+384                                             01072000
ATCVLCNT EQU   ISTATCVT+772                                             01073000
ATCRNO   EQU   ISTATCVT+788                                             01074000
ATCSOPD  EQU   ISTATCVT+792                                             01075000
ATCSIPD  EQU   ISTATCVT+800                                             01076000
ATCSECST EQU   ISTATCVT+812                                             01077000
ATCSTAT2 EQU   ISTATCVT+818                                             01078000
ATCVTBAM EQU   ISTATCVT+908                                             01079000
@NM00026 EQU   ATCVTBAM+3                                               01080000
ATCAOSM  EQU   ISTATCVT+912                                             01081000
ATCGSRBQ EQU   ATCAOSM+4                                                01082000
ATCGSRBG EQU   ATCGSRBQ                                                 01083000
ATCAP34  EQU   ATCAOSM+32                                               01084000
ATCZPSVT EQU   ATCAOSM+72                                               01085000
ATCICAPP EQU   ATCAOSM+100                                              01086000
ATCLDAPP EQU   ATCAOSM+120                                              01087000
ATCDAPVT EQU   ATCAOSM+140                                              01088000
ATCAP37  EQU   ATCAOSM+264                                              01089000
ATCVTFLG EQU   ATCAOSM+392                                              01090000
ATCZFLAG EQU   ATCAOSM+588                                              01091000
ISTDEVCH EQU   0                                                        01092000
DEVSHCH  EQU   ISTDEVCH                                                 01093000
DEVCHAR  EQU   DEVSHCH                                                  01094000
DEVTCODE EQU   ISTDEVCH+1                                               01095000
DEVFLAGS EQU   ISTDEVCH+3                                               01096000
DEVFCCTL EQU   DEVFLAGS                                                 01097000
DEVCHAR3 EQU   DEVFLAGS                                                 01098000
ISTNCB   EQU   0                                                        01099000
NCBRDTE  EQU   ISTNCB+4                                                 01100000
NCBFLAGS EQU   ISTNCB+24                                                01101000
NCBFRAS  EQU   NCBFLAGS+1                                               01102000
NCBFTRIO EQU   NCBFRAS                                                  01103000
NCBFLAG1 EQU   NCBFLAGS+2                                               01104000
ISTDNCB  EQU   0                                                        01105000
DNCNCB   EQU   ISTDNCB                                                  01106000
DNCOS    EQU   ISTDNCB+56                                               01107000
DNCZFLGS EQU   DNCOS                                                    01108000
DNCSESS  EQU   DNCZFLGS                                                 01109000
DNCCONT  EQU   DNCZFLGS                                                 01110000
DNCZRSCH EQU   DNCZFLGS                                                 01111000
DNCBSCED EQU   DNCOS+2                                                  01112000
DNCACIP  EQU   DNCBSCED+1                                               01113000
ISTZPSVT EQU   0                                                        01114000
ZPSZDFB0 EQU   ISTZPSVT+16                                              01115000
ISTBDU   EQU   0                                                        01116000
BDUCOMND EQU   ISTBDU                                                   01117000
BDUMODIF EQU   ISTBDU+1                                                 01118000
BDUMOD1  EQU   BDUMODIF                                                 01119000
BDUDAF   EQU   ISTBDU+2                                                 01120000
BDUFUNC  EQU   BDUDAF                                                   01121000
BDUCHECK EQU   BDUFUNC                                                  01122000
BDUFLAGS EQU   BDUDAF+1                                                 01123000
ISTFDB   EQU   0                                                        01124000
FDBOFSET EQU   ISTFDB+10                                                01125000
ISTLH    EQU   0                                                        01126000
ISTTH    EQU   0                                                        01127000
THFLAG1  EQU   ISTTH                                                    01128000
THFLGA   EQU   THFLAG1                                                  01129000
THMPF    EQU   THFLGA                                                   01130000
THFLGB   EQU   THFLAG1+1                                                01131000
ISTTH2   EQU   0                                                        01132000
TH2FLAG1 EQU   ISTTH2                                                   01133000
TH2MPF   EQU   TH2FLAG1                                                 01134000
ISTBTU   EQU   0                                                        01135000
BTUBTH   EQU   ISTBTU                                                   01136000
BTUFID   EQU   BTUBTH                                                   01137000
BTUDEST  EQU   BTUBTH+2                                                 01138000
BTUREQ   EQU   BTUBTH+6                                                 01139000
BTURQFLG EQU   BTUREQ                                                   01140000
BTURH    EQU   BTUBTH+10                                                01141000
BTUBDU   EQU   ISTBTU+14                                                01142000
BTUSYSTR EQU   ISTBTU+18                                                01143000
BTUTEXT  EQU   ISTBTU+20                                                01144000
ISTFSB   EQU   0                                                        01145000
FSBFSB   EQU   ISTFSB                                                   01146000
FSBMNRCD EQU   FSBFSB+2                                                 01147000
FSBSFLGS EQU   FSBFSB+3                                                 01148000
FSBFSBA  EQU   FSBFSB+4                                                 01149000
FSBBTH   EQU   FSBFSB+8                                                 01150000
FSBCID   EQU   FSBBTH                                                   01151000
FSBSAF   EQU   FSBCID                                                   01152000
FSBDAF   EQU   FSBCID+2                                                 01153000
FSBRQTAG EQU   FSBBTH+4                                                 01154000
FSBSEQID EQU   FSBRQTAG                                                 01155000
FSBFLAGS EQU   FSBSEQID                                                 01156000
FSBSEQ   EQU   FSBSEQID+1                                               01157000
FSBCSWST EQU   FSBBTH+6                                                 01158000
FSBTHFLD EQU   FSBCSWST                                                 01159000
FSBTH1   EQU   FSBTHFLD                                                 01160000
FSBSYSRS EQU   FSBTH1                                                   01161000
FSBSPHSE EQU   FSBSYSRS                                                 01162000
FSBTH2   EQU   FSBTHFLD+1                                               01163000
FSBEXTRS EQU   FSBTH2                                                   01164000
FSBXFSTS EQU   FSBEXTRS                                                 01165000
FSBXCODE EQU   FSBEXTRS                                                 01166000
FSBNETRS EQU   FSBFSB+16                                                01167000
FSBSRCAT EQU   FSBNETRS                                                 01168000
FSBMJRCD EQU   FSBSRCAT                                                 01169000
FSBERC   EQU   FSBNETRS+1                                               01170000
FSBELI   EQU   FSBERC                                                   01171000
FSBECI   EQU   FSBERC                                                   01172000
FSBFBMI  EQU   FSBERC                                                   01173000
FSBDMGRS EQU   FSBFSB+18                                                01174000
FSBSS1   EQU   FSBDMGRS                                                 01175000
FSBSS2   EQU   FSBDMGRS+1                                               01176000
FSBLCPB  EQU   FSBFSB+20                                                01177000
FSBMSGID EQU   FSBLCPB                                                  01178000
FSBLCCWA EQU   FSBFSB+24                                                01179000
FSBRLSTS EQU   FSBLCCWA                                                 01180000
ISTZIBUF EQU   0                                                        01181000
ZIBFSM   EQU   ISTZIBUF+4                                               01182000
ISTZRCVT EQU   0                                                        01183000
ZRCZCFCI EQU   ISTZRCVT+4                                               01184000
ZRCZIFHB EQU   ISTZRCVT+80                                              01185000
ZRCZIFGB EQU   ISTZRCVT+84                                              01186000
ZRCZIFIB EQU   ISTZRCVT+92                                              01187000
ISTPROCD EQU   0                                                        01188000
PROPROC  EQU   ISTPROCD                                                 01189000
PROPROC1 EQU   PROPROC                                                  01190000
PROPROC2 EQU   PROPROC+1                                                01191000
PROPROC3 EQU   PROPROC+2                                                01192000
PROPROC4 EQU   PROPROC+3                                                01193000
PROPROCS EQU   0                                                        01194000
PROSETMS EQU   PROPROCS+1                                               01195000
PROSETM2 EQU   PROSETMS                                                 01196000
PROSETM3 EQU   PROSETMS+1                                               01197000
PROSETM4 EQU   PROSETMS+2                                               01198000
ISTFMCB  EQU   0                                                        01199000
FMCSAF   EQU   ISTFMCB+2                                                01200000
FMCSTAT  EQU   ISTFMCB+28                                               01201000
FMCSTAT1 EQU   ISTFMCB+29                                               01202000
FMCCMDFL EQU   ISTFMCB+31                                               01203000
FMCCMPS1 EQU   ISTFMCB+36                                               01204000
FMCPAB2  EQU   ISTFMCB+80                                               01205000
FMCPAB3  EQU   ISTFMCB+96                                               01206000
FMCPAB4  EQU   ISTFMCB+112                                              01207000
FMCSIPA  EQU   ISTFMCB+148                                              01208000
FMCNXOSQ EQU   ISTFMCB+152                                              01209000
FMCNXCFM EQU   FMCNXOSQ                                                 01210000
FMCNXOSC EQU   FMCNXOSQ+2                                               01211000
FMCSSTAT EQU   ISTFMCB+159                                              01212000
FMCPACE  EQU   ISTFMCB+160                                              01213000
FMCPACEN EQU   FMCPACE                                                  01214000
FMCPACEM EQU   FMCPACE+1                                                01215000
FMCPACPC EQU   FMCPACE+2                                                01216000
FMCCVAL  EQU   FMCPACE+3                                                01217000
FMCOBCE  EQU   FMCCVAL                                                  01218000
FMCCLEXT EQU   ISTFMCB+164                                              01219000
FMCRPLA  EQU   FMCCLEXT                                                 01220000
FMCFBA   EQU   FMCCLEXT+4                                               01221000
FMCCMPS2 EQU   FMCCLEXT+16                                              01222000
FMCFLGA  EQU   FMCCMPS2                                                 01223000
FMCFLGCL EQU   FMCCMPS2+1                                               01224000
FMCPSCMD EQU   FMCCMPS2+2                                               01225000
FMCPSTAT EQU   FMCCMPS2+3                                               01226000
FMCSTAT2 EQU   ISTFMCB+186                                              01227000
FMCMODEB EQU   ISTFMCB+189                                              01228000
FMCCLSEQ EQU   ISTFMCB+190                                              01229000
FMCRRESP EQU   ISTFMCB+195                                              01230000
FMCSSEGQ EQU   ISTFMCB+200                                              01231000
FMCFBAS  EQU   ISTFMCB+216                                              01232000
FMCZV002 EQU   FMCFBAS                                                  01233000
FMCSNCTL EQU   ISTFMCB+224                                              01234000
FMCSCFLG EQU   FMCSNCTL                                                 01235000
FMCVS1   EQU   ISTFMCB+232                                              01236000
FMCZFLAG EQU   FMCVS1                                                   01237000
FMCZF006 EQU   FMCZFLAG                                                 01238000
FMCZFC06 EQU   FMCZF006                                                 01239000
FMCZH001 EQU   FMCVS1+4                                                 01240000
FMCLBXM  EQU   FMCVS1+12                                                01241000
FMCSHEAQ EQU   FMCLBXM                                                  01242000
FMCLCPBQ EQU   FMCVS1+16                                                01243000
FMCLCPAQ EQU   FMCVS1+20                                                01244000
FMCZX001 EQU   FMCVS1+28                                                01245000
FMCSEQ1  EQU   FMCVS1+34                                                01246000
FMCZFLG2 EQU   FMCVS1+35                                                01247000
FMCCVFLG EQU   FMCVS1+44                                                01248000
FMCFLAG  EQU   0                                                        01249000
FMCFLGB  EQU   FMCFLAG                                                  01250000
ISTAVT   EQU   0                                                        01251000
ISTAS49  EQU   ISTAVT+4                                                 01252000
ISTRPRE  EQU   0                                                        01253000
RPRCOMID EQU   ISTRPRE+8                                                01254000
RPRFLAGA EQU   ISTRPRE+21                                               01255000
RPRFLAGB EQU   ISTRPRE+22                                               01256000
RPRCAUSE EQU   ISTRPRE+23                                               01257000
RPRFLAGD EQU   ISTRPRE+61                                               01258000
RPRFLAGC EQU   ISTRPRE+62                                               01259000
ISTRCPRE EQU   0                                                        01260000
RCPPMODE EQU   ISTRCPRE+91                                              01261000
RCPLGNIN EQU   ISTRCPRE+92                                              01262000
ISTRDT   EQU   0                                                        01263000
RDTPLEN  EQU   ISTRDT+72                                                01264000
RDTPRIOR EQU   RDTPLEN                                                  01265000
RDTFLAGB EQU   ISTRDT+91                                                01266000
RDTVYRPH EQU   ISTRDT+108                                               01267000
RDTSTCNT EQU   ISTRDT+112                                               01268000
ISTRAP   EQU   0                                                        01269000
RAPFLG   EQU   ISTRAP+108                                               01270000
RAPFLGB  EQU   ISTRAP+109                                               01271000
RAPFLGC  EQU   ISTRAP+110                                               01272000
ISTRLC   EQU   0                                                        01273000
RLCADR   EQU   ISTRLC+72                                                01274000
RLCFLAG  EQU   RLCADR                                                   01275000
ISTRRN   EQU   0                                                        01276000
RRNADR   EQU   ISTRRN+136                                               01277000
RRNFLAG  EQU   RRNADR                                                   01278000
RRNUCBAD EQU   RRNADR+1                                                 01279000
RRNRDF   EQU   ISTRRN+172                                               01280000
RRNRDFA  EQU   RRNRDF                                                   01281000
RRNRDFB  EQU   RRNRDF+1                                                 01282000
RRNCMF   EQU   ISTRRN+176                                               01283000
RRNCMFA  EQU   RRNCMF                                                   01284000
RRNCMFB  EQU   RRNCMF+1                                                 01285000
RRNCMFC  EQU   RRNCMF+2                                                 01286000
RRNCMFD  EQU   RRNCMF+3                                                 01287000
RRNNMDPD EQU   ISTRRN+192                                               01288000
RRNHPRE  EQU   ISTRRN+216                                               01289000
ISTRGP   EQU   0                                                        01290000
RGPFLG   EQU   ISTRGP+72                                                01291000
ISTRLN   EQU   0                                                        01292000
RLNADR   EQU   ISTRLN+72                                                01293000
RLNFLAG  EQU   RLNADR                                                   01294000
RLNUCBAD EQU   RLNADR+1                                                 01295000
RLNSTAT1 EQU   ISTRLN+86                                                01296000
RLNSTAT2 EQU   ISTRLN+87                                                01297000
RLNRDF   EQU   ISTRLN+88                                                01298000
RLNRDFA  EQU   RLNRDF                                                   01299000
RLNRACNT EQU   RLNRDFA                                                  01300000
RLNRDFB  EQU   RLNRDF+1                                                 01301000
RLNCRFLG EQU   ISTRLN+102                                               01302000
RLNLSCMD EQU   RLNCRFLG                                                 01303000
ISTRPT   EQU   0                                                        01304000
RPTLNCID EQU   ISTRPT+116                                               01305000
RPTDITT  EQU   ISTRPT+128                                               01306000
RPTATERM EQU   ISTRPT+132                                               01307000
RPTUTERM EQU   ISTRPT+136                                               01308000
RPTFLAG1 EQU   ISTRPT+140                                               01309000
ISTRCL   EQU   0                                                        01310000
RCLADR   EQU   ISTRCL+72                                                01311000
RCLFLAG  EQU   RCLADR                                                   01312000
ISTRTR   EQU   0                                                        01313000
RTRADR   EQU   ISTRTR+124                                               01314000
RTRFLAG  EQU   RTRADR                                                   01315000
RTRRDFA  EQU   ISTRTR+136                                               01316000
RTRRAALL EQU   RTRRDFA                                                  01317000
RTRRDFB  EQU   ISTRTR+137                                               01318000
RTRRDFC  EQU   ISTRTR+138                                               01319000
RTRRDFD  EQU   ISTRTR+139                                               01320000
RTRRDFE  EQU   ISTRTR+140                                               01321000
RTRRDFF  EQU   ISTRTR+141                                               01322000
RTRCRFLG EQU   ISTRTR+143                                               01323000
RTRLSCMD EQU   RTRCRFLG                                                 01324000
RTRBSCID EQU   ISTRTR+188                                               01325000
RTRLCTI  EQU   ISTRTR+209                                               01326000
ISTRIN   EQU   0                                                        01327000
RINDFD   EQU   ISTRIN+124                                               01328000
RINREMPO EQU   RINDFD                                                   01329000
RINNODEF EQU   RINDFD                                                   01330000
RINLDISC EQU   RINDFD                                                   01331000
RINNODID EQU   ISTRIN+125                                               01332000
RINRLDAF EQU   ISTRIN+126                                               01333000
RINREMOT EQU   ISTRIN+128                                               01334000
RINVPAB  EQU   ISTRIN+132                                               01335000
RINRPHCN EQU   ISTRIN+136                                               01336000
RINNCSPL EQU   ISTRIN+140                                               01337000
RINCNCNT EQU   ISTRIN+144                                               01338000
ISTRDS   EQU   0                                                        01339000
ISTDOT   EQU   0                                                        01340000
ISTRCC   EQU   0                                                        01341000
RCCFLAG  EQU   ISTRCC+73                                                01342000
RCCFLAGB EQU   ISTRCC+74                                                01343000
RCCSTAID EQU   ISTRCC+78                                                01344000
RCCID48  EQU   RCCSTAID+2                                               01345000
RCCCRFLG EQU   ISTRCC+108                                               01346000
ISTRLU   EQU   0                                                        01347000
RLUFLAG  EQU   ISTRLU+125                                               01348000
RLUCRFLG EQU   ISTRLU+126                                               01349000
RLUPACE  EQU   ISTRLU+132                                               01350000
RLUNCPPC EQU   ISTRLU+134                                               01351000
RLUUSSTB EQU   ISTRLU+140                                               01352000
RLUMODET EQU   ISTRLU+152                                               01353000
ISTRPX   EQU   0                                                        01354000
ISTRLX   EQU   0                                                        01355000
RLXFLAGA EQU   ISTRLX+76                                                01356000
ISTRSW   EQU   0                                                        01357000
ISTRDA   EQU   0                                                        01358000
RDAADR   EQU   ISTRDA+72                                                01359000
RDAFLAG  EQU   RDAADR                                                   01360000
RDAUCBAD EQU   RDAADR+1                                                 01361000
ISTRLS   EQU   0                                                        01362000
ISTDNT   EQU   0                                                        01363000
ISTGNT   EQU   0                                                        01364000
ISTPAT   EQU   0                                                        01365000
PATFLAGA EQU   ISTPAT+7                                                 01366000
ISTDTE   EQU   0                                                        01367000
DTELCTI  EQU   ISTDTE                                                   01368000
DTERDTEA EQU   ISTDTE+1                                                 01369000
ISTZIFIB EQU   0                                                        01370000
ISTZIFGB EQU   0                                                        01371000
ISTZIFHB EQU   0                                                        01372000
ISTZCF2B EQU   0                                                        01373000
ISTZDFB0 EQU   0                                                        01374000
ISTWKE   EQU   0                                                        01375000
WKECHAIN EQU   ISTWKE+4                                                 01376000
WKEFLAGS EQU   WKECHAIN                                                 01377000
ISTAPC37 EQU   0                                                        01378000
ISTAPC34 EQU   0                                                        01379000
ZIBSRB   EQU   0                                                        01380000
LCPZTIE  EQU   LCPCID                                                   01381000
LCPZSNAM EQU   LCPZTIE+8                                                01382000
FSBCOMBN EQU   FSBNETRS                                                 01383000
FSBRHFLD EQU   FSBCOMBN+1                                               01384000
FSBRH3   EQU   FSBRHFLD+2                                               01385000
FSBLDFLG EQU   FSBRH3                                                   01386000
@NM00035 EQU   FSBRQTAG                                                 01387000
ZIBDIO   EQU   ZIBFSM                                                   01388000
ZIBCCW2  EQU   ZIBDIO+8                                                 01389000
ZIBCPTCC EQU   ZIBCCW2                                                  01390000
ZIBAIO   EQU   ISTZIBUF                                                 01391000
ZIBAIOCM EQU   ZIBAIO                                                   01392000
ZIBFDBZ  EQU   ZIBAIOCM                                                 01393000
ZIBFIB   EQU   ZIBAIO+16                                                01394000
ZIBFSB   EQU   ZIBFIB                                                   01395000
ZIBMDREC EQU   ZIBFSB+4                                                 01396000
ZIBMDRIN EQU   ZIBFSB+28                                                01397000
ZIBBTU   EQU   ZIBFIB+32                                                01398000
ZIBFDBS  EQU   ZIBBTU                                                   01399000
@NM00038 EQU   ZIBBTU+12                                                01400000
ZIBFID1  EQU   @NM00038+1                                               01401000
ZIBFITXT EQU   ZIBFID1                                                  01402000
ZIBSIB   EQU   ZIBFIB                                                   01403000
ZIBREC   EQU   ZIBMDRIN                                                 01404000
ZIBRECPL EQU   ZIBREC                                                   01405000
ZIBRECHD EQU   ZIBRECPL                                                 01406000
ZIBRECRS EQU   ZIBREC+8                                                 01407000
ZIBRECDT EQU   ZIBREC+10                                                01408000
ZIBMDRRC EQU   ZIBMDREC                                                 01409000
ZIBRCPL  EQU   ZIBMDRRC                                                 01410000
ZIBRCDT  EQU   ZIBMDRRC+24                                              01411000
@NM00040 EQU   ZIBBTU                                                   01412000
RTRDNCBA EQU   ISTRTR+40                                                01413000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01414000
ZIBTH2   EQU   @NM00040+4                                               01415000
ZIBLH    EQU   @NM00040                                                 01416000
ZIBRCTXT EQU   ZIBMDRRC+36                                              01417000
ZIBRCRID EQU   ZIBRCDT+10                                               01418000
ZIBRCNAM EQU   ZIBRCDT+2                                                01419000
ZIBRCUA  EQU   ZIBRCDT                                                  01420000
ZIBRCPUI EQU   ZIBRCPL+20                                               01421000
ZIBRCPUN EQU   ZIBRCPL+16                                               01422000
ZIBRCTIM EQU   ZIBRCPL+12                                               01423000
ZIBRCDAT EQU   ZIBRCPL+8                                                01424000
ZIBRCRS1 EQU   ZIBRCPL+6                                                01425000
ZIBRCSID EQU   ZIBRCPL+5                                                01426000
ZIBRCID  EQU   ZIBRCPL+4                                                01427000
ZIBRCSW  EQU   ZIBRCPL+2                                                01428000
ZIBRCSYR EQU   ZIBRCPL+1                                                01429000
ZIBRCL   EQU   ZIBRCPL                                                  01430000
ZIBRECTX EQU   ZIBREC+22                                                01431000
ZIBRECID EQU   ZIBRECDT+10                                              01432000
ZIBRECNA EQU   ZIBRECDT+2                                               01433000
ZIBRECUA EQU   ZIBRECDT                                                 01434000
ZIBRECSV EQU   ZIBRECRS                                                 01435000
ZIBRECDA EQU   ZIBRECPL+4                                               01436000
ZIBRECSI EQU   ZIBRECHD+3                                               01437000
ZIBRECDV EQU   ZIBRECHD+2                                               01438000
ZIBRECFL EQU   ZIBRECHD+1                                               01439000
ZIBRECTY EQU   ZIBRECHD                                                 01440000
ZIBTEXT  EQU   ZIBSIB+4                                                 01441000
ZIBRSV04 EQU   ZIBSIB                                                   01442000
ZIBTEXT2 EQU   ZIBFITXT                                                 01443000
ZIBTEXT1 EQU   ZIBFIB+52                                                01444000
@NM00039 EQU   @NM00038                                                 01445000
@NM00037 EQU   ZIBMDREC                                                 01446000
@NM00036 EQU   ZIBFSB                                                   01447000
ZIBLNG2  EQU   ZIBAIOCM+14                                              01448000
ZIBRSV03 EQU   ZIBAIOCM+13                                              01449000
ZIBWKBYT EQU   ZIBAIOCM+12                                              01450000
ZIBCPNPK EQU   ZIBCCW2+6                                                01451000
ZIBRSV02 EQU   ZIBCCW2+5                                                01452000
ZIBCPTPF EQU   ZIBCCW2+4                                                01453000
ZIBCPTCA EQU   ZIBCCW2+1                                                01454000
ZIBCPNPC EQU   ZIBCPTCC                                                 01455000
ZIBCPRDK EQU   ZIBDIO+6                                                 01456000
ZIBRSV01 EQU   ZIBDIO+5                                                 01457000
ZIBCPRDF EQU   ZIBDIO+4                                                 01458000
ZIBCPTXA EQU   ZIBDIO+1                                                 01459000
ZIBCPRDC EQU   ZIBDIO                                                   01460000
FSBRT0B  EQU   @NM00035+1                                               01461000
FSBRT0A  EQU   @NM00035+1                                               01462000
FSBRT09  EQU   @NM00035+1                                               01463000
FSBRT08  EQU   @NM00035+1                                               01464000
FSBRT07  EQU   @NM00035                                                 01465000
FSBRT06  EQU   @NM00035                                                 01466000
FSBRT05  EQU   @NM00035                                                 01467000
FSBRT04  EQU   @NM00035                                                 01468000
FSBRT03  EQU   @NM00035                                                 01469000
FSBRT02  EQU   @NM00035                                                 01470000
FSBRT01  EQU   @NM00035                                                 01471000
FSBRT00  EQU   @NM00035                                                 01472000
FSBLDCUF EQU   FSBLDFLG                                                 01473000
FSBLDSIF EQU   FSBLDFLG                                                 01474000
FSBLDSOF EQU   FSBLDFLG                                                 01475000
FSBLDEBF EQU   FSBLDFLG                                                 01476000
FSBLDBBF EQU   FSBLDFLG                                                 01477000
FSBLDFME EQU   FSBLDFLG                                                 01478000
FSBLDSCF EQU   FSBLDFLG                                                 01479000
FSBLDRMF EQU   FSBLDFLG                                                 01480000
FSBRH2   EQU   FSBRHFLD+1                                               01481000
FSBRH1   EQU   FSBRHFLD                                                 01482000
FSBALIGN EQU   FSBCOMBN                                                 01483000
LCPZTRV4 EQU   LCPZSNAM+4                                               01484000
LCPZTRV1 EQU   LCPZSNAM                                                 01485000
LCPZSNA  EQU   LCPZTIE+4                                                01486000
LCPZFMCA EQU   LCPZTIE                                                  01487000
WKECHNGP EQU   WKECHAIN+1                                               01488000
@NM00060 EQU   WKEFLAGS                                                 01489000
WKEGATE  EQU   WKEFLAGS                                                 01490000
@NM00059 EQU   ISTWKE                                                   01491000
PATRSV01 EQU   PATFLAGA                                                 01492000
PATUSEFG EQU   PATFLAGA                                                 01493000
PATRDCNT EQU   ISTPAT+6                                                 01494000
PATGRPID EQU   ISTPAT+5                                                 01495000
PATPTHID EQU   ISTPAT+4                                                 01496000
PATDINDX EQU   ISTPAT+2                                                 01497000
PATGINDX EQU   ISTPAT                                                   01498000
GNTGRPNM EQU   ISTGNT                                                   01499000
DNTTELNO EQU   ISTDNT+1                                                 01500000
DNTCTDIG EQU   ISTDNT                                                   01501000
RLSRSV02 EQU   ISTRLS+140                                               01502000
RLSRSV01 EQU   ISTRLS+138                                               01503000
RLSCTELU EQU   ISTRLS+136                                               01504000
RLSPRE   EQU   ISTRLS                                                   01505000
RDARSVPT EQU   ISTRDA+84                                                01506000
RDAPUBI  EQU   ISTRDA+83                                                01507000
RDADFCUA EQU   ISTRDA+80                                                01508000
RDACTPCC EQU   ISTRDA+79                                                01509000
RDADACUA EQU   ISTRDA+76                                                01510000
RDALUBA  EQU   RDAUCBAD+1                                               01511000
RDACHQI  EQU   RDAUCBAD                                                 01512000
RDARSV01 EQU   RDAFLAG                                                  01513000
RDARBISA EQU   RDAFLAG                                                  01514000
RDAPRE   EQU   ISTRDA                                                   01515000
RSWRSV01 EQU   ISTRSW+152                                               01516000
RSWRSV02 EQU   ISTRSW+150                                               01517000
RSWCTELU EQU   ISTRSW+148                                               01518000
RSWGRUPZ EQU   ISTRSW+146                                               01519000
RSWDIALZ EQU   ISTRSW+144                                               01520000
RSWGRUPT EQU   ISTRSW+140                                               01521000
RSWDIALT EQU   ISTRSW+136                                               01522000
RSWPRE   EQU   ISTRSW                                                   01523000
RLXRSV03 EQU   ISTRLX+80                                                01524000
RLXRSV02 EQU   ISTRLX+77                                                01525000
RLXRSV01 EQU   RLXFLAGA                                                 01526000
RLXINUSE EQU   RLXFLAGA                                                 01527000
RLXNLUX  EQU   ISTRLX+72                                                01528000
RLXPRE   EQU   ISTRLX                                                   01529000
RPXRSV01 EQU   ISTRPX+80                                                01530000
RPXRSV02 EQU   ISTRPX+77                                                01531000
RPXMAXLU EQU   ISTRPX+76                                                01532000
RPXFLUX  EQU   ISTRPX+72                                                01533000
RPXPRE   EQU   ISTRPX                                                   01534000
RLURSV02 EQU   ISTRLU+172                                               01535000
RLULGMOD EQU   ISTRLU+164                                               01536000
RLUMODEP EQU   RLUMODET+8                                               01537000
RLUMODEN EQU   RLUMODET                                                 01538000
RLUUSSPT EQU   RLUUSSTB+8                                               01539000
RLUUSSNM EQU   RLUUSSTB                                                 01540000
RLURSV01 EQU   ISTRLU+137                                               01541000
RLULOCAD EQU   ISTRLU+136                                               01542000
RLUNCPPM EQU   RLUNCPPC+1                                               01543000
RLUNCPPN EQU   RLUNCPPC                                                 01544000
RLUPACEM EQU   RLUPACE+1                                                01545000
RLUPACEN EQU   RLUPACE                                                  01546000
RLUINTA  EQU   ISTRLU+128                                               01547000
RLUSSCFM EQU   ISTRLU+127                                               01548000
RLUCRRSV EQU   RLUCRFLG                                                 01549000
RLUACTLU EQU   RLUCRFLG                                                 01550000
RLURSV00 EQU   RLUFLAG                                                  01551000
RLUNDSES EQU   RLUFLAG                                                  01552000
RLUGSTAT EQU   RLUFLAG                                                  01553000
RLUBATCH EQU   RLUFLAG                                                  01554000
RLURBISA EQU   RLUFLAG                                                  01555000
RLUTYPE  EQU   ISTRLU+124                                               01556000
RLUCRPR  EQU   ISTRLU                                                   01557000
RCCRVPT2 EQU   ISTRCC+144                                               01558000
RCCXTOSW EQU   ISTRCC+140                                               01559000
RCCSWTOX EQU   ISTRCC+136                                               01560000
RCCRSPT2 EQU   ISTRCC+133                                               01561000
RCCADDR  EQU   ISTRCC+132                                               01562000
RCCPASSL EQU   ISTRCC+131                                               01563000
RCCMXOUT EQU   ISTRCC+130                                               01564000
RCCMXDAT EQU   ISTRCC+128                                               01565000
RCCINDEX EQU   ISTRCC+126                                               01566000
RCCPATHZ EQU   ISTRCC+124                                               01567000
RCCPATHT EQU   ISTRCC+120                                               01568000
RCCDPQ   EQU   ISTRCC+116                                               01569000
RCCTPAB  EQU   ISTRCC+112                                               01570000
RCCRSV02 EQU   ISTRCC+109                                               01571000
RCCCRRSV EQU   RCCCRFLG                                                 01572000
RCCCTCFL EQU   RCCCRFLG                                                 01573000
RCCACTPU EQU   RCCCRFLG                                                 01574000
RCCNCSPL EQU   ISTRCC+104                                               01575000
RCCRPHCN EQU   ISTRCC+100                                               01576000
RCCEPAB  EQU   ISTRCC+96                                                01577000
RCCDPAB  EQU   ISTRCC+92                                                01578000
RCCVPAB  EQU   ISTRCC+88                                                01579000
@NM00058 EQU   ISTRCC+87                                                01580000
RCCSESCT EQU   ISTRCC+86                                                01581000
RCCIDNUM EQU   RCCID48+3                                                01582000
RCCIDBLK EQU   RCCID48+2                                                01583000
RCCIDPA2 EQU   RCCID48+1                                                01584000
RCCIDPUT EQU   RCCID48                                                  01585000
RCCIDPA1 EQU   RCCSTAID                                                 01586000
RCCCTELU EQU   ISTRCC+76                                                01587000
RCCCNCNT EQU   ISTRCC+75                                                01588000
RCCRTGOH EQU   RCCFLAGB                                                 01589000
RCCBRKCN EQU   RCCFLAGB                                                 01590000
RCCRESET EQU   RCCFLAGB                                                 01591000
RCCFINAL EQU   RCCFLAGB                                                 01592000
RCCBNNSP EQU   RCCFLAGB                                                 01593000
RCCIRETR EQU   RCCFLAGB                                                 01594000
RCCDIALP EQU   RCCFLAGB                                                 01595000
RCCDSTCT EQU   RCCFLAGB                                                 01596000
RCCCTPGD EQU   RCCFLAG                                                  01597000
RCCPRGDN EQU   RCCFLAG                                                  01598000
RCCOUERP EQU   RCCFLAG                                                  01599000
RCCOHIMM EQU   RCCFLAG                                                  01600000
RCCLDISC EQU   RCCFLAG                                                  01601000
RCCERPIP EQU   RCCFLAG                                                  01602000
RCCCUDIE EQU   RCCFLAG                                                  01603000
RCCRBISA EQU   RCCFLAG                                                  01604000
RCCTYPE  EQU   ISTRCC+72                                                01605000
RCCPRE   EQU   ISTRCC                                                   01606000
DOTADTRM EQU   ISTDOT                                                   01607000
RDSADDOT EQU   ISTRDS+76                                                01608000
RDSCTATR EQU   ISTRDS+74                                                01609000
RDSCTTRM EQU   ISTRDS+72                                                01610000
RDSPRE   EQU   ISTRDS                                                   01611000
RINRSV05 EQU   ISTRIN+156                                               01612000
RINRSV04 EQU   ISTRIN+152                                               01613000
RINLOCRN EQU   ISTRIN+148                                               01614000
RINRSV02 EQU   ISTRIN+145                                               01615000
RTRCNCNT EQU   RINCNCNT                                                 01616000
RTRNCSPL EQU   RINNCSPL                                                 01617000
RTRRPHCN EQU   RINRPHCN                                                 01618000
RTRVPAB  EQU   RINVPAB                                                  01619000
RTRREMOT EQU   RINREMOT                                                 01620000
RTRRLDAF EQU   RINRLDAF                                                 01621000
RTRNODID EQU   RINNODID                                                 01622000
RINRSV01 EQU   RINDFD                                                   01623000
RTRLDISC EQU   RINLDISC                                                 01624000
RTRNODEF EQU   RINNODEF                                                 01625000
RTRREMPO EQU   RINREMPO                                                 01626000
RINCRPRE EQU   ISTRIN                                                   01627000
RTRRSV04 EQU   ISTRTR+210                                               01628000
RTRIDCAS EQU   RTRBSCID+1                                               01629000
RTRIDLEN EQU   RTRBSCID                                                 01630000
RTRRSVDD EQU   ISTRTR+181                                               01631000
RTRRDFG  EQU   ISTRTR+180                                               01632000
RTRDIAA  EQU   ISTRTR+176                                               01633000
RTRPOLA  EQU   ISTRTR+172                                               01634000
RTRCADDR EQU   ISTRTR+164                                               01635000
RTRCTADR EQU   ISTRTR+162                                               01636000
RTRCTPOL EQU   ISTRTR+160                                               01637000
RTRCTDIA EQU   ISTRTR+158                                               01638000
RTRRSV03 EQU   ISTRTR+156                                               01639000
RTRRVPT1 EQU   ISTRTR+152                                               01640000
RTRBHSN1 EQU   ISTRTR+144                                               01641000
RTRCRSV2 EQU   RTRCRFLG                                                 01642000
RTRDTRLM EQU   RTRLSCMD                                                 01643000
RTRCRSV1 EQU   RTRCRFLG                                                 01644000
RTRTRMAX EQU   ISTRTR+142                                               01645000
RTRRSV24 EQU   RTRRDFF                                                  01646000
RTRRFDEK EQU   RTRRDFF                                                  01647000
RTRRFANK EQU   RTRRDFF                                                  01648000
RTRRFPFK EQU   RTRRDFF                                                  01649000
RTRRFPEN EQU   RTRRDFF                                                  01650000
RTRRFXCT EQU   RTRRDFF                                                  01651000
RTRRESCT EQU   RTRRDFE                                                  01652000
RTRRESUP EQU   RTRRDFE                                                  01653000
RTRREATT EQU   RTRRDFE                                                  01654000
RTRRECHK EQU   RTRRDFE                                                  01655000
RTRREACR EQU   RTRRDFE                                                  01656000
RTRRSV0A EQU   RTRRDFE                                                  01657000
RTRREBRK EQU   RTRRDFE                                                  01658000
RTRRSV11 EQU   RTRRDFD                                                  01659000
RTRRSV10 EQU   RTRRDFD                                                  01660000
RTRRDBHI EQU   RTRRDFD                                                  01661000
RTRRDBHD EQU   RTRRDFD                                                  01662000
RTRRDBHN EQU   RTRRDFD                                                  01663000
RTRRSV23 EQU   RTRRDFC                                                  01664000
RTRRCXMS EQU   RTRRDFC                                                  01665000
RTRRCMSG EQU   RTRRDFC                                                  01666000
RTRRCBLK EQU   RTRRDFC                                                  01667000
RTRRCPT3 EQU   RTRRDFC                                                  01668000
RTRRCIT2 EQU   RTRRDFC                                                  01669000
RTRRCIT1 EQU   RTRRDFC                                                  01670000
RTRRSV32 EQU   RTRRDFB                                                  01671000
RTRRBEND EQU   RTRRDFB                                                  01672000
RTRRBECT EQU   RTRRDFB                                                  01673000
RTRRSV02 EQU   RTRRDFA                                                  01674000
RTRRACTR EQU   RTRRDFA                                                  01675000
RTRRSV60 EQU   RTRRDFA                                                  01676000
RTRRACDT EQU   RTRRDFA                                                  01677000
RTRRAPT3 EQU   RTRRAALL                                                 01678000
RTRRAPT2 EQU   RTRRAALL                                                 01679000
RTRRAPT1 EQU   RTRRAALL                                                 01680000
RTRRAATN EQU   RTRRDFA                                                  01681000
RTRRSV45 EQU   ISTRTR+132                                               01682000
RTRRSV01 EQU   ISTRTR+130                                               01683000
RTRCTECM EQU   ISTRTR+128                                               01684000
RTRADRPT EQU   RTRADR+1                                                 01685000
RTRRSV22 EQU   RTRFLAG                                                  01686000
RTRVTERM EQU   RTRFLAG                                                  01687000
RTRRSV51 EQU   RTRFLAG                                                  01688000
RTRRBISA EQU   RTRFLAG                                                  01689000
RTRRSV21 EQU   RTRFLAG                                                  01690000
RTRCRPR  EQU   ISTRTR                                                   01691000
RCLRVPT2 EQU   ISTRCL+92                                                01692000
RCLRVPT1 EQU   ISTRCL+88                                                01693000
RCLGPOLA EQU   ISTRCL+84                                                01694000
RCLCTNGP EQU   ISTRCL+82                                                01695000
RCLRSV01 EQU   ISTRCL+80                                                01696000
RCLCTECM EQU   ISTRCL+78                                                01697000
RCLCTETR EQU   ISTRCL+76                                                01698000
RCLGPADR EQU   RCLADR+1                                                 01699000
RCLRSV33 EQU   RCLFLAG                                                  01700000
RCLBATCH EQU   RCLFLAG                                                  01701000
RCLRBISA EQU   RCLFLAG                                                  01702000
RCLRSV22 EQU   RCLFLAG                                                  01703000
RCLPRE   EQU   ISTRCL                                                   01704000
RPTRSV03 EQU   ISTRPT+156                                               01705000
RPTRSV02 EQU   ISTRPT+152                                               01706000
RPTNSNSV EQU   ISTRPT+148                                               01707000
RPTPTHCT EQU   ISTRPT+146                                               01708000
RPTPEPCT EQU   ISTRPT+144                                               01709000
RPTDAFSV EQU   ISTRPT+142                                               01710000
RPTRSV01 EQU   ISTRPT+141                                               01711000
RPTISTAT EQU   RPTFLAG1                                                 01712000
RPTDYNAM EQU   RPTFLAG1                                                 01713000
RPTVYIMM EQU   RPTFLAG1                                                 01714000
RPTVIODN EQU   RPTFLAG1                                                 01715000
RPTONLIN EQU   RPTFLAG1                                                 01716000
RPTHLVPD EQU   RPTFLAG1                                                 01717000
RPTVRYPD EQU   RPTFLAG1                                                 01718000
RPTASLEP EQU   RPTFLAG1                                                 01719000
RPTDIVT  EQU   RPTDITT                                                  01720000
RPTCTNM  EQU   ISTRPT+120                                               01721000
RPTLNDAF EQU   RPTLNCID+2                                               01722000
RPTLNSAF EQU   RPTLNCID                                                 01723000
RPTLN    EQU   ISTRPT                                                   01724000
RLNRVPT2 EQU   ISTRLN+112                                               01725000
RLNNCSPL EQU   ISTRLN+108                                               01726000
RLNX2SW  EQU   ISTRLN+104                                               01727000
@NM00057 EQU   ISTRLN+103                                               01728000
RLNCRRSV EQU   RLNCRFLG                                                 01729000
RLNSWEP  EQU   RLNCRFLG                                                 01730000
RLNSVSKP EQU   RLNLSCMD                                                 01731000
RLNSESLM EQU   RLNLSCMD                                                 01732000
RLNNPRLM EQU   RLNLSCMD                                                 01733000
RLNSWNCP EQU   RLNCRFLG                                                 01734000
RLNACTLN EQU   RLNCRFLG                                                 01735000
RLNPAUSE EQU   ISTRLN+101                                               01736000
RLNPOLMT EQU   ISTRLN+100                                               01737000
RLNACTSN EQU   ISTRLN+98                                                01738000
RLNRESV1 EQU   ISTRLN+97                                                01739000
RLNACTRM EQU   ISTRLN+96                                                01740000
RLNCTSES EQU   ISTRLN+95                                                01741000
RLNRDSLM EQU   ISTRLN+94                                                01742000
RLNAUTOA EQU   ISTRLN+92                                                01743000
RLNRDFD  EQU   RLNRDF+3                                                 01744000
RLNRDFC  EQU   RLNRDF+2                                                 01745000
RLNMULTP EQU   RLNRDFB                                                  01746000
RLNRATRN EQU   RLNRDFB                                                  01747000
RLNRAPOL EQU   RLNRDFB                                                  01748000
RLNTTV   EQU   RLNRDFB                                                  01749000
RLNRSV0B EQU   RLNRDFB                                                  01750000
RLNAUTOD EQU   RLNRDFB                                                  01751000
RLNANSWR EQU   RLNRDFB                                                  01752000
RLNRBUSE EQU   RLNRDFB                                                  01753000
RLNRAPEP EQU   RLNRDFA                                                  01754000
RLNRANCP EQU   RLNRDFA                                                  01755000
RLNRAEP  EQU   RLNRDFA                                                  01756000
RLNIDV   EQU   RLNRDFA                                                  01757000
RLNPORT  EQU   RLNRDFA                                                  01758000
RLNGANSW EQU   RLNRDFA                                                  01759000
RLNRACAN EQU   RLNRACNT                                                 01760000
RLNRACAT EQU   RLNRACNT                                                 01761000
RLNRSV04 EQU   RLNSTAT2                                                 01762000
RLNINUSE EQU   RLNSTAT2                                                 01763000
RLNOHIN  EQU   RLNSTAT2                                                 01764000
RLNRSV03 EQU   RLNSTAT1                                                 01765000
RLNVD    EQU   RLNSTAT1                                                 01766000
RLNINOPP EQU   RLNSTAT1                                                 01767000
RLNINOPL EQU   RLNSTAT1                                                 01768000
RLNLRST  EQU   RLNSTAT1                                                 01769000
RLNTRAP  EQU   RLNSTAT1                                                 01770000
RLNACTCT EQU   ISTRLN+84                                                01771000
RLNCTECM EQU   ISTRLN+82                                                01772000
RLNCTEIN EQU   ISTRLN+80                                                01773000
RLNCTETR EQU   ISTRLN+78                                                01774000
RLNCTECL EQU   ISTRLN+76                                                01775000
RLNCUA   EQU   RLNUCBAD                                                 01776000
RLNRSV01 EQU   RLNFLAG                                                  01777000
RLNRBISA EQU   RLNFLAG                                                  01778000
RLNEAM   EQU   RLNFLAG                                                  01779000
RLNPRE   EQU   ISTRLN                                                   01780000
RGPRVPT2 EQU   ISTRGP+88                                                01781000
RGPRVPT1 EQU   ISTRGP+84                                                01782000
RGPCTECM EQU   ISTRGP+82                                                01783000
RGPCTEIN EQU   ISTRGP+80                                                01784000
RGPCTETR EQU   ISTRGP+78                                                01785000
RGPCTECL EQU   ISTRGP+76                                                01786000
RGPCTELN EQU   ISTRGP+74                                                01787000
RGPRSV03 EQU   ISTRGP+73                                                01788000
RGPRSV02 EQU   RGPFLG                                                   01789000
RGPASDLC EQU   RGPFLG                                                   01790000
RGPABSC  EQU   RGPFLG                                                   01791000
RGPASS   EQU   RGPFLG                                                   01792000
RGPADIL  EQU   RGPFLG                                                   01793000
RGPPRE   EQU   ISTRGP                                                   01794000
RRNRINNM EQU   ISTRRN+248                                               01795000
@NM00056 EQU   ISTRRN+247                                               01796000
RRNRDCUA EQU   ISTRRN+244                                               01797000
RRNLASTE EQU   ISTRRN+240                                               01798000
RRNNCSPL EQU   ISTRRN+236                                               01799000
RRNRPLPT EQU   ISTRRN+232                                               01800000
RRNMSIZE EQU   ISTRRN+228                                               01801000
RRNNCPNM EQU   ISTRRN+221                                               01802000
RRNCTPCC EQU   ISTRRN+220                                               01803000
RRNHBUFS EQU   ISTRRN+218                                               01804000
RRNHLENT EQU   RRNHPRE+1                                                01805000
RRNHLENH EQU   RRNHPRE                                                  01806000
RRNNMNCP EQU   ISTRRN+208                                               01807000
RRNDELAY EQU   ISTRRN+206                                               01808000
RRNRSV04 EQU   ISTRRN+200                                               01809000
RRNRSV88 EQU   RRNNMDPD+7                                               01810000
RRNPUBI  EQU   RRNNMDPD+6                                               01811000
RRNDPLUB EQU   RRNNMDPD                                                 01812000
RRNEPADR EQU   ISTRRN+190                                               01813000
RRNCPLUB EQU   ISTRRN+184                                               01814000
RRNFLUX  EQU   ISTRRN+180                                               01815000
RRNRSV05 EQU   RRNCMFD                                                  01816000
RRNREMPO EQU   RRNCMFD                                                  01817000
RRNCDREC EQU   RRNCMFD                                                  01818000
RRNCDDSI EQU   RRNCMFD                                                  01819000
RRNCDBCK EQU   RRNCMFD                                                  01820000
RRNCDDTL EQU   RRNCMFD                                                  01821000
RRNCDSTD EQU   RRNCMFD                                                  01822000
RRNCDCSP EQU   RRNCMFD                                                  01823000
RRNCCCSL EQU   RRNCMFC                                                  01824000
RRNCCSIM EQU   RRNCMFC                                                  01825000
RRNCCRCM EQU   RRNCMFC                                                  01826000
RRNCCRIM EQU   RRNCMFC                                                  01827000
RRNCCCRC EQU   RRNCMFC                                                  01828000
RRNCCRST EQU   RRNCMFC                                                  01829000
RRNCCRDQ EQU   RRNCMFC                                                  01830000
RRNCCRCN EQU   RRNCMFC                                                  01831000
RRNCBALT EQU   RRNCMFB                                                  01832000
RRNCBMOD EQU   RRNCMFB                                                  01833000
RRNCBNPL EQU   RRNCMFB                                                  01834000
RRNCBRLS EQU   RRNCMFB                                                  01835000
RRNCBRDS EQU   RRNCMFB                                                  01836000
RRNCBDLR EQU   RRNCMFB                                                  01837000
RRNCBDLH EQU   RRNCMFB                                                  01838000
RRNCBDLO EQU   RRNCMFB                                                  01839000
RRNCADGO EQU   RRNCMFA                                                  01840000
RRNCADTD EQU   RRNCMFA                                                  01841000
RRNCACDT EQU   RRNCMFA                                                  01842000
RRNCAMBH EQU   RRNCMFA                                                  01843000
RRNCAATI EQU   RRNCMFA                                                  01844000
RRNCAATG EQU   RRNCMFA                                                  01845000
RRNCAATD EQU   RRNCMFA                                                  01846000
RRNCAALL EQU   RRNCMFA                                                  01847000
RRNRSV55 EQU   RRNRDF+3                                                 01848000
RRNPTASL EQU   RRNRDFB+1                                                01849000
RRNRSV01 EQU   RRNRDFB+1                                                01850000
RRNVYDON EQU   RRNRDFB+1                                                01851000
RRNRBBUP EQU   RRNRDFB+1                                                01852000
RRNRSV03 EQU   RRNRDFB                                                  01853000
RRNRBCT2 EQU   RRNRDFB                                                  01854000
RRNRBCT1 EQU   RRNRDFB                                                  01855000
RRNRBSEC EQU   RRNRDFB                                                  01856000
RRNRBCCT EQU   RRNRDFB                                                  01857000
RRNRBCCL EQU   RRNRDFB                                                  01858000
RRNRSV02 EQU   RRNRDFB                                                  01859000
RRNRBMDL EQU   RRNRDFB                                                  01860000
RRNRAPEP EQU   RRNRDFA                                                  01861000
RRNRANCP EQU   RRNRDFA                                                  01862000
RRNRBREM EQU   RRNRDFA                                                  01863000
RRNRAOLT EQU   RRNRDFA                                                  01864000
RRNRASYN EQU   RRNRDFA                                                  01865000
RRNRADMP EQU   RRNRDFA                                                  01866000
RRNRAIPL EQU   RRNRDFA                                                  01867000
RRNRASHT EQU   RRNRDFA                                                  01868000
RRNCTENT EQU   ISTRRN+170                                               01869000
RRNCTECM EQU   ISTRRN+168                                               01870000
RRNCTEIN EQU   ISTRRN+166                                               01871000
RRNCTETR EQU   ISTRRN+164                                               01872000
RRNCTECL EQU   ISTRRN+162                                               01873000
RRNCTELI EQU   ISTRRN+160                                               01874000
RRNCTEGP EQU   ISTRRN+158                                               01875000
RRNCTBHS EQU   ISTRRN+156                                               01876000
RRNBHSET EQU   ISTRRN+152                                               01877000
RRNTRENT EQU   ISTRRN+148                                               01878000
RRNRLDIP EQU   ISTRRN+147                                               01879000
RRNRNCUA EQU   ISTRRN+144                                               01880000
RRNGRPA  EQU   ISTRRN+140                                               01881000
RRNLUBA  EQU   RRNUCBAD+1                                               01882000
RRNCHQI  EQU   RRNUCBAD                                                 01883000
RRNRSV11 EQU   RRNFLAG                                                  01884000
RRNDSTCT EQU   RRNFLAG                                                  01885000
RRNERPIP EQU   RRNFLAG                                                  01886000
RRNLCDIP EQU   RRNFLAG                                                  01887000
RRNLCDIE EQU   RRNFLAG                                                  01888000
RRNLCSIP EQU   RRNFLAG                                                  01889000
RRNRBISA EQU   RRNFLAG                                                  01890000
RRNRSV89 EQU   RRNFLAG                                                  01891000
RRNPRE   EQU   ISTRRN                                                   01892000
RLCRVPT2 EQU   ISTRLC+80                                                01893000
RLCRVPT1 EQU   ISTRLC+79                                                01894000
RLCLCCUA EQU   ISTRLC+76                                                01895000
RLCUCBAD EQU   RLCADR+1                                                 01896000
RLCRSVDE EQU   RLCFLAG                                                  01897000
RLCACNT  EQU   RLCFLAG                                                  01898000
RLCRSV14 EQU   RLCFLAG                                                  01899000
RLCRBISA EQU   RLCFLAG                                                  01900000
RLCRSV22 EQU   RLCFLAG                                                  01901000
RLCPRE   EQU   ISTRLC                                                   01902000
RAPRVPT2 EQU   ISTRAP+116                                               01903000
RAPRVPT1 EQU   ISTRAP+112                                               01904000
RAPBFACT EQU   ISTRAP+111                                               01905000
RAPRSV17 EQU   RAPFLGC                                                  01906000
RAPRSV16 EQU   RAPFLGC                                                  01907000
RAPRSV15 EQU   RAPFLGC                                                  01908000
RAPRSV14 EQU   RAPFLGC                                                  01909000
RAPRSV13 EQU   RAPFLGC                                                  01910000
RAPRSV12 EQU   RAPFLGC                                                  01911000
RAPRSV11 EQU   RAPFLGC                                                  01912000
RAPRSV10 EQU   RAPFLGC                                                  01913000
RAPRSV09 EQU   RAPFLGB                                                  01914000
RAPASPO  EQU   RAPFLGB                                                  01915000
RAPAPPO  EQU   RAPFLGB                                                  01916000
RAPAACQ  EQU   RAPFLGB                                                  01917000
RAPAPRMT EQU   RAPFLGB                                                  01918000
RAPAPASS EQU   RAPFLGB                                                  01919000
RAPABLCK EQU   RAPFLGB                                                  01920000
RAPALLF  EQU   RAPFLGB                                                  01921000
RAPRSV06 EQU   RAPFLG                                                   01922000
RAPRSV05 EQU   RAPFLG                                                   01923000
RAPRSV04 EQU   RAPFLG                                                   01924000
RAPRSV03 EQU   RAPFLG                                                   01925000
RAPATLGN EQU   RAPFLG                                                   01926000
RAPASLGI EQU   RAPFLG                                                   01927000
RAPAQUI  EQU   RAPFLG                                                   01928000
RAPABLGN EQU   RAPFLG                                                   01929000
RAPACEQD EQU   ISTRAP+106                                               01930000
RAPTRPRE EQU   ISTRAP+104                                               01931000
RAPACEAP EQU   ISTRAP+100                                               01932000
RAPICEAQ EQU   ISTRAP+96                                                01933000
RAPICEAC EQU   ISTRAP+92                                                01934000
RAPICELG EQU   ISTRAP+88                                                01935000
RAPAPPWD EQU   ISTRAP+80                                                01936000
RAPACDEB EQU   ISTRAP+76                                                01937000
RAPACBA  EQU   ISTRAP+72                                                01938000
RAPPRE   EQU   ISTRAP                                                   01939000
RDTVSRPL EQU   ISTRDT+132                                               01940000
RDTCRSPW EQU   ISTRDT+124                                               01941000
RDTCRSDS EQU   ISTRDT+116                                               01942000
@NM00055 EQU   ISTRDT+113                                               01943000
RRNSTCNT EQU   RDTSTCNT                                                 01944000
RRNVYRPH EQU   RDTVYRPH                                                 01945000
RDTTPAB  EQU   ISTRDT+104                                               01946000
RDTDPAB  EQU   ISTRDT+100                                               01947000
RDTEPAB  EQU   ISTRDT+96                                                01948000
RDTVPAB  EQU   ISTRDT+92                                                01949000
RDTRSV01 EQU   RDTFLAGB                                                 01950000
RDTBHSET EQU   RDTFLAGB                                                 01951000
RDTCTCFL EQU   RDTFLAGB                                                 01952000
RDTCTPGD EQU   RDTFLAGB                                                 01953000
RDTPRGDN EQU   RDTFLAGB                                                 01954000
RDTOUERP EQU   RDTFLAGB                                                 01955000
RDTLGCT  EQU   ISTRDT+90                                                01956000
RDTNODID EQU   ISTRDT+89                                                01957000
RDTMAXID EQU   ISTRDT+88                                                01958000
RDTCTSNT EQU   ISTRDT+86                                                01959000
RDTFLAGS EQU   ISTRDT+84                                                01960000
RDTBACK  EQU   ISTRDT+80                                                01961000
RDTFORW  EQU   ISTRDT+76                                                01962000
RDTLEN   EQU   RDTPLEN+1                                                01963000
RDTPRILS EQU   RDTPRIOR                                                 01964000
RDTPRISW EQU   RDTPRIOR                                                 01965000
RDTPRIRN EQU   RDTPRIOR                                                 01966000
RDTPRILC EQU   RDTPRIOR                                                 01967000
RDTPRIAP EQU   RDTPRIOR                                                 01968000
@NM00054 EQU   RDTPRIOR                                                 01969000
RDTPRE   EQU   ISTRDT                                                   01970000
RCPRSV05 EQU   ISTRCPRE+120                                             01971000
RCPRSV04 EQU   ISTRCPRE+116                                             01972000
RCPRSV03 EQU   ISTRCPRE+112                                             01973000
RCPINTA  EQU   RCPLGNIN+16                                              01974000
RCPLGNCT EQU   RCPLGNIN+8                                               01975000
RCPLGNAP EQU   RCPLGNIN                                                 01976000
@NM00053 EQU   RCPPMODE                                                 01977000
RCPRRECD EQU   RCPPMODE                                                 01978000
RCPRBASC EQU   RCPPMODE                                                 01979000
RCPBFLIM EQU   ISTRCPRE+90                                              01980000
RCPBHSI2 EQU   ISTRCPRE+89                                              01981000
RCPBHSI1 EQU   ISTRCPRE+88                                              01982000
RCPACETR EQU   ISTRCPRE+84                                              01983000
RCPICEAQ EQU   ISTRCPRE+80                                              01984000
RCPLNAPA EQU   ISTRCPRE+76                                              01985000
RCPICELN EQU   ISTRCPRE+72                                              01986000
RCPPRE   EQU   ISTRCPRE                                                 01987000
RPRCONID EQU   ISTRPRE+63                                               01988000
RPRCLVPD EQU   RPRFLAGC                                                 01989000
RPRINIMM EQU   RPRFLAGD                                                 01990000
RPRRSV05 EQU   RPRFLAGD                                                 01991000
RPRCONP  EQU   RPRFLAGD                                                 01992000
RPRACTP  EQU   RPRFLAGD                                                 01993000
RPRRSON  EQU   RPRFLAGD                                                 01994000
RPRCONCT EQU   RPRFLAGD                                                 01995000
RPRLTASN EQU   RPRFLAGD                                                 01996000
RPRPTHCT EQU   ISTRPRE+60                                               01997000
RPRSWDAF EQU   ISTRPRE+58                                               01998000
RPRSTPCT EQU   ISTRPRE+56                                               01999000
RPRRVPT1 EQU   ISTRPRE+52                                               02000000
RPRDEVCH EQU   ISTRPRE+44                                               02001000
RPRNCBA  EQU   ISTRPRE+40                                               02002000
RPRNSNEA EQU   ISTRPRE+36                                               02003000
RPRLGONB EQU   ISTRPRE+32                                               02004000
RPRLGONF EQU   ISTRPRE+28                                               02005000
RPRHDTYP EQU   ISTRPRE+27                                               02006000
RPRTIOCT EQU   ISTRPRE+26                                               02007000
RPRPEPCT EQU   ISTRPRE+24                                               02008000
RPRRSV03 EQU   RPRCAUSE                                                 02009000
RPRRSYNC EQU   RPRCAUSE                                                 02010000
RPRCRCPT EQU   RPRCAUSE                                                 02011000
RPRNOSRT EQU   RPRCAUSE                                                 02012000
RPRINTST EQU   RPRFLAGB                                                 02013000
RPRVYIMM EQU   RPRFLAGB                                                 02014000
RPRHLVPD EQU   RPRFLAGB                                                 02015000
RPRONLIN EQU   RPRFLAGB                                                 02016000
RPRVIODN EQU   RPRFLAGB                                                 02017000
RPRAOPN  EQU   RPRFLAGB                                                 02018000
RPRENTVT EQU   RPRFLAGB                                                 02019000
RPRENTVH EQU   RPRFLAGB                                                 02020000
RPRLIVE  EQU   RPRFLAGA                                                 02021000
RPRVRYPD EQU   RPRFLAGA                                                 02022000
RPRENTED EQU   RPRFLAGA                                                 02023000
RPRENTIO EQU   RPRFLAGA                                                 02024000
RPRENTBF EQU   RPRFLAGA                                                 02025000
RPRTIED  EQU   RPRFLAGA                                                 02026000
RPRINV   EQU   RPRFLAGA                                                 02027000
RPRACT   EQU   RPRFLAGA                                                 02028000
RPRENTRY EQU   ISTRPRE+20                                               02029000
RPRPELEN EQU   ISTRPRE+18                                               02030000
RPRELEN  EQU   ISTRPRE+16                                               02031000
RPRRLOCK EQU   ISTRPRE+12                                               02032000
RPRDAF   EQU   RPRCOMID+2                                               02033000
RPRSAF   EQU   RPRCOMID                                                 02034000
RPRNAME  EQU   ISTRPRE                                                  02035000
ISTPDAVP EQU   ISTAVT+40                                                02036000
ISTAVR01 EQU   ISTAVT+38                                                02037000
ISTVTTP  EQU   ISTAVT+36                                                02038000
ISTAGTWT EQU   ISTAVT+34                                                02039000
ISTATRT  EQU   ISTAVT+32                                                02040000
ISTARID  EQU   ISTAVT+30                                                02041000
ISTX1    EQU   ISTAVT+29                                                02042000
ISTPHNM  EQU   ISTAVT+24                                                02043000
ISTAPSEX EQU   ISTAVT+20                                                02044000
ISTVTTIK EQU   ISTAVT+18                                                02045000
AVTASID  EQU   ISTAVT+16                                                02046000
ISTAPSTA EQU   ISTAVT+12                                                02047000
ISTAS53  EQU   ISTAVT+8                                                 02048000
ISTAHIP  EQU   ISTAS49                                                  02049000
ISTACVT  EQU   ISTAVT                                                   02050000
FMCFLRSV EQU   FMCFLGB                                                  02051000
FMCFLGA8 EQU   FMCFLGB                                                  02052000
FMCCLRPH EQU   FMCVS1+45                                                02053000
FMCRSV0X EQU   FMCCVFLG                                                 02054000
FMCVYRPH EQU   FMCCVFLG                                                 02055000
FMCZV004 EQU   FMCVS1+40                                                02056000
FMCLOCK2 EQU   FMCVS1+36                                                02057000
@NM00052 EQU   FMCZFLG2                                                 02058000
FMCZF027 EQU   FMCZFLG2                                                 02059000
FMCZF026 EQU   FMCZFLG2                                                 02060000
FMCSEQ1B EQU   FMCSEQ1                                                  02061000
FMCSEQ1T EQU   FMCSEQ1                                                  02062000
FMCZX006 EQU   FMCVS1+33                                                02063000
FMCZX005 EQU   FMCVS1+32                                                02064000
FMCZX004 EQU   FMCVS1+31                                                02065000
FMCZX003 EQU   FMCVS1+30                                                02066000
FMCZX002 EQU   FMCVS1+29                                                02067000
FMCZV001 EQU   FMCVS1+24                                                02068000
FMCAWATQ EQU   FMCLCPAQ+1                                               02069000
@NM00051 EQU   FMCLCPAQ                                                 02070000
FMCLCPB2 EQU   FMCLCPBQ+1                                               02071000
FMCLCPB1 EQU   FMCLCPBQ                                                 02072000
FMCASCDQ EQU   FMCSHEAQ+1                                               02073000
@NM00050 EQU   FMCSHEAQ                                                 02074000
FMCSHEDQ EQU   FMCVS1+8                                                 02075000
FMCZFCSQ EQU   FMCVS1+6                                                 02076000
FMCZF025 EQU   FMCZFLAG+3                                               02077000
FMCZF024 EQU   FMCZFLAG+3                                               02078000
FMCZF023 EQU   FMCZFLAG+3                                               02079000
FMCZF022 EQU   FMCZFLAG+3                                               02080000
FMCZF021 EQU   FMCZFLAG+3                                               02081000
FMCZF020 EQU   FMCZFLAG+3                                               02082000
FMCZF019 EQU   FMCZFLAG+3                                               02083000
FMCZF018 EQU   FMCZFLAG+3                                               02084000
FMCZF017 EQU   FMCZFLAG+2                                               02085000
FMCZF016 EQU   FMCZFLAG+2                                               02086000
FMCZF015 EQU   FMCZFLAG+2                                               02087000
FMCZF014 EQU   FMCZFLAG+2                                               02088000
FMCZF013 EQU   FMCZFLAG+2                                               02089000
FMCZF012 EQU   FMCZFLAG+2                                               02090000
FMCZF011 EQU   FMCZFLAG+2                                               02091000
FMCZF010 EQU   FMCZFLAG+2                                               02092000
FMCZF00F EQU   FMCZFLAG+1                                               02093000
FMCZF00E EQU   FMCZFLAG+1                                               02094000
FMCZF00D EQU   FMCZFLAG+1                                               02095000
FMCZF00C EQU   FMCZFLAG+1                                               02096000
FMCZF00B EQU   FMCZFLAG+1                                               02097000
FMCRSV10 EQU   FMCZFLAG+1                                               02098000
FMCZF009 EQU   FMCZFLAG+1                                               02099000
FMCZFD06 EQU   FMCZF006+1                                               02100000
FMCZFB06 EQU   FMCZF006                                                 02101000
FMCZFA06 EQU   FMCZF006                                                 02102000
FMCZF005 EQU   FMCZFLAG                                                 02103000
FMCZF004 EQU   FMCZFLAG                                                 02104000
FMCZF003 EQU   FMCZFLAG                                                 02105000
FMCZF002 EQU   FMCZFLAG                                                 02106000
FMCZF001 EQU   FMCZFLAG                                                 02107000
FMCFRESA EQU   ISTFMCB+228                                              02108000
FMCSCSQN EQU   FMCSNCTL+2                                               02109000
FMCSCCTL EQU   FMCSNCTL+1                                               02110000
FMCSTCTL EQU   FMCSCFLG                                                 02111000
FMCSCCLO EQU   FMCSCFLG                                                 02112000
FMCAPRO  EQU   FMCSCFLG                                                 02113000
FMCLURO  EQU   FMCSCFLG                                                 02114000
FMCOBSAC EQU   FMCSCFLG                                                 02115000
FMCIBSAC EQU   FMCSCFLG                                                 02116000
FMCFBRE  EQU   ISTFMCB+220                                              02117000
FMCFBXM  EQU   FMCZV002                                                 02118000
FMCASEGQ EQU   ISTFMCB+212                                              02119000
FMCRDTPT EQU   ISTFMCB+208                                              02120000
FMCLOCK  EQU   ISTFMCB+204                                              02121000
FMCSEGD  EQU   FMCSSEGQ                                                 02122000
FMCRSPLM EQU   ISTFMCB+198                                              02123000
FMCPSTRS EQU   ISTFMCB+196                                              02124000
@NM00049 EQU   FMCRRESP                                                 02125000
FMCTSLHA EQU   FMCRRESP                                                 02126000
FMCFRRN  EQU   FMCRRESP                                                 02127000
FMCFME   EQU   FMCRRESP                                                 02128000
FMCFEX   EQU   FMCRRESP                                                 02129000
FMCFPE   EQU   FMCRRESP                                                 02130000
FMCCTLB  EQU   ISTFMCB+194                                              02131000
FMCBSQNO EQU   FMCCLSEQ+2                                               02132000
FMCTSQNO EQU   FMCCLSEQ                                                 02133000
FMCOBPRG EQU   FMCMODEB                                                 02134000
FMCIBPRG EQU   FMCMODEB                                                 02135000
FMCRESOT EQU   FMCMODEB                                                 02136000
FMCRSTSR EQU   FMCMODEB                                                 02137000
FMCLUQ   EQU   FMCMODEB                                                 02138000
FMCAPQ   EQU   FMCMODEB                                                 02139000
FMCCLEAR EQU   FMCMODEB                                                 02140000
FMCHOLD  EQU   FMCMODEB                                                 02141000
FMCIPSEQ EQU   ISTFMCB+188                                              02142000
FMCLUSTR EQU   ISTFMCB+187                                              02143000
FMCRSV87 EQU   FMCSTAT2                                                 02144000
FMCSEQI  EQU   FMCSTAT2                                                 02145000
FMCCPIP  EQU   FMCSTAT2                                                 02146000
FMCALIPR EQU   FMCSTAT2                                                 02147000
FMCIAIO  EQU   FMCSTAT2                                                 02148000
FMCZF00A EQU   FMCSTAT2                                                 02149000
FMCVPIP  EQU   FMCSTAT2                                                 02150000
FMCBHSET EQU   ISTFMCB+185                                              02151000
FMCPRMRC EQU   FMCCLEXT+20                                              02152000
FMCRSV89 EQU   FMCPSTAT                                                 02153000
FMCPCLSD EQU   FMCPSTAT                                                 02154000
FMCDDOCD EQU   FMCPSTAT                                                 02155000
FMCIDVFD EQU   FMCPSTAT                                                 02156000
FMCELKST EQU   FMCPSTAT                                                 02157000
FMCRSV88 EQU   FMCPSCMD                                                 02158000
FMCRDBLK EQU   FMCPSCMD                                                 02159000
FMCDSEOC EQU   FMCPSCMD                                                 02160000
FMCPURGE EQU   FMCPSCMD                                                 02161000
FMCRESTI EQU   FMCPSCMD                                                 02162000
FMCCNTCT EQU   FMCPSCMD                                                 02163000
FMCINVT  EQU   FMCPSCMD                                                 02164000
FMCFLGB7 EQU   FMCFLGCL                                                 02165000
FMCFLGB6 EQU   FMCFLGCL                                                 02166000
FMCFLGB5 EQU   FMCFLGCL                                                 02167000
FMCFLGB4 EQU   FMCFLGCL                                                 02168000
FMCFLGB3 EQU   FMCFLGCL                                                 02169000
FMCFLGB2 EQU   FMCFLGCL                                                 02170000
FMCFLGB1 EQU   FMCFLGCL                                                 02171000
FMCFLGB0 EQU   FMCFLGCL                                                 02172000
FMCFLGA7 EQU   FMCFLGA                                                  02173000
FMCFLGA6 EQU   FMCFLGA                                                  02174000
FMCFLGA5 EQU   FMCFLGA                                                  02175000
FMCFLGA4 EQU   FMCFLGA                                                  02176000
FMCFLGA3 EQU   FMCFLGA                                                  02177000
FMCFLGA2 EQU   FMCFLGA                                                  02178000
FMCFLGA1 EQU   FMCFLGA                                                  02179000
FMCFLGA0 EQU   FMCFLGA                                                  02180000
FMCDCLOK EQU   FMCCLEXT+12                                              02181000
FMCRAFM  EQU   FMCCLEXT+8                                               02182000
FMCFBPTR EQU   FMCFBA+1                                                 02183000
FMCFBRSV EQU   FMCFBA                                                   02184000
FMCRPLPT EQU   FMCRPLA+1                                                02185000
FMCRPLRS EQU   FMCRPLA                                                  02186000
FMCPRCLS EQU   FMCCVAL                                                  02187000
FMCIBCE  EQU   FMCCVAL                                                  02188000
FMCONLY  EQU   FMCOBCE                                                  02189000
FMCLAST  EQU   FMCOBCE                                                  02190000
FMCMIDLE EQU   FMCOBCE                                                  02191000
FMCFIRST EQU   FMCOBCE                                                  02192000
FMCCPCNT EQU   FMCPACPC                                                 02193000
FMCMPCNT EQU   FMCPACEM                                                 02194000
FMCNPCNT EQU   FMCPACEN                                                 02195000
FMCCONF  EQU   FMCSSTAT                                                 02196000
FMCPURCH EQU   FMCSSTAT                                                 02197000
FMCNSALU EQU   FMCSSTAT                                                 02198000
FMCBIP   EQU   FMCSSTAT                                                 02199000
FMCSDTR  EQU   FMCSSTAT                                                 02200000
FMCUIPI  EQU   FMCSSTAT                                                 02201000
FMCCIPI  EQU   FMCSSTAT                                                 02202000
FMCSNBI  EQU   FMCSSTAT                                                 02203000
FMCRVD01 EQU   ISTFMCB+158                                              02204000
FMCISSN  EQU   ISTFMCB+156                                              02205000
FMCOASN  EQU   FMCNXOSC                                                 02206000
FMCOSSN  EQU   FMCNXCFM                                                 02207000
FMCSIP   EQU   FMCSIPA                                                  02208000
FMCEXLST EQU   ISTFMCB+144                                              02209000
FMCPAB5  EQU   ISTFMCB+128                                              02210000
FMCPAB1  EQU   ISTFMCB+64                                               02211000
FMCFASYA EQU   ISTFMCB+60                                               02212000
FMCMODE  EQU   ISTFMCB+52                                               02213000
FMCPROCD EQU   ISTFMCB+48                                               02214000
FMCVWT   EQU   ISTFMCB+44                                               02215000
FMCRPLH  EQU   ISTFMCB+40                                               02216000
FMCBUFNB EQU   FMCCMPS1+2                                               02217000
FMCBUFLM EQU   FMCCMPS1                                                 02218000
FMCDEBA  EQU   ISTFMCB+32                                               02219000
@NM00048 EQU   FMCCMDFL                                                 02220000
FMCSNA   EQU   FMCCMDFL                                                 02221000
FMCVSNA  EQU   FMCCMDFL                                                 02222000
FMCCMDR  EQU   FMCCMDFL                                                 02223000
@NM00047 EQU   ISTFMCB+30                                               02224000
@NM00046 EQU   FMCSTAT1                                                 02225000
FMCLTCLS EQU   FMCSTAT1                                                 02226000
FMCHPURG EQU   FMCSTAT1                                                 02227000
FMCVSP2  EQU   FMCSTAT1                                                 02228000
FMCVSP1  EQU   FMCSTAT                                                  02229000
FMCLTEAS EQU   FMCSTAT                                                  02230000
FMCZF007 EQU   FMCSTAT                                                  02231000
FMCDEDSC EQU   FMCSTAT                                                  02232000
FMCDEVOF EQU   FMCSTAT                                                  02233000
FMCDAPT  EQU   FMCSTAT                                                  02234000
FMCPRMTE EQU   FMCSTAT                                                  02235000
FMCPRMTR EQU   FMCSTAT                                                  02236000
FMCUSFLD EQU   ISTFMCB+24                                               02237000
FMCFMCBA EQU   ISTFMCB+20                                               02238000
FMCDNCBA EQU   ISTFMCB+16                                               02239000
FMCDVTA  EQU   ISTFMCB+12                                               02240000
FMCTSKID EQU   ISTFMCB+8                                                02241000
FMCNXTCB EQU   ISTFMCB+4                                                02242000
FMCLNGTH EQU   ISTFMCB+1                                                02243000
FMCTYPE  EQU   ISTFMCB                                                  02244000
PROSRDEF EQU   PROSETM4                                                 02245000
PRORSV47 EQU   PROSETM4                                                 02246000
PROSCON  EQU   PROSETM4                                                 02247000
PRORSV46 EQU   PROSETM3                                                 02248000
PROSMONT EQU   PROSETM3                                                 02249000
PRORSV45 EQU   PROSETM3                                                 02250000
PROSNTO  EQU   PROSETM3                                                 02251000
PRORSV44 EQU   PROSETM3                                                 02252000
PRORSV43 EQU   PROSETM2                                                 02253000
PROSNTFL EQU   PROSETM2                                                 02254000
PRORSV42 EQU   PROSETM2                                                 02255000
PRORSV41 EQU   PROPROCS                                                 02256000
PROMODC  EQU   PROPROC4                                                 02257000
PROMODT  EQU   PROPROC4                                                 02258000
PROMODM  EQU   PROPROC4                                                 02259000
PROMODB  EQU   PROPROC4                                                 02260000
PRORSV14 EQU   PROPROC4                                                 02261000
PRORSV13 EQU   PROPROC4                                                 02262000
PRORSV12 EQU   PROPROC4                                                 02263000
PROEIB   EQU   PROPROC4                                                 02264000
PRORSV11 EQU   PROPROC3                                                 02265000
PROMONT2 EQU   PROPROC3                                                 02266000
PROMONIT EQU   PROPROC3                                                 02267000
PROSUBLK EQU   PROPROC3                                                 02268000
PRONTO   EQU   PROPROC3                                                 02269000
PROLGIN  EQU   PROPROC3                                                 02270000
PROERPI  EQU   PROPROC3                                                 02271000
PRORSV07 EQU   PROPROC3                                                 02272000
PROCFTX  EQU   PROPROC2                                                 02273000
PROEMLC  EQU   PROPROC2                                                 02274000
PRONTFL  EQU   PROPROC2                                                 02275000
PRORSV05 EQU   PROPROC2                                                 02276000
PRORSV04 EQU   PROPROC2                                                 02277000
PROLGOT  EQU   PROPROC2                                                 02278000
PROERPO  EQU   PROPROC2                                                 02279000
PRORSV03 EQU   PROPROC2                                                 02280000
PRORPLC  EQU   PROPROC1                                                 02281000
PROCS    EQU   PROPROC1                                                 02282000
PROCA    EQU   PROPROC1                                                 02283000
PRORESPX EQU   PROPROC1                                                 02284000
PRODFASY EQU   PROPROC1                                                 02285000
PROXPOPT EQU   PROPROC1                                                 02286000
PROTRUNC EQU   PROPROC1                                                 02287000
PROASYIP EQU   PROPROC1                                                 02288000
ZRCZDFWB EQU   ISTZRCVT+120                                             02289000
ZRCZIFJB EQU   ISTZRCVT+116                                             02290000
ZRCZKFCB EQU   ISTZRCVT+112                                             02291000
ZRCZKFBB EQU   ISTZRCVT+108                                             02292000
ZRCZIFTB EQU   ISTZRCVT+104                                             02293000
ZRCZIFSB EQU   ISTZRCVT+100                                             02294000
ZRCZIFX0 EQU   ISTZRCVT+96                                              02295000
ZRCZIFAB EQU   ISTZRCVT+88                                              02296000
ZRCZIFBB EQU   ISTZRCVT+76                                              02297000
ZRCZIFCB EQU   ISTZRCVT+72                                              02298000
ZRCZIFDB EQU   ISTZRCVT+68                                              02299000
ZRCZIFEB EQU   ISTZRCVT+64                                              02300000
ZRCRSV01 EQU   ISTZRCVT+60                                              02301000
ZRCZGFBB EQU   ISTZRCVT+56                                              02302000
ZRCZIFQB EQU   ISTZRCVT+52                                              02303000
ZRCZIFNB EQU   ISTZRCVT+48                                              02304000
ZRCZIFOB EQU   ISTZRCVT+44                                              02305000
ZRCZIFMB EQU   ISTZRCVT+40                                              02306000
ZRCZIFKB EQU   ISTZRCVT+36                                              02307000
ZRCZIFLB EQU   ISTZRCVT+32                                              02308000
@NM00045 EQU   ISTZRCVT+28                                              02309000
@NM00044 EQU   ISTZRCVT+24                                              02310000
@NM00043 EQU   ISTZRCVT+20                                              02311000
@NM00042 EQU   ISTZRCVT+16                                              02312000
@NM00041 EQU   ISTZRCVT+12                                              02313000
ZRCZJF0B EQU   ISTZRCVT+8                                               02314000
ZRCZIF0B EQU   ISTZRCVT                                                 02315000
ZIBLNG1  EQU   ZIBFSM                                                   02316000
ZIBCHAIN EQU   ISTZIBUF                                                 02317000
FSBFDB   EQU   ISTFSB+32                                                02318000
FSBRSV01 EQU   FSBFSB+30                                                02319000
FSBTHCNT EQU   FSBFSB+28                                                02320000
FSBRLRSV EQU   FSBRLSTS                                                 02321000
FSBCFTX  EQU   FSBRLSTS                                                 02322000
FSBICNCB EQU   FSBMSGID                                                 02323000
FSBSSOC  EQU   FSBSS2                                                   02324000
FSBSSCC  EQU   FSBSS2                                                   02325000
FSBSSDC  EQU   FSBSS2                                                   02326000
FSBSSEC  EQU   FSBSS2                                                   02327000
FSBSSIR  EQU   FSBSS2                                                   02328000
FSBSSCR  EQU   FSBSS2                                                   02329000
@NM00034 EQU   FSBSS2                                                   02330000
@NM00033 EQU   FSBSS1                                                   02331000
FSBSSDE  EQU   FSBSS1                                                   02332000
FSBSSUS  EQU   FSBSS1                                                   02333000
@NM00032 EQU   FSBSS1                                                   02334000
FSBSOHI  EQU   FSBERC                                                   02335000
FSBLGI   EQU   FSBERC                                                   02336000
FSBLMRI  EQU   FSBFBMI                                                  02337000
FSBETI   EQU   FSBERC                                                   02338000
FSBEMI   EQU   FSBERC                                                   02339000
FSBEBI   EQU   FSBERC                                                   02340000
FSBXLCI  EQU   FSBXCODE                                                 02341000
FSBXFINS EQU   FSBXCODE                                                 02342000
FSBXNORM EQU   FSBXFSTS                                                 02343000
FSBSCODE EQU   FSBSYSRS                                                 02344000
FSBSERR  EQU   FSBSYSRS                                                 02345000
FSBCMD   EQU   FSBSEQ                                                   02346000
FSBDTRCE EQU   FSBFLAGS                                                 02347000
FSBASBTU EQU   FSBFLAGS                                                 02348000
FSBINPET EQU   FSBFLAGS                                                 02349000
FSBNONCB EQU   FSBFLAGS                                                 02350000
FSBLBIND EQU   FSBFLAGS                                                 02351000
FSBFFIND EQU   FSBFLAGS                                                 02352000
FSBACIND EQU   FSBFLAGS                                                 02353000
FSBRFIND EQU   FSBFLAGS                                                 02354000
FSBGATE  EQU   FSBFSBA                                                  02355000
FSBRSV02 EQU   FSBSFLGS                                                 02356000
FSBPGBUF EQU   FSBSFLGS                                                 02357000
FSBMNSDA EQU   FSBMNRCD                                                 02358000
FSBMNOA  EQU   FSBMNRCD                                                 02359000
FSBMNDIF EQU   FSBMNRCD                                                 02360000
FSBMNEOP EQU   FSBMNRCD                                                 02361000
FSBMNDNU EQU   FSBMNRCD                                                 02362000
FSBMNATN EQU   FSBMNRCD                                                 02363000
FSBMNRVI EQU   FSBMNRCD                                                 02364000
FSBMNELI EQU   FSBMNRCD                                                 02365000
FSBLNGTH EQU   FSBFSB+1                                                 02366000
FSBTYPE  EQU   FSBFSB                                                   02367000
BTUEXTR  EQU   ISTBTU+19                                                02368000
BTURSV02 EQU   BTUSYSTR                                                 02369000
BTUPHASE EQU   BTUSYSTR                                                 02370000
BTURSV01 EQU   BTUSYSTR                                                 02371000
BTUPAD   EQU   BTURH+3                                                  02372000
BTURH3   EQU   BTURH+2                                                  02373000
BTURH2   EQU   BTURH+1                                                  02374000
BTURH1   EQU   BTURH                                                    02375000
BTUDCF   EQU   BTUBTH+8                                                 02376000
BTUZRTSC EQU   BTURQFLG+1                                               02377000
BTUZRT0B EQU   BTURQFLG+1                                               02378000
BTUZRT0A EQU   BTURQFLG+1                                               02379000
BTUZRT09 EQU   BTURQFLG+1                                               02380000
BTUZRT08 EQU   BTURQFLG+1                                               02381000
BTUZRT07 EQU   BTURQFLG                                                 02382000
BTUZRT06 EQU   BTURQFLG                                                 02383000
BTUZRT05 EQU   BTURQFLG                                                 02384000
BTUZRT04 EQU   BTURQFLG                                                 02385000
BTUZRT03 EQU   BTURQFLG                                                 02386000
BTUZRT02 EQU   BTURQFLG                                                 02387000
BTUZRT01 EQU   BTURQFLG                                                 02388000
BTUZRT00 EQU   BTURQFLG                                                 02389000
BTUSORCE EQU   BTUBTH+4                                                 02390000
BTUCDF   EQU   BTUFID+1                                                 02391000
BTUSCF   EQU   BTUFID+1                                                 02392000
BTUPRY   EQU   BTUFID+1                                                 02393000
BTUASFL  EQU   BTUFID                                                   02394000
BTUPSFL  EQU   BTUFID                                                   02395000
BTUMPF   EQU   BTUFID                                                   02396000
BTUFIDNO EQU   BTUFID                                                   02397000
TH2SNF   EQU   ISTTH2+4                                                 02398000
TH2OAF   EQU   ISTTH2+3                                                 02399000
TH2DAF   EQU   ISTTH2+2                                                 02400000
TH2CDF   EQU   TH2FLAG1+1                                               02401000
TH2SEF   EQU   TH2FLAG1+1                                               02402000
TH2PYF   EQU   TH2FLAG1+1                                               02403000
TH2AFI   EQU   TH2FLAG1                                                 02404000
TH2PSI   EQU   TH2FLAG1                                                 02405000
TH2CMPLI EQU   TH2MPF                                                   02406000
TH2RHI   EQU   TH2MPF                                                   02407000
TH2FID   EQU   TH2FLAG1                                                 02408000
THDCF    EQU   ISTTH+8                                                  02409000
THSNF    EQU   ISTTH+6                                                  02410000
THOAF    EQU   ISTTH+4                                                  02411000
THDAF    EQU   ISTTH+2                                                  02412000
THCDF    EQU   THFLGB                                                   02413000
THSEF    EQU   THFLGB                                                   02414000
THPYF    EQU   THFLGB                                                   02415000
THAFI    EQU   THFLGA                                                   02416000
THPSI    EQU   THFLGA                                                   02417000
THCMPLI  EQU   THMPF                                                    02418000
THRHI    EQU   THMPF                                                    02419000
THFID    EQU   THFLAG1                                                  02420000
LHVDATA  EQU   ISTLH+4                                                  02421000
LHFUNCT  EQU   ISTLH+3                                                  02422000
@NM00031 EQU   ISTLH+2                                                  02423000
LHLEN    EQU   ISTLH                                                    02424000
FDBDATCT EQU   ISTFDB+8                                                 02425000
FDBDATAA EQU   ISTFDB+4                                                 02426000
FDBFDBA  EQU   ISTFDB                                                   02427000
BDURSV04 EQU   BDUFLAGS                                                 02428000
BDURTOE  EQU   BDUFLAGS                                                 02429000
BDUSTPR  EQU   BDUFLAGS                                                 02430000
BDURSV03 EQU   BDUFLAGS                                                 02431000
BDUALT   EQU   BDUFUNC                                                  02432000
BDUNACK  EQU   BDUFUNC                                                  02433000
BDUACK   EQU   BDUFUNC                                                  02434000
BDUTRPM  EQU   BDUFUNC                                                  02435000
BDUFBMI  EQU   BDUFUNC                                                  02436000
BDULDGPH EQU   BDUFUNC                                                  02437000
BDUHEADP EQU   BDUFUNC                                                  02438000
BDUSOH   EQU   BDUCHECK                                                 02439000
BDURSV01 EQU   BDUMODIF                                                 02440000
BDUMOD0  EQU   BDUMOD1                                                  02441000
ZPSZDFQR EQU   ISTZPSVT+80                                              02442000
ZPSZDFPR EQU   ISTZPSVT+76                                              02443000
ZPSZDFXR EQU   ISTZPSVT+72                                              02444000
ZPSZWRD5 EQU   ISTZPSVT+68                                              02445000
ZPSZWRD4 EQU   ISTZPSVT+64                                              02446000
ZPSZDFMB EQU   ISTZPSVT+60                                              02447000
ZPSZDFMF EQU   ISTZPSVT+56                                              02448000
ZPSZDFNB EQU   ISTZPSVT+52                                              02449000
@NM00030 EQU   ISTZPSVT+48                                              02450000
ZPSZDFF0 EQU   ISTZPSVT+44                                              02451000
ZPSZTRTT EQU   ISTZPSVT+40                                              02452000
ZPSZBFOB EQU   ISTZPSVT+36                                              02453000
ZPSZBFMB EQU   ISTZPSVT+32                                              02454000
ZPSZBFZ0 EQU   ISTZPSVT+28                                              02455000
ZPSZBFY0 EQU   ISTZPSVT+24                                              02456000
ZPSZDFI0 EQU   ISTZPSVT+20                                              02457000
ZPSZDFH0 EQU   ISTZPSVT+12                                              02458000
ZPSZDFD0 EQU   ISTZPSVT+8                                               02459000
ZPSZDFC0 EQU   ISTZPSVT+4                                               02460000
ZPSZDFA0 EQU   ISTZPSVT                                                 02461000
DNCZC001 EQU   DNCOS+40                                                 02462000
DNCLOCK  EQU   DNCOS+36                                                 02463000
DNCZV005 EQU   DNCOS+32                                                 02464000
DNCZV004 EQU   DNCOS+28                                                 02465000
DNCZV003 EQU   DNCOS+24                                                 02466000
DNCZV002 EQU   DNCOS+21                                                 02467000
DNCZX001 EQU   DNCOS+20                                                 02468000
DNCZV001 EQU   DNCOS+17                                                 02469000
DNCZX003 EQU   DNCOS+16                                                 02470000
DNCZV000 EQU   DNCOS+12                                                 02471000
DNCSESCQ EQU   DNCOS+8                                                  02472000
DNCSESIQ EQU   DNCOS+4                                                  02473000
DNCLICP  EQU   DNCBSCED                                                 02474000
DNCZF008 EQU   DNCZFLGS+1                                               02475000
DNCZPSRD EQU   DNCZFLGS+1                                               02476000
DNCPSOL  EQU   DNCZFLGS+1                                               02477000
DNCZF007 EQU   DNCZFLGS+1                                               02478000
DNCZF006 EQU   DNCZFLGS+1                                               02479000
DNCZF005 EQU   DNCZFLGS+1                                               02480000
DNCZF004 EQU   DNCZFLGS+1                                               02481000
DNCZF003 EQU   DNCZFLGS                                                 02482000
DNCZF002 EQU   DNCZFLGS                                                 02483000
DNCDISC  EQU   DNCZFLGS                                                 02484000
DNCINVIT EQU   DNCZFLGS                                                 02485000
DNCZF001 EQU   DNCZFLGS                                                 02486000
DNCMODE  EQU   ISTDNCB+49                                               02487000
DNCBHSET EQU   ISTDNCB+48                                               02488000
NCBRSV01 EQU   ISTNCB+46                                                02489000
NCBSWDAF EQU   ISTNCB+44                                                02490000
NCBDEVCH EQU   ISTNCB+36                                                02491000
NCBFMCBP EQU   ISTNCB+32                                                02492000
NCBLTRC  EQU   ISTNCB+30                                                02493000
NCBRVPT1 EQU   ISTNCB+28                                                02494000
NCBNMLLN EQU   NCBFLAGS+3                                               02495000
@NM00029 EQU   NCBFLAG1                                                 02496000
NCBFORCE EQU   NCBFLAG1                                                 02497000
NCBTTF   EQU   NCBFLAG1                                                 02498000
NCBRSYNC EQU   NCBFLAG1                                                 02499000
NCBRSTRT EQU   NCBFLAG1                                                 02500000
NCBCONF  EQU   NCBFLAG1                                                 02501000
NCBSNAI  EQU   NCBFLAG1                                                 02502000
NCBFLTIO EQU   NCBFTRIO                                                 02503000
NCBCSTAT EQU   NCBFLAGS                                                 02504000
NCBNCSL  EQU   ISTNCB+22                                                02505000
NCBNCBA  EQU   ISTNCB+20                                                02506000
NCBFMCBA EQU   ISTNCB+16                                                02507000
NCBNSNA  EQU   ISTNCB+12                                                02508000
NCBTSKID EQU   ISTNCB+8                                                 02509000
NCBDAF   EQU   ISTNCB+2                                                 02510000
NCBLNGTH EQU   ISTNCB+1                                                 02511000
NCBTYPE  EQU   ISTNCB                                                   02512000
DEVRSV03 EQU   ISTDEVCH+5                                               02513000
DEVPHYSA EQU   ISTDEVCH+4                                               02514000
DEVCSLPN EQU   DEVCHAR3                                                 02515000
DEVCSTCL EQU   DEVCHAR3                                                 02516000
DEVCCHEK EQU   DEVCHAR3                                                 02517000
DEVCATTN EQU   DEVCHAR3                                                 02518000
DEVCSWL  EQU   DEVFCCTL                                                 02519000
DEVCRVB  EQU   DEVFCCTL                                                 02520000
DEVCSSL  EQU   DEVFCCTL                                                 02521000
DEVCBSC  EQU   DEVFCCTL                                                 02522000
DEVMCODE EQU   ISTDEVCH+2                                               02523000
DEVCHAR2 EQU   DEVTCODE                                                 02524000
DEVRSV01 EQU   DEVCHAR                                                  02525000
DEVCCTL  EQU   DEVCHAR                                                  02526000
DEVNNSPT EQU   DEVCHAR                                                  02527000
DEVSPS   EQU   DEVCHAR                                                  02528000
DEVSUBND EQU   DEVCHAR                                                  02529000
DEVCONVR EQU   DEVCHAR                                                  02530000
DEVOTPUT EQU   DEVCHAR                                                  02531000
DEVINPUT EQU   DEVCHAR                                                  02532000
ATCAOS   EQU   ISTATCVT+1584                                            02533000
ATCPOPAB EQU   ATCAOSM+640                                              02534000
ATCVIOPM EQU   ATCAOSM+636                                              02535000
ATCTPMMI EQU   ATCAOSM+632                                              02536000
ATCTPMPB EQU   ATCAOSM+600                                              02537000
ATCRSV88 EQU   ATCAOSM+596                                              02538000
ATCRPLCT EQU   ATCAOSM+594                                              02539000
ATCCRACT EQU   ATCAOSM+592                                              02540000
ATCSRBCT EQU   ATCAOSM+590                                              02541000
ATCRSV75 EQU   ATCAOSM+589                                              02542000
ATCRSV66 EQU   ATCZFLAG                                                 02543000
ATCZF001 EQU   ATCZFLAG                                                 02544000
ATCTPCP1 EQU   ATCAOSM+584                                              02545000
ATCTPCP0 EQU   ATCAOSM+580                                              02546000
ATCAICTN EQU   ATCAOSM+576                                              02547000
ATCZR01  EQU   ATCAOSM+572                                              02548000
ATCMPLTA EQU   ATCAOSM+568                                              02549000
ATCASCB  EQU   ATCAOSM+564                                              02550000
ATCAP86  EQU   ATCAOSM+560                                              02551000
ATCAP85  EQU   ATCAOSM+556                                              02552000
ATCAP84  EQU   ATCAOSM+552                                              02553000
ATCAP83  EQU   ATCAOSM+548                                              02554000
ATCAP82  EQU   ATCAOSM+544                                              02555000
ATCAP69  EQU   ATCAOSM+540                                              02556000
ATCAP66  EQU   ATCAOSM+536                                              02557000
ATCAP62  EQU   ATCAOSM+532                                              02558000
ATCAPC59 EQU   ATCAOSM+528                                              02559000
ATCAP56  EQU   ATCAOSM+524                                              02560000
ATCAP55  EQU   ATCAOSM+520                                              02561000
ATCRCFY0 EQU   ATCAOSM+516                                              02562000
ATCAP41  EQU   ATCAOSM+512                                              02563000
ATCAPC25 EQU   ATCAOSM+508                                              02564000
ATCAP23  EQU   ATCAOSM+504                                              02565000
ATCTPSPB EQU   ATCAOSM+472                                              02566000
ATCTRMPB EQU   ATCAOSM+440                                              02567000
ATCAPBE  EQU   ATCAOSM+436                                              02568000
ATCPSTA  EQU   ATCAOSM+432                                              02569000
ATCSMABF EQU   ATCAOSM+428                                              02570000
ATCSMAPR EQU   ATCAOSM+424                                              02571000
ATCTPWQA EQU   ATCAOSM+420                                              02572000
ATCSMAID EQU   ATCAOSM+416                                              02573000
ATCSMARA EQU   ATCAOSM+412                                              02574000
ATCCACXA EQU   ATCAOSM+408                                              02575000
ATCZLAAB EQU   ATCAOSM+404                                              02576000
ATCATA10 EQU   ATCAOSM+400                                              02577000
ATCHLTCB EQU   ATCAOSM+396                                              02578000
@NM00028 EQU   ATCVTFLG                                                 02579000
ATCVTACT EQU   ATCVTFLG                                                 02580000
ATCRPT40 EQU   ATCAOSM+388                                              02581000
ATCRPT39 EQU   ATCAOSM+384                                              02582000
ATCRPT38 EQU   ATCAOSM+380                                              02583000
ATCRPT37 EQU   ATCAOSM+376                                              02584000
ATCRPT36 EQU   ATCAOSM+372                                              02585000
ATCRPT35 EQU   ATCAOSM+368                                              02586000
ATCRPT34 EQU   ATCAOSM+364                                              02587000
ATCRPT33 EQU   ATCAOSM+360                                              02588000
ATCRPT32 EQU   ATCAOSM+356                                              02589000
ATCRPT31 EQU   ATCAOSM+352                                              02590000
ATCRPT30 EQU   ATCAOSM+348                                              02591000
ATCRPT29 EQU   ATCAOSM+344                                              02592000
ATCRPT28 EQU   ATCAOSM+340                                              02593000
ATCRPT27 EQU   ATCAOSM+336                                              02594000
ATCRPT26 EQU   ATCAOSM+332                                              02595000
ATCRPT25 EQU   ATCAOSM+328                                              02596000
ATCRPT24 EQU   ATCAOSM+324                                              02597000
ATCRPT23 EQU   ATCAOSM+320                                              02598000
ATCRPT22 EQU   ATCAOSM+316                                              02599000
ATCRPT21 EQU   ATCAOSM+312                                              02600000
ATCRPT20 EQU   ATCAOSM+308                                              02601000
ATCRPT19 EQU   ATCAOSM+304                                              02602000
ATCRPT18 EQU   ATCAOSM+300                                              02603000
ATCRPT17 EQU   ATCAOSM+296                                              02604000
ATCRPT16 EQU   ATCAOSM+292                                              02605000
ATCRPT15 EQU   ATCAOSM+288                                              02606000
ATCRPT14 EQU   ATCAOSM+284                                              02607000
ATCRPT13 EQU   ATCAOSM+280                                              02608000
ATCRPT12 EQU   ATCAOSM+276                                              02609000
ATCDMAPP EQU   ATCAOSM+272                                              02610000
ATCAP38  EQU   ATCAOSM+268                                              02611000
ATCZDFJ0 EQU   ATCAOSM+260                                              02612000
ATCAP51  EQU   ATCAOSM+256                                              02613000
ATCZPAB2 EQU   ATCAOSM+224                                              02614000
ATCZPAB1 EQU   ATCAOSM+192                                              02615000
ATCZLFVT EQU   ATCAOSM+188                                              02616000
ATCZLPVT EQU   ATCAOSM+184                                              02617000
ATCZDVTX EQU   ATCAOSM+180                                              02618000
ATCZDVTA EQU   ATCAOSM+176                                              02619000
ATCZDVT9 EQU   ATCAOSM+172                                              02620000
ATCZDVT8 EQU   ATCAOSM+168                                              02621000
ATCZDVT7 EQU   ATCAOSM+164                                              02622000
ATCRSV56 EQU   ATCDAPVT+22                                              02623000
ATCDAPDG EQU   ATCDAPVT+20                                              02624000
ATCDXCEA EQU   ATCDAPVT+16                                              02625000
ATCDCEA  EQU   ATCDAPVT+12                                              02626000
ATCDPCIA EQU   ATCDAPVT+8                                               02627000
ATCDSIOA EQU   ATCDAPVT+4                                               02628000
ATCDEOEA EQU   ATCDAPVT                                                 02629000
ATCZLAEA EQU   ATCLDAPP+16                                              02630000
ATCZLCEA EQU   ATCLDAPP+12                                              02631000
ATCRSV17 EQU   ATCLDAPP+8                                               02632000
ATCSMFRR EQU   ATCLDAPP+4                                               02633000
ATCCDTID EQU   ATCLDAPP                                                 02634000
ATCZAEA  EQU   ATCICAPP+16                                              02635000
ATCZCEA  EQU   ATCICAPP+12                                              02636000
ATCCDTCB EQU   ATCICAPP+8                                               02637000
ATCZSIOA EQU   ATCICAPP+4                                               02638000
ATCCDRPH EQU   ATCICAPP                                                 02639000
ATCAP65  EQU   ATCAOSM+96                                               02640000
ATCZDVT6 EQU   ATCAOSM+92                                               02641000
ATCZDVT4 EQU   ATCAOSM+88                                               02642000
ATCZDVT3 EQU   ATCAOSM+84                                               02643000
ATCZDVT1 EQU   ATCAOSM+80                                               02644000
ATCICNCB EQU   ATCAOSM+76                                               02645000
ATCZFSVT EQU   ATCAOSM+68                                               02646000
ATCAP64  EQU   ATCAOSM+64                                               02647000
ATCAP63  EQU   ATCAOSM+60                                               02648000
ATCAP61  EQU   ATCAOSM+56                                               02649000
ATCAP58  EQU   ATCAOSM+52                                               02650000
ATCAP57  EQU   ATCAOSM+48                                               02651000
ATCAP54  EQU   ATCAOSM+44                                               02652000
ATCAP53  EQU   ATCAOSM+40                                               02653000
ATCAP52  EQU   ATCAOSM+36                                               02654000
ATCAP32  EQU   ATCAOSM+28                                               02655000
ATCAP31  EQU   ATCAOSM+24                                               02656000
ATCAP12  EQU   ATCAOSM+20                                               02657000
ATCAP11  EQU   ATCAOSM+16                                               02658000
ATCCMTCB EQU   ATCAOSM+12                                               02659000
ATCPRPH  EQU   ATCAOSM+8                                                02660000
ATCGSRBF EQU   ATCGSRBG                                                 02661000
ATCSRBRT EQU   ATCAOSM                                                  02662000
@NM00027 EQU   @NM00026                                                 02663000
ATCVTMAB EQU   @NM00026                                                 02664000
@NM00025 EQU   ATCVTBAM                                                 02665000
ATCVDLOK EQU   ISTATCVT+904                                             02666000
ATCVFPAB EQU   ISTATCVT+872                                             02667000
ATCVDPAB EQU   ISTATCVT+840                                             02668000
ATCIOECB EQU   ISTATCVT+836                                             02669000
ATCINCW3 EQU   ISTATCVT+832                                             02670000
ATCMODTB EQU   ISTATCVT+828                                             02671000
ATCUSSPT EQU   ISTATCVT+824                                             02672000
ATCSRTAB EQU   ISTATCVT+820                                             02673000
@NM00024 EQU   ISTATCVT+819                                             02674000
@NM00023 EQU   ATCSTAT2                                                 02675000
ATCTRSMS EQU   ATCSTAT2                                                 02676000
ATCTRLOK EQU   ATCSTAT2                                                 02677000
ATCTRPSS EQU   ATCSTAT2                                                 02678000
ATCTRESC EQU   ATCSTAT2                                                 02679000
ATCTRAPI EQU   ATCSTAT2                                                 02680000
ATCNMCTR EQU   ISTATCVT+816                                             02681000
ATCSEC51 EQU   ATCSECST                                                 02682000
ATCSEC40 EQU   ATCSIPD+8                                                02683000
ATCSEC30 EQU   ATCSIPD+4                                                02684000
ATCSEC21 EQU   ATCSIPD                                                  02685000
ATCSEC10 EQU   ATCSOPD+4                                                02686000
ATCSEC01 EQU   ATCSOPD                                                  02687000
ATCPOIA  EQU   ATCRNO+1                                                 02688000
@NM00022 EQU   ATCRNO                                                   02689000
ATCPODVT EQU   ISTATCVT+784                                             02690000
ATCS49XL EQU   ISTATCVT+780                                             02691000
ATCS49XI EQU   ISTATCVT+776                                             02692000
ATCLCLCT EQU   ATCVLCNT+2                                               02693000
ATCRNCNT EQU   ATCVLCNT                                                 02694000
ATCCFEAD EQU   ISTATCVT+768                                             02695000
ATCPTR00 EQU   ISTATCVT+736                                             02696000
ATCRSV10 EQU   ISTATCVT+704                                             02697000
ATCTACB  EQU   ISTATCVT+700                                             02698000
ATCVTINM EQU   ISTATCVT+696                                             02699000
ATCTCLIM EQU   ISTATCVT+692                                             02700000
ATCTCLOM EQU   ISTATCVT+688                                             02701000
ATCVTIPB EQU   ISTATCVT+656                                             02702000
ATCTCIPB EQU   ISTATCVT+624                                             02703000
ATCTIPAB EQU   ISTATCVT+592                                             02704000
ATCOCCCB EQU   ISTATCVT+588                                             02705000
ATCOCCOB EQU   ISTATCVT+584                                             02706000
ATCCDLAD EQU   ISTATCVT+580                                             02707000
ATCCCLAD EQU   ISTATCVT+576                                             02708000
ATCDLRPB EQU   ISTATCVT+544                                             02709000
ATCPGPAB EQU   ISTATCVT+512                                             02710000
ATCVPAB1 EQU   ISTATCVT+480                                             02711000
ATCRSV97 EQU   ISTATCVT+476                                             02712000
ATCRDTLK EQU   ISTATCVT+472                                             02713000
ATCVOCLK EQU   ISTATCVT+468                                             02714000
ATCCDFDN EQU   ISTATCVT+464                                             02715000
ATCCDFIN EQU   ISTATCVT+460                                             02716000
ATCDVTLK EQU   ISTATCVT+456                                             02717000
ATCAP36  EQU   ISTATCVT+452                                             02718000
ATCAP35  EQU   ISTATCVT+448                                             02719000
ATCAP33  EQU   ISTATCVT+444                                             02720000
ATCRSV99 EQU   ISTATCVT+440                                             02721000
ATCONFIG EQU   ISTATCVT+432                                             02722000
ATCNODDS EQU   ISTATCVT+428                                             02723000
ATCNODEL EQU   ISTATCVT+420                                             02724000
ATCRSV69 EQU   ISTATCVT+416                                             02725000
ATCAPCR5 EQU   ISTATCVT+412                                             02726000
ATCLDECB EQU   ISTATCVT+408                                             02727000
ATCLDNCS EQU   ISTATCVT+404                                             02728000
ATCCDPTR EQU   ISTATCVT+400                                             02729000
ATCADEL  EQU   ISTATCVT+396                                             02730000
ATCTODVT EQU   ISTATCVT+392                                             02731000
ATCDEBCH EQU   ISTATCVT+388                                             02732000
ATCHBSIZ EQU   ATCHPGM+2                                                02733000
ATCHBFNO EQU   ATCHPGM                                                  02734000
ATCCRME  EQU   ISTATCVT+380                                             02735000
ATCRVCHS EQU   ISTATCVT+372                                             02736000
ATCECTLP EQU   ISTATCVT+368                                             02737000
ATCZDVTB EQU   ISTATCVT+364                                             02738000
ATCECPRT EQU   ISTATCVT+360                                             02739000
ATCVTLOD EQU   ISTATCVT+356                                             02740000
ATCTRPAB EQU   ISTATCVT+352                                             02741000
ATCMSGM  EQU   ISTATCVT+348                                             02742000
ATCMSGP  EQU   ISTATCVT+344                                             02743000
ATCEPT   EQU   ISTATCVT+340                                             02744000
ATCDVT   EQU   ISTATCVT+336                                             02745000
ATCTRCPT EQU   ISTATCVT+332                                             02746000
ATCDVLOD EQU   ISTATCVT+328                                             02747000
ATCALERT EQU   ISTATCVT+324                                             02748000
ATCEPA   EQU   ISTATCVT+320                                             02749000
ATCSAF   EQU   ISTATCVT+318                                             02750000
ATCXRANG EQU   ISTATCVT+317                                             02751000
ATCLAST  EQU   ATCSHRFG                                                 02752000
ATCSHRTN EQU   ISTATCVT+308                                             02753000
ATCUEP   EQU   ISTATCVT+304                                             02754000
ATCOCRT  EQU   ISTATCVT+300                                             02755000
ATCCSMA  EQU   ATCCSMR                                                  02756000
ATCESC02 EQU   ISTATCVT+292                                             02757000
ATCESC01 EQU   ISTATCVT+288                                             02758000
ATCCDFND EQU   ISTATCVT+284                                             02759000
ATCCDDEL EQU   ISTATCVT+280                                             02760000
ATCCDADD EQU   ISTATCVT+276                                             02761000
ATCMNT   EQU   ISTATCVT+272                                             02762000
ATCRSV16 EQU   ISTATCVT+270                                             02763000
ATCMAXID EQU   ISTATCVT+269                                             02764000
ATCMSGSP EQU   ATCCOM+268                                               02765000
ATCCIDM  EQU   ATCCOM+266                                               02766000
ATCACTRM EQU   ATCCOM+264                                               02767000
ATCNERAP EQU   ATCCOM+260                                               02768000
ATCNESAL EQU   ATCCOM+256                                               02769000
ATCRCC65 EQU   ATCCOM+252                                               02770000
ATCRCC26 EQU   ATCCOM+248                                               02771000
ATCRCC63 EQU   ATCCOM+244                                               02772000
ATCRSV11 EQU   ATCCOM+242                                               02773000
ATCVTMID EQU   ATCCOM+240                                               02774000
ATCAPOST EQU   ATCCOM+236                                               02775000
ATCNERFN EQU   ATCCOM+232                                               02776000
ATCNERNE EQU   ATCCOM+228                                               02777000
ATCNERCV EQU   ATCCOM+224                                               02778000
ATCNERST EQU   ATCCOM+220                                               02779000
ATCDCC61 EQU   ATCCOM+216                                               02780000
ATCDCC60 EQU   ATCCOM+212                                               02781000
ATCSRTDF EQU   ATCCOM+208                                               02782000
ATCSRTAD EQU   ATCCOM+204                                               02783000
ATCFIRA  EQU   ATCCOM+200                                               02784000
ATCSMBQ  EQU   ATCCOM+196                                               02785000
ATCSMRC  EQU   ATCCOM+192                                               02786000
ATCSMRS  EQU   ATCCOM+188                                               02787000
ATCSMQU  EQU   ATCCOM+184                                               02788000
ATCSMRQ  EQU   ATCCOM+180                                               02789000
ATCACDA  EQU   ATCCOM+176                                               02790000
ATCSTMA  EQU   ATCCOM+172                                               02791000
ATCFRSTR EQU   ATCCOM+168                                               02792000
ATCGTSTR EQU   ATCCOM+164                                               02793000
ATCREADA EQU   ATCCOM+160                                               02794000
ATCALOAD EQU   ATCCOM+156                                               02795000
ATCBLDLA EQU   ATCCOM+152                                               02796000
ATCFBRPH EQU   ATCCOM+148                                               02797000
ATCBFTRC EQU   ATCCOM+144                                               02798000
ATCTPBUF EQU   ATCTHTRC                                                 02799000
ATCREMOV EQU   ATCCOM+136                                               02800000
ATCADD   EQU   ATCCOM+132                                               02801000
ATCBPDA  EQU   ATCCOM+128                                               02802000
ATCDVTPT EQU   ATCCOM+124                                               02803000
ATCFEPT  EQU   ATCCOM+120                                               02804000
ATCFDVT  EQU   ATCCOM+116                                               02805000
ATCCONFT EQU   ATCCOM+112                                               02806000
ATCPTCHA EQU   ATCCOM+108                                               02807000
ATCAUTHA EQU   ATCCOM+104                                               02808000
ATCACCTA EQU   ATCCOM+100                                               02809000
ATCRDTH  EQU   ATCCOM+96                                                02810000
ATCFRSCH EQU   ATCCOM+92                                                02811000
ATCFSB   EQU   ATCCOM+88                                                02812000
ATCHLTMS EQU   ATCCOM+84                                                02813000
ATCECPRM EQU   ATCCOM+80                                                02814000
ATCECNET EQU   ATCCOM+76                                                02815000
ATCECOPC EQU   ATCCOM+72                                                02816000
ATCVPARM EQU   ATCCOM+68                                                02817000
ATCECVRQ EQU   ATCCOM+64                                                02818000
ATCECSES EQU   ATCCOM+60                                                02819000
ATCOCHA  EQU   ATCCOM+56                                                02820000
ATCDSPLQ EQU   ATCCOM+52                                                02821000
ATCECDSP EQU   ATCCOM+48                                                02822000
ATCVARYQ EQU   ATCCOM+44                                                02823000
ATCECVRY EQU   ATCCOM+40                                                02824000
ATCHALTQ EQU   ATCCOM+36                                                02825000
ATCECHLT EQU   ATCCOM+32                                                02826000
ATCMODQ  EQU   ATCCOM+28                                                02827000
ATCECMOD EQU   ATCCOM+24                                                02828000
ATCASCHD EQU   ATCCOM+20                                                02829000
ATCSRT   EQU   ATCCOM+16                                                02830000
ATCRDT   EQU   ATCCOM+12                                                02831000
ATCDCFRR EQU   ATCCOM+8                                                 02832000
ATCAPI   EQU   ATCCOM+4                                                 02833000
ATCRSV04 EQU   ATCSTAT4                                                 02834000
ATCVTTRC EQU   ATCSTAT4                                                 02835000
ATCNCSD  EQU   ATCSTAT4                                                 02836000
ATCMTST  EQU   ATCSTAT4                                                 02837000
ATCTPRT  EQU   ATCSTAT4                                                 02838000
ATCPRTAT EQU   ATCSTAT4                                                 02839000
@NM00021 EQU   ATCPOFLG                                                 02840000
ATCPOUNS EQU   ATCPOFLG                                                 02841000
ATCHSDMF EQU   ATCSTFLG                                                 02842000
@NM00020 EQU   ATCSTAT1                                                 02843000
ATCMDHLT EQU   ATCSTAT1                                                 02844000
ATCINHLT EQU   ATCSTAT1                                                 02845000
ATCNETSL EQU   ATCSTAT1                                                 02846000
ATCQKHLT EQU   ATCSTAT1                                                 02847000
ATCSNHLT EQU   ATCSTAT1                                                 02848000
ATCACTIV EQU   ATCSTAT1                                                 02849000
ATCSTART EQU   ATCSTAT1                                                 02850000
DYPPAB   EQU   ISTDYPAB+16                                              02851000
DYPRSV01 EQU   ISTDYPAB+12                                              02852000
DYPTSKID EQU   ISTDYPAB+8                                               02853000
DYPCHAIN EQU   ISTDYPAB+4                                               02854000
DYPFLGS  EQU   ISTDYPAB+2                                               02855000
DYPLNGTH EQU   ISTDYPAB+1                                               02856000
DYPTYPE  EQU   ISTDYPAB                                                 02857000
LOKXCL   EQU   @NM00018                                                 02858000
LOKPRY   EQU   @NM00018                                                 02859000
@NM00019 EQU   @NM00018                                                 02860000
@NM00017 EQU   LOKCHNG                                                  02861000
LOKCT    EQU   ISTLOK                                                   02862000
CRACHAIN EQU   ISTCRA+928                                               02863000
CRARSV02 EQU   ISTCRA+924                                               02864000
CRARSV01 EQU   ISTCRA+920                                               02865000
CRABFTBA EQU   CRABUFA                                                  02866000
CRAMASK  EQU   CRASVC+64                                                02867000
CRAHSIZ  EQU   CRASVC+60                                                02868000
CRAASCRR EQU   CRASVC                                                   02869000
CRAPROCR EQU   ISTCRA+312                                               02870000
CRAPSS   EQU   ISTCRA+160                                               02871000
CRARPH   EQU   ISTCRA+52                                                02872000
CRALAPTR EQU   CRABASIC+48                                              02873000
CRAL9PTR EQU   CRABASIC+44                                              02874000
CRAL8PTR EQU   CRABASIC+40                                              02875000
CRAL7PTR EQU   CRABASIC+36                                              02876000
CRAL6PTR EQU   CRABASIC+32                                              02877000
CRAL5PTR EQU   CRABASIC+28                                              02878000
CRAL4PTR EQU   CRABASIC+24                                              02879000
CRAL3PTR EQU   CRABASIC+20                                              02880000
CRAL2PTR EQU   CRABASIC+16                                              02881000
CRAL1PTR EQU   CRABASIC+12                                              02882000
CRALEV01 EQU   CRALKACT+3                                               02883000
CRALEV02 EQU   CRALKACT+3                                               02884000
CRALEV03 EQU   CRALKACT+3                                               02885000
CRALEV04 EQU   CRALKACT+3                                               02886000
CRALEV05 EQU   CRALKACT+3                                               02887000
CRALEV06 EQU   CRALKACT+3                                               02888000
CRALEV07 EQU   CRALKACT+3                                               02889000
CRALEV08 EQU   CRALKACT+3                                               02890000
CRALEV09 EQU   CRALKACT+2                                               02891000
CRALEV10 EQU   CRALKACT+2                                               02892000
CRALEV11 EQU   CRALKACT+2                                               02893000
CRALEV12 EQU   CRALKACT+2                                               02894000
CRALEV13 EQU   CRALKACT+2                                               02895000
CRALEV14 EQU   CRALKACT+2                                               02896000
CRALEV15 EQU   CRALKACT+2                                               02897000
CRALEV16 EQU   CRALKACT+2                                               02898000
CRALEV17 EQU   CRALKACT+1                                               02899000
CRALEV18 EQU   CRALKACT+1                                               02900000
CRALEV19 EQU   CRALKACT+1                                               02901000
CRALEV20 EQU   CRALKACT+1                                               02902000
CRALEV21 EQU   CRALKACT+1                                               02903000
CRALEV22 EQU   CRALKACT+1                                               02904000
CRALEV23 EQU   CRALKACT+1                                               02905000
CRALEV24 EQU   CRALKACT+1                                               02906000
CRALEV25 EQU   CRALKACT                                                 02907000
CRALEV26 EQU   CRALKACT                                                 02908000
CRALEV27 EQU   CRALKACT                                                 02909000
CRALEV28 EQU   CRALKACT                                                 02910000
CRALEV29 EQU   CRALKACT                                                 02911000
CRALEV30 EQU   CRALKACT                                                 02912000
CRALEV31 EQU   CRALKACT                                                 02913000
CRALEV32 EQU   CRALKACT                                                 02914000
CRAFRR   EQU   CRAHDR+4                                                 02915000
@NM00016 EQU   ISTAPCRR+137                                             02916000
@NM00015 EQU   APC57FLG                                                 02917000
APCNREL  EQU   APC57FLG                                                 02918000
APCRECRA EQU   APC57FLG                                                 02919000
@NM00014 EQU   APC54FLG                                                 02920000
APCRLST  EQU   APC54FLG                                                 02921000
APCPR153 EQU   APC53FLG                                                 02922000
@NM00013 EQU   APC52FLG                                                 02923000
APCWKF   EQU   APC52FLG                                                 02924000
APCNWF   EQU   APC52FLG                                                 02925000
APCRDQ   EQU   APC52FLG                                                 02926000
APCQENQ  EQU   APC52FLG                                                 02927000
APCSMSR  EQU   APC52FLG                                                 02928000
APCCKRQ  EQU   APC52FLG                                                 02929000
@NM00012 EQU   APC31FLG                                                 02930000
APCSORT  EQU   APC31FLG                                                 02931000
APCRESCH EQU   APC31FLG                                                 02932000
APCTPXIT EQU   APC31FLG                                                 02933000
APCSWTWD EQU   ISTAPCRR+128                                             02934000
APCSAV2  EQU   ISTAPCRR+124                                             02935000
APCSAV1  EQU   ISTAPCRR+120                                             02936000
APCRETCD EQU   APCCOMF+2                                                02937000
@NM00011 EQU   APCCOMF1+1                                               02938000
APCZLBER EQU   APCCOMF1                                                 02939000
APCEXIT  EQU   APCCOMF1                                                 02940000
APCRELR  EQU   APCCOMF1                                                 02941000
APCIRB2  EQU   APCCOMF1                                                 02942000
APCIRB1  EQU   APCCOMF1                                                 02943000
APCSMCR  EQU   APCCOMF1                                                 02944000
APCUETSK EQU   APCCOMF1                                                 02945000
APCSSTSK EQU   APCCOMF1                                                 02946000
APCESTAL EQU   APCSAVE                                                  02947000
APCFRRPM EQU   ISTAPCRR+40                                              02948000
APCQWFO  EQU   ISTAPCRR+36                                              02949000
APCPABSV EQU   ISTAPCRR+32                                              02950000
APCRTRN  EQU   ISTAPCRR+28                                              02951000
APCTCBA  EQU   ISTAPCRR+24                                              02952000
APCPSTA  EQU   ISTAPCRR+20                                              02953000
@NM00010 EQU   APCRFLG+1                                                02954000
APC31R   EQU   APCRFLG                                                  02955000
APC58R   EQU   APCRFLG                                                  02956000
APC57R   EQU   APCRFLG                                                  02957000
APC56R   EQU   APCRFLG                                                  02958000
APC54R   EQU   APCRFLG                                                  02959000
APC53R   EQU   APCRFLG                                                  02960000
APC52R   EQU   APCRFLG                                                  02961000
APC51R   EQU   APCRFLG                                                  02962000
@NM00009 EQU   APCATFLG+1                                               02963000
APC31E   EQU   APCATFLG                                                 02964000
APC58E   EQU   APCATFLG                                                 02965000
APC57E   EQU   APCATFLG                                                 02966000
APC56E   EQU   APCATFLG                                                 02967000
APC54E   EQU   APCATFLG                                                 02968000
APC53E   EQU   APCATFLG                                                 02969000
APC52E   EQU   APCATFLG                                                 02970000
APC51E   EQU   APCATFLG                                                 02971000
APCHDRSV EQU   ISTAPCRR                                                 02972000
ASCPSREG EQU   ISTASCRR+44                                              02973000
ASCUSR01 EQU   ASCUSRGS+12                                              02974000
ASCUSR00 EQU   ASCUSRGS+8                                               02975000
ASCUSR15 EQU   ASCUSRGS+4                                               02976000
ASCUSR14 EQU   ASCUSRGS                                                 02977000
ASCETRYA EQU   ISTASCRR+24                                              02978000
ASCKEY   EQU   ISTASCRR+23                                              02979000
ASCAUDIT EQU   ASCFLG3                                                  02980000
ASCFBDUD EQU   ASCFLG3                                                  02981000
ASCLLKF  EQU   ASCFLG3                                                  02982000
ASCKEYF  EQU   ASCFLG3                                                  02983000
ASCFBDAL EQU   ASCFLG3                                                  02984000
ASCFSRGT EQU   ASCFLG3                                                  02985000
ASCICR   EQU   ASCFLG2                                                  02986000
ASCFSRIC EQU   ASCFLG2                                                  02987000
ASCFBDIC EQU   ASCFLG2                                                  02988000
ASCFBAIC EQU   ASCFLG2                                                  02989000
ASCPASTR EQU   ASCFLG1                                                  02990000
ASCFSR   EQU   ASCFLG1                                                  02991000
ASCFBD   EQU   ASCFLG1                                                  02992000
ASCFBA   EQU   ASCFLG1                                                  02993000
ASCPFCRR EQU   ISTASCRR                                                 02994000
CCFRSVD1 EQU   CFCCRT                                                   02995000
CCFCR2   EQU   CFCCRT                                                   02996000
CCFCRP   EQU   CFCCRT                                                   02997000
CCFCR1   EQU   CFCCRT                                                   02998000
CCFCS2   EQU   CFCCRT                                                   02999000
CCFCS1   EQU   CFCCRT                                                   03000000
NCFRSVD  EQU   CFCNTRD                                                  03001000
NCFCR2   EQU   CFCNTRD                                                  03002000
NCFCRP   EQU   CFCNTRD                                                  03003000
NCFCR1   EQU   CFCNTRD                                                  03004000
NCFCS2   EQU   CFCNTRD                                                  03005000
NCFCS1   EQU   CFCNTRD                                                  03006000
PFCRSV01 EQU   ISTPFCRR+13                                              03007000
PFCFTA   EQU   ISTPFCRR+12                                              03008000
CRRFRR   EQU   PFCFRRO                                                  03009000
CRRCHAIN EQU   PFCCRRO                                                  03010000
CRRLEN   EQU   PFCCRRLN                                                 03011000
PFCRSV10 EQU   PFCCRR+1                                                 03012000
CRRID    EQU   PFCCRRID                                                 03013000
RPHNEXPO EQU   ISTRPH+104                                               03014000
RPHSAV16 EQU   RPHWORK+60                                               03015000
RPHSAV15 EQU   RPHWORK+56                                               03016000
RPHSAV14 EQU   RPHWORK+52                                               03017000
RPHSAV13 EQU   RPHWORK+48                                               03018000
RPHSAV12 EQU   RPHWORK+44                                               03019000
RPHSAV11 EQU   RPHWORK+40                                               03020000
RPHSAV10 EQU   RPHWORK+36                                               03021000
RPHSAVE9 EQU   RPHWORK+32                                               03022000
RPHSAVE8 EQU   RPHWORK+28                                               03023000
RPHSAVE7 EQU   RPHWORK+24                                               03024000
RPHSAVE6 EQU   RPHWORK+20                                               03025000
RPHSAVE5 EQU   RPHWORK+16                                               03026000
RPHSAVE4 EQU   RPHWORK+12                                               03027000
RPHSAVE3 EQU   RPHWORK+8                                                03028000
RPHSAVE2 EQU   RPHWORK+4                                                03029000
RPHSHALF EQU   RPHSAVE1+2                                               03030000
RPHSBIT8 EQU   RPHSBITS                                                 03031000
RPHSBIT7 EQU   RPHSBITS                                                 03032000
RPHSBIT6 EQU   RPHSBITS                                                 03033000
RPHSBIT5 EQU   RPHSBITS                                                 03034000
RPHSBIT4 EQU   RPHSBITS                                                 03035000
RPHSBIT3 EQU   RPHSBITS                                                 03036000
RPHSBIT2 EQU   RPHSBITS                                                 03037000
RPHSBIT1 EQU   RPHSBITS                                                 03038000
RPHSBYTE EQU   RPHSAVE1                                                 03039000
RPHPABQP EQU   RPHPABQA+1                                               03040000
RPHPABFG EQU   RPHPABQA                                                 03041000
RPHSRP34 EQU   RPHSRPRM+2                                               03042000
RPHSRP12 EQU   RPHSRPRM                                                 03043000
RPHWEGT  EQU   RPHCSPA                                                  03044000
RPHMAJCB EQU   ISTRPH+21                                                03045000
RPHPABOF EQU   ISTRPH+20                                                03046000
RPHRESUM EQU   RPHRESMA+1                                               03047000
RPHRSV01 EQU   RPHWPFLG                                                 03048000
RPHPURGE EQU   RPHWPFLG                                                 03049000
RPHPT    EQU   RPHWPFLG                                                 03050000
RPHWT    EQU   RPHWPFLG                                                 03051000
RPHRSKEY EQU   RPHWPFLG                                                 03052000
RPHDVTA  EQU   ISTRPH+12                                                03053000
RPHTIK   EQU   RPHTSKID+3                                               03054000
@NM00008 EQU   RPHTSKID                                                 03055000
RPHRPHAP EQU   RPHRPHA+1                                                03056000
@NM00007 EQU   RPHRPHA                                                  03057000
RPHGATE  EQU   RPHRPHA                                                  03058000
@NM00006 EQU   RPHFLGB                                                  03059000
RPHRLCRA EQU   RPHFLGB                                                  03060000
RPHNRSAV EQU   RPHFLGB                                                  03061000
RPHPGCMP EQU   RPHFLGB                                                  03062000
RPHFBAPS EQU   RPHFLGB                                                  03063000
RPHBSSP  EQU   RPHFLGB                                                  03064000
RPHLOCK  EQU   RPHFLGB                                                  03065000
RPHFNFLG EQU   RPHFSTLC                                                 03066000
RPHMLTCP EQU   RPHFLAGS                                                 03067000
RPHSMCLR EQU   RPHFLAGS                                                 03068000
RPHSMTYP EQU   RPHFLAGS                                                 03069000
RPHSMQ   EQU   RPHFLAGS                                                 03070000
RPHAUTEX EQU   RPHAPTYP                                                 03071000
RPHSPGIN EQU   RPHFLAGS                                                 03072000
RPHOGIND EQU   RPHFLAGS                                                 03073000
RPHLNGTH EQU   RPHCNTL+1                                                03074000
RPHTYPE  EQU   RPHCNTL                                                  03075000
ZCRRU    EQU   ZCRRHRU+3                                                03076000
ZCRRH    EQU   ZCRRHRU                                                  03077000
ZCRWORDA EQU   ISTZCRR+477                                              03078000
ZCRCMNRC EQU   ISTZCRR+476                                              03079000
ZCRRSV97 EQU   ZCRENTER+18                                              03080000
ZCREIC2B EQU   ZCRENTER+18                                              03081000
ZCREAC2B EQU   ZCRENTER+18                                              03082000
ZCRELCAB EQU   ZCRENTER+18                                              03083000
ZCREDCMF EQU   ZCRENTER+18                                              03084000
ZCREBCIF EQU   ZCRENTER+18                                              03085000
ZCREICSG EQU   ZCRENTER+18                                              03086000
ZCREDCK0 EQU   ZCRENTER+18                                              03087000
ZCRECFY0 EQU   ZCRENTER+17                                              03088000
ZCREKCCB EQU   ZCRENTER+17                                              03089000
ZCREDCNB EQU   ZCRENTER+17                                              03090000
ZCREBCNB EQU   ZCRENTER+17                                              03091000
ZCREBC0L EQU   ZCRENTER+17                                              03092000
ZCREBCAL EQU   ZCRENTER+17                                              03093000
ZCREDCQR EQU   ZCRENTER+17                                              03094000
ZCREDCPR EQU   ZCRENTER+16                                              03095000
ZCREBCSB EQU   ZCRENTER+16                                              03096000
ZCREAC1R EQU   ZCRENTER+16                                              03097000
ZCRECCCI EQU   ZCRENTER+16                                              03098000
ZCRECCAI EQU   ZCRENTER+16                                              03099000
ZCRECCBI EQU   ZCRENTER+16                                              03100000
ZCREBCAR EQU   ZCRENTER+16                                              03101000
ZCREBCDR EQU   ZCRENTER+16                                              03102000
ZCREBCBR EQU   ZCRENTER+15                                              03103000
ZCREDCXR EQU   ZCRENTER+15                                              03104000
ZCREDCWB EQU   ZCRENTER+15                                              03105000
ZCREDCWR EQU   ZCRENTER+15                                              03106000
ZCREKCCN EQU   ZCRENTER+15                                              03107000
ZCREKCBN EQU   ZCRENTER+15                                              03108000
ZCREKCBB EQU   ZCRENTER+15                                              03109000
ZCREJC0B EQU   ZCRENTER+15                                              03110000
ZCREJCDB EQU   ZCRENTER+14                                              03111000
ZCREJCCB EQU   ZCRENTER+14                                              03112000
ZCREJCBB EQU   ZCRENTER+14                                              03113000
ZCREJCAB EQU   ZCRENTER+14                                              03114000
ZCREIC1B EQU   ZCRENTER+14                                              03115000
ZCREIC0B EQU   ZCRENTER+14                                              03116000
ZCREICX0 EQU   ZCRENTER+14                                              03117000
ZCREICWB EQU   ZCRENTER+14                                              03118000
ZCREICVB EQU   ZCRENTER+13                                              03119000
ZCREICUB EQU   ZCRENTER+13                                              03120000
ZCREICTB EQU   ZCRENTER+13                                              03121000
ZCREICSC EQU   ZCRENTER+13                                              03122000
ZCREICSB EQU   ZCRENTER+13                                              03123000
ZCREICRB EQU   ZCRENTER+13                                              03124000
ZCREICQB EQU   ZCRENTER+13                                              03125000
ZCREICQA EQU   ZCRENTER+13                                              03126000
ZCREICOB EQU   ZCRENTER+12                                              03127000
ZCREICOA EQU   ZCRENTER+12                                              03128000
ZCREICNB EQU   ZCRENTER+12                                              03129000
ZCREICNA EQU   ZCRENTER+12                                              03130000
ZCREICMB EQU   ZCRENTER+12                                              03131000
ZCREICLB EQU   ZCRENTER+12                                              03132000
ZCREICKG EQU   ZCRENTER+12                                              03133000
ZCREICKE EQU   ZCRENTER+12                                              03134000
ZCREICKB EQU   ZCRENTER+11                                              03135000
ZCREICJB EQU   ZCRENTER+11                                              03136000
ZCREICID EQU   ZCRENTER+11                                              03137000
ZCREICIB EQU   ZCRENTER+11                                              03138000
ZCREICHB EQU   ZCRENTER+11                                              03139000
ZCREICGB EQU   ZCRENTER+11                                              03140000
ZCREICEB EQU   ZCRENTER+11                                              03141000
ZCREICDB EQU   ZCRENTER+11                                              03142000
ZCREICCI EQU   ZCRENTER+10                                              03143000
ZCREICCB EQU   ZCRENTER+10                                              03144000
ZCREICBI EQU   ZCRENTER+10                                              03145000
ZCREICBB EQU   ZCRENTER+10                                              03146000
ZCREICAB EQU   ZCRENTER+10                                              03147000
ZCREICAA EQU   ZCRENTER+10                                              03148000
ZCREHCAN EQU   ZCRENTER+10                                              03149000
ZCREGC0B EQU   ZCRENTER+10                                              03150000
ZCREGC0A EQU   ZCRENTER+9                                               03151000
ZCREGCLA EQU   ZCRENTER+9                                               03152000
ZCREGCEB EQU   ZCRENTER+9                                               03153000
ZCREGCDB EQU   ZCRENTER+9                                               03154000
@NM00005 EQU   ZCRENTER+9                                               03155000
ZCREGCBB EQU   ZCRENTER+9                                               03156000
ZCREGCAB EQU   ZCRENTER+9                                               03157000
ZCREFCEB EQU   ZCRENTER+9                                               03158000
ZCREFCEA EQU   ZCRENTER+8                                               03159000
ZCREECTA EQU   ZCRENTER+8                                               03160000
ZCREECEA EQU   ZCRENTER+8                                               03161000
ZCREECDA EQU   ZCRENTER+8                                               03162000
ZCREECCB EQU   ZCRENTER+8                                               03163000
ZCREECCA EQU   ZCRENTER+8                                               03164000
ZCREECBB EQU   ZCRENTER+8                                               03165000
ZCREECBA EQU   ZCRENTER+8                                               03166000
ZCREDCMB EQU   ZCRENTER+7                                               03167000
ZCREDCL0 EQU   ZCRENTER+7                                               03168000
ZCREDCKB EQU   ZCRENTER+7                                               03169000
ZCREDCKA EQU   ZCRENTER+7                                               03170000
ZCREDCJ0 EQU   ZCRENTER+7                                               03171000
ZCREDCI0 EQU   ZCRENTER+7                                               03172000
ZCREDCH0 EQU   ZCRENTER+7                                               03173000
ZCREDCF0 EQU   ZCRENTER+7                                               03174000
ZCREDCE0 EQU   ZCRENTER+6                                               03175000
ZCREDCD0 EQU   ZCRENTER+6                                               03176000
ZCREDCC0 EQU   ZCRENTER+6                                               03177000
ZCREDCB0 EQU   ZCRENTER+6                                               03178000
ZCREDCA0 EQU   ZCRENTER+6                                               03179000
ZCRECC2B EQU   ZCRENTER+6                                               03180000
ZCRECC1B EQU   ZCRENTER+6                                               03181000
ZCRECC1A EQU   ZCRENTER+6                                               03182000
ZCRECC0B EQU   ZCRENTER+5                                               03183000
ZCRECC0A EQU   ZCRENTER+5                                               03184000
ZCREBC0B EQU   ZCRENTER+5                                               03185000
ZCREBC0A EQU   ZCRENTER+5                                               03186000
ZCREBCZ0 EQU   ZCRENTER+5                                               03187000
ZCREBCY0 EQU   ZCRENTER+5                                               03188000
ZCREBCX0 EQU   ZCRENTER+5                                               03189000
ZCREBCXA EQU   ZCRENTER+5                                               03190000
ZCREBCSC EQU   ZCRENTER+4                                               03191000
ZCREBCRB EQU   ZCRENTER+4                                               03192000
ZCREBCRA EQU   ZCRENTER+4                                               03193000
ZCREBCQB EQU   ZCRENTER+4                                               03194000
ZCREBCPB EQU   ZCRENTER+4                                               03195000
ZCREBCOB EQU   ZCRENTER+4                                               03196000
ZCREBCNE EQU   ZCRENTER+4                                               03197000
ZCREBCND EQU   ZCRENTER+4                                               03198000
ZCREBCMB EQU   ZCRENTER+3                                               03199000
ZCREBCLB EQU   ZCRENTER+3                                               03200000
ZCREBCLA EQU   ZCRENTER+3                                               03201000
ZCREBCKB EQU   ZCRENTER+3                                               03202000
ZCREBCKA EQU   ZCRENTER+3                                               03203000
ZCREBCJB EQU   ZCRENTER+3                                               03204000
ZCREBCJA EQU   ZCRENTER+3                                               03205000
ZCREBCID EQU   ZCRENTER+3                                               03206000
ZCREBCIB EQU   ZCRENTER+2                                               03207000
ZCREBCIA EQU   ZCRENTER+2                                               03208000
ZCREBCHB EQU   ZCRENTER+2                                               03209000
ZCREBCHA EQU   ZCRENTER+2                                               03210000
ZCREBCGB EQU   ZCRENTER+2                                               03211000
ZCREBCGA EQU   ZCRENTER+2                                               03212000
ZCREBCFB EQU   ZCRENTER+2                                               03213000
ZCREBCFA EQU   ZCRENTER+2                                               03214000
ZCREBCEB EQU   ZCRENTER+1                                               03215000
ZCREBCDI EQU   ZCRENTER+1                                               03216000
ZCREBCCB EQU   ZCRENTER+1                                               03217000
ZCREBCBI EQU   ZCRENTER+1                                               03218000
ZCREBCBB EQU   ZCRENTER+1                                               03219000
ZCREBCBA EQU   ZCRENTER+1                                               03220000
ZCREBCAM EQU   ZCRENTER+1                                               03221000
ZCREBCAI EQU   ZCRENTER+1                                               03222000
ZCREBCAG EQU   ZCRENTER                                                 03223000
ZCREBCAE EQU   ZCRENTER                                                 03224000
ZCREBCAB EQU   ZCRENTER                                                 03225000
ZCREBCAA EQU   ZCRENTER                                                 03226000
ZCREAC1B EQU   ZCRENTER                                                 03227000
ZCREAC0B EQU   ZCRENTER                                                 03228000
ZCREAC0A EQU   ZCRENTER                                                 03229000
ZCREAC1A EQU   ZCRENTER                                                 03230000
ZCRTNAME EQU   ZCRAUDIT+1                                               03231000
ZCRTID   EQU   ZCRAUDIT                                                 03232000
ZCRREMIC EQU   ISTZCRR+436                                              03233000
ZCRSAVEZ EQU   ISTZCRR+196                                              03234000
ZCRDAFSV EQU   ZCRCIDSV+2                                               03235000
ZCRSAFSV EQU   ZCRCIDSV                                                 03236000
ZCRR13SV EQU   ISTZCRR+188                                              03237000
ZCRR2SV  EQU   ISTZCRR+184                                              03238000
ZCROPCDE EQU   ISTZCRR+183                                              03239000
ZCRPRMTC EQU   ISTZCRR+182                                              03240000
ZCRRCDSV EQU   ISTZCRR+181                                              03241000
ZCRAWQSW EQU   ISTZCRR+180                                              03242000
ZCRTOPQ  EQU   ISTZCRR+180                                              03243000
ZCRLSTFB EQU   ISTZCRR+180                                              03244000
ZCRXSCHD EQU   ISTZCRR+180                                              03245000
ZCRNXTEL EQU   ISTZCRR+180                                              03246000
ZCRSCANQ EQU   ISTZCRR+180                                              03247000
ZCRMOREL EQU   ISTZCRR+180                                              03248000
ZCRFBPRC EQU   ISTZCRR+180                                              03249000
ZCRFSBSV EQU   ISTZCRR+176                                              03250000
ZCRSVWK5 EQU   ZCRWKARA+16                                              03251000
ZCRSVWK4 EQU   ZCRWKARA+12                                              03252000
ZCRSVWK3 EQU   ZCRWKARA+8                                               03253000
ZCRSVWK2 EQU   ZCRWKARA+4                                               03254000
ZCRSVWK1 EQU   ZCRWKARA                                                 03255000
ZCRSVF25 EQU   ZCRSVRTN+96                                              03256000
ZCRSVF24 EQU   ZCRSVRTN+92                                              03257000
ZCRSVF23 EQU   ZCRSVRTN+88                                              03258000
ZCRSVF22 EQU   ZCRSVRTN+84                                              03259000
ZCRSVF21 EQU   ZCRSVRTN+80                                              03260000
ZCRSVF20 EQU   ZCRSVRTN+76                                              03261000
ZCRSVF19 EQU   ZCRSVRTN+72                                              03262000
ZCRSVF18 EQU   ZCRSVRTN+68                                              03263000
ZCRSVF17 EQU   ZCRSVRTN+64                                              03264000
ZCRSVF16 EQU   ZCRSVRTN+60                                              03265000
ZCRSVF15 EQU   ZCRSVRTN+56                                              03266000
ZCRSVF14 EQU   ZCRSVRTN+52                                              03267000
ZCRSVF13 EQU   ZCRSVRTN+48                                              03268000
ZCRSVF12 EQU   ZCRSVRTN+44                                              03269000
ZCRSVF11 EQU   ZCRSVRTN+40                                              03270000
ZCRSVF10 EQU   ZCRSVRTN+36                                              03271000
ZCRSVF9  EQU   ZCRSVRTN+32                                              03272000
ZCRSVF8  EQU   ZCRSVRTN+28                                              03273000
ZCRSVF7  EQU   ZCRSVRTN+24                                              03274000
ZCRSVF6  EQU   ZCRSVRTN+20                                              03275000
ZCRSVF5  EQU   ZCRSVRTN+16                                              03276000
ZCRSVF4  EQU   ZCRSVRTN+12                                              03277000
ZCRSVF3  EQU   ZCRSVRTN+8                                               03278000
ZCRSVF2  EQU   ZCRSVRTN+4                                               03279000
ZCRSVF1  EQU   ZCRSVRTN                                                 03280000
ZCRPVZB  EQU   ISTZCRR+52                                               03281000
ZCRZLB   EQU   ISTZCRR+48                                               03282000
ZCRBFPTR EQU   ISTZCRR+44                                               03283000
ZCRCCWA  EQU   ISTZCRR+40                                               03284000
ZCRPSW   EQU   ZCRPARMS+15                                              03285000
ZCRPCHAR EQU   ZCRPARMS+14                                              03286000
ZCRPRES2 EQU   ZCRPCOD2                                                 03287000
ZCRPMFGF EQU   ZCRPCOD2                                                 03288000
ZCRPFHDR EQU   ZCRPCOD2                                                 03289000
ZCRPPG2  EQU   ZCRPCOD2                                                 03290000
ZCRPRES  EQU   ZCRPCOD1                                                 03291000
ZCRPCFTX EQU   ZCRPCOD1                                                 03292000
ZCRPLSBQ EQU   ZCRPLSBF                                                 03293000
ZCRPFSB  EQU   ZCRPCOD1                                                 03294000
ZCRPLNG  EQU   ZCRPCOD1                                                 03295000
ZCRPPG   EQU   ZCRPCOD1                                                 03296000
ZCRDTODA EQU   ZCRDFRDA                                                 03297000
ZCRMLNG  EQU   ZCRPARMS+8                                               03298000
ZCRTBPTR EQU   ZCRPARMS+4                                               03299000
ZCRCBPTR EQU   ZCRFBPTR                                                 03300000
ZCRCRLCP EQU   ISTZCRR+20                                               03301000
@NM00004 EQU   ZCRSCPSW                                                 03302000
ZCRSKIPT EQU   ZCRSCPSW                                                 03303000
ZCRFSBWE EQU   ZCRSCPSW                                                 03304000
ZCRPRCMP EQU   ZCRSCPSW                                                 03305000
ZCRLREQ  EQU   ZCRSCPSW                                                 03306000
ZCRRJLCP EQU   ZCRSCPSW                                                 03307000
ZCRTPINV EQU   ZCRSCPSW                                                 03308000
ZCRTPEX  EQU   ZCRSCPSW                                                 03309000
@NM00003 EQU   ZCRIBPR                                                  03310000
ZCR3270R EQU   ZCRIBPR                                                  03311000
ZCR3270  EQU   ZCRIBPR                                                  03312000
ZCRLCPFD EQU   ZCRIBPR                                                  03313000
ZCRLCPFR EQU   ZCRIBPR                                                  03314000
ZCRRELK  EQU   ZCRIBPR                                                  03315000
ZCRERR   EQU   ZCRIBPR                                                  03316000
ZCRNOBUF EQU   ZCRIBPR                                                  03317000
@NM00002 EQU   ZCRPFLGS                                                 03318000
ZCRQAHED EQU   ZCRPFLGS                                                 03319000
ZCRF1RES EQU   ZCRGENSW                                                 03320000
ZCRBRIS  EQU   ZCRGENSW                                                 03321000
ZCRCLRBD EQU   ZCRGENSW                                                 03322000
ZCREXRES EQU   ZCRGENSW                                                 03323000
ZCRLCSYN EQU   ZCRGENSW                                                 03324000
ZCRRT06  EQU   ZCRGENSW                                                 03325000
ZCRTSW2  EQU   ZCRGENSW                                                 03326000
ZCRTSW1  EQU   ZCRGENSW                                                 03327000
ZCRINLCP EQU   ZCRFLGS3                                                 03328000
ZCRWRPTR EQU   ZCRFLGS3                                                 03329000
ZCRNOFRE EQU   ZCRFLGS3                                                 03330000
ZCREDRIV EQU   ZCRFLGS3                                                 03331000
ZCRDISC  EQU   ZCRFLGS3                                                 03332000
ZCRTPDIS EQU   ZCRFLGS3                                                 03333000
ZCRTPCON EQU   ZCRFLGS3                                                 03334000
ZCRTIC   EQU   ZCRFLGS3                                                 03335000
ZCRCNLXL EQU   ZCRRESET                                                 03336000
ZCRENDAN EQU   ZCRSWFLD                                                 03337000
ZCRENDXL EQU   ZCRSWFLD                                                 03338000
ZCRENDX  EQU   ZCRSWFLD                                                 03339000
ZCROB1   EQU   ZCRNDLCP                                                 03340000
ZCRENDPR EQU   ZCRSWFLD                                                 03341000
ZCREXTYP EQU   ZCRSWFLD                                                 03342000
ZCRSLCP  EQU   ZCRENDSH                                                 03343000
ZCROB    EQU   ZCRFLGS2                                                 03344000
ZCRFMSED EQU   ZCRFLGS2                                                 03345000
ZCRSHEDI EQU   ZCRFLGS2                                                 03346000
ZCRLOCAL EQU   ZCRFLGS2                                                 03347000
ZCRFEXIT EQU   ZCRFLGS1                                                 03348000
ZCRUNSOL EQU   ZCRFLGS1                                                 03349000
ZCRENDLP EQU   ZCRFLGS1                                                 03350000
ZCRNRMEX EQU   ZCRFLGS1                                                 03351000
ZCRWAIT  EQU   ZCRFLGS1                                                 03352000
ZCRDEQSW EQU   ZCRFLGS1                                                 03353000
ZCRQUESW EQU   ZCRFLGS1                                                 03354000
ZCREXSW  EQU   ZCRFLGS1                                                 03355000
ZCRFRRA  EQU   ISTZCRR+8                                                03356000
ZCRCHAIN EQU   ISTZCRR+4                                                03357000
ZCRFLAG  EQU   ZCRCRR+3                                                 03358000
ZCRLEN   EQU   ZCRCRR+1                                                 03359000
ZCRID    EQU   ZCRCRR                                                   03360000
LSCTLBAD EQU   ISTLSCB+28                                               03361000
LSCFDB2  EQU   LSCFDBA+1                                                03362000
LSCFDB1  EQU   LSCFDBA                                                  03363000
LSCLCCW1 EQU   ISTLSCB+12                                               03364000
LSCRRCNT EQU   LSCSEQ+1                                                 03365000
LSCRRCCT EQU   LSCSEQ                                                   03366000
LSCATOP  EQU   LSCFLGS                                                  03367000
LSCFREE  EQU   LSCFLGS                                                  03368000
LSCDSTAT EQU   LSCFLGS                                                  03369000
LSCEXRES EQU   LSCFLGS                                                  03370000
LSCZRIMM EQU   LSCFLGS                                                  03371000
LSCRSV01 EQU   LSCFLGS                                                  03372000
LSCSMODE EQU   LSCFLGS                                                  03373000
LSCZMIRC EQU   LSCRUCNT                                                 03374000
LSCCHAI2 EQU   LSCCHAIN+1                                               03375000
LSCCHNG  EQU   LSCCHAI1                                                 03376000
LSCZRTSC EQU   LSCZMNRC                                                 03377000
LSCZRT0B EQU   LSCZMNRC                                                 03378000
LSCZRT0A EQU   LSCZMNRC                                                 03379000
LSCZRTL9 EQU   LSCZRT09                                                 03380000
LSCZRTL8 EQU   LSCZRT08                                                 03381000
LSCZRTL7 EQU   LSCZRT07                                                 03382000
LSCZRTL6 EQU   LSCZRT06                                                 03383000
LSCZRTL5 EQU   LSCZRT05                                                 03384000
LSCZRTL4 EQU   LSCZRT04                                                 03385000
LSCZRTL3 EQU   LSCZRT03                                                 03386000
LSCZRTL2 EQU   LSCZRT02                                                 03387000
LSCZRT01 EQU   LSCREQTG                                                 03388000
LSCZRT00 EQU   LSCREQTG                                                 03389000
LSCLNGTH EQU   LSC1WORD+1                                               03390000
LCPFTYPE EQU   LCPRPHA                                                  03391000
LCPRSTQH EQU   LCPLCCW                                                  03392000
LCPCLREP EQU   ISTLCPB+44                                               03393000
LCPUBFSB EQU   LCPFLCCW                                                 03394000
LCPRSV77 EQU   ISTLCPB+39                                               03395000
LCPLCCWC EQU   ISTLCPB+38                                               03396000
LCPRSV78 EQU   LCPFLG1                                                  03397000
LCPTRANS EQU   LCPFLG1                                                  03398000
LCPSTLB  EQU   LCPFLG1                                                  03399000
LCPREDRV EQU   LCPFLG1                                                  03400000
LCPDIRPT EQU   LCPFLG1                                                  03401000
LCPINTER EQU   LCPFLG1                                                  03402000
LCPRESET EQU   LCPFLG1                                                  03403000
LCPSTYPE EQU   ISTLCPB+36                                               03404000
LCPFSNCH EQU   ISTLCPB+34                                               03405000
LCPFOSN  EQU   ISTLCPB+32                                               03406000
LCPTLBAD EQU   ISTLCPB+28                                               03407000
LCPFDB2  EQU   LCPFDBA+1                                                03408000
LCPFDB1  EQU   LCPFDBA                                                  03409000
LCPNXLCW EQU   ISTLCPB+20                                               03410000
LCPDAF   EQU   LCPCID+2                                                 03411000
LCPSAF   EQU   LCPCID                                                   03412000
LCPLCCW1 EQU   ISTLCPB+12                                               03413000
LCPRRCNT EQU   LCPSEQ+1                                                 03414000
LCPRRCCT EQU   LCPSEQ                                                   03415000
LCPATOP  EQU   LCPFLAG2                                                 03416000
LCPFREE  EQU   LCPFLAG2                                                 03417000
LCPDSTAT EQU   LCPFLAG2                                                 03418000
LCPEXRES EQU   LCPFID0                                                  03419000
LCPZRIMM EQU   LCPTLBPI                                                 03420000
LCPRSTRT EQU   LCPFLAG2                                                 03421000
LCPASYN  EQU   LCPFLAG2                                                 03422000
LCPPRFLG EQU   LCPFLAG2                                                 03423000
LCPZMIRC EQU   LCPRUCNT                                                 03424000
LCPCHAI2 EQU   LCPCHAIN+1                                               03425000
LCPCHNG  EQU   LCPCHAI1                                                 03426000
LCPZRT0B EQU   LCPMNRCD                                                 03427000
LCPZRT0A EQU   LCPMNRCD                                                 03428000
LCPZRTL9 EQU   LCPZRT09                                                 03429000
LCPZRTL8 EQU   LCPZRT08                                                 03430000
LCPZRTL7 EQU   LCPZRT07                                                 03431000
LCPZRTL6 EQU   LCPZRT06                                                 03432000
LCPZRTL5 EQU   LCPZRT05                                                 03433000
LCPZRTL4 EQU   LCPZRT04                                                 03434000
LCPZRTL3 EQU   LCPZRT03                                                 03435000
LCPZRTL2 EQU   LCPZRT02                                                 03436000
LCPZRT01 EQU   LCPFLAGS                                                 03437000
LCPZRT00 EQU   LCPFLAGS                                                 03438000
LCPLNGTH EQU   ISTLCPB+1                                                03439000
LCPTYPE  EQU   ISTLCPB                                                  03440000
LCCWDATA EQU   ISTLCCW+4                                                03441000
LCCWCNT  EQU   ISTLCCW+2                                                03442000
LCCWACI  EQU   LCCWFLAG                                                 03443000
LCCWRFI  EQU   LCCWFLAG                                                 03444000
LCCWPER  EQU   LCCWLSI                                                  03445000
LCCWIDAT EQU   LCCWFLAG                                                 03446000
LCCWNTVC EQU   LCCWFLAG                                                 03447000
LCCWCKPT EQU   LCCWFLAG                                                 03448000
LCCWCC   EQU   LCCWFLAG                                                 03449000
LCCWCD   EQU   LCCWFLAG                                                 03450000
LCCWTYPE EQU   LCCWCTL                                                  03451000
LCCWMODE EQU   LCCWCTL                                                  03452000
LCCWSOP  EQU   LCCWRWOP                                                 03453000
@NM00001 EQU   LCCWRWOP                                                 03454000
LCCWSD   EQU   LCCWOP                                                   03455000
LCCWSI   EQU   LCCWOP                                                   03456000
PABRPHA  EQU   PABRPHFG+1                                               03457000
PABNODQ  EQU   PABFLAGS                                                 03458000
PABINHBT EQU   PABFLAGS                                                 03459000
PABSSN   EQU   PABFLAGS                                                 03460000
PABDYNAM EQU   PABFLAGS                                                 03461000
PABNORPR EQU   PABFLAGS                                                 03462000
PABPRIOR EQU   PABFLAGS                                                 03463000
PABAPYP  EQU   PABFLAGS                                                 03464000
PABOFFST EQU   ISTPAB+8                                                 03465000
PABCHNGP EQU   PABCHAIN+1                                               03466000
PABRSV02 EQU   PABCHAIN                                                 03467000
PABRUNNG EQU   PABCHAIN                                                 03468000
PABRESET EQU   PABCHAIN                                                 03469000
PABUNCON EQU   PABCHAIN                                                 03470000
PABCDP   EQU   PABCHAIN                                                 03471000
PABRESCH EQU   PABCHAIN                                                 03472000
PABCHNG  EQU   PABCHAIN                                                 03473000
PABWEQP  EQU   PABWEQA+1                                                03474000
PABRSV01 EQU   PABWEQA                                                  03475000
PABWEQG  EQU   PABWEQA                                                  03476000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03477000
IFOE00A# EQU   @RC00493                                                 03478000
@RC00570 EQU   @RC00569                                                 03479000
@RC00602 EQU   @RC00601                                                 03480000
@ENDDATA EQU   *                                                        03481000
         END   ISTZIFOE,(C'PLS2009',0603,75336)                         03482000
