         TITLE 'ISTZHFAN/AAN-VS1/MAN-VS2 - PORT SOLICITOR READ PROCESSO*00001000
               OR       '                                               00002000
ISTZHFAN CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZHFAN  75.130'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
*                                                                  0394 00011000
*/* TPZSAVE (7,12,14) BASE AC(HCAN)                                  */ 00012000
*                                                                  0394 00013000
*   DO;                                                            0394 00014000
*     RFY                                                          0395 00015000
*      (GPR01P,                                                    0395 00016000
*       GPR12P,                                                    0395 00017000
*       GPR13P,                                                    0395 00018000
*       GPR14P) RSTD;                                              0395 00019000
*     GEN(PRINT OFF);                                              0396 00020000
*                                                                  0396 00021000
         PRINT OFF                                                      00022000
*/* ATBUILD (ISTZSAVE)                                               */ 00023000
*/* END OF ATBUILD                                                   */ 00024000
*                                                                  0397 00025000
*     GEN(PRINT ON);                                               0397 00026000
         PRINT ON                                                       00027000
*     RFY                                                          0398 00028000
*       ISTZSAVE BASED(GPR13P);                                    0398 00029000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0399 00030000
         STM   7,12,ZSAZSVVR+0(13)                                      00031000
*     GEN SETS(GPR12P);                                            0400 00032000
         BALR  GPR12P,0                                                 00033000
@TSTART  DS    0H                                                       00034000
         USING @TSTART,GPR12P                                           00035000
*     GEN(PRINT OFF);                                              0401 00036000
*                                                                  0401 00037000
         PRINT OFF                                                      00038000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00039000
*/* END OF ATBUILD                                                   */ 00040000
*                                                                  0402 00041000
*     GEN(PRINT ON);                                               0402 00042000
         PRINT ON                                                       00043000
*     GPR01P->RPHCRR->CRACRR->ZCREHCAN='1'B;                       0403 00044000
         L     @11,RPHCRR(,GPR01P)                                 0403 00045000
         L     @11,CRACRR(,@11)                                    0403 00046000
         OI    ZCREHCAN(@11),B'01000000'                           0403 00047000
*     ZSAZACTV='1'B;                                               0404 00048000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0404 00049000
*     ZSAZTRAC='HCAN';                                             0405 00050000
         MVC   ZSAZTRAC(4,GPR13P),@CC02985                         0405 00051000
*     ZSAZSVRR=GPR14P;                                             0406 00052000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0406 00053000
*     GPR13P=ZSAZSVFC;                                             0407 00054000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0407 00055000
*     RFY                                                          0408 00056000
*      (GPR01P) UNRSTD;                                            0408 00057000
*     RFY                                                          0409 00058000
*      (GPR14P) UNRSTD;                                            0409 00059000
*   END;                                                           0410 00060000
*                                                                  0410 00061000
*/* END TPZSAVE                                                      */ 00062000
*                                                                  0411 00063000
*   BTUREG=ADDR(ZOBBTU);            /* ADDRESS OUTBOUND BTU          */ 00064000
         LA    BTUREG,ZOBBTU(,BUFREG)                              0411 00065000
*/* SEGMENT(HCAN010)REQUEST                                          */ 00066000
*                                                                  0412 00067000
*   DO;                                                            0412 00068000
*     GOTO HCAN010;                                                0413 00069000
         B     HCAN010                                             0413 00070000
*HCAN010#:                                                         0414 00071000
*   END;                                                           0414 00072000
HCAN010# DS    0H                                                  0415 00073000
*   IF LCPZRT00='1'B|LCPZRT01='1'B  /* ERROR ENCOUNTERED ?           */ 00074000
*     THEN                                                         0415 00075000
         TM    LCPZRT00(ELEMREG),B'11000000'                       0415 00076000
         BNZ   @RT00415                                            0415 00077000
*     ;                             /* YES, DON'T INITIALIZE BTU     */ 00078000
*   ELSE                                                           0417 00079000
*HCAN1:                                                            0417 00080000
*     DO;                                                          0417 00081000
HCAN1    DS    0H                                                  0418 00082000
*       IF RC=0                     /* IF NOT IN SESSION             */ 00083000
*         THEN                                                     0418 00084000
         LTR   RC,RC                                               0418 00085000
         BNZ   @RF00418                                            0418 00086000
*         DO;                                                      0419 00087000
*           BDUCOMND=BCMDI;         /* COMMAND = INVITE              */ 00088000
         MVI   BDUCOMND+14(BTUREG),X'05'                           0420 00089000
*           FMCZFB06='1'B;          /* IN SESSION                    */ 00090000
         OI    FMCZFB06(FMCBREG),B'00000010'                       0421 00091000
*           FMCZX001=FMCZX001+1;    /* BUMP SESSION COUNT            */ 00092000
         LA    @14,1                                               0422 00093000
         SLR   @00,@00                                             0422 00094000
         IC    @00,FMCZX001(,FMCBREG)                              0422 00095000
         ALR   @14,@00                                             0422 00096000
         STC   @14,FMCZX001(,FMCBREG)                              0422 00097000
*           DNCINVIT='1'B;          /* DEVICE INVITE OUTSTANDING     */ 00098000
         OI    DNCINVIT(DNCBREG),B'00100000'                       0423 00099000
*         END;                                                     0424 00100000
*       ELSE                                                       0425 00101000
*         DO;                                                      0425 00102000
         B     @RC00418                                            0425 00103000
@RF00418 DS    0H                                                  0426 00104000
*           BDUCOMND=BCMDR;         /* COMMAND = READ                */ 00105000
         MVI   BDUCOMND+14(BTUREG),X'01'                           0426 00106000
*           FMCZF004='1'B;          /* APPLICATION STATUS=READ       */ 00107000
         OI    FMCZF004(FMCBREG),B'00010000'                       0427 00108000
*         END;                                                     0428 00109000
*                                                                  0428 00110000
*       /*************************************************************/ 00111000
*       /*                                                           */ 00112000
*       /* SEGMENT(HCAN020)REQUEST                                   */ 00113000
*       /*                                                           */ 00114000
*       /*************************************************************/ 00115000
*                                                                  0429 00116000
*       DO;                                                        0429 00117000
@RC00418 DS    0H                                                  0430 00118000
*         GOTO HCAN020;                                            0430 00119000
         B     HCAN020                                             0430 00120000
*HCAN020#:                                                         0431 00121000
*       END;                                                       0431 00122000
HCAN020# DS    0H                                                  0432 00123000
*     END;                                                         0432 00124000
*   IF LCPZRT00='1'B|LCPZRT01='1'B  /* ERROR ENCOUNTERED ?           */ 00125000
*     THEN                          /* YES                           */ 00126000
@RT00415 TM    LCPZRT00(ELEMREG),B'11000000'                       0433 00127000
         BZ    @RF00433                                            0433 00128000
*     CALL ISTZBFZ0;                /* ERROR RECOVERY                */ 00129000
         L     @14,ATCZPSVT(,ATCVTREG)                             0434 00130000
         L     @15,ZPSZBFZ0(,@14)                                  0434 00131000
         BALR  @14,@15                                             0434 00132000
*   ELSE                                                           0435 00133000
*     DO;                                                          0435 00134000
         B     @RC00433                                            0435 00135000
@RF00433 DS    0H                                                  0436 00136000
*       IF LCCWLSI='1'B             /* LCCW SYNCH. REQUESTED ?       */ 00137000
*         THEN                      /* YES ,CALL LCCW SYNCH RTN.     */ 00138000
         L     @14,LCPNXLCW(,ELEMREG)                              0436 00139000
         TM    LCCWLSI(@14),B'00000100'                            0436 00140000
         BNO   @RF00436                                            0436 00141000
*         CALL ISTZBFY0;                                           0437 00142000
         L     @14,ATCZPSVT(,ATCVTREG)                             0437 00143000
         L     @15,ZPSZBFY0(,@14)                                  0437 00144000
         BALR  @14,@15                                             0437 00145000
*       ELSE                                                       0438 00146000
*         ;                                                        0438 00147000
*                                                                  0438 00148000
@RF00436 DS    0H                                                  0439 00149000
*       /*************************************************************/ 00150000
*       /*                                                           */ 00151000
*       /* SEGMENT(HCAN030)REQUEST                                   */ 00152000
*       /*                                                           */ 00153000
*       /*************************************************************/ 00154000
*                                                                  0439 00155000
*       DO;                                                        0439 00156000
*         GOTO HCAN030;                                            0440 00157000
         B     HCAN030                                             0440 00158000
*HCAN030#:                                                         0441 00159000
*       END;                                                       0441 00160000
HCAN030# DS    0H                                                  0442 00161000
*     END;                                                         0442 00162000
*                                                                  0442 00163000
*/* TPZRETN                                                          */ 00164000
*                                                                  0443 00165000
*   DO;                                                            0443 00166000
@RC00433 DS    0H                                                  0444 00167000
*     RFY                                                          0444 00168000
*      (GPR07P,                                                    0444 00169000
*       GPR14P,                                                    0444 00170000
*       GPR15P) RSTD;                                              0444 00171000
*     GPR13P=ZSAZSVBC;                                             0445 00172000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0445 00173000
*     IF GPR13P=0 THEN                                             0446 00174000
         LTR   GPR13P,GPR13P                                       0446 00175000
         BZ    @RT00446                                            0446 00176000
*       ;                           /* TPDVTS ISTZFARR               */ 00177000
*     ELSE                                                         0448 00178000
*       GPR14P=ZSAZSVRR;                                           0448 00179000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0448 00180000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0449 00181000
@RT00446 DS    0H                                                  0449 00182000
         LM    7,12,ZSAZSVVR+0(13)                                      00183000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0450 00184000
         BR    GPR14P                                                   00185000
*     RFY                                                          0451 00186000
*      (GPR07P,                                                    0451 00187000
*       GPR14P,                                                    0451 00188000
*       GPR15P) UNRSTD;                                            0451 00189000
*   END;                                                           0452 00190000
*                                                                  0452 00191000
*/* END TPZRETN                                                      */ 00192000
*                                                                  0453 00193000
*                                                                  0453 00194000
*/* SEGMENT(HCAN010)START                                            */ 00195000
*                                                                  0453 00196000
*   DO;                                                            0453 00197000
*     GOTO HCAN010@;                                               0454 00198000
*HCAN010:                                                          0455 00199000
*   END;                                                           0455 00200000
HCAN010  DS    0H                                                  0456 00201000
*   IF LCCWCD='1'B                  /* DATA CHAINED                  */ 00202000
*     THEN                          /* YES, ERROR                    */ 00203000
         L     @14,LCPNXLCW(,ELEMREG)                              0456 00204000
         TM    LCCWCD(@14),B'10000000'                             0456 00205000
         BNO   @RF00456                                            0456 00206000
*     DO;                                                          0457 00207000
*       LCPZRT01='1'B;              /* FLAG ERROR                    */ 00208000
         OI    LCPZRT01(ELEMREG),B'01000000'                       0458 00209000
*       LCPMNRCD=FRMINVCF;          /* SET ERROR RETURN CODE         */ 00210000
         MVI   LCPMNRCD(ELEMREG),X'81'                             0459 00211000
*     END;                                                         0460 00212000
*   ELSE                                                           0461 00213000
*     IF(FMCZFA06='1'B|             /* IF IN SESSION OR              */ 00214000
*         FMCZFB06='1'B|            /* CONTACT OR                    */ 00215000
*         FMCZFC06='1'B)&           /* INVITE OUTSTANDING            */ 00216000
*         FMCZFD06='0'B             /* NO DISCON. PENDNG     @XM09611*/ 00217000
*       THEN                                                       0461 00218000
         B     @RC00456                                            0461 00219000
@RF00456 TM    FMCZFA06(FMCBREG),B'00000111'                       0461 00220000
         BZ    @RF00461                                            0461 00221000
         TM    FMCZFD06(FMCBREG),B'10000000'                       0461 00222000
         BNZ   @RF00461                                            0461 00223000
*       IF LCCWSI='1'B              /* START DIALOG REQUESTED?       */ 00224000
*         THEN                      /* YES, ERROR                    */ 00225000
         L     @14,LCPNXLCW(,ELEMREG)                              0462 00226000
         TM    LCCWSI(@14),B'10000000'                             0462 00227000
         BNO   @RF00462                                            0462 00228000
*         DO;                                                      0463 00229000
*           LCPZRT00='1'B;          /* FLAG ERROR                    */ 00230000
         OI    LCPZRT00(ELEMREG),B'10000000'                       0464 00231000
*           LCPMNRCD=FRMCDITS;      /* SET ERROR RETURN CODE         */ 00232000
         MVI   LCPMNRCD(ELEMREG),X'A6'                             0465 00233000
*         END;                                                     0466 00234000
*       ELSE                                                       0467 00235000
*         RC=4;                     /* SUBROUTINE RET.=IN     SESSION*/ 00236000
         B     @RC00462                                            0467 00237000
@RF00462 LA    RC,4                                                0467 00238000
*     ELSE                                                         0468 00239000
*       RC=0;                       /* SET RETURN FOR NOT IN SESSION */ 00240000
         B     @RC00461                                            0468 00241000
@RF00461 SLR   RC,RC                                               0468 00242000
*/* SEGMENT(HCAN010)FINISH                                           */ 00243000
*                                                                  0469 00244000
*   DO;                                                            0469 00245000
@RC00461 DS    0H                                                  0469 00246000
@RC00456 DS    0H                                                  0470 00247000
*     GOTO HCAN010#;                                               0470 00248000
         B     HCAN010#                                            0470 00249000
*HCAN010@:                                                         0471 00250000
*   END;                                                           0471 00251000
HCAN010@ DS    0H                                                  0472 00252000
*   GEN(EJECT);                                                    0472 00253000
         EJECT                                                          00254000
*                                                                  0473 00255000
*/* SEGMENT(HCAN020)START                                            */ 00256000
*                                                                  0473 00257000
*   DO;                                                            0473 00258000
*     GOTO HCAN020@;                                               0474 00259000
         B     HCAN020@                                            0474 00260000
*HCAN020:                                                          0475 00261000
*   END;                                                           0475 00262000
HCAN020  DS    0H                                                  0476 00263000
*   BTUZRTSC=''B;                   /* CLR BTU REQTAG SEQ@XL03HEK    */ 00264000
         NI    BTUZRTSC(BTUREG),B'11110000'                        0476 00265000
*   BTUSORCE=FMCSAF;                /* DATA SOURCE                   */ 00266000
         MVC   BTUSORCE(2,BTUREG),FMCSAF(FMCBREG)                  0477 00267000
*   BTUDEST=NCBDAF;                 /* DATA DESTINATION              */ 00268000
         MVC   BTUDEST(2,BTUREG),NCBDAF(DNCBREG)                   0478 00269000
*   BTUFID=THSET;                   /* INIT TH BYTES 1&2     @XL03HAH*/ 00270000
         MVC   BTUFID(2,BTUREG),@CB02954                           0479 00271000
*   BTURH=0;                        /* INIT REQST HEADR      @XL03HAH*/ 00272000
         SLR   @14,@14                                             0480 00273000
         ST    @14,BTURH(,BTUREG)                                  0480 00274000
*   BTUDCF=LENGTH(BTURH)+LENGTH(BTUSYSTR)+LENGTH(BTUEXTR)+LENGTH(ISTBDU 00275000
*       );                          /* INITIALIZE COUNT      @XL03HAH*/ 00276000
         MVC   BTUDCF(2,BTUREG),@CH01174                           0481 00277000
*   FDBDATAA=ADDR(ZOBBTU);          /* INIT FDB DATA         @XL03HEK*/ 00278000
         LA    @14,ZOBBTU(,BUFREG)                                 0482 00279000
         ST    @14,FDBDATAA(,BUFREG)                               0482 00280000
*   FDBDATCT=LENGTH(ISTBTU);        /* ADDR AND LENGTH       @XL03HEK*/ 00281000
         MVC   FDBDATCT(2,BUFREG),@CH01162                         0483 00282000
*   IF LCCWRWOP=LRB                 /* READ BLOCK ?                  */ 00283000
*     THEN                                                         0484 00284000
         L     @14,LCPNXLCW(,ELEMREG)                              0484 00285000
         TM    LCCWRWOP(@14),B'00000110'                           0484 00286000
         BNO   @RF00484                                            0484 00287000
         TM    LCCWRWOP(@14),B'00111001'                           0484 00288000
         BNZ   @RF00484                                            0484 00289000
*     DO;                                                          0485 00290000
*       BDUMODIF=BMODRB;            /* SET BLOCK MODIFIER            */ 00291000
         MVI   BDUMODIF+14(BTUREG),X'01'                           0486 00292000
*       DNCZPSRD=DNCZPSRB;          /* DNCB INDICATOR=BLOCK          */ 00293000
         NI    DNCZPSRD(DNCBREG),B'11111001'                       0487 00294000
*     END;                                                         0488 00295000
*   ELSE                                                           0489 00296000
*     IF LCCWRWOP=LRM               /* READ MESSAGE ?                */ 00297000
*       THEN                                                       0489 00298000
         B     @RC00484                                            0489 00299000
@RF00484 L     @14,LCPNXLCW(,ELEMREG)                              0489 00300000
         TM    LCCWRWOP(@14),B'00001010'                           0489 00301000
         BNO   @RF00489                                            0489 00302000
         TM    LCCWRWOP(@14),B'00110101'                           0489 00303000
         BNZ   @RF00489                                            0489 00304000
*       DO;                                                        0490 00305000
*         BDUMODIF=BMODDRM;         /* SET MESSAGE MODIFIER          */ 00306000
         MVI   BDUMODIF+14(BTUREG),X'02'                           0491 00307000
*         DNCZPSRD=DNCZPSRM;        /* DNCB INDICATOR=MESSAGE        */ 00308000
         NI    DNCZPSRD(DNCBREG),B'11111011'                       0492 00309000
         OI    DNCZPSRD(DNCBREG),B'00000010'                       0492 00310000
*       END;                                                       0493 00311000
*     ELSE                                                         0494 00312000
*       IF LCCWRWOP=LRCONT          /* READ CONTINOUS?               */ 00313000
*         THEN                                                     0494 00314000
         B     @RC00489                                            0494 00315000
@RF00489 L     @14,LCPNXLCW(,ELEMREG)                              0494 00316000
         TM    LCCWRWOP(@14),B'00011010'                           0494 00317000
         BNO   @RF00494                                            0494 00318000
         TM    LCCWRWOP(@14),B'00100101'                           0494 00319000
         BNZ   @RF00494                                            0494 00320000
*         DO;                                                      0495 00321000
*           BDUMODIF=BMODIA;                                       0496 00322000
         MVI   BDUMODIF+14(BTUREG),X'05'                           0496 00323000
*           DNCZPSRD=DNCZPSRC;      /* DNCB INDICATOR=CONTINUOUS     */ 00324000
         OI    DNCZPSRD(DNCBREG),B'00000110'                       0497 00325000
*         END;                      /* SET CONTINOUS MODIFIER        */ 00326000
*       ELSE                                                       0499 00327000
*         IF LCCWRWOP=LRT           /* READ TRANSMISSION ?           */ 00328000
*           THEN                                                   0499 00329000
         B     @RC00494                                            0499 00330000
@RF00494 L     @14,LCPNXLCW(,ELEMREG)                              0499 00331000
         TM    LCCWRWOP(@14),B'00001110'                           0499 00332000
         BNO   @RF00499                                            0499 00333000
         TM    LCCWRWOP(@14),B'00110001'                           0499 00334000
         BNZ   @RF00499                                            0499 00335000
*           DO;                                                    0500 00336000
*             BDUMODIF=BMODRT;                                     0501 00337000
         MVI   BDUMODIF+14(BTUREG),X'03'                           0501 00338000
*             DNCZPSRD=DNCZPSRT;    /* DNCB INDICATOR=TRANSMISSN     */ 00339000
         NI    DNCZPSRD(DNCBREG),B'11111101'                       0502 00340000
         OI    DNCZPSRD(DNCBREG),B'00000100'                       0502 00341000
*           END;                    /* SET TRANSMISSION MODIFIER     */ 00342000
*         ELSE                                                     0504 00343000
*           DO;                                                    0504 00344000
         B     @RC00499                                            0504 00345000
@RF00499 DS    0H                                                  0505 00346000
*             LCPZRT01='1'B;                                       0505 00347000
         OI    LCPZRT01(ELEMREG),B'01000000'                       0505 00348000
*             LCPMNRCD=FRMINVL;                                    0506 00349000
         MVI   LCPMNRCD(ELEMREG),X'A3'                             0506 00350000
*           END;                    /* FLAG ERROR AND SET RC         */ 00351000
*   IF LCPZRT01='1'B                /* LCCW INVALID ?                */ 00352000
*     THEN                                                         0508 00353000
@RC00499 DS    0H                                                  0508 00354000
@RC00494 DS    0H                                                  0508 00355000
@RC00489 DS    0H                                                  0508 00356000
@RC00484 TM    LCPZRT01(ELEMREG),B'01000000'                       0508 00357000
         BO    @RT00508                                            0508 00358000
*     ;                             /* EXIT                          */ 00359000
*   ELSE                                                           0510 00360000
*     DO;                                                          0510 00361000
*       FMCZFD06='0'B;              /* APPLICATION DISCONNECT PENDING*/ 00362000
         NI    FMCZFD06(FMCBREG),B'01111111'                       0511 00363000
*       DNCDISC='0'B;               /* DEVICE DISCONNECT PENDING     */ 00364000
         NI    DNCDISC(DNCBREG),B'11110111'                        0512 00365000
*       FMCZX003=FMCZX003+1;        /* INCREMENT SCHEDULE Q CNT.     */ 00366000
         LA    @14,1                                               0513 00367000
         SLR   @00,@00                                             0513 00368000
         IC    @00,FMCZX003(,FMCBREG)                              0513 00369000
         ALR   @14,@00                                             0513 00370000
         STC   @14,FMCZX003(,FMCBREG)                              0513 00371000
*       LCPREQTG=BTUREQ;            /* REQUEST TAG TO ELEMENT        */ 00372000
         MVC   LCPREQTG(2,ELEMREG),BTUREQ(BTUREG)                  0514 00373000
*       FMCZF001='1'B;              /* BDU ALLOCATION REQUIRED FOR 0515 00374000
*                                      NEXT LCCW                     */ 00375000
         OI    FMCZF001(FMCBREG),B'10000000'                       0515 00376000
*     END;                                                         0516 00377000
*                                                                  0516 00378000
*/* SEGMENT(HCAN020)FINISH                                           */ 00379000
*                                                                  0517 00380000
*   DO;                                                            0517 00381000
@RT00508 DS    0H                                                  0518 00382000
*     GOTO HCAN020#;                                               0518 00383000
         B     HCAN020#                                            0518 00384000
*HCAN020@:                                                         0519 00385000
*   END;                                                           0519 00386000
HCAN020@ DS    0H                                                  0520 00387000
*   GEN(EJECT);                                                    0520 00388000
         EJECT                                                          00389000
*                                                                  0521 00390000
*/* SEGMENT(HCAN030)START                                            */ 00391000
*                                                                  0521 00392000
*   DO;                                                            0521 00393000
*     GOTO HCAN030@;                                               0522 00394000
         B     HCAN030@                                            0522 00395000
*HCAN030:                                                          0523 00396000
*   END;                                                           0523 00397000
HCAN030  DS    0H                                                  0524 00398000
*   IF BDUCOMND=BCMDR               /* COMMAND = READ ?              */ 00399000
*     THEN                                                         0524 00400000
         CLI   BDUCOMND+14(BTUREG),X'01'                           0524 00401000
         BNE   @RF00524                                            0524 00402000
*HCAN30:                                                           0525 00403000
*     DO;                                                          0525 00404000
HCAN30   DS    0H                                                  0526 00405000
*       DNCSESS='1'B;               /* INDIC NCP SESSION     @XA06938*/ 00406000
         OI    DNCSESS(DNCBREG),B'01000000'                        0526 00407000
*       FMCZFA06='0'B;              /* FMCB NOT IN SESS      @XA06938*/ 00408000
         NI    FMCZFA06(FMCBREG),B'11111011'                       0527 00409000
*       DNCZV001=0;                 /* NO ACTIVE APPLICATION FOR   0528 00410000
*                                      DEVICE                        */ 00411000
         SLR   @14,@14                                             0528 00412000
         STCM  @14,7,DNCZV001(DNCBREG)                             0528 00413000
*       ADDR(DNCZC001)->PABDVTA=DNCZV004;/* DIALOG SCHED TO GET    0529 00414000
*                                      CONTROL FOR THIS DEVICE       */ 00415000
         MVC   PABDVTA+96(3,DNCBREG),DNCZV004+1(DNCBREG)           0529 00416000
*       ZCRPCOD1='00'X;                                            0530 00417000
         L     @14,RPHCRR(,RPHREG)                                 0530 00418000
         L     @14,CRACRR(,@14)                                    0530 00419000
         MVI   ZCRPCOD1(@14),X'00'                                 0530 00420000
*       ZCRPBUF='1'B;                                              0531 00421000
*                                                                  0531 00422000
         OI    ZCRPBUF(@14),B'00000100'                            0531 00423000
*       /*************************************************************/ 00424000
*       /*                                                           */ 00425000
*       /* ALLOCATE A FSB VIA TPIOS UTILITY                          */ 00426000
*       /*                                                           */ 00427000
*       /*************************************************************/ 00428000
*                                                                  0532 00429000
*       CALL ISTZDFA0;                                             0532 00430000
         L     @14,ATCZPSVT(,ATCVTREG)                             0532 00431000
         L     @15,ZPSZDFA0(,@14)                                  0532 00432000
         BALR  @14,@15                                             0532 00433000
*       WORKREG=RPHSRPRM;           /* ADDRESS INBOUND BUFFER        */ 00434000
         L     WORKREG,RPHSRPRM(,RPHREG)                           0533 00435000
*       ZIBLNG2=ZIBLNG1;            /* SAVE BUFFER LENGTH            */ 00436000
         MVC   ZIBLNG2(2,WORKREG),ZIBLNG1(WORKREG)                 0534 00437000
*       FSBTYPE=FSTYPE;             /*                               */ 00438000
         LA    @14,16                                              0535 00439000
         ALR   @14,WORKREG                                         0535 00440000
         MVI   FSBTYPE(@14),X'02'                                  0535 00441000
*       FSBLNGTH=LENGTH(ISTFSB);    /*                               */ 00442000
         MVI   FSBLNGTH(@14),X'2C'                                 0536 00443000
*       FSBCID=LCPCID;              /* INITIALIZE                    */ 00444000
         MVC   FSBCID(4,@14),LCPCID(ELEMREG)                       0537 00445000
*       FSBLCCWA=LCPNXLCW;          /*                               */ 00446000
         MVC   FSBLCCWA(4,@14),LCPNXLCW(ELEMREG)                   0538 00447000
*       FSBLCPB=ELEMREG;            /* FSB                           */ 00448000
         ST    ELEMREG,FSBLCPB(,@14)                               0539 00449000
*       FSBMNRCD=FRMOK;             /*                               */ 00450000
         MVI   FSBMNRCD(@14),X'00'                                 0540 00451000
*       FSBMJRCD=FRNORM;            /*                               */ 00452000
         MVI   FSBMJRCD(@14),X'00'                                 0541 00453000
*       ADDR(ZIBFDBS)->FDBDATAA=0;  /* INIT SYSTEM FDB       @XM01400*/ 00454000
         SLR   @14,@14                                             0542 00455000
         LA    @11,48                                              0542 00456000
         ALR   @11,WORKREG                                         0542 00457000
         ST    @14,FDBDATAA(,@11)                                  0542 00458000
*       ADDR(ZIBFDBS)->FDBDATCT=0;  /* NO DATA               @XM01400*/ 00459000
         STH   @14,FDBDATCT(,@11)                                  0543 00460000
*       ADDR(ZIBFDBS)->FDBFDBA=0;   /* NO CHAINED FDB        @XM01400*/ 00461000
         ST    @14,FDBFDBA(,@11)                                   0544 00462000
*       ADDR(ZIBFDBS)->FDBOFSET=ADDR(ZIBFDBS)-ADDR(ZIBFDBZ);/* FDB 0545 00463000
*                                      OFFSET                @XM01400*/ 00464000
*                                                                  0545 00465000
         LA    @14,ZIBFDBS(,WORKREG)                               0545 00466000
         SLR   @14,WORKREG                                         0545 00467000
         STH   @14,FDBOFSET(,@11)                                  0545 00468000
*       /*************************************************************/ 00469000
*       /*                                                           */ 00470000
*       /* DEQUE CURRENT ELEMENT FROM SCHEDULE Q                     */ 00471000
*       /*                                                           */ 00472000
*       /*************************************************************/ 00473000
*                                                                  0546 00474000
*/* TPDEQ (ELEMREG,FMCSHEDQ)                                         */ 00475000
*                                                                  0546 00476000
*       DO;                         /* BEGIN TPDEQ CODE GENERATION   */ 00477000
*         DCL                                                      0547 00478000
*           FMZCA026 BIT(32) CONSTANT('80000000'X);                0547 00479000
*         DCL                                                      0548 00480000
*           FMZCB026 BIT(32) CONSTANT('7FFFFFFF'X);                0548 00481000
*         RFY                                                      0549 00482000
*          (GPR00P,                                                0549 00483000
*           GPR01P,                                                0549 00484000
*           GPR14P,                                                0549 00485000
*           GPR15P) RSTD;                                          0549 00486000
*         RFY                                                      0550 00487000
*           ISTWKE;                                                0550 00488000
*         GPR15P=ADDR(FMCSHEDQ);    /* ADDRESS QUEUE POINTER         */ 00489000
         LA    GPR15P,FMCSHEDQ(,FMCBREG)                           0551 00490000
*         RFY                                                      0552 00491000
*          (GPR02P,                                                0552 00492000
*           GPR03P) RSTD;                                          0552 00493000
*         STM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                0553 00494000
         STM   GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0553 00495000
*         GPR03P=ELEMREG|FMZCA026;                                 0554 00496000
         L     @11,@CF01227                                        0554 00497000
         LR    GPR03P,ELEMREG                                      0554 00498000
         OR    GPR03P,@11                                          0554 00499000
*         GPR14P=FMZCA026;                                         0555 00500000
         LR    GPR14P,@11                                          0555 00501000
*         GPR15P=ADDR(GPR15P->PABWEQA);                            0556 00502000
*         GPR02P=GPR15P->PABWEQA|FMZCA026;                         0557 00503000
         O     @11,PABWEQA(,GPR15P)                                0557 00504000
         LR    GPR02P,@11                                          0557 00505000
*         DO WHILE(GPR02P^=GPR14P);                                0558 00506000
         B     @DE00558                                            0558 00507000
@DL00558 DS    0H                                                  0559 00508000
*FMZL2026:                                                         0559 00509000
*           ;                                                      0559 00510000
FMZL2026 DS    0H                                                  0560 00511000
*           IF GPR02P=GPR03P THEN                                  0560 00512000
         CR    GPR02P,GPR03P                                       0560 00513000
         BNE   @RF00560                                            0560 00514000
*             DO;                                                  0561 00515000
*               GPR00P=GPR02P->WKECHAIN;                           0562 00516000
         L     GPR00P,WKECHAIN(,GPR02P)                            0562 00517000
*               CS(GPR02P,GPR00P,GPR15P->PABWEQA);                 0563 00518000
         CS    GPR02P,@00,PABWEQA(GPR15P)                          0563 00519000
*               BC(7,FMZL3026);                                    0564 00520000
         BC    7,FMZL3026                                          0564 00521000
*               GPR14P=GPR02P;                                     0565 00522000
         LR    GPR14P,GPR02P                                       0565 00523000
*               GPR14P->WKECHAIN=0;                                0566 00524000
         SLR   @11,@11                                             0566 00525000
         ST    @11,WKECHAIN(,GPR14P)                               0566 00526000
*             END;                                                 0567 00527000
*           ELSE                                                   0568 00528000
*             DO;                                                  0568 00529000
         B     @RC00560                                            0568 00530000
@RF00560 DS    0H                                                  0569 00531000
*               IF(GPR02P->WKECHAIN)=GPR14P THEN                   0569 00532000
         L     @11,WKECHAIN(,GPR02P)                               0569 00533000
         CR    @11,GPR14P                                          0569 00534000
         BE    @RT00569                                            0569 00535000
*                 GOTO ISTA0026;                                   0570 00536000
*               ELSE                                               0571 00537000
*                 DO;                                              0571 00538000
*                   GPR15P=ADDR(GPR02P->WKECHAIN);                 0572 00539000
         LA    GPR15P,WKECHAIN(,GPR02P)                            0572 00540000
*                   GPR02P=GPR02P->WKECHAIN;                       0573 00541000
         LR    GPR02P,@11                                          0573 00542000
*                   GOTO FMZL2026;                                 0574 00543000
         B     FMZL2026                                            0574 00544000
*                 END;                                             0575 00545000
*             END;                                                 0576 00546000
*FMZL3026:                                                         0577 00547000
*           ;                                                      0577 00548000
@RC00560 DS    0H                                                  0577 00549000
FMZL3026 DS    0H                                                  0578 00550000
*         END;                                                     0578 00551000
@DE00558 CR    GPR02P,GPR14P                                       0578 00552000
         BNE   @DL00558                                            0578 00553000
*ISTA0026:                                                         0579 00554000
*         ;                                                        0579 00555000
ISTA0026 DS    0H                                                  0580 00556000
*         LM(GPR02P,GPR03P,GPR01P->RPHWORK(5:12));                 0580 00557000
         LM    GPR02P,GPR03P,RPHWORK+4(GPR01P)                     0580 00558000
*         RFY                                                      0581 00559000
*          (GPR02P,                                                0581 00560000
*           GPR03P) UNRSTD;                                        0581 00561000
*         GPR14P=GPR14P&FMZCB026;                                  0582 00562000
         N     GPR14P,@CF01225                                     0582 00563000
*         GPR01P->RPHWEA=GPR14P;                                   0583 00564000
         ST    GPR14P,RPHWEA(,GPR01P)                              0583 00565000
*         RFY                                                      0584 00566000
*          (GPR00P,                                                0584 00567000
*           GPR01P,                                                0584 00568000
*           GPR14P,                                                0584 00569000
*           GPR15P) UNRSTD;                                        0584 00570000
*       END;                        /* END TPDEQ GENERATION          */ 00571000
*       LCPFDBA=0;                  /* ZERO ELEMENT BUFFER ADDR.     */ 00572000
*                                                                  0586 00573000
         SLR   @14,@14                                             0586 00574000
         ST    @14,LCPFDBA(,ELEMREG)                               0586 00575000
*       /*************************************************************/ 00576000
*       /*                                                           */ 00577000
*       /* Q FSB TO PART SOLICTOR INBOUND PAB                        */ 00578000
*       /*                                                           */ 00579000
*       /*************************************************************/ 00580000
*                                                                  0587 00581000
*/*  TPQUE (ADDR(ZIBFSB),FMCPAB2) NORM                               */ 00582000
*                                                                  0587 00583000
*       DO;                                                        0587 00584000
*         RFY                                                      0588 00585000
*          (GPR00P,                                                0588 00586000
*           GPR01P,                                                0588 00587000
*           GPR04P,                                                0588 00588000
*           GPR05P,                                                0588 00589000
*           GPR15P) RSTD;                                          0588 00590000
*         GEN REFS(GPR01P) SETS(RPHWORK)                           0589 00591000
*             (STM GPR02P,GPR08P,RPHWORK(GPR01P));                 0589 00592000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00593000
*         GPR00P=0;                                                0590 00594000
         SLR   GPR00P,GPR00P                                       0590 00595000
*         GPR15P=ADDR(FMCPAB2);     /* HOLD PAB PTR                  */ 00596000
         LA    GPR15P,FMCPAB2(,FMCBREG)                            0591 00597000
*         GPR04P=ADDR(ZIBFSB);      /* WORK ELE PTR                  */ 00598000
         LA    GPR04P,ZIBFSB(,WORKREG)                             0592 00599000
*         GPR05P=GPR15P;            /* PASS PAB PTR                  */ 00600000
         LR    GPR05P,GPR15P                                       0593 00601000
*         CALL ATCLCPTR->ATCAP37->ISTAPC37;                        0594 00602000
         L     @14,ATCLCPTR                                        0594 00603000
         L     @15,ATCAP37(,@14)                                   0594 00604000
         BALR  @14,@15                                             0594 00605000
*         GEN(NOPR  0)                                             0595 00606000
*         NOSETS NOREFS;                                           0595 00607000
         NOPR  0                                                        00608000
*         RFY                                                      0596 00609000
*          (GPR00P,                                                0596 00610000
*           GPR01P,                                                0596 00611000
*           GPR04P,                                                0596 00612000
*           GPR05P,                                                0596 00613000
*           GPR15P) UNRSTD;                                        0596 00614000
*       END;                        /* *** END OF TPQUE GENERATION 0597 00615000
*                                                            @XM03HDP*/ 00616000
*                                                                  0597 00617000
*       /*************************************************************/ 00618000
*       /*                                                           */ 00619000
*       /* SHIPOUT ZOB                                               */ 00620000
*       /*                                                           */ 00621000
*       /*************************************************************/ 00622000
*                                                                  0598 00623000
*       IF DNCBREG->NCBFTRIO='1'B THEN/* TRACE ACTIVE        @XM10497*/ 00624000
         CLI   NCBFTRIO(DNCBREG),1                                 0598 00625000
         BNE   @RF00598                                            0598 00626000
*         ZOBRT08='1'B;             /* SET CONF TXT          @XM10497*/ 00627000
         OI    ZOBRT08(BUFREG),B'01000000'                         0599 00628000
*       ELSE                                                       0600 00629000
*         ;                         /*                       @XM10497*/ 00630000
@RF00598 DS    0H                                                  0601 00631000
*       IF PROCFTX='1'B THEN        /* CONFIDENTIAL TXT      @XM10497*/ 00632000
         TM    PROCFTX+48(FMCBREG),B'00000001'                     0601 00633000
         BNO   @RF00601                                            0601 00634000
*         ZOBRT06='1'B;             /* SET CONF TXT FLG      @XM10497*/ 00635000
         OI    ZOBRT06(BUFREG),B'10000000'                         0602 00636000
*       ELSE                                                       0603 00637000
*         ;                         /*                       @XM10497*/ 00638000
@RF00601 DS    0H                                                  0604 00639000
*       CALL ISTZEFBB;                                             0604 00640000
         L     @14,ATCZFSVT(,ATCVTREG)                             0604 00641000
         L     @15,ZFSZEFBB(,@14)                                  0604 00642000
         BALR  @14,@15                                             0604 00643000
*     END HCAN30;                                                  0605 00644000
*   ELSE                                                           0606 00645000
*     ;                                                            0606 00646000
*                                                                  0606 00647000
@RF00524 DS    0H                                                  0607 00648000
*/* SEGMENT(HCAN030)FINISH                                           */ 00649000
*                                                                  0607 00650000
*   DO;                                                            0607 00651000
*     GOTO HCAN030#;                                               0608 00652000
         B     HCAN030#                                            0608 00653000
*HCAN030@:                                                         0609 00654000
*   END;                                                           0609 00655000
*                                                                  0609 00656000
HCAN030@ DS    0H                                                  0610 00657000
*/* TPEPILOG                                                         */ 00658000
*                                                                  0610 00659000
*   GEN(PRINT OFF);                                                0610 00660000
         PRINT OFF                                                      00661000
*/* TEMPLATE FOR CHAIN FIELD OF WORK ELEMENT */                    0611 00662000
*DCL  1  ISTWKE BDY(WORD) BASED(WKEPTR),                           0611 00663000
*        2  * CHAR(4),                 /* SPACE                       * 00664000
*        2  WKECHAIN PTR(31),          /* CHAIN POINTER               * 00665000
*           3 WKEFLAGS BIT(8),         /* FLAGS                       * 00666000
*             4 WKEGATE  BIT(1),       /* GATE BIT                    * 00667000
*             4 *        BIT(7),       /* RESERVED                    * 00668000
*           3 WKECHNGP PTR(24);        /* PTR ADDRESS                 * 00669000
*   DCL                                                            0612 00670000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 00671000
*   DCL                                                            0613 00672000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 00673000
*   GEN(PRINT ON);                                                 0614 00674000
*                                                                  0614 00675000
         PRINT ON                                                       00676000
*/* END OF TPEPILOG                                                  */ 00677000
*                                                                  0615 00678000
*   END ISTZHFAN;                                                  0615 00679000
@EL00001 DS    0H                                                  0615 00680000
@EF00001 DS    0H                                                  0615 00681000
@ER00001 BR    @14                                                 0615 00682000
@DATA    DS    0H                                                       00683000
@CH01174 DC    H'10'                                                    00684000
@CH01162 DC    H'20'                                                    00685000
@DATD    DSECT                                                          00686000
         DS    0F                                                       00687000
ISTZHFAN CSECT                                                          00688000
         DS    0F                                                       00689000
@CF01225 DC    XL4'7FFFFFFF'                                            00690000
@CF01227 DC    XL4'80000000'                                            00691000
@DATD    DSECT                                                          00692000
         DS    0D                                                       00693000
LCPBPTR  DS    A                                                        00694000
BDUPTR   DS    A                                                        00695000
BTUPTR   DS    A                                                        00696000
FSBPTR   DS    A                                                        00697000
FMCBPTR  DS    A                                                        00698000
DNCBPTR  DS    A                                                        00699000
WKEPTR   DS    A                                                        00700000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00701000
@ENDDATD EQU   *                                                        00702000
ISTZHFAN CSECT                                                          00703000
         DS    0F                                                       00704000
@SIZDATD DC    AL1(0)                                                   00705000
         DC    AL3(@ENDDATD-@DATD)                                      00706000
         DS    0D                                                       00707000
@CC02985 DC    C'HCAN'                                                  00708000
@CB02954 DC    X'0E00'                                                  00709000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00710000
@01      EQU   01                                                       00711000
@02      EQU   02                                                       00712000
@03      EQU   03                                                       00713000
@04      EQU   04                                                       00714000
@05      EQU   05                                                       00715000
@06      EQU   06                                                       00716000
@07      EQU   07                                                       00717000
@08      EQU   08                                                       00718000
@09      EQU   09                                                       00719000
@10      EQU   10                                                       00720000
@11      EQU   11                                                       00721000
@12      EQU   12                                                       00722000
@13      EQU   13                                                       00723000
@14      EQU   14                                                       00724000
@15      EQU   15                                                       00725000
GPR00P   EQU   @00                                                      00726000
GPR01P   EQU   @01                                                      00727000
GPR02P   EQU   @02                                                      00728000
GPR03P   EQU   @03                                                      00729000
GPR04P   EQU   @04                                                      00730000
GPR05P   EQU   @05                                                      00731000
GPR07P   EQU   @07                                                      00732000
GPR12P   EQU   @12                                                      00733000
GPR13P   EQU   @13                                                      00734000
GPR14P   EQU   @14                                                      00735000
GPR15P   EQU   @15                                                      00736000
RPHPTR   EQU   @01                                                      00737000
RPHREG   EQU   @01                                                      00738000
ATCVTREG EQU   @02                                                      00739000
R3       EQU   @03                                                      00740000
DNCBREG  EQU   @04                                                      00741000
FMCBREG  EQU   @05                                                      00742000
BUFREG   EQU   @06                                                      00743000
ELEMREG  EQU   @07                                                      00744000
WORKREG  EQU   @08                                                      00745000
BTUREG   EQU   @09                                                      00746000
R12      EQU   @12                                                      00747000
R13      EQU   @13                                                      00748000
RC       EQU   @15                                                      00749000
GPR00F   EQU   @00                                                      00750000
GPR01F   EQU   @01                                                      00751000
GPR02F   EQU   @02                                                      00752000
GPR03F   EQU   @03                                                      00753000
GPR04F   EQU   @04                                                      00754000
GPR05F   EQU   @05                                                      00755000
GPR06F   EQU   @06                                                      00756000
GPR06P   EQU   @06                                                      00757000
GPR07F   EQU   @07                                                      00758000
GPR08F   EQU   @08                                                      00759000
GPR08P   EQU   @08                                                      00760000
GPR09F   EQU   @09                                                      00761000
GPR09P   EQU   @09                                                      00762000
GPR10F   EQU   @10                                                      00763000
GPR10P   EQU   @10                                                      00764000
GPR11F   EQU   @11                                                      00765000
GPR11P   EQU   @11                                                      00766000
GPR12F   EQU   @12                                                      00767000
GPR13F   EQU   @13                                                      00768000
GPR14F   EQU   @14                                                      00769000
GPR15F   EQU   @15                                                      00770000
R0       EQU   @00                                                      00771000
ATCLCPTR EQU   1032                                                     00772000
ISTLCCW  EQU   0                                                        00773000
LCCWOP   EQU   ISTLCCW                                                  00774000
LCCWSI   EQU   LCCWOP                                                   00775000
LCCWRWOP EQU   LCCWOP                                                   00776000
LCCWCTL  EQU   LCCWRWOP                                                 00777000
LCCWFLAG EQU   ISTLCCW+1                                                00778000
LCCWCD   EQU   LCCWFLAG                                                 00779000
LCCWLSI  EQU   LCCWFLAG                                                 00780000
ISTLCPB  EQU   0                                                        00781000
LCPREQTG EQU   ISTLCPB+2                                                00782000
LCPFLAGS EQU   LCPREQTG                                                 00783000
LCPZRT00 EQU   LCPFLAGS                                                 00784000
LCPZRT01 EQU   LCPFLAGS                                                 00785000
LCPZF001 EQU   LCPFLAGS                                                 00786000
LCPZRT02 EQU   LCPZF001                                                 00787000
LCPZF002 EQU   LCPFLAGS                                                 00788000
LCPZRT03 EQU   LCPZF002                                                 00789000
LCPZF003 EQU   LCPFLAGS                                                 00790000
LCPZRT04 EQU   LCPZF003                                                 00791000
LCPZF004 EQU   LCPFLAGS                                                 00792000
LCPZRT05 EQU   LCPZF004                                                 00793000
LCPZRT06 EQU   LCPFLAGS                                                 00794000
LCPZRT07 EQU   LCPFLAGS                                                 00795000
LCPMNRCD EQU   LCPREQTG+1                                               00796000
LCPZRT08 EQU   LCPMNRCD                                                 00797000
LCPZRT09 EQU   LCPMNRCD                                                 00798000
LCPCHAIN EQU   ISTLCPB+4                                                00799000
LCPCHAI1 EQU   LCPCHAIN                                                 00800000
LCPRUCNT EQU   ISTLCPB+8                                                00801000
LCPFLAG2 EQU   ISTLCPB+9                                                00802000
LCPTLBPI EQU   LCPFLAG2                                                 00803000
LCPFID0  EQU   LCPFLAG2                                                 00804000
LCPSEQ   EQU   ISTLCPB+10                                               00805000
LCPCID   EQU   ISTLCPB+16                                               00806000
LCPNXLCW EQU   ISTLCPB+20                                               00807000
LCPFDBA  EQU   ISTLCPB+24                                               00808000
LCPFLG1  EQU   ISTLCPB+37                                               00809000
LCPFLCCW EQU   ISTLCPB+40                                               00810000
LCPLCCW  EQU   ISTLCPB+48                                               00811000
LCPPABA  EQU   LCPLCCW+4                                                00812000
LCPRPHA  EQU   LCPPABA                                                  00813000
ISTBDU   EQU   0                                                        00814000
BDUCOMND EQU   ISTBDU                                                   00815000
BDUMODIF EQU   ISTBDU+1                                                 00816000
BDUMOD1  EQU   BDUMODIF                                                 00817000
BDUDAF   EQU   ISTBDU+2                                                 00818000
BDUFUNC  EQU   BDUDAF                                                   00819000
BDUCHECK EQU   BDUFUNC                                                  00820000
BDUFLAGS EQU   BDUDAF+1                                                 00821000
ISTFDB   EQU   0                                                        00822000
FDBFDBA  EQU   ISTFDB                                                   00823000
FDBDATAA EQU   ISTFDB+4                                                 00824000
FDBDATCT EQU   ISTFDB+8                                                 00825000
FDBOFSET EQU   ISTFDB+10                                                00826000
ISTLH    EQU   0                                                        00827000
ISTTH    EQU   0                                                        00828000
THFLAG1  EQU   ISTTH                                                    00829000
THFLGA   EQU   THFLAG1                                                  00830000
THMPF    EQU   THFLGA                                                   00831000
THFLGB   EQU   THFLAG1+1                                                00832000
ISTTH2   EQU   0                                                        00833000
TH2FLAG1 EQU   ISTTH2                                                   00834000
TH2MPF   EQU   TH2FLAG1                                                 00835000
ISTBTU   EQU   0                                                        00836000
BTUBTH   EQU   ISTBTU                                                   00837000
BTUFID   EQU   BTUBTH                                                   00838000
BTUDEST  EQU   BTUBTH+2                                                 00839000
BTUSORCE EQU   BTUBTH+4                                                 00840000
BTUREQ   EQU   BTUBTH+6                                                 00841000
BTURQFLG EQU   BTUREQ                                                   00842000
BTUZRTSC EQU   BTURQFLG+1                                               00843000
BTUDCF   EQU   BTUBTH+8                                                 00844000
BTURH    EQU   BTUBTH+10                                                00845000
BTUBDU   EQU   ISTBTU+14                                                00846000
BTUSYSTR EQU   ISTBTU+18                                                00847000
BTUEXTR  EQU   ISTBTU+19                                                00848000
ISTFSB   EQU   0                                                        00849000
FSBFSB   EQU   ISTFSB                                                   00850000
FSBTYPE  EQU   FSBFSB                                                   00851000
FSBLNGTH EQU   FSBFSB+1                                                 00852000
FSBMNRCD EQU   FSBFSB+2                                                 00853000
FSBSFLGS EQU   FSBFSB+3                                                 00854000
FSBFSBA  EQU   FSBFSB+4                                                 00855000
FSBBTH   EQU   FSBFSB+8                                                 00856000
FSBCID   EQU   FSBBTH                                                   00857000
FSBRQTAG EQU   FSBBTH+4                                                 00858000
FSBSEQID EQU   FSBRQTAG                                                 00859000
FSBFLAGS EQU   FSBSEQID                                                 00860000
FSBSEQ   EQU   FSBSEQID+1                                               00861000
FSBCSWST EQU   FSBBTH+6                                                 00862000
FSBTHFLD EQU   FSBCSWST                                                 00863000
FSBTH1   EQU   FSBTHFLD                                                 00864000
FSBSYSRS EQU   FSBTH1                                                   00865000
FSBTH2   EQU   FSBTHFLD+1                                               00866000
FSBEXTRS EQU   FSBTH2                                                   00867000
FSBXFSTS EQU   FSBEXTRS                                                 00868000
FSBXCODE EQU   FSBEXTRS                                                 00869000
FSBNETRS EQU   FSBFSB+16                                                00870000
FSBSRCAT EQU   FSBNETRS                                                 00871000
FSBMJRCD EQU   FSBSRCAT                                                 00872000
FSBERC   EQU   FSBNETRS+1                                               00873000
FSBFBMI  EQU   FSBERC                                                   00874000
FSBDMGRS EQU   FSBFSB+18                                                00875000
FSBSS1   EQU   FSBDMGRS                                                 00876000
FSBSS2   EQU   FSBDMGRS+1                                               00877000
FSBLCPB  EQU   FSBFSB+20                                                00878000
FSBMSGID EQU   FSBLCPB                                                  00879000
FSBLCCWA EQU   FSBFSB+24                                                00880000
FSBRLSTS EQU   FSBLCCWA                                                 00881000
ISTZIBUF EQU   0                                                        00882000
ZIBFSM   EQU   ISTZIBUF+4                                               00883000
ZIBLNG1  EQU   ZIBFSM                                                   00884000
ISTLOK   EQU   0                                                        00885000
LOKCHN   EQU   ISTLOK+1                                                 00886000
LOKCHNG  EQU   LOKCHN                                                   00887000
@NM00013 EQU   LOKCHNG+2                                                00888000
ISTPAB   EQU   0                                                        00889000
PABWQCHN EQU   ISTPAB                                                   00890000
PABWEQA  EQU   PABWQCHN                                                 00891000
PABCHAIN EQU   PABWQCHN+4                                               00892000
PABDVTA  EQU   ISTPAB+9                                                 00893000
PABRPHFG EQU   ISTPAB+12                                                00894000
PABFLAGS EQU   PABRPHFG                                                 00895000
PABERLCK EQU   PABFLAGS                                                 00896000
PABERRLK EQU   PABERLCK                                                 00897000
ISTDEVCH EQU   0                                                        00898000
DEVSHCH  EQU   ISTDEVCH                                                 00899000
DEVCHAR  EQU   DEVSHCH                                                  00900000
DEVTCODE EQU   ISTDEVCH+1                                               00901000
DEVFLAGS EQU   ISTDEVCH+3                                               00902000
DEVFCCTL EQU   DEVFLAGS                                                 00903000
DEVCHAR3 EQU   DEVFLAGS                                                 00904000
ISTPROCD EQU   0                                                        00905000
PROPROC  EQU   ISTPROCD                                                 00906000
PROPROC1 EQU   PROPROC                                                  00907000
PROPROC2 EQU   PROPROC+1                                                00908000
PROCFTX  EQU   PROPROC2                                                 00909000
PROPROC3 EQU   PROPROC+2                                                00910000
PROPROC4 EQU   PROPROC+3                                                00911000
PROPROCS EQU   0                                                        00912000
PROSETMS EQU   PROPROCS+1                                               00913000
PROSETM2 EQU   PROSETMS                                                 00914000
PROSETM3 EQU   PROSETMS+1                                               00915000
PROSETM4 EQU   PROSETMS+2                                               00916000
ISTFMCB  EQU   0                                                        00917000
FMCSAF   EQU   ISTFMCB+2                                                00918000
FMCSTAT  EQU   ISTFMCB+28                                               00919000
FMCSTAT1 EQU   ISTFMCB+29                                               00920000
FMCCMDFL EQU   ISTFMCB+31                                               00921000
FMCCMPS1 EQU   ISTFMCB+36                                               00922000
FMCPROCD EQU   ISTFMCB+48                                               00923000
FMCPAB2  EQU   ISTFMCB+80                                               00924000
FMCSIPA  EQU   ISTFMCB+148                                              00925000
FMCNXOSQ EQU   ISTFMCB+152                                              00926000
FMCNXCFM EQU   FMCNXOSQ                                                 00927000
FMCNXOSC EQU   FMCNXOSQ+2                                               00928000
FMCSSTAT EQU   ISTFMCB+159                                              00929000
FMCPACE  EQU   ISTFMCB+160                                              00930000
FMCPACEN EQU   FMCPACE                                                  00931000
FMCPACEM EQU   FMCPACE+1                                                00932000
FMCPACPC EQU   FMCPACE+2                                                00933000
FMCCVAL  EQU   FMCPACE+3                                                00934000
FMCOBCE  EQU   FMCCVAL                                                  00935000
FMCCLEXT EQU   ISTFMCB+164                                              00936000
FMCRPLA  EQU   FMCCLEXT                                                 00937000
FMCFBA   EQU   FMCCLEXT+4                                               00938000
FMCCMPS2 EQU   FMCCLEXT+16                                              00939000
FMCFLGA  EQU   FMCCMPS2                                                 00940000
FMCFLGCL EQU   FMCCMPS2+1                                               00941000
FMCPSCMD EQU   FMCCMPS2+2                                               00942000
FMCPSTAT EQU   FMCCMPS2+3                                               00943000
FMCSTAT2 EQU   ISTFMCB+186                                              00944000
FMCMODEB EQU   ISTFMCB+189                                              00945000
FMCCLSEQ EQU   ISTFMCB+190                                              00946000
FMCRRESP EQU   ISTFMCB+195                                              00947000
FMCSSEGQ EQU   ISTFMCB+200                                              00948000
FMCFBAS  EQU   ISTFMCB+216                                              00949000
FMCZV002 EQU   FMCFBAS                                                  00950000
FMCSNCTL EQU   ISTFMCB+224                                              00951000
FMCSCFLG EQU   FMCSNCTL                                                 00952000
FMCVS1   EQU   ISTFMCB+232                                              00953000
FMCZFLAG EQU   FMCVS1                                                   00954000
FMCZF001 EQU   FMCZFLAG                                                 00955000
FMCZF004 EQU   FMCZFLAG                                                 00956000
FMCZF006 EQU   FMCZFLAG                                                 00957000
FMCZFA06 EQU   FMCZF006                                                 00958000
FMCZFB06 EQU   FMCZF006                                                 00959000
FMCZFC06 EQU   FMCZF006                                                 00960000
FMCZFD06 EQU   FMCZF006+1                                               00961000
FMCSHEDQ EQU   FMCVS1+8                                                 00962000
FMCLBXM  EQU   FMCVS1+12                                                00963000
FMCSHEAQ EQU   FMCLBXM                                                  00964000
FMCLCPBQ EQU   FMCVS1+16                                                00965000
FMCLCPAQ EQU   FMCVS1+20                                                00966000
FMCZX001 EQU   FMCVS1+28                                                00967000
FMCZX003 EQU   FMCVS1+30                                                00968000
FMCSEQ1  EQU   FMCVS1+34                                                00969000
FMCZFLG2 EQU   FMCVS1+35                                                00970000
FMCCVFLG EQU   FMCVS1+44                                                00971000
FMCFLAG  EQU   0                                                        00972000
FMCFLGB  EQU   FMCFLAG                                                  00973000
ISTNCB   EQU   0                                                        00974000
NCBDAF   EQU   ISTNCB+2                                                 00975000
NCBFLAGS EQU   ISTNCB+24                                                00976000
NCBFRAS  EQU   NCBFLAGS+1                                               00977000
NCBFTRIO EQU   NCBFRAS                                                  00978000
NCBFLAG1 EQU   NCBFLAGS+2                                               00979000
ISTDNCB  EQU   0                                                        00980000
DNCOS    EQU   ISTDNCB+56                                               00981000
DNCZFLGS EQU   DNCOS                                                    00982000
DNCSESS  EQU   DNCZFLGS                                                 00983000
DNCINVIT EQU   DNCZFLGS                                                 00984000
DNCDISC  EQU   DNCZFLGS                                                 00985000
DNCZPSRD EQU   DNCZFLGS+1                                               00986000
DNCBSCED EQU   DNCOS+2                                                  00987000
DNCZV001 EQU   DNCOS+17                                                 00988000
DNCZV004 EQU   DNCOS+28                                                 00989000
DNCZC001 EQU   DNCOS+40                                                 00990000
ISTZPSVT EQU   0                                                        00991000
ZPSZDFA0 EQU   ISTZPSVT                                                 00992000
ZPSZBFY0 EQU   ISTZPSVT+24                                              00993000
ZPSZBFZ0 EQU   ISTZPSVT+28                                              00994000
ISTRPH   EQU   0                                                        00995000
RPHFLAGS EQU   ISTRPH+2                                                 00996000
RPHAPTYP EQU   RPHFLAGS                                                 00997000
RPHFSTLC EQU   RPHFLAGS                                                 00998000
RPHFLGB  EQU   ISTRPH+3                                                 00999000
RPHRPHA  EQU   ISTRPH+4                                                 01000000
RPHTSKID EQU   ISTRPH+8                                                 01001000
RPHRESMA EQU   ISTRPH+16                                                01002000
RPHWPFLG EQU   RPHRESMA                                                 01003000
RPHWEA   EQU   ISTRPH+24                                                01004000
RPHCSPA  EQU   RPHWEA                                                   01005000
RPHSRPRM EQU   ISTRPH+28                                                01006000
RPHCRR   EQU   ISTRPH+32                                                01007000
RPHPABQA EQU   ISTRPH+36                                                01008000
RPHWORK  EQU   ISTRPH+40                                                01009000
RPHSAVE1 EQU   RPHWORK                                                  01010000
RPHSBITS EQU   RPHSAVE1+1                                               01011000
ISTZSAVE EQU   0                                                        01012000
ZSAZSVBC EQU   ISTZSAVE                                                 01013000
ZSAZSVMS EQU   ZSAZSVBC                                                 01014000
ZSAZACTV EQU   ZSAZSVMS                                                 01015000
ZSAZSVFC EQU   ISTZSAVE+4                                               01016000
ZSAZSVRR EQU   ISTZSAVE+8                                               01017000
ZSAZSVVR EQU   ISTZSAVE+12                                              01018000
ZSAZTRAC EQU   ISTZSAVE+36                                              01019000
ISTZCRR  EQU   0                                                        01020000
ZCRCRR   EQU   ISTZCRR                                                  01021000
ZCRFLGS1 EQU   ISTZCRR+12                                               01022000
ZCRFLGS2 EQU   ISTZCRR+13                                               01023000
ZCRSWFLD EQU   ISTZCRR+14                                               01024000
ZCRENDSH EQU   ZCRSWFLD                                                 01025000
ZCRNDLCP EQU   ZCRSWFLD                                                 01026000
ZCRRESET EQU   ZCRSWFLD                                                 01027000
ZCRFLGS3 EQU   ISTZCRR+15                                               01028000
ZCRGENSW EQU   ISTZCRR+16                                               01029000
ZCRPFLGS EQU   ISTZCRR+17                                               01030000
ZCRIBPR  EQU   ISTZCRR+18                                               01031000
ZCRSCPSW EQU   ISTZCRR+19                                               01032000
ZCRPARMS EQU   ISTZCRR+24                                               01033000
ZCRFBPTR EQU   ZCRPARMS                                                 01034000
ZCRDFRDA EQU   ZCRPARMS+10                                              01035000
ZCRPCOD1 EQU   ZCRPARMS+12                                              01036000
ZCRPLSBF EQU   ZCRPCOD1                                                 01037000
ZCRPBUF  EQU   ZCRPCOD1                                                 01038000
ZCRPCOD2 EQU   ZCRPARMS+13                                              01039000
ZCRSVRTN EQU   ISTZCRR+56                                               01040000
ZCRWKARA EQU   ISTZCRR+156                                              01041000
ZCRCIDSV EQU   ISTZCRR+192                                              01042000
ZCRAUDIT EQU   ISTZCRR+440                                              01043000
ZCRENTER EQU   ZCRAUDIT+5                                               01044000
ZCREHCAN EQU   ZCRENTER+10                                              01045000
ZCRLCPB  EQU   ISTZCRR+480                                              01046000
ZCRRHRU  EQU   ZCRLCPB                                                  01047000
ISTPFCRR EQU   0                                                        01048000
PFCCRR   EQU   ISTPFCRR                                                 01049000
PFCCRRID EQU   PFCCRR                                                   01050000
PFCCRRLN EQU   PFCCRR+2                                                 01051000
PFCHDR   EQU   ISTPFCRR+4                                               01052000
PFCCRRO  EQU   PFCHDR                                                   01053000
PFCFRRO  EQU   PFCHDR+4                                                 01054000
ISTCFCRR EQU   0                                                        01055000
CFCAUDIT EQU   ISTCFCRR                                                 01056000
CFCNTRD  EQU   CFCAUDIT                                                 01057000
CFCCRT   EQU   CFCAUDIT+1                                               01058000
ISTASCRR EQU   0                                                        01059000
ASCFLAGS EQU   ISTASCRR+16                                              01060000
ASCFLG1  EQU   ASCFLAGS                                                 01061000
ASCFLG2  EQU   ASCFLAGS+2                                               01062000
ASCFLG3  EQU   ASCFLAGS+4                                               01063000
ASCUSRGS EQU   ISTASCRR+28                                              01064000
ISTAPCRR EQU   0                                                        01065000
APCATFLG EQU   ISTAPCRR+16                                              01066000
APCRFLG  EQU   ISTAPCRR+18                                              01067000
APCSAVE  EQU   ISTAPCRR+44                                              01068000
APCCOMF  EQU   ISTAPCRR+116                                             01069000
APCCOMF1 EQU   APCCOMF                                                  01070000
APC31FLG EQU   ISTAPCRR+132                                             01071000
APC52FLG EQU   ISTAPCRR+133                                             01072000
APC53FLG EQU   ISTAPCRR+134                                             01073000
APC54FLG EQU   ISTAPCRR+135                                             01074000
APC57FLG EQU   ISTAPCRR+136                                             01075000
ISTCRA   EQU   0                                                        01076000
CRABASIC EQU   ISTCRA                                                   01077000
CRAHDR   EQU   CRABASIC                                                 01078000
CRACRR   EQU   CRAHDR                                                   01079000
CRALKACT EQU   CRABASIC+8                                               01080000
CRASVC   EQU   ISTCRA+848                                               01081000
CRABUFA  EQU   CRASVC+68                                                01082000
ISTZOBUF EQU   0                                                        01083000
ZOBFSM   EQU   ISTZOBUF+4                                               01084000
ISTDYPAB EQU   0                                                        01085000
ISTATCVT EQU   0                                                        01086000
ATCCOM   EQU   ISTATCVT                                                 01087000
ATCSTAT  EQU   ATCCOM                                                   01088000
ATCSTAT1 EQU   ATCSTAT                                                  01089000
ATCSTFLG EQU   ATCSTAT+1                                                01090000
ATCPOFLG EQU   ATCSTAT+2                                                01091000
ATCSTAT4 EQU   ATCSTAT+3                                                01092000
ATCIOTRC EQU   ATCCOM+140                                               01093000
ATCTHTRC EQU   ATCIOTRC                                                 01094000
ATCCSMR  EQU   ISTATCVT+296                                             01095000
ATCSHRFG EQU   ISTATCVT+316                                             01096000
ATCHPGM  EQU   ISTATCVT+384                                             01097000
ATCVLCNT EQU   ISTATCVT+772                                             01098000
ATCSOPD  EQU   ISTATCVT+792                                             01099000
ATCSIPD  EQU   ISTATCVT+800                                             01100000
ATCSECST EQU   ISTATCVT+812                                             01101000
ATCAOSM  EQU   ISTATCVT+912                                             01102000
ATCGSRBQ EQU   ATCAOSM+4                                                01103000
ATCGSRBG EQU   ATCGSRBQ                                                 01104000
ATCAP34  EQU   ATCAOSM+32                                               01105000
ATCZFSVT EQU   ATCAOSM+68                                               01106000
ATCZPSVT EQU   ATCAOSM+72                                               01107000
ATCICAPP EQU   ATCAOSM+100                                              01108000
ATCLDAPP EQU   ATCAOSM+120                                              01109000
ATCDAPVT EQU   ATCAOSM+140                                              01110000
ATCAP37  EQU   ATCAOSM+264                                              01111000
ATCVTFLG EQU   ATCAOSM+392                                              01112000
ATCZFLAG EQU   ATCAOSM+588                                              01113000
ISTZFSVT EQU   0                                                        01114000
ZFSZEFBB EQU   ISTZFSVT                                                 01115000
ZFSZEABB EQU   ZFSZEFBB                                                 01116000
ZFSZEFAB EQU   ISTZFSVT+4                                               01117000
ZFSZEAAB EQU   ZFSZEFAB                                                 01118000
ISTZEFBB EQU   0                                                        01119000
ISTZDFA0 EQU   0                                                        01120000
ISTZBFZ0 EQU   0                                                        01121000
ISTZBFY0 EQU   0                                                        01122000
ISTWKE   EQU   0                                                        01123000
WKECHAIN EQU   ISTWKE+4                                                 01124000
WKEFLAGS EQU   WKECHAIN                                                 01125000
ISTAPC37 EQU   0                                                        01126000
ISTAPC34 EQU   0                                                        01127000
REQTAG   EQU   0                                                        01128000
ZIBSRB   EQU   0                                                        01129000
LCPZTIE  EQU   LCPCID                                                   01130000
LCPZSNAM EQU   LCPZTIE+8                                                01131000
FSBCOMBN EQU   FSBNETRS                                                 01132000
FSBRHFLD EQU   FSBCOMBN+1                                               01133000
FSBRH3   EQU   FSBRHFLD+2                                               01134000
FSBLDFLG EQU   FSBRH3                                                   01135000
@NM00006 EQU   FSBRQTAG                                                 01136000
ZIBDIO   EQU   ZIBFSM                                                   01137000
ZIBCCW2  EQU   ZIBDIO+8                                                 01138000
ZIBCPTCC EQU   ZIBCCW2                                                  01139000
ZIBAIO   EQU   ISTZIBUF                                                 01140000
ZIBAIOCM EQU   ZIBAIO                                                   01141000
ZIBFDBZ  EQU   ZIBAIOCM                                                 01142000
ZIBLNG2  EQU   ZIBAIOCM+14                                              01143000
ZIBFIB   EQU   ZIBAIO+16                                                01144000
ZIBFSB   EQU   ZIBFIB                                                   01145000
ZIBMDREC EQU   ZIBFSB+4                                                 01146000
ZIBMDRIN EQU   ZIBFSB+28                                                01147000
ZIBBTU   EQU   ZIBFIB+32                                                01148000
ZIBFDBS  EQU   ZIBBTU                                                   01149000
@NM00009 EQU   ZIBBTU+12                                                01150000
ZIBFID1  EQU   @NM00009+1                                               01151000
ZIBFITXT EQU   ZIBFID1                                                  01152000
ZIBSIB   EQU   ZIBFIB                                                   01153000
ZIBREC   EQU   ZIBMDRIN                                                 01154000
ZIBRECPL EQU   ZIBREC                                                   01155000
ZIBRECHD EQU   ZIBRECPL                                                 01156000
ZIBRECRS EQU   ZIBREC+8                                                 01157000
ZIBRECDT EQU   ZIBREC+10                                                01158000
ZIBMDRRC EQU   ZIBMDREC                                                 01159000
ZIBRCPL  EQU   ZIBMDRRC                                                 01160000
ZIBRCDT  EQU   ZIBMDRRC+24                                              01161000
@NM00011 EQU   ZIBBTU                                                   01162000
ZOBDLBT  EQU   ISTZOBUF                                                 01163000
ZOBDLBCM EQU   ZOBDLBT                                                  01164000
ZOBFDB   EQU   ZOBDLBCM                                                 01165000
@NM00040 EQU   ZOBDLBCM+25                                              01166000
ZOBBTU   EQU   ZOBDLBT+28                                               01167000
ZOBWCC   EQU   ZOBDLBT+48                                               01168000
ZOBECCC  EQU   ZOBDLBT+50                                               01169000
ZOBDIO   EQU   ZOBFSM                                                   01170000
ZOBCCW2  EQU   ZOBDIO+8                                                 01171000
ZOBCPTCC EQU   ZOBCCW2                                                  01172000
ZOBFLAGS EQU   ZOBCCW2+5                                                01173000
ZOBRT06  EQU   ZOBFLAGS                                                 01174000
ZOBRT08  EQU   ZOBFLAGS                                                 01175000
ZOBCCW3  EQU   ZOBDIO+16                                                01176000
ZOBCPTRC EQU   ZOBCCW3                                                  01177000
ZOBCPN2C EQU   ZOBCPTRC                                                 01178000
ZOBCPTRA EQU   ZOBCCW3+1                                                01179000
@NM00044 EQU   ZOBBTU                                                   01180000
ZOBTEXT  EQU   ZOBBTU                                                   01181000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01182000
ZOBTH2   EQU   @NM00044+4                                               01183000
ZOBLH    EQU   @NM00044                                                 01184000
ZOBCPN2K EQU   ZOBCCW3+6                                                01185000
ZOBRSV99 EQU   ZOBCCW3+5                                                01186000
ZOBCPN2F EQU   ZOBCCW3+4                                                01187000
ZOBCPTC2 EQU   ZOBCPTRA                                                 01188000
ZOBCPTC1 EQU   ZOBCPN2C                                                 01189000
ZOBCPNPK EQU   ZOBCCW2+6                                                01190000
ZOBRSV03 EQU   ZOBFLAGS                                                 01191000
ZOBCPNPF EQU   ZOBCCW2+4                                                01192000
ZOBCPTCA EQU   ZOBCCW2+1                                                01193000
ZOBCPNPC EQU   ZOBCPTCC                                                 01194000
ZOBCPWTK EQU   ZOBDIO+6                                                 01195000
ZOBRSV02 EQU   ZOBDIO+5                                                 01196000
ZOBCPWTF EQU   ZOBDIO+4                                                 01197000
ZOBCPTXA EQU   ZOBDIO+1                                                 01198000
ZOBCPWTC EQU   ZOBDIO                                                   01199000
ZOBRSV09 EQU   ZOBECCC                                                  01200000
ZOBECSP  EQU   ZOBECCC                                                  01201000
ZOBRSV08 EQU   ZOBECCC                                                  01202000
ZOBRSV07 EQU   ZOBDLBT+49                                               01203000
ZOBRSV06 EQU   ZOBWCC                                                   01204000
ZOBWCSP  EQU   ZOBWCC                                                   01205000
ZOBRSV05 EQU   ZOBWCC                                                   01206000
ZOBRSV10 EQU   ZOBDLBCM+26                                              01207000
@NM00043 EQU   @NM00040                                                 01208000
@NM00042 EQU   @NM00040                                                 01209000
@NM00041 EQU   @NM00040                                                 01210000
ZOBRSV04 EQU   ZOBDLBCM+16                                              01211000
ZOBLNG2  EQU   ZOBDLBCM+14                                              01212000
ZOBRSV01 EQU   ZOBDLBCM+12                                              01213000
ZIBTH2   EQU   @NM00011+4                                               01214000
ZIBLH    EQU   @NM00011                                                 01215000
ZIBRCTXT EQU   ZIBMDRRC+36                                              01216000
ZIBRCRID EQU   ZIBRCDT+10                                               01217000
ZIBRCNAM EQU   ZIBRCDT+2                                                01218000
ZIBRCUA  EQU   ZIBRCDT                                                  01219000
ZIBRCPUI EQU   ZIBRCPL+20                                               01220000
ZIBRCPUN EQU   ZIBRCPL+16                                               01221000
ZIBRCTIM EQU   ZIBRCPL+12                                               01222000
ZIBRCDAT EQU   ZIBRCPL+8                                                01223000
ZIBRCRS1 EQU   ZIBRCPL+6                                                01224000
ZIBRCSID EQU   ZIBRCPL+5                                                01225000
ZIBRCID  EQU   ZIBRCPL+4                                                01226000
ZIBRCSW  EQU   ZIBRCPL+2                                                01227000
ZIBRCSYR EQU   ZIBRCPL+1                                                01228000
ZIBRCL   EQU   ZIBRCPL                                                  01229000
ZIBRECTX EQU   ZIBREC+22                                                01230000
ZIBRECID EQU   ZIBRECDT+10                                              01231000
ZIBRECNA EQU   ZIBRECDT+2                                               01232000
ZIBRECUA EQU   ZIBRECDT                                                 01233000
ZIBRECSV EQU   ZIBRECRS                                                 01234000
ZIBRECDA EQU   ZIBRECPL+4                                               01235000
ZIBRECSI EQU   ZIBRECHD+3                                               01236000
ZIBRECDV EQU   ZIBRECHD+2                                               01237000
ZIBRECFL EQU   ZIBRECHD+1                                               01238000
ZIBRECTY EQU   ZIBRECHD                                                 01239000
ZIBTEXT  EQU   ZIBSIB+4                                                 01240000
ZIBRSV04 EQU   ZIBSIB                                                   01241000
ZIBTEXT2 EQU   ZIBFITXT                                                 01242000
ZIBTEXT1 EQU   ZIBFIB+52                                                01243000
@NM00010 EQU   @NM00009                                                 01244000
@NM00008 EQU   ZIBMDREC                                                 01245000
@NM00007 EQU   ZIBFSB                                                   01246000
ZIBRSV03 EQU   ZIBAIOCM+13                                              01247000
ZIBWKBYT EQU   ZIBAIOCM+12                                              01248000
ZIBCPNPK EQU   ZIBCCW2+6                                                01249000
ZIBRSV02 EQU   ZIBCCW2+5                                                01250000
ZIBCPTPF EQU   ZIBCCW2+4                                                01251000
ZIBCPTCA EQU   ZIBCCW2+1                                                01252000
ZIBCPNPC EQU   ZIBCPTCC                                                 01253000
ZIBCPRDK EQU   ZIBDIO+6                                                 01254000
ZIBRSV01 EQU   ZIBDIO+5                                                 01255000
ZIBCPRDF EQU   ZIBDIO+4                                                 01256000
ZIBCPTXA EQU   ZIBDIO+1                                                 01257000
ZIBCPRDC EQU   ZIBDIO                                                   01258000
FSBRT0B  EQU   @NM00006+1                                               01259000
FSBRT0A  EQU   @NM00006+1                                               01260000
FSBRT09  EQU   @NM00006+1                                               01261000
FSBRT08  EQU   @NM00006+1                                               01262000
FSBRT07  EQU   @NM00006                                                 01263000
FSBRT06  EQU   @NM00006                                                 01264000
FSBRT05  EQU   @NM00006                                                 01265000
FSBRT04  EQU   @NM00006                                                 01266000
FSBRT03  EQU   @NM00006                                                 01267000
FSBRT02  EQU   @NM00006                                                 01268000
FSBRT01  EQU   @NM00006                                                 01269000
FSBRT00  EQU   @NM00006                                                 01270000
FSBLDCUF EQU   FSBLDFLG                                                 01271000
FSBLDSIF EQU   FSBLDFLG                                                 01272000
FSBLDSOF EQU   FSBLDFLG                                                 01273000
FSBLDEBF EQU   FSBLDFLG                                                 01274000
FSBLDBBF EQU   FSBLDFLG                                                 01275000
FSBLDFME EQU   FSBLDFLG                                                 01276000
FSBLDSCF EQU   FSBLDFLG                                                 01277000
FSBLDRMF EQU   FSBLDFLG                                                 01278000
FSBRH2   EQU   FSBRHFLD+1                                               01279000
FSBRH1   EQU   FSBRHFLD                                                 01280000
FSBALIGN EQU   FSBCOMBN                                                 01281000
LCPZTRV4 EQU   LCPZSNAM+4                                               01282000
LCPZTRV1 EQU   LCPZSNAM                                                 01283000
LCPZSNA  EQU   LCPZTIE+4                                                01284000
LCPZFMCA EQU   LCPZTIE                                                  01285000
WKECHNGP EQU   WKECHAIN+1                                               01286000
@NM00050 EQU   WKEFLAGS                                                 01287000
WKEGATE  EQU   WKEFLAGS                                                 01288000
@NM00049 EQU   ISTWKE                                                   01289000
ZFSZWRD4 EQU   ISTZFSVT+36                                              01290000
ZFSZWRD3 EQU   ISTZFSVT+32                                              01291000
ZFSZEFCB EQU   ISTZFSVT+28                                              01292000
ZFSZFFEB EQU   ISTZFSVT+24                                              01293000
ZFSZDFJ0 EQU   ISTZFSVT+20                                              01294000
ZFSZFFFB EQU   ISTZFSVT+16                                              01295000
ZFSZFFDB EQU   ISTZFSVT+12                                              01296000
ZFSZFFCB EQU   ISTZFSVT+8                                               01297000
ZFSZEMAB EQU   ZFSZEAAB                                                 01298000
ZFSZEMBB EQU   ZFSZEABB                                                 01299000
ATCAOS   EQU   ISTATCVT+1552                                            01300000
ATCVIOPM EQU   ATCAOSM+636                                              01301000
ATCTPMMI EQU   ATCAOSM+632                                              01302000
ATCTPMPB EQU   ATCAOSM+600                                              01303000
ATCRPLCT EQU   ATCAOSM+594                                              01304000
ATCCRACT EQU   ATCAOSM+592                                              01305000
ATCSRBCT EQU   ATCAOSM+590                                              01306000
ATCRSV75 EQU   ATCAOSM+589                                              01307000
ATCRSV66 EQU   ATCZFLAG                                                 01308000
ATCZF001 EQU   ATCZFLAG                                                 01309000
ATCTPCP1 EQU   ATCAOSM+584                                              01310000
ATCTPCP0 EQU   ATCAOSM+580                                              01311000
ATCAICTN EQU   ATCAOSM+576                                              01312000
ATCZR01  EQU   ATCAOSM+572                                              01313000
ATCMPLTA EQU   ATCAOSM+568                                              01314000
ATCASCB  EQU   ATCAOSM+564                                              01315000
ATCAP86  EQU   ATCAOSM+560                                              01316000
ATCAP85  EQU   ATCAOSM+556                                              01317000
ATCAP84  EQU   ATCAOSM+552                                              01318000
ATCAP83  EQU   ATCAOSM+548                                              01319000
ATCAP82  EQU   ATCAOSM+544                                              01320000
ATCAP69  EQU   ATCAOSM+540                                              01321000
ATCAP66  EQU   ATCAOSM+536                                              01322000
ATCAP62  EQU   ATCAOSM+532                                              01323000
ATCAPC59 EQU   ATCAOSM+528                                              01324000
ATCAP56  EQU   ATCAOSM+524                                              01325000
ATCAP55  EQU   ATCAOSM+520                                              01326000
ATCRCFY0 EQU   ATCAOSM+516                                              01327000
ATCAP41  EQU   ATCAOSM+512                                              01328000
ATCAPC25 EQU   ATCAOSM+508                                              01329000
ATCAP23  EQU   ATCAOSM+504                                              01330000
ATCTPSPB EQU   ATCAOSM+472                                              01331000
ATCTRMBP EQU   ATCAOSM+440                                              01332000
ATCPSTA  EQU   ATCAOSM+432                                              01333000
ATCSMABF EQU   ATCAOSM+428                                              01334000
ATCSMAPR EQU   ATCAOSM+424                                              01335000
ATCTPWQA EQU   ATCAOSM+420                                              01336000
ATCSMAID EQU   ATCAOSM+416                                              01337000
ATCSMARA EQU   ATCAOSM+412                                              01338000
ATCCACXA EQU   ATCAOSM+408                                              01339000
ATCZLAAB EQU   ATCAOSM+404                                              01340000
ATCATA10 EQU   ATCAOSM+400                                              01341000
ATCHLTCB EQU   ATCAOSM+396                                              01342000
@NM00048 EQU   ATCVTFLG                                                 01343000
ATCVTACT EQU   ATCVTFLG                                                 01344000
ATCRPT40 EQU   ATCAOSM+388                                              01345000
ATCRPT39 EQU   ATCAOSM+384                                              01346000
ATCRPT38 EQU   ATCAOSM+380                                              01347000
ATCRPT37 EQU   ATCAOSM+376                                              01348000
ATCRPT36 EQU   ATCAOSM+372                                              01349000
ATCRPT35 EQU   ATCAOSM+368                                              01350000
ATCRPT34 EQU   ATCAOSM+364                                              01351000
ATCRPT33 EQU   ATCAOSM+360                                              01352000
ATCRPT32 EQU   ATCAOSM+356                                              01353000
ATCRPT31 EQU   ATCAOSM+352                                              01354000
ATCRPT30 EQU   ATCAOSM+348                                              01355000
ATCRPT29 EQU   ATCAOSM+344                                              01356000
ATCRPT28 EQU   ATCAOSM+340                                              01357000
ATCRPT27 EQU   ATCAOSM+336                                              01358000
ATCRPT26 EQU   ATCAOSM+332                                              01359000
ATCRPT25 EQU   ATCAOSM+328                                              01360000
ATCRPT24 EQU   ATCAOSM+324                                              01361000
ATCRPT23 EQU   ATCAOSM+320                                              01362000
ATCRPT22 EQU   ATCAOSM+316                                              01363000
ATCRPT21 EQU   ATCAOSM+312                                              01364000
ATCRPT20 EQU   ATCAOSM+308                                              01365000
ATCRPT19 EQU   ATCAOSM+304                                              01366000
ATCRPT18 EQU   ATCAOSM+300                                              01367000
ATCRPT17 EQU   ATCAOSM+296                                              01368000
ATCRPT16 EQU   ATCAOSM+292                                              01369000
ATCRPT15 EQU   ATCAOSM+288                                              01370000
ATCRPT14 EQU   ATCAOSM+284                                              01371000
ATCRPT13 EQU   ATCAOSM+280                                              01372000
ATCRPT12 EQU   ATCAOSM+276                                              01373000
ATCRPT11 EQU   ATCAOSM+272                                              01374000
ATCAP38  EQU   ATCAOSM+268                                              01375000
ATCZDFJ0 EQU   ATCAOSM+260                                              01376000
ATCAP51  EQU   ATCAOSM+256                                              01377000
ATCZPAB2 EQU   ATCAOSM+224                                              01378000
ATCZPAB1 EQU   ATCAOSM+192                                              01379000
ATCZLFVT EQU   ATCAOSM+188                                              01380000
ATCZLPVT EQU   ATCAOSM+184                                              01381000
ATCZDVTX EQU   ATCAOSM+180                                              01382000
ATCZDVTA EQU   ATCAOSM+176                                              01383000
ATCZDVT9 EQU   ATCAOSM+172                                              01384000
ATCZDVT8 EQU   ATCAOSM+168                                              01385000
ATCZDVT7 EQU   ATCAOSM+164                                              01386000
ATCRSV56 EQU   ATCDAPVT+22                                              01387000
ATCDAPDG EQU   ATCDAPVT+20                                              01388000
ATCDXCEA EQU   ATCDAPVT+16                                              01389000
ATCDCEA  EQU   ATCDAPVT+12                                              01390000
ATCDPCIA EQU   ATCDAPVT+8                                               01391000
ATCDSIOA EQU   ATCDAPVT+4                                               01392000
ATCDEOEA EQU   ATCDAPVT                                                 01393000
ATCZLAEA EQU   ATCLDAPP+16                                              01394000
ATCZLCEA EQU   ATCLDAPP+12                                              01395000
ATCRSV17 EQU   ATCLDAPP+8                                               01396000
ATCSMFRR EQU   ATCLDAPP+4                                               01397000
ATCCDTID EQU   ATCLDAPP                                                 01398000
ATCZAEA  EQU   ATCICAPP+16                                              01399000
ATCZCEA  EQU   ATCICAPP+12                                              01400000
ATCCDTCB EQU   ATCICAPP+8                                               01401000
ATCZSIOA EQU   ATCICAPP+4                                               01402000
ATCCDRPH EQU   ATCICAPP                                                 01403000
ATCAP65  EQU   ATCAOSM+96                                               01404000
ATCZDVT6 EQU   ATCAOSM+92                                               01405000
ATCZDVT4 EQU   ATCAOSM+88                                               01406000
ATCZDVT3 EQU   ATCAOSM+84                                               01407000
ATCZDVT1 EQU   ATCAOSM+80                                               01408000
ATCICNCB EQU   ATCAOSM+76                                               01409000
ATCAP64  EQU   ATCAOSM+64                                               01410000
ATCAP63  EQU   ATCAOSM+60                                               01411000
ATCAP61  EQU   ATCAOSM+56                                               01412000
ATCAP58  EQU   ATCAOSM+52                                               01413000
ATCAP57  EQU   ATCAOSM+48                                               01414000
ATCAP54  EQU   ATCAOSM+44                                               01415000
ATCAP53  EQU   ATCAOSM+40                                               01416000
ATCAP52  EQU   ATCAOSM+36                                               01417000
ATCAP32  EQU   ATCAOSM+28                                               01418000
ATCAP31  EQU   ATCAOSM+24                                               01419000
ATCAP12  EQU   ATCAOSM+20                                               01420000
ATCAP11  EQU   ATCAOSM+16                                               01421000
ATCCMTCB EQU   ATCAOSM+12                                               01422000
ATCPRPH  EQU   ATCAOSM+8                                                01423000
ATCGSRBF EQU   ATCGSRBG                                                 01424000
ATCSRBRT EQU   ATCAOSM                                                  01425000
ATCRSVBB EQU   ISTATCVT+908                                             01426000
ATCVDLOK EQU   ISTATCVT+904                                             01427000
ATCVFPAB EQU   ISTATCVT+872                                             01428000
ATCVDPAB EQU   ISTATCVT+840                                             01429000
ATCIOECB EQU   ISTATCVT+836                                             01430000
ATCINCW3 EQU   ISTATCVT+832                                             01431000
ATCMODTB EQU   ISTATCVT+828                                             01432000
ATCUSSPT EQU   ISTATCVT+824                                             01433000
ATCSRTAB EQU   ISTATCVT+820                                             01434000
@NM00047 EQU   ISTATCVT+818                                             01435000
ATCNMCTR EQU   ISTATCVT+816                                             01436000
ATCSEC51 EQU   ATCSECST                                                 01437000
ATCSEC40 EQU   ATCSIPD+8                                                01438000
ATCSEC30 EQU   ATCSIPD+4                                                01439000
ATCSEC21 EQU   ATCSIPD                                                  01440000
ATCSEC10 EQU   ATCSOPD+4                                                01441000
ATCSEC01 EQU   ATCSOPD                                                  01442000
ATCPOIA  EQU   ISTATCVT+788                                             01443000
ATCPODVT EQU   ISTATCVT+784                                             01444000
ATCS49XL EQU   ISTATCVT+780                                             01445000
ATCS49XI EQU   ISTATCVT+776                                             01446000
ATCLCLCT EQU   ATCVLCNT+2                                               01447000
ATCRNCNT EQU   ATCVLCNT                                                 01448000
ATCCFEAD EQU   ISTATCVT+768                                             01449000
ATCPTR00 EQU   ISTATCVT+736                                             01450000
ATCRSV10 EQU   ISTATCVT+704                                             01451000
ATCTACB  EQU   ISTATCVT+700                                             01452000
ATCVTINM EQU   ISTATCVT+696                                             01453000
ATCTCLIM EQU   ISTATCVT+692                                             01454000
ATCTCLOM EQU   ISTATCVT+688                                             01455000
ATCVTIPB EQU   ISTATCVT+656                                             01456000
ATCTCIPB EQU   ISTATCVT+624                                             01457000
ATCTIPAB EQU   ISTATCVT+592                                             01458000
ATCOCCCB EQU   ISTATCVT+588                                             01459000
ATCOCCOB EQU   ISTATCVT+584                                             01460000
ATCCDLAD EQU   ISTATCVT+580                                             01461000
ATCCCLAD EQU   ISTATCVT+576                                             01462000
ATCDLRPB EQU   ISTATCVT+544                                             01463000
ATCPGPAB EQU   ISTATCVT+512                                             01464000
ATCVPAB1 EQU   ISTATCVT+480                                             01465000
ATCRSV97 EQU   ISTATCVT+476                                             01466000
ATCRDTLK EQU   ISTATCVT+472                                             01467000
ATCVOCLK EQU   ISTATCVT+468                                             01468000
ATCCDFDN EQU   ISTATCVT+464                                             01469000
ATCCDFIN EQU   ISTATCVT+460                                             01470000
ATCDVTLK EQU   ISTATCVT+456                                             01471000
ATCAP36  EQU   ISTATCVT+452                                             01472000
ATCAP35  EQU   ISTATCVT+448                                             01473000
ATCAP33  EQU   ISTATCVT+444                                             01474000
ATCRSV99 EQU   ISTATCVT+412                                             01475000
ATCLDECB EQU   ISTATCVT+408                                             01476000
ATCLDNCS EQU   ISTATCVT+404                                             01477000
ATCCDPTR EQU   ISTATCVT+400                                             01478000
ATCADEL  EQU   ISTATCVT+396                                             01479000
ATCTODVT EQU   ISTATCVT+392                                             01480000
ATCDEBCH EQU   ISTATCVT+388                                             01481000
ATCHBSIZ EQU   ATCHPGM+2                                                01482000
ATCHBFNO EQU   ATCHPGM                                                  01483000
ATCCRME  EQU   ISTATCVT+380                                             01484000
ATCRVCHS EQU   ISTATCVT+372                                             01485000
ATCECTLP EQU   ISTATCVT+368                                             01486000
ATCZDVTB EQU   ISTATCVT+364                                             01487000
ATCECPRT EQU   ISTATCVT+360                                             01488000
ATCVTLOD EQU   ISTATCVT+356                                             01489000
ATCTRPAB EQU   ISTATCVT+352                                             01490000
ATCMSGM  EQU   ISTATCVT+348                                             01491000
ATCMSGP  EQU   ISTATCVT+344                                             01492000
ATCEPT   EQU   ISTATCVT+340                                             01493000
ATCDVT   EQU   ISTATCVT+336                                             01494000
ATCTRCPT EQU   ISTATCVT+332                                             01495000
ATCDVLOD EQU   ISTATCVT+328                                             01496000
ATCALERT EQU   ISTATCVT+324                                             01497000
ATCEPA   EQU   ISTATCVT+320                                             01498000
ATCSAF   EQU   ISTATCVT+318                                             01499000
ATCXRANG EQU   ISTATCVT+317                                             01500000
ATCLAST  EQU   ATCSHRFG                                                 01501000
ATCSHRTN EQU   ISTATCVT+308                                             01502000
ATCUEP   EQU   ISTATCVT+304                                             01503000
ATCOCRT  EQU   ISTATCVT+300                                             01504000
ATCCSMA  EQU   ATCCSMR                                                  01505000
ATCESC02 EQU   ISTATCVT+292                                             01506000
ATCESC01 EQU   ISTATCVT+288                                             01507000
ATCCDFND EQU   ISTATCVT+284                                             01508000
ATCCDDEL EQU   ISTATCVT+280                                             01509000
ATCCDADD EQU   ISTATCVT+276                                             01510000
ATCMNT   EQU   ISTATCVT+272                                             01511000
ATCRSV16 EQU   ISTATCVT+270                                             01512000
ATCMAXID EQU   ISTATCVT+269                                             01513000
ATCMSGSP EQU   ATCCOM+268                                               01514000
ATCCIDM  EQU   ATCCOM+266                                               01515000
ATCACTRM EQU   ATCCOM+264                                               01516000
ATCNERAP EQU   ATCCOM+260                                               01517000
ATCNESAL EQU   ATCCOM+256                                               01518000
ATCRCC65 EQU   ATCCOM+252                                               01519000
ATCRCC26 EQU   ATCCOM+248                                               01520000
ATCRCC63 EQU   ATCCOM+244                                               01521000
ATCRSV11 EQU   ATCCOM+242                                               01522000
ATCVTMID EQU   ATCCOM+240                                               01523000
ATCAPOST EQU   ATCCOM+236                                               01524000
ATCNERFN EQU   ATCCOM+232                                               01525000
ATCNERNE EQU   ATCCOM+228                                               01526000
ATCNERCV EQU   ATCCOM+224                                               01527000
ATCNERST EQU   ATCCOM+220                                               01528000
ATCDCC61 EQU   ATCCOM+216                                               01529000
ATCDCC60 EQU   ATCCOM+212                                               01530000
ATCSRTDF EQU   ATCCOM+208                                               01531000
ATCSRTAD EQU   ATCCOM+204                                               01532000
ATCFIRA  EQU   ATCCOM+200                                               01533000
ATCSMBQ  EQU   ATCCOM+196                                               01534000
ATCSMRC  EQU   ATCCOM+192                                               01535000
ATCSMRS  EQU   ATCCOM+188                                               01536000
ATCSMQU  EQU   ATCCOM+184                                               01537000
ATCSMRQ  EQU   ATCCOM+180                                               01538000
ATCACDA  EQU   ATCCOM+176                                               01539000
ATCSTMA  EQU   ATCCOM+172                                               01540000
ATCFRSTR EQU   ATCCOM+168                                               01541000
ATCGTSTR EQU   ATCCOM+164                                               01542000
ATCREADA EQU   ATCCOM+160                                               01543000
ATCALOAD EQU   ATCCOM+156                                               01544000
ATCBLDLA EQU   ATCCOM+152                                               01545000
ATCFBRPH EQU   ATCCOM+148                                               01546000
ATCBFTRC EQU   ATCCOM+144                                               01547000
ATCTPBUF EQU   ATCTHTRC                                                 01548000
ATCREMOV EQU   ATCCOM+136                                               01549000
ATCADD   EQU   ATCCOM+132                                               01550000
ATCBPDA  EQU   ATCCOM+128                                               01551000
ATCDVTPT EQU   ATCCOM+124                                               01552000
ATCFEPT  EQU   ATCCOM+120                                               01553000
ATCFDVT  EQU   ATCCOM+116                                               01554000
ATCCONFT EQU   ATCCOM+112                                               01555000
ATCPTCHA EQU   ATCCOM+108                                               01556000
ATCAUTHA EQU   ATCCOM+104                                               01557000
ATCACCTA EQU   ATCCOM+100                                               01558000
ATCRDTH  EQU   ATCCOM+96                                                01559000
ATCFRSCH EQU   ATCCOM+92                                                01560000
ATCFSB   EQU   ATCCOM+88                                                01561000
ATCHLTMS EQU   ATCCOM+84                                                01562000
ATCECPRM EQU   ATCCOM+80                                                01563000
ATCECNET EQU   ATCCOM+76                                                01564000
ATCECOPC EQU   ATCCOM+72                                                01565000
ATCVPARM EQU   ATCCOM+68                                                01566000
ATCECVRQ EQU   ATCCOM+64                                                01567000
ATCECSES EQU   ATCCOM+60                                                01568000
ATCOCHA  EQU   ATCCOM+56                                                01569000
ATCDSPLQ EQU   ATCCOM+52                                                01570000
ATCECDSP EQU   ATCCOM+48                                                01571000
ATCVARYQ EQU   ATCCOM+44                                                01572000
ATCECVRY EQU   ATCCOM+40                                                01573000
ATCHALTQ EQU   ATCCOM+36                                                01574000
ATCECHLT EQU   ATCCOM+32                                                01575000
ATCMODQ  EQU   ATCCOM+28                                                01576000
ATCECMOD EQU   ATCCOM+24                                                01577000
ATCASCHD EQU   ATCCOM+20                                                01578000
ATCSRT   EQU   ATCCOM+16                                                01579000
ATCRDT   EQU   ATCCOM+12                                                01580000
ATCDCFRR EQU   ATCCOM+8                                                 01581000
ATCAPI   EQU   ATCCOM+4                                                 01582000
ATCRSV04 EQU   ATCSTAT4                                                 01583000
ATCNCSD  EQU   ATCSTAT4                                                 01584000
ATCMTST  EQU   ATCSTAT4                                                 01585000
ATCTPRT  EQU   ATCSTAT4                                                 01586000
ATCPRTAT EQU   ATCSTAT4                                                 01587000
@NM00046 EQU   ATCPOFLG                                                 01588000
ATCPOUNS EQU   ATCPOFLG                                                 01589000
ATCHSDMF EQU   ATCSTFLG                                                 01590000
@NM00045 EQU   ATCSTAT1                                                 01591000
ATCINHLT EQU   ATCSTAT1                                                 01592000
ATCNETSL EQU   ATCSTAT1                                                 01593000
ATCQKHLT EQU   ATCSTAT1                                                 01594000
ATCSNHLT EQU   ATCSTAT1                                                 01595000
ATCACTIV EQU   ATCSTAT1                                                 01596000
ATCSTART EQU   ATCSTAT1                                                 01597000
DYPPAB   EQU   ISTDYPAB+16                                              01598000
DYPRSV01 EQU   ISTDYPAB+12                                              01599000
DYPTSKID EQU   ISTDYPAB+8                                               01600000
DYPCHAIN EQU   ISTDYPAB+4                                               01601000
DYPFLGS  EQU   ISTDYPAB+2                                               01602000
DYPLNGTH EQU   ISTDYPAB+1                                               01603000
DYPTYPE  EQU   ISTDYPAB                                                 01604000
ZOBLNG1  EQU   ZOBFSM                                                   01605000
ZOBCHAIN EQU   ISTZOBUF                                                 01606000
CRACHAIN EQU   ISTCRA+928                                               01607000
CRARSV02 EQU   ISTCRA+924                                               01608000
CRARSV01 EQU   ISTCRA+920                                               01609000
CRABFTBA EQU   CRABUFA                                                  01610000
CRAMASK  EQU   CRASVC+64                                                01611000
CRAHSIZ  EQU   CRASVC+60                                                01612000
CRAASCRR EQU   CRASVC                                                   01613000
CRAPROCR EQU   ISTCRA+312                                               01614000
CRAPSS   EQU   ISTCRA+160                                               01615000
CRARPH   EQU   ISTCRA+52                                                01616000
CRALAPTR EQU   CRABASIC+48                                              01617000
CRAL9PTR EQU   CRABASIC+44                                              01618000
CRAL8PTR EQU   CRABASIC+40                                              01619000
CRAL7PTR EQU   CRABASIC+36                                              01620000
CRAL6PTR EQU   CRABASIC+32                                              01621000
CRAL5PTR EQU   CRABASIC+28                                              01622000
CRAL4PTR EQU   CRABASIC+24                                              01623000
CRAL3PTR EQU   CRABASIC+20                                              01624000
CRAL2PTR EQU   CRABASIC+16                                              01625000
CRAL1PTR EQU   CRABASIC+12                                              01626000
CRALEV01 EQU   CRALKACT+3                                               01627000
CRALEV02 EQU   CRALKACT+3                                               01628000
CRALEV03 EQU   CRALKACT+3                                               01629000
CRALEV04 EQU   CRALKACT+3                                               01630000
CRALEV05 EQU   CRALKACT+3                                               01631000
CRALEV06 EQU   CRALKACT+3                                               01632000
CRALEV07 EQU   CRALKACT+3                                               01633000
CRALEV08 EQU   CRALKACT+3                                               01634000
CRALEV09 EQU   CRALKACT+2                                               01635000
CRALEV10 EQU   CRALKACT+2                                               01636000
CRALEV11 EQU   CRALKACT+2                                               01637000
CRALEV12 EQU   CRALKACT+2                                               01638000
CRALEV13 EQU   CRALKACT+2                                               01639000
CRALEV14 EQU   CRALKACT+2                                               01640000
CRALEV15 EQU   CRALKACT+2                                               01641000
CRALEV16 EQU   CRALKACT+2                                               01642000
CRALEV17 EQU   CRALKACT+1                                               01643000
CRALEV18 EQU   CRALKACT+1                                               01644000
CRALEV19 EQU   CRALKACT+1                                               01645000
CRALEV20 EQU   CRALKACT+1                                               01646000
CRALEV21 EQU   CRALKACT+1                                               01647000
CRALEV22 EQU   CRALKACT+1                                               01648000
CRALEV23 EQU   CRALKACT+1                                               01649000
CRALEV24 EQU   CRALKACT+1                                               01650000
CRALEV25 EQU   CRALKACT                                                 01651000
CRALEV26 EQU   CRALKACT                                                 01652000
CRALEV27 EQU   CRALKACT                                                 01653000
CRALEV28 EQU   CRALKACT                                                 01654000
CRALEV29 EQU   CRALKACT                                                 01655000
CRALEV30 EQU   CRALKACT                                                 01656000
CRALEV31 EQU   CRALKACT                                                 01657000
CRALEV32 EQU   CRALKACT                                                 01658000
CRAFRR   EQU   CRAHDR+4                                                 01659000
@NM00039 EQU   ISTAPCRR+137                                             01660000
@NM00038 EQU   APC57FLG                                                 01661000
APCNREL  EQU   APC57FLG                                                 01662000
APCRECRA EQU   APC57FLG                                                 01663000
@NM00037 EQU   APC54FLG                                                 01664000
APCRLST  EQU   APC54FLG                                                 01665000
APCPR153 EQU   APC53FLG                                                 01666000
@NM00036 EQU   APC52FLG                                                 01667000
APCWKF   EQU   APC52FLG                                                 01668000
APCNWF   EQU   APC52FLG                                                 01669000
APCRDQ   EQU   APC52FLG                                                 01670000
APCQENQ  EQU   APC52FLG                                                 01671000
APCSMSR  EQU   APC52FLG                                                 01672000
APCCKRQ  EQU   APC52FLG                                                 01673000
@NM00035 EQU   APC31FLG                                                 01674000
APCSORT  EQU   APC31FLG                                                 01675000
APCRESCH EQU   APC31FLG                                                 01676000
APCTPXIT EQU   APC31FLG                                                 01677000
APCSWTWD EQU   ISTAPCRR+128                                             01678000
APCSAV2  EQU   ISTAPCRR+124                                             01679000
APCSAV1  EQU   ISTAPCRR+120                                             01680000
APCRETCD EQU   APCCOMF+2                                                01681000
@NM00034 EQU   APCCOMF1+1                                               01682000
APCZLBER EQU   APCCOMF1                                                 01683000
APCEXIT  EQU   APCCOMF1                                                 01684000
APCRELR  EQU   APCCOMF1                                                 01685000
APCIRB2  EQU   APCCOMF1                                                 01686000
APCIRB1  EQU   APCCOMF1                                                 01687000
APCSMCR  EQU   APCCOMF1                                                 01688000
APCUETSK EQU   APCCOMF1                                                 01689000
APCSSTSK EQU   APCCOMF1                                                 01690000
APCESTAL EQU   APCSAVE                                                  01691000
APCFRRPM EQU   ISTAPCRR+40                                              01692000
APCQWFO  EQU   ISTAPCRR+36                                              01693000
APCPABSV EQU   ISTAPCRR+32                                              01694000
APCRTRN  EQU   ISTAPCRR+28                                              01695000
APCTCBA  EQU   ISTAPCRR+24                                              01696000
APCPSTA  EQU   ISTAPCRR+20                                              01697000
@NM00033 EQU   APCRFLG+1                                                01698000
APC31R   EQU   APCRFLG                                                  01699000
APC58R   EQU   APCRFLG                                                  01700000
APC57R   EQU   APCRFLG                                                  01701000
APC56R   EQU   APCRFLG                                                  01702000
APC54R   EQU   APCRFLG                                                  01703000
APC53R   EQU   APCRFLG                                                  01704000
APC52R   EQU   APCRFLG                                                  01705000
APC51R   EQU   APCRFLG                                                  01706000
@NM00032 EQU   APCATFLG+1                                               01707000
APC31E   EQU   APCATFLG                                                 01708000
APC58E   EQU   APCATFLG                                                 01709000
APC57E   EQU   APCATFLG                                                 01710000
APC56E   EQU   APCATFLG                                                 01711000
APC54E   EQU   APCATFLG                                                 01712000
APC53E   EQU   APCATFLG                                                 01713000
APC52E   EQU   APCATFLG                                                 01714000
APC51E   EQU   APCATFLG                                                 01715000
APCHDRSV EQU   ISTAPCRR                                                 01716000
ASCPSREG EQU   ISTASCRR+44                                              01717000
ASCUSR01 EQU   ASCUSRGS+12                                              01718000
ASCUSR00 EQU   ASCUSRGS+8                                               01719000
ASCUSR15 EQU   ASCUSRGS+4                                               01720000
ASCUSR14 EQU   ASCUSRGS                                                 01721000
ASCETRYA EQU   ISTASCRR+24                                              01722000
ASCKEY   EQU   ISTASCRR+23                                              01723000
ASCAUDIT EQU   ASCFLG3                                                  01724000
ASCFBDUD EQU   ASCFLG3                                                  01725000
ASCLLKF  EQU   ASCFLG3                                                  01726000
ASCKEYF  EQU   ASCFLG3                                                  01727000
ASCFBDAL EQU   ASCFLG3                                                  01728000
ASCFSRGT EQU   ASCFLG3                                                  01729000
ASCICR   EQU   ASCFLG2                                                  01730000
ASCFSRIC EQU   ASCFLG2                                                  01731000
ASCFBDIC EQU   ASCFLG2                                                  01732000
ASCFBAIC EQU   ASCFLG2                                                  01733000
ASCPASTR EQU   ASCFLG1                                                  01734000
ASCFSR   EQU   ASCFLG1                                                  01735000
ASCFBD   EQU   ASCFLG1                                                  01736000
ASCFBA   EQU   ASCFLG1                                                  01737000
ASCPFCRR EQU   ISTASCRR                                                 01738000
CCFRSVD1 EQU   CFCCRT                                                   01739000
CCFCR2   EQU   CFCCRT                                                   01740000
CCFCRP   EQU   CFCCRT                                                   01741000
CCFCR1   EQU   CFCCRT                                                   01742000
CCFCS2   EQU   CFCCRT                                                   01743000
CCFCS1   EQU   CFCCRT                                                   01744000
NCFRSVD  EQU   CFCNTRD                                                  01745000
NCFCR2   EQU   CFCNTRD                                                  01746000
NCFCRP   EQU   CFCNTRD                                                  01747000
NCFCR1   EQU   CFCNTRD                                                  01748000
NCFCS2   EQU   CFCNTRD                                                  01749000
NCFCS1   EQU   CFCNTRD                                                  01750000
PFCRSV01 EQU   ISTPFCRR+13                                              01751000
PFCFTA   EQU   ISTPFCRR+12                                              01752000
CRRFRR   EQU   PFCFRRO                                                  01753000
CRRCHAIN EQU   PFCCRRO                                                  01754000
CRRLEN   EQU   PFCCRRLN                                                 01755000
PFCRSV10 EQU   PFCCRR+1                                                 01756000
CRRID    EQU   PFCCRRID                                                 01757000
ZCRRU    EQU   ZCRRHRU+3                                                01758000
ZCRRH    EQU   ZCRRHRU                                                  01759000
ZCRWORDA EQU   ISTZCRR+477                                              01760000
ZCRCMNRC EQU   ISTZCRR+476                                              01761000
ZCRRSV97 EQU   ZCRENTER+18                                              01762000
ZCREIC2B EQU   ZCRENTER+18                                              01763000
ZCREAC2B EQU   ZCRENTER+18                                              01764000
ZCRELCAB EQU   ZCRENTER+18                                              01765000
ZCREDCMF EQU   ZCRENTER+18                                              01766000
ZCREBCIF EQU   ZCRENTER+18                                              01767000
ZCREICSG EQU   ZCRENTER+18                                              01768000
ZCREDCK0 EQU   ZCRENTER+18                                              01769000
ZCRECFY0 EQU   ZCRENTER+17                                              01770000
ZCREKCCB EQU   ZCRENTER+17                                              01771000
ZCREDCNB EQU   ZCRENTER+17                                              01772000
ZCREICOE EQU   ZCRENTER+17                                              01773000
ZCREBCNB EQU   ZCRENTER+17                                              01774000
ZCREBC0L EQU   ZCRENTER+17                                              01775000
ZCREBCAL EQU   ZCRENTER+17                                              01776000
ZCREDCQR EQU   ZCRENTER+17                                              01777000
ZCREDCPR EQU   ZCRENTER+16                                              01778000
ZCREBCSB EQU   ZCRENTER+16                                              01779000
ZCREAC1R EQU   ZCRENTER+16                                              01780000
ZCRECCCI EQU   ZCRENTER+16                                              01781000
ZCRECCAI EQU   ZCRENTER+16                                              01782000
ZCRECCBI EQU   ZCRENTER+16                                              01783000
ZCREBCAR EQU   ZCRENTER+16                                              01784000
ZCREBCDR EQU   ZCRENTER+16                                              01785000
ZCREBCBR EQU   ZCRENTER+15                                              01786000
ZCREDCXR EQU   ZCRENTER+15                                              01787000
ZCREDCWB EQU   ZCRENTER+15                                              01788000
ZCREDCWR EQU   ZCRENTER+15                                              01789000
ZCREKCCN EQU   ZCRENTER+15                                              01790000
ZCREKCBN EQU   ZCRENTER+15                                              01791000
ZCREKCBB EQU   ZCRENTER+15                                              01792000
ZCREJC0B EQU   ZCRENTER+15                                              01793000
ZCREJCDB EQU   ZCRENTER+14                                              01794000
ZCREJCCB EQU   ZCRENTER+14                                              01795000
ZCREJCBB EQU   ZCRENTER+14                                              01796000
ZCREJCAB EQU   ZCRENTER+14                                              01797000
ZCREIC1B EQU   ZCRENTER+14                                              01798000
ZCREIC0B EQU   ZCRENTER+14                                              01799000
ZCREICX0 EQU   ZCRENTER+14                                              01800000
ZCREICWB EQU   ZCRENTER+14                                              01801000
ZCREICVB EQU   ZCRENTER+13                                              01802000
ZCREICUB EQU   ZCRENTER+13                                              01803000
ZCREICTB EQU   ZCRENTER+13                                              01804000
ZCREICSC EQU   ZCRENTER+13                                              01805000
ZCREICSB EQU   ZCRENTER+13                                              01806000
ZCREICRB EQU   ZCRENTER+13                                              01807000
ZCREICQB EQU   ZCRENTER+13                                              01808000
ZCREICQA EQU   ZCRENTER+13                                              01809000
ZCREICOB EQU   ZCRENTER+12                                              01810000
ZCREICOA EQU   ZCRENTER+12                                              01811000
ZCREICNB EQU   ZCRENTER+12                                              01812000
ZCREICNA EQU   ZCRENTER+12                                              01813000
ZCREICMB EQU   ZCRENTER+12                                              01814000
ZCREICLB EQU   ZCRENTER+12                                              01815000
ZCREICKG EQU   ZCRENTER+12                                              01816000
ZCREICKE EQU   ZCRENTER+12                                              01817000
ZCREICKB EQU   ZCRENTER+11                                              01818000
ZCREICJB EQU   ZCRENTER+11                                              01819000
ZCREICID EQU   ZCRENTER+11                                              01820000
ZCREICIB EQU   ZCRENTER+11                                              01821000
ZCREICHB EQU   ZCRENTER+11                                              01822000
ZCREICGB EQU   ZCRENTER+11                                              01823000
ZCREICEB EQU   ZCRENTER+11                                              01824000
ZCREICDB EQU   ZCRENTER+11                                              01825000
ZCREICCI EQU   ZCRENTER+10                                              01826000
ZCREICCB EQU   ZCRENTER+10                                              01827000
ZCREICBI EQU   ZCRENTER+10                                              01828000
ZCREICBB EQU   ZCRENTER+10                                              01829000
ZCREICAB EQU   ZCRENTER+10                                              01830000
ZCREICAA EQU   ZCRENTER+10                                              01831000
ZCREGC0B EQU   ZCRENTER+10                                              01832000
ZCREGC0A EQU   ZCRENTER+9                                               01833000
ZCREGCLA EQU   ZCRENTER+9                                               01834000
ZCREGCEB EQU   ZCRENTER+9                                               01835000
ZCREGCDB EQU   ZCRENTER+9                                               01836000
@NM00031 EQU   ZCRENTER+9                                               01837000
ZCREGCBB EQU   ZCRENTER+9                                               01838000
ZCREGCAB EQU   ZCRENTER+9                                               01839000
ZCREFCEB EQU   ZCRENTER+9                                               01840000
ZCREFCEA EQU   ZCRENTER+8                                               01841000
ZCREECTA EQU   ZCRENTER+8                                               01842000
ZCREECEA EQU   ZCRENTER+8                                               01843000
ZCREECDA EQU   ZCRENTER+8                                               01844000
ZCREECCB EQU   ZCRENTER+8                                               01845000
ZCREECCA EQU   ZCRENTER+8                                               01846000
ZCREECBB EQU   ZCRENTER+8                                               01847000
ZCREECBA EQU   ZCRENTER+8                                               01848000
ZCREDCMB EQU   ZCRENTER+7                                               01849000
ZCREDCL0 EQU   ZCRENTER+7                                               01850000
ZCREDCKB EQU   ZCRENTER+7                                               01851000
ZCREDCKA EQU   ZCRENTER+7                                               01852000
ZCREDCJ0 EQU   ZCRENTER+7                                               01853000
ZCREDCI0 EQU   ZCRENTER+7                                               01854000
ZCREDCH0 EQU   ZCRENTER+7                                               01855000
ZCREDCF0 EQU   ZCRENTER+7                                               01856000
ZCREDCE0 EQU   ZCRENTER+6                                               01857000
ZCREDCD0 EQU   ZCRENTER+6                                               01858000
ZCREDCC0 EQU   ZCRENTER+6                                               01859000
ZCREDCB0 EQU   ZCRENTER+6                                               01860000
ZCREDCA0 EQU   ZCRENTER+6                                               01861000
ZCRECC2B EQU   ZCRENTER+6                                               01862000
ZCRECC1B EQU   ZCRENTER+6                                               01863000
ZCRECC1A EQU   ZCRENTER+6                                               01864000
ZCRECC0B EQU   ZCRENTER+5                                               01865000
ZCRECC0A EQU   ZCRENTER+5                                               01866000
ZCREBC0B EQU   ZCRENTER+5                                               01867000
ZCREBC0A EQU   ZCRENTER+5                                               01868000
ZCREBCZ0 EQU   ZCRENTER+5                                               01869000
ZCREBCY0 EQU   ZCRENTER+5                                               01870000
ZCREBCX0 EQU   ZCRENTER+5                                               01871000
ZCREBCXA EQU   ZCRENTER+5                                               01872000
ZCREBCSC EQU   ZCRENTER+4                                               01873000
ZCREBCRB EQU   ZCRENTER+4                                               01874000
ZCREBCRA EQU   ZCRENTER+4                                               01875000
ZCREBCQB EQU   ZCRENTER+4                                               01876000
ZCREBCPB EQU   ZCRENTER+4                                               01877000
ZCREBCOB EQU   ZCRENTER+4                                               01878000
ZCREBCNE EQU   ZCRENTER+4                                               01879000
ZCREBCND EQU   ZCRENTER+4                                               01880000
ZCREBCMB EQU   ZCRENTER+3                                               01881000
ZCREBCLB EQU   ZCRENTER+3                                               01882000
ZCREBCLA EQU   ZCRENTER+3                                               01883000
ZCREBCKB EQU   ZCRENTER+3                                               01884000
ZCREBCKA EQU   ZCRENTER+3                                               01885000
ZCREBCJB EQU   ZCRENTER+3                                               01886000
ZCREBCJA EQU   ZCRENTER+3                                               01887000
ZCREBCID EQU   ZCRENTER+3                                               01888000
ZCREBCIB EQU   ZCRENTER+2                                               01889000
ZCREBCIA EQU   ZCRENTER+2                                               01890000
ZCREBCHB EQU   ZCRENTER+2                                               01891000
ZCREBCHA EQU   ZCRENTER+2                                               01892000
ZCREBCGB EQU   ZCRENTER+2                                               01893000
ZCREBCGA EQU   ZCRENTER+2                                               01894000
ZCREBCFB EQU   ZCRENTER+2                                               01895000
ZCREBCFA EQU   ZCRENTER+2                                               01896000
ZCREBCEB EQU   ZCRENTER+1                                               01897000
ZCREBCDI EQU   ZCRENTER+1                                               01898000
ZCREBCCB EQU   ZCRENTER+1                                               01899000
ZCREBCBI EQU   ZCRENTER+1                                               01900000
ZCREBCBB EQU   ZCRENTER+1                                               01901000
ZCREBCBA EQU   ZCRENTER+1                                               01902000
ZCREBCAM EQU   ZCRENTER+1                                               01903000
ZCREBCAI EQU   ZCRENTER+1                                               01904000
ZCREBCAG EQU   ZCRENTER                                                 01905000
ZCREBCAE EQU   ZCRENTER                                                 01906000
ZCREBCAB EQU   ZCRENTER                                                 01907000
ZCREBCAA EQU   ZCRENTER                                                 01908000
ZCREAC1B EQU   ZCRENTER                                                 01909000
ZCREAC0B EQU   ZCRENTER                                                 01910000
ZCREAC0A EQU   ZCRENTER                                                 01911000
ZCREAC1A EQU   ZCRENTER                                                 01912000
ZCRTNAME EQU   ZCRAUDIT+1                                               01913000
ZCRTID   EQU   ZCRAUDIT                                                 01914000
ZCRREMIC EQU   ISTZCRR+436                                              01915000
ZCRSAVEZ EQU   ISTZCRR+196                                              01916000
ZCRDAFSV EQU   ZCRCIDSV+2                                               01917000
ZCRSAFSV EQU   ZCRCIDSV                                                 01918000
ZCRR13SV EQU   ISTZCRR+188                                              01919000
ZCRR2SV  EQU   ISTZCRR+184                                              01920000
ZCROPCDE EQU   ISTZCRR+183                                              01921000
ZCRPRMTC EQU   ISTZCRR+182                                              01922000
ZCRRCDSV EQU   ISTZCRR+181                                              01923000
ZCRAWQSW EQU   ISTZCRR+180                                              01924000
ZCRTOPQ  EQU   ISTZCRR+180                                              01925000
ZCRLSTFB EQU   ISTZCRR+180                                              01926000
ZCRXSCHD EQU   ISTZCRR+180                                              01927000
ZCRNXTEL EQU   ISTZCRR+180                                              01928000
ZCRSCANQ EQU   ISTZCRR+180                                              01929000
ZCRMOREL EQU   ISTZCRR+180                                              01930000
ZCRFBPRC EQU   ISTZCRR+180                                              01931000
ZCRFSBSV EQU   ISTZCRR+176                                              01932000
ZCRSVWK5 EQU   ZCRWKARA+16                                              01933000
ZCRSVWK4 EQU   ZCRWKARA+12                                              01934000
ZCRSVWK3 EQU   ZCRWKARA+8                                               01935000
ZCRSVWK2 EQU   ZCRWKARA+4                                               01936000
ZCRSVWK1 EQU   ZCRWKARA                                                 01937000
ZCRSVF25 EQU   ZCRSVRTN+96                                              01938000
ZCRSVF24 EQU   ZCRSVRTN+92                                              01939000
ZCRSVF23 EQU   ZCRSVRTN+88                                              01940000
ZCRSVF22 EQU   ZCRSVRTN+84                                              01941000
ZCRSVF21 EQU   ZCRSVRTN+80                                              01942000
ZCRSVF20 EQU   ZCRSVRTN+76                                              01943000
ZCRSVF19 EQU   ZCRSVRTN+72                                              01944000
ZCRSVF18 EQU   ZCRSVRTN+68                                              01945000
ZCRSVF17 EQU   ZCRSVRTN+64                                              01946000
ZCRSVF16 EQU   ZCRSVRTN+60                                              01947000
ZCRSVF15 EQU   ZCRSVRTN+56                                              01948000
ZCRSVF14 EQU   ZCRSVRTN+52                                              01949000
ZCRSVF13 EQU   ZCRSVRTN+48                                              01950000
ZCRSVF12 EQU   ZCRSVRTN+44                                              01951000
ZCRSVF11 EQU   ZCRSVRTN+40                                              01952000
ZCRSVF10 EQU   ZCRSVRTN+36                                              01953000
ZCRSVF9  EQU   ZCRSVRTN+32                                              01954000
ZCRSVF8  EQU   ZCRSVRTN+28                                              01955000
ZCRSVF7  EQU   ZCRSVRTN+24                                              01956000
ZCRSVF6  EQU   ZCRSVRTN+20                                              01957000
ZCRSVF5  EQU   ZCRSVRTN+16                                              01958000
ZCRSVF4  EQU   ZCRSVRTN+12                                              01959000
ZCRSVF3  EQU   ZCRSVRTN+8                                               01960000
ZCRSVF2  EQU   ZCRSVRTN+4                                               01961000
ZCRSVF1  EQU   ZCRSVRTN                                                 01962000
ZCRPVZB  EQU   ISTZCRR+52                                               01963000
ZCRZLB   EQU   ISTZCRR+48                                               01964000
ZCRBFPTR EQU   ISTZCRR+44                                               01965000
ZCRCCWA  EQU   ISTZCRR+40                                               01966000
ZCRPSW   EQU   ZCRPARMS+15                                              01967000
ZCRPCHAR EQU   ZCRPARMS+14                                              01968000
ZCRPRES2 EQU   ZCRPCOD2                                                 01969000
ZCRPMFGF EQU   ZCRPCOD2                                                 01970000
ZCRPFHDR EQU   ZCRPCOD2                                                 01971000
ZCRPPG2  EQU   ZCRPCOD2                                                 01972000
ZCRPRES  EQU   ZCRPCOD1                                                 01973000
ZCRPCFTX EQU   ZCRPCOD1                                                 01974000
ZCRPLSCB EQU   ZCRPCOD1                                                 01975000
ZCRPLSBQ EQU   ZCRPLSBF                                                 01976000
ZCRPFSB  EQU   ZCRPCOD1                                                 01977000
ZCRPLNG  EQU   ZCRPCOD1                                                 01978000
ZCRPPG   EQU   ZCRPCOD1                                                 01979000
ZCRDTODA EQU   ZCRDFRDA                                                 01980000
ZCRMLNG  EQU   ZCRPARMS+8                                               01981000
ZCRTBPTR EQU   ZCRPARMS+4                                               01982000
ZCRCBPTR EQU   ZCRFBPTR                                                 01983000
ZCRCRLCP EQU   ISTZCRR+20                                               01984000
@NM00030 EQU   ZCRSCPSW                                                 01985000
ZCRSKIPT EQU   ZCRSCPSW                                                 01986000
ZCRFSBWE EQU   ZCRSCPSW                                                 01987000
ZCRPRCMP EQU   ZCRSCPSW                                                 01988000
ZCRLREQ  EQU   ZCRSCPSW                                                 01989000
ZCRRJLCP EQU   ZCRSCPSW                                                 01990000
ZCRTPINV EQU   ZCRSCPSW                                                 01991000
ZCRTPEX  EQU   ZCRSCPSW                                                 01992000
@NM00029 EQU   ZCRIBPR                                                  01993000
ZCR3270R EQU   ZCRIBPR                                                  01994000
ZCR3270  EQU   ZCRIBPR                                                  01995000
ZCRLCPFD EQU   ZCRIBPR                                                  01996000
ZCRLCPFR EQU   ZCRIBPR                                                  01997000
ZCRRELK  EQU   ZCRIBPR                                                  01998000
ZCRERR   EQU   ZCRIBPR                                                  01999000
ZCRNOBUF EQU   ZCRIBPR                                                  02000000
@NM00028 EQU   ZCRPFLGS                                                 02001000
ZCRQAHED EQU   ZCRPFLGS                                                 02002000
ZCRF1RES EQU   ZCRGENSW                                                 02003000
ZCRBRIS  EQU   ZCRGENSW                                                 02004000
ZCRCLRBD EQU   ZCRGENSW                                                 02005000
ZCREXRES EQU   ZCRGENSW                                                 02006000
ZCRLCSYN EQU   ZCRGENSW                                                 02007000
ZCRRT06  EQU   ZCRGENSW                                                 02008000
ZCRTSW2  EQU   ZCRGENSW                                                 02009000
ZCRTSW1  EQU   ZCRGENSW                                                 02010000
ZCRINLCP EQU   ZCRFLGS3                                                 02011000
ZCRWRPTR EQU   ZCRFLGS3                                                 02012000
ZCRNOFRE EQU   ZCRFLGS3                                                 02013000
ZCREDRIV EQU   ZCRFLGS3                                                 02014000
ZCRDISC  EQU   ZCRFLGS3                                                 02015000
ZCRTPDIS EQU   ZCRFLGS3                                                 02016000
ZCRTPCON EQU   ZCRFLGS3                                                 02017000
ZCRTIC   EQU   ZCRFLGS3                                                 02018000
ZCRCNLXL EQU   ZCRRESET                                                 02019000
ZCRENDAN EQU   ZCRSWFLD                                                 02020000
ZCRENDXL EQU   ZCRSWFLD                                                 02021000
ZCRENDX  EQU   ZCRSWFLD                                                 02022000
ZCROB1   EQU   ZCRNDLCP                                                 02023000
ZCRENDPR EQU   ZCRSWFLD                                                 02024000
ZCREXTYP EQU   ZCRSWFLD                                                 02025000
ZCRSLCP  EQU   ZCRENDSH                                                 02026000
ZCRIF0E3 EQU   ZCRFLGS2                                                 02027000
ZCRIF0E2 EQU   ZCRFLGS2                                                 02028000
ZCRIF0E1 EQU   ZCRFLGS2                                                 02029000
ZCROB    EQU   ZCRFLGS2                                                 02030000
ZCRFMSED EQU   ZCRFLGS2                                                 02031000
ZCRSHEDI EQU   ZCRFLGS2                                                 02032000
ZCRLOCAL EQU   ZCRFLGS2                                                 02033000
ZCRFEXIT EQU   ZCRFLGS1                                                 02034000
ZCRUNSOL EQU   ZCRFLGS1                                                 02035000
ZCRENDLP EQU   ZCRFLGS1                                                 02036000
ZCRNRMEX EQU   ZCRFLGS1                                                 02037000
ZCRWAIT  EQU   ZCRFLGS1                                                 02038000
ZCRDEQSW EQU   ZCRFLGS1                                                 02039000
ZCRQUESW EQU   ZCRFLGS1                                                 02040000
ZCREXSW  EQU   ZCRFLGS1                                                 02041000
ZCRFRRA  EQU   ISTZCRR+8                                                02042000
ZCRCHAIN EQU   ISTZCRR+4                                                02043000
ZCRFLAG  EQU   ZCRCRR+3                                                 02044000
ZCRLEN   EQU   ZCRCRR+1                                                 02045000
ZCRID    EQU   ZCRCRR                                                   02046000
RPHNEXPO EQU   ISTRPH+104                                               02047000
RPHSAV16 EQU   RPHWORK+60                                               02048000
RPHSAV15 EQU   RPHWORK+56                                               02049000
RPHSAV14 EQU   RPHWORK+52                                               02050000
RPHSAV13 EQU   RPHWORK+48                                               02051000
RPHSAV12 EQU   RPHWORK+44                                               02052000
RPHSAV11 EQU   RPHWORK+40                                               02053000
RPHSAV10 EQU   RPHWORK+36                                               02054000
RPHSAVE9 EQU   RPHWORK+32                                               02055000
RPHSAVE8 EQU   RPHWORK+28                                               02056000
RPHSAVE7 EQU   RPHWORK+24                                               02057000
RPHSAVE6 EQU   RPHWORK+20                                               02058000
RPHSAVE5 EQU   RPHWORK+16                                               02059000
RPHSAVE4 EQU   RPHWORK+12                                               02060000
RPHSAVE3 EQU   RPHWORK+8                                                02061000
RPHSAVE2 EQU   RPHWORK+4                                                02062000
RPHSHALF EQU   RPHSAVE1+2                                               02063000
RPHSBIT8 EQU   RPHSBITS                                                 02064000
RPHSBIT7 EQU   RPHSBITS                                                 02065000
RPHSBIT6 EQU   RPHSBITS                                                 02066000
RPHSBIT5 EQU   RPHSBITS                                                 02067000
RPHSBIT4 EQU   RPHSBITS                                                 02068000
RPHSBIT3 EQU   RPHSBITS                                                 02069000
RPHSBIT2 EQU   RPHSBITS                                                 02070000
RPHSBIT1 EQU   RPHSBITS                                                 02071000
RPHSBYTE EQU   RPHSAVE1                                                 02072000
RPHPABQP EQU   RPHPABQA+1                                               02073000
RPHPABFG EQU   RPHPABQA                                                 02074000
RPHSRP34 EQU   RPHSRPRM+2                                               02075000
RPHSRP12 EQU   RPHSRPRM                                                 02076000
RPHWEGT  EQU   RPHCSPA                                                  02077000
RPHMAJCB EQU   ISTRPH+21                                                02078000
RPHPABOF EQU   ISTRPH+20                                                02079000
RPHRESUM EQU   RPHRESMA+1                                               02080000
RPHRSV01 EQU   RPHWPFLG                                                 02081000
RPHPURGE EQU   RPHWPFLG                                                 02082000
RPHPT    EQU   RPHWPFLG                                                 02083000
RPHWT    EQU   RPHWPFLG                                                 02084000
RPHRSKEY EQU   RPHWPFLG                                                 02085000
RPHDVTA  EQU   ISTRPH+12                                                02086000
RPHTIK   EQU   RPHTSKID+3                                               02087000
@NM00027 EQU   RPHTSKID                                                 02088000
RPHRPHAP EQU   RPHRPHA+1                                                02089000
@NM00026 EQU   RPHRPHA                                                  02090000
RPHGATE  EQU   RPHRPHA                                                  02091000
@NM00025 EQU   RPHFLGB                                                  02092000
RPHRLCRA EQU   RPHFLGB                                                  02093000
RPHNRSAV EQU   RPHFLGB                                                  02094000
RPHPGCMP EQU   RPHFLGB                                                  02095000
RPHFBAPS EQU   RPHFLGB                                                  02096000
RPHBSSP  EQU   RPHFLGB                                                  02097000
RPHLOCK  EQU   RPHFLGB                                                  02098000
RPHFNFLG EQU   RPHFSTLC                                                 02099000
RPHMLTCP EQU   RPHFLAGS                                                 02100000
RPHSMCLR EQU   RPHFLAGS                                                 02101000
RPHSMTYP EQU   RPHFLAGS                                                 02102000
RPHSMQ   EQU   RPHFLAGS                                                 02103000
RPHAUTEX EQU   RPHAPTYP                                                 02104000
RPHSPGIN EQU   RPHFLAGS                                                 02105000
RPHOGIND EQU   RPHFLAGS                                                 02106000
RPHLNGTH EQU   ISTRPH+1                                                 02107000
RPHTYPE  EQU   ISTRPH                                                   02108000
ZPSZDFQR EQU   ISTZPSVT+80                                              02109000
ZPSZDFPR EQU   ISTZPSVT+76                                              02110000
ZPSZDFXR EQU   ISTZPSVT+72                                              02111000
ZPSZIF2B EQU   ISTZPSVT+68                                              02112000
ZPSZAF2B EQU   ISTZPSVT+64                                              02113000
ZPSZDFMB EQU   ISTZPSVT+60                                              02114000
ZPSZDFMF EQU   ISTZPSVT+56                                              02115000
ZPSZDFNB EQU   ISTZPSVT+52                                              02116000
@NM00024 EQU   ISTZPSVT+48                                              02117000
ZPSZDFF0 EQU   ISTZPSVT+44                                              02118000
ZPSZTRTT EQU   ISTZPSVT+40                                              02119000
ZPSZBFOB EQU   ISTZPSVT+36                                              02120000
ZPSZBFMB EQU   ISTZPSVT+32                                              02121000
ZPSZDFI0 EQU   ISTZPSVT+20                                              02122000
ZPSZDFB0 EQU   ISTZPSVT+16                                              02123000
ZPSZDFH0 EQU   ISTZPSVT+12                                              02124000
ZPSZDFD0 EQU   ISTZPSVT+8                                               02125000
ZPSZDFC0 EQU   ISTZPSVT+4                                               02126000
DNCLOCK  EQU   DNCOS+36                                                 02127000
DNCZV005 EQU   DNCOS+32                                                 02128000
DNCZV003 EQU   DNCOS+24                                                 02129000
DNCZV002 EQU   DNCOS+21                                                 02130000
DNCZX001 EQU   DNCOS+20                                                 02131000
DNCZX003 EQU   DNCOS+16                                                 02132000
DNCZV000 EQU   DNCOS+12                                                 02133000
DNCSESCQ EQU   DNCOS+8                                                  02134000
DNCSESIQ EQU   DNCOS+4                                                  02135000
DNCACIP  EQU   DNCBSCED+1                                               02136000
DNCLICP  EQU   DNCBSCED                                                 02137000
DNCZF008 EQU   DNCZFLGS+1                                               02138000
DNCPSOL  EQU   DNCZFLGS+1                                               02139000
DNCZF007 EQU   DNCZFLGS+1                                               02140000
DNCZF006 EQU   DNCZFLGS+1                                               02141000
DNCZF005 EQU   DNCZFLGS+1                                               02142000
DNCZF004 EQU   DNCZFLGS+1                                               02143000
DNCZF003 EQU   DNCZFLGS                                                 02144000
DNCZF002 EQU   DNCZFLGS                                                 02145000
DNCZRSCH EQU   DNCZFLGS                                                 02146000
DNCCONT  EQU   DNCZFLGS                                                 02147000
DNCZF001 EQU   DNCZFLGS                                                 02148000
DNCMODE  EQU   ISTDNCB+49                                               02149000
DNCBHSET EQU   ISTDNCB+48                                               02150000
DNCNCB   EQU   ISTDNCB                                                  02151000
NCBRSV01 EQU   ISTNCB+46                                                02152000
NCBSWDAF EQU   ISTNCB+44                                                02153000
NCBDEVCH EQU   ISTNCB+36                                                02154000
NCBFMCBP EQU   ISTNCB+32                                                02155000
NCBLTRC  EQU   ISTNCB+30                                                02156000
NCBRVPT1 EQU   ISTNCB+28                                                02157000
NCBNMLLN EQU   NCBFLAGS+3                                               02158000
@NM00023 EQU   NCBFLAG1                                                 02159000
@NM00022 EQU   NCBFLAG1                                                 02160000
NCBTTF   EQU   NCBFLAG1                                                 02161000
NCBRSYNC EQU   NCBFLAG1                                                 02162000
NCBRSTRT EQU   NCBFLAG1                                                 02163000
NCBCONF  EQU   NCBFLAG1                                                 02164000
NCBSNAI  EQU   NCBFLAG1                                                 02165000
NCBFLTIO EQU   NCBFTRIO                                                 02166000
NCBCSTAT EQU   NCBFLAGS                                                 02167000
NCBNCSL  EQU   ISTNCB+22                                                02168000
NCBNCBA  EQU   ISTNCB+20                                                02169000
NCBFMCBA EQU   ISTNCB+16                                                02170000
NCBNSNA  EQU   ISTNCB+12                                                02171000
NCBTSKID EQU   ISTNCB+8                                                 02172000
NCBRDTE  EQU   ISTNCB+4                                                 02173000
NCBLNGTH EQU   ISTNCB+1                                                 02174000
NCBTYPE  EQU   ISTNCB                                                   02175000
FMCFLRSV EQU   FMCFLGB                                                  02176000
FMCFLGA8 EQU   FMCFLGB                                                  02177000
FMCCLRPH EQU   FMCVS1+45                                                02178000
FMCRSV0X EQU   FMCCVFLG                                                 02179000
FMCVYRPH EQU   FMCCVFLG                                                 02180000
FMCZV004 EQU   FMCVS1+40                                                02181000
FMCLOCK2 EQU   FMCVS1+36                                                02182000
@NM00021 EQU   FMCZFLG2                                                 02183000
FMCZF027 EQU   FMCZFLG2                                                 02184000
FMCZF026 EQU   FMCZFLG2                                                 02185000
FMCSEQ1B EQU   FMCSEQ1                                                  02186000
FMCSEQ1T EQU   FMCSEQ1                                                  02187000
FMCZX006 EQU   FMCVS1+33                                                02188000
FMCZX005 EQU   FMCVS1+32                                                02189000
FMCZX004 EQU   FMCVS1+31                                                02190000
FMCZX002 EQU   FMCVS1+29                                                02191000
FMCZV001 EQU   FMCVS1+24                                                02192000
FMCAWATQ EQU   FMCLCPAQ+1                                               02193000
@NM00020 EQU   FMCLCPAQ                                                 02194000
FMCLCPB2 EQU   FMCLCPBQ+1                                               02195000
FMCLCPB1 EQU   FMCLCPBQ                                                 02196000
FMCASCDQ EQU   FMCSHEAQ+1                                               02197000
@NM00019 EQU   FMCSHEAQ                                                 02198000
FMCRSV04 EQU   FMCVS1+6                                                 02199000
FMCZH001 EQU   FMCVS1+4                                                 02200000
FMCZF025 EQU   FMCZFLAG+3                                               02201000
FMCZF024 EQU   FMCZFLAG+3                                               02202000
FMCZF023 EQU   FMCZFLAG+3                                               02203000
FMCZF022 EQU   FMCZFLAG+3                                               02204000
FMCZF021 EQU   FMCZFLAG+3                                               02205000
FMCZF020 EQU   FMCZFLAG+3                                               02206000
FMCZF019 EQU   FMCZFLAG+3                                               02207000
FMCZF018 EQU   FMCZFLAG+3                                               02208000
FMCZF017 EQU   FMCZFLAG+2                                               02209000
FMCZF016 EQU   FMCZFLAG+2                                               02210000
FMCZF015 EQU   FMCZFLAG+2                                               02211000
FMCZF014 EQU   FMCZFLAG+2                                               02212000
FMCZF013 EQU   FMCZFLAG+2                                               02213000
FMCZF012 EQU   FMCZFLAG+2                                               02214000
FMCZF011 EQU   FMCZFLAG+2                                               02215000
FMCZF010 EQU   FMCZFLAG+2                                               02216000
FMCZF00F EQU   FMCZFLAG+1                                               02217000
FMCZF00E EQU   FMCZFLAG+1                                               02218000
FMCZF00D EQU   FMCZFLAG+1                                               02219000
FMCZF00C EQU   FMCZFLAG+1                                               02220000
FMCZF00B EQU   FMCZFLAG+1                                               02221000
FMCRSV10 EQU   FMCZFLAG+1                                               02222000
FMCZF009 EQU   FMCZFLAG+1                                               02223000
FMCZF005 EQU   FMCZFLAG                                                 02224000
FMCZF003 EQU   FMCZFLAG                                                 02225000
FMCZF002 EQU   FMCZFLAG                                                 02226000
FMCFRESA EQU   ISTFMCB+228                                              02227000
FMCSCSQN EQU   FMCSNCTL+2                                               02228000
FMCSCCTL EQU   FMCSNCTL+1                                               02229000
FMCSTCTL EQU   FMCSCFLG                                                 02230000
FMCSCCLO EQU   FMCSCFLG                                                 02231000
FMCAPRO  EQU   FMCSCFLG                                                 02232000
FMCLURO  EQU   FMCSCFLG                                                 02233000
FMCOBSAC EQU   FMCSCFLG                                                 02234000
FMCIBSAC EQU   FMCSCFLG                                                 02235000
FMCFBRE  EQU   ISTFMCB+220                                              02236000
FMCFBXM  EQU   FMCZV002                                                 02237000
FMCASEGQ EQU   ISTFMCB+212                                              02238000
FMCRDTPT EQU   ISTFMCB+208                                              02239000
FMCLOCK  EQU   ISTFMCB+204                                              02240000
FMCSEGD  EQU   FMCSSEGQ                                                 02241000
FMCRSPLM EQU   ISTFMCB+198                                              02242000
FMCPSTRS EQU   ISTFMCB+196                                              02243000
@NM00018 EQU   FMCRRESP                                                 02244000
FMCTSLHA EQU   FMCRRESP                                                 02245000
FMCFRRN  EQU   FMCRRESP                                                 02246000
FMCFME   EQU   FMCRRESP                                                 02247000
FMCFEX   EQU   FMCRRESP                                                 02248000
FMCFPE   EQU   FMCRRESP                                                 02249000
FMCCTLB  EQU   ISTFMCB+194                                              02250000
FMCBSQNO EQU   FMCCLSEQ+2                                               02251000
FMCTSQNO EQU   FMCCLSEQ                                                 02252000
FMCOBPRG EQU   FMCMODEB                                                 02253000
FMCIBPRG EQU   FMCMODEB                                                 02254000
FMCRESOT EQU   FMCMODEB                                                 02255000
FMCRSTSR EQU   FMCMODEB                                                 02256000
FMCLUQ   EQU   FMCMODEB                                                 02257000
FMCAPQ   EQU   FMCMODEB                                                 02258000
FMCCLEAR EQU   FMCMODEB                                                 02259000
FMCHOLD  EQU   FMCMODEB                                                 02260000
FMCIPSEQ EQU   ISTFMCB+188                                              02261000
FMCLUSTR EQU   ISTFMCB+187                                              02262000
FMCRSV87 EQU   FMCSTAT2                                                 02263000
FMCSEQI  EQU   FMCSTAT2                                                 02264000
FMCCPIP  EQU   FMCSTAT2                                                 02265000
FMCALIPR EQU   FMCSTAT2                                                 02266000
FMCIAIO  EQU   FMCSTAT2                                                 02267000
FMCZF00A EQU   FMCSTAT2                                                 02268000
FMCVPIP  EQU   FMCSTAT2                                                 02269000
FMCBHSET EQU   ISTFMCB+185                                              02270000
FMCPRMRC EQU   FMCCLEXT+20                                              02271000
FMCRSV89 EQU   FMCPSTAT                                                 02272000
FMCPCLSD EQU   FMCPSTAT                                                 02273000
FMCDDOCD EQU   FMCPSTAT                                                 02274000
FMCIDVFD EQU   FMCPSTAT                                                 02275000
FMCELKST EQU   FMCPSTAT                                                 02276000
FMCRSV88 EQU   FMCPSCMD                                                 02277000
FMCRDBLK EQU   FMCPSCMD                                                 02278000
FMCDSEOC EQU   FMCPSCMD                                                 02279000
FMCPURGE EQU   FMCPSCMD                                                 02280000
FMCRESTI EQU   FMCPSCMD                                                 02281000
FMCCNTCT EQU   FMCPSCMD                                                 02282000
FMCINVT  EQU   FMCPSCMD                                                 02283000
FMCFLGB7 EQU   FMCFLGCL                                                 02284000
FMCFLGB6 EQU   FMCFLGCL                                                 02285000
FMCFLGB5 EQU   FMCFLGCL                                                 02286000
FMCFLGB4 EQU   FMCFLGCL                                                 02287000
FMCFLGB3 EQU   FMCFLGCL                                                 02288000
FMCFLGB2 EQU   FMCFLGCL                                                 02289000
FMCFLGB1 EQU   FMCFLGCL                                                 02290000
FMCFLGB0 EQU   FMCFLGCL                                                 02291000
FMCFLGA7 EQU   FMCFLGA                                                  02292000
FMCFLGA6 EQU   FMCFLGA                                                  02293000
FMCFLGA5 EQU   FMCFLGA                                                  02294000
FMCFLGA4 EQU   FMCFLGA                                                  02295000
FMCFLGA3 EQU   FMCFLGA                                                  02296000
FMCFLGA2 EQU   FMCFLGA                                                  02297000
FMCFLGA1 EQU   FMCFLGA                                                  02298000
FMCFLGA0 EQU   FMCFLGA                                                  02299000
FMCDCLOK EQU   FMCCLEXT+12                                              02300000
FMCRAFM  EQU   FMCCLEXT+8                                               02301000
FMCFBPTR EQU   FMCFBA+1                                                 02302000
FMCFBRSV EQU   FMCFBA                                                   02303000
FMCRPLPT EQU   FMCRPLA+1                                                02304000
FMCRPLRS EQU   FMCRPLA                                                  02305000
FMCPRCLS EQU   FMCCVAL                                                  02306000
FMCIBCE  EQU   FMCCVAL                                                  02307000
FMCONLY  EQU   FMCOBCE                                                  02308000
FMCLAST  EQU   FMCOBCE                                                  02309000
FMCMIDLE EQU   FMCOBCE                                                  02310000
FMCFIRST EQU   FMCOBCE                                                  02311000
FMCCPCNT EQU   FMCPACPC                                                 02312000
FMCMPCNT EQU   FMCPACEM                                                 02313000
FMCNPCNT EQU   FMCPACEN                                                 02314000
FMCCONF  EQU   FMCSSTAT                                                 02315000
FMCPURCH EQU   FMCSSTAT                                                 02316000
FMCNSALU EQU   FMCSSTAT                                                 02317000
FMCBIP   EQU   FMCSSTAT                                                 02318000
FMCSDTR  EQU   FMCSSTAT                                                 02319000
FMCUIPI  EQU   FMCSSTAT                                                 02320000
FMCCIPI  EQU   FMCSSTAT                                                 02321000
FMCSNBI  EQU   FMCSSTAT                                                 02322000
FMCRVD01 EQU   ISTFMCB+158                                              02323000
FMCISSN  EQU   ISTFMCB+156                                              02324000
FMCOASN  EQU   FMCNXOSC                                                 02325000
FMCOSSN  EQU   FMCNXCFM                                                 02326000
FMCSIP   EQU   FMCSIPA                                                  02327000
FMCEXLST EQU   ISTFMCB+144                                              02328000
FMCPAB5  EQU   ISTFMCB+128                                              02329000
FMCPAB4  EQU   ISTFMCB+112                                              02330000
FMCPAB3  EQU   ISTFMCB+96                                               02331000
FMCPAB1  EQU   ISTFMCB+64                                               02332000
FMCFASYA EQU   ISTFMCB+60                                               02333000
FMCMODE  EQU   ISTFMCB+52                                               02334000
FMCVWT   EQU   ISTFMCB+44                                               02335000
FMCRPLH  EQU   ISTFMCB+40                                               02336000
FMCBUFNB EQU   FMCCMPS1+2                                               02337000
FMCBUFLM EQU   FMCCMPS1                                                 02338000
FMCDEBA  EQU   ISTFMCB+32                                               02339000
@NM00017 EQU   FMCCMDFL                                                 02340000
FMCSNA   EQU   FMCCMDFL                                                 02341000
FMCVSNA  EQU   FMCCMDFL                                                 02342000
FMCCMDR  EQU   FMCCMDFL                                                 02343000
@NM00016 EQU   ISTFMCB+30                                               02344000
@NM00015 EQU   FMCSTAT1                                                 02345000
FMCHPURG EQU   FMCSTAT1                                                 02346000
FMCVSP2  EQU   FMCSTAT1                                                 02347000
FMCVSP1  EQU   FMCSTAT                                                  02348000
FMCLTEAS EQU   FMCSTAT                                                  02349000
FMCZF007 EQU   FMCSTAT                                                  02350000
FMCDEDSC EQU   FMCSTAT                                                  02351000
FMCDEVOF EQU   FMCSTAT                                                  02352000
FMCDAPT  EQU   FMCSTAT                                                  02353000
FMCPRMTE EQU   FMCSTAT                                                  02354000
FMCPRMTR EQU   FMCSTAT                                                  02355000
FMCUSFLD EQU   ISTFMCB+24                                               02356000
FMCFMCBA EQU   ISTFMCB+20                                               02357000
FMCDNCBA EQU   ISTFMCB+16                                               02358000
FMCDVTA  EQU   ISTFMCB+12                                               02359000
FMCTSKID EQU   ISTFMCB+8                                                02360000
FMCNXTCB EQU   ISTFMCB+4                                                02361000
FMCLNGTH EQU   ISTFMCB+1                                                02362000
FMCTYPE  EQU   ISTFMCB                                                  02363000
PROSRDEF EQU   PROSETM4                                                 02364000
PRORSV47 EQU   PROSETM4                                                 02365000
PROSCON  EQU   PROSETM4                                                 02366000
PRORSV46 EQU   PROSETM3                                                 02367000
PROSMONT EQU   PROSETM3                                                 02368000
PRORSV45 EQU   PROSETM3                                                 02369000
PROSNTO  EQU   PROSETM3                                                 02370000
PRORSV44 EQU   PROSETM3                                                 02371000
PRORSV43 EQU   PROSETM2                                                 02372000
PROSNTFL EQU   PROSETM2                                                 02373000
PRORSV42 EQU   PROSETM2                                                 02374000
PRORSV41 EQU   PROPROCS                                                 02375000
PROMODC  EQU   PROPROC4                                                 02376000
PROMODT  EQU   PROPROC4                                                 02377000
PROMODM  EQU   PROPROC4                                                 02378000
PROMODB  EQU   PROPROC4                                                 02379000
PRORSV14 EQU   PROPROC4                                                 02380000
PRORSV13 EQU   PROPROC4                                                 02381000
PRORSV12 EQU   PROPROC4                                                 02382000
PROEIB   EQU   PROPROC4                                                 02383000
PRORSV11 EQU   PROPROC3                                                 02384000
PROMONT2 EQU   PROPROC3                                                 02385000
PROMONIT EQU   PROPROC3                                                 02386000
PROSUBLK EQU   PROPROC3                                                 02387000
PRONTO   EQU   PROPROC3                                                 02388000
PROLGIN  EQU   PROPROC3                                                 02389000
PROERPI  EQU   PROPROC3                                                 02390000
PRORSV07 EQU   PROPROC3                                                 02391000
PROEMLC  EQU   PROPROC2                                                 02392000
PRONTFL  EQU   PROPROC2                                                 02393000
PRORSV05 EQU   PROPROC2                                                 02394000
PRORSV04 EQU   PROPROC2                                                 02395000
PROLGOT  EQU   PROPROC2                                                 02396000
PROERPO  EQU   PROPROC2                                                 02397000
PRORSV03 EQU   PROPROC2                                                 02398000
PRORPLC  EQU   PROPROC1                                                 02399000
PROCS    EQU   PROPROC1                                                 02400000
PROCA    EQU   PROPROC1                                                 02401000
PRORESPX EQU   PROPROC1                                                 02402000
PRODFASY EQU   PROPROC1                                                 02403000
PROXPOPT EQU   PROPROC1                                                 02404000
PROTRUNC EQU   PROPROC1                                                 02405000
PROASYIP EQU   PROPROC1                                                 02406000
DEVRSV03 EQU   ISTDEVCH+5                                               02407000
DEVPHYSA EQU   ISTDEVCH+4                                               02408000
DEVCSLPN EQU   DEVCHAR3                                                 02409000
DEVCSTCL EQU   DEVCHAR3                                                 02410000
DEVCCHEK EQU   DEVCHAR3                                                 02411000
DEVCATTN EQU   DEVCHAR3                                                 02412000
DEVCSWL  EQU   DEVFCCTL                                                 02413000
DEVCRVB  EQU   DEVFCCTL                                                 02414000
DEVCSSL  EQU   DEVFCCTL                                                 02415000
DEVCBSC  EQU   DEVFCCTL                                                 02416000
DEVMCODE EQU   ISTDEVCH+2                                               02417000
DEVCHAR2 EQU   DEVTCODE                                                 02418000
DEVRSV01 EQU   DEVCHAR                                                  02419000
DEVCCTL  EQU   DEVCHAR                                                  02420000
DEVNNSPT EQU   DEVCHAR                                                  02421000
DEVSPS   EQU   DEVCHAR                                                  02422000
DEVSUBND EQU   DEVCHAR                                                  02423000
DEVCONVR EQU   DEVCHAR                                                  02424000
DEVOTPUT EQU   DEVCHAR                                                  02425000
DEVINPUT EQU   DEVCHAR                                                  02426000
PABRPHA  EQU   PABRPHFG+1                                               02427000
PABNODQ  EQU   PABFLAGS                                                 02428000
PABINHBT EQU   PABFLAGS                                                 02429000
PABERLOK EQU   PABERRLK                                                 02430000
PABSSN   EQU   PABFLAGS                                                 02431000
PABDYNAM EQU   PABFLAGS                                                 02432000
PABNORPR EQU   PABFLAGS                                                 02433000
PABPRIOR EQU   PABFLAGS                                                 02434000
PABAPYP  EQU   PABFLAGS                                                 02435000
PABOFFST EQU   ISTPAB+8                                                 02436000
PABCHNGP EQU   PABCHAIN+1                                               02437000
PABRSV02 EQU   PABCHAIN                                                 02438000
PABRUNNG EQU   PABCHAIN                                                 02439000
PABRESET EQU   PABCHAIN                                                 02440000
PABUNCON EQU   PABCHAIN                                                 02441000
PABCDP   EQU   PABCHAIN                                                 02442000
PABRESCH EQU   PABCHAIN                                                 02443000
PABCHNG  EQU   PABCHAIN                                                 02444000
PABWEQP  EQU   PABWEQA+1                                                02445000
PABRSV01 EQU   PABWEQA                                                  02446000
PABWEQG  EQU   PABWEQA                                                  02447000
LOKXCL   EQU   @NM00013                                                 02448000
LOKPRY   EQU   @NM00013                                                 02449000
@NM00014 EQU   @NM00013                                                 02450000
@NM00012 EQU   LOKCHNG                                                  02451000
LOKCT    EQU   ISTLOK                                                   02452000
ZIBCHAIN EQU   ISTZIBUF                                                 02453000
FSBFDB   EQU   ISTFSB+32                                                02454000
FSBRSV01 EQU   FSBFSB+30                                                02455000
FSBTHCNT EQU   FSBFSB+28                                                02456000
FSBRLRSV EQU   FSBRLSTS                                                 02457000
FSBCFTX  EQU   FSBRLSTS                                                 02458000
FSBICNCB EQU   FSBMSGID                                                 02459000
FSBSSOC  EQU   FSBSS2                                                   02460000
FSBSSCC  EQU   FSBSS2                                                   02461000
FSBSSDC  EQU   FSBSS2                                                   02462000
FSBSSEC  EQU   FSBSS2                                                   02463000
FSBSSIR  EQU   FSBSS2                                                   02464000
FSBSSCR  EQU   FSBSS2                                                   02465000
@NM00005 EQU   FSBSS2                                                   02466000
@NM00004 EQU   FSBSS1                                                   02467000
FSBSSDE  EQU   FSBSS1                                                   02468000
FSBSSUS  EQU   FSBSS1                                                   02469000
@NM00003 EQU   FSBSS1                                                   02470000
FSBSOHI  EQU   FSBERC                                                   02471000
FSBLGI   EQU   FSBERC                                                   02472000
FSBLMRI  EQU   FSBFBMI                                                  02473000
FSBETI   EQU   FSBERC                                                   02474000
FSBEMI   EQU   FSBERC                                                   02475000
FSBEBI   EQU   FSBERC                                                   02476000
FSBECI   EQU   FSBERC                                                   02477000
FSBELI   EQU   FSBERC                                                   02478000
FSBXLCI  EQU   FSBXCODE                                                 02479000
FSBXFINS EQU   FSBXCODE                                                 02480000
FSBXNORM EQU   FSBXFSTS                                                 02481000
FSBSCODE EQU   FSBSYSRS                                                 02482000
FSBSPHSE EQU   FSBSYSRS                                                 02483000
FSBSERR  EQU   FSBSYSRS                                                 02484000
FSBCMD   EQU   FSBSEQ                                                   02485000
FSBDTRCE EQU   FSBFLAGS                                                 02486000
FSBASBTU EQU   FSBFLAGS                                                 02487000
FSBINPET EQU   FSBFLAGS                                                 02488000
FSBNONCB EQU   FSBFLAGS                                                 02489000
FSBLBIND EQU   FSBFLAGS                                                 02490000
FSBFFIND EQU   FSBFLAGS                                                 02491000
FSBACIND EQU   FSBFLAGS                                                 02492000
FSBRFIND EQU   FSBFLAGS                                                 02493000
FSBDAF   EQU   FSBCID+2                                                 02494000
FSBSAF   EQU   FSBCID                                                   02495000
FSBGATE  EQU   FSBFSBA                                                  02496000
FSBRSV02 EQU   FSBSFLGS                                                 02497000
FSBPGBUF EQU   FSBSFLGS                                                 02498000
FSBMNSDA EQU   FSBMNRCD                                                 02499000
FSBMNOA  EQU   FSBMNRCD                                                 02500000
FSBMNDIF EQU   FSBMNRCD                                                 02501000
FSBMNEOP EQU   FSBMNRCD                                                 02502000
FSBMNDNU EQU   FSBMNRCD                                                 02503000
FSBMNATN EQU   FSBMNRCD                                                 02504000
FSBMNRVI EQU   FSBMNRCD                                                 02505000
FSBMNELI EQU   FSBMNRCD                                                 02506000
BTUTEXT  EQU   ISTBTU+20                                                02507000
BTURSV02 EQU   BTUSYSTR                                                 02508000
BTUPHASE EQU   BTUSYSTR                                                 02509000
BTURSV01 EQU   BTUSYSTR                                                 02510000
BTUPAD   EQU   BTURH+3                                                  02511000
BTURH3   EQU   BTURH+2                                                  02512000
BTURH2   EQU   BTURH+1                                                  02513000
BTURH1   EQU   BTURH                                                    02514000
BTUZRT0B EQU   BTURQFLG+1                                               02515000
BTUZRT0A EQU   BTURQFLG+1                                               02516000
BTUZRT09 EQU   BTURQFLG+1                                               02517000
BTUZRT08 EQU   BTURQFLG+1                                               02518000
BTUZRT07 EQU   BTURQFLG                                                 02519000
BTUZRT06 EQU   BTURQFLG                                                 02520000
BTUZRT05 EQU   BTURQFLG                                                 02521000
BTUZRT04 EQU   BTURQFLG                                                 02522000
BTUZRT03 EQU   BTURQFLG                                                 02523000
BTUZRT02 EQU   BTURQFLG                                                 02524000
BTUZRT01 EQU   BTURQFLG                                                 02525000
BTUZRT00 EQU   BTURQFLG                                                 02526000
BTUCDF   EQU   BTUFID+1                                                 02527000
BTUSCF   EQU   BTUFID+1                                                 02528000
BTUPRY   EQU   BTUFID+1                                                 02529000
BTUASFL  EQU   BTUFID                                                   02530000
BTUPSFL  EQU   BTUFID                                                   02531000
BTUMPF   EQU   BTUFID                                                   02532000
BTUFIDNO EQU   BTUFID                                                   02533000
TH2SNF   EQU   ISTTH2+4                                                 02534000
TH2OAF   EQU   ISTTH2+3                                                 02535000
TH2DAF   EQU   ISTTH2+2                                                 02536000
TH2CDF   EQU   TH2FLAG1+1                                               02537000
TH2SEF   EQU   TH2FLAG1+1                                               02538000
TH2PYF   EQU   TH2FLAG1+1                                               02539000
TH2AFI   EQU   TH2FLAG1                                                 02540000
TH2PSI   EQU   TH2FLAG1                                                 02541000
TH2CMPLI EQU   TH2MPF                                                   02542000
TH2RHI   EQU   TH2MPF                                                   02543000
TH2FID   EQU   TH2FLAG1                                                 02544000
THDCF    EQU   ISTTH+8                                                  02545000
THSNF    EQU   ISTTH+6                                                  02546000
THOAF    EQU   ISTTH+4                                                  02547000
THDAF    EQU   ISTTH+2                                                  02548000
THCDF    EQU   THFLGB                                                   02549000
THSEF    EQU   THFLGB                                                   02550000
THPYF    EQU   THFLGB                                                   02551000
THAFI    EQU   THFLGA                                                   02552000
THPSI    EQU   THFLGA                                                   02553000
THCMPLI  EQU   THMPF                                                    02554000
THRHI    EQU   THMPF                                                    02555000
THFID    EQU   THFLAG1                                                  02556000
LHVDATA  EQU   ISTLH+4                                                  02557000
LHFUNCT  EQU   ISTLH+3                                                  02558000
@NM00002 EQU   ISTLH+2                                                  02559000
LHLEN    EQU   ISTLH                                                    02560000
BDURSV04 EQU   BDUFLAGS                                                 02561000
BDURTOE  EQU   BDUFLAGS                                                 02562000
BDUSTPR  EQU   BDUFLAGS                                                 02563000
BDURSV03 EQU   BDUFLAGS                                                 02564000
BDUALT   EQU   BDUFUNC                                                  02565000
BDUNACK  EQU   BDUFUNC                                                  02566000
BDUACK   EQU   BDUFUNC                                                  02567000
BDUTRPM  EQU   BDUFUNC                                                  02568000
BDUFBMI  EQU   BDUFUNC                                                  02569000
BDULDGPH EQU   BDUFUNC                                                  02570000
BDUHEADP EQU   BDUFUNC                                                  02571000
BDUSOH   EQU   BDUCHECK                                                 02572000
BDURSV01 EQU   BDUMODIF                                                 02573000
BDUMOD0  EQU   BDUMOD1                                                  02574000
LCPFTYPE EQU   LCPRPHA                                                  02575000
LCPRSTQH EQU   LCPLCCW                                                  02576000
LCPCLREP EQU   ISTLCPB+44                                               02577000
LCPUBFSB EQU   LCPFLCCW                                                 02578000
LCPRSV77 EQU   ISTLCPB+39                                               02579000
LCPLCCWC EQU   ISTLCPB+38                                               02580000
LCPRSV78 EQU   LCPFLG1                                                  02581000
LCPTRANS EQU   LCPFLG1                                                  02582000
LCPSTLB  EQU   LCPFLG1                                                  02583000
LCPREDRV EQU   LCPFLG1                                                  02584000
LCPDIRPT EQU   LCPFLG1                                                  02585000
LCPINTER EQU   LCPFLG1                                                  02586000
LCPRESET EQU   LCPFLG1                                                  02587000
LCPSTYPE EQU   ISTLCPB+36                                               02588000
LCPFSNCH EQU   ISTLCPB+34                                               02589000
LCPFOSN  EQU   ISTLCPB+32                                               02590000
LCPTLBAD EQU   ISTLCPB+28                                               02591000
LCPFDB2  EQU   LCPFDBA+1                                                02592000
LCPFDB1  EQU   LCPFDBA                                                  02593000
LCPDAF   EQU   LCPCID+2                                                 02594000
LCPSAF   EQU   LCPCID                                                   02595000
LCPLCCW1 EQU   ISTLCPB+12                                               02596000
LCPRRCNT EQU   LCPSEQ+1                                                 02597000
LCPRRCCT EQU   LCPSEQ                                                   02598000
LCPATOP  EQU   LCPFLAG2                                                 02599000
LCPFREE  EQU   LCPFLAG2                                                 02600000
LCPDSTAT EQU   LCPFLAG2                                                 02601000
LCPEXRES EQU   LCPFID0                                                  02602000
LCPZRIMM EQU   LCPTLBPI                                                 02603000
LCPRSTRT EQU   LCPFLAG2                                                 02604000
LCPASYN  EQU   LCPFLAG2                                                 02605000
LCPPRFLG EQU   LCPFLAG2                                                 02606000
LCPZMIRC EQU   LCPRUCNT                                                 02607000
LCPCHAI2 EQU   LCPCHAIN+1                                               02608000
LCPCHNG  EQU   LCPCHAI1                                                 02609000
LCPZRT0B EQU   LCPMNRCD                                                 02610000
LCPZRT0A EQU   LCPMNRCD                                                 02611000
LCPZRTL9 EQU   LCPZRT09                                                 02612000
LCPZRTL8 EQU   LCPZRT08                                                 02613000
LCPZRTL7 EQU   LCPZRT07                                                 02614000
LCPZRTL6 EQU   LCPZRT06                                                 02615000
LCPZRTL5 EQU   LCPZRT05                                                 02616000
LCPZRTL4 EQU   LCPZRT04                                                 02617000
LCPZRTL3 EQU   LCPZRT03                                                 02618000
LCPZRTL2 EQU   LCPZRT02                                                 02619000
LCPLNGTH EQU   ISTLCPB+1                                                02620000
LCPTYPE  EQU   ISTLCPB                                                  02621000
LCCWDATA EQU   ISTLCCW+4                                                02622000
LCCWCNT  EQU   ISTLCCW+2                                                02623000
LCCWACI  EQU   LCCWFLAG                                                 02624000
LCCWRFI  EQU   LCCWFLAG                                                 02625000
LCCWPER  EQU   LCCWLSI                                                  02626000
LCCWIDAT EQU   LCCWFLAG                                                 02627000
LCCWNTVC EQU   LCCWFLAG                                                 02628000
LCCWCKPT EQU   LCCWFLAG                                                 02629000
LCCWCC   EQU   LCCWFLAG                                                 02630000
LCCWTYPE EQU   LCCWCTL                                                  02631000
LCCWMODE EQU   LCCWCTL                                                  02632000
LCCWSOP  EQU   LCCWRWOP                                                 02633000
@NM00001 EQU   LCCWRWOP                                                 02634000
LCCWSD   EQU   LCCWOP                                                   02635000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02636000
@RC00462 EQU   @RC00461                                                 02637000
@RT00569 EQU   ISTA0026                                                 02638000
@ENDDATA EQU   *                                                        02639000
         END   ISTZHFAN,(C'PLS1727',0603,75130)                         02640000
