         TITLE 'ISTZBMJA: 3270 LOCAL TEST LCCW PROCESSOR               *00001000
                        '                                               00002000
ISTZBMJA CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZBMJA  75.136'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
* * * * * * * * * * * * * * * * *                                       00011000
* GENERATED CODE TO ENSURE THAT *                                       00012000
* THE COMMON ENTRY POINT IS     *                                       00013000
* IDENTIFIED                    *                                       00014000
ISTZBMJA CSECT                  *                                       00015000
         ENTRY ISTZBCJA         *                                       00016000
ISTZBCJA EQU   ISTZBMJA         *                                       00017000
* * * * * * * * * * * * * * * * *                                       00018000
*                                                                  0469 00019000
*/* TPZSAVE (7,12,14) BASE                                           */ 00020000
*                                                                  0469 00021000
*   DO;                                                            0469 00022000
*     RFY                                                          0470 00023000
*      (GPR01P,                                                    0470 00024000
*       GPR12P,                                                    0470 00025000
*       GPR13P,                                                    0470 00026000
*       GPR14P) RSTD;                                              0470 00027000
*     GEN(PRINT OFF);                                              0471 00028000
*                                                                  0471 00029000
         PRINT OFF                                                      00030000
*/* ATBUILD (ISTZSAVE)                                               */ 00031000
*/* END OF ATBUILD                                                   */ 00032000
*                                                                  0472 00033000
*     GEN(PRINT ON);                                               0472 00034000
         PRINT ON                                                       00035000
*     RFY                                                          0473 00036000
*       ISTZSAVE BASED(GPR13P);                                    0473 00037000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0474 00038000
         STM   7,12,ZSAZSVVR+0(13)                                      00039000
*     GEN SETS(GPR12P);                                            0475 00040000
         BALR  GPR12P,0                                                 00041000
@TSTART  DS    0H                                                       00042000
         USING @TSTART,GPR12P                                           00043000
*     ZSAZSVRR=GPR14P;                                             0476 00044000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0476 00045000
*     GPR13P=ZSAZSVFC;                                             0477 00046000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0477 00047000
*     RFY                                                          0478 00048000
*      (GPR01P) UNRSTD;                                            0478 00049000
*     RFY                                                          0479 00050000
*      (GPR14P) UNRSTD;                                            0479 00051000
*   END;                                                           0480 00052000
*                                                                  0480 00053000
*/* END TPZSAVE                                                      */ 00054000
*                                                                  0481 00055000
*   LDNZF006=ON;                    /* SET TEST FLAG ON              */ 00056000
         L     @08,LDNZF006-3(,PTRLDNCB)                           0481 00057000
@GL00001 LR    @02,@08                                             0481 00058000
         O     @02,@CF04111                                        0481 00059000
         CS    @08,@02,LDNZF006-3(PTRLDNCB)                        0481 00060000
         BNE   @GL00001                                            0481 00061000
*   ZLBSAF=FMCSAF;                  /* MOVE SAF FROM FMCB INTO BUFFER*/ 00062000
*                                                                  0482 00063000
         MVC   ZLBSAF(2,PTRZLB),FMCSAF(PTRFMCB)                    0482 00064000
*   /*****************************************************************/ 00065000
*   /*                                                               */ 00066000
*   /* CODE REMOVED PER VS3                                  @ZM31216*/ 00067000
*   /*                                                               */ 00068000
*   /*****************************************************************/ 00069000
*                                                                  0483 00070000
*/*  REQSTORE CBID(TCCW)RPH(RPHPTR)CLEAR(YES)                        */ 00071000
*                                                                  0483 00072000
*   DO;                                                            0483 00073000
*                                                                  0483 00074000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 00075000
*/* END OF ATBUILD                                                   */ 00076000
*                                                                  0484 00077000
*     RFY                                                          0484 00078000
*      (GPR02P,                                                    0484 00079000
*       GPR03P,                                                    0484 00080000
*       GPR04P,                                                    0484 00081000
*       GPR15P) RSTD;                                              0484 00082000
*     RFY                                                          0485 00083000
*      (GPR01P) RSTD;                                              0485 00084000
*     GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);           0486 00085000
           STM GPR02P,GPR13P,RPHWORK(GPR01P)                            00086000
*     RFY                                                          0487 00087000
*      (GPR01P) UNRSTD;                                            0487 00088000
*     DO;                           /* LISATCVT                    0488 00089000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00090000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 00091000
         L     GPR15P,ATCLCPTR                                     0489 00092000
*     END;                          /* LISATCVT                      */ 00093000
*     GPR02P=GPR15P->ATCBPDA|'80000000'X;                          0491 00094000
         L     GPR02P,ATCBPDA(,GPR15P)                             0491 00095000
         O     GPR02P,@CF01542                                     0491 00096000
*     DCL                                                          0492 00097000
*       1 FMZA0018 FIXED(31) STATIC LOCAL,                         0492 00098000
*        2 * FIXED(8) INIT(184),                                   0492 00099000
*        2 * PTR(24) INIT(0);                                      0492 00100000
*     GPR03F=FMZA0018;                                             0493 00101000
         L     GPR03F,FMZA0018                                     0493 00102000
*     GPR04F=36;                                                   0494 00103000
         LA    GPR04F,36                                           0494 00104000
*     GPR15P=GPR15P->ATCSMRQ;                                      0495 00105000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0495 00106000
*     DCL                                                          0496 00107000
*       FMZL0018 BASED(GPR15P) LABEL VALUERANGE(*);                0496 00108000
*     CALL FMZL0018;                                               0497 00109000
         BALR  @14,@15                                             0497 00110000
*     GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);           0498 00111000
           LM GPR02P,GPR13P,RPHWORK(GPR01P)                             00112000
*     RFY                                                          0499 00113000
*      (GPR02P,                                                    0499 00114000
*       GPR03P,                                                    0499 00115000
*       GPR04P,                                                    0499 00116000
*       GPR15P) UNRSTD;                                            0499 00117000
*   END;                            /* ******** END OF REQSTORE    0500 00118000
*                                      EXPANSION GET STORAGE FOR A 0500 00119000
*                                      TCCW                  @ZM32420*/ 00120000
*   RFY                                                            0501 00121000
*     RETCDE RSTD;                                                 0501 00122000
*   IF RETCDE^=8 THEN                                              0502 00123000
         C     RETCDE,@CF00035                                     0502 00124000
         BNE   @RT00502                                            0502 00125000
*     ;                             /* IF STORAGE AVAILABLE, CONTINUE*/ 00126000
*   ELSE                            /* IF STORAGE NOT AVAILABLE      */ 00127000
*/*  TPWAIT                                                          */ 00128000
*                                                                  0504 00129000
*     DO;                           /* BEGIN TPWAIT GENERATION       */ 00130000
*       RFY                                                        0505 00131000
*        (GPR01P,                                                  0505 00132000
*         GPR14P,                                                  0505 00133000
*         GPR15P) RSTD;                                            0505 00134000
*       RFY                                                        0506 00135000
*        (GPR00P) RSTD;                                            0506 00136000
*       GEN(STM   GPR00P,GPR15P,RPHWORK(GPR01P))                   0507 00137000
*       REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);                  0507 00138000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            00139000
*       RFY                                                        0508 00140000
*        (GPR00P) UNRSTD;                                          0508 00141000
*       GPR15P=ADDR(LHAA0037);                                     0509 00142000
         LA    GPR15P,LHAA0037                                     0509 00143000
*       GPR14P=0;                                                  0510 00144000
         SLR   GPR14P,GPR14P                                       0510 00145000
*       GPR15P=GPR15P&'00FFFFFF'X;                                 0511 00146000
         N     GPR15P,@CF04090                                     0511 00147000
*       GPR15P=GPR15P|RPHWT1;                                      0512 00148000
         O     GPR15P,@CF01502                                     0512 00149000
*       CS(GPR14P,GPR15P,GPR01P->RPHRESMA);                        0513 00150000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         0513 00151000
*       BC(7,LHAB0037);                                            0514 00152000
*                                                                  0514 00153000
         BC    7,LHAB0037                                          0514 00154000
*/* TPEXIT  NONE                                                     */ 00155000
*                                                                  0515 00156000
*       DO;                                                        0515 00157000
*         RESPECIFY                                                0516 00158000
*           GPR15P RSTD;                                           0516 00159000
*                                                                  0516 00160000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */ 00161000
*/* END OF ATBUILD                                                   */ 00162000
*                                                                  0517 00163000
*         DO;                       /* LISATCVT                    0517 00164000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00165000
*           GPR15P=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 00166000
         L     GPR15P,ATCLCPTR                                     0518 00167000
*         END;                      /* LISATCVT                      */ 00168000
*         RESPECIFY                                                0520 00169000
*           GPR00F RSTD;                                           0520 00170000
*         GPR00F=0;                 /* SET PARAMETER REGISTER TO 0   */ 00171000
         SLR   GPR00F,GPR00F                                       0521 00172000
*         GPR15P=GPR15P->ATCAP31;                                  0522 00173000
         L     GPR15P,ATCAP31(,GPR15P)                             0522 00174000
*         DCL                                                      0523 00175000
*           FMZL0042 BASED(GPR15P) LABEL VALUERANGE(*);            0523 00176000
*         CALL FMZL0042;                                           0524 00177000
         BALR  @14,@15                                             0524 00178000
*         RESPECIFY                                                0525 00179000
*          (GPR00F,                                                0525 00180000
*           GPR15P) UNRSTD;                                        0525 00181000
*       END;                        /* **** END OF TPEXIT            */ 00182000
*LHAB0037:                                                         0527 00183000
*       ;                                                          0527 00184000
LHAB0037 DS    0H                                                  0528 00185000
*       GPR01P->RPHRESMA=0;                                        0528 00186000
         SLR   @08,@08                                             0528 00187000
         ST    @08,RPHRESMA(,GPR01P)                               0528 00188000
*       RFY                                                        0529 00189000
*        (GPR00P) RSTD;                                            0529 00190000
*LHAA0037:                                                         0530 00191000
*       ;                                                          0530 00192000
LHAA0037 DS    0H                                                  0531 00193000
*       GEN(LM    GPR00P,GPR15P,RPHWORK(GPR01P))                   0531 00194000
*       REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);                  0531 00195000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            00196000
*       RFY                                                        0532 00197000
*        (GPR00P,                                                  0532 00198000
*         GPR01P,                                                  0532 00199000
*         GPR14P,                                                  0532 00200000
*         GPR15P) UNRSTD;                                          0532 00201000
*     END;                          /* ****END OF TPWAIT WAIT FOR IT    00202000
*                                      & PROCEED NORMALLY            */ 00203000
*   TCCWPTR=RPHSRPRM+(ADDR(TCCTCCW)-ADDR(ISTTCCW));/* GET ADDRESS OF    00204000
*                                      TCCW STORAGE OBTAINED @ZM31482*/ 00205000
@RT00502 L     @14,RPHSRPRM(,RPHPTR)                               0534 00206000
         LA    TCCWPTR,TCCTCCW(,@14)                               0534 00207000
         SLR   TCCWPTR,@14                                         0534 00208000
         ALR   @14,TCCWPTR                                         0534 00209000
         LR    TCCWPTR,@14                                         0534 00210000
*   TCCWTCB=NCBTSKID;               /* INITIALIZE TCCW               */ 00211000
         L     @14,NCBTSKID(,PTRLDNCB)                             0535 00212000
         ST    @14,TCCWTCB(,TCCWPTR)                               0535 00213000
*   TCCWOPTN=TCCWXLAT;                                             0536 00214000
         MVI   TCCWOPTN(TCCWPTR),X'00'                             0536 00215000
*   TCCWUCB=LDNUCBAD;               /* INITIALIZE UCB ADDR IN TCCW   */ 00216000
*                                                                  0537 00217000
         MVC   TCCWUCB(3,TCCWPTR),LDNUCBAD+1(PTRLDNCB)             0537 00218000
*   /*****************************************************************/ 00219000
*   /*                                                               */ 00220000
*   /* GET TWO FIXED BUFFERS TO BE USED BY IOS AS WORK AREAS. ALSO   */ 00221000
*   /* CHAIN THEM TO SIMPLIFY THEIR RELSTORE IN ISTZIMQA     @ZM31482*/ 00222000
*   /*                                                               */ 00223000
*   /*****************************************************************/ 00224000
*                                                                  0538 00225000
*   RFY                                                            0538 00226000
*    (SAVEADDR,                                                    0538 00227000
*     COUNT) RSTD;                  /* NEED REGS FOR FOLLOWING DO  0538 00228000
*                                                            @ZM31482*/ 00229000
*   DO COUNT=1 TO 2;                /* GET TWO BUFFERS FOR IOS     0539 00230000
*                                                            @ZM31482*/ 00231000
*                                                                  0539 00232000
         LA    COUNT,1                                             0539 00233000
@DL00539 DS    0H                                                  0540 00234000
*     /***************************************************************/ 00235000
*     /*                                                             */ 00236000
*     /* REQSTORE CBID(DNCB)CLEAR(YES)RPH(RPHPTR)                    */ 00237000
*     /*                                                             */ 00238000
*     /***************************************************************/ 00239000
*                                                                  0540 00240000
*     DO;                                                          0540 00241000
*                                                                  0540 00242000
*/* ATBUILD (ISTDYPAB,ISTATCVT,ISTRPH)                               */ 00243000
*/* END OF ATBUILD                                                   */ 00244000
*                                                                  0541 00245000
*       RFY                                                        0541 00246000
*        (GPR02P,                                                  0541 00247000
*         GPR03P,                                                  0541 00248000
*         GPR04P,                                                  0541 00249000
*         GPR15P) RSTD;                                            0541 00250000
*       RFY                                                        0542 00251000
*        (GPR01P) RSTD;                                            0542 00252000
*       GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);         0543 00253000
           STM GPR02P,GPR13P,RPHWORK(GPR01P)                            00254000
*       RFY                                                        0544 00255000
*        (GPR01P) UNRSTD;                                          0544 00256000
*       DO;                         /* LISATCVT                    0545 00257000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00258000
*         GPR15P=ATCLCPTR;          /* SET UP ATCVT POINTER          */ 00259000
         L     GPR15P,ATCLCPTR                                     0546 00260000
*       END;                        /* LISATCVT                      */ 00261000
*       GPR02P=GPR15P->ATCBPDA|'80000000'X;                        0548 00262000
         L     GPR02P,ATCBPDA(,GPR15P)                             0548 00263000
         O     GPR02P,@CF01542                                     0548 00264000
*       DCL                                                        0549 00265000
*         1 FMZA0052 FIXED(31) STATIC LOCAL,                       0549 00266000
*          2 * FIXED(8) INIT(184),                                 0549 00267000
*          2 * PTR(24) INIT(0);                                    0549 00268000
*       GPR03F=FMZA0052;                                           0550 00269000
         L     GPR03F,FMZA0052                                     0550 00270000
*       GPR04F=26;                                                 0551 00271000
         LA    GPR04F,26                                           0551 00272000
*       GPR15P=GPR15P->ATCSMRQ;                                    0552 00273000
         L     GPR15P,ATCSMRQ(,GPR15P)                             0552 00274000
*       DCL                                                        0553 00275000
*         FMZL0052 BASED(GPR15P) LABEL VALUERANGE(*);              0553 00276000
*       CALL FMZL0052;                                             0554 00277000
         BALR  @14,@15                                             0554 00278000
*       GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);         0555 00279000
           LM GPR02P,GPR13P,RPHWORK(GPR01P)                             00280000
*       RFY                                                        0556 00281000
*        (GPR02P,                                                  0556 00282000
*         GPR03P,                                                  0556 00283000
*         GPR04P,                                                  0556 00284000
*         GPR15P) UNRSTD;                                          0556 00285000
*     END;                          /* ******** END OF REQSTORE    0557 00286000
*                                      EXPANSION NEED BUFFERS THE  0557 00287000
*                                      SIZE OF A DNCB        @ZM32420*/ 00288000
*     IF RETCDE=8 THEN              /* WAS STORAGE AVAILABLE ?     0558 00289000
*                                                            @ZM31482*/ 00290000
         C     RETCDE,@CF00035                                     0558 00291000
         BNE   @RF00558                                            0558 00292000
*/*  TPWAIT                                                          */ 00293000
*                                                                  0559 00294000
*       DO;                         /* BEGIN TPWAIT GENERATION       */ 00295000
*         RFY                                                      0560 00296000
*          (GPR01P,                                                0560 00297000
*           GPR14P,                                                0560 00298000
*           GPR15P) RSTD;                                          0560 00299000
*         RFY                                                      0561 00300000
*          (GPR00P) RSTD;                                          0561 00301000
*         GEN(STM   GPR00P,GPR15P,RPHWORK(GPR01P))                 0562 00302000
*         REFS(GPR00P,GPR01P,GPR15P) SETS(RPHWORK);                0562 00303000
         STM   GPR00P,GPR15P,RPHWORK(GPR01P)                            00304000
*         RFY                                                      0563 00305000
*          (GPR00P) UNRSTD;                                        0563 00306000
*         GPR15P=ADDR(LHAA0071);                                   0564 00307000
         LA    GPR15P,LHAA0071                                     0564 00308000
*         GPR14P=0;                                                0565 00309000
         SLR   GPR14P,GPR14P                                       0565 00310000
*         GPR15P=GPR15P&'00FFFFFF'X;                               0566 00311000
         N     GPR15P,@CF04090                                     0566 00312000
*         GPR15P=GPR15P|RPHWT1;                                    0567 00313000
         O     GPR15P,@CF01502                                     0567 00314000
*         CS(GPR14P,GPR15P,GPR01P->RPHRESMA);                      0568 00315000
         CS    GPR14P,@15,RPHRESMA(GPR01P)                         0568 00316000
*         BC(7,LHAB0071);                                          0569 00317000
*                                                                  0569 00318000
         BC    7,LHAB0071                                          0569 00319000
*/* TPEXIT  NONE                                                     */ 00320000
*                                                                  0570 00321000
*         DO;                                                      0570 00322000
*           RESPECIFY                                              0571 00323000
*             GPR15P RSTD;                                         0571 00324000
*                                                                  0571 00325000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT)                               */ 00326000
*/* END OF ATBUILD                                                   */ 00327000
*                                                                  0572 00328000
*           DO;                     /* LISATCVT                    0572 00329000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00330000
*             GPR15P=ATCLCPTR;      /* SET UP ATCVT POINTER          */ 00331000
         L     GPR15P,ATCLCPTR                                     0573 00332000
*           END;                    /* LISATCVT                      */ 00333000
*           RESPECIFY                                              0575 00334000
*             GPR00F RSTD;                                         0575 00335000
*           GPR00F=0;               /* SET PARAMETER REGISTER TO 0   */ 00336000
         SLR   GPR00F,GPR00F                                       0576 00337000
*           GPR15P=GPR15P->ATCAP31;                                0577 00338000
         L     GPR15P,ATCAP31(,GPR15P)                             0577 00339000
*           DCL                                                    0578 00340000
*             FMZL0076 BASED(GPR15P) LABEL VALUERANGE(*);          0578 00341000
*           CALL FMZL0076;                                         0579 00342000
         BALR  @14,@15                                             0579 00343000
*           RESPECIFY                                              0580 00344000
*            (GPR00F,                                              0580 00345000
*             GPR15P) UNRSTD;                                      0580 00346000
*         END;                      /* **** END OF TPEXIT            */ 00347000
*LHAB0071:                                                         0582 00348000
*         ;                                                        0582 00349000
LHAB0071 DS    0H                                                  0583 00350000
*         GPR01P->RPHRESMA=0;                                      0583 00351000
         SLR   @00,@00                                             0583 00352000
         ST    @00,RPHRESMA(,GPR01P)                               0583 00353000
*         RFY                                                      0584 00354000
*          (GPR00P) RSTD;                                          0584 00355000
*LHAA0071:                                                         0585 00356000
*         ;                                                        0585 00357000
LHAA0071 DS    0H                                                  0586 00358000
*         GEN(LM    GPR00P,GPR15P,RPHWORK(GPR01P))                 0586 00359000
*         REFS(RPHWORK,GPR01P) SETS(GPR00P,GPR15P);                0586 00360000
         LM    GPR00P,GPR15P,RPHWORK(GPR01P)                            00361000
*         RFY                                                      0587 00362000
*          (GPR00P,                                                0587 00363000
*           GPR01P,                                                0587 00364000
*           GPR14P,                                                0587 00365000
*           GPR15P) UNRSTD;                                        0587 00366000
*       END;                        /* ****END OF TPWAIT NO, WAIT FOR   00367000
*                                      SOME                  @ZM31482*/ 00368000
*     ELSE                                                         0589 00369000
*       ;                           /* YES, CONTINUE         @ZM31482*/ 00370000
@RF00558 DS    0H                                                  0590 00371000
*     IF COUNT=1 THEN               /* FIRST BUFFER ?        @ZM31482*/ 00372000
         C     COUNT,@CF00066                                      0590 00373000
         BNE   @RF00590                                            0590 00374000
*       DO;                         /* YES, MAKE IT BEB LIST @ZM31482*/ 00375000
*         TCCWBEB=ADDR(WKABUFF);    /* PUT BEB ADDR IN TCCW  @ZM31482*/ 00376000
         L     @14,RPHSRPRM(,RPHPTR)                               0592 00377000
         LA    @00,WKABUFF(,@14)                                   0592 00378000
         ST    @00,TCCWBEB(,TCCWPTR)                               0592 00379000
*         SAVEADDR=RPHSRPRM;        /* SAVE ADDR FOR CHAINING      0593 00380000
*                                                            @ZM31482*/ 00381000
         LR    SAVEADDR,@14                                        0593 00382000
*       END;                        /* BEB LIST OBTAINED     @ZM31482*/ 00383000
*     ELSE                          /* SECOND AREA IS FOR    @ZM31482*/ 00384000
*       DO;                         /* FIX LIST              @ZM31482*/ 00385000
         B     @RC00590                                            0595 00386000
@RF00590 DS    0H                                                  0596 00387000
*         TCCWFIX=ADDR(WKABUFF);    /* PUT FIXLIST ADDR IN TCCW    0596 00388000
*                                                            @ZM31482*/ 00389000
         L     @14,RPHSRPRM(,RPHPTR)                               0596 00390000
         LA    @00,WKABUFF(,@14)                                   0596 00391000
         ST    @00,TCCWFIX(,TCCWPTR)                               0596 00392000
*         SAVEADDR->WKACHAIN=RPHSRPRM;/* CHAIN TO FIRST AREA OBTAINED   00393000
*                                      TO SIMPLIFY RELSTORE IN IMQA     00394000
*                                                            @ZM31482*/ 00395000
         ST    @14,WKACHAIN(,SAVEADDR)                             0597 00396000
*       END;                        /* FIX LIST OBTAINED     @ZM31482*/ 00397000
*   END;                            /* BOTH BUFFERS OBTAINED @ZM31482*/ 00398000
@RC00590 AL    COUNT,@CF00066                                      0599 00399000
         C     COUNT,@CF00107                                      0599 00400000
         BNH   @DL00539                                            0599 00401000
*   RFY                                                            0600 00402000
*    (SAVEADDR,                                                    0600 00403000
*     COUNT) UNRSTD;                /* RETURN TO COMPILER    @ZM31482*/ 00404000
*   TCCWFVC=LCPNXLCW->LCCWDATA;     /* PUT VIRTUAL CP ADDR IN TCCW 0601 00405000
*                                                            @ZM31482*/ 00406000
         L     @14,LCPNXLCW(,PTRLCP)                               0601 00407000
         L     @14,LCCWDATA(,@14)                                  0601 00408000
         ST    @14,TCCWFVC(,TCCWPTR)                               0601 00409000
*   SAVEAREG=SAVEAREG+ZSAZSVVA;     /* NEED 5 WORD SA FOR VSETLOCK 0602 00410000
*                                                            @ZM32427*/ 00411000
         AL    SAVEAREG,@CF00035                                   0602 00412000
*/*VSETLCK  (15,OBTAIN,LOCAL,(LOCAL,ISTZBMJA(BMJAUNLK));)            */ 00413000
*                                                                  0603 00414000
*BMJALOCK:                                                         0603 00415000
*   DO;                             /* DECLARE AND RESTRICT REGS   0603 00416000
*                                      2,10,11,12,13,14, AND 15      */ 00417000
BMJALOCK DS    0H                                                  0604 00418000
*     RFY                                                          0604 00419000
*      (GPR02P,                                                    0604 00420000
*       GPR10P,                                                    0604 00421000
*       GPR11P,                                                    0604 00422000
*       GPR14P,                                                    0604 00423000
*       GPR15P) RSTD;               /* SAVE REGS 2 AND 10 THRU 14    */ 00424000
*     GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);         0605 00425000
         STM   GPR10F,GPR12F,0(GPR13P)                                  00426000
         ST    GPR14F,12(GPR13P)                                        00427000
         ST    GPR02F,16(GPR13P)                                        00428000
*                                   /* INVOKE MODESET TO CHANGE PSW     00429000
*                                      PROTECTION KEY TO 0           */ 00430000
*     GEN SETS(2);                                                 0606 00431000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      00432000
*     GPR10P=GPR13P;                /* PUT SAVE AREA ADDR IN R 10  0607 00433000
*                                      INVOKE OS/VS SETLOCK MACRO    */ 00434000
         LR    GPR10P,GPR13P                                       0607 00435000
*     GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);                   0608 00436000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        *00437000
               RELATED=(LOCAL,ISTZBMJA(BMJAUNLK));                      00438000
*     GPR15P=GPR13P;                /* PUT RETURN CODE IN R 15 INVOKE   00439000
*                                      MODESET MACRO TO              */ 00440000
         LR    GPR15P,GPR13P                                       0609 00441000
*     DO;                           /* RESTORE PSW PROTECTION KEY    */ 00442000
*       GEN SETS(2);                                               0611 00443000
         MODESET KEYADDR=(2),WORKREG=2                                  00444000
*     END;                          /* RESTORE REGISTERS             */ 00445000
*     GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,GPR12F,GPR13F,GPR14F,  00446000
*         GPR02F);                                                 0613 00447000
         LR    GPR13F,GPR10F                                            00448000
         LM    GPR10F,GPR12F,0(GPR13P)                                  00449000
         L     GPR14F,12(GPR13P)                                        00450000
         L     GPR02F,16(GPR13P)                                        00451000
*     IF GPR15F=4 THEN                                             0614 00452000
         C     GPR15F,@CF00043                                     0614 00453000
         BNE   @RF00614                                            0614 00454000
*       GPR15F=0;                                                  0615 00455000
         SLR   GPR15F,GPR15F                                       0615 00456000
*     RFY                                                          0616 00457000
*      (GPR02P,                                                    0616 00458000
*       GPR10P,                                                    0616 00459000
*       GPR11P,                                                    0616 00460000
*       GPR14P,                                                    0616 00461000
*       GPR15P) UNRSTD;                                            0616 00462000
@RF00614 DS    0H                                                  0617 00463000
*   END;                            /* BMJALOCK:VSETLCK ...MEMORY  0617 00464000
*                                      LOCK                  @ZM32427*/ 00465000
*   SAVEAREG=SAVEAREG-ZSAZSVVA;     /* RESTORE SA PTR        @ZM32427*/ 00466000
         SL    SAVEAREG,@CF00035                                   0618 00467000
*   IF RETCDE^=SUCCESS THEN         /* IF VSETLCK FAILED     @ZM32427*/ 00468000
         LTR   RETCDE,RETCDE                                       0619 00469000
         BZ    @RF00619                                            0619 00470000
*     LCPZRT00=ON;                  /* SET LOGICAL ERROR BIT @ZM32427*/ 00471000
         OI    LCPZRT00(PTRLCP),B'10000000'                        0620 00472000
*   ELSE                            /* VSETLCK WORKED OK     @ZM32427*/ 00473000
*     DO;                           /* CONTINUE NORMALLY     @ZM32427*/ 00474000
         B     @RC00619                                            0621 00475000
@RF00619 DS    0H                                                  0622 00476000
*       RFY                                                        0622 00477000
*         XLATPTR RSTD;             /* ENTRY POINT FOR XLATE RTN   0622 00478000
*                                                            @ZM31482*/ 00479000
*       XLATPTR=CVTIXAVL->IOCTCCW;  /* GET ADDR OF XLATE ROUTINE   0623 00480000
*                                                            @ZM31482*/ 00481000
         L     @08,CVTPTR                                          0623 00482000
         L     @08,CVTIXAVL(,@08)                                  0623 00483000
         L     XLATPTR,IOCTCCW(,@08)                               0623 00484000
*       RFY                                                        0624 00485000
*        (SAVEADDR,                                                0624 00486000
*         PLISTPTR) RSTD;           /* MUST SAVE RPHPTR IN SAVEADDR     00487000
*                                      BEFORE LOADING PLISTPTR WITH     00488000
*                                      PARM ADDR (THE TCCW)  @ZM31482*/ 00489000
*       SAVEADDR=RPHPTR;            /* SAVE RPH ADDR         @ZM31482*/ 00490000
         LR    SAVEADDR,RPHPTR                                     0625 00491000
*       PLISTPTR=TCCWPTR;           /* SET R1 = PARM LIST ADDR     0626 00492000
*                                                            @ZM31482*/ 00493000
         LR    PLISTPTR,TCCWPTR                                    0626 00494000
*       ZLBTCP=TCCWPTR;             /* SET TCCW PTR FOR OTHERS     0627 00495000
*                                                            @ZM31482*/ 00496000
         ST    TCCWPTR,ZLBTCP(,PTRZLB)                             0627 00497000
*       RFY                                                        0628 00498000
*         SAVEKEY RSTD;             /* TO SAVE KEY AFTER MODESET   0628 00499000
*                                                            @ZM31482*/ 00500000
*       GEN SETS(SAVEKEY) REFS(SAVEKEY);                           0629 00501000
*                                 /* GET INTO KEY ZERO       @ZM31482*/ 00502000
         IPK            SAVE THE CURRENT PSW KEY IN R2         @ZM30785 00503000
         SPKA 0(0)      SET THE PSW KEY TO ZERO                @ZM30785 00504000
*       CALL IECVTCCW;              /* INVOKE XLATE RTN              */ 00505000
         BALR  @14,@15                                             0630 00506000
*       RFY                                                        0631 00507000
*         XLATPTR UNRSTD;                                          0631 00508000
*       GEN REFS(SAVEKEY);                                         0632 00509000
*                                                          /*@ZM30785*/ 00510000
         SPKA 0(2)      RESTORE PSW KEY TO ORIGINAL            @ZM30785 00511000
*       RFY                                                        0633 00512000
*         PTRATCVT RSTD;            /* TO RESTORE ATCVT PTR  @ZM31482*/ 00513000
*       DO;                         /* LISATCVT                    0634 00514000
*                                      CVTBASE(PAGEABLE,(PTRATCVT))  */ 00515000
*         PTRATCVT=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 00516000
         L     PTRATCVT,ATCLCPTR                                   0635 00517000
*       END;                        /* LISATCVT              @ZM30785*/ 00518000
*                                                                  0636 00519000
*       /*************************************************************/ 00520000
*       /*                                                           */ 00521000
*       /* SET R2 BACK UP AS ATCVT POINTER                   @ZM30785*/ 00522000
*       /*                                                           */ 00523000
*       /*************************************************************/ 00524000
*                                                                  0637 00525000
*       RPHPTR=SAVEADDR;            /* RESTORE R1 TO ORIGINAL      0637 00526000
*                                                            @ZM30786*/ 00527000
         LR    RPHPTR,SAVEADDR                                     0637 00528000
*       SAVEAREG=SAVEAREG+ZSAZSVVA; /* NEED 5 WORD SA FOR VSETLOCK 0638 00529000
*                                                            @ZM32427*/ 00530000
         AL    SAVEAREG,@CF00035                                   0638 00531000
*/*VSETLCK  (15,RELEASE,LOCAL,(LOCAL,ISTZBMJA(BMJALOCK));)           */ 00532000
*                                                                  0639 00533000
*BMJAUNLK:                                                         0639 00534000
*       DO;                         /* DECLARE AND RESTRICT REGS   0639 00535000
*                                      2,10,11,12,13,14, AND 15      */ 00536000
BMJAUNLK DS    0H                                                  0640 00537000
*         RFY                                                      0640 00538000
*          (GPR02P,                                                0640 00539000
*           GPR10P,                                                0640 00540000
*           GPR11P,                                                0640 00541000
*           GPR14P,                                                0640 00542000
*           GPR15P) RSTD;           /* SAVE REGS 2 AND 10 THRU 14    */ 00543000
*         GEN REFS(GPR02F,GPR10F,GPR11F,GPR12F,GPR14F,GPR13P);     0641 00544000
         STM   GPR10F,GPR12F,0(GPR13P)                                  00545000
         ST    GPR14F,12(GPR13P)                                        00546000
         ST    GPR02F,16(GPR13P)                                        00547000
*                                   /* INVOKE MODESET TO CHANGE PSW     00548000
*                                      PROTECTION KEY TO 0           */ 00549000
*         GEN SETS(2);                                             0642 00550000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      00551000
*         GPR10P=GPR13P;            /* PUT SAVE AREA ADDR IN R 10  0643 00552000
*                                      INVOKE OS/VS SETLOCK MACRO    */ 00553000
         LR    GPR10P,GPR13P                                       0643 00554000
*         GEN REFS(GPR13P,PSALITA,FLC) SETS(GPR12F);               0644 00555000
         SETLOCK RELEASE,TYPE=LOCAL,                                   *00556000
               RELATED=(LOCAL,ISTZBMJA(BMJALOCK));                      00557000
*         GPR15P=GPR13P;            /* PUT RETURN CODE IN R 15 INVOKE   00558000
*                                      MODESET MACRO TO              */ 00559000
         LR    GPR15P,GPR13P                                       0645 00560000
*         DO;                       /* RESTORE PSW PROTECTION KEY    */ 00561000
*           GEN SETS(2);                                           0647 00562000
         MODESET KEYADDR=(2),WORKREG=2                                  00563000
*         END;                      /* RESTORE REGISTERS             */ 00564000
*         GEN REFS(GPR10F,GPR13P) SETS(GPR10F,GPR11F,GPR12F,GPR13F,     00565000
*             GPR14F,GPR02F);                                      0649 00566000
         LR    GPR13F,GPR10F                                            00567000
         LM    GPR10F,GPR12F,0(GPR13P)                                  00568000
         L     GPR14F,12(GPR13P)                                        00569000
         L     GPR02F,16(GPR13P)                                        00570000
*         IF GPR15F=4 THEN                                         0650 00571000
         C     GPR15F,@CF00043                                     0650 00572000
         BNE   @RF00650                                            0650 00573000
*           GPR15F=0;                                              0651 00574000
         SLR   GPR15F,GPR15F                                       0651 00575000
*         RFY                                                      0652 00576000
*          (GPR02P,                                                0652 00577000
*           GPR10P,                                                0652 00578000
*           GPR11P,                                                0652 00579000
*           GPR14P,                                                0652 00580000
*           GPR15P) UNRSTD;                                        0652 00581000
@RF00650 DS    0H                                                  0653 00582000
*       END;                        /* BMJAUNLK:VSETLCK ...MEMORY  0653 00583000
*                                      LOCK                  @ZM32427*/ 00584000
*       SAVEAREG=SAVEAREG-ZSAZSVVA; /* RESTORE SA POINTER    @ZM32427*/ 00585000
         SL    SAVEAREG,@CF00035                                   0654 00586000
*       IF RETCDE^=SUCCESS THEN     /* IF VSETLCK FAILED     @ZM32427*/ 00587000
         LTR   RETCDE,RETCDE                                       0655 00588000
         BZ    @RF00655                                            0655 00589000
*         LCPZRT00=ON;              /* SET LOGICAL ERROR     @ZM32427*/ 00590000
         OI    LCPZRT00(PTRLCP),B'10000000'                        0656 00591000
*       ELSE                                                       0657 00592000
*         ;                         /* RETURN SUCCESSFULLY   @ZM32427*/ 00593000
@RF00655 DS    0H                                                  0658 00594000
*     END;                          /* END OF NORMAL PROCESSING    0658 00595000
*                                                            @ZM32427*/ 00596000
*/* TPZRETN                                                          */ 00597000
*                                                                  0659 00598000
*   DO;                                                            0659 00599000
@RC00619 DS    0H                                                  0660 00600000
*     RFY                                                          0660 00601000
*      (GPR07P,                                                    0660 00602000
*       GPR14P,                                                    0660 00603000
*       GPR15P) RSTD;                                              0660 00604000
*     GPR13P=ZSAZSVBC;                                             0661 00605000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0661 00606000
*     IF GPR13P=0 THEN                                             0662 00607000
         LTR   GPR13P,GPR13P                                       0662 00608000
         BZ    @RT00662                                            0662 00609000
*       ;                           /* TPDVTS ISTZFARR               */ 00610000
*     ELSE                                                         0664 00611000
*       GPR14P=ZSAZSVRR;                                           0664 00612000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0664 00613000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0665 00614000
@RT00662 DS    0H                                                  0665 00615000
         LM    7,12,ZSAZSVVR+0(13)                                      00616000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0666 00617000
         BR    GPR14P                                                   00618000
*     RFY                                                          0667 00619000
*      (GPR07P,                                                    0667 00620000
*       GPR14P,                                                    0667 00621000
*       GPR15P) UNRSTD;                                            0667 00622000
*   END;                                                           0668 00623000
*                                                                  0668 00624000
*/* END TPZRETN                                                      */ 00625000
*                                                                  0669 00626000
*                                   /* RETURN                        */ 00627000
*/* TPEPILOG                                                         */ 00628000
*                                                                  0669 00629000
*   GEN(PRINT OFF);                                                0669 00630000
         PRINT OFF                                                      00631000
*   GEN(PRINT ON);                                                 0670 00632000
*                                                                  0670 00633000
         PRINT ON                                                       00634000
*/* END OF TPEPILOG                                                  */ 00635000
*                                                                  0671 00636000
*   END ISTZBMJA                                                   0671 00637000
*                                                                  0671 00638000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00639000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00640000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00641000
*/*%INCLUDE SYSLIB  (IECDTCCW)                                       */ 00642000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00643000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00644000
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */ 00645000
*                                                                  0671 00646000
*       ;                                                          0671 00647000
@EL00001 DS    0H                                                  0671 00648000
@EF00001 DS    0H                                                  0671 00649000
@ER00001 BR    @14                                                 0671 00650000
@DATA    DS    0H                                                       00651000
@DATD    DSECT                                                          00652000
         DS    0F                                                       00653000
ISTZBMJA CSECT                                                          00654000
         DS    0F                                                       00655000
@CF00066 DC    F'1'                                                     00656000
@CF00107 DC    F'2'                                                     00657000
@CF00043 DC    F'4'                                                     00658000
@CF00035 DC    F'8'                                                     00659000
@CF01502 DC    XL4'08000000'                                            00660000
@CF01542 DC    XL4'80000000'                                            00661000
@CF04090 DC    XL4'00FFFFFF'                                            00662000
@CF04111 DC    BL4'00000000000000000000000000001000'                    00663000
@DATD    DSECT                                                          00664000
         DS    0D                                                       00665000
SRBPTR   DS    A                                                        00666000
IOSBPTR  DS    A                                                        00667000
IOCOMPTR DS    A                                                        00668000
LDNCBPTR DS    A                                                        00669000
FSBPTR   DS    A                                                        00670000
LCPBPTR  DS    A                                                        00671000
FMCBPTR  DS    A                                                        00672000
DNCBPTR  DS    A                                                        00673000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00674000
@ENDDATD EQU   *                                                        00675000
ISTZBMJA CSECT                                                          00676000
         DS    0F                                                       00677000
@SIZDATD DC    AL1(0)                                                   00678000
         DC    AL3(@ENDDATD-@DATD)                                      00679000
         DS    0D                                                       00680000
FMZA0018 DS    FL4                                                      00681000
         ORG   FMZA0018                                                 00682000
@NM00077 DC    AL1(184)                                                 00683000
@NM00078 DC    AL3(0)                                                   00684000
         ORG   FMZA0018+4                                               00685000
FMZA0052 DS    FL4                                                      00686000
         ORG   FMZA0052                                                 00687000
@NM00079 DC    AL1(184)                                                 00688000
@NM00080 DC    AL3(0)                                                   00689000
         ORG   FMZA0052+4                                               00690000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00691000
@01      EQU   01                                                       00692000
@02      EQU   02                                                       00693000
@03      EQU   03                                                       00694000
@04      EQU   04                                                       00695000
@05      EQU   05                                                       00696000
@06      EQU   06                                                       00697000
@07      EQU   07                                                       00698000
@08      EQU   08                                                       00699000
@09      EQU   09                                                       00700000
@10      EQU   10                                                       00701000
@11      EQU   11                                                       00702000
@12      EQU   12                                                       00703000
@13      EQU   13                                                       00704000
@14      EQU   14                                                       00705000
@15      EQU   15                                                       00706000
TCCWPTR  EQU   @09                                                      00707000
RPHPTR   EQU   @01                                                      00708000
GPR00F   EQU   @00                                                      00709000
GPR00P   EQU   @00                                                      00710000
GPR01P   EQU   @01                                                      00711000
GPR02F   EQU   @02                                                      00712000
GPR02P   EQU   @02                                                      00713000
GPR03F   EQU   @03                                                      00714000
GPR03P   EQU   @03                                                      00715000
GPR04F   EQU   @04                                                      00716000
GPR04P   EQU   @04                                                      00717000
GPR07P   EQU   @07                                                      00718000
GPR10F   EQU   @10                                                      00719000
GPR10P   EQU   @10                                                      00720000
GPR11F   EQU   @11                                                      00721000
GPR11P   EQU   @11                                                      00722000
GPR12F   EQU   @12                                                      00723000
GPR12P   EQU   @12                                                      00724000
GPR13F   EQU   @13                                                      00725000
GPR13P   EQU   @13                                                      00726000
GPR14F   EQU   @14                                                      00727000
GPR14P   EQU   @14                                                      00728000
GPR15F   EQU   @15                                                      00729000
GPR15P   EQU   @15                                                      00730000
PLISTPTR EQU   @01                                                      00731000
PTRATCVT EQU   @02                                                      00732000
SAVEKEY  EQU   @02                                                      00733000
COUNT    EQU   @02                                                      00734000
PTRLDNCB EQU   @03                                                      00735000
R4       EQU   @04                                                      00736000
PTRFMCB  EQU   @05                                                      00737000
PTRZLB   EQU   @06                                                      00738000
PTRLCP   EQU   @07                                                      00739000
SAVEADDR EQU   @08                                                      00740000
BASEREG  EQU   @12                                                      00741000
SAVEAREG EQU   @13                                                      00742000
XLATPTR  EQU   @15                                                      00743000
RETCDE   EQU   @15                                                      00744000
GPR01F   EQU   @01                                                      00745000
GPR05F   EQU   @05                                                      00746000
GPR05P   EQU   @05                                                      00747000
GPR06F   EQU   @06                                                      00748000
GPR06P   EQU   @06                                                      00749000
GPR07F   EQU   @07                                                      00750000
GPR08F   EQU   @08                                                      00751000
GPR08P   EQU   @08                                                      00752000
GPR09F   EQU   @09                                                      00753000
GPR09P   EQU   @09                                                      00754000
PSA      EQU   0                                                        00755000
FLCRNPSW EQU   PSA                                                      00756000
FLCROPSW EQU   PSA+8                                                    00757000
FLCICCW2 EQU   PSA+16                                                   00758000
FLCCVT   EQU   FLCICCW2                                                 00759000
PSAEEPSW EQU   PSA+132                                                  00760000
PSAESPSW EQU   PSA+136                                                  00761000
FLCSVILC EQU   PSAESPSW+1                                               00762000
PSAEPPSW EQU   PSA+140                                                  00763000
FLCPIILC EQU   PSAEPPSW+1                                               00764000
FLCPICOD EQU   PSAEPPSW+2                                               00765000
PSAPICOD EQU   FLCPICOD+1                                               00766000
FLCTEA   EQU   PSAEPPSW+4                                               00767000
FLCPER   EQU   PSA+152                                                  00768000
FLCMCLA  EQU   PSA+168                                                  00769000
FLCIOEL  EQU   FLCMCLA+4                                                00770000
FLCIOA   EQU   FLCMCLA+16                                               00771000
FLCFSA   EQU   FLCMCLA+80                                               00772000
PSASUPER EQU   PSA+552                                                  00773000
PSASUP1  EQU   PSASUPER                                                 00774000
PSASUP2  EQU   PSASUPER+1                                               00775000
PSASUP3  EQU   PSASUPER+2                                               00776000
PSASUP4  EQU   PSASUPER+3                                               00777000
PSACLHT  EQU   PSA+640                                                  00778000
PSALKSA  EQU   PSA+696                                                  00779000
PSAHLHI  EQU   PSA+760                                                  00780000
PSALITA  EQU   PSA+764                                                  00781000
PSADSSFL EQU   PSA+836                                                  00782000
PSADSSF1 EQU   PSADSSFL                                                 00783000
PSADSSF3 EQU   PSADSSFL+2                                               00784000
PSADSSF4 EQU   PSADSSFL+3                                               00785000
PSARSVT  EQU   PSA+896                                                  00786000
ATCLCPTR EQU   1032                                                     00787000
CVTMAP   EQU   0                                                        00788000
CVTDAR   EQU   CVTMAP+72                                                00789000
CVTFLGS1 EQU   CVTDAR                                                   00790000
CVTDCB   EQU   CVTMAP+116                                               00791000
CVTIXAVL EQU   CVTMAP+124                                               00792000
CVTIERLC EQU   CVTMAP+144                                               00793000
CVTOPTA  EQU   CVTMAP+182                                               00794000
CVTOPTB  EQU   CVTMAP+183                                               00795000
CVTGTF   EQU   CVTMAP+236                                               00796000
CVTGTFST EQU   CVTGTF                                                   00797000
CVTGTFS  EQU   CVTGTFST                                                 00798000
CVTSTATE EQU   CVTGTFST                                                 00799000
CVTTMODE EQU   CVTGTFST                                                 00800000
CVTFORM  EQU   CVTGTFST                                                 00801000
CVTAQAVT EQU   CVTMAP+240                                               00802000
CVTTCMFG EQU   CVTAQAVT                                                 00803000
CVTVOLM2 EQU   CVTMAP+244                                               00804000
CVTTATA  EQU   CVTVOLM2                                                 00805000
CVTTSKS  EQU   CVTTATA                                                  00806000
CVTVOLF2 EQU   CVTTSKS                                                  00807000
CVTTAT   EQU   CVTTATA+1                                                00808000
CVTATER  EQU   CVTMAP+248                                               00809000
CVTEXT1  EQU   CVTMAP+252                                               00810000
CVTPURG  EQU   CVTMAP+260                                               00811000
CVTQMSG  EQU   CVTMAP+268                                               00812000
CVTDMSR  EQU   CVTMAP+272                                               00813000
CVTERPV  EQU   CVTMAP+316                                               00814000
CVTINTLA EQU   CVTMAP+320                                               00815000
CVTAPF   EQU   CVTMAP+324                                               00816000
CVTEXT2  EQU   CVTMAP+328                                               00817000
CVTHJES  EQU   CVTMAP+332                                               00818000
CVTPGSIA EQU   CVTMAP+348                                               00819000
CVTA1F1  EQU   CVTMAP+356                                               00820000
CVTSYSK  EQU   CVTMAP+357                                               00821000
CVTVOLM1 EQU   CVTMAP+380                                               00822000
CVTVOLF1 EQU   CVTVOLM1                                                 00823000
CVTATMCT EQU   CVTMAP+388                                               00824000
CVTXTNT1 EQU   0                                                        00825000
CVTXTNT2 EQU   0                                                        00826000
CVTDSSV  EQU   CVTXTNT2                                                 00827000
CVTFLGBT EQU   CVTXTNT2+5                                               00828000
CVTQID   EQU   CVTXTNT2+24                                              00829000
CVTSHS   EQU   CVTXTNT2+40                                              00830000
CVTRV400 EQU   CVTXTNT2+52                                              00831000
CVTRV409 EQU   CVTXTNT2+53                                              00832000
CVTATCVT EQU   CVTXTNT2+64                                              00833000
CVTRV429 EQU   CVTXTNT2+84                                              00834000
CVTRV438 EQU   CVTXTNT2+85                                              00835000
CVTRV457 EQU   CVTXTNT2+112                                             00836000
CVTRV466 EQU   CVTXTNT2+113                                             00837000
CVTFIX   EQU   0                                                        00838000
CVTRELNO EQU   CVTFIX+252                                               00839000
TCCW     EQU   0                                                        00840000
TCCWTCB  EQU   TCCW                                                     00841000
TCCWOPTN EQU   TCCW+4                                                   00842000
TCCWUCB  EQU   TCCW+5                                                   00843000
TCCWBEB  EQU   TCCW+8                                                   00844000
TCCWFIX  EQU   TCCW+12                                                  00845000
TCCWFVC  EQU   TCCW+16                                                  00846000
TCCWRGSV EQU   TCCW+100                                                 00847000
SRBSECT  EQU   0                                                        00848000
SRBFLC   EQU   SRBSECT+12                                               00849000
IOSB     EQU   0                                                        00850000
IOSFLA   EQU   IOSB                                                     00851000
IOSACHN  EQU   IOSFLA                                                   00852000
IOSFLB   EQU   IOSB+1                                                   00853000
IOSFLC   EQU   IOSB+2                                                   00854000
IOSDVALT EQU   IOSFLC                                                   00855000
IOSPKEY  EQU   IOSB+12                                                  00856000
IOSOPT   EQU   IOSB+14                                                  00857000
IOSOPT2  EQU   IOSB+15                                                  00858000
@NM00030 EQU   IOSB+20                                                  00859000
IOSCSW   EQU   @NM00030+1                                               00860000
IOSTATUS EQU   IOSCSW+3                                                 00861000
IOSIPIB  EQU   IOSB+44                                                  00862000
IOSPATH  EQU   IOSB+86                                                  00863000
IOSCHN   EQU   IOSPATH                                                  00864000
IOSCKEY  EQU   IOSB+89                                                  00865000
IOSEEKA  EQU   IOSB+100                                                 00866000
IOSCCHH  EQU   IOSEEKA+3                                                00867000
IOSSKHH  EQU   IOSCCHH+2                                                00868000
IOCOM    EQU   0                                                        00869000
IOCTCCW  EQU   IOCOM+100                                                00870000
ISTDEVCH EQU   0                                                        00871000
DEVSHCH  EQU   ISTDEVCH                                                 00872000
DEVCHAR  EQU   DEVSHCH                                                  00873000
DEVTCODE EQU   ISTDEVCH+1                                               00874000
DEVFLAGS EQU   ISTDEVCH+3                                               00875000
DEVFCCTL EQU   DEVFLAGS                                                 00876000
DEVCHAR3 EQU   DEVFLAGS                                                 00877000
ISTLOK   EQU   0                                                        00878000
LOKCHN   EQU   ISTLOK+1                                                 00879000
LOKCHNG  EQU   LOKCHN                                                   00880000
@NM00039 EQU   LOKCHNG+2                                                00881000
ISTRPH   EQU   0                                                        00882000
RPHFLAGS EQU   ISTRPH+2                                                 00883000
RPHAPTYP EQU   RPHFLAGS                                                 00884000
RPHFSTLC EQU   RPHFLAGS                                                 00885000
RPHFLGB  EQU   ISTRPH+3                                                 00886000
RPHRPHA  EQU   ISTRPH+4                                                 00887000
RPHTSKID EQU   ISTRPH+8                                                 00888000
RPHRESMA EQU   ISTRPH+16                                                00889000
RPHWPFLG EQU   RPHRESMA                                                 00890000
RPHWEA   EQU   ISTRPH+24                                                00891000
RPHCSPA  EQU   RPHWEA                                                   00892000
RPHSRPRM EQU   ISTRPH+28                                                00893000
RPHCRR   EQU   ISTRPH+32                                                00894000
RPHPABQA EQU   ISTRPH+36                                                00895000
RPHWORK  EQU   ISTRPH+40                                                00896000
RPHSAVE1 EQU   RPHWORK                                                  00897000
RPHSBITS EQU   RPHSAVE1+1                                               00898000
ISTPAB   EQU   0                                                        00899000
PABWQCHN EQU   ISTPAB                                                   00900000
PABWEQA  EQU   PABWQCHN                                                 00901000
PABCHAIN EQU   PABWQCHN+4                                               00902000
PABRPHFG EQU   ISTPAB+12                                                00903000
PABFLAGS EQU   PABRPHFG                                                 00904000
PABERLCK EQU   PABFLAGS                                                 00905000
PABERRLK EQU   PABERLCK                                                 00906000
ISTNCB   EQU   0                                                        00907000
NCBTSKID EQU   ISTNCB+8                                                 00908000
NCBFLAGS EQU   ISTNCB+24                                                00909000
NCBFRAS  EQU   NCBFLAGS+1                                               00910000
NCBFTRIO EQU   NCBFRAS                                                  00911000
NCBFLAG1 EQU   NCBFLAGS+2                                               00912000
ISTLDNCB EQU   0                                                        00913000
LDNCFLAG EQU   ISTLDNCB+54                                              00914000
LDNFLAGS EQU   ISTLDNCB+107                                             00915000
LDNZF006 EQU   LDNFLAGS                                                 00916000
LDNFLAG2 EQU   ISTLDNCB+110                                             00917000
LDNZIOLK EQU   ISTLDNCB+184                                             00918000
LDNZERPF EQU   ISTLDNCB+185                                             00919000
LDNZCPAN EQU   LDNZERPF                                                 00920000
LDNZEPIN EQU   LDNZERPF                                                 00921000
LDNZLPC  EQU   ISTLDNCB+186                                             00922000
LDNDCDEB EQU   ISTLDNCB+304                                             00923000
LDNUCBAD EQU   LDNDCDEB+8                                               00924000
LDNZSAV3 EQU   ISTLDNCB+376                                             00925000
LDNZSAV4 EQU   LDNZSAV3+8                                               00926000
LDNZH003 EQU   ISTLDNCB+577                                             00927000
ISTFDB   EQU   0                                                        00928000
ISTFSB   EQU   0                                                        00929000
FSBFSB   EQU   ISTFSB                                                   00930000
FSBMNRCD EQU   FSBFSB+2                                                 00931000
FSBSFLGS EQU   FSBFSB+3                                                 00932000
FSBFSBA  EQU   FSBFSB+4                                                 00933000
FSBBTH   EQU   FSBFSB+8                                                 00934000
FSBCID   EQU   FSBBTH                                                   00935000
FSBRQTAG EQU   FSBBTH+4                                                 00936000
FSBSEQID EQU   FSBRQTAG                                                 00937000
FSBFLAGS EQU   FSBSEQID                                                 00938000
FSBSEQ   EQU   FSBSEQID+1                                               00939000
FSBCSWST EQU   FSBBTH+6                                                 00940000
FSBTHFLD EQU   FSBCSWST                                                 00941000
FSBTH1   EQU   FSBTHFLD                                                 00942000
FSBSYSRS EQU   FSBTH1                                                   00943000
FSBTH2   EQU   FSBTHFLD+1                                               00944000
FSBEXTRS EQU   FSBTH2                                                   00945000
FSBXFSTS EQU   FSBEXTRS                                                 00946000
FSBXCODE EQU   FSBEXTRS                                                 00947000
FSBNETRS EQU   FSBFSB+16                                                00948000
FSBSRCAT EQU   FSBNETRS                                                 00949000
FSBERC   EQU   FSBNETRS+1                                               00950000
FSBFBMI  EQU   FSBERC                                                   00951000
FSBDMGRS EQU   FSBFSB+18                                                00952000
FSBSS1   EQU   FSBDMGRS                                                 00953000
FSBSS2   EQU   FSBDMGRS+1                                               00954000
FSBLCPB  EQU   FSBFSB+20                                                00955000
FSBMSGID EQU   FSBLCPB                                                  00956000
FSBLCCWA EQU   FSBFSB+24                                                00957000
FSBRLSTS EQU   FSBLCCWA                                                 00958000
ISTZLBUF EQU   0                                                        00959000
ZLBFSM   EQU   ISTZLBUF+4                                               00960000
ISTLCCW  EQU   0                                                        00961000
LCCWOP   EQU   ISTLCCW                                                  00962000
LCCWRWOP EQU   LCCWOP                                                   00963000
LCCWCTL  EQU   LCCWRWOP                                                 00964000
LCCWFLAG EQU   ISTLCCW+1                                                00965000
LCCWLSI  EQU   LCCWFLAG                                                 00966000
LCCWDATA EQU   ISTLCCW+4                                                00967000
ISTLCPB  EQU   0                                                        00968000
LCPREQTG EQU   ISTLCPB+2                                                00969000
LCPFLAGS EQU   LCPREQTG                                                 00970000
LCPZRT00 EQU   LCPFLAGS                                                 00971000
LCPZF001 EQU   LCPFLAGS                                                 00972000
LCPZRT02 EQU   LCPZF001                                                 00973000
LCPZF002 EQU   LCPFLAGS                                                 00974000
LCPZRT03 EQU   LCPZF002                                                 00975000
LCPZF003 EQU   LCPFLAGS                                                 00976000
LCPZRT04 EQU   LCPZF003                                                 00977000
LCPZF004 EQU   LCPFLAGS                                                 00978000
LCPZRT05 EQU   LCPZF004                                                 00979000
LCPZRT06 EQU   LCPFLAGS                                                 00980000
LCPZRT07 EQU   LCPFLAGS                                                 00981000
LCPMNRCD EQU   LCPREQTG+1                                               00982000
LCPZRT08 EQU   LCPMNRCD                                                 00983000
LCPZRT09 EQU   LCPMNRCD                                                 00984000
LCPCHAIN EQU   ISTLCPB+4                                                00985000
LCPCHAI1 EQU   LCPCHAIN                                                 00986000
LCPRUCNT EQU   ISTLCPB+8                                                00987000
LCPFLAG2 EQU   ISTLCPB+9                                                00988000
LCPTLBPI EQU   LCPFLAG2                                                 00989000
LCPFID0  EQU   LCPFLAG2                                                 00990000
LCPSEQ   EQU   ISTLCPB+10                                               00991000
LCPCID   EQU   ISTLCPB+16                                               00992000
LCPNXLCW EQU   ISTLCPB+20                                               00993000
LCPFDBA  EQU   ISTLCPB+24                                               00994000
LCPFLG1  EQU   ISTLCPB+37                                               00995000
LCPFLCCW EQU   ISTLCPB+40                                               00996000
LCPLCCW  EQU   ISTLCPB+48                                               00997000
LCPPABA  EQU   LCPLCCW+4                                                00998000
LCPRPHA  EQU   LCPPABA                                                  00999000
ISTZSAVE EQU   0                                                        01000000
ZSAZSVBC EQU   ISTZSAVE                                                 01001000
ZSAZSVMS EQU   ZSAZSVBC                                                 01002000
ZSAZSVFC EQU   ISTZSAVE+4                                               01003000
ZSAZSVRR EQU   ISTZSAVE+8                                               01004000
ZSAZSVVR EQU   ISTZSAVE+12                                              01005000
ISTZCRR  EQU   0                                                        01006000
ZCRCRR   EQU   ISTZCRR                                                  01007000
ZCRFLGS1 EQU   ISTZCRR+12                                               01008000
ZCRFLGS2 EQU   ISTZCRR+13                                               01009000
ZCRSWFLD EQU   ISTZCRR+14                                               01010000
ZCRENDSH EQU   ZCRSWFLD                                                 01011000
ZCRNDLCP EQU   ZCRSWFLD                                                 01012000
ZCRRESET EQU   ZCRSWFLD                                                 01013000
ZCRFLGS3 EQU   ISTZCRR+15                                               01014000
ZCRGENSW EQU   ISTZCRR+16                                               01015000
ZCRPFLGS EQU   ISTZCRR+17                                               01016000
ZCRIBPR  EQU   ISTZCRR+18                                               01017000
ZCRSCPSW EQU   ISTZCRR+19                                               01018000
ZCRPARMS EQU   ISTZCRR+24                                               01019000
ZCRFBPTR EQU   ZCRPARMS                                                 01020000
ZCRDFRDA EQU   ZCRPARMS+10                                              01021000
ZCRPCOD1 EQU   ZCRPARMS+12                                              01022000
ZCRPLSBF EQU   ZCRPCOD1                                                 01023000
ZCRPCOD2 EQU   ZCRPARMS+13                                              01024000
ZCRSVRTN EQU   ISTZCRR+56                                               01025000
ZCRWKARA EQU   ISTZCRR+156                                              01026000
ZCRCIDSV EQU   ISTZCRR+192                                              01027000
ZCRAUDIT EQU   ISTZCRR+440                                              01028000
ZCRENTER EQU   ZCRAUDIT+5                                               01029000
ZCRLCPB  EQU   ISTZCRR+480                                              01030000
ZCRRHRU  EQU   ZCRLCPB                                                  01031000
ISTPFCRR EQU   0                                                        01032000
PFCCRR   EQU   ISTPFCRR                                                 01033000
PFCCRRID EQU   PFCCRR                                                   01034000
PFCCRRLN EQU   PFCCRR+2                                                 01035000
PFCHDR   EQU   ISTPFCRR+4                                               01036000
PFCCRRO  EQU   PFCHDR                                                   01037000
PFCFRRO  EQU   PFCHDR+4                                                 01038000
ISTCFCRR EQU   0                                                        01039000
CFCAUDIT EQU   ISTCFCRR                                                 01040000
CFCNTRD  EQU   CFCAUDIT                                                 01041000
CFCCRT   EQU   CFCAUDIT+1                                               01042000
ISTASCRR EQU   0                                                        01043000
ASCFLAGS EQU   ISTASCRR+16                                              01044000
ASCFLG1  EQU   ASCFLAGS                                                 01045000
ASCFLG2  EQU   ASCFLAGS+2                                               01046000
ASCFLG3  EQU   ASCFLAGS+4                                               01047000
ASCUSRGS EQU   ISTASCRR+28                                              01048000
ISTAPCRR EQU   0                                                        01049000
APCATFLG EQU   ISTAPCRR+16                                              01050000
APCRFLG  EQU   ISTAPCRR+18                                              01051000
APCSAVE  EQU   ISTAPCRR+44                                              01052000
APCCOMF  EQU   ISTAPCRR+116                                             01053000
APCCOMF1 EQU   APCCOMF                                                  01054000
APC31FLG EQU   ISTAPCRR+132                                             01055000
APC52FLG EQU   ISTAPCRR+133                                             01056000
APC53FLG EQU   ISTAPCRR+134                                             01057000
APC54FLG EQU   ISTAPCRR+135                                             01058000
APC57FLG EQU   ISTAPCRR+136                                             01059000
ISTCRA   EQU   0                                                        01060000
CRABASIC EQU   ISTCRA                                                   01061000
CRAHDR   EQU   CRABASIC                                                 01062000
CRACRR   EQU   CRAHDR                                                   01063000
CRALKACT EQU   CRABASIC+8                                               01064000
CRASVC   EQU   ISTCRA+848                                               01065000
CRABUFA  EQU   CRASVC+68                                                01066000
ISTPROCD EQU   0                                                        01067000
PROPROC  EQU   ISTPROCD                                                 01068000
PROPROC1 EQU   PROPROC                                                  01069000
PROPROC2 EQU   PROPROC+1                                                01070000
PROPROC3 EQU   PROPROC+2                                                01071000
PROPROC4 EQU   PROPROC+3                                                01072000
PROPROCS EQU   0                                                        01073000
PROSETMS EQU   PROPROCS+1                                               01074000
PROSETM2 EQU   PROSETMS                                                 01075000
PROSETM3 EQU   PROSETMS+1                                               01076000
PROSETM4 EQU   PROSETMS+2                                               01077000
ISTFMCB  EQU   0                                                        01078000
FMCSAF   EQU   ISTFMCB+2                                                01079000
FMCSTAT  EQU   ISTFMCB+28                                               01080000
FMCSTAT1 EQU   ISTFMCB+29                                               01081000
FMCCMDFL EQU   ISTFMCB+31                                               01082000
FMCCMPS1 EQU   ISTFMCB+36                                               01083000
FMCSIPA  EQU   ISTFMCB+148                                              01084000
FMCNXOSQ EQU   ISTFMCB+152                                              01085000
FMCNXCFM EQU   FMCNXOSQ                                                 01086000
FMCNXOSC EQU   FMCNXOSQ+2                                               01087000
FMCSSTAT EQU   ISTFMCB+159                                              01088000
FMCPACE  EQU   ISTFMCB+160                                              01089000
FMCPACEN EQU   FMCPACE                                                  01090000
FMCPACEM EQU   FMCPACE+1                                                01091000
FMCPACPC EQU   FMCPACE+2                                                01092000
FMCCVAL  EQU   FMCPACE+3                                                01093000
FMCOBCE  EQU   FMCCVAL                                                  01094000
FMCCLEXT EQU   ISTFMCB+164                                              01095000
FMCRPLA  EQU   FMCCLEXT                                                 01096000
FMCFBA   EQU   FMCCLEXT+4                                               01097000
FMCCMPS2 EQU   FMCCLEXT+16                                              01098000
FMCFLGA  EQU   FMCCMPS2                                                 01099000
FMCFLGCL EQU   FMCCMPS2+1                                               01100000
FMCPSCMD EQU   FMCCMPS2+2                                               01101000
FMCPSTAT EQU   FMCCMPS2+3                                               01102000
FMCSTAT2 EQU   ISTFMCB+186                                              01103000
FMCMODEB EQU   ISTFMCB+189                                              01104000
FMCCLSEQ EQU   ISTFMCB+190                                              01105000
FMCRRESP EQU   ISTFMCB+195                                              01106000
FMCSSEGQ EQU   ISTFMCB+200                                              01107000
FMCFBAS  EQU   ISTFMCB+216                                              01108000
FMCZV002 EQU   FMCFBAS                                                  01109000
FMCSNCTL EQU   ISTFMCB+224                                              01110000
FMCSCFLG EQU   FMCSNCTL                                                 01111000
FMCVS1   EQU   ISTFMCB+232                                              01112000
FMCZFLAG EQU   FMCVS1                                                   01113000
FMCZF006 EQU   FMCZFLAG                                                 01114000
FMCLBXM  EQU   FMCVS1+12                                                01115000
FMCSHEAQ EQU   FMCLBXM                                                  01116000
FMCLCPBQ EQU   FMCVS1+16                                                01117000
FMCLCPAQ EQU   FMCVS1+20                                                01118000
FMCSEQ1  EQU   FMCVS1+34                                                01119000
FMCZFLG2 EQU   FMCVS1+35                                                01120000
FMCCVFLG EQU   FMCVS1+44                                                01121000
FMCFLAG  EQU   0                                                        01122000
FMCFLGB  EQU   FMCFLAG                                                  01123000
ISTTCCW  EQU   0                                                        01124000
TCCTCCW  EQU   ISTTCCW+8                                                01125000
ISTDYPAB EQU   0                                                        01126000
ISTATCVT EQU   0                                                        01127000
ATCCOM   EQU   ISTATCVT                                                 01128000
ATCSTAT  EQU   ATCCOM                                                   01129000
ATCSTAT1 EQU   ATCSTAT                                                  01130000
ATCSTFLG EQU   ATCSTAT+1                                                01131000
ATCPOFLG EQU   ATCSTAT+2                                                01132000
ATCSTAT4 EQU   ATCSTAT+3                                                01133000
ATCBPDA  EQU   ATCCOM+128                                               01134000
ATCIOTRC EQU   ATCCOM+140                                               01135000
ATCTHTRC EQU   ATCIOTRC                                                 01136000
ATCSMRQ  EQU   ATCCOM+180                                               01137000
ATCCSMR  EQU   ISTATCVT+296                                             01138000
ATCSHRFG EQU   ISTATCVT+316                                             01139000
ATCHPGM  EQU   ISTATCVT+384                                             01140000
ATCVLCNT EQU   ISTATCVT+772                                             01141000
ATCSOPD  EQU   ISTATCVT+792                                             01142000
ATCSIPD  EQU   ISTATCVT+800                                             01143000
ATCSECST EQU   ISTATCVT+812                                             01144000
ATCAOSM  EQU   ISTATCVT+912                                             01145000
ATCGSRBQ EQU   ATCAOSM+4                                                01146000
ATCGSRBG EQU   ATCGSRBQ                                                 01147000
ATCAP31  EQU   ATCAOSM+24                                               01148000
ATCICAPP EQU   ATCAOSM+100                                              01149000
ATCLDAPP EQU   ATCAOSM+120                                              01150000
ATCDAPVT EQU   ATCAOSM+140                                              01151000
ATCVTFLG EQU   ATCAOSM+392                                              01152000
ATCZFLAG EQU   ATCAOSM+588                                              01153000
ISTDNCB  EQU   0                                                        01154000
DNCOS    EQU   ISTDNCB+56                                               01155000
DNCZFLGS EQU   DNCOS                                                    01156000
DNCBSCED EQU   DNCOS+2                                                  01157000
IECVTCCW EQU   0                                                        01158000
WORKAREA EQU   0                                                        01159000
WKACHAIN EQU   WORKAREA                                                 01160000
WKABUFF  EQU   WORKAREA+8                                               01161000
FMZL0018 EQU   0                                                        01162000
FMZL0042 EQU   0                                                        01163000
FMZL0052 EQU   0                                                        01164000
FMZL0076 EQU   0                                                        01165000
FLC      EQU   PSA                                                      01166000
PSARSVTE EQU   PSARSVT                                                  01167000
CVTPTR   EQU   FLCCVT                                                   01168000
CVTS01   EQU   CVTPGSIA                                                 01169000
CVTLPDIA EQU   CVTS01+12                                                01170000
CVTDIRST EQU   CVTLPDIA                                                 01171000
CVTSLIDA EQU   CVTS01+24                                                01172000
CVTCTLFG EQU   CVTS01+50                                                01173000
CVTRV210 EQU   CVTS01+424                                               01174000
CVTRV219 EQU   CVTS01+425                                               01175000
CVTRV228 EQU   CVTS01+426                                               01176000
CVTRV237 EQU   CVTS01+427                                               01177000
CVTMFRTR EQU   CVTS01+452                                               01178000
CVTRV262 EQU   CVTS01+468                                               01179000
CVTRV271 EQU   CVTS01+469                                               01180000
CVTRV280 EQU   CVTS01+470                                               01181000
CVTRV289 EQU   CVTS01+471                                               01182000
CVTGSDA  EQU   CVTS01+600                                               01183000
IOSATTSC EQU   IOSIPIB                                                  01184000
IOSWTOWA EQU   IOSIPIB                                                  01185000
IOSPCISC EQU   IOSIPIB                                                  01186000
FSBCOMBN EQU   FSBNETRS                                                 01187000
FSBRHFLD EQU   FSBCOMBN+1                                               01188000
FSBRH3   EQU   FSBRHFLD+2                                               01189000
FSBLDFLG EQU   FSBRH3                                                   01190000
@NM00051 EQU   FSBRQTAG                                                 01191000
ZLBBTRAN EQU   ISTZLBUF                                                 01192000
ZLBAIO   EQU   ZLBBTRAN+16                                              01193000
ZLBDTIO  EQU   ZLBFSM                                                   01194000
ZLBCCW1  EQU   ZLBDTIO                                                  01195000
ZLBCCW2  EQU   ZLBDTIO+8                                                01196000
ZLBCCW3  EQU   ZLBDTIO+16                                               01197000
ZLBSNS   EQU   ZLBDTIO+28                                               01198000
ZLBERC   EQU   ZLBDTIO+29                                               01199000
ZLBSAF   EQU   ZLBDTIO+48                                               01200000
ZLBSTAT  EQU   ZLBSAF                                                   01201000
ZLBDEVST EQU   ZLBSTAT                                                  01202000
ZLBRQTG  EQU   ZLBDTIO+50                                               01203000
ZLBRQFLG EQU   ZLBRQTG                                                  01204000
ZLBFLAGS EQU   ZLBDTIO+56                                               01205000
ZLBTCP   EQU   ZLBFLAGS+8                                               01206000
ZLBTEXTA EQU   ZLBCCW3                                                  01207000
ZLBTEXTB EQU   ZLBFLAGS                                                 01208000
ZLBTEXTC EQU   ZLBFLAGS                                                 01209000
ZLBPPL   EQU   ZLBTEXTC                                                 01210000
ZLBFAIO  EQU   ZLBAIO                                                   01211000
LCPZTIE  EQU   LCPCID                                                   01212000
LCPZSNAM EQU   LCPZTIE+8                                                01213000
SRB      EQU   SRBSECT                                                  01214000
TAGFMC   EQU   FMCSEQ1                                                  01215000
TAGZLB   EQU   ZLBRQTG+1                                                01216000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01217000
LCPZTRV4 EQU   LCPZSNAM+4                                               01218000
LCPZTRV1 EQU   LCPZSNAM                                                 01219000
LCPZSNA  EQU   LCPZTIE+4                                                01220000
LCPZFMCA EQU   LCPZTIE                                                  01221000
ZLBFDBS  EQU   ZLBFAIO+32                                               01222000
ZLBFSB   EQU   ZLBFAIO                                                  01223000
ZLBPPCSC EQU   ZLBPPL+14                                                01224000
ZLBPPRS1 EQU   ZLBPPL+13                                                01225000
ZLBPPRSV EQU   ZLBPPL+12                                                01226000
ZLBPPCLG EQU   ZLBPPL+12                                                01227000
ZLBPPCC  EQU   ZLBPPL+12                                                01228000
ZLBPPINT EQU   ZLBPPL+12                                                01229000
ZLBPPHIO EQU   ZLBPPL+12                                                01230000
ZLBPP    EQU   ZLBPPL+4                                                 01231000
ZLBPPLDB EQU   ZLBPPL+1                                                 01232000
ZLBPPLF  EQU   ZLBPPL                                                   01233000
ZLBTEXT1 EQU   ZLBTEXTB                                                 01234000
ZLBTEXT  EQU   ZLBTEXTA+8                                               01235000
ZLBRSV0A EQU   ZLBTEXTA                                                 01236000
ZLBTCSW  EQU   ZLBFLAGS+1                                               01237000
ZLBRSV09 EQU   ZLBFLAGS                                                 01238000
ZLBWCCSP EQU   ZLBFLAGS                                                 01239000
ZLBRSV07 EQU   ZLBFLAGS                                                 01240000
ZLBLSTST EQU   ZLBDTIO+52                                               01241000
ZLBRQSEQ EQU   ZLBRQTG+1                                                01242000
ZLBRT0B  EQU   ZLBRQFLG+1                                               01243000
ZLBRT0A  EQU   ZLBRQFLG+1                                               01244000
ZLBRT09  EQU   ZLBRQFLG+1                                               01245000
ZLBRT08  EQU   ZLBRQFLG+1                                               01246000
ZLBRT07  EQU   ZLBRQFLG                                                 01247000
ZLBRT06  EQU   ZLBRQFLG                                                 01248000
ZLBRT05  EQU   ZLBRQFLG                                                 01249000
ZLBRT04  EQU   ZLBRQFLG                                                 01250000
ZLBRT03  EQU   ZLBRQFLG                                                 01251000
ZLBRT02  EQU   ZLBRQFLG                                                 01252000
ZLBRT01  EQU   ZLBRQFLG                                                 01253000
ZLBRT00  EQU   ZLBRQFLG                                                 01254000
ZLBCHNST EQU   ZLBSTAT+1                                                01255000
ZLBUCST  EQU   ZLBDEVST                                                 01256000
ZLBDEST  EQU   ZLBDEVST                                                 01257000
ZLBRSV10 EQU   ZLBDEVST                                                 01258000
ZLBLSTBF EQU   ZLBDTIO+44                                               01259000
ZLBRSV11 EQU   ZLBDTIO+40                                               01260000
ZLBLCCWA EQU   ZLBDTIO+36                                               01261000
ZLBLCPBA EQU   ZLBDTIO+32                                               01262000
ZLBCOMP  EQU   ZLBDTIO+31                                               01263000
ZLBRSV08 EQU   ZLBDTIO+30                                               01264000
ZLBRSV05 EQU   ZLBERC                                                   01265000
ZLBFBMI  EQU   ZLBERC                                                   01266000
ZLBETI   EQU   ZLBERC                                                   01267000
ZLBEMI   EQU   ZLBERC                                                   01268000
ZLBEBI   EQU   ZLBERC                                                   01269000
ZLBECI   EQU   ZLBERC                                                   01270000
ZLBELI   EQU   ZLBERC                                                   01271000
ZLBSOC   EQU   ZLBSNS                                                   01272000
ZLBSCC   EQU   ZLBSNS                                                   01273000
ZLBSUS   EQU   ZLBSNS                                                   01274000
ZLBSDC   EQU   ZLBSNS                                                   01275000
ZLBSEQCK EQU   ZLBSNS                                                   01276000
ZLBSBOL  EQU   ZLBSNS                                                   01277000
ZLBSIR   EQU   ZLBSNS                                                   01278000
ZLBSCR   EQU   ZLBSNS                                                   01279000
ZLBRSV12 EQU   ZLBDTIO+24                                               01280000
ZLBCPTC3 EQU   ZLBCCW3+6                                                01281000
ZLBRSV04 EQU   ZLBCCW3+5                                                01282000
ZLBCPFL3 EQU   ZLBCCW3+4                                                01283000
ZLBCPAD3 EQU   ZLBCCW3+1                                                01284000
ZLBCPCF3 EQU   ZLBCCW3                                                  01285000
ZLBCPTC2 EQU   ZLBCCW2+6                                                01286000
ZLBRSV03 EQU   ZLBCCW2+5                                                01287000
ZLBCPFL2 EQU   ZLBCCW2+4                                                01288000
ZLBCPAD2 EQU   ZLBCCW2+1                                                01289000
ZLBCPCF2 EQU   ZLBCCW2                                                  01290000
ZLBCPTC1 EQU   ZLBCCW1+6                                                01291000
ZLBCMOD  EQU   ZLBCCW1+5                                                01292000
ZLBCPFL1 EQU   ZLBCCW1+4                                                01293000
ZLBCPAD1 EQU   ZLBCCW1+1                                                01294000
ZLBCPCF1 EQU   ZLBCCW1                                                  01295000
ZLBLNG2  EQU   ZLBBTRAN+14                                              01296000
ZLBRSV01 EQU   ZLBBTRAN+12                                              01297000
ZLBFDBZ  EQU   ZLBBTRAN                                                 01298000
FSBRT0B  EQU   @NM00051+1                                               01299000
FSBRT0A  EQU   @NM00051+1                                               01300000
FSBRT09  EQU   @NM00051+1                                               01301000
FSBRT08  EQU   @NM00051+1                                               01302000
FSBRT07  EQU   @NM00051                                                 01303000
FSBRT06  EQU   @NM00051                                                 01304000
FSBRT05  EQU   @NM00051                                                 01305000
FSBRT04  EQU   @NM00051                                                 01306000
FSBRT03  EQU   @NM00051                                                 01307000
FSBRT02  EQU   @NM00051                                                 01308000
FSBRT01  EQU   @NM00051                                                 01309000
FSBRT00  EQU   @NM00051                                                 01310000
FSBLDCUF EQU   FSBLDFLG                                                 01311000
FSBLDSIF EQU   FSBLDFLG                                                 01312000
FSBLDSOF EQU   FSBLDFLG                                                 01313000
FSBLDEBF EQU   FSBLDFLG                                                 01314000
FSBLDBBF EQU   FSBLDFLG                                                 01315000
FSBLDFME EQU   FSBLDFLG                                                 01316000
FSBLDSCF EQU   FSBLDFLG                                                 01317000
FSBLDRMF EQU   FSBLDFLG                                                 01318000
FSBRH2   EQU   FSBRHFLD+1                                               01319000
FSBRH1   EQU   FSBRHFLD                                                 01320000
FSBALIGN EQU   FSBCOMBN                                                 01321000
IOSPCIWA EQU   IOSPCISC+44                                              01322000
IOSPCIRS EQU   IOSPCISC+8                                               01323000
@NM00035 EQU   IOSPCISC+4                                               01324000
@NM00034 EQU   IOSPCISC                                                 01325000
IOSWRNDR EQU   IOSWTOWA+4                                               01326000
IOSWTOPT EQU   IOSWTOWA+3                                               01327000
IOSWTOCP EQU   IOSWTOWA+2                                               01328000
IOSWTOCH EQU   IOSWTOWA                                                 01329000
IOSATTWA EQU   IOSATTSC+40                                              01330000
@NM00033 EQU   IOSATTSC+24                                              01331000
IOSATTSN EQU   IOSATTSC                                                 01332000
CVTRV628 EQU   CVTS01+728                                               01333000
CVTRV627 EQU   CVTS01+724                                               01334000
CVTRV626 EQU   CVTS01+720                                               01335000
CVTRV625 EQU   CVTS01+716                                               01336000
CVTRV624 EQU   CVTS01+712                                               01337000
CVTRV623 EQU   CVTS01+708                                               01338000
CVTRV622 EQU   CVTS01+704                                               01339000
CVTRV621 EQU   CVTS01+700                                               01340000
CVTRV620 EQU   CVTS01+696                                               01341000
CVTRV619 EQU   CVTS01+692                                               01342000
CVTRV618 EQU   CVTS01+688                                               01343000
CVTRV617 EQU   CVTS01+684                                               01344000
CVTRV616 EQU   CVTS01+680                                               01345000
CVTRV615 EQU   CVTS01+676                                               01346000
CVTRV614 EQU   CVTS01+672                                               01347000
CVTRV613 EQU   CVTS01+668                                               01348000
CVTRV612 EQU   CVTS01+664                                               01349000
CVTRV611 EQU   CVTS01+660                                               01350000
CVTEVERM EQU   CVTS01+656                                               01351000
CVTIRM   EQU   CVTS01+652                                               01352000
CVTCGK   EQU   CVTS01+648                                               01353000
CVTRAC   EQU   CVTS01+644                                               01354000
CVTRV606 EQU   CVTS01+640                                               01355000
CVTRV605 EQU   CVTS01+636                                               01356000
CVTRV604 EQU   CVTS01+632                                               01357000
CVTEFF02 EQU   CVTS01+628                                               01358000
CVTCBBR  EQU   CVTS01+624                                               01359000
CVTSSCR  EQU   CVTS01+620                                               01360000
CVTEVENT EQU   CVTS01+616                                               01361000
CVTCRCA  EQU   CVTS01+612                                               01362000
CVTTPIO  EQU   CVTS01+608                                               01363000
CVTADV   EQU   CVTS01+604                                               01364000
CVTGSDAB EQU   CVTGSDA                                                  01365000
CVTQV3   EQU   CVTS01+596                                               01366000
CVTQV2   EQU   CVTS01+592                                               01367000
CVTQV1   EQU   CVTS01+588                                               01368000
CVTRPT   EQU   CVTS01+584                                               01369000
CVTSSRB  EQU   CVTS01+580                                               01370000
CVTCSDRL EQU   CVTS01+576                                               01371000
CVTEXP1  EQU   CVTS01+572                                               01372000
CVTRMPMT EQU   CVTS01+568                                               01373000
CVTRMPTT EQU   CVTS01+564                                               01374000
CVTVPSA  EQU   CVTS01+560                                               01375000
CVTVSTOP EQU   CVTS01+556                                               01376000
CVTGTFR8 EQU   CVTS01+552                                               01377000
CVTQUIT  EQU   CVTS01+548                                               01378000
CVTVACR  EQU   CVTS01+544                                               01379000
CVTWTCB  EQU   CVTS01+540                                               01380000
CVTSTPRS EQU   CVTS01+536                                               01381000
CVT0PT02 EQU   CVTS01+532                                               01382000
CVTDARCM EQU   CVTS01+528                                               01383000
CVTIRECM EQU   CVTS01+524                                               01384000
CVTJRECM EQU   CVTS01+520                                               01385000
CVTVEMS0 EQU   CVTS01+516                                               01386000
CVTSPFRR EQU   CVTS01+512                                               01387000
CVTRLSTG EQU   CVTS01+508                                               01388000
CVT0TC0A EQU   CVTS01+504                                               01389000
CVTGMBR  EQU   CVTS01+500                                               01390000
CVTLFRM  EQU   CVTS01+496                                               01391000
CVTRMBR  EQU   CVTS01+492                                               01392000
CVTVIOP  EQU   CVTS01+488                                               01393000
CVTRV307 EQU   CVTS01+486                                               01394000
CVTRV306 EQU   CVTS01+484                                               01395000
CVTRV305 EQU   CVTS01+482                                               01396000
CVTRV304 EQU   CVTS01+480                                               01397000
CVTRV303 EQU   CVTS01+478                                               01398000
CVTRV302 EQU   CVTS01+476                                               01399000
CVTTRCA  EQU   CVTS01+472                                               01400000
CVTRV297 EQU   CVTRV289                                                 01401000
CVTRV296 EQU   CVTRV289                                                 01402000
CVTRV295 EQU   CVTRV289                                                 01403000
CVTRV294 EQU   CVTRV289                                                 01404000
CVTRV293 EQU   CVTRV289                                                 01405000
CVTRV292 EQU   CVTRV289                                                 01406000
CVTRV291 EQU   CVTRV289                                                 01407000
CVTRV290 EQU   CVTRV289                                                 01408000
CVTRV288 EQU   CVTRV280                                                 01409000
CVTRV287 EQU   CVTRV280                                                 01410000
CVTRV286 EQU   CVTRV280                                                 01411000
CVTRV285 EQU   CVTRV280                                                 01412000
CVTRV284 EQU   CVTRV280                                                 01413000
CVTRV283 EQU   CVTRV280                                                 01414000
CVTRV282 EQU   CVTRV280                                                 01415000
CVTRV281 EQU   CVTRV280                                                 01416000
CVTRV279 EQU   CVTRV271                                                 01417000
CVTRV278 EQU   CVTRV271                                                 01418000
CVTRV277 EQU   CVTRV271                                                 01419000
CVTRV276 EQU   CVTRV271                                                 01420000
CVTRV275 EQU   CVTRV271                                                 01421000
CVTRV274 EQU   CVTRV271                                                 01422000
CVTRV273 EQU   CVTRV271                                                 01423000
CVTRV272 EQU   CVTRV271                                                 01424000
CVTRV270 EQU   CVTRV262                                                 01425000
CVTRV269 EQU   CVTRV262                                                 01426000
CVTRV268 EQU   CVTRV262                                                 01427000
CVTRV267 EQU   CVTRV262                                                 01428000
CVTRV266 EQU   CVTRV262                                                 01429000
CVTRV265 EQU   CVTRV262                                                 01430000
CVTRV264 EQU   CVTRV262                                                 01431000
CVTRV263 EQU   CVTRV262                                                 01432000
CVTVFP   EQU   CVTS01+464                                               01433000
CVTVSI   EQU   CVTS01+460                                               01434000
CVTVPSIB EQU   CVTS01+456                                               01435000
CVTMFACT EQU   CVTMFRTR                                                 01436000
CVTMFCTL EQU   CVTS01+448                                               01437000
CVTPVBP  EQU   CVTS01+444                                               01438000
CVTPWI   EQU   CVTS01+440                                               01439000
CVTRV254 EQU   CVTS01+438                                               01440000
CVTRV253 EQU   CVTS01+436                                               01441000
CVTRV252 EQU   CVTS01+434                                               01442000
CVTRV251 EQU   CVTS01+433                                               01443000
CVTRV250 EQU   CVTS01+432                                               01444000
CVTRV249 EQU   CVTS01+431                                               01445000
CVTRV248 EQU   CVTS01+430                                               01446000
CVTRV247 EQU   CVTS01+429                                               01447000
CVTRV246 EQU   CVTS01+428                                               01448000
CVTRV245 EQU   CVTRV237                                                 01449000
CVTRV244 EQU   CVTRV237                                                 01450000
CVTRV243 EQU   CVTRV237                                                 01451000
CVTRV242 EQU   CVTRV237                                                 01452000
CVTRV241 EQU   CVTRV237                                                 01453000
CVTRV240 EQU   CVTRV237                                                 01454000
CVTRV239 EQU   CVTRV237                                                 01455000
CVTRV238 EQU   CVTRV237                                                 01456000
CVTRV236 EQU   CVTRV228                                                 01457000
CVTRV235 EQU   CVTRV228                                                 01458000
CVTRV234 EQU   CVTRV228                                                 01459000
CVTRV233 EQU   CVTRV228                                                 01460000
CVTRV232 EQU   CVTRV228                                                 01461000
CVTRV231 EQU   CVTRV228                                                 01462000
CVTRV230 EQU   CVTRV228                                                 01463000
CVTRV229 EQU   CVTRV228                                                 01464000
CVTRV227 EQU   CVTRV219                                                 01465000
CVTRV226 EQU   CVTRV219                                                 01466000
CVTRV225 EQU   CVTRV219                                                 01467000
CVTRV224 EQU   CVTRV219                                                 01468000
CVTRV223 EQU   CVTRV219                                                 01469000
CVTRV222 EQU   CVTRV219                                                 01470000
CVTRV221 EQU   CVTRV219                                                 01471000
CVTRV220 EQU   CVTRV219                                                 01472000
CVTRV218 EQU   CVTRV210                                                 01473000
CVTRV217 EQU   CVTRV210                                                 01474000
CVTRV216 EQU   CVTRV210                                                 01475000
CVTRV215 EQU   CVTRV210                                                 01476000
CVTRV214 EQU   CVTRV210                                                 01477000
CVTRV213 EQU   CVTRV210                                                 01478000
CVTRV212 EQU   CVTRV210                                                 01479000
CVTRV211 EQU   CVTRV210                                                 01480000
CVTLCCAT EQU   CVTS01+420                                               01481000
CVTPCCAT EQU   CVTS01+416                                               01482000
CVTIPCRP EQU   CVTS01+412                                               01483000
CVTIPCRI EQU   CVTS01+408                                               01484000
CVTIPCDS EQU   CVTS01+404                                               01485000
CVTAIDVT EQU   CVTS01+400                                               01486000
CVTSSAP  EQU   CVTS01+396                                               01487000
CVTEHCIR EQU   CVTS01+392                                               01488000
CVTEHDEF EQU   CVTS01+388                                               01489000
CVTDAIR  EQU   CVTS01+384                                               01490000
CVTPERFM EQU   CVTS01+380                                               01491000
CVT044R2 EQU   CVTS01+376                                               01492000
CVTFETCH EQU   CVTS01+372                                               01493000
CVTRSTWD EQU   CVTS01+368                                               01494000
CVTSPOST EQU   CVTS01+364                                               01495000
CVTIOBP  EQU   CVTS01+360                                               01496000
CVTASMVT EQU   CVTS01+356                                               01497000
CVTRECRQ EQU   CVTS01+352                                               01498000
CVTWSAC  EQU   CVTS01+348                                               01499000
CVTRV149 EQU   CVTS01+344                                               01500000
CVTWSAL  EQU   CVTS01+340                                               01501000
CVTSPSA  EQU   CVTS01+336                                               01502000
CVTGLMN  EQU   CVTS01+332                                               01503000
CVTVEAC0 EQU   CVTS01+328                                               01504000
CVT062R1 EQU   CVTS01+324                                               01505000
CVTRPOST EQU   CVTS01+320                                               01506000
CVTDQIQE EQU   CVTS01+316                                               01507000
CVTCSD   EQU   CVTS01+312                                               01508000
CVTLKRMA EQU   CVTS01+308                                               01509000
CVTRSPIE EQU   CVTS01+304                                               01510000
CVTRENQ  EQU   CVTS01+300                                               01511000
CVTLQCB  EQU   CVTS01+296                                               01512000
CVTFQCB  EQU   CVTS01+292                                               01513000
CVTQCS01 EQU   CVTS01+288                                               01514000
CVTAPFT  EQU   CVTS01+284                                               01515000
CVTPARRL EQU   CVTS01+280                                               01516000
CVTVWAIT EQU   CVTS01+276                                               01517000
CVTGSPL  EQU   CVTS01+272                                               01518000
CVTLSMQ  EQU   CVTS01+268                                               01519000
CVTGSMQ  EQU   CVTS01+264                                               01520000
CVTEXPRO EQU   CVTS01+260                                               01521000
CVTOPCTP EQU   CVTS01+256                                               01522000
CVTSIC   EQU   CVTS01+252                                               01523000
CVTTPIOS EQU   CVTS01+248                                               01524000
CVTRTMS  EQU   CVTS01+244                                               01525000
CVTSDBF  EQU   CVTS01+240                                               01526000
CVTSCBP  EQU   CVTS01+236                                               01527000
CVTSDMP  EQU   CVTS01+232                                               01528000
CVTSV60  EQU   CVTS01+228                                               01529000
CVTRTMCT EQU   CVTS01+224                                               01530000
CVTASCBL EQU   CVTS01+220                                               01531000
CVTASCBH EQU   CVTS01+216                                               01532000
CVTGDA   EQU   CVTS01+212                                               01533000
CVTASVT  EQU   CVTS01+208                                               01534000
CVTVVMDI EQU   CVTS01+204                                               01535000
CVTAQTOP EQU   CVTS01+200                                               01536000
CVTIOSCS EQU   CVTS01+196                                               01537000
CVTSDRM  EQU   CVTS01+192                                               01538000
CVTOPTE  EQU   CVTS01+188                                               01539000
CVTSTXU  EQU   CVTS01+184                                               01540000
CVTQUIS  EQU   CVTS01+180                                               01541000
CVTPARS  EQU   CVTS01+176                                               01542000
CVTS1EE  EQU   CVTS01+172                                               01543000
CVTFRAS  EQU   CVTS01+168                                               01544000
CVTQSAS  EQU   CVTS01+164                                               01545000
CVTCRAS  EQU   CVTS01+160                                               01546000
CVTCRMN  EQU   CVTS01+156                                               01547000
CVTDELCP EQU   CVTS01+152                                               01548000
CVTFRECL EQU   CVTS01+148                                               01549000
CVTGETCL EQU   CVTS01+144                                               01550000
CVTBLDCP EQU   CVTS01+140                                               01551000
CVTAUTHL EQU   CVTS01+136                                               01552000
CVTSCAN  EQU   CVTS01+132                                               01553000
CVTRV144 EQU   CVTS01+130                                               01554000
CVTMAXMP EQU   CVTS01+128                                               01555000
CVTSTCK  EQU   CVTS01+124                                               01556000
CVTRV139 EQU   CVTS01+123                                               01557000
CVTDSSAC EQU   CVTS01+122                                               01558000
CVTRV513 EQU   CVTS01+121                                               01559000
CVTIOSPL EQU   CVTS01+120                                               01560000
CVTPTGT  EQU   CVTS01+116                                               01561000
CVTCSPIE EQU   CVTS01+112                                               01562000
CVTSMFEX EQU   CVTS01+108                                               01563000
CVTOLT0A EQU   CVTS01+104                                               01564000
CVTSRBRT EQU   CVTS01+100                                               01565000
CVTPUTL  EQU   CVTS01+96                                                01566000
CVTRV519 EQU   CVTS01+92                                                01567000
CVTRV327 EQU   CVTS01+88                                                01568000
CVTRV326 EQU   CVTS01+84                                                01569000
CVTRV325 EQU   CVTS01+80                                                01570000
CVTRV324 EQU   CVTS01+76                                                01571000
CVT0VL01 EQU   CVTS01+72                                                01572000
CVTSHRVM EQU   CVTS01+68                                                01573000
CVTRV332 EQU   CVTS01+64                                                01574000
CVTTAS   EQU   CVTS01+60                                                01575000
CVTRSCN  EQU   CVTS01+56                                                01576000
CVTTRAC2 EQU   CVTS01+54                                                01577000
CVTTRACE EQU   CVTS01+52                                                01578000
CVTAPG   EQU   CVTS01+51                                                01579000
CVTSDTRC EQU   CVTCTLFG                                                 01580000
CVTGTRCE EQU   CVTCTLFG                                                 01581000
CVTNOMP  EQU   CVTCTLFG                                                 01582000
CVTRSV79 EQU   CVTCTLFG                                                 01583000
CVTDSTAT EQU   CVTCTLFG                                                 01584000
CVTRSV78 EQU   CVTCTLFG                                                 01585000
CVTRV333 EQU   CVTCTLFG                                                 01586000
CVTRV323 EQU   CVTCTLFG                                                 01587000
CVTSPVLK EQU   CVTS01+49                                                01588000
CVTRSV77 EQU   CVTS01+48                                                01589000
CVTRV331 EQU   CVTS01+44                                                01590000
CVTRV330 EQU   CVTS01+40                                                01591000
CVTRV329 EQU   CVTS01+36                                                01592000
CVTRV328 EQU   CVTS01+32                                                01593000
CVTRV322 EQU   CVTS01+28                                                01594000
CVTSLID  EQU   CVTSLIDA+1                                               01595000
CVTSYLK  EQU   CVTSLIDA                                                 01596000
CVTRV321 EQU   CVTS01+20                                                01597000
CVTRV320 EQU   CVTS01+16                                                01598000
CVTLPDIR EQU   CVTLPDIA+1                                               01599000
CVTRSV69 EQU   CVTDIRST                                                 01600000
CVTRSV68 EQU   CVTDIRST                                                 01601000
CVTRSV67 EQU   CVTDIRST                                                 01602000
CVTRSV66 EQU   CVTDIRST                                                 01603000
CVTRSV65 EQU   CVTDIRST                                                 01604000
CVTRSV64 EQU   CVTDIRST                                                 01605000
CVTRSV63 EQU   CVTDIRST                                                 01606000
CVTDICOM EQU   CVTDIRST                                                 01607000
CVTPVTP  EQU   CVTS01+8                                                 01608000
CVTLPDSR EQU   CVTS01+4                                                 01609000
CVTGETL  EQU   CVTS01                                                   01610000
PSARSAV  EQU   PSARSVTE+60                                              01611000
PSARSTK  EQU   PSARSVTE+56                                              01612000
PSAESAV3 EQU   PSARSVTE+52                                              01613000
PSAESTK3 EQU   PSARSVTE+48                                              01614000
PSAESAV2 EQU   PSARSVTE+44                                              01615000
PSAESTK2 EQU   PSARSVTE+40                                              01616000
PSAESAV1 EQU   PSARSVTE+36                                              01617000
PSAESTK1 EQU   PSARSVTE+32                                              01618000
PSAPSAV  EQU   PSARSVTE+28                                              01619000
PSAPSTK  EQU   PSARSVTE+24                                              01620000
PSAMSAV  EQU   PSARSVTE+20                                              01621000
PSAMSTK  EQU   PSARSVTE+16                                              01622000
PSASSAV  EQU   PSARSVTE+12                                              01623000
PSASSTK  EQU   PSARSVTE+8                                               01624000
PSANSTK  EQU   PSARSVTE+4                                               01625000
PSACSTK  EQU   PSARSVTE                                                 01626000
@NM00076 EQU   WORKAREA+4                                               01627000
DNCZC001 EQU   DNCOS+40                                                 01628000
DNCLOCK  EQU   DNCOS+36                                                 01629000
DNCZV005 EQU   DNCOS+32                                                 01630000
DNCZV004 EQU   DNCOS+28                                                 01631000
DNCZV003 EQU   DNCOS+24                                                 01632000
DNCZV002 EQU   DNCOS+21                                                 01633000
DNCZX001 EQU   DNCOS+20                                                 01634000
DNCZV001 EQU   DNCOS+17                                                 01635000
DNCZX003 EQU   DNCOS+16                                                 01636000
DNCZV000 EQU   DNCOS+12                                                 01637000
DNCSESCQ EQU   DNCOS+8                                                  01638000
DNCSESIQ EQU   DNCOS+4                                                  01639000
DNCACIP  EQU   DNCBSCED+1                                               01640000
DNCLICP  EQU   DNCBSCED                                                 01641000
DNCZF008 EQU   DNCZFLGS+1                                               01642000
DNCZPSRD EQU   DNCZFLGS+1                                               01643000
DNCPSOL  EQU   DNCZFLGS+1                                               01644000
DNCZF007 EQU   DNCZFLGS+1                                               01645000
DNCZF006 EQU   DNCZFLGS+1                                               01646000
DNCZF005 EQU   DNCZFLGS+1                                               01647000
DNCZF004 EQU   DNCZFLGS+1                                               01648000
DNCZF003 EQU   DNCZFLGS                                                 01649000
DNCZF002 EQU   DNCZFLGS                                                 01650000
DNCZRSCH EQU   DNCZFLGS                                                 01651000
DNCDISC  EQU   DNCZFLGS                                                 01652000
DNCCONT  EQU   DNCZFLGS                                                 01653000
DNCINVIT EQU   DNCZFLGS                                                 01654000
DNCSESS  EQU   DNCZFLGS                                                 01655000
DNCZF001 EQU   DNCZFLGS                                                 01656000
DNCMODE  EQU   ISTDNCB+49                                               01657000
DNCBHSET EQU   ISTDNCB+48                                               01658000
DNCNCB   EQU   ISTDNCB                                                  01659000
ATCAOS   EQU   ISTATCVT+1584                                            01660000
ATCPOPAB EQU   ATCAOSM+640                                              01661000
ATCVIOPM EQU   ATCAOSM+636                                              01662000
ATCTPMMI EQU   ATCAOSM+632                                              01663000
ATCTPMPB EQU   ATCAOSM+600                                              01664000
ATCRPLCT EQU   ATCAOSM+594                                              01665000
ATCCRACT EQU   ATCAOSM+592                                              01666000
ATCSRBCT EQU   ATCAOSM+590                                              01667000
ATCRSV75 EQU   ATCAOSM+589                                              01668000
ATCRSV66 EQU   ATCZFLAG                                                 01669000
ATCZF001 EQU   ATCZFLAG                                                 01670000
ATCTPCP1 EQU   ATCAOSM+584                                              01671000
ATCTPCP0 EQU   ATCAOSM+580                                              01672000
ATCAICTN EQU   ATCAOSM+576                                              01673000
ATCZR01  EQU   ATCAOSM+572                                              01674000
ATCMPLTA EQU   ATCAOSM+568                                              01675000
ATCASCB  EQU   ATCAOSM+564                                              01676000
ATCAP86  EQU   ATCAOSM+560                                              01677000
ATCAP85  EQU   ATCAOSM+556                                              01678000
ATCAP84  EQU   ATCAOSM+552                                              01679000
ATCAP83  EQU   ATCAOSM+548                                              01680000
ATCAP82  EQU   ATCAOSM+544                                              01681000
ATCAP69  EQU   ATCAOSM+540                                              01682000
ATCAP66  EQU   ATCAOSM+536                                              01683000
ATCAP62  EQU   ATCAOSM+532                                              01684000
ATCAPC59 EQU   ATCAOSM+528                                              01685000
ATCAP56  EQU   ATCAOSM+524                                              01686000
ATCAP55  EQU   ATCAOSM+520                                              01687000
ATCRCFY0 EQU   ATCAOSM+516                                              01688000
ATCAP41  EQU   ATCAOSM+512                                              01689000
ATCAPC25 EQU   ATCAOSM+508                                              01690000
ATCAP23  EQU   ATCAOSM+504                                              01691000
ATCTPSPB EQU   ATCAOSM+472                                              01692000
ATCTRMPB EQU   ATCAOSM+440                                              01693000
ATCPSTA  EQU   ATCAOSM+432                                              01694000
ATCSMABF EQU   ATCAOSM+428                                              01695000
ATCSMAPR EQU   ATCAOSM+424                                              01696000
ATCTPWQA EQU   ATCAOSM+420                                              01697000
ATCSMAID EQU   ATCAOSM+416                                              01698000
ATCSMARA EQU   ATCAOSM+412                                              01699000
ATCCACXA EQU   ATCAOSM+408                                              01700000
ATCZLAAB EQU   ATCAOSM+404                                              01701000
ATCATA10 EQU   ATCAOSM+400                                              01702000
ATCHLTCB EQU   ATCAOSM+396                                              01703000
@NM00075 EQU   ATCVTFLG                                                 01704000
ATCVTACT EQU   ATCVTFLG                                                 01705000
ATCRPT40 EQU   ATCAOSM+388                                              01706000
ATCRPT39 EQU   ATCAOSM+384                                              01707000
ATCRPT38 EQU   ATCAOSM+380                                              01708000
ATCRPT37 EQU   ATCAOSM+376                                              01709000
ATCRPT36 EQU   ATCAOSM+372                                              01710000
ATCRPT35 EQU   ATCAOSM+368                                              01711000
ATCRPT34 EQU   ATCAOSM+364                                              01712000
ATCRPT33 EQU   ATCAOSM+360                                              01713000
ATCRPT32 EQU   ATCAOSM+356                                              01714000
ATCRPT31 EQU   ATCAOSM+352                                              01715000
ATCRPT30 EQU   ATCAOSM+348                                              01716000
ATCRPT29 EQU   ATCAOSM+344                                              01717000
ATCRPT28 EQU   ATCAOSM+340                                              01718000
ATCRPT27 EQU   ATCAOSM+336                                              01719000
ATCRPT26 EQU   ATCAOSM+332                                              01720000
ATCRPT25 EQU   ATCAOSM+328                                              01721000
ATCRPT24 EQU   ATCAOSM+324                                              01722000
ATCRPT23 EQU   ATCAOSM+320                                              01723000
ATCRPT22 EQU   ATCAOSM+316                                              01724000
ATCRPT21 EQU   ATCAOSM+312                                              01725000
ATCRPT20 EQU   ATCAOSM+308                                              01726000
ATCRPT19 EQU   ATCAOSM+304                                              01727000
ATCRPT18 EQU   ATCAOSM+300                                              01728000
ATCRPT17 EQU   ATCAOSM+296                                              01729000
ATCRPT16 EQU   ATCAOSM+292                                              01730000
ATCRPT15 EQU   ATCAOSM+288                                              01731000
ATCRPT14 EQU   ATCAOSM+284                                              01732000
ATCRPT13 EQU   ATCAOSM+280                                              01733000
ATCRPT12 EQU   ATCAOSM+276                                              01734000
ATCRPT11 EQU   ATCAOSM+272                                              01735000
ATCAP38  EQU   ATCAOSM+268                                              01736000
ATCAP37  EQU   ATCAOSM+264                                              01737000
ATCZDFJ0 EQU   ATCAOSM+260                                              01738000
ATCAP51  EQU   ATCAOSM+256                                              01739000
ATCZPAB2 EQU   ATCAOSM+224                                              01740000
ATCZPAB1 EQU   ATCAOSM+192                                              01741000
ATCZLFVT EQU   ATCAOSM+188                                              01742000
ATCZLPVT EQU   ATCAOSM+184                                              01743000
ATCZDVTX EQU   ATCAOSM+180                                              01744000
ATCZDVTA EQU   ATCAOSM+176                                              01745000
ATCZDVT9 EQU   ATCAOSM+172                                              01746000
ATCZDVT8 EQU   ATCAOSM+168                                              01747000
ATCZDVT7 EQU   ATCAOSM+164                                              01748000
ATCRSV56 EQU   ATCDAPVT+22                                              01749000
ATCDAPDG EQU   ATCDAPVT+20                                              01750000
ATCDXCEA EQU   ATCDAPVT+16                                              01751000
ATCDCEA  EQU   ATCDAPVT+12                                              01752000
ATCDPCIA EQU   ATCDAPVT+8                                               01753000
ATCDSIOA EQU   ATCDAPVT+4                                               01754000
ATCDEOEA EQU   ATCDAPVT                                                 01755000
ATCZLAEA EQU   ATCLDAPP+16                                              01756000
ATCZLCEA EQU   ATCLDAPP+12                                              01757000
ATCRSV17 EQU   ATCLDAPP+8                                               01758000
ATCSMFRR EQU   ATCLDAPP+4                                               01759000
ATCCDTID EQU   ATCLDAPP                                                 01760000
ATCZAEA  EQU   ATCICAPP+16                                              01761000
ATCZCEA  EQU   ATCICAPP+12                                              01762000
ATCCDTCB EQU   ATCICAPP+8                                               01763000
ATCZSIOA EQU   ATCICAPP+4                                               01764000
ATCCDRPH EQU   ATCICAPP                                                 01765000
ATCAP65  EQU   ATCAOSM+96                                               01766000
ATCZDVT6 EQU   ATCAOSM+92                                               01767000
ATCZDVT4 EQU   ATCAOSM+88                                               01768000
ATCZDVT3 EQU   ATCAOSM+84                                               01769000
ATCZDVT1 EQU   ATCAOSM+80                                               01770000
ATCICNCB EQU   ATCAOSM+76                                               01771000
ATCZPSVT EQU   ATCAOSM+72                                               01772000
ATCZFSVT EQU   ATCAOSM+68                                               01773000
ATCAP64  EQU   ATCAOSM+64                                               01774000
ATCAP63  EQU   ATCAOSM+60                                               01775000
ATCAP61  EQU   ATCAOSM+56                                               01776000
ATCAP58  EQU   ATCAOSM+52                                               01777000
ATCAP57  EQU   ATCAOSM+48                                               01778000
ATCAP54  EQU   ATCAOSM+44                                               01779000
ATCAP53  EQU   ATCAOSM+40                                               01780000
ATCAP52  EQU   ATCAOSM+36                                               01781000
ATCAP34  EQU   ATCAOSM+32                                               01782000
ATCAP32  EQU   ATCAOSM+28                                               01783000
ATCAP12  EQU   ATCAOSM+20                                               01784000
ATCAP11  EQU   ATCAOSM+16                                               01785000
ATCCMTCB EQU   ATCAOSM+12                                               01786000
ATCPRPH  EQU   ATCAOSM+8                                                01787000
ATCGSRBF EQU   ATCGSRBG                                                 01788000
ATCSRBRT EQU   ATCAOSM                                                  01789000
ATCRSVBB EQU   ISTATCVT+908                                             01790000
ATCVDLOK EQU   ISTATCVT+904                                             01791000
ATCVFPAB EQU   ISTATCVT+872                                             01792000
ATCVDPAB EQU   ISTATCVT+840                                             01793000
ATCIOECB EQU   ISTATCVT+836                                             01794000
ATCINCW3 EQU   ISTATCVT+832                                             01795000
ATCMODTB EQU   ISTATCVT+828                                             01796000
ATCUSSPT EQU   ISTATCVT+824                                             01797000
ATCSRTAB EQU   ISTATCVT+820                                             01798000
@NM00074 EQU   ISTATCVT+818                                             01799000
ATCNMCTR EQU   ISTATCVT+816                                             01800000
ATCSEC51 EQU   ATCSECST                                                 01801000
ATCSEC40 EQU   ATCSIPD+8                                                01802000
ATCSEC30 EQU   ATCSIPD+4                                                01803000
ATCSEC21 EQU   ATCSIPD                                                  01804000
ATCSEC10 EQU   ATCSOPD+4                                                01805000
ATCSEC01 EQU   ATCSOPD                                                  01806000
ATCPOIA  EQU   ISTATCVT+788                                             01807000
ATCPODVT EQU   ISTATCVT+784                                             01808000
ATCS49XL EQU   ISTATCVT+780                                             01809000
ATCS49XI EQU   ISTATCVT+776                                             01810000
ATCLCLCT EQU   ATCVLCNT+2                                               01811000
ATCRNCNT EQU   ATCVLCNT                                                 01812000
ATCCFEAD EQU   ISTATCVT+768                                             01813000
ATCPTR00 EQU   ISTATCVT+736                                             01814000
ATCRSV10 EQU   ISTATCVT+704                                             01815000
ATCTACB  EQU   ISTATCVT+700                                             01816000
ATCVTINM EQU   ISTATCVT+696                                             01817000
ATCTCLIM EQU   ISTATCVT+692                                             01818000
ATCTCLOM EQU   ISTATCVT+688                                             01819000
ATCVTIPB EQU   ISTATCVT+656                                             01820000
ATCTCIPB EQU   ISTATCVT+624                                             01821000
ATCTIPAB EQU   ISTATCVT+592                                             01822000
ATCOCCCB EQU   ISTATCVT+588                                             01823000
ATCOCCOB EQU   ISTATCVT+584                                             01824000
ATCCDLAD EQU   ISTATCVT+580                                             01825000
ATCCCLAD EQU   ISTATCVT+576                                             01826000
ATCDLRPB EQU   ISTATCVT+544                                             01827000
ATCPGPAB EQU   ISTATCVT+512                                             01828000
ATCVPAB1 EQU   ISTATCVT+480                                             01829000
ATCRSV97 EQU   ISTATCVT+476                                             01830000
ATCRDTLK EQU   ISTATCVT+472                                             01831000
ATCVOCLK EQU   ISTATCVT+468                                             01832000
ATCCDFDN EQU   ISTATCVT+464                                             01833000
ATCCDFIN EQU   ISTATCVT+460                                             01834000
ATCDVTLK EQU   ISTATCVT+456                                             01835000
ATCAP36  EQU   ISTATCVT+452                                             01836000
ATCAP35  EQU   ISTATCVT+448                                             01837000
ATCAP33  EQU   ISTATCVT+444                                             01838000
ATCRSV99 EQU   ISTATCVT+412                                             01839000
ATCLDECB EQU   ISTATCVT+408                                             01840000
ATCLDNCS EQU   ISTATCVT+404                                             01841000
ATCCDPTR EQU   ISTATCVT+400                                             01842000
ATCADEL  EQU   ISTATCVT+396                                             01843000
ATCTODVT EQU   ISTATCVT+392                                             01844000
ATCDEBCH EQU   ISTATCVT+388                                             01845000
ATCHBSIZ EQU   ATCHPGM+2                                                01846000
ATCHBFNO EQU   ATCHPGM                                                  01847000
ATCCRME  EQU   ISTATCVT+380                                             01848000
ATCRVCHS EQU   ISTATCVT+372                                             01849000
ATCECTLP EQU   ISTATCVT+368                                             01850000
ATCZDVTB EQU   ISTATCVT+364                                             01851000
ATCECPRT EQU   ISTATCVT+360                                             01852000
ATCVTLOD EQU   ISTATCVT+356                                             01853000
ATCTRPAB EQU   ISTATCVT+352                                             01854000
ATCMSGM  EQU   ISTATCVT+348                                             01855000
ATCMSGP  EQU   ISTATCVT+344                                             01856000
ATCEPT   EQU   ISTATCVT+340                                             01857000
ATCDVT   EQU   ISTATCVT+336                                             01858000
ATCTRCPT EQU   ISTATCVT+332                                             01859000
ATCDVLOD EQU   ISTATCVT+328                                             01860000
ATCALERT EQU   ISTATCVT+324                                             01861000
ATCEPA   EQU   ISTATCVT+320                                             01862000
ATCSAF   EQU   ISTATCVT+318                                             01863000
ATCXRANG EQU   ISTATCVT+317                                             01864000
ATCLAST  EQU   ATCSHRFG                                                 01865000
ATCSHRTN EQU   ISTATCVT+308                                             01866000
ATCUEP   EQU   ISTATCVT+304                                             01867000
ATCOCRT  EQU   ISTATCVT+300                                             01868000
ATCCSMA  EQU   ATCCSMR                                                  01869000
ATCESC02 EQU   ISTATCVT+292                                             01870000
ATCESC01 EQU   ISTATCVT+288                                             01871000
ATCCDFND EQU   ISTATCVT+284                                             01872000
ATCCDDEL EQU   ISTATCVT+280                                             01873000
ATCCDADD EQU   ISTATCVT+276                                             01874000
ATCMNT   EQU   ISTATCVT+272                                             01875000
ATCRSV16 EQU   ISTATCVT+270                                             01876000
ATCMAXID EQU   ISTATCVT+269                                             01877000
ATCMSGSP EQU   ATCCOM+268                                               01878000
ATCCIDM  EQU   ATCCOM+266                                               01879000
ATCACTRM EQU   ATCCOM+264                                               01880000
ATCNERAP EQU   ATCCOM+260                                               01881000
ATCNESAL EQU   ATCCOM+256                                               01882000
ATCRCC65 EQU   ATCCOM+252                                               01883000
ATCRCC26 EQU   ATCCOM+248                                               01884000
ATCRCC63 EQU   ATCCOM+244                                               01885000
ATCRSV11 EQU   ATCCOM+242                                               01886000
ATCVTMID EQU   ATCCOM+240                                               01887000
ATCAPOST EQU   ATCCOM+236                                               01888000
ATCNERFN EQU   ATCCOM+232                                               01889000
ATCNERNE EQU   ATCCOM+228                                               01890000
ATCNERCV EQU   ATCCOM+224                                               01891000
ATCNERST EQU   ATCCOM+220                                               01892000
ATCDCC61 EQU   ATCCOM+216                                               01893000
ATCDCC60 EQU   ATCCOM+212                                               01894000
ATCSRTDF EQU   ATCCOM+208                                               01895000
ATCSRTAD EQU   ATCCOM+204                                               01896000
ATCFIRA  EQU   ATCCOM+200                                               01897000
ATCSMBQ  EQU   ATCCOM+196                                               01898000
ATCSMRC  EQU   ATCCOM+192                                               01899000
ATCSMRS  EQU   ATCCOM+188                                               01900000
ATCSMQU  EQU   ATCCOM+184                                               01901000
ATCACDA  EQU   ATCCOM+176                                               01902000
ATCSTMA  EQU   ATCCOM+172                                               01903000
ATCFRSTR EQU   ATCCOM+168                                               01904000
ATCGTSTR EQU   ATCCOM+164                                               01905000
ATCREADA EQU   ATCCOM+160                                               01906000
ATCALOAD EQU   ATCCOM+156                                               01907000
ATCBLDLA EQU   ATCCOM+152                                               01908000
ATCFBRPH EQU   ATCCOM+148                                               01909000
ATCBFTRC EQU   ATCCOM+144                                               01910000
ATCTPBUF EQU   ATCTHTRC                                                 01911000
ATCREMOV EQU   ATCCOM+136                                               01912000
ATCADD   EQU   ATCCOM+132                                               01913000
ATCDVTPT EQU   ATCCOM+124                                               01914000
ATCFEPT  EQU   ATCCOM+120                                               01915000
ATCFDVT  EQU   ATCCOM+116                                               01916000
ATCCONFT EQU   ATCCOM+112                                               01917000
ATCPTCHA EQU   ATCCOM+108                                               01918000
ATCAUTHA EQU   ATCCOM+104                                               01919000
ATCACCTA EQU   ATCCOM+100                                               01920000
ATCRDTH  EQU   ATCCOM+96                                                01921000
ATCFRSCH EQU   ATCCOM+92                                                01922000
ATCFSB   EQU   ATCCOM+88                                                01923000
ATCHLTMS EQU   ATCCOM+84                                                01924000
ATCECPRM EQU   ATCCOM+80                                                01925000
ATCECNET EQU   ATCCOM+76                                                01926000
ATCECOPC EQU   ATCCOM+72                                                01927000
ATCVPARM EQU   ATCCOM+68                                                01928000
ATCECVRQ EQU   ATCCOM+64                                                01929000
ATCECSES EQU   ATCCOM+60                                                01930000
ATCOCHA  EQU   ATCCOM+56                                                01931000
ATCDSPLQ EQU   ATCCOM+52                                                01932000
ATCECDSP EQU   ATCCOM+48                                                01933000
ATCVARYQ EQU   ATCCOM+44                                                01934000
ATCECVRY EQU   ATCCOM+40                                                01935000
ATCHALTQ EQU   ATCCOM+36                                                01936000
ATCECHLT EQU   ATCCOM+32                                                01937000
ATCMODQ  EQU   ATCCOM+28                                                01938000
ATCECMOD EQU   ATCCOM+24                                                01939000
ATCASCHD EQU   ATCCOM+20                                                01940000
ATCSRT   EQU   ATCCOM+16                                                01941000
ATCRDT   EQU   ATCCOM+12                                                01942000
ATCDCFRR EQU   ATCCOM+8                                                 01943000
ATCAPI   EQU   ATCCOM+4                                                 01944000
ATCRSV04 EQU   ATCSTAT4                                                 01945000
ATCNCSD  EQU   ATCSTAT4                                                 01946000
ATCMTST  EQU   ATCSTAT4                                                 01947000
ATCTPRT  EQU   ATCSTAT4                                                 01948000
ATCPRTAT EQU   ATCSTAT4                                                 01949000
@NM00073 EQU   ATCPOFLG                                                 01950000
ATCPOUNS EQU   ATCPOFLG                                                 01951000
ATCHSDMF EQU   ATCSTFLG                                                 01952000
@NM00072 EQU   ATCSTAT1                                                 01953000
ATCINHLT EQU   ATCSTAT1                                                 01954000
ATCNETSL EQU   ATCSTAT1                                                 01955000
ATCQKHLT EQU   ATCSTAT1                                                 01956000
ATCSNHLT EQU   ATCSTAT1                                                 01957000
ATCACTIV EQU   ATCSTAT1                                                 01958000
ATCSTART EQU   ATCSTAT1                                                 01959000
DYPPAB   EQU   ISTDYPAB+16                                              01960000
DYPRSV01 EQU   ISTDYPAB+12                                              01961000
DYPTSKID EQU   ISTDYPAB+8                                               01962000
DYPCHAIN EQU   ISTDYPAB+4                                               01963000
DYPFLGS  EQU   ISTDYPAB+2                                               01964000
DYPLNGTH EQU   ISTDYPAB+1                                               01965000
DYPTYPE  EQU   ISTDYPAB                                                 01966000
TCCCHAIN EQU   ISTTCCW+4                                                01967000
TCCRSVD  EQU   ISTTCCW+2                                                01968000
TCCLNGTH EQU   ISTTCCW+1                                                01969000
TCCTYPE  EQU   ISTTCCW                                                  01970000
FMCFLRSV EQU   FMCFLGB                                                  01971000
FMCFLGA8 EQU   FMCFLGB                                                  01972000
FMCCLRPH EQU   FMCVS1+45                                                01973000
FMCRSV0X EQU   FMCCVFLG                                                 01974000
FMCVYRPH EQU   FMCCVFLG                                                 01975000
FMCZV004 EQU   FMCVS1+40                                                01976000
FMCLOCK2 EQU   FMCVS1+36                                                01977000
@NM00071 EQU   FMCZFLG2                                                 01978000
FMCZF027 EQU   FMCZFLG2                                                 01979000
FMCZF026 EQU   FMCZFLG2                                                 01980000
FMCSEQ1B EQU   FMCSEQ1                                                  01981000
FMCSEQ1T EQU   FMCSEQ1                                                  01982000
FMCZX006 EQU   FMCVS1+33                                                01983000
FMCZX005 EQU   FMCVS1+32                                                01984000
FMCZX004 EQU   FMCVS1+31                                                01985000
FMCZX003 EQU   FMCVS1+30                                                01986000
FMCZX002 EQU   FMCVS1+29                                                01987000
FMCZX001 EQU   FMCVS1+28                                                01988000
FMCZV001 EQU   FMCVS1+24                                                01989000
FMCAWATQ EQU   FMCLCPAQ+1                                               01990000
@NM00070 EQU   FMCLCPAQ                                                 01991000
FMCLCPB2 EQU   FMCLCPBQ+1                                               01992000
FMCLCPB1 EQU   FMCLCPBQ                                                 01993000
FMCASCDQ EQU   FMCSHEAQ+1                                               01994000
@NM00069 EQU   FMCSHEAQ                                                 01995000
FMCSHEDQ EQU   FMCVS1+8                                                 01996000
FMCZFCSQ EQU   FMCVS1+6                                                 01997000
FMCZH001 EQU   FMCVS1+4                                                 01998000
FMCZF025 EQU   FMCZFLAG+3                                               01999000
FMCZF024 EQU   FMCZFLAG+3                                               02000000
FMCZF023 EQU   FMCZFLAG+3                                               02001000
FMCZF022 EQU   FMCZFLAG+3                                               02002000
FMCZF021 EQU   FMCZFLAG+3                                               02003000
FMCZF020 EQU   FMCZFLAG+3                                               02004000
FMCZF019 EQU   FMCZFLAG+3                                               02005000
FMCZF018 EQU   FMCZFLAG+3                                               02006000
FMCZF017 EQU   FMCZFLAG+2                                               02007000
FMCZF016 EQU   FMCZFLAG+2                                               02008000
FMCZF015 EQU   FMCZFLAG+2                                               02009000
FMCZF014 EQU   FMCZFLAG+2                                               02010000
FMCZF013 EQU   FMCZFLAG+2                                               02011000
FMCZF012 EQU   FMCZFLAG+2                                               02012000
FMCZF011 EQU   FMCZFLAG+2                                               02013000
FMCZF010 EQU   FMCZFLAG+2                                               02014000
FMCZF00F EQU   FMCZFLAG+1                                               02015000
FMCZF00E EQU   FMCZFLAG+1                                               02016000
FMCZF00D EQU   FMCZFLAG+1                                               02017000
FMCZF00C EQU   FMCZFLAG+1                                               02018000
FMCZF00B EQU   FMCZFLAG+1                                               02019000
FMCRSV10 EQU   FMCZFLAG+1                                               02020000
FMCZF009 EQU   FMCZFLAG+1                                               02021000
FMCZFD06 EQU   FMCZF006+1                                               02022000
FMCZFC06 EQU   FMCZF006                                                 02023000
FMCZFB06 EQU   FMCZF006                                                 02024000
FMCZFA06 EQU   FMCZF006                                                 02025000
FMCZF005 EQU   FMCZFLAG                                                 02026000
FMCZF004 EQU   FMCZFLAG                                                 02027000
FMCZF003 EQU   FMCZFLAG                                                 02028000
FMCZF002 EQU   FMCZFLAG                                                 02029000
FMCZF001 EQU   FMCZFLAG                                                 02030000
FMCFRESA EQU   ISTFMCB+228                                              02031000
FMCSCSQN EQU   FMCSNCTL+2                                               02032000
FMCSCCTL EQU   FMCSNCTL+1                                               02033000
FMCSTCTL EQU   FMCSCFLG                                                 02034000
FMCSCCLO EQU   FMCSCFLG                                                 02035000
FMCAPRO  EQU   FMCSCFLG                                                 02036000
FMCLURO  EQU   FMCSCFLG                                                 02037000
FMCOBSAC EQU   FMCSCFLG                                                 02038000
FMCIBSAC EQU   FMCSCFLG                                                 02039000
FMCFBRE  EQU   ISTFMCB+220                                              02040000
FMCFBXM  EQU   FMCZV002                                                 02041000
FMCASEGQ EQU   ISTFMCB+212                                              02042000
FMCRDTPT EQU   ISTFMCB+208                                              02043000
FMCLOCK  EQU   ISTFMCB+204                                              02044000
FMCSEGD  EQU   FMCSSEGQ                                                 02045000
FMCRSPLM EQU   ISTFMCB+198                                              02046000
FMCPSTRS EQU   ISTFMCB+196                                              02047000
@NM00068 EQU   FMCRRESP                                                 02048000
FMCTSLHA EQU   FMCRRESP                                                 02049000
FMCFRRN  EQU   FMCRRESP                                                 02050000
FMCFME   EQU   FMCRRESP                                                 02051000
FMCFEX   EQU   FMCRRESP                                                 02052000
FMCFPE   EQU   FMCRRESP                                                 02053000
FMCCTLB  EQU   ISTFMCB+194                                              02054000
FMCBSQNO EQU   FMCCLSEQ+2                                               02055000
FMCTSQNO EQU   FMCCLSEQ                                                 02056000
FMCOBPRG EQU   FMCMODEB                                                 02057000
FMCIBPRG EQU   FMCMODEB                                                 02058000
FMCRESOT EQU   FMCMODEB                                                 02059000
FMCRSTSR EQU   FMCMODEB                                                 02060000
FMCLUQ   EQU   FMCMODEB                                                 02061000
FMCAPQ   EQU   FMCMODEB                                                 02062000
FMCCLEAR EQU   FMCMODEB                                                 02063000
FMCHOLD  EQU   FMCMODEB                                                 02064000
FMCIPSEQ EQU   ISTFMCB+188                                              02065000
FMCLUSTR EQU   ISTFMCB+187                                              02066000
FMCRSV87 EQU   FMCSTAT2                                                 02067000
FMCSEQI  EQU   FMCSTAT2                                                 02068000
FMCCPIP  EQU   FMCSTAT2                                                 02069000
FMCALIPR EQU   FMCSTAT2                                                 02070000
FMCIAIO  EQU   FMCSTAT2                                                 02071000
FMCZF00A EQU   FMCSTAT2                                                 02072000
FMCVPIP  EQU   FMCSTAT2                                                 02073000
FMCBHSET EQU   ISTFMCB+185                                              02074000
FMCPRMRC EQU   FMCCLEXT+20                                              02075000
FMCRSV89 EQU   FMCPSTAT                                                 02076000
FMCPCLSD EQU   FMCPSTAT                                                 02077000
FMCDDOCD EQU   FMCPSTAT                                                 02078000
FMCIDVFD EQU   FMCPSTAT                                                 02079000
FMCELKST EQU   FMCPSTAT                                                 02080000
FMCRSV88 EQU   FMCPSCMD                                                 02081000
FMCRDBLK EQU   FMCPSCMD                                                 02082000
FMCDSEOC EQU   FMCPSCMD                                                 02083000
FMCPURGE EQU   FMCPSCMD                                                 02084000
FMCRESTI EQU   FMCPSCMD                                                 02085000
FMCCNTCT EQU   FMCPSCMD                                                 02086000
FMCINVT  EQU   FMCPSCMD                                                 02087000
FMCFLGB7 EQU   FMCFLGCL                                                 02088000
FMCFLGB6 EQU   FMCFLGCL                                                 02089000
FMCFLGB5 EQU   FMCFLGCL                                                 02090000
FMCFLGB4 EQU   FMCFLGCL                                                 02091000
FMCFLGB3 EQU   FMCFLGCL                                                 02092000
FMCFLGB2 EQU   FMCFLGCL                                                 02093000
FMCFLGB1 EQU   FMCFLGCL                                                 02094000
FMCFLGB0 EQU   FMCFLGCL                                                 02095000
FMCFLGA7 EQU   FMCFLGA                                                  02096000
FMCFLGA6 EQU   FMCFLGA                                                  02097000
FMCFLGA5 EQU   FMCFLGA                                                  02098000
FMCFLGA4 EQU   FMCFLGA                                                  02099000
FMCFLGA3 EQU   FMCFLGA                                                  02100000
FMCFLGA2 EQU   FMCFLGA                                                  02101000
FMCFLGA1 EQU   FMCFLGA                                                  02102000
FMCFLGA0 EQU   FMCFLGA                                                  02103000
FMCDCLOK EQU   FMCCLEXT+12                                              02104000
FMCRAFM  EQU   FMCCLEXT+8                                               02105000
FMCFBPTR EQU   FMCFBA+1                                                 02106000
FMCFBRSV EQU   FMCFBA                                                   02107000
FMCRPLPT EQU   FMCRPLA+1                                                02108000
FMCRPLRS EQU   FMCRPLA                                                  02109000
FMCPRCLS EQU   FMCCVAL                                                  02110000
FMCIBCE  EQU   FMCCVAL                                                  02111000
FMCONLY  EQU   FMCOBCE                                                  02112000
FMCLAST  EQU   FMCOBCE                                                  02113000
FMCMIDLE EQU   FMCOBCE                                                  02114000
FMCFIRST EQU   FMCOBCE                                                  02115000
FMCCPCNT EQU   FMCPACPC                                                 02116000
FMCMPCNT EQU   FMCPACEM                                                 02117000
FMCNPCNT EQU   FMCPACEN                                                 02118000
FMCCONF  EQU   FMCSSTAT                                                 02119000
FMCPURCH EQU   FMCSSTAT                                                 02120000
FMCNSALU EQU   FMCSSTAT                                                 02121000
FMCBIP   EQU   FMCSSTAT                                                 02122000
FMCSDTR  EQU   FMCSSTAT                                                 02123000
FMCUIPI  EQU   FMCSSTAT                                                 02124000
FMCCIPI  EQU   FMCSSTAT                                                 02125000
FMCSNBI  EQU   FMCSSTAT                                                 02126000
FMCRVD01 EQU   ISTFMCB+158                                              02127000
FMCISSN  EQU   ISTFMCB+156                                              02128000
FMCOASN  EQU   FMCNXOSC                                                 02129000
FMCOSSN  EQU   FMCNXCFM                                                 02130000
FMCSIP   EQU   FMCSIPA                                                  02131000
FMCEXLST EQU   ISTFMCB+144                                              02132000
FMCPAB5  EQU   ISTFMCB+128                                              02133000
FMCPAB4  EQU   ISTFMCB+112                                              02134000
FMCPAB3  EQU   ISTFMCB+96                                               02135000
FMCPAB2  EQU   ISTFMCB+80                                               02136000
FMCPAB1  EQU   ISTFMCB+64                                               02137000
FMCFASYA EQU   ISTFMCB+60                                               02138000
FMCMODE  EQU   ISTFMCB+52                                               02139000
FMCPROCD EQU   ISTFMCB+48                                               02140000
FMCVWT   EQU   ISTFMCB+44                                               02141000
FMCRPLH  EQU   ISTFMCB+40                                               02142000
FMCBUFNB EQU   FMCCMPS1+2                                               02143000
FMCBUFLM EQU   FMCCMPS1                                                 02144000
FMCDEBA  EQU   ISTFMCB+32                                               02145000
@NM00067 EQU   FMCCMDFL                                                 02146000
FMCSNA   EQU   FMCCMDFL                                                 02147000
FMCVSNA  EQU   FMCCMDFL                                                 02148000
FMCCMDR  EQU   FMCCMDFL                                                 02149000
@NM00066 EQU   ISTFMCB+30                                               02150000
@NM00065 EQU   FMCSTAT1                                                 02151000
FMCHPURG EQU   FMCSTAT1                                                 02152000
FMCVSP2  EQU   FMCSTAT1                                                 02153000
FMCVSP1  EQU   FMCSTAT                                                  02154000
FMCLTEAS EQU   FMCSTAT                                                  02155000
FMCZF007 EQU   FMCSTAT                                                  02156000
FMCDEDSC EQU   FMCSTAT                                                  02157000
FMCDEVOF EQU   FMCSTAT                                                  02158000
FMCDAPT  EQU   FMCSTAT                                                  02159000
FMCPRMTE EQU   FMCSTAT                                                  02160000
FMCPRMTR EQU   FMCSTAT                                                  02161000
FMCUSFLD EQU   ISTFMCB+24                                               02162000
FMCFMCBA EQU   ISTFMCB+20                                               02163000
FMCDNCBA EQU   ISTFMCB+16                                               02164000
FMCDVTA  EQU   ISTFMCB+12                                               02165000
FMCTSKID EQU   ISTFMCB+8                                                02166000
FMCNXTCB EQU   ISTFMCB+4                                                02167000
FMCLNGTH EQU   ISTFMCB+1                                                02168000
FMCTYPE  EQU   ISTFMCB                                                  02169000
PROSRDEF EQU   PROSETM4                                                 02170000
PRORSV47 EQU   PROSETM4                                                 02171000
PROSCON  EQU   PROSETM4                                                 02172000
PRORSV46 EQU   PROSETM3                                                 02173000
PROSMONT EQU   PROSETM3                                                 02174000
PRORSV45 EQU   PROSETM3                                                 02175000
PROSNTO  EQU   PROSETM3                                                 02176000
PRORSV44 EQU   PROSETM3                                                 02177000
PRORSV43 EQU   PROSETM2                                                 02178000
PROSNTFL EQU   PROSETM2                                                 02179000
PRORSV42 EQU   PROSETM2                                                 02180000
PRORSV41 EQU   PROPROCS                                                 02181000
PROMODC  EQU   PROPROC4                                                 02182000
PROMODT  EQU   PROPROC4                                                 02183000
PROMODM  EQU   PROPROC4                                                 02184000
PROMODB  EQU   PROPROC4                                                 02185000
PRORSV14 EQU   PROPROC4                                                 02186000
PRORSV13 EQU   PROPROC4                                                 02187000
PRORSV12 EQU   PROPROC4                                                 02188000
PROEIB   EQU   PROPROC4                                                 02189000
PRORSV11 EQU   PROPROC3                                                 02190000
PROMONT2 EQU   PROPROC3                                                 02191000
PROMONIT EQU   PROPROC3                                                 02192000
PROSUBLK EQU   PROPROC3                                                 02193000
PRONTO   EQU   PROPROC3                                                 02194000
PROLGIN  EQU   PROPROC3                                                 02195000
PROERPI  EQU   PROPROC3                                                 02196000
PRORSV07 EQU   PROPROC3                                                 02197000
PROCFTX  EQU   PROPROC2                                                 02198000
PROEMLC  EQU   PROPROC2                                                 02199000
PRONTFL  EQU   PROPROC2                                                 02200000
PRORSV05 EQU   PROPROC2                                                 02201000
PRORSV04 EQU   PROPROC2                                                 02202000
PROLGOT  EQU   PROPROC2                                                 02203000
PROERPO  EQU   PROPROC2                                                 02204000
PRORSV03 EQU   PROPROC2                                                 02205000
PRORPLC  EQU   PROPROC1                                                 02206000
PROCS    EQU   PROPROC1                                                 02207000
PROCA    EQU   PROPROC1                                                 02208000
PRORESPX EQU   PROPROC1                                                 02209000
PRODFASY EQU   PROPROC1                                                 02210000
PROXPOPT EQU   PROPROC1                                                 02211000
PROTRUNC EQU   PROPROC1                                                 02212000
PROASYIP EQU   PROPROC1                                                 02213000
CRACHAIN EQU   ISTCRA+928                                               02214000
CRARSV02 EQU   ISTCRA+924                                               02215000
CRARSV01 EQU   ISTCRA+920                                               02216000
CRABFTBA EQU   CRABUFA                                                  02217000
CRAMASK  EQU   CRASVC+64                                                02218000
CRAHSIZ  EQU   CRASVC+60                                                02219000
CRAASCRR EQU   CRASVC                                                   02220000
CRAPROCR EQU   ISTCRA+312                                               02221000
CRAPSS   EQU   ISTCRA+160                                               02222000
CRARPH   EQU   ISTCRA+52                                                02223000
CRALAPTR EQU   CRABASIC+48                                              02224000
CRAL9PTR EQU   CRABASIC+44                                              02225000
CRAL8PTR EQU   CRABASIC+40                                              02226000
CRAL7PTR EQU   CRABASIC+36                                              02227000
CRAL6PTR EQU   CRABASIC+32                                              02228000
CRAL5PTR EQU   CRABASIC+28                                              02229000
CRAL4PTR EQU   CRABASIC+24                                              02230000
CRAL3PTR EQU   CRABASIC+20                                              02231000
CRAL2PTR EQU   CRABASIC+16                                              02232000
CRAL1PTR EQU   CRABASIC+12                                              02233000
CRALEV01 EQU   CRALKACT+3                                               02234000
CRALEV02 EQU   CRALKACT+3                                               02235000
CRALEV03 EQU   CRALKACT+3                                               02236000
CRALEV04 EQU   CRALKACT+3                                               02237000
CRALEV05 EQU   CRALKACT+3                                               02238000
CRALEV06 EQU   CRALKACT+3                                               02239000
CRALEV07 EQU   CRALKACT+3                                               02240000
CRALEV08 EQU   CRALKACT+3                                               02241000
CRALEV09 EQU   CRALKACT+2                                               02242000
CRALEV10 EQU   CRALKACT+2                                               02243000
CRALEV11 EQU   CRALKACT+2                                               02244000
CRALEV12 EQU   CRALKACT+2                                               02245000
CRALEV13 EQU   CRALKACT+2                                               02246000
CRALEV14 EQU   CRALKACT+2                                               02247000
CRALEV15 EQU   CRALKACT+2                                               02248000
CRALEV16 EQU   CRALKACT+2                                               02249000
CRALEV17 EQU   CRALKACT+1                                               02250000
CRALEV18 EQU   CRALKACT+1                                               02251000
CRALEV19 EQU   CRALKACT+1                                               02252000
CRALEV20 EQU   CRALKACT+1                                               02253000
CRALEV21 EQU   CRALKACT+1                                               02254000
CRALEV22 EQU   CRALKACT+1                                               02255000
CRALEV23 EQU   CRALKACT+1                                               02256000
CRALEV24 EQU   CRALKACT+1                                               02257000
CRALEV25 EQU   CRALKACT                                                 02258000
CRALEV26 EQU   CRALKACT                                                 02259000
CRALEV27 EQU   CRALKACT                                                 02260000
CRALEV28 EQU   CRALKACT                                                 02261000
CRALEV29 EQU   CRALKACT                                                 02262000
CRALEV30 EQU   CRALKACT                                                 02263000
CRALEV31 EQU   CRALKACT                                                 02264000
CRALEV32 EQU   CRALKACT                                                 02265000
CRAFRR   EQU   CRAHDR+4                                                 02266000
@NM00064 EQU   ISTAPCRR+137                                             02267000
@NM00063 EQU   APC57FLG                                                 02268000
APCNREL  EQU   APC57FLG                                                 02269000
APCRECRA EQU   APC57FLG                                                 02270000
@NM00062 EQU   APC54FLG                                                 02271000
APCRLST  EQU   APC54FLG                                                 02272000
APCPR153 EQU   APC53FLG                                                 02273000
@NM00061 EQU   APC52FLG                                                 02274000
APCWKF   EQU   APC52FLG                                                 02275000
APCNWF   EQU   APC52FLG                                                 02276000
APCRDQ   EQU   APC52FLG                                                 02277000
APCQENQ  EQU   APC52FLG                                                 02278000
APCSMSR  EQU   APC52FLG                                                 02279000
APCCKRQ  EQU   APC52FLG                                                 02280000
@NM00060 EQU   APC31FLG                                                 02281000
APCSORT  EQU   APC31FLG                                                 02282000
APCRESCH EQU   APC31FLG                                                 02283000
APCTPXIT EQU   APC31FLG                                                 02284000
APCSWTWD EQU   ISTAPCRR+128                                             02285000
APCSAV2  EQU   ISTAPCRR+124                                             02286000
APCSAV1  EQU   ISTAPCRR+120                                             02287000
APCRETCD EQU   APCCOMF+2                                                02288000
@NM00059 EQU   APCCOMF1+1                                               02289000
APCZLBER EQU   APCCOMF1                                                 02290000
APCEXIT  EQU   APCCOMF1                                                 02291000
APCRELR  EQU   APCCOMF1                                                 02292000
APCIRB2  EQU   APCCOMF1                                                 02293000
APCIRB1  EQU   APCCOMF1                                                 02294000
APCSMCR  EQU   APCCOMF1                                                 02295000
APCUETSK EQU   APCCOMF1                                                 02296000
APCSSTSK EQU   APCCOMF1                                                 02297000
APCESTAL EQU   APCSAVE                                                  02298000
APCFRRPM EQU   ISTAPCRR+40                                              02299000
APCQWFO  EQU   ISTAPCRR+36                                              02300000
APCPABSV EQU   ISTAPCRR+32                                              02301000
APCRTRN  EQU   ISTAPCRR+28                                              02302000
APCTCBA  EQU   ISTAPCRR+24                                              02303000
APCPSTA  EQU   ISTAPCRR+20                                              02304000
@NM00058 EQU   APCRFLG+1                                                02305000
APC31R   EQU   APCRFLG                                                  02306000
APC58R   EQU   APCRFLG                                                  02307000
APC57R   EQU   APCRFLG                                                  02308000
APC56R   EQU   APCRFLG                                                  02309000
APC54R   EQU   APCRFLG                                                  02310000
APC53R   EQU   APCRFLG                                                  02311000
APC52R   EQU   APCRFLG                                                  02312000
APC51R   EQU   APCRFLG                                                  02313000
@NM00057 EQU   APCATFLG+1                                               02314000
APC31E   EQU   APCATFLG                                                 02315000
APC58E   EQU   APCATFLG                                                 02316000
APC57E   EQU   APCATFLG                                                 02317000
APC56E   EQU   APCATFLG                                                 02318000
APC54E   EQU   APCATFLG                                                 02319000
APC53E   EQU   APCATFLG                                                 02320000
APC52E   EQU   APCATFLG                                                 02321000
APC51E   EQU   APCATFLG                                                 02322000
APCHDRSV EQU   ISTAPCRR                                                 02323000
ASCPSREG EQU   ISTASCRR+44                                              02324000
ASCUSR01 EQU   ASCUSRGS+12                                              02325000
ASCUSR00 EQU   ASCUSRGS+8                                               02326000
ASCUSR15 EQU   ASCUSRGS+4                                               02327000
ASCUSR14 EQU   ASCUSRGS                                                 02328000
ASCETRYA EQU   ISTASCRR+24                                              02329000
ASCKEY   EQU   ISTASCRR+23                                              02330000
ASCAUDIT EQU   ASCFLG3                                                  02331000
ASCFBDUD EQU   ASCFLG3                                                  02332000
ASCLLKF  EQU   ASCFLG3                                                  02333000
ASCKEYF  EQU   ASCFLG3                                                  02334000
ASCFBDAL EQU   ASCFLG3                                                  02335000
ASCFSRGT EQU   ASCFLG3                                                  02336000
ASCICR   EQU   ASCFLG2                                                  02337000
ASCFSRIC EQU   ASCFLG2                                                  02338000
ASCFBDIC EQU   ASCFLG2                                                  02339000
ASCFBAIC EQU   ASCFLG2                                                  02340000
ASCPASTR EQU   ASCFLG1                                                  02341000
ASCFSR   EQU   ASCFLG1                                                  02342000
ASCFBD   EQU   ASCFLG1                                                  02343000
ASCFBA   EQU   ASCFLG1                                                  02344000
ASCPFCRR EQU   ISTASCRR                                                 02345000
CCFRSVD1 EQU   CFCCRT                                                   02346000
CCFCR2   EQU   CFCCRT                                                   02347000
CCFCRP   EQU   CFCCRT                                                   02348000
CCFCR1   EQU   CFCCRT                                                   02349000
CCFCS2   EQU   CFCCRT                                                   02350000
CCFCS1   EQU   CFCCRT                                                   02351000
NCFRSVD  EQU   CFCNTRD                                                  02352000
NCFCR2   EQU   CFCNTRD                                                  02353000
NCFCRP   EQU   CFCNTRD                                                  02354000
NCFCR1   EQU   CFCNTRD                                                  02355000
NCFCS2   EQU   CFCNTRD                                                  02356000
NCFCS1   EQU   CFCNTRD                                                  02357000
PFCRSV01 EQU   ISTPFCRR+13                                              02358000
PFCFTA   EQU   ISTPFCRR+12                                              02359000
CRRFRR   EQU   PFCFRRO                                                  02360000
CRRCHAIN EQU   PFCCRRO                                                  02361000
CRRLEN   EQU   PFCCRRLN                                                 02362000
PFCRSV10 EQU   PFCCRR+1                                                 02363000
CRRID    EQU   PFCCRRID                                                 02364000
ZCRRU    EQU   ZCRRHRU+3                                                02365000
ZCRRH    EQU   ZCRRHRU                                                  02366000
ZCRWORDA EQU   ISTZCRR+477                                              02367000
ZCRCMNRC EQU   ISTZCRR+476                                              02368000
ZCRRSV97 EQU   ZCRENTER+18                                              02369000
ZCREIC2B EQU   ZCRENTER+18                                              02370000
ZCREAC2B EQU   ZCRENTER+18                                              02371000
ZCRELCAB EQU   ZCRENTER+18                                              02372000
ZCREDCMF EQU   ZCRENTER+18                                              02373000
ZCREBCIF EQU   ZCRENTER+18                                              02374000
ZCREICSG EQU   ZCRENTER+18                                              02375000
ZCREDCK0 EQU   ZCRENTER+18                                              02376000
ZCRECFY0 EQU   ZCRENTER+17                                              02377000
ZCREKCCB EQU   ZCRENTER+17                                              02378000
ZCREDCNB EQU   ZCRENTER+17                                              02379000
ZCREICOE EQU   ZCRENTER+17                                              02380000
ZCREBCNB EQU   ZCRENTER+17                                              02381000
ZCREBC0L EQU   ZCRENTER+17                                              02382000
ZCREBCAL EQU   ZCRENTER+17                                              02383000
ZCREDCQR EQU   ZCRENTER+17                                              02384000
ZCREDCPR EQU   ZCRENTER+16                                              02385000
ZCREBCSB EQU   ZCRENTER+16                                              02386000
ZCREAC1R EQU   ZCRENTER+16                                              02387000
ZCRECCCI EQU   ZCRENTER+16                                              02388000
ZCRECCAI EQU   ZCRENTER+16                                              02389000
ZCRECCBI EQU   ZCRENTER+16                                              02390000
ZCREBCAR EQU   ZCRENTER+16                                              02391000
ZCREBCDR EQU   ZCRENTER+16                                              02392000
ZCREBCBR EQU   ZCRENTER+15                                              02393000
ZCREDCXR EQU   ZCRENTER+15                                              02394000
ZCREDCWB EQU   ZCRENTER+15                                              02395000
ZCREDCWR EQU   ZCRENTER+15                                              02396000
ZCREKCCN EQU   ZCRENTER+15                                              02397000
ZCREKCBN EQU   ZCRENTER+15                                              02398000
ZCREKCBB EQU   ZCRENTER+15                                              02399000
ZCREJC0B EQU   ZCRENTER+15                                              02400000
ZCREJCDB EQU   ZCRENTER+14                                              02401000
ZCREJCCB EQU   ZCRENTER+14                                              02402000
ZCREJCBB EQU   ZCRENTER+14                                              02403000
ZCREJCAB EQU   ZCRENTER+14                                              02404000
ZCREIC1B EQU   ZCRENTER+14                                              02405000
ZCREIC0B EQU   ZCRENTER+14                                              02406000
ZCREICX0 EQU   ZCRENTER+14                                              02407000
ZCREICWB EQU   ZCRENTER+14                                              02408000
ZCREICVB EQU   ZCRENTER+13                                              02409000
ZCREICUB EQU   ZCRENTER+13                                              02410000
ZCREICTB EQU   ZCRENTER+13                                              02411000
ZCREICSC EQU   ZCRENTER+13                                              02412000
ZCREICSB EQU   ZCRENTER+13                                              02413000
ZCREICRB EQU   ZCRENTER+13                                              02414000
ZCREICQB EQU   ZCRENTER+13                                              02415000
ZCREICQA EQU   ZCRENTER+13                                              02416000
ZCREICOB EQU   ZCRENTER+12                                              02417000
ZCREICOA EQU   ZCRENTER+12                                              02418000
ZCREICNB EQU   ZCRENTER+12                                              02419000
ZCREICNA EQU   ZCRENTER+12                                              02420000
ZCREICMB EQU   ZCRENTER+12                                              02421000
ZCREICLB EQU   ZCRENTER+12                                              02422000
ZCREICKG EQU   ZCRENTER+12                                              02423000
ZCREICKE EQU   ZCRENTER+12                                              02424000
ZCREICKB EQU   ZCRENTER+11                                              02425000
ZCREICJB EQU   ZCRENTER+11                                              02426000
ZCREICID EQU   ZCRENTER+11                                              02427000
ZCREICIB EQU   ZCRENTER+11                                              02428000
ZCREICHB EQU   ZCRENTER+11                                              02429000
ZCREICGB EQU   ZCRENTER+11                                              02430000
ZCREICEB EQU   ZCRENTER+11                                              02431000
ZCREICDB EQU   ZCRENTER+11                                              02432000
ZCREICCI EQU   ZCRENTER+10                                              02433000
ZCREICCB EQU   ZCRENTER+10                                              02434000
ZCREICBI EQU   ZCRENTER+10                                              02435000
ZCREICBB EQU   ZCRENTER+10                                              02436000
ZCREICAB EQU   ZCRENTER+10                                              02437000
ZCREICAA EQU   ZCRENTER+10                                              02438000
ZCREHCAN EQU   ZCRENTER+10                                              02439000
ZCREGC0B EQU   ZCRENTER+10                                              02440000
ZCREGC0A EQU   ZCRENTER+9                                               02441000
ZCREGCLA EQU   ZCRENTER+9                                               02442000
ZCREGCEB EQU   ZCRENTER+9                                               02443000
ZCREGCDB EQU   ZCRENTER+9                                               02444000
@NM00056 EQU   ZCRENTER+9                                               02445000
ZCREGCBB EQU   ZCRENTER+9                                               02446000
ZCREGCAB EQU   ZCRENTER+9                                               02447000
ZCREFCEB EQU   ZCRENTER+9                                               02448000
ZCREFCEA EQU   ZCRENTER+8                                               02449000
ZCREECTA EQU   ZCRENTER+8                                               02450000
ZCREECEA EQU   ZCRENTER+8                                               02451000
ZCREECDA EQU   ZCRENTER+8                                               02452000
ZCREECCB EQU   ZCRENTER+8                                               02453000
ZCREECCA EQU   ZCRENTER+8                                               02454000
ZCREECBB EQU   ZCRENTER+8                                               02455000
ZCREECBA EQU   ZCRENTER+8                                               02456000
ZCREDCMB EQU   ZCRENTER+7                                               02457000
ZCREDCL0 EQU   ZCRENTER+7                                               02458000
ZCREDCKB EQU   ZCRENTER+7                                               02459000
ZCREDCKA EQU   ZCRENTER+7                                               02460000
ZCREDCJ0 EQU   ZCRENTER+7                                               02461000
ZCREDCI0 EQU   ZCRENTER+7                                               02462000
ZCREDCH0 EQU   ZCRENTER+7                                               02463000
ZCREDCF0 EQU   ZCRENTER+7                                               02464000
ZCREDCE0 EQU   ZCRENTER+6                                               02465000
ZCREDCD0 EQU   ZCRENTER+6                                               02466000
ZCREDCC0 EQU   ZCRENTER+6                                               02467000
ZCREDCB0 EQU   ZCRENTER+6                                               02468000
ZCREDCA0 EQU   ZCRENTER+6                                               02469000
ZCRECC2B EQU   ZCRENTER+6                                               02470000
ZCRECC1B EQU   ZCRENTER+6                                               02471000
ZCRECC1A EQU   ZCRENTER+6                                               02472000
ZCRECC0B EQU   ZCRENTER+5                                               02473000
ZCRECC0A EQU   ZCRENTER+5                                               02474000
ZCREBC0B EQU   ZCRENTER+5                                               02475000
ZCREBC0A EQU   ZCRENTER+5                                               02476000
ZCREBCZ0 EQU   ZCRENTER+5                                               02477000
ZCREBCY0 EQU   ZCRENTER+5                                               02478000
ZCREBCX0 EQU   ZCRENTER+5                                               02479000
ZCREBCXA EQU   ZCRENTER+5                                               02480000
ZCREBCSC EQU   ZCRENTER+4                                               02481000
ZCREBCRB EQU   ZCRENTER+4                                               02482000
ZCREBCRA EQU   ZCRENTER+4                                               02483000
ZCREBCQB EQU   ZCRENTER+4                                               02484000
ZCREBCPB EQU   ZCRENTER+4                                               02485000
ZCREBCOB EQU   ZCRENTER+4                                               02486000
ZCREBCNE EQU   ZCRENTER+4                                               02487000
ZCREBCND EQU   ZCRENTER+4                                               02488000
ZCREBCMB EQU   ZCRENTER+3                                               02489000
ZCREBCLB EQU   ZCRENTER+3                                               02490000
ZCREBCLA EQU   ZCRENTER+3                                               02491000
ZCREBCKB EQU   ZCRENTER+3                                               02492000
ZCREBCKA EQU   ZCRENTER+3                                               02493000
ZCREBCJB EQU   ZCRENTER+3                                               02494000
ZCREBCJA EQU   ZCRENTER+3                                               02495000
ZCREBCID EQU   ZCRENTER+3                                               02496000
ZCREBCIB EQU   ZCRENTER+2                                               02497000
ZCREBCIA EQU   ZCRENTER+2                                               02498000
ZCREBCHB EQU   ZCRENTER+2                                               02499000
ZCREBCHA EQU   ZCRENTER+2                                               02500000
ZCREBCGB EQU   ZCRENTER+2                                               02501000
ZCREBCGA EQU   ZCRENTER+2                                               02502000
ZCREBCFB EQU   ZCRENTER+2                                               02503000
ZCREBCFA EQU   ZCRENTER+2                                               02504000
ZCREBCEB EQU   ZCRENTER+1                                               02505000
ZCREBCDI EQU   ZCRENTER+1                                               02506000
ZCREBCCB EQU   ZCRENTER+1                                               02507000
ZCREBCBI EQU   ZCRENTER+1                                               02508000
ZCREBCBB EQU   ZCRENTER+1                                               02509000
ZCREBCBA EQU   ZCRENTER+1                                               02510000
ZCREBCAM EQU   ZCRENTER+1                                               02511000
ZCREBCAI EQU   ZCRENTER+1                                               02512000
ZCREBCAG EQU   ZCRENTER                                                 02513000
ZCREBCAE EQU   ZCRENTER                                                 02514000
ZCREBCAB EQU   ZCRENTER                                                 02515000
ZCREBCAA EQU   ZCRENTER                                                 02516000
ZCREAC1B EQU   ZCRENTER                                                 02517000
ZCREAC0B EQU   ZCRENTER                                                 02518000
ZCREAC0A EQU   ZCRENTER                                                 02519000
ZCREAC1A EQU   ZCRENTER                                                 02520000
ZCRTNAME EQU   ZCRAUDIT+1                                               02521000
ZCRTID   EQU   ZCRAUDIT                                                 02522000
ZCRREMIC EQU   ISTZCRR+436                                              02523000
ZCRSAVEZ EQU   ISTZCRR+196                                              02524000
ZCRDAFSV EQU   ZCRCIDSV+2                                               02525000
ZCRSAFSV EQU   ZCRCIDSV                                                 02526000
ZCRR13SV EQU   ISTZCRR+188                                              02527000
ZCRR2SV  EQU   ISTZCRR+184                                              02528000
ZCROPCDE EQU   ISTZCRR+183                                              02529000
ZCRPRMTC EQU   ISTZCRR+182                                              02530000
ZCRRCDSV EQU   ISTZCRR+181                                              02531000
ZCRAWQSW EQU   ISTZCRR+180                                              02532000
ZCRTOPQ  EQU   ISTZCRR+180                                              02533000
ZCRLSTFB EQU   ISTZCRR+180                                              02534000
ZCRXSCHD EQU   ISTZCRR+180                                              02535000
ZCRNXTEL EQU   ISTZCRR+180                                              02536000
ZCRSCANQ EQU   ISTZCRR+180                                              02537000
ZCRMOREL EQU   ISTZCRR+180                                              02538000
ZCRFBPRC EQU   ISTZCRR+180                                              02539000
ZCRFSBSV EQU   ISTZCRR+176                                              02540000
ZCRSVWK5 EQU   ZCRWKARA+16                                              02541000
ZCRSVWK4 EQU   ZCRWKARA+12                                              02542000
ZCRSVWK3 EQU   ZCRWKARA+8                                               02543000
ZCRSVWK2 EQU   ZCRWKARA+4                                               02544000
ZCRSVWK1 EQU   ZCRWKARA                                                 02545000
ZCRSVF25 EQU   ZCRSVRTN+96                                              02546000
ZCRSVF24 EQU   ZCRSVRTN+92                                              02547000
ZCRSVF23 EQU   ZCRSVRTN+88                                              02548000
ZCRSVF22 EQU   ZCRSVRTN+84                                              02549000
ZCRSVF21 EQU   ZCRSVRTN+80                                              02550000
ZCRSVF20 EQU   ZCRSVRTN+76                                              02551000
ZCRSVF19 EQU   ZCRSVRTN+72                                              02552000
ZCRSVF18 EQU   ZCRSVRTN+68                                              02553000
ZCRSVF17 EQU   ZCRSVRTN+64                                              02554000
ZCRSVF16 EQU   ZCRSVRTN+60                                              02555000
ZCRSVF15 EQU   ZCRSVRTN+56                                              02556000
ZCRSVF14 EQU   ZCRSVRTN+52                                              02557000
ZCRSVF13 EQU   ZCRSVRTN+48                                              02558000
ZCRSVF12 EQU   ZCRSVRTN+44                                              02559000
ZCRSVF11 EQU   ZCRSVRTN+40                                              02560000
ZCRSVF10 EQU   ZCRSVRTN+36                                              02561000
ZCRSVF9  EQU   ZCRSVRTN+32                                              02562000
ZCRSVF8  EQU   ZCRSVRTN+28                                              02563000
ZCRSVF7  EQU   ZCRSVRTN+24                                              02564000
ZCRSVF6  EQU   ZCRSVRTN+20                                              02565000
ZCRSVF5  EQU   ZCRSVRTN+16                                              02566000
ZCRSVF4  EQU   ZCRSVRTN+12                                              02567000
ZCRSVF3  EQU   ZCRSVRTN+8                                               02568000
ZCRSVF2  EQU   ZCRSVRTN+4                                               02569000
ZCRSVF1  EQU   ZCRSVRTN                                                 02570000
ZCRPVZB  EQU   ISTZCRR+52                                               02571000
ZCRZLB   EQU   ISTZCRR+48                                               02572000
ZCRBFPTR EQU   ISTZCRR+44                                               02573000
ZCRCCWA  EQU   ISTZCRR+40                                               02574000
ZCRPSW   EQU   ZCRPARMS+15                                              02575000
ZCRPCHAR EQU   ZCRPARMS+14                                              02576000
ZCRPRES2 EQU   ZCRPCOD2                                                 02577000
ZCRPMFGF EQU   ZCRPCOD2                                                 02578000
ZCRPFHDR EQU   ZCRPCOD2                                                 02579000
ZCRPPG2  EQU   ZCRPCOD2                                                 02580000
ZCRPRES  EQU   ZCRPCOD1                                                 02581000
ZCRPCFTX EQU   ZCRPCOD1                                                 02582000
ZCRPBUF  EQU   ZCRPCOD1                                                 02583000
ZCRPLSCB EQU   ZCRPCOD1                                                 02584000
ZCRPLSBQ EQU   ZCRPLSBF                                                 02585000
ZCRPFSB  EQU   ZCRPCOD1                                                 02586000
ZCRPLNG  EQU   ZCRPCOD1                                                 02587000
ZCRPPG   EQU   ZCRPCOD1                                                 02588000
ZCRDTODA EQU   ZCRDFRDA                                                 02589000
ZCRMLNG  EQU   ZCRPARMS+8                                               02590000
ZCRTBPTR EQU   ZCRPARMS+4                                               02591000
ZCRCBPTR EQU   ZCRFBPTR                                                 02592000
ZCRCRLCP EQU   ISTZCRR+20                                               02593000
@NM00055 EQU   ZCRSCPSW                                                 02594000
ZCRSKIPT EQU   ZCRSCPSW                                                 02595000
ZCRFSBWE EQU   ZCRSCPSW                                                 02596000
ZCRPRCMP EQU   ZCRSCPSW                                                 02597000
ZCRLREQ  EQU   ZCRSCPSW                                                 02598000
ZCRRJLCP EQU   ZCRSCPSW                                                 02599000
ZCRTPINV EQU   ZCRSCPSW                                                 02600000
ZCRTPEX  EQU   ZCRSCPSW                                                 02601000
@NM00054 EQU   ZCRIBPR                                                  02602000
ZCR3270R EQU   ZCRIBPR                                                  02603000
ZCR3270  EQU   ZCRIBPR                                                  02604000
ZCRLCPFD EQU   ZCRIBPR                                                  02605000
ZCRLCPFR EQU   ZCRIBPR                                                  02606000
ZCRRELK  EQU   ZCRIBPR                                                  02607000
ZCRERR   EQU   ZCRIBPR                                                  02608000
ZCRNOBUF EQU   ZCRIBPR                                                  02609000
@NM00053 EQU   ZCRPFLGS                                                 02610000
ZCRQAHED EQU   ZCRPFLGS                                                 02611000
ZCRF1RES EQU   ZCRGENSW                                                 02612000
ZCRBRIS  EQU   ZCRGENSW                                                 02613000
ZCRCLRBD EQU   ZCRGENSW                                                 02614000
ZCREXRES EQU   ZCRGENSW                                                 02615000
ZCRLCSYN EQU   ZCRGENSW                                                 02616000
ZCRRT06  EQU   ZCRGENSW                                                 02617000
ZCRTSW2  EQU   ZCRGENSW                                                 02618000
ZCRTSW1  EQU   ZCRGENSW                                                 02619000
ZCRINLCP EQU   ZCRFLGS3                                                 02620000
ZCRWRPTR EQU   ZCRFLGS3                                                 02621000
ZCRNOFRE EQU   ZCRFLGS3                                                 02622000
ZCREDRIV EQU   ZCRFLGS3                                                 02623000
ZCRDISC  EQU   ZCRFLGS3                                                 02624000
ZCRTPDIS EQU   ZCRFLGS3                                                 02625000
ZCRTPCON EQU   ZCRFLGS3                                                 02626000
ZCRTIC   EQU   ZCRFLGS3                                                 02627000
ZCRCNLXL EQU   ZCRRESET                                                 02628000
ZCRENDAN EQU   ZCRSWFLD                                                 02629000
ZCRENDXL EQU   ZCRSWFLD                                                 02630000
ZCRENDX  EQU   ZCRSWFLD                                                 02631000
ZCROB1   EQU   ZCRNDLCP                                                 02632000
ZCRENDPR EQU   ZCRSWFLD                                                 02633000
ZCREXTYP EQU   ZCRSWFLD                                                 02634000
ZCRSLCP  EQU   ZCRENDSH                                                 02635000
ZCRIF0E3 EQU   ZCRFLGS2                                                 02636000
ZCRIF0E2 EQU   ZCRFLGS2                                                 02637000
ZCRIF0E1 EQU   ZCRFLGS2                                                 02638000
ZCROB    EQU   ZCRFLGS2                                                 02639000
ZCRFMSED EQU   ZCRFLGS2                                                 02640000
ZCRSHEDI EQU   ZCRFLGS2                                                 02641000
ZCRLOCAL EQU   ZCRFLGS2                                                 02642000
ZCRFEXIT EQU   ZCRFLGS1                                                 02643000
ZCRUNSOL EQU   ZCRFLGS1                                                 02644000
ZCRENDLP EQU   ZCRFLGS1                                                 02645000
ZCRNRMEX EQU   ZCRFLGS1                                                 02646000
ZCRWAIT  EQU   ZCRFLGS1                                                 02647000
ZCRDEQSW EQU   ZCRFLGS1                                                 02648000
ZCRQUESW EQU   ZCRFLGS1                                                 02649000
ZCREXSW  EQU   ZCRFLGS1                                                 02650000
ZCRFRRA  EQU   ISTZCRR+8                                                02651000
ZCRCHAIN EQU   ISTZCRR+4                                                02652000
ZCRFLAG  EQU   ZCRCRR+3                                                 02653000
ZCRLEN   EQU   ZCRCRR+1                                                 02654000
ZCRID    EQU   ZCRCRR                                                   02655000
ZSAZTRAC EQU   ISTZSAVE+36                                              02656000
ZSAZACTV EQU   ZSAZSVMS                                                 02657000
LCPFTYPE EQU   LCPRPHA                                                  02658000
LCPRSTQH EQU   LCPLCCW                                                  02659000
LCPCLREP EQU   ISTLCPB+44                                               02660000
LCPUBFSB EQU   LCPFLCCW                                                 02661000
LCPRSV77 EQU   ISTLCPB+39                                               02662000
LCPLCCWC EQU   ISTLCPB+38                                               02663000
LCPRSV78 EQU   LCPFLG1                                                  02664000
LCPTRANS EQU   LCPFLG1                                                  02665000
LCPSTLB  EQU   LCPFLG1                                                  02666000
LCPREDRV EQU   LCPFLG1                                                  02667000
LCPDIRPT EQU   LCPFLG1                                                  02668000
LCPINTER EQU   LCPFLG1                                                  02669000
LCPRESET EQU   LCPFLG1                                                  02670000
LCPSTYPE EQU   ISTLCPB+36                                               02671000
LCPFSNCH EQU   ISTLCPB+34                                               02672000
LCPFOSN  EQU   ISTLCPB+32                                               02673000
LCPTLBAD EQU   ISTLCPB+28                                               02674000
LCPFDB2  EQU   LCPFDBA+1                                                02675000
LCPFDB1  EQU   LCPFDBA                                                  02676000
LCPDAF   EQU   LCPCID+2                                                 02677000
LCPSAF   EQU   LCPCID                                                   02678000
LCPLCCW1 EQU   ISTLCPB+12                                               02679000
LCPRRCNT EQU   LCPSEQ+1                                                 02680000
LCPRRCCT EQU   LCPSEQ                                                   02681000
LCPATOP  EQU   LCPFLAG2                                                 02682000
LCPFREE  EQU   LCPFLAG2                                                 02683000
LCPDSTAT EQU   LCPFLAG2                                                 02684000
LCPEXRES EQU   LCPFID0                                                  02685000
LCPZRIMM EQU   LCPTLBPI                                                 02686000
LCPRSTRT EQU   LCPFLAG2                                                 02687000
LCPASYN  EQU   LCPFLAG2                                                 02688000
LCPPRFLG EQU   LCPFLAG2                                                 02689000
LCPZMIRC EQU   LCPRUCNT                                                 02690000
LCPCHAI2 EQU   LCPCHAIN+1                                               02691000
LCPCHNG  EQU   LCPCHAI1                                                 02692000
LCPZRT0B EQU   LCPMNRCD                                                 02693000
LCPZRT0A EQU   LCPMNRCD                                                 02694000
LCPZRTL9 EQU   LCPZRT09                                                 02695000
LCPZRTL8 EQU   LCPZRT08                                                 02696000
LCPZRTL7 EQU   LCPZRT07                                                 02697000
LCPZRTL6 EQU   LCPZRT06                                                 02698000
LCPZRTL5 EQU   LCPZRT05                                                 02699000
LCPZRTL4 EQU   LCPZRT04                                                 02700000
LCPZRTL3 EQU   LCPZRT03                                                 02701000
LCPZRTL2 EQU   LCPZRT02                                                 02702000
LCPZRT01 EQU   LCPFLAGS                                                 02703000
LCPLNGTH EQU   ISTLCPB+1                                                02704000
LCPTYPE  EQU   ISTLCPB                                                  02705000
LCCWCNT  EQU   ISTLCCW+2                                                02706000
LCCWACI  EQU   LCCWFLAG                                                 02707000
LCCWRFI  EQU   LCCWFLAG                                                 02708000
LCCWPER  EQU   LCCWLSI                                                  02709000
LCCWIDAT EQU   LCCWFLAG                                                 02710000
LCCWNTVC EQU   LCCWFLAG                                                 02711000
LCCWCKPT EQU   LCCWFLAG                                                 02712000
LCCWCC   EQU   LCCWFLAG                                                 02713000
LCCWCD   EQU   LCCWFLAG                                                 02714000
LCCWTYPE EQU   LCCWCTL                                                  02715000
LCCWMODE EQU   LCCWCTL                                                  02716000
LCCWSOP  EQU   LCCWRWOP                                                 02717000
@NM00052 EQU   LCCWRWOP                                                 02718000
LCCWSD   EQU   LCCWOP                                                   02719000
LCCWSI   EQU   LCCWOP                                                   02720000
ZLBLNG1  EQU   ZLBFSM                                                   02721000
ZLBCHAIN EQU   ISTZLBUF                                                 02722000
FSBFDB   EQU   ISTFSB+32                                                02723000
FSBRSV01 EQU   FSBFSB+30                                                02724000
FSBTHCNT EQU   FSBFSB+28                                                02725000
FSBRLRSV EQU   FSBRLSTS                                                 02726000
FSBCFTX  EQU   FSBRLSTS                                                 02727000
FSBICNCB EQU   FSBMSGID                                                 02728000
FSBSSOC  EQU   FSBSS2                                                   02729000
FSBSSCC  EQU   FSBSS2                                                   02730000
FSBSSDC  EQU   FSBSS2                                                   02731000
FSBSSEC  EQU   FSBSS2                                                   02732000
FSBSSIR  EQU   FSBSS2                                                   02733000
FSBSSCR  EQU   FSBSS2                                                   02734000
@NM00050 EQU   FSBSS2                                                   02735000
@NM00049 EQU   FSBSS1                                                   02736000
FSBSSDE  EQU   FSBSS1                                                   02737000
FSBSSUS  EQU   FSBSS1                                                   02738000
@NM00048 EQU   FSBSS1                                                   02739000
FSBSOHI  EQU   FSBERC                                                   02740000
FSBLGI   EQU   FSBERC                                                   02741000
FSBLMRI  EQU   FSBFBMI                                                  02742000
FSBETI   EQU   FSBERC                                                   02743000
FSBEMI   EQU   FSBERC                                                   02744000
FSBEBI   EQU   FSBERC                                                   02745000
FSBECI   EQU   FSBERC                                                   02746000
FSBELI   EQU   FSBERC                                                   02747000
FSBMJRCD EQU   FSBSRCAT                                                 02748000
FSBXLCI  EQU   FSBXCODE                                                 02749000
FSBXFINS EQU   FSBXCODE                                                 02750000
FSBXNORM EQU   FSBXFSTS                                                 02751000
FSBSCODE EQU   FSBSYSRS                                                 02752000
FSBSPHSE EQU   FSBSYSRS                                                 02753000
FSBSERR  EQU   FSBSYSRS                                                 02754000
FSBCMD   EQU   FSBSEQ                                                   02755000
FSBDTRCE EQU   FSBFLAGS                                                 02756000
FSBASBTU EQU   FSBFLAGS                                                 02757000
FSBINPET EQU   FSBFLAGS                                                 02758000
FSBNONCB EQU   FSBFLAGS                                                 02759000
FSBLBIND EQU   FSBFLAGS                                                 02760000
FSBFFIND EQU   FSBFLAGS                                                 02761000
FSBACIND EQU   FSBFLAGS                                                 02762000
FSBRFIND EQU   FSBFLAGS                                                 02763000
FSBDAF   EQU   FSBCID+2                                                 02764000
FSBSAF   EQU   FSBCID                                                   02765000
FSBGATE  EQU   FSBFSBA                                                  02766000
FSBRSV02 EQU   FSBSFLGS                                                 02767000
FSBPGBUF EQU   FSBSFLGS                                                 02768000
FSBMNSDA EQU   FSBMNRCD                                                 02769000
FSBMNOA  EQU   FSBMNRCD                                                 02770000
FSBMNDIF EQU   FSBMNRCD                                                 02771000
FSBMNEOP EQU   FSBMNRCD                                                 02772000
FSBMNDNU EQU   FSBMNRCD                                                 02773000
FSBMNATN EQU   FSBMNRCD                                                 02774000
FSBMNRVI EQU   FSBMNRCD                                                 02775000
FSBMNELI EQU   FSBMNRCD                                                 02776000
FSBLNGTH EQU   FSBFSB+1                                                 02777000
FSBTYPE  EQU   FSBFSB                                                   02778000
FDBOFSET EQU   ISTFDB+10                                                02779000
FDBDATCT EQU   ISTFDB+8                                                 02780000
FDBDATAA EQU   ISTFDB+4                                                 02781000
FDBFDBA  EQU   ISTFDB                                                   02782000
LDNZS00F EQU   LDNZH003+1                                               02783000
LDNZS00E EQU   LDNZH003+1                                               02784000
LDNZS00D EQU   LDNZH003+1                                               02785000
LDNZS00C EQU   LDNZH003+1                                               02786000
LDNZS00B EQU   LDNZH003+1                                               02787000
LDNZS007 EQU   LDNZH003                                                 02788000
LDNZS006 EQU   LDNZH003                                                 02789000
LDNZS005 EQU   LDNZH003                                                 02790000
LDNZS004 EQU   LDNZH003                                                 02791000
LDNZS003 EQU   LDNZH003                                                 02792000
LDNZS002 EQU   LDNZH003                                                 02793000
LDNZS001 EQU   LDNZH003                                                 02794000
LDNZS000 EQU   LDNZH003                                                 02795000
LDNZX006 EQU   ISTLDNCB+576                                             02796000
LDNZC001 EQU   ISTLDNCB+569                                             02797000
LDNZX005 EQU   ISTLDNCB+568                                             02798000
LDNZV006 EQU   ISTLDNCB+564                                             02799000
LDNSRB   EQU   ISTLDNCB+520                                             02800000
LDNIOSB  EQU   ISTLDNCB+412                                             02801000
@NM00047 EQU   LDNZSAV3+28                                              02802000
LDNRSV06 EQU   LDNZSAV4+16                                              02803000
LDNZSAV6 EQU   LDNZSAV4+12                                              02804000
LDNZSAV5 EQU   LDNZSAV4                                                 02805000
LDNZSAVE EQU   LDNZSAV3                                                 02806000
LDNZSAV2 EQU   ISTLDNCB+368                                             02807000
LDNZSAV1 EQU   ISTLDNCB+352                                             02808000
LDNZ3RR  EQU   ISTLDNCB+348                                             02809000
LDNZ2RR  EQU   ISTLDNCB+344                                             02810000
LDNZ1RR  EQU   ISTLDNCB+340                                             02811000
LDNRSV0B EQU   ISTLDNCB+336                                             02812000
LDNRSV0A EQU   ISTLDNCB+332                                             02813000
LDNRSV09 EQU   ISTLDNCB+328                                             02814000
LDNRSV08 EQU   ISTLDNCB+324                                             02815000
LDNRSV07 EQU   ISTLDNCB+320                                             02816000
LDNDEAD  EQU   LDNDCDEB+12                                              02817000
LDNAPPAD EQU   LDNDCDEB+5                                               02818000
LDNEXSCL EQU   LDNDCDEB+4                                               02819000
LDNDCBAD EQU   LDNDCDEB+1                                               02820000
LDNDEBID EQU   LDNDCDEB                                                 02821000
LDNZRIND EQU   ISTLDNCB+300                                             02822000
LDNRPH   EQU   ISTLDNCB+192                                             02823000
LDNZTCP  EQU   ISTLDNCB+188                                             02824000
LDNZCHNC EQU   ISTLDNCB+187                                             02825000
LDNZLPC7 EQU   LDNZLPC                                                  02826000
LDNZLPC6 EQU   LDNZLPC                                                  02827000
LDNZLPC5 EQU   LDNZLPC                                                  02828000
LDNZLPC4 EQU   LDNZLPC                                                  02829000
LDNZLPC3 EQU   LDNZLPC                                                  02830000
LDNZLPC2 EQU   LDNZLPC                                                  02831000
LDNZLPC1 EQU   LDNZLPC                                                  02832000
LDNZLPC0 EQU   LDNZLPC                                                  02833000
LDNRSV05 EQU   LDNZERPF                                                 02834000
LDNZCTOV EQU   LDNZEPIN                                                 02835000
LDNZF001 EQU   LDNZEPIN                                                 02836000
LDNZFRDW EQU   LDNZCPAN                                                 02837000
LDNZFRD  EQU   LDNZCPAN                                                 02838000
LDNZNARD EQU   LDNZCPAN                                                 02839000
LDNRSV04 EQU   LDNZIOLK                                                 02840000
LDNZATBF EQU   LDNZIOLK                                                 02841000
LDNZERLK EQU   LDNZIOLK                                                 02842000
LDNZDSIC EQU   LDNZIOLK                                                 02843000
LDNZPAB1 EQU   ISTLDNCB+168                                             02844000
LDNZV005 EQU   ISTLDNCB+160                                             02845000
LDNZS1VR EQU   ISTLDNCB+136                                             02846000
LDNZS1RR EQU   ISTLDNCB+132                                             02847000
LDNZS1FC EQU   ISTLDNCB+128                                             02848000
LDNZS1BC EQU   ISTLDNCB+124                                             02849000
LDNZLOCK EQU   ISTLDNCB+120                                             02850000
LDNZFBUF EQU   ISTLDNCB+116                                             02851000
LDNZLAST EQU   ISTLDNCB+112                                             02852000
LDNRSV02 EQU   LDNFLAG2                                                 02853000
LDNZFF04 EQU   LDNFLAG2                                                 02854000
LDNZFF69 EQU   LDNFLAGS+2                                               02855000
LDNTPBIO EQU   LDNFLAGS+2                                               02856000
LDNZFF03 EQU   LDNFLAGS+2                                               02857000
LDNZFF02 EQU   LDNFLAGS+2                                               02858000
LDNZFF01 EQU   LDNFLAGS+2                                               02859000
LDNZFF00 EQU   LDNFLAGS+2                                               02860000
LDNCLOSD EQU   LDNFLAGS+2                                               02861000
LDNZENTR EQU   LDNFLAGS+2                                               02862000
LDNZICCW EQU   LDNFLAGS+1                                               02863000
LDNZREC  EQU   LDNFLAGS+1                                               02864000
LDNZCTXT EQU   LDNFLAGS+1                                               02865000
LDNZATLK EQU   LDNFLAGS+1                                               02866000
LDNZCHNE EQU   LDNFLAGS+1                                               02867000
LDNZATTP EQU   LDNFLAGS+1                                               02868000
LDNZIOBY EQU   LDNFLAGS+1                                               02869000
LDNZF00A EQU   LDNFLAGS+1                                               02870000
LDNZF009 EQU   LDNFLAGS                                                 02871000
LDNZF008 EQU   LDNFLAGS                                                 02872000
LDNZF007 EQU   LDNFLAGS                                                 02873000
LDNZF005 EQU   LDNFLAGS                                                 02874000
LDNZF004 EQU   LDNFLAGS                                                 02875000
LDNZF003 EQU   LDNFLAGS                                                 02876000
LDNZF002 EQU   LDNFLAGS                                                 02877000
LDNZHDCC EQU   ISTLDNCB+106                                             02878000
LDNZARM  EQU   ISTLDNCB+104                                             02879000
LDNZRM   EQU   ISTLDNCB+102                                             02880000
LDNZRB   EQU   ISTLDNCB+100                                             02881000
LDNCPQ   EQU   ISTLDNCB+96                                              02882000
LDNSIOQ  EQU   ISTLDNCB+92                                              02883000
LDNZX002 EQU   ISTLDNCB+91                                              02884000
LDNZX001 EQU   ISTLDNCB+90                                              02885000
LDNZH002 EQU   ISTLDNCB+88                                              02886000
LDNZV001 EQU   ISTLDNCB+84                                              02887000
LDNZACSW EQU   ISTLDNCB+76                                              02888000
LDNZC002 EQU   ISTLDNCB+68                                              02889000
LDNCSWSV EQU   ISTLDNCB+60                                              02890000
LDNCHFLD EQU   ISTLDNCB+56                                              02891000
LDNRESRV EQU   ISTLDNCB+55                                              02892000
@NM00046 EQU   LDNCFLAG                                                 02893000
LDNRMF   EQU   LDNCFLAG                                                 02894000
LDNIBI   EQU   LDNCFLAG                                                 02895000
LDNTSAF  EQU   ISTLDNCB+52                                              02896000
LDNCUUA  EQU   ISTLDNCB+48                                              02897000
LDNCB    EQU   ISTLDNCB                                                 02898000
NCBRSV01 EQU   ISTNCB+46                                                02899000
NCBSWDAF EQU   ISTNCB+44                                                02900000
NCBDEVCH EQU   ISTNCB+36                                                02901000
NCBFMCBP EQU   ISTNCB+32                                                02902000
NCBLTRC  EQU   ISTNCB+30                                                02903000
NCBRVPT1 EQU   ISTNCB+28                                                02904000
NCBNMLLN EQU   NCBFLAGS+3                                               02905000
@NM00045 EQU   NCBFLAG1                                                 02906000
@NM00044 EQU   NCBFLAG1                                                 02907000
NCBTTF   EQU   NCBFLAG1                                                 02908000
NCBRSYNC EQU   NCBFLAG1                                                 02909000
NCBRSTRT EQU   NCBFLAG1                                                 02910000
NCBCONF  EQU   NCBFLAG1                                                 02911000
NCBSNAI  EQU   NCBFLAG1                                                 02912000
NCBFLTIO EQU   NCBFTRIO                                                 02913000
NCBCSTAT EQU   NCBFLAGS                                                 02914000
NCBNCSL  EQU   ISTNCB+22                                                02915000
NCBNCBA  EQU   ISTNCB+20                                                02916000
NCBFMCBA EQU   ISTNCB+16                                                02917000
NCBNSNA  EQU   ISTNCB+12                                                02918000
NCBRDTE  EQU   ISTNCB+4                                                 02919000
NCBDAF   EQU   ISTNCB+2                                                 02920000
NCBLNGTH EQU   ISTNCB+1                                                 02921000
NCBTYPE  EQU   ISTNCB                                                   02922000
PABRPHA  EQU   PABRPHFG+1                                               02923000
PABNODQ  EQU   PABFLAGS                                                 02924000
PABINHBT EQU   PABFLAGS                                                 02925000
PABERLOK EQU   PABERRLK                                                 02926000
PABSSN   EQU   PABFLAGS                                                 02927000
PABDYNAM EQU   PABFLAGS                                                 02928000
PABNORPR EQU   PABFLAGS                                                 02929000
PABPRIOR EQU   PABFLAGS                                                 02930000
PABAPYP  EQU   PABFLAGS                                                 02931000
PABDVTA  EQU   ISTPAB+9                                                 02932000
PABOFFST EQU   ISTPAB+8                                                 02933000
PABCHNGP EQU   PABCHAIN+1                                               02934000
PABRSV02 EQU   PABCHAIN                                                 02935000
PABRUNNG EQU   PABCHAIN                                                 02936000
PABRESET EQU   PABCHAIN                                                 02937000
PABUNCON EQU   PABCHAIN                                                 02938000
PABCDP   EQU   PABCHAIN                                                 02939000
PABRESCH EQU   PABCHAIN                                                 02940000
PABCHNG  EQU   PABCHAIN                                                 02941000
PABWEQP  EQU   PABWEQA+1                                                02942000
PABRSV01 EQU   PABWEQA                                                  02943000
PABWEQG  EQU   PABWEQA                                                  02944000
RPHNEXPO EQU   ISTRPH+104                                               02945000
RPHSAV16 EQU   RPHWORK+60                                               02946000
RPHSAV15 EQU   RPHWORK+56                                               02947000
RPHSAV14 EQU   RPHWORK+52                                               02948000
RPHSAV13 EQU   RPHWORK+48                                               02949000
RPHSAV12 EQU   RPHWORK+44                                               02950000
RPHSAV11 EQU   RPHWORK+40                                               02951000
RPHSAV10 EQU   RPHWORK+36                                               02952000
RPHSAVE9 EQU   RPHWORK+32                                               02953000
RPHSAVE8 EQU   RPHWORK+28                                               02954000
RPHSAVE7 EQU   RPHWORK+24                                               02955000
RPHSAVE6 EQU   RPHWORK+20                                               02956000
RPHSAVE5 EQU   RPHWORK+16                                               02957000
RPHSAVE4 EQU   RPHWORK+12                                               02958000
RPHSAVE3 EQU   RPHWORK+8                                                02959000
RPHSAVE2 EQU   RPHWORK+4                                                02960000
RPHSHALF EQU   RPHSAVE1+2                                               02961000
RPHSBIT8 EQU   RPHSBITS                                                 02962000
RPHSBIT7 EQU   RPHSBITS                                                 02963000
RPHSBIT6 EQU   RPHSBITS                                                 02964000
RPHSBIT5 EQU   RPHSBITS                                                 02965000
RPHSBIT4 EQU   RPHSBITS                                                 02966000
RPHSBIT3 EQU   RPHSBITS                                                 02967000
RPHSBIT2 EQU   RPHSBITS                                                 02968000
RPHSBIT1 EQU   RPHSBITS                                                 02969000
RPHSBYTE EQU   RPHSAVE1                                                 02970000
RPHPABQP EQU   RPHPABQA+1                                               02971000
RPHPABFG EQU   RPHPABQA                                                 02972000
RPHSRP34 EQU   RPHSRPRM+2                                               02973000
RPHSRP12 EQU   RPHSRPRM                                                 02974000
RPHWEGT  EQU   RPHCSPA                                                  02975000
RPHMAJCB EQU   ISTRPH+21                                                02976000
RPHPABOF EQU   ISTRPH+20                                                02977000
RPHRESUM EQU   RPHRESMA+1                                               02978000
RPHRSV01 EQU   RPHWPFLG                                                 02979000
RPHPURGE EQU   RPHWPFLG                                                 02980000
RPHPT    EQU   RPHWPFLG                                                 02981000
RPHWT    EQU   RPHWPFLG                                                 02982000
RPHRSKEY EQU   RPHWPFLG                                                 02983000
RPHDVTA  EQU   ISTRPH+12                                                02984000
RPHTIK   EQU   RPHTSKID+3                                               02985000
@NM00043 EQU   RPHTSKID                                                 02986000
RPHRPHAP EQU   RPHRPHA+1                                                02987000
@NM00042 EQU   RPHRPHA                                                  02988000
RPHGATE  EQU   RPHRPHA                                                  02989000
@NM00041 EQU   RPHFLGB                                                  02990000
RPHRLCRA EQU   RPHFLGB                                                  02991000
RPHNRSAV EQU   RPHFLGB                                                  02992000
RPHPGCMP EQU   RPHFLGB                                                  02993000
RPHFBAPS EQU   RPHFLGB                                                  02994000
RPHBSSP  EQU   RPHFLGB                                                  02995000
RPHLOCK  EQU   RPHFLGB                                                  02996000
RPHFNFLG EQU   RPHFSTLC                                                 02997000
RPHMLTCP EQU   RPHFLAGS                                                 02998000
RPHSMCLR EQU   RPHFLAGS                                                 02999000
RPHSMTYP EQU   RPHFLAGS                                                 03000000
RPHSMQ   EQU   RPHFLAGS                                                 03001000
RPHAUTEX EQU   RPHAPTYP                                                 03002000
RPHSPGIN EQU   RPHFLAGS                                                 03003000
RPHOGIND EQU   RPHFLAGS                                                 03004000
RPHLNGTH EQU   ISTRPH+1                                                 03005000
RPHTYPE  EQU   ISTRPH                                                   03006000
LOKXCL   EQU   @NM00039                                                 03007000
LOKPRY   EQU   @NM00039                                                 03008000
@NM00040 EQU   @NM00039                                                 03009000
@NM00038 EQU   LOKCHNG                                                  03010000
LOKCT    EQU   ISTLOK                                                   03011000
DEVRSV03 EQU   ISTDEVCH+5                                               03012000
DEVPHYSA EQU   ISTDEVCH+4                                               03013000
DEVCSLPN EQU   DEVCHAR3                                                 03014000
DEVCSTCL EQU   DEVCHAR3                                                 03015000
DEVCCHEK EQU   DEVCHAR3                                                 03016000
DEVCATTN EQU   DEVCHAR3                                                 03017000
DEVCSWL  EQU   DEVFCCTL                                                 03018000
DEVCRVB  EQU   DEVFCCTL                                                 03019000
DEVCSSL  EQU   DEVFCCTL                                                 03020000
DEVCBSC  EQU   DEVFCCTL                                                 03021000
DEVMCODE EQU   ISTDEVCH+2                                               03022000
DEVCHAR2 EQU   DEVTCODE                                                 03023000
DEVRSV01 EQU   DEVCHAR                                                  03024000
DEVCCTL  EQU   DEVCHAR                                                  03025000
DEVNNSPT EQU   DEVCHAR                                                  03026000
DEVSPS   EQU   DEVCHAR                                                  03027000
DEVSUBND EQU   DEVCHAR                                                  03028000
DEVCONVR EQU   DEVCHAR                                                  03029000
DEVOTPUT EQU   DEVCHAR                                                  03030000
DEVINPUT EQU   DEVCHAR                                                  03031000
IOCOEND  EQU   IOCOM+128                                                03032000
IOCPATCH EQU   IOCOM+124                                                03033000
IOCUCBBM EQU   IOCOM+120                                                03034000
IOCQCNT  EQU   IOCOM+116                                                03035000
IOCIOSDQ EQU   IOCOM+112                                                03036000
IOCIOSEQ EQU   IOCOM+108                                                03037000
IOCSVCF  EQU   IOCOM+104                                                03038000
IOCRSVTB EQU   IOCOM+96                                                 03039000
IOCMFCNT EQU   IOCOM+92                                                 03040000
IOCMFHK  EQU   IOCOM+88                                                 03041000
IOCGENA  EQU   IOCOM+84                                                 03042000
IOCCCH   EQU   IOCOM+80                                                 03043000
IOCASYNQ EQU   IOCOM+76                                                 03044000
IOCLCHTB EQU   IOCOM+72                                                 03045000
IOCATTBL EQU   IOCOM+68                                                 03046000
IOCOMEX  EQU   IOCOM+64                                                 03047000
IOCSYNCH EQU   IOCOM+56                                                 03048000
IOCCATLK EQU   IOCOM+48                                                 03049000
IOCPRGID EQU   IOCOM+44                                                 03050000
IOCIOSCP EQU   IOCOM+40                                                 03051000
IOCORMGT EQU   IOCOM+36                                                 03052000
IOCVOID  EQU   IOCOM+32                                                 03053000
IOCSTIO  EQU   IOCOM+28                                                 03054000
@NM00037 EQU   IOCOM+24                                                 03055000
@NM00036 EQU   IOCOM+20                                                 03056000
IOCINT   EQU   IOCOM+16                                                 03057000
IOCCTBL  EQU   IOCOM+12                                                 03058000
IOCHIO   EQU   IOCOM+8                                                  03059000
IOCPST   EQU   IOCOM+4                                                  03060000
IOCPGCT  EQU   IOCOM+2                                                  03061000
IOCVOICT EQU   IOCOM                                                    03062000
IOSEND   EQU   IOSB+108                                                 03063000
IOSSKR   EQU   IOSEEKA+7                                                03064000
IOSSKH2  EQU   IOSSKHH+1                                                03065000
IOSSKH1  EQU   IOSSKHH                                                  03066000
IOSSKCC  EQU   IOSCCHH                                                  03067000
IOSSKBB  EQU   IOSEEKA+1                                                03068000
IOSSKM   EQU   IOSEEKA                                                  03069000
IOSEEK   EQU   IOSB+92                                                  03070000
IOSMDM   EQU   IOSB+91                                                  03071000
IOSMDB   EQU   IOSB+90                                                  03072000
IOSCKEY7 EQU   IOSCKEY                                                  03073000
IOSCKEY6 EQU   IOSCKEY                                                  03074000
IOSCKEY5 EQU   IOSCKEY                                                  03075000
IOSCKEY4 EQU   IOSCKEY                                                  03076000
@NM00032 EQU   IOSCKEY                                                  03077000
IOSFMSK  EQU   IOSB+88                                                  03078000
IOSCUDEV EQU   IOSPATH+1                                                03079000
@NM00031 EQU   IOSCHN                                                   03080000
IOSPATH3 EQU   IOSCHN                                                   03081000
IOSPATH2 EQU   IOSCHN                                                   03082000
IOSEXP   EQU   IOSCHN                                                   03083000
IOSGDP   EQU   IOSCHN                                                   03084000
IOSAFF   EQU   IOSB+85                                                  03085000
IOSRSS1B EQU   IOSB+84                                                  03086000
IOSDSID  EQU   IOSB+80                                                  03087000
IOSVST   EQU   IOSB+76                                                  03088000
IOSRST   EQU   IOSB+72                                                  03089000
IOSDIE   EQU   IOSB+68                                                  03090000
IOSABN   EQU   IOSB+64                                                  03091000
IOSNRM   EQU   IOSB+60                                                  03092000
IOSPCI   EQU   IOSB+56                                                  03093000
IOSERP   EQU   IOSB+52                                                  03094000
IOSPCHN  EQU   IOSB+48                                                  03095000
IOSSNS   EQU   IOSB+42                                                  03096000
IOSAPMSK EQU   IOSB+40                                                  03097000
IOSRES4A EQU   IOSB+36                                                  03098000
IOSUSE   EQU   IOSB+32                                                  03099000
IOSSRB   EQU   IOSB+28                                                  03100000
IOSCSWRC EQU   IOSCSW+5                                                 03101000
IOSTSB   EQU   IOSTATUS+1                                               03102000
IOSTSA   EQU   IOSTATUS                                                 03103000
IOSCSWCA EQU   IOSCSW                                                   03104000
IOSCC    EQU   @NM00030                                                 03105000
IOSUCB   EQU   IOSB+16                                                  03106000
IOSOPT2X EQU   IOSOPT2                                                  03107000
IOSHTP   EQU   IOSOPT2                                                  03108000
IOSRELSE EQU   IOSOPT                                                   03109000
IOSAPR   EQU   IOSOPT                                                   03110000
IOSTSLL  EQU   IOSOPT                                                   03111000
IOSNERP  EQU   IOSOPT                                                   03112000
IOSPSLL  EQU   IOSOPT                                                   03113000
IOSQISCE EQU   IOSOPT                                                   03114000
IOSDEP   EQU   IOSOPT                                                   03115000
IOSBYP   EQU   IOSOPT                                                   03116000
IOSCOD   EQU   IOSB+13                                                  03117000
IOSPKY7  EQU   IOSPKEY                                                  03118000
IOSPGDPX EQU   IOSPKEY                                                  03119000
IOSIDR   EQU   IOSPKEY                                                  03120000
IOSLCL   EQU   IOSPKEY                                                  03121000
@NM00029 EQU   IOSPKEY                                                  03122000
IOSPGAD  EQU   IOSB+8                                                   03123000
IOSASID  EQU   IOSB+6                                                   03124000
IOSPRLVL EQU   IOSB+5                                                   03125000
IOSDVRID EQU   IOSB+4                                                   03126000
IOSPROC  EQU   IOSB+3                                                   03127000
IOSFLC7  EQU   IOSFLC                                                   03128000
IOSFLC6  EQU   IOSFLC                                                   03129000
IOSGLC5  EQU   IOSFLC                                                   03130000
IOSFLC4  EQU   IOSFLC                                                   03131000
IOSTP    EQU   IOSFLC                                                   03132000
IOSCC3WE EQU   IOSFLC                                                   03133000
IOSVERIF EQU   IOSDVALT                                                 03134000
IOSDVMNT EQU   IOSFLC                                                   03135000
IOSLOG   EQU   IOSFLB                                                   03136000
IOSBDCST EQU   IOSFLB                                                   03137000
IOSMSG   EQU   IOSFLB                                                   03138000
IOSFLB4  EQU   IOSFLB                                                   03139000
IOSFLB3  EQU   IOSFLB                                                   03140000
IOSFLB2  EQU   IOSFLB                                                   03141000
IOSSDR   EQU   IOSFLB                                                   03142000
IOSDIESE EQU   IOSFLB                                                   03143000
IOSIOSB  EQU   IOSFLA                                                   03144000
IOSDOM   EQU   IOSFLA                                                   03145000
IOSEX    EQU   IOSFLA                                                   03146000
IOSSMDB  EQU   IOSFLA                                                   03147000
IOSSMDA  EQU   IOSFLA                                                   03148000
IOSERR   EQU   IOSFLA                                                   03149000
IOSCCHN  EQU   IOSACHN                                                  03150000
IOSDCHN  EQU   IOSACHN                                                  03151000
@NM00028 EQU   SRBSECT+40                                               03152000
@NM00027 EQU   SRBSECT+38                                               03153000
SRBPRIOR EQU   SRBSECT+37                                               03154000
SRBPKF   EQU   SRBSECT+36                                               03155000
SRBSAVE  EQU   SRBSECT+32                                               03156000
SRBPARM  EQU   SRBSECT+28                                               03157000
SRBRMTR  EQU   SRBSECT+24                                               03158000
SRBEP    EQU   SRBSECT+20                                               03159000
SRBPTCB  EQU   SRBFLC+4                                                 03160000
SRBPASID EQU   SRBFLC+2                                                 03161000
SRBCPAFF EQU   SRBFLC                                                   03162000
SRBASCB  EQU   SRBSECT+8                                                03163000
SRBFLNK  EQU   SRBSECT+4                                                03164000
SRBID    EQU   SRBSECT                                                  03165000
TCCWEND  EQU   TCCW+156                                                 03166000
TCCWREGE EQU   TCCWRGSV+52                                              03167000
TCCWREGD EQU   TCCWRGSV+48                                              03168000
TCCWREGC EQU   TCCWRGSV+44                                              03169000
TCCWREGB EQU   TCCWRGSV+40                                              03170000
TCCWREGA EQU   TCCWRGSV+36                                              03171000
TCCWREG9 EQU   TCCWRGSV+32                                              03172000
TCCWREG8 EQU   TCCWRGSV+28                                              03173000
TCCWREG7 EQU   TCCWRGSV+24                                              03174000
TCCWREG6 EQU   TCCWRGSV+20                                              03175000
TCCWREG5 EQU   TCCWRGSV+16                                              03176000
TCCWREG4 EQU   TCCWRGSV+12                                              03177000
TCCWREG3 EQU   TCCWRGSV+8                                               03178000
TCCWREG2 EQU   TCCWRGSV+4                                               03179000
TCCWREG1 EQU   TCCWRGSV                                                 03180000
TCCWSAVE EQU   TCCW+68                                                  03181000
TCCWCBEB EQU   TCCW+64                                                  03182000
TCCWHICA EQU   TCCW+60                                                  03183000
TCCWLOCA EQU   TCCW+56                                                  03184000
TCCWTICA EQU   TCCW+52                                                  03185000
TCCWCCWA EQU   TCCW+48                                                  03186000
TCCWEFOP EQU   TCCW+47                                                  03187000
TCCWINDL EQU   TCCW+46                                                  03188000
TCCWCCWL EQU   TCCW+45                                                  03189000
TCCWMODB EQU   TCCW+44                                                  03190000
TCCWCCWR EQU   TCCW+40                                                  03191000
TCCWINDR EQU   TCCW+36                                                  03192000
TCCWTICL EQU   TCCW+32                                                  03193000
TCCWINDA EQU   TCCW+28                                                  03194000
TCCWPLKR EQU   TCCW+24                                                  03195000
TCCWFRC  EQU   TCCW+20                                                  03196000
CVTLEVL  EQU   CVTRELNO+2                                               03197000
CVTNUMB  EQU   CVTRELNO                                                 03198000
CVTMDL   EQU   CVTFIX+250                                               03199000
@NM00026 EQU   CVTFIX+248                                               03200000
@NM00025 EQU   CVTFIX                                                   03201000
CVTRV482 EQU   CVTXTNT2+128                                             03202000
CVTRV481 EQU   CVTXTNT2+124                                             03203000
CVTRV480 EQU   CVTXTNT2+120                                             03204000
CVTRV479 EQU   CVTXTNT2+118                                             03205000
CVTRV478 EQU   CVTXTNT2+117                                             03206000
CVTRV477 EQU   CVTXTNT2+116                                             03207000
CVTRV476 EQU   CVTXTNT2+115                                             03208000
CVTRV475 EQU   CVTXTNT2+114                                             03209000
CVTRV474 EQU   CVTRV466                                                 03210000
CVTRV473 EQU   CVTRV466                                                 03211000
CVTRV472 EQU   CVTRV466                                                 03212000
CVTRV471 EQU   CVTRV466                                                 03213000
CVTRV470 EQU   CVTRV466                                                 03214000
CVTRV469 EQU   CVTRV466                                                 03215000
CVTRV468 EQU   CVTRV466                                                 03216000
CVTRV467 EQU   CVTRV466                                                 03217000
CVTRV465 EQU   CVTRV457                                                 03218000
CVTRV464 EQU   CVTRV457                                                 03219000
CVTRV463 EQU   CVTRV457                                                 03220000
CVTRV462 EQU   CVTRV457                                                 03221000
CVTRV461 EQU   CVTRV457                                                 03222000
CVTRV460 EQU   CVTRV457                                                 03223000
CVTRV459 EQU   CVTRV457                                                 03224000
CVTRV458 EQU   CVTRV457                                                 03225000
CVTRV456 EQU   CVTXTNT2+108                                             03226000
CVTRV455 EQU   CVTXTNT2+104                                             03227000
CVTRV454 EQU   CVTXTNT2+100                                             03228000
CVTRV453 EQU   CVTXTNT2+96                                              03229000
CVTRV452 EQU   CVTXTNT2+94                                              03230000
CVTRV451 EQU   CVTXTNT2+92                                              03231000
CVTRV450 EQU   CVTXTNT2+90                                              03232000
CVTRV449 EQU   CVTXTNT2+88                                              03233000
CVTRV448 EQU   CVTXTNT2+87                                              03234000
CVTRV447 EQU   CVTXTNT2+86                                              03235000
CVTRV446 EQU   CVTRV438                                                 03236000
CVTRV445 EQU   CVTRV438                                                 03237000
CVTRV444 EQU   CVTRV438                                                 03238000
CVTRV443 EQU   CVTRV438                                                 03239000
CVTRV442 EQU   CVTRV438                                                 03240000
CVTRV441 EQU   CVTRV438                                                 03241000
CVTRV440 EQU   CVTRV438                                                 03242000
CVTRV439 EQU   CVTRV438                                                 03243000
CVTRV437 EQU   CVTRV429                                                 03244000
CVTRV436 EQU   CVTRV429                                                 03245000
CVTRV435 EQU   CVTRV429                                                 03246000
CVTRV434 EQU   CVTRV429                                                 03247000
CVTRV433 EQU   CVTRV429                                                 03248000
CVTRV432 EQU   CVTRV429                                                 03249000
CVTRV431 EQU   CVTRV429                                                 03250000
CVTRV430 EQU   CVTRV429                                                 03251000
CVTRV428 EQU   CVTXTNT2+80                                              03252000
CVTRV427 EQU   CVTXTNT2+76                                              03253000
CVTRV426 EQU   CVTXTNT2+72                                              03254000
CVTRV425 EQU   CVTXTNT2+68                                              03255000
CVTATACT EQU   CVTATCVT                                                 03256000
CVTRV423 EQU   CVTXTNT2+62                                              03257000
CVTRV422 EQU   CVTXTNT2+60                                              03258000
CVTRV421 EQU   CVTXTNT2+58                                              03259000
CVTRV420 EQU   CVTXTNT2+56                                              03260000
CVTRV419 EQU   CVTXTNT2+55                                              03261000
CVTRV418 EQU   CVTXTNT2+54                                              03262000
CVTRV417 EQU   CVTRV409                                                 03263000
CVTRV416 EQU   CVTRV409                                                 03264000
CVTRV415 EQU   CVTRV409                                                 03265000
CVTRV414 EQU   CVTRV409                                                 03266000
CVTRV413 EQU   CVTRV409                                                 03267000
CVTRV412 EQU   CVTRV409                                                 03268000
CVTRV411 EQU   CVTRV409                                                 03269000
CVTRV410 EQU   CVTRV409                                                 03270000
CVTRV408 EQU   CVTRV400                                                 03271000
CVTRV407 EQU   CVTRV400                                                 03272000
CVTRV406 EQU   CVTRV400                                                 03273000
CVTRV405 EQU   CVTRV400                                                 03274000
CVTRV404 EQU   CVTRV400                                                 03275000
CVTRV403 EQU   CVTRV400                                                 03276000
CVTRV402 EQU   CVTRV400                                                 03277000
CVTRV401 EQU   CVTRV400                                                 03278000
CVTICB   EQU   CVTXTNT2+48                                              03279000
CVTSKTA  EQU   CVTXTNT2+44                                              03280000
CVTSHSB  EQU   CVTSHS                                                   03281000
CVTRSV98 EQU   CVTXTNT2+36                                              03282000
CVTRSV97 EQU   CVTXTNT2+34                                              03283000
CVTRSV96 EQU   CVTXTNT2+32                                              03284000
CVTOLTEP EQU   CVTXTNT2+28                                              03285000
CVTQIDA  EQU   CVTQID+1                                                 03286000
CVTRSV95 EQU   CVTQID                                                   03287000
CVTRSV94 EQU   CVTXTNT2+20                                              03288000
CVTRSV93 EQU   CVTXTNT2+16                                              03289000
CVTRSV92 EQU   CVTXTNT2+12                                              03290000
CVTDEBVR EQU   CVTXTNT2+8                                               03291000
CVTRSV91 EQU   CVTXTNT2+6                                               03292000
CVTRSV9H EQU   CVTFLGBT                                                 03293000
CVTRSV9G EQU   CVTFLGBT                                                 03294000
CVTRSV9F EQU   CVTFLGBT                                                 03295000
CVTRSV9E EQU   CVTFLGBT                                                 03296000
CVTRSV9D EQU   CVTFLGBT                                                 03297000
CVTRSV9C EQU   CVTFLGBT                                                 03298000
CVTVME   EQU   CVTFLGBT                                                 03299000
CVTNPE   EQU   CVTFLGBT                                                 03300000
CVTNUCLS EQU   CVTXTNT2+4                                               03301000
CVTDSSVA EQU   CVTDSSV+1                                                03302000
CVTRSV89 EQU   CVTDSSV                                                  03303000
CVTRSV88 EQU   CVTXTNT1+8                                               03304000
CVTRSV87 EQU   CVTXTNT1+4                                               03305000
CVTFACHN EQU   CVTXTNT1                                                 03306000
CVTRV488 EQU   CVTMAP+412                                               03307000
CVTRV487 EQU   CVTMAP+408                                               03308000
CVTRV486 EQU   CVTMAP+404                                               03309000
CVTRV485 EQU   CVTMAP+400                                               03310000
CVTACTAP EQU   CVTMAP+396                                               03311000
CVTAUTH  EQU   CVTMAP+392                                               03312000
CVTATMCA EQU   CVTATMCT+1                                               03313000
CVTATMST EQU   CVTATMCT                                                 03314000
CVTRSV61 EQU   CVTMAP+384                                               03315000
CVTVOLT1 EQU   CVTVOLM1+1                                               03316000
CVTVOLI1 EQU   CVTVOLF1                                                 03317000
CVTSTOA  EQU   CVTMAP+376                                               03318000
CVTRSV58 EQU   CVTMAP+374                                               03319000
CVTRSV57 EQU   CVTMAP+372                                               03320000
CVTDDCE  EQU   CVTMAP+368                                               03321000
CVTPNWFR EQU   CVTMAP+364                                               03322000
CVTSMF   EQU   CVTMAP+360                                               03323000
CVTSULK  EQU   CVTMAP+358                                               03324000
CVTSLKO  EQU   CVTSYSK                                                  03325000
CVTSLKP  EQU   CVTSYSK                                                  03326000
CVTSLKQ  EQU   CVTSYSK                                                  03327000
CVTSLKR  EQU   CVTSYSK                                                  03328000
CVTRSV56 EQU   CVTSYSK                                                  03329000
CVTRSV55 EQU   CVTSYSK                                                  03330000
CVTRSV54 EQU   CVTSYSK                                                  03331000
CVTRSV53 EQU   CVTSYSK                                                  03332000
CVTRSV52 EQU   CVTA1F1                                                  03333000
CVTRSV51 EQU   CVTA1F1                                                  03334000
CVTRSV50 EQU   CVTA1F1                                                  03335000
CVTRSV49 EQU   CVTA1F1                                                  03336000
CVTRSV48 EQU   CVTA1F1                                                  03337000
CVTRSV47 EQU   CVTA1F1                                                  03338000
CVTSRSW  EQU   CVTA1F1                                                  03339000
CVTPFSW  EQU   CVTA1F1                                                  03340000
CVTPCVT  EQU   CVTMAP+352                                               03341000
CVTRSV46 EQU   CVTMAP+344                                               03342000
CVTRSV45 EQU   CVTMAP+340                                               03343000
CVTRSV44 EQU   CVTMAP+338                                               03344000
CVTRSV43 EQU   CVTMAP+336                                               03345000
CVTHJESA EQU   CVTHJES+1                                                03346000
CVTRSV42 EQU   CVTHJES                                                  03347000
CVTEXT2A EQU   CVTEXT2+1                                                03348000
CVTRSV41 EQU   CVTEXT2                                                  03349000
CVTAPFA  EQU   CVTAPF+1                                                 03350000
CVTRSV40 EQU   CVTAPF                                                   03351000
CVTRV518 EQU   CVTINTLA                                                 03352000
CVTRV517 EQU   CVTERPV                                                  03353000
CVTEORM  EQU   CVTMAP+312                                               03354000
CVTMCHPR EQU   CVTMAP+308                                               03355000
CVTTZ    EQU   CVTMAP+304                                               03356000
CVTJEPS  EQU   CVTMAP+300                                               03357000
CVTJESCT EQU   CVTMAP+296                                               03358000
CVTMODE  EQU   CVTMAP+292                                               03359000
CVTPTRV  EQU   CVTMAP+288                                               03360000
CVTREAL  EQU   CVTMAP+284                                               03361000
CVTRSV39 EQU   CVTMAP+280                                               03362000
CVTRSV38 EQU   CVTMAP+276                                               03363000
CVTDMSRA EQU   CVTDMSR+1                                                03364000
CVTRSV37 EQU   CVTDMSR                                                  03365000
CVTQMSGA EQU   CVTQMSG+1                                                03366000
CVTRSV36 EQU   CVTQMSG                                                  03367000
CVTAMFF  EQU   CVTMAP+264                                               03368000
CVTPURGA EQU   CVTPURG+1                                                03369000
CVTRSV35 EQU   CVTPURG                                                  03370000
CVTCBSP  EQU   CVTMAP+256                                               03371000
CVTATERA EQU   CVTATER+1                                                03372000
CVTSYST  EQU   CVTATER                                                  03373000
CVTVOLT2 EQU   CVTTAT                                                   03374000
CVTVOLI2 EQU   CVTVOLF2                                                 03375000
CVTAQAVB EQU   CVTAQAVT+1                                               03376000
CVTRSV34 EQU   CVTTCMFG                                                 03377000
CVTRSV33 EQU   CVTTCMFG                                                 03378000
CVTRSV32 EQU   CVTTCMFG                                                 03379000
CVTRSV31 EQU   CVTTCMFG                                                 03380000
CVTRSV30 EQU   CVTTCMFG                                                 03381000
CVTRSV29 EQU   CVTTCMFG                                                 03382000
CVTRSV28 EQU   CVTTCMFG                                                 03383000
CVTTCRDY EQU   CVTTCMFG                                                 03384000
CVTGTFA  EQU   CVTGTF+1                                                 03385000
CVTRSV27 EQU   CVTGTFST                                                 03386000
CVTRNIO  EQU   CVTGTFST                                                 03387000
CVTUSR   EQU   CVTGTFST                                                 03388000
CVTRV318 EQU   CVTFORM                                                  03389000
CVTRV317 EQU   CVTTMODE                                                 03390000
CVTRV316 EQU   CVTSTATE                                                 03391000
CVTRV315 EQU   CVTGTFS                                                  03392000
CVTGTFAV EQU   CVTGTFS                                                  03393000
CVT0SCR1 EQU   CVTMAP+232                                               03394000
CVTRV515 EQU   CVTMAP+228                                               03395000
CVTRMS   EQU   CVTMAP+224                                               03396000
CVTPATCH EQU   CVTMAP+220                                               03397000
CVTTSCE  EQU   CVTMAP+216                                               03398000
CVTLNKSC EQU   CVTMAP+214                                               03399000
CVTQABST EQU   CVTMAP+212                                               03400000
CVTMDLDS EQU   CVTMAP+208                                               03401000
CVTUSER  EQU   CVTMAP+204                                               03402000
CVTABEND EQU   CVTMAP+200                                               03403000
CVTSMCA  EQU   CVTMAP+196                                               03404000
CVTRSV18 EQU   CVTMAP+192                                               03405000
CVTQLPAQ EQU   CVTMAP+188                                               03406000
CVTQCDSR EQU   CVTMAP+184                                               03407000
CVTRSV17 EQU   CVTOPTB                                                  03408000
CVTRSV16 EQU   CVTOPTB                                                  03409000
CVTFP    EQU   CVTOPTB                                                  03410000
CVTAPTHR EQU   CVTOPTB                                                  03411000
CVTNLOG  EQU   CVTOPTB                                                  03412000
CVTTOD   EQU   CVTOPTB                                                  03413000
CVTCTIMS EQU   CVTOPTB                                                  03414000
CVTPROT  EQU   CVTOPTB                                                  03415000
CVTXPFP  EQU   CVTOPTA                                                  03416000
CVTASCII EQU   CVTOPTA                                                  03417000
CVTRSV13 EQU   CVTOPTA                                                  03418000
CVTRSV12 EQU   CVTOPTA                                                  03419000
CVTNIP   EQU   CVTOPTA                                                  03420000
CVTDDR   EQU   CVTOPTA                                                  03421000
CVTAPR   EQU   CVTOPTA                                                  03422000
CVTCCH   EQU   CVTOPTA                                                  03423000
CVTSNCTR EQU   CVTMAP+180                                               03424000
CVTQMWR  EQU   CVTMAP+176                                               03425000
CVTQOCR  EQU   CVTMAP+172                                               03426000
CVT1EF00 EQU   CVTMAP+168                                               03427000
CVTMZ00  EQU   CVTMAP+164                                               03428000
CVTHEAD  EQU   CVTMAP+160                                               03429000
CVTRSV11 EQU   CVTMAP+156                                               03430000
CVT0PT01 EQU   CVTMAP+152                                               03431000
CVTMSER  EQU   CVTMAP+148                                               03432000
CVTRV516 EQU   CVTIERLC                                                 03433000
CVTILCH  EQU   CVTMAP+140                                               03434000
CVT0DS   EQU   CVTMAP+136                                               03435000
CVTFBOSV EQU   CVTMAP+132                                               03436000
CVTNUCB  EQU   CVTMAP+128                                               03437000
CVTIOQET EQU   CVTMAP+120                                               03438000
CVTDCBA  EQU   CVTMAP+117                                               03439000
CVTMVS2  EQU   CVTDCB                                                   03440000
CVT6DAT  EQU   CVTDCB                                                   03441000
CVT4MPS  EQU   CVTDCB                                                   03442000
CVTRSV09 EQU   CVTDCB                                                   03443000
CVT4MS1  EQU   CVTDCB                                                   03444000
CVT2SPS  EQU   CVTDCB                                                   03445000
CVT1SSS  EQU   CVTDCB                                                   03446000
CVTRSV08 EQU   CVTDCB                                                   03447000
CVTSTB   EQU   CVTMAP+112                                               03448000
CVTQTD00 EQU   CVTMAP+108                                               03449000
CVTQTE00 EQU   CVTMAP+104                                               03450000
CVTCUCB  EQU   CVTMAP+100                                               03451000
CVTSJQ   EQU   CVTMAP+96                                                03452000
CVTPBLDL EQU   CVTMAP+92                                                03453000
CVTTPC   EQU   CVTMAP+88                                                03454000
CVTSVDCB EQU   CVTMAP+84                                                03455000
CVTBRET  EQU   CVTMAP+82                                                03456000
CVTEXIT  EQU   CVTMAP+80                                                03457000
CVT0FN00 EQU   CVTMAP+76                                                03458000
CVTDARA  EQU   CVTDAR+1                                                 03459000
CVTRSV07 EQU   CVTFLGS1                                                 03460000
CVTRSV06 EQU   CVTFLGS1                                                 03461000
CVTRSV05 EQU   CVTFLGS1                                                 03462000
CVTRSV04 EQU   CVTFLGS1                                                 03463000
CVTRSV03 EQU   CVTFLGS1                                                 03464000
CVTRSV02 EQU   CVTFLGS1                                                 03465000
CVTRSV01 EQU   CVTFLGS1                                                 03466000
CVTDMPLK EQU   CVTFLGS1                                                 03467000
CVTXITP  EQU   CVTMAP+68                                                03468000
CVTZDTAB EQU   CVTMAP+64                                                03469000
CVTMSLT  EQU   CVTMAP+60                                                03470000
CVTDATE  EQU   CVTMAP+56                                                03471000
CVTBTERM EQU   CVTMAP+52                                                03472000
CVTSYSAD EQU   CVTMAP+48                                                03473000
CVTXTLER EQU   CVTMAP+44                                                03474000
CVTILK2  EQU   CVTMAP+40                                                03475000
CVTILK1  EQU   CVTMAP+36                                                03476000
CVTPRLTV EQU   CVTMAP+32                                                03477000
CVTPCNVT EQU   CVTMAP+28                                                03478000
CVT0VL00 EQU   CVTMAP+24                                                03479000
CVTXAPG  EQU   CVTMAP+20                                                03480000
CVTBUF   EQU   CVTMAP+16                                                03481000
CVTJOB   EQU   CVTMAP+12                                                03482000
CVTLINK  EQU   CVTMAP+8                                                 03483000
CVT0EF00 EQU   CVTMAP+4                                                 03484000
CVTTCBP  EQU   CVTMAP                                                   03485000
CVT      EQU   CVTMAP                                                   03486000
@NM00024 EQU   PSA+3668                                                 03487000
PSASTAK  EQU   PSA+3072                                                 03488000
@NM00023 EQU   PSA+1040                                                 03489000
PSAUSEND EQU   PSA+1040                                                 03490000
PSARV062 EQU   PSA+1036                                                 03491000
PSAATCVT EQU   PSA+1032                                                 03492000
PSAPCPSW EQU   PSA+1024                                                 03493000
PSAPIR2  EQU   PSA+1020                                                 03494000
PSARV059 EQU   PSA+1018                                                 03495000
PSASVC13 EQU   PSA+1016                                                 03496000
PSALSFCC EQU   PSA+1012                                                 03497000
PSASFACC EQU   PSA+1008                                                 03498000
PSASTOP  EQU   PSA+992                                                  03499000
PSASTART EQU   PSA+976                                                  03500000
PSARSPSW EQU   PSA+968                                                  03501000
PSASRPSW EQU   PSA+960                                                  03502000
PSARV045 EQU   PSA+892                                                  03503000
PSARV044 EQU   PSA+888                                                  03504000
PSARV043 EQU   PSA+884                                                  03505000
PSARV042 EQU   PSA+880                                                  03506000
PSARV041 EQU   PSA+876                                                  03507000
PSARV040 EQU   PSA+872                                                  03508000
PSARV025 EQU   PSA+868                                                  03509000
PSADSSED EQU   PSA+868                                                  03510000
PSADSSPR EQU   PSA+864                                                  03511000
PSADSSFW EQU   PSA+860                                                  03512000
PSADSS14 EQU   PSA+856                                                  03513000
PSADSSPP EQU   PSA+848                                                  03514000
PSADSSRP EQU   PSA+840                                                  03515000
PSADSS05 EQU   PSADSSF4                                                 03516000
PSADSS10 EQU   PSADSSF4                                                 03517000
PSADSSVE EQU   PSADSSF4                                                 03518000
PSADSSDE EQU   PSADSSF4                                                 03519000
PSADSSC0 EQU   PSADSSF4                                                 03520000
PSADSSIE EQU   PSADSSF4                                                 03521000
PSADSS12 EQU   PSADSSF4                                                 03522000
PSADSSRC EQU   PSADSSF4                                                 03523000
PSARV057 EQU   PSADSSF3                                                 03524000
PSARV056 EQU   PSADSSF3                                                 03525000
PSARV055 EQU   PSADSSF3                                                 03526000
PSADSSMC EQU   PSADSSF3                                                 03527000
PSADSSRW EQU   PSADSSF3                                                 03528000
PSADSSNM EQU   PSADSSF3                                                 03529000
PSADSSES EQU   PSADSSF3                                                 03530000
PSADSSGP EQU   PSADSSF3                                                 03531000
PSADSSF2 EQU   PSADSSFL+1                                               03532000
PSADSSPI EQU   PSADSSF1                                                 03533000
PSADSSOI EQU   PSADSSF1                                                 03534000
PSADSSSP EQU   PSADSSF1                                                 03535000
PSADSSTP EQU   PSADSSF1                                                 03536000
PSADSSDW EQU   PSADSSF1                                                 03537000
PSADSSDD EQU   PSADSSF1                                                 03538000
PSADSSDM EQU   PSADSSF1                                                 03539000
PSADSSMV EQU   PSADSSF1                                                 03540000
PSADSSTS EQU   PSA+816                                                  03541000
PSADSSWK EQU   PSA+812                                                  03542000
PSADSSR3 EQU   PSA+808                                                  03543000
PSADSSR2 EQU   PSA+804                                                  03544000
PSADSSRS EQU   PSA+800                                                  03545000
PSASTOR  EQU   PSA+796                                                  03546000
PSACPUSA EQU   PSA+794                                                  03547000
PSAVSTAP EQU   PSA+792                                                  03548000
PSAWKVAP EQU   PSA+788                                                  03549000
PSAWKRAP EQU   PSA+784                                                  03550000
PSAMCHIC EQU   PSA+783                                                  03551000
PSARV061 EQU   PSA+782                                                  03552000
PSASYMSK EQU   PSA+781                                                  03553000
PSAMCHFL EQU   PSA+780                                                  03554000
PSACR0   EQU   PSA+776                                                  03555000
PSAPSWSV EQU   PSA+768                                                  03556000
PSACLHS  EQU   PSAHLHI                                                  03557000
PSALKR15 EQU   PSALKSA+60                                               03558000
PSALKR14 EQU   PSALKSA+56                                               03559000
PSALKR13 EQU   PSALKSA+52                                               03560000
PSALKR12 EQU   PSALKSA+48                                               03561000
PSALKR11 EQU   PSALKSA+44                                               03562000
PSALKR10 EQU   PSALKSA+40                                               03563000
PSALKR9  EQU   PSALKSA+36                                               03564000
PSALKR8  EQU   PSALKSA+32                                               03565000
PSALKR7  EQU   PSALKSA+28                                               03566000
PSALKR6  EQU   PSALKSA+24                                               03567000
PSALKR5  EQU   PSALKSA+20                                               03568000
PSALKR4  EQU   PSALKSA+16                                               03569000
PSALKR3  EQU   PSALKSA+12                                               03570000
PSALKR2  EQU   PSALKSA+8                                                03571000
PSALKR1  EQU   PSALKSA+4                                                03572000
PSALKR0  EQU   PSALKSA                                                  03573000
PSARV023 EQU   PSACLHT+52                                               03574000
PSALOCAL EQU   PSACLHT+48                                               03575000
PSACMSL  EQU   PSACLHT+44                                               03576000
PSAOPTL  EQU   PSACLHT+40                                               03577000
PSATPACL EQU   PSACLHT+36                                               03578000
PSATPDNL EQU   PSACLHT+32                                               03579000
PSATPNCL EQU   PSACLHT+28                                               03580000
PSAIOSLL EQU   PSACLHT+24                                               03581000
PSAIOSUL EQU   PSACLHT+20                                               03582000
PSAIOSCL EQU   PSACLHT+16                                               03583000
PSAIOSSL EQU   PSACLHT+12                                               03584000
PSASALCL EQU   PSACLHT+8                                                03585000
PSAASML  EQU   PSACLHT+4                                                03586000
PSADISPL EQU   PSACLHT                                                  03587000
PSASRSA  EQU   PSA+636                                                  03588000
PSARV050 EQU   PSA+634                                                  03589000
PSADSSGO EQU   PSA+633                                                  03590000
PSARECUR EQU   PSA+632                                                  03591000
PSAHLHIS EQU   PSA+628                                                  03592000
PSAIPCSA EQU   PSA+624                                                  03593000
@NM00022 EQU   PSA+621                                                  03594000
PSAIPCDM EQU   PSA+620                                                  03595000
PSAIPCD  EQU   PSA+616                                                  03596000
@NM00021 EQU   PSA+613                                                  03597000
PSAIPCRM EQU   PSA+612                                                  03598000
PSAIPCR  EQU   PSA+608                                                  03599000
PSAMCHEX EQU   PSA+600                                                  03600000
PSAMPSW  EQU   PSA+592                                                  03601000
PSAEXPS2 EQU   PSA+584                                                  03602000
PSAEXPS1 EQU   PSA+576                                                  03603000
PSAPIREG EQU   PSA+572                                                  03604000
PSARSREG EQU   PSA+568                                                  03605000
PSAGPREG EQU   PSA+556                                                  03606000
PSARV022 EQU   PSASUP4                                                  03607000
PSARV021 EQU   PSASUP4                                                  03608000
PSARV020 EQU   PSASUP4                                                  03609000
PSARV019 EQU   PSASUP4                                                  03610000
PSARV018 EQU   PSASUP4                                                  03611000
PSARV017 EQU   PSASUP4                                                  03612000
PSARV016 EQU   PSASUP4                                                  03613000
PSARV015 EQU   PSASUP4                                                  03614000
PSARV014 EQU   PSASUP3                                                  03615000
PSARV013 EQU   PSASUP3                                                  03616000
PSARV012 EQU   PSASUP3                                                  03617000
PSARV011 EQU   PSASUP3                                                  03618000
PSASPR   EQU   PSASUP3                                                  03619000
PSAPSREG EQU   PSASUP3                                                  03620000
PSAPI2   EQU   PSASUP3                                                  03621000
PSAIOSUP EQU   PSASUP3                                                  03622000
PSALCR   EQU   PSASUP2                                                  03623000
PSARTM   EQU   PSASUP2                                                  03624000
PSAACR   EQU   PSASUP2                                                  03625000
PSAIPCE2 EQU   PSASUP2                                                  03626000
PSAIPCES EQU   PSASUP2                                                  03627000
PSAIPCEC EQU   PSASUP2                                                  03628000
PSAGTF   EQU   PSASUP2                                                  03629000
PSAIPCRI EQU   PSASUP2                                                  03630000
PSAIPCRP EQU   PSASUP1                                                  03631000
PSAIPCDR EQU   PSASUP1                                                  03632000
PSADISP  EQU   PSASUP1                                                  03633000
PSALOCK  EQU   PSASUP1                                                  03634000
PSAPI    EQU   PSASUP1                                                  03635000
PSAEXT   EQU   PSASUP1                                                  03636000
PSASVC   EQU   PSASUP1                                                  03637000
PSAIO    EQU   PSASUP1                                                  03638000
PSAAOLD  EQU   PSA+548                                                  03639000
PSAANEW  EQU   PSA+544                                                  03640000
PSATOLD  EQU   PSA+540                                                  03641000
PSATNEW  EQU   PSA+536                                                  03642000
PSALCCAR EQU   PSA+532                                                  03643000
PSALCCAV EQU   PSA+528                                                  03644000
PSAPCCAR EQU   PSA+524                                                  03645000
PSAPCCAV EQU   PSA+520                                                  03646000
PSACPULA EQU   PSA+518                                                  03647000
PSACPUPA EQU   PSA+516                                                  03648000
PSAPSA   EQU   PSA+512                                                  03649000
FLCHDEND EQU   PSA+512                                                  03650000
FLCCRSAV EQU   FLCMCLA+280                                              03651000
FLCGRSAV EQU   FLCMCLA+216                                              03652000
FLCFPSAV EQU   FLCMCLA+184                                              03653000
FLCFLA   EQU   FLCMCLA+88                                               03654000
FLCRGNCD EQU   FLCMCLA+84                                               03655000
FLCFSAA  EQU   FLCFSA+1                                                 03656000
@NM00020 EQU   FLCFSA                                                   03657000
@NM00019 EQU   FLCMCLA+72                                               03658000
FLCMCIC  EQU   FLCMCLA+64                                               03659000
@NM00018 EQU   FLCMCLA+20                                               03660000
FLCIOAA  EQU   FLCIOA+1                                                 03661000
@NM00017 EQU   FLCIOA                                                   03662000
@NM00016 EQU   FLCMCLA+15                                               03663000
@NM00015 EQU   FLCMCLA+14                                               03664000
@NM00014 EQU   FLCMCLA+12                                               03665000
FLCLCL   EQU   FLCMCLA+8                                                03666000
FLCIOELA EQU   FLCIOEL+1                                                03667000
@NM00013 EQU   FLCIOEL                                                  03668000
FLCCHNID EQU   FLCMCLA                                                  03669000
@NM00012 EQU   PSA+160                                                  03670000
FLCMTRCD EQU   PSA+157                                                  03671000
@NM00011 EQU   PSA+156                                                  03672000
FLCPERA  EQU   FLCPER+1                                                 03673000
@NM00010 EQU   FLCPER                                                   03674000
@NM00009 EQU   PSA+151                                                  03675000
FLCPERCD EQU   PSA+150                                                  03676000
FLCMCNUM EQU   PSA+149                                                  03677000
@NM00008 EQU   PSA+148                                                  03678000
FLCTEAA  EQU   FLCTEA+1                                                 03679000
@NM00007 EQU   FLCTEA                                                   03680000
PSAPIPC  EQU   PSAPICOD                                                 03681000
PSAPIMC  EQU   PSAPICOD                                                 03682000
PSAPIPER EQU   PSAPICOD                                                 03683000
PSARV049 EQU   FLCPICOD                                                 03684000
FLCPILCB EQU   FLCPIILC                                                 03685000
@NM00006 EQU   FLCPIILC                                                 03686000
@NM00005 EQU   PSAEPPSW                                                 03687000
FLCSVCN  EQU   PSAESPSW+2                                               03688000
FLCSILCB EQU   FLCSVILC                                                 03689000
@NM00004 EQU   FLCSVILC                                                 03690000
@NM00003 EQU   PSAESPSW                                                 03691000
FLCEICOD EQU   PSAEEPSW+2                                               03692000
PSASPAD  EQU   PSAEEPSW                                                 03693000
@NM00002 EQU   PSA+128                                                  03694000
FLCINPSW EQU   PSA+120                                                  03695000
FLCMNPSW EQU   PSA+112                                                  03696000
FLCPNPSW EQU   PSA+104                                                  03697000
FLCSNPSW EQU   PSA+96                                                   03698000
FLCENPSW EQU   PSA+88                                                   03699000
FLCTRACE EQU   PSA+84                                                   03700000
FLCTIMER EQU   PSA+80                                                   03701000
FLCCVT2  EQU   PSA+76                                                   03702000
FLCCAW   EQU   PSA+72                                                   03703000
FLCCSW   EQU   PSA+64                                                   03704000
FLCIOPSW EQU   PSA+56                                                   03705000
FLCMOPSW EQU   PSA+48                                                   03706000
FLCPOPSW EQU   PSA+40                                                   03707000
FLCSOPSW EQU   PSA+32                                                   03708000
FLCEOPSW EQU   PSA+24                                                   03709000
@NM00001 EQU   FLCICCW2+4                                               03710000
FLCICCW1 EQU   FLCROPSW                                                 03711000
FLCIPPSW EQU   FLCRNPSW                                                 03712000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03713000
@ENDDATA EQU   *                                                        03714000
         END   ISTZBMJA,(C'PLS0954',0603,75136)                         03715000
