         TITLE 'ISTZJFCB/ACB-VS1/MCB-VS2 - TPIOS NRP PHASE III - INVITE*00001000
               E        '                                               00002000
ISTZJFCB CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZJFCB  75.130'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
          EJECT                                                         00011000
*/* TPZSAVE (7,12,14) BASE AC(JCCB)                                  */ 00012000
*                                                                  0242 00013000
*   DO;                                                            0242 00014000
*     DCL                                                          0243 00015000
*       GPR01F FIXED(31) REG(01);                                  0243 00016000
*     DCL                                                          0244 00017000
*       GPR01P PTR(31) REG(01);                                    0244 00018000
*     DCL                                                          0245 00019000
*       GPR12F FIXED(31) REG(12);                                  0245 00020000
*     DCL                                                          0246 00021000
*       GPR12P PTR(31) REG(12);                                    0246 00022000
*     DCL                                                          0247 00023000
*       GPR13F FIXED(31) REG(13);                                  0247 00024000
*     DCL                                                          0248 00025000
*       GPR13P PTR(31) REG(13);                                    0248 00026000
*     DCL                                                          0249 00027000
*       GPR14F FIXED(31) REG(14);                                  0249 00028000
*     DCL                                                          0250 00029000
*       GPR14P PTR(31) REG(14);                                    0250 00030000
*     RFY                                                          0251 00031000
*      (GPR01P,                                                    0251 00032000
*       GPR12P,                                                    0251 00033000
*       GPR13P,                                                    0251 00034000
*       GPR14P) RSTD;                                              0251 00035000
*     GEN(PRINT OFF);                                              0252 00036000
*                                                                  0252 00037000
         PRINT OFF                                                      00038000
*/* ATBUILD (ISTZSAVE)                                               */ 00039000
*/* END OF ATBUILD                                                   */ 00040000
*                                                                  0253 00041000
*     GEN(PRINT ON);                                               0253 00042000
         PRINT ON                                                       00043000
*     RFY                                                          0254 00044000
*       ISTZSAVE BASED(GPR13P);                                    0254 00045000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0255 00046000
         STM   7,12,ZSAZSVVR+0(13)                                      00047000
*     GEN SETS(GPR12P);                                            0256 00048000
         BALR  GPR12P,0                                                 00049000
@TSTART  DS    0H                                                       00050000
         USING @TSTART,GPR12P                                           00051000
*     GEN(PRINT OFF);                                              0257 00052000
*                                                                  0257 00053000
         PRINT OFF                                                      00054000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00055000
*                                                                  0258 00056000
*/* COMPONENT RECOVERY RECORD FOR TPIOS */                         0258 00057000
*/*  DELTA                                             006 02/10/75  */ 00058000
*DCL                                                               0258 00059000
*1  ISTZCRR BDY(WORD) BASED,     /* CONTROL WORD                     */ 00060000
*   2  ZCRCRR CHAR(4),           /* CONTROL WORD                     */ 00061000
*      3  ZCRID CHAR(1),         /* CONTROL BLOCK ID                 */ 00062000
*      3  ZCRLEN CHAR(2),        /* LENGTH OF ZCR                    */ 00063000
*      3  ZCRFLAG CHAR(1),       /* FLAGS                            */ 00064000
*   2  ZCRCHAIN PTR(31),         /* POINTER TO PREVIOUS ZCR          */ 00065000
*   2  ZCRFRRA PTR(31),          /* PTR TO FRR                       */ 00066000
*   2  ZCRFLGS1 CHAR(1),         /* FLGS USED BY REQUEST COMPLETION  */ 00067000
*      3  ZCREXSW BIT(1),        /* EXIT SWITCH                      */ 00068000
*      3  ZCRQUESW BIT(1),       /* QUEUE SWITCH                     */ 00069000
*      3  ZCRDEQSW BIT(1),       /* DEQUEUE SWITCH                   */ 00070000
*      3  ZCRWAIT BIT(1),        /* WAIT Q ANALYSIS COMPLETE         */ 00071000
*      3  ZCRNRMEX BIT(1),       /* NORMAL EXIT TO BE TAKEN          */ 00072000
*      3  ZCRENDLP BIT(1),       /* END OF LOOP SWITCH               */ 00073000
*      3  ZCRUNSOL BIT(1),       /* UNSOLICITED DATA                 */ 00074000
*      3  ZCRFEXIT BIT(1),       /* FORCE EXIT SWITCH                */ 00075000
*   2  ZCRFLGS2 CHAR(1),         /* FLAGS USED WITHIN TPIOS          */ 00076000
*      3  ZCRLOCAL BIT(1),       /* LOCAL SUPPORT                    */ 00077000
*      3  ZCRSHEDI BIT(1),       /* IMMEDIATE SCHEDULE               */ 00078000
*      3  ZCRFMSED BIT(1),       /* FMCB SEARCH ENDED                */ 00079000
*      3  ZCROB    BIT(1),       /* OUTBOUND PROC IN PROGRESS        */ 00080000
*      3  ZCRIF0E1 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   00081000
*                                   INBOUND PROCESSING               */ 00082000
*      3  ZCRIF0E2 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   00083000
*                                   INBOUND PROCESSING               */ 00084000
*      3  ZCRIF0E3 BIT(1),       /* SWITCH FOR STRUCTURED PGM USED BY   00085000
*                                   INBOUND PROCESSING               */ 00086000
*   2  ZCRSWFLD CHAR(1),         /* SWITCHES FOR TPIOS OUTBOUND      */ 00087000
*      3  ZCRENDSH BIT(1),       /* EXIT FROM REMOTE DEV SCHEDULER   */ 00088000
*         4  ZCRSLCP BIT(1),     /* SCHEDULE LCPB                    */ 00089000
*      3  ZCREXTYP BIT(1),       /* TPEXIT TYPE                      */ 00090000
*      3  ZCRENDPR BIT(1),       /* EXIT FROM INNER PROCESS          */ 00091000
*      3  ZCRNDLCP BIT(1),       /* EXIT FROM LCPB PROCESSING        */ 00092000
*         4  ZCROB1 BIT(1),      /* REMOTE DEV SCHED 1ST TIME SWITCH */ 00093000
*      3  ZCRENDX BIT(1),        /* EXIT FROM LCCW/BTU XLATION       */ 00094000
*      3  ZCRENDXL BIT(1),       /* EXIT FROM LCCW PROC              */ 00095000
*      3  ZCRENDAN BIT(1),       /* EXIT FROM LCPB ANALYSIS          */ 00096000
*      3  ZCRRESET BIT(1),                                         0258 00097000
*         4  ZCRCNLXL BIT(1),    /* CANCEL FURTHER XLATE             */ 00098000
*   2  ZCRFLGS3 CHAR(1),         /* FLAGS FOR OUTBOUND PROCESSING    */ 00099000
*      3  ZCRTIC BIT(1),         /* SELECT NOT TO BE SENT            */ 00100000
*      3  ZCRTPCON BIT(1),       /* TPIOS CONTACT SENT               */ 00101000
*      3  ZCRTPDIS BIT(1),       /* TPIOS DISCONNECT TO BE SENT      */ 00102000
*      3  ZCRDISC  BIT(1),       /* DISCONNECT IN PROCESS            */ 00103000
*      3  ZCREDRIV BIT(1),       /* DO DERIVE                        */ 00104000
*      3  ZCRNOFRE BIT(1),       /* NO FREEING OF SIO QUEUE          */ 00105000
*      3  ZCRWRPTR BIT(1),       /* WRITE TO PRINTER REQUEST         */ 00106000
*      3  ZCRINLCP BIT(1),       /* ERROR OCCURED DURING OUTBND PROC */ 00107000
*   2  ZCRGENSW CHAR(1),         /* GENERAL SWITCHES                 */ 00108000
*      3  ZCRTSW1  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 00109000
*      3  ZCRTSW2  BIT(1),       /* TEMP SW FOR STRUCTURED PGM       */ 00110000
*      3  ZCRRT06  BIT(1),       /* CRITICAL TEXT OPTION             */ 00111000
*      3  ZCRLCSYN BIT(1),       /* LCCW SYNC SPECIFIED              */ 00112000
*      3  ZCREXRES BIT(1),       /* EXCEPTION RESPONSE SPECIFIED     */ 00113000
*      3  ZCRCLRBD BIT(1),       /* FLAG INDICATING BIND WAS CLEARED */ 00114000
*      3  ZCRBRIS  BIT(1),       /* BRACKET REJECTED DUE TO IN BRAC. */ 00115000
*      3  ZCRF1RES BIT(1),       /* FID1 RESPONSE TO BE GENERATED    */ 00116000
*   2  ZCRPFLGS CHAR(1),         /* UTILITIES PROC OPTION FLAGS      */ 00117000
*      3  ZCRQAHED BIT(1),      /* QXFR RTN TO USE INSERT OPT'N ON TPQ* 00118000
*      3  *        BIT(7),      /* RESERVED                          */ 00119000
*   2  ZCRIBPR CHAR(1),          /* INBOUND PROCESSING FLAGS         */ 00120000
*         3  ZCRNOBUF BIT(1),    /* FSB WITH NO BUFFER               */ 00121000
*         3  ZCRERR   BIT(1),    /* ERROR INDICATOR                  */ 00122000
*         3  ZCRRELK  BIT(1),    /* RESET ERROR LOCK FUNCTION REQ.   */ 00123000
*         3  ZCRLCPFR BIT(1),    /* FLAG IND. DEALLOCATE ATOP LCPB   */ 00124000
*         3  ZCRLCPFD BIT(1),    /* FLAG IND. LCPB FOUND ON WAITQ    */ 00125000
*         3  ZCR3270  BIT(1),    /* 3270 DEVICE                      */ 00126000
*         3  ZCR3270R BIT(1),    /* 3270 DEVICE IN RECORD MODE       */ 00127000
*         3  *        BIT(1),    /* RESERVED                         */ 00128000
*   2  ZCRSCPSW CHAR(1),         /* SESSION CONTROL FLAGS            */ 00129000
*         3  ZCRTPEX BIT(1),     /* TP EXIT                          */ 00130000
*         3  ZCRTPINV BIT(1),    /* INVOKE TPIOS                     */ 00131000
*         3  ZCRRJLCP BIT(1),    /* LCPB REJECTED                    */ 00132000
*         3  ZCRLREQ BIT(1),     /* REQUEST                          */ 00133000
*         3  ZCRPRCMP BIT(1),    /* PROCESSING COMPLETE              */ 00134000
*         3  ZCRFSBWE BIT(1),    /* FSB IS WORK ELEMENT              */ 00135000
*         3  ZCRSKIPT BIT(1),    /* SKIP TRACE FLAG                  */ 00136000
*         3  *       BIT(1),     /* RESERVED                         */ 00137000
*   2  ZCRCRLCP PTR(31),         /* CURRENT LCPB PTR                 */ 00138000
*   2  ZCRPARMS BDY(WORD),       /* PARAMETERS PASSED TO UTILITIES */   00139000
*      3  ZCRFBPTR PTR(31),      /* PTR TO FROM BUFFER               */ 00140000
*         4  ZCRCBPTR PTR(31),   /* PTR TO CURRENT BUFFER            */ 00141000
*      3  ZCRTBPTR PTR(31),      /* PTR TO TO-OR-TRANSLATE BUFFER    */ 00142000
*      3  ZCRMLNG FIXED(15),     /* LENGTH TO MOVE                   */ 00143000
*      3  ZCRDFRDA FIXED(15),    /* OFFSET FROM DATA ADDR IN FROM BUF*/ 00144000
*         4  ZCRDTODA FIXED(15), /* OFFSET FROM DATA ADDR XLATE BUF  */ 00145000
*      3  ZCRPCOD1 CHAR(1),      /* CODE BYTE FOR ALLOC/DISALLOC     */ 00146000
*         4  ZCRPPG BIT(1),      /* GET PAGEABLE BUFF                */ 00147000
*         4  ZCRPLNG BIT(1),     /* LENGTH OF BUFFER SPECIFIED       */ 00148000
*         4  ZCRPFSB BIT(1),     /* GET FSB                          */ 00149000
*         4  ZCRPLSBF BIT(1),    /* GET LSCB AND BUFFER              */ 00150000
*            5 ZCRPLSBQ BIT(1),  /* PURGE LSCB QUEUE                 */ 00151000
*         4  ZCRPLSCB BIT(1),    /* GET OR RELEASE LSCB              */ 00152000
*         4  ZCRPBUF BIT(1),     /* GET OR RELEASE BUFFER            */ 00153000
*         4  ZCRPCFTX BIT(1),    /* CONFIDENTIAL TEXT                */ 00154000
*         4  ZCRPRES BIT(1),     /* RESERVED                         */ 00155000
*      3  ZCRPCOD2 CHAR(1),      /* CODE BYTE FOR MOVE               */ 00156000
*         4  ZCRPPG2 BIT(1),     /* GET PAGEABLE BUFFER              */ 00157000
*         4  ZCRPFHDR BIT(1),    /* FROM BUFFER FDB TO BE USED       */ 00158000
*         4  ZCRPMFGF BIT(1),    /* MOVE STARTS WIHT 1ST BUFF IN BLOCK* 00159000
*         4  ZCRPRES2 BIT(5),    /* RESERVED                         */ 00160000
*      3  ZCRPCHAR CHAR(1),      /* TRANSLATE & TEST SEARCH CHARACTER*/ 00161000
*      3  ZCRPSW   CHAR(1),      /* SWITCH FIELD                     */ 00162000
*   2  ZCRCCWA PTR(31),          /* PTR TO CURRENT CCW (CCW 1 OR 2)  */ 00163000
*   2  ZCRBFPTR PTR(31),         /* SAVE 1ST BUFF PTR IN TO-BUFF CHN    00164000
*                                   OR LAST BUFFER IN CHANNEL PGM    */ 00165000
*   2  ZCRZLB PTR(31),           /* PTR TO CURR BUFF IN CHANNEL PGM  */ 00166000
*   2  ZCRPVZB PTR(31),          /* PTR TO PREVIOUS BUFF IN CHAN PGM */ 00167000
*   2  ZCRSVRTN BDY(WORD),       /* REG 14 SAVE AREAS                */ 00168000
*      3  ZCRSVF1 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00169000
*      3  ZCRSVF2 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00170000
*      3  ZCRSVF3 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00171000
*      3  ZCRSVF4 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00172000
*      3  ZCRSVF5 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00173000
*      3  ZCRSVF6 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00174000
*      3  ZCRSVF7 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00175000
*      3  ZCRSVF8 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00176000
*      3  ZCRSVF9 PTR(31),       /* SAVE REQUIRED REGISTER           */ 00177000
*      3  ZCRSVF10 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00178000
*      3  ZCRSVF11 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00179000
*      3  ZCRSVF12 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00180000
*      3  ZCRSVF13 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00181000
*      3  ZCRSVF14 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00182000
*      3  ZCRSVF15 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00183000
*      3  ZCRSVF16 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00184000
*      3  ZCRSVF17 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00185000
*      3  ZCRSVF18 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00186000
*      3  ZCRSVF19 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00187000
*      3  ZCRSVF20 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00188000
*      3  ZCRSVF21 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00189000
*      3  ZCRSVF22 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00190000
*      3  ZCRSVF23 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00191000
*      3  ZCRSVF24 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00192000
*      3  ZCRSVF25 PTR(31),      /* SAVE REQUIRED REGISTER           */ 00193000
*   2  ZCRWKARA BDY(WORD),       /* TEMPORARY REG SAVE AREA          */ 00194000
*      3  ZCRSVWK1 PTR(31),      /* SAVE REQUIRED REG                */ 00195000
*      3  ZCRSVWK2 PTR(31),      /* SAVE REQUIRED REG                */ 00196000
*      3  ZCRSVWK3 PTR(31),      /* SAVE REQUIRED REG                */ 00197000
*      3  ZCRSVWK4 PTR(31),      /* SAVE REQUIRED REG                */ 00198000
*      3  ZCRSVWK5 PTR(31),      /* SAVE REQUIRED REG                */ 00199000
*   2  ZCRFSBSV PTR(31),         /* FSB CHAIN PTR SAVEAREA           */ 00200000
*   2  ZCRFBPRC BIT(1),          /* FSB PROCESS SW                   */ 00201000
*   2  ZCRMOREL BIT(1),          /* MORE ELEMENTS SW                 */ 00202000
*   2  ZCRSCANQ BIT(1),          /* SCAN QUEUE SW                    */ 00203000
*   2  ZCRNXTEL BIT(1),          /* NEXT ELEMENT SW                  */ 00204000
*   2  ZCRXSCHD BIT(1),          /* EXIT SCHEDULE SW                 */ 00205000
*   2  ZCRLSTFB BIT(1),          /* INBOUND PROC LAST FSB FOR ELEM SW*/ 00206000
*   2  ZCRTOPQ  BIT(1),          /* QUEUE ELEMENT TO TOP SW          */ 00207000
*   2  ZCRAWQSW BIT(1),          /* CHECK AWAITQ FOR MORE WORK =1    */ 00208000
*                                /* CHECK WAITQ =0                   */ 00209000
*   2  ZCRRCDSV CHAR(1),         /* RETURN CODE SAVEAREA             */ 00210000
*   2  ZCRPRMTC CHAR(1),         /* PREEMPT COMPLETION PARAMETER BYTE*/ 00211000
*   2  ZCROPCDE CHAR(1),         /* OP CODE TO BE TRANSFORMED         * 00212000
*   2  ZCRR2SV PTR(31),          /* ISTZBFDI REG 2 SAVE EREA         */ 00213000
*   2  ZCRR13SV PTR(31),         /* ISTSBFDI REG 13 SAVE EREA        */ 00214000
*   2  ZCRCIDSV BDY(WORD),       /* ISTZBFDI CID SAVE AREA           */ 00215000
*      3  ZCRSAFSV CHAR(2),      /* ISTZBFDI SAF SAVE AREA           */ 00216000
*      3  ZCRDAFSV CHAR(2),      /* ISTZBFDI DAF SAVE AREA           */ 00217000
*   2  ZCRSAVEZ (6) BDY(WORD) CHAR(LENGTH(ISTZSAVE)),              0258 00218000
*                                /* SAVE/TRACE AREAS FOR TPIOS MODS  */ 00219000
*   2  ZCRREMIC PTR(31),        /* POINTER TO REMOTE RN ICNCB        */ 00220000
*   2  ZCRAUDIT CHAR(36),        /* TPIOS AUDIT TRAIL AREA           */ 00221000
*      3  ZCRTID CHAR(1),        /* THREAD I.D.                      */ 00222000
*      3  ZCRTNAME CHAR(4),      /* LAST 4 CHARS OF THREAD NAME      */ 00223000
*      3  ZCRENTER BIT(248),     /* BIT ARRAY FOR MODULES ENTERED    */ 00224000
*         4  ZCREAC1A BIT(1),    /* ISTZAC1A ENTERED                 */ 00225000
*         4  ZCREAC0A BIT(1),    /* ISTZAC0A ENTERED                 */ 00226000
*         4  ZCREAC0B BIT(1),    /* ISTZAC0B ENTERED                 */ 00227000
*         4  ZCREAC1B BIT(1),    /* ISTZAC1B ENTERED                 */ 00228000
*         4  ZCREBCAA BIT(1),    /* ISTZBCAA ENTERED                 */ 00229000
*         4  ZCREBCAB BIT(1),    /* ISTZBCAB ENTERED                 */ 00230000
*         4  ZCREBCAE BIT(1),    /* ISTZBCAE ENTERED                 */ 00231000
*         4  ZCREBCAG BIT(1),    /* ISTZBCAG ENTERED                 */ 00232000
*         4  ZCREBCAI BIT(1),    /* ISTZBCAI ENTERED                 */ 00233000
*         4  ZCREBCAM BIT(1),    /* ISTZBCAM ENTERED                 */ 00234000
*         4  ZCREBCBA BIT(1),    /* ISTZBCBA ENTERED                 */ 00235000
*         4  ZCREBCBB BIT(1),    /* ISTZBCBB ENTERED                 */ 00236000
*         4  ZCREBCBI BIT(1),    /* ISTZBCBI ENTERED                 */ 00237000
*         4  ZCREBCCB BIT(1),    /* ISTZBCCB ENTERED                 */ 00238000
*         4  ZCREBCDI BIT(1),    /* ISTZBCDI ENTERED                 */ 00239000
*         4  ZCREBCEB BIT(1),    /* ISTZBCEB ENTERED                 */ 00240000
*         4  ZCREBCFA BIT(1),    /* ISTZBCFA ENTERED                 */ 00241000
*         4  ZCREBCFB BIT(1),    /* ISTZBCFB ENTERED                 */ 00242000
*         4  ZCREBCGA BIT(1),    /* ISTZBCGA ENTERED                 */ 00243000
*         4  ZCREBCGB BIT(1),    /* ISTZBCGB ENTERED                 */ 00244000
*         4  ZCREBCHA BIT(1),    /* ISTZBCHA ENTERED                 */ 00245000
*         4  ZCREBCHB BIT(1),    /* ISTZBCHB ENTERED                 */ 00246000
*         4  ZCREBCIA BIT(1),    /* ISTZBCIA ENTERED                 */ 00247000
*         4  ZCREBCIB BIT(1),    /* ISTZBCIB ENTERED                 */ 00248000
*         4  ZCREBCID BIT(1),    /* ISTZBCID ENTERED                 */ 00249000
*         4  ZCREBCJA BIT(1),    /* ISTZBCJA ENTERED                 */ 00250000
*         4  ZCREBCJB BIT(1),    /* ISTZBCJB ENTERED                 */ 00251000
*         4  ZCREBCKA BIT(1),    /* ISTZBCKA ENTERED                 */ 00252000
*         4  ZCREBCKB BIT(1),    /* ISTZBCKB ENTERED                 */ 00253000
*         4  ZCREBCLA BIT(1),    /* ISTZBCLA ENTERED                 */ 00254000
*         4  ZCREBCLB BIT(1),    /* ISTZBCLB ENTERED                 */ 00255000
*         4  ZCREBCMB BIT(1),    /* ISTZBCMB ENTERED                 */ 00256000
*         4  ZCREBCND BIT(1),    /* ISTZBCND ENTERED                 */ 00257000
*         4  ZCREBCNE BIT(1),    /* ISTZBCNE ENTERED                 */ 00258000
*         4  ZCREBCOB BIT(1),    /* ISTZBCOB ENTERED                 */ 00259000
*         4  ZCREBCPB BIT(1),    /* ISTZBCPB ENTERED                 */ 00260000
*         4  ZCREBCQB BIT(1),    /* ISTZBCQB ENTERED                 */ 00261000
*         4  ZCREBCRA BIT(1),    /* ISTZBCRA ENTERED                 */ 00262000
*         4  ZCREBCRB BIT(1),    /* ISTZBCRB ENTERED                 */ 00263000
*         4  ZCREBCSC BIT(1),    /* ISTZBCSC ENTERED                 */ 00264000
*         4  ZCREBCXA BIT(1),    /* ISTZBCXA ENTERED                 */ 00265000
*         4  ZCREBCX0 BIT(1),    /* ISTZBCX0 ENTERED                 */ 00266000
*         4  ZCREBCY0 BIT(1),    /* ISTZBCY0 ENTERED                 */ 00267000
*         4  ZCREBCZ0 BIT(1),    /* ISTZBCZ0 ENTERED                 */ 00268000
*         4  ZCREBC0A BIT(1),    /* ISTZBC0A ENTERED                 */ 00269000
*         4  ZCREBC0B BIT(1),    /* ISTZBC0B ENTERED                 */ 00270000
*         4  ZCRECC0A BIT(1),    /* ISTZCC0A ENTERED                 */ 00271000
*         4  ZCRECC0B BIT(1),    /* ISTZCC0B ENTERED                 */ 00272000
*         4  ZCRECC1A BIT(1),    /* ISTZCC1A ENTERED                 */ 00273000
*         4  ZCRECC1B BIT(1),    /* ISTZCC1B ENTERED                 */ 00274000
*         4  ZCRECC2B BIT(1),    /* ISTZCC2B ENTERED                 */ 00275000
*         4  ZCREDCA0 BIT(1),    /* ISTZDCA0 ENTERED                 */ 00276000
*         4  ZCREDCB0 BIT(1),    /* ISTZDCB0 ENTERED                 */ 00277000
*         4  ZCREDCC0 BIT(1),    /* ISTZDCC0 ENTERED                 */ 00278000
*         4  ZCREDCD0 BIT(1),    /* ISTZDCD0 ENTERED                 */ 00279000
*         4  ZCREDCE0 BIT(1),    /* ISTZDCE0 ENTERED                 */ 00280000
*         4  ZCREDCF0 BIT(1),    /* ISTZDCF0 ENTERED                 */ 00281000
*         4  ZCREDCH0 BIT(1),    /* ISTZDCH0 ENTERED                 */ 00282000
*         4  ZCREDCI0 BIT(1),    /* ISTZDCI0 ENTERED                 */ 00283000
*         4  ZCREDCJ0 BIT(1),    /* ISTZDCJ0 ENTERED                 */ 00284000
*         4  ZCREDCKA BIT(1),    /* ISTZDCKA ENTERED                 */ 00285000
*         4  ZCREDCKB BIT(1),    /* ISTZDCKB ENTERED                 */ 00286000
*         4  ZCREDCL0 BIT(1),    /* ISTZDCL0 ENTERED                 */ 00287000
*         4  ZCREDCMB BIT(1),    /* ISTZDCMB ENTERED                 */ 00288000
*         4  ZCREECBA BIT(1),    /* ISTZECBA ENTERED                 */ 00289000
*         4  ZCREECBB BIT(1),    /* ISTZECBB ENTERED                 */ 00290000
*         4  ZCREECCA BIT(1),    /* ISTZECCA ENTERED                 */ 00291000
*         4  ZCREECCB BIT(1),    /* ISTZECCB ENTERED                 */ 00292000
*         4  ZCREECDA BIT(1),    /* ISTZECDA ENTERED                 */ 00293000
*         4  ZCREECEA BIT(1),    /* ISTZECEA ENTERED                 */ 00294000
*         4  ZCREECTA BIT(1),    /* ISTZECTA ENTERED                 */ 00295000
*         4  ZCREFCEA BIT(1),    /* ISTZFCEA ENTERED                 */ 00296000
*         4  ZCREFCEB BIT(1),    /* ISTZFCEB ENTERED                 */ 00297000
*         4  ZCREGCAB BIT(1),    /* ISTZGCAB ENTERED                 */ 00298000
*         4  ZCREGCBB BIT(1),    /* ISTZGCBB ENTERED                 */ 00299000
*         4  *        BIT(1),    /* NOT USED                         */ 00300000
*         4  ZCREGCDB BIT(1),    /* ISTZGCDB ENTERED                 */ 00301000
*         4  ZCREGCEB BIT(1),    /* ISTZGCEB ENTERED                 */ 00302000
*         4  ZCREGCLA BIT(1),    /* ISTZGCLA ENTERED                 */ 00303000
*         4  ZCREGC0A BIT(1),    /* ISTZGC0A ENTERED                 */ 00304000
*         4  ZCREGC0B BIT(1),    /* ISTZGC0B ENTERED                 */ 00305000
*         4  ZCREHCAN BIT(1),    /* ISTZHCAN ENTERED                 */ 00306000
*         4  ZCREICAA BIT(1),    /* ISTZICAA ENTERED                 */ 00307000
*         4  ZCREICAB BIT(1),    /* ISTZICAB ENTERED                 */ 00308000
*         4  ZCREICBB BIT(1),    /* ISTZICBB ENTERED                 */ 00309000
*         4  ZCREICBI BIT(1),    /* ISTZICBI ENTERED                 */ 00310000
*         4  ZCREICCB BIT(1),    /* ISTZICCB ENTERED                 */ 00311000
*         4  ZCREICCI BIT(1),    /* ISTZICCI ENTERED                 */ 00312000
*         4  ZCREICDB BIT(1),    /* ISTZICDB ENTERED                 */ 00313000
*         4  ZCREICEB BIT(1),    /* ISTZICEB ENTERED                 */ 00314000
*         4  ZCREICGB BIT(1),    /* ISTZICGB ENTERED                 */ 00315000
*         4  ZCREICHB BIT(1),    /* ISTZICHB ENTERED                 */ 00316000
*         4  ZCREICIB BIT(1),    /* ISTZICIB ENTERED                 */ 00317000
*         4  ZCREICID BIT(1),    /* ISTZICID ENTERED                 */ 00318000
*         4  ZCREICJB BIT(1),    /* ISTZICJB ENTERED                 */ 00319000
*         4  ZCREICKB BIT(1),    /* ISTZICKB ENTERED                 */ 00320000
*         4  ZCREICKE BIT(1),    /* ISTZICKE ENTERED                 */ 00321000
*         4  ZCREICKG BIT(1),    /* ISTZICKG ENTERED                 */ 00322000
*         4  ZCREICLB BIT(1),    /* ISTZICLB ENTERED                 */ 00323000
*         4  ZCREICMB BIT(1),    /* ISTZICMB ENTERED                 */ 00324000
*         4  ZCREICNA BIT(1),    /* ISTZICNA ENTERED                 */ 00325000
*         4  ZCREICNB BIT(1),    /* ISTZICNB ENTERED                 */ 00326000
*         4  ZCREICOA BIT(1),    /* ISTZICOA ENTERED                 */ 00327000
*         4  ZCREICOB BIT(1),    /* ISTZICOB ENTERED                 */ 00328000
*         4  ZCREICQA BIT(1),    /* ISTZICQA ENTERED                 */ 00329000
*         4  ZCREICQB BIT(1),    /* ISTZICQB ENTERED                 */ 00330000
*         4  ZCREICRB BIT(1),    /* ISTZICRB ENTERED                 */ 00331000
*         4  ZCREICSB BIT(1),    /* ISTZICSB ENTERED                 */ 00332000
*         4  ZCREICSC BIT(1),    /* ISTZICSC ENTERED                 */ 00333000
*         4  ZCREICTB BIT(1),    /* ISTZICTB ENTERED                 */ 00334000
*         4  ZCREICUB BIT(1),    /* ISTZICUB ENTERED                 */ 00335000
*         4  ZCREICVB BIT(1),    /* ISTZICVB ENTERED                 */ 00336000
*         4  ZCREICWB BIT(1),    /* ISTZICWB ENTERED                 */ 00337000
*         4  ZCREICX0 BIT(1),    /* ISTZICX0 ENTERED                 */ 00338000
*         4  ZCREIC0B BIT(1),    /* ISTZIC0B ENTERED                 */ 00339000
*         4  ZCREIC1B BIT(1),    /* ISTZIC1B ENTERED                 */ 00340000
*         4  ZCREJCAB BIT(1),    /* ISTZJCAB ENTERED                 */ 00341000
*         4  ZCREJCBB BIT(1),    /* ISTZJCBB ENTERED                 */ 00342000
*         4  ZCREJCCB BIT(1),    /* ISTZJCCB ENTERED                 */ 00343000
*         4  ZCREJCDB BIT(1),    /* ISTZJCDB ENTERED                 */ 00344000
*         4  ZCREJC0B BIT(1),    /* ISTZJC0B ENTERED                 */ 00345000
*         4  ZCREKCBB BIT(1),    /* ISTZKCBB ENTERED                 */ 00346000
*         4  ZCREKCBN BIT(1),    /* ISTZKCBN ENTERED                 */ 00347000
*         4  ZCREKCCN BIT(1),    /* ISTZKCCN ENTERED                 */ 00348000
*         4  ZCREDCWR BIT(1),    /* ISTZDCWR ENTERED                 */ 00349000
*         4  ZCREDCWB BIT(1),    /* ISTZDCWB ENTERED                 */ 00350000
*         4  ZCREDCXR BIT(1),    /* ISTZDCXR ENTERED                 */ 00351000
*         4  ZCREBCBR BIT(1),    /* ISTZBCBR ENTERED                 */ 00352000
*         4  ZCREBCDR BIT(1),    /* ISTZBCDR ENTERED                 */ 00353000
*         4  ZCREBCAR BIT(1),    /* ISTZBCAR ENTERED                 */ 00354000
*         4  ZCRECCBI BIT(1),    /* ISTZCCBI ENTERED                 */ 00355000
*         4  ZCRECCAI BIT(1),    /* ISTZCCAI ENTERED                 */ 00356000
*         4  ZCRECCCI BIT(1),    /* ISTZCCCI ENTERED                 */ 00357000
*         4  ZCREAC1R BIT(1),    /* ISTZAC1R ENTERED                 */ 00358000
*         4  ZCREBCSB BIT(1),    /* ISTZBCSB ENTERED                 */ 00359000
*         4  ZCREDCPR BIT(1),    /* ISTZDCPR ENTERED                 */ 00360000
*         4  ZCREDCQR BIT(1),    /* ISTZDCQR ENTERED                 */ 00361000
*         4  ZCREBCAL BIT(1),    /* ISTZBCAL ENTERED                 */ 00362000
*         4  ZCREBC0L BIT(1),    /* ISTZBC0L ENTERED                 */ 00363000
*         4  ZCREBCNB BIT(1),    /* ISTZBCNB ENTERED                 */ 00364000
*         4  ZCREICOE BIT(1),    /* ISTZICOE ENTERED                 */ 00365000
*         4  ZCREDCNB BIT(1),    /* ISTZDCNB ENTERED                 */ 00366000
*         4  ZCREKCCB BIT(1),    /* ISTZKCCB ENTERED                 */ 00367000
*         4  ZCRECFY0 BIT(1),    /* ISTZCFY0 ENTERED                 */ 00368000
*         4  ZCREDCK0 BIT(1),    /* ISTZDFK0 ENTERED                 */ 00369000
*         4  ZCREICSG BIT(1),    /* ISTZICSG ENTERED                 */ 00370000
*         4  ZCREBCIF BIT(1),    /* ISTZBCIF ENTERED                 */ 00371000
*         4  ZCREDCMF BIT(1),    /* ISTZDCMF ENTERED                 */ 00372000
*         4  ZCRELCAB BIT(1),    /* ISTZLCAB ENTERED                 */ 00373000
*         4  ZCREAC2B BIT(1),    /* ISTZAC2B ENTERED                 */ 00374000
*         4  ZCREIC2B BIT(1),    /* ISTZIC2B ENTERED                 */ 00375000
*         4  ZCRRSV97 BIT(97),   /* RESERVED                         */ 00376000
*   2  ZCRCMNRC CHAR(1),                /* PURGE MWOR RETURN CODE    */ 00377000
*   2  ZCRWORDA CHAR(3),                /* RESERVED FOR LATER USE    */ 00378000
*   2  ZCRLCPB  CHAR(LENGTH(ISTLCPB)),  /* 3270 S/R LCPB             */ 00379000
*      3 ZCRRHRU,                       /* SAVEAREA FOR RH AND RU    */ 00380000
*        4 ZCRRH    CHAR(3),            /* RH                        */ 00381000
*        4 ZCRRU    CHAR(*);            /* RU                        */ 00382000
*DCL ZCTYPE BIT(8) CONSTANT('00'X);   /* ZCR TYPE                   */  00383000
*DCL ZCLNG FIXED(15) CONSTANT(172);   /* ZCRR LENGTH                */  00384000
*DCL ZCRSAVNO BIT(8) CONSTANT('06'X); /* NUMBER OF SAVEAREAS IN ZCRR */ 00385000
*DCL ZCRLSVNO BIT(8) CONSTANT('04'X); /* NUMBER OF SAVE AREAS IN   0262 00386000
*                                         LOCAL SUPPORT              */ 00387000
*/* *** EQUATES FOR ZCRRCDSV *** */                                0263 00388000
*                                                                  0263 00389000
*DCL ZCRMRFSB BIT(8) CONSTANT('0C'X);  /* REQUEST COMPLETION MOVE FSB   00390000
*                                         TO PROCESS                 */ 00391000
*DCL ZCRSRCHQ BIT(8) CONSTANT('10'X);  /* REQUEST COMPLETION SEARCH     00392000
*                                         REQUEST QUEUE              */ 00393000
*DCL ZCREXIT  BIT(8) CONSTANT('14'X);  /* REQUEST COMPLETION EXIT    */ 00394000
*DCL ZCRSFSB  BIT(8) CONSTANT('18'X);  /* REQUEST COMPLETION SINGLE     00395000
*                                         FSB                        */ 00396000
*DCL ZCRDLFSB BIT(8) CONSTANT('1C'X);  /* REQUEST COMPLETION DUAL FSB * 00397000
*DCL ZCRNOSCH BIT (8) CONSTANT('20'X); /* REQUEST COMPLETION, EXIT WITH 00398000
*                                         SCHED NONE                 */ 00399000
*DCL ZCRNRSCH BIT (8) CONSTANT('24'X); /* REQUEST COMPLETION, EXIT WITH 00400000
*                                         SCHED NORM                 */ 00401000
*DCL ZCRLGERR FIXED(8) CONSTANT(8);    /* LOGICAL ERROR              */ 00402000
*DCL ZCPLSCB BIT(8) CONSTANT('08'X);   /* GET A RELEASE LSCB         */ 00403000
*DCL ZCPBUF  BIT(8) CONSTANT('04'X);   /* GET A RELEASE BUFFER       */ 00404000
*DCL ZCRTAC0A FIXED(8) CONSTANT(01);   /* LOCAL DEVICE SCHEDULER(OUT)*/ 00405000
*DCL ZCRTAC0B FIXED(8) CONSTANT(02);   /* REMOTE DEVICE SCHEDLER(OUT)*/ 00406000
*DCL ZCRTCC1A FIXED(8) CONSTANT(03);   /* LOCAL DIALOG SCHEDLER(IN)  */ 00407000
*DCL ZCRTCC1B FIXED(8) CONSTANT(04);   /* REMOTE DIALOG SCHEDLER(IN) */ 00408000
*DCL ZCRTDCE0 FIXED(8) CONSTANT(05);   /* NCP SLOWDOWN RECOVERY      */ 00409000
*DCL ZCRTDCKA FIXED(8) CONSTANT(06);   /* LOCAL GENERAL FUNCTIONS    */ 00410000
*DCL ZCRTDCKB FIXED(8) CONSTANT(07);   /* REMOTE GENERAL FUNCTIONS   */ 00411000
*DCL ZCRTFCEB FIXED(8) CONSTANT(08);   /* REMOTE READ BUFFER ALLOC.  */ 00412000
*DCL ZCRTGCLA FIXED(8) CONSTANT(09);   /* LCAL CTL & TEST FEEDBACK(IN)* 00413000
*DCL ZCRTGC0A FIXED(8) CONSTANT(10);   /* LOCAL REQ. COMPLETION(IN)  */ 00414000
*DCL ZCRTGC0B FIXED(8) CONSTANT(11);   /* REMOTE REQ. COMPLETION(IN) */ 00415000
*DCL ZCRTICWB FIXED(8) CONSTANT(12);   /* RESET CLEANUP (PHASE 5)    */ 00416000
*DCL ZCRTIC0B FIXED(8) CONSTANT(13);   /* REMOTE REQ COMPLTION CTL(IN)* 00417000
*DCL ZCRTAC1B FIXED(8) CONSTANT(14);   /* ISTZAC1B THREAD ID         */ 00418000
*DCL ZCRTIC1B FIXED(8) CONSTANT(15);   /* ISTZIC1B THREAD ID         */ 00419000
*DCL ZCRTCCBI FIXED(8) CONSTANT(16);   /* ISTZCCBI THREAD ID         */ 00420000
*DCL ZCRTAC1R FIXED(8) CONSTANT(17);   /* ISTZAC1R THREAD ID         */ 00421000
*DCL ZCRTAC1A FIXED(8) CONSTANT(18);   /* ISTZAC1A THREAD ID         */ 00422000
*DCL ZCRTLCAB FIXED(8) CONSTANT(19);   /* ISTZLCAB THREAD ID         */ 00423000
*/* PREFIX FOR CRR                                                   */ 00424000
*/*                                                                  */ 00425000
*/* RELEASE 1 - JUNE 28, 1973                                        */ 00426000
*/*                                                                  */ 00427000
*DCL 1 ISTPFCRR BASED BDY(WORD),        /* PREFIX FOR CRR            */ 00428000
*     2  PFCCRR   CHAR(4),              /* CRR HEADER                */ 00429000
*        3  PFCCRRID CHAR(1),           /* CRR ID FIELD              */ 00430000
*           4  CRRID CHAR(1),           /* BASIC CTL LAYER DEFINITION*/ 00431000
*        3  PFCRSV10 CHAR(1),           /* RESERVED FOR ALIGNMENT    */ 00432000
*        3  PFCCRRLN CHAR(2),           /* CRR LENGTH                */ 00433000
*           4  CRRLEN CHAR(2),          /* BASIC CTL LAYER DEF       */ 00434000
*     2  PFCHDR CHAR(8) BDY(WORD),      /* SAVE AREA FOR OLD CRR FRR */ 00435000
*        3  PFCCRRO  PTR(31),           /* PTR TO OLD CRR            */ 00436000
*           4  CRRCHAIN PTR(31),        /* BASIC CTL LAYER DEFINITION   00437000
*                                          FOR OLD CRR PTR           */ 00438000
*        3  PFCFRRO  PTR(31),           /* PTR TO OLD FRR            */ 00439000
*           4  CRRFRR   PTR(31),        /* BASIC CTL LAYER         0292 00440000
*                                          DEFINITION OF OLD FRR PTR */ 00441000
*     2  PFCFTA BIT(8),                 /* ID OF LAST FUNCTION TRACED*/ 00442000
*     2  PFCRSV01 CHAR(3);              /* ALIGNMENT                 */ 00443000
*DCL PFIDPIE BIT(8) CONSTANT('80'X);    /* DOS/VS TPIOS              */ 00444000
*DCL PFIDORE BIT(8) CONSTANT('81'X);    /* DOS/VS BMS                */ 00445000
*DCL PFIDAPE BIT(8) CONSTANT('82'X);    /* DOS/VS PSS                */ 00446000
*DCL PFCIDPSV BIT(8) CONSTANT('38'X); /* COMPONENT ID              0296 00447000
*                                          PSS - VS1 AND 2           */ 00448000
*DCL PFCIDTPV BIT(8) CONSTANT('3C'X); /* COMPONENT ID              0297 00449000
*                                          TPIOS VS1 AND 2           */ 00450000
*DCL PFCIDSME BIT(8) CONSTANT('3D'X); /* COMPONENT ID              0298 00451000
*                                          STORAGE MANAGEMENT DOS    */ 00452000
*DCL PFCIDOC BIT(8) CONSTANT('31'X);    /* COMPONENT ID OPEN/CLOSE   */ 00453000
*DCL PFCIDPS BIT(8) CONSTANT('32'X);    /* PORT SOLICITOR            */ 00454000
*DCL PFCIDCS BIT(8) CONSTANT('34'X);    /* CLUSTER SOLICITOR         */ 00455000
*DCL PFCIDIT BIT(8) CONSTANT('35'X);    /* INIT/TERM                 */ 00456000
*DCL PFCIDVY BIT(8) CONSTANT('36'X);    /* VARY                      */ 00457000
*DCL PFCIDNS  BIT(8) CONSTANT('37'X);   /* NET. STAT.SRV.            */ 00458000
*DCL PFCIDTPE BIT(8) CONSTANT('38'X);   /* COMPONENT ID            0305 00459000
*                                          TPIOS - DOS               */ 00460000
*DCL PFCIDCL BIT(8) CONSTANT('39'X);    /* COMPONENT ID            0306 00461000
*                                          CONTROL LAYER             */ 00462000
*DCL PFCIDPSE BIT(8) CONSTANT('3A'X);   /* COMPONENT ID            0307 00463000
*                                          PSS - DOS                 */ 00464000
*DCL PFCIDSMV BIT(8) CONSTANT('3F'X);   /* COMPONENT ID            0308 00465000
*                                          STORAGE MANAGEMENT        */ 00466000
*DCL PFCIDTIO BIT(8) CONSTANT('40'X);   /* COMPONENT ID TIIO       0309 00467000
*                                          PROCESSING (VS2)          */ 00468000
*DCL PFCIDRS  BIT(8) CONSTANT('41'X);   /* ID FOR REMOTE SOLICITOR   */ 00469000
*/* CRR FOR COMMAND FACILITIES                                      */  00470000
*DCL  1  ISTCFCRR BDY(WORD) BASED, /* CRR FOR COMMAND FACILITIES    */  00471000
*        2 CFCAUDIT,               /* AUDIT TRAIL FOR CMD FACILITIES*/  00472000
*          3 CFCNTRD  CHAR(1),     /* LIST OF MODULES IN COMMAND    */  00473000
*                                  /* FACILITIES ENTERED            */  00474000
*            4 NCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 ENTERED   */  00475000
*            4 NCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 ENTERED   */  00476000
*            4 NCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 ENTERED   */  00477000
*            4 NCFCRP   BIT(1),    /* IND MODULE ISTCFCRP ENTERED   */  00478000
*            4 NCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 ENTERED   */  00479000
*            4 NCFRSVD  BIT(3),    /* RESERVED                      */  00480000
*          3 CFCCRT   CHAR(1),     /* LIST OF MODULES IN COMMAND    */  00481000
*                                  /* FACILITIES RUNNING            */  00482000
*            4 CCFCS1   BIT(1),    /* IND MODULE ISTCFCS1 RUNNING   */  00483000
*            4 CCFCS2   BIT(1),    /* IND MODULE ISTCFCS2 RUNNING   */  00484000
*            4 CCFCR1   BIT(1),    /* IND MODULE ISTCFCR1 RUNNING   */  00485000
*            4 CCFCRP   BIT(1),    /* IND MODULE ISTCFCRP RUNNING   */  00486000
*            4 CCFCR2   BIT(1),    /* IND MODULE ISTCFCR2 RUNNING   */  00487000
*            4 CCFRSVD1 BIT(3);    /* RESERVED                      */  00488000
*/* COMPONENT RECOVERY                                               */ 00489000
*/*                                                                  */ 00490000
*DCL 1 ISTASCRR BDY(WORD) BASED,        /* CRR FOR SMS               */ 00491000
*     2  ASCPFCRR CHAR(LENGTH(ISTPFCRR)),                          0312 00492000
*     2  ASCFLAGS CHAR(7),              /* FLAGS                     */ 00493000
*        3  ASCFLG1 CHAR(2),            /* MODULE TRACE FLAGS        */ 00494000
*           4  ASCFBA BIT(1),           /* ALLOCATION IN PATH        */ 00495000
*           4  ASCFBD BIT(1),           /* DE-ALLOCATION IN PATH     */ 00496000
*           4  ASCFSR BIT(1),           /* FSR IN PATH               */ 00497000
*           4  ASCPASTR BIT(13),        /* RESERVED PATH FLAGS       */ 00498000
*        3  ASCFLG2 CHAR(2),            /* MODULE IN CONTROL FLAGS   */ 00499000
*           4  ASCFBAIC BIT(1),         /* ALLOCATION IN CONTROL     */ 00500000
*           4  ASCFBDIC BIT(1),         /* DE-ALLOCATION IN CONTROL  */ 00501000
*           4  ASCFSRIC BIT(1),         /* FSR IN CONTROL            */ 00502000
*           4  ASCICR BIT(13),          /* RESERVED IN CONTROL FLAGS */ 00503000
*        3  ASCFLG3 CHAR(3),            /* AUDIT FLAGS               */ 00504000
*           4  ASCFSRGT BIT(1),         /* FSR DOING GET PROCESSING  */ 00505000
*           4  ASCFBDAL BIT(1),         /* FBD DOING ALLOCATION      */ 00506000
*           4  ASCKEYF BIT(1),          /* KEY HAS BEEN ALTERED      */ 00507000
*           4  ASCLLKF BIT(1),          /* LOCAL LOCK HELD           */ 00508000
*           4  ASCFBDUD BIT(1),         /* FBD USING USER DATA       */ 00509000
*           4  ASCAUDIT BIT(19),        /* RESERVED AUDIT BITS       */ 00510000
*     2  ASCKEY CHAR(1),                /* ORIGINAL KEY              */ 00511000
*     2  ASCETRYA PTR(31),              /* RETRY ADRS FOR CONTINUE 0312 00512000
*                                          OPTION                    */ 00513000
*     2  ASCUSRGS CHAR(16),             /* SAVE AREA FOR USER REGS 0312 00514000
*                                          14 - 1                    */ 00515000
*        3  ASCUSR14 CHAR(4),           /* REGISTER 14               */ 00516000
*        3  ASCUSR15 CHAR(4),           /* REGISTER 15               */ 00517000
*        3  ASCUSR00 CHAR(4),           /* REGISTER 0                */ 00518000
*        3  ASCUSR01 CHAR(4),           /* REGISTER 1                */ 00519000
*     2  ASCPSREG CHAR(16);             /* SAVE AREA FOR PSS       0312 00520000
*                                          REGS 1 - 4                */ 00521000
*/*  INITIAL LEVEL                                      001 04/09/75 */ 00522000
*DCL 1 ISTAPCRR BDY(WORD) BASED,                                   0313 00523000
*     2 APCHDRSV CHAR(LENGTH(ISTPFCRR)),  /* HEADER                  */ 00524000
*     2  APCATFLG CHAR(2),              /* AUDIT TRACE FLAGS         */ 00525000
*        3  APC51E BIT(1),              /* ISTAPC51 WAS ENTERED      */ 00526000
*        3  APC52E BIT(1),              /* ISTAPC52  '     '         */ 00527000
*        3  APC53E BIT(1),              /* ISTAPC53                  */ 00528000
*        3  APC54E BIT(1),                                         0313 00529000
*        3  APC56E BIT(1),                                         0313 00530000
*        3  APC57E BIT(1),                                         0313 00531000
*        3  APC58E BIT(1),                                         0313 00532000
*        3  APC31E BIT(1),                                         0313 00533000
*        3 * BIT(8),                    /* RESERVED                  */ 00534000
*     2  APCRFLG CHAR(2),               /* AUDIT TRACE FLAGS         */ 00535000
*        3  APC51R BIT(1),              /* ISTAPCR1 IS RUNNING       */ 00536000
*        3  APC52R BIT(1),              /* ISTAPC52 IS RUNNING       */ 00537000
*        3  APC53R BIT(1),                                         0313 00538000
*        3  APC54R BIT(1),                                         0313 00539000
*        3  APC56R BIT(1),                                         0313 00540000
*        3  APC57R BIT(1),                                         0313 00541000
*        3  APC58R BIT(1),                                         0313 00542000
*        3  APC31R BIT(1),                                         0313 00543000
*        3  *      BIT(8),              /* RESERVED                  */ 00544000
*     2  APCPSTA PTR(31),               /* PST@                      */ 00545000
*     2  APCTCBA PTR(31),               /* TCB@                      */ 00546000
*     2  APCRTRN PTR(31),               /*@ TO BR14 TO RTN TO SYSTEM */ 00547000
*     2  APCPABSV PTR(31),              /*SAVED PAB@ TO REDISPATCH   */ 00548000
*     2  APCQWFO PTR(31),               /* Q@ IN PST WORK AREA ON    */ 00549000
*     2  APCFRRPM PTR(31),              /* WORKAREA@ RTN'D FROM SETFR*/ 00550000
*     2  APCSAVE CHAR(72),                                         0313 00551000
*        3  APCESTAL CHAR(72),          /* ESTAE PARAMETER LIST AREA */ 00552000
*     2  APCCOMF CHAR(4) BDY(HWORD),    /* FLAGS USED BY ALL PSS RTN */ 00553000
*        3  APCCOMF1 CHAR(2),                                      0313 00554000
*           4  APCSSTSK BIT(1),         /* IRB TYPE WORK             */ 00555000
*           4  APCUETSK BIT(1),         /* USER EXIT RUNNING UNDER IRB* 00556000
*           4  APCSMCR BIT(1),          /* SMA CRA BEING USED        */ 00557000
*           4  APCIRB1 BIT(1),          /* IRB1 BEING USED           */ 00558000
*           4  APCIRB2 BIT(1),          /* IRB2 BEING USED           */ 00559000
*           4  APCRELR BIT(1),          /*CALL ISTAPC58 TO RLEASE CRA*/ 00560000
*           4  APCEXIT BIT(1),          /* TELLS ISTAPC58 TO EXIT SYS*/ 00561000
*           4  APCZLBER BIT(1),         /* ERR WHILE RUNNING ZLFAB PAB* 00562000
*           4  * BIT(8),                /* RESERVED                  */ 00563000
*        3  APCRETCD FIXED(15),         /* RTN CODE FOR R15 FOR SYS  */ 00564000
*     2  APCSAV1 PTR(31),               /* 1ST SAVE WORD             */ 00565000
*     2  APCSAV2 PTR(31),               /* 2ND SAVE WORD             */ 00566000
*     2  APCSWTWD CHAR(4),              /* SWITCH AREA FOR PSS RTN   */ 00567000
*     2  APC31FLG CHAR(1),              /* ISTAPC31 FLAGS            */ 00568000
*        3  APCTPXIT BIT(1),            /* TPEXIT IN PROGRESS        */ 00569000
*        3  APCRESCH BIT(1),            /*PAB TPEXIT OCCURED  RESCHED*/ 00570000
*        3  APCSORT BIT(1),       /* PAB SORTED TO PROPER PST/MPST   */ 00571000
*        3  *       BIT(5),       /* RESERVED                        */ 00572000
*     2  APC52FLG CHAR(1),        /* ISTAPC52 FLAGS                  */ 00573000
*        3  APCCKRQ BIT(1),       /* CHECK RDY Q FOR WORK            */ 00574000
*        3  APCSMSR BIT(1),       /* RETURNING SMS RPH               */ 00575000
*        3  APCQENQ BIT(1),       /* ENQUEUEING PAB'S ON PST Q'S     */ 00576000
*        3  APCRDQ BIT(1),        /* DEQUEING PAB'S FROM PST RDY Q   */ 00577000
*        3  APCNWF BIT(1),        /* NO WORK FOUND                   */ 00578000
*        3  APCWKF   BIT(1),      /* WORK FOUND                      */ 00579000
*        3    *      BIT(2),      /* RESERVED                        */ 00580000
*     2  APC53FLG CHAR(1),        /* ISTAPC53 FLAGS                  */ 00581000
*        3  APCPR153 BIT(1),      /* USED PREALLOCATED CRA           */ 00582000
*     2  APC54FLG CHAR(1),        /* ISTAPC54 FLAGS                  */ 00583000
*        3  APCRLST BIT(1),       /* SMS BEING CALLED TO RELEASE UECB*/ 00584000
*        3  * BIT(7),             /* RESERVED                        */ 00585000
*     2  APC57FLG CHAR(1),        /* ISTAPC57 FLAGS                  */ 00586000
*        3  APCRECRA BIT(1),      /* RELEASE CRA BEING DONE          */ 00587000
*        3  APCNREL BIT(1),       /* DID NOT RELEASE CRA             */ 00588000
*        3  *   BIT(6),           /* RESERVED                        */ 00589000
*     2  * CHAR(15);              /* RESERVED                        */ 00590000
*/*               COMPONENT RECOVERY AREA                            */ 00591000
*/*  REVISIONS                                         005 04/09/75  */ 00592000
*DCL 1  ISTCRA BASED BDY(DWORD),        /* COMPONENT RECOVERY AREA   */ 00593000
*     2  CRABASIC BDY(WORD),            /* CRA WITHOUT PROCESS CRR   */ 00594000
*      3 CRAHDR CHAR(8) BDY(WORD),      /* CRA HEADER                */ 00595000
*        4  CRACRR PTR(31),             /* PTR TO ACTIVE CRR         */ 00596000
*        4  CRAFRR PTR(31),             /* PTR TO ACTIVE FRR         */ 00597000
*      3 CRALKACT BIT(32),              /* LOCK LEVEL AND          0314 00598000
*                                          OWNERSHIP FLAGS           */ 00599000
*        4  CRALEV32 BIT(1),            /* 1 = LEVEL 32 LOCK HELD    */ 00600000
*        4  CRALEV31 BIT(1),            /* 1 = LEVEL 31 LOCK HELD    */ 00601000
*        4  CRALEV30 BIT(1),            /* 1 = LEVEL 30 LOCK HELD    */ 00602000
*        4  CRALEV29 BIT(1),            /* 1 = LEVEL 29 LOCK HELD    */ 00603000
*        4  CRALEV28 BIT(1),            /* 1 = LEVEL 28 LOCK HELD    */ 00604000
*        4  CRALEV27 BIT(1),            /* 1 = LEVEL 27 LOCK HELD    */ 00605000
*        4  CRALEV26 BIT(1),            /* 1 = LEVEL 26 LOCK HELD    */ 00606000
*        4  CRALEV25 BIT(1),            /* 1 = LEVEL 25 LOCK HELD    */ 00607000
*        4  CRALEV24 BIT(1),            /* 1 = LEVEL 24 LOCK HELD    */ 00608000
*        4  CRALEV23 BIT(1),            /* 1 = LEVEL 23 LOCK HELD    */ 00609000
*        4  CRALEV22 BIT(1),            /* 1 = LEVEL 22 LOCK HELD    */ 00610000
*        4  CRALEV21 BIT(1),            /* 1 = LEVEL 21 LOCK HELD    */ 00611000
*        4  CRALEV20 BIT(1),            /* 1 = LEVEL 20 LOCK HELD    */ 00612000
*        4  CRALEV19 BIT(1),            /* 1 = LEVEL 19 LOCK HELD    */ 00613000
*        4  CRALEV18 BIT(1),            /* 1 = LEVEL 18 LOCK HELD    */ 00614000
*        4  CRALEV17 BIT(1),            /* 1 = LEVEL 17 LOCK HELD    */ 00615000
*        4  CRALEV16 BIT(1),            /* 1 = LEVEL 16 LOCK HELD    */ 00616000
*        4  CRALEV15 BIT(1),            /* 1 = LEVEL 15 LOCK HELD    */ 00617000
*        4  CRALEV14 BIT(1),            /* 1 = LEVEL 14 LOCK HELD    */ 00618000
*        4  CRALEV13 BIT(1),            /* 1 = LEVEL 13 LOCK HELD    */ 00619000
*        4  CRALEV12 BIT(1),            /* 1 = LEVEL 12 LOCK HELD    */ 00620000
*        4  CRALEV11 BIT(1),            /* 1 = LEVEL 11 LOCK HELD    */ 00621000
*        4  CRALEV10 BIT(1),            /* 1 = LEVEL 10 LOCK HELD    */ 00622000
*        4  CRALEV09 BIT(1),            /* 1 = LEVEL 9 LOCK HELD     */ 00623000
*        4  CRALEV08 BIT(1),            /* 1 = LEVEL 8 LOCK HELD     */ 00624000
*        4  CRALEV07 BIT(1),            /* 1 = LEVEL 7 LOCK HELD     */ 00625000
*        4  CRALEV06 BIT(1),            /* 1 = LEVEL 6 LOCK HELD     */ 00626000
*        4  CRALEV05 BIT(1),            /* 1 = LEVEL 5 LOCK HELD     */ 00627000
*        4  CRALEV04 BIT(1),            /* 1 = LEVEL 4 LOCK HELD     */ 00628000
*        4  CRALEV03 BIT(1),            /* 1 = LEVEL 3 LOCK HELD     */ 00629000
*        4  CRALEV02 BIT(1),            /* 1 = LEVEL 2 LOCK HELD     */ 00630000
*        4  CRALEV01 BIT(1),            /* 1 = LEVEL 1 LOCK HELD     */ 00631000
*      3 CRAL1PTR PTR(31),              /* PTR TO LEVEL 1 LOCK       */ 00632000
*      3 CRAL2PTR PTR(31),              /* PTR TO LEVEL 2 LOCK       */ 00633000
*      3 CRAL3PTR PTR(31),              /* PTR TO LEVEL 3 LOCK       */ 00634000
*      3 CRAL4PTR PTR(31),              /* PTR TO LEVEL 4 LOCK       */ 00635000
*      3 CRAL5PTR PTR(31),              /* PTR TO LEVEL 5 LOCK       */ 00636000
*      3 CRAL6PTR PTR(31),              /* PTR TO LEVEL 6 LOCK       */ 00637000
*      3 CRAL7PTR PTR(31),              /* PTR TO LEVEL 7 LOCK       */ 00638000
*      3 CRAL8PTR PTR(31),              /* PTR TO LEVEL 8 LOCK       */ 00639000
*      3 CRAL9PTR PTR(31),              /* PTR TO LEVEL 9 LOCK       */ 00640000
*      3 CRALAPTR PTR(31),              /* RESERVED                  */ 00641000
*/*                                                                  */ 00642000
*/*   VS1/VS2 EXTENSION                                              */ 00643000
*/*                                                                  */ 00644000
*     2  CRARPH CHAR(LENGTH(ISTRPH)),   /* RPH ASSOCIATED WITH     0314 00645000
*                                          THIS CRH                  */ 00646000
*     2  CRAPSS CHAR(LENGTH(ISTAPCRR)), /* PSS CRR                   */ 00647000
*     2  CRAPROCR CHAR(LENGTH(ISTZCRR)) BDY(DWORD), /* PROCESS CRR   */ 00648000
*     2  CRASVC CHAR(72) BDY(WORD),     /* SERVICE RTN CRA           */ 00649000
*        3  CRAASCRR CHAR(LENGTH(ISTASCRR)), /* CRR FOR SMS          */ 00650000
*        3  CRAHSIZ  PTR(31),           /* HEADER SIZE QUED SMS REQ  */ 00651000
*        3  CRAMASK  PTR(31),           /* PREFIX MASK QUED SMS REQ  */ 00652000
*        3  CRABUFA  FIXED(31),         /* BUFF QUE FOR FBQ ALLOCATION* 00653000
*           4 CRABFTBA BIT(1),          /* NO BUFFERS ALLOCATED YET   * 00654000
*     2  CRARSV01 PTR(31),              /* RESERVED                  */ 00655000
*     2  CRARSV02 PTR(31),              /* RESERVED                  */ 00656000
*     2  CRACHAIN PTR(31);              /* CHAIN FIELD USED TO QUEUE    00657000
*                                          CRA TO PREALLOCATE QUEUE     00658000
*                                          WHEN NOT IN USE           */ 00659000
*DCL CRALMS32 BIT(32) CONSTANT('80000000'X); /* 32ND LEVEL LOCK MASK */ 00660000
*DCL CRALMS31 BIT(32) CONSTANT('40000000'X); /* 31ST LEVEL LOCK MASK */ 00661000
*DCL CRALMS30 BIT(32) CONSTANT('20000000'X); /* 30TH LEVEL LOCK MASK */ 00662000
*DCL CRALMS29 BIT(32) CONSTANT('10000000'X); /* 29TH LEVEL LOCK MASK */ 00663000
*DCL CRALMS28 BIT(32) CONSTANT('08000000'X); /* 28TH LEVEL LOCK MASK */ 00664000
*DCL CRALMS27 BIT(32) CONSTANT('04000000'X); /* 27TH LEVEL LOCK MASK */ 00665000
*DCL CRALMS26 BIT(32) CONSTANT('02000000'X); /* 26TH LEVEL LOCK MASK */ 00666000
*DCL CRALMS25 BIT(32) CONSTANT('01000000'X); /* 25TH LEVEL LOCK MASK */ 00667000
*DCL CRALMS24 BIT(32) CONSTANT('00800000'X); /* 24TH LEVEL LOCK MASK */ 00668000
*DCL CRALMS23 BIT(32) CONSTANT('00400000'X); /* 23RD LEVEL LOCK MASK */ 00669000
*DCL CRALMS22 BIT(32) CONSTANT('00200000'X); /* 22ND LEVEL LOCK MASK */ 00670000
*DCL CRALMS21 BIT(32) CONSTANT('00100000'X); /* 21ST LEVEL LOCK MASK */ 00671000
*DCL CRALMS20 BIT(32) CONSTANT('00080000'X); /* 20TH LEVEL LOCK MASK */ 00672000
*DCL CRALMS19 BIT(32) CONSTANT('00040000'X); /* 19TH LEVEL LOCK MASK */ 00673000
*DCL CRALMS18 BIT(32) CONSTANT('00020000'X); /* 18TH LEVEL LOCK MASK */ 00674000
*DCL CRALMS17 BIT(32) CONSTANT('00010000'X); /* 17TH LEVEL LOCK MASK */ 00675000
*DCL CRALMS16 BIT(32) CONSTANT('00008000'X); /* 16TH LEVEL LOCK MASK */ 00676000
*DCL CRALMS15 BIT(32) CONSTANT('00004000'X); /* 15TH LEVEL LOCK MASK */ 00677000
*DCL CRALMS14 BIT(32) CONSTANT('00002000'X); /* 14TH LEVEL LOCK MASK */ 00678000
*DCL CRALMS13 BIT(32) CONSTANT('00001000'X); /* 13TH LEVEL LOCK MASK */ 00679000
*DCL CRALMS12 BIT(32) CONSTANT('00000800'X); /* 12TH LEVEL LOCK MASK */ 00680000
*DCL CRALMS11 BIT(32) CONSTANT('00000400'X); /* 11TH LEVEL LOCK MASK */ 00681000
*DCL CRALMS10 BIT(32) CONSTANT('00000200'X); /* 10TH LEVEL LOCK MASK */ 00682000
*DCL CRALMS09 BIT(32) CONSTANT('00000100'X); /* 9TH LEVEL LOCK MASK  */ 00683000
*DCL CRALMS08 BIT(32) CONSTANT('00000080'X); /* 8TH LEVEL LOCK MASK  */ 00684000
*DCL CRALMS07 BIT(32) CONSTANT('00000040'X); /* 7TH LEVEL LOCK MASK  */ 00685000
*DCL CRALMS06 BIT(32) CONSTANT('00000020'X); /* 6TH LEVEL LOCK MASK  */ 00686000
*DCL CRALMS05 BIT(32) CONSTANT('00000010'X); /* 5TH LEVEL LOCK MASK  */ 00687000
*DCL CRALMS04 BIT(32) CONSTANT('00000008'X); /* 4TH LEVEL LOCK MASK  */ 00688000
*DCL CRALMS03 BIT(32) CONSTANT('00000004'X); /* 3RD LEVEL LOCK MASK  */ 00689000
*DCL CRALMS02 BIT(32) CONSTANT('00000002'X); /* 2ND LEVEL LOCK MASK  */ 00690000
*DCL CRALMS01 BIT(32) CONSTANT('00000001'X); /* 1ST LEVEL LOCK MASK  */ 00691000
*DCL CRACRA   CHAR(4) CONSTANT('CRA ');      /* CHARACTER C.B. ID    */ 00692000
*                                                                  0348 00693000
*/* END OF ATBUILD                                                   */ 00694000
*                                                                  0348 00695000
*     GEN(PRINT ON);                                               0348 00696000
         PRINT ON                                                       00697000
*     GPR01P->RPHCRR->CRACRR->ZCREJCCB='1'B;                       0349 00698000
         L     @09,RPHCRR(,GPR01P)                                 0349 00699000
         L     @09,CRACRR(,@09)                                    0349 00700000
         OI    ZCREJCCB(@09),B'00000010'                           0349 00701000
*     ZSAZACTV='1'B;                                               0350 00702000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0350 00703000
*     ZSAZTRAC='JCCB';                                             0351 00704000
         MVC   ZSAZTRAC(4,GPR13P),@CC03395                         0351 00705000
*     ZSAZSVRR=GPR14P;                                             0352 00706000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0352 00707000
*     GPR13P=ZSAZSVFC;                                             0353 00708000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0353 00709000
*     RFY                                                          0354 00710000
*      (GPR01P) UNRSTD;                                            0354 00711000
*     RFY                                                          0355 00712000
*      (GPR14P) UNRSTD;                                            0355 00713000
*   END;                                                           0356 00714000
*                                                                  0356 00715000
*/* END TPZSAVE                                                      */ 00716000
*                                                                  0357 00717000
*   PTRFSB=ADDR(ZIBFSB);            /* ADDRESS FSB WITHIN ZIBUF      */ 00718000
         LA    PTRFSB,ZIBFSB(,PTRZIB)                              0357 00719000
*   RFY                                                            0358 00720000
*     ISTFSB BASED(PTRFSB);         /* TELL COMPILER                 */ 00721000
*   IF(FMCLCPBQ&GATEMASK)=PTRLCP THEN/* ONLY 1 WAITQ ELEMENT?        */ 00722000
         L     @09,FMCLCPBQ(,PTRFMC)                               0359 00723000
         N     @09,@CF00048                                        0359 00724000
         CR    @09,PTRLCP                                          0359 00725000
         BNE   @RF00359                                            0359 00726000
*     FMCZH001=FMCZHF31;            /* IF SO, SET LINE STATE=NULL    */ 00727000
         SLR   @09,@09                                             0360 00728000
         STH   @09,FMCZH001(,PTRFMC)                               0360 00729000
*   ELSE                            /* IF NOT...                     */ 00730000
*     IF FSBMJRCD=FRNORM THEN       /* IF INVITE COMPLETED OK...     */ 00731000
         B     @RC00359                                            0361 00732000
@RF00359 CLI   FSBMJRCD(PTRFSB),X'00'                              0361 00733000
         BNE   @RF00361                                            0361 00734000
*       FMCZH001=FMCZHF41;          /* SET LINE STATE = RESCHEDULE 0362 00735000
*                                      STATE                         */ 00736000
         MVC   FMCZH001(2,PTRFMC),@CH02487                         0362 00737000
*     ELSE                                                         0363 00738000
*       FMCZH001=FMCZHF51;          /* OTHERWISE, LINE STATE =     0363 00739000
*                                      RESCHEDULE ERROR              */ 00740000
         B     @RC00361                                            0363 00741000
@RF00361 MVC   FMCZH001(2,PTRFMC),@CH02489                         0363 00742000
*   LCPZRT03=OFF;                   /* ZERO LCP ANALYSIS FLAG        */ 00743000
@RC00361 DS    0H                                                  0364 00744000
@RC00359 NI    LCPZRT03(PTRLCP),B'11101111'                        0364 00745000
*   RTNCODE=MOREWORK;               /* INDICATE MORE WORK TO BE DONE */ 00746000
         LA    RTNCODE,12                                          0365 00747000
*/* TPZRETN                                                          */ 00748000
*                                                                  0366 00749000
*   DO;                                                            0366 00750000
*     DCL                                                          0367 00751000
*       GPR07F FIXED(31) REG(07);                                  0367 00752000
*     DCL                                                          0368 00753000
*       GPR07P PTR(31) REG(07);                                    0368 00754000
*     DCL                                                          0369 00755000
*       GPR15F FIXED(31) REG(15);                                  0369 00756000
*     DCL                                                          0370 00757000
*       GPR15P PTR(31) REG(15);                                    0370 00758000
*     RFY                                                          0371 00759000
*      (GPR07P,                                                    0371 00760000
*       GPR14P,                                                    0371 00761000
*       GPR15P) RSTD;                                              0371 00762000
*     GPR13P=ZSAZSVBC;                                             0372 00763000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0372 00764000
*     IF GPR13P=0 THEN                                             0373 00765000
         LTR   GPR13P,GPR13P                                       0373 00766000
         BZ    @RT00373                                            0373 00767000
*       ;                           /* TPDVTS ISTZFARR               */ 00768000
*     ELSE                                                         0375 00769000
*       GPR14P=ZSAZSVRR;                                           0375 00770000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0375 00771000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0376 00772000
@RT00373 DS    0H                                                  0376 00773000
         LM    7,12,ZSAZSVVR+0(13)                                      00774000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0377 00775000
         BR    GPR14P                                                   00776000
*     RFY                                                          0378 00777000
*      (GPR07P,                                                    0378 00778000
*       GPR14P,                                                    0378 00779000
*       GPR15P) UNRSTD;                                            0378 00780000
*   END;                                                           0379 00781000
*                                                                  0379 00782000
*/* END TPZRETN                                                      */ 00783000
*/* TPEPILOG                                                         */ 00784000
*                                                                  0380 00785000
*   GEN(PRINT OFF);                                                0380 00786000
         PRINT OFF                                                      00787000
*   GEN(PRINT ON);                                                 0381 00788000
*                                                                  0381 00789000
         PRINT ON                                                       00790000
*/* END OF TPEPILOG                                                  */ 00791000
*                                                                  0382 00792000
*   END ISTZJFCB                                                   0382 00793000
*                                                                  0382 00794000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00795000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00796000
*                                                                  0382 00797000
*       ;                                                          0382 00798000
@EL00001 DS    0H                                                  0382 00799000
@EF00001 DS    0H                                                  0382 00800000
@ER00001 BR    @14                                                 0382 00801000
@DATA    DS    0H                                                       00802000
@CH02487 DC    XL2'0007'                                                00803000
@CH02489 DC    XL2'B007'                                                00804000
@DATD    DSECT                                                          00805000
         DS    0F                                                       00806000
ISTZJFCB CSECT                                                          00807000
         DS    0F                                                       00808000
@CF00048 DC    XL4'00FFFFFF'                                            00809000
@DATD    DSECT                                                          00810000
         DS    0D                                                       00811000
CVTPTR   DS    A                                                        00812000
FSBPTR   DS    A                                                        00813000
BDUPTR   DS    A                                                        00814000
BTUPTR   DS    A                                                        00815000
FMCBPTR  DS    A                                                        00816000
LCPBPTR  DS    A                                                        00817000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00818000
@ENDDATD EQU   *                                                        00819000
ISTZJFCB CSECT                                                          00820000
         DS    0F                                                       00821000
@SIZDATD DC    AL1(0)                                                   00822000
         DC    AL3(@ENDDATD-@DATD)                                      00823000
         DS    0D                                                       00824000
@CC03395 DC    C'JCCB'                                                  00825000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00826000
@01      EQU   01                                                       00827000
@02      EQU   02                                                       00828000
@03      EQU   03                                                       00829000
@04      EQU   04                                                       00830000
@05      EQU   05                                                       00831000
@06      EQU   06                                                       00832000
@07      EQU   07                                                       00833000
@08      EQU   08                                                       00834000
@09      EQU   09                                                       00835000
@10      EQU   10                                                       00836000
@11      EQU   11                                                       00837000
@12      EQU   12                                                       00838000
@13      EQU   13                                                       00839000
@14      EQU   14                                                       00840000
@15      EQU   15                                                       00841000
PTRATC   EQU   @02                                                      00842000
PTRFMC   EQU   @05                                                      00843000
PTRZIB   EQU   @06                                                      00844000
PTRLCP   EQU   @07                                                      00845000
PTRFSB   EQU   @08                                                      00846000
BASER    EQU   @12                                                      00847000
PTRSAVE  EQU   @13                                                      00848000
RTNREG   EQU   @14                                                      00849000
RTNCODE  EQU   @15                                                      00850000
R01      EQU   @01                                                      00851000
R02      EQU   @02                                                      00852000
R03      EQU   @03                                                      00853000
R04      EQU   @04                                                      00854000
R05      EQU   @05                                                      00855000
R06      EQU   @06                                                      00856000
RPHPTR   EQU   @01                                                      00857000
GPR01P   EQU   @01                                                      00858000
GPR12P   EQU   @12                                                      00859000
GPR13P   EQU   @13                                                      00860000
GPR14P   EQU   @14                                                      00861000
GPR07P   EQU   @07                                                      00862000
GPR15P   EQU   @15                                                      00863000
GPR01F   EQU   @01                                                      00864000
GPR07F   EQU   @07                                                      00865000
GPR12F   EQU   @12                                                      00866000
GPR13F   EQU   @13                                                      00867000
GPR14F   EQU   @14                                                      00868000
GPR15F   EQU   @15                                                      00869000
ATCLCPTR EQU   1032                                                     00870000
CVTMAP   EQU   0                                                        00871000
CVTDAR   EQU   CVTMAP+72                                                00872000
CVTFLGS1 EQU   CVTDAR                                                   00873000
CVTDCB   EQU   CVTMAP+116                                               00874000
CVTIERLC EQU   CVTMAP+144                                               00875000
CVTOPTA  EQU   CVTMAP+182                                               00876000
CVTOPTB  EQU   CVTMAP+183                                               00877000
CVTGTF   EQU   CVTMAP+236                                               00878000
CVTGTFST EQU   CVTGTF                                                   00879000
CVTGTFS  EQU   CVTGTFST                                                 00880000
CVTSTATE EQU   CVTGTFST                                                 00881000
CVTTMODE EQU   CVTGTFST                                                 00882000
CVTFORM  EQU   CVTGTFST                                                 00883000
CVTAQAVT EQU   CVTMAP+240                                               00884000
CVTTCMFG EQU   CVTAQAVT                                                 00885000
CVTVOLM2 EQU   CVTMAP+244                                               00886000
CVTTATA  EQU   CVTVOLM2                                                 00887000
CVTTSKS  EQU   CVTTATA                                                  00888000
CVTVOLF2 EQU   CVTTSKS                                                  00889000
CVTTAT   EQU   CVTTATA+1                                                00890000
CVTATER  EQU   CVTMAP+248                                               00891000
CVTEXT1  EQU   CVTMAP+252                                               00892000
CVTPURG  EQU   CVTMAP+260                                               00893000
CVTQMSG  EQU   CVTMAP+268                                               00894000
CVTDMSR  EQU   CVTMAP+272                                               00895000
CVTERPV  EQU   CVTMAP+316                                               00896000
CVTINTLA EQU   CVTMAP+320                                               00897000
CVTAPF   EQU   CVTMAP+324                                               00898000
CVTEXT2  EQU   CVTMAP+328                                               00899000
CVTHJES  EQU   CVTMAP+332                                               00900000
CVTPGSIA EQU   CVTMAP+348                                               00901000
CVTA1F1  EQU   CVTMAP+356                                               00902000
CVTSYSK  EQU   CVTMAP+357                                               00903000
CVTVOLM1 EQU   CVTMAP+380                                               00904000
CVTVOLF1 EQU   CVTVOLM1                                                 00905000
CVTATMCT EQU   CVTMAP+388                                               00906000
CVTXTNT1 EQU   0                                                        00907000
CVTXTNT2 EQU   0                                                        00908000
CVTDSSV  EQU   CVTXTNT2                                                 00909000
CVTFLGBT EQU   CVTXTNT2+5                                               00910000
CVTQID   EQU   CVTXTNT2+24                                              00911000
CVTSHS   EQU   CVTXTNT2+40                                              00912000
CVTRV400 EQU   CVTXTNT2+52                                              00913000
CVTRV409 EQU   CVTXTNT2+53                                              00914000
CVTATCVT EQU   CVTXTNT2+64                                              00915000
CVTRV429 EQU   CVTXTNT2+84                                              00916000
CVTRV438 EQU   CVTXTNT2+85                                              00917000
CVTRV457 EQU   CVTXTNT2+112                                             00918000
CVTRV466 EQU   CVTXTNT2+113                                             00919000
CVTFIX   EQU   0                                                        00920000
CVTRELNO EQU   CVTFIX+252                                               00921000
ISTPAB   EQU   0                                                        00922000
PABWQCHN EQU   ISTPAB                                                   00923000
PABWEQA  EQU   PABWQCHN                                                 00924000
PABCHAIN EQU   PABWQCHN+4                                               00925000
PABRPHFG EQU   ISTPAB+12                                                00926000
PABFLAGS EQU   PABRPHFG                                                 00927000
PABERLCK EQU   PABFLAGS                                                 00928000
PABERRLK EQU   PABERLCK                                                 00929000
ISTDYPAB EQU   0                                                        00930000
ISTLOK   EQU   0                                                        00931000
LOKCHN   EQU   ISTLOK+1                                                 00932000
LOKCHNG  EQU   LOKCHN                                                   00933000
@NM00004 EQU   LOKCHNG+2                                                00934000
ISTRPH   EQU   0                                                        00935000
RPHFLAGS EQU   ISTRPH+2                                                 00936000
RPHAPTYP EQU   RPHFLAGS                                                 00937000
RPHFSTLC EQU   RPHFLAGS                                                 00938000
RPHFLGB  EQU   ISTRPH+3                                                 00939000
RPHRPHA  EQU   ISTRPH+4                                                 00940000
RPHTSKID EQU   ISTRPH+8                                                 00941000
RPHRESMA EQU   ISTRPH+16                                                00942000
RPHWPFLG EQU   RPHRESMA                                                 00943000
RPHWEA   EQU   ISTRPH+24                                                00944000
RPHCSPA  EQU   RPHWEA                                                   00945000
RPHSRPRM EQU   ISTRPH+28                                                00946000
RPHCRR   EQU   ISTRPH+32                                                00947000
RPHPABQA EQU   ISTRPH+36                                                00948000
RPHWORK  EQU   ISTRPH+40                                                00949000
RPHSAVE1 EQU   RPHWORK                                                  00950000
RPHSBITS EQU   RPHSAVE1+1                                               00951000
ISTATCVT EQU   0                                                        00952000
ATCCOM   EQU   ISTATCVT                                                 00953000
ATCSTAT  EQU   ATCCOM                                                   00954000
ATCSTAT1 EQU   ATCSTAT                                                  00955000
ATCSTFLG EQU   ATCSTAT+1                                                00956000
ATCPOFLG EQU   ATCSTAT+2                                                00957000
ATCSTAT4 EQU   ATCSTAT+3                                                00958000
ATCIOTRC EQU   ATCCOM+140                                               00959000
ATCTHTRC EQU   ATCIOTRC                                                 00960000
ATCCSMR  EQU   ISTATCVT+296                                             00961000
ATCSHRFG EQU   ISTATCVT+316                                             00962000
ATCHPGM  EQU   ISTATCVT+384                                             00963000
ATCVLCNT EQU   ISTATCVT+772                                             00964000
ATCSOPD  EQU   ISTATCVT+792                                             00965000
ATCSIPD  EQU   ISTATCVT+800                                             00966000
ATCSECST EQU   ISTATCVT+812                                             00967000
ATCAOSM  EQU   ISTATCVT+912                                             00968000
ATCGSRBQ EQU   ATCAOSM+4                                                00969000
ATCGSRBG EQU   ATCGSRBQ                                                 00970000
ATCICAPP EQU   ATCAOSM+100                                              00971000
ATCLDAPP EQU   ATCAOSM+120                                              00972000
ATCDAPVT EQU   ATCAOSM+140                                              00973000
ATCVTFLG EQU   ATCAOSM+392                                              00974000
ATCZFLAG EQU   ATCAOSM+588                                              00975000
ISTFDB   EQU   0                                                        00976000
ISTFSB   EQU   0                                                        00977000
FSBFSB   EQU   ISTFSB                                                   00978000
FSBMNRCD EQU   FSBFSB+2                                                 00979000
FSBSFLGS EQU   FSBFSB+3                                                 00980000
FSBFSBA  EQU   FSBFSB+4                                                 00981000
FSBBTH   EQU   FSBFSB+8                                                 00982000
FSBCID   EQU   FSBBTH                                                   00983000
FSBRQTAG EQU   FSBBTH+4                                                 00984000
FSBSEQID EQU   FSBRQTAG                                                 00985000
FSBFLAGS EQU   FSBSEQID                                                 00986000
FSBSEQ   EQU   FSBSEQID+1                                               00987000
FSBCSWST EQU   FSBBTH+6                                                 00988000
FSBTHFLD EQU   FSBCSWST                                                 00989000
FSBTH1   EQU   FSBTHFLD                                                 00990000
FSBSYSRS EQU   FSBTH1                                                   00991000
FSBTH2   EQU   FSBTHFLD+1                                               00992000
FSBEXTRS EQU   FSBTH2                                                   00993000
FSBXFSTS EQU   FSBEXTRS                                                 00994000
FSBXCODE EQU   FSBEXTRS                                                 00995000
FSBNETRS EQU   FSBFSB+16                                                00996000
FSBSRCAT EQU   FSBNETRS                                                 00997000
FSBMJRCD EQU   FSBSRCAT                                                 00998000
FSBERC   EQU   FSBNETRS+1                                               00999000
FSBFBMI  EQU   FSBERC                                                   01000000
FSBDMGRS EQU   FSBFSB+18                                                01001000
FSBSS1   EQU   FSBDMGRS                                                 01002000
FSBSS2   EQU   FSBDMGRS+1                                               01003000
FSBLCPB  EQU   FSBFSB+20                                                01004000
FSBMSGID EQU   FSBLCPB                                                  01005000
FSBLCCWA EQU   FSBFSB+24                                                01006000
FSBRLSTS EQU   FSBLCCWA                                                 01007000
ISTBDU   EQU   0                                                        01008000
BDUMODIF EQU   ISTBDU+1                                                 01009000
BDUMOD1  EQU   BDUMODIF                                                 01010000
BDUDAF   EQU   ISTBDU+2                                                 01011000
BDUFUNC  EQU   BDUDAF                                                   01012000
BDUCHECK EQU   BDUFUNC                                                  01013000
BDUFLAGS EQU   BDUDAF+1                                                 01014000
ISTBTU   EQU   0                                                        01015000
BTUBTH   EQU   ISTBTU                                                   01016000
BTUFID   EQU   BTUBTH                                                   01017000
BTUREQ   EQU   BTUBTH+6                                                 01018000
BTURQFLG EQU   BTUREQ                                                   01019000
BTURH    EQU   BTUBTH+10                                                01020000
BTUSYSTR EQU   ISTBTU+18                                                01021000
ISTLH    EQU   0                                                        01022000
ISTTH    EQU   0                                                        01023000
THFLAG1  EQU   ISTTH                                                    01024000
THFLGA   EQU   THFLAG1                                                  01025000
THMPF    EQU   THFLGA                                                   01026000
THFLGB   EQU   THFLAG1+1                                                01027000
ISTTH2   EQU   0                                                        01028000
TH2FLAG1 EQU   ISTTH2                                                   01029000
TH2MPF   EQU   TH2FLAG1                                                 01030000
ISTZIBUF EQU   0                                                        01031000
ZIBFSM   EQU   ISTZIBUF+4                                               01032000
ISTPROCD EQU   0                                                        01033000
PROPROC  EQU   ISTPROCD                                                 01034000
PROPROC1 EQU   PROPROC                                                  01035000
PROPROC2 EQU   PROPROC+1                                                01036000
PROPROC3 EQU   PROPROC+2                                                01037000
PROPROC4 EQU   PROPROC+3                                                01038000
PROPROCS EQU   0                                                        01039000
PROSETMS EQU   PROPROCS+1                                               01040000
PROSETM2 EQU   PROSETMS                                                 01041000
PROSETM3 EQU   PROSETMS+1                                               01042000
PROSETM4 EQU   PROSETMS+2                                               01043000
ISTDEVCH EQU   0                                                        01044000
DEVSHCH  EQU   ISTDEVCH                                                 01045000
DEVCHAR  EQU   DEVSHCH                                                  01046000
DEVTCODE EQU   ISTDEVCH+1                                               01047000
DEVFLAGS EQU   ISTDEVCH+3                                               01048000
DEVFCCTL EQU   DEVFLAGS                                                 01049000
DEVCHAR3 EQU   DEVFLAGS                                                 01050000
ISTFMCB  EQU   0                                                        01051000
FMCSTAT  EQU   ISTFMCB+28                                               01052000
FMCSTAT1 EQU   ISTFMCB+29                                               01053000
FMCCMDFL EQU   ISTFMCB+31                                               01054000
FMCCMPS1 EQU   ISTFMCB+36                                               01055000
FMCSIPA  EQU   ISTFMCB+148                                              01056000
FMCNXOSQ EQU   ISTFMCB+152                                              01057000
FMCNXCFM EQU   FMCNXOSQ                                                 01058000
FMCNXOSC EQU   FMCNXOSQ+2                                               01059000
FMCSSTAT EQU   ISTFMCB+159                                              01060000
FMCPACE  EQU   ISTFMCB+160                                              01061000
FMCPACEN EQU   FMCPACE                                                  01062000
FMCPACEM EQU   FMCPACE+1                                                01063000
FMCPACPC EQU   FMCPACE+2                                                01064000
FMCCVAL  EQU   FMCPACE+3                                                01065000
FMCOBCE  EQU   FMCCVAL                                                  01066000
FMCCLEXT EQU   ISTFMCB+164                                              01067000
FMCRPLA  EQU   FMCCLEXT                                                 01068000
FMCFBA   EQU   FMCCLEXT+4                                               01069000
FMCCMPS2 EQU   FMCCLEXT+16                                              01070000
FMCFLGA  EQU   FMCCMPS2                                                 01071000
FMCFLGCL EQU   FMCCMPS2+1                                               01072000
FMCPSCMD EQU   FMCCMPS2+2                                               01073000
FMCPSTAT EQU   FMCCMPS2+3                                               01074000
FMCSTAT2 EQU   ISTFMCB+186                                              01075000
FMCMODEB EQU   ISTFMCB+189                                              01076000
FMCCLSEQ EQU   ISTFMCB+190                                              01077000
FMCRRESP EQU   ISTFMCB+195                                              01078000
FMCSSEGQ EQU   ISTFMCB+200                                              01079000
FMCFBAS  EQU   ISTFMCB+216                                              01080000
FMCZV002 EQU   FMCFBAS                                                  01081000
FMCSNCTL EQU   ISTFMCB+224                                              01082000
FMCSCFLG EQU   FMCSNCTL                                                 01083000
FMCVS1   EQU   ISTFMCB+232                                              01084000
FMCZFLAG EQU   FMCVS1                                                   01085000
FMCZF006 EQU   FMCZFLAG                                                 01086000
FMCZH001 EQU   FMCVS1+4                                                 01087000
FMCLBXM  EQU   FMCVS1+12                                                01088000
FMCSHEAQ EQU   FMCLBXM                                                  01089000
FMCLCPBQ EQU   FMCVS1+16                                                01090000
FMCLCPAQ EQU   FMCVS1+20                                                01091000
FMCSEQ1  EQU   FMCVS1+34                                                01092000
FMCZFLG2 EQU   FMCVS1+35                                                01093000
FMCCVFLG EQU   FMCVS1+44                                                01094000
FMCFLAG  EQU   0                                                        01095000
FMCFLGB  EQU   FMCFLAG                                                  01096000
ISTLCCW  EQU   0                                                        01097000
LCCWOP   EQU   ISTLCCW                                                  01098000
LCCWRWOP EQU   LCCWOP                                                   01099000
LCCWCTL  EQU   LCCWRWOP                                                 01100000
LCCWFLAG EQU   ISTLCCW+1                                                01101000
LCCWLSI  EQU   LCCWFLAG                                                 01102000
ISTLCPB  EQU   0                                                        01103000
LCPREQTG EQU   ISTLCPB+2                                                01104000
LCPFLAGS EQU   LCPREQTG                                                 01105000
LCPZF001 EQU   LCPFLAGS                                                 01106000
LCPZRT02 EQU   LCPZF001                                                 01107000
LCPZF002 EQU   LCPFLAGS                                                 01108000
LCPZRT03 EQU   LCPZF002                                                 01109000
LCPZF003 EQU   LCPFLAGS                                                 01110000
LCPZRT04 EQU   LCPZF003                                                 01111000
LCPZF004 EQU   LCPFLAGS                                                 01112000
LCPZRT05 EQU   LCPZF004                                                 01113000
LCPZRT06 EQU   LCPFLAGS                                                 01114000
LCPZRT07 EQU   LCPFLAGS                                                 01115000
LCPMNRCD EQU   LCPREQTG+1                                               01116000
LCPZRT08 EQU   LCPMNRCD                                                 01117000
LCPZRT09 EQU   LCPMNRCD                                                 01118000
LCPCHAIN EQU   ISTLCPB+4                                                01119000
LCPCHAI1 EQU   LCPCHAIN                                                 01120000
LCPRUCNT EQU   ISTLCPB+8                                                01121000
LCPFLAG2 EQU   ISTLCPB+9                                                01122000
LCPTLBPI EQU   LCPFLAG2                                                 01123000
LCPFID0  EQU   LCPFLAG2                                                 01124000
LCPSEQ   EQU   ISTLCPB+10                                               01125000
LCPCID   EQU   ISTLCPB+16                                               01126000
LCPFDBA  EQU   ISTLCPB+24                                               01127000
LCPFLG1  EQU   ISTLCPB+37                                               01128000
LCPFLCCW EQU   ISTLCPB+40                                               01129000
LCPLCCW  EQU   ISTLCPB+48                                               01130000
LCPPABA  EQU   LCPLCCW+4                                                01131000
LCPRPHA  EQU   LCPPABA                                                  01132000
ISTZSAVE EQU   0                                                        01133000
ZSAZSVBC EQU   ISTZSAVE                                                 01134000
ZSAZSVMS EQU   ZSAZSVBC                                                 01135000
ZSAZACTV EQU   ZSAZSVMS                                                 01136000
ZSAZSVFC EQU   ISTZSAVE+4                                               01137000
ZSAZSVRR EQU   ISTZSAVE+8                                               01138000
ZSAZSVVR EQU   ISTZSAVE+12                                              01139000
ZSAZTRAC EQU   ISTZSAVE+36                                              01140000
ISTZCRR  EQU   0                                                        01141000
ZCRCRR   EQU   ISTZCRR                                                  01142000
ZCRFLGS1 EQU   ISTZCRR+12                                               01143000
ZCRFLGS2 EQU   ISTZCRR+13                                               01144000
ZCRSWFLD EQU   ISTZCRR+14                                               01145000
ZCRENDSH EQU   ZCRSWFLD                                                 01146000
ZCRNDLCP EQU   ZCRSWFLD                                                 01147000
ZCRRESET EQU   ZCRSWFLD                                                 01148000
ZCRFLGS3 EQU   ISTZCRR+15                                               01149000
ZCRGENSW EQU   ISTZCRR+16                                               01150000
ZCRPFLGS EQU   ISTZCRR+17                                               01151000
ZCRIBPR  EQU   ISTZCRR+18                                               01152000
ZCRSCPSW EQU   ISTZCRR+19                                               01153000
ZCRPARMS EQU   ISTZCRR+24                                               01154000
ZCRFBPTR EQU   ZCRPARMS                                                 01155000
ZCRDFRDA EQU   ZCRPARMS+10                                              01156000
ZCRPCOD1 EQU   ZCRPARMS+12                                              01157000
ZCRPLSBF EQU   ZCRPCOD1                                                 01158000
ZCRPCOD2 EQU   ZCRPARMS+13                                              01159000
ZCRSVRTN EQU   ISTZCRR+56                                               01160000
ZCRWKARA EQU   ISTZCRR+156                                              01161000
ZCRCIDSV EQU   ISTZCRR+192                                              01162000
ZCRAUDIT EQU   ISTZCRR+440                                              01163000
ZCRENTER EQU   ZCRAUDIT+5                                               01164000
ZCREJCCB EQU   ZCRENTER+14                                              01165000
ZCRLCPB  EQU   ISTZCRR+480                                              01166000
ZCRRHRU  EQU   ZCRLCPB                                                  01167000
ISTPFCRR EQU   0                                                        01168000
PFCCRR   EQU   ISTPFCRR                                                 01169000
PFCCRRID EQU   PFCCRR                                                   01170000
PFCCRRLN EQU   PFCCRR+2                                                 01171000
PFCHDR   EQU   ISTPFCRR+4                                               01172000
PFCCRRO  EQU   PFCHDR                                                   01173000
PFCFRRO  EQU   PFCHDR+4                                                 01174000
ISTCFCRR EQU   0                                                        01175000
CFCAUDIT EQU   ISTCFCRR                                                 01176000
CFCNTRD  EQU   CFCAUDIT                                                 01177000
CFCCRT   EQU   CFCAUDIT+1                                               01178000
ISTASCRR EQU   0                                                        01179000
ASCFLAGS EQU   ISTASCRR+16                                              01180000
ASCFLG1  EQU   ASCFLAGS                                                 01181000
ASCFLG2  EQU   ASCFLAGS+2                                               01182000
ASCFLG3  EQU   ASCFLAGS+4                                               01183000
ASCUSRGS EQU   ISTASCRR+28                                              01184000
ISTAPCRR EQU   0                                                        01185000
APCATFLG EQU   ISTAPCRR+16                                              01186000
APCRFLG  EQU   ISTAPCRR+18                                              01187000
APCSAVE  EQU   ISTAPCRR+44                                              01188000
APCCOMF  EQU   ISTAPCRR+116                                             01189000
APCCOMF1 EQU   APCCOMF                                                  01190000
APC31FLG EQU   ISTAPCRR+132                                             01191000
APC52FLG EQU   ISTAPCRR+133                                             01192000
APC53FLG EQU   ISTAPCRR+134                                             01193000
APC54FLG EQU   ISTAPCRR+135                                             01194000
APC57FLG EQU   ISTAPCRR+136                                             01195000
ISTCRA   EQU   0                                                        01196000
CRABASIC EQU   ISTCRA                                                   01197000
CRAHDR   EQU   CRABASIC                                                 01198000
CRACRR   EQU   CRAHDR                                                   01199000
CRALKACT EQU   CRABASIC+8                                               01200000
CRASVC   EQU   ISTCRA+848                                               01201000
CRABUFA  EQU   CRASVC+68                                                01202000
ZIBSRB   EQU   0                                                        01203000
CVTS01   EQU   CVTPGSIA                                                 01204000
CVTLPDIA EQU   CVTS01+12                                                01205000
CVTDIRST EQU   CVTLPDIA                                                 01206000
CVTSLIDA EQU   CVTS01+24                                                01207000
CVTCTLFG EQU   CVTS01+50                                                01208000
CVTRV210 EQU   CVTS01+424                                               01209000
CVTRV219 EQU   CVTS01+425                                               01210000
CVTRV228 EQU   CVTS01+426                                               01211000
CVTRV237 EQU   CVTS01+427                                               01212000
CVTMFRTR EQU   CVTS01+452                                               01213000
CVTRV262 EQU   CVTS01+468                                               01214000
CVTRV271 EQU   CVTS01+469                                               01215000
CVTRV280 EQU   CVTS01+470                                               01216000
CVTRV289 EQU   CVTS01+471                                               01217000
CVTGSDA  EQU   CVTS01+600                                               01218000
FSBCOMBN EQU   FSBNETRS                                                 01219000
FSBRHFLD EQU   FSBCOMBN+1                                               01220000
FSBRH3   EQU   FSBRHFLD+2                                               01221000
FSBLDFLG EQU   FSBRH3                                                   01222000
@NM00016 EQU   FSBRQTAG                                                 01223000
ZIBDIO   EQU   ZIBFSM                                                   01224000
ZIBCCW2  EQU   ZIBDIO+8                                                 01225000
ZIBCPTCC EQU   ZIBCCW2                                                  01226000
ZIBAIO   EQU   ISTZIBUF                                                 01227000
ZIBAIOCM EQU   ZIBAIO                                                   01228000
ZIBFIB   EQU   ZIBAIO+16                                                01229000
ZIBFSB   EQU   ZIBFIB                                                   01230000
ZIBMDREC EQU   ZIBFSB+4                                                 01231000
ZIBMDRIN EQU   ZIBFSB+28                                                01232000
ZIBBTU   EQU   ZIBFIB+32                                                01233000
@NM00020 EQU   ZIBBTU+12                                                01234000
ZIBFID1  EQU   @NM00020+1                                               01235000
ZIBFITXT EQU   ZIBFID1                                                  01236000
ZIBSIB   EQU   ZIBFIB                                                   01237000
ZIBREC   EQU   ZIBMDRIN                                                 01238000
ZIBRECPL EQU   ZIBREC                                                   01239000
ZIBRECHD EQU   ZIBRECPL                                                 01240000
ZIBRECRS EQU   ZIBREC+8                                                 01241000
ZIBRECDT EQU   ZIBREC+10                                                01242000
ZIBMDRRC EQU   ZIBMDREC                                                 01243000
ZIBRCPL  EQU   ZIBMDRRC                                                 01244000
ZIBRCDT  EQU   ZIBMDRRC+24                                              01245000
@NM00022 EQU   ZIBBTU                                                   01246000
LCPZTIE  EQU   LCPCID                                                   01247000
LCPZSNAM EQU   LCPZTIE+8                                                01248000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01249000
LCPZTRV4 EQU   LCPZSNAM+4                                               01250000
LCPZTRV1 EQU   LCPZSNAM                                                 01251000
LCPZSNA  EQU   LCPZTIE+4                                                01252000
LCPZFMCA EQU   LCPZTIE                                                  01253000
ZIBTH2   EQU   @NM00022+4                                               01254000
ZIBLH    EQU   @NM00022                                                 01255000
ZIBRCTXT EQU   ZIBMDRRC+36                                              01256000
ZIBRCRID EQU   ZIBRCDT+10                                               01257000
ZIBRCNAM EQU   ZIBRCDT+2                                                01258000
ZIBRCUA  EQU   ZIBRCDT                                                  01259000
ZIBRCPUI EQU   ZIBRCPL+20                                               01260000
ZIBRCPUN EQU   ZIBRCPL+16                                               01261000
ZIBRCTIM EQU   ZIBRCPL+12                                               01262000
ZIBRCDAT EQU   ZIBRCPL+8                                                01263000
ZIBRCRS1 EQU   ZIBRCPL+6                                                01264000
ZIBRCSID EQU   ZIBRCPL+5                                                01265000
ZIBRCID  EQU   ZIBRCPL+4                                                01266000
ZIBRCSW  EQU   ZIBRCPL+2                                                01267000
ZIBRCSYR EQU   ZIBRCPL+1                                                01268000
ZIBRCL   EQU   ZIBRCPL                                                  01269000
ZIBRECTX EQU   ZIBREC+22                                                01270000
ZIBRECID EQU   ZIBRECDT+10                                              01271000
ZIBRECNA EQU   ZIBRECDT+2                                               01272000
ZIBRECUA EQU   ZIBRECDT                                                 01273000
ZIBRECSV EQU   ZIBRECRS                                                 01274000
ZIBRECDA EQU   ZIBRECPL+4                                               01275000
ZIBRECSI EQU   ZIBRECHD+3                                               01276000
ZIBRECDV EQU   ZIBRECHD+2                                               01277000
ZIBRECFL EQU   ZIBRECHD+1                                               01278000
ZIBRECTY EQU   ZIBRECHD                                                 01279000
ZIBTEXT  EQU   ZIBSIB+4                                                 01280000
ZIBRSV04 EQU   ZIBSIB                                                   01281000
ZIBTEXT2 EQU   ZIBFITXT                                                 01282000
ZIBTEXT1 EQU   ZIBFIB+52                                                01283000
@NM00021 EQU   @NM00020                                                 01284000
ZIBFDBS  EQU   ZIBBTU                                                   01285000
@NM00019 EQU   ZIBMDREC                                                 01286000
@NM00018 EQU   ZIBFSB                                                   01287000
ZIBLNG2  EQU   ZIBAIOCM+14                                              01288000
ZIBRSV03 EQU   ZIBAIOCM+13                                              01289000
ZIBWKBYT EQU   ZIBAIOCM+12                                              01290000
ZIBFDBZ  EQU   ZIBAIOCM                                                 01291000
ZIBCPNPK EQU   ZIBCCW2+6                                                01292000
ZIBRSV02 EQU   ZIBCCW2+5                                                01293000
ZIBCPTPF EQU   ZIBCCW2+4                                                01294000
ZIBCPTCA EQU   ZIBCCW2+1                                                01295000
ZIBCPNPC EQU   ZIBCPTCC                                                 01296000
ZIBCPRDK EQU   ZIBDIO+6                                                 01297000
ZIBRSV01 EQU   ZIBDIO+5                                                 01298000
ZIBCPRDF EQU   ZIBDIO+4                                                 01299000
ZIBCPTXA EQU   ZIBDIO+1                                                 01300000
ZIBCPRDC EQU   ZIBDIO                                                   01301000
FSBRT0B  EQU   @NM00016+1                                               01302000
FSBRT0A  EQU   @NM00016+1                                               01303000
FSBRT09  EQU   @NM00016+1                                               01304000
FSBRT08  EQU   @NM00016+1                                               01305000
FSBRT07  EQU   @NM00016                                                 01306000
FSBRT06  EQU   @NM00016                                                 01307000
FSBRT05  EQU   @NM00016                                                 01308000
FSBRT04  EQU   @NM00016                                                 01309000
FSBRT03  EQU   @NM00016                                                 01310000
FSBRT02  EQU   @NM00016                                                 01311000
FSBRT01  EQU   @NM00016                                                 01312000
FSBRT00  EQU   @NM00016                                                 01313000
FSBLDCUF EQU   FSBLDFLG                                                 01314000
FSBLDSIF EQU   FSBLDFLG                                                 01315000
FSBLDSOF EQU   FSBLDFLG                                                 01316000
FSBLDEBF EQU   FSBLDFLG                                                 01317000
FSBLDBBF EQU   FSBLDFLG                                                 01318000
FSBLDFME EQU   FSBLDFLG                                                 01319000
FSBLDSCF EQU   FSBLDFLG                                                 01320000
FSBLDRMF EQU   FSBLDFLG                                                 01321000
FSBRH2   EQU   FSBRHFLD+1                                               01322000
FSBRH1   EQU   FSBRHFLD                                                 01323000
FSBALIGN EQU   FSBCOMBN                                                 01324000
CVTRV628 EQU   CVTS01+728                                               01325000
CVTRV627 EQU   CVTS01+724                                               01326000
CVTRV626 EQU   CVTS01+720                                               01327000
CVTRV625 EQU   CVTS01+716                                               01328000
CVTRV624 EQU   CVTS01+712                                               01329000
CVTRV623 EQU   CVTS01+708                                               01330000
CVTRV622 EQU   CVTS01+704                                               01331000
CVTRV621 EQU   CVTS01+700                                               01332000
CVTRV620 EQU   CVTS01+696                                               01333000
CVTRV619 EQU   CVTS01+692                                               01334000
CVTRV618 EQU   CVTS01+688                                               01335000
CVTRV617 EQU   CVTS01+684                                               01336000
CVTRV616 EQU   CVTS01+680                                               01337000
CVTRV615 EQU   CVTS01+676                                               01338000
CVTRV614 EQU   CVTS01+672                                               01339000
CVTRV613 EQU   CVTS01+668                                               01340000
CVTRV612 EQU   CVTS01+664                                               01341000
CVTRV611 EQU   CVTS01+660                                               01342000
CVTEVERM EQU   CVTS01+656                                               01343000
CVTIRM   EQU   CVTS01+652                                               01344000
CVTCGK   EQU   CVTS01+648                                               01345000
CVTRAC   EQU   CVTS01+644                                               01346000
CVTRV606 EQU   CVTS01+640                                               01347000
CVTRV605 EQU   CVTS01+636                                               01348000
CVTRV604 EQU   CVTS01+632                                               01349000
CVTEFF02 EQU   CVTS01+628                                               01350000
CVTCBBR  EQU   CVTS01+624                                               01351000
CVTSSCR  EQU   CVTS01+620                                               01352000
CVTEVENT EQU   CVTS01+616                                               01353000
CVTCRCA  EQU   CVTS01+612                                               01354000
CVTTPIO  EQU   CVTS01+608                                               01355000
CVTADV   EQU   CVTS01+604                                               01356000
CVTGSDAB EQU   CVTGSDA                                                  01357000
CVTQV3   EQU   CVTS01+596                                               01358000
CVTQV2   EQU   CVTS01+592                                               01359000
CVTQV1   EQU   CVTS01+588                                               01360000
CVTRPT   EQU   CVTS01+584                                               01361000
CVTSSRB  EQU   CVTS01+580                                               01362000
CVTCSDRL EQU   CVTS01+576                                               01363000
CVTEXP1  EQU   CVTS01+572                                               01364000
CVTRMPMT EQU   CVTS01+568                                               01365000
CVTRMPTT EQU   CVTS01+564                                               01366000
CVTVPSA  EQU   CVTS01+560                                               01367000
CVTVSTOP EQU   CVTS01+556                                               01368000
CVTGTFR8 EQU   CVTS01+552                                               01369000
CVTQUIT  EQU   CVTS01+548                                               01370000
CVTVACR  EQU   CVTS01+544                                               01371000
CVTWTCB  EQU   CVTS01+540                                               01372000
CVTSTPRS EQU   CVTS01+536                                               01373000
CVT0PT02 EQU   CVTS01+532                                               01374000
CVTDARCM EQU   CVTS01+528                                               01375000
CVTIRECM EQU   CVTS01+524                                               01376000
CVTJRECM EQU   CVTS01+520                                               01377000
CVTVEMS0 EQU   CVTS01+516                                               01378000
CVTSPFRR EQU   CVTS01+512                                               01379000
CVTRLSTG EQU   CVTS01+508                                               01380000
CVT0TC0A EQU   CVTS01+504                                               01381000
CVTGMBR  EQU   CVTS01+500                                               01382000
CVTLFRM  EQU   CVTS01+496                                               01383000
CVTRMBR  EQU   CVTS01+492                                               01384000
CVTVIOP  EQU   CVTS01+488                                               01385000
CVTRV307 EQU   CVTS01+486                                               01386000
CVTRV306 EQU   CVTS01+484                                               01387000
CVTRV305 EQU   CVTS01+482                                               01388000
CVTRV304 EQU   CVTS01+480                                               01389000
CVTRV303 EQU   CVTS01+478                                               01390000
CVTRV302 EQU   CVTS01+476                                               01391000
CVTTRCA  EQU   CVTS01+472                                               01392000
CVTRV297 EQU   CVTRV289                                                 01393000
CVTRV296 EQU   CVTRV289                                                 01394000
CVTRV295 EQU   CVTRV289                                                 01395000
CVTRV294 EQU   CVTRV289                                                 01396000
CVTRV293 EQU   CVTRV289                                                 01397000
CVTRV292 EQU   CVTRV289                                                 01398000
CVTRV291 EQU   CVTRV289                                                 01399000
CVTRV290 EQU   CVTRV289                                                 01400000
CVTRV288 EQU   CVTRV280                                                 01401000
CVTRV287 EQU   CVTRV280                                                 01402000
CVTRV286 EQU   CVTRV280                                                 01403000
CVTRV285 EQU   CVTRV280                                                 01404000
CVTRV284 EQU   CVTRV280                                                 01405000
CVTRV283 EQU   CVTRV280                                                 01406000
CVTRV282 EQU   CVTRV280                                                 01407000
CVTRV281 EQU   CVTRV280                                                 01408000
CVTRV279 EQU   CVTRV271                                                 01409000
CVTRV278 EQU   CVTRV271                                                 01410000
CVTRV277 EQU   CVTRV271                                                 01411000
CVTRV276 EQU   CVTRV271                                                 01412000
CVTRV275 EQU   CVTRV271                                                 01413000
CVTRV274 EQU   CVTRV271                                                 01414000
CVTRV273 EQU   CVTRV271                                                 01415000
CVTRV272 EQU   CVTRV271                                                 01416000
CVTRV270 EQU   CVTRV262                                                 01417000
CVTRV269 EQU   CVTRV262                                                 01418000
CVTRV268 EQU   CVTRV262                                                 01419000
CVTRV267 EQU   CVTRV262                                                 01420000
CVTRV266 EQU   CVTRV262                                                 01421000
CVTRV265 EQU   CVTRV262                                                 01422000
CVTRV264 EQU   CVTRV262                                                 01423000
CVTRV263 EQU   CVTRV262                                                 01424000
CVTVFP   EQU   CVTS01+464                                               01425000
CVTVSI   EQU   CVTS01+460                                               01426000
CVTVPSIB EQU   CVTS01+456                                               01427000
CVTMFACT EQU   CVTMFRTR                                                 01428000
CVTMFCTL EQU   CVTS01+448                                               01429000
CVTPVBP  EQU   CVTS01+444                                               01430000
CVTPWI   EQU   CVTS01+440                                               01431000
CVTRV254 EQU   CVTS01+438                                               01432000
CVTRV253 EQU   CVTS01+436                                               01433000
CVTRV252 EQU   CVTS01+434                                               01434000
CVTRV251 EQU   CVTS01+433                                               01435000
CVTRV250 EQU   CVTS01+432                                               01436000
CVTRV249 EQU   CVTS01+431                                               01437000
CVTRV248 EQU   CVTS01+430                                               01438000
CVTRV247 EQU   CVTS01+429                                               01439000
CVTRV246 EQU   CVTS01+428                                               01440000
CVTRV245 EQU   CVTRV237                                                 01441000
CVTRV244 EQU   CVTRV237                                                 01442000
CVTRV243 EQU   CVTRV237                                                 01443000
CVTRV242 EQU   CVTRV237                                                 01444000
CVTRV241 EQU   CVTRV237                                                 01445000
CVTRV240 EQU   CVTRV237                                                 01446000
CVTRV239 EQU   CVTRV237                                                 01447000
CVTRV238 EQU   CVTRV237                                                 01448000
CVTRV236 EQU   CVTRV228                                                 01449000
CVTRV235 EQU   CVTRV228                                                 01450000
CVTRV234 EQU   CVTRV228                                                 01451000
CVTRV233 EQU   CVTRV228                                                 01452000
CVTRV232 EQU   CVTRV228                                                 01453000
CVTRV231 EQU   CVTRV228                                                 01454000
CVTRV230 EQU   CVTRV228                                                 01455000
CVTRV229 EQU   CVTRV228                                                 01456000
CVTRV227 EQU   CVTRV219                                                 01457000
CVTRV226 EQU   CVTRV219                                                 01458000
CVTRV225 EQU   CVTRV219                                                 01459000
CVTRV224 EQU   CVTRV219                                                 01460000
CVTRV223 EQU   CVTRV219                                                 01461000
CVTRV222 EQU   CVTRV219                                                 01462000
CVTRV221 EQU   CVTRV219                                                 01463000
CVTRV220 EQU   CVTRV219                                                 01464000
CVTRV218 EQU   CVTRV210                                                 01465000
CVTRV217 EQU   CVTRV210                                                 01466000
CVTRV216 EQU   CVTRV210                                                 01467000
CVTRV215 EQU   CVTRV210                                                 01468000
CVTRV214 EQU   CVTRV210                                                 01469000
CVTRV213 EQU   CVTRV210                                                 01470000
CVTRV212 EQU   CVTRV210                                                 01471000
CVTRV211 EQU   CVTRV210                                                 01472000
CVTLCCAT EQU   CVTS01+420                                               01473000
CVTPCCAT EQU   CVTS01+416                                               01474000
CVTIPCRP EQU   CVTS01+412                                               01475000
CVTIPCRI EQU   CVTS01+408                                               01476000
CVTIPCDS EQU   CVTS01+404                                               01477000
CVTAIDVT EQU   CVTS01+400                                               01478000
CVTSSAP  EQU   CVTS01+396                                               01479000
CVTEHCIR EQU   CVTS01+392                                               01480000
CVTEHDEF EQU   CVTS01+388                                               01481000
CVTDAIR  EQU   CVTS01+384                                               01482000
CVTPERFM EQU   CVTS01+380                                               01483000
CVT044R2 EQU   CVTS01+376                                               01484000
CVTFETCH EQU   CVTS01+372                                               01485000
CVTRSTWD EQU   CVTS01+368                                               01486000
CVTSPOST EQU   CVTS01+364                                               01487000
CVTIOBP  EQU   CVTS01+360                                               01488000
CVTASMVT EQU   CVTS01+356                                               01489000
CVTRECRQ EQU   CVTS01+352                                               01490000
CVTWSAC  EQU   CVTS01+348                                               01491000
CVTRV149 EQU   CVTS01+344                                               01492000
CVTWSAL  EQU   CVTS01+340                                               01493000
CVTSPSA  EQU   CVTS01+336                                               01494000
CVTGLMN  EQU   CVTS01+332                                               01495000
CVTVEAC0 EQU   CVTS01+328                                               01496000
CVT062R1 EQU   CVTS01+324                                               01497000
CVTRPOST EQU   CVTS01+320                                               01498000
CVTDQIQE EQU   CVTS01+316                                               01499000
CVTCSD   EQU   CVTS01+312                                               01500000
CVTLKRMA EQU   CVTS01+308                                               01501000
CVTRSPIE EQU   CVTS01+304                                               01502000
CVTRENQ  EQU   CVTS01+300                                               01503000
CVTLQCB  EQU   CVTS01+296                                               01504000
CVTFQCB  EQU   CVTS01+292                                               01505000
CVTQCS01 EQU   CVTS01+288                                               01506000
CVTAPFT  EQU   CVTS01+284                                               01507000
CVTPARRL EQU   CVTS01+280                                               01508000
CVTVWAIT EQU   CVTS01+276                                               01509000
CVTGSPL  EQU   CVTS01+272                                               01510000
CVTLSMQ  EQU   CVTS01+268                                               01511000
CVTGSMQ  EQU   CVTS01+264                                               01512000
CVTEXPRO EQU   CVTS01+260                                               01513000
CVTOPCTP EQU   CVTS01+256                                               01514000
CVTSIC   EQU   CVTS01+252                                               01515000
CVTTPIOS EQU   CVTS01+248                                               01516000
CVTRTMS  EQU   CVTS01+244                                               01517000
CVTSDBF  EQU   CVTS01+240                                               01518000
CVTSCBP  EQU   CVTS01+236                                               01519000
CVTSDMP  EQU   CVTS01+232                                               01520000
CVTSV60  EQU   CVTS01+228                                               01521000
CVTRTMCT EQU   CVTS01+224                                               01522000
CVTASCBL EQU   CVTS01+220                                               01523000
CVTASCBH EQU   CVTS01+216                                               01524000
CVTGDA   EQU   CVTS01+212                                               01525000
CVTASVT  EQU   CVTS01+208                                               01526000
CVTVVMDI EQU   CVTS01+204                                               01527000
CVTAQTOP EQU   CVTS01+200                                               01528000
CVTIOSCS EQU   CVTS01+196                                               01529000
CVTSDRM  EQU   CVTS01+192                                               01530000
CVTOPTE  EQU   CVTS01+188                                               01531000
CVTSTXU  EQU   CVTS01+184                                               01532000
CVTQUIS  EQU   CVTS01+180                                               01533000
CVTPARS  EQU   CVTS01+176                                               01534000
CVTS1EE  EQU   CVTS01+172                                               01535000
CVTFRAS  EQU   CVTS01+168                                               01536000
CVTQSAS  EQU   CVTS01+164                                               01537000
CVTCRAS  EQU   CVTS01+160                                               01538000
CVTCRMN  EQU   CVTS01+156                                               01539000
CVTDELCP EQU   CVTS01+152                                               01540000
CVTFRECL EQU   CVTS01+148                                               01541000
CVTGETCL EQU   CVTS01+144                                               01542000
CVTBLDCP EQU   CVTS01+140                                               01543000
CVTAUTHL EQU   CVTS01+136                                               01544000
CVTSCAN  EQU   CVTS01+132                                               01545000
CVTRV144 EQU   CVTS01+130                                               01546000
CVTMAXMP EQU   CVTS01+128                                               01547000
CVTSTCK  EQU   CVTS01+124                                               01548000
CVTRV139 EQU   CVTS01+123                                               01549000
CVTDSSAC EQU   CVTS01+122                                               01550000
CVTRV513 EQU   CVTS01+121                                               01551000
CVTIOSPL EQU   CVTS01+120                                               01552000
CVTPTGT  EQU   CVTS01+116                                               01553000
CVTCSPIE EQU   CVTS01+112                                               01554000
CVTSMFEX EQU   CVTS01+108                                               01555000
CVTOLT0A EQU   CVTS01+104                                               01556000
CVTSRBRT EQU   CVTS01+100                                               01557000
CVTPUTL  EQU   CVTS01+96                                                01558000
CVTRV519 EQU   CVTS01+92                                                01559000
CVTRV327 EQU   CVTS01+88                                                01560000
CVTRV326 EQU   CVTS01+84                                                01561000
CVTRV325 EQU   CVTS01+80                                                01562000
CVTRV324 EQU   CVTS01+76                                                01563000
CVT0VL01 EQU   CVTS01+72                                                01564000
CVTSHRVM EQU   CVTS01+68                                                01565000
CVTRV332 EQU   CVTS01+64                                                01566000
CVTTAS   EQU   CVTS01+60                                                01567000
CVTRSCN  EQU   CVTS01+56                                                01568000
CVTTRAC2 EQU   CVTS01+54                                                01569000
CVTTRACE EQU   CVTS01+52                                                01570000
CVTAPG   EQU   CVTS01+51                                                01571000
CVTSDTRC EQU   CVTCTLFG                                                 01572000
CVTGTRCE EQU   CVTCTLFG                                                 01573000
CVTNOMP  EQU   CVTCTLFG                                                 01574000
CVTRSV79 EQU   CVTCTLFG                                                 01575000
CVTDSTAT EQU   CVTCTLFG                                                 01576000
CVTRSV78 EQU   CVTCTLFG                                                 01577000
CVTRV333 EQU   CVTCTLFG                                                 01578000
CVTRV323 EQU   CVTCTLFG                                                 01579000
CVTSPVLK EQU   CVTS01+49                                                01580000
CVTRSV77 EQU   CVTS01+48                                                01581000
CVTRV331 EQU   CVTS01+44                                                01582000
CVTRV330 EQU   CVTS01+40                                                01583000
CVTRV329 EQU   CVTS01+36                                                01584000
CVTRV328 EQU   CVTS01+32                                                01585000
CVTRV322 EQU   CVTS01+28                                                01586000
CVTSLID  EQU   CVTSLIDA+1                                               01587000
CVTSYLK  EQU   CVTSLIDA                                                 01588000
CVTRV321 EQU   CVTS01+20                                                01589000
CVTRV320 EQU   CVTS01+16                                                01590000
CVTLPDIR EQU   CVTLPDIA+1                                               01591000
CVTRSV69 EQU   CVTDIRST                                                 01592000
CVTRSV68 EQU   CVTDIRST                                                 01593000
CVTRSV67 EQU   CVTDIRST                                                 01594000
CVTRSV66 EQU   CVTDIRST                                                 01595000
CVTRSV65 EQU   CVTDIRST                                                 01596000
CVTRSV64 EQU   CVTDIRST                                                 01597000
CVTRSV63 EQU   CVTDIRST                                                 01598000
CVTDICOM EQU   CVTDIRST                                                 01599000
CVTPVTP  EQU   CVTS01+8                                                 01600000
CVTLPDSR EQU   CVTS01+4                                                 01601000
CVTGETL  EQU   CVTS01                                                   01602000
CRACHAIN EQU   ISTCRA+928                                               01603000
CRARSV02 EQU   ISTCRA+924                                               01604000
CRARSV01 EQU   ISTCRA+920                                               01605000
CRABFTBA EQU   CRABUFA                                                  01606000
CRAMASK  EQU   CRASVC+64                                                01607000
CRAHSIZ  EQU   CRASVC+60                                                01608000
CRAASCRR EQU   CRASVC                                                   01609000
CRAPROCR EQU   ISTCRA+312                                               01610000
CRAPSS   EQU   ISTCRA+160                                               01611000
CRARPH   EQU   ISTCRA+52                                                01612000
CRALAPTR EQU   CRABASIC+48                                              01613000
CRAL9PTR EQU   CRABASIC+44                                              01614000
CRAL8PTR EQU   CRABASIC+40                                              01615000
CRAL7PTR EQU   CRABASIC+36                                              01616000
CRAL6PTR EQU   CRABASIC+32                                              01617000
CRAL5PTR EQU   CRABASIC+28                                              01618000
CRAL4PTR EQU   CRABASIC+24                                              01619000
CRAL3PTR EQU   CRABASIC+20                                              01620000
CRAL2PTR EQU   CRABASIC+16                                              01621000
CRAL1PTR EQU   CRABASIC+12                                              01622000
CRALEV01 EQU   CRALKACT+3                                               01623000
CRALEV02 EQU   CRALKACT+3                                               01624000
CRALEV03 EQU   CRALKACT+3                                               01625000
CRALEV04 EQU   CRALKACT+3                                               01626000
CRALEV05 EQU   CRALKACT+3                                               01627000
CRALEV06 EQU   CRALKACT+3                                               01628000
CRALEV07 EQU   CRALKACT+3                                               01629000
CRALEV08 EQU   CRALKACT+3                                               01630000
CRALEV09 EQU   CRALKACT+2                                               01631000
CRALEV10 EQU   CRALKACT+2                                               01632000
CRALEV11 EQU   CRALKACT+2                                               01633000
CRALEV12 EQU   CRALKACT+2                                               01634000
CRALEV13 EQU   CRALKACT+2                                               01635000
CRALEV14 EQU   CRALKACT+2                                               01636000
CRALEV15 EQU   CRALKACT+2                                               01637000
CRALEV16 EQU   CRALKACT+2                                               01638000
CRALEV17 EQU   CRALKACT+1                                               01639000
CRALEV18 EQU   CRALKACT+1                                               01640000
CRALEV19 EQU   CRALKACT+1                                               01641000
CRALEV20 EQU   CRALKACT+1                                               01642000
CRALEV21 EQU   CRALKACT+1                                               01643000
CRALEV22 EQU   CRALKACT+1                                               01644000
CRALEV23 EQU   CRALKACT+1                                               01645000
CRALEV24 EQU   CRALKACT+1                                               01646000
CRALEV25 EQU   CRALKACT                                                 01647000
CRALEV26 EQU   CRALKACT                                                 01648000
CRALEV27 EQU   CRALKACT                                                 01649000
CRALEV28 EQU   CRALKACT                                                 01650000
CRALEV29 EQU   CRALKACT                                                 01651000
CRALEV30 EQU   CRALKACT                                                 01652000
CRALEV31 EQU   CRALKACT                                                 01653000
CRALEV32 EQU   CRALKACT                                                 01654000
CRAFRR   EQU   CRAHDR+4                                                 01655000
@NM00042 EQU   ISTAPCRR+137                                             01656000
@NM00041 EQU   APC57FLG                                                 01657000
APCNREL  EQU   APC57FLG                                                 01658000
APCRECRA EQU   APC57FLG                                                 01659000
@NM00040 EQU   APC54FLG                                                 01660000
APCRLST  EQU   APC54FLG                                                 01661000
APCPR153 EQU   APC53FLG                                                 01662000
@NM00039 EQU   APC52FLG                                                 01663000
APCWKF   EQU   APC52FLG                                                 01664000
APCNWF   EQU   APC52FLG                                                 01665000
APCRDQ   EQU   APC52FLG                                                 01666000
APCQENQ  EQU   APC52FLG                                                 01667000
APCSMSR  EQU   APC52FLG                                                 01668000
APCCKRQ  EQU   APC52FLG                                                 01669000
@NM00038 EQU   APC31FLG                                                 01670000
APCSORT  EQU   APC31FLG                                                 01671000
APCRESCH EQU   APC31FLG                                                 01672000
APCTPXIT EQU   APC31FLG                                                 01673000
APCSWTWD EQU   ISTAPCRR+128                                             01674000
APCSAV2  EQU   ISTAPCRR+124                                             01675000
APCSAV1  EQU   ISTAPCRR+120                                             01676000
APCRETCD EQU   APCCOMF+2                                                01677000
@NM00037 EQU   APCCOMF1+1                                               01678000
APCZLBER EQU   APCCOMF1                                                 01679000
APCEXIT  EQU   APCCOMF1                                                 01680000
APCRELR  EQU   APCCOMF1                                                 01681000
APCIRB2  EQU   APCCOMF1                                                 01682000
APCIRB1  EQU   APCCOMF1                                                 01683000
APCSMCR  EQU   APCCOMF1                                                 01684000
APCUETSK EQU   APCCOMF1                                                 01685000
APCSSTSK EQU   APCCOMF1                                                 01686000
APCESTAL EQU   APCSAVE                                                  01687000
APCFRRPM EQU   ISTAPCRR+40                                              01688000
APCQWFO  EQU   ISTAPCRR+36                                              01689000
APCPABSV EQU   ISTAPCRR+32                                              01690000
APCRTRN  EQU   ISTAPCRR+28                                              01691000
APCTCBA  EQU   ISTAPCRR+24                                              01692000
APCPSTA  EQU   ISTAPCRR+20                                              01693000
@NM00036 EQU   APCRFLG+1                                                01694000
APC31R   EQU   APCRFLG                                                  01695000
APC58R   EQU   APCRFLG                                                  01696000
APC57R   EQU   APCRFLG                                                  01697000
APC56R   EQU   APCRFLG                                                  01698000
APC54R   EQU   APCRFLG                                                  01699000
APC53R   EQU   APCRFLG                                                  01700000
APC52R   EQU   APCRFLG                                                  01701000
APC51R   EQU   APCRFLG                                                  01702000
@NM00035 EQU   APCATFLG+1                                               01703000
APC31E   EQU   APCATFLG                                                 01704000
APC58E   EQU   APCATFLG                                                 01705000
APC57E   EQU   APCATFLG                                                 01706000
APC56E   EQU   APCATFLG                                                 01707000
APC54E   EQU   APCATFLG                                                 01708000
APC53E   EQU   APCATFLG                                                 01709000
APC52E   EQU   APCATFLG                                                 01710000
APC51E   EQU   APCATFLG                                                 01711000
APCHDRSV EQU   ISTAPCRR                                                 01712000
ASCPSREG EQU   ISTASCRR+44                                              01713000
ASCUSR01 EQU   ASCUSRGS+12                                              01714000
ASCUSR00 EQU   ASCUSRGS+8                                               01715000
ASCUSR15 EQU   ASCUSRGS+4                                               01716000
ASCUSR14 EQU   ASCUSRGS                                                 01717000
ASCETRYA EQU   ISTASCRR+24                                              01718000
ASCKEY   EQU   ISTASCRR+23                                              01719000
ASCAUDIT EQU   ASCFLG3                                                  01720000
ASCFBDUD EQU   ASCFLG3                                                  01721000
ASCLLKF  EQU   ASCFLG3                                                  01722000
ASCKEYF  EQU   ASCFLG3                                                  01723000
ASCFBDAL EQU   ASCFLG3                                                  01724000
ASCFSRGT EQU   ASCFLG3                                                  01725000
ASCICR   EQU   ASCFLG2                                                  01726000
ASCFSRIC EQU   ASCFLG2                                                  01727000
ASCFBDIC EQU   ASCFLG2                                                  01728000
ASCFBAIC EQU   ASCFLG2                                                  01729000
ASCPASTR EQU   ASCFLG1                                                  01730000
ASCFSR   EQU   ASCFLG1                                                  01731000
ASCFBD   EQU   ASCFLG1                                                  01732000
ASCFBA   EQU   ASCFLG1                                                  01733000
ASCPFCRR EQU   ISTASCRR                                                 01734000
CCFRSVD1 EQU   CFCCRT                                                   01735000
CCFCR2   EQU   CFCCRT                                                   01736000
CCFCRP   EQU   CFCCRT                                                   01737000
CCFCR1   EQU   CFCCRT                                                   01738000
CCFCS2   EQU   CFCCRT                                                   01739000
CCFCS1   EQU   CFCCRT                                                   01740000
NCFRSVD  EQU   CFCNTRD                                                  01741000
NCFCR2   EQU   CFCNTRD                                                  01742000
NCFCRP   EQU   CFCNTRD                                                  01743000
NCFCR1   EQU   CFCNTRD                                                  01744000
NCFCS2   EQU   CFCNTRD                                                  01745000
NCFCS1   EQU   CFCNTRD                                                  01746000
PFCRSV01 EQU   ISTPFCRR+13                                              01747000
PFCFTA   EQU   ISTPFCRR+12                                              01748000
CRRFRR   EQU   PFCFRRO                                                  01749000
CRRCHAIN EQU   PFCCRRO                                                  01750000
CRRLEN   EQU   PFCCRRLN                                                 01751000
PFCRSV10 EQU   PFCCRR+1                                                 01752000
CRRID    EQU   PFCCRRID                                                 01753000
ZCRRU    EQU   ZCRRHRU+3                                                01754000
ZCRRH    EQU   ZCRRHRU                                                  01755000
ZCRWORDA EQU   ISTZCRR+477                                              01756000
ZCRCMNRC EQU   ISTZCRR+476                                              01757000
ZCRRSV97 EQU   ZCRENTER+18                                              01758000
ZCREIC2B EQU   ZCRENTER+18                                              01759000
ZCREAC2B EQU   ZCRENTER+18                                              01760000
ZCRELCAB EQU   ZCRENTER+18                                              01761000
ZCREDCMF EQU   ZCRENTER+18                                              01762000
ZCREBCIF EQU   ZCRENTER+18                                              01763000
ZCREICSG EQU   ZCRENTER+18                                              01764000
ZCREDCK0 EQU   ZCRENTER+18                                              01765000
ZCRECFY0 EQU   ZCRENTER+17                                              01766000
ZCREKCCB EQU   ZCRENTER+17                                              01767000
ZCREDCNB EQU   ZCRENTER+17                                              01768000
ZCREICOE EQU   ZCRENTER+17                                              01769000
ZCREBCNB EQU   ZCRENTER+17                                              01770000
ZCREBC0L EQU   ZCRENTER+17                                              01771000
ZCREBCAL EQU   ZCRENTER+17                                              01772000
ZCREDCQR EQU   ZCRENTER+17                                              01773000
ZCREDCPR EQU   ZCRENTER+16                                              01774000
ZCREBCSB EQU   ZCRENTER+16                                              01775000
ZCREAC1R EQU   ZCRENTER+16                                              01776000
ZCRECCCI EQU   ZCRENTER+16                                              01777000
ZCRECCAI EQU   ZCRENTER+16                                              01778000
ZCRECCBI EQU   ZCRENTER+16                                              01779000
ZCREBCAR EQU   ZCRENTER+16                                              01780000
ZCREBCDR EQU   ZCRENTER+16                                              01781000
ZCREBCBR EQU   ZCRENTER+15                                              01782000
ZCREDCXR EQU   ZCRENTER+15                                              01783000
ZCREDCWB EQU   ZCRENTER+15                                              01784000
ZCREDCWR EQU   ZCRENTER+15                                              01785000
ZCREKCCN EQU   ZCRENTER+15                                              01786000
ZCREKCBN EQU   ZCRENTER+15                                              01787000
ZCREKCBB EQU   ZCRENTER+15                                              01788000
ZCREJC0B EQU   ZCRENTER+15                                              01789000
ZCREJCDB EQU   ZCRENTER+14                                              01790000
ZCREJCBB EQU   ZCRENTER+14                                              01791000
ZCREJCAB EQU   ZCRENTER+14                                              01792000
ZCREIC1B EQU   ZCRENTER+14                                              01793000
ZCREIC0B EQU   ZCRENTER+14                                              01794000
ZCREICX0 EQU   ZCRENTER+14                                              01795000
ZCREICWB EQU   ZCRENTER+14                                              01796000
ZCREICVB EQU   ZCRENTER+13                                              01797000
ZCREICUB EQU   ZCRENTER+13                                              01798000
ZCREICTB EQU   ZCRENTER+13                                              01799000
ZCREICSC EQU   ZCRENTER+13                                              01800000
ZCREICSB EQU   ZCRENTER+13                                              01801000
ZCREICRB EQU   ZCRENTER+13                                              01802000
ZCREICQB EQU   ZCRENTER+13                                              01803000
ZCREICQA EQU   ZCRENTER+13                                              01804000
ZCREICOB EQU   ZCRENTER+12                                              01805000
ZCREICOA EQU   ZCRENTER+12                                              01806000
ZCREICNB EQU   ZCRENTER+12                                              01807000
ZCREICNA EQU   ZCRENTER+12                                              01808000
ZCREICMB EQU   ZCRENTER+12                                              01809000
ZCREICLB EQU   ZCRENTER+12                                              01810000
ZCREICKG EQU   ZCRENTER+12                                              01811000
ZCREICKE EQU   ZCRENTER+12                                              01812000
ZCREICKB EQU   ZCRENTER+11                                              01813000
ZCREICJB EQU   ZCRENTER+11                                              01814000
ZCREICID EQU   ZCRENTER+11                                              01815000
ZCREICIB EQU   ZCRENTER+11                                              01816000
ZCREICHB EQU   ZCRENTER+11                                              01817000
ZCREICGB EQU   ZCRENTER+11                                              01818000
ZCREICEB EQU   ZCRENTER+11                                              01819000
ZCREICDB EQU   ZCRENTER+11                                              01820000
ZCREICCI EQU   ZCRENTER+10                                              01821000
ZCREICCB EQU   ZCRENTER+10                                              01822000
ZCREICBI EQU   ZCRENTER+10                                              01823000
ZCREICBB EQU   ZCRENTER+10                                              01824000
ZCREICAB EQU   ZCRENTER+10                                              01825000
ZCREICAA EQU   ZCRENTER+10                                              01826000
ZCREHCAN EQU   ZCRENTER+10                                              01827000
ZCREGC0B EQU   ZCRENTER+10                                              01828000
ZCREGC0A EQU   ZCRENTER+9                                               01829000
ZCREGCLA EQU   ZCRENTER+9                                               01830000
ZCREGCEB EQU   ZCRENTER+9                                               01831000
ZCREGCDB EQU   ZCRENTER+9                                               01832000
@NM00034 EQU   ZCRENTER+9                                               01833000
ZCREGCBB EQU   ZCRENTER+9                                               01834000
ZCREGCAB EQU   ZCRENTER+9                                               01835000
ZCREFCEB EQU   ZCRENTER+9                                               01836000
ZCREFCEA EQU   ZCRENTER+8                                               01837000
ZCREECTA EQU   ZCRENTER+8                                               01838000
ZCREECEA EQU   ZCRENTER+8                                               01839000
ZCREECDA EQU   ZCRENTER+8                                               01840000
ZCREECCB EQU   ZCRENTER+8                                               01841000
ZCREECCA EQU   ZCRENTER+8                                               01842000
ZCREECBB EQU   ZCRENTER+8                                               01843000
ZCREECBA EQU   ZCRENTER+8                                               01844000
ZCREDCMB EQU   ZCRENTER+7                                               01845000
ZCREDCL0 EQU   ZCRENTER+7                                               01846000
ZCREDCKB EQU   ZCRENTER+7                                               01847000
ZCREDCKA EQU   ZCRENTER+7                                               01848000
ZCREDCJ0 EQU   ZCRENTER+7                                               01849000
ZCREDCI0 EQU   ZCRENTER+7                                               01850000
ZCREDCH0 EQU   ZCRENTER+7                                               01851000
ZCREDCF0 EQU   ZCRENTER+7                                               01852000
ZCREDCE0 EQU   ZCRENTER+6                                               01853000
ZCREDCD0 EQU   ZCRENTER+6                                               01854000
ZCREDCC0 EQU   ZCRENTER+6                                               01855000
ZCREDCB0 EQU   ZCRENTER+6                                               01856000
ZCREDCA0 EQU   ZCRENTER+6                                               01857000
ZCRECC2B EQU   ZCRENTER+6                                               01858000
ZCRECC1B EQU   ZCRENTER+6                                               01859000
ZCRECC1A EQU   ZCRENTER+6                                               01860000
ZCRECC0B EQU   ZCRENTER+5                                               01861000
ZCRECC0A EQU   ZCRENTER+5                                               01862000
ZCREBC0B EQU   ZCRENTER+5                                               01863000
ZCREBC0A EQU   ZCRENTER+5                                               01864000
ZCREBCZ0 EQU   ZCRENTER+5                                               01865000
ZCREBCY0 EQU   ZCRENTER+5                                               01866000
ZCREBCX0 EQU   ZCRENTER+5                                               01867000
ZCREBCXA EQU   ZCRENTER+5                                               01868000
ZCREBCSC EQU   ZCRENTER+4                                               01869000
ZCREBCRB EQU   ZCRENTER+4                                               01870000
ZCREBCRA EQU   ZCRENTER+4                                               01871000
ZCREBCQB EQU   ZCRENTER+4                                               01872000
ZCREBCPB EQU   ZCRENTER+4                                               01873000
ZCREBCOB EQU   ZCRENTER+4                                               01874000
ZCREBCNE EQU   ZCRENTER+4                                               01875000
ZCREBCND EQU   ZCRENTER+4                                               01876000
ZCREBCMB EQU   ZCRENTER+3                                               01877000
ZCREBCLB EQU   ZCRENTER+3                                               01878000
ZCREBCLA EQU   ZCRENTER+3                                               01879000
ZCREBCKB EQU   ZCRENTER+3                                               01880000
ZCREBCKA EQU   ZCRENTER+3                                               01881000
ZCREBCJB EQU   ZCRENTER+3                                               01882000
ZCREBCJA EQU   ZCRENTER+3                                               01883000
ZCREBCID EQU   ZCRENTER+3                                               01884000
ZCREBCIB EQU   ZCRENTER+2                                               01885000
ZCREBCIA EQU   ZCRENTER+2                                               01886000
ZCREBCHB EQU   ZCRENTER+2                                               01887000
ZCREBCHA EQU   ZCRENTER+2                                               01888000
ZCREBCGB EQU   ZCRENTER+2                                               01889000
ZCREBCGA EQU   ZCRENTER+2                                               01890000
ZCREBCFB EQU   ZCRENTER+2                                               01891000
ZCREBCFA EQU   ZCRENTER+2                                               01892000
ZCREBCEB EQU   ZCRENTER+1                                               01893000
ZCREBCDI EQU   ZCRENTER+1                                               01894000
ZCREBCCB EQU   ZCRENTER+1                                               01895000
ZCREBCBI EQU   ZCRENTER+1                                               01896000
ZCREBCBB EQU   ZCRENTER+1                                               01897000
ZCREBCBA EQU   ZCRENTER+1                                               01898000
ZCREBCAM EQU   ZCRENTER+1                                               01899000
ZCREBCAI EQU   ZCRENTER+1                                               01900000
ZCREBCAG EQU   ZCRENTER                                                 01901000
ZCREBCAE EQU   ZCRENTER                                                 01902000
ZCREBCAB EQU   ZCRENTER                                                 01903000
ZCREBCAA EQU   ZCRENTER                                                 01904000
ZCREAC1B EQU   ZCRENTER                                                 01905000
ZCREAC0B EQU   ZCRENTER                                                 01906000
ZCREAC0A EQU   ZCRENTER                                                 01907000
ZCREAC1A EQU   ZCRENTER                                                 01908000
ZCRTNAME EQU   ZCRAUDIT+1                                               01909000
ZCRTID   EQU   ZCRAUDIT                                                 01910000
ZCRREMIC EQU   ISTZCRR+436                                              01911000
ZCRSAVEZ EQU   ISTZCRR+196                                              01912000
ZCRDAFSV EQU   ZCRCIDSV+2                                               01913000
ZCRSAFSV EQU   ZCRCIDSV                                                 01914000
ZCRR13SV EQU   ISTZCRR+188                                              01915000
ZCRR2SV  EQU   ISTZCRR+184                                              01916000
ZCROPCDE EQU   ISTZCRR+183                                              01917000
ZCRPRMTC EQU   ISTZCRR+182                                              01918000
ZCRRCDSV EQU   ISTZCRR+181                                              01919000
ZCRAWQSW EQU   ISTZCRR+180                                              01920000
ZCRTOPQ  EQU   ISTZCRR+180                                              01921000
ZCRLSTFB EQU   ISTZCRR+180                                              01922000
ZCRXSCHD EQU   ISTZCRR+180                                              01923000
ZCRNXTEL EQU   ISTZCRR+180                                              01924000
ZCRSCANQ EQU   ISTZCRR+180                                              01925000
ZCRMOREL EQU   ISTZCRR+180                                              01926000
ZCRFBPRC EQU   ISTZCRR+180                                              01927000
ZCRFSBSV EQU   ISTZCRR+176                                              01928000
ZCRSVWK5 EQU   ZCRWKARA+16                                              01929000
ZCRSVWK4 EQU   ZCRWKARA+12                                              01930000
ZCRSVWK3 EQU   ZCRWKARA+8                                               01931000
ZCRSVWK2 EQU   ZCRWKARA+4                                               01932000
ZCRSVWK1 EQU   ZCRWKARA                                                 01933000
ZCRSVF25 EQU   ZCRSVRTN+96                                              01934000
ZCRSVF24 EQU   ZCRSVRTN+92                                              01935000
ZCRSVF23 EQU   ZCRSVRTN+88                                              01936000
ZCRSVF22 EQU   ZCRSVRTN+84                                              01937000
ZCRSVF21 EQU   ZCRSVRTN+80                                              01938000
ZCRSVF20 EQU   ZCRSVRTN+76                                              01939000
ZCRSVF19 EQU   ZCRSVRTN+72                                              01940000
ZCRSVF18 EQU   ZCRSVRTN+68                                              01941000
ZCRSVF17 EQU   ZCRSVRTN+64                                              01942000
ZCRSVF16 EQU   ZCRSVRTN+60                                              01943000
ZCRSVF15 EQU   ZCRSVRTN+56                                              01944000
ZCRSVF14 EQU   ZCRSVRTN+52                                              01945000
ZCRSVF13 EQU   ZCRSVRTN+48                                              01946000
ZCRSVF12 EQU   ZCRSVRTN+44                                              01947000
ZCRSVF11 EQU   ZCRSVRTN+40                                              01948000
ZCRSVF10 EQU   ZCRSVRTN+36                                              01949000
ZCRSVF9  EQU   ZCRSVRTN+32                                              01950000
ZCRSVF8  EQU   ZCRSVRTN+28                                              01951000
ZCRSVF7  EQU   ZCRSVRTN+24                                              01952000
ZCRSVF6  EQU   ZCRSVRTN+20                                              01953000
ZCRSVF5  EQU   ZCRSVRTN+16                                              01954000
ZCRSVF4  EQU   ZCRSVRTN+12                                              01955000
ZCRSVF3  EQU   ZCRSVRTN+8                                               01956000
ZCRSVF2  EQU   ZCRSVRTN+4                                               01957000
ZCRSVF1  EQU   ZCRSVRTN                                                 01958000
ZCRPVZB  EQU   ISTZCRR+52                                               01959000
ZCRZLB   EQU   ISTZCRR+48                                               01960000
ZCRBFPTR EQU   ISTZCRR+44                                               01961000
ZCRCCWA  EQU   ISTZCRR+40                                               01962000
ZCRPSW   EQU   ZCRPARMS+15                                              01963000
ZCRPCHAR EQU   ZCRPARMS+14                                              01964000
ZCRPRES2 EQU   ZCRPCOD2                                                 01965000
ZCRPMFGF EQU   ZCRPCOD2                                                 01966000
ZCRPFHDR EQU   ZCRPCOD2                                                 01967000
ZCRPPG2  EQU   ZCRPCOD2                                                 01968000
ZCRPRES  EQU   ZCRPCOD1                                                 01969000
ZCRPCFTX EQU   ZCRPCOD1                                                 01970000
ZCRPBUF  EQU   ZCRPCOD1                                                 01971000
ZCRPLSCB EQU   ZCRPCOD1                                                 01972000
ZCRPLSBQ EQU   ZCRPLSBF                                                 01973000
ZCRPFSB  EQU   ZCRPCOD1                                                 01974000
ZCRPLNG  EQU   ZCRPCOD1                                                 01975000
ZCRPPG   EQU   ZCRPCOD1                                                 01976000
ZCRDTODA EQU   ZCRDFRDA                                                 01977000
ZCRMLNG  EQU   ZCRPARMS+8                                               01978000
ZCRTBPTR EQU   ZCRPARMS+4                                               01979000
ZCRCBPTR EQU   ZCRFBPTR                                                 01980000
ZCRCRLCP EQU   ISTZCRR+20                                               01981000
@NM00033 EQU   ZCRSCPSW                                                 01982000
ZCRSKIPT EQU   ZCRSCPSW                                                 01983000
ZCRFSBWE EQU   ZCRSCPSW                                                 01984000
ZCRPRCMP EQU   ZCRSCPSW                                                 01985000
ZCRLREQ  EQU   ZCRSCPSW                                                 01986000
ZCRRJLCP EQU   ZCRSCPSW                                                 01987000
ZCRTPINV EQU   ZCRSCPSW                                                 01988000
ZCRTPEX  EQU   ZCRSCPSW                                                 01989000
@NM00032 EQU   ZCRIBPR                                                  01990000
ZCR3270R EQU   ZCRIBPR                                                  01991000
ZCR3270  EQU   ZCRIBPR                                                  01992000
ZCRLCPFD EQU   ZCRIBPR                                                  01993000
ZCRLCPFR EQU   ZCRIBPR                                                  01994000
ZCRRELK  EQU   ZCRIBPR                                                  01995000
ZCRERR   EQU   ZCRIBPR                                                  01996000
ZCRNOBUF EQU   ZCRIBPR                                                  01997000
@NM00031 EQU   ZCRPFLGS                                                 01998000
ZCRQAHED EQU   ZCRPFLGS                                                 01999000
ZCRF1RES EQU   ZCRGENSW                                                 02000000
ZCRBRIS  EQU   ZCRGENSW                                                 02001000
ZCRCLRBD EQU   ZCRGENSW                                                 02002000
ZCREXRES EQU   ZCRGENSW                                                 02003000
ZCRLCSYN EQU   ZCRGENSW                                                 02004000
ZCRRT06  EQU   ZCRGENSW                                                 02005000
ZCRTSW2  EQU   ZCRGENSW                                                 02006000
ZCRTSW1  EQU   ZCRGENSW                                                 02007000
ZCRINLCP EQU   ZCRFLGS3                                                 02008000
ZCRWRPTR EQU   ZCRFLGS3                                                 02009000
ZCRNOFRE EQU   ZCRFLGS3                                                 02010000
ZCREDRIV EQU   ZCRFLGS3                                                 02011000
ZCRDISC  EQU   ZCRFLGS3                                                 02012000
ZCRTPDIS EQU   ZCRFLGS3                                                 02013000
ZCRTPCON EQU   ZCRFLGS3                                                 02014000
ZCRTIC   EQU   ZCRFLGS3                                                 02015000
ZCRCNLXL EQU   ZCRRESET                                                 02016000
ZCRENDAN EQU   ZCRSWFLD                                                 02017000
ZCRENDXL EQU   ZCRSWFLD                                                 02018000
ZCRENDX  EQU   ZCRSWFLD                                                 02019000
ZCROB1   EQU   ZCRNDLCP                                                 02020000
ZCRENDPR EQU   ZCRSWFLD                                                 02021000
ZCREXTYP EQU   ZCRSWFLD                                                 02022000
ZCRSLCP  EQU   ZCRENDSH                                                 02023000
ZCRIF0E3 EQU   ZCRFLGS2                                                 02024000
ZCRIF0E2 EQU   ZCRFLGS2                                                 02025000
ZCRIF0E1 EQU   ZCRFLGS2                                                 02026000
ZCROB    EQU   ZCRFLGS2                                                 02027000
ZCRFMSED EQU   ZCRFLGS2                                                 02028000
ZCRSHEDI EQU   ZCRFLGS2                                                 02029000
ZCRLOCAL EQU   ZCRFLGS2                                                 02030000
ZCRFEXIT EQU   ZCRFLGS1                                                 02031000
ZCRUNSOL EQU   ZCRFLGS1                                                 02032000
ZCRENDLP EQU   ZCRFLGS1                                                 02033000
ZCRNRMEX EQU   ZCRFLGS1                                                 02034000
ZCRWAIT  EQU   ZCRFLGS1                                                 02035000
ZCRDEQSW EQU   ZCRFLGS1                                                 02036000
ZCRQUESW EQU   ZCRFLGS1                                                 02037000
ZCREXSW  EQU   ZCRFLGS1                                                 02038000
ZCRFRRA  EQU   ISTZCRR+8                                                02039000
ZCRCHAIN EQU   ISTZCRR+4                                                02040000
ZCRFLAG  EQU   ZCRCRR+3                                                 02041000
ZCRLEN   EQU   ZCRCRR+1                                                 02042000
ZCRID    EQU   ZCRCRR                                                   02043000
LCPFTYPE EQU   LCPRPHA                                                  02044000
LCPRSTQH EQU   LCPLCCW                                                  02045000
LCPCLREP EQU   ISTLCPB+44                                               02046000
LCPUBFSB EQU   LCPFLCCW                                                 02047000
LCPRSV77 EQU   ISTLCPB+39                                               02048000
LCPLCCWC EQU   ISTLCPB+38                                               02049000
LCPRSV78 EQU   LCPFLG1                                                  02050000
LCPTRANS EQU   LCPFLG1                                                  02051000
LCPSTLB  EQU   LCPFLG1                                                  02052000
LCPREDRV EQU   LCPFLG1                                                  02053000
LCPDIRPT EQU   LCPFLG1                                                  02054000
LCPINTER EQU   LCPFLG1                                                  02055000
LCPRESET EQU   LCPFLG1                                                  02056000
LCPSTYPE EQU   ISTLCPB+36                                               02057000
LCPFSNCH EQU   ISTLCPB+34                                               02058000
LCPFOSN  EQU   ISTLCPB+32                                               02059000
LCPTLBAD EQU   ISTLCPB+28                                               02060000
LCPFDB2  EQU   LCPFDBA+1                                                02061000
LCPFDB1  EQU   LCPFDBA                                                  02062000
LCPNXLCW EQU   ISTLCPB+20                                               02063000
LCPDAF   EQU   LCPCID+2                                                 02064000
LCPSAF   EQU   LCPCID                                                   02065000
LCPLCCW1 EQU   ISTLCPB+12                                               02066000
LCPRRCNT EQU   LCPSEQ+1                                                 02067000
LCPRRCCT EQU   LCPSEQ                                                   02068000
LCPATOP  EQU   LCPFLAG2                                                 02069000
LCPFREE  EQU   LCPFLAG2                                                 02070000
LCPDSTAT EQU   LCPFLAG2                                                 02071000
LCPEXRES EQU   LCPFID0                                                  02072000
LCPZRIMM EQU   LCPTLBPI                                                 02073000
LCPRSTRT EQU   LCPFLAG2                                                 02074000
LCPASYN  EQU   LCPFLAG2                                                 02075000
LCPPRFLG EQU   LCPFLAG2                                                 02076000
LCPZMIRC EQU   LCPRUCNT                                                 02077000
LCPCHAI2 EQU   LCPCHAIN+1                                               02078000
LCPCHNG  EQU   LCPCHAI1                                                 02079000
LCPZRT0B EQU   LCPMNRCD                                                 02080000
LCPZRT0A EQU   LCPMNRCD                                                 02081000
LCPZRTL9 EQU   LCPZRT09                                                 02082000
LCPZRTL8 EQU   LCPZRT08                                                 02083000
LCPZRTL7 EQU   LCPZRT07                                                 02084000
LCPZRTL6 EQU   LCPZRT06                                                 02085000
LCPZRTL5 EQU   LCPZRT05                                                 02086000
LCPZRTL4 EQU   LCPZRT04                                                 02087000
LCPZRTL3 EQU   LCPZRT03                                                 02088000
LCPZRTL2 EQU   LCPZRT02                                                 02089000
LCPZRT01 EQU   LCPFLAGS                                                 02090000
LCPZRT00 EQU   LCPFLAGS                                                 02091000
LCPLNGTH EQU   ISTLCPB+1                                                02092000
LCPTYPE  EQU   ISTLCPB                                                  02093000
LCCWDATA EQU   ISTLCCW+4                                                02094000
LCCWCNT  EQU   ISTLCCW+2                                                02095000
LCCWACI  EQU   LCCWFLAG                                                 02096000
LCCWRFI  EQU   LCCWFLAG                                                 02097000
LCCWPER  EQU   LCCWLSI                                                  02098000
LCCWIDAT EQU   LCCWFLAG                                                 02099000
LCCWNTVC EQU   LCCWFLAG                                                 02100000
LCCWCKPT EQU   LCCWFLAG                                                 02101000
LCCWCC   EQU   LCCWFLAG                                                 02102000
LCCWCD   EQU   LCCWFLAG                                                 02103000
LCCWTYPE EQU   LCCWCTL                                                  02104000
LCCWMODE EQU   LCCWCTL                                                  02105000
LCCWSOP  EQU   LCCWRWOP                                                 02106000
@NM00030 EQU   LCCWRWOP                                                 02107000
LCCWSD   EQU   LCCWOP                                                   02108000
LCCWSI   EQU   LCCWOP                                                   02109000
FMCFLRSV EQU   FMCFLGB                                                  02110000
FMCFLGA8 EQU   FMCFLGB                                                  02111000
FMCCLRPH EQU   FMCVS1+45                                                02112000
FMCRSV0X EQU   FMCCVFLG                                                 02113000
FMCVYRPH EQU   FMCCVFLG                                                 02114000
FMCZV004 EQU   FMCVS1+40                                                02115000
FMCLOCK2 EQU   FMCVS1+36                                                02116000
@NM00029 EQU   FMCZFLG2                                                 02117000
FMCZF027 EQU   FMCZFLG2                                                 02118000
FMCZF026 EQU   FMCZFLG2                                                 02119000
FMCSEQ1B EQU   FMCSEQ1                                                  02120000
FMCSEQ1T EQU   FMCSEQ1                                                  02121000
FMCZX006 EQU   FMCVS1+33                                                02122000
FMCZX005 EQU   FMCVS1+32                                                02123000
FMCZX004 EQU   FMCVS1+31                                                02124000
FMCZX003 EQU   FMCVS1+30                                                02125000
FMCZX002 EQU   FMCVS1+29                                                02126000
FMCZX001 EQU   FMCVS1+28                                                02127000
FMCZV001 EQU   FMCVS1+24                                                02128000
FMCAWATQ EQU   FMCLCPAQ+1                                               02129000
@NM00028 EQU   FMCLCPAQ                                                 02130000
FMCLCPB2 EQU   FMCLCPBQ+1                                               02131000
FMCLCPB1 EQU   FMCLCPBQ                                                 02132000
FMCASCDQ EQU   FMCSHEAQ+1                                               02133000
@NM00027 EQU   FMCSHEAQ                                                 02134000
FMCSHEDQ EQU   FMCVS1+8                                                 02135000
FMCRSV04 EQU   FMCVS1+6                                                 02136000
FMCZF025 EQU   FMCZFLAG+3                                               02137000
FMCZF024 EQU   FMCZFLAG+3                                               02138000
FMCZF023 EQU   FMCZFLAG+3                                               02139000
FMCZF022 EQU   FMCZFLAG+3                                               02140000
FMCZF021 EQU   FMCZFLAG+3                                               02141000
FMCZF020 EQU   FMCZFLAG+3                                               02142000
FMCZF019 EQU   FMCZFLAG+3                                               02143000
FMCZF018 EQU   FMCZFLAG+3                                               02144000
FMCZF017 EQU   FMCZFLAG+2                                               02145000
FMCZF016 EQU   FMCZFLAG+2                                               02146000
FMCZF015 EQU   FMCZFLAG+2                                               02147000
FMCZF014 EQU   FMCZFLAG+2                                               02148000
FMCZF013 EQU   FMCZFLAG+2                                               02149000
FMCZF012 EQU   FMCZFLAG+2                                               02150000
FMCZF011 EQU   FMCZFLAG+2                                               02151000
FMCZF010 EQU   FMCZFLAG+2                                               02152000
FMCZF00F EQU   FMCZFLAG+1                                               02153000
FMCZF00E EQU   FMCZFLAG+1                                               02154000
FMCZF00D EQU   FMCZFLAG+1                                               02155000
FMCZF00C EQU   FMCZFLAG+1                                               02156000
FMCZF00B EQU   FMCZFLAG+1                                               02157000
FMCRSV10 EQU   FMCZFLAG+1                                               02158000
FMCZF009 EQU   FMCZFLAG+1                                               02159000
FMCZFD06 EQU   FMCZF006+1                                               02160000
FMCZFC06 EQU   FMCZF006                                                 02161000
FMCZFB06 EQU   FMCZF006                                                 02162000
FMCZFA06 EQU   FMCZF006                                                 02163000
FMCZF005 EQU   FMCZFLAG                                                 02164000
FMCZF004 EQU   FMCZFLAG                                                 02165000
FMCZF003 EQU   FMCZFLAG                                                 02166000
FMCZF002 EQU   FMCZFLAG                                                 02167000
FMCZF001 EQU   FMCZFLAG                                                 02168000
FMCFRESA EQU   ISTFMCB+228                                              02169000
FMCSCSQN EQU   FMCSNCTL+2                                               02170000
FMCSCCTL EQU   FMCSNCTL+1                                               02171000
FMCSTCTL EQU   FMCSCFLG                                                 02172000
FMCSCCLO EQU   FMCSCFLG                                                 02173000
FMCAPRO  EQU   FMCSCFLG                                                 02174000
FMCLURO  EQU   FMCSCFLG                                                 02175000
FMCOBSAC EQU   FMCSCFLG                                                 02176000
FMCIBSAC EQU   FMCSCFLG                                                 02177000
FMCFBRE  EQU   ISTFMCB+220                                              02178000
FMCFBXM  EQU   FMCZV002                                                 02179000
FMCASEGQ EQU   ISTFMCB+212                                              02180000
FMCRDTPT EQU   ISTFMCB+208                                              02181000
FMCLOCK  EQU   ISTFMCB+204                                              02182000
FMCSEGD  EQU   FMCSSEGQ                                                 02183000
FMCRSPLM EQU   ISTFMCB+198                                              02184000
FMCPSTRS EQU   ISTFMCB+196                                              02185000
@NM00026 EQU   FMCRRESP                                                 02186000
FMCTSLHA EQU   FMCRRESP                                                 02187000
FMCFRRN  EQU   FMCRRESP                                                 02188000
FMCFME   EQU   FMCRRESP                                                 02189000
FMCFEX   EQU   FMCRRESP                                                 02190000
FMCFPE   EQU   FMCRRESP                                                 02191000
FMCCTLB  EQU   ISTFMCB+194                                              02192000
FMCBSQNO EQU   FMCCLSEQ+2                                               02193000
FMCTSQNO EQU   FMCCLSEQ                                                 02194000
FMCOBPRG EQU   FMCMODEB                                                 02195000
FMCIBPRG EQU   FMCMODEB                                                 02196000
FMCRESOT EQU   FMCMODEB                                                 02197000
FMCRSTSR EQU   FMCMODEB                                                 02198000
FMCLUQ   EQU   FMCMODEB                                                 02199000
FMCAPQ   EQU   FMCMODEB                                                 02200000
FMCCLEAR EQU   FMCMODEB                                                 02201000
FMCHOLD  EQU   FMCMODEB                                                 02202000
FMCIPSEQ EQU   ISTFMCB+188                                              02203000
FMCLUSTR EQU   ISTFMCB+187                                              02204000
FMCRSV87 EQU   FMCSTAT2                                                 02205000
FMCSEQI  EQU   FMCSTAT2                                                 02206000
FMCCPIP  EQU   FMCSTAT2                                                 02207000
FMCALIPR EQU   FMCSTAT2                                                 02208000
FMCIAIO  EQU   FMCSTAT2                                                 02209000
FMCZF00A EQU   FMCSTAT2                                                 02210000
FMCVPIP  EQU   FMCSTAT2                                                 02211000
FMCBHSET EQU   ISTFMCB+185                                              02212000
FMCPRMRC EQU   FMCCLEXT+20                                              02213000
FMCRSV89 EQU   FMCPSTAT                                                 02214000
FMCPCLSD EQU   FMCPSTAT                                                 02215000
FMCDDOCD EQU   FMCPSTAT                                                 02216000
FMCIDVFD EQU   FMCPSTAT                                                 02217000
FMCELKST EQU   FMCPSTAT                                                 02218000
FMCRSV88 EQU   FMCPSCMD                                                 02219000
FMCRDBLK EQU   FMCPSCMD                                                 02220000
FMCDSEOC EQU   FMCPSCMD                                                 02221000
FMCPURGE EQU   FMCPSCMD                                                 02222000
FMCRESTI EQU   FMCPSCMD                                                 02223000
FMCCNTCT EQU   FMCPSCMD                                                 02224000
FMCINVT  EQU   FMCPSCMD                                                 02225000
FMCFLGB7 EQU   FMCFLGCL                                                 02226000
FMCFLGB6 EQU   FMCFLGCL                                                 02227000
FMCFLGB5 EQU   FMCFLGCL                                                 02228000
FMCFLGB4 EQU   FMCFLGCL                                                 02229000
FMCFLGB3 EQU   FMCFLGCL                                                 02230000
FMCFLGB2 EQU   FMCFLGCL                                                 02231000
FMCFLGB1 EQU   FMCFLGCL                                                 02232000
FMCFLGB0 EQU   FMCFLGCL                                                 02233000
FMCFLGA7 EQU   FMCFLGA                                                  02234000
FMCFLGA6 EQU   FMCFLGA                                                  02235000
FMCFLGA5 EQU   FMCFLGA                                                  02236000
FMCFLGA4 EQU   FMCFLGA                                                  02237000
FMCFLGA3 EQU   FMCFLGA                                                  02238000
FMCFLGA2 EQU   FMCFLGA                                                  02239000
FMCFLGA1 EQU   FMCFLGA                                                  02240000
FMCFLGA0 EQU   FMCFLGA                                                  02241000
FMCDCLOK EQU   FMCCLEXT+12                                              02242000
FMCRAFM  EQU   FMCCLEXT+8                                               02243000
FMCFBPTR EQU   FMCFBA+1                                                 02244000
FMCFBRSV EQU   FMCFBA                                                   02245000
FMCRPLPT EQU   FMCRPLA+1                                                02246000
FMCRPLRS EQU   FMCRPLA                                                  02247000
FMCPRCLS EQU   FMCCVAL                                                  02248000
FMCIBCE  EQU   FMCCVAL                                                  02249000
FMCONLY  EQU   FMCOBCE                                                  02250000
FMCLAST  EQU   FMCOBCE                                                  02251000
FMCMIDLE EQU   FMCOBCE                                                  02252000
FMCFIRST EQU   FMCOBCE                                                  02253000
FMCCPCNT EQU   FMCPACPC                                                 02254000
FMCMPCNT EQU   FMCPACEM                                                 02255000
FMCNPCNT EQU   FMCPACEN                                                 02256000
FMCCONF  EQU   FMCSSTAT                                                 02257000
FMCPURCH EQU   FMCSSTAT                                                 02258000
FMCNSALU EQU   FMCSSTAT                                                 02259000
FMCBIP   EQU   FMCSSTAT                                                 02260000
FMCSDTR  EQU   FMCSSTAT                                                 02261000
FMCUIPI  EQU   FMCSSTAT                                                 02262000
FMCCIPI  EQU   FMCSSTAT                                                 02263000
FMCSNBI  EQU   FMCSSTAT                                                 02264000
FMCRVD01 EQU   ISTFMCB+158                                              02265000
FMCISSN  EQU   ISTFMCB+156                                              02266000
FMCOASN  EQU   FMCNXOSC                                                 02267000
FMCOSSN  EQU   FMCNXCFM                                                 02268000
FMCSIP   EQU   FMCSIPA                                                  02269000
FMCEXLST EQU   ISTFMCB+144                                              02270000
FMCPAB5  EQU   ISTFMCB+128                                              02271000
FMCPAB4  EQU   ISTFMCB+112                                              02272000
FMCPAB3  EQU   ISTFMCB+96                                               02273000
FMCPAB2  EQU   ISTFMCB+80                                               02274000
FMCPAB1  EQU   ISTFMCB+64                                               02275000
FMCFASYA EQU   ISTFMCB+60                                               02276000
FMCMODE  EQU   ISTFMCB+52                                               02277000
FMCPROCD EQU   ISTFMCB+48                                               02278000
FMCVWT   EQU   ISTFMCB+44                                               02279000
FMCRPLH  EQU   ISTFMCB+40                                               02280000
FMCBUFNB EQU   FMCCMPS1+2                                               02281000
FMCBUFLM EQU   FMCCMPS1                                                 02282000
FMCDEBA  EQU   ISTFMCB+32                                               02283000
@NM00025 EQU   FMCCMDFL                                                 02284000
FMCSNA   EQU   FMCCMDFL                                                 02285000
FMCVSNA  EQU   FMCCMDFL                                                 02286000
FMCCMDR  EQU   FMCCMDFL                                                 02287000
@NM00024 EQU   ISTFMCB+30                                               02288000
@NM00023 EQU   FMCSTAT1                                                 02289000
FMCHPURG EQU   FMCSTAT1                                                 02290000
FMCVSP2  EQU   FMCSTAT1                                                 02291000
FMCVSP1  EQU   FMCSTAT                                                  02292000
FMCLTEAS EQU   FMCSTAT                                                  02293000
FMCZF007 EQU   FMCSTAT                                                  02294000
FMCDEDSC EQU   FMCSTAT                                                  02295000
FMCDEVOF EQU   FMCSTAT                                                  02296000
FMCDAPT  EQU   FMCSTAT                                                  02297000
FMCPRMTE EQU   FMCSTAT                                                  02298000
FMCPRMTR EQU   FMCSTAT                                                  02299000
FMCUSFLD EQU   ISTFMCB+24                                               02300000
FMCFMCBA EQU   ISTFMCB+20                                               02301000
FMCDNCBA EQU   ISTFMCB+16                                               02302000
FMCDVTA  EQU   ISTFMCB+12                                               02303000
FMCTSKID EQU   ISTFMCB+8                                                02304000
FMCNXTCB EQU   ISTFMCB+4                                                02305000
FMCSAF   EQU   ISTFMCB+2                                                02306000
FMCLNGTH EQU   ISTFMCB+1                                                02307000
FMCTYPE  EQU   ISTFMCB                                                  02308000
DEVRSV03 EQU   ISTDEVCH+5                                               02309000
DEVPHYSA EQU   ISTDEVCH+4                                               02310000
DEVCSLPN EQU   DEVCHAR3                                                 02311000
DEVCSTCL EQU   DEVCHAR3                                                 02312000
DEVCCHEK EQU   DEVCHAR3                                                 02313000
DEVCATTN EQU   DEVCHAR3                                                 02314000
DEVCSWL  EQU   DEVFCCTL                                                 02315000
DEVCRVB  EQU   DEVFCCTL                                                 02316000
DEVCSSL  EQU   DEVFCCTL                                                 02317000
DEVCBSC  EQU   DEVFCCTL                                                 02318000
DEVMCODE EQU   ISTDEVCH+2                                               02319000
DEVCHAR2 EQU   DEVTCODE                                                 02320000
DEVRSV01 EQU   DEVCHAR                                                  02321000
DEVCCTL  EQU   DEVCHAR                                                  02322000
DEVNNSPT EQU   DEVCHAR                                                  02323000
DEVSPS   EQU   DEVCHAR                                                  02324000
DEVSUBND EQU   DEVCHAR                                                  02325000
DEVCONVR EQU   DEVCHAR                                                  02326000
DEVOTPUT EQU   DEVCHAR                                                  02327000
DEVINPUT EQU   DEVCHAR                                                  02328000
PROSRDEF EQU   PROSETM4                                                 02329000
PRORSV47 EQU   PROSETM4                                                 02330000
PROSCON  EQU   PROSETM4                                                 02331000
PRORSV46 EQU   PROSETM3                                                 02332000
PROSMONT EQU   PROSETM3                                                 02333000
PRORSV45 EQU   PROSETM3                                                 02334000
PROSNTO  EQU   PROSETM3                                                 02335000
PRORSV44 EQU   PROSETM3                                                 02336000
PRORSV43 EQU   PROSETM2                                                 02337000
PROSNTFL EQU   PROSETM2                                                 02338000
PRORSV42 EQU   PROSETM2                                                 02339000
PRORSV41 EQU   PROPROCS                                                 02340000
PROMODC  EQU   PROPROC4                                                 02341000
PROMODT  EQU   PROPROC4                                                 02342000
PROMODM  EQU   PROPROC4                                                 02343000
PROMODB  EQU   PROPROC4                                                 02344000
PRORSV14 EQU   PROPROC4                                                 02345000
PRORSV13 EQU   PROPROC4                                                 02346000
PRORSV12 EQU   PROPROC4                                                 02347000
PROEIB   EQU   PROPROC4                                                 02348000
PRORSV11 EQU   PROPROC3                                                 02349000
PROMONT2 EQU   PROPROC3                                                 02350000
PROMONIT EQU   PROPROC3                                                 02351000
PROSUBLK EQU   PROPROC3                                                 02352000
PRONTO   EQU   PROPROC3                                                 02353000
PROLGIN  EQU   PROPROC3                                                 02354000
PROERPI  EQU   PROPROC3                                                 02355000
PRORSV07 EQU   PROPROC3                                                 02356000
PROCFTX  EQU   PROPROC2                                                 02357000
PROEMLC  EQU   PROPROC2                                                 02358000
PRONTFL  EQU   PROPROC2                                                 02359000
PRORSV05 EQU   PROPROC2                                                 02360000
PRORSV04 EQU   PROPROC2                                                 02361000
PROLGOT  EQU   PROPROC2                                                 02362000
PROERPO  EQU   PROPROC2                                                 02363000
PRORSV03 EQU   PROPROC2                                                 02364000
PRORPLC  EQU   PROPROC1                                                 02365000
PROCS    EQU   PROPROC1                                                 02366000
PROCA    EQU   PROPROC1                                                 02367000
PRORESPX EQU   PROPROC1                                                 02368000
PRODFASY EQU   PROPROC1                                                 02369000
PROXPOPT EQU   PROPROC1                                                 02370000
PROTRUNC EQU   PROPROC1                                                 02371000
PROASYIP EQU   PROPROC1                                                 02372000
ZIBLNG1  EQU   ZIBFSM                                                   02373000
ZIBCHAIN EQU   ISTZIBUF                                                 02374000
TH2SNF   EQU   ISTTH2+4                                                 02375000
TH2OAF   EQU   ISTTH2+3                                                 02376000
TH2DAF   EQU   ISTTH2+2                                                 02377000
TH2CDF   EQU   TH2FLAG1+1                                               02378000
TH2SEF   EQU   TH2FLAG1+1                                               02379000
TH2PYF   EQU   TH2FLAG1+1                                               02380000
TH2AFI   EQU   TH2FLAG1                                                 02381000
TH2PSI   EQU   TH2FLAG1                                                 02382000
TH2CMPLI EQU   TH2MPF                                                   02383000
TH2RHI   EQU   TH2MPF                                                   02384000
TH2FID   EQU   TH2FLAG1                                                 02385000
THDCF    EQU   ISTTH+8                                                  02386000
THSNF    EQU   ISTTH+6                                                  02387000
THOAF    EQU   ISTTH+4                                                  02388000
THDAF    EQU   ISTTH+2                                                  02389000
THCDF    EQU   THFLGB                                                   02390000
THSEF    EQU   THFLGB                                                   02391000
THPYF    EQU   THFLGB                                                   02392000
THAFI    EQU   THFLGA                                                   02393000
THPSI    EQU   THFLGA                                                   02394000
THCMPLI  EQU   THMPF                                                    02395000
THRHI    EQU   THMPF                                                    02396000
THFID    EQU   THFLAG1                                                  02397000
LHVDATA  EQU   ISTLH+4                                                  02398000
LHFUNCT  EQU   ISTLH+3                                                  02399000
@NM00017 EQU   ISTLH+2                                                  02400000
LHLEN    EQU   ISTLH                                                    02401000
BTUTEXT  EQU   ISTBTU+20                                                02402000
BTUEXTR  EQU   ISTBTU+19                                                02403000
BTURSV02 EQU   BTUSYSTR                                                 02404000
BTUPHASE EQU   BTUSYSTR                                                 02405000
BTURSV01 EQU   BTUSYSTR                                                 02406000
BTUBDU   EQU   ISTBTU+14                                                02407000
BTUPAD   EQU   BTURH+3                                                  02408000
BTURH3   EQU   BTURH+2                                                  02409000
BTURH2   EQU   BTURH+1                                                  02410000
BTURH1   EQU   BTURH                                                    02411000
BTUDCF   EQU   BTUBTH+8                                                 02412000
BTUZRTSC EQU   BTURQFLG+1                                               02413000
BTUZRT0B EQU   BTURQFLG+1                                               02414000
BTUZRT0A EQU   BTURQFLG+1                                               02415000
BTUZRT09 EQU   BTURQFLG+1                                               02416000
BTUZRT08 EQU   BTURQFLG+1                                               02417000
BTUZRT07 EQU   BTURQFLG                                                 02418000
BTUZRT06 EQU   BTURQFLG                                                 02419000
BTUZRT05 EQU   BTURQFLG                                                 02420000
BTUZRT04 EQU   BTURQFLG                                                 02421000
BTUZRT03 EQU   BTURQFLG                                                 02422000
BTUZRT02 EQU   BTURQFLG                                                 02423000
BTUZRT01 EQU   BTURQFLG                                                 02424000
BTUZRT00 EQU   BTURQFLG                                                 02425000
BTUSORCE EQU   BTUBTH+4                                                 02426000
BTUDEST  EQU   BTUBTH+2                                                 02427000
BTUCDF   EQU   BTUFID+1                                                 02428000
BTUSCF   EQU   BTUFID+1                                                 02429000
BTUPRY   EQU   BTUFID+1                                                 02430000
BTUASFL  EQU   BTUFID                                                   02431000
BTUPSFL  EQU   BTUFID                                                   02432000
BTUMPF   EQU   BTUFID                                                   02433000
BTUFIDNO EQU   BTUFID                                                   02434000
BDURSV04 EQU   BDUFLAGS                                                 02435000
BDURTOE  EQU   BDUFLAGS                                                 02436000
BDUSTPR  EQU   BDUFLAGS                                                 02437000
BDURSV03 EQU   BDUFLAGS                                                 02438000
BDUALT   EQU   BDUFUNC                                                  02439000
BDUNACK  EQU   BDUFUNC                                                  02440000
BDUACK   EQU   BDUFUNC                                                  02441000
BDUTRPM  EQU   BDUFUNC                                                  02442000
BDUFBMI  EQU   BDUFUNC                                                  02443000
BDULDGPH EQU   BDUFUNC                                                  02444000
BDUHEADP EQU   BDUFUNC                                                  02445000
BDUSOH   EQU   BDUCHECK                                                 02446000
BDURSV01 EQU   BDUMODIF                                                 02447000
BDUMOD0  EQU   BDUMOD1                                                  02448000
BDUCOMND EQU   ISTBDU                                                   02449000
FSBFDB   EQU   ISTFSB+32                                                02450000
FSBRSV01 EQU   FSBFSB+30                                                02451000
FSBTHCNT EQU   FSBFSB+28                                                02452000
FSBRLRSV EQU   FSBRLSTS                                                 02453000
FSBCFTX  EQU   FSBRLSTS                                                 02454000
FSBICNCB EQU   FSBMSGID                                                 02455000
FSBSSOC  EQU   FSBSS2                                                   02456000
FSBSSCC  EQU   FSBSS2                                                   02457000
FSBSSDC  EQU   FSBSS2                                                   02458000
FSBSSEC  EQU   FSBSS2                                                   02459000
FSBSSIR  EQU   FSBSS2                                                   02460000
FSBSSCR  EQU   FSBSS2                                                   02461000
@NM00015 EQU   FSBSS2                                                   02462000
@NM00014 EQU   FSBSS1                                                   02463000
FSBSSDE  EQU   FSBSS1                                                   02464000
FSBSSUS  EQU   FSBSS1                                                   02465000
@NM00013 EQU   FSBSS1                                                   02466000
FSBSOHI  EQU   FSBERC                                                   02467000
FSBLGI   EQU   FSBERC                                                   02468000
FSBLMRI  EQU   FSBFBMI                                                  02469000
FSBETI   EQU   FSBERC                                                   02470000
FSBEMI   EQU   FSBERC                                                   02471000
FSBEBI   EQU   FSBERC                                                   02472000
FSBECI   EQU   FSBERC                                                   02473000
FSBELI   EQU   FSBERC                                                   02474000
FSBXLCI  EQU   FSBXCODE                                                 02475000
FSBXFINS EQU   FSBXCODE                                                 02476000
FSBXNORM EQU   FSBXFSTS                                                 02477000
FSBSCODE EQU   FSBSYSRS                                                 02478000
FSBSPHSE EQU   FSBSYSRS                                                 02479000
FSBSERR  EQU   FSBSYSRS                                                 02480000
FSBCMD   EQU   FSBSEQ                                                   02481000
FSBDTRCE EQU   FSBFLAGS                                                 02482000
FSBASBTU EQU   FSBFLAGS                                                 02483000
FSBINPET EQU   FSBFLAGS                                                 02484000
FSBNONCB EQU   FSBFLAGS                                                 02485000
FSBLBIND EQU   FSBFLAGS                                                 02486000
FSBFFIND EQU   FSBFLAGS                                                 02487000
FSBACIND EQU   FSBFLAGS                                                 02488000
FSBRFIND EQU   FSBFLAGS                                                 02489000
FSBDAF   EQU   FSBCID+2                                                 02490000
FSBSAF   EQU   FSBCID                                                   02491000
FSBGATE  EQU   FSBFSBA                                                  02492000
FSBRSV02 EQU   FSBSFLGS                                                 02493000
FSBPGBUF EQU   FSBSFLGS                                                 02494000
FSBMNSDA EQU   FSBMNRCD                                                 02495000
FSBMNOA  EQU   FSBMNRCD                                                 02496000
FSBMNDIF EQU   FSBMNRCD                                                 02497000
FSBMNEOP EQU   FSBMNRCD                                                 02498000
FSBMNDNU EQU   FSBMNRCD                                                 02499000
FSBMNATN EQU   FSBMNRCD                                                 02500000
FSBMNRVI EQU   FSBMNRCD                                                 02501000
FSBMNELI EQU   FSBMNRCD                                                 02502000
FSBLNGTH EQU   FSBFSB+1                                                 02503000
FSBTYPE  EQU   FSBFSB                                                   02504000
FDBOFSET EQU   ISTFDB+10                                                02505000
FDBDATCT EQU   ISTFDB+8                                                 02506000
FDBDATAA EQU   ISTFDB+4                                                 02507000
FDBFDBA  EQU   ISTFDB                                                   02508000
ATCAOS   EQU   ISTATCVT+1552                                            02509000
ATCVIOPM EQU   ATCAOSM+636                                              02510000
ATCTPMMI EQU   ATCAOSM+632                                              02511000
ATCTPMPB EQU   ATCAOSM+600                                              02512000
ATCRPLCT EQU   ATCAOSM+594                                              02513000
ATCCRACT EQU   ATCAOSM+592                                              02514000
ATCSRBCT EQU   ATCAOSM+590                                              02515000
ATCRSV75 EQU   ATCAOSM+589                                              02516000
ATCRSV66 EQU   ATCZFLAG                                                 02517000
ATCZF001 EQU   ATCZFLAG                                                 02518000
ATCTPCP1 EQU   ATCAOSM+584                                              02519000
ATCTPCP0 EQU   ATCAOSM+580                                              02520000
ATCAICTN EQU   ATCAOSM+576                                              02521000
ATCZR01  EQU   ATCAOSM+572                                              02522000
ATCMPLTA EQU   ATCAOSM+568                                              02523000
ATCASCB  EQU   ATCAOSM+564                                              02524000
ATCAP86  EQU   ATCAOSM+560                                              02525000
ATCAP85  EQU   ATCAOSM+556                                              02526000
ATCAP84  EQU   ATCAOSM+552                                              02527000
ATCAP83  EQU   ATCAOSM+548                                              02528000
ATCAP82  EQU   ATCAOSM+544                                              02529000
ATCAP69  EQU   ATCAOSM+540                                              02530000
ATCAP66  EQU   ATCAOSM+536                                              02531000
ATCAP62  EQU   ATCAOSM+532                                              02532000
ATCAPC59 EQU   ATCAOSM+528                                              02533000
ATCAP56  EQU   ATCAOSM+524                                              02534000
ATCAP55  EQU   ATCAOSM+520                                              02535000
ATCRCFY0 EQU   ATCAOSM+516                                              02536000
ATCAP41  EQU   ATCAOSM+512                                              02537000
ATCAPC25 EQU   ATCAOSM+508                                              02538000
ATCAP23  EQU   ATCAOSM+504                                              02539000
ATCTPSPB EQU   ATCAOSM+472                                              02540000
ATCTRMBP EQU   ATCAOSM+440                                              02541000
ATCPSTA  EQU   ATCAOSM+432                                              02542000
ATCSMABF EQU   ATCAOSM+428                                              02543000
ATCSMAPR EQU   ATCAOSM+424                                              02544000
ATCTPWQA EQU   ATCAOSM+420                                              02545000
ATCSMAID EQU   ATCAOSM+416                                              02546000
ATCSMARA EQU   ATCAOSM+412                                              02547000
ATCCACXA EQU   ATCAOSM+408                                              02548000
ATCZLAAB EQU   ATCAOSM+404                                              02549000
ATCATA10 EQU   ATCAOSM+400                                              02550000
ATCHLTCB EQU   ATCAOSM+396                                              02551000
@NM00012 EQU   ATCVTFLG                                                 02552000
ATCVTACT EQU   ATCVTFLG                                                 02553000
ATCRPT40 EQU   ATCAOSM+388                                              02554000
ATCRPT39 EQU   ATCAOSM+384                                              02555000
ATCRPT38 EQU   ATCAOSM+380                                              02556000
ATCRPT37 EQU   ATCAOSM+376                                              02557000
ATCRPT36 EQU   ATCAOSM+372                                              02558000
ATCRPT35 EQU   ATCAOSM+368                                              02559000
ATCRPT34 EQU   ATCAOSM+364                                              02560000
ATCRPT33 EQU   ATCAOSM+360                                              02561000
ATCRPT32 EQU   ATCAOSM+356                                              02562000
ATCRPT31 EQU   ATCAOSM+352                                              02563000
ATCRPT30 EQU   ATCAOSM+348                                              02564000
ATCRPT29 EQU   ATCAOSM+344                                              02565000
ATCRPT28 EQU   ATCAOSM+340                                              02566000
ATCRPT27 EQU   ATCAOSM+336                                              02567000
ATCRPT26 EQU   ATCAOSM+332                                              02568000
ATCRPT25 EQU   ATCAOSM+328                                              02569000
ATCRPT24 EQU   ATCAOSM+324                                              02570000
ATCRPT23 EQU   ATCAOSM+320                                              02571000
ATCRPT22 EQU   ATCAOSM+316                                              02572000
ATCRPT21 EQU   ATCAOSM+312                                              02573000
ATCRPT20 EQU   ATCAOSM+308                                              02574000
ATCRPT19 EQU   ATCAOSM+304                                              02575000
ATCRPT18 EQU   ATCAOSM+300                                              02576000
ATCRPT17 EQU   ATCAOSM+296                                              02577000
ATCRPT16 EQU   ATCAOSM+292                                              02578000
ATCRPT15 EQU   ATCAOSM+288                                              02579000
ATCRPT14 EQU   ATCAOSM+284                                              02580000
ATCRPT13 EQU   ATCAOSM+280                                              02581000
ATCRPT12 EQU   ATCAOSM+276                                              02582000
ATCRPT11 EQU   ATCAOSM+272                                              02583000
ATCAP38  EQU   ATCAOSM+268                                              02584000
ATCAP37  EQU   ATCAOSM+264                                              02585000
ATCZDFJ0 EQU   ATCAOSM+260                                              02586000
ATCAP51  EQU   ATCAOSM+256                                              02587000
ATCZPAB2 EQU   ATCAOSM+224                                              02588000
ATCZPAB1 EQU   ATCAOSM+192                                              02589000
ATCZLFVT EQU   ATCAOSM+188                                              02590000
ATCZLPVT EQU   ATCAOSM+184                                              02591000
ATCZDVTX EQU   ATCAOSM+180                                              02592000
ATCZDVTA EQU   ATCAOSM+176                                              02593000
ATCZDVT9 EQU   ATCAOSM+172                                              02594000
ATCZDVT8 EQU   ATCAOSM+168                                              02595000
ATCZDVT7 EQU   ATCAOSM+164                                              02596000
ATCRSV56 EQU   ATCDAPVT+22                                              02597000
ATCDAPDG EQU   ATCDAPVT+20                                              02598000
ATCDXCEA EQU   ATCDAPVT+16                                              02599000
ATCDCEA  EQU   ATCDAPVT+12                                              02600000
ATCDPCIA EQU   ATCDAPVT+8                                               02601000
ATCDSIOA EQU   ATCDAPVT+4                                               02602000
ATCDEOEA EQU   ATCDAPVT                                                 02603000
ATCZLAEA EQU   ATCLDAPP+16                                              02604000
ATCZLCEA EQU   ATCLDAPP+12                                              02605000
ATCRSV17 EQU   ATCLDAPP+8                                               02606000
ATCSMFRR EQU   ATCLDAPP+4                                               02607000
ATCCDTID EQU   ATCLDAPP                                                 02608000
ATCZAEA  EQU   ATCICAPP+16                                              02609000
ATCZCEA  EQU   ATCICAPP+12                                              02610000
ATCCDTCB EQU   ATCICAPP+8                                               02611000
ATCZSIOA EQU   ATCICAPP+4                                               02612000
ATCCDRPH EQU   ATCICAPP                                                 02613000
ATCAP65  EQU   ATCAOSM+96                                               02614000
ATCZDVT6 EQU   ATCAOSM+92                                               02615000
ATCZDVT4 EQU   ATCAOSM+88                                               02616000
ATCZDVT3 EQU   ATCAOSM+84                                               02617000
ATCZDVT1 EQU   ATCAOSM+80                                               02618000
ATCICNCB EQU   ATCAOSM+76                                               02619000
ATCZPSVT EQU   ATCAOSM+72                                               02620000
ATCZFSVT EQU   ATCAOSM+68                                               02621000
ATCAP64  EQU   ATCAOSM+64                                               02622000
ATCAP63  EQU   ATCAOSM+60                                               02623000
ATCAP61  EQU   ATCAOSM+56                                               02624000
ATCAP58  EQU   ATCAOSM+52                                               02625000
ATCAP57  EQU   ATCAOSM+48                                               02626000
ATCAP54  EQU   ATCAOSM+44                                               02627000
ATCAP53  EQU   ATCAOSM+40                                               02628000
ATCAP52  EQU   ATCAOSM+36                                               02629000
ATCAP34  EQU   ATCAOSM+32                                               02630000
ATCAP32  EQU   ATCAOSM+28                                               02631000
ATCAP31  EQU   ATCAOSM+24                                               02632000
ATCAP12  EQU   ATCAOSM+20                                               02633000
ATCAP11  EQU   ATCAOSM+16                                               02634000
ATCCMTCB EQU   ATCAOSM+12                                               02635000
ATCPRPH  EQU   ATCAOSM+8                                                02636000
ATCGSRBF EQU   ATCGSRBG                                                 02637000
ATCSRBRT EQU   ATCAOSM                                                  02638000
ATCRSVBB EQU   ISTATCVT+908                                             02639000
ATCVDLOK EQU   ISTATCVT+904                                             02640000
ATCVFPAB EQU   ISTATCVT+872                                             02641000
ATCVDPAB EQU   ISTATCVT+840                                             02642000
ATCIOECB EQU   ISTATCVT+836                                             02643000
ATCINCW3 EQU   ISTATCVT+832                                             02644000
ATCMODTB EQU   ISTATCVT+828                                             02645000
ATCUSSPT EQU   ISTATCVT+824                                             02646000
ATCSRTAB EQU   ISTATCVT+820                                             02647000
@NM00011 EQU   ISTATCVT+818                                             02648000
ATCNMCTR EQU   ISTATCVT+816                                             02649000
ATCSEC51 EQU   ATCSECST                                                 02650000
ATCSEC40 EQU   ATCSIPD+8                                                02651000
ATCSEC30 EQU   ATCSIPD+4                                                02652000
ATCSEC21 EQU   ATCSIPD                                                  02653000
ATCSEC10 EQU   ATCSOPD+4                                                02654000
ATCSEC01 EQU   ATCSOPD                                                  02655000
ATCPOIA  EQU   ISTATCVT+788                                             02656000
ATCPODVT EQU   ISTATCVT+784                                             02657000
ATCS49XL EQU   ISTATCVT+780                                             02658000
ATCS49XI EQU   ISTATCVT+776                                             02659000
ATCLCLCT EQU   ATCVLCNT+2                                               02660000
ATCRNCNT EQU   ATCVLCNT                                                 02661000
ATCCFEAD EQU   ISTATCVT+768                                             02662000
ATCPTR00 EQU   ISTATCVT+736                                             02663000
ATCRSV10 EQU   ISTATCVT+704                                             02664000
ATCTACB  EQU   ISTATCVT+700                                             02665000
ATCVTINM EQU   ISTATCVT+696                                             02666000
ATCTCLIM EQU   ISTATCVT+692                                             02667000
ATCTCLOM EQU   ISTATCVT+688                                             02668000
ATCVTIPB EQU   ISTATCVT+656                                             02669000
ATCTCIPB EQU   ISTATCVT+624                                             02670000
ATCTIPAB EQU   ISTATCVT+592                                             02671000
ATCOCCCB EQU   ISTATCVT+588                                             02672000
ATCOCCOB EQU   ISTATCVT+584                                             02673000
ATCCDLAD EQU   ISTATCVT+580                                             02674000
ATCCCLAD EQU   ISTATCVT+576                                             02675000
ATCDLRPB EQU   ISTATCVT+544                                             02676000
ATCPGPAB EQU   ISTATCVT+512                                             02677000
ATCVPAB1 EQU   ISTATCVT+480                                             02678000
ATCRSV97 EQU   ISTATCVT+476                                             02679000
ATCRDTLK EQU   ISTATCVT+472                                             02680000
ATCVOCLK EQU   ISTATCVT+468                                             02681000
ATCCDFDN EQU   ISTATCVT+464                                             02682000
ATCCDFIN EQU   ISTATCVT+460                                             02683000
ATCDVTLK EQU   ISTATCVT+456                                             02684000
ATCAP36  EQU   ISTATCVT+452                                             02685000
ATCAP35  EQU   ISTATCVT+448                                             02686000
ATCAP33  EQU   ISTATCVT+444                                             02687000
ATCRSV99 EQU   ISTATCVT+412                                             02688000
ATCLDECB EQU   ISTATCVT+408                                             02689000
ATCLDNCS EQU   ISTATCVT+404                                             02690000
ATCCDPTR EQU   ISTATCVT+400                                             02691000
ATCADEL  EQU   ISTATCVT+396                                             02692000
ATCTODVT EQU   ISTATCVT+392                                             02693000
ATCDEBCH EQU   ISTATCVT+388                                             02694000
ATCHBSIZ EQU   ATCHPGM+2                                                02695000
ATCHBFNO EQU   ATCHPGM                                                  02696000
ATCCRME  EQU   ISTATCVT+380                                             02697000
ATCRVCHS EQU   ISTATCVT+372                                             02698000
ATCECTLP EQU   ISTATCVT+368                                             02699000
ATCZDVTB EQU   ISTATCVT+364                                             02700000
ATCECPRT EQU   ISTATCVT+360                                             02701000
ATCVTLOD EQU   ISTATCVT+356                                             02702000
ATCTRPAB EQU   ISTATCVT+352                                             02703000
ATCMSGM  EQU   ISTATCVT+348                                             02704000
ATCMSGP  EQU   ISTATCVT+344                                             02705000
ATCEPT   EQU   ISTATCVT+340                                             02706000
ATCDVT   EQU   ISTATCVT+336                                             02707000
ATCTRCPT EQU   ISTATCVT+332                                             02708000
ATCDVLOD EQU   ISTATCVT+328                                             02709000
ATCALERT EQU   ISTATCVT+324                                             02710000
ATCEPA   EQU   ISTATCVT+320                                             02711000
ATCSAF   EQU   ISTATCVT+318                                             02712000
ATCXRANG EQU   ISTATCVT+317                                             02713000
ATCLAST  EQU   ATCSHRFG                                                 02714000
ATCSHRTN EQU   ISTATCVT+308                                             02715000
ATCUEP   EQU   ISTATCVT+304                                             02716000
ATCOCRT  EQU   ISTATCVT+300                                             02717000
ATCCSMA  EQU   ATCCSMR                                                  02718000
ATCESC02 EQU   ISTATCVT+292                                             02719000
ATCESC01 EQU   ISTATCVT+288                                             02720000
ATCCDFND EQU   ISTATCVT+284                                             02721000
ATCCDDEL EQU   ISTATCVT+280                                             02722000
ATCCDADD EQU   ISTATCVT+276                                             02723000
ATCMNT   EQU   ISTATCVT+272                                             02724000
ATCRSV16 EQU   ISTATCVT+270                                             02725000
ATCMAXID EQU   ISTATCVT+269                                             02726000
ATCMSGSP EQU   ATCCOM+268                                               02727000
ATCCIDM  EQU   ATCCOM+266                                               02728000
ATCACTRM EQU   ATCCOM+264                                               02729000
ATCNERAP EQU   ATCCOM+260                                               02730000
ATCNESAL EQU   ATCCOM+256                                               02731000
ATCRCC65 EQU   ATCCOM+252                                               02732000
ATCRCC26 EQU   ATCCOM+248                                               02733000
ATCRCC63 EQU   ATCCOM+244                                               02734000
ATCRSV11 EQU   ATCCOM+242                                               02735000
ATCVTMID EQU   ATCCOM+240                                               02736000
ATCAPOST EQU   ATCCOM+236                                               02737000
ATCNERFN EQU   ATCCOM+232                                               02738000
ATCNERNE EQU   ATCCOM+228                                               02739000
ATCNERCV EQU   ATCCOM+224                                               02740000
ATCNERST EQU   ATCCOM+220                                               02741000
ATCDCC61 EQU   ATCCOM+216                                               02742000
ATCDCC60 EQU   ATCCOM+212                                               02743000
ATCSRTDF EQU   ATCCOM+208                                               02744000
ATCSRTAD EQU   ATCCOM+204                                               02745000
ATCFIRA  EQU   ATCCOM+200                                               02746000
ATCSMBQ  EQU   ATCCOM+196                                               02747000
ATCSMRC  EQU   ATCCOM+192                                               02748000
ATCSMRS  EQU   ATCCOM+188                                               02749000
ATCSMQU  EQU   ATCCOM+184                                               02750000
ATCSMRQ  EQU   ATCCOM+180                                               02751000
ATCACDA  EQU   ATCCOM+176                                               02752000
ATCSTMA  EQU   ATCCOM+172                                               02753000
ATCFRSTR EQU   ATCCOM+168                                               02754000
ATCGTSTR EQU   ATCCOM+164                                               02755000
ATCREADA EQU   ATCCOM+160                                               02756000
ATCALOAD EQU   ATCCOM+156                                               02757000
ATCBLDLA EQU   ATCCOM+152                                               02758000
ATCFBRPH EQU   ATCCOM+148                                               02759000
ATCBFTRC EQU   ATCCOM+144                                               02760000
ATCTPBUF EQU   ATCTHTRC                                                 02761000
ATCREMOV EQU   ATCCOM+136                                               02762000
ATCADD   EQU   ATCCOM+132                                               02763000
ATCBPDA  EQU   ATCCOM+128                                               02764000
ATCDVTPT EQU   ATCCOM+124                                               02765000
ATCFEPT  EQU   ATCCOM+120                                               02766000
ATCFDVT  EQU   ATCCOM+116                                               02767000
ATCCONFT EQU   ATCCOM+112                                               02768000
ATCPTCHA EQU   ATCCOM+108                                               02769000
ATCAUTHA EQU   ATCCOM+104                                               02770000
ATCACCTA EQU   ATCCOM+100                                               02771000
ATCRDTH  EQU   ATCCOM+96                                                02772000
ATCFRSCH EQU   ATCCOM+92                                                02773000
ATCFSB   EQU   ATCCOM+88                                                02774000
ATCHLTMS EQU   ATCCOM+84                                                02775000
ATCECPRM EQU   ATCCOM+80                                                02776000
ATCECNET EQU   ATCCOM+76                                                02777000
ATCECOPC EQU   ATCCOM+72                                                02778000
ATCVPARM EQU   ATCCOM+68                                                02779000
ATCECVRQ EQU   ATCCOM+64                                                02780000
ATCECSES EQU   ATCCOM+60                                                02781000
ATCOCHA  EQU   ATCCOM+56                                                02782000
ATCDSPLQ EQU   ATCCOM+52                                                02783000
ATCECDSP EQU   ATCCOM+48                                                02784000
ATCVARYQ EQU   ATCCOM+44                                                02785000
ATCECVRY EQU   ATCCOM+40                                                02786000
ATCHALTQ EQU   ATCCOM+36                                                02787000
ATCECHLT EQU   ATCCOM+32                                                02788000
ATCMODQ  EQU   ATCCOM+28                                                02789000
ATCECMOD EQU   ATCCOM+24                                                02790000
ATCASCHD EQU   ATCCOM+20                                                02791000
ATCSRT   EQU   ATCCOM+16                                                02792000
ATCRDT   EQU   ATCCOM+12                                                02793000
ATCDCFRR EQU   ATCCOM+8                                                 02794000
ATCAPI   EQU   ATCCOM+4                                                 02795000
ATCRSV04 EQU   ATCSTAT4                                                 02796000
ATCNCSD  EQU   ATCSTAT4                                                 02797000
ATCMTST  EQU   ATCSTAT4                                                 02798000
ATCTPRT  EQU   ATCSTAT4                                                 02799000
ATCPRTAT EQU   ATCSTAT4                                                 02800000
@NM00010 EQU   ATCPOFLG                                                 02801000
ATCPOUNS EQU   ATCPOFLG                                                 02802000
ATCHSDMF EQU   ATCSTFLG                                                 02803000
@NM00009 EQU   ATCSTAT1                                                 02804000
ATCINHLT EQU   ATCSTAT1                                                 02805000
ATCNETSL EQU   ATCSTAT1                                                 02806000
ATCQKHLT EQU   ATCSTAT1                                                 02807000
ATCSNHLT EQU   ATCSTAT1                                                 02808000
ATCACTIV EQU   ATCSTAT1                                                 02809000
ATCSTART EQU   ATCSTAT1                                                 02810000
RPHNEXPO EQU   ISTRPH+104                                               02811000
RPHSAV16 EQU   RPHWORK+60                                               02812000
RPHSAV15 EQU   RPHWORK+56                                               02813000
RPHSAV14 EQU   RPHWORK+52                                               02814000
RPHSAV13 EQU   RPHWORK+48                                               02815000
RPHSAV12 EQU   RPHWORK+44                                               02816000
RPHSAV11 EQU   RPHWORK+40                                               02817000
RPHSAV10 EQU   RPHWORK+36                                               02818000
RPHSAVE9 EQU   RPHWORK+32                                               02819000
RPHSAVE8 EQU   RPHWORK+28                                               02820000
RPHSAVE7 EQU   RPHWORK+24                                               02821000
RPHSAVE6 EQU   RPHWORK+20                                               02822000
RPHSAVE5 EQU   RPHWORK+16                                               02823000
RPHSAVE4 EQU   RPHWORK+12                                               02824000
RPHSAVE3 EQU   RPHWORK+8                                                02825000
RPHSAVE2 EQU   RPHWORK+4                                                02826000
RPHSHALF EQU   RPHSAVE1+2                                               02827000
RPHSBIT8 EQU   RPHSBITS                                                 02828000
RPHSBIT7 EQU   RPHSBITS                                                 02829000
RPHSBIT6 EQU   RPHSBITS                                                 02830000
RPHSBIT5 EQU   RPHSBITS                                                 02831000
RPHSBIT4 EQU   RPHSBITS                                                 02832000
RPHSBIT3 EQU   RPHSBITS                                                 02833000
RPHSBIT2 EQU   RPHSBITS                                                 02834000
RPHSBIT1 EQU   RPHSBITS                                                 02835000
RPHSBYTE EQU   RPHSAVE1                                                 02836000
RPHPABQP EQU   RPHPABQA+1                                               02837000
RPHPABFG EQU   RPHPABQA                                                 02838000
RPHSRP34 EQU   RPHSRPRM+2                                               02839000
RPHSRP12 EQU   RPHSRPRM                                                 02840000
RPHWEGT  EQU   RPHCSPA                                                  02841000
RPHMAJCB EQU   ISTRPH+21                                                02842000
RPHPABOF EQU   ISTRPH+20                                                02843000
RPHRESUM EQU   RPHRESMA+1                                               02844000
RPHRSV01 EQU   RPHWPFLG                                                 02845000
RPHPURGE EQU   RPHWPFLG                                                 02846000
RPHPT    EQU   RPHWPFLG                                                 02847000
RPHWT    EQU   RPHWPFLG                                                 02848000
RPHRSKEY EQU   RPHWPFLG                                                 02849000
RPHDVTA  EQU   ISTRPH+12                                                02850000
RPHTIK   EQU   RPHTSKID+3                                               02851000
@NM00008 EQU   RPHTSKID                                                 02852000
RPHRPHAP EQU   RPHRPHA+1                                                02853000
@NM00007 EQU   RPHRPHA                                                  02854000
RPHGATE  EQU   RPHRPHA                                                  02855000
@NM00006 EQU   RPHFLGB                                                  02856000
RPHRLCRA EQU   RPHFLGB                                                  02857000
RPHNRSAV EQU   RPHFLGB                                                  02858000
RPHPGCMP EQU   RPHFLGB                                                  02859000
RPHFBAPS EQU   RPHFLGB                                                  02860000
RPHBSSP  EQU   RPHFLGB                                                  02861000
RPHLOCK  EQU   RPHFLGB                                                  02862000
RPHFNFLG EQU   RPHFSTLC                                                 02863000
RPHMLTCP EQU   RPHFLAGS                                                 02864000
RPHSMCLR EQU   RPHFLAGS                                                 02865000
RPHSMTYP EQU   RPHFLAGS                                                 02866000
RPHSMQ   EQU   RPHFLAGS                                                 02867000
RPHAUTEX EQU   RPHAPTYP                                                 02868000
RPHSPGIN EQU   RPHFLAGS                                                 02869000
RPHOGIND EQU   RPHFLAGS                                                 02870000
RPHLNGTH EQU   ISTRPH+1                                                 02871000
RPHTYPE  EQU   ISTRPH                                                   02872000
LOKXCL   EQU   @NM00004                                                 02873000
LOKPRY   EQU   @NM00004                                                 02874000
@NM00005 EQU   @NM00004                                                 02875000
@NM00003 EQU   LOKCHNG                                                  02876000
LOKCT    EQU   ISTLOK                                                   02877000
DYPPAB   EQU   ISTDYPAB+16                                              02878000
DYPRSV01 EQU   ISTDYPAB+12                                              02879000
DYPTSKID EQU   ISTDYPAB+8                                               02880000
DYPCHAIN EQU   ISTDYPAB+4                                               02881000
DYPFLGS  EQU   ISTDYPAB+2                                               02882000
DYPLNGTH EQU   ISTDYPAB+1                                               02883000
DYPTYPE  EQU   ISTDYPAB                                                 02884000
PABRPHA  EQU   PABRPHFG+1                                               02885000
PABNODQ  EQU   PABFLAGS                                                 02886000
PABINHBT EQU   PABFLAGS                                                 02887000
PABERLOK EQU   PABERRLK                                                 02888000
PABSSN   EQU   PABFLAGS                                                 02889000
PABDYNAM EQU   PABFLAGS                                                 02890000
PABNORPR EQU   PABFLAGS                                                 02891000
PABPRIOR EQU   PABFLAGS                                                 02892000
PABAPYP  EQU   PABFLAGS                                                 02893000
PABDVTA  EQU   ISTPAB+9                                                 02894000
PABOFFST EQU   ISTPAB+8                                                 02895000
PABCHNGP EQU   PABCHAIN+1                                               02896000
PABRSV02 EQU   PABCHAIN                                                 02897000
PABRUNNG EQU   PABCHAIN                                                 02898000
PABRESET EQU   PABCHAIN                                                 02899000
PABUNCON EQU   PABCHAIN                                                 02900000
PABCDP   EQU   PABCHAIN                                                 02901000
PABRESCH EQU   PABCHAIN                                                 02902000
PABCHNG  EQU   PABCHAIN                                                 02903000
PABWEQP  EQU   PABWEQA+1                                                02904000
PABRSV01 EQU   PABWEQA                                                  02905000
PABWEQG  EQU   PABWEQA                                                  02906000
CVTLEVL  EQU   CVTRELNO+2                                               02907000
CVTNUMB  EQU   CVTRELNO                                                 02908000
CVTMDL   EQU   CVTFIX+250                                               02909000
@NM00002 EQU   CVTFIX+248                                               02910000
@NM00001 EQU   CVTFIX                                                   02911000
CVTRV482 EQU   CVTXTNT2+128                                             02912000
CVTRV481 EQU   CVTXTNT2+124                                             02913000
CVTRV480 EQU   CVTXTNT2+120                                             02914000
CVTRV479 EQU   CVTXTNT2+118                                             02915000
CVTRV478 EQU   CVTXTNT2+117                                             02916000
CVTRV477 EQU   CVTXTNT2+116                                             02917000
CVTRV476 EQU   CVTXTNT2+115                                             02918000
CVTRV475 EQU   CVTXTNT2+114                                             02919000
CVTRV474 EQU   CVTRV466                                                 02920000
CVTRV473 EQU   CVTRV466                                                 02921000
CVTRV472 EQU   CVTRV466                                                 02922000
CVTRV471 EQU   CVTRV466                                                 02923000
CVTRV470 EQU   CVTRV466                                                 02924000
CVTRV469 EQU   CVTRV466                                                 02925000
CVTRV468 EQU   CVTRV466                                                 02926000
CVTRV467 EQU   CVTRV466                                                 02927000
CVTRV465 EQU   CVTRV457                                                 02928000
CVTRV464 EQU   CVTRV457                                                 02929000
CVTRV463 EQU   CVTRV457                                                 02930000
CVTRV462 EQU   CVTRV457                                                 02931000
CVTRV461 EQU   CVTRV457                                                 02932000
CVTRV460 EQU   CVTRV457                                                 02933000
CVTRV459 EQU   CVTRV457                                                 02934000
CVTRV458 EQU   CVTRV457                                                 02935000
CVTRV456 EQU   CVTXTNT2+108                                             02936000
CVTRV455 EQU   CVTXTNT2+104                                             02937000
CVTRV454 EQU   CVTXTNT2+100                                             02938000
CVTRV453 EQU   CVTXTNT2+96                                              02939000
CVTRV452 EQU   CVTXTNT2+94                                              02940000
CVTRV451 EQU   CVTXTNT2+92                                              02941000
CVTRV450 EQU   CVTXTNT2+90                                              02942000
CVTRV449 EQU   CVTXTNT2+88                                              02943000
CVTRV448 EQU   CVTXTNT2+87                                              02944000
CVTRV447 EQU   CVTXTNT2+86                                              02945000
CVTRV446 EQU   CVTRV438                                                 02946000
CVTRV445 EQU   CVTRV438                                                 02947000
CVTRV444 EQU   CVTRV438                                                 02948000
CVTRV443 EQU   CVTRV438                                                 02949000
CVTRV442 EQU   CVTRV438                                                 02950000
CVTRV441 EQU   CVTRV438                                                 02951000
CVTRV440 EQU   CVTRV438                                                 02952000
CVTRV439 EQU   CVTRV438                                                 02953000
CVTRV437 EQU   CVTRV429                                                 02954000
CVTRV436 EQU   CVTRV429                                                 02955000
CVTRV435 EQU   CVTRV429                                                 02956000
CVTRV434 EQU   CVTRV429                                                 02957000
CVTRV433 EQU   CVTRV429                                                 02958000
CVTRV432 EQU   CVTRV429                                                 02959000
CVTRV431 EQU   CVTRV429                                                 02960000
CVTRV430 EQU   CVTRV429                                                 02961000
CVTRV428 EQU   CVTXTNT2+80                                              02962000
CVTRV427 EQU   CVTXTNT2+76                                              02963000
CVTRV426 EQU   CVTXTNT2+72                                              02964000
CVTRV425 EQU   CVTXTNT2+68                                              02965000
CVTATACT EQU   CVTATCVT                                                 02966000
CVTRV423 EQU   CVTXTNT2+62                                              02967000
CVTRV422 EQU   CVTXTNT2+60                                              02968000
CVTRV421 EQU   CVTXTNT2+58                                              02969000
CVTRV420 EQU   CVTXTNT2+56                                              02970000
CVTRV419 EQU   CVTXTNT2+55                                              02971000
CVTRV418 EQU   CVTXTNT2+54                                              02972000
CVTRV417 EQU   CVTRV409                                                 02973000
CVTRV416 EQU   CVTRV409                                                 02974000
CVTRV415 EQU   CVTRV409                                                 02975000
CVTRV414 EQU   CVTRV409                                                 02976000
CVTRV413 EQU   CVTRV409                                                 02977000
CVTRV412 EQU   CVTRV409                                                 02978000
CVTRV411 EQU   CVTRV409                                                 02979000
CVTRV410 EQU   CVTRV409                                                 02980000
CVTRV408 EQU   CVTRV400                                                 02981000
CVTRV407 EQU   CVTRV400                                                 02982000
CVTRV406 EQU   CVTRV400                                                 02983000
CVTRV405 EQU   CVTRV400                                                 02984000
CVTRV404 EQU   CVTRV400                                                 02985000
CVTRV403 EQU   CVTRV400                                                 02986000
CVTRV402 EQU   CVTRV400                                                 02987000
CVTRV401 EQU   CVTRV400                                                 02988000
CVTICB   EQU   CVTXTNT2+48                                              02989000
CVTSKTA  EQU   CVTXTNT2+44                                              02990000
CVTSHSB  EQU   CVTSHS                                                   02991000
CVTRSV98 EQU   CVTXTNT2+36                                              02992000
CVTRSV97 EQU   CVTXTNT2+34                                              02993000
CVTRSV96 EQU   CVTXTNT2+32                                              02994000
CVTOLTEP EQU   CVTXTNT2+28                                              02995000
CVTQIDA  EQU   CVTQID+1                                                 02996000
CVTRSV95 EQU   CVTQID                                                   02997000
CVTRSV94 EQU   CVTXTNT2+20                                              02998000
CVTRSV93 EQU   CVTXTNT2+16                                              02999000
CVTRSV92 EQU   CVTXTNT2+12                                              03000000
CVTDEBVR EQU   CVTXTNT2+8                                               03001000
CVTRSV91 EQU   CVTXTNT2+6                                               03002000
CVTRSV9H EQU   CVTFLGBT                                                 03003000
CVTRSV9G EQU   CVTFLGBT                                                 03004000
CVTRSV9F EQU   CVTFLGBT                                                 03005000
CVTRSV9E EQU   CVTFLGBT                                                 03006000
CVTRSV9D EQU   CVTFLGBT                                                 03007000
CVTRSV9C EQU   CVTFLGBT                                                 03008000
CVTVME   EQU   CVTFLGBT                                                 03009000
CVTNPE   EQU   CVTFLGBT                                                 03010000
CVTNUCLS EQU   CVTXTNT2+4                                               03011000
CVTDSSVA EQU   CVTDSSV+1                                                03012000
CVTRSV89 EQU   CVTDSSV                                                  03013000
CVTRSV88 EQU   CVTXTNT1+8                                               03014000
CVTRSV87 EQU   CVTXTNT1+4                                               03015000
CVTFACHN EQU   CVTXTNT1                                                 03016000
CVTRV488 EQU   CVTMAP+412                                               03017000
CVTRV487 EQU   CVTMAP+408                                               03018000
CVTRV486 EQU   CVTMAP+404                                               03019000
CVTRV485 EQU   CVTMAP+400                                               03020000
CVTACTAP EQU   CVTMAP+396                                               03021000
CVTAUTH  EQU   CVTMAP+392                                               03022000
CVTATMCA EQU   CVTATMCT+1                                               03023000
CVTATMST EQU   CVTATMCT                                                 03024000
CVTRSV61 EQU   CVTMAP+384                                               03025000
CVTVOLT1 EQU   CVTVOLM1+1                                               03026000
CVTVOLI1 EQU   CVTVOLF1                                                 03027000
CVTSTOA  EQU   CVTMAP+376                                               03028000
CVTRSV58 EQU   CVTMAP+374                                               03029000
CVTRSV57 EQU   CVTMAP+372                                               03030000
CVTDDCE  EQU   CVTMAP+368                                               03031000
CVTPNWFR EQU   CVTMAP+364                                               03032000
CVTSMF   EQU   CVTMAP+360                                               03033000
CVTSULK  EQU   CVTMAP+358                                               03034000
CVTSLKO  EQU   CVTSYSK                                                  03035000
CVTSLKP  EQU   CVTSYSK                                                  03036000
CVTSLKQ  EQU   CVTSYSK                                                  03037000
CVTSLKR  EQU   CVTSYSK                                                  03038000
CVTRSV56 EQU   CVTSYSK                                                  03039000
CVTRSV55 EQU   CVTSYSK                                                  03040000
CVTRSV54 EQU   CVTSYSK                                                  03041000
CVTRSV53 EQU   CVTSYSK                                                  03042000
CVTRSV52 EQU   CVTA1F1                                                  03043000
CVTRSV51 EQU   CVTA1F1                                                  03044000
CVTRSV50 EQU   CVTA1F1                                                  03045000
CVTRSV49 EQU   CVTA1F1                                                  03046000
CVTRSV48 EQU   CVTA1F1                                                  03047000
CVTRSV47 EQU   CVTA1F1                                                  03048000
CVTSRSW  EQU   CVTA1F1                                                  03049000
CVTPFSW  EQU   CVTA1F1                                                  03050000
CVTPCVT  EQU   CVTMAP+352                                               03051000
CVTRSV46 EQU   CVTMAP+344                                               03052000
CVTRSV45 EQU   CVTMAP+340                                               03053000
CVTRSV44 EQU   CVTMAP+338                                               03054000
CVTRSV43 EQU   CVTMAP+336                                               03055000
CVTHJESA EQU   CVTHJES+1                                                03056000
CVTRSV42 EQU   CVTHJES                                                  03057000
CVTEXT2A EQU   CVTEXT2+1                                                03058000
CVTRSV41 EQU   CVTEXT2                                                  03059000
CVTAPFA  EQU   CVTAPF+1                                                 03060000
CVTRSV40 EQU   CVTAPF                                                   03061000
CVTRV518 EQU   CVTINTLA                                                 03062000
CVTRV517 EQU   CVTERPV                                                  03063000
CVTEORM  EQU   CVTMAP+312                                               03064000
CVTMCHPR EQU   CVTMAP+308                                               03065000
CVTTZ    EQU   CVTMAP+304                                               03066000
CVTJEPS  EQU   CVTMAP+300                                               03067000
CVTJESCT EQU   CVTMAP+296                                               03068000
CVTMODE  EQU   CVTMAP+292                                               03069000
CVTPTRV  EQU   CVTMAP+288                                               03070000
CVTREAL  EQU   CVTMAP+284                                               03071000
CVTRSV39 EQU   CVTMAP+280                                               03072000
CVTRSV38 EQU   CVTMAP+276                                               03073000
CVTDMSRA EQU   CVTDMSR+1                                                03074000
CVTRSV37 EQU   CVTDMSR                                                  03075000
CVTQMSGA EQU   CVTQMSG+1                                                03076000
CVTRSV36 EQU   CVTQMSG                                                  03077000
CVTAMFF  EQU   CVTMAP+264                                               03078000
CVTPURGA EQU   CVTPURG+1                                                03079000
CVTRSV35 EQU   CVTPURG                                                  03080000
CVTCBSP  EQU   CVTMAP+256                                               03081000
CVTATERA EQU   CVTATER+1                                                03082000
CVTSYST  EQU   CVTATER                                                  03083000
CVTVOLT2 EQU   CVTTAT                                                   03084000
CVTVOLI2 EQU   CVTVOLF2                                                 03085000
CVTAQAVB EQU   CVTAQAVT+1                                               03086000
CVTRSV34 EQU   CVTTCMFG                                                 03087000
CVTRSV33 EQU   CVTTCMFG                                                 03088000
CVTRSV32 EQU   CVTTCMFG                                                 03089000
CVTRSV31 EQU   CVTTCMFG                                                 03090000
CVTRSV30 EQU   CVTTCMFG                                                 03091000
CVTRSV29 EQU   CVTTCMFG                                                 03092000
CVTRSV28 EQU   CVTTCMFG                                                 03093000
CVTTCRDY EQU   CVTTCMFG                                                 03094000
CVTGTFA  EQU   CVTGTF+1                                                 03095000
CVTRSV27 EQU   CVTGTFST                                                 03096000
CVTRNIO  EQU   CVTGTFST                                                 03097000
CVTUSR   EQU   CVTGTFST                                                 03098000
CVTRV318 EQU   CVTFORM                                                  03099000
CVTRV317 EQU   CVTTMODE                                                 03100000
CVTRV316 EQU   CVTSTATE                                                 03101000
CVTRV315 EQU   CVTGTFS                                                  03102000
CVTGTFAV EQU   CVTGTFS                                                  03103000
CVT0SCR1 EQU   CVTMAP+232                                               03104000
CVTRV515 EQU   CVTMAP+228                                               03105000
CVTRMS   EQU   CVTMAP+224                                               03106000
CVTPATCH EQU   CVTMAP+220                                               03107000
CVTTSCE  EQU   CVTMAP+216                                               03108000
CVTLNKSC EQU   CVTMAP+214                                               03109000
CVTQABST EQU   CVTMAP+212                                               03110000
CVTMDLDS EQU   CVTMAP+208                                               03111000
CVTUSER  EQU   CVTMAP+204                                               03112000
CVTABEND EQU   CVTMAP+200                                               03113000
CVTSMCA  EQU   CVTMAP+196                                               03114000
CVTRSV18 EQU   CVTMAP+192                                               03115000
CVTQLPAQ EQU   CVTMAP+188                                               03116000
CVTQCDSR EQU   CVTMAP+184                                               03117000
CVTRSV17 EQU   CVTOPTB                                                  03118000
CVTRSV16 EQU   CVTOPTB                                                  03119000
CVTFP    EQU   CVTOPTB                                                  03120000
CVTAPTHR EQU   CVTOPTB                                                  03121000
CVTNLOG  EQU   CVTOPTB                                                  03122000
CVTTOD   EQU   CVTOPTB                                                  03123000
CVTCTIMS EQU   CVTOPTB                                                  03124000
CVTPROT  EQU   CVTOPTB                                                  03125000
CVTXPFP  EQU   CVTOPTA                                                  03126000
CVTASCII EQU   CVTOPTA                                                  03127000
CVTRSV13 EQU   CVTOPTA                                                  03128000
CVTRSV12 EQU   CVTOPTA                                                  03129000
CVTNIP   EQU   CVTOPTA                                                  03130000
CVTDDR   EQU   CVTOPTA                                                  03131000
CVTAPR   EQU   CVTOPTA                                                  03132000
CVTCCH   EQU   CVTOPTA                                                  03133000
CVTSNCTR EQU   CVTMAP+180                                               03134000
CVTQMWR  EQU   CVTMAP+176                                               03135000
CVTQOCR  EQU   CVTMAP+172                                               03136000
CVT1EF00 EQU   CVTMAP+168                                               03137000
CVTMZ00  EQU   CVTMAP+164                                               03138000
CVTHEAD  EQU   CVTMAP+160                                               03139000
CVTRSV11 EQU   CVTMAP+156                                               03140000
CVT0PT01 EQU   CVTMAP+152                                               03141000
CVTMSER  EQU   CVTMAP+148                                               03142000
CVTRV516 EQU   CVTIERLC                                                 03143000
CVTILCH  EQU   CVTMAP+140                                               03144000
CVT0DS   EQU   CVTMAP+136                                               03145000
CVTFBOSV EQU   CVTMAP+132                                               03146000
CVTNUCB  EQU   CVTMAP+128                                               03147000
CVTIXAVL EQU   CVTMAP+124                                               03148000
CVTIOQET EQU   CVTMAP+120                                               03149000
CVTDCBA  EQU   CVTMAP+117                                               03150000
CVTMVS2  EQU   CVTDCB                                                   03151000
CVT6DAT  EQU   CVTDCB                                                   03152000
CVT4MPS  EQU   CVTDCB                                                   03153000
CVTRSV09 EQU   CVTDCB                                                   03154000
CVT4MS1  EQU   CVTDCB                                                   03155000
CVT2SPS  EQU   CVTDCB                                                   03156000
CVT1SSS  EQU   CVTDCB                                                   03157000
CVTRSV08 EQU   CVTDCB                                                   03158000
CVTSTB   EQU   CVTMAP+112                                               03159000
CVTQTD00 EQU   CVTMAP+108                                               03160000
CVTQTE00 EQU   CVTMAP+104                                               03161000
CVTCUCB  EQU   CVTMAP+100                                               03162000
CVTSJQ   EQU   CVTMAP+96                                                03163000
CVTPBLDL EQU   CVTMAP+92                                                03164000
CVTTPC   EQU   CVTMAP+88                                                03165000
CVTSVDCB EQU   CVTMAP+84                                                03166000
CVTBRET  EQU   CVTMAP+82                                                03167000
CVTEXIT  EQU   CVTMAP+80                                                03168000
CVT0FN00 EQU   CVTMAP+76                                                03169000
CVTDARA  EQU   CVTDAR+1                                                 03170000
CVTRSV07 EQU   CVTFLGS1                                                 03171000
CVTRSV06 EQU   CVTFLGS1                                                 03172000
CVTRSV05 EQU   CVTFLGS1                                                 03173000
CVTRSV04 EQU   CVTFLGS1                                                 03174000
CVTRSV03 EQU   CVTFLGS1                                                 03175000
CVTRSV02 EQU   CVTFLGS1                                                 03176000
CVTRSV01 EQU   CVTFLGS1                                                 03177000
CVTDMPLK EQU   CVTFLGS1                                                 03178000
CVTXITP  EQU   CVTMAP+68                                                03179000
CVTZDTAB EQU   CVTMAP+64                                                03180000
CVTMSLT  EQU   CVTMAP+60                                                03181000
CVTDATE  EQU   CVTMAP+56                                                03182000
CVTBTERM EQU   CVTMAP+52                                                03183000
CVTSYSAD EQU   CVTMAP+48                                                03184000
CVTXTLER EQU   CVTMAP+44                                                03185000
CVTILK2  EQU   CVTMAP+40                                                03186000
CVTILK1  EQU   CVTMAP+36                                                03187000
CVTPRLTV EQU   CVTMAP+32                                                03188000
CVTPCNVT EQU   CVTMAP+28                                                03189000
CVT0VL00 EQU   CVTMAP+24                                                03190000
CVTXAPG  EQU   CVTMAP+20                                                03191000
CVTBUF   EQU   CVTMAP+16                                                03192000
CVTJOB   EQU   CVTMAP+12                                                03193000
CVTLINK  EQU   CVTMAP+8                                                 03194000
CVT0EF00 EQU   CVTMAP+4                                                 03195000
CVTTCBP  EQU   CVTMAP                                                   03196000
CVT      EQU   CVTMAP                                                   03197000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03198000
@ENDDATA EQU   *                                                        03199000
         END   ISTZJFCB,(C'PLS1921',0603,75130)                         03200000
