         TITLE 'ISTZFFEA/AEA-VS1/MEA-VS2: 3270 LOCAL BUFFER ALLOCATOR  *00001000
                        '                                               00002000
ISTZFFEA CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZFFEA  75.130'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
*                                                                  0557 00011000
*/********************************************************************/ 00012000
*/* MAIN PROCEDURE -                                                 */ 00013000
*/* IF TEST MODE,CALL PHASE TO PROCESS TEST                          */ 00014000
*/* IF NOT TEST MODE,                                                */ 00015000
*/*    CALL BUFFER ALLOCATION UTILITY TO GET A BUFFER,               */ 00016000
*/*    LOCK AND DISABLE,                                             */ 00017000
*/*    CALL I/O INITIATION ROUTINE,                                  */ 00018000
*/*    CALL I/O SCHEDULER IF I/O TO BE STARTED,                      */ 00019000
*/*    AND UNLOCK AND ENABLE                                         */ 00020000
*/********************************************************************/ 00021000
*                                                                  0557 00022000
*                                                                  0557 00023000
*/* TPZSAVE (7,12,14) BASE AC(FCEA)                                  */ 00024000
*                                                                  0557 00025000
*   DO;                                                            0557 00026000
*     RFY                                                          0558 00027000
*      (GPR01P,                                                    0558 00028000
*       GPR12P,                                                    0558 00029000
*       GPR13P,                                                    0558 00030000
*       GPR14P) RSTD;                                              0558 00031000
*     GEN(PRINT OFF);                                              0559 00032000
*                                                                  0559 00033000
         PRINT OFF                                                      00034000
*/* ATBUILD (ISTZSAVE)                                               */ 00035000
*/* END OF ATBUILD                                                   */ 00036000
*                                                                  0560 00037000
*     GEN(PRINT ON);                                               0560 00038000
         PRINT ON                                                       00039000
*     RFY                                                          0561 00040000
*       ISTZSAVE BASED(GPR13P);                                    0561 00041000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0562 00042000
         STM   7,12,ZSAZSVVR+0(13)                                      00043000
*     GEN SETS(GPR12P);                                            0563 00044000
         BALR  GPR12P,0                                                 00045000
@TSTART  DS    0H                                                       00046000
         USING @TSTART,GPR12P                                           00047000
*     GEN(PRINT OFF);                                              0564 00048000
*                                                                  0564 00049000
         PRINT OFF                                                      00050000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00051000
*/* END OF ATBUILD                                                   */ 00052000
*                                                                  0565 00053000
*     GEN(PRINT ON);                                               0565 00054000
         PRINT ON                                                       00055000
*     GPR01P->RPHCRR->CRACRR->ZCREFCEA='1'B;                       0566 00056000
         L     @15,RPHCRR(,GPR01P)                                 0566 00057000
         L     @15,CRACRR(,@15)                                    0566 00058000
         OI    ZCREFCEA(@15),B'00000001'                           0566 00059000
*     ZSAZACTV='1'B;                                               0567 00060000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0567 00061000
*     ZSAZTRAC='FCEA';                                             0568 00062000
         MVC   ZSAZTRAC(4,GPR13P),@CC04988                         0568 00063000
*     ZSAZSVRR=GPR14P;                                             0569 00064000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0569 00065000
*     GPR13P=ZSAZSVFC;                                             0570 00066000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0570 00067000
*     RFY                                                          0571 00068000
*      (GPR01P) UNRSTD;                                            0571 00069000
*     RFY                                                          0572 00070000
*      (GPR14P) UNRSTD;                                            0572 00071000
*   END;                                                           0573 00072000
*                                                                  0573 00073000
*/* END TPZSAVE                                                      */ 00074000
*                                                                  0574 00075000
*                                   /* SAVE REGS AND SET UP BASE     */ 00076000
*   IF LDNZF006='1'B THEN           /* IF TEST MODE                  */ 00077000
*                                                                  0574 00078000
         TM    LDNZF006(PTRLDN),B'00001000'                        0574 00079000
         BNO   @RF00574                                            0574 00080000
*     /***************************************************************/ 00081000
*     /*                                                             */ 00082000
*     /* SEGMENT(TSTMODE)REQUEST                                     */ 00083000
*     /*                                                             */ 00084000
*     /***************************************************************/ 00085000
*                                                                  0575 00086000
*     DO;                                                          0575 00087000
*       GOTO TSTMODE;                                              0576 00088000
         B     TSTMODE                                             0576 00089000
*TSTMODE#:                                                         0577 00090000
*     END;                          /* CALL TEST PHASE               */ 00091000
*   ELSE                            /* IF NOT TEST MODE              */ 00092000
*NOTEST:                                                           0578 00093000
*     DO;                                                          0578 00094000
         B     @RC00574                                            0578 00095000
@RF00574 DS    0H                                                  0578 00096000
NOTEST   DS    0H                                                  0579 00097000
*       RFY                                                        0579 00098000
*         PTRG08 RSTD;              /* RESTRICT PARAM REG            */ 00099000
*       PTRG08=LDNZRM;              /* GET MAXIMUM LENGTH            */ 00100000
         LH    PTRG08,LDNZRM(,PTRLDN)                              0580 00101000
         N     PTRG08,@CF05033                                     0580 00102000
*       ZCRPCOD1=0;                 /* ZERO PARAMETER BYTE           */ 00103000
         L     @09,RPHCRR(,PTRRPH)                                 0581 00104000
         L     @09,CRACRR(,@09)                                    0581 00105000
         MVI   ZCRPCOD1(@09),X'00'                                 0581 00106000
*       ZCRPBUF='1'B;               /* TURN ON BIT TO GET A BUFFER   */ 00107000
*       ZCRPLNG='1'B;               /* TURN ON BIT FOR SUPPLIED    0583 00108000
*                                      LENGTH                        */ 00109000
         OI    ZCRPBUF(@09),B'01000100'                            0583 00110000
*       CALL ZPSZDFA0;              /* CALL BUFFER ALLOCATION TO GET    00111000
*                                      A FIXED BUFFER                */ 00112000
         L     @09,ATCZPSVT(,PTRATC)                               0584 00113000
         L     @15,ZPSZDFA0(,@09)                                  0584 00114000
         BALR  @14,@15                                             0584 00115000
*       RFY                                                        0585 00116000
*         PTRG08 UNRSTD;            /* UNRESTRICT PARAM REG          */ 00117000
*       PTRZLB=RPHSRPRM;            /* GET THE ADDR OF THE BUFFER    */ 00118000
         L     PTRZLB,RPHSRPRM(,PTRRPH)                            0586 00119000
*/*TPZLOCK  (OBTAIN,(LDNCB,ISTZFFEA(UNLOCK)),VTAM,LDNRPH,SAV13)   TYNCB 00120000
*LDNCB)                                                              */ 00121000
*                                                                  0587 00122000
*       DO;                                                        0587 00123000
*                                                                  0587 00124000
*/* ATBUILD (ISTZFSAV,ISTZ19SV)                                      */ 00125000
*                                                                  0588 00126000
*/*  VS2 TPIOS FIXED SAVEAREA FORMAT (TPZLOCK) */                  0588 00127000
*DCL  1  ISTZFSAV BDY(WORD) BASED,                                 0588 00128000
*        3   ZSAFSVBC PTR(31),         /* SAVEAREA BACK CHAIN        */ 00129000
*        3   ZSAFSVFC PTR(31),         /* SAVEAREA FORWARD CHAIN     */ 00130000
*        3   ZSAFSVRR PTR(31),         /* RETURN REGISTER            */ 00131000
*        3   ZSAFSVVR (6) PTR(31),    /* VARIABLE REGS (9-14) SVEAREA*/ 00132000
*        3   ZSAFSVR2 PTR(31),        /* REGISTER 2 SAVEAREA         */ 00133000
*        3   ZSAFSV19 PTR(31);        /* ADDRESS OF 19 WORD SAVEAREA */ 00134000
*DCL ZSAFSVVA FIXED(8) CONSTANT(8);  /* DISPLACEMENT TO VARIABLE REGS*/ 00135000
*DCL ZSAFSVSZ FIXED(8) CONSTANT(44); /* LENGTH OF ISTZSAVE           */ 00136000
*/*  VS2 TPIOS 19 WORD FIXED SAVEAREA FORMAT (TPZLOCK) */          0591 00137000
*DCL  1  ISTZ19SV BDY(WORD) BASED,                                 0591 00138000
*        3  ZSAF19FG BIT(8),        /* FLAGS FIELD                  */  00139000
*           5  ZSAFLOCK BIT(1),     /* LOCK OWNERSHIP BIT           */  00140000
*           5  ZSAFRSVS BIT(7),     /* RESERVED                     */  00141000
*        3  ZSAF19RV CHAR(3),       /* RESERVED                     */  00142000
*        3  ZSAF19R1 PTR(31),       /* RPH REGISTER (R1) SAVEAREA   */  00143000
*        3  ZSAF19RD PTR(31),       /* SAVEAREA PTR (R13) SAVEAREA  */  00144000
*        3  ZSAF19IO (16) PTR(31);  /* 16 WORD SIO SAVEAREA         */  00145000
*                                                                  0592 00146000
*/* END OF ATBUILD                                                   */ 00147000
*                                                                  0592 00148000
*         DCL                                                      0592 00149000
*           1 FRWD0024 BDY(WORD) BASED,/* FRR PARM AREA              */ 00150000
*            2 WRD00024 PTR(31),    /* FIRST PARM WORD               */ 00151000
*            2 WRD10024 PTR(31),    /* 2ND PARM WORD                 */ 00152000
*            2 WRDS0024 CHAR(16);   /* OTHER PARM WORDS              */ 00153000
*         RFY                                                      0593 00154000
*          (GPR01P,                                                0593 00155000
*           GPR02P,                                                0593 00156000
*           GPR03P,                                                0593 00157000
*           GPR09P,                                                0593 00158000
*           GPR10P,                                                0593 00159000
*           GPR11P,                                                0593 00160000
*           GPR14P,                                                0593 00161000
*           GPR15P) RSTD;                                          0593 00162000
*         GPR15P=PSACPUPA;          /* GET CPU ADDRESS               */ 00163000
         LH    GPR15P,PSACPUPA                                     0594 00164000
*         SLL(GPR15P,2);            /* ADJUST FOR ADDRESSING         */ 00165000
         SLL   GPR15P,2                                            0595 00166000
*         GEN(L GPR15P,ATCTPCP0(GPR15P,GPR02P))                    0596 00167000
*         REFS(GPR02P,GPR15P,ATCTPCP0);/* DETERMINE PROPER SAVEAREA  */ 00168000
         L GPR15P,ATCTPCP0(GPR15P,GPR02P)                               00169000
*         GEN SETS(ZSAFSVVR)(STM   9,14,ZSAFSVVR+0(15));/* SAVE REGS */ 00170000
         STM   9,14,ZSAFSVVR+0(15)                                      00171000
*         GPR09P=GPR15P;            /* SAVE SAVEAREA PTR ACROSS    0598 00172000
*                                      MACROS                        */ 00173000
         LR    GPR09P,GPR15P                                       0598 00174000
*         GPR10P=GPR02P->ATCZR01;   /* GET FRR RTN ADDRESS           */ 00175000
         L     GPR10P,ATCZR01(,GPR02P)                             0599 00176000
*         GPR09P->ZSAFSVR2=GPR02P;  /* SAVE R2 ACROSS MODE SETS      */ 00177000
         ST    GPR02P,ZSAFSVR2(,GPR09P)                            0600 00178000
*         GEN(MODESET EXTKEY=ZERO,SAVEKEY=(2));                    0601 00179000
*                                                                  0601 00180000
         MODESET EXTKEY=ZERO,SAVEKEY=(2)                                00181000
*         /***********************************************************/ 00182000
*         /*                                                         */ 00183000
*         /* MODE SET TO KEY ZERO                                    */ 00184000
*         /*                                                         */ 00185000
*         /***********************************************************/ 00186000
*                                                                  0602 00187000
*         GPR11P=LDNZLOCK;          /* GET UCBLOCK FROM LDNCB        */ 00188000
         L     GPR11P,LDNZLOCK(,PTRLDN)                            0602 00189000
*         GPR09P->ZSAFSV19->ZSAFLOCK='1'B;/* SET OWNERSHIP FLAG      */ 00190000
         L     @08,ZSAFSV19(,GPR09P)                               0603 00191000
         OI    ZSAFLOCK(@08),B'10000000'                           0603 00192000
*         GEN REFS(GPR11P,PSALITA,FLC);                            0604 00193000
         SETLOCK OBTAIN,TYPE=IOSUCB,ADDR=(11),MODE=UNCOND,             *00194000
               RELATED=(LDNCB,ISTZFFEA(UNLOCK))                         00195000
*         GEN REFS(GPR10P,GPR13P,GPR14P,PSACSTK,FRRSCURR,FRRSLAST,FRRS, 00196000
*             FRRSENTR,FRRSPARM,PSALSFCC,FRRSELEN,FRRSFRRA);       0605 00197000
         SETFRR A,FRRAD=(GPR10P),PARMAD=(GPR14P),                      *00198000
               WRKREGS=(GPR13P,GPR14P)                                  00199000
*         GPR14P->WRD00024=GPR11P;  /* SAVE LOCK WORD ADDR           */ 00200000
         ST    GPR11P,WRD00024(,GPR14P)                            0606 00201000
*         GPR14P->WRD10024=GPR09P;  /* SAVE SAVEAREA ADDR            */ 00202000
         ST    GPR09P,WRD10024(,GPR14P)                            0607 00203000
*         GEN(MODESET KEYADDR=(2)); /* RESTORE KEY FROM REG 2        */ 00204000
         MODESET KEYADDR=(2)                                            00205000
*         GPR02P=GPR09P->ZSAFSVR2;  /* RESTORE REG 2                 */ 00206000
         L     GPR02P,ZSAFSVR2(,GPR09P)                            0609 00207000
*         GPR15P=GPR09P;            /* KEEP ADDR OF SAVEAREA         */ 00208000
         LR    GPR15P,GPR09P                                       0610 00209000
*         GEN REFS(ZSAFSVVR)(LM    9,14,ZSAFSVVR+0(15));/* RESTORE   */ 00210000
         LM    9,14,ZSAFSVVR+0(15)                                      00211000
*         GPR15P->ZSAFSV19->ZSAF19R1=GPR01P;/* SAVE R1 FOR CALLER    */ 00212000
         L     @08,ZSAFSV19(,GPR15P)                               0612 00213000
         ST    GPR01P,ZSAF19R1(,@08)                               0612 00214000
*         GPR01P=ADDR(LDNRPH);      /* R1=ADDR FIXED RPH             */ 00215000
         LA    GPR01P,LDNRPH(,PTRLDN)                              0613 00216000
*         GPR15P->ZSAFSV19->ZSAF19RD=GPR13P;/* SAVE R13 FOR CALLER   */ 00217000
         ST    GPR13P,ZSAF19RD(,@08)                               0614 00218000
*         GPR13P=GPR15P;            /* SET UP FIXED SAVEAREA PTR     */ 00219000
         LR    GPR13P,GPR15P                                       0615 00220000
*         RFY                                                      0616 00221000
*          (GPR01P,                                                0616 00222000
*           GPR02P,                                                0616 00223000
*           GPR03P,                                                0616 00224000
*           GPR09P,                                                0616 00225000
*           GPR10P,                                                0616 00226000
*           GPR11P,                                                0616 00227000
*           GPR14P,                                                0616 00228000
*           GPR15P) UNRSTD;                                        0616 00229000
*       END;                        /* *** END TPZLOCK ***           */ 00230000
*                                                                  0617 00231000
*       /*************************************************************/ 00232000
*       /*                                                           */ 00233000
*       /*                                                   @XL03HHY*/ 00234000
*       /*                                                           */ 00235000
*       /*************************************************************/ 00236000
*                                                                  0618 00237000
*       RFY                                                        0618 00238000
*         PTRG00 RSTD;              /* RESTRICT I/O INIT PARAM REG   */ 00239000
*       PTRG00=4;                   /* SET PARAM TO I/O INIT         */ 00240000
         LA    PTRG00,4                                            0619 00241000
*       RFY                                                        0620 00242000
*         PTRG15 RSTD;              /* RESTRICT RETURN CODE REG      */ 00243000
*       CALL ZLFZEAAA;              /* CALL I/O INITIATION           */ 00244000
         L     @14,ATCZLFVT(,PTRATC)                               0621 00245000
         L     @15,ZLFZEAAA(,@14)                                  0621 00246000
         BALR  @14,@15                                             0621 00247000
*       RFY                                                        0622 00248000
*         PTRG00 UNRSTD;            /* UNRESTRICT PARAM REG          */ 00249000
*       IF PTRG15=0 THEN            /* IF I/O TO BE STARTED          */ 00250000
         LTR   PTRG15,PTRG15                                       0623 00251000
         BNZ   @RF00623                                            0623 00252000
*         CALL ZLFZFAFA;            /* CALL I/O SCHEDULER            */ 00253000
         L     @14,ATCZLFVT(,PTRATC)                               0624 00254000
         L     @15,ZLFZFAFA(,@14)                                  0624 00255000
         BALR  @14,@15                                             0624 00256000
*       ELSE                                                       0625 00257000
*         ;                         /* NULL ELSE FOR I/O NOT STARTED */ 00258000
@RF00623 DS    0H                                                  0626 00259000
*       RFY                                                        0626 00260000
*         PTRG15 UNRSTD;            /* UNRESTRICT RETURN CODE REG    */ 00261000
*/*TPZLOCK  (RELEASE,(LDNCB,ISTZFFEA(LOCK)),VTAM,LDNRPH,SAV13)   TYNCB( 00262000
*DNCB)                                                               */ 00263000
*                                                                  0627 00264000
*       DO;                                                        0627 00265000
*                                                                  0627 00266000
*/* ATBUILD (ISTZFSAV,ISTZ19SV)                                      */ 00267000
*/* END OF ATBUILD                                                   */ 00268000
*                                                                  0628 00269000
*         RFY                                                      0628 00270000
*          (GPR01P,                                                0628 00271000
*           GPR02P,                                                0628 00272000
*           GPR03P,                                                0628 00273000
*           GPR09P,                                                0628 00274000
*           GPR10P,                                                0628 00275000
*           GPR11P,                                                0628 00276000
*           GPR14P,                                                0628 00277000
*           GPR15P) RSTD;                                          0628 00278000
*         GEN SETS(ZSAFSVVR)(STM   9,14,ZSAFSVVR+0(13));/* SAVE REGS */ 00279000
         STM   9,14,ZSAFSVVR+0(13)                                      00280000
*         GPR09P=GPR13P;            /* SAVE SAVEAREA PTR ACROSS    0630 00281000
*                                      MACROS                        */ 00282000
         LR    GPR09P,GPR13P                                       0630 00283000
*         GPR09P->ZSAFSVR2=GPR02P;  /* SAVE R2 ACROSS MODE SETS      */ 00284000
         ST    GPR02P,ZSAFSVR2(,GPR09P)                            0631 00285000
*         GEN(MODESET EXTKEY=ZERO,SAVEKEY=(2));                    0632 00286000
*                                                                  0632 00287000
         MODESET EXTKEY=ZERO,SAVEKEY=(2)                                00288000
*         /***********************************************************/ 00289000
*         /*                                                         */ 00290000
*         /* MODE SET TO KEY ZERO                                    */ 00291000
*         /*                                                         */ 00292000
*         /***********************************************************/ 00293000
*                                                                  0633 00294000
*         GEN REFS(GPR13P,GPR14P,PSACSTK,FRRSCURR,FRRS,FRRSEMP,FRRSELEN 00295000
*             ,PSA);                                               0633 00296000
         SETFRR D,WRKREGS=(GPR13P,GPR14P)                               00297000
*         IF GPR09P->ZSAFSV19->ZSAFLOCK='1'B/* CHECK OWNRSHIP FLG    */ 00298000
*           THEN                                                   0634 00299000
         L     @08,ZSAFSV19(,GPR09P)                               0634 00300000
         TM    ZSAFLOCK(@08),B'10000000'                           0634 00301000
         BNO   @RF00634                                            0634 00302000
*           DO;                     /* UCB LOCK OWNED - RELEASE IT   */ 00303000
*             GPR11P=LDNZLOCK;      /* GET UCBLOCK FROM LDNCB        */ 00304000
         L     GPR11P,LDNZLOCK(,PTRLDN)                            0636 00305000
*             GEN REFS(GPR11P,PSALITA,FLC);                        0637 00306000
         SETLOCK RELEASE,TYPE=IOSUCB,ADDR=(11),                        *00307000
               RELATED=(LDNCB,ISTZFFEA(LOCK))                           00308000
*             GPR09P->ZSAFSV19->ZSAFLOCK='0'B;/* RESET OWNERSHIP FLAG*/ 00309000
         L     @08,ZSAFSV19(,GPR09P)                               0638 00310000
         NI    ZSAFLOCK(@08),B'01111111'                           0638 00311000
*           END;                    /* END RELEASE LOCK              */ 00312000
*         ELSE                                                     0640 00313000
*           ;                       /* LOCK NOT OWNED                */ 00314000
@RF00634 DS    0H                                                  0641 00315000
*         GEN(MODESET KEYADDR=(2)); /* RESTORE KEY FROM REG 2        */ 00316000
         MODESET KEYADDR=(2)                                            00317000
*         GPR02P=GPR09P->ZSAFSVR2;  /* RESTORE REG 2                 */ 00318000
         L     GPR02P,ZSAFSVR2(,GPR09P)                            0642 00319000
*         GPR15P=GPR09P->ZSAFSV19;  /* KEEP ADDR OF 19 WORD SAVEAREA */ 00320000
         L     GPR15P,ZSAFSV19(,GPR09P)                            0643 00321000
*         GEN REFS(ZSAFSVVR)(LM    9,14,ZSAFSVVR+0(9));/* RESTORE    */ 00322000
         LM    9,14,ZSAFSVVR+0(9)                                       00323000
*         GPR01P=GPR15P->ZSAF19R1;  /* RESTORE R1 FOR CALLER         */ 00324000
         L     GPR01P,ZSAF19R1(,GPR15P)                            0645 00325000
*         GPR13P=GPR15P->ZSAF19RD;  /* RESTORE R13 FOR CALLER        */ 00326000
         L     GPR13P,ZSAF19RD(,GPR15P)                            0646 00327000
*         RFY                                                      0647 00328000
*          (GPR01P,                                                0647 00329000
*           GPR02P,                                                0647 00330000
*           GPR03P,                                                0647 00331000
*           GPR09P,                                                0647 00332000
*           GPR10P,                                                0647 00333000
*           GPR11P,                                                0647 00334000
*           GPR14P,                                                0647 00335000
*           GPR15P) UNRSTD;                                        0647 00336000
*       END;                        /* *** END TPZLOCK ***           */ 00337000
*                                                                  0648 00338000
*       /*************************************************************/ 00339000
*       /*                                                           */ 00340000
*       /*                                                   @XL03HHY*/ 00341000
*       /*                                                           */ 00342000
*       /*************************************************************/ 00343000
*                                                                  0649 00344000
*     END NOTEST;                   /* END DO FOR NOT TEST MODE      */ 00345000
*/* TPZRETN                                                          */ 00346000
*                                                                  0650 00347000
*   DO;                                                            0650 00348000
@RC00574 DS    0H                                                  0651 00349000
*     RFY                                                          0651 00350000
*      (GPR07P,                                                    0651 00351000
*       GPR14P,                                                    0651 00352000
*       GPR15P) RSTD;                                              0651 00353000
*     GPR13P=ZSAZSVBC;                                             0652 00354000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0652 00355000
*     IF GPR13P=0 THEN                                             0653 00356000
         LTR   GPR13P,GPR13P                                       0653 00357000
         BZ    @RT00653                                            0653 00358000
*       ;                           /* TPDVTS ISTZFARR               */ 00359000
*     ELSE                                                         0655 00360000
*       GPR14P=ZSAZSVRR;                                           0655 00361000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0655 00362000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0656 00363000
@RT00653 DS    0H                                                  0656 00364000
         LM    7,12,ZSAZSVVR+0(13)                                      00365000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0657 00366000
         BR    GPR14P                                                   00367000
*     RFY                                                          0658 00368000
*      (GPR07P,                                                    0658 00369000
*       GPR14P,                                                    0658 00370000
*       GPR15P) UNRSTD;                                            0658 00371000
*   END;                                                           0659 00372000
*                                                                  0659 00373000
*/* END TPZRETN                                                      */ 00374000
*                                                                  0660 00375000
*                                   /* RESTORE REGS AND RETURN       */ 00376000
*                                                                  0660 00377000
*/********************************************************************/ 00378000
*/* PHASE TSTMODE -                                                  */ 00379000
*/* IF NOT ATTENTION OR DELAYED DE, CLEAR I/O BUSY AND RETURN        */ 00380000
*/* IF ATTENTION OR DELAYED DE,                                      */ 00381000
*/*    GET A BUFFER FROM THE BUFFER ALLOCATION UTILITY,              */ 00382000
*/*    MOVE THE CSW INTO IT, SET ZLB, FDB AND FSB FIELDS,            */ 00383000
*/*    IF DELAYED READ AND HIO FLAG ON, QUEUE THE FSB TO THE         */ 00384000
*/*        FEEDBACK ROUTER PAB, AND CALL SIO Q CLEANUP               */ 00385000
*/********************************************************************/ 00386000
*                                                                  0660 00387000
*                                                                  0660 00388000
*/* SEGMENT(TSTMODE)START                                            */ 00389000
*                                                                  0660 00390000
*   DO;                                                            0660 00391000
*     GOTO TSTMODE@;                                               0661 00392000
*TSTMODE:                                                          0662 00393000
*   END;                                                           0662 00394000
TSTMODE  DS    0H                                                  0663 00395000
*TEST:                                                             0663 00396000
*   DO WHILE((LDNZF005='1'B)|(LDNZF004='1'B));/* DO WHILE ATTENTION     00397000
*                                      OR DELAYED DEVICE END         */ 00398000
TEST     B     @DE00663                                            0663 00399000
@DL00663 DS    0H                                                  0664 00400000
*     ZCRPCOD1=0;                   /* ZERO PARAMETER BYTE           */ 00401000
         L     @15,RPHCRR(,PTRRPH)                                 0664 00402000
         L     @15,CRACRR(,@15)                                    0664 00403000
         MVI   ZCRPCOD1(@15),X'00'                                 0664 00404000
*     ZCRPBUF='1'B;                 /* TURN ON BIT TO GET A BUFFER   */ 00405000
*     ZCRPPG='1'B;                  /* TURN ON BIT TO GET PAGEABLE 0666 00406000
*                                      BUFFER                        */ 00407000
         OI    ZCRPBUF(@15),B'10000100'                            0666 00408000
*     CALL ZPSZDFA0;                /* CALL BUFFER ALLOCATION        */ 00409000
         L     @14,ATCZPSVT(,PTRATC)                               0667 00410000
         L     @15,ZPSZDFA0(,@14)                                  0667 00411000
         BALR  @14,@15                                             0667 00412000
*     PTRZLB=RPHSRPRM;              /* GET THE ADDR OF THE BUFFER    */ 00413000
         L     PTRZLB,RPHSRPRM(,PTRRPH)                            0668 00414000
*     IF LDNZF004='1'B THEN         /* IF DELAYED DEVICE END         */ 00415000
         TM    LDNZF004(PTRLDN),B'00100000'                        0669 00416000
         BNO   @RF00669                                            0669 00417000
*DELDE:                                                            0670 00418000
*       DO;                                                        0670 00419000
DELDE    DS    0H                                                  0671 00420000
*         ZLBCOMP=ZLBTSUC;          /* SET TEST COMPLETE RC          */ 00421000
         MVI   ZLBCOMP(PTRZLB),X'20'                               0671 00422000
*         ZLBTEXT1(1:8)=LDNZC002(1:8);/* MOVE DE CSW INTO BUFFER     */ 00423000
         MVC   ZLBTEXT1(8,PTRZLB),LDNZC002(PTRLDN)                 0672 00424000
*       END DELDE;                  /* END DO FOR DELAYED DEVICE END */ 00425000
*     ELSE                          /* IF NOT DELAYED DE             */ 00426000
*NODELDE:                                                          0674 00427000
*       DO;                                                        0674 00428000
         B     @RC00669                                            0674 00429000
@RF00669 DS    0H                                                  0674 00430000
NODELDE  DS    0H                                                  0675 00431000
*         LDNZF005='0'B;            /* CLEAR TOLTEP ATTN FLAG        */ 00432000
         L     @00,LDNZF005-3(,PTRLDN)                             0675 00433000
@GL00001 LR    @15,@00                                             0675 00434000
         N     @15,@CF05035                                        0675 00435000
         CS    @00,@15,LDNZF005-3(PTRLDN)                          0675 00436000
         BNE   @GL00001                                            0675 00437000
*         ZLBCOMP=ZLBATTNR;         /* SET CODE FOR TOLTEP ATTN      */ 00438000
         MVI   ZLBCOMP(PTRZLB),X'34'                               0676 00439000
*         ZLBTEXT1(1:8)=LDNZACSW(1:8);/* MOVE ATTN CSW INTO BUFFER   */ 00440000
         MVC   ZLBTEXT1(8,PTRZLB),LDNZACSW(PTRLDN)                 0677 00441000
*       END NODELDE;                /* END DO FOR NOT DELAYED DE     */ 00442000
*     FDBDATAA=ADDR(ZLBTEXT1);      /* SET FDB DATA ADDRESS          */ 00443000
@RC00669 LA    @00,ZLBTEXT1(,PTRZLB)                               0679 00444000
         ST    @00,FDBDATAA(,PTRZLB)                               0679 00445000
*     FDBDATCT=8;                   /* SET FDB DATA COUNT            */ 00446000
         MVC   FDBDATCT(2,PTRZLB),@CH00072                         0680 00447000
*     FSBTYPE=FSTYPE;               /* SET FSB TYPE                  */ 00448000
         LA    @15,16                                              0681 00449000
         ALR   @15,PTRZLB                                          0681 00450000
         MVI   FSBTYPE(@15),X'02'                                  0681 00451000
*     FSBLNGTH=LENGTH(ISTFSB);      /* SET FSB LENGTH                */ 00452000
         MVI   FSBLNGTH(@15),X'2C'                                 0682 00453000
*     ZLBTCP=LDNZTCP;               /* SET PTR TO CHANNEL PROGRAM    */ 00454000
         L     @00,LDNZTCP(,PTRLDN)                                0683 00455000
         ST    @00,ZLBTCP(,PTRZLB)                                 0683 00456000
*     FSBSAF=LDNTSAF;               /* SET FSB SAF                   */ 00457000
         MVC   FSBSAF(2,@15),LDNTSAF(PTRLDN)                       0684 00458000
*     FSBDAF=ADDR(LDNCB)->NCBDAF;   /* SET FSB DAF                   */ 00459000
         MVC   FSBDAF(2,@15),NCBDAF(PTRLDN)                        0685 00460000
*/*  TPQUE (ADDR(ZLBFSB),ADDR(ATCZPAB1)->DYPPAB) NORM                */ 00461000
*                                                                  0686 00462000
*     DO;                                                          0686 00463000
*       RFY                                                        0687 00464000
*        (GPR00P,                                                  0687 00465000
*         GPR01P,                                                  0687 00466000
*         GPR04P,                                                  0687 00467000
*         GPR05P,                                                  0687 00468000
*         GPR15P) RSTD;                                            0687 00469000
*       GEN REFS(GPR01P) SETS(RPHWORK)                             0688 00470000
*           (STM GPR02P,GPR08P,RPHWORK(GPR01P));                   0688 00471000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00472000
*       GPR00P=0;                                                  0689 00473000
         SLR   GPR00P,GPR00P                                       0689 00474000
*       GPR15P=ADDR(ADDR(ATCZPAB1)->DYPPAB);/* HOLD PAB PTR          */ 00475000
         LA    GPR15P,DYPPAB+1104(,PTRATC)                         0690 00476000
*       GPR04P=ADDR(ZLBFSB);        /* WORK ELE PTR                  */ 00477000
         LA    GPR04P,ZLBFSB(,PTRZLB)                              0691 00478000
*       GPR05P=GPR15P;              /* PASS PAB PTR                  */ 00479000
         LR    GPR05P,GPR15P                                       0692 00480000
*       CALL ATCLCPTR->ATCAP37->ISTAPC37;                          0693 00481000
         L     @14,ATCLCPTR                                        0693 00482000
         L     @15,ATCAP37(,@14)                                   0693 00483000
         BALR  @14,@15                                             0693 00484000
*       GEN(NOPR  0)                                               0694 00485000
*       NOSETS NOREFS;                                             0694 00486000
         NOPR  0                                                        00487000
*       RFY                                                        0695 00488000
*        (GPR00P,                                                  0695 00489000
*         GPR01P,                                                  0695 00490000
*         GPR04P,                                                  0695 00491000
*         GPR05P,                                                  0695 00492000
*         GPR15P) UNRSTD;                                          0695 00493000
*     END;                          /* *** END OF TPQUE GENERATION 0696 00494000
*                                      QUEUE FSB TO FEEDBACK ROUTER     00495000
*                                                            @XL03HFZ*/ 00496000
*     IF(LDNZF004='1'B)&(LDNZF008='1'B) THEN                       0697 00497000
         TM    LDNZF004(PTRLDN),B'00100010'                        0697 00498000
         BNO   @RF00697                                            0697 00499000
*       DO;                         /* IF DELAYED DE & HIO   @XL03HFZ*/ 00500000
*         ZLBCOMP=ZLBTCMDR;         /* SET RESET COMPLT. CODE        */ 00501000
         MVI   ZLBCOMP(PTRZLB),X'24'                               0699 00502000
*         PTRZLB=LDNZV001;          /* LOAD RESET BUFFER ADDRESS     */ 00503000
         L     PTRZLB,LDNZV001(,PTRLDN)                            0700 00504000
*         CALL ZLFZFFXA;            /* CALL SIOQ CLEAN UP            */ 00505000
         L     @14,ATCZLFVT(,PTRATC)                               0701 00506000
         L     @15,ZLFZFFXA(,@14)                                  0701 00507000
         BALR  @14,@15                                             0701 00508000
*         LDNZF008='0'B;            /* CLEAR HIO FLAG                */ 00509000
         L     @00,LDNZF008-3(,PTRLDN)                             0702 00510000
@GL00002 LR    @15,@00                                             0702 00511000
         N     @15,@CF05038                                        0702 00512000
         CS    @00,@15,LDNZF008-3(PTRLDN)                          0702 00513000
         BNE   @GL00002                                            0702 00514000
*       END;                        /* END DO FOR DELAYD DE & HIO    */ 00515000
*     ELSE                                                         0704 00516000
*       ;                           /* NULL ELSE FOR NOT DELAYED DE     00517000
*                                      OR NOT HIO                    */ 00518000
@RF00697 DS    0H                                                  0705 00519000
*     LDNZF004='0'B;                /* CLEAR DELAYED DE FLAG         */ 00520000
         L     @00,LDNZF004-3(,PTRLDN)                             0705 00521000
@GL00003 LR    @15,@00                                             0705 00522000
         N     @15,@CF05041                                        0705 00523000
         CS    @00,@15,LDNZF004-3(PTRLDN)                          0705 00524000
         BNE   @GL00003                                            0705 00525000
*   END TEST;                       /* END DO WHILE FOR ATTN OR    0706 00526000
*                                      DELAYED DE                    */ 00527000
@DE00663 TM    LDNZF005(PTRLDN),B'00110000'                        0706 00528000
         BNZ   @DL00663                                            0706 00529000
*   LDNZIOBY='0'B;                  /* CLEAR IOB BUSY                */ 00530000
         L     @00,LDNZIOBY(,PTRLDN)                               0707 00531000
@GL00004 LR    @15,@00                                             0707 00532000
         N     @15,@CF05044                                        0707 00533000
         CS    @00,@15,LDNZIOBY(PTRLDN)                            0707 00534000
         BNE   @GL00004                                            0707 00535000
*/* SEGMENT(TSTMODE)FINISH                                           */ 00536000
*                                                                  0708 00537000
*   DO;                                                            0708 00538000
*     GOTO TSTMODE#;                                               0709 00539000
         B     TSTMODE#                                            0709 00540000
*TSTMODE@:                                                         0710 00541000
*   END;                                                           0710 00542000
*                                                                  0710 00543000
TSTMODE@ DS    0H                                                  0711 00544000
*/* TPEPILOG                                                         */ 00545000
*                                                                  0711 00546000
*   GEN(PRINT OFF);                                                0711 00547000
         PRINT OFF                                                      00548000
*   DCL                                                            0712 00549000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 00550000
*   DCL                                                            0713 00551000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 00552000
*   GEN(PRINT ON);                                                 0714 00553000
*                                                                  0714 00554000
         PRINT ON                                                       00555000
*/* END OF TPEPILOG                                                  */ 00556000
*                                                                  0715 00557000
*   END ISTZFFEA                                                   0715 00558000
*                                                                  0715 00559000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00560000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00561000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00562000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00563000
*/*%INCLUDE SYSLIB  (IHAFRRS )                                       */ 00564000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 00565000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00566000
*                                                                  0715 00567000
*       ;                                                          0715 00568000
@EL00001 DS    0H                                                  0715 00569000
@EF00001 DS    0H                                                  0715 00570000
@ER00001 BR    @14                                                 0715 00571000
@DATA    DS    0H                                                       00572000
@CH00072 DC    H'8'                                                     00573000
@DATD    DSECT                                                          00574000
         DS    0F                                                       00575000
ISTZFFEA CSECT                                                          00576000
         DS    0F                                                       00577000
@CF05033 DC    XL4'0000FFFF'                                            00578000
@CF05035 DC    BL4'11111111111111111111111111101111'                    00579000
@CF05038 DC    BL4'11111111111111111111111111111101'                    00580000
@CF05041 DC    BL4'11111111111111111111111111011111'                    00581000
@CF05044 DC    BL4'10111111111111111111111111111111'                    00582000
@DATD    DSECT                                                          00583000
         DS    0D                                                       00584000
IOSBPTR  DS    A                                                        00585000
SRBPTR   DS    A                                                        00586000
FRRSPTR  DS    A                                                        00587000
FRREPTR  DS    A                                                        00588000
UCBPTR   DS    A                                                        00589000
CVTPTR   DS    A                                                        00590000
LCPBPTR  DS    A                                                        00591000
LDNCBPTR DS    A                                                        00592000
DNCBPTR  DS    A                                                        00593000
FMCBPTR  DS    A                                                        00594000
FSBPTR   DS    A                                                        00595000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00596000
@ENDDATD EQU   *                                                        00597000
ISTZFFEA CSECT                                                          00598000
         DS    0F                                                       00599000
@SIZDATD DC    AL1(0)                                                   00600000
         DC    AL3(@ENDDATD-@DATD)                                      00601000
         DS    0D                                                       00602000
@CC04988 DC    C'FCEA'                                                  00603000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00604000
@01      EQU   01                                                       00605000
@02      EQU   02                                                       00606000
@03      EQU   03                                                       00607000
@04      EQU   04                                                       00608000
@05      EQU   05                                                       00609000
@06      EQU   06                                                       00610000
@07      EQU   07                                                       00611000
@08      EQU   08                                                       00612000
@09      EQU   09                                                       00613000
@10      EQU   10                                                       00614000
@11      EQU   11                                                       00615000
@12      EQU   12                                                       00616000
@13      EQU   13                                                       00617000
@14      EQU   14                                                       00618000
@15      EQU   15                                                       00619000
RPHPTR   EQU   @01                                                      00620000
GPR00P   EQU   @00                                                      00621000
GPR01P   EQU   @01                                                      00622000
GPR02P   EQU   @02                                                      00623000
GPR03P   EQU   @03                                                      00624000
GPR04P   EQU   @04                                                      00625000
GPR05P   EQU   @05                                                      00626000
GPR07P   EQU   @07                                                      00627000
GPR09P   EQU   @09                                                      00628000
GPR10P   EQU   @10                                                      00629000
GPR11P   EQU   @11                                                      00630000
GPR12P   EQU   @12                                                      00631000
GPR13P   EQU   @13                                                      00632000
GPR14P   EQU   @14                                                      00633000
GPR15P   EQU   @15                                                      00634000
PTRG00   EQU   @00                                                      00635000
PTRRPH   EQU   @01                                                      00636000
PTRATC   EQU   @02                                                      00637000
PTRLDN   EQU   @03                                                      00638000
PTRDNC   EQU   @04                                                      00639000
PTRFMC   EQU   @05                                                      00640000
PTRZLB   EQU   @06                                                      00641000
PTRLCP   EQU   @07                                                      00642000
PTRLSC   EQU   @07                                                      00643000
PTRG08   EQU   @08                                                      00644000
PTRG12   EQU   @12                                                      00645000
PTRG13   EQU   @13                                                      00646000
PTRG15   EQU   @15                                                      00647000
GPR00F   EQU   @00                                                      00648000
GPR01F   EQU   @01                                                      00649000
GPR02F   EQU   @02                                                      00650000
GPR03F   EQU   @03                                                      00651000
GPR04F   EQU   @04                                                      00652000
GPR05F   EQU   @05                                                      00653000
GPR06F   EQU   @06                                                      00654000
GPR06P   EQU   @06                                                      00655000
GPR07F   EQU   @07                                                      00656000
GPR08F   EQU   @08                                                      00657000
GPR08P   EQU   @08                                                      00658000
GPR09F   EQU   @09                                                      00659000
GPR10F   EQU   @10                                                      00660000
GPR11F   EQU   @11                                                      00661000
GPR12F   EQU   @12                                                      00662000
GPR13F   EQU   @13                                                      00663000
GPR14F   EQU   @14                                                      00664000
GPR15F   EQU   @15                                                      00665000
PTRG09   EQU   @09                                                      00666000
PTRG10   EQU   @10                                                      00667000
PTRG11   EQU   @11                                                      00668000
PTRG14   EQU   @14                                                      00669000
PSA      EQU   0                                                        00670000
FLCRNPSW EQU   PSA                                                      00671000
FLCROPSW EQU   PSA+8                                                    00672000
FLCICCW2 EQU   PSA+16                                                   00673000
PSAEEPSW EQU   PSA+132                                                  00674000
PSAESPSW EQU   PSA+136                                                  00675000
FLCSVILC EQU   PSAESPSW+1                                               00676000
PSAEPPSW EQU   PSA+140                                                  00677000
FLCPIILC EQU   PSAEPPSW+1                                               00678000
FLCPICOD EQU   PSAEPPSW+2                                               00679000
PSAPICOD EQU   FLCPICOD+1                                               00680000
FLCTEA   EQU   PSAEPPSW+4                                               00681000
FLCPER   EQU   PSA+152                                                  00682000
FLCMCLA  EQU   PSA+168                                                  00683000
FLCIOEL  EQU   FLCMCLA+4                                                00684000
FLCIOA   EQU   FLCMCLA+16                                               00685000
FLCFSA   EQU   FLCMCLA+80                                               00686000
PSACPUPA EQU   PSA+516                                                  00687000
PSASUPER EQU   PSA+552                                                  00688000
PSASUP1  EQU   PSASUPER                                                 00689000
PSASUP2  EQU   PSASUPER+1                                               00690000
PSASUP3  EQU   PSASUPER+2                                               00691000
PSASUP4  EQU   PSASUPER+3                                               00692000
PSACLHT  EQU   PSA+640                                                  00693000
PSALKSA  EQU   PSA+696                                                  00694000
PSAHLHI  EQU   PSA+760                                                  00695000
PSALITA  EQU   PSA+764                                                  00696000
PSADSSFL EQU   PSA+836                                                  00697000
PSADSSF1 EQU   PSADSSFL                                                 00698000
PSADSSF3 EQU   PSADSSFL+2                                               00699000
PSADSSF4 EQU   PSADSSFL+3                                               00700000
PSARSVT  EQU   PSA+896                                                  00701000
PSALSFCC EQU   PSA+1012                                                 00702000
ATCLCPTR EQU   1032                                                     00703000
IOSB     EQU   0                                                        00704000
IOSFLA   EQU   IOSB                                                     00705000
IOSACHN  EQU   IOSFLA                                                   00706000
IOSFLB   EQU   IOSB+1                                                   00707000
IOSFLC   EQU   IOSB+2                                                   00708000
IOSDVALT EQU   IOSFLC                                                   00709000
IOSPKEY  EQU   IOSB+12                                                  00710000
IOSOPT   EQU   IOSB+14                                                  00711000
IOSOPT2  EQU   IOSB+15                                                  00712000
@NM00002 EQU   IOSB+20                                                  00713000
IOSCSW   EQU   @NM00002+1                                               00714000
IOSTATUS EQU   IOSCSW+3                                                 00715000
IOSIPIB  EQU   IOSB+44                                                  00716000
IOSPATH  EQU   IOSB+86                                                  00717000
IOSCHN   EQU   IOSPATH                                                  00718000
IOSCKEY  EQU   IOSB+89                                                  00719000
IOSEEKA  EQU   IOSB+100                                                 00720000
IOSCCHH  EQU   IOSEEKA+3                                                00721000
IOSSKHH  EQU   IOSCCHH+2                                                00722000
SRBSECT  EQU   0                                                        00723000
SRBFLC   EQU   SRBSECT+12                                               00724000
FRRS     EQU   0                                                        00725000
FRRSHEAD EQU   FRRS                                                     00726000
FRRSEMP  EQU   FRRSHEAD                                                 00727000
FRRSLAST EQU   FRRSHEAD+4                                               00728000
FRRSELEN EQU   FRRSHEAD+8                                               00729000
FRRSCURR EQU   FRRSHEAD+12                                              00730000
FRRSENTR EQU   0                                                        00731000
FRRSFRRA EQU   FRRSENTR                                                 00732000
FRRSFLGS EQU   FRRSENTR+4                                               00733000
FRRSFLG1 EQU   FRRSFLGS                                                 00734000
FRRSPARM EQU   FRRSENTR+8                                               00735000
UCB      EQU   0                                                        00736000
UCBOB    EQU   0                                                        00737000
UCBJBNR  EQU   UCBOB                                                    00738000
UCBFL5   EQU   UCBOB+1                                                  00739000
UCBAF    EQU   UCBFL5                                                   00740000
UCBSTAT  EQU   UCBOB+3                                                  00741000
UCBCHAN  EQU   UCBOB+4                                                  00742000
UCBSFLS  EQU   UCBOB+6                                                  00743000
UCBFLA   EQU   UCBSFLS                                                  00744000
UCBFL1   EQU   UCBFLA                                                   00745000
UCBBSY   EQU   UCBFL1                                                   00746000
UCBNRY   EQU   UCBFL1                                                   00747000
UCBPST   EQU   UCBFL1                                                   00748000
UCBCUB   EQU   UCBFL1                                                   00749000
UCBFLB   EQU   UCBSFLS+1                                                00750000
UCBCHM   EQU   UCBOB+8                                                  00751000
UCBCHM1  EQU   UCBCHM                                                   00752000
UCBPTH0  EQU   UCBCHM1                                                  00753000
UCBPTH1  EQU   UCBCHM1                                                  00754000
UCBWGT   EQU   UCBOB+12                                                 00755000
UCBTYP   EQU   UCBOB+16                                                 00756000
UCBTBYT1 EQU   UCBTYP                                                   00757000
UCB1FEA5 EQU   UCBTBYT1                                                 00758000
UCB1FEA6 EQU   UCBTBYT1                                                 00759000
UCBTBYT2 EQU   UCBTYP+1                                                 00760000
UCB2OPT2 EQU   UCBTBYT2                                                 00761000
UCBDUDN1 EQU   UCB2OPT2                                                 00762000
UCB2OPT3 EQU   UCBTBYT2                                                 00763000
UCBDUDN2 EQU   UCB2OPT3                                                 00764000
UCB2OPT4 EQU   UCBTBYT2                                                 00765000
UCBRWTAU EQU   UCB2OPT4                                                 00766000
UCB2OPT6 EQU   UCBTBYT2                                                 00767000
UCB2OPT7 EQU   UCBTBYT2                                                 00768000
UCBTBYT3 EQU   UCBTYP+2                                                 00769000
UCBDVCLS EQU   UCBTBYT3                                                 00770000
UCBTBYT4 EQU   UCBTYP+3                                                 00771000
UCBEXTPT EQU   UCBOB+20                                                 00772000
UCBFLC   EQU   UCBEXTPT                                                 00773000
UCBDEV   EQU   UCBOB+24                                                 00774000
UCBCMEXT EQU   0                                                        00775000
UCBATI   EQU   UCBCMEXT+3                                               00776000
@NM00039 EQU   UCBATI                                                   00777000
UCBFLP1  EQU   UCBCMEXT+5                                               00778000
UCBMT    EQU   0                                                        00779000
UCBOCR   EQU   0                                                        00780000
UCB3540X EQU   0                                                        00781000
UCBDKBYT EQU   UCB3540X+6                                               00782000
UCB3800X EQU   0                                                        00783000
UCBOPTNS EQU   UCB3800X                                                 00784000
UCBACTIV EQU   UCB3800X+3                                               00785000
UCBMDRBF EQU   UCB3800X+36                                              00786000
UCBUCS   EQU   0                                                        00787000
UCBUCSOP EQU   UCBUCS+4                                                 00788000
UCBFCBOP EQU   UCBUCS+5                                                 00789000
CVTMAP   EQU   0                                                        00790000
CVTDAR   EQU   CVTMAP+72                                                00791000
CVTFLGS1 EQU   CVTDAR                                                   00792000
CVTDCB   EQU   CVTMAP+116                                               00793000
CVTIERLC EQU   CVTMAP+144                                               00794000
CVTOPTA  EQU   CVTMAP+182                                               00795000
CVTOPTB  EQU   CVTMAP+183                                               00796000
CVTGTF   EQU   CVTMAP+236                                               00797000
CVTGTFST EQU   CVTGTF                                                   00798000
CVTGTFS  EQU   CVTGTFST                                                 00799000
CVTSTATE EQU   CVTGTFST                                                 00800000
CVTTMODE EQU   CVTGTFST                                                 00801000
CVTFORM  EQU   CVTGTFST                                                 00802000
CVTAQAVT EQU   CVTMAP+240                                               00803000
CVTTCMFG EQU   CVTAQAVT                                                 00804000
CVTVOLM2 EQU   CVTMAP+244                                               00805000
CVTTATA  EQU   CVTVOLM2                                                 00806000
CVTTSKS  EQU   CVTTATA                                                  00807000
CVTVOLF2 EQU   CVTTSKS                                                  00808000
CVTTAT   EQU   CVTTATA+1                                                00809000
CVTATER  EQU   CVTMAP+248                                               00810000
CVTEXT1  EQU   CVTMAP+252                                               00811000
CVTPURG  EQU   CVTMAP+260                                               00812000
CVTQMSG  EQU   CVTMAP+268                                               00813000
CVTDMSR  EQU   CVTMAP+272                                               00814000
CVTERPV  EQU   CVTMAP+316                                               00815000
CVTINTLA EQU   CVTMAP+320                                               00816000
CVTAPF   EQU   CVTMAP+324                                               00817000
CVTEXT2  EQU   CVTMAP+328                                               00818000
CVTHJES  EQU   CVTMAP+332                                               00819000
CVTPGSIA EQU   CVTMAP+348                                               00820000
CVTA1F1  EQU   CVTMAP+356                                               00821000
CVTSYSK  EQU   CVTMAP+357                                               00822000
CVTVOLM1 EQU   CVTMAP+380                                               00823000
CVTVOLF1 EQU   CVTVOLM1                                                 00824000
CVTATMCT EQU   CVTMAP+388                                               00825000
CVTXTNT1 EQU   0                                                        00826000
CVTXTNT2 EQU   0                                                        00827000
CVTDSSV  EQU   CVTXTNT2                                                 00828000
CVTFLGBT EQU   CVTXTNT2+5                                               00829000
CVTQID   EQU   CVTXTNT2+24                                              00830000
CVTSHS   EQU   CVTXTNT2+40                                              00831000
CVTRV400 EQU   CVTXTNT2+52                                              00832000
CVTRV409 EQU   CVTXTNT2+53                                              00833000
CVTATCVT EQU   CVTXTNT2+64                                              00834000
CVTRV429 EQU   CVTXTNT2+84                                              00835000
CVTRV438 EQU   CVTXTNT2+85                                              00836000
CVTRV457 EQU   CVTXTNT2+112                                             00837000
CVTRV466 EQU   CVTXTNT2+113                                             00838000
CVTFIX   EQU   0                                                        00839000
CVTRELNO EQU   CVTFIX+252                                               00840000
ISTZLFVT EQU   0                                                        00841000
ZLFZEFAA EQU   ISTZLFVT+4                                               00842000
ZLFZEAAA EQU   ZLFZEFAA                                                 00843000
ZLFZFFFA EQU   ISTZLFVT+8                                               00844000
ZLFZFAFA EQU   ZLFZFFFA                                                 00845000
ZLFZEFTA EQU   ISTZLFVT+12                                              00846000
ZLFZEATA EQU   ZLFZEFTA                                                 00847000
ZLFZFFTA EQU   ISTZLFVT+16                                              00848000
ZLFZFATA EQU   ZLFZFFTA                                                 00849000
ZLFZFFXA EQU   ISTZLFVT+20                                              00850000
ZLFZEFFA EQU   ISTZLFVT+24                                              00851000
ZLFZEAFA EQU   ZLFZEFFA                                                 00852000
ZLFZEFCA EQU   ISTZLFVT+28                                              00853000
ZLFZEACA EQU   ZLFZEFCA                                                 00854000
ISTZPSVT EQU   0                                                        00855000
ZPSZDFA0 EQU   ISTZPSVT                                                 00856000
ISTZFSVT EQU   0                                                        00857000
ZFSZEFBB EQU   ISTZFSVT                                                 00858000
ZFSZEABB EQU   ZFSZEFBB                                                 00859000
ZFSZEFAB EQU   ISTZFSVT+4                                               00860000
ZFSZEAAB EQU   ZFSZEFAB                                                 00861000
ISTZLBVT EQU   0                                                        00862000
ISTRPH   EQU   0                                                        00863000
RPHFLAGS EQU   ISTRPH+2                                                 00864000
RPHAPTYP EQU   RPHFLAGS                                                 00865000
RPHFSTLC EQU   RPHFLAGS                                                 00866000
RPHFLGB  EQU   ISTRPH+3                                                 00867000
RPHRPHA  EQU   ISTRPH+4                                                 00868000
RPHTSKID EQU   ISTRPH+8                                                 00869000
RPHRESMA EQU   ISTRPH+16                                                00870000
RPHWPFLG EQU   RPHRESMA                                                 00871000
RPHWEA   EQU   ISTRPH+24                                                00872000
RPHCSPA  EQU   RPHWEA                                                   00873000
RPHSRPRM EQU   ISTRPH+28                                                00874000
RPHCRR   EQU   ISTRPH+32                                                00875000
RPHPABQA EQU   ISTRPH+36                                                00876000
RPHWORK  EQU   ISTRPH+40                                                00877000
RPHSAVE1 EQU   RPHWORK                                                  00878000
RPHSBITS EQU   RPHSAVE1+1                                               00879000
ISTZSAVE EQU   0                                                        00880000
ZSAZSVBC EQU   ISTZSAVE                                                 00881000
ZSAZSVMS EQU   ZSAZSVBC                                                 00882000
ZSAZACTV EQU   ZSAZSVMS                                                 00883000
ZSAZSVFC EQU   ISTZSAVE+4                                               00884000
ZSAZSVRR EQU   ISTZSAVE+8                                               00885000
ZSAZSVVR EQU   ISTZSAVE+12                                              00886000
ZSAZTRAC EQU   ISTZSAVE+36                                              00887000
ISTLCCW  EQU   0                                                        00888000
LCCWOP   EQU   ISTLCCW                                                  00889000
LCCWRWOP EQU   LCCWOP                                                   00890000
LCCWCTL  EQU   LCCWRWOP                                                 00891000
LCCWFLAG EQU   ISTLCCW+1                                                00892000
LCCWLSI  EQU   LCCWFLAG                                                 00893000
ISTLCPB  EQU   0                                                        00894000
LCPREQTG EQU   ISTLCPB+2                                                00895000
LCPFLAGS EQU   LCPREQTG                                                 00896000
LCPZF001 EQU   LCPFLAGS                                                 00897000
LCPZRT02 EQU   LCPZF001                                                 00898000
LCPZF002 EQU   LCPFLAGS                                                 00899000
LCPZRT03 EQU   LCPZF002                                                 00900000
LCPZF003 EQU   LCPFLAGS                                                 00901000
LCPZRT04 EQU   LCPZF003                                                 00902000
LCPZF004 EQU   LCPFLAGS                                                 00903000
LCPZRT05 EQU   LCPZF004                                                 00904000
LCPZRT06 EQU   LCPFLAGS                                                 00905000
LCPZRT07 EQU   LCPFLAGS                                                 00906000
LCPMNRCD EQU   LCPREQTG+1                                               00907000
LCPZRT08 EQU   LCPMNRCD                                                 00908000
LCPZRT09 EQU   LCPMNRCD                                                 00909000
LCPCHAIN EQU   ISTLCPB+4                                                00910000
LCPCHAI1 EQU   LCPCHAIN                                                 00911000
LCPRUCNT EQU   ISTLCPB+8                                                00912000
LCPFLAG2 EQU   ISTLCPB+9                                                00913000
LCPTLBPI EQU   LCPFLAG2                                                 00914000
LCPFID0  EQU   LCPFLAG2                                                 00915000
LCPSEQ   EQU   ISTLCPB+10                                               00916000
LCPCID   EQU   ISTLCPB+16                                               00917000
LCPFDBA  EQU   ISTLCPB+24                                               00918000
LCPFLG1  EQU   ISTLCPB+37                                               00919000
LCPFLCCW EQU   ISTLCPB+40                                               00920000
LCPLCCW  EQU   ISTLCPB+48                                               00921000
LCPPABA  EQU   LCPLCCW+4                                                00922000
LCPRPHA  EQU   LCPPABA                                                  00923000
ISTZCRR  EQU   0                                                        00924000
ZCRCRR   EQU   ISTZCRR                                                  00925000
ZCRFLGS1 EQU   ISTZCRR+12                                               00926000
ZCRFLGS2 EQU   ISTZCRR+13                                               00927000
ZCRSWFLD EQU   ISTZCRR+14                                               00928000
ZCRENDSH EQU   ZCRSWFLD                                                 00929000
ZCRNDLCP EQU   ZCRSWFLD                                                 00930000
ZCRRESET EQU   ZCRSWFLD                                                 00931000
ZCRFLGS3 EQU   ISTZCRR+15                                               00932000
ZCRGENSW EQU   ISTZCRR+16                                               00933000
ZCRPFLGS EQU   ISTZCRR+17                                               00934000
ZCRIBPR  EQU   ISTZCRR+18                                               00935000
ZCRSCPSW EQU   ISTZCRR+19                                               00936000
ZCRPARMS EQU   ISTZCRR+24                                               00937000
ZCRFBPTR EQU   ZCRPARMS                                                 00938000
ZCRDFRDA EQU   ZCRPARMS+10                                              00939000
ZCRPCOD1 EQU   ZCRPARMS+12                                              00940000
ZCRPPG   EQU   ZCRPCOD1                                                 00941000
ZCRPLNG  EQU   ZCRPCOD1                                                 00942000
ZCRPLSBF EQU   ZCRPCOD1                                                 00943000
ZCRPBUF  EQU   ZCRPCOD1                                                 00944000
ZCRPCOD2 EQU   ZCRPARMS+13                                              00945000
ZCRSVRTN EQU   ISTZCRR+56                                               00946000
ZCRWKARA EQU   ISTZCRR+156                                              00947000
ZCRCIDSV EQU   ISTZCRR+192                                              00948000
ZCRAUDIT EQU   ISTZCRR+440                                              00949000
ZCRENTER EQU   ZCRAUDIT+5                                               00950000
ZCREFCEA EQU   ZCRENTER+8                                               00951000
ZCRLCPB  EQU   ISTZCRR+480                                              00952000
ZCRRHRU  EQU   ZCRLCPB                                                  00953000
ISTPFCRR EQU   0                                                        00954000
PFCCRR   EQU   ISTPFCRR                                                 00955000
PFCCRRID EQU   PFCCRR                                                   00956000
PFCCRRLN EQU   PFCCRR+2                                                 00957000
PFCHDR   EQU   ISTPFCRR+4                                               00958000
PFCCRRO  EQU   PFCHDR                                                   00959000
PFCFRRO  EQU   PFCHDR+4                                                 00960000
ISTAPCRR EQU   0                                                        00961000
APCATFLG EQU   ISTAPCRR+16                                              00962000
APCRFLG  EQU   ISTAPCRR+18                                              00963000
APCSAVE  EQU   ISTAPCRR+44                                              00964000
APCCOMF  EQU   ISTAPCRR+116                                             00965000
APCCOMF1 EQU   APCCOMF                                                  00966000
APC31FLG EQU   ISTAPCRR+132                                             00967000
APC52FLG EQU   ISTAPCRR+133                                             00968000
APC53FLG EQU   ISTAPCRR+134                                             00969000
APC54FLG EQU   ISTAPCRR+135                                             00970000
APC57FLG EQU   ISTAPCRR+136                                             00971000
ISTDCCRR EQU   0                                                        00972000
CRRSPACE EQU   ISTDCCRR+12                                              00973000
CRRSAREA EQU   0                                                        00974000
CRRMAS   EQU   CRRSAREA+148                                             00975000
CRRMAS1  EQU   CRRMAS                                                   00976000
CRRMAS2  EQU   CRRMAS+1                                                 00977000
CRRMAS3  EQU   CRRMAS+2                                                 00978000
CRRMAS4  EQU   CRRMAS+3                                                 00979000
CRRRMAS1 EQU   CRRMAS+4                                                 00980000
CRRRMAS2 EQU   CRRMAS+5                                                 00981000
CRRRMAS3 EQU   CRRMAS+6                                                 00982000
CRRSMAS  EQU   CRRRMAS3                                                 00983000
CRRATS   EQU   CRRSAREA+156                                             00984000
CRRATS1  EQU   CRRATS                                                   00985000
CRRATS2  EQU   CRRATS+1                                                 00986000
CRRATS3  EQU   CRRATS+2                                                 00987000
CRRATS4  EQU   CRRATS+3                                                 00988000
CRRRATS1 EQU   CRRATS+4                                                 00989000
CRRRATS2 EQU   CRRATS+5                                                 00990000
CRRRATS3 EQU   CRRATS+6                                                 00991000
CRRSATS  EQU   CRRRATS3                                                 00992000
CRRFLGS1 EQU   CRRSAREA+164                                             00993000
CRRFLGS2 EQU   CRRSAREA+165                                             00994000
CRRFLGS3 EQU   CRRSAREA+166                                             00995000
CRRFLGS4 EQU   CRRSAREA+167                                             00996000
CRRFLGS  EQU   CRRSAREA+168                                             00997000
CRRRFLG1 EQU   CRRSAREA+169                                             00998000
CRRRTYPE EQU   CRRRFLG1                                                 00999000
CRRFDBK1 EQU   CRRSAREA+170                                             01000000
CRRFDB2  EQU   CRRFDBK1+1                                               01001000
CRRFDB3  EQU   CRRFDBK1+2                                               01002000
CRRFDBK2 EQU   CRRSAREA+176                                             01003000
CRRDSB   EQU   CRRFDBK2                                                 01004000
CRRESR   EQU   CRRFDBK2+2                                               01005000
CRRTRBUF EQU   CRRSAREA+204                                             01006000
CRRBFLGS EQU   CRRSAREA+280                                             01007000
ISTASCRR EQU   0                                                        01008000
ASCFLAGS EQU   ISTASCRR+16                                              01009000
ASCFLG1  EQU   ASCFLAGS                                                 01010000
ASCFLG2  EQU   ASCFLAGS+2                                               01011000
ASCFLG3  EQU   ASCFLAGS+4                                               01012000
ASCUSRGS EQU   ISTASCRR+28                                              01013000
ISTRIA   EQU   0                                                        01014000
RIAABRGS EQU   ISTRIA+16                                                01015000
RIAFLGS  EQU   ISTRIA+80                                                01016000
RIAFLG1  EQU   RIAFLGS                                                  01017000
RIAFLG2  EQU   RIAFLGS+1                                                01018000
ISTCFCRR EQU   0                                                        01019000
CFCAUDIT EQU   ISTCFCRR                                                 01020000
CFCNTRD  EQU   CFCAUDIT                                                 01021000
CFCCRT   EQU   CFCAUDIT+1                                               01022000
ISTCRA   EQU   0                                                        01023000
CRABASIC EQU   ISTCRA                                                   01024000
CRAHDR   EQU   CRABASIC                                                 01025000
CRACRR   EQU   CRAHDR                                                   01026000
CRALKACT EQU   CRABASIC+8                                               01027000
CRASVC   EQU   ISTCRA+848                                               01028000
CRABUFA  EQU   CRASVC+68                                                01029000
ISTPAB   EQU   0                                                        01030000
PABWQCHN EQU   ISTPAB                                                   01031000
PABWEQA  EQU   PABWQCHN                                                 01032000
PABCHAIN EQU   PABWQCHN+4                                               01033000
PABRPHFG EQU   ISTPAB+12                                                01034000
PABFLAGS EQU   PABRPHFG                                                 01035000
PABERLCK EQU   PABFLAGS                                                 01036000
PABERRLK EQU   PABERLCK                                                 01037000
ISTDYPAB EQU   0                                                        01038000
DYPPAB   EQU   ISTDYPAB+16                                              01039000
ISTLOK   EQU   0                                                        01040000
LOKCHN   EQU   ISTLOK+1                                                 01041000
LOKCHNG  EQU   LOKCHN                                                   01042000
@NM00067 EQU   LOKCHNG+2                                                01043000
ISTATCVT EQU   0                                                        01044000
ATCCOM   EQU   ISTATCVT                                                 01045000
ATCSTAT  EQU   ATCCOM                                                   01046000
ATCSTAT1 EQU   ATCSTAT                                                  01047000
ATCSTFLG EQU   ATCSTAT+1                                                01048000
ATCPOFLG EQU   ATCSTAT+2                                                01049000
ATCSTAT4 EQU   ATCSTAT+3                                                01050000
ATCIOTRC EQU   ATCCOM+140                                               01051000
ATCTHTRC EQU   ATCIOTRC                                                 01052000
ATCCSMR  EQU   ISTATCVT+296                                             01053000
ATCSHRFG EQU   ISTATCVT+316                                             01054000
ATCHPGM  EQU   ISTATCVT+384                                             01055000
ATCVLCNT EQU   ISTATCVT+772                                             01056000
ATCSOPD  EQU   ISTATCVT+792                                             01057000
ATCSIPD  EQU   ISTATCVT+800                                             01058000
ATCSECST EQU   ISTATCVT+812                                             01059000
ATCAOSM  EQU   ISTATCVT+912                                             01060000
ATCGSRBQ EQU   ATCAOSM+4                                                01061000
ATCGSRBG EQU   ATCGSRBQ                                                 01062000
ATCAP34  EQU   ATCAOSM+32                                               01063000
ATCZPSVT EQU   ATCAOSM+72                                               01064000
ATCICAPP EQU   ATCAOSM+100                                              01065000
ATCLDAPP EQU   ATCAOSM+120                                              01066000
ATCDAPVT EQU   ATCAOSM+140                                              01067000
ATCZLFVT EQU   ATCAOSM+188                                              01068000
ATCZPAB1 EQU   ATCAOSM+192                                              01069000
ATCAP37  EQU   ATCAOSM+264                                              01070000
ATCVTFLG EQU   ATCAOSM+392                                              01071000
ATCZR01  EQU   ATCAOSM+572                                              01072000
ATCTPCP0 EQU   ATCAOSM+580                                              01073000
ATCZFLAG EQU   ATCAOSM+588                                              01074000
ISTDEVCH EQU   0                                                        01075000
DEVSHCH  EQU   ISTDEVCH                                                 01076000
DEVCHAR  EQU   DEVSHCH                                                  01077000
DEVTCODE EQU   ISTDEVCH+1                                               01078000
DEVFLAGS EQU   ISTDEVCH+3                                               01079000
DEVFCCTL EQU   DEVFLAGS                                                 01080000
DEVCHAR3 EQU   DEVFLAGS                                                 01081000
ISTNCB   EQU   0                                                        01082000
NCBDAF   EQU   ISTNCB+2                                                 01083000
NCBFLAGS EQU   ISTNCB+24                                                01084000
NCBFRAS  EQU   NCBFLAGS+1                                               01085000
NCBFTRIO EQU   NCBFRAS                                                  01086000
NCBFLAG1 EQU   NCBFLAGS+2                                               01087000
ISTLDNCB EQU   0                                                        01088000
LDNCB    EQU   ISTLDNCB                                                 01089000
LDNTSAF  EQU   ISTLDNCB+52                                              01090000
LDNCFLAG EQU   ISTLDNCB+54                                              01091000
LDNZC002 EQU   ISTLDNCB+68                                              01092000
LDNZACSW EQU   ISTLDNCB+76                                              01093000
LDNZV001 EQU   ISTLDNCB+84                                              01094000
LDNZRM   EQU   ISTLDNCB+102                                             01095000
LDNFLAGS EQU   ISTLDNCB+107                                             01096000
LDNZF004 EQU   LDNFLAGS                                                 01097000
LDNZF005 EQU   LDNFLAGS                                                 01098000
LDNZF006 EQU   LDNFLAGS                                                 01099000
LDNZF008 EQU   LDNFLAGS                                                 01100000
LDNZIOBY EQU   LDNFLAGS+1                                               01101000
LDNFLAG2 EQU   ISTLDNCB+110                                             01102000
LDNZLOCK EQU   ISTLDNCB+120                                             01103000
LDNZIOLK EQU   ISTLDNCB+184                                             01104000
LDNZERPF EQU   ISTLDNCB+185                                             01105000
LDNZCPAN EQU   LDNZERPF                                                 01106000
LDNZEPIN EQU   LDNZERPF                                                 01107000
LDNZLPC  EQU   ISTLDNCB+186                                             01108000
LDNZTCP  EQU   ISTLDNCB+188                                             01109000
LDNRPH   EQU   ISTLDNCB+192                                             01110000
LDNDCDEB EQU   ISTLDNCB+304                                             01111000
LDNZSAV3 EQU   ISTLDNCB+376                                             01112000
LDNZSAV4 EQU   LDNZSAV3+8                                               01113000
LDNZH003 EQU   ISTLDNCB+577                                             01114000
ISTDNCB  EQU   0                                                        01115000
DNCOS    EQU   ISTDNCB+56                                               01116000
DNCZFLGS EQU   DNCOS                                                    01117000
DNCBSCED EQU   DNCOS+2                                                  01118000
ISTPROCD EQU   0                                                        01119000
PROPROC  EQU   ISTPROCD                                                 01120000
PROPROC1 EQU   PROPROC                                                  01121000
PROPROC2 EQU   PROPROC+1                                                01122000
PROPROC3 EQU   PROPROC+2                                                01123000
PROPROC4 EQU   PROPROC+3                                                01124000
PROPROCS EQU   0                                                        01125000
PROSETMS EQU   PROPROCS+1                                               01126000
PROSETM2 EQU   PROSETMS                                                 01127000
PROSETM3 EQU   PROSETMS+1                                               01128000
PROSETM4 EQU   PROSETMS+2                                               01129000
ISTFMCB  EQU   0                                                        01130000
FMCSTAT  EQU   ISTFMCB+28                                               01131000
FMCSTAT1 EQU   ISTFMCB+29                                               01132000
FMCCMDFL EQU   ISTFMCB+31                                               01133000
FMCCMPS1 EQU   ISTFMCB+36                                               01134000
FMCSIPA  EQU   ISTFMCB+148                                              01135000
FMCNXOSQ EQU   ISTFMCB+152                                              01136000
FMCNXCFM EQU   FMCNXOSQ                                                 01137000
FMCNXOSC EQU   FMCNXOSQ+2                                               01138000
FMCSSTAT EQU   ISTFMCB+159                                              01139000
FMCPACE  EQU   ISTFMCB+160                                              01140000
FMCPACEN EQU   FMCPACE                                                  01141000
FMCPACEM EQU   FMCPACE+1                                                01142000
FMCPACPC EQU   FMCPACE+2                                                01143000
FMCCVAL  EQU   FMCPACE+3                                                01144000
FMCOBCE  EQU   FMCCVAL                                                  01145000
FMCCLEXT EQU   ISTFMCB+164                                              01146000
FMCRPLA  EQU   FMCCLEXT                                                 01147000
FMCFBA   EQU   FMCCLEXT+4                                               01148000
FMCCMPS2 EQU   FMCCLEXT+16                                              01149000
FMCFLGA  EQU   FMCCMPS2                                                 01150000
FMCFLGCL EQU   FMCCMPS2+1                                               01151000
FMCPSCMD EQU   FMCCMPS2+2                                               01152000
FMCPSTAT EQU   FMCCMPS2+3                                               01153000
FMCSTAT2 EQU   ISTFMCB+186                                              01154000
FMCMODEB EQU   ISTFMCB+189                                              01155000
FMCCLSEQ EQU   ISTFMCB+190                                              01156000
FMCRRESP EQU   ISTFMCB+195                                              01157000
FMCSSEGQ EQU   ISTFMCB+200                                              01158000
FMCFBAS  EQU   ISTFMCB+216                                              01159000
FMCZV002 EQU   FMCFBAS                                                  01160000
FMCSNCTL EQU   ISTFMCB+224                                              01161000
FMCSCFLG EQU   FMCSNCTL                                                 01162000
FMCVS1   EQU   ISTFMCB+232                                              01163000
FMCZFLAG EQU   FMCVS1                                                   01164000
FMCZF006 EQU   FMCZFLAG                                                 01165000
FMCLBXM  EQU   FMCVS1+12                                                01166000
FMCSHEAQ EQU   FMCLBXM                                                  01167000
FMCLCPBQ EQU   FMCVS1+16                                                01168000
FMCLCPAQ EQU   FMCVS1+20                                                01169000
FMCSEQ1  EQU   FMCVS1+34                                                01170000
FMCZFLG2 EQU   FMCVS1+35                                                01171000
FMCCVFLG EQU   FMCVS1+44                                                01172000
FMCFLAG  EQU   0                                                        01173000
FMCFLGB  EQU   FMCFLAG                                                  01174000
ISTFDB   EQU   0                                                        01175000
FDBDATAA EQU   ISTFDB+4                                                 01176000
FDBDATCT EQU   ISTFDB+8                                                 01177000
ISTFSB   EQU   0                                                        01178000
FSBFSB   EQU   ISTFSB                                                   01179000
FSBTYPE  EQU   FSBFSB                                                   01180000
FSBLNGTH EQU   FSBFSB+1                                                 01181000
FSBMNRCD EQU   FSBFSB+2                                                 01182000
FSBSFLGS EQU   FSBFSB+3                                                 01183000
FSBFSBA  EQU   FSBFSB+4                                                 01184000
FSBBTH   EQU   FSBFSB+8                                                 01185000
FSBCID   EQU   FSBBTH                                                   01186000
FSBSAF   EQU   FSBCID                                                   01187000
FSBDAF   EQU   FSBCID+2                                                 01188000
FSBRQTAG EQU   FSBBTH+4                                                 01189000
FSBSEQID EQU   FSBRQTAG                                                 01190000
FSBFLAGS EQU   FSBSEQID                                                 01191000
FSBSEQ   EQU   FSBSEQID+1                                               01192000
FSBCSWST EQU   FSBBTH+6                                                 01193000
FSBTHFLD EQU   FSBCSWST                                                 01194000
FSBTH1   EQU   FSBTHFLD                                                 01195000
FSBSYSRS EQU   FSBTH1                                                   01196000
FSBTH2   EQU   FSBTHFLD+1                                               01197000
FSBEXTRS EQU   FSBTH2                                                   01198000
FSBXFSTS EQU   FSBEXTRS                                                 01199000
FSBXCODE EQU   FSBEXTRS                                                 01200000
FSBNETRS EQU   FSBFSB+16                                                01201000
FSBSRCAT EQU   FSBNETRS                                                 01202000
FSBERC   EQU   FSBNETRS+1                                               01203000
FSBFBMI  EQU   FSBERC                                                   01204000
FSBDMGRS EQU   FSBFSB+18                                                01205000
FSBSS1   EQU   FSBDMGRS                                                 01206000
FSBSS2   EQU   FSBDMGRS+1                                               01207000
FSBLCPB  EQU   FSBFSB+20                                                01208000
FSBMSGID EQU   FSBLCPB                                                  01209000
FSBLCCWA EQU   FSBFSB+24                                                01210000
FSBRLSTS EQU   FSBLCCWA                                                 01211000
ISTZLBUF EQU   0                                                        01212000
ZLBFSM   EQU   ISTZLBUF+4                                               01213000
ISTLSCB  EQU   0                                                        01214000
LSC1WORD EQU   ISTLSCB                                                  01215000
LSCREQTG EQU   LSC1WORD+2                                               01216000
LSCZRT02 EQU   LSCREQTG                                                 01217000
LSCZRT03 EQU   LSCREQTG                                                 01218000
LSCZRT04 EQU   LSCREQTG                                                 01219000
LSCZRT05 EQU   LSCREQTG                                                 01220000
LSCZRT06 EQU   LSCREQTG                                                 01221000
LSCZRT07 EQU   LSCREQTG                                                 01222000
LSCZMNRC EQU   LSCREQTG+1                                               01223000
LSCZRT08 EQU   LSCZMNRC                                                 01224000
LSCZRT09 EQU   LSCZMNRC                                                 01225000
LSCCHAIN EQU   ISTLSCB+4                                                01226000
LSCCHAI1 EQU   LSCCHAIN                                                 01227000
LSCRUCNT EQU   ISTLSCB+8                                                01228000
LSCFLGS  EQU   ISTLSCB+9                                                01229000
LSCSEQ   EQU   ISTLSCB+10                                               01230000
LSCFDBA  EQU   ISTLSCB+24                                               01231000
ISTZFSAV EQU   0                                                        01232000
ZSAFSVVR EQU   ISTZFSAV+12                                              01233000
ZSAFSVR2 EQU   ISTZFSAV+36                                              01234000
ZSAFSV19 EQU   ISTZFSAV+40                                              01235000
ISTZ19SV EQU   0                                                        01236000
ZSAF19FG EQU   ISTZ19SV                                                 01237000
ZSAFLOCK EQU   ZSAF19FG                                                 01238000
ZSAF19R1 EQU   ISTZ19SV+4                                               01239000
ZSAF19RD EQU   ISTZ19SV+8                                               01240000
FRWD0024 EQU   0                                                        01241000
WRD00024 EQU   FRWD0024                                                 01242000
WRD10024 EQU   FRWD0024+4                                               01243000
ISTAPC37 EQU   0                                                        01244000
ISTAPC34 EQU   0                                                        01245000
UCBBGN   EQU   0                                                        01246000
IOSATTSC EQU   IOSIPIB                                                  01247000
IOSWTOWA EQU   IOSIPIB                                                  01248000
IOSPCISC EQU   IOSIPIB                                                  01249000
FLC      EQU   PSA                                                      01250000
PSARSVTE EQU   PSARSVT                                                  01251000
PSACSTK  EQU   PSARSVTE                                                 01252000
UCBOBS01 EQU   UCBDEV                                                   01253000
UCBSTAB  EQU   UCBOBS01+10                                              01254000
UCBBSVL  EQU   UCBSTAB                                                  01255000
UCBPRSRS EQU   UCBSTAB                                                  01256000
UCBDMCT  EQU   UCBOBS01+11                                              01257000
UCBFL4   EQU   UCBOBS01+13                                              01258000
UCBOBS02 EQU   UCBDEV                                                   01259000
UCBTFL1  EQU   UCBOBS02+19                                              01260000
UCBXTN   EQU   UCBOBS02+20                                              01261000
UCBVOPT  EQU   UCBXTN                                                   01262000
UCBOBS03 EQU   UCBDEV                                                   01263000
UCBXTADR EQU   UCBOBS03                                                 01264000
UCBOBS04 EQU   UCBDEV                                                   01265000
UCBBTA   EQU   UCBOBS04+12                                              01266000
UCBOBS06 EQU   UCBDEV                                                   01267000
UCBAOF   EQU   UCBOBS06                                                 01268000
UCBAOF1  EQU   UCBAOF                                                   01269000
UCBAOF2  EQU   UCBAOF+1                                                 01270000
@NM00038 EQU   UCBOBS06+3                                               01271000
UCBIRB   EQU   UCBOBS06+4                                               01272000
UCBGRAF  EQU   UCBIRB                                                   01273000
UCBLDNCA EQU   UCBOBS06+8                                               01274000
UCBRDYQ  EQU   UCBLDNCA                                                 01275000
UCBIRLN  EQU   UCBRDYQ                                                  01276000
UCBLDNCB EQU   UCBRDYQ+1                                                01277000
UCBCTLNK EQU   UCBOBS06+12                                              01278000
UCBOBS07 EQU   UCBDEV                                                   01279000
UCBOBS08 EQU   UCBDEV                                                   01280000
UCBCTCAD EQU   UCBOBS08                                                 01281000
UCBCTCF1 EQU   UCBOBS08+4                                               01282000
UCBOBS09 EQU   UCBDEV                                                   01283000
CVTS01   EQU   CVTPGSIA                                                 01284000
CVTLPDIA EQU   CVTS01+12                                                01285000
CVTDIRST EQU   CVTLPDIA                                                 01286000
CVTSLIDA EQU   CVTS01+24                                                01287000
CVTCTLFG EQU   CVTS01+50                                                01288000
CVTRV210 EQU   CVTS01+424                                               01289000
CVTRV219 EQU   CVTS01+425                                               01290000
CVTRV228 EQU   CVTS01+426                                               01291000
CVTRV237 EQU   CVTS01+427                                               01292000
CVTMFRTR EQU   CVTS01+452                                               01293000
CVTRV262 EQU   CVTS01+468                                               01294000
CVTRV271 EQU   CVTS01+469                                               01295000
CVTRV280 EQU   CVTS01+470                                               01296000
CVTRV289 EQU   CVTS01+471                                               01297000
CVTGSDA  EQU   CVTS01+600                                               01298000
LCPZTIE  EQU   LCPCID                                                   01299000
LCPZSNAM EQU   LCPZTIE+8                                                01300000
FSBCOMBN EQU   FSBNETRS                                                 01301000
FSBRHFLD EQU   FSBCOMBN+1                                               01302000
FSBRH3   EQU   FSBRHFLD+2                                               01303000
FSBLDFLG EQU   FSBRH3                                                   01304000
@NM00087 EQU   FSBRQTAG                                                 01305000
ZLBBTRAN EQU   ISTZLBUF                                                 01306000
ZLBFDBZ  EQU   ZLBBTRAN                                                 01307000
ZLBAIO   EQU   ZLBBTRAN+16                                              01308000
ZLBDTIO  EQU   ZLBFSM                                                   01309000
ZLBCCW1  EQU   ZLBDTIO                                                  01310000
ZLBCCW2  EQU   ZLBDTIO+8                                                01311000
ZLBCCW3  EQU   ZLBDTIO+16                                               01312000
ZLBSNS   EQU   ZLBDTIO+28                                               01313000
ZLBERC   EQU   ZLBDTIO+29                                               01314000
ZLBCOMP  EQU   ZLBDTIO+31                                               01315000
ZLBSAF   EQU   ZLBDTIO+48                                               01316000
ZLBSTAT  EQU   ZLBSAF                                                   01317000
ZLBDEVST EQU   ZLBSTAT                                                  01318000
ZLBRQTG  EQU   ZLBDTIO+50                                               01319000
ZLBRQFLG EQU   ZLBRQTG                                                  01320000
ZLBFLAGS EQU   ZLBDTIO+56                                               01321000
ZLBTCP   EQU   ZLBFLAGS+8                                               01322000
ZLBTEXTA EQU   ZLBCCW3                                                  01323000
ZLBTEXTB EQU   ZLBFLAGS                                                 01324000
ZLBTEXT1 EQU   ZLBTEXTB                                                 01325000
ZLBTEXTC EQU   ZLBFLAGS                                                 01326000
ZLBPPL   EQU   ZLBTEXTC                                                 01327000
ZLBFAIO  EQU   ZLBAIO                                                   01328000
ZLBFSB   EQU   ZLBFAIO                                                  01329000
SRB      EQU   SRBSECT                                                  01330000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01331000
ZLBFDBS  EQU   ZLBFAIO+32                                               01332000
ZLBPPCSC EQU   ZLBPPL+14                                                01333000
ZLBPPRS1 EQU   ZLBPPL+13                                                01334000
ZLBPPRSV EQU   ZLBPPL+12                                                01335000
ZLBPPCLG EQU   ZLBPPL+12                                                01336000
ZLBPPCC  EQU   ZLBPPL+12                                                01337000
ZLBPPINT EQU   ZLBPPL+12                                                01338000
ZLBPPHIO EQU   ZLBPPL+12                                                01339000
ZLBPP    EQU   ZLBPPL+4                                                 01340000
ZLBPPLDB EQU   ZLBPPL+1                                                 01341000
ZLBPPLF  EQU   ZLBPPL                                                   01342000
ZLBTEXT  EQU   ZLBTEXTA+8                                               01343000
ZLBRSV0A EQU   ZLBTEXTA                                                 01344000
ZLBTCSW  EQU   ZLBFLAGS+1                                               01345000
ZLBRSV09 EQU   ZLBFLAGS                                                 01346000
ZLBWCCSP EQU   ZLBFLAGS                                                 01347000
ZLBRSV07 EQU   ZLBFLAGS                                                 01348000
ZLBLSTST EQU   ZLBDTIO+52                                               01349000
ZLBRQSEQ EQU   ZLBRQTG+1                                                01350000
ZLBRT0B  EQU   ZLBRQFLG+1                                               01351000
ZLBRT0A  EQU   ZLBRQFLG+1                                               01352000
ZLBRT09  EQU   ZLBRQFLG+1                                               01353000
ZLBRT08  EQU   ZLBRQFLG+1                                               01354000
ZLBRT07  EQU   ZLBRQFLG                                                 01355000
ZLBRT06  EQU   ZLBRQFLG                                                 01356000
ZLBRT05  EQU   ZLBRQFLG                                                 01357000
ZLBRT04  EQU   ZLBRQFLG                                                 01358000
ZLBRT03  EQU   ZLBRQFLG                                                 01359000
ZLBRT02  EQU   ZLBRQFLG                                                 01360000
ZLBRT01  EQU   ZLBRQFLG                                                 01361000
ZLBRT00  EQU   ZLBRQFLG                                                 01362000
ZLBCHNST EQU   ZLBSTAT+1                                                01363000
ZLBUCST  EQU   ZLBDEVST                                                 01364000
ZLBDEST  EQU   ZLBDEVST                                                 01365000
ZLBRSV10 EQU   ZLBDEVST                                                 01366000
ZLBLSTBF EQU   ZLBDTIO+44                                               01367000
ZLBRSV11 EQU   ZLBDTIO+40                                               01368000
ZLBLCCWA EQU   ZLBDTIO+36                                               01369000
ZLBLCPBA EQU   ZLBDTIO+32                                               01370000
ZLBRSV08 EQU   ZLBDTIO+30                                               01371000
ZLBRSV05 EQU   ZLBERC                                                   01372000
ZLBFBMI  EQU   ZLBERC                                                   01373000
ZLBETI   EQU   ZLBERC                                                   01374000
ZLBEMI   EQU   ZLBERC                                                   01375000
ZLBEBI   EQU   ZLBERC                                                   01376000
ZLBECI   EQU   ZLBERC                                                   01377000
ZLBELI   EQU   ZLBERC                                                   01378000
ZLBSOC   EQU   ZLBSNS                                                   01379000
ZLBSCC   EQU   ZLBSNS                                                   01380000
ZLBSUS   EQU   ZLBSNS                                                   01381000
ZLBSDC   EQU   ZLBSNS                                                   01382000
ZLBSEQCK EQU   ZLBSNS                                                   01383000
ZLBSBOL  EQU   ZLBSNS                                                   01384000
ZLBSIR   EQU   ZLBSNS                                                   01385000
ZLBSCR   EQU   ZLBSNS                                                   01386000
ZLBRSV12 EQU   ZLBDTIO+24                                               01387000
ZLBCPTC3 EQU   ZLBCCW3+6                                                01388000
ZLBRSV04 EQU   ZLBCCW3+5                                                01389000
ZLBCPFL3 EQU   ZLBCCW3+4                                                01390000
ZLBCPAD3 EQU   ZLBCCW3+1                                                01391000
ZLBCPCF3 EQU   ZLBCCW3                                                  01392000
ZLBCPTC2 EQU   ZLBCCW2+6                                                01393000
ZLBRSV03 EQU   ZLBCCW2+5                                                01394000
ZLBCPFL2 EQU   ZLBCCW2+4                                                01395000
ZLBCPAD2 EQU   ZLBCCW2+1                                                01396000
ZLBCPCF2 EQU   ZLBCCW2                                                  01397000
ZLBCPTC1 EQU   ZLBCCW1+6                                                01398000
ZLBCMOD  EQU   ZLBCCW1+5                                                01399000
ZLBCPFL1 EQU   ZLBCCW1+4                                                01400000
ZLBCPAD1 EQU   ZLBCCW1+1                                                01401000
ZLBCPCF1 EQU   ZLBCCW1                                                  01402000
ZLBLNG2  EQU   ZLBBTRAN+14                                              01403000
ZLBRSV01 EQU   ZLBBTRAN+12                                              01404000
FSBRT0B  EQU   @NM00087+1                                               01405000
FSBRT0A  EQU   @NM00087+1                                               01406000
FSBRT09  EQU   @NM00087+1                                               01407000
FSBRT08  EQU   @NM00087+1                                               01408000
FSBRT07  EQU   @NM00087                                                 01409000
FSBRT06  EQU   @NM00087                                                 01410000
FSBRT05  EQU   @NM00087                                                 01411000
FSBRT04  EQU   @NM00087                                                 01412000
FSBRT03  EQU   @NM00087                                                 01413000
FSBRT02  EQU   @NM00087                                                 01414000
FSBRT01  EQU   @NM00087                                                 01415000
FSBRT00  EQU   @NM00087                                                 01416000
FSBLDCUF EQU   FSBLDFLG                                                 01417000
FSBLDSIF EQU   FSBLDFLG                                                 01418000
FSBLDSOF EQU   FSBLDFLG                                                 01419000
FSBLDEBF EQU   FSBLDFLG                                                 01420000
FSBLDBBF EQU   FSBLDFLG                                                 01421000
FSBLDFME EQU   FSBLDFLG                                                 01422000
FSBLDSCF EQU   FSBLDFLG                                                 01423000
FSBLDRMF EQU   FSBLDFLG                                                 01424000
FSBRH2   EQU   FSBRHFLD+1                                               01425000
FSBRH1   EQU   FSBRHFLD                                                 01426000
FSBALIGN EQU   FSBCOMBN                                                 01427000
LCPZTRV4 EQU   LCPZSNAM+4                                               01428000
LCPZTRV1 EQU   LCPZSNAM                                                 01429000
LCPZSNA  EQU   LCPZTIE+4                                                01430000
LCPZFMCA EQU   LCPZTIE                                                  01431000
CVTRV628 EQU   CVTS01+728                                               01432000
CVTRV627 EQU   CVTS01+724                                               01433000
CVTRV626 EQU   CVTS01+720                                               01434000
CVTRV625 EQU   CVTS01+716                                               01435000
CVTRV624 EQU   CVTS01+712                                               01436000
CVTRV623 EQU   CVTS01+708                                               01437000
CVTRV622 EQU   CVTS01+704                                               01438000
CVTRV621 EQU   CVTS01+700                                               01439000
CVTRV620 EQU   CVTS01+696                                               01440000
CVTRV619 EQU   CVTS01+692                                               01441000
CVTRV618 EQU   CVTS01+688                                               01442000
CVTRV617 EQU   CVTS01+684                                               01443000
CVTRV616 EQU   CVTS01+680                                               01444000
CVTRV615 EQU   CVTS01+676                                               01445000
CVTRV614 EQU   CVTS01+672                                               01446000
CVTRV613 EQU   CVTS01+668                                               01447000
CVTRV612 EQU   CVTS01+664                                               01448000
CVTRV611 EQU   CVTS01+660                                               01449000
CVTEVERM EQU   CVTS01+656                                               01450000
CVTIRM   EQU   CVTS01+652                                               01451000
CVTCGK   EQU   CVTS01+648                                               01452000
CVTRAC   EQU   CVTS01+644                                               01453000
CVTRV606 EQU   CVTS01+640                                               01454000
CVTRV605 EQU   CVTS01+636                                               01455000
CVTRV604 EQU   CVTS01+632                                               01456000
CVTEFF02 EQU   CVTS01+628                                               01457000
CVTCBBR  EQU   CVTS01+624                                               01458000
CVTSSCR  EQU   CVTS01+620                                               01459000
CVTEVENT EQU   CVTS01+616                                               01460000
CVTCRCA  EQU   CVTS01+612                                               01461000
CVTTPIO  EQU   CVTS01+608                                               01462000
CVTADV   EQU   CVTS01+604                                               01463000
CVTGSDAB EQU   CVTGSDA                                                  01464000
CVTQV3   EQU   CVTS01+596                                               01465000
CVTQV2   EQU   CVTS01+592                                               01466000
CVTQV1   EQU   CVTS01+588                                               01467000
CVTRPT   EQU   CVTS01+584                                               01468000
CVTSSRB  EQU   CVTS01+580                                               01469000
CVTCSDRL EQU   CVTS01+576                                               01470000
CVTEXP1  EQU   CVTS01+572                                               01471000
CVTRMPMT EQU   CVTS01+568                                               01472000
CVTRMPTT EQU   CVTS01+564                                               01473000
CVTVPSA  EQU   CVTS01+560                                               01474000
CVTVSTOP EQU   CVTS01+556                                               01475000
CVTGTFR8 EQU   CVTS01+552                                               01476000
CVTQUIT  EQU   CVTS01+548                                               01477000
CVTVACR  EQU   CVTS01+544                                               01478000
CVTWTCB  EQU   CVTS01+540                                               01479000
CVTSTPRS EQU   CVTS01+536                                               01480000
CVT0PT02 EQU   CVTS01+532                                               01481000
CVTDARCM EQU   CVTS01+528                                               01482000
CVTIRECM EQU   CVTS01+524                                               01483000
CVTJRECM EQU   CVTS01+520                                               01484000
CVTVEMS0 EQU   CVTS01+516                                               01485000
CVTSPFRR EQU   CVTS01+512                                               01486000
CVTRLSTG EQU   CVTS01+508                                               01487000
CVT0TC0A EQU   CVTS01+504                                               01488000
CVTGMBR  EQU   CVTS01+500                                               01489000
CVTLFRM  EQU   CVTS01+496                                               01490000
CVTRMBR  EQU   CVTS01+492                                               01491000
CVTVIOP  EQU   CVTS01+488                                               01492000
CVTRV307 EQU   CVTS01+486                                               01493000
CVTRV306 EQU   CVTS01+484                                               01494000
CVTRV305 EQU   CVTS01+482                                               01495000
CVTRV304 EQU   CVTS01+480                                               01496000
CVTRV303 EQU   CVTS01+478                                               01497000
CVTRV302 EQU   CVTS01+476                                               01498000
CVTTRCA  EQU   CVTS01+472                                               01499000
CVTRV297 EQU   CVTRV289                                                 01500000
CVTRV296 EQU   CVTRV289                                                 01501000
CVTRV295 EQU   CVTRV289                                                 01502000
CVTRV294 EQU   CVTRV289                                                 01503000
CVTRV293 EQU   CVTRV289                                                 01504000
CVTRV292 EQU   CVTRV289                                                 01505000
CVTRV291 EQU   CVTRV289                                                 01506000
CVTRV290 EQU   CVTRV289                                                 01507000
CVTRV288 EQU   CVTRV280                                                 01508000
CVTRV287 EQU   CVTRV280                                                 01509000
CVTRV286 EQU   CVTRV280                                                 01510000
CVTRV285 EQU   CVTRV280                                                 01511000
CVTRV284 EQU   CVTRV280                                                 01512000
CVTRV283 EQU   CVTRV280                                                 01513000
CVTRV282 EQU   CVTRV280                                                 01514000
CVTRV281 EQU   CVTRV280                                                 01515000
CVTRV279 EQU   CVTRV271                                                 01516000
CVTRV278 EQU   CVTRV271                                                 01517000
CVTRV277 EQU   CVTRV271                                                 01518000
CVTRV276 EQU   CVTRV271                                                 01519000
CVTRV275 EQU   CVTRV271                                                 01520000
CVTRV274 EQU   CVTRV271                                                 01521000
CVTRV273 EQU   CVTRV271                                                 01522000
CVTRV272 EQU   CVTRV271                                                 01523000
CVTRV270 EQU   CVTRV262                                                 01524000
CVTRV269 EQU   CVTRV262                                                 01525000
CVTRV268 EQU   CVTRV262                                                 01526000
CVTRV267 EQU   CVTRV262                                                 01527000
CVTRV266 EQU   CVTRV262                                                 01528000
CVTRV265 EQU   CVTRV262                                                 01529000
CVTRV264 EQU   CVTRV262                                                 01530000
CVTRV263 EQU   CVTRV262                                                 01531000
CVTVFP   EQU   CVTS01+464                                               01532000
CVTVSI   EQU   CVTS01+460                                               01533000
CVTVPSIB EQU   CVTS01+456                                               01534000
CVTMFACT EQU   CVTMFRTR                                                 01535000
CVTMFCTL EQU   CVTS01+448                                               01536000
CVTPVBP  EQU   CVTS01+444                                               01537000
CVTPWI   EQU   CVTS01+440                                               01538000
CVTRV254 EQU   CVTS01+438                                               01539000
CVTRV253 EQU   CVTS01+436                                               01540000
CVTRV252 EQU   CVTS01+434                                               01541000
CVTRV251 EQU   CVTS01+433                                               01542000
CVTRV250 EQU   CVTS01+432                                               01543000
CVTRV249 EQU   CVTS01+431                                               01544000
CVTRV248 EQU   CVTS01+430                                               01545000
CVTRV247 EQU   CVTS01+429                                               01546000
CVTRV246 EQU   CVTS01+428                                               01547000
CVTRV245 EQU   CVTRV237                                                 01548000
CVTRV244 EQU   CVTRV237                                                 01549000
CVTRV243 EQU   CVTRV237                                                 01550000
CVTRV242 EQU   CVTRV237                                                 01551000
CVTRV241 EQU   CVTRV237                                                 01552000
CVTRV240 EQU   CVTRV237                                                 01553000
CVTRV239 EQU   CVTRV237                                                 01554000
CVTRV238 EQU   CVTRV237                                                 01555000
CVTRV236 EQU   CVTRV228                                                 01556000
CVTRV235 EQU   CVTRV228                                                 01557000
CVTRV234 EQU   CVTRV228                                                 01558000
CVTRV233 EQU   CVTRV228                                                 01559000
CVTRV232 EQU   CVTRV228                                                 01560000
CVTRV231 EQU   CVTRV228                                                 01561000
CVTRV230 EQU   CVTRV228                                                 01562000
CVTRV229 EQU   CVTRV228                                                 01563000
CVTRV227 EQU   CVTRV219                                                 01564000
CVTRV226 EQU   CVTRV219                                                 01565000
CVTRV225 EQU   CVTRV219                                                 01566000
CVTRV224 EQU   CVTRV219                                                 01567000
CVTRV223 EQU   CVTRV219                                                 01568000
CVTRV222 EQU   CVTRV219                                                 01569000
CVTRV221 EQU   CVTRV219                                                 01570000
CVTRV220 EQU   CVTRV219                                                 01571000
CVTRV218 EQU   CVTRV210                                                 01572000
CVTRV217 EQU   CVTRV210                                                 01573000
CVTRV216 EQU   CVTRV210                                                 01574000
CVTRV215 EQU   CVTRV210                                                 01575000
CVTRV214 EQU   CVTRV210                                                 01576000
CVTRV213 EQU   CVTRV210                                                 01577000
CVTRV212 EQU   CVTRV210                                                 01578000
CVTRV211 EQU   CVTRV210                                                 01579000
CVTLCCAT EQU   CVTS01+420                                               01580000
CVTPCCAT EQU   CVTS01+416                                               01581000
CVTIPCRP EQU   CVTS01+412                                               01582000
CVTIPCRI EQU   CVTS01+408                                               01583000
CVTIPCDS EQU   CVTS01+404                                               01584000
CVTAIDVT EQU   CVTS01+400                                               01585000
CVTSSAP  EQU   CVTS01+396                                               01586000
CVTEHCIR EQU   CVTS01+392                                               01587000
CVTEHDEF EQU   CVTS01+388                                               01588000
CVTDAIR  EQU   CVTS01+384                                               01589000
CVTPERFM EQU   CVTS01+380                                               01590000
CVT044R2 EQU   CVTS01+376                                               01591000
CVTFETCH EQU   CVTS01+372                                               01592000
CVTRSTWD EQU   CVTS01+368                                               01593000
CVTSPOST EQU   CVTS01+364                                               01594000
CVTIOBP  EQU   CVTS01+360                                               01595000
CVTASMVT EQU   CVTS01+356                                               01596000
CVTRECRQ EQU   CVTS01+352                                               01597000
CVTWSAC  EQU   CVTS01+348                                               01598000
CVTRV149 EQU   CVTS01+344                                               01599000
CVTWSAL  EQU   CVTS01+340                                               01600000
CVTSPSA  EQU   CVTS01+336                                               01601000
CVTGLMN  EQU   CVTS01+332                                               01602000
CVTVEAC0 EQU   CVTS01+328                                               01603000
CVT062R1 EQU   CVTS01+324                                               01604000
CVTRPOST EQU   CVTS01+320                                               01605000
CVTDQIQE EQU   CVTS01+316                                               01606000
CVTCSD   EQU   CVTS01+312                                               01607000
CVTLKRMA EQU   CVTS01+308                                               01608000
CVTRSPIE EQU   CVTS01+304                                               01609000
CVTRENQ  EQU   CVTS01+300                                               01610000
CVTLQCB  EQU   CVTS01+296                                               01611000
CVTFQCB  EQU   CVTS01+292                                               01612000
CVTQCS01 EQU   CVTS01+288                                               01613000
CVTAPFT  EQU   CVTS01+284                                               01614000
CVTPARRL EQU   CVTS01+280                                               01615000
CVTVWAIT EQU   CVTS01+276                                               01616000
CVTGSPL  EQU   CVTS01+272                                               01617000
CVTLSMQ  EQU   CVTS01+268                                               01618000
CVTGSMQ  EQU   CVTS01+264                                               01619000
CVTEXPRO EQU   CVTS01+260                                               01620000
CVTOPCTP EQU   CVTS01+256                                               01621000
CVTSIC   EQU   CVTS01+252                                               01622000
CVTTPIOS EQU   CVTS01+248                                               01623000
CVTRTMS  EQU   CVTS01+244                                               01624000
CVTSDBF  EQU   CVTS01+240                                               01625000
CVTSCBP  EQU   CVTS01+236                                               01626000
CVTSDMP  EQU   CVTS01+232                                               01627000
CVTSV60  EQU   CVTS01+228                                               01628000
CVTRTMCT EQU   CVTS01+224                                               01629000
CVTASCBL EQU   CVTS01+220                                               01630000
CVTASCBH EQU   CVTS01+216                                               01631000
CVTGDA   EQU   CVTS01+212                                               01632000
CVTASVT  EQU   CVTS01+208                                               01633000
CVTVVMDI EQU   CVTS01+204                                               01634000
CVTAQTOP EQU   CVTS01+200                                               01635000
CVTIOSCS EQU   CVTS01+196                                               01636000
CVTSDRM  EQU   CVTS01+192                                               01637000
CVTOPTE  EQU   CVTS01+188                                               01638000
CVTSTXU  EQU   CVTS01+184                                               01639000
CVTQUIS  EQU   CVTS01+180                                               01640000
CVTPARS  EQU   CVTS01+176                                               01641000
CVTS1EE  EQU   CVTS01+172                                               01642000
CVTFRAS  EQU   CVTS01+168                                               01643000
CVTQSAS  EQU   CVTS01+164                                               01644000
CVTCRAS  EQU   CVTS01+160                                               01645000
CVTCRMN  EQU   CVTS01+156                                               01646000
CVTDELCP EQU   CVTS01+152                                               01647000
CVTFRECL EQU   CVTS01+148                                               01648000
CVTGETCL EQU   CVTS01+144                                               01649000
CVTBLDCP EQU   CVTS01+140                                               01650000
CVTAUTHL EQU   CVTS01+136                                               01651000
CVTSCAN  EQU   CVTS01+132                                               01652000
CVTRV144 EQU   CVTS01+130                                               01653000
CVTMAXMP EQU   CVTS01+128                                               01654000
CVTSTCK  EQU   CVTS01+124                                               01655000
CVTRV139 EQU   CVTS01+123                                               01656000
CVTDSSAC EQU   CVTS01+122                                               01657000
CVTRV513 EQU   CVTS01+121                                               01658000
CVTIOSPL EQU   CVTS01+120                                               01659000
CVTPTGT  EQU   CVTS01+116                                               01660000
CVTCSPIE EQU   CVTS01+112                                               01661000
CVTSMFEX EQU   CVTS01+108                                               01662000
CVTOLT0A EQU   CVTS01+104                                               01663000
CVTSRBRT EQU   CVTS01+100                                               01664000
CVTPUTL  EQU   CVTS01+96                                                01665000
CVTRV519 EQU   CVTS01+92                                                01666000
CVTRV327 EQU   CVTS01+88                                                01667000
CVTRV326 EQU   CVTS01+84                                                01668000
CVTRV325 EQU   CVTS01+80                                                01669000
CVTRV324 EQU   CVTS01+76                                                01670000
CVT0VL01 EQU   CVTS01+72                                                01671000
CVTSHRVM EQU   CVTS01+68                                                01672000
CVTRV332 EQU   CVTS01+64                                                01673000
CVTTAS   EQU   CVTS01+60                                                01674000
CVTRSCN  EQU   CVTS01+56                                                01675000
CVTTRAC2 EQU   CVTS01+54                                                01676000
CVTTRACE EQU   CVTS01+52                                                01677000
CVTAPG   EQU   CVTS01+51                                                01678000
CVTSDTRC EQU   CVTCTLFG                                                 01679000
CVTGTRCE EQU   CVTCTLFG                                                 01680000
CVTNOMP  EQU   CVTCTLFG                                                 01681000
CVTRSV79 EQU   CVTCTLFG                                                 01682000
CVTDSTAT EQU   CVTCTLFG                                                 01683000
CVTRSV78 EQU   CVTCTLFG                                                 01684000
CVTRV333 EQU   CVTCTLFG                                                 01685000
CVTRV323 EQU   CVTCTLFG                                                 01686000
CVTSPVLK EQU   CVTS01+49                                                01687000
CVTRSV77 EQU   CVTS01+48                                                01688000
CVTRV331 EQU   CVTS01+44                                                01689000
CVTRV330 EQU   CVTS01+40                                                01690000
CVTRV329 EQU   CVTS01+36                                                01691000
CVTRV328 EQU   CVTS01+32                                                01692000
CVTRV322 EQU   CVTS01+28                                                01693000
CVTSLID  EQU   CVTSLIDA+1                                               01694000
CVTSYLK  EQU   CVTSLIDA                                                 01695000
CVTRV321 EQU   CVTS01+20                                                01696000
CVTRV320 EQU   CVTS01+16                                                01697000
CVTLPDIR EQU   CVTLPDIA+1                                               01698000
CVTRSV69 EQU   CVTDIRST                                                 01699000
CVTRSV68 EQU   CVTDIRST                                                 01700000
CVTRSV67 EQU   CVTDIRST                                                 01701000
CVTRSV66 EQU   CVTDIRST                                                 01702000
CVTRSV65 EQU   CVTDIRST                                                 01703000
CVTRSV64 EQU   CVTDIRST                                                 01704000
CVTRSV63 EQU   CVTDIRST                                                 01705000
CVTDICOM EQU   CVTDIRST                                                 01706000
CVTPVTP  EQU   CVTS01+8                                                 01707000
CVTLPDSR EQU   CVTS01+4                                                 01708000
CVTGETL  EQU   CVTS01                                                   01709000
UCBRV066 EQU   UCBOBS09+4                                               01710000
UCBIOSBA EQU   UCBOBS09                                                 01711000
UCBRV042 EQU   UCBOBS08+5                                               01712000
UCBRV082 EQU   UCBCTCF1                                                 01713000
UCBRV081 EQU   UCBCTCF1                                                 01714000
UCBRV080 EQU   UCBCTCF1                                                 01715000
UCBRV079 EQU   UCBCTCF1                                                 01716000
UCBRV078 EQU   UCBCTCF1                                                 01717000
UCBRV077 EQU   UCBCTCF1                                                 01718000
UCBRV076 EQU   UCBCTCF1                                                 01719000
UCBCTC80 EQU   UCBCTCF1                                                 01720000
UCBCTCAL EQU   UCBCTCAD                                                 01721000
UCBICNCB EQU   UCBOBS07+4                                               01722000
UCBRV040 EQU   UCBOBS07                                                 01723000
UCBCTLNA EQU   UCBCTLNK+1                                               01724000
UCBRLN   EQU   UCBCTLNK                                                 01725000
UCBRDYQA EQU   UCBLDNCB                                                 01726000
UCBINRLN EQU   UCBIRLN                                                  01727000
UCBIRBA  EQU   UCBIRB+1                                                 01728000
UCBRV039 EQU   UCBGRAF                                                  01729000
UCBDWNR  EQU   UCBGRAF                                                  01730000
UCBRPND  EQU   UCBGRAF                                                  01731000
UCBUPM   EQU   UCBGRAF                                                  01732000
UCBBTAM  EQU   UCBGRAF                                                  01733000
UCBDRNO  EQU   UCBGRAF                                                  01734000
UCBDRO   EQU   UCBGRAF                                                  01735000
UCBOIP   EQU   UCBGRAF                                                  01736000
UCBATRCD EQU   @NM00038                                                 01737000
UCBSKPFG EQU   @NM00038                                                 01738000
UCBRIPND EQU   @NM00038                                                 01739000
UCBRTIAC EQU   @NM00038                                                 01740000
UCBRSV79 EQU   @NM00038                                                 01741000
UCBRSV78 EQU   @NM00038                                                 01742000
UCBRSV77 EQU   @NM00038                                                 01743000
UCBOLTEP EQU   @NM00038                                                 01744000
UCBATNCT EQU   UCBOBS06+2                                               01745000
UCBRSV76 EQU   UCBAOF2                                                  01746000
UCBRSV75 EQU   UCBAOF2                                                  01747000
UCBRSV74 EQU   UCBAOF2                                                  01748000
UCBRSV73 EQU   UCBAOF2                                                  01749000
UCBRSV72 EQU   UCBAOF2                                                  01750000
UCBRSV71 EQU   UCBAOF2                                                  01751000
UCBRSV70 EQU   UCBAOF2                                                  01752000
UCBRSV69 EQU   UCBAOF2                                                  01753000
UCBRSV68 EQU   UCBAOF1                                                  01754000
UCBRSV67 EQU   UCBAOF1                                                  01755000
UCBRSV66 EQU   UCBAOF1                                                  01756000
UCBRSV65 EQU   UCBAOF1                                                  01757000
UCBRSV64 EQU   UCBAOF1                                                  01758000
UCBOFNL  EQU   UCBAOF1                                                  01759000
UCBOFSP  EQU   UCBAOF1                                                  01760000
UCBOFMCR EQU   UCBAOF1                                                  01761000
UCBBTB   EQU   UCBBTA+1                                                 01762000
UCBDI    EQU   UCBBTA                                                   01763000
UCBSNS   EQU   UCBOBS04+8                                               01764000
UCBTEB   EQU   UCBOBS04+4                                               01765000
UCBGCB   EQU   UCBOBS04+3                                               01766000
UCBOPEN  EQU   UCBOBS04+2                                               01767000
UCBSTART EQU   UCBOBS04                                                 01768000
UCBXTNB  EQU   UCBXTN+1                                                 01769000
UCBRSV22 EQU   UCBVOPT                                                  01770000
UCBRSV21 EQU   UCBVOPT                                                  01771000
UCBRSV20 EQU   UCBVOPT                                                  01772000
UCBESVE  EQU   UCBVOPT                                                  01773000
UCBERPC  EQU   UCBVOPT                                                  01774000
UCBESVC  EQU   UCBVOPT                                                  01775000
UCBEVA   EQU   UCBVOPT                                                  01776000
UCBESV   EQU   UCBVOPT                                                  01777000
UCBRV009 EQU   UCBTFL1                                                  01778000
UCBRV008 EQU   UCBTFL1                                                  01779000
UCBRV007 EQU   UCBTFL1                                                  01780000
UCBRV006 EQU   UCBTFL1                                                  01781000
UCBRV005 EQU   UCBTFL1                                                  01782000
UCBRV038 EQU   UCBTFL1                                                  01783000
UCBNSLTP EQU   UCBTFL1                                                  01784000
UCBNLTP  EQU   UCBTFL1                                                  01785000
UCBRES1B EQU   UCBOBS02+18                                              01786000
UCBFSER  EQU   UCBOBS02+12                                              01787000
@NM00037 EQU   UCBOBS02+4                                               01788000
UCBFSEQ  EQU   UCBOBS02+2                                               01789000
UCBFSCT  EQU   UCBOBS02                                                 01790000
UCBNEXP  EQU   UCBOBS01+20                                              01791000
UCBBASE  EQU   UCBOBS01+16                                              01792000
UCBRES1A EQU   UCBOBS01+15                                              01793000
UCBUSER  EQU   UCBOBS01+14                                              01794000
UCBFL47  EQU   UCBFL4                                                   01795000
UCBFL46  EQU   UCBFL4                                                   01796000
UCBFL45  EQU   UCBFL4                                                   01797000
UCBRV065 EQU   UCBFL4                                                   01798000
UCBDSS   EQU   UCBFL4                                                   01799000
UCBRV028 EQU   UCBFL4                                                   01800000
UCBWDAV  EQU   UCBFL4                                                   01801000
UCBDAVV  EQU   UCBFL4                                                   01802000
UCBSQC   EQU   UCBOBS01+12                                              01803000
UCBDATP  EQU   UCBOBS01+12                                              01804000
UCBDMC   EQU   UCBDMCT                                                  01805000
UCBMOUNT EQU   UCBDMCT                                                  01806000
UCBBNUL  EQU   UCBSTAB                                                  01807000
UCBSHAR  EQU   UCBSTAB                                                  01808000
UCBBSTR  EQU   UCBSTAB                                                  01809000
UCBBPUB  EQU   UCBSTAB                                                  01810000
UCBBPRV  EQU   UCBSTAB                                                  01811000
UCBBALB  EQU   UCBPRSRS                                                 01812000
UCBPGFL  EQU   UCBSTAB                                                  01813000
UCBDVSHR EQU   UCBBSVL                                                  01814000
UCBVOLI  EQU   UCBOBS01+4                                               01815000
UCBVTOC  EQU   UCBOBS01                                                 01816000
PSARSAV  EQU   PSARSVTE+60                                              01817000
PSARSTK  EQU   PSARSVTE+56                                              01818000
PSAESAV3 EQU   PSARSVTE+52                                              01819000
PSAESTK3 EQU   PSARSVTE+48                                              01820000
PSAESAV2 EQU   PSARSVTE+44                                              01821000
PSAESTK2 EQU   PSARSVTE+40                                              01822000
PSAESAV1 EQU   PSARSVTE+36                                              01823000
PSAESTK1 EQU   PSARSVTE+32                                              01824000
PSAPSAV  EQU   PSARSVTE+28                                              01825000
PSAPSTK  EQU   PSARSVTE+24                                              01826000
PSAMSAV  EQU   PSARSVTE+20                                              01827000
PSAMSTK  EQU   PSARSVTE+16                                              01828000
PSASSAV  EQU   PSARSVTE+12                                              01829000
PSASSTK  EQU   PSARSVTE+8                                               01830000
PSANSTK  EQU   PSARSVTE+4                                               01831000
IOSPCIWA EQU   IOSPCISC+44                                              01832000
IOSPCIRS EQU   IOSPCISC+8                                               01833000
@NM00007 EQU   IOSPCISC+4                                               01834000
@NM00006 EQU   IOSPCISC                                                 01835000
IOSWRNDR EQU   IOSWTOWA+4                                               01836000
IOSWTOPT EQU   IOSWTOWA+3                                               01837000
IOSWTOCP EQU   IOSWTOWA+2                                               01838000
IOSWTOCH EQU   IOSWTOWA                                                 01839000
IOSATTWA EQU   IOSATTSC+40                                              01840000
@NM00005 EQU   IOSATTSC+24                                              01841000
IOSATTSN EQU   IOSATTSC                                                 01842000
WRDS0024 EQU   FRWD0024+8                                               01843000
ZSAF19IO EQU   ISTZ19SV+12                                              01844000
ZSAF19RV EQU   ISTZ19SV+1                                               01845000
ZSAFRSVS EQU   ZSAF19FG                                                 01846000
ZSAFSVRR EQU   ISTZFSAV+8                                               01847000
ZSAFSVFC EQU   ISTZFSAV+4                                               01848000
ZSAFSVBC EQU   ISTZFSAV                                                 01849000
LSCTLBAD EQU   ISTLSCB+28                                               01850000
LSCFDB2  EQU   LSCFDBA+1                                                01851000
LSCFDB1  EQU   LSCFDBA                                                  01852000
LSCLCCWA EQU   ISTLSCB+20                                               01853000
LSCLCPBA EQU   ISTLSCB+16                                               01854000
LSCLCCW1 EQU   ISTLSCB+12                                               01855000
LSCRRCNT EQU   LSCSEQ+1                                                 01856000
LSCRRCCT EQU   LSCSEQ                                                   01857000
LSCATOP  EQU   LSCFLGS                                                  01858000
LSCFREE  EQU   LSCFLGS                                                  01859000
LSCDSTAT EQU   LSCFLGS                                                  01860000
LSCEXRES EQU   LSCFLGS                                                  01861000
LSCZRIMM EQU   LSCFLGS                                                  01862000
LSCRSV01 EQU   LSCFLGS                                                  01863000
LSCSMODE EQU   LSCFLGS                                                  01864000
LSCZMIRC EQU   LSCRUCNT                                                 01865000
LSCCHAI2 EQU   LSCCHAIN+1                                               01866000
LSCCHNG  EQU   LSCCHAI1                                                 01867000
LSCZRTSC EQU   LSCZMNRC                                                 01868000
LSCZRT0B EQU   LSCZMNRC                                                 01869000
LSCZRT0A EQU   LSCZMNRC                                                 01870000
LSCZRTL9 EQU   LSCZRT09                                                 01871000
LSCZRTL8 EQU   LSCZRT08                                                 01872000
LSCZRTL7 EQU   LSCZRT07                                                 01873000
LSCZRTL6 EQU   LSCZRT06                                                 01874000
LSCZRTL5 EQU   LSCZRT05                                                 01875000
LSCZRTL4 EQU   LSCZRT04                                                 01876000
LSCZRTL3 EQU   LSCZRT03                                                 01877000
LSCZRTL2 EQU   LSCZRT02                                                 01878000
LSCZRT01 EQU   LSCREQTG                                                 01879000
LSCZRT00 EQU   LSCREQTG                                                 01880000
LSCLNGTH EQU   LSC1WORD+1                                               01881000
LSCTYPE  EQU   LSC1WORD                                                 01882000
ZLBLNG1  EQU   ZLBFSM                                                   01883000
ZLBCHAIN EQU   ISTZLBUF                                                 01884000
FSBFDB   EQU   ISTFSB+32                                                01885000
FSBRSV01 EQU   FSBFSB+30                                                01886000
FSBTHCNT EQU   FSBFSB+28                                                01887000
FSBRLRSV EQU   FSBRLSTS                                                 01888000
FSBCFTX  EQU   FSBRLSTS                                                 01889000
FSBICNCB EQU   FSBMSGID                                                 01890000
FSBSSOC  EQU   FSBSS2                                                   01891000
FSBSSCC  EQU   FSBSS2                                                   01892000
FSBSSDC  EQU   FSBSS2                                                   01893000
FSBSSEC  EQU   FSBSS2                                                   01894000
FSBSSIR  EQU   FSBSS2                                                   01895000
FSBSSCR  EQU   FSBSS2                                                   01896000
@NM00086 EQU   FSBSS2                                                   01897000
@NM00085 EQU   FSBSS1                                                   01898000
FSBSSDE  EQU   FSBSS1                                                   01899000
FSBSSUS  EQU   FSBSS1                                                   01900000
@NM00084 EQU   FSBSS1                                                   01901000
FSBSOHI  EQU   FSBERC                                                   01902000
FSBLGI   EQU   FSBERC                                                   01903000
FSBLMRI  EQU   FSBFBMI                                                  01904000
FSBETI   EQU   FSBERC                                                   01905000
FSBEMI   EQU   FSBERC                                                   01906000
FSBEBI   EQU   FSBERC                                                   01907000
FSBECI   EQU   FSBERC                                                   01908000
FSBELI   EQU   FSBERC                                                   01909000
FSBMJRCD EQU   FSBSRCAT                                                 01910000
FSBXLCI  EQU   FSBXCODE                                                 01911000
FSBXFINS EQU   FSBXCODE                                                 01912000
FSBXNORM EQU   FSBXFSTS                                                 01913000
FSBSCODE EQU   FSBSYSRS                                                 01914000
FSBSPHSE EQU   FSBSYSRS                                                 01915000
FSBSERR  EQU   FSBSYSRS                                                 01916000
FSBCMD   EQU   FSBSEQ                                                   01917000
FSBDTRCE EQU   FSBFLAGS                                                 01918000
FSBASBTU EQU   FSBFLAGS                                                 01919000
FSBINPET EQU   FSBFLAGS                                                 01920000
FSBNONCB EQU   FSBFLAGS                                                 01921000
FSBLBIND EQU   FSBFLAGS                                                 01922000
FSBFFIND EQU   FSBFLAGS                                                 01923000
FSBACIND EQU   FSBFLAGS                                                 01924000
FSBRFIND EQU   FSBFLAGS                                                 01925000
FSBGATE  EQU   FSBFSBA                                                  01926000
FSBRSV02 EQU   FSBSFLGS                                                 01927000
FSBPGBUF EQU   FSBSFLGS                                                 01928000
FSBMNSDA EQU   FSBMNRCD                                                 01929000
FSBMNOA  EQU   FSBMNRCD                                                 01930000
FSBMNDIF EQU   FSBMNRCD                                                 01931000
FSBMNEOP EQU   FSBMNRCD                                                 01932000
FSBMNDNU EQU   FSBMNRCD                                                 01933000
FSBMNATN EQU   FSBMNRCD                                                 01934000
FSBMNRVI EQU   FSBMNRCD                                                 01935000
FSBMNELI EQU   FSBMNRCD                                                 01936000
FDBOFSET EQU   ISTFDB+10                                                01937000
FDBFDBA  EQU   ISTFDB                                                   01938000
FMCFLRSV EQU   FMCFLGB                                                  01939000
FMCFLGA8 EQU   FMCFLGB                                                  01940000
FMCCLRPH EQU   FMCVS1+45                                                01941000
FMCRSV0X EQU   FMCCVFLG                                                 01942000
FMCVYRPH EQU   FMCCVFLG                                                 01943000
FMCZV004 EQU   FMCVS1+40                                                01944000
FMCLOCK2 EQU   FMCVS1+36                                                01945000
@NM00083 EQU   FMCZFLG2                                                 01946000
FMCZF027 EQU   FMCZFLG2                                                 01947000
FMCZF026 EQU   FMCZFLG2                                                 01948000
FMCSEQ1B EQU   FMCSEQ1                                                  01949000
FMCSEQ1T EQU   FMCSEQ1                                                  01950000
FMCZX006 EQU   FMCVS1+33                                                01951000
FMCZX005 EQU   FMCVS1+32                                                01952000
FMCZX004 EQU   FMCVS1+31                                                01953000
FMCZX003 EQU   FMCVS1+30                                                01954000
FMCZX002 EQU   FMCVS1+29                                                01955000
FMCZX001 EQU   FMCVS1+28                                                01956000
FMCZV001 EQU   FMCVS1+24                                                01957000
FMCAWATQ EQU   FMCLCPAQ+1                                               01958000
@NM00082 EQU   FMCLCPAQ                                                 01959000
FMCLCPB2 EQU   FMCLCPBQ+1                                               01960000
FMCLCPB1 EQU   FMCLCPBQ                                                 01961000
FMCASCDQ EQU   FMCSHEAQ+1                                               01962000
@NM00081 EQU   FMCSHEAQ                                                 01963000
FMCSHEDQ EQU   FMCVS1+8                                                 01964000
FMCRSV04 EQU   FMCVS1+6                                                 01965000
FMCZH001 EQU   FMCVS1+4                                                 01966000
FMCZF025 EQU   FMCZFLAG+3                                               01967000
FMCZF024 EQU   FMCZFLAG+3                                               01968000
FMCZF023 EQU   FMCZFLAG+3                                               01969000
FMCZF022 EQU   FMCZFLAG+3                                               01970000
FMCZF021 EQU   FMCZFLAG+3                                               01971000
FMCZF020 EQU   FMCZFLAG+3                                               01972000
FMCZF019 EQU   FMCZFLAG+3                                               01973000
FMCZF018 EQU   FMCZFLAG+3                                               01974000
FMCZF017 EQU   FMCZFLAG+2                                               01975000
FMCZF016 EQU   FMCZFLAG+2                                               01976000
FMCZF015 EQU   FMCZFLAG+2                                               01977000
FMCZF014 EQU   FMCZFLAG+2                                               01978000
FMCZF013 EQU   FMCZFLAG+2                                               01979000
FMCZF012 EQU   FMCZFLAG+2                                               01980000
FMCZF011 EQU   FMCZFLAG+2                                               01981000
FMCZF010 EQU   FMCZFLAG+2                                               01982000
FMCZF00F EQU   FMCZFLAG+1                                               01983000
FMCZF00E EQU   FMCZFLAG+1                                               01984000
FMCZF00D EQU   FMCZFLAG+1                                               01985000
FMCZF00C EQU   FMCZFLAG+1                                               01986000
FMCZF00B EQU   FMCZFLAG+1                                               01987000
FMCRSV10 EQU   FMCZFLAG+1                                               01988000
FMCZF009 EQU   FMCZFLAG+1                                               01989000
FMCZFD06 EQU   FMCZF006+1                                               01990000
FMCZFC06 EQU   FMCZF006                                                 01991000
FMCZFB06 EQU   FMCZF006                                                 01992000
FMCZFA06 EQU   FMCZF006                                                 01993000
FMCZF005 EQU   FMCZFLAG                                                 01994000
FMCZF004 EQU   FMCZFLAG                                                 01995000
FMCZF003 EQU   FMCZFLAG                                                 01996000
FMCZF002 EQU   FMCZFLAG                                                 01997000
FMCZF001 EQU   FMCZFLAG                                                 01998000
FMCFRESA EQU   ISTFMCB+228                                              01999000
FMCSCSQN EQU   FMCSNCTL+2                                               02000000
FMCSCCTL EQU   FMCSNCTL+1                                               02001000
FMCSTCTL EQU   FMCSCFLG                                                 02002000
FMCSCCLO EQU   FMCSCFLG                                                 02003000
FMCAPRO  EQU   FMCSCFLG                                                 02004000
FMCLURO  EQU   FMCSCFLG                                                 02005000
FMCOBSAC EQU   FMCSCFLG                                                 02006000
FMCIBSAC EQU   FMCSCFLG                                                 02007000
FMCFBRE  EQU   ISTFMCB+220                                              02008000
FMCFBXM  EQU   FMCZV002                                                 02009000
FMCASEGQ EQU   ISTFMCB+212                                              02010000
FMCRDTPT EQU   ISTFMCB+208                                              02011000
FMCLOCK  EQU   ISTFMCB+204                                              02012000
FMCSEGD  EQU   FMCSSEGQ                                                 02013000
FMCRSPLM EQU   ISTFMCB+198                                              02014000
FMCPSTRS EQU   ISTFMCB+196                                              02015000
@NM00080 EQU   FMCRRESP                                                 02016000
FMCTSLHA EQU   FMCRRESP                                                 02017000
FMCFRRN  EQU   FMCRRESP                                                 02018000
FMCFME   EQU   FMCRRESP                                                 02019000
FMCFEX   EQU   FMCRRESP                                                 02020000
FMCFPE   EQU   FMCRRESP                                                 02021000
FMCCTLB  EQU   ISTFMCB+194                                              02022000
FMCBSQNO EQU   FMCCLSEQ+2                                               02023000
FMCTSQNO EQU   FMCCLSEQ                                                 02024000
FMCOBPRG EQU   FMCMODEB                                                 02025000
FMCIBPRG EQU   FMCMODEB                                                 02026000
FMCRESOT EQU   FMCMODEB                                                 02027000
FMCRSTSR EQU   FMCMODEB                                                 02028000
FMCLUQ   EQU   FMCMODEB                                                 02029000
FMCAPQ   EQU   FMCMODEB                                                 02030000
FMCCLEAR EQU   FMCMODEB                                                 02031000
FMCHOLD  EQU   FMCMODEB                                                 02032000
FMCIPSEQ EQU   ISTFMCB+188                                              02033000
FMCLUSTR EQU   ISTFMCB+187                                              02034000
FMCRSV87 EQU   FMCSTAT2                                                 02035000
FMCSEQI  EQU   FMCSTAT2                                                 02036000
FMCCPIP  EQU   FMCSTAT2                                                 02037000
FMCALIPR EQU   FMCSTAT2                                                 02038000
FMCIAIO  EQU   FMCSTAT2                                                 02039000
FMCZF00A EQU   FMCSTAT2                                                 02040000
FMCVPIP  EQU   FMCSTAT2                                                 02041000
FMCBHSET EQU   ISTFMCB+185                                              02042000
FMCPRMRC EQU   FMCCLEXT+20                                              02043000
FMCRSV89 EQU   FMCPSTAT                                                 02044000
FMCPCLSD EQU   FMCPSTAT                                                 02045000
FMCDDOCD EQU   FMCPSTAT                                                 02046000
FMCIDVFD EQU   FMCPSTAT                                                 02047000
FMCELKST EQU   FMCPSTAT                                                 02048000
FMCRSV88 EQU   FMCPSCMD                                                 02049000
FMCRDBLK EQU   FMCPSCMD                                                 02050000
FMCDSEOC EQU   FMCPSCMD                                                 02051000
FMCPURGE EQU   FMCPSCMD                                                 02052000
FMCRESTI EQU   FMCPSCMD                                                 02053000
FMCCNTCT EQU   FMCPSCMD                                                 02054000
FMCINVT  EQU   FMCPSCMD                                                 02055000
FMCFLGB7 EQU   FMCFLGCL                                                 02056000
FMCFLGB6 EQU   FMCFLGCL                                                 02057000
FMCFLGB5 EQU   FMCFLGCL                                                 02058000
FMCFLGB4 EQU   FMCFLGCL                                                 02059000
FMCFLGB3 EQU   FMCFLGCL                                                 02060000
FMCFLGB2 EQU   FMCFLGCL                                                 02061000
FMCFLGB1 EQU   FMCFLGCL                                                 02062000
FMCFLGB0 EQU   FMCFLGCL                                                 02063000
FMCFLGA7 EQU   FMCFLGA                                                  02064000
FMCFLGA6 EQU   FMCFLGA                                                  02065000
FMCFLGA5 EQU   FMCFLGA                                                  02066000
FMCFLGA4 EQU   FMCFLGA                                                  02067000
FMCFLGA3 EQU   FMCFLGA                                                  02068000
FMCFLGA2 EQU   FMCFLGA                                                  02069000
FMCFLGA1 EQU   FMCFLGA                                                  02070000
FMCFLGA0 EQU   FMCFLGA                                                  02071000
FMCDCLOK EQU   FMCCLEXT+12                                              02072000
FMCRAFM  EQU   FMCCLEXT+8                                               02073000
FMCFBPTR EQU   FMCFBA+1                                                 02074000
FMCFBRSV EQU   FMCFBA                                                   02075000
FMCRPLPT EQU   FMCRPLA+1                                                02076000
FMCRPLRS EQU   FMCRPLA                                                  02077000
FMCPRCLS EQU   FMCCVAL                                                  02078000
FMCIBCE  EQU   FMCCVAL                                                  02079000
FMCONLY  EQU   FMCOBCE                                                  02080000
FMCLAST  EQU   FMCOBCE                                                  02081000
FMCMIDLE EQU   FMCOBCE                                                  02082000
FMCFIRST EQU   FMCOBCE                                                  02083000
FMCCPCNT EQU   FMCPACPC                                                 02084000
FMCMPCNT EQU   FMCPACEM                                                 02085000
FMCNPCNT EQU   FMCPACEN                                                 02086000
FMCCONF  EQU   FMCSSTAT                                                 02087000
FMCPURCH EQU   FMCSSTAT                                                 02088000
FMCNSALU EQU   FMCSSTAT                                                 02089000
FMCBIP   EQU   FMCSSTAT                                                 02090000
FMCSDTR  EQU   FMCSSTAT                                                 02091000
FMCUIPI  EQU   FMCSSTAT                                                 02092000
FMCCIPI  EQU   FMCSSTAT                                                 02093000
FMCSNBI  EQU   FMCSSTAT                                                 02094000
FMCRVD01 EQU   ISTFMCB+158                                              02095000
FMCISSN  EQU   ISTFMCB+156                                              02096000
FMCOASN  EQU   FMCNXOSC                                                 02097000
FMCOSSN  EQU   FMCNXCFM                                                 02098000
FMCSIP   EQU   FMCSIPA                                                  02099000
FMCEXLST EQU   ISTFMCB+144                                              02100000
FMCPAB5  EQU   ISTFMCB+128                                              02101000
FMCPAB4  EQU   ISTFMCB+112                                              02102000
FMCPAB3  EQU   ISTFMCB+96                                               02103000
FMCPAB2  EQU   ISTFMCB+80                                               02104000
FMCPAB1  EQU   ISTFMCB+64                                               02105000
FMCFASYA EQU   ISTFMCB+60                                               02106000
FMCMODE  EQU   ISTFMCB+52                                               02107000
FMCPROCD EQU   ISTFMCB+48                                               02108000
FMCVWT   EQU   ISTFMCB+44                                               02109000
FMCRPLH  EQU   ISTFMCB+40                                               02110000
FMCBUFNB EQU   FMCCMPS1+2                                               02111000
FMCBUFLM EQU   FMCCMPS1                                                 02112000
FMCDEBA  EQU   ISTFMCB+32                                               02113000
@NM00079 EQU   FMCCMDFL                                                 02114000
FMCSNA   EQU   FMCCMDFL                                                 02115000
FMCVSNA  EQU   FMCCMDFL                                                 02116000
FMCCMDR  EQU   FMCCMDFL                                                 02117000
@NM00078 EQU   ISTFMCB+30                                               02118000
@NM00077 EQU   FMCSTAT1                                                 02119000
FMCHPURG EQU   FMCSTAT1                                                 02120000
FMCVSP2  EQU   FMCSTAT1                                                 02121000
FMCVSP1  EQU   FMCSTAT                                                  02122000
FMCLTEAS EQU   FMCSTAT                                                  02123000
FMCZF007 EQU   FMCSTAT                                                  02124000
FMCDEDSC EQU   FMCSTAT                                                  02125000
FMCDEVOF EQU   FMCSTAT                                                  02126000
FMCDAPT  EQU   FMCSTAT                                                  02127000
FMCPRMTE EQU   FMCSTAT                                                  02128000
FMCPRMTR EQU   FMCSTAT                                                  02129000
FMCUSFLD EQU   ISTFMCB+24                                               02130000
FMCFMCBA EQU   ISTFMCB+20                                               02131000
FMCDNCBA EQU   ISTFMCB+16                                               02132000
FMCDVTA  EQU   ISTFMCB+12                                               02133000
FMCTSKID EQU   ISTFMCB+8                                                02134000
FMCNXTCB EQU   ISTFMCB+4                                                02135000
FMCSAF   EQU   ISTFMCB+2                                                02136000
FMCLNGTH EQU   ISTFMCB+1                                                02137000
FMCTYPE  EQU   ISTFMCB                                                  02138000
PROSRDEF EQU   PROSETM4                                                 02139000
PRORSV47 EQU   PROSETM4                                                 02140000
PROSCON  EQU   PROSETM4                                                 02141000
PRORSV46 EQU   PROSETM3                                                 02142000
PROSMONT EQU   PROSETM3                                                 02143000
PRORSV45 EQU   PROSETM3                                                 02144000
PROSNTO  EQU   PROSETM3                                                 02145000
PRORSV44 EQU   PROSETM3                                                 02146000
PRORSV43 EQU   PROSETM2                                                 02147000
PROSNTFL EQU   PROSETM2                                                 02148000
PRORSV42 EQU   PROSETM2                                                 02149000
PRORSV41 EQU   PROPROCS                                                 02150000
PROMODC  EQU   PROPROC4                                                 02151000
PROMODT  EQU   PROPROC4                                                 02152000
PROMODM  EQU   PROPROC4                                                 02153000
PROMODB  EQU   PROPROC4                                                 02154000
PRORSV14 EQU   PROPROC4                                                 02155000
PRORSV13 EQU   PROPROC4                                                 02156000
PRORSV12 EQU   PROPROC4                                                 02157000
PROEIB   EQU   PROPROC4                                                 02158000
PRORSV11 EQU   PROPROC3                                                 02159000
PROMONT2 EQU   PROPROC3                                                 02160000
PROMONIT EQU   PROPROC3                                                 02161000
PROSUBLK EQU   PROPROC3                                                 02162000
PRONTO   EQU   PROPROC3                                                 02163000
PROLGIN  EQU   PROPROC3                                                 02164000
PROERPI  EQU   PROPROC3                                                 02165000
PRORSV07 EQU   PROPROC3                                                 02166000
PROCFTX  EQU   PROPROC2                                                 02167000
PROEMLC  EQU   PROPROC2                                                 02168000
PRONTFL  EQU   PROPROC2                                                 02169000
PRORSV05 EQU   PROPROC2                                                 02170000
PRORSV04 EQU   PROPROC2                                                 02171000
PROLGOT  EQU   PROPROC2                                                 02172000
PROERPO  EQU   PROPROC2                                                 02173000
PRORSV03 EQU   PROPROC2                                                 02174000
PRORPLC  EQU   PROPROC1                                                 02175000
PROCS    EQU   PROPROC1                                                 02176000
PROCA    EQU   PROPROC1                                                 02177000
PRORESPX EQU   PROPROC1                                                 02178000
PRODFASY EQU   PROPROC1                                                 02179000
PROXPOPT EQU   PROPROC1                                                 02180000
PROTRUNC EQU   PROPROC1                                                 02181000
PROASYIP EQU   PROPROC1                                                 02182000
DNCZC001 EQU   DNCOS+40                                                 02183000
DNCLOCK  EQU   DNCOS+36                                                 02184000
DNCZV005 EQU   DNCOS+32                                                 02185000
DNCZV004 EQU   DNCOS+28                                                 02186000
DNCZV003 EQU   DNCOS+24                                                 02187000
DNCZV002 EQU   DNCOS+21                                                 02188000
DNCZX001 EQU   DNCOS+20                                                 02189000
DNCZV001 EQU   DNCOS+17                                                 02190000
DNCZX003 EQU   DNCOS+16                                                 02191000
DNCZV000 EQU   DNCOS+12                                                 02192000
DNCSESCQ EQU   DNCOS+8                                                  02193000
DNCSESIQ EQU   DNCOS+4                                                  02194000
DNCACIP  EQU   DNCBSCED+1                                               02195000
DNCLICP  EQU   DNCBSCED                                                 02196000
DNCZF008 EQU   DNCZFLGS+1                                               02197000
DNCZPSRD EQU   DNCZFLGS+1                                               02198000
DNCPSOL  EQU   DNCZFLGS+1                                               02199000
DNCZF007 EQU   DNCZFLGS+1                                               02200000
DNCZF006 EQU   DNCZFLGS+1                                               02201000
DNCZF005 EQU   DNCZFLGS+1                                               02202000
DNCZF004 EQU   DNCZFLGS+1                                               02203000
DNCZF003 EQU   DNCZFLGS                                                 02204000
DNCZF002 EQU   DNCZFLGS                                                 02205000
DNCZRSCH EQU   DNCZFLGS                                                 02206000
DNCDISC  EQU   DNCZFLGS                                                 02207000
DNCCONT  EQU   DNCZFLGS                                                 02208000
DNCINVIT EQU   DNCZFLGS                                                 02209000
DNCSESS  EQU   DNCZFLGS                                                 02210000
DNCZF001 EQU   DNCZFLGS                                                 02211000
DNCMODE  EQU   ISTDNCB+49                                               02212000
DNCBHSET EQU   ISTDNCB+48                                               02213000
DNCNCB   EQU   ISTDNCB                                                  02214000
LDNZS00F EQU   LDNZH003+1                                               02215000
LDNZS00E EQU   LDNZH003+1                                               02216000
LDNZS00D EQU   LDNZH003+1                                               02217000
LDNZS00C EQU   LDNZH003+1                                               02218000
LDNZS00B EQU   LDNZH003+1                                               02219000
LDNZS007 EQU   LDNZH003                                                 02220000
LDNZS006 EQU   LDNZH003                                                 02221000
LDNZS005 EQU   LDNZH003                                                 02222000
LDNZS004 EQU   LDNZH003                                                 02223000
LDNZS003 EQU   LDNZH003                                                 02224000
LDNZS002 EQU   LDNZH003                                                 02225000
LDNZS001 EQU   LDNZH003                                                 02226000
LDNZS000 EQU   LDNZH003                                                 02227000
LDNZX006 EQU   ISTLDNCB+576                                             02228000
LDNZC001 EQU   ISTLDNCB+569                                             02229000
LDNZX005 EQU   ISTLDNCB+568                                             02230000
LDNZV006 EQU   ISTLDNCB+564                                             02231000
LDNSRB   EQU   ISTLDNCB+520                                             02232000
LDNIOSB  EQU   ISTLDNCB+412                                             02233000
@NM00076 EQU   LDNZSAV3+28                                              02234000
LDNRSV06 EQU   LDNZSAV4+16                                              02235000
LDNZSAV6 EQU   LDNZSAV4+12                                              02236000
LDNZSAV5 EQU   LDNZSAV4                                                 02237000
LDNZSAVE EQU   LDNZSAV3                                                 02238000
LDNZSAV2 EQU   ISTLDNCB+368                                             02239000
LDNZSAV1 EQU   ISTLDNCB+352                                             02240000
LDNZ3RR  EQU   ISTLDNCB+348                                             02241000
LDNZ2RR  EQU   ISTLDNCB+344                                             02242000
LDNZ1RR  EQU   ISTLDNCB+340                                             02243000
LDNRSV0B EQU   ISTLDNCB+336                                             02244000
LDNRSV0A EQU   ISTLDNCB+332                                             02245000
LDNRSV09 EQU   ISTLDNCB+328                                             02246000
LDNRSV08 EQU   ISTLDNCB+324                                             02247000
LDNRSV07 EQU   ISTLDNCB+320                                             02248000
LDNDEAD  EQU   LDNDCDEB+12                                              02249000
LDNUCBAD EQU   LDNDCDEB+8                                               02250000
LDNAPPAD EQU   LDNDCDEB+5                                               02251000
LDNEXSCL EQU   LDNDCDEB+4                                               02252000
LDNDCBAD EQU   LDNDCDEB+1                                               02253000
LDNDEBID EQU   LDNDCDEB                                                 02254000
LDNZRIND EQU   ISTLDNCB+300                                             02255000
LDNZCHNC EQU   ISTLDNCB+187                                             02256000
LDNZLPC7 EQU   LDNZLPC                                                  02257000
LDNZLPC6 EQU   LDNZLPC                                                  02258000
LDNZLPC5 EQU   LDNZLPC                                                  02259000
LDNZLPC4 EQU   LDNZLPC                                                  02260000
LDNZLPC3 EQU   LDNZLPC                                                  02261000
LDNZLPC2 EQU   LDNZLPC                                                  02262000
LDNZLPC1 EQU   LDNZLPC                                                  02263000
LDNZLPC0 EQU   LDNZLPC                                                  02264000
LDNRSV05 EQU   LDNZERPF                                                 02265000
LDNZCTOV EQU   LDNZEPIN                                                 02266000
LDNZF001 EQU   LDNZEPIN                                                 02267000
LDNZFRDW EQU   LDNZCPAN                                                 02268000
LDNZFRD  EQU   LDNZCPAN                                                 02269000
LDNZNARD EQU   LDNZCPAN                                                 02270000
LDNRSV04 EQU   LDNZIOLK                                                 02271000
LDNZATBF EQU   LDNZIOLK                                                 02272000
LDNZERLK EQU   LDNZIOLK                                                 02273000
LDNZDSIC EQU   LDNZIOLK                                                 02274000
LDNZPAB1 EQU   ISTLDNCB+168                                             02275000
LDNZV005 EQU   ISTLDNCB+160                                             02276000
LDNZS1VR EQU   ISTLDNCB+136                                             02277000
LDNZS1RR EQU   ISTLDNCB+132                                             02278000
LDNZS1FC EQU   ISTLDNCB+128                                             02279000
LDNZS1BC EQU   ISTLDNCB+124                                             02280000
LDNZFBUF EQU   ISTLDNCB+116                                             02281000
LDNZLAST EQU   ISTLDNCB+112                                             02282000
LDNRSV02 EQU   LDNFLAG2                                                 02283000
LDNZFF04 EQU   LDNFLAG2                                                 02284000
LDNZFF69 EQU   LDNFLAGS+2                                               02285000
LDNTPBIO EQU   LDNFLAGS+2                                               02286000
LDNZFF03 EQU   LDNFLAGS+2                                               02287000
LDNZFF02 EQU   LDNFLAGS+2                                               02288000
LDNZFF01 EQU   LDNFLAGS+2                                               02289000
LDNZFF00 EQU   LDNFLAGS+2                                               02290000
LDNCLOSD EQU   LDNFLAGS+2                                               02291000
LDNZENTR EQU   LDNFLAGS+2                                               02292000
LDNZICCW EQU   LDNFLAGS+1                                               02293000
LDNZREC  EQU   LDNFLAGS+1                                               02294000
LDNZCTXT EQU   LDNFLAGS+1                                               02295000
LDNZATLK EQU   LDNFLAGS+1                                               02296000
LDNZCHNE EQU   LDNFLAGS+1                                               02297000
LDNZATTP EQU   LDNFLAGS+1                                               02298000
LDNZF00A EQU   LDNFLAGS+1                                               02299000
LDNZF009 EQU   LDNFLAGS                                                 02300000
LDNZF007 EQU   LDNFLAGS                                                 02301000
LDNZF003 EQU   LDNFLAGS                                                 02302000
LDNZF002 EQU   LDNFLAGS                                                 02303000
LDNZHDCC EQU   ISTLDNCB+106                                             02304000
LDNZARM  EQU   ISTLDNCB+104                                             02305000
LDNZRB   EQU   ISTLDNCB+100                                             02306000
LDNCPQ   EQU   ISTLDNCB+96                                              02307000
LDNSIOQ  EQU   ISTLDNCB+92                                              02308000
LDNZX002 EQU   ISTLDNCB+91                                              02309000
LDNZX001 EQU   ISTLDNCB+90                                              02310000
LDNZH002 EQU   ISTLDNCB+88                                              02311000
LDNCSWSV EQU   ISTLDNCB+60                                              02312000
LDNCHFLD EQU   ISTLDNCB+56                                              02313000
LDNRESRV EQU   ISTLDNCB+55                                              02314000
@NM00075 EQU   LDNCFLAG                                                 02315000
LDNRMF   EQU   LDNCFLAG                                                 02316000
LDNIBI   EQU   LDNCFLAG                                                 02317000
LDNCUUA  EQU   ISTLDNCB+48                                              02318000
NCBRSV01 EQU   ISTNCB+46                                                02319000
NCBSWDAF EQU   ISTNCB+44                                                02320000
NCBDEVCH EQU   ISTNCB+36                                                02321000
NCBFMCBP EQU   ISTNCB+32                                                02322000
NCBLTRC  EQU   ISTNCB+30                                                02323000
NCBRVPT1 EQU   ISTNCB+28                                                02324000
NCBNMLLN EQU   NCBFLAGS+3                                               02325000
@NM00074 EQU   NCBFLAG1                                                 02326000
@NM00073 EQU   NCBFLAG1                                                 02327000
NCBTTF   EQU   NCBFLAG1                                                 02328000
NCBRSYNC EQU   NCBFLAG1                                                 02329000
NCBRSTRT EQU   NCBFLAG1                                                 02330000
NCBCONF  EQU   NCBFLAG1                                                 02331000
NCBSNAI  EQU   NCBFLAG1                                                 02332000
NCBFLTIO EQU   NCBFTRIO                                                 02333000
NCBCSTAT EQU   NCBFLAGS                                                 02334000
NCBNCSL  EQU   ISTNCB+22                                                02335000
NCBNCBA  EQU   ISTNCB+20                                                02336000
NCBFMCBA EQU   ISTNCB+16                                                02337000
NCBNSNA  EQU   ISTNCB+12                                                02338000
NCBTSKID EQU   ISTNCB+8                                                 02339000
NCBRDTE  EQU   ISTNCB+4                                                 02340000
NCBLNGTH EQU   ISTNCB+1                                                 02341000
NCBTYPE  EQU   ISTNCB                                                   02342000
DEVRSV03 EQU   ISTDEVCH+5                                               02343000
DEVPHYSA EQU   ISTDEVCH+4                                               02344000
DEVCSLPN EQU   DEVCHAR3                                                 02345000
DEVCSTCL EQU   DEVCHAR3                                                 02346000
DEVCCHEK EQU   DEVCHAR3                                                 02347000
DEVCATTN EQU   DEVCHAR3                                                 02348000
DEVCSWL  EQU   DEVFCCTL                                                 02349000
DEVCRVB  EQU   DEVFCCTL                                                 02350000
DEVCSSL  EQU   DEVFCCTL                                                 02351000
DEVCBSC  EQU   DEVFCCTL                                                 02352000
DEVMCODE EQU   ISTDEVCH+2                                               02353000
DEVCHAR2 EQU   DEVTCODE                                                 02354000
DEVRSV01 EQU   DEVCHAR                                                  02355000
DEVCCTL  EQU   DEVCHAR                                                  02356000
DEVNNSPT EQU   DEVCHAR                                                  02357000
DEVSPS   EQU   DEVCHAR                                                  02358000
DEVSUBND EQU   DEVCHAR                                                  02359000
DEVCONVR EQU   DEVCHAR                                                  02360000
DEVOTPUT EQU   DEVCHAR                                                  02361000
DEVINPUT EQU   DEVCHAR                                                  02362000
ATCAOS   EQU   ISTATCVT+1552                                            02363000
ATCVIOPM EQU   ATCAOSM+636                                              02364000
ATCTPMMI EQU   ATCAOSM+632                                              02365000
ATCTPMPB EQU   ATCAOSM+600                                              02366000
ATCRPLCT EQU   ATCAOSM+594                                              02367000
ATCCRACT EQU   ATCAOSM+592                                              02368000
ATCSRBCT EQU   ATCAOSM+590                                              02369000
ATCRSV75 EQU   ATCAOSM+589                                              02370000
ATCRSV66 EQU   ATCZFLAG                                                 02371000
ATCZF001 EQU   ATCZFLAG                                                 02372000
ATCTPCP1 EQU   ATCAOSM+584                                              02373000
ATCAICTN EQU   ATCAOSM+576                                              02374000
ATCMPLTA EQU   ATCAOSM+568                                              02375000
ATCASCB  EQU   ATCAOSM+564                                              02376000
ATCAP86  EQU   ATCAOSM+560                                              02377000
ATCAP85  EQU   ATCAOSM+556                                              02378000
ATCAP84  EQU   ATCAOSM+552                                              02379000
ATCAP83  EQU   ATCAOSM+548                                              02380000
ATCAP82  EQU   ATCAOSM+544                                              02381000
ATCAP69  EQU   ATCAOSM+540                                              02382000
ATCAP66  EQU   ATCAOSM+536                                              02383000
ATCAP62  EQU   ATCAOSM+532                                              02384000
ATCAPC59 EQU   ATCAOSM+528                                              02385000
ATCAP56  EQU   ATCAOSM+524                                              02386000
ATCAP55  EQU   ATCAOSM+520                                              02387000
ATCRCFY0 EQU   ATCAOSM+516                                              02388000
ATCAP41  EQU   ATCAOSM+512                                              02389000
ATCAPC25 EQU   ATCAOSM+508                                              02390000
ATCAP23  EQU   ATCAOSM+504                                              02391000
ATCTPSPB EQU   ATCAOSM+472                                              02392000
ATCTRMBP EQU   ATCAOSM+440                                              02393000
ATCPSTA  EQU   ATCAOSM+432                                              02394000
ATCSMABF EQU   ATCAOSM+428                                              02395000
ATCSMAPR EQU   ATCAOSM+424                                              02396000
ATCTPWQA EQU   ATCAOSM+420                                              02397000
ATCSMAID EQU   ATCAOSM+416                                              02398000
ATCSMARA EQU   ATCAOSM+412                                              02399000
ATCCACXA EQU   ATCAOSM+408                                              02400000
ATCZLAAB EQU   ATCAOSM+404                                              02401000
ATCATA10 EQU   ATCAOSM+400                                              02402000
ATCHLTCB EQU   ATCAOSM+396                                              02403000
@NM00072 EQU   ATCVTFLG                                                 02404000
ATCVTACT EQU   ATCVTFLG                                                 02405000
ATCRPT40 EQU   ATCAOSM+388                                              02406000
ATCRPT39 EQU   ATCAOSM+384                                              02407000
ATCRPT38 EQU   ATCAOSM+380                                              02408000
ATCRPT37 EQU   ATCAOSM+376                                              02409000
ATCRPT36 EQU   ATCAOSM+372                                              02410000
ATCRPT35 EQU   ATCAOSM+368                                              02411000
ATCRPT34 EQU   ATCAOSM+364                                              02412000
ATCRPT33 EQU   ATCAOSM+360                                              02413000
ATCRPT32 EQU   ATCAOSM+356                                              02414000
ATCRPT31 EQU   ATCAOSM+352                                              02415000
ATCRPT30 EQU   ATCAOSM+348                                              02416000
ATCRPT29 EQU   ATCAOSM+344                                              02417000
ATCRPT28 EQU   ATCAOSM+340                                              02418000
ATCRPT27 EQU   ATCAOSM+336                                              02419000
ATCRPT26 EQU   ATCAOSM+332                                              02420000
ATCRPT25 EQU   ATCAOSM+328                                              02421000
ATCRPT24 EQU   ATCAOSM+324                                              02422000
ATCRPT23 EQU   ATCAOSM+320                                              02423000
ATCRPT22 EQU   ATCAOSM+316                                              02424000
ATCRPT21 EQU   ATCAOSM+312                                              02425000
ATCRPT20 EQU   ATCAOSM+308                                              02426000
ATCRPT19 EQU   ATCAOSM+304                                              02427000
ATCRPT18 EQU   ATCAOSM+300                                              02428000
ATCRPT17 EQU   ATCAOSM+296                                              02429000
ATCRPT16 EQU   ATCAOSM+292                                              02430000
ATCRPT15 EQU   ATCAOSM+288                                              02431000
ATCRPT14 EQU   ATCAOSM+284                                              02432000
ATCRPT13 EQU   ATCAOSM+280                                              02433000
ATCRPT12 EQU   ATCAOSM+276                                              02434000
ATCRPT11 EQU   ATCAOSM+272                                              02435000
ATCAP38  EQU   ATCAOSM+268                                              02436000
ATCZDFJ0 EQU   ATCAOSM+260                                              02437000
ATCAP51  EQU   ATCAOSM+256                                              02438000
ATCZPAB2 EQU   ATCAOSM+224                                              02439000
ATCZLPVT EQU   ATCAOSM+184                                              02440000
ATCZDVTX EQU   ATCAOSM+180                                              02441000
ATCZDVTA EQU   ATCAOSM+176                                              02442000
ATCZDVT9 EQU   ATCAOSM+172                                              02443000
ATCZDVT8 EQU   ATCAOSM+168                                              02444000
ATCZDVT7 EQU   ATCAOSM+164                                              02445000
ATCRSV56 EQU   ATCDAPVT+22                                              02446000
ATCDAPDG EQU   ATCDAPVT+20                                              02447000
ATCDXCEA EQU   ATCDAPVT+16                                              02448000
ATCDCEA  EQU   ATCDAPVT+12                                              02449000
ATCDPCIA EQU   ATCDAPVT+8                                               02450000
ATCDSIOA EQU   ATCDAPVT+4                                               02451000
ATCDEOEA EQU   ATCDAPVT                                                 02452000
ATCZLAEA EQU   ATCLDAPP+16                                              02453000
ATCZLCEA EQU   ATCLDAPP+12                                              02454000
ATCRSV17 EQU   ATCLDAPP+8                                               02455000
ATCSMFRR EQU   ATCLDAPP+4                                               02456000
ATCCDTID EQU   ATCLDAPP                                                 02457000
ATCZAEA  EQU   ATCICAPP+16                                              02458000
ATCZCEA  EQU   ATCICAPP+12                                              02459000
ATCCDTCB EQU   ATCICAPP+8                                               02460000
ATCZSIOA EQU   ATCICAPP+4                                               02461000
ATCCDRPH EQU   ATCICAPP                                                 02462000
ATCAP65  EQU   ATCAOSM+96                                               02463000
ATCZDVT6 EQU   ATCAOSM+92                                               02464000
ATCZDVT4 EQU   ATCAOSM+88                                               02465000
ATCZDVT3 EQU   ATCAOSM+84                                               02466000
ATCZDVT1 EQU   ATCAOSM+80                                               02467000
ATCICNCB EQU   ATCAOSM+76                                               02468000
ATCZFSVT EQU   ATCAOSM+68                                               02469000
ATCAP64  EQU   ATCAOSM+64                                               02470000
ATCAP63  EQU   ATCAOSM+60                                               02471000
ATCAP61  EQU   ATCAOSM+56                                               02472000
ATCAP58  EQU   ATCAOSM+52                                               02473000
ATCAP57  EQU   ATCAOSM+48                                               02474000
ATCAP54  EQU   ATCAOSM+44                                               02475000
ATCAP53  EQU   ATCAOSM+40                                               02476000
ATCAP52  EQU   ATCAOSM+36                                               02477000
ATCAP32  EQU   ATCAOSM+28                                               02478000
ATCAP31  EQU   ATCAOSM+24                                               02479000
ATCAP12  EQU   ATCAOSM+20                                               02480000
ATCAP11  EQU   ATCAOSM+16                                               02481000
ATCCMTCB EQU   ATCAOSM+12                                               02482000
ATCPRPH  EQU   ATCAOSM+8                                                02483000
ATCGSRBF EQU   ATCGSRBG                                                 02484000
ATCSRBRT EQU   ATCAOSM                                                  02485000
ATCRSVBB EQU   ISTATCVT+908                                             02486000
ATCVDLOK EQU   ISTATCVT+904                                             02487000
ATCVFPAB EQU   ISTATCVT+872                                             02488000
ATCVDPAB EQU   ISTATCVT+840                                             02489000
ATCIOECB EQU   ISTATCVT+836                                             02490000
ATCINCW3 EQU   ISTATCVT+832                                             02491000
ATCMODTB EQU   ISTATCVT+828                                             02492000
ATCUSSPT EQU   ISTATCVT+824                                             02493000
ATCSRTAB EQU   ISTATCVT+820                                             02494000
@NM00071 EQU   ISTATCVT+818                                             02495000
ATCNMCTR EQU   ISTATCVT+816                                             02496000
ATCSEC51 EQU   ATCSECST                                                 02497000
ATCSEC40 EQU   ATCSIPD+8                                                02498000
ATCSEC30 EQU   ATCSIPD+4                                                02499000
ATCSEC21 EQU   ATCSIPD                                                  02500000
ATCSEC10 EQU   ATCSOPD+4                                                02501000
ATCSEC01 EQU   ATCSOPD                                                  02502000
ATCPOIA  EQU   ISTATCVT+788                                             02503000
ATCPODVT EQU   ISTATCVT+784                                             02504000
ATCS49XL EQU   ISTATCVT+780                                             02505000
ATCS49XI EQU   ISTATCVT+776                                             02506000
ATCLCLCT EQU   ATCVLCNT+2                                               02507000
ATCRNCNT EQU   ATCVLCNT                                                 02508000
ATCCFEAD EQU   ISTATCVT+768                                             02509000
ATCPTR00 EQU   ISTATCVT+736                                             02510000
ATCRSV10 EQU   ISTATCVT+704                                             02511000
ATCTACB  EQU   ISTATCVT+700                                             02512000
ATCVTINM EQU   ISTATCVT+696                                             02513000
ATCTCLIM EQU   ISTATCVT+692                                             02514000
ATCTCLOM EQU   ISTATCVT+688                                             02515000
ATCVTIPB EQU   ISTATCVT+656                                             02516000
ATCTCIPB EQU   ISTATCVT+624                                             02517000
ATCTIPAB EQU   ISTATCVT+592                                             02518000
ATCOCCCB EQU   ISTATCVT+588                                             02519000
ATCOCCOB EQU   ISTATCVT+584                                             02520000
ATCCDLAD EQU   ISTATCVT+580                                             02521000
ATCCCLAD EQU   ISTATCVT+576                                             02522000
ATCDLRPB EQU   ISTATCVT+544                                             02523000
ATCPGPAB EQU   ISTATCVT+512                                             02524000
ATCVPAB1 EQU   ISTATCVT+480                                             02525000
ATCRSV97 EQU   ISTATCVT+476                                             02526000
ATCRDTLK EQU   ISTATCVT+472                                             02527000
ATCVOCLK EQU   ISTATCVT+468                                             02528000
ATCCDFDN EQU   ISTATCVT+464                                             02529000
ATCCDFIN EQU   ISTATCVT+460                                             02530000
ATCDVTLK EQU   ISTATCVT+456                                             02531000
ATCAP36  EQU   ISTATCVT+452                                             02532000
ATCAP35  EQU   ISTATCVT+448                                             02533000
ATCAP33  EQU   ISTATCVT+444                                             02534000
ATCRSV99 EQU   ISTATCVT+412                                             02535000
ATCLDECB EQU   ISTATCVT+408                                             02536000
ATCLDNCS EQU   ISTATCVT+404                                             02537000
ATCCDPTR EQU   ISTATCVT+400                                             02538000
ATCADEL  EQU   ISTATCVT+396                                             02539000
ATCTODVT EQU   ISTATCVT+392                                             02540000
ATCDEBCH EQU   ISTATCVT+388                                             02541000
ATCHBSIZ EQU   ATCHPGM+2                                                02542000
ATCHBFNO EQU   ATCHPGM                                                  02543000
ATCCRME  EQU   ISTATCVT+380                                             02544000
ATCRVCHS EQU   ISTATCVT+372                                             02545000
ATCECTLP EQU   ISTATCVT+368                                             02546000
ATCZDVTB EQU   ISTATCVT+364                                             02547000
ATCECPRT EQU   ISTATCVT+360                                             02548000
ATCVTLOD EQU   ISTATCVT+356                                             02549000
ATCTRPAB EQU   ISTATCVT+352                                             02550000
ATCMSGM  EQU   ISTATCVT+348                                             02551000
ATCMSGP  EQU   ISTATCVT+344                                             02552000
ATCEPT   EQU   ISTATCVT+340                                             02553000
ATCDVT   EQU   ISTATCVT+336                                             02554000
ATCTRCPT EQU   ISTATCVT+332                                             02555000
ATCDVLOD EQU   ISTATCVT+328                                             02556000
ATCALERT EQU   ISTATCVT+324                                             02557000
ATCEPA   EQU   ISTATCVT+320                                             02558000
ATCSAF   EQU   ISTATCVT+318                                             02559000
ATCXRANG EQU   ISTATCVT+317                                             02560000
ATCLAST  EQU   ATCSHRFG                                                 02561000
ATCSHRTN EQU   ISTATCVT+308                                             02562000
ATCUEP   EQU   ISTATCVT+304                                             02563000
ATCOCRT  EQU   ISTATCVT+300                                             02564000
ATCCSMA  EQU   ATCCSMR                                                  02565000
ATCESC02 EQU   ISTATCVT+292                                             02566000
ATCESC01 EQU   ISTATCVT+288                                             02567000
ATCCDFND EQU   ISTATCVT+284                                             02568000
ATCCDDEL EQU   ISTATCVT+280                                             02569000
ATCCDADD EQU   ISTATCVT+276                                             02570000
ATCMNT   EQU   ISTATCVT+272                                             02571000
ATCRSV16 EQU   ISTATCVT+270                                             02572000
ATCMAXID EQU   ISTATCVT+269                                             02573000
ATCMSGSP EQU   ATCCOM+268                                               02574000
ATCCIDM  EQU   ATCCOM+266                                               02575000
ATCACTRM EQU   ATCCOM+264                                               02576000
ATCNERAP EQU   ATCCOM+260                                               02577000
ATCNESAL EQU   ATCCOM+256                                               02578000
ATCRCC65 EQU   ATCCOM+252                                               02579000
ATCRCC26 EQU   ATCCOM+248                                               02580000
ATCRCC63 EQU   ATCCOM+244                                               02581000
ATCRSV11 EQU   ATCCOM+242                                               02582000
ATCVTMID EQU   ATCCOM+240                                               02583000
ATCAPOST EQU   ATCCOM+236                                               02584000
ATCNERFN EQU   ATCCOM+232                                               02585000
ATCNERNE EQU   ATCCOM+228                                               02586000
ATCNERCV EQU   ATCCOM+224                                               02587000
ATCNERST EQU   ATCCOM+220                                               02588000
ATCDCC61 EQU   ATCCOM+216                                               02589000
ATCDCC60 EQU   ATCCOM+212                                               02590000
ATCSRTDF EQU   ATCCOM+208                                               02591000
ATCSRTAD EQU   ATCCOM+204                                               02592000
ATCFIRA  EQU   ATCCOM+200                                               02593000
ATCSMBQ  EQU   ATCCOM+196                                               02594000
ATCSMRC  EQU   ATCCOM+192                                               02595000
ATCSMRS  EQU   ATCCOM+188                                               02596000
ATCSMQU  EQU   ATCCOM+184                                               02597000
ATCSMRQ  EQU   ATCCOM+180                                               02598000
ATCACDA  EQU   ATCCOM+176                                               02599000
ATCSTMA  EQU   ATCCOM+172                                               02600000
ATCFRSTR EQU   ATCCOM+168                                               02601000
ATCGTSTR EQU   ATCCOM+164                                               02602000
ATCREADA EQU   ATCCOM+160                                               02603000
ATCALOAD EQU   ATCCOM+156                                               02604000
ATCBLDLA EQU   ATCCOM+152                                               02605000
ATCFBRPH EQU   ATCCOM+148                                               02606000
ATCBFTRC EQU   ATCCOM+144                                               02607000
ATCTPBUF EQU   ATCTHTRC                                                 02608000
ATCREMOV EQU   ATCCOM+136                                               02609000
ATCADD   EQU   ATCCOM+132                                               02610000
ATCBPDA  EQU   ATCCOM+128                                               02611000
ATCDVTPT EQU   ATCCOM+124                                               02612000
ATCFEPT  EQU   ATCCOM+120                                               02613000
ATCFDVT  EQU   ATCCOM+116                                               02614000
ATCCONFT EQU   ATCCOM+112                                               02615000
ATCPTCHA EQU   ATCCOM+108                                               02616000
ATCAUTHA EQU   ATCCOM+104                                               02617000
ATCACCTA EQU   ATCCOM+100                                               02618000
ATCRDTH  EQU   ATCCOM+96                                                02619000
ATCFRSCH EQU   ATCCOM+92                                                02620000
ATCFSB   EQU   ATCCOM+88                                                02621000
ATCHLTMS EQU   ATCCOM+84                                                02622000
ATCECPRM EQU   ATCCOM+80                                                02623000
ATCECNET EQU   ATCCOM+76                                                02624000
ATCECOPC EQU   ATCCOM+72                                                02625000
ATCVPARM EQU   ATCCOM+68                                                02626000
ATCECVRQ EQU   ATCCOM+64                                                02627000
ATCECSES EQU   ATCCOM+60                                                02628000
ATCOCHA  EQU   ATCCOM+56                                                02629000
ATCDSPLQ EQU   ATCCOM+52                                                02630000
ATCECDSP EQU   ATCCOM+48                                                02631000
ATCVARYQ EQU   ATCCOM+44                                                02632000
ATCECVRY EQU   ATCCOM+40                                                02633000
ATCHALTQ EQU   ATCCOM+36                                                02634000
ATCECHLT EQU   ATCCOM+32                                                02635000
ATCMODQ  EQU   ATCCOM+28                                                02636000
ATCECMOD EQU   ATCCOM+24                                                02637000
ATCASCHD EQU   ATCCOM+20                                                02638000
ATCSRT   EQU   ATCCOM+16                                                02639000
ATCRDT   EQU   ATCCOM+12                                                02640000
ATCDCFRR EQU   ATCCOM+8                                                 02641000
ATCAPI   EQU   ATCCOM+4                                                 02642000
ATCRSV04 EQU   ATCSTAT4                                                 02643000
ATCNCSD  EQU   ATCSTAT4                                                 02644000
ATCMTST  EQU   ATCSTAT4                                                 02645000
ATCTPRT  EQU   ATCSTAT4                                                 02646000
ATCPRTAT EQU   ATCSTAT4                                                 02647000
@NM00070 EQU   ATCPOFLG                                                 02648000
ATCPOUNS EQU   ATCPOFLG                                                 02649000
ATCHSDMF EQU   ATCSTFLG                                                 02650000
@NM00069 EQU   ATCSTAT1                                                 02651000
ATCINHLT EQU   ATCSTAT1                                                 02652000
ATCNETSL EQU   ATCSTAT1                                                 02653000
ATCQKHLT EQU   ATCSTAT1                                                 02654000
ATCSNHLT EQU   ATCSTAT1                                                 02655000
ATCACTIV EQU   ATCSTAT1                                                 02656000
ATCSTART EQU   ATCSTAT1                                                 02657000
LOKXCL   EQU   @NM00067                                                 02658000
LOKPRY   EQU   @NM00067                                                 02659000
@NM00068 EQU   @NM00067                                                 02660000
@NM00066 EQU   LOKCHNG                                                  02661000
LOKCT    EQU   ISTLOK                                                   02662000
DYPRSV01 EQU   ISTDYPAB+12                                              02663000
DYPTSKID EQU   ISTDYPAB+8                                               02664000
DYPCHAIN EQU   ISTDYPAB+4                                               02665000
DYPFLGS  EQU   ISTDYPAB+2                                               02666000
DYPLNGTH EQU   ISTDYPAB+1                                               02667000
DYPTYPE  EQU   ISTDYPAB                                                 02668000
PABRPHA  EQU   PABRPHFG+1                                               02669000
PABNODQ  EQU   PABFLAGS                                                 02670000
PABINHBT EQU   PABFLAGS                                                 02671000
PABERLOK EQU   PABERRLK                                                 02672000
PABSSN   EQU   PABFLAGS                                                 02673000
PABDYNAM EQU   PABFLAGS                                                 02674000
PABNORPR EQU   PABFLAGS                                                 02675000
PABPRIOR EQU   PABFLAGS                                                 02676000
PABAPYP  EQU   PABFLAGS                                                 02677000
PABDVTA  EQU   ISTPAB+9                                                 02678000
PABOFFST EQU   ISTPAB+8                                                 02679000
PABCHNGP EQU   PABCHAIN+1                                               02680000
PABRSV02 EQU   PABCHAIN                                                 02681000
PABRUNNG EQU   PABCHAIN                                                 02682000
PABRESET EQU   PABCHAIN                                                 02683000
PABUNCON EQU   PABCHAIN                                                 02684000
PABCDP   EQU   PABCHAIN                                                 02685000
PABRESCH EQU   PABCHAIN                                                 02686000
PABCHNG  EQU   PABCHAIN                                                 02687000
PABWEQP  EQU   PABWEQA+1                                                02688000
PABRSV01 EQU   PABWEQA                                                  02689000
PABWEQG  EQU   PABWEQA                                                  02690000
CRACHAIN EQU   ISTCRA+928                                               02691000
CRARSV02 EQU   ISTCRA+924                                               02692000
CRARSV01 EQU   ISTCRA+920                                               02693000
CRABFTBA EQU   CRABUFA                                                  02694000
CRAMASK  EQU   CRASVC+64                                                02695000
CRAHSIZ  EQU   CRASVC+60                                                02696000
CRAASCRR EQU   CRASVC                                                   02697000
CRAPROCR EQU   ISTCRA+312                                               02698000
CRAPSS   EQU   ISTCRA+160                                               02699000
CRARPH   EQU   ISTCRA+52                                                02700000
CRALAPTR EQU   CRABASIC+48                                              02701000
CRAL9PTR EQU   CRABASIC+44                                              02702000
CRAL8PTR EQU   CRABASIC+40                                              02703000
CRAL7PTR EQU   CRABASIC+36                                              02704000
CRAL6PTR EQU   CRABASIC+32                                              02705000
CRAL5PTR EQU   CRABASIC+28                                              02706000
CRAL4PTR EQU   CRABASIC+24                                              02707000
CRAL3PTR EQU   CRABASIC+20                                              02708000
CRAL2PTR EQU   CRABASIC+16                                              02709000
CRAL1PTR EQU   CRABASIC+12                                              02710000
CRALEV01 EQU   CRALKACT+3                                               02711000
CRALEV02 EQU   CRALKACT+3                                               02712000
CRALEV03 EQU   CRALKACT+3                                               02713000
CRALEV04 EQU   CRALKACT+3                                               02714000
CRALEV05 EQU   CRALKACT+3                                               02715000
CRALEV06 EQU   CRALKACT+3                                               02716000
CRALEV07 EQU   CRALKACT+3                                               02717000
CRALEV08 EQU   CRALKACT+3                                               02718000
CRALEV09 EQU   CRALKACT+2                                               02719000
CRALEV10 EQU   CRALKACT+2                                               02720000
CRALEV11 EQU   CRALKACT+2                                               02721000
CRALEV12 EQU   CRALKACT+2                                               02722000
CRALEV13 EQU   CRALKACT+2                                               02723000
CRALEV14 EQU   CRALKACT+2                                               02724000
CRALEV15 EQU   CRALKACT+2                                               02725000
CRALEV16 EQU   CRALKACT+2                                               02726000
CRALEV17 EQU   CRALKACT+1                                               02727000
CRALEV18 EQU   CRALKACT+1                                               02728000
CRALEV19 EQU   CRALKACT+1                                               02729000
CRALEV20 EQU   CRALKACT+1                                               02730000
CRALEV21 EQU   CRALKACT+1                                               02731000
CRALEV22 EQU   CRALKACT+1                                               02732000
CRALEV23 EQU   CRALKACT+1                                               02733000
CRALEV24 EQU   CRALKACT+1                                               02734000
CRALEV25 EQU   CRALKACT                                                 02735000
CRALEV26 EQU   CRALKACT                                                 02736000
CRALEV27 EQU   CRALKACT                                                 02737000
CRALEV28 EQU   CRALKACT                                                 02738000
CRALEV29 EQU   CRALKACT                                                 02739000
CRALEV30 EQU   CRALKACT                                                 02740000
CRALEV31 EQU   CRALKACT                                                 02741000
CRALEV32 EQU   CRALKACT                                                 02742000
CRAFRR   EQU   CRAHDR+4                                                 02743000
CCFRSVD1 EQU   CFCCRT                                                   02744000
CCFCR2   EQU   CFCCRT                                                   02745000
CCFCRP   EQU   CFCCRT                                                   02746000
CCFCR1   EQU   CFCCRT                                                   02747000
CCFCS2   EQU   CFCCRT                                                   02748000
CCFCS1   EQU   CFCCRT                                                   02749000
NCFRSVD  EQU   CFCNTRD                                                  02750000
NCFCR2   EQU   CFCNTRD                                                  02751000
NCFCRP   EQU   CFCNTRD                                                  02752000
NCFCR1   EQU   CFCNTRD                                                  02753000
NCFCS2   EQU   CFCNTRD                                                  02754000
NCFCS1   EQU   CFCNTRD                                                  02755000
RIARSV03 EQU   RIAFLGS+2                                                02756000
RIARSV02 EQU   RIAFLG2                                                  02757000
RIABR15  EQU   RIAFLG2                                                  02758000
RIARSPCC EQU   RIAFLG2                                                  02759000
RIARTPXT EQU   RIAFLG2                                                  02760000
RIACONT  EQU   RIAFLG2                                                  02761000
RIAFABN  EQU   RIAFLG2                                                  02762000
RIARSV01 EQU   RIAFLG1                                                  02763000
RIACTIVE EQU   RIAFLG1                                                  02764000
RIACTL   EQU   RIAFLG1                                                  02765000
RIAABR15 EQU   RIAABRGS+60                                              02766000
RIAABR14 EQU   RIAABRGS+56                                              02767000
RIAABR13 EQU   RIAABRGS+52                                              02768000
RIAABR12 EQU   RIAABRGS+48                                              02769000
RIAABR11 EQU   RIAABRGS+44                                              02770000
RIAABR10 EQU   RIAABRGS+40                                              02771000
RIAABR09 EQU   RIAABRGS+36                                              02772000
RIAABR08 EQU   RIAABRGS+32                                              02773000
RIAABR07 EQU   RIAABRGS+28                                              02774000
RIAABR06 EQU   RIAABRGS+24                                              02775000
RIAABR05 EQU   RIAABRGS+20                                              02776000
RIAABR04 EQU   RIAABRGS+16                                              02777000
RIAABR03 EQU   RIAABRGS+12                                              02778000
RIAABR02 EQU   RIAABRGS+8                                               02779000
RIAABR01 EQU   RIAABRGS+4                                               02780000
RIAABR00 EQU   RIAABRGS                                                 02781000
RIARSV04 EQU   ISTRIA+14                                                02782000
RIAABPSW EQU   ISTRIA+4                                                 02783000
RIAABCD  EQU   ISTRIA                                                   02784000
ASCPSREG EQU   ISTASCRR+44                                              02785000
ASCUSR01 EQU   ASCUSRGS+12                                              02786000
ASCUSR00 EQU   ASCUSRGS+8                                               02787000
ASCUSR15 EQU   ASCUSRGS+4                                               02788000
ASCUSR14 EQU   ASCUSRGS                                                 02789000
ASCETRYA EQU   ISTASCRR+24                                              02790000
ASCKEY   EQU   ISTASCRR+23                                              02791000
ASCAUDIT EQU   ASCFLG3                                                  02792000
ASCFBDUD EQU   ASCFLG3                                                  02793000
ASCLLKF  EQU   ASCFLG3                                                  02794000
ASCKEYF  EQU   ASCFLG3                                                  02795000
ASCFBDAL EQU   ASCFLG3                                                  02796000
ASCFSRGT EQU   ASCFLG3                                                  02797000
ASCICR   EQU   ASCFLG2                                                  02798000
ASCFSRIC EQU   ASCFLG2                                                  02799000
ASCFBDIC EQU   ASCFLG2                                                  02800000
ASCFBAIC EQU   ASCFLG2                                                  02801000
ASCPASTR EQU   ASCFLG1                                                  02802000
ASCFSR   EQU   ASCFLG1                                                  02803000
ASCFBD   EQU   ASCFLG1                                                  02804000
ASCFBA   EQU   ASCFLG1                                                  02805000
ASCPFCRR EQU   ISTASCRR                                                 02806000
CRRRVPT5 EQU   CRRSAREA+316                                             02807000
CRRRVPT4 EQU   CRRSAREA+312                                             02808000
CRRRVPT3 EQU   CRRSAREA+308                                             02809000
CRRRVPT2 EQU   CRRSAREA+304                                             02810000
CRRRVPT1 EQU   CRRSAREA+300                                             02811000
CRRRVCR2 EQU   CRRSAREA+292                                             02812000
CRRRVCR1 EQU   CRRSAREA+291                                             02813000
CRRXFNCD EQU   CRRSAREA+290                                             02814000
CRRLDOCT EQU   CRRSAREA+288                                             02815000
CRRBTLEN EQU   CRRSAREA+284                                             02816000
CRRBLEN  EQU   CRRSAREA+282                                             02817000
CRRBRTCD EQU   CRRSAREA+281                                             02818000
@NM00065 EQU   CRRBFLGS                                                 02819000
CRRBFLG1 EQU   CRRBFLGS                                                 02820000
CRRBLDAD EQU   CRRSAREA+276                                             02821000
CRRBARAD EQU   CRRSAREA+272                                             02822000
CRRRTN12 EQU   CRRSAREA+268                                             02823000
CRRRTN11 EQU   CRRSAREA+264                                             02824000
CRRRTN10 EQU   CRRSAREA+260                                             02825000
CRRRTN9  EQU   CRRSAREA+256                                             02826000
CRRRTN8  EQU   CRRSAREA+252                                             02827000
CRRRTN7  EQU   CRRSAREA+248                                             02828000
CRRRTN6  EQU   CRRSAREA+244                                             02829000
CRRRTN5  EQU   CRRSAREA+240                                             02830000
CRRRTN4  EQU   CRRSAREA+236                                             02831000
CRRRTN3  EQU   CRRSAREA+232                                             02832000
CRRRTN2  EQU   CRRSAREA+228                                             02833000
CRRRTN1  EQU   CRRSAREA+224                                             02834000
CRRRES1  EQU   CRRSAREA+222                                             02835000
CRRLCNT  EQU   CRRSAREA+220                                             02836000
CRRATCVT EQU   CRRSAREA+216                                             02837000
CRRVALCK EQU   CRRSAREA+212                                             02838000
CRRARPL  EQU   CRRTRBUF+4                                               02839000
CRRBIND  EQU   CRRTRBUF+3                                               02840000
CRRTRRES EQU   CRRTRBUF                                                 02841000
CRRCLDO  EQU   CRRSAREA+200                                             02842000
CRRUECB  EQU   CRRSAREA+196                                             02843000
CRRLCPB  EQU   CRRSAREA+192                                             02844000
CRRCMDAD EQU   CRRSAREA+188                                             02845000
CRRFMCB  EQU   CRRSAREA+184                                             02846000
CRRCLCCW EQU   CRRSAREA+180                                             02847000
CRRESR2  EQU   CRRESR+1                                                 02848000
CRRESR1  EQU   CRRESR                                                   02849000
CRRDSB2  EQU   CRRDSB+1                                                 02850000
CRRDSB1  EQU   CRRDSB                                                   02851000
CRRDTACT EQU   CRRSAREA+174                                             02852000
CRRRSV99 EQU   CRRSAREA+173                                             02853000
CRRRDSOH EQU   CRRFDB3                                                  02854000
CRRRLG   EQU   CRRFDB3                                                  02855000
CRRLGFRC EQU   CRRFDB3                                                  02856000
CRRRDEOT EQU   CRRFDB3                                                  02857000
CRRRDEOM EQU   CRRFDB3                                                  02858000
CRRRDEOB EQU   CRRFDB3                                                  02859000
CRRUNUSD EQU   CRRFDB3                                                  02860000
CRRUINPT EQU   CRRFDB3                                                  02861000
CRRSTSAV EQU   CRRFDB2                                                  02862000
CRRCUERR EQU   CRRFDB2                                                  02863000
CRRDLGFL EQU   CRRFDB2                                                  02864000
CRRIOERR EQU   CRRFDB2                                                  02865000
CRRDVUNS EQU   CRRFDB2                                                  02866000
CRRATND  EQU   CRRFDB2                                                  02867000
CRRRVID  EQU   CRRFDB2                                                  02868000
CRRERLK  EQU   CRRFDB2                                                  02869000
CRRRTNCD EQU   CRRFDBK1                                                 02870000
CRRNSNA  EQU   CRRRTYPE                                                 02871000
CRRDFSYN EQU   CRRRTYPE                                                 02872000
CRRRESP  EQU   CRRRTYPE                                                 02873000
CRRDFASY EQU   CRRRTYPE                                                 02874000
CRRDBLCK EQU   CRRRFLG1                                                 02875000
CRRRPSBD EQU   CRRRFLG1                                                 02876000
CRRRPLOQ EQU   CRRRFLG1                                                 02877000
CRRRPLS  EQU   CRRRFLG1                                                 02878000
CRRSW7   EQU   CRRFLGS                                                  02879000
CRRSW6   EQU   CRRFLGS                                                  02880000
CRRSW5   EQU   CRRFLGS                                                  02881000
CRRSW4   EQU   CRRFLGS                                                  02882000
CRRSW3   EQU   CRRFLGS                                                  02883000
CRRSW2   EQU   CRRFLGS                                                  02884000
CRRSW1   EQU   CRRFLGS                                                  02885000
CRRSW0   EQU   CRRFLGS                                                  02886000
CRRRSV04 EQU   CRRFLGS4                                                 02887000
CRRDLCCW EQU   CRRFLGS3                                                 02888000
CRRRESET EQU   CRRFLGS3                                                 02889000
CRRSUBBK EQU   CRRFLGS3                                                 02890000
CRRRSV08 EQU   CRRFLGS3                                                 02891000
CRRDEBQ  EQU   CRRFLGS3                                                 02892000
CRRSTSPR EQU   CRRFLGS3                                                 02893000
CRRDREQ  EQU   CRRFLGS3                                                 02894000
CRRDFDBK EQU   CRRFLGS3                                                 02895000
CRRDFSB  EQU   CRRFLGS2                                                 02896000
CRRDPROC EQU   CRRFLGS2                                                 02897000
CRREXTS  EQU   CRRFLGS2                                                 02898000
CRRELSRI EQU   CRRFLGS2                                                 02899000
CRRPOST  EQU   CRRFLGS2                                                 02900000
CRRENDLW EQU   CRRFLGS2                                                 02901000
CRRPRGIP EQU   CRRFLGS2                                                 02902000
CRRDEXP  EQU   CRRFLGS2                                                 02903000
CRRSOLRQ EQU   CRRFLGS1                                                 02904000
CRRREQP  EQU   CRRFLGS1                                                 02905000
CRRCPROC EQU   CRRFLGS1                                                 02906000
CRRFINI  EQU   CRRFLGS1                                                 02907000
CRRPREIO EQU   CRRFLGS1                                                 02908000
CRRINIO  EQU   CRRFLGS1                                                 02909000
CRRFLDOS EQU   CRRFLGS1                                                 02910000
CRRDOCUR EQU   CRRFLGS1                                                 02911000
CRRRATS4 EQU   CRRATS+7                                                 02912000
@NM00064 EQU   CRRSATS                                                  02913000
CRRASC51 EQU   CRRSATS                                                  02914000
CRRASC40 EQU   CRRSATS                                                  02915000
CRRASC30 EQU   CRRSATS                                                  02916000
CRRASC21 EQU   CRRSATS                                                  02917000
CRRASC10 EQU   CRRSATS                                                  02918000
CRRASC01 EQU   CRRSATS                                                  02919000
@NM00063 EQU   CRRRATS2                                                 02920000
CRRPLIC  EQU   CRRRATS2                                                 02921000
CRRRC81  EQU   CRRRATS2                                                 02922000
CRRRC80  EQU   CRRRATS2                                                 02923000
CRRRC65  EQU   CRRRATS2                                                 02924000
CRRRC63  EQU   CRRRATS2                                                 02925000
CRRRC55  EQU   CRRRATS2                                                 02926000
CRRRC54  EQU   CRRRATS2                                                 02927000
CRRRC53  EQU   CRRRATS1                                                 02928000
CRRRC52  EQU   CRRRATS1                                                 02929000
CRRRC51  EQU   CRRRATS1                                                 02930000
CRRRC30  EQU   CRRRATS1                                                 02931000
CRRRC26  EQU   CRRRATS1                                                 02932000
CRRRC23  EQU   CRRRATS1                                                 02933000
CRRRC22  EQU   CRRRATS1                                                 02934000
CRRRC21  EQU   CRRRATS1                                                 02935000
@NM00062 EQU   CRRATS4                                                  02936000
CRRC3X   EQU   CRRATS4                                                  02937000
CRRC85   EQU   CRRATS4                                                  02938000
CRRC83   EQU   CRRATS4                                                  02939000
CRRC82   EQU   CRRATS4                                                  02940000
CRRC61   EQU   CRRATS4                                                  02941000
CRRC60   EQU   CRRATS4                                                  02942000
CRRC81   EQU   CRRATS3                                                  02943000
CRRC80   EQU   CRRATS3                                                  02944000
CRRC75   EQU   CRRATS3                                                  02945000
CRRC51   EQU   CRRATS3                                                  02946000
CRRC50   EQU   CRRATS3                                                  02947000
CRRC42   EQU   CRRATS3                                                  02948000
CRRC41   EQU   CRRATS3                                                  02949000
CRRC40   EQU   CRRATS3                                                  02950000
CRRC32   EQU   CRRATS2                                                  02951000
CRRC31   EQU   CRRATS2                                                  02952000
CRRC30   EQU   CRRATS2                                                  02953000
CRRC25   EQU   CRRATS2                                                  02954000
CRRC24   EQU   CRRATS2                                                  02955000
CRRC23   EQU   CRRATS2                                                  02956000
CRRC22   EQU   CRRATS2                                                  02957000
CRRC21   EQU   CRRATS2                                                  02958000
CRRC20   EQU   CRRATS1                                                  02959000
CRRC13   EQU   CRRATS1                                                  02960000
CRRC12   EQU   CRRATS1                                                  02961000
CRRC11   EQU   CRRATS1                                                  02962000
CRRC10   EQU   CRRATS1                                                  02963000
CRRC02   EQU   CRRATS1                                                  02964000
CRRC01   EQU   CRRATS1                                                  02965000
CRRC00   EQU   CRRATS1                                                  02966000
CRRRMAS4 EQU   CRRMAS+7                                                 02967000
@NM00061 EQU   CRRSMAS                                                  02968000
CRRMSC51 EQU   CRRSMAS                                                  02969000
CRRMSC40 EQU   CRRSMAS                                                  02970000
CRRMSC30 EQU   CRRSMAS                                                  02971000
CRRMSC21 EQU   CRRSMAS                                                  02972000
CRRMSC10 EQU   CRRSMAS                                                  02973000
CRRMSC01 EQU   CRRSMAS                                                  02974000
@NM00060 EQU   CRRRMAS2                                                 02975000
CRRRM81  EQU   CRRRMAS2                                                 02976000
CRRRM80  EQU   CRRRMAS2                                                 02977000
CRRRM65  EQU   CRRRMAS2                                                 02978000
CRRRM63  EQU   CRRRMAS2                                                 02979000
CRRRM55  EQU   CRRRMAS2                                                 02980000
CRRRM54  EQU   CRRRMAS2                                                 02981000
CRRRM53  EQU   CRRRMAS1                                                 02982000
CRRRM52  EQU   CRRRMAS1                                                 02983000
CRRRM51  EQU   CRRRMAS1                                                 02984000
CRRRM30  EQU   CRRRMAS1                                                 02985000
CRRRM26  EQU   CRRRMAS1                                                 02986000
CRRRM23  EQU   CRRRMAS1                                                 02987000
CRRRM22  EQU   CRRRMAS1                                                 02988000
CRRRM21  EQU   CRRRMAS1                                                 02989000
@NM00059 EQU   CRRMAS4                                                  02990000
CRRM3X   EQU   CRRMAS4                                                  02991000
CRRM85   EQU   CRRMAS4                                                  02992000
CRRM83   EQU   CRRMAS4                                                  02993000
CRRM82   EQU   CRRMAS4                                                  02994000
CRRM61   EQU   CRRMAS4                                                  02995000
CRRM60   EQU   CRRMAS4                                                  02996000
CRRM81   EQU   CRRMAS3                                                  02997000
CRRM80   EQU   CRRMAS3                                                  02998000
CRRM75   EQU   CRRMAS3                                                  02999000
CRRM51   EQU   CRRMAS3                                                  03000000
CRRM50   EQU   CRRMAS3                                                  03001000
CRRM42   EQU   CRRMAS3                                                  03002000
CRRM41   EQU   CRRMAS3                                                  03003000
CRRM40   EQU   CRRMAS3                                                  03004000
CRRM32   EQU   CRRMAS2                                                  03005000
CRRM31   EQU   CRRMAS2                                                  03006000
CRRM30   EQU   CRRMAS2                                                  03007000
CRRM25   EQU   CRRMAS2                                                  03008000
CRRM24   EQU   CRRMAS2                                                  03009000
CRRM23   EQU   CRRMAS2                                                  03010000
CRRM22   EQU   CRRMAS2                                                  03011000
CRRM21   EQU   CRRMAS2                                                  03012000
CRRM20   EQU   CRRMAS1                                                  03013000
CRRM13   EQU   CRRMAS1                                                  03014000
CRRM12   EQU   CRRMAS1                                                  03015000
CRRM11   EQU   CRRMAS1                                                  03016000
CRRM10   EQU   CRRMAS1                                                  03017000
CRRM02   EQU   CRRMAS1                                                  03018000
CRRM01   EQU   CRRMAS1                                                  03019000
CRRM00   EQU   CRRMAS1                                                  03020000
CRRFSB   EQU   CRRSAREA+144                                             03021000
CRRSAVE1 EQU   CRRSAREA+72                                              03022000
CRRSAVE  EQU   CRRSAREA                                                 03023000
CRRRSV22 EQU   ISTDCCRR+4                                               03024000
CRRCRR   EQU   ISTDCCRR                                                 03025000
@NM00058 EQU   ISTAPCRR+137                                             03026000
@NM00057 EQU   APC57FLG                                                 03027000
APCNREL  EQU   APC57FLG                                                 03028000
APCRECRA EQU   APC57FLG                                                 03029000
@NM00056 EQU   APC54FLG                                                 03030000
APCRLST  EQU   APC54FLG                                                 03031000
APCPR153 EQU   APC53FLG                                                 03032000
@NM00055 EQU   APC52FLG                                                 03033000
APCWKF   EQU   APC52FLG                                                 03034000
APCNWF   EQU   APC52FLG                                                 03035000
APCRDQ   EQU   APC52FLG                                                 03036000
APCQENQ  EQU   APC52FLG                                                 03037000
APCSMSR  EQU   APC52FLG                                                 03038000
APCCKRQ  EQU   APC52FLG                                                 03039000
@NM00054 EQU   APC31FLG                                                 03040000
APCSORT  EQU   APC31FLG                                                 03041000
APCRESCH EQU   APC31FLG                                                 03042000
APCTPXIT EQU   APC31FLG                                                 03043000
APCSWTWD EQU   ISTAPCRR+128                                             03044000
APCSAV2  EQU   ISTAPCRR+124                                             03045000
APCSAV1  EQU   ISTAPCRR+120                                             03046000
APCRETCD EQU   APCCOMF+2                                                03047000
@NM00053 EQU   APCCOMF1+1                                               03048000
APCZLBER EQU   APCCOMF1                                                 03049000
APCEXIT  EQU   APCCOMF1                                                 03050000
APCRELR  EQU   APCCOMF1                                                 03051000
APCIRB2  EQU   APCCOMF1                                                 03052000
APCIRB1  EQU   APCCOMF1                                                 03053000
APCSMCR  EQU   APCCOMF1                                                 03054000
APCUETSK EQU   APCCOMF1                                                 03055000
APCSSTSK EQU   APCCOMF1                                                 03056000
APCESTAL EQU   APCSAVE                                                  03057000
APCFRRPM EQU   ISTAPCRR+40                                              03058000
APCQWFO  EQU   ISTAPCRR+36                                              03059000
APCPABSV EQU   ISTAPCRR+32                                              03060000
APCRTRN  EQU   ISTAPCRR+28                                              03061000
APCTCBA  EQU   ISTAPCRR+24                                              03062000
APCPSTA  EQU   ISTAPCRR+20                                              03063000
@NM00052 EQU   APCRFLG+1                                                03064000
APC31R   EQU   APCRFLG                                                  03065000
APC58R   EQU   APCRFLG                                                  03066000
APC57R   EQU   APCRFLG                                                  03067000
APC56R   EQU   APCRFLG                                                  03068000
APC54R   EQU   APCRFLG                                                  03069000
APC53R   EQU   APCRFLG                                                  03070000
APC52R   EQU   APCRFLG                                                  03071000
APC51R   EQU   APCRFLG                                                  03072000
@NM00051 EQU   APCATFLG+1                                               03073000
APC31E   EQU   APCATFLG                                                 03074000
APC58E   EQU   APCATFLG                                                 03075000
APC57E   EQU   APCATFLG                                                 03076000
APC56E   EQU   APCATFLG                                                 03077000
APC54E   EQU   APCATFLG                                                 03078000
APC53E   EQU   APCATFLG                                                 03079000
APC52E   EQU   APCATFLG                                                 03080000
APC51E   EQU   APCATFLG                                                 03081000
APCHDRSV EQU   ISTAPCRR                                                 03082000
PFCRSV01 EQU   ISTPFCRR+13                                              03083000
PFCFTA   EQU   ISTPFCRR+12                                              03084000
CRRFRR   EQU   PFCFRRO                                                  03085000
CRRCHAIN EQU   PFCCRRO                                                  03086000
CRRLEN   EQU   PFCCRRLN                                                 03087000
PFCRSV10 EQU   PFCCRR+1                                                 03088000
CRRID    EQU   PFCCRRID                                                 03089000
ZCRRU    EQU   ZCRRHRU+3                                                03090000
ZCRRH    EQU   ZCRRHRU                                                  03091000
ZCRWORDA EQU   ISTZCRR+477                                              03092000
ZCRCMNRC EQU   ISTZCRR+476                                              03093000
ZCRRSV97 EQU   ZCRENTER+18                                              03094000
ZCREIC2B EQU   ZCRENTER+18                                              03095000
ZCREAC2B EQU   ZCRENTER+18                                              03096000
ZCRELCAB EQU   ZCRENTER+18                                              03097000
ZCREDCMF EQU   ZCRENTER+18                                              03098000
ZCREBCIF EQU   ZCRENTER+18                                              03099000
ZCREICSG EQU   ZCRENTER+18                                              03100000
ZCREDCK0 EQU   ZCRENTER+18                                              03101000
ZCRECFY0 EQU   ZCRENTER+17                                              03102000
ZCREKCCB EQU   ZCRENTER+17                                              03103000
ZCREDCNB EQU   ZCRENTER+17                                              03104000
ZCREICOE EQU   ZCRENTER+17                                              03105000
ZCREBCNB EQU   ZCRENTER+17                                              03106000
ZCREBC0L EQU   ZCRENTER+17                                              03107000
ZCREBCAL EQU   ZCRENTER+17                                              03108000
ZCREDCQR EQU   ZCRENTER+17                                              03109000
ZCREDCPR EQU   ZCRENTER+16                                              03110000
ZCREBCSB EQU   ZCRENTER+16                                              03111000
ZCREAC1R EQU   ZCRENTER+16                                              03112000
ZCRECCCI EQU   ZCRENTER+16                                              03113000
ZCRECCAI EQU   ZCRENTER+16                                              03114000
ZCRECCBI EQU   ZCRENTER+16                                              03115000
ZCREBCAR EQU   ZCRENTER+16                                              03116000
ZCREBCDR EQU   ZCRENTER+16                                              03117000
ZCREBCBR EQU   ZCRENTER+15                                              03118000
ZCREDCXR EQU   ZCRENTER+15                                              03119000
ZCREDCWB EQU   ZCRENTER+15                                              03120000
ZCREDCWR EQU   ZCRENTER+15                                              03121000
ZCREKCCN EQU   ZCRENTER+15                                              03122000
ZCREKCBN EQU   ZCRENTER+15                                              03123000
ZCREKCBB EQU   ZCRENTER+15                                              03124000
ZCREJC0B EQU   ZCRENTER+15                                              03125000
ZCREJCDB EQU   ZCRENTER+14                                              03126000
ZCREJCCB EQU   ZCRENTER+14                                              03127000
ZCREJCBB EQU   ZCRENTER+14                                              03128000
ZCREJCAB EQU   ZCRENTER+14                                              03129000
ZCREIC1B EQU   ZCRENTER+14                                              03130000
ZCREIC0B EQU   ZCRENTER+14                                              03131000
ZCREICX0 EQU   ZCRENTER+14                                              03132000
ZCREICWB EQU   ZCRENTER+14                                              03133000
ZCREICVB EQU   ZCRENTER+13                                              03134000
ZCREICUB EQU   ZCRENTER+13                                              03135000
ZCREICTB EQU   ZCRENTER+13                                              03136000
ZCREICSC EQU   ZCRENTER+13                                              03137000
ZCREICSB EQU   ZCRENTER+13                                              03138000
ZCREICRB EQU   ZCRENTER+13                                              03139000
ZCREICQB EQU   ZCRENTER+13                                              03140000
ZCREICQA EQU   ZCRENTER+13                                              03141000
ZCREICOB EQU   ZCRENTER+12                                              03142000
ZCREICOA EQU   ZCRENTER+12                                              03143000
ZCREICNB EQU   ZCRENTER+12                                              03144000
ZCREICNA EQU   ZCRENTER+12                                              03145000
ZCREICMB EQU   ZCRENTER+12                                              03146000
ZCREICLB EQU   ZCRENTER+12                                              03147000
ZCREICKG EQU   ZCRENTER+12                                              03148000
ZCREICKE EQU   ZCRENTER+12                                              03149000
ZCREICKB EQU   ZCRENTER+11                                              03150000
ZCREICJB EQU   ZCRENTER+11                                              03151000
ZCREICID EQU   ZCRENTER+11                                              03152000
ZCREICIB EQU   ZCRENTER+11                                              03153000
ZCREICHB EQU   ZCRENTER+11                                              03154000
ZCREICGB EQU   ZCRENTER+11                                              03155000
ZCREICEB EQU   ZCRENTER+11                                              03156000
ZCREICDB EQU   ZCRENTER+11                                              03157000
ZCREICCI EQU   ZCRENTER+10                                              03158000
ZCREICCB EQU   ZCRENTER+10                                              03159000
ZCREICBI EQU   ZCRENTER+10                                              03160000
ZCREICBB EQU   ZCRENTER+10                                              03161000
ZCREICAB EQU   ZCRENTER+10                                              03162000
ZCREICAA EQU   ZCRENTER+10                                              03163000
ZCREHCAN EQU   ZCRENTER+10                                              03164000
ZCREGC0B EQU   ZCRENTER+10                                              03165000
ZCREGC0A EQU   ZCRENTER+9                                               03166000
ZCREGCLA EQU   ZCRENTER+9                                               03167000
ZCREGCEB EQU   ZCRENTER+9                                               03168000
ZCREGCDB EQU   ZCRENTER+9                                               03169000
@NM00050 EQU   ZCRENTER+9                                               03170000
ZCREGCBB EQU   ZCRENTER+9                                               03171000
ZCREGCAB EQU   ZCRENTER+9                                               03172000
ZCREFCEB EQU   ZCRENTER+9                                               03173000
ZCREECTA EQU   ZCRENTER+8                                               03174000
ZCREECEA EQU   ZCRENTER+8                                               03175000
ZCREECDA EQU   ZCRENTER+8                                               03176000
ZCREECCB EQU   ZCRENTER+8                                               03177000
ZCREECCA EQU   ZCRENTER+8                                               03178000
ZCREECBB EQU   ZCRENTER+8                                               03179000
ZCREECBA EQU   ZCRENTER+8                                               03180000
ZCREDCMB EQU   ZCRENTER+7                                               03181000
ZCREDCL0 EQU   ZCRENTER+7                                               03182000
ZCREDCKB EQU   ZCRENTER+7                                               03183000
ZCREDCKA EQU   ZCRENTER+7                                               03184000
ZCREDCJ0 EQU   ZCRENTER+7                                               03185000
ZCREDCI0 EQU   ZCRENTER+7                                               03186000
ZCREDCH0 EQU   ZCRENTER+7                                               03187000
ZCREDCF0 EQU   ZCRENTER+7                                               03188000
ZCREDCE0 EQU   ZCRENTER+6                                               03189000
ZCREDCD0 EQU   ZCRENTER+6                                               03190000
ZCREDCC0 EQU   ZCRENTER+6                                               03191000
ZCREDCB0 EQU   ZCRENTER+6                                               03192000
ZCREDCA0 EQU   ZCRENTER+6                                               03193000
ZCRECC2B EQU   ZCRENTER+6                                               03194000
ZCRECC1B EQU   ZCRENTER+6                                               03195000
ZCRECC1A EQU   ZCRENTER+6                                               03196000
ZCRECC0B EQU   ZCRENTER+5                                               03197000
ZCRECC0A EQU   ZCRENTER+5                                               03198000
ZCREBC0B EQU   ZCRENTER+5                                               03199000
ZCREBC0A EQU   ZCRENTER+5                                               03200000
ZCREBCZ0 EQU   ZCRENTER+5                                               03201000
ZCREBCY0 EQU   ZCRENTER+5                                               03202000
ZCREBCX0 EQU   ZCRENTER+5                                               03203000
ZCREBCXA EQU   ZCRENTER+5                                               03204000
ZCREBCSC EQU   ZCRENTER+4                                               03205000
ZCREBCRB EQU   ZCRENTER+4                                               03206000
ZCREBCRA EQU   ZCRENTER+4                                               03207000
ZCREBCQB EQU   ZCRENTER+4                                               03208000
ZCREBCPB EQU   ZCRENTER+4                                               03209000
ZCREBCOB EQU   ZCRENTER+4                                               03210000
ZCREBCNE EQU   ZCRENTER+4                                               03211000
ZCREBCND EQU   ZCRENTER+4                                               03212000
ZCREBCMB EQU   ZCRENTER+3                                               03213000
ZCREBCLB EQU   ZCRENTER+3                                               03214000
ZCREBCLA EQU   ZCRENTER+3                                               03215000
ZCREBCKB EQU   ZCRENTER+3                                               03216000
ZCREBCKA EQU   ZCRENTER+3                                               03217000
ZCREBCJB EQU   ZCRENTER+3                                               03218000
ZCREBCJA EQU   ZCRENTER+3                                               03219000
ZCREBCID EQU   ZCRENTER+3                                               03220000
ZCREBCIB EQU   ZCRENTER+2                                               03221000
ZCREBCIA EQU   ZCRENTER+2                                               03222000
ZCREBCHB EQU   ZCRENTER+2                                               03223000
ZCREBCHA EQU   ZCRENTER+2                                               03224000
ZCREBCGB EQU   ZCRENTER+2                                               03225000
ZCREBCGA EQU   ZCRENTER+2                                               03226000
ZCREBCFB EQU   ZCRENTER+2                                               03227000
ZCREBCFA EQU   ZCRENTER+2                                               03228000
ZCREBCEB EQU   ZCRENTER+1                                               03229000
ZCREBCDI EQU   ZCRENTER+1                                               03230000
ZCREBCCB EQU   ZCRENTER+1                                               03231000
ZCREBCBI EQU   ZCRENTER+1                                               03232000
ZCREBCBB EQU   ZCRENTER+1                                               03233000
ZCREBCBA EQU   ZCRENTER+1                                               03234000
ZCREBCAM EQU   ZCRENTER+1                                               03235000
ZCREBCAI EQU   ZCRENTER+1                                               03236000
ZCREBCAG EQU   ZCRENTER                                                 03237000
ZCREBCAE EQU   ZCRENTER                                                 03238000
ZCREBCAB EQU   ZCRENTER                                                 03239000
ZCREBCAA EQU   ZCRENTER                                                 03240000
ZCREAC1B EQU   ZCRENTER                                                 03241000
ZCREAC0B EQU   ZCRENTER                                                 03242000
ZCREAC0A EQU   ZCRENTER                                                 03243000
ZCREAC1A EQU   ZCRENTER                                                 03244000
ZCRTNAME EQU   ZCRAUDIT+1                                               03245000
ZCRTID   EQU   ZCRAUDIT                                                 03246000
ZCRREMIC EQU   ISTZCRR+436                                              03247000
ZCRSAVEZ EQU   ISTZCRR+196                                              03248000
ZCRDAFSV EQU   ZCRCIDSV+2                                               03249000
ZCRSAFSV EQU   ZCRCIDSV                                                 03250000
ZCRR13SV EQU   ISTZCRR+188                                              03251000
ZCRR2SV  EQU   ISTZCRR+184                                              03252000
ZCROPCDE EQU   ISTZCRR+183                                              03253000
ZCRPRMTC EQU   ISTZCRR+182                                              03254000
ZCRRCDSV EQU   ISTZCRR+181                                              03255000
ZCRAWQSW EQU   ISTZCRR+180                                              03256000
ZCRTOPQ  EQU   ISTZCRR+180                                              03257000
ZCRLSTFB EQU   ISTZCRR+180                                              03258000
ZCRXSCHD EQU   ISTZCRR+180                                              03259000
ZCRNXTEL EQU   ISTZCRR+180                                              03260000
ZCRSCANQ EQU   ISTZCRR+180                                              03261000
ZCRMOREL EQU   ISTZCRR+180                                              03262000
ZCRFBPRC EQU   ISTZCRR+180                                              03263000
ZCRFSBSV EQU   ISTZCRR+176                                              03264000
ZCRSVWK5 EQU   ZCRWKARA+16                                              03265000
ZCRSVWK4 EQU   ZCRWKARA+12                                              03266000
ZCRSVWK3 EQU   ZCRWKARA+8                                               03267000
ZCRSVWK2 EQU   ZCRWKARA+4                                               03268000
ZCRSVWK1 EQU   ZCRWKARA                                                 03269000
ZCRSVF25 EQU   ZCRSVRTN+96                                              03270000
ZCRSVF24 EQU   ZCRSVRTN+92                                              03271000
ZCRSVF23 EQU   ZCRSVRTN+88                                              03272000
ZCRSVF22 EQU   ZCRSVRTN+84                                              03273000
ZCRSVF21 EQU   ZCRSVRTN+80                                              03274000
ZCRSVF20 EQU   ZCRSVRTN+76                                              03275000
ZCRSVF19 EQU   ZCRSVRTN+72                                              03276000
ZCRSVF18 EQU   ZCRSVRTN+68                                              03277000
ZCRSVF17 EQU   ZCRSVRTN+64                                              03278000
ZCRSVF16 EQU   ZCRSVRTN+60                                              03279000
ZCRSVF15 EQU   ZCRSVRTN+56                                              03280000
ZCRSVF14 EQU   ZCRSVRTN+52                                              03281000
ZCRSVF13 EQU   ZCRSVRTN+48                                              03282000
ZCRSVF12 EQU   ZCRSVRTN+44                                              03283000
ZCRSVF11 EQU   ZCRSVRTN+40                                              03284000
ZCRSVF10 EQU   ZCRSVRTN+36                                              03285000
ZCRSVF9  EQU   ZCRSVRTN+32                                              03286000
ZCRSVF8  EQU   ZCRSVRTN+28                                              03287000
ZCRSVF7  EQU   ZCRSVRTN+24                                              03288000
ZCRSVF6  EQU   ZCRSVRTN+20                                              03289000
ZCRSVF5  EQU   ZCRSVRTN+16                                              03290000
ZCRSVF4  EQU   ZCRSVRTN+12                                              03291000
ZCRSVF3  EQU   ZCRSVRTN+8                                               03292000
ZCRSVF2  EQU   ZCRSVRTN+4                                               03293000
ZCRSVF1  EQU   ZCRSVRTN                                                 03294000
ZCRPVZB  EQU   ISTZCRR+52                                               03295000
ZCRZLB   EQU   ISTZCRR+48                                               03296000
ZCRBFPTR EQU   ISTZCRR+44                                               03297000
ZCRCCWA  EQU   ISTZCRR+40                                               03298000
ZCRPSW   EQU   ZCRPARMS+15                                              03299000
ZCRPCHAR EQU   ZCRPARMS+14                                              03300000
ZCRPRES2 EQU   ZCRPCOD2                                                 03301000
ZCRPMFGF EQU   ZCRPCOD2                                                 03302000
ZCRPFHDR EQU   ZCRPCOD2                                                 03303000
ZCRPPG2  EQU   ZCRPCOD2                                                 03304000
ZCRPRES  EQU   ZCRPCOD1                                                 03305000
ZCRPCFTX EQU   ZCRPCOD1                                                 03306000
ZCRPLSCB EQU   ZCRPCOD1                                                 03307000
ZCRPLSBQ EQU   ZCRPLSBF                                                 03308000
ZCRPFSB  EQU   ZCRPCOD1                                                 03309000
ZCRDTODA EQU   ZCRDFRDA                                                 03310000
ZCRMLNG  EQU   ZCRPARMS+8                                               03311000
ZCRTBPTR EQU   ZCRPARMS+4                                               03312000
ZCRCBPTR EQU   ZCRFBPTR                                                 03313000
ZCRCRLCP EQU   ISTZCRR+20                                               03314000
@NM00049 EQU   ZCRSCPSW                                                 03315000
ZCRSKIPT EQU   ZCRSCPSW                                                 03316000
ZCRFSBWE EQU   ZCRSCPSW                                                 03317000
ZCRPRCMP EQU   ZCRSCPSW                                                 03318000
ZCRLREQ  EQU   ZCRSCPSW                                                 03319000
ZCRRJLCP EQU   ZCRSCPSW                                                 03320000
ZCRTPINV EQU   ZCRSCPSW                                                 03321000
ZCRTPEX  EQU   ZCRSCPSW                                                 03322000
@NM00048 EQU   ZCRIBPR                                                  03323000
ZCR3270R EQU   ZCRIBPR                                                  03324000
ZCR3270  EQU   ZCRIBPR                                                  03325000
ZCRLCPFD EQU   ZCRIBPR                                                  03326000
ZCRLCPFR EQU   ZCRIBPR                                                  03327000
ZCRRELK  EQU   ZCRIBPR                                                  03328000
ZCRERR   EQU   ZCRIBPR                                                  03329000
ZCRNOBUF EQU   ZCRIBPR                                                  03330000
@NM00047 EQU   ZCRPFLGS                                                 03331000
ZCRQAHED EQU   ZCRPFLGS                                                 03332000
ZCRF1RES EQU   ZCRGENSW                                                 03333000
ZCRBRIS  EQU   ZCRGENSW                                                 03334000
ZCRCLRBD EQU   ZCRGENSW                                                 03335000
ZCREXRES EQU   ZCRGENSW                                                 03336000
ZCRLCSYN EQU   ZCRGENSW                                                 03337000
ZCRRT06  EQU   ZCRGENSW                                                 03338000
ZCRTSW2  EQU   ZCRGENSW                                                 03339000
ZCRTSW1  EQU   ZCRGENSW                                                 03340000
ZCRINLCP EQU   ZCRFLGS3                                                 03341000
ZCRWRPTR EQU   ZCRFLGS3                                                 03342000
ZCRNOFRE EQU   ZCRFLGS3                                                 03343000
ZCREDRIV EQU   ZCRFLGS3                                                 03344000
ZCRDISC  EQU   ZCRFLGS3                                                 03345000
ZCRTPDIS EQU   ZCRFLGS3                                                 03346000
ZCRTPCON EQU   ZCRFLGS3                                                 03347000
ZCRTIC   EQU   ZCRFLGS3                                                 03348000
ZCRCNLXL EQU   ZCRRESET                                                 03349000
ZCRENDAN EQU   ZCRSWFLD                                                 03350000
ZCRENDXL EQU   ZCRSWFLD                                                 03351000
ZCRENDX  EQU   ZCRSWFLD                                                 03352000
ZCROB1   EQU   ZCRNDLCP                                                 03353000
ZCRENDPR EQU   ZCRSWFLD                                                 03354000
ZCREXTYP EQU   ZCRSWFLD                                                 03355000
ZCRSLCP  EQU   ZCRENDSH                                                 03356000
ZCRIF0E3 EQU   ZCRFLGS2                                                 03357000
ZCRIF0E2 EQU   ZCRFLGS2                                                 03358000
ZCRIF0E1 EQU   ZCRFLGS2                                                 03359000
ZCROB    EQU   ZCRFLGS2                                                 03360000
ZCRFMSED EQU   ZCRFLGS2                                                 03361000
ZCRSHEDI EQU   ZCRFLGS2                                                 03362000
ZCRLOCAL EQU   ZCRFLGS2                                                 03363000
ZCRFEXIT EQU   ZCRFLGS1                                                 03364000
ZCRUNSOL EQU   ZCRFLGS1                                                 03365000
ZCRENDLP EQU   ZCRFLGS1                                                 03366000
ZCRNRMEX EQU   ZCRFLGS1                                                 03367000
ZCRWAIT  EQU   ZCRFLGS1                                                 03368000
ZCRDEQSW EQU   ZCRFLGS1                                                 03369000
ZCRQUESW EQU   ZCRFLGS1                                                 03370000
ZCREXSW  EQU   ZCRFLGS1                                                 03371000
ZCRFRRA  EQU   ISTZCRR+8                                                03372000
ZCRCHAIN EQU   ISTZCRR+4                                                03373000
ZCRFLAG  EQU   ZCRCRR+3                                                 03374000
ZCRLEN   EQU   ZCRCRR+1                                                 03375000
ZCRID    EQU   ZCRCRR                                                   03376000
LCPFTYPE EQU   LCPRPHA                                                  03377000
LCPRSTQH EQU   LCPLCCW                                                  03378000
LCPCLREP EQU   ISTLCPB+44                                               03379000
LCPUBFSB EQU   LCPFLCCW                                                 03380000
LCPRSV77 EQU   ISTLCPB+39                                               03381000
LCPLCCWC EQU   ISTLCPB+38                                               03382000
LCPRSV78 EQU   LCPFLG1                                                  03383000
LCPTRANS EQU   LCPFLG1                                                  03384000
LCPSTLB  EQU   LCPFLG1                                                  03385000
LCPREDRV EQU   LCPFLG1                                                  03386000
LCPDIRPT EQU   LCPFLG1                                                  03387000
LCPINTER EQU   LCPFLG1                                                  03388000
LCPRESET EQU   LCPFLG1                                                  03389000
LCPSTYPE EQU   ISTLCPB+36                                               03390000
LCPFSNCH EQU   ISTLCPB+34                                               03391000
LCPFOSN  EQU   ISTLCPB+32                                               03392000
LCPTLBAD EQU   ISTLCPB+28                                               03393000
LCPFDB2  EQU   LCPFDBA+1                                                03394000
LCPFDB1  EQU   LCPFDBA                                                  03395000
LCPNXLCW EQU   ISTLCPB+20                                               03396000
LCPDAF   EQU   LCPCID+2                                                 03397000
LCPSAF   EQU   LCPCID                                                   03398000
LCPLCCW1 EQU   ISTLCPB+12                                               03399000
LCPRRCNT EQU   LCPSEQ+1                                                 03400000
LCPRRCCT EQU   LCPSEQ                                                   03401000
LCPATOP  EQU   LCPFLAG2                                                 03402000
LCPFREE  EQU   LCPFLAG2                                                 03403000
LCPDSTAT EQU   LCPFLAG2                                                 03404000
LCPEXRES EQU   LCPFID0                                                  03405000
LCPZRIMM EQU   LCPTLBPI                                                 03406000
LCPRSTRT EQU   LCPFLAG2                                                 03407000
LCPASYN  EQU   LCPFLAG2                                                 03408000
LCPPRFLG EQU   LCPFLAG2                                                 03409000
LCPZMIRC EQU   LCPRUCNT                                                 03410000
LCPCHAI2 EQU   LCPCHAIN+1                                               03411000
LCPCHNG  EQU   LCPCHAI1                                                 03412000
LCPZRT0B EQU   LCPMNRCD                                                 03413000
LCPZRT0A EQU   LCPMNRCD                                                 03414000
LCPZRTL9 EQU   LCPZRT09                                                 03415000
LCPZRTL8 EQU   LCPZRT08                                                 03416000
LCPZRTL7 EQU   LCPZRT07                                                 03417000
LCPZRTL6 EQU   LCPZRT06                                                 03418000
LCPZRTL5 EQU   LCPZRT05                                                 03419000
LCPZRTL4 EQU   LCPZRT04                                                 03420000
LCPZRTL3 EQU   LCPZRT03                                                 03421000
LCPZRTL2 EQU   LCPZRT02                                                 03422000
LCPZRT01 EQU   LCPFLAGS                                                 03423000
LCPZRT00 EQU   LCPFLAGS                                                 03424000
LCPLNGTH EQU   ISTLCPB+1                                                03425000
LCPTYPE  EQU   ISTLCPB                                                  03426000
LCCWDATA EQU   ISTLCCW+4                                                03427000
LCCWCNT  EQU   ISTLCCW+2                                                03428000
LCCWACI  EQU   LCCWFLAG                                                 03429000
LCCWRFI  EQU   LCCWFLAG                                                 03430000
LCCWPER  EQU   LCCWLSI                                                  03431000
LCCWIDAT EQU   LCCWFLAG                                                 03432000
LCCWNTVC EQU   LCCWFLAG                                                 03433000
LCCWCKPT EQU   LCCWFLAG                                                 03434000
LCCWCC   EQU   LCCWFLAG                                                 03435000
LCCWCD   EQU   LCCWFLAG                                                 03436000
LCCWTYPE EQU   LCCWCTL                                                  03437000
LCCWMODE EQU   LCCWCTL                                                  03438000
LCCWSOP  EQU   LCCWRWOP                                                 03439000
@NM00046 EQU   LCCWRWOP                                                 03440000
LCCWSD   EQU   LCCWOP                                                   03441000
LCCWSI   EQU   LCCWOP                                                   03442000
RPHNEXPO EQU   ISTRPH+104                                               03443000
RPHSAV16 EQU   RPHWORK+60                                               03444000
RPHSAV15 EQU   RPHWORK+56                                               03445000
RPHSAV14 EQU   RPHWORK+52                                               03446000
RPHSAV13 EQU   RPHWORK+48                                               03447000
RPHSAV12 EQU   RPHWORK+44                                               03448000
RPHSAV11 EQU   RPHWORK+40                                               03449000
RPHSAV10 EQU   RPHWORK+36                                               03450000
RPHSAVE9 EQU   RPHWORK+32                                               03451000
RPHSAVE8 EQU   RPHWORK+28                                               03452000
RPHSAVE7 EQU   RPHWORK+24                                               03453000
RPHSAVE6 EQU   RPHWORK+20                                               03454000
RPHSAVE5 EQU   RPHWORK+16                                               03455000
RPHSAVE4 EQU   RPHWORK+12                                               03456000
RPHSAVE3 EQU   RPHWORK+8                                                03457000
RPHSAVE2 EQU   RPHWORK+4                                                03458000
RPHSHALF EQU   RPHSAVE1+2                                               03459000
RPHSBIT8 EQU   RPHSBITS                                                 03460000
RPHSBIT7 EQU   RPHSBITS                                                 03461000
RPHSBIT6 EQU   RPHSBITS                                                 03462000
RPHSBIT5 EQU   RPHSBITS                                                 03463000
RPHSBIT4 EQU   RPHSBITS                                                 03464000
RPHSBIT3 EQU   RPHSBITS                                                 03465000
RPHSBIT2 EQU   RPHSBITS                                                 03466000
RPHSBIT1 EQU   RPHSBITS                                                 03467000
RPHSBYTE EQU   RPHSAVE1                                                 03468000
RPHPABQP EQU   RPHPABQA+1                                               03469000
RPHPABFG EQU   RPHPABQA                                                 03470000
RPHSRP34 EQU   RPHSRPRM+2                                               03471000
RPHSRP12 EQU   RPHSRPRM                                                 03472000
RPHWEGT  EQU   RPHCSPA                                                  03473000
RPHMAJCB EQU   ISTRPH+21                                                03474000
RPHPABOF EQU   ISTRPH+20                                                03475000
RPHRESUM EQU   RPHRESMA+1                                               03476000
RPHRSV01 EQU   RPHWPFLG                                                 03477000
RPHPURGE EQU   RPHWPFLG                                                 03478000
RPHPT    EQU   RPHWPFLG                                                 03479000
RPHWT    EQU   RPHWPFLG                                                 03480000
RPHRSKEY EQU   RPHWPFLG                                                 03481000
RPHDVTA  EQU   ISTRPH+12                                                03482000
RPHTIK   EQU   RPHTSKID+3                                               03483000
@NM00045 EQU   RPHTSKID                                                 03484000
RPHRPHAP EQU   RPHRPHA+1                                                03485000
@NM00044 EQU   RPHRPHA                                                  03486000
RPHGATE  EQU   RPHRPHA                                                  03487000
@NM00043 EQU   RPHFLGB                                                  03488000
RPHRLCRA EQU   RPHFLGB                                                  03489000
RPHNRSAV EQU   RPHFLGB                                                  03490000
RPHPGCMP EQU   RPHFLGB                                                  03491000
RPHFBAPS EQU   RPHFLGB                                                  03492000
RPHBSSP  EQU   RPHFLGB                                                  03493000
RPHLOCK  EQU   RPHFLGB                                                  03494000
RPHFNFLG EQU   RPHFSTLC                                                 03495000
RPHMLTCP EQU   RPHFLAGS                                                 03496000
RPHSMCLR EQU   RPHFLAGS                                                 03497000
RPHSMTYP EQU   RPHFLAGS                                                 03498000
RPHSMQ   EQU   RPHFLAGS                                                 03499000
RPHAUTEX EQU   RPHAPTYP                                                 03500000
RPHSPGIN EQU   RPHFLAGS                                                 03501000
RPHOGIND EQU   RPHFLAGS                                                 03502000
RPHLNGTH EQU   ISTRPH+1                                                 03503000
RPHTYPE  EQU   ISTRPH                                                   03504000
ZLBZBFSC EQU   ISTZLBVT+88                                              03505000
ZLBZIFVB EQU   ISTZLBVT+84                                              03506000
ZLBZIFUB EQU   ISTZLBVT+80                                              03507000
ZLBZIFSB EQU   ISTZLBVT+76                                              03508000
ZLBRSV22 EQU   ISTZLBVT+72                                              03509000
ZLBZBFID EQU   ISTZLBVT+68                                              03510000
ZLBZBFX0 EQU   ISTZLBVT+64                                              03511000
ZLBRSV02 EQU   ISTZLBVT+60                                              03512000
ZLBRSV21 EQU   ISTZLBVT+56                                              03513000
ZLBZBFJB EQU   ISTZLBVT+52                                              03514000
ZLBZBFIB EQU   ISTZLBVT+48                                              03515000
ZLBZBFHB EQU   ISTZLBVT+44                                              03516000
ZLBZBFGB EQU   ISTZLBVT+40                                              03517000
ZLBZBFFB EQU   ISTZLBVT+36                                              03518000
ZLBZBFEB EQU   ISTZLBVT+32                                              03519000
ZLBZBFDB EQU   ISTZLBVT+28                                              03520000
ZLBZBFCB EQU   ISTZLBVT+24                                              03521000
ZLBZBFBB EQU   ISTZLBVT+20                                              03522000
ZLBZBFAB EQU   ISTZLBVT+16                                              03523000
ZLBZBFNB EQU   ISTZLBVT+12                                              03524000
ZLBZCFAI EQU   ISTZLBVT+8                                               03525000
ZLBZBF0B EQU   ISTZLBVT+4                                               03526000
ZLBZAF0B EQU   ISTZLBVT                                                 03527000
ZFSZWRD4 EQU   ISTZFSVT+36                                              03528000
ZFSZWRD3 EQU   ISTZFSVT+32                                              03529000
ZFSZEFCB EQU   ISTZFSVT+28                                              03530000
ZFSZFFEB EQU   ISTZFSVT+24                                              03531000
ZFSZDFJ0 EQU   ISTZFSVT+20                                              03532000
ZFSZFFFB EQU   ISTZFSVT+16                                              03533000
ZFSZFFDB EQU   ISTZFSVT+12                                              03534000
ZFSZFFCB EQU   ISTZFSVT+8                                               03535000
ZFSZEMAB EQU   ZFSZEAAB                                                 03536000
ZFSZEMBB EQU   ZFSZEABB                                                 03537000
ZPSZDFQR EQU   ISTZPSVT+80                                              03538000
ZPSZDFPR EQU   ISTZPSVT+76                                              03539000
ZPSZDFXR EQU   ISTZPSVT+72                                              03540000
ZPSZIF2B EQU   ISTZPSVT+68                                              03541000
ZPSZAF2B EQU   ISTZPSVT+64                                              03542000
ZPSZDFMB EQU   ISTZPSVT+60                                              03543000
ZPSZDFMF EQU   ISTZPSVT+56                                              03544000
ZPSZDFNB EQU   ISTZPSVT+52                                              03545000
@NM00042 EQU   ISTZPSVT+48                                              03546000
ZPSZDFF0 EQU   ISTZPSVT+44                                              03547000
ZPSZTRTT EQU   ISTZPSVT+40                                              03548000
ZPSZBFOB EQU   ISTZPSVT+36                                              03549000
ZPSZBFMB EQU   ISTZPSVT+32                                              03550000
ZPSZBFZ0 EQU   ISTZPSVT+28                                              03551000
ZPSZBFY0 EQU   ISTZPSVT+24                                              03552000
ZPSZDFI0 EQU   ISTZPSVT+20                                              03553000
ZPSZDFB0 EQU   ISTZPSVT+16                                              03554000
ZPSZDFH0 EQU   ISTZPSVT+12                                              03555000
ZPSZDFD0 EQU   ISTZPSVT+8                                               03556000
ZPSZDFC0 EQU   ISTZPSVT+4                                               03557000
ZLFZWRD5 EQU   ISTZLFVT+48                                              03558000
ZLFZWRD4 EQU   ISTZLFVT+44                                              03559000
ZLFZDFK0 EQU   ISTZLFVT+40                                              03560000
ZLFZEMEA EQU   ISTZLFVT+36                                              03561000
ZLFZFFEA EQU   ISTZLFVT+32                                              03562000
ZLFZEMCA EQU   ZLFZEACA                                                 03563000
ZLFZEMFA EQU   ZLFZEAFA                                                 03564000
ZLFZFMTA EQU   ZLFZFATA                                                 03565000
ZLFZEMTA EQU   ZLFZEATA                                                 03566000
ZLFZFMFA EQU   ZLFZFAFA                                                 03567000
ZLFZEMAA EQU   ZLFZEAAA                                                 03568000
ZLFZEFBA EQU   ISTZLFVT                                                 03569000
CVTLEVL  EQU   CVTRELNO+2                                               03570000
CVTNUMB  EQU   CVTRELNO                                                 03571000
CVTMDL   EQU   CVTFIX+250                                               03572000
@NM00041 EQU   CVTFIX+248                                               03573000
@NM00040 EQU   CVTFIX                                                   03574000
CVTRV482 EQU   CVTXTNT2+128                                             03575000
CVTRV481 EQU   CVTXTNT2+124                                             03576000
CVTRV480 EQU   CVTXTNT2+120                                             03577000
CVTRV479 EQU   CVTXTNT2+118                                             03578000
CVTRV478 EQU   CVTXTNT2+117                                             03579000
CVTRV477 EQU   CVTXTNT2+116                                             03580000
CVTRV476 EQU   CVTXTNT2+115                                             03581000
CVTRV475 EQU   CVTXTNT2+114                                             03582000
CVTRV474 EQU   CVTRV466                                                 03583000
CVTRV473 EQU   CVTRV466                                                 03584000
CVTRV472 EQU   CVTRV466                                                 03585000
CVTRV471 EQU   CVTRV466                                                 03586000
CVTRV470 EQU   CVTRV466                                                 03587000
CVTRV469 EQU   CVTRV466                                                 03588000
CVTRV468 EQU   CVTRV466                                                 03589000
CVTRV467 EQU   CVTRV466                                                 03590000
CVTRV465 EQU   CVTRV457                                                 03591000
CVTRV464 EQU   CVTRV457                                                 03592000
CVTRV463 EQU   CVTRV457                                                 03593000
CVTRV462 EQU   CVTRV457                                                 03594000
CVTRV461 EQU   CVTRV457                                                 03595000
CVTRV460 EQU   CVTRV457                                                 03596000
CVTRV459 EQU   CVTRV457                                                 03597000
CVTRV458 EQU   CVTRV457                                                 03598000
CVTRV456 EQU   CVTXTNT2+108                                             03599000
CVTRV455 EQU   CVTXTNT2+104                                             03600000
CVTRV454 EQU   CVTXTNT2+100                                             03601000
CVTRV453 EQU   CVTXTNT2+96                                              03602000
CVTRV452 EQU   CVTXTNT2+94                                              03603000
CVTRV451 EQU   CVTXTNT2+92                                              03604000
CVTRV450 EQU   CVTXTNT2+90                                              03605000
CVTRV449 EQU   CVTXTNT2+88                                              03606000
CVTRV448 EQU   CVTXTNT2+87                                              03607000
CVTRV447 EQU   CVTXTNT2+86                                              03608000
CVTRV446 EQU   CVTRV438                                                 03609000
CVTRV445 EQU   CVTRV438                                                 03610000
CVTRV444 EQU   CVTRV438                                                 03611000
CVTRV443 EQU   CVTRV438                                                 03612000
CVTRV442 EQU   CVTRV438                                                 03613000
CVTRV441 EQU   CVTRV438                                                 03614000
CVTRV440 EQU   CVTRV438                                                 03615000
CVTRV439 EQU   CVTRV438                                                 03616000
CVTRV437 EQU   CVTRV429                                                 03617000
CVTRV436 EQU   CVTRV429                                                 03618000
CVTRV435 EQU   CVTRV429                                                 03619000
CVTRV434 EQU   CVTRV429                                                 03620000
CVTRV433 EQU   CVTRV429                                                 03621000
CVTRV432 EQU   CVTRV429                                                 03622000
CVTRV431 EQU   CVTRV429                                                 03623000
CVTRV430 EQU   CVTRV429                                                 03624000
CVTRV428 EQU   CVTXTNT2+80                                              03625000
CVTRV427 EQU   CVTXTNT2+76                                              03626000
CVTRV426 EQU   CVTXTNT2+72                                              03627000
CVTRV425 EQU   CVTXTNT2+68                                              03628000
CVTATACT EQU   CVTATCVT                                                 03629000
CVTRV423 EQU   CVTXTNT2+62                                              03630000
CVTRV422 EQU   CVTXTNT2+60                                              03631000
CVTRV421 EQU   CVTXTNT2+58                                              03632000
CVTRV420 EQU   CVTXTNT2+56                                              03633000
CVTRV419 EQU   CVTXTNT2+55                                              03634000
CVTRV418 EQU   CVTXTNT2+54                                              03635000
CVTRV417 EQU   CVTRV409                                                 03636000
CVTRV416 EQU   CVTRV409                                                 03637000
CVTRV415 EQU   CVTRV409                                                 03638000
CVTRV414 EQU   CVTRV409                                                 03639000
CVTRV413 EQU   CVTRV409                                                 03640000
CVTRV412 EQU   CVTRV409                                                 03641000
CVTRV411 EQU   CVTRV409                                                 03642000
CVTRV410 EQU   CVTRV409                                                 03643000
CVTRV408 EQU   CVTRV400                                                 03644000
CVTRV407 EQU   CVTRV400                                                 03645000
CVTRV406 EQU   CVTRV400                                                 03646000
CVTRV405 EQU   CVTRV400                                                 03647000
CVTRV404 EQU   CVTRV400                                                 03648000
CVTRV403 EQU   CVTRV400                                                 03649000
CVTRV402 EQU   CVTRV400                                                 03650000
CVTRV401 EQU   CVTRV400                                                 03651000
CVTICB   EQU   CVTXTNT2+48                                              03652000
CVTSKTA  EQU   CVTXTNT2+44                                              03653000
CVTSHSB  EQU   CVTSHS                                                   03654000
CVTRSV98 EQU   CVTXTNT2+36                                              03655000
CVTRSV97 EQU   CVTXTNT2+34                                              03656000
CVTRSV96 EQU   CVTXTNT2+32                                              03657000
CVTOLTEP EQU   CVTXTNT2+28                                              03658000
CVTQIDA  EQU   CVTQID+1                                                 03659000
CVTRSV95 EQU   CVTQID                                                   03660000
CVTRSV94 EQU   CVTXTNT2+20                                              03661000
CVTRSV93 EQU   CVTXTNT2+16                                              03662000
CVTRSV92 EQU   CVTXTNT2+12                                              03663000
CVTDEBVR EQU   CVTXTNT2+8                                               03664000
CVTRSV91 EQU   CVTXTNT2+6                                               03665000
CVTRSV9H EQU   CVTFLGBT                                                 03666000
CVTRSV9G EQU   CVTFLGBT                                                 03667000
CVTRSV9F EQU   CVTFLGBT                                                 03668000
CVTRSV9E EQU   CVTFLGBT                                                 03669000
CVTRSV9D EQU   CVTFLGBT                                                 03670000
CVTRSV9C EQU   CVTFLGBT                                                 03671000
CVTVME   EQU   CVTFLGBT                                                 03672000
CVTNPE   EQU   CVTFLGBT                                                 03673000
CVTNUCLS EQU   CVTXTNT2+4                                               03674000
CVTDSSVA EQU   CVTDSSV+1                                                03675000
CVTRSV89 EQU   CVTDSSV                                                  03676000
CVTRSV88 EQU   CVTXTNT1+8                                               03677000
CVTRSV87 EQU   CVTXTNT1+4                                               03678000
CVTFACHN EQU   CVTXTNT1                                                 03679000
CVTRV488 EQU   CVTMAP+412                                               03680000
CVTRV487 EQU   CVTMAP+408                                               03681000
CVTRV486 EQU   CVTMAP+404                                               03682000
CVTRV485 EQU   CVTMAP+400                                               03683000
CVTACTAP EQU   CVTMAP+396                                               03684000
CVTAUTH  EQU   CVTMAP+392                                               03685000
CVTATMCA EQU   CVTATMCT+1                                               03686000
CVTATMST EQU   CVTATMCT                                                 03687000
CVTRSV61 EQU   CVTMAP+384                                               03688000
CVTVOLT1 EQU   CVTVOLM1+1                                               03689000
CVTVOLI1 EQU   CVTVOLF1                                                 03690000
CVTSTOA  EQU   CVTMAP+376                                               03691000
CVTRSV58 EQU   CVTMAP+374                                               03692000
CVTRSV57 EQU   CVTMAP+372                                               03693000
CVTDDCE  EQU   CVTMAP+368                                               03694000
CVTPNWFR EQU   CVTMAP+364                                               03695000
CVTSMF   EQU   CVTMAP+360                                               03696000
CVTSULK  EQU   CVTMAP+358                                               03697000
CVTSLKO  EQU   CVTSYSK                                                  03698000
CVTSLKP  EQU   CVTSYSK                                                  03699000
CVTSLKQ  EQU   CVTSYSK                                                  03700000
CVTSLKR  EQU   CVTSYSK                                                  03701000
CVTRSV56 EQU   CVTSYSK                                                  03702000
CVTRSV55 EQU   CVTSYSK                                                  03703000
CVTRSV54 EQU   CVTSYSK                                                  03704000
CVTRSV53 EQU   CVTSYSK                                                  03705000
CVTRSV52 EQU   CVTA1F1                                                  03706000
CVTRSV51 EQU   CVTA1F1                                                  03707000
CVTRSV50 EQU   CVTA1F1                                                  03708000
CVTRSV49 EQU   CVTA1F1                                                  03709000
CVTRSV48 EQU   CVTA1F1                                                  03710000
CVTRSV47 EQU   CVTA1F1                                                  03711000
CVTSRSW  EQU   CVTA1F1                                                  03712000
CVTPFSW  EQU   CVTA1F1                                                  03713000
CVTPCVT  EQU   CVTMAP+352                                               03714000
CVTRSV46 EQU   CVTMAP+344                                               03715000
CVTRSV45 EQU   CVTMAP+340                                               03716000
CVTRSV44 EQU   CVTMAP+338                                               03717000
CVTRSV43 EQU   CVTMAP+336                                               03718000
CVTHJESA EQU   CVTHJES+1                                                03719000
CVTRSV42 EQU   CVTHJES                                                  03720000
CVTEXT2A EQU   CVTEXT2+1                                                03721000
CVTRSV41 EQU   CVTEXT2                                                  03722000
CVTAPFA  EQU   CVTAPF+1                                                 03723000
CVTRSV40 EQU   CVTAPF                                                   03724000
CVTRV518 EQU   CVTINTLA                                                 03725000
CVTRV517 EQU   CVTERPV                                                  03726000
CVTEORM  EQU   CVTMAP+312                                               03727000
CVTMCHPR EQU   CVTMAP+308                                               03728000
CVTTZ    EQU   CVTMAP+304                                               03729000
CVTJEPS  EQU   CVTMAP+300                                               03730000
CVTJESCT EQU   CVTMAP+296                                               03731000
CVTMODE  EQU   CVTMAP+292                                               03732000
CVTPTRV  EQU   CVTMAP+288                                               03733000
CVTREAL  EQU   CVTMAP+284                                               03734000
CVTRSV39 EQU   CVTMAP+280                                               03735000
CVTRSV38 EQU   CVTMAP+276                                               03736000
CVTDMSRA EQU   CVTDMSR+1                                                03737000
CVTRSV37 EQU   CVTDMSR                                                  03738000
CVTQMSGA EQU   CVTQMSG+1                                                03739000
CVTRSV36 EQU   CVTQMSG                                                  03740000
CVTAMFF  EQU   CVTMAP+264                                               03741000
CVTPURGA EQU   CVTPURG+1                                                03742000
CVTRSV35 EQU   CVTPURG                                                  03743000
CVTCBSP  EQU   CVTMAP+256                                               03744000
CVTATERA EQU   CVTATER+1                                                03745000
CVTSYST  EQU   CVTATER                                                  03746000
CVTVOLT2 EQU   CVTTAT                                                   03747000
CVTVOLI2 EQU   CVTVOLF2                                                 03748000
CVTAQAVB EQU   CVTAQAVT+1                                               03749000
CVTRSV34 EQU   CVTTCMFG                                                 03750000
CVTRSV33 EQU   CVTTCMFG                                                 03751000
CVTRSV32 EQU   CVTTCMFG                                                 03752000
CVTRSV31 EQU   CVTTCMFG                                                 03753000
CVTRSV30 EQU   CVTTCMFG                                                 03754000
CVTRSV29 EQU   CVTTCMFG                                                 03755000
CVTRSV28 EQU   CVTTCMFG                                                 03756000
CVTTCRDY EQU   CVTTCMFG                                                 03757000
CVTGTFA  EQU   CVTGTF+1                                                 03758000
CVTRSV27 EQU   CVTGTFST                                                 03759000
CVTRNIO  EQU   CVTGTFST                                                 03760000
CVTUSR   EQU   CVTGTFST                                                 03761000
CVTRV318 EQU   CVTFORM                                                  03762000
CVTRV317 EQU   CVTTMODE                                                 03763000
CVTRV316 EQU   CVTSTATE                                                 03764000
CVTRV315 EQU   CVTGTFS                                                  03765000
CVTGTFAV EQU   CVTGTFS                                                  03766000
CVT0SCR1 EQU   CVTMAP+232                                               03767000
CVTRV515 EQU   CVTMAP+228                                               03768000
CVTRMS   EQU   CVTMAP+224                                               03769000
CVTPATCH EQU   CVTMAP+220                                               03770000
CVTTSCE  EQU   CVTMAP+216                                               03771000
CVTLNKSC EQU   CVTMAP+214                                               03772000
CVTQABST EQU   CVTMAP+212                                               03773000
CVTMDLDS EQU   CVTMAP+208                                               03774000
CVTUSER  EQU   CVTMAP+204                                               03775000
CVTABEND EQU   CVTMAP+200                                               03776000
CVTSMCA  EQU   CVTMAP+196                                               03777000
CVTRSV18 EQU   CVTMAP+192                                               03778000
CVTQLPAQ EQU   CVTMAP+188                                               03779000
CVTQCDSR EQU   CVTMAP+184                                               03780000
CVTRSV17 EQU   CVTOPTB                                                  03781000
CVTRSV16 EQU   CVTOPTB                                                  03782000
CVTFP    EQU   CVTOPTB                                                  03783000
CVTAPTHR EQU   CVTOPTB                                                  03784000
CVTNLOG  EQU   CVTOPTB                                                  03785000
CVTTOD   EQU   CVTOPTB                                                  03786000
CVTCTIMS EQU   CVTOPTB                                                  03787000
CVTPROT  EQU   CVTOPTB                                                  03788000
CVTXPFP  EQU   CVTOPTA                                                  03789000
CVTASCII EQU   CVTOPTA                                                  03790000
CVTRSV13 EQU   CVTOPTA                                                  03791000
CVTRSV12 EQU   CVTOPTA                                                  03792000
CVTNIP   EQU   CVTOPTA                                                  03793000
CVTDDR   EQU   CVTOPTA                                                  03794000
CVTAPR   EQU   CVTOPTA                                                  03795000
CVTCCH   EQU   CVTOPTA                                                  03796000
CVTSNCTR EQU   CVTMAP+180                                               03797000
CVTQMWR  EQU   CVTMAP+176                                               03798000
CVTQOCR  EQU   CVTMAP+172                                               03799000
CVT1EF00 EQU   CVTMAP+168                                               03800000
CVTMZ00  EQU   CVTMAP+164                                               03801000
CVTHEAD  EQU   CVTMAP+160                                               03802000
CVTRSV11 EQU   CVTMAP+156                                               03803000
CVT0PT01 EQU   CVTMAP+152                                               03804000
CVTMSER  EQU   CVTMAP+148                                               03805000
CVTRV516 EQU   CVTIERLC                                                 03806000
CVTILCH  EQU   CVTMAP+140                                               03807000
CVT0DS   EQU   CVTMAP+136                                               03808000
CVTFBOSV EQU   CVTMAP+132                                               03809000
CVTNUCB  EQU   CVTMAP+128                                               03810000
CVTIXAVL EQU   CVTMAP+124                                               03811000
CVTIOQET EQU   CVTMAP+120                                               03812000
CVTDCBA  EQU   CVTMAP+117                                               03813000
CVTMVS2  EQU   CVTDCB                                                   03814000
CVT6DAT  EQU   CVTDCB                                                   03815000
CVT4MPS  EQU   CVTDCB                                                   03816000
CVTRSV09 EQU   CVTDCB                                                   03817000
CVT4MS1  EQU   CVTDCB                                                   03818000
CVT2SPS  EQU   CVTDCB                                                   03819000
CVT1SSS  EQU   CVTDCB                                                   03820000
CVTRSV08 EQU   CVTDCB                                                   03821000
CVTSTB   EQU   CVTMAP+112                                               03822000
CVTQTD00 EQU   CVTMAP+108                                               03823000
CVTQTE00 EQU   CVTMAP+104                                               03824000
CVTCUCB  EQU   CVTMAP+100                                               03825000
CVTSJQ   EQU   CVTMAP+96                                                03826000
CVTPBLDL EQU   CVTMAP+92                                                03827000
CVTTPC   EQU   CVTMAP+88                                                03828000
CVTSVDCB EQU   CVTMAP+84                                                03829000
CVTBRET  EQU   CVTMAP+82                                                03830000
CVTEXIT  EQU   CVTMAP+80                                                03831000
CVT0FN00 EQU   CVTMAP+76                                                03832000
CVTDARA  EQU   CVTDAR+1                                                 03833000
CVTRSV07 EQU   CVTFLGS1                                                 03834000
CVTRSV06 EQU   CVTFLGS1                                                 03835000
CVTRSV05 EQU   CVTFLGS1                                                 03836000
CVTRSV04 EQU   CVTFLGS1                                                 03837000
CVTRSV03 EQU   CVTFLGS1                                                 03838000
CVTRSV02 EQU   CVTFLGS1                                                 03839000
CVTRSV01 EQU   CVTFLGS1                                                 03840000
CVTDMPLK EQU   CVTFLGS1                                                 03841000
CVTXITP  EQU   CVTMAP+68                                                03842000
CVTZDTAB EQU   CVTMAP+64                                                03843000
CVTMSLT  EQU   CVTMAP+60                                                03844000
CVTDATE  EQU   CVTMAP+56                                                03845000
CVTBTERM EQU   CVTMAP+52                                                03846000
CVTSYSAD EQU   CVTMAP+48                                                03847000
CVTXTLER EQU   CVTMAP+44                                                03848000
CVTILK2  EQU   CVTMAP+40                                                03849000
CVTILK1  EQU   CVTMAP+36                                                03850000
CVTPRLTV EQU   CVTMAP+32                                                03851000
CVTPCNVT EQU   CVTMAP+28                                                03852000
CVT0VL00 EQU   CVTMAP+24                                                03853000
CVTXAPG  EQU   CVTMAP+20                                                03854000
CVTBUF   EQU   CVTMAP+16                                                03855000
CVTJOB   EQU   CVTMAP+12                                                03856000
CVTLINK  EQU   CVTMAP+8                                                 03857000
CVT0EF00 EQU   CVTMAP+4                                                 03858000
CVTTCBP  EQU   CVTMAP                                                   03859000
CVT      EQU   CVTMAP                                                   03860000
UCBERADR EQU   UCBUCS+12                                                03861000
UCBFCBID EQU   UCBUCS+8                                                 03862000
UCBERCNT EQU   UCBUCS+7                                                 03863000
UCBRSV51 EQU   UCBUCS+6                                                 03864000
UCBRSV50 EQU   UCBFCBOP                                                 03865000
UCBRSV49 EQU   UCBFCBOP                                                 03866000
UCBRSV48 EQU   UCBFCBOP                                                 03867000
UCBRSV47 EQU   UCBFCBOP                                                 03868000
UCBRSV46 EQU   UCBFCBOP                                                 03869000
UCBRSV45 EQU   UCBFCBOP                                                 03870000
UCBRSV44 EQU   UCBFCBOP                                                 03871000
UCBFCBO1 EQU   UCBFCBOP                                                 03872000
UCBUCSPE EQU   UCBUCSOP                                                 03873000
UCBRSV43 EQU   UCBUCSOP                                                 03874000
UCBRSV42 EQU   UCBUCSOP                                                 03875000
UCBRSV41 EQU   UCBUCSOP                                                 03876000
UCBRSV40 EQU   UCBUCSOP                                                 03877000
UCBRSV39 EQU   UCBUCSOP                                                 03878000
UCBUCSO2 EQU   UCBUCSOP                                                 03879000
UCBUCSO1 EQU   UCBUCSOP                                                 03880000
UCBUCSID EQU   UCBUCS                                                   03881000
UCBMDRBA EQU   UCBMDRBF+1                                               03882000
UCBRV075 EQU   UCBMDRBF                                                 03883000
UCBRV074 EQU   UCB3800X+32                                              03884000
UCBIMAGE EQU   UCB3800X+28                                              03885000
UCBFCBNM EQU   UCB3800X+24                                              03886000
UCBCHAR4 EQU   UCB3800X+20                                              03887000
UCBCHAR3 EQU   UCB3800X+16                                              03888000
UCBCHAR2 EQU   UCB3800X+12                                              03889000
UCBCHAR1 EQU   UCB3800X+8                                               03890000
UCBCGMID EQU   UCB3800X+4                                               03891000
UCBBRSTA EQU   UCBACTIV                                                 03892000
UCBRV063 EQU   UCBACTIV                                                 03893000
UCBRV062 EQU   UCBACTIV                                                 03894000
UCBRV061 EQU   UCBACTIV                                                 03895000
UCBRV060 EQU   UCBACTIV                                                 03896000
UCBRV059 EQU   UCBACTIV                                                 03897000
UCBRV058 EQU   UCBACTIV                                                 03898000
UCBRV057 EQU   UCBACTIV                                                 03899000
UCBRV050 EQU   UCB3800X+2                                               03900000
UCBCGMNO EQU   UCB3800X+1                                               03901000
UCBRV083 EQU   UCBOPTNS                                                 03902000
UCBBRSTR EQU   UCBOPTNS                                                 03903000
UCBRV056 EQU   UCBOPTNS                                                 03904000
UCBRV055 EQU   UCBOPTNS                                                 03905000
UCBRV054 EQU   UCBOPTNS                                                 03906000
UCBRV053 EQU   UCBOPTNS                                                 03907000
UCBRV052 EQU   UCBOPTNS                                                 03908000
UCBRV051 EQU   UCBOPTNS                                                 03909000
UCBRV073 EQU   UCB3540X+7                                               03910000
UCBRV072 EQU   UCBDKBYT                                                 03911000
UCBRV071 EQU   UCBDKBYT                                                 03912000
UCBRV070 EQU   UCBDKBYT                                                 03913000
UCBRV069 EQU   UCBDKBYT                                                 03914000
UCBRV068 EQU   UCBDKBYT                                                 03915000
UCBRV067 EQU   UCBDKBYT                                                 03916000
UCBVLVER EQU   UCBDKBYT                                                 03917000
UCBDKAMX EQU   UCBDKBYT                                                 03918000
UCBVLSER EQU   UCB3540X                                                 03919000
UCBRDATA EQU   UCBOCR+4                                                 03920000
UCBFRID  EQU   UCBOCR                                                   03921000
UCBCLN   EQU   UCBMT+14                                                 03922000
UCBERG   EQU   UCBMT+12                                                 03923000
UCBMS    EQU   UCBMT+11                                                 03924000
UCBNB    EQU   UCBMT+10                                                 03925000
UCBPW    EQU   UCBMT+9                                                  03926000
UCBPR    EQU   UCBMT+8                                                  03927000
UCBSIO   EQU   UCBMT+6                                                  03928000
UCBTW    EQU   UCBMT+5                                                  03929000
UCBTR    EQU   UCBMT+4                                                  03930000
UCBTWT   EQU   UCBMT+3                                                  03931000
UCBTRT   EQU   UCBMT+2                                                  03932000
UCBCTD   EQU   UCBMT                                                    03933000
UCBWTOID EQU   UCBCMEXT+17                                              03934000
UCBRV043 EQU   UCBCMEXT+16                                              03935000
UCBASID  EQU   UCBCMEXT+14                                              03936000
UCBMFCNT EQU   UCBCMEXT+12                                              03937000
UCBPMSK  EQU   UCBCMEXT+10                                              03938000
UCBCCWOF EQU   UCBCMEXT+8                                               03939000
UCBRV041 EQU   UCBCMEXT+6                                               03940000
UCBRV036 EQU   UCBFLP1                                                  03941000
UCBRV035 EQU   UCBFLP1                                                  03942000
UCBERLOG EQU   UCBFLP1                                                  03943000
UCBRV033 EQU   UCBFLP1                                                  03944000
UCBRV032 EQU   UCBFLP1                                                  03945000
UCBRV031 EQU   UCBFLP1                                                  03946000
UCBSHRUP EQU   UCBFLP1                                                  03947000
UCBNSRCH EQU   UCBFLP1                                                  03948000
UCBSNSCT EQU   UCBCMEXT+4                                               03949000
UCBHPDV  EQU   @NM00039                                                 03950000
UCBHALI  EQU   @NM00039                                                 03951000
UCBRSV09 EQU   @NM00039                                                 03952000
UCBRSV08 EQU   @NM00039                                                 03953000
UCBRSV07 EQU   @NM00039                                                 03954000
UCBRSV06 EQU   @NM00039                                                 03955000
UCBRSV05 EQU   @NM00039                                                 03956000
UCBRSV04 EQU   @NM00039                                                 03957000
UCBDTI   EQU   UCBCMEXT+2                                               03958000
UCBSTI   EQU   UCBCMEXT+1                                               03959000
UCBETI   EQU   UCBCMEXT                                                 03960000
UCBEXTP  EQU   UCBEXTPT+1                                               03961000
UCBDDRSW EQU   UCBFLC                                                   03962000
UCBTICBT EQU   UCBFLC                                                   03963000
UCBIVRR  EQU   UCBFLC                                                   03964000
UCBIVRS  EQU   UCBFLC                                                   03965000
UCBITF   EQU   UCBFLC                                                   03966000
UCBUDE   EQU   UCBFLC                                                   03967000
UCBWAA   EQU   UCBFLC                                                   03968000
UCBATTP  EQU   UCBFLC                                                   03969000
UCBUNTYP EQU   UCBTBYT4                                                 03970000
UCBRSV11 EQU   UCBDVCLS                                                 03971000
UCBRSV10 EQU   UCBDVCLS                                                 03972000
UCB3CHAR EQU   UCBDVCLS                                                 03973000
UCB3UREC EQU   UCBDVCLS                                                 03974000
UCB3DISP EQU   UCBDVCLS                                                 03975000
UCB3DACC EQU   UCBDVCLS                                                 03976000
UCB3COMM EQU   UCBDVCLS                                                 03977000
UCB3TAPE EQU   UCBDVCLS                                                 03978000
UCBDVPWR EQU   UCB2OPT7                                                 03979000
UCBVLPWR EQU   UCB2OPT6                                                 03980000
UCB2OPT5 EQU   UCBTBYT2                                                 03981000
UCBRVDEV EQU   UCBRWTAU                                                 03982000
UCBRPS   EQU   UCBDUDN2                                                 03983000
UCBRR    EQU   UCBDUDN1                                                 03984000
UCB2OPT1 EQU   UCBTBYT2                                                 03985000
UCB2OPT0 EQU   UCBTBYT2                                                 03986000
UCB1FEA7 EQU   UCBTBYT1                                                 03987000
UCBD6250 EQU   UCB1FEA6                                                 03988000
UCBD1600 EQU   UCB1FEA5                                                 03989000
UCB1FEA4 EQU   UCBTBYT1                                                 03990000
UCB1FEA3 EQU   UCBTBYT1                                                 03991000
UCB1FEA2 EQU   UCBTBYT1                                                 03992000
UCB1FEA1 EQU   UCBTBYT1                                                 03993000
UCB1FEA0 EQU   UCBTBYT1                                                 03994000
UCBNAME  EQU   UCBOB+13                                                 03995000
UCBRV029 EQU   UCBWGT                                                   03996000
UCBVHRSN EQU   UCBWGT                                                   03997000
UCBVORSN EQU   UCBWGT                                                   03998000
UCBMTPXP EQU   UCBWGT                                                   03999000
UCBREW   EQU   UCBWGT                                                   04000000
UCBPUB   EQU   UCBWGT                                                   04001000
UCBOUT   EQU   UCBWGT                                                   04002000
UCBIN    EQU   UCBWGT                                                   04003000
UCBCPU   EQU   UCBOB+11                                                 04004000
UCBLCI   EQU   UCBOB+10                                                 04005000
UCBCNT   EQU   UCBOB+9                                                  04006000
UCBRV017 EQU   UCBCHM1                                                  04007000
UCBRV016 EQU   UCBCHM1                                                  04008000
UCBRV015 EQU   UCBCHM1                                                  04009000
UCBRV014 EQU   UCBCHM1                                                  04010000
UCBSPB   EQU   UCBPTH1                                                  04011000
UCBPPB   EQU   UCBPTH1                                                  04012000
UCBSPA   EQU   UCBPTH0                                                  04013000
UCBPPA   EQU   UCBPTH0                                                  04014000
UCBSIGP  EQU   UCBFLB                                                   04015000
UCBVALPH EQU   UCBFLB                                                   04016000
UCBCRHSN EQU   UCBFLB                                                   04017000
UCBCRHRV EQU   UCBFLB                                                   04018000
UCBRESVH EQU   UCBFLB                                                   04019000
UCBSPST  EQU   UCBFLB                                                   04020000
UCBASNS  EQU   UCBFLB                                                   04021000
UCBIORST EQU   UCBFLB                                                   04022000
UCBQISCE EQU   UCBFL1                                                   04023000
UCBACTV  EQU   UCBFL1                                                   04024000
UCBSAP   EQU   UCBFL1                                                   04025000
UCBNOTRC EQU   UCBCUB                                                   04026000
UCBPSNS  EQU   UCBFL1                                                   04027000
UCBUSING EQU   UCBPST                                                   04028000
UCBNOTRD EQU   UCBNRY                                                   04029000
UCBBUSYD EQU   UCBBSY                                                   04030000
UCBUA    EQU   UCBCHAN+1                                                04031000
UCBCHA   EQU   UCBCHAN                                                  04032000
UCBDADI  EQU   UCBSTAT                                                  04033000
UCBSYSR  EQU   UCBSTAT                                                  04034000
UCBPRES  EQU   UCBSTAT                                                  04035000
UCBALOC  EQU   UCBSTAT                                                  04036000
UCBUNLD  EQU   UCBSTAT                                                  04037000
UCBRESV  EQU   UCBSTAT                                                  04038000
UCBCHGS  EQU   UCBSTAT                                                  04039000
UCBONLI  EQU   UCBSTAT                                                  04040000
UCBID    EQU   UCBOB+2                                                  04041000
UCBALTPH EQU   UCBFL5                                                   04042000
UCBALTCU EQU   UCBFL5                                                   04043000
UCBNALOC EQU   UCBFL5                                                   04044000
UCBENVRD EQU   UCBFL5                                                   04045000
UCBVSDR  EQU   UCBFL5                                                   04046000
UCBSASK  EQU   UCBFL5                                                   04047000
UCBAMV   EQU   UCBAF                                                    04048000
UCBDCC   EQU   UCBFL5                                                   04049000
UCBMONT  EQU   UCBJBNR                                                  04050000
UCBRV011 EQU   UCBJBNR                                                  04051000
UCBRSV02 EQU   UCBJBNR                                                  04052000
UCBOLDSM EQU   UCBJBNR                                                  04053000
UCBRV003 EQU   UCBJBNR                                                  04054000
UCBRV002 EQU   UCBJBNR                                                  04055000
UCBJES3  EQU   UCBJBNR                                                  04056000
UCBVRDEV EQU   UCBJBNR                                                  04057000
UCBCMSEG EQU   UCBOB                                                    04058000
UCBPFXND EQU   UCB+512                                                  04059000
UCBIOQ   EQU   UCB+508                                                  04060000
UCBLOCK  EQU   UCB+504                                                  04061000
UCBPXST  EQU   UCB+504                                                  04062000
@NM00036 EQU   UCB                                                      04063000
@NM00035 EQU   FRRSFLGS+1                                               04064000
@NM00034 EQU   FRRSFLG1                                                 04065000
FRRSRCUR EQU   FRRSFLG1                                                 04066000
FRRSENTS EQU   FRRS+84                                                  04067000
FRRSRTMW EQU   FRRS+16                                                  04068000
@NM00009 EQU   SRBSECT+40                                               04069000
@NM00008 EQU   SRBSECT+38                                               04070000
SRBPRIOR EQU   SRBSECT+37                                               04071000
SRBPKF   EQU   SRBSECT+36                                               04072000
SRBSAVE  EQU   SRBSECT+32                                               04073000
SRBPARM  EQU   SRBSECT+28                                               04074000
SRBRMTR  EQU   SRBSECT+24                                               04075000
SRBEP    EQU   SRBSECT+20                                               04076000
SRBPTCB  EQU   SRBFLC+4                                                 04077000
SRBPASID EQU   SRBFLC+2                                                 04078000
SRBCPAFF EQU   SRBFLC                                                   04079000
SRBASCB  EQU   SRBSECT+8                                                04080000
SRBFLNK  EQU   SRBSECT+4                                                04081000
SRBID    EQU   SRBSECT                                                  04082000
IOSEND   EQU   IOSB+108                                                 04083000
IOSSKR   EQU   IOSEEKA+7                                                04084000
IOSSKH2  EQU   IOSSKHH+1                                                04085000
IOSSKH1  EQU   IOSSKHH                                                  04086000
IOSSKCC  EQU   IOSCCHH                                                  04087000
IOSSKBB  EQU   IOSEEKA+1                                                04088000
IOSSKM   EQU   IOSEEKA                                                  04089000
IOSEEK   EQU   IOSB+92                                                  04090000
IOSMDM   EQU   IOSB+91                                                  04091000
IOSMDB   EQU   IOSB+90                                                  04092000
IOSCKEY7 EQU   IOSCKEY                                                  04093000
IOSCKEY6 EQU   IOSCKEY                                                  04094000
IOSCKEY5 EQU   IOSCKEY                                                  04095000
IOSCKEY4 EQU   IOSCKEY                                                  04096000
@NM00004 EQU   IOSCKEY                                                  04097000
IOSFMSK  EQU   IOSB+88                                                  04098000
IOSCUDEV EQU   IOSPATH+1                                                04099000
@NM00003 EQU   IOSCHN                                                   04100000
IOSPATH3 EQU   IOSCHN                                                   04101000
IOSPATH2 EQU   IOSCHN                                                   04102000
IOSEXP   EQU   IOSCHN                                                   04103000
IOSGDP   EQU   IOSCHN                                                   04104000
IOSAFF   EQU   IOSB+85                                                  04105000
IOSRSS1B EQU   IOSB+84                                                  04106000
IOSDSID  EQU   IOSB+80                                                  04107000
IOSVST   EQU   IOSB+76                                                  04108000
IOSRST   EQU   IOSB+72                                                  04109000
IOSDIE   EQU   IOSB+68                                                  04110000
IOSABN   EQU   IOSB+64                                                  04111000
IOSNRM   EQU   IOSB+60                                                  04112000
IOSPCI   EQU   IOSB+56                                                  04113000
IOSERP   EQU   IOSB+52                                                  04114000
IOSPCHN  EQU   IOSB+48                                                  04115000
IOSSNS   EQU   IOSB+42                                                  04116000
IOSAPMSK EQU   IOSB+40                                                  04117000
IOSRES4A EQU   IOSB+36                                                  04118000
IOSUSE   EQU   IOSB+32                                                  04119000
IOSSRB   EQU   IOSB+28                                                  04120000
IOSCSWRC EQU   IOSCSW+5                                                 04121000
IOSTSB   EQU   IOSTATUS+1                                               04122000
IOSTSA   EQU   IOSTATUS                                                 04123000
IOSCSWCA EQU   IOSCSW                                                   04124000
IOSCC    EQU   @NM00002                                                 04125000
IOSUCB   EQU   IOSB+16                                                  04126000
IOSOPT2X EQU   IOSOPT2                                                  04127000
IOSHTP   EQU   IOSOPT2                                                  04128000
IOSRELSE EQU   IOSOPT                                                   04129000
IOSAPR   EQU   IOSOPT                                                   04130000
IOSTSLL  EQU   IOSOPT                                                   04131000
IOSNERP  EQU   IOSOPT                                                   04132000
IOSPSLL  EQU   IOSOPT                                                   04133000
IOSQISCE EQU   IOSOPT                                                   04134000
IOSDEP   EQU   IOSOPT                                                   04135000
IOSBYP   EQU   IOSOPT                                                   04136000
IOSCOD   EQU   IOSB+13                                                  04137000
IOSPKY7  EQU   IOSPKEY                                                  04138000
IOSPGDPX EQU   IOSPKEY                                                  04139000
IOSIDR   EQU   IOSPKEY                                                  04140000
IOSLCL   EQU   IOSPKEY                                                  04141000
@NM00001 EQU   IOSPKEY                                                  04142000
IOSPGAD  EQU   IOSB+8                                                   04143000
IOSASID  EQU   IOSB+6                                                   04144000
IOSPRLVL EQU   IOSB+5                                                   04145000
IOSDVRID EQU   IOSB+4                                                   04146000
IOSPROC  EQU   IOSB+3                                                   04147000
IOSFLC7  EQU   IOSFLC                                                   04148000
IOSFLC6  EQU   IOSFLC                                                   04149000
IOSGLC5  EQU   IOSFLC                                                   04150000
IOSFLC4  EQU   IOSFLC                                                   04151000
IOSFLC3  EQU   IOSFLC                                                   04152000
IOSFLC2  EQU   IOSFLC                                                   04153000
IOSVERIF EQU   IOSDVALT                                                 04154000
IOSDVMNT EQU   IOSFLC                                                   04155000
IOSLOG   EQU   IOSFLB                                                   04156000
IOSBDCST EQU   IOSFLB                                                   04157000
IOSMSG   EQU   IOSFLB                                                   04158000
IOSFLB4  EQU   IOSFLB                                                   04159000
IOSFLB3  EQU   IOSFLB                                                   04160000
IOSFLB2  EQU   IOSFLB                                                   04161000
IOSFLB1  EQU   IOSFLB                                                   04162000
IOSDIESE EQU   IOSFLB                                                   04163000
IOSIOSB  EQU   IOSFLA                                                   04164000
IOSDOM   EQU   IOSFLA                                                   04165000
IOSEX    EQU   IOSFLA                                                   04166000
IOSSMDB  EQU   IOSFLA                                                   04167000
IOSSMDA  EQU   IOSFLA                                                   04168000
IOSERR   EQU   IOSFLA                                                   04169000
IOSCCHN  EQU   IOSACHN                                                  04170000
IOSDCHN  EQU   IOSACHN                                                  04171000
@NM00033 EQU   PSA+3668                                                 04172000
PSASTAK  EQU   PSA+3072                                                 04173000
@NM00032 EQU   PSA+1040                                                 04174000
PSAUSEND EQU   PSA+1040                                                 04175000
PSARV062 EQU   PSA+1036                                                 04176000
PSAATCVT EQU   PSA+1032                                                 04177000
PSAPCPSW EQU   PSA+1024                                                 04178000
PSAPIR2  EQU   PSA+1020                                                 04179000
PSARV059 EQU   PSA+1018                                                 04180000
PSASVC13 EQU   PSA+1016                                                 04181000
PSASFACC EQU   PSA+1008                                                 04182000
PSASTOP  EQU   PSA+992                                                  04183000
PSASTART EQU   PSA+976                                                  04184000
PSARSPSW EQU   PSA+968                                                  04185000
PSASRPSW EQU   PSA+960                                                  04186000
PSARV045 EQU   PSA+892                                                  04187000
PSARV044 EQU   PSA+888                                                  04188000
PSARV043 EQU   PSA+884                                                  04189000
PSARV042 EQU   PSA+880                                                  04190000
PSARV041 EQU   PSA+876                                                  04191000
PSARV040 EQU   PSA+872                                                  04192000
PSARV025 EQU   PSA+868                                                  04193000
PSADSSED EQU   PSA+868                                                  04194000
PSADSSPR EQU   PSA+864                                                  04195000
PSADSSFW EQU   PSA+860                                                  04196000
PSADSS14 EQU   PSA+856                                                  04197000
PSADSSPP EQU   PSA+848                                                  04198000
PSADSSRP EQU   PSA+840                                                  04199000
PSADSS05 EQU   PSADSSF4                                                 04200000
PSADSS10 EQU   PSADSSF4                                                 04201000
PSADSSVE EQU   PSADSSF4                                                 04202000
PSADSSDE EQU   PSADSSF4                                                 04203000
PSADSSC0 EQU   PSADSSF4                                                 04204000
PSADSSIE EQU   PSADSSF4                                                 04205000
PSADSS12 EQU   PSADSSF4                                                 04206000
PSADSSRC EQU   PSADSSF4                                                 04207000
PSARV057 EQU   PSADSSF3                                                 04208000
PSARV056 EQU   PSADSSF3                                                 04209000
PSARV055 EQU   PSADSSF3                                                 04210000
PSADSSMC EQU   PSADSSF3                                                 04211000
PSADSSRW EQU   PSADSSF3                                                 04212000
PSADSSNM EQU   PSADSSF3                                                 04213000
PSADSSES EQU   PSADSSF3                                                 04214000
PSADSSGP EQU   PSADSSF3                                                 04215000
PSADSSF2 EQU   PSADSSFL+1                                               04216000
PSADSSPI EQU   PSADSSF1                                                 04217000
PSADSSOI EQU   PSADSSF1                                                 04218000
PSADSSSP EQU   PSADSSF1                                                 04219000
PSADSSTP EQU   PSADSSF1                                                 04220000
PSADSSDW EQU   PSADSSF1                                                 04221000
PSADSSDD EQU   PSADSSF1                                                 04222000
PSADSSDM EQU   PSADSSF1                                                 04223000
PSADSSMV EQU   PSADSSF1                                                 04224000
PSADSSTS EQU   PSA+816                                                  04225000
PSADSSWK EQU   PSA+812                                                  04226000
PSADSSR3 EQU   PSA+808                                                  04227000
PSADSSR2 EQU   PSA+804                                                  04228000
PSADSSRS EQU   PSA+800                                                  04229000
PSASTOR  EQU   PSA+796                                                  04230000
PSACPUSA EQU   PSA+794                                                  04231000
PSAVSTAP EQU   PSA+792                                                  04232000
PSAWKVAP EQU   PSA+788                                                  04233000
PSAWKRAP EQU   PSA+784                                                  04234000
PSAMCHIC EQU   PSA+783                                                  04235000
PSARV061 EQU   PSA+782                                                  04236000
PSASYMSK EQU   PSA+781                                                  04237000
PSAMCHFL EQU   PSA+780                                                  04238000
PSACR0   EQU   PSA+776                                                  04239000
PSAPSWSV EQU   PSA+768                                                  04240000
PSACLHS  EQU   PSAHLHI                                                  04241000
PSALKR15 EQU   PSALKSA+60                                               04242000
PSALKR14 EQU   PSALKSA+56                                               04243000
PSALKR13 EQU   PSALKSA+52                                               04244000
PSALKR12 EQU   PSALKSA+48                                               04245000
PSALKR11 EQU   PSALKSA+44                                               04246000
PSALKR10 EQU   PSALKSA+40                                               04247000
PSALKR9  EQU   PSALKSA+36                                               04248000
PSALKR8  EQU   PSALKSA+32                                               04249000
PSALKR7  EQU   PSALKSA+28                                               04250000
PSALKR6  EQU   PSALKSA+24                                               04251000
PSALKR5  EQU   PSALKSA+20                                               04252000
PSALKR4  EQU   PSALKSA+16                                               04253000
PSALKR3  EQU   PSALKSA+12                                               04254000
PSALKR2  EQU   PSALKSA+8                                                04255000
PSALKR1  EQU   PSALKSA+4                                                04256000
PSALKR0  EQU   PSALKSA                                                  04257000
PSARV023 EQU   PSACLHT+52                                               04258000
PSALOCAL EQU   PSACLHT+48                                               04259000
PSACMSL  EQU   PSACLHT+44                                               04260000
PSAOPTL  EQU   PSACLHT+40                                               04261000
PSATPACL EQU   PSACLHT+36                                               04262000
PSATPDNL EQU   PSACLHT+32                                               04263000
PSATPNCL EQU   PSACLHT+28                                               04264000
PSAIOSLL EQU   PSACLHT+24                                               04265000
PSAIOSUL EQU   PSACLHT+20                                               04266000
PSAIOSCL EQU   PSACLHT+16                                               04267000
PSAIOSSL EQU   PSACLHT+12                                               04268000
PSASALCL EQU   PSACLHT+8                                                04269000
PSAASML  EQU   PSACLHT+4                                                04270000
PSADISPL EQU   PSACLHT                                                  04271000
PSASRSA  EQU   PSA+636                                                  04272000
PSARV050 EQU   PSA+634                                                  04273000
PSADSSGO EQU   PSA+633                                                  04274000
PSARECUR EQU   PSA+632                                                  04275000
PSAHLHIS EQU   PSA+628                                                  04276000
PSAIPCSA EQU   PSA+624                                                  04277000
@NM00031 EQU   PSA+621                                                  04278000
PSAIPCDM EQU   PSA+620                                                  04279000
PSAIPCD  EQU   PSA+616                                                  04280000
@NM00030 EQU   PSA+613                                                  04281000
PSAIPCRM EQU   PSA+612                                                  04282000
PSAIPCR  EQU   PSA+608                                                  04283000
PSAMCHEX EQU   PSA+600                                                  04284000
PSAMPSW  EQU   PSA+592                                                  04285000
PSAEXPS2 EQU   PSA+584                                                  04286000
PSAEXPS1 EQU   PSA+576                                                  04287000
PSAPIREG EQU   PSA+572                                                  04288000
PSARSREG EQU   PSA+568                                                  04289000
PSAGPREG EQU   PSA+556                                                  04290000
PSARV022 EQU   PSASUP4                                                  04291000
PSARV021 EQU   PSASUP4                                                  04292000
PSARV020 EQU   PSASUP4                                                  04293000
PSARV019 EQU   PSASUP4                                                  04294000
PSARV018 EQU   PSASUP4                                                  04295000
PSARV017 EQU   PSASUP4                                                  04296000
PSARV016 EQU   PSASUP4                                                  04297000
PSARV015 EQU   PSASUP4                                                  04298000
PSARV014 EQU   PSASUP3                                                  04299000
PSARV013 EQU   PSASUP3                                                  04300000
PSARV012 EQU   PSASUP3                                                  04301000
PSARV011 EQU   PSASUP3                                                  04302000
PSASPR   EQU   PSASUP3                                                  04303000
PSAPSREG EQU   PSASUP3                                                  04304000
PSAPI2   EQU   PSASUP3                                                  04305000
PSAIOSUP EQU   PSASUP3                                                  04306000
PSALCR   EQU   PSASUP2                                                  04307000
PSARTM   EQU   PSASUP2                                                  04308000
PSAACR   EQU   PSASUP2                                                  04309000
PSAIPCE2 EQU   PSASUP2                                                  04310000
PSAIPCES EQU   PSASUP2                                                  04311000
PSAIPCEC EQU   PSASUP2                                                  04312000
PSAGTF   EQU   PSASUP2                                                  04313000
PSAIPCRI EQU   PSASUP2                                                  04314000
PSAIPCRP EQU   PSASUP1                                                  04315000
PSAIPCDR EQU   PSASUP1                                                  04316000
PSADISP  EQU   PSASUP1                                                  04317000
PSALOCK  EQU   PSASUP1                                                  04318000
PSAPI    EQU   PSASUP1                                                  04319000
PSAEXT   EQU   PSASUP1                                                  04320000
PSASVC   EQU   PSASUP1                                                  04321000
PSAIO    EQU   PSASUP1                                                  04322000
PSAAOLD  EQU   PSA+548                                                  04323000
PSAANEW  EQU   PSA+544                                                  04324000
PSATOLD  EQU   PSA+540                                                  04325000
PSATNEW  EQU   PSA+536                                                  04326000
PSALCCAR EQU   PSA+532                                                  04327000
PSALCCAV EQU   PSA+528                                                  04328000
PSAPCCAR EQU   PSA+524                                                  04329000
PSAPCCAV EQU   PSA+520                                                  04330000
PSACPULA EQU   PSA+518                                                  04331000
PSAPSA   EQU   PSA+512                                                  04332000
FLCHDEND EQU   PSA+512                                                  04333000
FLCCRSAV EQU   FLCMCLA+280                                              04334000
FLCGRSAV EQU   FLCMCLA+216                                              04335000
FLCFPSAV EQU   FLCMCLA+184                                              04336000
FLCFLA   EQU   FLCMCLA+88                                               04337000
FLCRGNCD EQU   FLCMCLA+84                                               04338000
FLCFSAA  EQU   FLCFSA+1                                                 04339000
@NM00029 EQU   FLCFSA                                                   04340000
@NM00028 EQU   FLCMCLA+72                                               04341000
FLCMCIC  EQU   FLCMCLA+64                                               04342000
@NM00027 EQU   FLCMCLA+20                                               04343000
FLCIOAA  EQU   FLCIOA+1                                                 04344000
@NM00026 EQU   FLCIOA                                                   04345000
@NM00025 EQU   FLCMCLA+15                                               04346000
@NM00024 EQU   FLCMCLA+14                                               04347000
@NM00023 EQU   FLCMCLA+12                                               04348000
FLCLCL   EQU   FLCMCLA+8                                                04349000
FLCIOELA EQU   FLCIOEL+1                                                04350000
@NM00022 EQU   FLCIOEL                                                  04351000
FLCCHNID EQU   FLCMCLA                                                  04352000
@NM00021 EQU   PSA+160                                                  04353000
FLCMTRCD EQU   PSA+157                                                  04354000
@NM00020 EQU   PSA+156                                                  04355000
FLCPERA  EQU   FLCPER+1                                                 04356000
@NM00019 EQU   FLCPER                                                   04357000
@NM00018 EQU   PSA+151                                                  04358000
FLCPERCD EQU   PSA+150                                                  04359000
FLCMCNUM EQU   PSA+149                                                  04360000
@NM00017 EQU   PSA+148                                                  04361000
FLCTEAA  EQU   FLCTEA+1                                                 04362000
@NM00016 EQU   FLCTEA                                                   04363000
PSAPIPC  EQU   PSAPICOD                                                 04364000
PSAPIMC  EQU   PSAPICOD                                                 04365000
PSAPIPER EQU   PSAPICOD                                                 04366000
PSARV049 EQU   FLCPICOD                                                 04367000
FLCPILCB EQU   FLCPIILC                                                 04368000
@NM00015 EQU   FLCPIILC                                                 04369000
@NM00014 EQU   PSAEPPSW                                                 04370000
FLCSVCN  EQU   PSAESPSW+2                                               04371000
FLCSILCB EQU   FLCSVILC                                                 04372000
@NM00013 EQU   FLCSVILC                                                 04373000
@NM00012 EQU   PSAESPSW                                                 04374000
FLCEICOD EQU   PSAEEPSW+2                                               04375000
PSASPAD  EQU   PSAEEPSW                                                 04376000
@NM00011 EQU   PSA+128                                                  04377000
FLCINPSW EQU   PSA+120                                                  04378000
FLCMNPSW EQU   PSA+112                                                  04379000
FLCPNPSW EQU   PSA+104                                                  04380000
FLCSNPSW EQU   PSA+96                                                   04381000
FLCENPSW EQU   PSA+88                                                   04382000
FLCTRACE EQU   PSA+84                                                   04383000
FLCTIMER EQU   PSA+80                                                   04384000
FLCCVT2  EQU   PSA+76                                                   04385000
FLCCAW   EQU   PSA+72                                                   04386000
FLCCSW   EQU   PSA+64                                                   04387000
FLCIOPSW EQU   PSA+56                                                   04388000
FLCMOPSW EQU   PSA+48                                                   04389000
FLCPOPSW EQU   PSA+40                                                   04390000
FLCSOPSW EQU   PSA+32                                                   04391000
FLCEOPSW EQU   PSA+24                                                   04392000
@NM00010 EQU   FLCICCW2+4                                               04393000
FLCCVT   EQU   FLCICCW2                                                 04394000
FLCICCW1 EQU   FLCROPSW                                                 04395000
FLCIPPSW EQU   FLCRNPSW                                                 04396000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04397000
TSTMODE# EQU   @RC00574                                                 04398000
@ENDDATA EQU   *                                                        04399000
         END   ISTZFFEA,(C'PLS1702',0603,75130)                         04400000
