         TITLE 'LINK CONTROL VECTOR TABLE                              *00001000
                        '                                               00002000
ISTZFMV0 CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
*   END ISTZFMV0;                                                  0003 00005000
@DATA    DS    0H                                                       00006000
         DS    0F                                                       00007000
         DS    0F                                                       00008000
         DS    0D                                                       00009000
ISTZFMV0 CSECT                                                          00010000
*                           /*     ---VS2 VERSION---     */             00011000
         DC    V(ISTZFFDB)       370X WRITE DEALLOCATION                00012000
         DC    V(ISTZFM1B)       370X READ DEBLOCKING                   00013000
ISTZFMV0 CSECT                                                          00014000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00015000
@01      EQU   01                                                       00016000
@02      EQU   02                                                       00017000
@03      EQU   03                                                       00018000
@04      EQU   04                                                       00019000
@05      EQU   05                                                       00020000
@06      EQU   06                                                       00021000
@07      EQU   07                                                       00022000
@08      EQU   08                                                       00023000
@09      EQU   09                                                       00024000
@10      EQU   10                                                       00025000
@11      EQU   11                                                       00026000
@12      EQU   12                                                       00027000
@13      EQU   13                                                       00028000
@14      EQU   14                                                       00029000
@15      EQU   15                                                       00030000
@ENDDATA EQU   *                                                        00031000
         END   ISTZFMV0,(C'PLS1713',0603,75130)                         00032000
