         TITLE 'ISTZKFBN/ABN-VS1/MBN-VS2 - DIAL DISCONNECT PROCESSOR   *00001000
                        '                                               00002000
ISTZKFBN CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZKFBN  75.134'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
*                                                                  0341 00011000
*/* TPZSAVE (7,12,14) BASE AC(KCBN)                                  */ 00012000
*                                                                  0341 00013000
*   DO;                                                            0341 00014000
*     DCL                                                          0342 00015000
*       GPR01F FIXED(31) REG(01);                                  0342 00016000
*     DCL                                                          0343 00017000
*       GPR01P PTR(31) REG(01);                                    0343 00018000
*     DCL                                                          0344 00019000
*       GPR12F FIXED(31) REG(12);                                  0344 00020000
*     DCL                                                          0345 00021000
*       GPR12P PTR(31) REG(12);                                    0345 00022000
*     DCL                                                          0346 00023000
*       GPR13F FIXED(31) REG(13);                                  0346 00024000
*     DCL                                                          0347 00025000
*       GPR13P PTR(31) REG(13);                                    0347 00026000
*     DCL                                                          0348 00027000
*       GPR14F FIXED(31) REG(14);                                  0348 00028000
*     DCL                                                          0349 00029000
*       GPR14P PTR(31) REG(14);                                    0349 00030000
*     RFY                                                          0350 00031000
*      (GPR01P,                                                    0350 00032000
*       GPR12P,                                                    0350 00033000
*       GPR13P,                                                    0350 00034000
*       GPR14P) RSTD;                                              0350 00035000
*     GEN(PRINT OFF);                                              0351 00036000
*                                                                  0351 00037000
         PRINT OFF                                                      00038000
*/* ATBUILD (ISTZSAVE)                                               */ 00039000
*/* END OF ATBUILD                                                   */ 00040000
*                                                                  0352 00041000
*     GEN(PRINT ON);                                               0352 00042000
         PRINT ON                                                       00043000
*     RFY                                                          0353 00044000
*       ISTZSAVE BASED(GPR13P);                                    0353 00045000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0354 00046000
         STM   7,12,ZSAZSVVR+0(13)                                      00047000
*     GEN SETS(GPR12P);                                            0355 00048000
         BALR  GPR12P,0                                                 00049000
@TSTART  DS    0H                                                       00050000
         USING @TSTART,GPR12P                                           00051000
*     GEN(PRINT OFF);                                              0356 00052000
*                                                                  0356 00053000
         PRINT OFF                                                      00054000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00055000
*/* END OF ATBUILD                                                   */ 00056000
*                                                                  0357 00057000
*     GEN(PRINT ON);                                               0357 00058000
         PRINT ON                                                       00059000
*     GPR01P->RPHCRR->CRACRR->ZCREKCBN='1'B;                       0358 00060000
         L     @15,RPHCRR(,GPR01P)                                 0358 00061000
         L     @15,CRACRR(,@15)                                    0358 00062000
         OI    ZCREKCBN(@15),B'00100000'                           0358 00063000
*     ZSAZACTV='1'B;                                               0359 00064000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0359 00065000
*     ZSAZTRAC='KCBN';                                             0360 00066000
         MVC   ZSAZTRAC(4,GPR13P),@CC03551                         0360 00067000
*     ZSAZSVRR=GPR14P;                                             0361 00068000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0361 00069000
*     GPR13P=ZSAZSVFC;                                             0362 00070000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0362 00071000
*     RFY                                                          0363 00072000
*      (GPR01P) UNRSTD;                                            0363 00073000
*     RFY                                                          0364 00074000
*      (GPR14P) UNRSTD;                                            0364 00075000
*   END;                                                           0365 00076000
*                                                                  0365 00077000
*/* END TPZSAVE                                                      */ 00078000
*                                                                  0366 00079000
*   FSBREG=ADDR(ZIBFSB);            /* ADDRESS CURRENT FSB           */ 00080000
         LA    FSBREG,ZIBFSB(,BFRREG)                              0366 00081000
*   FSBMJRCD=FRDISCNT;              /* CHANGE RC TO DISCONNECTED     */ 00082000
         MVI   FSBMJRCD(FSBREG),X'28'                              0367 00083000
*   FSBMNRCD='00'X;                 /* NO MINOR RC                   */ 00084000
         MVI   FSBMNRCD(FSBREG),X'00'                              0368 00085000
*   FSBMNELI='1'B;                  /*                               */ 00086000
         OI    FSBMNELI(FSBREG),B'10000000'                        0369 00087000
*   IF(NCBFMCBP&'00FFFFFF'X)=0 THEN                                0370 00088000
         L     @11,NCBFMCBP(,DNCBREG)                              0370 00089000
         N     @11,@CF03552                                        0370 00090000
         LTR   @11,@11                                             0370 00091000
         BZ    @RT00370                                            0370 00092000
*     ;                             /* DIAL IN DEVICE ?      @XM09539*/ 00093000
*   ELSE                            /* YES                   @XM09539*/ 00094000
*     DO;                           /*                       @XM09539*/ 00095000
*       FSBMNDNU='1'B;              /* DEVICE NOT USABLE     @XM01629*/ 00096000
         OI    FSBMNDNU(FSBREG),B'00010000'                        0373 00097000
*       IF(NCBFMCBP&'00FFFFFF'X)=ADDR(ISTFMCB) THEN                0374 00098000
         L     @11,NCBFMCBP(,DNCBREG)                              0374 00099000
         N     @11,@CF03552                                        0374 00100000
         CR    @11,FMCBREG                                         0374 00101000
         BE    @RT00374                                            0374 00102000
*         ;                                                        0375 00103000
*                                                                  0375 00104000
*       /*************************************************************/ 00105000
*       /*                                                           */ 00106000
*       /* WONT QUEUE 2ND FSB TO PORT SOLICITOR              @XA07978*/ 00107000
*       /*                                                           */ 00108000
*       /*************************************************************/ 00109000
*                                                                  0376 00110000
*       ELSE                        /* NOT PORT SOL FMCB     @XA07978*/ 00111000
*         DO;                       /* DO GRP-BUILD 2ND FSB  @XA07978*/ 00112000
*           ZCRREG=CRACRR;          /* ADDRESS TPIOS ZCRR            */ 00113000
         L     @11,RPHCRR(,RPHREG)                                 0377 00114000
         L     ZCRREG,CRACRR(,@11)                                 0377 00115000
*           ZCRPCOD1='00'X;         /* ZERO BUFFER ALLOCATION PARAM. */ 00116000
         MVI   ZCRPCOD1(ZCRREG),X'00'                              0378 00117000
*           ZCRPPG='1'B;            /*                               */ 00118000
*           ZCRPFSB='1'B;           /* PAGEABLE FSB PARAMATER        */ 00119000
*                                                                  0380 00120000
         OI    ZCRPPG(ZCRREG),B'10100000'                          0380 00121000
*           /*********************************************************/ 00122000
*           /*                                                       */ 00123000
*           /* ALLOCATE A FSB VIA ISTZDFA0                           */ 00124000
*           /*                                                       */ 00125000
*           /*********************************************************/ 00126000
*                                                                  0381 00127000
*           CALL ISTZDFA0;          /* CALL BFR ALLOCATION   @XL03HDP*/ 00128000
         L     @11,ATCZPSVT(,ATCVTREG)                             0381 00129000
         L     @15,ZPSZDFA0(,@11)                                  0381 00130000
         BALR  @14,@15                                             0381 00131000
*           WORKREG=RPHSRPRM;       /* GET FSB ADDRESS               */ 00132000
         L     WORKREG,RPHSRPRM(,RPHREG)                           0382 00133000
*           WORKREG->ISTFSB=FSBREG->ISTFSB;/* MOVE OLD FSB INTO NEW  */ 00134000
*                                                                  0383 00135000
         MVC   ISTFSB(44,WORKREG),ISTFSB(FSBREG)                   0383 00136000
*           /*********************************************************/ 00137000
*           /*                                                       */ 00138000
*           /* COPY OF VTAM TASKID, CHANGE OF TIP DVT POINTER, AND   */ 00139000
*           /* CLEARING OF ACTIVE FMCB ADDRESS WERE DELETED, @XL03HDP*/ 00140000
*           /* INSERTION OF LCPB & LCCW ADDRESS INTO FSB WERE DELETED*/ 00141000
*           /*                                                       */ 00142000
*           /*********************************************************/ 00143000
*                                                                  0384 00144000
*           WORKREG->FSBLCPB=0;     /* ZERO LCPB AND LCCW .. @XM03HDP*/ 00145000
         SLR   @11,@11                                             0384 00146000
         ST    @11,FSBLCPB(,WORKREG)                               0384 00147000
*           WORKREG->FSBLCCWA=0;    /* ADDRS TELL PORT SOL THIS IS A    00148000
*                                      DISCONNECT CASE       @XM03HDP*/ 00149000
*                                                                  0385 00150000
         ST    @11,FSBLCCWA(,WORKREG)                              0385 00151000
*           /*********************************************************/ 00152000
*           /*                                                       */ 00153000
*           /* COMPLETE FDB PORTION OF FSB FOR PORT SOLICITOR        */ 00154000
*           /*                                               @XL03HDP*/ 00155000
*           /*                                                       */ 00156000
*           /*********************************************************/ 00157000
*                                                                  0386 00158000
*           ADDR(WORKREG->FSBFDB)->FDBDATAA=0;/* ZERO DATA         0386 00159000
*                                      ADDR@XL03HDP                  */ 00160000
         LA    @15,32                                              0386 00161000
         ALR   @15,WORKREG                                         0386 00162000
         ST    @11,FDBDATAA(,@15)                                  0386 00163000
*           ADDR(WORKREG->FSBFDB)->FDBDATCT=0;/* ZERO DATA CNT     0387 00164000
*                                                            @XL03HDP*/ 00165000
         STH   @11,FDBDATCT(,@15)                                  0387 00166000
*           ADDR(WORKREG->FSBFDB)->FDBOFSET=ADDR(FSBFDB)-ADDR(ISTFSB);  00167000
         LA    @11,FSBFDB(,FSBREG)                                 0388 00168000
         SLR   @11,FSBREG                                          0388 00169000
         STH   @11,FDBOFSET(,@15)                                  0388 00170000
*                                   /* FDB OFFSET.           @XM01629*/ 00171000
*                                                                  0389 00172000
*           /*********************************************************/ 00173000
*           /*                                                       */ 00174000
*           /* RESET DEVICE CONNECTED SWITCH DNCZF006 REMOVED        */ 00175000
*           /*                                               @XM10857*/ 00176000
*           /* Q NEW FSB TO PORT SOLICITOR CLIP                      */ 00177000
*           /*                                                       */ 00178000
*           /*********************************************************/ 00179000
*                                                                  0389 00180000
*/*  TPQUE (WORKREG,NCBFMCBP->FMCPAB2) NORM                          */ 00181000
*                                                                  0389 00182000
*           DO;                                                    0389 00183000
*             DCL                                                  0390 00184000
*               GPR00F FIXED(31) REG(00);                          0390 00185000
*             DCL                                                  0391 00186000
*               GPR00P PTR(31) REG(00);                            0391 00187000
*             DCL                                                  0392 00188000
*               GPR04F FIXED(31) REG(04);                          0392 00189000
*             DCL                                                  0393 00190000
*               GPR04P PTR(31) REG(04);                            0393 00191000
*             DCL                                                  0394 00192000
*               GPR05F FIXED(31) REG(05);                          0394 00193000
*             DCL                                                  0395 00194000
*               GPR05P PTR(31) REG(05);                            0395 00195000
*             DCL                                                  0396 00196000
*               GPR15F FIXED(31) REG(15);                          0396 00197000
*             DCL                                                  0397 00198000
*               GPR15P PTR(31) REG(15);                            0397 00199000
*             RFY                                                  0398 00200000
*              (GPR00P,                                            0398 00201000
*               GPR01P,                                            0398 00202000
*               GPR04P,                                            0398 00203000
*               GPR05P,                                            0398 00204000
*               GPR15P) RSTD;                                      0398 00205000
*             DCL                                                  0399 00206000
*               GPR02F FIXED(31) REG(02);                          0399 00207000
*             DCL                                                  0400 00208000
*               GPR02P PTR(31) REG(02);                            0400 00209000
*             DCL                                                  0401 00210000
*               GPR08F FIXED(31) REG(08);                          0401 00211000
*             DCL                                                  0402 00212000
*               GPR08P PTR(31) REG(08);                            0402 00213000
*             GEN REFS(GPR01P) SETS(RPHWORK)                       0403 00214000
*                 (STM GPR02P,GPR08P,RPHWORK(GPR01P));             0403 00215000
         STM GPR02P,GPR08P,RPHWORK(GPR01P)                              00216000
*             GPR00P=0;                                            0404 00217000
         SLR   GPR00P,GPR00P                                       0404 00218000
*             GPR15P=ADDR(NCBFMCBP->FMCPAB2);/* HOLD PAB PTR         */ 00219000
         L     GPR15P,NCBFMCBP(,DNCBREG)                           0405 00220000
         LA    GPR15P,FMCPAB2(,GPR15P)                             0405 00221000
*             GPR04P=WORKREG;       /* WORK ELE PTR                  */ 00222000
         LR    GPR04P,WORKREG                                      0406 00223000
*             GPR05P=GPR15P;        /* PASS PAB PTR                  */ 00224000
         LR    GPR05P,GPR15P                                       0407 00225000
*             CALL ATCLCPTR->ATCAP37->ISTAPC37;                    0408 00226000
         L     @11,ATCLCPTR                                        0408 00227000
         L     @15,ATCAP37(,@11)                                   0408 00228000
         BALR  @14,@15                                             0408 00229000
*             GEN(NOPR  0)                                         0409 00230000
*             NOSETS NOREFS;                                       0409 00231000
         NOPR  0                                                        00232000
*             RFY                                                  0410 00233000
*              (GPR00P,                                            0410 00234000
*               GPR01P,                                            0410 00235000
*               GPR04P,                                            0410 00236000
*               GPR05P,                                            0410 00237000
*               GPR15P) UNRSTD;                                    0410 00238000
*           END;                    /* *** END OF TPQUE GENERATION   */ 00239000
*         END;                      /* DO GRP-BUILD 2ND FSB  @XA07978*/ 00240000
*     END;                          /* END FORMAT FSB        @XM09539*/ 00241000
@RT00374 DS    0H                                                  0414 00242000
*/* TPZRETN                                                          */ 00243000
*                                                                  0414 00244000
*   DO;                                                            0414 00245000
@RT00370 DS    0H                                                  0415 00246000
*     DCL                                                          0415 00247000
*       GPR07F FIXED(31) REG(07);                                  0415 00248000
*     DCL                                                          0416 00249000
*       GPR07P PTR(31) REG(07);                                    0416 00250000
*     RFY                                                          0417 00251000
*      (GPR07P,                                                    0417 00252000
*       GPR14P,                                                    0417 00253000
*       GPR15P) RSTD;                                              0417 00254000
*     GPR13P=ZSAZSVBC;                                             0418 00255000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0418 00256000
*     IF GPR13P=0 THEN                                             0419 00257000
         LTR   GPR13P,GPR13P                                       0419 00258000
         BZ    @RT00419                                            0419 00259000
*       ;                           /* TPDVTS ISTZFARR               */ 00260000
*     ELSE                                                         0421 00261000
*       GPR14P=ZSAZSVRR;                                           0421 00262000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0421 00263000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0422 00264000
@RT00419 DS    0H                                                  0422 00265000
         LM    7,12,ZSAZSVVR+0(13)                                      00266000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0423 00267000
         BR    GPR14P                                                   00268000
*     RFY                                                          0424 00269000
*      (GPR07P,                                                    0424 00270000
*       GPR14P,                                                    0424 00271000
*       GPR15P) UNRSTD;                                            0424 00272000
*   END;                                                           0425 00273000
*                                                                  0425 00274000
*/* END TPZRETN                                                      */ 00275000
*/* TPEPILOG                                                         */ 00276000
*                                                                  0426 00277000
*   GEN(PRINT OFF);                                                0426 00278000
         PRINT OFF                                                      00279000
*   DCL                                                            0427 00280000
*     ISTAPC34 ENTRY BASED(ATCAP34) VALRG(*);/* RESET ROUTINE        */ 00281000
*   DCL                                                            0428 00282000
*     ISTAPC37 ENTRY BASED(ATCAP37) VALRG(*);/* TPQUE ROUTINE        */ 00283000
*   GEN(PRINT ON);                                                 0429 00284000
*                                                                  0429 00285000
         PRINT ON                                                       00286000
*/* END OF TPEPILOG                                                  */ 00287000
*                                                                  0430 00288000
*   END ISTZKFBN                                                   0430 00289000
*                                                                  0430 00290000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00291000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00292000
*                                                                  0430 00293000
*       ;                                                          0430 00294000
@EL00001 DS    0H                                                  0430 00295000
@EF00001 DS    0H                                                  0430 00296000
@ER00001 BR    @14                                                 0430 00297000
@DATA    DS    0H                                                       00298000
@DATD    DSECT                                                          00299000
         DS    0F                                                       00300000
ISTZKFBN CSECT                                                          00301000
         DS    0F                                                       00302000
@CF03552 DC    XL4'00FFFFFF'                                            00303000
@DATD    DSECT                                                          00304000
         DS    0D                                                       00305000
CVTPTR   DS    A                                                        00306000
FSBPTR   DS    A                                                        00307000
LCPBPTR  DS    A                                                        00308000
BDUPTR   DS    A                                                        00309000
BTUPTR   DS    A                                                        00310000
FMCBPTR  DS    A                                                        00311000
DNCBPTR  DS    A                                                        00312000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00313000
@ENDDATD EQU   *                                                        00314000
ISTZKFBN CSECT                                                          00315000
         DS    0F                                                       00316000
@SIZDATD DC    AL1(0)                                                   00317000
         DC    AL3(@ENDDATD-@DATD)                                      00318000
         DS    0D                                                       00319000
@CC03551 DC    C'KCBN'                                                  00320000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00321000
@01      EQU   01                                                       00322000
@02      EQU   02                                                       00323000
@03      EQU   03                                                       00324000
@04      EQU   04                                                       00325000
@05      EQU   05                                                       00326000
@06      EQU   06                                                       00327000
@07      EQU   07                                                       00328000
@08      EQU   08                                                       00329000
@09      EQU   09                                                       00330000
@10      EQU   10                                                       00331000
@11      EQU   11                                                       00332000
@12      EQU   12                                                       00333000
@13      EQU   13                                                       00334000
@14      EQU   14                                                       00335000
@15      EQU   15                                                       00336000
RPHPTR   EQU   @01                                                      00337000
RPHREG   EQU   @01                                                      00338000
ATCVTREG EQU   @02                                                      00339000
R3       EQU   @03                                                      00340000
DNCBREG  EQU   @04                                                      00341000
FMCBREG  EQU   @05                                                      00342000
BFRREG   EQU   @06                                                      00343000
PTRLCP   EQU   @07                                                      00344000
FSBREG   EQU   @08                                                      00345000
ZCRREG   EQU   @09                                                      00346000
WORKREG  EQU   @10                                                      00347000
R12      EQU   @12                                                      00348000
R13      EQU   @13                                                      00349000
GPR01P   EQU   @01                                                      00350000
GPR12P   EQU   @12                                                      00351000
GPR13P   EQU   @13                                                      00352000
GPR14P   EQU   @14                                                      00353000
GPR00P   EQU   @00                                                      00354000
GPR04P   EQU   @04                                                      00355000
GPR05P   EQU   @05                                                      00356000
GPR15P   EQU   @15                                                      00357000
GPR07P   EQU   @07                                                      00358000
GPR00F   EQU   @00                                                      00359000
GPR01F   EQU   @01                                                      00360000
GPR02F   EQU   @02                                                      00361000
GPR02P   EQU   @02                                                      00362000
GPR04F   EQU   @04                                                      00363000
GPR05F   EQU   @05                                                      00364000
GPR07F   EQU   @07                                                      00365000
GPR08F   EQU   @08                                                      00366000
GPR08P   EQU   @08                                                      00367000
GPR12F   EQU   @12                                                      00368000
GPR13F   EQU   @13                                                      00369000
GPR14F   EQU   @14                                                      00370000
GPR15F   EQU   @15                                                      00371000
ATCLCPTR EQU   1032                                                     00372000
CVTMAP   EQU   0                                                        00373000
CVTDAR   EQU   CVTMAP+72                                                00374000
CVTFLGS1 EQU   CVTDAR                                                   00375000
CVTDCB   EQU   CVTMAP+116                                               00376000
CVTIERLC EQU   CVTMAP+144                                               00377000
CVTOPTA  EQU   CVTMAP+182                                               00378000
CVTOPTB  EQU   CVTMAP+183                                               00379000
CVTGTF   EQU   CVTMAP+236                                               00380000
CVTGTFST EQU   CVTGTF                                                   00381000
CVTGTFS  EQU   CVTGTFST                                                 00382000
CVTSTATE EQU   CVTGTFST                                                 00383000
CVTTMODE EQU   CVTGTFST                                                 00384000
CVTFORM  EQU   CVTGTFST                                                 00385000
CVTAQAVT EQU   CVTMAP+240                                               00386000
CVTTCMFG EQU   CVTAQAVT                                                 00387000
CVTVOLM2 EQU   CVTMAP+244                                               00388000
CVTTATA  EQU   CVTVOLM2                                                 00389000
CVTTSKS  EQU   CVTTATA                                                  00390000
CVTVOLF2 EQU   CVTTSKS                                                  00391000
CVTTAT   EQU   CVTTATA+1                                                00392000
CVTATER  EQU   CVTMAP+248                                               00393000
CVTEXT1  EQU   CVTMAP+252                                               00394000
CVTPURG  EQU   CVTMAP+260                                               00395000
CVTQMSG  EQU   CVTMAP+268                                               00396000
CVTDMSR  EQU   CVTMAP+272                                               00397000
CVTERPV  EQU   CVTMAP+316                                               00398000
CVTINTLA EQU   CVTMAP+320                                               00399000
CVTAPF   EQU   CVTMAP+324                                               00400000
CVTEXT2  EQU   CVTMAP+328                                               00401000
CVTHJES  EQU   CVTMAP+332                                               00402000
CVTPGSIA EQU   CVTMAP+348                                               00403000
CVTA1F1  EQU   CVTMAP+356                                               00404000
CVTSYSK  EQU   CVTMAP+357                                               00405000
CVTVOLM1 EQU   CVTMAP+380                                               00406000
CVTVOLF1 EQU   CVTVOLM1                                                 00407000
CVTATMCT EQU   CVTMAP+388                                               00408000
CVTXTNT1 EQU   0                                                        00409000
CVTXTNT2 EQU   0                                                        00410000
CVTDSSV  EQU   CVTXTNT2                                                 00411000
CVTFLGBT EQU   CVTXTNT2+5                                               00412000
CVTQID   EQU   CVTXTNT2+24                                              00413000
CVTSHS   EQU   CVTXTNT2+40                                              00414000
CVTRV400 EQU   CVTXTNT2+52                                              00415000
CVTRV409 EQU   CVTXTNT2+53                                              00416000
CVTATCVT EQU   CVTXTNT2+64                                              00417000
CVTRV429 EQU   CVTXTNT2+84                                              00418000
CVTRV438 EQU   CVTXTNT2+85                                              00419000
CVTRV457 EQU   CVTXTNT2+112                                             00420000
CVTRV466 EQU   CVTXTNT2+113                                             00421000
CVTFIX   EQU   0                                                        00422000
CVTRELNO EQU   CVTFIX+252                                               00423000
ISTFDB   EQU   0                                                        00424000
FDBDATAA EQU   ISTFDB+4                                                 00425000
FDBDATCT EQU   ISTFDB+8                                                 00426000
FDBOFSET EQU   ISTFDB+10                                                00427000
ISTFSB   EQU   0                                                        00428000
FSBFSB   EQU   ISTFSB                                                   00429000
FSBMNRCD EQU   FSBFSB+2                                                 00430000
FSBMNELI EQU   FSBMNRCD                                                 00431000
FSBMNDNU EQU   FSBMNRCD                                                 00432000
FSBSFLGS EQU   FSBFSB+3                                                 00433000
FSBFSBA  EQU   FSBFSB+4                                                 00434000
FSBBTH   EQU   FSBFSB+8                                                 00435000
FSBCID   EQU   FSBBTH                                                   00436000
FSBRQTAG EQU   FSBBTH+4                                                 00437000
FSBSEQID EQU   FSBRQTAG                                                 00438000
FSBFLAGS EQU   FSBSEQID                                                 00439000
FSBSEQ   EQU   FSBSEQID+1                                               00440000
FSBCSWST EQU   FSBBTH+6                                                 00441000
FSBTHFLD EQU   FSBCSWST                                                 00442000
FSBTH1   EQU   FSBTHFLD                                                 00443000
FSBSYSRS EQU   FSBTH1                                                   00444000
FSBTH2   EQU   FSBTHFLD+1                                               00445000
FSBEXTRS EQU   FSBTH2                                                   00446000
FSBXFSTS EQU   FSBEXTRS                                                 00447000
FSBXCODE EQU   FSBEXTRS                                                 00448000
FSBNETRS EQU   FSBFSB+16                                                00449000
FSBSRCAT EQU   FSBNETRS                                                 00450000
FSBMJRCD EQU   FSBSRCAT                                                 00451000
FSBERC   EQU   FSBNETRS+1                                               00452000
FSBFBMI  EQU   FSBERC                                                   00453000
FSBDMGRS EQU   FSBFSB+18                                                00454000
FSBSS1   EQU   FSBDMGRS                                                 00455000
FSBSS2   EQU   FSBDMGRS+1                                               00456000
FSBLCPB  EQU   FSBFSB+20                                                00457000
FSBMSGID EQU   FSBLCPB                                                  00458000
FSBLCCWA EQU   FSBFSB+24                                                00459000
FSBRLSTS EQU   FSBLCCWA                                                 00460000
FSBFDB   EQU   ISTFSB+32                                                00461000
ISTZSAVE EQU   0                                                        00462000
ZSAZSVBC EQU   ISTZSAVE                                                 00463000
ZSAZSVMS EQU   ZSAZSVBC                                                 00464000
ZSAZACTV EQU   ZSAZSVMS                                                 00465000
ZSAZSVFC EQU   ISTZSAVE+4                                               00466000
ZSAZSVRR EQU   ISTZSAVE+8                                               00467000
ZSAZSVVR EQU   ISTZSAVE+12                                              00468000
ZSAZTRAC EQU   ISTZSAVE+36                                              00469000
ISTLCCW  EQU   0                                                        00470000
LCCWOP   EQU   ISTLCCW                                                  00471000
LCCWRWOP EQU   LCCWOP                                                   00472000
LCCWCTL  EQU   LCCWRWOP                                                 00473000
LCCWFLAG EQU   ISTLCCW+1                                                00474000
LCCWLSI  EQU   LCCWFLAG                                                 00475000
ISTLCPB  EQU   0                                                        00476000
LCPREQTG EQU   ISTLCPB+2                                                00477000
LCPFLAGS EQU   LCPREQTG                                                 00478000
LCPZF001 EQU   LCPFLAGS                                                 00479000
LCPZRT02 EQU   LCPZF001                                                 00480000
LCPZF002 EQU   LCPFLAGS                                                 00481000
LCPZRT03 EQU   LCPZF002                                                 00482000
LCPZF003 EQU   LCPFLAGS                                                 00483000
LCPZRT04 EQU   LCPZF003                                                 00484000
LCPZF004 EQU   LCPFLAGS                                                 00485000
LCPZRT05 EQU   LCPZF004                                                 00486000
LCPZRT06 EQU   LCPFLAGS                                                 00487000
LCPZRT07 EQU   LCPFLAGS                                                 00488000
LCPMNRCD EQU   LCPREQTG+1                                               00489000
LCPZRT08 EQU   LCPMNRCD                                                 00490000
LCPZRT09 EQU   LCPMNRCD                                                 00491000
LCPCHAIN EQU   ISTLCPB+4                                                00492000
LCPCHAI1 EQU   LCPCHAIN                                                 00493000
LCPRUCNT EQU   ISTLCPB+8                                                00494000
LCPFLAG2 EQU   ISTLCPB+9                                                00495000
LCPTLBPI EQU   LCPFLAG2                                                 00496000
LCPFID0  EQU   LCPFLAG2                                                 00497000
LCPSEQ   EQU   ISTLCPB+10                                               00498000
LCPCID   EQU   ISTLCPB+16                                               00499000
LCPFDBA  EQU   ISTLCPB+24                                               00500000
LCPFLG1  EQU   ISTLCPB+37                                               00501000
LCPFLCCW EQU   ISTLCPB+40                                               00502000
LCPLCCW  EQU   ISTLCPB+48                                               00503000
LCPPABA  EQU   LCPLCCW+4                                                00504000
LCPRPHA  EQU   LCPPABA                                                  00505000
ISTZCRR  EQU   0                                                        00506000
ZCRCRR   EQU   ISTZCRR                                                  00507000
ZCRFLGS1 EQU   ISTZCRR+12                                               00508000
ZCRFLGS2 EQU   ISTZCRR+13                                               00509000
ZCRSWFLD EQU   ISTZCRR+14                                               00510000
ZCRENDSH EQU   ZCRSWFLD                                                 00511000
ZCRNDLCP EQU   ZCRSWFLD                                                 00512000
ZCRRESET EQU   ZCRSWFLD                                                 00513000
ZCRFLGS3 EQU   ISTZCRR+15                                               00514000
ZCRGENSW EQU   ISTZCRR+16                                               00515000
ZCRPFLGS EQU   ISTZCRR+17                                               00516000
ZCRIBPR  EQU   ISTZCRR+18                                               00517000
ZCRSCPSW EQU   ISTZCRR+19                                               00518000
ZCRPARMS EQU   ISTZCRR+24                                               00519000
ZCRFBPTR EQU   ZCRPARMS                                                 00520000
ZCRDFRDA EQU   ZCRPARMS+10                                              00521000
ZCRPCOD1 EQU   ZCRPARMS+12                                              00522000
ZCRPPG   EQU   ZCRPCOD1                                                 00523000
ZCRPFSB  EQU   ZCRPCOD1                                                 00524000
ZCRPLSBF EQU   ZCRPCOD1                                                 00525000
ZCRPCOD2 EQU   ZCRPARMS+13                                              00526000
ZCRSVRTN EQU   ISTZCRR+56                                               00527000
ZCRWKARA EQU   ISTZCRR+156                                              00528000
ZCRCIDSV EQU   ISTZCRR+192                                              00529000
ZCRAUDIT EQU   ISTZCRR+440                                              00530000
ZCRENTER EQU   ZCRAUDIT+5                                               00531000
ZCREKCBN EQU   ZCRENTER+15                                              00532000
ZCRLCPB  EQU   ISTZCRR+480                                              00533000
ZCRRHRU  EQU   ZCRLCPB                                                  00534000
ISTBDU   EQU   0                                                        00535000
BDUMODIF EQU   ISTBDU+1                                                 00536000
BDUMOD1  EQU   BDUMODIF                                                 00537000
BDUDAF   EQU   ISTBDU+2                                                 00538000
BDUFUNC  EQU   BDUDAF                                                   00539000
BDUCHECK EQU   BDUFUNC                                                  00540000
BDUFLAGS EQU   BDUDAF+1                                                 00541000
ISTLH    EQU   0                                                        00542000
ISTTH    EQU   0                                                        00543000
THFLAG1  EQU   ISTTH                                                    00544000
THFLGA   EQU   THFLAG1                                                  00545000
THMPF    EQU   THFLGA                                                   00546000
THFLGB   EQU   THFLAG1+1                                                00547000
ISTTH2   EQU   0                                                        00548000
TH2FLAG1 EQU   ISTTH2                                                   00549000
TH2MPF   EQU   TH2FLAG1                                                 00550000
ISTBTU   EQU   0                                                        00551000
BTUBTH   EQU   ISTBTU                                                   00552000
BTUFID   EQU   BTUBTH                                                   00553000
BTUREQ   EQU   BTUBTH+6                                                 00554000
BTURQFLG EQU   BTUREQ                                                   00555000
BTURH    EQU   BTUBTH+10                                                00556000
BTUSYSTR EQU   ISTBTU+18                                                00557000
ISTZIBUF EQU   0                                                        00558000
ZIBFSM   EQU   ISTZIBUF+4                                               00559000
ISTRPH   EQU   0                                                        00560000
RPHFLAGS EQU   ISTRPH+2                                                 00561000
RPHAPTYP EQU   RPHFLAGS                                                 00562000
RPHFSTLC EQU   RPHFLAGS                                                 00563000
RPHFLGB  EQU   ISTRPH+3                                                 00564000
RPHRPHA  EQU   ISTRPH+4                                                 00565000
RPHTSKID EQU   ISTRPH+8                                                 00566000
RPHRESMA EQU   ISTRPH+16                                                00567000
RPHWPFLG EQU   RPHRESMA                                                 00568000
RPHWEA   EQU   ISTRPH+24                                                00569000
RPHCSPA  EQU   RPHWEA                                                   00570000
RPHSRPRM EQU   ISTRPH+28                                                00571000
RPHCRR   EQU   ISTRPH+32                                                00572000
RPHPABQA EQU   ISTRPH+36                                                00573000
RPHWORK  EQU   ISTRPH+40                                                00574000
RPHSAVE1 EQU   RPHWORK                                                  00575000
RPHSBITS EQU   RPHSAVE1+1                                               00576000
ISTPFCRR EQU   0                                                        00577000
PFCCRR   EQU   ISTPFCRR                                                 00578000
PFCCRRID EQU   PFCCRR                                                   00579000
PFCCRRLN EQU   PFCCRR+2                                                 00580000
PFCHDR   EQU   ISTPFCRR+4                                               00581000
PFCCRRO  EQU   PFCHDR                                                   00582000
PFCFRRO  EQU   PFCHDR+4                                                 00583000
ISTCFCRR EQU   0                                                        00584000
CFCAUDIT EQU   ISTCFCRR                                                 00585000
CFCNTRD  EQU   CFCAUDIT                                                 00586000
CFCCRT   EQU   CFCAUDIT+1                                               00587000
ISTASCRR EQU   0                                                        00588000
ASCFLAGS EQU   ISTASCRR+16                                              00589000
ASCFLG1  EQU   ASCFLAGS                                                 00590000
ASCFLG2  EQU   ASCFLAGS+2                                               00591000
ASCFLG3  EQU   ASCFLAGS+4                                               00592000
ASCUSRGS EQU   ISTASCRR+28                                              00593000
ISTAPCRR EQU   0                                                        00594000
APCATFLG EQU   ISTAPCRR+16                                              00595000
APCRFLG  EQU   ISTAPCRR+18                                              00596000
APCSAVE  EQU   ISTAPCRR+44                                              00597000
APCCOMF  EQU   ISTAPCRR+116                                             00598000
APCCOMF1 EQU   APCCOMF                                                  00599000
APC31FLG EQU   ISTAPCRR+132                                             00600000
APC52FLG EQU   ISTAPCRR+133                                             00601000
APC53FLG EQU   ISTAPCRR+134                                             00602000
APC54FLG EQU   ISTAPCRR+135                                             00603000
APC57FLG EQU   ISTAPCRR+136                                             00604000
ISTCRA   EQU   0                                                        00605000
CRABASIC EQU   ISTCRA                                                   00606000
CRAHDR   EQU   CRABASIC                                                 00607000
CRACRR   EQU   CRAHDR                                                   00608000
CRALKACT EQU   CRABASIC+8                                               00609000
CRASVC   EQU   ISTCRA+848                                               00610000
CRABUFA  EQU   CRASVC+68                                                00611000
ISTLOK   EQU   0                                                        00612000
LOKCHN   EQU   ISTLOK+1                                                 00613000
LOKCHNG  EQU   LOKCHN                                                   00614000
@NM00030 EQU   LOKCHNG+2                                                00615000
ISTPAB   EQU   0                                                        00616000
PABWQCHN EQU   ISTPAB                                                   00617000
PABWEQA  EQU   PABWQCHN                                                 00618000
PABCHAIN EQU   PABWQCHN+4                                               00619000
PABRPHFG EQU   ISTPAB+12                                                00620000
PABFLAGS EQU   PABRPHFG                                                 00621000
PABERLCK EQU   PABFLAGS                                                 00622000
PABERRLK EQU   PABERLCK                                                 00623000
ISTDEVCH EQU   0                                                        00624000
DEVSHCH  EQU   ISTDEVCH                                                 00625000
DEVCHAR  EQU   DEVSHCH                                                  00626000
DEVTCODE EQU   ISTDEVCH+1                                               00627000
DEVFLAGS EQU   ISTDEVCH+3                                               00628000
DEVFCCTL EQU   DEVFLAGS                                                 00629000
DEVCHAR3 EQU   DEVFLAGS                                                 00630000
ISTPROCD EQU   0                                                        00631000
PROPROC  EQU   ISTPROCD                                                 00632000
PROPROC1 EQU   PROPROC                                                  00633000
PROPROC2 EQU   PROPROC+1                                                00634000
PROPROC3 EQU   PROPROC+2                                                00635000
PROPROC4 EQU   PROPROC+3                                                00636000
PROPROCS EQU   0                                                        00637000
PROSETMS EQU   PROPROCS+1                                               00638000
PROSETM2 EQU   PROSETMS                                                 00639000
PROSETM3 EQU   PROSETMS+1                                               00640000
PROSETM4 EQU   PROSETMS+2                                               00641000
ISTFMCB  EQU   0                                                        00642000
FMCSTAT  EQU   ISTFMCB+28                                               00643000
FMCSTAT1 EQU   ISTFMCB+29                                               00644000
FMCCMDFL EQU   ISTFMCB+31                                               00645000
FMCCMPS1 EQU   ISTFMCB+36                                               00646000
FMCPAB2  EQU   ISTFMCB+80                                               00647000
FMCSIPA  EQU   ISTFMCB+148                                              00648000
FMCNXOSQ EQU   ISTFMCB+152                                              00649000
FMCNXCFM EQU   FMCNXOSQ                                                 00650000
FMCNXOSC EQU   FMCNXOSQ+2                                               00651000
FMCSSTAT EQU   ISTFMCB+159                                              00652000
FMCPACE  EQU   ISTFMCB+160                                              00653000
FMCPACEN EQU   FMCPACE                                                  00654000
FMCPACEM EQU   FMCPACE+1                                                00655000
FMCPACPC EQU   FMCPACE+2                                                00656000
FMCCVAL  EQU   FMCPACE+3                                                00657000
FMCOBCE  EQU   FMCCVAL                                                  00658000
FMCCLEXT EQU   ISTFMCB+164                                              00659000
FMCRPLA  EQU   FMCCLEXT                                                 00660000
FMCFBA   EQU   FMCCLEXT+4                                               00661000
FMCCMPS2 EQU   FMCCLEXT+16                                              00662000
FMCFLGA  EQU   FMCCMPS2                                                 00663000
FMCFLGCL EQU   FMCCMPS2+1                                               00664000
FMCPSCMD EQU   FMCCMPS2+2                                               00665000
FMCPSTAT EQU   FMCCMPS2+3                                               00666000
FMCSTAT2 EQU   ISTFMCB+186                                              00667000
FMCMODEB EQU   ISTFMCB+189                                              00668000
FMCCLSEQ EQU   ISTFMCB+190                                              00669000
FMCRRESP EQU   ISTFMCB+195                                              00670000
FMCSSEGQ EQU   ISTFMCB+200                                              00671000
FMCFBAS  EQU   ISTFMCB+216                                              00672000
FMCZV002 EQU   FMCFBAS                                                  00673000
FMCSNCTL EQU   ISTFMCB+224                                              00674000
FMCSCFLG EQU   FMCSNCTL                                                 00675000
FMCVS1   EQU   ISTFMCB+232                                              00676000
FMCZFLAG EQU   FMCVS1                                                   00677000
FMCZF006 EQU   FMCZFLAG                                                 00678000
FMCLBXM  EQU   FMCVS1+12                                                00679000
FMCSHEAQ EQU   FMCLBXM                                                  00680000
FMCLCPBQ EQU   FMCVS1+16                                                00681000
FMCLCPAQ EQU   FMCVS1+20                                                00682000
FMCSEQ1  EQU   FMCVS1+34                                                00683000
FMCZFLG2 EQU   FMCVS1+35                                                00684000
FMCCVFLG EQU   FMCVS1+44                                                00685000
FMCFLAG  EQU   0                                                        00686000
FMCFLGB  EQU   FMCFLAG                                                  00687000
ISTNCB   EQU   0                                                        00688000
NCBFLAGS EQU   ISTNCB+24                                                00689000
NCBFRAS  EQU   NCBFLAGS+1                                               00690000
NCBFTRIO EQU   NCBFRAS                                                  00691000
NCBFLAG1 EQU   NCBFLAGS+2                                               00692000
NCBFMCBP EQU   ISTNCB+32                                                00693000
ISTDNCB  EQU   0                                                        00694000
DNCOS    EQU   ISTDNCB+56                                               00695000
DNCZFLGS EQU   DNCOS                                                    00696000
DNCBSCED EQU   DNCOS+2                                                  00697000
ISTZPSVT EQU   0                                                        00698000
ZPSZDFA0 EQU   ISTZPSVT                                                 00699000
ISTDYPAB EQU   0                                                        00700000
ISTATCVT EQU   0                                                        00701000
ATCCOM   EQU   ISTATCVT                                                 00702000
ATCSTAT  EQU   ATCCOM                                                   00703000
ATCSTAT1 EQU   ATCSTAT                                                  00704000
ATCSTFLG EQU   ATCSTAT+1                                                00705000
ATCPOFLG EQU   ATCSTAT+2                                                00706000
ATCSTAT4 EQU   ATCSTAT+3                                                00707000
ATCIOTRC EQU   ATCCOM+140                                               00708000
ATCTHTRC EQU   ATCIOTRC                                                 00709000
ATCCSMR  EQU   ISTATCVT+296                                             00710000
ATCSHRFG EQU   ISTATCVT+316                                             00711000
ATCHPGM  EQU   ISTATCVT+384                                             00712000
ATCVLCNT EQU   ISTATCVT+772                                             00713000
ATCSOPD  EQU   ISTATCVT+792                                             00714000
ATCSIPD  EQU   ISTATCVT+800                                             00715000
ATCSECST EQU   ISTATCVT+812                                             00716000
ATCAOSM  EQU   ISTATCVT+912                                             00717000
ATCGSRBQ EQU   ATCAOSM+4                                                00718000
ATCGSRBG EQU   ATCGSRBQ                                                 00719000
ATCAP34  EQU   ATCAOSM+32                                               00720000
ATCZPSVT EQU   ATCAOSM+72                                               00721000
ATCICAPP EQU   ATCAOSM+100                                              00722000
ATCLDAPP EQU   ATCAOSM+120                                              00723000
ATCDAPVT EQU   ATCAOSM+140                                              00724000
ATCAP37  EQU   ATCAOSM+264                                              00725000
ATCVTFLG EQU   ATCAOSM+392                                              00726000
ATCZFLAG EQU   ATCAOSM+588                                              00727000
ISTLSCB  EQU   0                                                        00728000
LSC1WORD EQU   ISTLSCB                                                  00729000
LSCREQTG EQU   LSC1WORD+2                                               00730000
LSCZRT02 EQU   LSCREQTG                                                 00731000
LSCZRT03 EQU   LSCREQTG                                                 00732000
LSCZRT04 EQU   LSCREQTG                                                 00733000
LSCZRT05 EQU   LSCREQTG                                                 00734000
LSCZRT06 EQU   LSCREQTG                                                 00735000
LSCZRT07 EQU   LSCREQTG                                                 00736000
LSCZMNRC EQU   LSCREQTG+1                                               00737000
LSCZRT08 EQU   LSCZMNRC                                                 00738000
LSCZRT09 EQU   LSCZMNRC                                                 00739000
LSCCHAIN EQU   ISTLSCB+4                                                00740000
LSCCHAI1 EQU   LSCCHAIN                                                 00741000
LSCRUCNT EQU   ISTLSCB+8                                                00742000
LSCFLGS  EQU   ISTLSCB+9                                                00743000
LSCSEQ   EQU   ISTLSCB+10                                               00744000
LSCFDBA  EQU   ISTLSCB+24                                               00745000
ISTZDFA0 EQU   0                                                        00746000
ISTAPC37 EQU   0                                                        00747000
ISTAPC34 EQU   0                                                        00748000
ZIBSRB   EQU   0                                                        00749000
CVTS01   EQU   CVTPGSIA                                                 00750000
CVTLPDIA EQU   CVTS01+12                                                00751000
CVTDIRST EQU   CVTLPDIA                                                 00752000
CVTSLIDA EQU   CVTS01+24                                                00753000
CVTCTLFG EQU   CVTS01+50                                                00754000
CVTRV210 EQU   CVTS01+424                                               00755000
CVTRV219 EQU   CVTS01+425                                               00756000
CVTRV228 EQU   CVTS01+426                                               00757000
CVTRV237 EQU   CVTS01+427                                               00758000
CVTMFRTR EQU   CVTS01+452                                               00759000
CVTRV262 EQU   CVTS01+468                                               00760000
CVTRV271 EQU   CVTS01+469                                               00761000
CVTRV280 EQU   CVTS01+470                                               00762000
CVTRV289 EQU   CVTS01+471                                               00763000
CVTGSDA  EQU   CVTS01+600                                               00764000
FSBCOMBN EQU   FSBNETRS                                                 00765000
FSBRHFLD EQU   FSBCOMBN+1                                               00766000
FSBRH3   EQU   FSBRHFLD+2                                               00767000
FSBLDFLG EQU   FSBRH3                                                   00768000
@NM00006 EQU   FSBRQTAG                                                 00769000
LCPZTIE  EQU   LCPCID                                                   00770000
LCPZSNAM EQU   LCPZTIE+8                                                00771000
ZIBDIO   EQU   ZIBFSM                                                   00772000
ZIBCCW2  EQU   ZIBDIO+8                                                 00773000
ZIBCPTCC EQU   ZIBCCW2                                                  00774000
ZIBAIO   EQU   ISTZIBUF                                                 00775000
ZIBAIOCM EQU   ZIBAIO                                                   00776000
ZIBFIB   EQU   ZIBAIO+16                                                00777000
ZIBFSB   EQU   ZIBFIB                                                   00778000
ZIBMDREC EQU   ZIBFSB+4                                                 00779000
ZIBMDRIN EQU   ZIBFSB+28                                                00780000
ZIBBTU   EQU   ZIBFIB+32                                                00781000
@NM00015 EQU   ZIBBTU+12                                                00782000
ZIBFID1  EQU   @NM00015+1                                               00783000
ZIBFITXT EQU   ZIBFID1                                                  00784000
ZIBSIB   EQU   ZIBFIB                                                   00785000
ZIBREC   EQU   ZIBMDRIN                                                 00786000
ZIBRECPL EQU   ZIBREC                                                   00787000
ZIBRECHD EQU   ZIBRECPL                                                 00788000
ZIBRECRS EQU   ZIBREC+8                                                 00789000
ZIBRECDT EQU   ZIBREC+10                                                00790000
ZIBMDRRC EQU   ZIBMDREC                                                 00791000
ZIBRCPL  EQU   ZIBMDRRC                                                 00792000
ZIBRCDT  EQU   ZIBMDRRC+24                                              00793000
@NM00017 EQU   ZIBBTU                                                   00794000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00795000
ZIBTH2   EQU   @NM00017+4                                               00796000
ZIBLH    EQU   @NM00017                                                 00797000
ZIBRCTXT EQU   ZIBMDRRC+36                                              00798000
ZIBRCRID EQU   ZIBRCDT+10                                               00799000
ZIBRCNAM EQU   ZIBRCDT+2                                                00800000
ZIBRCUA  EQU   ZIBRCDT                                                  00801000
ZIBRCPUI EQU   ZIBRCPL+20                                               00802000
ZIBRCPUN EQU   ZIBRCPL+16                                               00803000
ZIBRCTIM EQU   ZIBRCPL+12                                               00804000
ZIBRCDAT EQU   ZIBRCPL+8                                                00805000
ZIBRCRS1 EQU   ZIBRCPL+6                                                00806000
ZIBRCSID EQU   ZIBRCPL+5                                                00807000
ZIBRCID  EQU   ZIBRCPL+4                                                00808000
ZIBRCSW  EQU   ZIBRCPL+2                                                00809000
ZIBRCSYR EQU   ZIBRCPL+1                                                00810000
ZIBRCL   EQU   ZIBRCPL                                                  00811000
ZIBRECTX EQU   ZIBREC+22                                                00812000
ZIBRECID EQU   ZIBRECDT+10                                              00813000
ZIBRECNA EQU   ZIBRECDT+2                                               00814000
ZIBRECUA EQU   ZIBRECDT                                                 00815000
ZIBRECSV EQU   ZIBRECRS                                                 00816000
ZIBRECDA EQU   ZIBRECPL+4                                               00817000
ZIBRECSI EQU   ZIBRECHD+3                                               00818000
ZIBRECDV EQU   ZIBRECHD+2                                               00819000
ZIBRECFL EQU   ZIBRECHD+1                                               00820000
ZIBRECTY EQU   ZIBRECHD                                                 00821000
ZIBTEXT  EQU   ZIBSIB+4                                                 00822000
ZIBRSV04 EQU   ZIBSIB                                                   00823000
ZIBTEXT2 EQU   ZIBFITXT                                                 00824000
ZIBTEXT1 EQU   ZIBFIB+52                                                00825000
@NM00016 EQU   @NM00015                                                 00826000
ZIBFDBS  EQU   ZIBBTU                                                   00827000
@NM00014 EQU   ZIBMDREC                                                 00828000
@NM00013 EQU   ZIBFSB                                                   00829000
ZIBLNG2  EQU   ZIBAIOCM+14                                              00830000
ZIBRSV03 EQU   ZIBAIOCM+13                                              00831000
ZIBWKBYT EQU   ZIBAIOCM+12                                              00832000
ZIBFDBZ  EQU   ZIBAIOCM                                                 00833000
ZIBCPNPK EQU   ZIBCCW2+6                                                00834000
ZIBRSV02 EQU   ZIBCCW2+5                                                00835000
ZIBCPTPF EQU   ZIBCCW2+4                                                00836000
ZIBCPTCA EQU   ZIBCCW2+1                                                00837000
ZIBCPNPC EQU   ZIBCPTCC                                                 00838000
ZIBCPRDK EQU   ZIBDIO+6                                                 00839000
ZIBRSV01 EQU   ZIBDIO+5                                                 00840000
ZIBCPRDF EQU   ZIBDIO+4                                                 00841000
ZIBCPTXA EQU   ZIBDIO+1                                                 00842000
ZIBCPRDC EQU   ZIBDIO                                                   00843000
LCPZTRV4 EQU   LCPZSNAM+4                                               00844000
LCPZTRV1 EQU   LCPZSNAM                                                 00845000
LCPZSNA  EQU   LCPZTIE+4                                                00846000
LCPZFMCA EQU   LCPZTIE                                                  00847000
FSBRT0B  EQU   @NM00006+1                                               00848000
FSBRT0A  EQU   @NM00006+1                                               00849000
FSBRT09  EQU   @NM00006+1                                               00850000
FSBRT08  EQU   @NM00006+1                                               00851000
FSBRT07  EQU   @NM00006                                                 00852000
FSBRT06  EQU   @NM00006                                                 00853000
FSBRT05  EQU   @NM00006                                                 00854000
FSBRT04  EQU   @NM00006                                                 00855000
FSBRT03  EQU   @NM00006                                                 00856000
FSBRT02  EQU   @NM00006                                                 00857000
FSBRT01  EQU   @NM00006                                                 00858000
FSBRT00  EQU   @NM00006                                                 00859000
FSBLDCUF EQU   FSBLDFLG                                                 00860000
FSBLDSIF EQU   FSBLDFLG                                                 00861000
FSBLDSOF EQU   FSBLDFLG                                                 00862000
FSBLDEBF EQU   FSBLDFLG                                                 00863000
FSBLDBBF EQU   FSBLDFLG                                                 00864000
FSBLDFME EQU   FSBLDFLG                                                 00865000
FSBLDSCF EQU   FSBLDFLG                                                 00866000
FSBLDRMF EQU   FSBLDFLG                                                 00867000
FSBRH2   EQU   FSBRHFLD+1                                               00868000
FSBRH1   EQU   FSBRHFLD                                                 00869000
FSBALIGN EQU   FSBCOMBN                                                 00870000
CVTRV628 EQU   CVTS01+728                                               00871000
CVTRV627 EQU   CVTS01+724                                               00872000
CVTRV626 EQU   CVTS01+720                                               00873000
CVTRV625 EQU   CVTS01+716                                               00874000
CVTRV624 EQU   CVTS01+712                                               00875000
CVTRV623 EQU   CVTS01+708                                               00876000
CVTRV622 EQU   CVTS01+704                                               00877000
CVTRV621 EQU   CVTS01+700                                               00878000
CVTRV620 EQU   CVTS01+696                                               00879000
CVTRV619 EQU   CVTS01+692                                               00880000
CVTRV618 EQU   CVTS01+688                                               00881000
CVTRV617 EQU   CVTS01+684                                               00882000
CVTRV616 EQU   CVTS01+680                                               00883000
CVTRV615 EQU   CVTS01+676                                               00884000
CVTRV614 EQU   CVTS01+672                                               00885000
CVTRV613 EQU   CVTS01+668                                               00886000
CVTRV612 EQU   CVTS01+664                                               00887000
CVTRV611 EQU   CVTS01+660                                               00888000
CVTEVERM EQU   CVTS01+656                                               00889000
CVTIRM   EQU   CVTS01+652                                               00890000
CVTCGK   EQU   CVTS01+648                                               00891000
CVTRAC   EQU   CVTS01+644                                               00892000
CVTRV606 EQU   CVTS01+640                                               00893000
CVTRV605 EQU   CVTS01+636                                               00894000
CVTRV604 EQU   CVTS01+632                                               00895000
CVTEFF02 EQU   CVTS01+628                                               00896000
CVTCBBR  EQU   CVTS01+624                                               00897000
CVTSSCR  EQU   CVTS01+620                                               00898000
CVTEVENT EQU   CVTS01+616                                               00899000
CVTCRCA  EQU   CVTS01+612                                               00900000
CVTTPIO  EQU   CVTS01+608                                               00901000
CVTADV   EQU   CVTS01+604                                               00902000
CVTGSDAB EQU   CVTGSDA                                                  00903000
CVTQV3   EQU   CVTS01+596                                               00904000
CVTQV2   EQU   CVTS01+592                                               00905000
CVTQV1   EQU   CVTS01+588                                               00906000
CVTRPT   EQU   CVTS01+584                                               00907000
CVTSSRB  EQU   CVTS01+580                                               00908000
CVTCSDRL EQU   CVTS01+576                                               00909000
CVTEXP1  EQU   CVTS01+572                                               00910000
CVTRMPMT EQU   CVTS01+568                                               00911000
CVTRMPTT EQU   CVTS01+564                                               00912000
CVTVPSA  EQU   CVTS01+560                                               00913000
CVTVSTOP EQU   CVTS01+556                                               00914000
CVTGTFR8 EQU   CVTS01+552                                               00915000
CVTQUIT  EQU   CVTS01+548                                               00916000
CVTVACR  EQU   CVTS01+544                                               00917000
CVTWTCB  EQU   CVTS01+540                                               00918000
CVTSTPRS EQU   CVTS01+536                                               00919000
CVT0PT02 EQU   CVTS01+532                                               00920000
CVTDARCM EQU   CVTS01+528                                               00921000
CVTIRECM EQU   CVTS01+524                                               00922000
CVTJRECM EQU   CVTS01+520                                               00923000
CVTVEMS0 EQU   CVTS01+516                                               00924000
CVTSPFRR EQU   CVTS01+512                                               00925000
CVTRLSTG EQU   CVTS01+508                                               00926000
CVT0TC0A EQU   CVTS01+504                                               00927000
CVTGMBR  EQU   CVTS01+500                                               00928000
CVTLFRM  EQU   CVTS01+496                                               00929000
CVTRMBR  EQU   CVTS01+492                                               00930000
CVTVIOP  EQU   CVTS01+488                                               00931000
CVTRV307 EQU   CVTS01+486                                               00932000
CVTRV306 EQU   CVTS01+484                                               00933000
CVTRV305 EQU   CVTS01+482                                               00934000
CVTRV304 EQU   CVTS01+480                                               00935000
CVTRV303 EQU   CVTS01+478                                               00936000
CVTRV302 EQU   CVTS01+476                                               00937000
CVTTRCA  EQU   CVTS01+472                                               00938000
CVTRV297 EQU   CVTRV289                                                 00939000
CVTRV296 EQU   CVTRV289                                                 00940000
CVTRV295 EQU   CVTRV289                                                 00941000
CVTRV294 EQU   CVTRV289                                                 00942000
CVTRV293 EQU   CVTRV289                                                 00943000
CVTRV292 EQU   CVTRV289                                                 00944000
CVTRV291 EQU   CVTRV289                                                 00945000
CVTRV290 EQU   CVTRV289                                                 00946000
CVTRV288 EQU   CVTRV280                                                 00947000
CVTRV287 EQU   CVTRV280                                                 00948000
CVTRV286 EQU   CVTRV280                                                 00949000
CVTRV285 EQU   CVTRV280                                                 00950000
CVTRV284 EQU   CVTRV280                                                 00951000
CVTRV283 EQU   CVTRV280                                                 00952000
CVTRV282 EQU   CVTRV280                                                 00953000
CVTRV281 EQU   CVTRV280                                                 00954000
CVTRV279 EQU   CVTRV271                                                 00955000
CVTRV278 EQU   CVTRV271                                                 00956000
CVTRV277 EQU   CVTRV271                                                 00957000
CVTRV276 EQU   CVTRV271                                                 00958000
CVTRV275 EQU   CVTRV271                                                 00959000
CVTRV274 EQU   CVTRV271                                                 00960000
CVTRV273 EQU   CVTRV271                                                 00961000
CVTRV272 EQU   CVTRV271                                                 00962000
CVTRV270 EQU   CVTRV262                                                 00963000
CVTRV269 EQU   CVTRV262                                                 00964000
CVTRV268 EQU   CVTRV262                                                 00965000
CVTRV267 EQU   CVTRV262                                                 00966000
CVTRV266 EQU   CVTRV262                                                 00967000
CVTRV265 EQU   CVTRV262                                                 00968000
CVTRV264 EQU   CVTRV262                                                 00969000
CVTRV263 EQU   CVTRV262                                                 00970000
CVTVFP   EQU   CVTS01+464                                               00971000
CVTVSI   EQU   CVTS01+460                                               00972000
CVTVPSIB EQU   CVTS01+456                                               00973000
CVTMFACT EQU   CVTMFRTR                                                 00974000
CVTMFCTL EQU   CVTS01+448                                               00975000
CVTPVBP  EQU   CVTS01+444                                               00976000
CVTPWI   EQU   CVTS01+440                                               00977000
CVTRV254 EQU   CVTS01+438                                               00978000
CVTRV253 EQU   CVTS01+436                                               00979000
CVTRV252 EQU   CVTS01+434                                               00980000
CVTRV251 EQU   CVTS01+433                                               00981000
CVTRV250 EQU   CVTS01+432                                               00982000
CVTRV249 EQU   CVTS01+431                                               00983000
CVTRV248 EQU   CVTS01+430                                               00984000
CVTRV247 EQU   CVTS01+429                                               00985000
CVTRV246 EQU   CVTS01+428                                               00986000
CVTRV245 EQU   CVTRV237                                                 00987000
CVTRV244 EQU   CVTRV237                                                 00988000
CVTRV243 EQU   CVTRV237                                                 00989000
CVTRV242 EQU   CVTRV237                                                 00990000
CVTRV241 EQU   CVTRV237                                                 00991000
CVTRV240 EQU   CVTRV237                                                 00992000
CVTRV239 EQU   CVTRV237                                                 00993000
CVTRV238 EQU   CVTRV237                                                 00994000
CVTRV236 EQU   CVTRV228                                                 00995000
CVTRV235 EQU   CVTRV228                                                 00996000
CVTRV234 EQU   CVTRV228                                                 00997000
CVTRV233 EQU   CVTRV228                                                 00998000
CVTRV232 EQU   CVTRV228                                                 00999000
CVTRV231 EQU   CVTRV228                                                 01000000
CVTRV230 EQU   CVTRV228                                                 01001000
CVTRV229 EQU   CVTRV228                                                 01002000
CVTRV227 EQU   CVTRV219                                                 01003000
CVTRV226 EQU   CVTRV219                                                 01004000
CVTRV225 EQU   CVTRV219                                                 01005000
CVTRV224 EQU   CVTRV219                                                 01006000
CVTRV223 EQU   CVTRV219                                                 01007000
CVTRV222 EQU   CVTRV219                                                 01008000
CVTRV221 EQU   CVTRV219                                                 01009000
CVTRV220 EQU   CVTRV219                                                 01010000
CVTRV218 EQU   CVTRV210                                                 01011000
CVTRV217 EQU   CVTRV210                                                 01012000
CVTRV216 EQU   CVTRV210                                                 01013000
CVTRV215 EQU   CVTRV210                                                 01014000
CVTRV214 EQU   CVTRV210                                                 01015000
CVTRV213 EQU   CVTRV210                                                 01016000
CVTRV212 EQU   CVTRV210                                                 01017000
CVTRV211 EQU   CVTRV210                                                 01018000
CVTLCCAT EQU   CVTS01+420                                               01019000
CVTPCCAT EQU   CVTS01+416                                               01020000
CVTIPCRP EQU   CVTS01+412                                               01021000
CVTIPCRI EQU   CVTS01+408                                               01022000
CVTIPCDS EQU   CVTS01+404                                               01023000
CVTAIDVT EQU   CVTS01+400                                               01024000
CVTSSAP  EQU   CVTS01+396                                               01025000
CVTEHCIR EQU   CVTS01+392                                               01026000
CVTEHDEF EQU   CVTS01+388                                               01027000
CVTDAIR  EQU   CVTS01+384                                               01028000
CVTPERFM EQU   CVTS01+380                                               01029000
CVT044R2 EQU   CVTS01+376                                               01030000
CVTFETCH EQU   CVTS01+372                                               01031000
CVTRSTWD EQU   CVTS01+368                                               01032000
CVTSPOST EQU   CVTS01+364                                               01033000
CVTIOBP  EQU   CVTS01+360                                               01034000
CVTASMVT EQU   CVTS01+356                                               01035000
CVTRECRQ EQU   CVTS01+352                                               01036000
CVTWSAC  EQU   CVTS01+348                                               01037000
CVTRV149 EQU   CVTS01+344                                               01038000
CVTWSAL  EQU   CVTS01+340                                               01039000
CVTSPSA  EQU   CVTS01+336                                               01040000
CVTGLMN  EQU   CVTS01+332                                               01041000
CVTVEAC0 EQU   CVTS01+328                                               01042000
CVT062R1 EQU   CVTS01+324                                               01043000
CVTRPOST EQU   CVTS01+320                                               01044000
CVTDQIQE EQU   CVTS01+316                                               01045000
CVTCSD   EQU   CVTS01+312                                               01046000
CVTLKRMA EQU   CVTS01+308                                               01047000
CVTRSPIE EQU   CVTS01+304                                               01048000
CVTRENQ  EQU   CVTS01+300                                               01049000
CVTLQCB  EQU   CVTS01+296                                               01050000
CVTFQCB  EQU   CVTS01+292                                               01051000
CVTQCS01 EQU   CVTS01+288                                               01052000
CVTAPFT  EQU   CVTS01+284                                               01053000
CVTPARRL EQU   CVTS01+280                                               01054000
CVTVWAIT EQU   CVTS01+276                                               01055000
CVTGSPL  EQU   CVTS01+272                                               01056000
CVTLSMQ  EQU   CVTS01+268                                               01057000
CVTGSMQ  EQU   CVTS01+264                                               01058000
CVTEXPRO EQU   CVTS01+260                                               01059000
CVTOPCTP EQU   CVTS01+256                                               01060000
CVTSIC   EQU   CVTS01+252                                               01061000
CVTTPIOS EQU   CVTS01+248                                               01062000
CVTRTMS  EQU   CVTS01+244                                               01063000
CVTSDBF  EQU   CVTS01+240                                               01064000
CVTSCBP  EQU   CVTS01+236                                               01065000
CVTSDMP  EQU   CVTS01+232                                               01066000
CVTSV60  EQU   CVTS01+228                                               01067000
CVTRTMCT EQU   CVTS01+224                                               01068000
CVTASCBL EQU   CVTS01+220                                               01069000
CVTASCBH EQU   CVTS01+216                                               01070000
CVTGDA   EQU   CVTS01+212                                               01071000
CVTASVT  EQU   CVTS01+208                                               01072000
CVTVVMDI EQU   CVTS01+204                                               01073000
CVTAQTOP EQU   CVTS01+200                                               01074000
CVTIOSCS EQU   CVTS01+196                                               01075000
CVTSDRM  EQU   CVTS01+192                                               01076000
CVTOPTE  EQU   CVTS01+188                                               01077000
CVTSTXU  EQU   CVTS01+184                                               01078000
CVTQUIS  EQU   CVTS01+180                                               01079000
CVTPARS  EQU   CVTS01+176                                               01080000
CVTS1EE  EQU   CVTS01+172                                               01081000
CVTFRAS  EQU   CVTS01+168                                               01082000
CVTQSAS  EQU   CVTS01+164                                               01083000
CVTCRAS  EQU   CVTS01+160                                               01084000
CVTCRMN  EQU   CVTS01+156                                               01085000
CVTDELCP EQU   CVTS01+152                                               01086000
CVTFRECL EQU   CVTS01+148                                               01087000
CVTGETCL EQU   CVTS01+144                                               01088000
CVTBLDCP EQU   CVTS01+140                                               01089000
CVTAUTHL EQU   CVTS01+136                                               01090000
CVTSCAN  EQU   CVTS01+132                                               01091000
CVTRV144 EQU   CVTS01+130                                               01092000
CVTMAXMP EQU   CVTS01+128                                               01093000
CVTSTCK  EQU   CVTS01+124                                               01094000
CVTRV139 EQU   CVTS01+123                                               01095000
CVTDSSAC EQU   CVTS01+122                                               01096000
CVTRV513 EQU   CVTS01+121                                               01097000
CVTIOSPL EQU   CVTS01+120                                               01098000
CVTPTGT  EQU   CVTS01+116                                               01099000
CVTCSPIE EQU   CVTS01+112                                               01100000
CVTSMFEX EQU   CVTS01+108                                               01101000
CVTOLT0A EQU   CVTS01+104                                               01102000
CVTSRBRT EQU   CVTS01+100                                               01103000
CVTPUTL  EQU   CVTS01+96                                                01104000
CVTRV519 EQU   CVTS01+92                                                01105000
CVTRV327 EQU   CVTS01+88                                                01106000
CVTRV326 EQU   CVTS01+84                                                01107000
CVTRV325 EQU   CVTS01+80                                                01108000
CVTRV324 EQU   CVTS01+76                                                01109000
CVT0VL01 EQU   CVTS01+72                                                01110000
CVTSHRVM EQU   CVTS01+68                                                01111000
CVTRV332 EQU   CVTS01+64                                                01112000
CVTTAS   EQU   CVTS01+60                                                01113000
CVTRSCN  EQU   CVTS01+56                                                01114000
CVTTRAC2 EQU   CVTS01+54                                                01115000
CVTTRACE EQU   CVTS01+52                                                01116000
CVTAPG   EQU   CVTS01+51                                                01117000
CVTSDTRC EQU   CVTCTLFG                                                 01118000
CVTGTRCE EQU   CVTCTLFG                                                 01119000
CVTNOMP  EQU   CVTCTLFG                                                 01120000
CVTRSV79 EQU   CVTCTLFG                                                 01121000
CVTDSTAT EQU   CVTCTLFG                                                 01122000
CVTRSV78 EQU   CVTCTLFG                                                 01123000
CVTRV333 EQU   CVTCTLFG                                                 01124000
CVTRV323 EQU   CVTCTLFG                                                 01125000
CVTSPVLK EQU   CVTS01+49                                                01126000
CVTRSV77 EQU   CVTS01+48                                                01127000
CVTRV331 EQU   CVTS01+44                                                01128000
CVTRV330 EQU   CVTS01+40                                                01129000
CVTRV329 EQU   CVTS01+36                                                01130000
CVTRV328 EQU   CVTS01+32                                                01131000
CVTRV322 EQU   CVTS01+28                                                01132000
CVTSLID  EQU   CVTSLIDA+1                                               01133000
CVTSYLK  EQU   CVTSLIDA                                                 01134000
CVTRV321 EQU   CVTS01+20                                                01135000
CVTRV320 EQU   CVTS01+16                                                01136000
CVTLPDIR EQU   CVTLPDIA+1                                               01137000
CVTRSV69 EQU   CVTDIRST                                                 01138000
CVTRSV68 EQU   CVTDIRST                                                 01139000
CVTRSV67 EQU   CVTDIRST                                                 01140000
CVTRSV66 EQU   CVTDIRST                                                 01141000
CVTRSV65 EQU   CVTDIRST                                                 01142000
CVTRSV64 EQU   CVTDIRST                                                 01143000
CVTRSV63 EQU   CVTDIRST                                                 01144000
CVTDICOM EQU   CVTDIRST                                                 01145000
CVTPVTP  EQU   CVTS01+8                                                 01146000
CVTLPDSR EQU   CVTS01+4                                                 01147000
CVTGETL  EQU   CVTS01                                                   01148000
LSCTLBAD EQU   ISTLSCB+28                                               01149000
LSCFDB2  EQU   LSCFDBA+1                                                01150000
LSCFDB1  EQU   LSCFDBA                                                  01151000
LSCLCCWA EQU   ISTLSCB+20                                               01152000
LSCLCPBA EQU   ISTLSCB+16                                               01153000
LSCLCCW1 EQU   ISTLSCB+12                                               01154000
LSCRRCNT EQU   LSCSEQ+1                                                 01155000
LSCRRCCT EQU   LSCSEQ                                                   01156000
LSCATOP  EQU   LSCFLGS                                                  01157000
LSCFREE  EQU   LSCFLGS                                                  01158000
LSCDSTAT EQU   LSCFLGS                                                  01159000
LSCEXRES EQU   LSCFLGS                                                  01160000
LSCZRIMM EQU   LSCFLGS                                                  01161000
LSCRSV01 EQU   LSCFLGS                                                  01162000
LSCSMODE EQU   LSCFLGS                                                  01163000
LSCZMIRC EQU   LSCRUCNT                                                 01164000
LSCCHAI2 EQU   LSCCHAIN+1                                               01165000
LSCCHNG  EQU   LSCCHAI1                                                 01166000
LSCZRTSC EQU   LSCZMNRC                                                 01167000
LSCZRT0B EQU   LSCZMNRC                                                 01168000
LSCZRT0A EQU   LSCZMNRC                                                 01169000
LSCZRTL9 EQU   LSCZRT09                                                 01170000
LSCZRTL8 EQU   LSCZRT08                                                 01171000
LSCZRTL7 EQU   LSCZRT07                                                 01172000
LSCZRTL6 EQU   LSCZRT06                                                 01173000
LSCZRTL5 EQU   LSCZRT05                                                 01174000
LSCZRTL4 EQU   LSCZRT04                                                 01175000
LSCZRTL3 EQU   LSCZRT03                                                 01176000
LSCZRTL2 EQU   LSCZRT02                                                 01177000
LSCZRT01 EQU   LSCREQTG                                                 01178000
LSCZRT00 EQU   LSCREQTG                                                 01179000
LSCLNGTH EQU   LSC1WORD+1                                               01180000
LSCTYPE  EQU   LSC1WORD                                                 01181000
ATCAOS   EQU   ISTATCVT+1552                                            01182000
ATCVIOPM EQU   ATCAOSM+636                                              01183000
ATCTPMMI EQU   ATCAOSM+632                                              01184000
ATCTPMPB EQU   ATCAOSM+600                                              01185000
ATCRPLCT EQU   ATCAOSM+594                                              01186000
ATCCRACT EQU   ATCAOSM+592                                              01187000
ATCSRBCT EQU   ATCAOSM+590                                              01188000
ATCRSV75 EQU   ATCAOSM+589                                              01189000
ATCRSV66 EQU   ATCZFLAG                                                 01190000
ATCZF001 EQU   ATCZFLAG                                                 01191000
ATCTPCP1 EQU   ATCAOSM+584                                              01192000
ATCTPCP0 EQU   ATCAOSM+580                                              01193000
ATCAICTN EQU   ATCAOSM+576                                              01194000
ATCZR01  EQU   ATCAOSM+572                                              01195000
ATCMPLTA EQU   ATCAOSM+568                                              01196000
ATCASCB  EQU   ATCAOSM+564                                              01197000
ATCAP86  EQU   ATCAOSM+560                                              01198000
ATCAP85  EQU   ATCAOSM+556                                              01199000
ATCAP84  EQU   ATCAOSM+552                                              01200000
ATCAP83  EQU   ATCAOSM+548                                              01201000
ATCAP82  EQU   ATCAOSM+544                                              01202000
ATCAP69  EQU   ATCAOSM+540                                              01203000
ATCAP66  EQU   ATCAOSM+536                                              01204000
ATCAP62  EQU   ATCAOSM+532                                              01205000
ATCAPC59 EQU   ATCAOSM+528                                              01206000
ATCAP56  EQU   ATCAOSM+524                                              01207000
ATCAP55  EQU   ATCAOSM+520                                              01208000
ATCRCFY0 EQU   ATCAOSM+516                                              01209000
ATCAP41  EQU   ATCAOSM+512                                              01210000
ATCAPC25 EQU   ATCAOSM+508                                              01211000
ATCAP23  EQU   ATCAOSM+504                                              01212000
ATCTPSPB EQU   ATCAOSM+472                                              01213000
ATCTRMPB EQU   ATCAOSM+440                                              01214000
ATCPSTA  EQU   ATCAOSM+432                                              01215000
ATCSMABF EQU   ATCAOSM+428                                              01216000
ATCSMAPR EQU   ATCAOSM+424                                              01217000
ATCTPWQA EQU   ATCAOSM+420                                              01218000
ATCSMAID EQU   ATCAOSM+416                                              01219000
ATCSMARA EQU   ATCAOSM+412                                              01220000
ATCCACXA EQU   ATCAOSM+408                                              01221000
ATCZLAAB EQU   ATCAOSM+404                                              01222000
ATCATA10 EQU   ATCAOSM+400                                              01223000
ATCHLTCB EQU   ATCAOSM+396                                              01224000
@NM00045 EQU   ATCVTFLG                                                 01225000
ATCVTACT EQU   ATCVTFLG                                                 01226000
ATCRPT40 EQU   ATCAOSM+388                                              01227000
ATCRPT39 EQU   ATCAOSM+384                                              01228000
ATCRPT38 EQU   ATCAOSM+380                                              01229000
ATCRPT37 EQU   ATCAOSM+376                                              01230000
ATCRPT36 EQU   ATCAOSM+372                                              01231000
ATCRPT35 EQU   ATCAOSM+368                                              01232000
ATCRPT34 EQU   ATCAOSM+364                                              01233000
ATCRPT33 EQU   ATCAOSM+360                                              01234000
ATCRPT32 EQU   ATCAOSM+356                                              01235000
ATCRPT31 EQU   ATCAOSM+352                                              01236000
ATCRPT30 EQU   ATCAOSM+348                                              01237000
ATCRPT29 EQU   ATCAOSM+344                                              01238000
ATCRPT28 EQU   ATCAOSM+340                                              01239000
ATCRPT27 EQU   ATCAOSM+336                                              01240000
ATCRPT26 EQU   ATCAOSM+332                                              01241000
ATCRPT25 EQU   ATCAOSM+328                                              01242000
ATCRPT24 EQU   ATCAOSM+324                                              01243000
ATCRPT23 EQU   ATCAOSM+320                                              01244000
ATCRPT22 EQU   ATCAOSM+316                                              01245000
ATCRPT21 EQU   ATCAOSM+312                                              01246000
ATCRPT20 EQU   ATCAOSM+308                                              01247000
ATCRPT19 EQU   ATCAOSM+304                                              01248000
ATCRPT18 EQU   ATCAOSM+300                                              01249000
ATCRPT17 EQU   ATCAOSM+296                                              01250000
ATCRPT16 EQU   ATCAOSM+292                                              01251000
ATCRPT15 EQU   ATCAOSM+288                                              01252000
ATCRPT14 EQU   ATCAOSM+284                                              01253000
ATCRPT13 EQU   ATCAOSM+280                                              01254000
ATCRPT12 EQU   ATCAOSM+276                                              01255000
ATCRPT11 EQU   ATCAOSM+272                                              01256000
ATCAP38  EQU   ATCAOSM+268                                              01257000
ATCZDFJ0 EQU   ATCAOSM+260                                              01258000
ATCAP51  EQU   ATCAOSM+256                                              01259000
ATCZPAB2 EQU   ATCAOSM+224                                              01260000
ATCZPAB1 EQU   ATCAOSM+192                                              01261000
ATCZLFVT EQU   ATCAOSM+188                                              01262000
ATCZLPVT EQU   ATCAOSM+184                                              01263000
ATCZDVTX EQU   ATCAOSM+180                                              01264000
ATCZDVTA EQU   ATCAOSM+176                                              01265000
ATCZDVT9 EQU   ATCAOSM+172                                              01266000
ATCZDVT8 EQU   ATCAOSM+168                                              01267000
ATCZDVT7 EQU   ATCAOSM+164                                              01268000
ATCRSV56 EQU   ATCDAPVT+22                                              01269000
ATCDAPDG EQU   ATCDAPVT+20                                              01270000
ATCDXCEA EQU   ATCDAPVT+16                                              01271000
ATCDCEA  EQU   ATCDAPVT+12                                              01272000
ATCDPCIA EQU   ATCDAPVT+8                                               01273000
ATCDSIOA EQU   ATCDAPVT+4                                               01274000
ATCDEOEA EQU   ATCDAPVT                                                 01275000
ATCZLAEA EQU   ATCLDAPP+16                                              01276000
ATCZLCEA EQU   ATCLDAPP+12                                              01277000
ATCRSV17 EQU   ATCLDAPP+8                                               01278000
ATCSMFRR EQU   ATCLDAPP+4                                               01279000
ATCCDTID EQU   ATCLDAPP                                                 01280000
ATCZAEA  EQU   ATCICAPP+16                                              01281000
ATCZCEA  EQU   ATCICAPP+12                                              01282000
ATCCDTCB EQU   ATCICAPP+8                                               01283000
ATCZSIOA EQU   ATCICAPP+4                                               01284000
ATCCDRPH EQU   ATCICAPP                                                 01285000
ATCAP65  EQU   ATCAOSM+96                                               01286000
ATCZDVT6 EQU   ATCAOSM+92                                               01287000
ATCZDVT4 EQU   ATCAOSM+88                                               01288000
ATCZDVT3 EQU   ATCAOSM+84                                               01289000
ATCZDVT1 EQU   ATCAOSM+80                                               01290000
ATCICNCB EQU   ATCAOSM+76                                               01291000
ATCZFSVT EQU   ATCAOSM+68                                               01292000
ATCAP64  EQU   ATCAOSM+64                                               01293000
ATCAP63  EQU   ATCAOSM+60                                               01294000
ATCAP61  EQU   ATCAOSM+56                                               01295000
ATCAP58  EQU   ATCAOSM+52                                               01296000
ATCAP57  EQU   ATCAOSM+48                                               01297000
ATCAP54  EQU   ATCAOSM+44                                               01298000
ATCAP53  EQU   ATCAOSM+40                                               01299000
ATCAP52  EQU   ATCAOSM+36                                               01300000
ATCAP32  EQU   ATCAOSM+28                                               01301000
ATCAP31  EQU   ATCAOSM+24                                               01302000
ATCAP12  EQU   ATCAOSM+20                                               01303000
ATCAP11  EQU   ATCAOSM+16                                               01304000
ATCCMTCB EQU   ATCAOSM+12                                               01305000
ATCPRPH  EQU   ATCAOSM+8                                                01306000
ATCGSRBF EQU   ATCGSRBG                                                 01307000
ATCSRBRT EQU   ATCAOSM                                                  01308000
ATCRSVBB EQU   ISTATCVT+908                                             01309000
ATCVDLOK EQU   ISTATCVT+904                                             01310000
ATCVFPAB EQU   ISTATCVT+872                                             01311000
ATCVDPAB EQU   ISTATCVT+840                                             01312000
ATCIOECB EQU   ISTATCVT+836                                             01313000
ATCINCW3 EQU   ISTATCVT+832                                             01314000
ATCMODTB EQU   ISTATCVT+828                                             01315000
ATCUSSPT EQU   ISTATCVT+824                                             01316000
ATCSRTAB EQU   ISTATCVT+820                                             01317000
@NM00044 EQU   ISTATCVT+818                                             01318000
ATCNMCTR EQU   ISTATCVT+816                                             01319000
ATCSEC51 EQU   ATCSECST                                                 01320000
ATCSEC40 EQU   ATCSIPD+8                                                01321000
ATCSEC30 EQU   ATCSIPD+4                                                01322000
ATCSEC21 EQU   ATCSIPD                                                  01323000
ATCSEC10 EQU   ATCSOPD+4                                                01324000
ATCSEC01 EQU   ATCSOPD                                                  01325000
ATCPOIA  EQU   ISTATCVT+788                                             01326000
ATCPODVT EQU   ISTATCVT+784                                             01327000
ATCS49XL EQU   ISTATCVT+780                                             01328000
ATCS49XI EQU   ISTATCVT+776                                             01329000
ATCLCLCT EQU   ATCVLCNT+2                                               01330000
ATCRNCNT EQU   ATCVLCNT                                                 01331000
ATCCFEAD EQU   ISTATCVT+768                                             01332000
ATCPTR00 EQU   ISTATCVT+736                                             01333000
ATCRSV10 EQU   ISTATCVT+704                                             01334000
ATCTACB  EQU   ISTATCVT+700                                             01335000
ATCVTINM EQU   ISTATCVT+696                                             01336000
ATCTCLIM EQU   ISTATCVT+692                                             01337000
ATCTCLOM EQU   ISTATCVT+688                                             01338000
ATCVTIPB EQU   ISTATCVT+656                                             01339000
ATCTCIPB EQU   ISTATCVT+624                                             01340000
ATCTIPAB EQU   ISTATCVT+592                                             01341000
ATCOCCCB EQU   ISTATCVT+588                                             01342000
ATCOCCOB EQU   ISTATCVT+584                                             01343000
ATCCDLAD EQU   ISTATCVT+580                                             01344000
ATCCCLAD EQU   ISTATCVT+576                                             01345000
ATCDLRPB EQU   ISTATCVT+544                                             01346000
ATCPGPAB EQU   ISTATCVT+512                                             01347000
ATCVPAB1 EQU   ISTATCVT+480                                             01348000
ATCRSV97 EQU   ISTATCVT+476                                             01349000
ATCRDTLK EQU   ISTATCVT+472                                             01350000
ATCVOCLK EQU   ISTATCVT+468                                             01351000
ATCCDFDN EQU   ISTATCVT+464                                             01352000
ATCCDFIN EQU   ISTATCVT+460                                             01353000
ATCDVTLK EQU   ISTATCVT+456                                             01354000
ATCAP36  EQU   ISTATCVT+452                                             01355000
ATCAP35  EQU   ISTATCVT+448                                             01356000
ATCAP33  EQU   ISTATCVT+444                                             01357000
ATCRSV99 EQU   ISTATCVT+412                                             01358000
ATCLDECB EQU   ISTATCVT+408                                             01359000
ATCLDNCS EQU   ISTATCVT+404                                             01360000
ATCCDPTR EQU   ISTATCVT+400                                             01361000
ATCADEL  EQU   ISTATCVT+396                                             01362000
ATCTODVT EQU   ISTATCVT+392                                             01363000
ATCDEBCH EQU   ISTATCVT+388                                             01364000
ATCHBSIZ EQU   ATCHPGM+2                                                01365000
ATCHBFNO EQU   ATCHPGM                                                  01366000
ATCCRME  EQU   ISTATCVT+380                                             01367000
ATCRVCHS EQU   ISTATCVT+372                                             01368000
ATCECTLP EQU   ISTATCVT+368                                             01369000
ATCZDVTB EQU   ISTATCVT+364                                             01370000
ATCECPRT EQU   ISTATCVT+360                                             01371000
ATCVTLOD EQU   ISTATCVT+356                                             01372000
ATCTRPAB EQU   ISTATCVT+352                                             01373000
ATCMSGM  EQU   ISTATCVT+348                                             01374000
ATCMSGP  EQU   ISTATCVT+344                                             01375000
ATCEPT   EQU   ISTATCVT+340                                             01376000
ATCDVT   EQU   ISTATCVT+336                                             01377000
ATCTRCPT EQU   ISTATCVT+332                                             01378000
ATCDVLOD EQU   ISTATCVT+328                                             01379000
ATCALERT EQU   ISTATCVT+324                                             01380000
ATCEPA   EQU   ISTATCVT+320                                             01381000
ATCSAF   EQU   ISTATCVT+318                                             01382000
ATCXRANG EQU   ISTATCVT+317                                             01383000
ATCLAST  EQU   ATCSHRFG                                                 01384000
ATCSHRTN EQU   ISTATCVT+308                                             01385000
ATCUEP   EQU   ISTATCVT+304                                             01386000
ATCOCRT  EQU   ISTATCVT+300                                             01387000
ATCCSMA  EQU   ATCCSMR                                                  01388000
ATCESC02 EQU   ISTATCVT+292                                             01389000
ATCESC01 EQU   ISTATCVT+288                                             01390000
ATCCDFND EQU   ISTATCVT+284                                             01391000
ATCCDDEL EQU   ISTATCVT+280                                             01392000
ATCCDADD EQU   ISTATCVT+276                                             01393000
ATCMNT   EQU   ISTATCVT+272                                             01394000
ATCRSV16 EQU   ISTATCVT+270                                             01395000
ATCMAXID EQU   ISTATCVT+269                                             01396000
ATCMSGSP EQU   ATCCOM+268                                               01397000
ATCCIDM  EQU   ATCCOM+266                                               01398000
ATCACTRM EQU   ATCCOM+264                                               01399000
ATCNERAP EQU   ATCCOM+260                                               01400000
ATCNESAL EQU   ATCCOM+256                                               01401000
ATCRCC65 EQU   ATCCOM+252                                               01402000
ATCRCC26 EQU   ATCCOM+248                                               01403000
ATCRCC63 EQU   ATCCOM+244                                               01404000
ATCRSV11 EQU   ATCCOM+242                                               01405000
ATCVTMID EQU   ATCCOM+240                                               01406000
ATCAPOST EQU   ATCCOM+236                                               01407000
ATCNERFN EQU   ATCCOM+232                                               01408000
ATCNERNE EQU   ATCCOM+228                                               01409000
ATCNERCV EQU   ATCCOM+224                                               01410000
ATCNERST EQU   ATCCOM+220                                               01411000
ATCDCC61 EQU   ATCCOM+216                                               01412000
ATCDCC60 EQU   ATCCOM+212                                               01413000
ATCSRTDF EQU   ATCCOM+208                                               01414000
ATCSRTAD EQU   ATCCOM+204                                               01415000
ATCFIRA  EQU   ATCCOM+200                                               01416000
ATCSMBQ  EQU   ATCCOM+196                                               01417000
ATCSMRC  EQU   ATCCOM+192                                               01418000
ATCSMRS  EQU   ATCCOM+188                                               01419000
ATCSMQU  EQU   ATCCOM+184                                               01420000
ATCSMRQ  EQU   ATCCOM+180                                               01421000
ATCACDA  EQU   ATCCOM+176                                               01422000
ATCSTMA  EQU   ATCCOM+172                                               01423000
ATCFRSTR EQU   ATCCOM+168                                               01424000
ATCGTSTR EQU   ATCCOM+164                                               01425000
ATCREADA EQU   ATCCOM+160                                               01426000
ATCALOAD EQU   ATCCOM+156                                               01427000
ATCBLDLA EQU   ATCCOM+152                                               01428000
ATCFBRPH EQU   ATCCOM+148                                               01429000
ATCBFTRC EQU   ATCCOM+144                                               01430000
ATCTPBUF EQU   ATCTHTRC                                                 01431000
ATCREMOV EQU   ATCCOM+136                                               01432000
ATCADD   EQU   ATCCOM+132                                               01433000
ATCBPDA  EQU   ATCCOM+128                                               01434000
ATCDVTPT EQU   ATCCOM+124                                               01435000
ATCFEPT  EQU   ATCCOM+120                                               01436000
ATCFDVT  EQU   ATCCOM+116                                               01437000
ATCCONFT EQU   ATCCOM+112                                               01438000
ATCPTCHA EQU   ATCCOM+108                                               01439000
ATCAUTHA EQU   ATCCOM+104                                               01440000
ATCACCTA EQU   ATCCOM+100                                               01441000
ATCRDTH  EQU   ATCCOM+96                                                01442000
ATCFRSCH EQU   ATCCOM+92                                                01443000
ATCFSB   EQU   ATCCOM+88                                                01444000
ATCHLTMS EQU   ATCCOM+84                                                01445000
ATCECPRM EQU   ATCCOM+80                                                01446000
ATCECNET EQU   ATCCOM+76                                                01447000
ATCECOPC EQU   ATCCOM+72                                                01448000
ATCVPARM EQU   ATCCOM+68                                                01449000
ATCECVRQ EQU   ATCCOM+64                                                01450000
ATCECSES EQU   ATCCOM+60                                                01451000
ATCOCHA  EQU   ATCCOM+56                                                01452000
ATCDSPLQ EQU   ATCCOM+52                                                01453000
ATCECDSP EQU   ATCCOM+48                                                01454000
ATCVARYQ EQU   ATCCOM+44                                                01455000
ATCECVRY EQU   ATCCOM+40                                                01456000
ATCHALTQ EQU   ATCCOM+36                                                01457000
ATCECHLT EQU   ATCCOM+32                                                01458000
ATCMODQ  EQU   ATCCOM+28                                                01459000
ATCECMOD EQU   ATCCOM+24                                                01460000
ATCASCHD EQU   ATCCOM+20                                                01461000
ATCSRT   EQU   ATCCOM+16                                                01462000
ATCRDT   EQU   ATCCOM+12                                                01463000
ATCDCFRR EQU   ATCCOM+8                                                 01464000
ATCAPI   EQU   ATCCOM+4                                                 01465000
ATCRSV04 EQU   ATCSTAT4                                                 01466000
ATCNCSD  EQU   ATCSTAT4                                                 01467000
ATCMTST  EQU   ATCSTAT4                                                 01468000
ATCTPRT  EQU   ATCSTAT4                                                 01469000
ATCPRTAT EQU   ATCSTAT4                                                 01470000
@NM00043 EQU   ATCPOFLG                                                 01471000
ATCPOUNS EQU   ATCPOFLG                                                 01472000
ATCHSDMF EQU   ATCSTFLG                                                 01473000
@NM00042 EQU   ATCSTAT1                                                 01474000
ATCINHLT EQU   ATCSTAT1                                                 01475000
ATCNETSL EQU   ATCSTAT1                                                 01476000
ATCQKHLT EQU   ATCSTAT1                                                 01477000
ATCSNHLT EQU   ATCSTAT1                                                 01478000
ATCACTIV EQU   ATCSTAT1                                                 01479000
ATCSTART EQU   ATCSTAT1                                                 01480000
DYPPAB   EQU   ISTDYPAB+16                                              01481000
DYPRSV01 EQU   ISTDYPAB+12                                              01482000
DYPTSKID EQU   ISTDYPAB+8                                               01483000
DYPCHAIN EQU   ISTDYPAB+4                                               01484000
DYPFLGS  EQU   ISTDYPAB+2                                               01485000
DYPLNGTH EQU   ISTDYPAB+1                                               01486000
DYPTYPE  EQU   ISTDYPAB                                                 01487000
ZPSZDFQR EQU   ISTZPSVT+80                                              01488000
ZPSZDFPR EQU   ISTZPSVT+76                                              01489000
ZPSZDFXR EQU   ISTZPSVT+72                                              01490000
ZPSZIF2B EQU   ISTZPSVT+68                                              01491000
ZPSZAF2B EQU   ISTZPSVT+64                                              01492000
ZPSZDFMB EQU   ISTZPSVT+60                                              01493000
ZPSZDFMF EQU   ISTZPSVT+56                                              01494000
ZPSZDFNB EQU   ISTZPSVT+52                                              01495000
@NM00041 EQU   ISTZPSVT+48                                              01496000
ZPSZDFF0 EQU   ISTZPSVT+44                                              01497000
ZPSZTRTT EQU   ISTZPSVT+40                                              01498000
ZPSZBFOB EQU   ISTZPSVT+36                                              01499000
ZPSZBFMB EQU   ISTZPSVT+32                                              01500000
ZPSZBFZ0 EQU   ISTZPSVT+28                                              01501000
ZPSZBFY0 EQU   ISTZPSVT+24                                              01502000
ZPSZDFI0 EQU   ISTZPSVT+20                                              01503000
ZPSZDFB0 EQU   ISTZPSVT+16                                              01504000
ZPSZDFH0 EQU   ISTZPSVT+12                                              01505000
ZPSZDFD0 EQU   ISTZPSVT+8                                               01506000
ZPSZDFC0 EQU   ISTZPSVT+4                                               01507000
DNCZC001 EQU   DNCOS+40                                                 01508000
DNCLOCK  EQU   DNCOS+36                                                 01509000
DNCZV005 EQU   DNCOS+32                                                 01510000
DNCZV004 EQU   DNCOS+28                                                 01511000
DNCZV003 EQU   DNCOS+24                                                 01512000
DNCZV002 EQU   DNCOS+21                                                 01513000
DNCZX001 EQU   DNCOS+20                                                 01514000
DNCZV001 EQU   DNCOS+17                                                 01515000
DNCZX003 EQU   DNCOS+16                                                 01516000
DNCZV000 EQU   DNCOS+12                                                 01517000
DNCSESCQ EQU   DNCOS+8                                                  01518000
DNCSESIQ EQU   DNCOS+4                                                  01519000
DNCACIP  EQU   DNCBSCED+1                                               01520000
DNCLICP  EQU   DNCBSCED                                                 01521000
DNCZF008 EQU   DNCZFLGS+1                                               01522000
DNCZPSRD EQU   DNCZFLGS+1                                               01523000
DNCPSOL  EQU   DNCZFLGS+1                                               01524000
DNCZF007 EQU   DNCZFLGS+1                                               01525000
DNCZF006 EQU   DNCZFLGS+1                                               01526000
DNCZF005 EQU   DNCZFLGS+1                                               01527000
DNCZF004 EQU   DNCZFLGS+1                                               01528000
DNCZF003 EQU   DNCZFLGS                                                 01529000
DNCZF002 EQU   DNCZFLGS                                                 01530000
DNCZRSCH EQU   DNCZFLGS                                                 01531000
DNCDISC  EQU   DNCZFLGS                                                 01532000
DNCCONT  EQU   DNCZFLGS                                                 01533000
DNCINVIT EQU   DNCZFLGS                                                 01534000
DNCSESS  EQU   DNCZFLGS                                                 01535000
DNCZF001 EQU   DNCZFLGS                                                 01536000
DNCMODE  EQU   ISTDNCB+49                                               01537000
DNCBHSET EQU   ISTDNCB+48                                               01538000
DNCNCB   EQU   ISTDNCB                                                  01539000
NCBRSV01 EQU   ISTNCB+46                                                01540000
NCBSWDAF EQU   ISTNCB+44                                                01541000
NCBDEVCH EQU   ISTNCB+36                                                01542000
NCBLTRC  EQU   ISTNCB+30                                                01543000
NCBRVPT1 EQU   ISTNCB+28                                                01544000
NCBNMLLN EQU   NCBFLAGS+3                                               01545000
@NM00040 EQU   NCBFLAG1                                                 01546000
@NM00039 EQU   NCBFLAG1                                                 01547000
NCBTTF   EQU   NCBFLAG1                                                 01548000
NCBRSYNC EQU   NCBFLAG1                                                 01549000
NCBRSTRT EQU   NCBFLAG1                                                 01550000
NCBCONF  EQU   NCBFLAG1                                                 01551000
NCBSNAI  EQU   NCBFLAG1                                                 01552000
NCBFLTIO EQU   NCBFTRIO                                                 01553000
NCBCSTAT EQU   NCBFLAGS                                                 01554000
NCBNCSL  EQU   ISTNCB+22                                                01555000
NCBNCBA  EQU   ISTNCB+20                                                01556000
NCBFMCBA EQU   ISTNCB+16                                                01557000
NCBNSNA  EQU   ISTNCB+12                                                01558000
NCBTSKID EQU   ISTNCB+8                                                 01559000
NCBRDTE  EQU   ISTNCB+4                                                 01560000
NCBDAF   EQU   ISTNCB+2                                                 01561000
NCBLNGTH EQU   ISTNCB+1                                                 01562000
NCBTYPE  EQU   ISTNCB                                                   01563000
FMCFLRSV EQU   FMCFLGB                                                  01564000
FMCFLGA8 EQU   FMCFLGB                                                  01565000
FMCCLRPH EQU   FMCVS1+45                                                01566000
FMCRSV0X EQU   FMCCVFLG                                                 01567000
FMCVYRPH EQU   FMCCVFLG                                                 01568000
FMCZV004 EQU   FMCVS1+40                                                01569000
FMCLOCK2 EQU   FMCVS1+36                                                01570000
@NM00038 EQU   FMCZFLG2                                                 01571000
FMCZF027 EQU   FMCZFLG2                                                 01572000
FMCZF026 EQU   FMCZFLG2                                                 01573000
FMCSEQ1B EQU   FMCSEQ1                                                  01574000
FMCSEQ1T EQU   FMCSEQ1                                                  01575000
FMCZX006 EQU   FMCVS1+33                                                01576000
FMCZX005 EQU   FMCVS1+32                                                01577000
FMCZX004 EQU   FMCVS1+31                                                01578000
FMCZX003 EQU   FMCVS1+30                                                01579000
FMCZX002 EQU   FMCVS1+29                                                01580000
FMCZX001 EQU   FMCVS1+28                                                01581000
FMCZV001 EQU   FMCVS1+24                                                01582000
FMCAWATQ EQU   FMCLCPAQ+1                                               01583000
@NM00037 EQU   FMCLCPAQ                                                 01584000
FMCLCPB2 EQU   FMCLCPBQ+1                                               01585000
FMCLCPB1 EQU   FMCLCPBQ                                                 01586000
FMCASCDQ EQU   FMCSHEAQ+1                                               01587000
@NM00036 EQU   FMCSHEAQ                                                 01588000
FMCSHEDQ EQU   FMCVS1+8                                                 01589000
FMCRSV04 EQU   FMCVS1+6                                                 01590000
FMCZH001 EQU   FMCVS1+4                                                 01591000
FMCZF025 EQU   FMCZFLAG+3                                               01592000
FMCZF024 EQU   FMCZFLAG+3                                               01593000
FMCZF023 EQU   FMCZFLAG+3                                               01594000
FMCZF022 EQU   FMCZFLAG+3                                               01595000
FMCZF021 EQU   FMCZFLAG+3                                               01596000
FMCZF020 EQU   FMCZFLAG+3                                               01597000
FMCZF019 EQU   FMCZFLAG+3                                               01598000
FMCZF018 EQU   FMCZFLAG+3                                               01599000
FMCZF017 EQU   FMCZFLAG+2                                               01600000
FMCZF016 EQU   FMCZFLAG+2                                               01601000
FMCZF015 EQU   FMCZFLAG+2                                               01602000
FMCZF014 EQU   FMCZFLAG+2                                               01603000
FMCZF013 EQU   FMCZFLAG+2                                               01604000
FMCZF012 EQU   FMCZFLAG+2                                               01605000
FMCZF011 EQU   FMCZFLAG+2                                               01606000
FMCZF010 EQU   FMCZFLAG+2                                               01607000
FMCZF00F EQU   FMCZFLAG+1                                               01608000
FMCZF00E EQU   FMCZFLAG+1                                               01609000
FMCZF00D EQU   FMCZFLAG+1                                               01610000
FMCZF00C EQU   FMCZFLAG+1                                               01611000
FMCZF00B EQU   FMCZFLAG+1                                               01612000
FMCRSV10 EQU   FMCZFLAG+1                                               01613000
FMCZF009 EQU   FMCZFLAG+1                                               01614000
FMCZFD06 EQU   FMCZF006+1                                               01615000
FMCZFC06 EQU   FMCZF006                                                 01616000
FMCZFB06 EQU   FMCZF006                                                 01617000
FMCZFA06 EQU   FMCZF006                                                 01618000
FMCZF005 EQU   FMCZFLAG                                                 01619000
FMCZF004 EQU   FMCZFLAG                                                 01620000
FMCZF003 EQU   FMCZFLAG                                                 01621000
FMCZF002 EQU   FMCZFLAG                                                 01622000
FMCZF001 EQU   FMCZFLAG                                                 01623000
FMCFRESA EQU   ISTFMCB+228                                              01624000
FMCSCSQN EQU   FMCSNCTL+2                                               01625000
FMCSCCTL EQU   FMCSNCTL+1                                               01626000
FMCSTCTL EQU   FMCSCFLG                                                 01627000
FMCSCCLO EQU   FMCSCFLG                                                 01628000
FMCAPRO  EQU   FMCSCFLG                                                 01629000
FMCLURO  EQU   FMCSCFLG                                                 01630000
FMCOBSAC EQU   FMCSCFLG                                                 01631000
FMCIBSAC EQU   FMCSCFLG                                                 01632000
FMCFBRE  EQU   ISTFMCB+220                                              01633000
FMCFBXM  EQU   FMCZV002                                                 01634000
FMCASEGQ EQU   ISTFMCB+212                                              01635000
FMCRDTPT EQU   ISTFMCB+208                                              01636000
FMCLOCK  EQU   ISTFMCB+204                                              01637000
FMCSEGD  EQU   FMCSSEGQ                                                 01638000
FMCRSPLM EQU   ISTFMCB+198                                              01639000
FMCPSTRS EQU   ISTFMCB+196                                              01640000
@NM00035 EQU   FMCRRESP                                                 01641000
FMCTSLHA EQU   FMCRRESP                                                 01642000
FMCFRRN  EQU   FMCRRESP                                                 01643000
FMCFME   EQU   FMCRRESP                                                 01644000
FMCFEX   EQU   FMCRRESP                                                 01645000
FMCFPE   EQU   FMCRRESP                                                 01646000
FMCCTLB  EQU   ISTFMCB+194                                              01647000
FMCBSQNO EQU   FMCCLSEQ+2                                               01648000
FMCTSQNO EQU   FMCCLSEQ                                                 01649000
FMCOBPRG EQU   FMCMODEB                                                 01650000
FMCIBPRG EQU   FMCMODEB                                                 01651000
FMCRESOT EQU   FMCMODEB                                                 01652000
FMCRSTSR EQU   FMCMODEB                                                 01653000
FMCLUQ   EQU   FMCMODEB                                                 01654000
FMCAPQ   EQU   FMCMODEB                                                 01655000
FMCCLEAR EQU   FMCMODEB                                                 01656000
FMCHOLD  EQU   FMCMODEB                                                 01657000
FMCIPSEQ EQU   ISTFMCB+188                                              01658000
FMCLUSTR EQU   ISTFMCB+187                                              01659000
FMCRSV87 EQU   FMCSTAT2                                                 01660000
FMCSEQI  EQU   FMCSTAT2                                                 01661000
FMCCPIP  EQU   FMCSTAT2                                                 01662000
FMCALIPR EQU   FMCSTAT2                                                 01663000
FMCIAIO  EQU   FMCSTAT2                                                 01664000
FMCZF00A EQU   FMCSTAT2                                                 01665000
FMCVPIP  EQU   FMCSTAT2                                                 01666000
FMCBHSET EQU   ISTFMCB+185                                              01667000
FMCPRMRC EQU   FMCCLEXT+20                                              01668000
FMCRSV89 EQU   FMCPSTAT                                                 01669000
FMCPCLSD EQU   FMCPSTAT                                                 01670000
FMCDDOCD EQU   FMCPSTAT                                                 01671000
FMCIDVFD EQU   FMCPSTAT                                                 01672000
FMCELKST EQU   FMCPSTAT                                                 01673000
FMCRSV88 EQU   FMCPSCMD                                                 01674000
FMCRDBLK EQU   FMCPSCMD                                                 01675000
FMCDSEOC EQU   FMCPSCMD                                                 01676000
FMCPURGE EQU   FMCPSCMD                                                 01677000
FMCRESTI EQU   FMCPSCMD                                                 01678000
FMCCNTCT EQU   FMCPSCMD                                                 01679000
FMCINVT  EQU   FMCPSCMD                                                 01680000
FMCFLGB7 EQU   FMCFLGCL                                                 01681000
FMCFLGB6 EQU   FMCFLGCL                                                 01682000
FMCFLGB5 EQU   FMCFLGCL                                                 01683000
FMCFLGB4 EQU   FMCFLGCL                                                 01684000
FMCFLGB3 EQU   FMCFLGCL                                                 01685000
FMCFLGB2 EQU   FMCFLGCL                                                 01686000
FMCFLGB1 EQU   FMCFLGCL                                                 01687000
FMCFLGB0 EQU   FMCFLGCL                                                 01688000
FMCFLGA7 EQU   FMCFLGA                                                  01689000
FMCFLGA6 EQU   FMCFLGA                                                  01690000
FMCFLGA5 EQU   FMCFLGA                                                  01691000
FMCFLGA4 EQU   FMCFLGA                                                  01692000
FMCFLGA3 EQU   FMCFLGA                                                  01693000
FMCFLGA2 EQU   FMCFLGA                                                  01694000
FMCFLGA1 EQU   FMCFLGA                                                  01695000
FMCFLGA0 EQU   FMCFLGA                                                  01696000
FMCDCLOK EQU   FMCCLEXT+12                                              01697000
FMCRAFM  EQU   FMCCLEXT+8                                               01698000
FMCFBPTR EQU   FMCFBA+1                                                 01699000
FMCFBRSV EQU   FMCFBA                                                   01700000
FMCRPLPT EQU   FMCRPLA+1                                                01701000
FMCRPLRS EQU   FMCRPLA                                                  01702000
FMCPRCLS EQU   FMCCVAL                                                  01703000
FMCIBCE  EQU   FMCCVAL                                                  01704000
FMCONLY  EQU   FMCOBCE                                                  01705000
FMCLAST  EQU   FMCOBCE                                                  01706000
FMCMIDLE EQU   FMCOBCE                                                  01707000
FMCFIRST EQU   FMCOBCE                                                  01708000
FMCCPCNT EQU   FMCPACPC                                                 01709000
FMCMPCNT EQU   FMCPACEM                                                 01710000
FMCNPCNT EQU   FMCPACEN                                                 01711000
FMCCONF  EQU   FMCSSTAT                                                 01712000
FMCPURCH EQU   FMCSSTAT                                                 01713000
FMCNSALU EQU   FMCSSTAT                                                 01714000
FMCBIP   EQU   FMCSSTAT                                                 01715000
FMCSDTR  EQU   FMCSSTAT                                                 01716000
FMCUIPI  EQU   FMCSSTAT                                                 01717000
FMCCIPI  EQU   FMCSSTAT                                                 01718000
FMCSNBI  EQU   FMCSSTAT                                                 01719000
FMCRVD01 EQU   ISTFMCB+158                                              01720000
FMCISSN  EQU   ISTFMCB+156                                              01721000
FMCOASN  EQU   FMCNXOSC                                                 01722000
FMCOSSN  EQU   FMCNXCFM                                                 01723000
FMCSIP   EQU   FMCSIPA                                                  01724000
FMCEXLST EQU   ISTFMCB+144                                              01725000
FMCPAB5  EQU   ISTFMCB+128                                              01726000
FMCPAB4  EQU   ISTFMCB+112                                              01727000
FMCPAB3  EQU   ISTFMCB+96                                               01728000
FMCPAB1  EQU   ISTFMCB+64                                               01729000
FMCFASYA EQU   ISTFMCB+60                                               01730000
FMCMODE  EQU   ISTFMCB+52                                               01731000
FMCPROCD EQU   ISTFMCB+48                                               01732000
FMCVWT   EQU   ISTFMCB+44                                               01733000
FMCRPLH  EQU   ISTFMCB+40                                               01734000
FMCBUFNB EQU   FMCCMPS1+2                                               01735000
FMCBUFLM EQU   FMCCMPS1                                                 01736000
FMCDEBA  EQU   ISTFMCB+32                                               01737000
@NM00034 EQU   FMCCMDFL                                                 01738000
FMCSNA   EQU   FMCCMDFL                                                 01739000
FMCVSNA  EQU   FMCCMDFL                                                 01740000
FMCCMDR  EQU   FMCCMDFL                                                 01741000
@NM00033 EQU   ISTFMCB+30                                               01742000
@NM00032 EQU   FMCSTAT1                                                 01743000
FMCHPURG EQU   FMCSTAT1                                                 01744000
FMCVSP2  EQU   FMCSTAT1                                                 01745000
FMCVSP1  EQU   FMCSTAT                                                  01746000
FMCLTEAS EQU   FMCSTAT                                                  01747000
FMCZF007 EQU   FMCSTAT                                                  01748000
FMCDEDSC EQU   FMCSTAT                                                  01749000
FMCDEVOF EQU   FMCSTAT                                                  01750000
FMCDAPT  EQU   FMCSTAT                                                  01751000
FMCPRMTE EQU   FMCSTAT                                                  01752000
FMCPRMTR EQU   FMCSTAT                                                  01753000
FMCUSFLD EQU   ISTFMCB+24                                               01754000
FMCFMCBA EQU   ISTFMCB+20                                               01755000
FMCDNCBA EQU   ISTFMCB+16                                               01756000
FMCDVTA  EQU   ISTFMCB+12                                               01757000
FMCTSKID EQU   ISTFMCB+8                                                01758000
FMCNXTCB EQU   ISTFMCB+4                                                01759000
FMCSAF   EQU   ISTFMCB+2                                                01760000
FMCLNGTH EQU   ISTFMCB+1                                                01761000
FMCTYPE  EQU   ISTFMCB                                                  01762000
PROSRDEF EQU   PROSETM4                                                 01763000
PRORSV47 EQU   PROSETM4                                                 01764000
PROSCON  EQU   PROSETM4                                                 01765000
PRORSV46 EQU   PROSETM3                                                 01766000
PROSMONT EQU   PROSETM3                                                 01767000
PRORSV45 EQU   PROSETM3                                                 01768000
PROSNTO  EQU   PROSETM3                                                 01769000
PRORSV44 EQU   PROSETM3                                                 01770000
PRORSV43 EQU   PROSETM2                                                 01771000
PROSNTFL EQU   PROSETM2                                                 01772000
PRORSV42 EQU   PROSETM2                                                 01773000
PRORSV41 EQU   PROPROCS                                                 01774000
PROMODC  EQU   PROPROC4                                                 01775000
PROMODT  EQU   PROPROC4                                                 01776000
PROMODM  EQU   PROPROC4                                                 01777000
PROMODB  EQU   PROPROC4                                                 01778000
PRORSV14 EQU   PROPROC4                                                 01779000
PRORSV13 EQU   PROPROC4                                                 01780000
PRORSV12 EQU   PROPROC4                                                 01781000
PROEIB   EQU   PROPROC4                                                 01782000
PRORSV11 EQU   PROPROC3                                                 01783000
PROMONT2 EQU   PROPROC3                                                 01784000
PROMONIT EQU   PROPROC3                                                 01785000
PROSUBLK EQU   PROPROC3                                                 01786000
PRONTO   EQU   PROPROC3                                                 01787000
PROLGIN  EQU   PROPROC3                                                 01788000
PROERPI  EQU   PROPROC3                                                 01789000
PRORSV07 EQU   PROPROC3                                                 01790000
PROCFTX  EQU   PROPROC2                                                 01791000
PROEMLC  EQU   PROPROC2                                                 01792000
PRONTFL  EQU   PROPROC2                                                 01793000
PRORSV05 EQU   PROPROC2                                                 01794000
PRORSV04 EQU   PROPROC2                                                 01795000
PROLGOT  EQU   PROPROC2                                                 01796000
PROERPO  EQU   PROPROC2                                                 01797000
PRORSV03 EQU   PROPROC2                                                 01798000
PRORPLC  EQU   PROPROC1                                                 01799000
PROCS    EQU   PROPROC1                                                 01800000
PROCA    EQU   PROPROC1                                                 01801000
PRORESPX EQU   PROPROC1                                                 01802000
PRODFASY EQU   PROPROC1                                                 01803000
PROXPOPT EQU   PROPROC1                                                 01804000
PROTRUNC EQU   PROPROC1                                                 01805000
PROASYIP EQU   PROPROC1                                                 01806000
DEVRSV03 EQU   ISTDEVCH+5                                               01807000
DEVPHYSA EQU   ISTDEVCH+4                                               01808000
DEVCSLPN EQU   DEVCHAR3                                                 01809000
DEVCSTCL EQU   DEVCHAR3                                                 01810000
DEVCCHEK EQU   DEVCHAR3                                                 01811000
DEVCATTN EQU   DEVCHAR3                                                 01812000
DEVCSWL  EQU   DEVFCCTL                                                 01813000
DEVCRVB  EQU   DEVFCCTL                                                 01814000
DEVCSSL  EQU   DEVFCCTL                                                 01815000
DEVCBSC  EQU   DEVFCCTL                                                 01816000
DEVMCODE EQU   ISTDEVCH+2                                               01817000
DEVCHAR2 EQU   DEVTCODE                                                 01818000
DEVRSV01 EQU   DEVCHAR                                                  01819000
DEVCCTL  EQU   DEVCHAR                                                  01820000
DEVNNSPT EQU   DEVCHAR                                                  01821000
DEVSPS   EQU   DEVCHAR                                                  01822000
DEVSUBND EQU   DEVCHAR                                                  01823000
DEVCONVR EQU   DEVCHAR                                                  01824000
DEVOTPUT EQU   DEVCHAR                                                  01825000
DEVINPUT EQU   DEVCHAR                                                  01826000
PABRPHA  EQU   PABRPHFG+1                                               01827000
PABNODQ  EQU   PABFLAGS                                                 01828000
PABINHBT EQU   PABFLAGS                                                 01829000
PABERLOK EQU   PABERRLK                                                 01830000
PABSSN   EQU   PABFLAGS                                                 01831000
PABDYNAM EQU   PABFLAGS                                                 01832000
PABNORPR EQU   PABFLAGS                                                 01833000
PABPRIOR EQU   PABFLAGS                                                 01834000
PABAPYP  EQU   PABFLAGS                                                 01835000
PABDVTA  EQU   ISTPAB+9                                                 01836000
PABOFFST EQU   ISTPAB+8                                                 01837000
PABCHNGP EQU   PABCHAIN+1                                               01838000
PABRSV02 EQU   PABCHAIN                                                 01839000
PABRUNNG EQU   PABCHAIN                                                 01840000
PABRESET EQU   PABCHAIN                                                 01841000
PABUNCON EQU   PABCHAIN                                                 01842000
PABCDP   EQU   PABCHAIN                                                 01843000
PABRESCH EQU   PABCHAIN                                                 01844000
PABCHNG  EQU   PABCHAIN                                                 01845000
PABWEQP  EQU   PABWEQA+1                                                01846000
PABRSV01 EQU   PABWEQA                                                  01847000
PABWEQG  EQU   PABWEQA                                                  01848000
LOKXCL   EQU   @NM00030                                                 01849000
LOKPRY   EQU   @NM00030                                                 01850000
@NM00031 EQU   @NM00030                                                 01851000
@NM00029 EQU   LOKCHNG                                                  01852000
LOKCT    EQU   ISTLOK                                                   01853000
CRACHAIN EQU   ISTCRA+928                                               01854000
CRARSV02 EQU   ISTCRA+924                                               01855000
CRARSV01 EQU   ISTCRA+920                                               01856000
CRABFTBA EQU   CRABUFA                                                  01857000
CRAMASK  EQU   CRASVC+64                                                01858000
CRAHSIZ  EQU   CRASVC+60                                                01859000
CRAASCRR EQU   CRASVC                                                   01860000
CRAPROCR EQU   ISTCRA+312                                               01861000
CRAPSS   EQU   ISTCRA+160                                               01862000
CRARPH   EQU   ISTCRA+52                                                01863000
CRALAPTR EQU   CRABASIC+48                                              01864000
CRAL9PTR EQU   CRABASIC+44                                              01865000
CRAL8PTR EQU   CRABASIC+40                                              01866000
CRAL7PTR EQU   CRABASIC+36                                              01867000
CRAL6PTR EQU   CRABASIC+32                                              01868000
CRAL5PTR EQU   CRABASIC+28                                              01869000
CRAL4PTR EQU   CRABASIC+24                                              01870000
CRAL3PTR EQU   CRABASIC+20                                              01871000
CRAL2PTR EQU   CRABASIC+16                                              01872000
CRAL1PTR EQU   CRABASIC+12                                              01873000
CRALEV01 EQU   CRALKACT+3                                               01874000
CRALEV02 EQU   CRALKACT+3                                               01875000
CRALEV03 EQU   CRALKACT+3                                               01876000
CRALEV04 EQU   CRALKACT+3                                               01877000
CRALEV05 EQU   CRALKACT+3                                               01878000
CRALEV06 EQU   CRALKACT+3                                               01879000
CRALEV07 EQU   CRALKACT+3                                               01880000
CRALEV08 EQU   CRALKACT+3                                               01881000
CRALEV09 EQU   CRALKACT+2                                               01882000
CRALEV10 EQU   CRALKACT+2                                               01883000
CRALEV11 EQU   CRALKACT+2                                               01884000
CRALEV12 EQU   CRALKACT+2                                               01885000
CRALEV13 EQU   CRALKACT+2                                               01886000
CRALEV14 EQU   CRALKACT+2                                               01887000
CRALEV15 EQU   CRALKACT+2                                               01888000
CRALEV16 EQU   CRALKACT+2                                               01889000
CRALEV17 EQU   CRALKACT+1                                               01890000
CRALEV18 EQU   CRALKACT+1                                               01891000
CRALEV19 EQU   CRALKACT+1                                               01892000
CRALEV20 EQU   CRALKACT+1                                               01893000
CRALEV21 EQU   CRALKACT+1                                               01894000
CRALEV22 EQU   CRALKACT+1                                               01895000
CRALEV23 EQU   CRALKACT+1                                               01896000
CRALEV24 EQU   CRALKACT+1                                               01897000
CRALEV25 EQU   CRALKACT                                                 01898000
CRALEV26 EQU   CRALKACT                                                 01899000
CRALEV27 EQU   CRALKACT                                                 01900000
CRALEV28 EQU   CRALKACT                                                 01901000
CRALEV29 EQU   CRALKACT                                                 01902000
CRALEV30 EQU   CRALKACT                                                 01903000
CRALEV31 EQU   CRALKACT                                                 01904000
CRALEV32 EQU   CRALKACT                                                 01905000
CRAFRR   EQU   CRAHDR+4                                                 01906000
@NM00028 EQU   ISTAPCRR+137                                             01907000
@NM00027 EQU   APC57FLG                                                 01908000
APCNREL  EQU   APC57FLG                                                 01909000
APCRECRA EQU   APC57FLG                                                 01910000
@NM00026 EQU   APC54FLG                                                 01911000
APCRLST  EQU   APC54FLG                                                 01912000
APCPR153 EQU   APC53FLG                                                 01913000
@NM00025 EQU   APC52FLG                                                 01914000
APCWKF   EQU   APC52FLG                                                 01915000
APCNWF   EQU   APC52FLG                                                 01916000
APCRDQ   EQU   APC52FLG                                                 01917000
APCQENQ  EQU   APC52FLG                                                 01918000
APCSMSR  EQU   APC52FLG                                                 01919000
APCCKRQ  EQU   APC52FLG                                                 01920000
@NM00024 EQU   APC31FLG                                                 01921000
APCSORT  EQU   APC31FLG                                                 01922000
APCRESCH EQU   APC31FLG                                                 01923000
APCTPXIT EQU   APC31FLG                                                 01924000
APCSWTWD EQU   ISTAPCRR+128                                             01925000
APCSAV2  EQU   ISTAPCRR+124                                             01926000
APCSAV1  EQU   ISTAPCRR+120                                             01927000
APCRETCD EQU   APCCOMF+2                                                01928000
@NM00023 EQU   APCCOMF1+1                                               01929000
APCZLBER EQU   APCCOMF1                                                 01930000
APCEXIT  EQU   APCCOMF1                                                 01931000
APCRELR  EQU   APCCOMF1                                                 01932000
APCIRB2  EQU   APCCOMF1                                                 01933000
APCIRB1  EQU   APCCOMF1                                                 01934000
APCSMCR  EQU   APCCOMF1                                                 01935000
APCUETSK EQU   APCCOMF1                                                 01936000
APCSSTSK EQU   APCCOMF1                                                 01937000
APCESTAL EQU   APCSAVE                                                  01938000
APCFRRPM EQU   ISTAPCRR+40                                              01939000
APCQWFO  EQU   ISTAPCRR+36                                              01940000
APCPABSV EQU   ISTAPCRR+32                                              01941000
APCRTRN  EQU   ISTAPCRR+28                                              01942000
APCTCBA  EQU   ISTAPCRR+24                                              01943000
APCPSTA  EQU   ISTAPCRR+20                                              01944000
@NM00022 EQU   APCRFLG+1                                                01945000
APC31R   EQU   APCRFLG                                                  01946000
APC58R   EQU   APCRFLG                                                  01947000
APC57R   EQU   APCRFLG                                                  01948000
APC56R   EQU   APCRFLG                                                  01949000
APC54R   EQU   APCRFLG                                                  01950000
APC53R   EQU   APCRFLG                                                  01951000
APC52R   EQU   APCRFLG                                                  01952000
APC51R   EQU   APCRFLG                                                  01953000
@NM00021 EQU   APCATFLG+1                                               01954000
APC31E   EQU   APCATFLG                                                 01955000
APC58E   EQU   APCATFLG                                                 01956000
APC57E   EQU   APCATFLG                                                 01957000
APC56E   EQU   APCATFLG                                                 01958000
APC54E   EQU   APCATFLG                                                 01959000
APC53E   EQU   APCATFLG                                                 01960000
APC52E   EQU   APCATFLG                                                 01961000
APC51E   EQU   APCATFLG                                                 01962000
APCHDRSV EQU   ISTAPCRR                                                 01963000
ASCPSREG EQU   ISTASCRR+44                                              01964000
ASCUSR01 EQU   ASCUSRGS+12                                              01965000
ASCUSR00 EQU   ASCUSRGS+8                                               01966000
ASCUSR15 EQU   ASCUSRGS+4                                               01967000
ASCUSR14 EQU   ASCUSRGS                                                 01968000
ASCETRYA EQU   ISTASCRR+24                                              01969000
ASCKEY   EQU   ISTASCRR+23                                              01970000
ASCAUDIT EQU   ASCFLG3                                                  01971000
ASCFBDUD EQU   ASCFLG3                                                  01972000
ASCLLKF  EQU   ASCFLG3                                                  01973000
ASCKEYF  EQU   ASCFLG3                                                  01974000
ASCFBDAL EQU   ASCFLG3                                                  01975000
ASCFSRGT EQU   ASCFLG3                                                  01976000
ASCICR   EQU   ASCFLG2                                                  01977000
ASCFSRIC EQU   ASCFLG2                                                  01978000
ASCFBDIC EQU   ASCFLG2                                                  01979000
ASCFBAIC EQU   ASCFLG2                                                  01980000
ASCPASTR EQU   ASCFLG1                                                  01981000
ASCFSR   EQU   ASCFLG1                                                  01982000
ASCFBD   EQU   ASCFLG1                                                  01983000
ASCFBA   EQU   ASCFLG1                                                  01984000
ASCPFCRR EQU   ISTASCRR                                                 01985000
CCFRSVD1 EQU   CFCCRT                                                   01986000
CCFCR2   EQU   CFCCRT                                                   01987000
CCFCRP   EQU   CFCCRT                                                   01988000
CCFCR1   EQU   CFCCRT                                                   01989000
CCFCS2   EQU   CFCCRT                                                   01990000
CCFCS1   EQU   CFCCRT                                                   01991000
NCFRSVD  EQU   CFCNTRD                                                  01992000
NCFCR2   EQU   CFCNTRD                                                  01993000
NCFCRP   EQU   CFCNTRD                                                  01994000
NCFCR1   EQU   CFCNTRD                                                  01995000
NCFCS2   EQU   CFCNTRD                                                  01996000
NCFCS1   EQU   CFCNTRD                                                  01997000
PFCRSV01 EQU   ISTPFCRR+13                                              01998000
PFCFTA   EQU   ISTPFCRR+12                                              01999000
CRRFRR   EQU   PFCFRRO                                                  02000000
CRRCHAIN EQU   PFCCRRO                                                  02001000
CRRLEN   EQU   PFCCRRLN                                                 02002000
PFCRSV10 EQU   PFCCRR+1                                                 02003000
CRRID    EQU   PFCCRRID                                                 02004000
RPHNEXPO EQU   ISTRPH+104                                               02005000
RPHSAV16 EQU   RPHWORK+60                                               02006000
RPHSAV15 EQU   RPHWORK+56                                               02007000
RPHSAV14 EQU   RPHWORK+52                                               02008000
RPHSAV13 EQU   RPHWORK+48                                               02009000
RPHSAV12 EQU   RPHWORK+44                                               02010000
RPHSAV11 EQU   RPHWORK+40                                               02011000
RPHSAV10 EQU   RPHWORK+36                                               02012000
RPHSAVE9 EQU   RPHWORK+32                                               02013000
RPHSAVE8 EQU   RPHWORK+28                                               02014000
RPHSAVE7 EQU   RPHWORK+24                                               02015000
RPHSAVE6 EQU   RPHWORK+20                                               02016000
RPHSAVE5 EQU   RPHWORK+16                                               02017000
RPHSAVE4 EQU   RPHWORK+12                                               02018000
RPHSAVE3 EQU   RPHWORK+8                                                02019000
RPHSAVE2 EQU   RPHWORK+4                                                02020000
RPHSHALF EQU   RPHSAVE1+2                                               02021000
RPHSBIT8 EQU   RPHSBITS                                                 02022000
RPHSBIT7 EQU   RPHSBITS                                                 02023000
RPHSBIT6 EQU   RPHSBITS                                                 02024000
RPHSBIT5 EQU   RPHSBITS                                                 02025000
RPHSBIT4 EQU   RPHSBITS                                                 02026000
RPHSBIT3 EQU   RPHSBITS                                                 02027000
RPHSBIT2 EQU   RPHSBITS                                                 02028000
RPHSBIT1 EQU   RPHSBITS                                                 02029000
RPHSBYTE EQU   RPHSAVE1                                                 02030000
RPHPABQP EQU   RPHPABQA+1                                               02031000
RPHPABFG EQU   RPHPABQA                                                 02032000
RPHSRP34 EQU   RPHSRPRM+2                                               02033000
RPHSRP12 EQU   RPHSRPRM                                                 02034000
RPHWEGT  EQU   RPHCSPA                                                  02035000
RPHMAJCB EQU   ISTRPH+21                                                02036000
RPHPABOF EQU   ISTRPH+20                                                02037000
RPHRESUM EQU   RPHRESMA+1                                               02038000
RPHRSV01 EQU   RPHWPFLG                                                 02039000
RPHPURGE EQU   RPHWPFLG                                                 02040000
RPHPT    EQU   RPHWPFLG                                                 02041000
RPHWT    EQU   RPHWPFLG                                                 02042000
RPHRSKEY EQU   RPHWPFLG                                                 02043000
RPHDVTA  EQU   ISTRPH+12                                                02044000
RPHTIK   EQU   RPHTSKID+3                                               02045000
@NM00020 EQU   RPHTSKID                                                 02046000
RPHRPHAP EQU   RPHRPHA+1                                                02047000
@NM00019 EQU   RPHRPHA                                                  02048000
RPHGATE  EQU   RPHRPHA                                                  02049000
@NM00018 EQU   RPHFLGB                                                  02050000
RPHRLCRA EQU   RPHFLGB                                                  02051000
RPHNRSAV EQU   RPHFLGB                                                  02052000
RPHPGCMP EQU   RPHFLGB                                                  02053000
RPHFBAPS EQU   RPHFLGB                                                  02054000
RPHBSSP  EQU   RPHFLGB                                                  02055000
RPHLOCK  EQU   RPHFLGB                                                  02056000
RPHFNFLG EQU   RPHFSTLC                                                 02057000
RPHMLTCP EQU   RPHFLAGS                                                 02058000
RPHSMCLR EQU   RPHFLAGS                                                 02059000
RPHSMTYP EQU   RPHFLAGS                                                 02060000
RPHSMQ   EQU   RPHFLAGS                                                 02061000
RPHAUTEX EQU   RPHAPTYP                                                 02062000
RPHSPGIN EQU   RPHFLAGS                                                 02063000
RPHOGIND EQU   RPHFLAGS                                                 02064000
RPHLNGTH EQU   ISTRPH+1                                                 02065000
RPHTYPE  EQU   ISTRPH                                                   02066000
ZIBLNG1  EQU   ZIBFSM                                                   02067000
ZIBCHAIN EQU   ISTZIBUF                                                 02068000
BTUTEXT  EQU   ISTBTU+20                                                02069000
BTUEXTR  EQU   ISTBTU+19                                                02070000
BTURSV02 EQU   BTUSYSTR                                                 02071000
BTUPHASE EQU   BTUSYSTR                                                 02072000
BTURSV01 EQU   BTUSYSTR                                                 02073000
BTUBDU   EQU   ISTBTU+14                                                02074000
BTUPAD   EQU   BTURH+3                                                  02075000
BTURH3   EQU   BTURH+2                                                  02076000
BTURH2   EQU   BTURH+1                                                  02077000
BTURH1   EQU   BTURH                                                    02078000
BTUDCF   EQU   BTUBTH+8                                                 02079000
BTUZRTSC EQU   BTURQFLG+1                                               02080000
BTUZRT0B EQU   BTURQFLG+1                                               02081000
BTUZRT0A EQU   BTURQFLG+1                                               02082000
BTUZRT09 EQU   BTURQFLG+1                                               02083000
BTUZRT08 EQU   BTURQFLG+1                                               02084000
BTUZRT07 EQU   BTURQFLG                                                 02085000
BTUZRT06 EQU   BTURQFLG                                                 02086000
BTUZRT05 EQU   BTURQFLG                                                 02087000
BTUZRT04 EQU   BTURQFLG                                                 02088000
BTUZRT03 EQU   BTURQFLG                                                 02089000
BTUZRT02 EQU   BTURQFLG                                                 02090000
BTUZRT01 EQU   BTURQFLG                                                 02091000
BTUZRT00 EQU   BTURQFLG                                                 02092000
BTUSORCE EQU   BTUBTH+4                                                 02093000
BTUDEST  EQU   BTUBTH+2                                                 02094000
BTUCDF   EQU   BTUFID+1                                                 02095000
BTUSCF   EQU   BTUFID+1                                                 02096000
BTUPRY   EQU   BTUFID+1                                                 02097000
BTUASFL  EQU   BTUFID                                                   02098000
BTUPSFL  EQU   BTUFID                                                   02099000
BTUMPF   EQU   BTUFID                                                   02100000
BTUFIDNO EQU   BTUFID                                                   02101000
TH2SNF   EQU   ISTTH2+4                                                 02102000
TH2OAF   EQU   ISTTH2+3                                                 02103000
TH2DAF   EQU   ISTTH2+2                                                 02104000
TH2CDF   EQU   TH2FLAG1+1                                               02105000
TH2SEF   EQU   TH2FLAG1+1                                               02106000
TH2PYF   EQU   TH2FLAG1+1                                               02107000
TH2AFI   EQU   TH2FLAG1                                                 02108000
TH2PSI   EQU   TH2FLAG1                                                 02109000
TH2CMPLI EQU   TH2MPF                                                   02110000
TH2RHI   EQU   TH2MPF                                                   02111000
TH2FID   EQU   TH2FLAG1                                                 02112000
THDCF    EQU   ISTTH+8                                                  02113000
THSNF    EQU   ISTTH+6                                                  02114000
THOAF    EQU   ISTTH+4                                                  02115000
THDAF    EQU   ISTTH+2                                                  02116000
THCDF    EQU   THFLGB                                                   02117000
THSEF    EQU   THFLGB                                                   02118000
THPYF    EQU   THFLGB                                                   02119000
THAFI    EQU   THFLGA                                                   02120000
THPSI    EQU   THFLGA                                                   02121000
THCMPLI  EQU   THMPF                                                    02122000
THRHI    EQU   THMPF                                                    02123000
THFID    EQU   THFLAG1                                                  02124000
LHVDATA  EQU   ISTLH+4                                                  02125000
LHFUNCT  EQU   ISTLH+3                                                  02126000
@NM00012 EQU   ISTLH+2                                                  02127000
LHLEN    EQU   ISTLH                                                    02128000
BDURSV04 EQU   BDUFLAGS                                                 02129000
BDURTOE  EQU   BDUFLAGS                                                 02130000
BDUSTPR  EQU   BDUFLAGS                                                 02131000
BDURSV03 EQU   BDUFLAGS                                                 02132000
BDUALT   EQU   BDUFUNC                                                  02133000
BDUNACK  EQU   BDUFUNC                                                  02134000
BDUACK   EQU   BDUFUNC                                                  02135000
BDUTRPM  EQU   BDUFUNC                                                  02136000
BDUFBMI  EQU   BDUFUNC                                                  02137000
BDULDGPH EQU   BDUFUNC                                                  02138000
BDUHEADP EQU   BDUFUNC                                                  02139000
BDUSOH   EQU   BDUCHECK                                                 02140000
BDURSV01 EQU   BDUMODIF                                                 02141000
BDUMOD0  EQU   BDUMOD1                                                  02142000
BDUCOMND EQU   ISTBDU                                                   02143000
ZCRRU    EQU   ZCRRHRU+3                                                02144000
ZCRRH    EQU   ZCRRHRU                                                  02145000
ZCRWORDA EQU   ISTZCRR+477                                              02146000
ZCRCMNRC EQU   ISTZCRR+476                                              02147000
ZCRRSV97 EQU   ZCRENTER+18                                              02148000
ZCREIC2B EQU   ZCRENTER+18                                              02149000
ZCREAC2B EQU   ZCRENTER+18                                              02150000
ZCRELCAB EQU   ZCRENTER+18                                              02151000
ZCREDCMF EQU   ZCRENTER+18                                              02152000
ZCREBCIF EQU   ZCRENTER+18                                              02153000
ZCREICSG EQU   ZCRENTER+18                                              02154000
ZCREDCK0 EQU   ZCRENTER+18                                              02155000
ZCRECFY0 EQU   ZCRENTER+17                                              02156000
ZCREKCCB EQU   ZCRENTER+17                                              02157000
ZCREDCNB EQU   ZCRENTER+17                                              02158000
ZCREICOE EQU   ZCRENTER+17                                              02159000
ZCREBCNB EQU   ZCRENTER+17                                              02160000
ZCREBC0L EQU   ZCRENTER+17                                              02161000
ZCREBCAL EQU   ZCRENTER+17                                              02162000
ZCREDCQR EQU   ZCRENTER+17                                              02163000
ZCREDCPR EQU   ZCRENTER+16                                              02164000
ZCREBCSB EQU   ZCRENTER+16                                              02165000
ZCREAC1R EQU   ZCRENTER+16                                              02166000
ZCRECCCI EQU   ZCRENTER+16                                              02167000
ZCRECCAI EQU   ZCRENTER+16                                              02168000
ZCRECCBI EQU   ZCRENTER+16                                              02169000
ZCREBCAR EQU   ZCRENTER+16                                              02170000
ZCREBCDR EQU   ZCRENTER+16                                              02171000
ZCREBCBR EQU   ZCRENTER+15                                              02172000
ZCREDCXR EQU   ZCRENTER+15                                              02173000
ZCREDCWB EQU   ZCRENTER+15                                              02174000
ZCREDCWR EQU   ZCRENTER+15                                              02175000
ZCREKCCN EQU   ZCRENTER+15                                              02176000
ZCREKCBB EQU   ZCRENTER+15                                              02177000
ZCREJC0B EQU   ZCRENTER+15                                              02178000
ZCREJCDB EQU   ZCRENTER+14                                              02179000
ZCREJCCB EQU   ZCRENTER+14                                              02180000
ZCREJCBB EQU   ZCRENTER+14                                              02181000
ZCREJCAB EQU   ZCRENTER+14                                              02182000
ZCREIC1B EQU   ZCRENTER+14                                              02183000
ZCREIC0B EQU   ZCRENTER+14                                              02184000
ZCREICX0 EQU   ZCRENTER+14                                              02185000
ZCREICWB EQU   ZCRENTER+14                                              02186000
ZCREICVB EQU   ZCRENTER+13                                              02187000
ZCREICUB EQU   ZCRENTER+13                                              02188000
ZCREICTB EQU   ZCRENTER+13                                              02189000
ZCREICSC EQU   ZCRENTER+13                                              02190000
ZCREICSB EQU   ZCRENTER+13                                              02191000
ZCREICRB EQU   ZCRENTER+13                                              02192000
ZCREICQB EQU   ZCRENTER+13                                              02193000
ZCREICQA EQU   ZCRENTER+13                                              02194000
ZCREICOB EQU   ZCRENTER+12                                              02195000
ZCREICOA EQU   ZCRENTER+12                                              02196000
ZCREICNB EQU   ZCRENTER+12                                              02197000
ZCREICNA EQU   ZCRENTER+12                                              02198000
ZCREICMB EQU   ZCRENTER+12                                              02199000
ZCREICLB EQU   ZCRENTER+12                                              02200000
ZCREICKG EQU   ZCRENTER+12                                              02201000
ZCREICKE EQU   ZCRENTER+12                                              02202000
ZCREICKB EQU   ZCRENTER+11                                              02203000
ZCREICJB EQU   ZCRENTER+11                                              02204000
ZCREICID EQU   ZCRENTER+11                                              02205000
ZCREICIB EQU   ZCRENTER+11                                              02206000
ZCREICHB EQU   ZCRENTER+11                                              02207000
ZCREICGB EQU   ZCRENTER+11                                              02208000
ZCREICEB EQU   ZCRENTER+11                                              02209000
ZCREICDB EQU   ZCRENTER+11                                              02210000
ZCREICCI EQU   ZCRENTER+10                                              02211000
ZCREICCB EQU   ZCRENTER+10                                              02212000
ZCREICBI EQU   ZCRENTER+10                                              02213000
ZCREICBB EQU   ZCRENTER+10                                              02214000
ZCREICAB EQU   ZCRENTER+10                                              02215000
ZCREICAA EQU   ZCRENTER+10                                              02216000
ZCREHCAN EQU   ZCRENTER+10                                              02217000
ZCREGC0B EQU   ZCRENTER+10                                              02218000
ZCREGC0A EQU   ZCRENTER+9                                               02219000
ZCREGCLA EQU   ZCRENTER+9                                               02220000
ZCREGCEB EQU   ZCRENTER+9                                               02221000
ZCREGCDB EQU   ZCRENTER+9                                               02222000
@NM00011 EQU   ZCRENTER+9                                               02223000
ZCREGCBB EQU   ZCRENTER+9                                               02224000
ZCREGCAB EQU   ZCRENTER+9                                               02225000
ZCREFCEB EQU   ZCRENTER+9                                               02226000
ZCREFCEA EQU   ZCRENTER+8                                               02227000
ZCREECTA EQU   ZCRENTER+8                                               02228000
ZCREECEA EQU   ZCRENTER+8                                               02229000
ZCREECDA EQU   ZCRENTER+8                                               02230000
ZCREECCB EQU   ZCRENTER+8                                               02231000
ZCREECCA EQU   ZCRENTER+8                                               02232000
ZCREECBB EQU   ZCRENTER+8                                               02233000
ZCREECBA EQU   ZCRENTER+8                                               02234000
ZCREDCMB EQU   ZCRENTER+7                                               02235000
ZCREDCL0 EQU   ZCRENTER+7                                               02236000
ZCREDCKB EQU   ZCRENTER+7                                               02237000
ZCREDCKA EQU   ZCRENTER+7                                               02238000
ZCREDCJ0 EQU   ZCRENTER+7                                               02239000
ZCREDCI0 EQU   ZCRENTER+7                                               02240000
ZCREDCH0 EQU   ZCRENTER+7                                               02241000
ZCREDCF0 EQU   ZCRENTER+7                                               02242000
ZCREDCE0 EQU   ZCRENTER+6                                               02243000
ZCREDCD0 EQU   ZCRENTER+6                                               02244000
ZCREDCC0 EQU   ZCRENTER+6                                               02245000
ZCREDCB0 EQU   ZCRENTER+6                                               02246000
ZCREDCA0 EQU   ZCRENTER+6                                               02247000
ZCRECC2B EQU   ZCRENTER+6                                               02248000
ZCRECC1B EQU   ZCRENTER+6                                               02249000
ZCRECC1A EQU   ZCRENTER+6                                               02250000
ZCRECC0B EQU   ZCRENTER+5                                               02251000
ZCRECC0A EQU   ZCRENTER+5                                               02252000
ZCREBC0B EQU   ZCRENTER+5                                               02253000
ZCREBC0A EQU   ZCRENTER+5                                               02254000
ZCREBCZ0 EQU   ZCRENTER+5                                               02255000
ZCREBCY0 EQU   ZCRENTER+5                                               02256000
ZCREBCX0 EQU   ZCRENTER+5                                               02257000
ZCREBCXA EQU   ZCRENTER+5                                               02258000
ZCREBCSC EQU   ZCRENTER+4                                               02259000
ZCREBCRB EQU   ZCRENTER+4                                               02260000
ZCREBCRA EQU   ZCRENTER+4                                               02261000
ZCREBCQB EQU   ZCRENTER+4                                               02262000
ZCREBCPB EQU   ZCRENTER+4                                               02263000
ZCREBCOB EQU   ZCRENTER+4                                               02264000
ZCREBCNE EQU   ZCRENTER+4                                               02265000
ZCREBCND EQU   ZCRENTER+4                                               02266000
ZCREBCMB EQU   ZCRENTER+3                                               02267000
ZCREBCLB EQU   ZCRENTER+3                                               02268000
ZCREBCLA EQU   ZCRENTER+3                                               02269000
ZCREBCKB EQU   ZCRENTER+3                                               02270000
ZCREBCKA EQU   ZCRENTER+3                                               02271000
ZCREBCJB EQU   ZCRENTER+3                                               02272000
ZCREBCJA EQU   ZCRENTER+3                                               02273000
ZCREBCID EQU   ZCRENTER+3                                               02274000
ZCREBCIB EQU   ZCRENTER+2                                               02275000
ZCREBCIA EQU   ZCRENTER+2                                               02276000
ZCREBCHB EQU   ZCRENTER+2                                               02277000
ZCREBCHA EQU   ZCRENTER+2                                               02278000
ZCREBCGB EQU   ZCRENTER+2                                               02279000
ZCREBCGA EQU   ZCRENTER+2                                               02280000
ZCREBCFB EQU   ZCRENTER+2                                               02281000
ZCREBCFA EQU   ZCRENTER+2                                               02282000
ZCREBCEB EQU   ZCRENTER+1                                               02283000
ZCREBCDI EQU   ZCRENTER+1                                               02284000
ZCREBCCB EQU   ZCRENTER+1                                               02285000
ZCREBCBI EQU   ZCRENTER+1                                               02286000
ZCREBCBB EQU   ZCRENTER+1                                               02287000
ZCREBCBA EQU   ZCRENTER+1                                               02288000
ZCREBCAM EQU   ZCRENTER+1                                               02289000
ZCREBCAI EQU   ZCRENTER+1                                               02290000
ZCREBCAG EQU   ZCRENTER                                                 02291000
ZCREBCAE EQU   ZCRENTER                                                 02292000
ZCREBCAB EQU   ZCRENTER                                                 02293000
ZCREBCAA EQU   ZCRENTER                                                 02294000
ZCREAC1B EQU   ZCRENTER                                                 02295000
ZCREAC0B EQU   ZCRENTER                                                 02296000
ZCREAC0A EQU   ZCRENTER                                                 02297000
ZCREAC1A EQU   ZCRENTER                                                 02298000
ZCRTNAME EQU   ZCRAUDIT+1                                               02299000
ZCRTID   EQU   ZCRAUDIT                                                 02300000
ZCRREMIC EQU   ISTZCRR+436                                              02301000
ZCRSAVEZ EQU   ISTZCRR+196                                              02302000
ZCRDAFSV EQU   ZCRCIDSV+2                                               02303000
ZCRSAFSV EQU   ZCRCIDSV                                                 02304000
ZCRR13SV EQU   ISTZCRR+188                                              02305000
ZCRR2SV  EQU   ISTZCRR+184                                              02306000
ZCROPCDE EQU   ISTZCRR+183                                              02307000
ZCRPRMTC EQU   ISTZCRR+182                                              02308000
ZCRRCDSV EQU   ISTZCRR+181                                              02309000
ZCRAWQSW EQU   ISTZCRR+180                                              02310000
ZCRTOPQ  EQU   ISTZCRR+180                                              02311000
ZCRLSTFB EQU   ISTZCRR+180                                              02312000
ZCRXSCHD EQU   ISTZCRR+180                                              02313000
ZCRNXTEL EQU   ISTZCRR+180                                              02314000
ZCRSCANQ EQU   ISTZCRR+180                                              02315000
ZCRMOREL EQU   ISTZCRR+180                                              02316000
ZCRFBPRC EQU   ISTZCRR+180                                              02317000
ZCRFSBSV EQU   ISTZCRR+176                                              02318000
ZCRSVWK5 EQU   ZCRWKARA+16                                              02319000
ZCRSVWK4 EQU   ZCRWKARA+12                                              02320000
ZCRSVWK3 EQU   ZCRWKARA+8                                               02321000
ZCRSVWK2 EQU   ZCRWKARA+4                                               02322000
ZCRSVWK1 EQU   ZCRWKARA                                                 02323000
ZCRSVF25 EQU   ZCRSVRTN+96                                              02324000
ZCRSVF24 EQU   ZCRSVRTN+92                                              02325000
ZCRSVF23 EQU   ZCRSVRTN+88                                              02326000
ZCRSVF22 EQU   ZCRSVRTN+84                                              02327000
ZCRSVF21 EQU   ZCRSVRTN+80                                              02328000
ZCRSVF20 EQU   ZCRSVRTN+76                                              02329000
ZCRSVF19 EQU   ZCRSVRTN+72                                              02330000
ZCRSVF18 EQU   ZCRSVRTN+68                                              02331000
ZCRSVF17 EQU   ZCRSVRTN+64                                              02332000
ZCRSVF16 EQU   ZCRSVRTN+60                                              02333000
ZCRSVF15 EQU   ZCRSVRTN+56                                              02334000
ZCRSVF14 EQU   ZCRSVRTN+52                                              02335000
ZCRSVF13 EQU   ZCRSVRTN+48                                              02336000
ZCRSVF12 EQU   ZCRSVRTN+44                                              02337000
ZCRSVF11 EQU   ZCRSVRTN+40                                              02338000
ZCRSVF10 EQU   ZCRSVRTN+36                                              02339000
ZCRSVF9  EQU   ZCRSVRTN+32                                              02340000
ZCRSVF8  EQU   ZCRSVRTN+28                                              02341000
ZCRSVF7  EQU   ZCRSVRTN+24                                              02342000
ZCRSVF6  EQU   ZCRSVRTN+20                                              02343000
ZCRSVF5  EQU   ZCRSVRTN+16                                              02344000
ZCRSVF4  EQU   ZCRSVRTN+12                                              02345000
ZCRSVF3  EQU   ZCRSVRTN+8                                               02346000
ZCRSVF2  EQU   ZCRSVRTN+4                                               02347000
ZCRSVF1  EQU   ZCRSVRTN                                                 02348000
ZCRPVZB  EQU   ISTZCRR+52                                               02349000
ZCRZLB   EQU   ISTZCRR+48                                               02350000
ZCRBFPTR EQU   ISTZCRR+44                                               02351000
ZCRCCWA  EQU   ISTZCRR+40                                               02352000
ZCRPSW   EQU   ZCRPARMS+15                                              02353000
ZCRPCHAR EQU   ZCRPARMS+14                                              02354000
ZCRPRES2 EQU   ZCRPCOD2                                                 02355000
ZCRPMFGF EQU   ZCRPCOD2                                                 02356000
ZCRPFHDR EQU   ZCRPCOD2                                                 02357000
ZCRPPG2  EQU   ZCRPCOD2                                                 02358000
ZCRPRES  EQU   ZCRPCOD1                                                 02359000
ZCRPCFTX EQU   ZCRPCOD1                                                 02360000
ZCRPBUF  EQU   ZCRPCOD1                                                 02361000
ZCRPLSCB EQU   ZCRPCOD1                                                 02362000
ZCRPLSBQ EQU   ZCRPLSBF                                                 02363000
ZCRPLNG  EQU   ZCRPCOD1                                                 02364000
ZCRDTODA EQU   ZCRDFRDA                                                 02365000
ZCRMLNG  EQU   ZCRPARMS+8                                               02366000
ZCRTBPTR EQU   ZCRPARMS+4                                               02367000
ZCRCBPTR EQU   ZCRFBPTR                                                 02368000
ZCRCRLCP EQU   ISTZCRR+20                                               02369000
@NM00010 EQU   ZCRSCPSW                                                 02370000
ZCRSKIPT EQU   ZCRSCPSW                                                 02371000
ZCRFSBWE EQU   ZCRSCPSW                                                 02372000
ZCRPRCMP EQU   ZCRSCPSW                                                 02373000
ZCRLREQ  EQU   ZCRSCPSW                                                 02374000
ZCRRJLCP EQU   ZCRSCPSW                                                 02375000
ZCRTPINV EQU   ZCRSCPSW                                                 02376000
ZCRTPEX  EQU   ZCRSCPSW                                                 02377000
@NM00009 EQU   ZCRIBPR                                                  02378000
ZCR3270R EQU   ZCRIBPR                                                  02379000
ZCR3270  EQU   ZCRIBPR                                                  02380000
ZCRLCPFD EQU   ZCRIBPR                                                  02381000
ZCRLCPFR EQU   ZCRIBPR                                                  02382000
ZCRRELK  EQU   ZCRIBPR                                                  02383000
ZCRERR   EQU   ZCRIBPR                                                  02384000
ZCRNOBUF EQU   ZCRIBPR                                                  02385000
@NM00008 EQU   ZCRPFLGS                                                 02386000
ZCRQAHED EQU   ZCRPFLGS                                                 02387000
ZCRF1RES EQU   ZCRGENSW                                                 02388000
ZCRBRIS  EQU   ZCRGENSW                                                 02389000
ZCRCLRBD EQU   ZCRGENSW                                                 02390000
ZCREXRES EQU   ZCRGENSW                                                 02391000
ZCRLCSYN EQU   ZCRGENSW                                                 02392000
ZCRRT06  EQU   ZCRGENSW                                                 02393000
ZCRTSW2  EQU   ZCRGENSW                                                 02394000
ZCRTSW1  EQU   ZCRGENSW                                                 02395000
ZCRINLCP EQU   ZCRFLGS3                                                 02396000
ZCRWRPTR EQU   ZCRFLGS3                                                 02397000
ZCRNOFRE EQU   ZCRFLGS3                                                 02398000
ZCREDRIV EQU   ZCRFLGS3                                                 02399000
ZCRDISC  EQU   ZCRFLGS3                                                 02400000
ZCRTPDIS EQU   ZCRFLGS3                                                 02401000
ZCRTPCON EQU   ZCRFLGS3                                                 02402000
ZCRTIC   EQU   ZCRFLGS3                                                 02403000
ZCRCNLXL EQU   ZCRRESET                                                 02404000
ZCRENDAN EQU   ZCRSWFLD                                                 02405000
ZCRENDXL EQU   ZCRSWFLD                                                 02406000
ZCRENDX  EQU   ZCRSWFLD                                                 02407000
ZCROB1   EQU   ZCRNDLCP                                                 02408000
ZCRENDPR EQU   ZCRSWFLD                                                 02409000
ZCREXTYP EQU   ZCRSWFLD                                                 02410000
ZCRSLCP  EQU   ZCRENDSH                                                 02411000
ZCRIF0E3 EQU   ZCRFLGS2                                                 02412000
ZCRIF0E2 EQU   ZCRFLGS2                                                 02413000
ZCRIF0E1 EQU   ZCRFLGS2                                                 02414000
ZCROB    EQU   ZCRFLGS2                                                 02415000
ZCRFMSED EQU   ZCRFLGS2                                                 02416000
ZCRSHEDI EQU   ZCRFLGS2                                                 02417000
ZCRLOCAL EQU   ZCRFLGS2                                                 02418000
ZCRFEXIT EQU   ZCRFLGS1                                                 02419000
ZCRUNSOL EQU   ZCRFLGS1                                                 02420000
ZCRENDLP EQU   ZCRFLGS1                                                 02421000
ZCRNRMEX EQU   ZCRFLGS1                                                 02422000
ZCRWAIT  EQU   ZCRFLGS1                                                 02423000
ZCRDEQSW EQU   ZCRFLGS1                                                 02424000
ZCRQUESW EQU   ZCRFLGS1                                                 02425000
ZCREXSW  EQU   ZCRFLGS1                                                 02426000
ZCRFRRA  EQU   ISTZCRR+8                                                02427000
ZCRCHAIN EQU   ISTZCRR+4                                                02428000
ZCRFLAG  EQU   ZCRCRR+3                                                 02429000
ZCRLEN   EQU   ZCRCRR+1                                                 02430000
ZCRID    EQU   ZCRCRR                                                   02431000
LCPFTYPE EQU   LCPRPHA                                                  02432000
LCPRSTQH EQU   LCPLCCW                                                  02433000
LCPCLREP EQU   ISTLCPB+44                                               02434000
LCPUBFSB EQU   LCPFLCCW                                                 02435000
LCPRSV77 EQU   ISTLCPB+39                                               02436000
LCPLCCWC EQU   ISTLCPB+38                                               02437000
LCPRSV78 EQU   LCPFLG1                                                  02438000
LCPTRANS EQU   LCPFLG1                                                  02439000
LCPSTLB  EQU   LCPFLG1                                                  02440000
LCPREDRV EQU   LCPFLG1                                                  02441000
LCPDIRPT EQU   LCPFLG1                                                  02442000
LCPINTER EQU   LCPFLG1                                                  02443000
LCPRESET EQU   LCPFLG1                                                  02444000
LCPSTYPE EQU   ISTLCPB+36                                               02445000
LCPFSNCH EQU   ISTLCPB+34                                               02446000
LCPFOSN  EQU   ISTLCPB+32                                               02447000
LCPTLBAD EQU   ISTLCPB+28                                               02448000
LCPFDB2  EQU   LCPFDBA+1                                                02449000
LCPFDB1  EQU   LCPFDBA                                                  02450000
LCPNXLCW EQU   ISTLCPB+20                                               02451000
LCPDAF   EQU   LCPCID+2                                                 02452000
LCPSAF   EQU   LCPCID                                                   02453000
LCPLCCW1 EQU   ISTLCPB+12                                               02454000
LCPRRCNT EQU   LCPSEQ+1                                                 02455000
LCPRRCCT EQU   LCPSEQ                                                   02456000
LCPATOP  EQU   LCPFLAG2                                                 02457000
LCPFREE  EQU   LCPFLAG2                                                 02458000
LCPDSTAT EQU   LCPFLAG2                                                 02459000
LCPEXRES EQU   LCPFID0                                                  02460000
LCPZRIMM EQU   LCPTLBPI                                                 02461000
LCPRSTRT EQU   LCPFLAG2                                                 02462000
LCPASYN  EQU   LCPFLAG2                                                 02463000
LCPPRFLG EQU   LCPFLAG2                                                 02464000
LCPZMIRC EQU   LCPRUCNT                                                 02465000
LCPCHAI2 EQU   LCPCHAIN+1                                               02466000
LCPCHNG  EQU   LCPCHAI1                                                 02467000
LCPZRT0B EQU   LCPMNRCD                                                 02468000
LCPZRT0A EQU   LCPMNRCD                                                 02469000
LCPZRTL9 EQU   LCPZRT09                                                 02470000
LCPZRTL8 EQU   LCPZRT08                                                 02471000
LCPZRTL7 EQU   LCPZRT07                                                 02472000
LCPZRTL6 EQU   LCPZRT06                                                 02473000
LCPZRTL5 EQU   LCPZRT05                                                 02474000
LCPZRTL4 EQU   LCPZRT04                                                 02475000
LCPZRTL3 EQU   LCPZRT03                                                 02476000
LCPZRTL2 EQU   LCPZRT02                                                 02477000
LCPZRT01 EQU   LCPFLAGS                                                 02478000
LCPZRT00 EQU   LCPFLAGS                                                 02479000
LCPLNGTH EQU   ISTLCPB+1                                                02480000
LCPTYPE  EQU   ISTLCPB                                                  02481000
LCCWDATA EQU   ISTLCCW+4                                                02482000
LCCWCNT  EQU   ISTLCCW+2                                                02483000
LCCWACI  EQU   LCCWFLAG                                                 02484000
LCCWRFI  EQU   LCCWFLAG                                                 02485000
LCCWPER  EQU   LCCWLSI                                                  02486000
LCCWIDAT EQU   LCCWFLAG                                                 02487000
LCCWNTVC EQU   LCCWFLAG                                                 02488000
LCCWCKPT EQU   LCCWFLAG                                                 02489000
LCCWCC   EQU   LCCWFLAG                                                 02490000
LCCWCD   EQU   LCCWFLAG                                                 02491000
LCCWTYPE EQU   LCCWCTL                                                  02492000
LCCWMODE EQU   LCCWCTL                                                  02493000
LCCWSOP  EQU   LCCWRWOP                                                 02494000
@NM00007 EQU   LCCWRWOP                                                 02495000
LCCWSD   EQU   LCCWOP                                                   02496000
LCCWSI   EQU   LCCWOP                                                   02497000
FSBRSV01 EQU   FSBFSB+30                                                02498000
FSBTHCNT EQU   FSBFSB+28                                                02499000
FSBRLRSV EQU   FSBRLSTS                                                 02500000
FSBCFTX  EQU   FSBRLSTS                                                 02501000
FSBICNCB EQU   FSBMSGID                                                 02502000
FSBSSOC  EQU   FSBSS2                                                   02503000
FSBSSCC  EQU   FSBSS2                                                   02504000
FSBSSDC  EQU   FSBSS2                                                   02505000
FSBSSEC  EQU   FSBSS2                                                   02506000
FSBSSIR  EQU   FSBSS2                                                   02507000
FSBSSCR  EQU   FSBSS2                                                   02508000
@NM00005 EQU   FSBSS2                                                   02509000
@NM00004 EQU   FSBSS1                                                   02510000
FSBSSDE  EQU   FSBSS1                                                   02511000
FSBSSUS  EQU   FSBSS1                                                   02512000
@NM00003 EQU   FSBSS1                                                   02513000
FSBSOHI  EQU   FSBERC                                                   02514000
FSBLGI   EQU   FSBERC                                                   02515000
FSBLMRI  EQU   FSBFBMI                                                  02516000
FSBETI   EQU   FSBERC                                                   02517000
FSBEMI   EQU   FSBERC                                                   02518000
FSBEBI   EQU   FSBERC                                                   02519000
FSBECI   EQU   FSBERC                                                   02520000
FSBELI   EQU   FSBERC                                                   02521000
FSBXLCI  EQU   FSBXCODE                                                 02522000
FSBXFINS EQU   FSBXCODE                                                 02523000
FSBXNORM EQU   FSBXFSTS                                                 02524000
FSBSCODE EQU   FSBSYSRS                                                 02525000
FSBSPHSE EQU   FSBSYSRS                                                 02526000
FSBSERR  EQU   FSBSYSRS                                                 02527000
FSBCMD   EQU   FSBSEQ                                                   02528000
FSBDTRCE EQU   FSBFLAGS                                                 02529000
FSBASBTU EQU   FSBFLAGS                                                 02530000
FSBINPET EQU   FSBFLAGS                                                 02531000
FSBNONCB EQU   FSBFLAGS                                                 02532000
FSBLBIND EQU   FSBFLAGS                                                 02533000
FSBFFIND EQU   FSBFLAGS                                                 02534000
FSBACIND EQU   FSBFLAGS                                                 02535000
FSBRFIND EQU   FSBFLAGS                                                 02536000
FSBDAF   EQU   FSBCID+2                                                 02537000
FSBSAF   EQU   FSBCID                                                   02538000
FSBGATE  EQU   FSBFSBA                                                  02539000
FSBRSV02 EQU   FSBSFLGS                                                 02540000
FSBPGBUF EQU   FSBSFLGS                                                 02541000
FSBMNSDA EQU   FSBMNRCD                                                 02542000
FSBMNOA  EQU   FSBMNRCD                                                 02543000
FSBMNDIF EQU   FSBMNRCD                                                 02544000
FSBMNEOP EQU   FSBMNRCD                                                 02545000
FSBMNATN EQU   FSBMNRCD                                                 02546000
FSBMNRVI EQU   FSBMNRCD                                                 02547000
FSBLNGTH EQU   FSBFSB+1                                                 02548000
FSBTYPE  EQU   FSBFSB                                                   02549000
FDBFDBA  EQU   ISTFDB                                                   02550000
CVTLEVL  EQU   CVTRELNO+2                                               02551000
CVTNUMB  EQU   CVTRELNO                                                 02552000
CVTMDL   EQU   CVTFIX+250                                               02553000
@NM00002 EQU   CVTFIX+248                                               02554000
@NM00001 EQU   CVTFIX                                                   02555000
CVTRV482 EQU   CVTXTNT2+128                                             02556000
CVTRV481 EQU   CVTXTNT2+124                                             02557000
CVTRV480 EQU   CVTXTNT2+120                                             02558000
CVTRV479 EQU   CVTXTNT2+118                                             02559000
CVTRV478 EQU   CVTXTNT2+117                                             02560000
CVTRV477 EQU   CVTXTNT2+116                                             02561000
CVTRV476 EQU   CVTXTNT2+115                                             02562000
CVTRV475 EQU   CVTXTNT2+114                                             02563000
CVTRV474 EQU   CVTRV466                                                 02564000
CVTRV473 EQU   CVTRV466                                                 02565000
CVTRV472 EQU   CVTRV466                                                 02566000
CVTRV471 EQU   CVTRV466                                                 02567000
CVTRV470 EQU   CVTRV466                                                 02568000
CVTRV469 EQU   CVTRV466                                                 02569000
CVTRV468 EQU   CVTRV466                                                 02570000
CVTRV467 EQU   CVTRV466                                                 02571000
CVTRV465 EQU   CVTRV457                                                 02572000
CVTRV464 EQU   CVTRV457                                                 02573000
CVTRV463 EQU   CVTRV457                                                 02574000
CVTRV462 EQU   CVTRV457                                                 02575000
CVTRV461 EQU   CVTRV457                                                 02576000
CVTRV460 EQU   CVTRV457                                                 02577000
CVTRV459 EQU   CVTRV457                                                 02578000
CVTRV458 EQU   CVTRV457                                                 02579000
CVTRV456 EQU   CVTXTNT2+108                                             02580000
CVTRV455 EQU   CVTXTNT2+104                                             02581000
CVTRV454 EQU   CVTXTNT2+100                                             02582000
CVTRV453 EQU   CVTXTNT2+96                                              02583000
CVTRV452 EQU   CVTXTNT2+94                                              02584000
CVTRV451 EQU   CVTXTNT2+92                                              02585000
CVTRV450 EQU   CVTXTNT2+90                                              02586000
CVTRV449 EQU   CVTXTNT2+88                                              02587000
CVTRV448 EQU   CVTXTNT2+87                                              02588000
CVTRV447 EQU   CVTXTNT2+86                                              02589000
CVTRV446 EQU   CVTRV438                                                 02590000
CVTRV445 EQU   CVTRV438                                                 02591000
CVTRV444 EQU   CVTRV438                                                 02592000
CVTRV443 EQU   CVTRV438                                                 02593000
CVTRV442 EQU   CVTRV438                                                 02594000
CVTRV441 EQU   CVTRV438                                                 02595000
CVTRV440 EQU   CVTRV438                                                 02596000
CVTRV439 EQU   CVTRV438                                                 02597000
CVTRV437 EQU   CVTRV429                                                 02598000
CVTRV436 EQU   CVTRV429                                                 02599000
CVTRV435 EQU   CVTRV429                                                 02600000
CVTRV434 EQU   CVTRV429                                                 02601000
CVTRV433 EQU   CVTRV429                                                 02602000
CVTRV432 EQU   CVTRV429                                                 02603000
CVTRV431 EQU   CVTRV429                                                 02604000
CVTRV430 EQU   CVTRV429                                                 02605000
CVTRV428 EQU   CVTXTNT2+80                                              02606000
CVTRV427 EQU   CVTXTNT2+76                                              02607000
CVTRV426 EQU   CVTXTNT2+72                                              02608000
CVTRV425 EQU   CVTXTNT2+68                                              02609000
CVTATACT EQU   CVTATCVT                                                 02610000
CVTRV423 EQU   CVTXTNT2+62                                              02611000
CVTRV422 EQU   CVTXTNT2+60                                              02612000
CVTRV421 EQU   CVTXTNT2+58                                              02613000
CVTRV420 EQU   CVTXTNT2+56                                              02614000
CVTRV419 EQU   CVTXTNT2+55                                              02615000
CVTRV418 EQU   CVTXTNT2+54                                              02616000
CVTRV417 EQU   CVTRV409                                                 02617000
CVTRV416 EQU   CVTRV409                                                 02618000
CVTRV415 EQU   CVTRV409                                                 02619000
CVTRV414 EQU   CVTRV409                                                 02620000
CVTRV413 EQU   CVTRV409                                                 02621000
CVTRV412 EQU   CVTRV409                                                 02622000
CVTRV411 EQU   CVTRV409                                                 02623000
CVTRV410 EQU   CVTRV409                                                 02624000
CVTRV408 EQU   CVTRV400                                                 02625000
CVTRV407 EQU   CVTRV400                                                 02626000
CVTRV406 EQU   CVTRV400                                                 02627000
CVTRV405 EQU   CVTRV400                                                 02628000
CVTRV404 EQU   CVTRV400                                                 02629000
CVTRV403 EQU   CVTRV400                                                 02630000
CVTRV402 EQU   CVTRV400                                                 02631000
CVTRV401 EQU   CVTRV400                                                 02632000
CVTICB   EQU   CVTXTNT2+48                                              02633000
CVTSKTA  EQU   CVTXTNT2+44                                              02634000
CVTSHSB  EQU   CVTSHS                                                   02635000
CVTRSV98 EQU   CVTXTNT2+36                                              02636000
CVTRSV97 EQU   CVTXTNT2+34                                              02637000
CVTRSV96 EQU   CVTXTNT2+32                                              02638000
CVTOLTEP EQU   CVTXTNT2+28                                              02639000
CVTQIDA  EQU   CVTQID+1                                                 02640000
CVTRSV95 EQU   CVTQID                                                   02641000
CVTRSV94 EQU   CVTXTNT2+20                                              02642000
CVTRSV93 EQU   CVTXTNT2+16                                              02643000
CVTRSV92 EQU   CVTXTNT2+12                                              02644000
CVTDEBVR EQU   CVTXTNT2+8                                               02645000
CVTRSV91 EQU   CVTXTNT2+6                                               02646000
CVTRSV9H EQU   CVTFLGBT                                                 02647000
CVTRSV9G EQU   CVTFLGBT                                                 02648000
CVTRSV9F EQU   CVTFLGBT                                                 02649000
CVTRSV9E EQU   CVTFLGBT                                                 02650000
CVTRSV9D EQU   CVTFLGBT                                                 02651000
CVTRSV9C EQU   CVTFLGBT                                                 02652000
CVTVME   EQU   CVTFLGBT                                                 02653000
CVTNPE   EQU   CVTFLGBT                                                 02654000
CVTNUCLS EQU   CVTXTNT2+4                                               02655000
CVTDSSVA EQU   CVTDSSV+1                                                02656000
CVTRSV89 EQU   CVTDSSV                                                  02657000
CVTRSV88 EQU   CVTXTNT1+8                                               02658000
CVTRSV87 EQU   CVTXTNT1+4                                               02659000
CVTFACHN EQU   CVTXTNT1                                                 02660000
CVTRV488 EQU   CVTMAP+412                                               02661000
CVTRV487 EQU   CVTMAP+408                                               02662000
CVTRV486 EQU   CVTMAP+404                                               02663000
CVTRV485 EQU   CVTMAP+400                                               02664000
CVTACTAP EQU   CVTMAP+396                                               02665000
CVTAUTH  EQU   CVTMAP+392                                               02666000
CVTATMCA EQU   CVTATMCT+1                                               02667000
CVTATMST EQU   CVTATMCT                                                 02668000
CVTRSV61 EQU   CVTMAP+384                                               02669000
CVTVOLT1 EQU   CVTVOLM1+1                                               02670000
CVTVOLI1 EQU   CVTVOLF1                                                 02671000
CVTSTOA  EQU   CVTMAP+376                                               02672000
CVTRSV58 EQU   CVTMAP+374                                               02673000
CVTRSV57 EQU   CVTMAP+372                                               02674000
CVTDDCE  EQU   CVTMAP+368                                               02675000
CVTPNWFR EQU   CVTMAP+364                                               02676000
CVTSMF   EQU   CVTMAP+360                                               02677000
CVTSULK  EQU   CVTMAP+358                                               02678000
CVTSLKO  EQU   CVTSYSK                                                  02679000
CVTSLKP  EQU   CVTSYSK                                                  02680000
CVTSLKQ  EQU   CVTSYSK                                                  02681000
CVTSLKR  EQU   CVTSYSK                                                  02682000
CVTRSV56 EQU   CVTSYSK                                                  02683000
CVTRSV55 EQU   CVTSYSK                                                  02684000
CVTRSV54 EQU   CVTSYSK                                                  02685000
CVTRSV53 EQU   CVTSYSK                                                  02686000
CVTRSV52 EQU   CVTA1F1                                                  02687000
CVTRSV51 EQU   CVTA1F1                                                  02688000
CVTRSV50 EQU   CVTA1F1                                                  02689000
CVTRSV49 EQU   CVTA1F1                                                  02690000
CVTRSV48 EQU   CVTA1F1                                                  02691000
CVTRSV47 EQU   CVTA1F1                                                  02692000
CVTSRSW  EQU   CVTA1F1                                                  02693000
CVTPFSW  EQU   CVTA1F1                                                  02694000
CVTPCVT  EQU   CVTMAP+352                                               02695000
CVTRSV46 EQU   CVTMAP+344                                               02696000
CVTRSV45 EQU   CVTMAP+340                                               02697000
CVTRSV44 EQU   CVTMAP+338                                               02698000
CVTRSV43 EQU   CVTMAP+336                                               02699000
CVTHJESA EQU   CVTHJES+1                                                02700000
CVTRSV42 EQU   CVTHJES                                                  02701000
CVTEXT2A EQU   CVTEXT2+1                                                02702000
CVTRSV41 EQU   CVTEXT2                                                  02703000
CVTAPFA  EQU   CVTAPF+1                                                 02704000
CVTRSV40 EQU   CVTAPF                                                   02705000
CVTRV518 EQU   CVTINTLA                                                 02706000
CVTRV517 EQU   CVTERPV                                                  02707000
CVTEORM  EQU   CVTMAP+312                                               02708000
CVTMCHPR EQU   CVTMAP+308                                               02709000
CVTTZ    EQU   CVTMAP+304                                               02710000
CVTJEPS  EQU   CVTMAP+300                                               02711000
CVTJESCT EQU   CVTMAP+296                                               02712000
CVTMODE  EQU   CVTMAP+292                                               02713000
CVTPTRV  EQU   CVTMAP+288                                               02714000
CVTREAL  EQU   CVTMAP+284                                               02715000
CVTRSV39 EQU   CVTMAP+280                                               02716000
CVTRSV38 EQU   CVTMAP+276                                               02717000
CVTDMSRA EQU   CVTDMSR+1                                                02718000
CVTRSV37 EQU   CVTDMSR                                                  02719000
CVTQMSGA EQU   CVTQMSG+1                                                02720000
CVTRSV36 EQU   CVTQMSG                                                  02721000
CVTAMFF  EQU   CVTMAP+264                                               02722000
CVTPURGA EQU   CVTPURG+1                                                02723000
CVTRSV35 EQU   CVTPURG                                                  02724000
CVTCBSP  EQU   CVTMAP+256                                               02725000
CVTATERA EQU   CVTATER+1                                                02726000
CVTSYST  EQU   CVTATER                                                  02727000
CVTVOLT2 EQU   CVTTAT                                                   02728000
CVTVOLI2 EQU   CVTVOLF2                                                 02729000
CVTAQAVB EQU   CVTAQAVT+1                                               02730000
CVTRSV34 EQU   CVTTCMFG                                                 02731000
CVTRSV33 EQU   CVTTCMFG                                                 02732000
CVTRSV32 EQU   CVTTCMFG                                                 02733000
CVTRSV31 EQU   CVTTCMFG                                                 02734000
CVTRSV30 EQU   CVTTCMFG                                                 02735000
CVTRSV29 EQU   CVTTCMFG                                                 02736000
CVTRSV28 EQU   CVTTCMFG                                                 02737000
CVTTCRDY EQU   CVTTCMFG                                                 02738000
CVTGTFA  EQU   CVTGTF+1                                                 02739000
CVTRSV27 EQU   CVTGTFST                                                 02740000
CVTRNIO  EQU   CVTGTFST                                                 02741000
CVTUSR   EQU   CVTGTFST                                                 02742000
CVTRV318 EQU   CVTFORM                                                  02743000
CVTRV317 EQU   CVTTMODE                                                 02744000
CVTRV316 EQU   CVTSTATE                                                 02745000
CVTRV315 EQU   CVTGTFS                                                  02746000
CVTGTFAV EQU   CVTGTFS                                                  02747000
CVT0SCR1 EQU   CVTMAP+232                                               02748000
CVTRV515 EQU   CVTMAP+228                                               02749000
CVTRMS   EQU   CVTMAP+224                                               02750000
CVTPATCH EQU   CVTMAP+220                                               02751000
CVTTSCE  EQU   CVTMAP+216                                               02752000
CVTLNKSC EQU   CVTMAP+214                                               02753000
CVTQABST EQU   CVTMAP+212                                               02754000
CVTMDLDS EQU   CVTMAP+208                                               02755000
CVTUSER  EQU   CVTMAP+204                                               02756000
CVTABEND EQU   CVTMAP+200                                               02757000
CVTSMCA  EQU   CVTMAP+196                                               02758000
CVTRSV18 EQU   CVTMAP+192                                               02759000
CVTQLPAQ EQU   CVTMAP+188                                               02760000
CVTQCDSR EQU   CVTMAP+184                                               02761000
CVTRSV17 EQU   CVTOPTB                                                  02762000
CVTRSV16 EQU   CVTOPTB                                                  02763000
CVTFP    EQU   CVTOPTB                                                  02764000
CVTAPTHR EQU   CVTOPTB                                                  02765000
CVTNLOG  EQU   CVTOPTB                                                  02766000
CVTTOD   EQU   CVTOPTB                                                  02767000
CVTCTIMS EQU   CVTOPTB                                                  02768000
CVTPROT  EQU   CVTOPTB                                                  02769000
CVTXPFP  EQU   CVTOPTA                                                  02770000
CVTASCII EQU   CVTOPTA                                                  02771000
CVTRSV13 EQU   CVTOPTA                                                  02772000
CVTRSV12 EQU   CVTOPTA                                                  02773000
CVTNIP   EQU   CVTOPTA                                                  02774000
CVTDDR   EQU   CVTOPTA                                                  02775000
CVTAPR   EQU   CVTOPTA                                                  02776000
CVTCCH   EQU   CVTOPTA                                                  02777000
CVTSNCTR EQU   CVTMAP+180                                               02778000
CVTQMWR  EQU   CVTMAP+176                                               02779000
CVTQOCR  EQU   CVTMAP+172                                               02780000
CVT1EF00 EQU   CVTMAP+168                                               02781000
CVTMZ00  EQU   CVTMAP+164                                               02782000
CVTHEAD  EQU   CVTMAP+160                                               02783000
CVTRSV11 EQU   CVTMAP+156                                               02784000
CVT0PT01 EQU   CVTMAP+152                                               02785000
CVTMSER  EQU   CVTMAP+148                                               02786000
CVTRV516 EQU   CVTIERLC                                                 02787000
CVTILCH  EQU   CVTMAP+140                                               02788000
CVT0DS   EQU   CVTMAP+136                                               02789000
CVTFBOSV EQU   CVTMAP+132                                               02790000
CVTNUCB  EQU   CVTMAP+128                                               02791000
CVTIXAVL EQU   CVTMAP+124                                               02792000
CVTIOQET EQU   CVTMAP+120                                               02793000
CVTDCBA  EQU   CVTMAP+117                                               02794000
CVTMVS2  EQU   CVTDCB                                                   02795000
CVT6DAT  EQU   CVTDCB                                                   02796000
CVT4MPS  EQU   CVTDCB                                                   02797000
CVTRSV09 EQU   CVTDCB                                                   02798000
CVT4MS1  EQU   CVTDCB                                                   02799000
CVT2SPS  EQU   CVTDCB                                                   02800000
CVT1SSS  EQU   CVTDCB                                                   02801000
CVTRSV08 EQU   CVTDCB                                                   02802000
CVTSTB   EQU   CVTMAP+112                                               02803000
CVTQTD00 EQU   CVTMAP+108                                               02804000
CVTQTE00 EQU   CVTMAP+104                                               02805000
CVTCUCB  EQU   CVTMAP+100                                               02806000
CVTSJQ   EQU   CVTMAP+96                                                02807000
CVTPBLDL EQU   CVTMAP+92                                                02808000
CVTTPC   EQU   CVTMAP+88                                                02809000
CVTSVDCB EQU   CVTMAP+84                                                02810000
CVTBRET  EQU   CVTMAP+82                                                02811000
CVTEXIT  EQU   CVTMAP+80                                                02812000
CVT0FN00 EQU   CVTMAP+76                                                02813000
CVTDARA  EQU   CVTDAR+1                                                 02814000
CVTRSV07 EQU   CVTFLGS1                                                 02815000
CVTRSV06 EQU   CVTFLGS1                                                 02816000
CVTRSV05 EQU   CVTFLGS1                                                 02817000
CVTRSV04 EQU   CVTFLGS1                                                 02818000
CVTRSV03 EQU   CVTFLGS1                                                 02819000
CVTRSV02 EQU   CVTFLGS1                                                 02820000
CVTRSV01 EQU   CVTFLGS1                                                 02821000
CVTDMPLK EQU   CVTFLGS1                                                 02822000
CVTXITP  EQU   CVTMAP+68                                                02823000
CVTZDTAB EQU   CVTMAP+64                                                02824000
CVTMSLT  EQU   CVTMAP+60                                                02825000
CVTDATE  EQU   CVTMAP+56                                                02826000
CVTBTERM EQU   CVTMAP+52                                                02827000
CVTSYSAD EQU   CVTMAP+48                                                02828000
CVTXTLER EQU   CVTMAP+44                                                02829000
CVTILK2  EQU   CVTMAP+40                                                02830000
CVTILK1  EQU   CVTMAP+36                                                02831000
CVTPRLTV EQU   CVTMAP+32                                                02832000
CVTPCNVT EQU   CVTMAP+28                                                02833000
CVT0VL00 EQU   CVTMAP+24                                                02834000
CVTXAPG  EQU   CVTMAP+20                                                02835000
CVTBUF   EQU   CVTMAP+16                                                02836000
CVTJOB   EQU   CVTMAP+12                                                02837000
CVTLINK  EQU   CVTMAP+8                                                 02838000
CVT0EF00 EQU   CVTMAP+4                                                 02839000
CVTTCBP  EQU   CVTMAP                                                   02840000
CVT      EQU   CVTMAP                                                   02841000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02842000
@ENDDATA EQU   *                                                        02843000
         END   ISTZKFBN,(C'PLS0424',0603,75134)                         02844000
