         TITLE 'ISTZDMMB - VTAM MDR RECORDER                           *00001000
                        '                                               00002000
ISTZDMMB CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'ISTZDMMB  75.317'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  DS    0H                                                  0002 00010000
* * * * * * * * * * * * * * * * *                                       00011000
* GENERATED CODE TO ENSURE THAT *                                       00012000
* THE COMMON ENTRY POINT IS     *                                       00013000
* IDENTIFIED                    *                                       00014000
ISTZDMMB CSECT                  *                                       00015000
         ENTRY ISTZDCMB         *                                       00016000
ISTZDCMB EQU   ISTZDMMB         *                                       00017000
* * * * * * * * * * * * * * * * *                                       00018000
*                                                                  0616 00019000
*/* TPZSAVE (7,12,14) AC(DCMB)BASE                                   */ 00020000
*                                                                  0616 00021000
*   DO;                                                            0616 00022000
*     RFY                                                          0617 00023000
*      (GPR01P,                                                    0617 00024000
*       GPR12P,                                                    0617 00025000
*       GPR13P,                                                    0617 00026000
*       GPR14P) RSTD;                                              0617 00027000
*     GEN(PRINT OFF);                                              0618 00028000
*                                                                  0618 00029000
         PRINT OFF                                                      00030000
*/* ATBUILD (ISTZSAVE)                                               */ 00031000
*/* END OF ATBUILD                                                   */ 00032000
*                                                                  0619 00033000
*     GEN(PRINT ON);                                               0619 00034000
         PRINT ON                                                       00035000
*     RFY                                                          0620 00036000
*       ISTZSAVE BASED(GPR13P);                                    0620 00037000
*     GEN SETS(ZSAZSVVR)(STM   7,12,ZSAZSVVR+0(13));               0621 00038000
         STM   7,12,ZSAZSVVR+0(13)                                      00039000
*     GEN SETS(GPR12P);                                            0622 00040000
         BALR  GPR12P,0                                                 00041000
@TSTART  DS    0H                                                       00042000
         USING @TSTART,GPR12P                                           00043000
*     GEN(PRINT OFF);                                              0623 00044000
*                                                                  0623 00045000
         PRINT OFF                                                      00046000
*/* ATBUILD (ISTZCRR,ISTRPH,ISTCRA) EJECT(NO)                        */ 00047000
*/* END OF ATBUILD                                                   */ 00048000
*                                                                  0624 00049000
*     GEN(PRINT ON);                                               0624 00050000
         PRINT ON                                                       00051000
*     GPR01P->RPHCRR->CRACRR->ZCREDCMB='1'B;                       0625 00052000
         L     @08,RPHCRR(,GPR01P)                                 0625 00053000
         L     @08,CRACRR(,@08)                                    0625 00054000
         OI    ZCREDCMB(@08),B'00000001'                           0625 00055000
*     ZSAZACTV='1'B;                                               0626 00056000
         OI    ZSAZACTV(GPR13P),B'10000000'                        0626 00057000
*     ZSAZTRAC='DCMB';                                             0627 00058000
         MVC   ZSAZTRAC(4,GPR13P),@CC05408                         0627 00059000
*     ZSAZSVRR=GPR14P;                                             0628 00060000
         ST    GPR14P,ZSAZSVRR(,GPR13P)                            0628 00061000
*     GPR13P=ZSAZSVFC;                                             0629 00062000
         L     GPR13P,ZSAZSVFC(,GPR13P)                            0629 00063000
*     RFY                                                          0630 00064000
*      (GPR01P) UNRSTD;                                            0630 00065000
*     RFY                                                          0631 00066000
*      (GPR14P) UNRSTD;                                            0631 00067000
*   END;                                                           0632 00068000
*                                                                  0632 00069000
*/* END TPZSAVE                                                      */ 00070000
*                                                                  0633 00071000
*                                   /* SAVE REGS                     */ 00072000
*   ZIBREG=ZIBREG-(ADDR(ZIBFSB)-ADDR(ZIBAIO));/* ADJUST POINTER TO 0633 00073000
*                                      INPUT BUFFER          @ZM32042*/ 00074000
         LA    @08,ZIBFSB(,ZIBREG)                                 0633 00075000
         LCR   @08,@08                                             0633 00076000
         ALR   @08,ZIBREG                                          0633 00077000
         ALR   ZIBREG,@08                                          0633 00078000
*   IF ATCZF001=$ON THEN                                           0634 00079000
         TM    ATCZF001(ATCVTREG),B'10000000'                      0634 00080000
         BO    @RT00634                                            0634 00081000
*     ;                             /* MDR SUSPENDED-YES,NOTHING     */ 00082000
*   ELSE                            /* NO, FORMAT MDR AND RECORD     */ 00083000
*     DO;                           /* DO1-BEGIN MDR FMT & REC       */ 00084000
*       CIDREG=NSRUDAF;             /* SET NETWORK ADDRESS           */ 00085000
         SLR   CIDREG,CIDREG                                       0637 00086000
         ICM   CIDREG,3,NSRUDAF+61(ZIBREG)                         0637 00087000
*       DO;                         /* CIDCTL(FIND)                  */ 00088000
*         RFY                                                      0639 00089000
*          (EMCR2,                                                 0639 00090000
*           EMCR3) RSTD;                                           0639 00091000
*         GEN SETS(RPHWORK)                                        0640 00092000
*             (STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH); 0640 00093000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              00094000
*         EMCR3='00'X;              /* CLEAR EXTRA BITS              */ 00095000
         SLR   EMCR3,EMCR3                                         0641 00096000
*         EMCR3='01'X;              /* INDICATE SHARED LOCK          */ 00097000
         LA    EMCR3,1                                             0642 00098000
*         CALL ATCLCPTR->ATCCDFND->ISTSDCCF;/* PROCESS REQUEST       */ 00099000
         L     @08,ATCLCPTR                                        0643 00100000
         L     @15,ATCCDFND(,@08)                                  0643 00101000
         BALR  @14,@15                                             0643 00102000
*         RFY                                                      0644 00103000
*          (EMCR2,                                                 0644 00104000
*           EMCR3) UNRSTD;                                         0644 00105000
*       END;                        /* CIDCTL FIND RELATED RESOURCE  */ 00106000
*       IF RCDREG^=$DNCB&           /* IF NOT DNCB AND NOT RDTE      */ 00107000
*           RCDREG^=$RDTE THEN                                     0646 00108000
         LTR   RCDREG,RCDREG                                       0646 00109000
         BZ    @RF00646                                            0646 00110000
         C     RCDREG,@CF01996                                     0646 00111000
         BNE   @RT00646                                            0646 00112000
*         ;                         /* THEN CIDCTL UNSUCCESSFUL      */ 00113000
*       ELSE                        /* VALID RESOURCE                */ 00114000
*         DO;                       /* DO2-CONT MDR FORMAT & REC     */ 00115000
@RF00646 DS    0H                                                  0649 00116000
*/********************************************************************  00117000
* *                                                                  *  00118000
* * THE FOLLOWING CODE TO INITIALIZE THE MDR HEADER, DATA ADDRESS,   *  00119000
* * CHANNEL UNIT ADDRESS, LENGTH OF MDR DATA, AND RESOURCE ID        *  00120000
* * FIELD HAS BEEN MOVED TO PRECEDE THE CODE THAT LOCATES THE        *  00121000
* * SYMBOLIC RESOURCE NAME.                                          *  00122000
* *                                                     @ZM40098     *  00123000
* ********************************************************************/ 00124000
*                                                                  0649 00125000
*           ZIBRECHD=$HEADER;       /* INIT PARM LIST - MDR HDR      */ 00126000
         MVC   ZIBRECHD(4,ZIBREG),@CB05382                         0649 00127000
*           ZIBRECDA=ADDR(ZIBRECDT);/* - DATA ADDRESS                */ 00128000
         LA    @08,ZIBRECDT(,ZIBREG)                               0650 00129000
         ST    @08,ZIBRECDA(,ZIBREG)                               0650 00130000
*           ZIBRECUA=UCBCHAN;       /* PUT BINARY CUA IN MDR         */ 00131000
         L     @08,IOSUCB+520(,ICNCBREG)                           0651 00132000
         MVC   ZIBRECUA(2,ZIBREG),UCBCHAN(@08)                     0651 00133000
*           RFY                                                    0652 00134000
*             DLTHREG RSTD;         /* RSTD FOR RECORD INVOKE        */ 00135000
*           DLTHREG=BTUDCF+LENGTH(ZIBRECDT);/* CALC LENGTH OF MDR  0653 00136000
*                                      DATA                          */ 00137000
         LA    @08,12                                              0653 00138000
         LH    DLTHREG,BTUDCF+48(,ZIBREG)                          0653 00139000
         N     DLTHREG,@CF05440                                    0653 00140000
         ALR   DLTHREG,@08                                         0653 00141000
*           RFY                                                    0654 00142000
*             WORKREG RSTD;         /* TO OVERCOME PLS INEFFICIENCY  */ 00143000
*           WORKREG=NSRUDAF;        /* GET DAF                       */ 00144000
         SLR   WORKREG,WORKREG                                     0655 00145000
         ICM   WORKREG,3,NSRUDAF+61(ZIBREG)                        0655 00146000
*           ZIBRECID=WORKREG;       /* PUT DAF IN RECORD             */ 00147000
         STH   WORKREG,ZIBRECID(,ZIBREG)                           0656 00148000
*           RFY                                                    0657 00149000
*             WORKREG UNRSTD;       /* GIVE BACK TO COMPILER         */ 00150000
*           PLISTREG=ADDR(ZIBRECPL);/* GET PARM LIST ADDR            */ 00151000
         LA    PLISTREG,ZIBRECPL(,ZIBREG)                          0658 00152000
*           IF RCDREG=$RDTE THEN    /* RESOURCE AN RDTE              */ 00153000
         CR    RCDREG,@08                                          0659 00154000
         BNE   @RF00659                                            0659 00155000
*             DO;                   /* YES                   @Z40GKD9*/ 00156000
*               RDTEREG=CIDREG0;    /* SET RDTE PTR FROM R0          */ 00157000
         LR    RDTEREG,CIDREG0                                     0661 00158000
*               IF RPRENTRY=RPRENTPX/* RDTE A PUX            @Z40GKD9*/ 00159000
*                   |RPRENTRY=RPRENTLX THEN/* OR A LUX       @Z40GKD9*/ 00160000
         CLI   RPRENTRY(RDTEREG),X'72'                             0662 00161000
         BE    @RT00662                                            0662 00162000
         CLI   RPRENTRY(RDTEREG),X'10'                             0662 00163000
         BNE   @RF00662                                            0662 00164000
@RT00662 DS    0H                                                  0663 00165000
*                 IF RPRSWDAF=0 THEN/* WITH ZERO SWDAF FIELD @Z40GKD9*/ 00166000
         LH    @11,RPRSWDAF(,RDTEREG)                              0663 00167000
         N     @11,@CF05440                                        0663 00168000
         LTR   @11,@11                                             0663 00169000
         BNZ   @RF00663                                            0663 00170000
*                   ZIBRECNA=' ';   /* BLANK SYMBOLIC NAME FIELD   0664 00171000
*                                                            @Z40GKD9*/ 00172000
         MVI   ZIBRECNA+1(ZIBREG),C' '                             0664 00173000
         MVC   ZIBRECNA+2(6,ZIBREG),ZIBRECNA+1(ZIBREG)             0664 00174000
         MVI   ZIBRECNA(ZIBREG),C' '                               0664 00175000
*                 ELSE              /* NON-ZERO SWDAF FIELD  @Z40GKD9*/ 00176000
*                   DO;             /*                       @Z40GKD9*/ 00177000
         B     @RC00663                                            0665 00178000
@RF00663 DS    0H                                                  0666 00179000
*                     RFY                                          0666 00180000
*                       WORKREG RSTD;/*                      @Z40GKD9*/ 00181000
*                     CIDREG=RPRSWDAF;/* SET CID @ FOR CIDCTL      0667 00182000
*                                                            @Z40GKD9*/ 00183000
         LH    CIDREG,RPRSWDAF(,RDTEREG)                           0667 00184000
         N     CIDREG,@CF05440                                     0667 00185000
*                     WORKREG=CIDREG;/* SAVE SWDAF VALUE     @Z40GKD9*/ 00186000
         LR    WORKREG,CIDREG                                      0668 00187000
*                     DO;           /* CIDCTL(FIND)                  */ 00188000
*                       RFY                                        0670 00189000
*                        (EMCR2,                                   0670 00190000
*                         EMCR3) RSTD;                             0670 00191000
*                       GEN SETS(RPHWORK)                          0671 00192000
*(STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);              0671 00193000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              00194000
*                       EMCR3='00'X;/* CLEAR EXTRA BITS              */ 00195000
         SLR   EMCR3,EMCR3                                         0672 00196000
*                       EMCR3='01'X;/* INDICATE SHARED LOCK          */ 00197000
         LA    EMCR3,1                                             0673 00198000
*                       CALL ATCLCPTR->ATCCDFND->ISTSDCCF;/* PROCESS    00199000
*                                      REQUEST                       */ 00200000
         L     @08,ATCLCPTR                                        0674 00201000
         L     @15,ATCCDFND(,@08)                                  0674 00202000
         BALR  @14,@15                                             0674 00203000
*                       RFY                                        0675 00204000
*                        (EMCR2,                                   0675 00205000
*                         EMCR3) UNRSTD;                           0675 00206000
*                     END;          /* CIDCTL FIND RELEATED RESOURCE    00207000
*                                                            @Z40GKD9*/ 00208000
*                     IF RCDREG=$RDTE THEN/* RESOURCE A RDTE @Z40GKD9*/ 00209000
         C     RCDREG,@CF01996                                     0677 00210000
         BNE   @RF00677                                            0677 00211000
*                       RDTEREG=CIDREG0;/* SET RDTE PTR FROM R0    0678 00212000
*                                                            @Z40GKD9*/ 00213000
         LR    RDTEREG,CIDREG0                                     0678 00214000
*                     ELSE          /* RESOURCE A DNCB       @Z40GKD9*/ 00215000
*                       DO;         /* GET ADDR RDTE FROM NCB      0679 00216000
*                                                            @Z40GKD9*/ 00217000
         B     @RC00677                                            0679 00218000
@RF00677 DS    0H                                                  0680 00219000
*                         RDTEREG=CIDREG0->NCBRDTE;/* SET RDTE PTR 0680 00220000
*                                                            @Z40GKD9*/ 00221000
         LR    @08,CIDREG0                                         0680 00222000
         L     RDTEREG,NCBRDTE(,@08)                               0680 00223000
*                         CIDREG=WORKREG;/* SET CID @ FOR CIDCTL   0681 00224000
*                                                            @Z40GKD9*/ 00225000
         LR    CIDREG,WORKREG                                      0681 00226000
*                         DO;       /* CIDCTL(FINISH)                */ 00227000
*                           RFY                                    0683 00228000
*                            (EMCR2,                               0683 00229000
*                             EMCR3) RSTD;                         0683 00230000
*                           GEN SETS(RPHWORK)                      0684 00231000
*(STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);              0684 00232000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              00233000
*                           EMCR3='00'X;/* CLEAR EXTRA BITS          */ 00234000
         SLR   EMCR3,EMCR3                                         0685 00235000
*                           CALL ATCLCPTR->ATCCDFIN->ISTSDCCR;/*   0686 00236000
*                                      PROCESS REQUEST               */ 00237000
         L     @08,ATCLCPTR                                        0686 00238000
         L     @15,ATCCDFIN(,@08)                                  0686 00239000
         BALR  @14,@15                                             0686 00240000
*                           RFY                                    0687 00241000
*                            (EMCR2,                               0687 00242000
*                             EMCR3) UNRSTD;                       0687 00243000
*                         END;      /* CIDCTL RELEASE DAF LOCK     0688 00244000
*                                                            @Z40GKD9*/ 00245000
*                       END;        /* END RESOURCE A DNCB   @Z40GKD9*/ 00246000
*                     RFY                                          0690 00247000
*                       WORKREG UNRSTD;/*                    @Z40GKD9*/ 00248000
@RC00677 DS    0H                                                  0691 00249000
*                     ZIBRECNA=RPRNAME;/* PUT SYMBOLIC NAME IN MDR 0691 00250000
*                                                            @Z40GKD9*/ 00251000
         MVC   ZIBRECNA(8,ZIBREG),RPRNAME(RDTEREG)                 0691 00252000
*                   END;            /* END NON-ZERO SWDAF          0692 00253000
*                                      FIELD@Z40GKD9                 */ 00254000
*               ELSE                /* RDTE NOT A PUX OR LUX @Z40GKD9*/ 00255000
*                 ZIBRECNA=RPRNAME; /* PUT SYMBOLIC NAME IN        0693 00256000
*                                      MDR@Z40GKD9                   */ 00257000
         B     @RC00662                                            0693 00258000
@RF00662 MVC   ZIBRECNA(8,ZIBREG),RPRNAME(RDTEREG)                 0693 00259000
*             END;                  /* END RDTE RESOURCE     @Z40GKD9*/ 00260000
*           ELSE                    /* RESOURCE A DNCB               */ 00261000
*             DO;                   /* GET ADDR RTE FROM NCB         */ 00262000
         B     @RC00659                                            0695 00263000
@RF00659 DS    0H                                                  0696 00264000
*               RDTEREG=CIDREG0->NCBRDTE;/* SET RDTE POINTER         */ 00265000
         LR    @11,CIDREG0                                         0696 00266000
         L     RDTEREG,NCBRDTE(,@11)                               0696 00267000
*               CIDREG=NSRUDAF;     /* SET NETWORK ADDRESS   @ZM32042*/ 00268000
         SLR   CIDREG,CIDREG                                       0697 00269000
         ICM   CIDREG,3,NSRUDAF+61(ZIBREG)                         0697 00270000
*               DO;                 /* CIDCTL(FINISH)                */ 00271000
*                 RFY                                              0699 00272000
*                  (EMCR2,                                         0699 00273000
*                   EMCR3) RSTD;                                   0699 00274000
*                 GEN SETS(RPHWORK)                                0700 00275000
*(STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH);              0700 00276000
         STM EMCR0,EMCR15,RPHWORK(RPHPTR) SAVE REGS IN RPH              00277000
*                 EMCR3='00'X;      /* CLEAR EXTRA BITS              */ 00278000
         SLR   EMCR3,EMCR3                                         0701 00279000
*                 CALL ATCLCPTR->ATCCDFIN->ISTSDCCR;/* PROCESS     0702 00280000
*                                      REQUEST                       */ 00281000
         L     @11,ATCLCPTR                                        0702 00282000
         L     @15,ATCCDFIN(,@11)                                  0702 00283000
         BALR  @14,@15                                             0702 00284000
*                 RFY                                              0703 00285000
*                  (EMCR2,                                         0703 00286000
*                   EMCR3) UNRSTD;                                 0703 00287000
*               END;                /* CIDCTL RELEASE DAF LOCK       */ 00288000
*               ZIBRECNA=RPRNAME;   /* PUT SYMBOLIC NAME IN MDR    0705 00289000
*                                                            @Z40GKD9*/ 00290000
         MVC   ZIBRECNA(8,ZIBREG),RPRNAME(RDTEREG)                 0705 00291000
*             END;                  /* END RESOURCE A DNCB           */ 00292000
*           RFY                                                    0707 00293000
*            (SAVER13,                                             0707 00294000
*             SAVER1) RSTD;         /* RECORD DESTROYS REG 1 AND   0707 00295000
*                                      NEEDS 18 WORD SAVE AREA       */ 00296000
@RC00659 DS    0H                                                  0708 00297000
*           SAVER1=RPHREG;          /* SAVE RPH POINTER              */ 00298000
         LR    SAVER1,RPHREG                                       0708 00299000
*           SAVER13=SAVAREG;        /* SAVE SAVEAREA POINTER         */ 00300000
         LR    SAVER13,SAVAREG                                     0709 00301000
*           SAVAREG=ADDR(CRASVC);   /* ACQUIRE 18 WORD SAVE AREA     */ 00302000
         L     SAVAREG,RPHCRR(,RPHREG)                             0710 00303000
         LA    SAVAREG,CRASVC(,SAVAREG)                            0710 00304000
*           GEN CODE REFS(DLTHREG,PLISTREG,PSA,FLCCVT,CVTRECRQ,CVTMAP); 00305000
         IPK                        SAVES CURRENT PSW KEY IN REG2       00306000
         SPKA 0(0)                  SETS PSW KEY TO ZERO                00307000
         RECORD TYPE=LOGREC,        WRITE TO SYS1.LOGREC VIA SVC 76    *00308000
               RCVRY=SETFRR,        CALLER DISABLED RECOVER VIA SETFRR *00309000
               PARMADR=(PLISTREG), ADDRESS OF PARAMETER LIST           *00310000
               LENGTH=(DLTHREG),    LENGTH OF DATA EXCLUDING HEADER    *00311000
               HEADER=YES,    PREFIX DATA WITH HEADER AS PER PARM LIST *00312000
               BUFFER=YES     MOVE BUFFERS TO REQUEST FACILITIES BUFFS  00313000
         SPKA  0(2)           RESTORE PSW KEY TO ORIGINAL               00314000
*           RFY                                                    0712 00315000
*             DLTHREG UNRSTD;                                      0712 00316000
*           RPHREG=SAVER1;          /* RESTORE RPH ADDRESS           */ 00317000
         LR    RPHREG,SAVER1                                       0713 00318000
*           SAVAREG=SAVER13;        /* RESTORE SAVE AREA POINTER     */ 00319000
         LR    SAVAREG,SAVER13                                     0714 00320000
*           RFY                                                    0715 00321000
*            (SAVER1,                                              0715 00322000
*             SAVER13) UNRSTD;                                     0715 00323000
*         END;                      /* END D02                       */ 00324000
*       DO;                         /* LISATCVT                    0717 00325000
*                                      CVTBASE(PAGEABLE,(ATCVTREG))  */ 00326000
@RT00646 DS    0H                                                  0718 00327000
*         ATCVTREG=ATCLCPTR;        /* SET UP ATCVT POINTER          */ 00328000
         L     ATCVTREG,ATCLCPTR                                   0718 00329000
*       END;                        /* LISATCVT RESTORE ATCVT POINTER   00330000
*                                                            @ZM32042*/ 00331000
*     END;                          /* END D01                       */ 00332000
*                                                                  0720 00333000
*   /*****************************************************************/ 00334000
*   /*                                                               */ 00335000
*   /* RELSTORE BUFADDR(ZIBREG)                                      */ 00336000
*   /*                                                               */ 00337000
*   /*****************************************************************/ 00338000
*                                                                  0721 00339000
*   DO;                                                            0721 00340000
*                                                                  0721 00341000
@RT00634 DS    0H                                                  0722 00342000
*/* ATBUILD (ISTATCVT,ISTRPH)                                        */ 00343000
*/* END OF ATBUILD                                                   */ 00344000
*                                                                  0722 00345000
*     RFY                                                          0722 00346000
*      (GPR02P,                                                    0722 00347000
*       GPR03P,                                                    0722 00348000
*       GPR04P,                                                    0722 00349000
*       GPR15P) RSTD;                                              0722 00350000
*     RFY                                                          0723 00351000
*      (GPR01P,                                                    0723 00352000
*       GPR13P) RSTD;                                              0723 00353000
*     GENERATE REFS(GPR01P,GPR02P,GPR13P) SETS(RPHWORK);           0724 00354000
          STM GPR02P,GPR13P,RPHWORK(GPR01P)                             00355000
*     RFY                                                          0725 00356000
*       GPR13P UNRSTD;                                             0725 00357000
*     GPR04P=ZIBREG;                                               0726 00358000
         LR    GPR04P,ZIBREG                                       0726 00359000
*     DCL                                                          0727 00360000
*       1 FMZA0035 FIXED(31) STATIC LOCAL,                         0727 00361000
*        2 * FIXED(8) INIT(64),                                    0727 00362000
*        2 * PTR(24) INIT(0);                                      0727 00363000
*     GPR03F=FMZA0035;                                             0728 00364000
         L     GPR03F,FMZA0035                                     0728 00365000
*     DO;                           /* LISATCVT                    0729 00366000
*                                      CVTBASE(PAGEABLE,(GPR15P))    */ 00367000
*       GPR15P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 00368000
         L     GPR15P,ATCLCPTR                                     0730 00369000
*     END;                          /* LISATCVT                      */ 00370000
*     GPR02P=GPR15P->ATCBPDA;                                      0732 00371000
         L     GPR02P,ATCBPDA(,GPR15P)                             0732 00372000
*     GPR15P=GPR15P->ATCSMRS;                                      0733 00373000
         L     GPR15P,ATCSMRS(,GPR15P)                             0733 00374000
*     DCL                                                          0734 00375000
*       FMZL0035 BASED(GPR15P) LABEL VALUERANGE(*);                0734 00376000
*     CALL FMZL0035;                                               0735 00377000
         BALR  @14,@15                                             0735 00378000
*     RFY                                                          0736 00379000
*       GPR13P RSTD;                                               0736 00380000
*     GENERATE REFS(GPR01P,RPHWORK) SETS(GPR02P,GPR13P);           0737 00381000
          LM GPR02P,GPR13P,RPHWORK(GPR01P)                              00382000
*     RFY                                                          0738 00383000
*      (GPR01P,                                                    0738 00384000
*       GPR13P) UNRSTD;                                            0738 00385000
*     RFY                                                          0739 00386000
*      (GPR02P,                                                    0739 00387000
*       GPR03P,                                                    0739 00388000
*       GPR04P,                                                    0739 00389000
*       GPR15P) UNRSTD;                                            0739 00390000
*   END;                            /* *********END OF RELSTORE    0740 00391000
*                                      EXPANSION********* RELEASE MDR   00392000
*                                      RECORD BUFFER                 */ 00393000
*/* TPZRETN                                                          */ 00394000
*                                                                  0741 00395000
*   DO;                                                            0741 00396000
*     RFY                                                          0742 00397000
*      (GPR07P,                                                    0742 00398000
*       GPR14P,                                                    0742 00399000
*       GPR15P) RSTD;                                              0742 00400000
*     GPR13P=ZSAZSVBC;                                             0743 00401000
         L     GPR13P,ZSAZSVBC(,GPR13P)                            0743 00402000
*     IF GPR13P=0 THEN                                             0744 00403000
         LTR   GPR13P,GPR13P                                       0744 00404000
         BZ    @RT00744                                            0744 00405000
*       ;                           /* TPDVTS ISTZFARR               */ 00406000
*     ELSE                                                         0746 00407000
*       GPR14P=ZSAZSVRR;                                           0746 00408000
         L     GPR14P,ZSAZSVRR(,GPR13P)                            0746 00409000
*     GEN REFS(ZSAZSVVR)(LM    7,12,ZSAZSVVR+0(13));               0747 00410000
@RT00744 DS    0H                                                  0747 00411000
         LM    7,12,ZSAZSVVR+0(13)                                      00412000
*     GEN REFS(GPR14P) EXIT NOSEQFLOW(BR    GPR14P);               0748 00413000
         BR    GPR14P                                                   00414000
*     RFY                                                          0749 00415000
*      (GPR07P,                                                    0749 00416000
*       GPR14P,                                                    0749 00417000
*       GPR15P) UNRSTD;                                            0749 00418000
*   END;                                                           0750 00419000
*                                                                  0750 00420000
*/* END TPZRETN                                                      */ 00421000
*                                                                  0751 00422000
*                                   /* RETURN TO CALLER              */ 00423000
*/* TPEPILOG                                                         */ 00424000
*                                                                  0751 00425000
*   GEN(PRINT OFF);                                                0751 00426000
         PRINT OFF                                                      00427000
*   DECLARE                                                        0752 00428000
*     EMCR0 PTR REG(0),                                            0752 00429000
*     EMCR1 PTR REG(1),                                            0752 00430000
*     EMCR2 PTR REG(2),                                            0752 00431000
*     EMCR3 PTR REG(3),                                            0752 00432000
*     EMCR4 PTR REG(4),                                            0752 00433000
*     EMCR5 PTR REG(5),                                            0752 00434000
*     EMCR6 PTR REG(6),                                            0752 00435000
*     EMCR7 PTR REG(7),                                            0752 00436000
*     EMCR8 PTR REG(8),                                            0752 00437000
*     EMCR9 PTR REG(9),                                            0752 00438000
*     EMCR10 PTR REG(10),                                          0752 00439000
*     EMCR11 PTR REG(11),                                          0752 00440000
*     EMCR12 PTR REG(12),                                          0752 00441000
*     EMCR13 PTR REG(13),                                          0752 00442000
*     EMCR14 PTR REG(14),                                          0752 00443000
*     EMCR15 PTR REG(15);                                          0752 00444000
*   DECLARE                                                        0753 00445000
*     ISTSDCCA ENTRY BASED(ATCCDADD) VALRG(*),/* CIDCTL ADD ROUTINE  */ 00446000
*     ISTSDCCD ENTRY BASED(ATCCDDEL) VALRG(*),/* CIDCTL DELETE     0753 00447000
*                                      ROUTINE                       */ 00448000
*     ISTSDCCF ENTRY BASED(ATCCDFND) VALRG(*),/* CIDCTL FIND ROUTINE */ 00449000
*     ISTSDCCN ENTRY BASED(ATCCDFDN) VALRG(*),/* CIDCTL FIND NCB   0753 00450000
*                                      ROUTINE                       */ 00451000
*     ISTSDCCR ENTRY BASED(ATCCDFIN) VALRG(*);/* CIDCTL FINISH     0753 00452000
*                                      ROUTINE                       */ 00453000
*   DCL                                                            0754 00454000
*     CMZCIDM FIXED(15) DEFINED(ATCCIDM);/* CIDMASK ALIAS            */ 00455000
*   GEN(PRINT ON);                                                 0755 00456000
*                                                                  0755 00457000
         PRINT ON                                                       00458000
*/* END OF TPEPILOG                                                  */ 00459000
*                                                                  0756 00460000
*   END ISTZDMMB                                                   0756 00461000
*                                                                  0756 00462000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00463000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00464000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00465000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 00466000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00467000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00468000
*                                                                  0756 00469000
*       ;                                                          0756 00470000
@EL00001 DS    0H                                                  0756 00471000
@EF00001 DS    0H                                                  0756 00472000
@ER00001 BR    @14                                                 0756 00473000
@DATA    DS    0H                                                       00474000
@DATD    DSECT                                                          00475000
         DS    0F                                                       00476000
ISTZDMMB CSECT                                                          00477000
         DS    0F                                                       00478000
@CF01996 DC    F'12'                                                    00479000
@CF05440 DC    XL4'0000FFFF'                                            00480000
@DATD    DSECT                                                          00481000
         DS    0D                                                       00482000
SRBPTR   DS    A                                                        00483000
IOSBPTR  DS    A                                                        00484000
UCBPTR   DS    A                                                        00485000
BDUPTR   DS    A                                                        00486000
BTUPTR   DS    A                                                        00487000
LCPBPTR  DS    A                                                        00488000
DNCBPTR  DS    A                                                        00489000
FSBPTR   DS    A                                                        00490000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00491000
@ENDDATD EQU   *                                                        00492000
ISTZDMMB CSECT                                                          00493000
         DS    0F                                                       00494000
@SIZDATD DC    AL1(0)                                                   00495000
         DC    AL3(@ENDDATD-@DATD)                                      00496000
         DS    0D                                                       00497000
FMZA0035 DS    FL4                                                      00498000
         ORG   FMZA0035                                                 00499000
@NM00097 DC    AL1(64)                                                  00500000
@NM00098 DC    AL3(0)                                                   00501000
         ORG   FMZA0035+4                                               00502000
@CC05408 DC    C'DCMB'                                                  00503000
@CB05382 DC    X'9100058A'                                              00504000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00505000
@01      EQU   01                                                       00506000
@02      EQU   02                                                       00507000
@03      EQU   03                                                       00508000
@04      EQU   04                                                       00509000
@05      EQU   05                                                       00510000
@06      EQU   06                                                       00511000
@07      EQU   07                                                       00512000
@08      EQU   08                                                       00513000
@09      EQU   09                                                       00514000
@10      EQU   10                                                       00515000
@11      EQU   11                                                       00516000
@12      EQU   12                                                       00517000
@13      EQU   13                                                       00518000
@14      EQU   14                                                       00519000
@15      EQU   15                                                       00520000
GPR01P   EQU   @01                                                      00521000
GPR02P   EQU   @02                                                      00522000
GPR03F   EQU   @03                                                      00523000
GPR03P   EQU   @03                                                      00524000
GPR04P   EQU   @04                                                      00525000
GPR07P   EQU   @07                                                      00526000
GPR12P   EQU   @12                                                      00527000
GPR13P   EQU   @13                                                      00528000
GPR14P   EQU   @14                                                      00529000
GPR15P   EQU   @15                                                      00530000
RPHPTR   EQU   @01                                                      00531000
CIDREG0  EQU   @00                                                      00532000
RPHREG   EQU   @01                                                      00533000
ATCVTREG EQU   @02                                                      00534000
CIDREG   EQU   @02                                                      00535000
ICNCBREG EQU   @03                                                      00536000
DNCBREG  EQU   @04                                                      00537000
FMCBREG  EQU   @05                                                      00538000
PLISTREG EQU   @07                                                      00539000
ZIBREG   EQU   @06                                                      00540000
SAVER13  EQU   @09                                                      00541000
SAVER1   EQU   @08                                                      00542000
RDTEREG  EQU   @09                                                      00543000
DLTHREG  EQU   @10                                                      00544000
WORKREG  EQU   @11                                                      00545000
BASEREG  EQU   @12                                                      00546000
SAVAREG  EQU   @13                                                      00547000
RTNREG   EQU   @14                                                      00548000
RCDREG   EQU   @15                                                      00549000
EMCR2    EQU   @02                                                      00550000
EMCR3    EQU   @03                                                      00551000
EMCR0    EQU   @00                                                      00552000
EMCR1    EQU   @01                                                      00553000
EMCR10   EQU   @10                                                      00554000
EMCR11   EQU   @11                                                      00555000
EMCR12   EQU   @12                                                      00556000
EMCR13   EQU   @13                                                      00557000
EMCR14   EQU   @14                                                      00558000
EMCR15   EQU   @15                                                      00559000
EMCR4    EQU   @04                                                      00560000
EMCR5    EQU   @05                                                      00561000
EMCR6    EQU   @06                                                      00562000
EMCR7    EQU   @07                                                      00563000
EMCR8    EQU   @08                                                      00564000
EMCR9    EQU   @09                                                      00565000
GPR00F   EQU   @00                                                      00566000
GPR00P   EQU   @00                                                      00567000
GPR01F   EQU   @01                                                      00568000
GPR02F   EQU   @02                                                      00569000
GPR04F   EQU   @04                                                      00570000
GPR05F   EQU   @05                                                      00571000
GPR05P   EQU   @05                                                      00572000
GPR06F   EQU   @06                                                      00573000
GPR06P   EQU   @06                                                      00574000
GPR07F   EQU   @07                                                      00575000
GPR08F   EQU   @08                                                      00576000
GPR08P   EQU   @08                                                      00577000
GPR09F   EQU   @09                                                      00578000
GPR09P   EQU   @09                                                      00579000
GPR10F   EQU   @10                                                      00580000
GPR10P   EQU   @10                                                      00581000
GPR11F   EQU   @11                                                      00582000
GPR11P   EQU   @11                                                      00583000
GPR12F   EQU   @12                                                      00584000
GPR13F   EQU   @13                                                      00585000
GPR14F   EQU   @14                                                      00586000
GPR15F   EQU   @15                                                      00587000
PSA      EQU   0                                                        00588000
FLCRNPSW EQU   PSA                                                      00589000
FLCROPSW EQU   PSA+8                                                    00590000
FLCICCW2 EQU   PSA+16                                                   00591000
FLCCVT   EQU   FLCICCW2                                                 00592000
PSAEEPSW EQU   PSA+132                                                  00593000
PSAESPSW EQU   PSA+136                                                  00594000
FLCSVILC EQU   PSAESPSW+1                                               00595000
PSAEPPSW EQU   PSA+140                                                  00596000
FLCPIILC EQU   PSAEPPSW+1                                               00597000
FLCPICOD EQU   PSAEPPSW+2                                               00598000
PSAPICOD EQU   FLCPICOD+1                                               00599000
FLCTEA   EQU   PSAEPPSW+4                                               00600000
FLCPER   EQU   PSA+152                                                  00601000
FLCMCLA  EQU   PSA+168                                                  00602000
FLCIOEL  EQU   FLCMCLA+4                                                00603000
FLCIOA   EQU   FLCMCLA+16                                               00604000
FLCFSA   EQU   FLCMCLA+80                                               00605000
PSASUPER EQU   PSA+552                                                  00606000
PSASUP1  EQU   PSASUPER                                                 00607000
PSASUP2  EQU   PSASUPER+1                                               00608000
PSASUP3  EQU   PSASUPER+2                                               00609000
PSASUP4  EQU   PSASUPER+3                                               00610000
PSACLHT  EQU   PSA+640                                                  00611000
PSALKSA  EQU   PSA+696                                                  00612000
PSAHLHI  EQU   PSA+760                                                  00613000
PSADSSFL EQU   PSA+836                                                  00614000
PSADSSF1 EQU   PSADSSFL                                                 00615000
PSADSSF3 EQU   PSADSSFL+2                                               00616000
PSADSSF4 EQU   PSADSSFL+3                                               00617000
PSARSVT  EQU   PSA+896                                                  00618000
CVTPTR   EQU   16                                                       00619000
ATCLCPTR EQU   1032                                                     00620000
SRBSECT  EQU   0                                                        00621000
SRBFLC   EQU   SRBSECT+12                                               00622000
IOSB     EQU   0                                                        00623000
IOSFLA   EQU   IOSB                                                     00624000
IOSACHN  EQU   IOSFLA                                                   00625000
IOSFLB   EQU   IOSB+1                                                   00626000
IOSFLC   EQU   IOSB+2                                                   00627000
IOSDVALT EQU   IOSFLC                                                   00628000
IOSPKEY  EQU   IOSB+12                                                  00629000
IOSOPT   EQU   IOSB+14                                                  00630000
IOSOPT2  EQU   IOSB+15                                                  00631000
IOSUCB   EQU   IOSB+16                                                  00632000
@NM00004 EQU   IOSB+20                                                  00633000
IOSCSW   EQU   @NM00004+1                                               00634000
IOSTATUS EQU   IOSCSW+3                                                 00635000
IOSIPIB  EQU   IOSB+44                                                  00636000
IOSPATH  EQU   IOSB+86                                                  00637000
IOSCHN   EQU   IOSPATH                                                  00638000
IOSCKEY  EQU   IOSB+89                                                  00639000
IOSEEKA  EQU   IOSB+100                                                 00640000
IOSCCHH  EQU   IOSEEKA+3                                                00641000
IOSSKHH  EQU   IOSCCHH+2                                                00642000
UCB      EQU   0                                                        00643000
UCBOB    EQU   0                                                        00644000
UCBJBNR  EQU   UCBOB                                                    00645000
UCBFL5   EQU   UCBOB+1                                                  00646000
UCBAF    EQU   UCBFL5                                                   00647000
UCBSTAT  EQU   UCBOB+3                                                  00648000
UCBCHAN  EQU   UCBOB+4                                                  00649000
UCBSFLS  EQU   UCBOB+6                                                  00650000
UCBFLA   EQU   UCBSFLS                                                  00651000
UCBFL1   EQU   UCBFLA                                                   00652000
UCBBSY   EQU   UCBFL1                                                   00653000
UCBNRY   EQU   UCBFL1                                                   00654000
UCBPST   EQU   UCBFL1                                                   00655000
UCBCUB   EQU   UCBFL1                                                   00656000
UCBFLB   EQU   UCBSFLS+1                                                00657000
UCBCHM   EQU   UCBOB+8                                                  00658000
UCBCHM1  EQU   UCBCHM                                                   00659000
UCBPTH0  EQU   UCBCHM1                                                  00660000
UCBPTH1  EQU   UCBCHM1                                                  00661000
UCBWGT   EQU   UCBOB+12                                                 00662000
UCBTYP   EQU   UCBOB+16                                                 00663000
UCBTBYT1 EQU   UCBTYP                                                   00664000
UCB1FEA5 EQU   UCBTBYT1                                                 00665000
UCB1FEA6 EQU   UCBTBYT1                                                 00666000
UCBTBYT2 EQU   UCBTYP+1                                                 00667000
UCB2OPT2 EQU   UCBTBYT2                                                 00668000
UCBDUDN1 EQU   UCB2OPT2                                                 00669000
UCB2OPT3 EQU   UCBTBYT2                                                 00670000
UCBDUDN2 EQU   UCB2OPT3                                                 00671000
UCB2OPT4 EQU   UCBTBYT2                                                 00672000
UCBRWTAU EQU   UCB2OPT4                                                 00673000
UCB2OPT6 EQU   UCBTBYT2                                                 00674000
UCB2OPT7 EQU   UCBTBYT2                                                 00675000
UCBTBYT3 EQU   UCBTYP+2                                                 00676000
UCBDVCLS EQU   UCBTBYT3                                                 00677000
UCBTBYT4 EQU   UCBTYP+3                                                 00678000
UCBEXTPT EQU   UCBOB+20                                                 00679000
UCBFLC   EQU   UCBEXTPT                                                 00680000
UCBDEV   EQU   UCBOB+24                                                 00681000
UCBCMEXT EQU   0                                                        00682000
UCBATI   EQU   UCBCMEXT+3                                               00683000
@NM00013 EQU   UCBATI                                                   00684000
UCBFLP1  EQU   UCBCMEXT+5                                               00685000
UCBMT    EQU   0                                                        00686000
UCBOCR   EQU   0                                                        00687000
UCB3540X EQU   0                                                        00688000
UCBDKBYT EQU   UCB3540X+6                                               00689000
UCB3800X EQU   0                                                        00690000
UCBOPTNS EQU   UCB3800X                                                 00691000
UCBACTIV EQU   UCB3800X+3                                               00692000
UCBMDRBF EQU   UCB3800X+36                                              00693000
UCBUCS   EQU   0                                                        00694000
UCBUCSOP EQU   UCBUCS+4                                                 00695000
UCBFCBOP EQU   UCBUCS+5                                                 00696000
CVTMAP   EQU   0                                                        00697000
CVTDAR   EQU   CVTMAP+72                                                00698000
CVTFLGS1 EQU   CVTDAR                                                   00699000
CVTDCB   EQU   CVTMAP+116                                               00700000
CVTIERLC EQU   CVTMAP+144                                               00701000
CVTOPTA  EQU   CVTMAP+182                                               00702000
CVTOPTB  EQU   CVTMAP+183                                               00703000
CVTGTF   EQU   CVTMAP+236                                               00704000
CVTGTFST EQU   CVTGTF                                                   00705000
CVTGTFS  EQU   CVTGTFST                                                 00706000
CVTSTATE EQU   CVTGTFST                                                 00707000
CVTTMODE EQU   CVTGTFST                                                 00708000
CVTFORM  EQU   CVTGTFST                                                 00709000
CVTAQAVT EQU   CVTMAP+240                                               00710000
CVTTCMFG EQU   CVTAQAVT                                                 00711000
CVTVOLM2 EQU   CVTMAP+244                                               00712000
CVTTATA  EQU   CVTVOLM2                                                 00713000
CVTTSKS  EQU   CVTTATA                                                  00714000
CVTVOLF2 EQU   CVTTSKS                                                  00715000
CVTTAT   EQU   CVTTATA+1                                                00716000
CVTATER  EQU   CVTMAP+248                                               00717000
CVTEXT1  EQU   CVTMAP+252                                               00718000
CVTPURG  EQU   CVTMAP+260                                               00719000
CVTQMSG  EQU   CVTMAP+268                                               00720000
CVTDMSR  EQU   CVTMAP+272                                               00721000
CVTERPV  EQU   CVTMAP+316                                               00722000
CVTINTLA EQU   CVTMAP+320                                               00723000
CVTAPF   EQU   CVTMAP+324                                               00724000
CVTEXT2  EQU   CVTMAP+328                                               00725000
CVTHJES  EQU   CVTMAP+332                                               00726000
CVTPGSIA EQU   CVTMAP+348                                               00727000
CVTA1F1  EQU   CVTMAP+356                                               00728000
CVTSYSK  EQU   CVTMAP+357                                               00729000
CVTVOLM1 EQU   CVTMAP+380                                               00730000
CVTVOLF1 EQU   CVTVOLM1                                                 00731000
CVTATMCT EQU   CVTMAP+388                                               00732000
CVTXTNT1 EQU   0                                                        00733000
CVTXTNT2 EQU   0                                                        00734000
CVTDSSV  EQU   CVTXTNT2                                                 00735000
CVTFLGBT EQU   CVTXTNT2+5                                               00736000
CVTQID   EQU   CVTXTNT2+24                                              00737000
CVTSHS   EQU   CVTXTNT2+40                                              00738000
CVTRV400 EQU   CVTXTNT2+52                                              00739000
CVTRV409 EQU   CVTXTNT2+53                                              00740000
CVTATCVT EQU   CVTXTNT2+64                                              00741000
CVTRV429 EQU   CVTXTNT2+84                                              00742000
CVTRV438 EQU   CVTXTNT2+85                                              00743000
CVTRV457 EQU   CVTXTNT2+112                                             00744000
CVTRV466 EQU   CVTXTNT2+113                                             00745000
CVTFIX   EQU   0                                                        00746000
CVTRELNO EQU   CVTFIX+252                                               00747000
ISTPAB   EQU   0                                                        00748000
PABWQCHN EQU   ISTPAB                                                   00749000
PABWEQA  EQU   PABWQCHN                                                 00750000
PABCHAIN EQU   PABWQCHN+4                                               00751000
PABRPHFG EQU   ISTPAB+12                                                00752000
PABFLAGS EQU   PABRPHFG                                                 00753000
PABERLCK EQU   PABFLAGS                                                 00754000
PABERRLK EQU   PABERLCK                                                 00755000
ISTLOK   EQU   0                                                        00756000
LOKCHN   EQU   ISTLOK+1                                                 00757000
LOKCHNG  EQU   LOKCHN                                                   00758000
@NM00041 EQU   LOKCHNG+2                                                00759000
ISTDYPAB EQU   0                                                        00760000
ISTRPH   EQU   0                                                        00761000
RPHCNTL  EQU   ISTRPH                                                   00762000
RPHFLAGS EQU   RPHCNTL+2                                                00763000
RPHAPTYP EQU   RPHFLAGS                                                 00764000
RPHFSTLC EQU   RPHFLAGS                                                 00765000
RPHFLGB  EQU   RPHCNTL+3                                                00766000
RPHRPHA  EQU   ISTRPH+4                                                 00767000
RPHTSKID EQU   ISTRPH+8                                                 00768000
RPHRESMA EQU   ISTRPH+16                                                00769000
RPHWPFLG EQU   RPHRESMA                                                 00770000
RPHWEA   EQU   ISTRPH+24                                                00771000
RPHCSPA  EQU   RPHWEA                                                   00772000
RPHSRPRM EQU   ISTRPH+28                                                00773000
RPHCRR   EQU   ISTRPH+32                                                00774000
RPHPABQA EQU   ISTRPH+36                                                00775000
RPHWORK  EQU   ISTRPH+40                                                00776000
RPHSAVE1 EQU   RPHWORK                                                  00777000
RPHSBITS EQU   RPHSAVE1+1                                               00778000
ISTATCVT EQU   0                                                        00779000
ATCCOM   EQU   ISTATCVT                                                 00780000
ATCSTAT  EQU   ATCCOM                                                   00781000
ATCSTAT1 EQU   ATCSTAT                                                  00782000
ATCSTFLG EQU   ATCSTAT+1                                                00783000
ATCPOFLG EQU   ATCSTAT+2                                                00784000
ATCSTAT4 EQU   ATCSTAT+3                                                00785000
ATCBPDA  EQU   ATCCOM+128                                               00786000
ATCIOTRC EQU   ATCCOM+140                                               00787000
ATCTHTRC EQU   ATCIOTRC                                                 00788000
ATCSMRS  EQU   ATCCOM+188                                               00789000
ATCCIDM  EQU   ATCCOM+266                                               00790000
ATCCDADD EQU   ISTATCVT+276                                             00791000
ATCCDDEL EQU   ISTATCVT+280                                             00792000
ATCCDFND EQU   ISTATCVT+284                                             00793000
ATCCSMR  EQU   ISTATCVT+296                                             00794000
ATCSHRFG EQU   ISTATCVT+316                                             00795000
ATCHPGM  EQU   ISTATCVT+384                                             00796000
ATCCDFIN EQU   ISTATCVT+460                                             00797000
ATCCDFDN EQU   ISTATCVT+464                                             00798000
ATCVLCNT EQU   ISTATCVT+772                                             00799000
ATCRNO   EQU   ISTATCVT+788                                             00800000
ATCSOPD  EQU   ISTATCVT+792                                             00801000
ATCSIPD  EQU   ISTATCVT+800                                             00802000
ATCSECST EQU   ISTATCVT+812                                             00803000
ATCSTAT2 EQU   ISTATCVT+818                                             00804000
ATCVTBAM EQU   ISTATCVT+908                                             00805000
@NM00052 EQU   ATCVTBAM+3                                               00806000
ATCAOSM  EQU   ISTATCVT+912                                             00807000
ATCGSRBQ EQU   ATCAOSM+4                                                00808000
ATCGSRBG EQU   ATCGSRBQ                                                 00809000
ATCICAPP EQU   ATCAOSM+100                                              00810000
ATCLDAPP EQU   ATCAOSM+120                                              00811000
ATCDAPVT EQU   ATCAOSM+140                                              00812000
ATCVTFLG EQU   ATCAOSM+392                                              00813000
ATCZFLAG EQU   ATCAOSM+588                                              00814000
ATCZF001 EQU   ATCZFLAG                                                 00815000
ISTBDU   EQU   0                                                        00816000
BDUMODIF EQU   ISTBDU+1                                                 00817000
BDUMOD1  EQU   BDUMODIF                                                 00818000
BDUDAF   EQU   ISTBDU+2                                                 00819000
BDUFUNC  EQU   BDUDAF                                                   00820000
BDUCHECK EQU   BDUFUNC                                                  00821000
BDUFLAGS EQU   BDUDAF+1                                                 00822000
ISTBTU   EQU   0                                                        00823000
BTUBTH   EQU   ISTBTU                                                   00824000
BTUFID   EQU   BTUBTH                                                   00825000
BTUREQ   EQU   BTUBTH+6                                                 00826000
BTURQFLG EQU   BTUREQ                                                   00827000
BTUDCF   EQU   BTUBTH+8                                                 00828000
BTURH    EQU   BTUBTH+10                                                00829000
BTUSYSTR EQU   ISTBTU+18                                                00830000
ISTLCCW  EQU   0                                                        00831000
LCCWOP   EQU   ISTLCCW                                                  00832000
LCCWRWOP EQU   LCCWOP                                                   00833000
LCCWCTL  EQU   LCCWRWOP                                                 00834000
LCCWFLAG EQU   ISTLCCW+1                                                00835000
LCCWLSI  EQU   LCCWFLAG                                                 00836000
ISTLCPB  EQU   0                                                        00837000
LCPREQTG EQU   ISTLCPB+2                                                00838000
LCPFLAGS EQU   LCPREQTG                                                 00839000
LCPZF001 EQU   LCPFLAGS                                                 00840000
LCPZRT02 EQU   LCPZF001                                                 00841000
LCPZF002 EQU   LCPFLAGS                                                 00842000
LCPZRT03 EQU   LCPZF002                                                 00843000
LCPZF003 EQU   LCPFLAGS                                                 00844000
LCPZRT04 EQU   LCPZF003                                                 00845000
LCPZF004 EQU   LCPFLAGS                                                 00846000
LCPZRT05 EQU   LCPZF004                                                 00847000
LCPZRT06 EQU   LCPFLAGS                                                 00848000
LCPZRT07 EQU   LCPFLAGS                                                 00849000
LCPMNRCD EQU   LCPREQTG+1                                               00850000
LCPZRT08 EQU   LCPMNRCD                                                 00851000
LCPZRT09 EQU   LCPMNRCD                                                 00852000
LCPCHAIN EQU   ISTLCPB+4                                                00853000
LCPCHAI1 EQU   LCPCHAIN                                                 00854000
LCPRUCNT EQU   ISTLCPB+8                                                00855000
LCPFLAG2 EQU   ISTLCPB+9                                                00856000
LCPTLBPI EQU   LCPFLAG2                                                 00857000
LCPFID0  EQU   LCPFLAG2                                                 00858000
LCPSEQ   EQU   ISTLCPB+10                                               00859000
LCPCID   EQU   ISTLCPB+16                                               00860000
LCPFDBA  EQU   ISTLCPB+24                                               00861000
LCPFLG1  EQU   ISTLCPB+37                                               00862000
LCPFLCCW EQU   ISTLCPB+40                                               00863000
LCPLCCW  EQU   ISTLCPB+48                                               00864000
LCPPABA  EQU   LCPLCCW+4                                                00865000
LCPRPHA  EQU   LCPPABA                                                  00866000
ISTZSAVE EQU   0                                                        00867000
ZSAZSVBC EQU   ISTZSAVE                                                 00868000
ZSAZSVMS EQU   ZSAZSVBC                                                 00869000
ZSAZACTV EQU   ZSAZSVMS                                                 00870000
ZSAZSVFC EQU   ISTZSAVE+4                                               00871000
ZSAZSVRR EQU   ISTZSAVE+8                                               00872000
ZSAZSVVR EQU   ISTZSAVE+12                                              00873000
ZSAZTRAC EQU   ISTZSAVE+36                                              00874000
ISTPFCRR EQU   0                                                        00875000
PFCCRR   EQU   ISTPFCRR                                                 00876000
PFCCRRID EQU   PFCCRR                                                   00877000
PFCCRRLN EQU   PFCCRR+2                                                 00878000
PFCHDR   EQU   ISTPFCRR+4                                               00879000
PFCCRRO  EQU   PFCHDR                                                   00880000
PFCFRRO  EQU   PFCHDR+4                                                 00881000
ISTCFCRR EQU   0                                                        00882000
CFCAUDIT EQU   ISTCFCRR                                                 00883000
CFCNTRD  EQU   CFCAUDIT                                                 00884000
CFCCRT   EQU   CFCAUDIT+1                                               00885000
ISTZCRR  EQU   0                                                        00886000
ZCRCRR   EQU   ISTZCRR                                                  00887000
ZCRFLGS1 EQU   ISTZCRR+12                                               00888000
ZCRFLGS2 EQU   ISTZCRR+13                                               00889000
ZCRSWFLD EQU   ISTZCRR+14                                               00890000
ZCRENDSH EQU   ZCRSWFLD                                                 00891000
ZCRNDLCP EQU   ZCRSWFLD                                                 00892000
ZCRRESET EQU   ZCRSWFLD                                                 00893000
ZCRFLGS3 EQU   ISTZCRR+15                                               00894000
ZCRGENSW EQU   ISTZCRR+16                                               00895000
ZCRPFLGS EQU   ISTZCRR+17                                               00896000
ZCRIBPR  EQU   ISTZCRR+18                                               00897000
ZCRSCPSW EQU   ISTZCRR+19                                               00898000
ZCRPARMS EQU   ISTZCRR+24                                               00899000
ZCRFBPTR EQU   ZCRPARMS                                                 00900000
ZCRDFRDA EQU   ZCRPARMS+10                                              00901000
ZCRPCOD1 EQU   ZCRPARMS+12                                              00902000
ZCRPLSBF EQU   ZCRPCOD1                                                 00903000
ZCRPCOD2 EQU   ZCRPARMS+13                                              00904000
ZCRSVRTN EQU   ISTZCRR+56                                               00905000
ZCRWKARA EQU   ISTZCRR+156                                              00906000
ZCRCIDSV EQU   ISTZCRR+192                                              00907000
ZCRAUDIT EQU   ISTZCRR+440                                              00908000
ZCRENTER EQU   ZCRAUDIT+5                                               00909000
ZCREDCMB EQU   ZCRENTER+7                                               00910000
ZCRLCPB  EQU   ISTZCRR+480                                              00911000
ZCRRHRU  EQU   ZCRLCPB                                                  00912000
ISTASCRR EQU   0                                                        00913000
ASCFLAGS EQU   ISTASCRR+16                                              00914000
ASCFLG1  EQU   ASCFLAGS                                                 00915000
ASCFLG2  EQU   ASCFLAGS+2                                               00916000
ASCFLG3  EQU   ASCFLAGS+4                                               00917000
ASCUSRGS EQU   ISTASCRR+28                                              00918000
ISTAPCRR EQU   0                                                        00919000
APCATFLG EQU   ISTAPCRR+16                                              00920000
APCRFLG  EQU   ISTAPCRR+18                                              00921000
APCSAVE  EQU   ISTAPCRR+44                                              00922000
APCCOMF  EQU   ISTAPCRR+116                                             00923000
APCCOMF1 EQU   APCCOMF                                                  00924000
APC31FLG EQU   ISTAPCRR+132                                             00925000
APC52FLG EQU   ISTAPCRR+133                                             00926000
APC53FLG EQU   ISTAPCRR+134                                             00927000
APC54FLG EQU   ISTAPCRR+135                                             00928000
APC57FLG EQU   ISTAPCRR+136                                             00929000
ISTCRA   EQU   0                                                        00930000
CRABASIC EQU   ISTCRA                                                   00931000
CRAHDR   EQU   CRABASIC                                                 00932000
CRACRR   EQU   CRAHDR                                                   00933000
CRALKACT EQU   CRABASIC+8                                               00934000
CRASVC   EQU   ISTCRA+848                                               00935000
CRABUFA  EQU   CRASVC+68                                                00936000
ISTDEVCH EQU   0                                                        00937000
DEVSHCH  EQU   ISTDEVCH                                                 00938000
DEVCHAR  EQU   DEVSHCH                                                  00939000
DEVTCODE EQU   ISTDEVCH+1                                               00940000
DEVFLAGS EQU   ISTDEVCH+3                                               00941000
DEVFCCTL EQU   DEVFLAGS                                                 00942000
DEVCHAR3 EQU   DEVFLAGS                                                 00943000
ISTNCB   EQU   0                                                        00944000
NCBRDTE  EQU   ISTNCB+4                                                 00945000
NCBFLAGS EQU   ISTNCB+24                                                00946000
NCBFRAS  EQU   NCBFLAGS+1                                               00947000
NCBFTRIO EQU   NCBFRAS                                                  00948000
NCBFLAG1 EQU   NCBFLAGS+2                                               00949000
ISTDNCB  EQU   0                                                        00950000
DNCNCB   EQU   ISTDNCB                                                  00951000
DNCOS    EQU   ISTDNCB+56                                               00952000
DNCZFLGS EQU   DNCOS                                                    00953000
DNCBSCED EQU   DNCOS+2                                                  00954000
ISTFDB   EQU   0                                                        00955000
ISTLH    EQU   0                                                        00956000
ISTTH    EQU   0                                                        00957000
THFLAG1  EQU   ISTTH                                                    00958000
THFLGA   EQU   THFLAG1                                                  00959000
THMPF    EQU   THFLGA                                                   00960000
THFLGB   EQU   THFLAG1+1                                                00961000
ISTTH2   EQU   0                                                        00962000
TH2FLAG1 EQU   ISTTH2                                                   00963000
TH2MPF   EQU   TH2FLAG1                                                 00964000
ISTFSB   EQU   0                                                        00965000
FSBFSB   EQU   ISTFSB                                                   00966000
FSBMNRCD EQU   FSBFSB+2                                                 00967000
FSBSFLGS EQU   FSBFSB+3                                                 00968000
FSBFSBA  EQU   FSBFSB+4                                                 00969000
FSBBTH   EQU   FSBFSB+8                                                 00970000
FSBCID   EQU   FSBBTH                                                   00971000
FSBRQTAG EQU   FSBBTH+4                                                 00972000
FSBSEQID EQU   FSBRQTAG                                                 00973000
FSBFLAGS EQU   FSBSEQID                                                 00974000
FSBSEQ   EQU   FSBSEQID+1                                               00975000
FSBCSWST EQU   FSBBTH+6                                                 00976000
FSBTHFLD EQU   FSBCSWST                                                 00977000
FSBTH1   EQU   FSBTHFLD                                                 00978000
FSBSYSRS EQU   FSBTH1                                                   00979000
FSBTH2   EQU   FSBTHFLD+1                                               00980000
FSBEXTRS EQU   FSBTH2                                                   00981000
FSBXFSTS EQU   FSBEXTRS                                                 00982000
FSBXCODE EQU   FSBEXTRS                                                 00983000
FSBNETRS EQU   FSBFSB+16                                                00984000
FSBSRCAT EQU   FSBNETRS                                                 00985000
FSBERC   EQU   FSBNETRS+1                                               00986000
FSBFBMI  EQU   FSBERC                                                   00987000
FSBDMGRS EQU   FSBFSB+18                                                00988000
FSBSS1   EQU   FSBDMGRS                                                 00989000
FSBSS2   EQU   FSBDMGRS+1                                               00990000
FSBLCPB  EQU   FSBFSB+20                                                00991000
FSBMSGID EQU   FSBLCPB                                                  00992000
FSBLCCWA EQU   FSBFSB+24                                                00993000
FSBRLSTS EQU   FSBLCCWA                                                 00994000
ISTZIBUF EQU   0                                                        00995000
ZIBFSM   EQU   ISTZIBUF+4                                               00996000
ISTRH    EQU   0                                                        00997000
RHFLAGS  EQU   ISTRH                                                    00998000
RH1      EQU   RHFLAGS                                                  00999000
RH2      EQU   RHFLAGS+1                                                01000000
RHRETRY  EQU   RH2                                                      01001000
RHRSVD1  EQU   RH2                                                      01002000
RH3      EQU   RHFLAGS+2                                                01003000
ISTNIR   EQU   0                                                        01004000
NIRRU    EQU   ISTNIR+3                                                 01005000
ISTPIU   EQU   0                                                        01006000
PIUNIR   EQU   ISTPIU+10                                                01007000
ISTRU    EQU   0                                                        01008000
RUDATA   EQU   ISTRU                                                    01009000
ISTRUB   EQU   0                                                        01010000
NSRUNA5  EQU   0                                                        01011000
ISTICNCB EQU   0                                                        01012000
@NM00083 EQU   ISTICNCB+53                                              01013000
ICNCKFLD EQU   ISTICNCB+96                                              01014000
ICNFLAG  EQU   ISTICNCB+100                                             01015000
ICNZF006 EQU   ICNFLAG                                                  01016000
ICNFFLAG EQU   ISTICNCB+101                                             01017000
ICNZSWS  EQU   ISTICNCB+102                                             01018000
ICNFLAG2 EQU   ISTICNCB+236                                             01019000
ICNZD001 EQU   ISTICNCB+288                                             01020000
ICNWSCCW EQU   ICNZD001                                                 01021000
ICNZD002 EQU   ISTICNCB+296                                             01022000
ICNZD003 EQU   ISTICNCB+320                                             01023000
ICNRSCCW EQU   ICNZD003                                                 01024000
ICNZD004 EQU   ISTICNCB+328                                             01025000
ICNZS1VR EQU   ISTICNCB+348                                             01026000
ICNSRV02 EQU   ICNZS1VR                                                 01027000
ICNDIEWA EQU   ICNSRV02                                                 01028000
ICNDCDEB EQU   ISTICNCB+480                                             01029000
ICNDIDEB EQU   ICNDCDEB+12                                              01030000
ICNZFLAG EQU   ISTICNCB+508                                             01031000
ICNZH002 EQU   ISTICNCB+509                                             01032000
ICNZS002 EQU   ICNZH002                                                 01033000
ICNZS003 EQU   ICNZH002                                                 01034000
ICNZS004 EQU   ICNZH002                                                 01035000
ICNZS006 EQU   ICNZH002                                                 01036000
ICNZS007 EQU   ICNZH002                                                 01037000
ICNZS008 EQU   ICNZH002                                                 01038000
ICNZS009 EQU   ICNZH002+1                                               01039000
ICNZS00A EQU   ICNZH002+1                                               01040000
ICNIOSB  EQU   ISTICNCB+520                                             01041000
ICNZCONS EQU   ISTICNCB+680                                             01042000
ISTRPRE  EQU   0                                                        01043000
RPRNAME  EQU   ISTRPRE                                                  01044000
RPRCOMID EQU   ISTRPRE+8                                                01045000
RPRENTRY EQU   ISTRPRE+20                                               01046000
RPRFLAGA EQU   ISTRPRE+21                                               01047000
RPRFLAGB EQU   ISTRPRE+22                                               01048000
RPRCAUSE EQU   ISTRPRE+23                                               01049000
RPRSWDAF EQU   ISTRPRE+58                                               01050000
RPRFLAGD EQU   ISTRPRE+61                                               01051000
RPRFLAGC EQU   ISTRPRE+62                                               01052000
ISTRCPRE EQU   0                                                        01053000
RCPPMODE EQU   ISTRCPRE+91                                              01054000
RCPLGNIN EQU   ISTRCPRE+92                                              01055000
ISTRDT   EQU   0                                                        01056000
RDTPLEN  EQU   ISTRDT+72                                                01057000
RDTPRIOR EQU   RDTPLEN                                                  01058000
RDTFLAGB EQU   ISTRDT+91                                                01059000
RDTVYRPH EQU   ISTRDT+108                                               01060000
RDTSTCNT EQU   ISTRDT+112                                               01061000
ISTRAP   EQU   0                                                        01062000
RAPFLG   EQU   ISTRAP+108                                               01063000
RAPFLGB  EQU   ISTRAP+109                                               01064000
RAPFLGC  EQU   ISTRAP+110                                               01065000
ISTRLC   EQU   0                                                        01066000
RLCADR   EQU   ISTRLC+72                                                01067000
RLCFLAG  EQU   RLCADR                                                   01068000
ISTRRN   EQU   0                                                        01069000
RRNADR   EQU   ISTRRN+136                                               01070000
RRNFLAG  EQU   RRNADR                                                   01071000
RRNUCBAD EQU   RRNADR+1                                                 01072000
RRNRDF   EQU   ISTRRN+172                                               01073000
RRNRDFA  EQU   RRNRDF                                                   01074000
RRNRDFB  EQU   RRNRDF+1                                                 01075000
RRNCMF   EQU   ISTRRN+176                                               01076000
RRNCMFA  EQU   RRNCMF                                                   01077000
RRNCMFB  EQU   RRNCMF+1                                                 01078000
RRNCMFC  EQU   RRNCMF+2                                                 01079000
RRNCMFD  EQU   RRNCMF+3                                                 01080000
RRNNMDPD EQU   ISTRRN+192                                               01081000
RRNHPRE  EQU   ISTRRN+216                                               01082000
ISTRGP   EQU   0                                                        01083000
RGPFLG   EQU   ISTRGP+72                                                01084000
ISTRLN   EQU   0                                                        01085000
RLNADR   EQU   ISTRLN+72                                                01086000
RLNFLAG  EQU   RLNADR                                                   01087000
RLNUCBAD EQU   RLNADR+1                                                 01088000
RLNSTAT1 EQU   ISTRLN+86                                                01089000
RLNSTAT2 EQU   ISTRLN+87                                                01090000
RLNRDF   EQU   ISTRLN+88                                                01091000
RLNRDFA  EQU   RLNRDF                                                   01092000
RLNRACNT EQU   RLNRDFA                                                  01093000
RLNRDFB  EQU   RLNRDF+1                                                 01094000
RLNCRFLG EQU   ISTRLN+102                                               01095000
RLNLSCMD EQU   RLNCRFLG                                                 01096000
ISTRPT   EQU   0                                                        01097000
RPTLNCID EQU   ISTRPT+116                                               01098000
RPTDITT  EQU   ISTRPT+128                                               01099000
RPTFLAG1 EQU   ISTRPT+140                                               01100000
ISTRCL   EQU   0                                                        01101000
RCLADR   EQU   ISTRCL+72                                                01102000
RCLFLAG  EQU   RCLADR                                                   01103000
ISTRTR   EQU   0                                                        01104000
RTRADR   EQU   ISTRTR+124                                               01105000
RTRFLAG  EQU   RTRADR                                                   01106000
RTRRDFA  EQU   ISTRTR+136                                               01107000
RTRRAALL EQU   RTRRDFA                                                  01108000
RTRRDFB  EQU   ISTRTR+137                                               01109000
RTRRDFC  EQU   ISTRTR+138                                               01110000
RTRRDFD  EQU   ISTRTR+139                                               01111000
RTRRDFE  EQU   ISTRTR+140                                               01112000
RTRRDFF  EQU   ISTRTR+141                                               01113000
RTRCRFLG EQU   ISTRTR+143                                               01114000
RTRLSCMD EQU   RTRCRFLG                                                 01115000
RTRBSCID EQU   ISTRTR+188                                               01116000
ISTRIN   EQU   0                                                        01117000
RINDFD   EQU   ISTRIN+124                                               01118000
RINREMPO EQU   RINDFD                                                   01119000
RINNODEF EQU   RINDFD                                                   01120000
RINLDISC EQU   RINDFD                                                   01121000
RINNODID EQU   ISTRIN+125                                               01122000
RINRLDAF EQU   ISTRIN+126                                               01123000
RINREMOT EQU   ISTRIN+128                                               01124000
RINVPAB  EQU   ISTRIN+132                                               01125000
RINRPHCN EQU   ISTRIN+136                                               01126000
RINNCSPL EQU   ISTRIN+140                                               01127000
RINCNCNT EQU   ISTRIN+144                                               01128000
ISTRDS   EQU   0                                                        01129000
ISTDOT   EQU   0                                                        01130000
ISTRCC   EQU   0                                                        01131000
RCCFLAG  EQU   ISTRCC+73                                                01132000
RCCFLAGB EQU   ISTRCC+74                                                01133000
RCCSTAID EQU   ISTRCC+78                                                01134000
RCCID48  EQU   RCCSTAID+2                                               01135000
RCCCRFLG EQU   ISTRCC+108                                               01136000
ISTRLU   EQU   0                                                        01137000
RLUFLAG  EQU   ISTRLU+125                                               01138000
RLUCRFLG EQU   ISTRLU+126                                               01139000
RLUPACE  EQU   ISTRLU+132                                               01140000
RLUNCPPC EQU   ISTRLU+134                                               01141000
RLUUSSTB EQU   ISTRLU+140                                               01142000
RLUMODET EQU   ISTRLU+152                                               01143000
ISTRPX   EQU   0                                                        01144000
ISTRLX   EQU   0                                                        01145000
RLXFLAGA EQU   ISTRLX+76                                                01146000
ISTRSW   EQU   0                                                        01147000
ISTRDA   EQU   0                                                        01148000
RDAADR   EQU   ISTRDA+72                                                01149000
RDAFLAG  EQU   RDAADR                                                   01150000
RDAUCBAD EQU   RDAADR+1                                                 01151000
ISTRLS   EQU   0                                                        01152000
ISTDNT   EQU   0                                                        01153000
ISTGNT   EQU   0                                                        01154000
ISTPAT   EQU   0                                                        01155000
PATFLAGA EQU   ISTPAT+7                                                 01156000
ISTSDCCF EQU   0                                                        01157000
ISTSDCCR EQU   0                                                        01158000
FMZL0035 EQU   0                                                        01159000
ISTSDCCA EQU   0                                                        01160000
ISTSDCCD EQU   0                                                        01161000
ISTSDCCN EQU   0                                                        01162000
UCBBGN   EQU   0                                                        01163000
ZIBSRB   EQU   0                                                        01164000
IOSATTSC EQU   IOSIPIB                                                  01165000
IOSWTOWA EQU   IOSIPIB                                                  01166000
IOSPCISC EQU   IOSIPIB                                                  01167000
UCBOBS01 EQU   UCBDEV                                                   01168000
UCBSTAB  EQU   UCBOBS01+10                                              01169000
UCBBSVL  EQU   UCBSTAB                                                  01170000
UCBPRSRS EQU   UCBSTAB                                                  01171000
UCBDMCT  EQU   UCBOBS01+11                                              01172000
UCBFL4   EQU   UCBOBS01+13                                              01173000
UCBOBS02 EQU   UCBDEV                                                   01174000
UCBTFL1  EQU   UCBOBS02+19                                              01175000
UCBXTN   EQU   UCBOBS02+20                                              01176000
UCBVOPT  EQU   UCBXTN                                                   01177000
UCBOBS03 EQU   UCBDEV                                                   01178000
UCBXTADR EQU   UCBOBS03                                                 01179000
UCBOBS04 EQU   UCBDEV                                                   01180000
UCBBTA   EQU   UCBOBS04+12                                              01181000
UCBOBS06 EQU   UCBDEV                                                   01182000
UCBAOF   EQU   UCBOBS06                                                 01183000
UCBAOF1  EQU   UCBAOF                                                   01184000
UCBAOF2  EQU   UCBAOF+1                                                 01185000
@NM00012 EQU   UCBOBS06+3                                               01186000
UCBIRB   EQU   UCBOBS06+4                                               01187000
UCBGRAF  EQU   UCBIRB                                                   01188000
UCBLDNCA EQU   UCBOBS06+8                                               01189000
UCBRDYQ  EQU   UCBLDNCA                                                 01190000
UCBIRLN  EQU   UCBRDYQ                                                  01191000
UCBLDNCB EQU   UCBRDYQ+1                                                01192000
UCBCTLNK EQU   UCBOBS06+12                                              01193000
UCBOBS07 EQU   UCBDEV                                                   01194000
UCBOBS08 EQU   UCBDEV                                                   01195000
UCBCTCAD EQU   UCBOBS08                                                 01196000
UCBCTCF1 EQU   UCBOBS08+4                                               01197000
UCBOBS09 EQU   UCBDEV                                                   01198000
PSARSVTE EQU   PSARSVT                                                  01199000
CVTS01   EQU   CVTPGSIA                                                 01200000
CVTLPDIA EQU   CVTS01+12                                                01201000
CVTDIRST EQU   CVTLPDIA                                                 01202000
CVTSLIDA EQU   CVTS01+24                                                01203000
CVTCTLFG EQU   CVTS01+50                                                01204000
CVTRECRQ EQU   CVTS01+352                                               01205000
CVTRV210 EQU   CVTS01+424                                               01206000
CVTRV219 EQU   CVTS01+425                                               01207000
CVTRV228 EQU   CVTS01+426                                               01208000
CVTRV237 EQU   CVTS01+427                                               01209000
CVTMFRTR EQU   CVTS01+452                                               01210000
CVTRV262 EQU   CVTS01+468                                               01211000
CVTRV271 EQU   CVTS01+469                                               01212000
CVTRV280 EQU   CVTS01+470                                               01213000
CVTRV289 EQU   CVTS01+471                                               01214000
CVTGSDA  EQU   CVTS01+600                                               01215000
LCPZTIE  EQU   LCPCID                                                   01216000
LCPZSNAM EQU   LCPZTIE+8                                                01217000
FSBCOMBN EQU   FSBNETRS                                                 01218000
FSBRHFLD EQU   FSBCOMBN+1                                               01219000
FSBRH3   EQU   FSBRHFLD+2                                               01220000
FSBLDFLG EQU   FSBRH3                                                   01221000
@NM00073 EQU   FSBRQTAG                                                 01222000
ZIBDIO   EQU   ZIBFSM                                                   01223000
ZIBCCW2  EQU   ZIBDIO+8                                                 01224000
ZIBCPTCC EQU   ZIBCCW2                                                  01225000
ZIBAIO   EQU   ISTZIBUF                                                 01226000
ZIBAIOCM EQU   ZIBAIO                                                   01227000
ZIBFIB   EQU   ZIBAIO+16                                                01228000
ZIBFSB   EQU   ZIBFIB                                                   01229000
ZIBMDREC EQU   ZIBFSB+4                                                 01230000
ZIBMDRIN EQU   ZIBFSB+28                                                01231000
ZIBBTU   EQU   ZIBFIB+32                                                01232000
@NM00076 EQU   ZIBBTU+12                                                01233000
ZIBFID1  EQU   @NM00076+1                                               01234000
ZIBFITXT EQU   ZIBFID1                                                  01235000
ZIBSIB   EQU   ZIBFIB                                                   01236000
ZIBREC   EQU   ZIBMDRIN                                                 01237000
ZIBRECPL EQU   ZIBREC                                                   01238000
ZIBRECHD EQU   ZIBRECPL                                                 01239000
ZIBRECDA EQU   ZIBRECPL+4                                               01240000
ZIBRECRS EQU   ZIBREC+8                                                 01241000
ZIBRECDT EQU   ZIBREC+10                                                01242000
ZIBRECUA EQU   ZIBRECDT                                                 01243000
ZIBRECNA EQU   ZIBRECDT+2                                               01244000
ZIBRECID EQU   ZIBRECDT+10                                              01245000
ZIBMDRRC EQU   ZIBMDREC                                                 01246000
ZIBRCPL  EQU   ZIBMDRRC                                                 01247000
ZIBRCDT  EQU   ZIBMDRRC+24                                              01248000
@NM00078 EQU   ZIBBTU                                                   01249000
ISTSENRU EQU   RUDATA                                                   01250000
SRUSENSE EQU   ISTSENRU                                                 01251000
SRUSENS1 EQU   SRUSENSE                                                 01252000
SRUSENS2 EQU   SRUSENSE+2                                               01253000
ISTSRU   EQU   ISTRUB                                                   01254000
SRUDATA  EQU   ISTSRU+1                                                 01255000
SRUTYPE  EQU   SRUDATA                                                  01256000
SRULDID  EQU   SRUDATA+1                                                01257000
SRUSPSN  EQU   SRULDID                                                  01258000
ISTNSRU  EQU   ISTRUB                                                   01259000
NSRUNETS EQU   ISTNSRU                                                  01260000
NSRUDATA EQU   ISTNSRU+3                                                01261000
NSRUHOOK EQU   NSRUDATA                                                 01262000
NSSSVRU  EQU   NSRUDATA                                                 01263000
NSSSVNOD EQU   NSSSVRU+3                                                01264000
NSSSVT3  EQU   NSSSVNOD                                                 01265000
NSSSVT3C EQU   NSSSVT3+2                                                01266000
NSSSVT3G EQU   NSSSVT3+5                                                01267000
NSSSVT4  EQU   NSSSVNOD                                                 01268000
NSSSVT5  EQU   NSSSVNOD                                                 01269000
NSRUDAT1 EQU   NSRUDATA                                                 01270000
NSRUDAF  EQU   NSRUDAT1                                                 01271000
NSRUDAT2 EQU   NSRUDAT1+2                                               01272000
ISTTRRU  EQU   NSRUDAT2                                                 01273000
ISTCTDRU EQU   NSRUDAT2                                                 01274000
ISTINORU EQU   NSRUDAT2                                                 01275000
SRUDAT1  EQU   SRUDATA                                                  01276000
SRUDAT1L EQU   SRUDAT1+1                                                01277000
SRUDAT2  EQU   SRUDATA                                                  01278000
ISTMRU   EQU   ISTRUB                                                   01279000
SRUDATA3 EQU   SRUDATA                                                  01280000
SRUDATA4 EQU   SRUDATA                                                  01281000
NSRUDAT3 EQU   NSRUDAT2                                                 01282000
NSRUDAT4 EQU   NSRUDAT2                                                 01283000
NSRUDAT5 EQU   NSRUDAT2                                                 01284000
NSRUDAT6 EQU   NSRUDAT2                                                 01285000
NSRUDAT7 EQU   NSRUDAT2                                                 01286000
NSRUDIL  EQU   NSRUDAT2                                                 01287000
NSRUDILB EQU   NSRUDIL+1                                                01288000
NSRUNA   EQU   NSRUDAT2                                                 01289000
NSRUNA2  EQU   NSRUNA+1                                                 01290000
NSRUCLSP EQU   NSRUDAT2                                                 01291000
NSRUOH1  EQU   NSRUDAT2                                                 01292000
NSRUDAT8 EQU   NSRUDATA                                                 01293000
ISTUNBRU EQU   SRUTYPE                                                  01294000
CMZCIDM  EQU   ATCCIDM                                                  01295000
FLC      EQU   PSA                                                      01296000
RTRDNCBA EQU   ISTRTR+40                                                01297000
SRB      EQU   SRBSECT                                                  01298000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01299000
UNBTYPE  EQU   ISTUNBRU                                                 01300000
NSRUDA8T EQU   NSRUDAT8                                                 01301000
NSRUOHID EQU   NSRUOH1                                                  01302000
NSRULSV  EQU   NSRUCLSP                                                 01303000
NSRUNA4  EQU   NSRUNA+2                                                 01304000
NSRUNA3  EQU   NSRUNA2                                                  01305000
NSRUNA1  EQU   NSRUNA                                                   01306000
NSRUDILF EQU   NSRUDIL+4                                                01307000
NSRUDILE EQU   NSRUDIL+3                                                01308000
NSRUDILD EQU   NSRUDIL+2                                                01309000
NSRUDILC EQU   NSRUDILB                                                 01310000
@NM00082 EQU   NSRUDILB                                                 01311000
NSRUDILA EQU   NSRUDIL                                                  01312000
NSRUDA7T EQU   NSRUDAT7                                                 01313000
NSRUDA6L EQU   NSRUDAT6+4                                               01314000
NSRUDA6S EQU   NSRUDAT6                                                 01315000
NSRUDA5E EQU   NSRUDAT5                                                 01316000
NSRUDA4T EQU   NSRUDAT4                                                 01317000
NSRUDA3S EQU   NSRUDAT3                                                 01318000
SRUDAT4D EQU   SRUDATA4                                                 01319000
SRUDAT3I EQU   SRUDATA3                                                 01320000
MRUDATA  EQU   ISTMRU+9                                                 01321000
MRURESP  EQU   ISTMRU+7                                                 01322000
MRUMODIF EQU   ISTMRU+6                                                 01323000
MRUCMND  EQU   ISTMRU+5                                                 01324000
MRUDAF   EQU   ISTMRU+3                                                 01325000
MRUREQ   EQU   ISTMRU+2                                                 01326000
MRUPREF  EQU   ISTMRU                                                   01327000
SRUDAT2N EQU   SRUDAT2+1                                                01328000
SRUDAT2T EQU   SRUDAT2                                                  01329000
SRUDAT1I EQU   SRUDAT1+2                                                01330000
SRUTSPRO EQU   SRUDAT1L                                                 01331000
SRUFMPRO EQU   SRUDAT1L                                                 01332000
SRUDAT1T EQU   SRUDAT1                                                  01333000
INORUET  EQU   ISTINORU                                                 01334000
CTDRUSTA EQU   ISTCTDRU                                                 01335000
TRRDATA  EQU   ISTTRRU+4                                                01336000
TRRSTAT  EQU   ISTTRRU+3                                                01337000
TRRPEP   EQU   ISTTRRU+2                                                01338000
TRRTIME  EQU   ISTTRRU+1                                                01339000
TRRTYPE  EQU   ISTTRRU                                                  01340000
NSSSVT5A EQU   NSSSVT5                                                  01341000
NSSSVT4D EQU   NSSSVT4+3                                                01342000
NSSSVT4C EQU   NSSSVT4+2                                                01343000
NSSSVT4B EQU   NSSSVT4+1                                                01344000
NSSSVT4A EQU   NSSSVT4                                                  01345000
NSSSVT3K EQU   NSSSVT3+8                                                01346000
NSSSVT3J EQU   NSSSVT3+7                                                01347000
NSSSVT3I EQU   NSSSVT3+6                                                01348000
@NM00081 EQU   NSSSVT3G                                                 01349000
NSSSVT3H EQU   NSSSVT3G                                                 01350000
NSSSVT3F EQU   NSSSVT3+4                                                01351000
NSSSVT3E EQU   NSSSVT3+3                                                01352000
@NM00080 EQU   NSSSVT3C                                                 01353000
NSSSVT3D EQU   NSSSVT3C                                                 01354000
NSSSVT3B EQU   NSSSVT3+1                                                01355000
NSSSVT3A EQU   NSSSVT3                                                  01356000
NSSSVT   EQU   NSSSVRU+2                                                01357000
NSSSVDAF EQU   NSSSVRU                                                  01358000
NSRUHKTY EQU   NSRUHOOK                                                 01359000
NSRURCD  EQU   NSRUNETS+2                                               01360000
NSRUSUB  EQU   NSRUNETS+1                                               01361000
NSRUID   EQU   NSRUNETS                                                 01362000
SRURSV01 EQU   SRULDID+4                                                01363000
SRUPSSN  EQU   SRULDID+2                                                01364000
SRUDFCLV EQU   SRUSPSN                                                  01365000
@NM00079 EQU   SRUTYPE                                                  01366000
SRUPSAC  EQU   SRUTYPE                                                  01367000
SRUSPAC  EQU   SRUTYPE                                                  01368000
SRUQSREQ EQU   ISTSRU                                                   01369000
SENRU    EQU   ISTSENRU+4                                               01370000
SRUSNS4  EQU   SRUSENS2+1                                               01371000
SRUSNS3  EQU   SRUSENS2                                                 01372000
SRUSNST  EQU   SRUSENS1+1                                               01373000
SRUSNS1  EQU   SRUSENS1                                                 01374000
ZIBTH2   EQU   @NM00078+4                                               01375000
ZIBLH    EQU   @NM00078                                                 01376000
ZIBRCTXT EQU   ZIBMDRRC+36                                              01377000
ZIBRCRID EQU   ZIBRCDT+10                                               01378000
ZIBRCNAM EQU   ZIBRCDT+2                                                01379000
ZIBRCUA  EQU   ZIBRCDT                                                  01380000
ZIBRCPUI EQU   ZIBRCPL+20                                               01381000
ZIBRCPUN EQU   ZIBRCPL+16                                               01382000
ZIBRCTIM EQU   ZIBRCPL+12                                               01383000
ZIBRCDAT EQU   ZIBRCPL+8                                                01384000
ZIBRCRS1 EQU   ZIBRCPL+6                                                01385000
ZIBRCSID EQU   ZIBRCPL+5                                                01386000
ZIBRCID  EQU   ZIBRCPL+4                                                01387000
ZIBRCSW  EQU   ZIBRCPL+2                                                01388000
ZIBRCSYR EQU   ZIBRCPL+1                                                01389000
ZIBRCL   EQU   ZIBRCPL                                                  01390000
ZIBRECTX EQU   ZIBREC+22                                                01391000
ZIBRECSV EQU   ZIBRECRS                                                 01392000
ZIBRECSI EQU   ZIBRECHD+3                                               01393000
ZIBRECDV EQU   ZIBRECHD+2                                               01394000
ZIBRECFL EQU   ZIBRECHD+1                                               01395000
ZIBRECTY EQU   ZIBRECHD                                                 01396000
ZIBTEXT  EQU   ZIBSIB+4                                                 01397000
ZIBRSV04 EQU   ZIBSIB                                                   01398000
ZIBTEXT2 EQU   ZIBFITXT                                                 01399000
ZIBTEXT1 EQU   ZIBFIB+52                                                01400000
@NM00077 EQU   @NM00076                                                 01401000
ZIBFDBS  EQU   ZIBBTU                                                   01402000
@NM00075 EQU   ZIBMDREC                                                 01403000
@NM00074 EQU   ZIBFSB                                                   01404000
ZIBLNG2  EQU   ZIBAIOCM+14                                              01405000
ZIBRSV03 EQU   ZIBAIOCM+13                                              01406000
ZIBWKBYT EQU   ZIBAIOCM+12                                              01407000
ZIBFDBZ  EQU   ZIBAIOCM                                                 01408000
ZIBCPNPK EQU   ZIBCCW2+6                                                01409000
ZIBRSV02 EQU   ZIBCCW2+5                                                01410000
ZIBCPTPF EQU   ZIBCCW2+4                                                01411000
ZIBCPTCA EQU   ZIBCCW2+1                                                01412000
ZIBCPNPC EQU   ZIBCPTCC                                                 01413000
ZIBCPRDK EQU   ZIBDIO+6                                                 01414000
ZIBRSV01 EQU   ZIBDIO+5                                                 01415000
ZIBCPRDF EQU   ZIBDIO+4                                                 01416000
ZIBCPTXA EQU   ZIBDIO+1                                                 01417000
ZIBCPRDC EQU   ZIBDIO                                                   01418000
FSBRT0B  EQU   @NM00073+1                                               01419000
FSBRT0A  EQU   @NM00073+1                                               01420000
FSBRT09  EQU   @NM00073+1                                               01421000
FSBRT08  EQU   @NM00073+1                                               01422000
FSBRT07  EQU   @NM00073                                                 01423000
FSBRT06  EQU   @NM00073                                                 01424000
FSBRT05  EQU   @NM00073                                                 01425000
FSBRT04  EQU   @NM00073                                                 01426000
FSBRT03  EQU   @NM00073                                                 01427000
FSBRT02  EQU   @NM00073                                                 01428000
FSBRT01  EQU   @NM00073                                                 01429000
FSBRT00  EQU   @NM00073                                                 01430000
FSBLDCUF EQU   FSBLDFLG                                                 01431000
FSBLDSIF EQU   FSBLDFLG                                                 01432000
FSBLDSOF EQU   FSBLDFLG                                                 01433000
FSBLDEBF EQU   FSBLDFLG                                                 01434000
FSBLDBBF EQU   FSBLDFLG                                                 01435000
FSBLDFME EQU   FSBLDFLG                                                 01436000
FSBLDSCF EQU   FSBLDFLG                                                 01437000
FSBLDRMF EQU   FSBLDFLG                                                 01438000
FSBRH2   EQU   FSBRHFLD+1                                               01439000
FSBRH1   EQU   FSBRHFLD                                                 01440000
FSBALIGN EQU   FSBCOMBN                                                 01441000
LCPZTRV4 EQU   LCPZSNAM+4                                               01442000
LCPZTRV1 EQU   LCPZSNAM                                                 01443000
LCPZSNA  EQU   LCPZTIE+4                                                01444000
LCPZFMCA EQU   LCPZTIE                                                  01445000
CVTRV628 EQU   CVTS01+728                                               01446000
CVTRV627 EQU   CVTS01+724                                               01447000
CVTRV626 EQU   CVTS01+720                                               01448000
CVTRV625 EQU   CVTS01+716                                               01449000
CVTRV624 EQU   CVTS01+712                                               01450000
CVTRV623 EQU   CVTS01+708                                               01451000
CVTRV622 EQU   CVTS01+704                                               01452000
CVTRV621 EQU   CVTS01+700                                               01453000
CVTRV620 EQU   CVTS01+696                                               01454000
CVTSUSP  EQU   CVTS01+692                                               01455000
CVTT6SVC EQU   CVTS01+688                                               01456000
CVTCDAL  EQU   CVTS01+684                                               01457000
CVTTCTL  EQU   CVTS01+680                                               01458000
CVTRSUME EQU   CVTS01+676                                               01459000
CVTJTERM EQU   CVTS01+672                                               01460000
CVTASMRM EQU   CVTS01+668                                               01461000
CVTTCASP EQU   CVTS01+664                                               01462000
CVT0PT03 EQU   CVTS01+660                                               01463000
CVT0PT0E EQU   CVTS01+656                                               01464000
CVTIRM   EQU   CVTS01+652                                               01465000
CVTCGK   EQU   CVTS01+648                                               01466000
CVTRAC   EQU   CVTS01+644                                               01467000
CVTRV606 EQU   CVTS01+640                                               01468000
CVTRV605 EQU   CVTS01+636                                               01469000
CVTRV604 EQU   CVTS01+632                                               01470000
CVTEFF02 EQU   CVTS01+628                                               01471000
CVTCBBR  EQU   CVTS01+624                                               01472000
CVTSSCR  EQU   CVTS01+620                                               01473000
CVTEVENT EQU   CVTS01+616                                               01474000
CVTCRCA  EQU   CVTS01+612                                               01475000
CVTTPIO  EQU   CVTS01+608                                               01476000
CVTADV   EQU   CVTS01+604                                               01477000
CVTGSDAB EQU   CVTGSDA                                                  01478000
CVTQV3   EQU   CVTS01+596                                               01479000
CVTQV2   EQU   CVTS01+592                                               01480000
CVTQV1   EQU   CVTS01+588                                               01481000
CVTRPT   EQU   CVTS01+584                                               01482000
CVTSSRB  EQU   CVTS01+580                                               01483000
CVTCSDRL EQU   CVTS01+576                                               01484000
CVTEXP1  EQU   CVTS01+572                                               01485000
CVTRMPMT EQU   CVTS01+568                                               01486000
CVTRMPTT EQU   CVTS01+564                                               01487000
CVTVPSA  EQU   CVTS01+560                                               01488000
CVTVSTOP EQU   CVTS01+556                                               01489000
CVTGTFR8 EQU   CVTS01+552                                               01490000
CVTQUIT  EQU   CVTS01+548                                               01491000
CVTVACR  EQU   CVTS01+544                                               01492000
CVTWTCB  EQU   CVTS01+540                                               01493000
CVTSTPRS EQU   CVTS01+536                                               01494000
CVT0PT02 EQU   CVTS01+532                                               01495000
CVTDARCM EQU   CVTS01+528                                               01496000
CVTIRECM EQU   CVTS01+524                                               01497000
CVTJRECM EQU   CVTS01+520                                               01498000
CVTVEMS0 EQU   CVTS01+516                                               01499000
CVTSPFRR EQU   CVTS01+512                                               01500000
CVTRLSTG EQU   CVTS01+508                                               01501000
CVT0TC0A EQU   CVTS01+504                                               01502000
CVTGMBR  EQU   CVTS01+500                                               01503000
CVTLFRM  EQU   CVTS01+496                                               01504000
CVTRMBR  EQU   CVTS01+492                                               01505000
CVTVIOP  EQU   CVTS01+488                                               01506000
CVTRV307 EQU   CVTS01+486                                               01507000
CVTRV306 EQU   CVTS01+484                                               01508000
CVTRV305 EQU   CVTS01+482                                               01509000
CVTRV304 EQU   CVTS01+480                                               01510000
CVTRV303 EQU   CVTS01+478                                               01511000
CVTRV302 EQU   CVTS01+476                                               01512000
CVTTRCA  EQU   CVTS01+472                                               01513000
CVTRV297 EQU   CVTRV289                                                 01514000
CVTRV296 EQU   CVTRV289                                                 01515000
CVTRV295 EQU   CVTRV289                                                 01516000
CVTRV294 EQU   CVTRV289                                                 01517000
CVTRV293 EQU   CVTRV289                                                 01518000
CVTRV292 EQU   CVTRV289                                                 01519000
CVTRV291 EQU   CVTRV289                                                 01520000
CVTRV290 EQU   CVTRV289                                                 01521000
CVTRV288 EQU   CVTRV280                                                 01522000
CVTRV287 EQU   CVTRV280                                                 01523000
CVTRV286 EQU   CVTRV280                                                 01524000
CVTRV285 EQU   CVTRV280                                                 01525000
CVTRV284 EQU   CVTRV280                                                 01526000
CVTRV283 EQU   CVTRV280                                                 01527000
CVTRV282 EQU   CVTRV280                                                 01528000
CVTRV281 EQU   CVTRV280                                                 01529000
CVTRV279 EQU   CVTRV271                                                 01530000
CVTRV278 EQU   CVTRV271                                                 01531000
CVTRV277 EQU   CVTRV271                                                 01532000
CVTRV276 EQU   CVTRV271                                                 01533000
CVTRV275 EQU   CVTRV271                                                 01534000
CVTRV274 EQU   CVTRV271                                                 01535000
CVTRV273 EQU   CVTRV271                                                 01536000
CVTRV272 EQU   CVTRV271                                                 01537000
CVTRV270 EQU   CVTRV262                                                 01538000
CVTRV269 EQU   CVTRV262                                                 01539000
CVTRV268 EQU   CVTRV262                                                 01540000
CVTRV267 EQU   CVTRV262                                                 01541000
CVTRV266 EQU   CVTRV262                                                 01542000
CVTRV265 EQU   CVTRV262                                                 01543000
CVTRV264 EQU   CVTRV262                                                 01544000
CVTRV263 EQU   CVTRV262                                                 01545000
CVTVFP   EQU   CVTS01+464                                               01546000
CVTVSI   EQU   CVTS01+460                                               01547000
CVTVPSIB EQU   CVTS01+456                                               01548000
CVTMFACT EQU   CVTMFRTR                                                 01549000
CVTMFCTL EQU   CVTS01+448                                               01550000
CVTPVBP  EQU   CVTS01+444                                               01551000
CVTPWI   EQU   CVTS01+440                                               01552000
CVTRV254 EQU   CVTS01+438                                               01553000
CVTRV253 EQU   CVTS01+436                                               01554000
CVTRV252 EQU   CVTS01+434                                               01555000
CVTRV251 EQU   CVTS01+433                                               01556000
CVTRV250 EQU   CVTS01+432                                               01557000
CVTRV249 EQU   CVTS01+431                                               01558000
CVTRV248 EQU   CVTS01+430                                               01559000
CVTRV247 EQU   CVTS01+429                                               01560000
CVTRV246 EQU   CVTS01+428                                               01561000
CVTRV245 EQU   CVTRV237                                                 01562000
CVTRV244 EQU   CVTRV237                                                 01563000
CVTRV243 EQU   CVTRV237                                                 01564000
CVTRV242 EQU   CVTRV237                                                 01565000
CVTRV241 EQU   CVTRV237                                                 01566000
CVTRV240 EQU   CVTRV237                                                 01567000
CVTRV239 EQU   CVTRV237                                                 01568000
CVTRV238 EQU   CVTRV237                                                 01569000
CVTRV236 EQU   CVTRV228                                                 01570000
CVTRV235 EQU   CVTRV228                                                 01571000
CVTRV234 EQU   CVTRV228                                                 01572000
CVTRV233 EQU   CVTRV228                                                 01573000
CVTRV232 EQU   CVTRV228                                                 01574000
CVTRV231 EQU   CVTRV228                                                 01575000
CVTRV230 EQU   CVTRV228                                                 01576000
CVTRV229 EQU   CVTRV228                                                 01577000
CVTRV227 EQU   CVTRV219                                                 01578000
CVTRV226 EQU   CVTRV219                                                 01579000
CVTRV225 EQU   CVTRV219                                                 01580000
CVTRV224 EQU   CVTRV219                                                 01581000
CVTRV223 EQU   CVTRV219                                                 01582000
CVTRV222 EQU   CVTRV219                                                 01583000
CVTRV221 EQU   CVTRV219                                                 01584000
CVTRV220 EQU   CVTRV219                                                 01585000
CVTRV218 EQU   CVTRV210                                                 01586000
CVTRV217 EQU   CVTRV210                                                 01587000
CVTRV216 EQU   CVTRV210                                                 01588000
CVTRV215 EQU   CVTRV210                                                 01589000
CVTRV214 EQU   CVTRV210                                                 01590000
CVTRV213 EQU   CVTRV210                                                 01591000
CVTRV212 EQU   CVTRV210                                                 01592000
CVTRV211 EQU   CVTRV210                                                 01593000
CVTLCCAT EQU   CVTS01+420                                               01594000
CVTPCCAT EQU   CVTS01+416                                               01595000
CVTIPCRP EQU   CVTS01+412                                               01596000
CVTIPCRI EQU   CVTS01+408                                               01597000
CVTIPCDS EQU   CVTS01+404                                               01598000
CVTAIDVT EQU   CVTS01+400                                               01599000
CVTSSAP  EQU   CVTS01+396                                               01600000
CVTEHCIR EQU   CVTS01+392                                               01601000
CVTEHDEF EQU   CVTS01+388                                               01602000
CVTDAIR  EQU   CVTS01+384                                               01603000
CVTPERFM EQU   CVTS01+380                                               01604000
CVT044R2 EQU   CVTS01+376                                               01605000
CVTFETCH EQU   CVTS01+372                                               01606000
CVTRSTWD EQU   CVTS01+368                                               01607000
CVTSPOST EQU   CVTS01+364                                               01608000
CVTIOBP  EQU   CVTS01+360                                               01609000
CVTASMVT EQU   CVTS01+356                                               01610000
CVTWSAC  EQU   CVTS01+348                                               01611000
CVTRV149 EQU   CVTS01+344                                               01612000
CVTWSAL  EQU   CVTS01+340                                               01613000
CVTSPSA  EQU   CVTS01+336                                               01614000
CVTGLMN  EQU   CVTS01+332                                               01615000
CVTVEAC0 EQU   CVTS01+328                                               01616000
CVT062R1 EQU   CVTS01+324                                               01617000
CVTRPOST EQU   CVTS01+320                                               01618000
CVTDQIQE EQU   CVTS01+316                                               01619000
CVTCSD   EQU   CVTS01+312                                               01620000
CVTLKRMA EQU   CVTS01+308                                               01621000
CVTRSPIE EQU   CVTS01+304                                               01622000
CVTRENQ  EQU   CVTS01+300                                               01623000
CVTLQCB  EQU   CVTS01+296                                               01624000
CVTFQCB  EQU   CVTS01+292                                               01625000
CVTQCS01 EQU   CVTS01+288                                               01626000
CVTAPFT  EQU   CVTS01+284                                               01627000
CVTPARRL EQU   CVTS01+280                                               01628000
CVTVWAIT EQU   CVTS01+276                                               01629000
CVTGSPL  EQU   CVTS01+272                                               01630000
CVTLSMQ  EQU   CVTS01+268                                               01631000
CVTGSMQ  EQU   CVTS01+264                                               01632000
CVTEXPRO EQU   CVTS01+260                                               01633000
CVTOPCTP EQU   CVTS01+256                                               01634000
CVTSIC   EQU   CVTS01+252                                               01635000
CVTTPIOS EQU   CVTS01+248                                               01636000
CVTRTMS  EQU   CVTS01+244                                               01637000
CVTSDBF  EQU   CVTS01+240                                               01638000
CVTSCBP  EQU   CVTS01+236                                               01639000
CVTSDMP  EQU   CVTS01+232                                               01640000
CVTSV60  EQU   CVTS01+228                                               01641000
CVTRTMCT EQU   CVTS01+224                                               01642000
CVTASCBL EQU   CVTS01+220                                               01643000
CVTASCBH EQU   CVTS01+216                                               01644000
CVTGDA   EQU   CVTS01+212                                               01645000
CVTASVT  EQU   CVTS01+208                                               01646000
CVTVVMDI EQU   CVTS01+204                                               01647000
CVTAQTOP EQU   CVTS01+200                                               01648000
CVTIOSCS EQU   CVTS01+196                                               01649000
CVTSDRM  EQU   CVTS01+192                                               01650000
CVTOPTE  EQU   CVTS01+188                                               01651000
CVTSTXU  EQU   CVTS01+184                                               01652000
CVTQUIS  EQU   CVTS01+180                                               01653000
CVTPARS  EQU   CVTS01+176                                               01654000
CVTS1EE  EQU   CVTS01+172                                               01655000
CVTFRAS  EQU   CVTS01+168                                               01656000
CVTQSAS  EQU   CVTS01+164                                               01657000
CVTCRAS  EQU   CVTS01+160                                               01658000
CVTCRMN  EQU   CVTS01+156                                               01659000
CVTDELCP EQU   CVTS01+152                                               01660000
CVTFRECL EQU   CVTS01+148                                               01661000
CVTGETCL EQU   CVTS01+144                                               01662000
CVTBLDCP EQU   CVTS01+140                                               01663000
CVTAUTHL EQU   CVTS01+136                                               01664000
CVTSCAN  EQU   CVTS01+132                                               01665000
CVTRV144 EQU   CVTS01+130                                               01666000
CVTMAXMP EQU   CVTS01+128                                               01667000
CVTSTCK  EQU   CVTS01+124                                               01668000
CVTRV139 EQU   CVTS01+123                                               01669000
CVTDSSAC EQU   CVTS01+122                                               01670000
CVTRV513 EQU   CVTS01+121                                               01671000
CVTIOSPL EQU   CVTS01+120                                               01672000
CVTPTGT  EQU   CVTS01+116                                               01673000
CVTCSPIE EQU   CVTS01+112                                               01674000
CVTSMFEX EQU   CVTS01+108                                               01675000
CVTOLT0A EQU   CVTS01+104                                               01676000
CVTSRBRT EQU   CVTS01+100                                               01677000
CVTPUTL  EQU   CVTS01+96                                                01678000
CVTASCRL EQU   CVTS01+92                                                01679000
CVTASCRF EQU   CVTS01+88                                                01680000
CVTRV326 EQU   CVTS01+84                                                01681000
CVTRV325 EQU   CVTS01+80                                                01682000
CVTRV324 EQU   CVTS01+76                                                01683000
CVT0VL01 EQU   CVTS01+72                                                01684000
CVTSHRVM EQU   CVTS01+68                                                01685000
CVTRV332 EQU   CVTS01+64                                                01686000
CVTTAS   EQU   CVTS01+60                                                01687000
CVTRSCN  EQU   CVTS01+56                                                01688000
CVTTRAC2 EQU   CVTS01+54                                                01689000
CVTTRACE EQU   CVTS01+52                                                01690000
CVTAPG   EQU   CVTS01+51                                                01691000
CVTSDTRC EQU   CVTCTLFG                                                 01692000
CVTGTRCE EQU   CVTCTLFG                                                 01693000
CVTNOMP  EQU   CVTCTLFG                                                 01694000
CVTRSV79 EQU   CVTCTLFG                                                 01695000
CVTDSTAT EQU   CVTCTLFG                                                 01696000
CVTRSV78 EQU   CVTCTLFG                                                 01697000
CVTRV333 EQU   CVTCTLFG                                                 01698000
CVTRV323 EQU   CVTCTLFG                                                 01699000
CVTSPVLK EQU   CVTS01+49                                                01700000
CVTRSV77 EQU   CVTS01+48                                                01701000
CVTRV331 EQU   CVTS01+44                                                01702000
CVTRV330 EQU   CVTS01+40                                                01703000
CVTRV329 EQU   CVTS01+36                                                01704000
CVTRV328 EQU   CVTS01+32                                                01705000
CVTRV322 EQU   CVTS01+28                                                01706000
CVTSLID  EQU   CVTSLIDA+1                                               01707000
CVTSYLK  EQU   CVTSLIDA                                                 01708000
CVTRV321 EQU   CVTS01+20                                                01709000
CVTRV320 EQU   CVTS01+16                                                01710000
CVTLPDIR EQU   CVTLPDIA+1                                               01711000
CVTRSV69 EQU   CVTDIRST                                                 01712000
CVTRSV68 EQU   CVTDIRST                                                 01713000
CVTRSV67 EQU   CVTDIRST                                                 01714000
CVTRSV66 EQU   CVTDIRST                                                 01715000
CVTRSV65 EQU   CVTDIRST                                                 01716000
CVTRSV64 EQU   CVTDIRST                                                 01717000
CVTRSV63 EQU   CVTDIRST                                                 01718000
CVTDICOM EQU   CVTDIRST                                                 01719000
CVTPVTP  EQU   CVTS01+8                                                 01720000
CVTLPDSR EQU   CVTS01+4                                                 01721000
CVTGETL  EQU   CVTS01                                                   01722000
PSARSAV  EQU   PSARSVTE+60                                              01723000
PSARSTK  EQU   PSARSVTE+56                                              01724000
PSAESAV3 EQU   PSARSVTE+52                                              01725000
PSAESTK3 EQU   PSARSVTE+48                                              01726000
PSAESAV2 EQU   PSARSVTE+44                                              01727000
PSAESTK2 EQU   PSARSVTE+40                                              01728000
PSAESAV1 EQU   PSARSVTE+36                                              01729000
PSAESTK1 EQU   PSARSVTE+32                                              01730000
PSAPSAV  EQU   PSARSVTE+28                                              01731000
PSAPSTK  EQU   PSARSVTE+24                                              01732000
PSAMSAV  EQU   PSARSVTE+20                                              01733000
PSAMSTK  EQU   PSARSVTE+16                                              01734000
PSASSAV  EQU   PSARSVTE+12                                              01735000
PSASSTK  EQU   PSARSVTE+8                                               01736000
PSANSTK  EQU   PSARSVTE+4                                               01737000
PSACSTK  EQU   PSARSVTE                                                 01738000
UCBRV066 EQU   UCBOBS09+4                                               01739000
UCBIOSBA EQU   UCBOBS09                                                 01740000
UCBRV042 EQU   UCBOBS08+5                                               01741000
UCBRV082 EQU   UCBCTCF1                                                 01742000
UCBRV081 EQU   UCBCTCF1                                                 01743000
UCBRV080 EQU   UCBCTCF1                                                 01744000
UCBRV079 EQU   UCBCTCF1                                                 01745000
UCBRV078 EQU   UCBCTCF1                                                 01746000
UCBRV077 EQU   UCBCTCF1                                                 01747000
UCBRV076 EQU   UCBCTCF1                                                 01748000
UCBCTC80 EQU   UCBCTCF1                                                 01749000
UCBCTCAL EQU   UCBCTCAD                                                 01750000
UCBICNCB EQU   UCBOBS07+4                                               01751000
UCBRV040 EQU   UCBOBS07                                                 01752000
UCBCTLNA EQU   UCBCTLNK+1                                               01753000
UCBRLN   EQU   UCBCTLNK                                                 01754000
UCBRDYQA EQU   UCBLDNCB                                                 01755000
UCBINRLN EQU   UCBIRLN                                                  01756000
UCBIRBA  EQU   UCBIRB+1                                                 01757000
UCBRV039 EQU   UCBGRAF                                                  01758000
UCBDWNR  EQU   UCBGRAF                                                  01759000
UCBRPND  EQU   UCBGRAF                                                  01760000
UCBUPM   EQU   UCBGRAF                                                  01761000
UCBBTAM  EQU   UCBGRAF                                                  01762000
UCBDRNO  EQU   UCBGRAF                                                  01763000
UCBDRO   EQU   UCBGRAF                                                  01764000
UCBOIP   EQU   UCBGRAF                                                  01765000
UCBATRCD EQU   @NM00012                                                 01766000
UCBSKPFG EQU   @NM00012                                                 01767000
UCBRIPND EQU   @NM00012                                                 01768000
UCBRTIAC EQU   @NM00012                                                 01769000
UCBRSV79 EQU   @NM00012                                                 01770000
UCBRSV78 EQU   @NM00012                                                 01771000
UCBRSV77 EQU   @NM00012                                                 01772000
UCBOLTEP EQU   @NM00012                                                 01773000
UCBATNCT EQU   UCBOBS06+2                                               01774000
UCBRSV76 EQU   UCBAOF2                                                  01775000
UCBRSV75 EQU   UCBAOF2                                                  01776000
UCBRSV74 EQU   UCBAOF2                                                  01777000
UCBRSV73 EQU   UCBAOF2                                                  01778000
UCBRSV72 EQU   UCBAOF2                                                  01779000
UCBRSV71 EQU   UCBAOF2                                                  01780000
UCBRSV70 EQU   UCBAOF2                                                  01781000
UCBRSV69 EQU   UCBAOF2                                                  01782000
UCBRSV68 EQU   UCBAOF1                                                  01783000
UCBRSV67 EQU   UCBAOF1                                                  01784000
UCBRSV66 EQU   UCBAOF1                                                  01785000
UCBRSV65 EQU   UCBAOF1                                                  01786000
UCBRSV64 EQU   UCBAOF1                                                  01787000
UCBOFNL  EQU   UCBAOF1                                                  01788000
UCBOFSP  EQU   UCBAOF1                                                  01789000
UCBOFMCR EQU   UCBAOF1                                                  01790000
UCBBTB   EQU   UCBBTA+1                                                 01791000
UCBDI    EQU   UCBBTA                                                   01792000
UCBSNS   EQU   UCBOBS04+8                                               01793000
UCBTEB   EQU   UCBOBS04+4                                               01794000
UCBGCB   EQU   UCBOBS04+3                                               01795000
UCBOPEN  EQU   UCBOBS04+2                                               01796000
UCBSTART EQU   UCBOBS04                                                 01797000
UCBXTNB  EQU   UCBXTN+1                                                 01798000
UCBRSV22 EQU   UCBVOPT                                                  01799000
UCBRSV21 EQU   UCBVOPT                                                  01800000
UCBRSV20 EQU   UCBVOPT                                                  01801000
UCBESVE  EQU   UCBVOPT                                                  01802000
UCBERPC  EQU   UCBVOPT                                                  01803000
UCBESVC  EQU   UCBVOPT                                                  01804000
UCBEVA   EQU   UCBVOPT                                                  01805000
UCBESV   EQU   UCBVOPT                                                  01806000
UCBRV009 EQU   UCBTFL1                                                  01807000
UCBRV008 EQU   UCBTFL1                                                  01808000
UCBRV007 EQU   UCBTFL1                                                  01809000
UCBRV006 EQU   UCBTFL1                                                  01810000
UCBRV005 EQU   UCBTFL1                                                  01811000
UCBRV038 EQU   UCBTFL1                                                  01812000
UCBNSLTP EQU   UCBTFL1                                                  01813000
UCBNLTP  EQU   UCBTFL1                                                  01814000
UCBRES1B EQU   UCBOBS02+18                                              01815000
UCBFSER  EQU   UCBOBS02+12                                              01816000
@NM00011 EQU   UCBOBS02+4                                               01817000
UCBFSEQ  EQU   UCBOBS02+2                                               01818000
UCBFSCT  EQU   UCBOBS02                                                 01819000
UCBNEXP  EQU   UCBOBS01+20                                              01820000
UCBBASE  EQU   UCBOBS01+16                                              01821000
UCBRES1A EQU   UCBOBS01+15                                              01822000
UCBUSER  EQU   UCBOBS01+14                                              01823000
UCBFL47  EQU   UCBFL4                                                   01824000
UCBFL46  EQU   UCBFL4                                                   01825000
UCBFL45  EQU   UCBFL4                                                   01826000
UCBRV065 EQU   UCBFL4                                                   01827000
UCBDSS   EQU   UCBFL4                                                   01828000
UCBRV028 EQU   UCBFL4                                                   01829000
UCBWDAV  EQU   UCBFL4                                                   01830000
UCBDAVV  EQU   UCBFL4                                                   01831000
UCBSQC   EQU   UCBOBS01+12                                              01832000
UCBDATP  EQU   UCBOBS01+12                                              01833000
UCBDMC   EQU   UCBDMCT                                                  01834000
UCBMOUNT EQU   UCBDMCT                                                  01835000
UCBBNUL  EQU   UCBSTAB                                                  01836000
UCBSHAR  EQU   UCBSTAB                                                  01837000
UCBBSTR  EQU   UCBSTAB                                                  01838000
UCBBPUB  EQU   UCBSTAB                                                  01839000
UCBBPRV  EQU   UCBSTAB                                                  01840000
UCBBALB  EQU   UCBPRSRS                                                 01841000
UCBPGFL  EQU   UCBSTAB                                                  01842000
UCBDVSHR EQU   UCBBSVL                                                  01843000
UCBVOLI  EQU   UCBOBS01+4                                               01844000
UCBVTOC  EQU   UCBOBS01                                                 01845000
IOSPCIWA EQU   IOSPCISC+44                                              01846000
IOSPCIRS EQU   IOSPCISC+8                                               01847000
@NM00009 EQU   IOSPCISC+4                                               01848000
@NM00008 EQU   IOSPCISC                                                 01849000
IOSWRNDR EQU   IOSWTOWA+4                                               01850000
IOSWTOPT EQU   IOSWTOWA+3                                               01851000
IOSWTOCP EQU   IOSWTOWA+2                                               01852000
IOSWTOCH EQU   IOSWTOWA                                                 01853000
IOSATTWA EQU   IOSATTSC+40                                              01854000
@NM00007 EQU   IOSATTSC+24                                              01855000
IOSATTSN EQU   IOSATTSC                                                 01856000
PATRSV01 EQU   PATFLAGA                                                 01857000
PATUSEFG EQU   PATFLAGA                                                 01858000
PATRDCNT EQU   ISTPAT+6                                                 01859000
PATGRPID EQU   ISTPAT+5                                                 01860000
PATPTHID EQU   ISTPAT+4                                                 01861000
PATDINDX EQU   ISTPAT+2                                                 01862000
PATGINDX EQU   ISTPAT                                                   01863000
GNTGRPNM EQU   ISTGNT                                                   01864000
DNTTELNO EQU   ISTDNT+1                                                 01865000
DNTCTDIG EQU   ISTDNT                                                   01866000
RLSRSV02 EQU   ISTRLS+140                                               01867000
RLSRSV01 EQU   ISTRLS+138                                               01868000
RLSCTELU EQU   ISTRLS+136                                               01869000
RLSPRE   EQU   ISTRLS                                                   01870000
RDARSVPT EQU   ISTRDA+84                                                01871000
RDAPUBI  EQU   ISTRDA+83                                                01872000
RDADFCUA EQU   ISTRDA+80                                                01873000
RDACTPCC EQU   ISTRDA+79                                                01874000
RDADACUA EQU   ISTRDA+76                                                01875000
RDALUBA  EQU   RDAUCBAD+1                                               01876000
RDACHQI  EQU   RDAUCBAD                                                 01877000
RDARSV01 EQU   RDAFLAG                                                  01878000
RDARBISA EQU   RDAFLAG                                                  01879000
RDAPRE   EQU   ISTRDA                                                   01880000
RSWRSV01 EQU   ISTRSW+152                                               01881000
RSWRSV02 EQU   ISTRSW+150                                               01882000
RSWCTELU EQU   ISTRSW+148                                               01883000
RSWGRUPZ EQU   ISTRSW+146                                               01884000
RSWDIALZ EQU   ISTRSW+144                                               01885000
RSWGRUPT EQU   ISTRSW+140                                               01886000
RSWDIALT EQU   ISTRSW+136                                               01887000
RSWPRE   EQU   ISTRSW                                                   01888000
RLXRSV03 EQU   ISTRLX+80                                                01889000
RLXRSV02 EQU   ISTRLX+77                                                01890000
RLXRSV01 EQU   RLXFLAGA                                                 01891000
RLXINUSE EQU   RLXFLAGA                                                 01892000
RLXNLUX  EQU   ISTRLX+72                                                01893000
RLXPRE   EQU   ISTRLX                                                   01894000
RPXRSV01 EQU   ISTRPX+80                                                01895000
RPXRSV02 EQU   ISTRPX+77                                                01896000
RPXMAXLU EQU   ISTRPX+76                                                01897000
RPXFLUX  EQU   ISTRPX+72                                                01898000
RPXPRE   EQU   ISTRPX                                                   01899000
RLURSV02 EQU   ISTRLU+172                                               01900000
RLULGMOD EQU   ISTRLU+164                                               01901000
RLUMODEP EQU   RLUMODET+8                                               01902000
RLUMODEN EQU   RLUMODET                                                 01903000
RLUUSSPT EQU   RLUUSSTB+8                                               01904000
RLUUSSNM EQU   RLUUSSTB                                                 01905000
RLURSV01 EQU   ISTRLU+137                                               01906000
RLULOCAD EQU   ISTRLU+136                                               01907000
RLUNCPPM EQU   RLUNCPPC+1                                               01908000
RLUNCPPN EQU   RLUNCPPC                                                 01909000
RLUPACEM EQU   RLUPACE+1                                                01910000
RLUPACEN EQU   RLUPACE                                                  01911000
RLUINTA  EQU   ISTRLU+128                                               01912000
RLUSSCFM EQU   ISTRLU+127                                               01913000
RLUCRRSV EQU   RLUCRFLG                                                 01914000
RLUACTLU EQU   RLUCRFLG                                                 01915000
RLURSV00 EQU   RLUFLAG                                                  01916000
RLUNDSES EQU   RLUFLAG                                                  01917000
RLUGSTAT EQU   RLUFLAG                                                  01918000
RLUBATCH EQU   RLUFLAG                                                  01919000
RLURBISA EQU   RLUFLAG                                                  01920000
RLUTYPE  EQU   ISTRLU+124                                               01921000
RLUCRPR  EQU   ISTRLU                                                   01922000
RCCRVPT2 EQU   ISTRCC+144                                               01923000
RCCXTOSW EQU   ISTRCC+140                                               01924000
RCCSWTOX EQU   ISTRCC+136                                               01925000
RCCRSPT2 EQU   ISTRCC+133                                               01926000
RCCADDR  EQU   ISTRCC+132                                               01927000
RCCPASSL EQU   ISTRCC+131                                               01928000
RCCMXOUT EQU   ISTRCC+130                                               01929000
RCCMXDAT EQU   ISTRCC+128                                               01930000
RCCINDEX EQU   ISTRCC+126                                               01931000
RCCPATHZ EQU   ISTRCC+124                                               01932000
RCCPATHT EQU   ISTRCC+120                                               01933000
RCCDPQ   EQU   ISTRCC+116                                               01934000
RCCTPAB  EQU   ISTRCC+112                                               01935000
RCCRSV02 EQU   ISTRCC+109                                               01936000
RCCCRRSV EQU   RCCCRFLG                                                 01937000
RCCCTCFL EQU   RCCCRFLG                                                 01938000
RCCACTPU EQU   RCCCRFLG                                                 01939000
RCCNCSPL EQU   ISTRCC+104                                               01940000
RCCRPHCN EQU   ISTRCC+100                                               01941000
RCCEPAB  EQU   ISTRCC+96                                                01942000
RCCDPAB  EQU   ISTRCC+92                                                01943000
RCCVPAB  EQU   ISTRCC+88                                                01944000
@NM00096 EQU   ISTRCC+87                                                01945000
RCCSESCT EQU   ISTRCC+86                                                01946000
RCCIDNUM EQU   RCCID48+3                                                01947000
RCCIDBLK EQU   RCCID48+2                                                01948000
RCCIDPA2 EQU   RCCID48+1                                                01949000
RCCIDPUT EQU   RCCID48                                                  01950000
RCCIDPA1 EQU   RCCSTAID                                                 01951000
RCCCTELU EQU   ISTRCC+76                                                01952000
RCCCNCNT EQU   ISTRCC+75                                                01953000
RCCRTGOH EQU   RCCFLAGB                                                 01954000
RCCBRKCN EQU   RCCFLAGB                                                 01955000
RCCRESET EQU   RCCFLAGB                                                 01956000
RCCFINAL EQU   RCCFLAGB                                                 01957000
RCCBNNSP EQU   RCCFLAGB                                                 01958000
RCCIRETR EQU   RCCFLAGB                                                 01959000
RCCDIALP EQU   RCCFLAGB                                                 01960000
RCCDSTCT EQU   RCCFLAGB                                                 01961000
RCCCTPGD EQU   RCCFLAG                                                  01962000
RCCPRGDN EQU   RCCFLAG                                                  01963000
RCCOUERP EQU   RCCFLAG                                                  01964000
RCCOHIMM EQU   RCCFLAG                                                  01965000
RCCLDISC EQU   RCCFLAG                                                  01966000
RCCERPIP EQU   RCCFLAG                                                  01967000
RCCCUDIE EQU   RCCFLAG                                                  01968000
RCCRBISA EQU   RCCFLAG                                                  01969000
RCCTYPE  EQU   ISTRCC+72                                                01970000
RCCPRE   EQU   ISTRCC                                                   01971000
DOTADTRM EQU   ISTDOT                                                   01972000
RDSADDOT EQU   ISTRDS+76                                                01973000
RDSCTATR EQU   ISTRDS+74                                                01974000
RDSCTTRM EQU   ISTRDS+72                                                01975000
RDSPRE   EQU   ISTRDS                                                   01976000
RINRSV05 EQU   ISTRIN+156                                               01977000
RINRSV04 EQU   ISTRIN+152                                               01978000
RINLOCRN EQU   ISTRIN+148                                               01979000
RINRSV02 EQU   ISTRIN+145                                               01980000
RTRCNCNT EQU   RINCNCNT                                                 01981000
RTRNCSPL EQU   RINNCSPL                                                 01982000
RTRRPHCN EQU   RINRPHCN                                                 01983000
RTRVPAB  EQU   RINVPAB                                                  01984000
RTRREMOT EQU   RINREMOT                                                 01985000
RTRRLDAF EQU   RINRLDAF                                                 01986000
RTRNODID EQU   RINNODID                                                 01987000
RINRSV01 EQU   RINDFD                                                   01988000
RTRLDISC EQU   RINLDISC                                                 01989000
RTRNODEF EQU   RINNODEF                                                 01990000
RTRREMPO EQU   RINREMPO                                                 01991000
RINCRPRE EQU   ISTRIN                                                   01992000
RTRRSV04 EQU   ISTRTR+210                                               01993000
RTRLCTI  EQU   ISTRTR+209                                               01994000
RTRIDCAS EQU   RTRBSCID+1                                               01995000
RTRIDLEN EQU   RTRBSCID                                                 01996000
RTRRSVDD EQU   ISTRTR+181                                               01997000
RTRRDFG  EQU   ISTRTR+180                                               01998000
RTRDIAA  EQU   ISTRTR+176                                               01999000
RTRPOLA  EQU   ISTRTR+172                                               02000000
RTRCADDR EQU   ISTRTR+164                                               02001000
RTRCTADR EQU   ISTRTR+162                                               02002000
RTRCTPOL EQU   ISTRTR+160                                               02003000
RTRCTDIA EQU   ISTRTR+158                                               02004000
RTRRSV03 EQU   ISTRTR+156                                               02005000
RTRRVPT1 EQU   ISTRTR+152                                               02006000
RTRBHSN1 EQU   ISTRTR+144                                               02007000
RTRCRSV2 EQU   RTRCRFLG                                                 02008000
RTRDTRLM EQU   RTRLSCMD                                                 02009000
RTRCRSV1 EQU   RTRCRFLG                                                 02010000
RTRTRMAX EQU   ISTRTR+142                                               02011000
RTRRSV24 EQU   RTRRDFF                                                  02012000
RTRRFDEK EQU   RTRRDFF                                                  02013000
RTRRFANK EQU   RTRRDFF                                                  02014000
RTRRFPFK EQU   RTRRDFF                                                  02015000
RTRRFPEN EQU   RTRRDFF                                                  02016000
RTRRFXCT EQU   RTRRDFF                                                  02017000
RTRRESCT EQU   RTRRDFE                                                  02018000
RTRRESUP EQU   RTRRDFE                                                  02019000
RTRREATT EQU   RTRRDFE                                                  02020000
RTRRECHK EQU   RTRRDFE                                                  02021000
RTRREACR EQU   RTRRDFE                                                  02022000
RTRRSV0A EQU   RTRRDFE                                                  02023000
RTRREBRK EQU   RTRRDFE                                                  02024000
RTRRSV11 EQU   RTRRDFD                                                  02025000
RTRRSV10 EQU   RTRRDFD                                                  02026000
RTRRDBHI EQU   RTRRDFD                                                  02027000
RTRRDBHD EQU   RTRRDFD                                                  02028000
RTRRDBHN EQU   RTRRDFD                                                  02029000
RTRRSV23 EQU   RTRRDFC                                                  02030000
RTRRCXMS EQU   RTRRDFC                                                  02031000
RTRRCMSG EQU   RTRRDFC                                                  02032000
RTRRCBLK EQU   RTRRDFC                                                  02033000
RTRRCPT3 EQU   RTRRDFC                                                  02034000
RTRRCIT2 EQU   RTRRDFC                                                  02035000
RTRRCIT1 EQU   RTRRDFC                                                  02036000
RTRRSV32 EQU   RTRRDFB                                                  02037000
RTRRBEND EQU   RTRRDFB                                                  02038000
RTRRBECT EQU   RTRRDFB                                                  02039000
RTRRSV02 EQU   RTRRDFA                                                  02040000
RTRRACTR EQU   RTRRDFA                                                  02041000
RTRRSV60 EQU   RTRRDFA                                                  02042000
RTRRACDT EQU   RTRRDFA                                                  02043000
RTRRAPT3 EQU   RTRRAALL                                                 02044000
RTRRAPT2 EQU   RTRRAALL                                                 02045000
RTRRAPT1 EQU   RTRRAALL                                                 02046000
RTRRAATN EQU   RTRRDFA                                                  02047000
RTRRSV45 EQU   ISTRTR+132                                               02048000
RTRRSV01 EQU   ISTRTR+130                                               02049000
RTRCTECM EQU   ISTRTR+128                                               02050000
RTRADRPT EQU   RTRADR+1                                                 02051000
RTRRSV22 EQU   RTRFLAG                                                  02052000
RTRVTERM EQU   RTRFLAG                                                  02053000
RTRRSV51 EQU   RTRFLAG                                                  02054000
RTRRBISA EQU   RTRFLAG                                                  02055000
RTRRSV21 EQU   RTRFLAG                                                  02056000
RTRCRPR  EQU   ISTRTR                                                   02057000
RCLRVPT2 EQU   ISTRCL+92                                                02058000
RCLRVPT1 EQU   ISTRCL+88                                                02059000
RCLGPOLA EQU   ISTRCL+84                                                02060000
RCLCTNGP EQU   ISTRCL+82                                                02061000
RCLRSV01 EQU   ISTRCL+80                                                02062000
RCLCTECM EQU   ISTRCL+78                                                02063000
RCLCTETR EQU   ISTRCL+76                                                02064000
RCLGPADR EQU   RCLADR+1                                                 02065000
RCLRSV33 EQU   RCLFLAG                                                  02066000
RCLBATCH EQU   RCLFLAG                                                  02067000
RCLRBISA EQU   RCLFLAG                                                  02068000
RCLRSV22 EQU   RCLFLAG                                                  02069000
RCLPRE   EQU   ISTRCL                                                   02070000
RPTRSV03 EQU   ISTRPT+156                                               02071000
RPTRSV02 EQU   ISTRPT+152                                               02072000
RPTNSNSV EQU   ISTRPT+148                                               02073000
RPTPTHCT EQU   ISTRPT+146                                               02074000
RPTPEPCT EQU   ISTRPT+144                                               02075000
RPTDAFSV EQU   ISTRPT+142                                               02076000
RPTRSV01 EQU   ISTRPT+141                                               02077000
RPTISTAT EQU   RPTFLAG1                                                 02078000
RPTDYNAM EQU   RPTFLAG1                                                 02079000
RPTVYIMM EQU   RPTFLAG1                                                 02080000
RPTVIODN EQU   RPTFLAG1                                                 02081000
RPTONLIN EQU   RPTFLAG1                                                 02082000
RPTHLVPD EQU   RPTFLAG1                                                 02083000
RPTVRYPD EQU   RPTFLAG1                                                 02084000
RPTASLEP EQU   RPTFLAG1                                                 02085000
RPTUTERM EQU   ISTRPT+136                                               02086000
RPTATERM EQU   ISTRPT+132                                               02087000
RPTDIVT  EQU   RPTDITT                                                  02088000
RPTCTNM  EQU   ISTRPT+120                                               02089000
RPTLNDAF EQU   RPTLNCID+2                                               02090000
RPTLNSAF EQU   RPTLNCID                                                 02091000
RPTLN    EQU   ISTRPT                                                   02092000
RLNRVPT2 EQU   ISTRLN+112                                               02093000
RLNNCSPL EQU   ISTRLN+108                                               02094000
RLNX2SW  EQU   ISTRLN+104                                               02095000
@NM00095 EQU   ISTRLN+103                                               02096000
RLNCRRSV EQU   RLNCRFLG                                                 02097000
RLNSWEP  EQU   RLNCRFLG                                                 02098000
RLNSVSKP EQU   RLNLSCMD                                                 02099000
RLNSESLM EQU   RLNLSCMD                                                 02100000
RLNNPRLM EQU   RLNLSCMD                                                 02101000
RLNSWNCP EQU   RLNCRFLG                                                 02102000
RLNACTLN EQU   RLNCRFLG                                                 02103000
RLNPAUSE EQU   ISTRLN+101                                               02104000
RLNPOLMT EQU   ISTRLN+100                                               02105000
RLNACTSN EQU   ISTRLN+98                                                02106000
RLNRESV1 EQU   ISTRLN+97                                                02107000
RLNACTRM EQU   ISTRLN+96                                                02108000
RLNCTSES EQU   ISTRLN+95                                                02109000
RLNRDSLM EQU   ISTRLN+94                                                02110000
RLNAUTOA EQU   ISTRLN+92                                                02111000
RLNRDFD  EQU   RLNRDF+3                                                 02112000
RLNRDFC  EQU   RLNRDF+2                                                 02113000
RLNMULTP EQU   RLNRDFB                                                  02114000
RLNRATRN EQU   RLNRDFB                                                  02115000
RLNRAPOL EQU   RLNRDFB                                                  02116000
RLNTTV   EQU   RLNRDFB                                                  02117000
RLNRSV0B EQU   RLNRDFB                                                  02118000
RLNAUTOD EQU   RLNRDFB                                                  02119000
RLNANSWR EQU   RLNRDFB                                                  02120000
RLNRBUSE EQU   RLNRDFB                                                  02121000
RLNRAPEP EQU   RLNRDFA                                                  02122000
RLNRANCP EQU   RLNRDFA                                                  02123000
RLNRAEP  EQU   RLNRDFA                                                  02124000
RLNIDV   EQU   RLNRDFA                                                  02125000
RLNPORT  EQU   RLNRDFA                                                  02126000
RLNGANSW EQU   RLNRDFA                                                  02127000
RLNRACAN EQU   RLNRACNT                                                 02128000
RLNRACAT EQU   RLNRACNT                                                 02129000
RLNRSV04 EQU   RLNSTAT2                                                 02130000
RLNINUSE EQU   RLNSTAT2                                                 02131000
RLNOHIN  EQU   RLNSTAT2                                                 02132000
RLNRSV03 EQU   RLNSTAT1                                                 02133000
RLNVD    EQU   RLNSTAT1                                                 02134000
RLNINOPP EQU   RLNSTAT1                                                 02135000
RLNINOPL EQU   RLNSTAT1                                                 02136000
RLNLRST  EQU   RLNSTAT1                                                 02137000
RLNTRAP  EQU   RLNSTAT1                                                 02138000
RLNACTCT EQU   ISTRLN+84                                                02139000
RLNCTECM EQU   ISTRLN+82                                                02140000
RLNCTEIN EQU   ISTRLN+80                                                02141000
RLNCTETR EQU   ISTRLN+78                                                02142000
RLNCTECL EQU   ISTRLN+76                                                02143000
RLNCUA   EQU   RLNUCBAD                                                 02144000
RLNRSV01 EQU   RLNFLAG                                                  02145000
RLNRBISA EQU   RLNFLAG                                                  02146000
RLNEAM   EQU   RLNFLAG                                                  02147000
RLNPRE   EQU   ISTRLN                                                   02148000
RGPRVPT2 EQU   ISTRGP+88                                                02149000
RGPRVPT1 EQU   ISTRGP+84                                                02150000
RGPCTECM EQU   ISTRGP+82                                                02151000
RGPCTEIN EQU   ISTRGP+80                                                02152000
RGPCTETR EQU   ISTRGP+78                                                02153000
RGPCTECL EQU   ISTRGP+76                                                02154000
RGPCTELN EQU   ISTRGP+74                                                02155000
RGPRSV03 EQU   ISTRGP+73                                                02156000
RGPRSV02 EQU   RGPFLG                                                   02157000
RGPASDLC EQU   RGPFLG                                                   02158000
RGPABSC  EQU   RGPFLG                                                   02159000
RGPASS   EQU   RGPFLG                                                   02160000
RGPADIL  EQU   RGPFLG                                                   02161000
RGPPRE   EQU   ISTRGP                                                   02162000
RRNRINNM EQU   ISTRRN+248                                               02163000
@NM00094 EQU   ISTRRN+247                                               02164000
RRNRDCUA EQU   ISTRRN+244                                               02165000
RRNLASTE EQU   ISTRRN+240                                               02166000
RRNNCSPL EQU   ISTRRN+236                                               02167000
RRNRPLPT EQU   ISTRRN+232                                               02168000
RRNMSIZE EQU   ISTRRN+228                                               02169000
RRNNCPNM EQU   ISTRRN+221                                               02170000
RRNCTPCC EQU   ISTRRN+220                                               02171000
RRNHBUFS EQU   ISTRRN+218                                               02172000
RRNHLENT EQU   RRNHPRE+1                                                02173000
RRNHLENH EQU   RRNHPRE                                                  02174000
RRNNMNCP EQU   ISTRRN+208                                               02175000
RRNDELAY EQU   ISTRRN+206                                               02176000
RRNRSV04 EQU   ISTRRN+200                                               02177000
RRNRSV88 EQU   RRNNMDPD+7                                               02178000
RRNPUBI  EQU   RRNNMDPD+6                                               02179000
RRNDPLUB EQU   RRNNMDPD                                                 02180000
RRNEPADR EQU   ISTRRN+190                                               02181000
RRNCPLUB EQU   ISTRRN+184                                               02182000
RRNFLUX  EQU   ISTRRN+180                                               02183000
RRNRSV05 EQU   RRNCMFD                                                  02184000
RRNREMPO EQU   RRNCMFD                                                  02185000
RRNCDREC EQU   RRNCMFD                                                  02186000
RRNCDDSI EQU   RRNCMFD                                                  02187000
RRNCDBCK EQU   RRNCMFD                                                  02188000
RRNCDDTL EQU   RRNCMFD                                                  02189000
RRNCDSTD EQU   RRNCMFD                                                  02190000
RRNCDCSP EQU   RRNCMFD                                                  02191000
RRNCCCSL EQU   RRNCMFC                                                  02192000
RRNCCSIM EQU   RRNCMFC                                                  02193000
RRNCCRCM EQU   RRNCMFC                                                  02194000
RRNCCRIM EQU   RRNCMFC                                                  02195000
RRNCCCRC EQU   RRNCMFC                                                  02196000
RRNCCRST EQU   RRNCMFC                                                  02197000
RRNCCRDQ EQU   RRNCMFC                                                  02198000
RRNCCRCN EQU   RRNCMFC                                                  02199000
RRNCBALT EQU   RRNCMFB                                                  02200000
RRNCBMOD EQU   RRNCMFB                                                  02201000
RRNCBNPL EQU   RRNCMFB                                                  02202000
RRNCBRLS EQU   RRNCMFB                                                  02203000
RRNCBRDS EQU   RRNCMFB                                                  02204000
RRNCBDLR EQU   RRNCMFB                                                  02205000
RRNCBDLH EQU   RRNCMFB                                                  02206000
RRNCBDLO EQU   RRNCMFB                                                  02207000
RRNCADGO EQU   RRNCMFA                                                  02208000
RRNCADTD EQU   RRNCMFA                                                  02209000
RRNCACDT EQU   RRNCMFA                                                  02210000
RRNCAMBH EQU   RRNCMFA                                                  02211000
RRNCAATI EQU   RRNCMFA                                                  02212000
RRNCAATG EQU   RRNCMFA                                                  02213000
RRNCAATD EQU   RRNCMFA                                                  02214000
RRNCAALL EQU   RRNCMFA                                                  02215000
RRNRSV55 EQU   RRNRDF+3                                                 02216000
RRNPTASL EQU   RRNRDFB+1                                                02217000
RRNRSV01 EQU   RRNRDFB+1                                                02218000
RRNVYDON EQU   RRNRDFB+1                                                02219000
RRNRBBUP EQU   RRNRDFB+1                                                02220000
RRNRSV03 EQU   RRNRDFB                                                  02221000
RRNRBCT2 EQU   RRNRDFB                                                  02222000
RRNRBCT1 EQU   RRNRDFB                                                  02223000
RRNRBSEC EQU   RRNRDFB                                                  02224000
RRNRBCCT EQU   RRNRDFB                                                  02225000
RRNRBCCL EQU   RRNRDFB                                                  02226000
RRNRSV02 EQU   RRNRDFB                                                  02227000
RRNRBMDL EQU   RRNRDFB                                                  02228000
RRNRAPEP EQU   RRNRDFA                                                  02229000
RRNRANCP EQU   RRNRDFA                                                  02230000
RRNRBREM EQU   RRNRDFA                                                  02231000
RRNRAOLT EQU   RRNRDFA                                                  02232000
RRNRASYN EQU   RRNRDFA                                                  02233000
RRNRADMP EQU   RRNRDFA                                                  02234000
RRNRAIPL EQU   RRNRDFA                                                  02235000
RRNRASHT EQU   RRNRDFA                                                  02236000
RRNCTENT EQU   ISTRRN+170                                               02237000
RRNCTECM EQU   ISTRRN+168                                               02238000
RRNCTEIN EQU   ISTRRN+166                                               02239000
RRNCTETR EQU   ISTRRN+164                                               02240000
RRNCTECL EQU   ISTRRN+162                                               02241000
RRNCTELI EQU   ISTRRN+160                                               02242000
RRNCTEGP EQU   ISTRRN+158                                               02243000
RRNCTBHS EQU   ISTRRN+156                                               02244000
RRNBHSET EQU   ISTRRN+152                                               02245000
RRNTRENT EQU   ISTRRN+148                                               02246000
RRNRLDIP EQU   ISTRRN+147                                               02247000
RRNRNCUA EQU   ISTRRN+144                                               02248000
RRNGRPA  EQU   ISTRRN+140                                               02249000
RRNLUBA  EQU   RRNUCBAD+1                                               02250000
RRNCHQI  EQU   RRNUCBAD                                                 02251000
RRNRSV11 EQU   RRNFLAG                                                  02252000
RRNDSTCT EQU   RRNFLAG                                                  02253000
RRNERPIP EQU   RRNFLAG                                                  02254000
RRNLCDIP EQU   RRNFLAG                                                  02255000
RRNLCDIE EQU   RRNFLAG                                                  02256000
RRNLCSIP EQU   RRNFLAG                                                  02257000
RRNRBISA EQU   RRNFLAG                                                  02258000
RRNRSV89 EQU   RRNFLAG                                                  02259000
RRNPRE   EQU   ISTRRN                                                   02260000
RLCRVPT2 EQU   ISTRLC+80                                                02261000
RLCRVPT1 EQU   ISTRLC+79                                                02262000
RLCLCCUA EQU   ISTRLC+76                                                02263000
RLCUCBAD EQU   RLCADR+1                                                 02264000
RLCRSVDE EQU   RLCFLAG                                                  02265000
RLCACNT  EQU   RLCFLAG                                                  02266000
RLCRSV14 EQU   RLCFLAG                                                  02267000
RLCRBISA EQU   RLCFLAG                                                  02268000
RLCRSV22 EQU   RLCFLAG                                                  02269000
RLCPRE   EQU   ISTRLC                                                   02270000
RAPRVPT2 EQU   ISTRAP+116                                               02271000
RAPRVPT1 EQU   ISTRAP+112                                               02272000
RAPBFACT EQU   ISTRAP+111                                               02273000
RAPRSV17 EQU   RAPFLGC                                                  02274000
RAPRSV16 EQU   RAPFLGC                                                  02275000
RAPRSV15 EQU   RAPFLGC                                                  02276000
RAPRSV14 EQU   RAPFLGC                                                  02277000
RAPRSV13 EQU   RAPFLGC                                                  02278000
RAPRSV12 EQU   RAPFLGC                                                  02279000
RAPRSV11 EQU   RAPFLGC                                                  02280000
RAPRSV10 EQU   RAPFLGC                                                  02281000
RAPRSV09 EQU   RAPFLGB                                                  02282000
RAPASPO  EQU   RAPFLGB                                                  02283000
RAPAPPO  EQU   RAPFLGB                                                  02284000
RAPAACQ  EQU   RAPFLGB                                                  02285000
RAPAPRMT EQU   RAPFLGB                                                  02286000
RAPAPASS EQU   RAPFLGB                                                  02287000
RAPABLCK EQU   RAPFLGB                                                  02288000
RAPALLF  EQU   RAPFLGB                                                  02289000
RAPRSV06 EQU   RAPFLG                                                   02290000
RAPRSV05 EQU   RAPFLG                                                   02291000
RAPRSV04 EQU   RAPFLG                                                   02292000
RAPRSV03 EQU   RAPFLG                                                   02293000
RAPATLGN EQU   RAPFLG                                                   02294000
RAPASLGI EQU   RAPFLG                                                   02295000
RAPAQUI  EQU   RAPFLG                                                   02296000
RAPABLGN EQU   RAPFLG                                                   02297000
RAPACEQD EQU   ISTRAP+106                                               02298000
RAPTRPRE EQU   ISTRAP+104                                               02299000
RAPACEAP EQU   ISTRAP+100                                               02300000
RAPICEAQ EQU   ISTRAP+96                                                02301000
RAPICEAC EQU   ISTRAP+92                                                02302000
RAPICELG EQU   ISTRAP+88                                                02303000
RAPAPPWD EQU   ISTRAP+80                                                02304000
RAPACDEB EQU   ISTRAP+76                                                02305000
RAPACBA  EQU   ISTRAP+72                                                02306000
RAPPRE   EQU   ISTRAP                                                   02307000
RDTVSRPL EQU   ISTRDT+132                                               02308000
RDTCRSPW EQU   ISTRDT+124                                               02309000
RDTCRSDS EQU   ISTRDT+116                                               02310000
@NM00093 EQU   ISTRDT+113                                               02311000
RRNSTCNT EQU   RDTSTCNT                                                 02312000
RRNVYRPH EQU   RDTVYRPH                                                 02313000
RDTTPAB  EQU   ISTRDT+104                                               02314000
RDTDPAB  EQU   ISTRDT+100                                               02315000
RDTEPAB  EQU   ISTRDT+96                                                02316000
RDTVPAB  EQU   ISTRDT+92                                                02317000
RDTRSV01 EQU   RDTFLAGB                                                 02318000
RDTBHSET EQU   RDTFLAGB                                                 02319000
RDTCTCFL EQU   RDTFLAGB                                                 02320000
RDTCTPGD EQU   RDTFLAGB                                                 02321000
RDTPRGDN EQU   RDTFLAGB                                                 02322000
RDTOUERP EQU   RDTFLAGB                                                 02323000
RDTLGCT  EQU   ISTRDT+90                                                02324000
RDTNODID EQU   ISTRDT+89                                                02325000
RDTMAXID EQU   ISTRDT+88                                                02326000
RDTCTSNT EQU   ISTRDT+86                                                02327000
RDTFLAGS EQU   ISTRDT+84                                                02328000
RDTBACK  EQU   ISTRDT+80                                                02329000
RDTFORW  EQU   ISTRDT+76                                                02330000
RDTLEN   EQU   RDTPLEN+1                                                02331000
RDTPRILS EQU   RDTPRIOR                                                 02332000
RDTPRISW EQU   RDTPRIOR                                                 02333000
RDTPRIRN EQU   RDTPRIOR                                                 02334000
RDTPRILC EQU   RDTPRIOR                                                 02335000
RDTPRIAP EQU   RDTPRIOR                                                 02336000
@NM00092 EQU   RDTPRIOR                                                 02337000
RDTPRE   EQU   ISTRDT                                                   02338000
RCPRSV05 EQU   ISTRCPRE+120                                             02339000
RCPRSV04 EQU   ISTRCPRE+116                                             02340000
RCPRSV03 EQU   ISTRCPRE+112                                             02341000
RCPINTA  EQU   RCPLGNIN+16                                              02342000
RCPLGNCT EQU   RCPLGNIN+8                                               02343000
RCPLGNAP EQU   RCPLGNIN                                                 02344000
@NM00091 EQU   RCPPMODE                                                 02345000
RCPRRECD EQU   RCPPMODE                                                 02346000
RCPRBASC EQU   RCPPMODE                                                 02347000
RCPBFLIM EQU   ISTRCPRE+90                                              02348000
RCPBHSI2 EQU   ISTRCPRE+89                                              02349000
RCPBHSI1 EQU   ISTRCPRE+88                                              02350000
RCPACETR EQU   ISTRCPRE+84                                              02351000
RCPICEAQ EQU   ISTRCPRE+80                                              02352000
RCPLNAPA EQU   ISTRCPRE+76                                              02353000
RCPICELN EQU   ISTRCPRE+72                                              02354000
RCPPRE   EQU   ISTRCPRE                                                 02355000
RPRCONID EQU   ISTRPRE+63                                               02356000
RPRCLVPD EQU   RPRFLAGC                                                 02357000
RPRINIMM EQU   RPRFLAGD                                                 02358000
RPRRSV05 EQU   RPRFLAGD                                                 02359000
RPRCONP  EQU   RPRFLAGD                                                 02360000
RPRACTP  EQU   RPRFLAGD                                                 02361000
RPRRSON  EQU   RPRFLAGD                                                 02362000
RPRCONCT EQU   RPRFLAGD                                                 02363000
RPRLTASN EQU   RPRFLAGD                                                 02364000
RPRPTHCT EQU   ISTRPRE+60                                               02365000
RPRSTPCT EQU   ISTRPRE+56                                               02366000
RPRRVPT1 EQU   ISTRPRE+52                                               02367000
RPRDEVCH EQU   ISTRPRE+44                                               02368000
RPRNCBA  EQU   ISTRPRE+40                                               02369000
RPRNSNEA EQU   ISTRPRE+36                                               02370000
RPRLGONB EQU   ISTRPRE+32                                               02371000
RPRLGONF EQU   ISTRPRE+28                                               02372000
RPRHDTYP EQU   ISTRPRE+27                                               02373000
RPRTIOCT EQU   ISTRPRE+26                                               02374000
RPRPEPCT EQU   ISTRPRE+24                                               02375000
RPRRSV03 EQU   RPRCAUSE                                                 02376000
RPRRSYNC EQU   RPRCAUSE                                                 02377000
RPRCRCPT EQU   RPRCAUSE                                                 02378000
RPRNOSRT EQU   RPRCAUSE                                                 02379000
RPRINTST EQU   RPRFLAGB                                                 02380000
RPRVYIMM EQU   RPRFLAGB                                                 02381000
RPRHLVPD EQU   RPRFLAGB                                                 02382000
RPRONLIN EQU   RPRFLAGB                                                 02383000
RPRVIODN EQU   RPRFLAGB                                                 02384000
RPRAOPN  EQU   RPRFLAGB                                                 02385000
RPRENTVT EQU   RPRFLAGB                                                 02386000
RPRENTVH EQU   RPRFLAGB                                                 02387000
RPRLIVE  EQU   RPRFLAGA                                                 02388000
RPRVRYPD EQU   RPRFLAGA                                                 02389000
RPRENTED EQU   RPRFLAGA                                                 02390000
RPRENTIO EQU   RPRFLAGA                                                 02391000
RPRENTBF EQU   RPRFLAGA                                                 02392000
RPRTIED  EQU   RPRFLAGA                                                 02393000
RPRINV   EQU   RPRFLAGA                                                 02394000
RPRACT   EQU   RPRFLAGA                                                 02395000
RPRPELEN EQU   ISTRPRE+18                                               02396000
RPRELEN  EQU   ISTRPRE+16                                               02397000
RPRRLOCK EQU   ISTRPRE+12                                               02398000
RPRDAF   EQU   RPRCOMID+2                                               02399000
RPRSAF   EQU   RPRCOMID                                                 02400000
ICNZCON6 EQU   ICNZCONS+10                                              02401000
ICNZCON5 EQU   ICNZCONS+8                                               02402000
ICNZCON4 EQU   ICNZCONS+6                                               02403000
ICNZCON3 EQU   ICNZCONS+4                                               02404000
ICNZCON2 EQU   ICNZCONS+2                                               02405000
ICNZCON1 EQU   ICNZCONS                                                 02406000
ICNZATSA EQU   ISTICNCB+676                                             02407000
ICNZX012 EQU   ISTICNCB+675                                             02408000
ICNZX011 EQU   ISTICNCB+674                                             02409000
ICNZX010 EQU   ISTICNCB+672                                             02410000
ICNSRB   EQU   ISTICNCB+628                                             02411000
ICNZC001 EQU   ISTICNCB+512                                             02412000
ICNZX013 EQU   ISTICNCB+511                                             02413000
ICNZS010 EQU   ICNZH002+1                                               02414000
ICNZS00F EQU   ICNZH002+1                                               02415000
ICNZS00E EQU   ICNZH002+1                                               02416000
ICNZS00D EQU   ICNZH002+1                                               02417000
ICNZS00C EQU   ICNZH002+1                                               02418000
ICNZS00B EQU   ICNZH002+1                                               02419000
ICNZS01A EQU   ICNZS00A                                                 02420000
ICNZS019 EQU   ICNZS009                                                 02421000
ICNZS018 EQU   ICNZS008                                                 02422000
ICNZS017 EQU   ICNZS007                                                 02423000
ICNZS016 EQU   ICNZS006                                                 02424000
ICNZS005 EQU   ICNZH002                                                 02425000
ICNZS014 EQU   ICNZS004                                                 02426000
ICNZS013 EQU   ICNZS003                                                 02427000
ICNZS012 EQU   ICNZS002                                                 02428000
ICNZS001 EQU   ICNZH002                                                 02429000
ICNZF028 EQU   ICNZFLAG                                                 02430000
ICNZF027 EQU   ICNZFLAG                                                 02431000
ICNZF026 EQU   ICNZFLAG                                                 02432000
ICNZF025 EQU   ICNZFLAG                                                 02433000
ICNZF024 EQU   ICNZFLAG                                                 02434000
ICNZF023 EQU   ICNZFLAG                                                 02435000
ICNZF022 EQU   ICNZFLAG                                                 02436000
ICNZF021 EQU   ICNZFLAG                                                 02437000
ICNWORD5 EQU   ISTICNCB+504                                             02438000
ICNMSIZE EQU   ISTICNCB+500                                             02439000
ICNLCVTA EQU   ISTICNCB+496                                             02440000
ICNDEBAD EQU   ICNDIDEB+1                                               02441000
ICNDCBIF EQU   ICNDIDEB                                                 02442000
ICNUCBAD EQU   ICNDCDEB+8                                               02443000
ICNAPPAD EQU   ICNDCDEB+5                                               02444000
ICNEXSCL EQU   ICNDCDEB+4                                               02445000
ICNDCBAD EQU   ICNDCDEB+1                                               02446000
ICNDEBID EQU   ICNDCDEB                                                 02447000
@NM00090 EQU   ISTICNCB+477                                             02448000
ICNERCNT EQU   ISTICNCB+476                                             02449000
ICNZX002 EQU   ISTICNCB+475                                             02450000
ICNZX001 EQU   ISTICNCB+474                                             02451000
ICNZH001 EQU   ISTICNCB+472                                             02452000
ICNZSW3R EQU   ISTICNCB+468                                             02453000
ICNZSW2R EQU   ISTICNCB+464                                             02454000
ICNZSW1R EQU   ISTICNCB+460                                             02455000
ICNZS4VR EQU   ISTICNCB+436                                             02456000
ICNZS4RR EQU   ISTICNCB+432                                             02457000
ICNZS4FC EQU   ISTICNCB+428                                             02458000
ICNZS4BC EQU   ISTICNCB+424                                             02459000
ICNZS3VR EQU   ISTICNCB+400                                             02460000
ICNZS3RR EQU   ISTICNCB+396                                             02461000
ICNZS3FC EQU   ISTICNCB+392                                             02462000
ICNZS3BC EQU   ISTICNCB+388                                             02463000
ICNZS1RC EQU   ICNZS1VR+36                                              02464000
ICNDIEW3 EQU   ICNDIEWA+8                                               02465000
ICNDIEW2 EQU   ICNDIEWA+4                                               02466000
ICNDIEW1 EQU   ICNDIEWA                                                 02467000
ICNZS1RR EQU   ISTICNCB+344                                             02468000
ICNZS1FC EQU   ISTICNCB+340                                             02469000
ICNZS1BC EQU   ISTICNCB+336                                             02470000
ICNRSTIC EQU   ICNZD004                                                 02471000
ICNRDCOD EQU   ICNRSCCW                                                 02472000
ICNZD006 EQU   ISTICNCB+312                                             02473000
ICNZD005 EQU   ISTICNCB+304                                             02474000
ICNWSTIC EQU   ICNZD002                                                 02475000
ICNWRCOD EQU   ICNWSCCW                                                 02476000
ICNZV008 EQU   ISTICNCB+284                                             02477000
ICNZV007 EQU   ISTICNCB+280                                             02478000
ICNZV006 EQU   ISTICNCB+276                                             02479000
ICNZV005 EQU   ISTICNCB+272                                             02480000
ICNZV004 EQU   ISTICNCB+268                                             02481000
ICNLSTIT EQU   ISTICNCB+264                                             02482000
ICNLSTIF EQU   ISTICNCB+260                                             02483000
ICNZV002 EQU   ISTICNCB+256                                             02484000
ICNZV001 EQU   ISTICNCB+252                                             02485000
ICNZV00A EQU   ISTICNCB+249                                             02486000
ICNBUFF  EQU   ISTICNCB+248                                             02487000
ICNCPQ   EQU   ISTICNCB+244                                             02488000
ICNNICNA EQU   ISTICNCB+240                                             02489000
@NM00089 EQU   ICNFLAG2+2                                               02490000
ICNZF019 EQU   ICNFLAG2+2                                               02491000
ICNZF018 EQU   ICNFLAG2+2                                               02492000
ICNZF017 EQU   ICNFLAG2+2                                               02493000
ICNZF016 EQU   ICNFLAG2+2                                               02494000
ICNZF015 EQU   ICNFLAG2+2                                               02495000
ICNMSG   EQU   ICNFLAG2+1                                               02496000
ICNCLOSE EQU   ICNFLAG2+1                                               02497000
ICNZF014 EQU   ICNFLAG2+1                                               02498000
ICNZF013 EQU   ICNFLAG2+1                                               02499000
ICNZF012 EQU   ICNFLAG2+1                                               02500000
ICNZF011 EQU   ICNFLAG2+1                                               02501000
ICNZF00D EQU   ICNFLAG2+1                                               02502000
ICNZF00B EQU   ICNFLAG2+1                                               02503000
ICNZF00A EQU   ICNFLAG2                                                 02504000
ICNZF008 EQU   ICNFLAG2                                                 02505000
ICNZF007 EQU   ICNFLAG2                                                 02506000
ICNZF005 EQU   ICNFLAG2                                                 02507000
ICNZF004 EQU   ICNFLAG2                                                 02508000
ICNZF003 EQU   ICNFLAG2                                                 02509000
ICNZF002 EQU   ICNFLAG2                                                 02510000
ICNZF001 EQU   ICNFLAG2                                                 02511000
ICNLOCK  EQU   ISTICNCB+232                                             02512000
ICNLICNA EQU   ISTICNCB+228                                             02513000
ICNRPH   EQU   ISTICNCB+120                                             02514000
ICNZV003 EQU   ISTICNCB+116                                             02515000
ICNLAST  EQU   ISTICNCB+112                                             02516000
ICNLSTBT EQU   ISTICNCB+108                                             02517000
ICNSIOQ  EQU   ISTICNCB+104                                             02518000
ICNFLAG1 EQU   ISTICNCB+103                                             02519000
ICNZSW08 EQU   ICNZSWS                                                  02520000
ICNZSW07 EQU   ICNZSWS                                                  02521000
ICNZSW06 EQU   ICNZSWS                                                  02522000
ICNZSW05 EQU   ICNZSWS                                                  02523000
ICNZSW04 EQU   ICNZSWS                                                  02524000
ICNZSW03 EQU   ICNZSWS                                                  02525000
ICNZSW02 EQU   ICNZSWS                                                  02526000
ICNZSW01 EQU   ICNZSWS                                                  02527000
ICNZFF69 EQU   ICNFFLAG                                                 02528000
@NM00088 EQU   ICNFFLAG                                                 02529000
ICNZFF05 EQU   ICNFFLAG                                                 02530000
ICNZFF04 EQU   ICNFFLAG                                                 02531000
ICNZFF03 EQU   ICNFFLAG                                                 02532000
ICNZFF02 EQU   ICNFFLAG                                                 02533000
ICNZFF01 EQU   ICNFFLAG                                                 02534000
ICNZFF00 EQU   ICNFFLAG                                                 02535000
@NM00087 EQU   ICNFLAG                                                  02536000
ICNZCRIT EQU   ICNFLAG                                                  02537000
ICNSTART EQU   ICNFLAG                                                  02538000
ICNSLOW  EQU   ICNFLAG                                                  02539000
ICNZF010 EQU   ICNFLAG                                                  02540000
ICNZF00F EQU   ICNFLAG                                                  02541000
ICNZF00E EQU   ICNFLAG                                                  02542000
ICNCONF  EQU   ICNZF006                                                 02543000
ICNCKPAB EQU   ICNCKFLD+1                                               02544000
ICNRSV07 EQU   ICNCKFLD                                                 02545000
ICNCKBIT EQU   ICNCKFLD                                                 02546000
ICNZPAB4 EQU   ISTICNCB+80                                              02547000
ICNZPAB1 EQU   ISTICNCB+64                                              02548000
ICNRSV01 EQU   ISTICNCB+60                                              02549000
@NM00086 EQU   ISTICNCB+56                                              02550000
@NM00085 EQU   ISTICNCB+54                                              02551000
@NM00084 EQU   @NM00083                                                 02552000
ICNRRY   EQU   @NM00083                                                 02553000
ICNLCLUS EQU   @NM00083                                                 02554000
ICNROLN  EQU   @NM00083                                                 02555000
ICNRNRY  EQU   @NM00083                                                 02556000
ICNLNKMD EQU   ISTICNCB+52                                              02557000
ICNCUUA  EQU   ISTICNCB+48                                              02558000
ICNCB    EQU   ISTICNCB                                                 02559000
NSRUNA6  EQU   NSRUNA5                                                  02560000
RUBDATA  EQU   ISTRUB                                                   02561000
PIUTH    EQU   ISTPIU                                                   02562000
NIRRH    EQU   ISTNIR                                                   02563000
RHRSVD5  EQU   RH3                                                      02564000
RHRSVD4  EQU   RH3                                                      02565000
RHLOG    EQU   RH3                                                      02566000
RHRSVD3  EQU   RH3                                                      02567000
RHRCDIR  EQU   RH3                                                      02568000
RHCDIR   EQU   RH3                                                      02569000
RHEB     EQU   RH3                                                      02570000
RHBB     EQU   RH3                                                      02571000
RHPACE   EQU   RH2                                                      02572000
RHRSVD2  EQU   RH2                                                      02573000
RHINOP   EQU   RHRSVD1                                                  02574000
RHBUSY   EQU   RHRETRY                                                  02575000
RHEXCEPT EQU   RH2                                                      02576000
RHRRN    EQU   RH2                                                      02577000
RHPE     EQU   RH2                                                      02578000
RHFME    EQU   RH2                                                      02579000
RHCHAIN  EQU   RH1                                                      02580000
RHSENSE  EQU   RH1                                                      02581000
RHFORMAT EQU   RH1                                                      02582000
RHDIRI   EQU   RH1                                                      02583000
RHSCI    EQU   RH1                                                      02584000
RHTYPE   EQU   RH1                                                      02585000
RHQS     EQU   RH1                                                      02586000
ZIBLNG1  EQU   ZIBFSM                                                   02587000
ZIBCHAIN EQU   ISTZIBUF                                                 02588000
FSBFDB   EQU   ISTFSB+32                                                02589000
FSBRSV01 EQU   FSBFSB+30                                                02590000
FSBTHCNT EQU   FSBFSB+28                                                02591000
FSBRLRSV EQU   FSBRLSTS                                                 02592000
FSBCFTX  EQU   FSBRLSTS                                                 02593000
FSBICNCB EQU   FSBMSGID                                                 02594000
FSBSSOC  EQU   FSBSS2                                                   02595000
FSBSSCC  EQU   FSBSS2                                                   02596000
FSBSSDC  EQU   FSBSS2                                                   02597000
FSBSSEC  EQU   FSBSS2                                                   02598000
FSBSSIR  EQU   FSBSS2                                                   02599000
FSBSSCR  EQU   FSBSS2                                                   02600000
@NM00072 EQU   FSBSS2                                                   02601000
@NM00071 EQU   FSBSS1                                                   02602000
FSBSSDE  EQU   FSBSS1                                                   02603000
FSBSSUS  EQU   FSBSS1                                                   02604000
@NM00070 EQU   FSBSS1                                                   02605000
FSBSOHI  EQU   FSBERC                                                   02606000
FSBLGI   EQU   FSBERC                                                   02607000
FSBLMRI  EQU   FSBFBMI                                                  02608000
FSBETI   EQU   FSBERC                                                   02609000
FSBEMI   EQU   FSBERC                                                   02610000
FSBEBI   EQU   FSBERC                                                   02611000
FSBECI   EQU   FSBERC                                                   02612000
FSBELI   EQU   FSBERC                                                   02613000
FSBMJRCD EQU   FSBSRCAT                                                 02614000
FSBXLCI  EQU   FSBXCODE                                                 02615000
FSBXFINS EQU   FSBXCODE                                                 02616000
FSBXNORM EQU   FSBXFSTS                                                 02617000
FSBSCODE EQU   FSBSYSRS                                                 02618000
FSBSPHSE EQU   FSBSYSRS                                                 02619000
FSBSERR  EQU   FSBSYSRS                                                 02620000
FSBCMD   EQU   FSBSEQ                                                   02621000
FSBDTRCE EQU   FSBFLAGS                                                 02622000
FSBASBTU EQU   FSBFLAGS                                                 02623000
FSBINPET EQU   FSBFLAGS                                                 02624000
FSBNONCB EQU   FSBFLAGS                                                 02625000
FSBLBIND EQU   FSBFLAGS                                                 02626000
FSBFFIND EQU   FSBFLAGS                                                 02627000
FSBACIND EQU   FSBFLAGS                                                 02628000
FSBRFIND EQU   FSBFLAGS                                                 02629000
FSBDAF   EQU   FSBCID+2                                                 02630000
FSBSAF   EQU   FSBCID                                                   02631000
FSBGATE  EQU   FSBFSBA                                                  02632000
FSBRSV02 EQU   FSBSFLGS                                                 02633000
FSBPGBUF EQU   FSBSFLGS                                                 02634000
FSBMNSDA EQU   FSBMNRCD                                                 02635000
FSBMNOA  EQU   FSBMNRCD                                                 02636000
FSBMNDIF EQU   FSBMNRCD                                                 02637000
FSBMNEOP EQU   FSBMNRCD                                                 02638000
FSBMNDNU EQU   FSBMNRCD                                                 02639000
FSBMNATN EQU   FSBMNRCD                                                 02640000
FSBMNRVI EQU   FSBMNRCD                                                 02641000
FSBMNELI EQU   FSBMNRCD                                                 02642000
FSBLNGTH EQU   FSBFSB+1                                                 02643000
FSBTYPE  EQU   FSBFSB                                                   02644000
TH2SNF   EQU   ISTTH2+4                                                 02645000
TH2OAF   EQU   ISTTH2+3                                                 02646000
TH2DAF   EQU   ISTTH2+2                                                 02647000
TH2CDF   EQU   TH2FLAG1+1                                               02648000
TH2SEF   EQU   TH2FLAG1+1                                               02649000
TH2PYF   EQU   TH2FLAG1+1                                               02650000
TH2AFI   EQU   TH2FLAG1                                                 02651000
TH2PSI   EQU   TH2FLAG1                                                 02652000
TH2CMPLI EQU   TH2MPF                                                   02653000
TH2RHI   EQU   TH2MPF                                                   02654000
TH2FID   EQU   TH2FLAG1                                                 02655000
THDCF    EQU   ISTTH+8                                                  02656000
THSNF    EQU   ISTTH+6                                                  02657000
THOAF    EQU   ISTTH+4                                                  02658000
THDAF    EQU   ISTTH+2                                                  02659000
THCDF    EQU   THFLGB                                                   02660000
THSEF    EQU   THFLGB                                                   02661000
THPYF    EQU   THFLGB                                                   02662000
THAFI    EQU   THFLGA                                                   02663000
THPSI    EQU   THFLGA                                                   02664000
THCMPLI  EQU   THMPF                                                    02665000
THRHI    EQU   THMPF                                                    02666000
THFID    EQU   THFLAG1                                                  02667000
LHVDATA  EQU   ISTLH+4                                                  02668000
LHFUNCT  EQU   ISTLH+3                                                  02669000
@NM00069 EQU   ISTLH+2                                                  02670000
LHLEN    EQU   ISTLH                                                    02671000
FDBOFSET EQU   ISTFDB+10                                                02672000
FDBDATCT EQU   ISTFDB+8                                                 02673000
FDBDATAA EQU   ISTFDB+4                                                 02674000
FDBFDBA  EQU   ISTFDB                                                   02675000
DNCZC001 EQU   DNCOS+40                                                 02676000
DNCLOCK  EQU   DNCOS+36                                                 02677000
DNCZV005 EQU   DNCOS+32                                                 02678000
DNCZV004 EQU   DNCOS+28                                                 02679000
DNCZV003 EQU   DNCOS+24                                                 02680000
DNCZV002 EQU   DNCOS+21                                                 02681000
DNCZX001 EQU   DNCOS+20                                                 02682000
DNCZV001 EQU   DNCOS+17                                                 02683000
DNCZX003 EQU   DNCOS+16                                                 02684000
DNCZV000 EQU   DNCOS+12                                                 02685000
DNCSESCQ EQU   DNCOS+8                                                  02686000
DNCSESIQ EQU   DNCOS+4                                                  02687000
DNCACIP  EQU   DNCBSCED+1                                               02688000
DNCLICP  EQU   DNCBSCED                                                 02689000
DNCZF008 EQU   DNCZFLGS+1                                               02690000
DNCZPSRD EQU   DNCZFLGS+1                                               02691000
DNCPSOL  EQU   DNCZFLGS+1                                               02692000
DNCZF007 EQU   DNCZFLGS+1                                               02693000
DNCZF006 EQU   DNCZFLGS+1                                               02694000
DNCZF005 EQU   DNCZFLGS+1                                               02695000
DNCZF004 EQU   DNCZFLGS+1                                               02696000
DNCZF003 EQU   DNCZFLGS                                                 02697000
DNCZF002 EQU   DNCZFLGS                                                 02698000
DNCZRSCH EQU   DNCZFLGS                                                 02699000
DNCDISC  EQU   DNCZFLGS                                                 02700000
DNCCONT  EQU   DNCZFLGS                                                 02701000
DNCINVIT EQU   DNCZFLGS                                                 02702000
DNCSESS  EQU   DNCZFLGS                                                 02703000
DNCZF001 EQU   DNCZFLGS                                                 02704000
DNCMODE  EQU   ISTDNCB+49                                               02705000
DNCBHSET EQU   ISTDNCB+48                                               02706000
NCBRSV01 EQU   ISTNCB+46                                                02707000
NCBSWDAF EQU   ISTNCB+44                                                02708000
NCBDEVCH EQU   ISTNCB+36                                                02709000
NCBFMCBP EQU   ISTNCB+32                                                02710000
NCBLTRC  EQU   ISTNCB+30                                                02711000
NCBRVPT1 EQU   ISTNCB+28                                                02712000
NCBNMLLN EQU   NCBFLAGS+3                                               02713000
@NM00068 EQU   NCBFLAG1                                                 02714000
NCBFORCE EQU   NCBFLAG1                                                 02715000
NCBTTF   EQU   NCBFLAG1                                                 02716000
NCBRSYNC EQU   NCBFLAG1                                                 02717000
NCBRSTRT EQU   NCBFLAG1                                                 02718000
NCBCONF  EQU   NCBFLAG1                                                 02719000
NCBSNAI  EQU   NCBFLAG1                                                 02720000
NCBFLTIO EQU   NCBFTRIO                                                 02721000
NCBCSTAT EQU   NCBFLAGS                                                 02722000
NCBNCSL  EQU   ISTNCB+22                                                02723000
NCBNCBA  EQU   ISTNCB+20                                                02724000
NCBFMCBA EQU   ISTNCB+16                                                02725000
NCBNSNA  EQU   ISTNCB+12                                                02726000
NCBTSKID EQU   ISTNCB+8                                                 02727000
NCBDAF   EQU   ISTNCB+2                                                 02728000
NCBLNGTH EQU   ISTNCB+1                                                 02729000
NCBTYPE  EQU   ISTNCB                                                   02730000
DEVRSV03 EQU   ISTDEVCH+5                                               02731000
DEVPHYSA EQU   ISTDEVCH+4                                               02732000
DEVCSLPN EQU   DEVCHAR3                                                 02733000
DEVCSTCL EQU   DEVCHAR3                                                 02734000
DEVCCHEK EQU   DEVCHAR3                                                 02735000
DEVCATTN EQU   DEVCHAR3                                                 02736000
DEVCSWL  EQU   DEVFCCTL                                                 02737000
DEVCRVB  EQU   DEVFCCTL                                                 02738000
DEVCSSL  EQU   DEVFCCTL                                                 02739000
DEVCBSC  EQU   DEVFCCTL                                                 02740000
DEVMCODE EQU   ISTDEVCH+2                                               02741000
DEVCHAR2 EQU   DEVTCODE                                                 02742000
DEVRSV01 EQU   DEVCHAR                                                  02743000
DEVCCTL  EQU   DEVCHAR                                                  02744000
DEVNNSPT EQU   DEVCHAR                                                  02745000
DEVSPS   EQU   DEVCHAR                                                  02746000
DEVSUBND EQU   DEVCHAR                                                  02747000
DEVCONVR EQU   DEVCHAR                                                  02748000
DEVOTPUT EQU   DEVCHAR                                                  02749000
DEVINPUT EQU   DEVCHAR                                                  02750000
CRACHAIN EQU   ISTCRA+928                                               02751000
CRARSV02 EQU   ISTCRA+924                                               02752000
CRARSV01 EQU   ISTCRA+920                                               02753000
CRABFTBA EQU   CRABUFA                                                  02754000
CRAMASK  EQU   CRASVC+64                                                02755000
CRAHSIZ  EQU   CRASVC+60                                                02756000
CRAASCRR EQU   CRASVC                                                   02757000
CRAPROCR EQU   ISTCRA+312                                               02758000
CRAPSS   EQU   ISTCRA+160                                               02759000
CRARPH   EQU   ISTCRA+52                                                02760000
CRALAPTR EQU   CRABASIC+48                                              02761000
CRAL9PTR EQU   CRABASIC+44                                              02762000
CRAL8PTR EQU   CRABASIC+40                                              02763000
CRAL7PTR EQU   CRABASIC+36                                              02764000
CRAL6PTR EQU   CRABASIC+32                                              02765000
CRAL5PTR EQU   CRABASIC+28                                              02766000
CRAL4PTR EQU   CRABASIC+24                                              02767000
CRAL3PTR EQU   CRABASIC+20                                              02768000
CRAL2PTR EQU   CRABASIC+16                                              02769000
CRAL1PTR EQU   CRABASIC+12                                              02770000
CRALEV01 EQU   CRALKACT+3                                               02771000
CRALEV02 EQU   CRALKACT+3                                               02772000
CRALEV03 EQU   CRALKACT+3                                               02773000
CRALEV04 EQU   CRALKACT+3                                               02774000
CRALEV05 EQU   CRALKACT+3                                               02775000
CRALEV06 EQU   CRALKACT+3                                               02776000
CRALEV07 EQU   CRALKACT+3                                               02777000
CRALEV08 EQU   CRALKACT+3                                               02778000
CRALEV09 EQU   CRALKACT+2                                               02779000
CRALEV10 EQU   CRALKACT+2                                               02780000
CRALEV11 EQU   CRALKACT+2                                               02781000
CRALEV12 EQU   CRALKACT+2                                               02782000
CRALEV13 EQU   CRALKACT+2                                               02783000
CRALEV14 EQU   CRALKACT+2                                               02784000
CRALEV15 EQU   CRALKACT+2                                               02785000
CRALEV16 EQU   CRALKACT+2                                               02786000
CRALEV17 EQU   CRALKACT+1                                               02787000
CRALEV18 EQU   CRALKACT+1                                               02788000
CRALEV19 EQU   CRALKACT+1                                               02789000
CRALEV20 EQU   CRALKACT+1                                               02790000
CRALEV21 EQU   CRALKACT+1                                               02791000
CRALEV22 EQU   CRALKACT+1                                               02792000
CRALEV23 EQU   CRALKACT+1                                               02793000
CRALEV24 EQU   CRALKACT+1                                               02794000
CRALEV25 EQU   CRALKACT                                                 02795000
CRALEV26 EQU   CRALKACT                                                 02796000
CRALEV27 EQU   CRALKACT                                                 02797000
CRALEV28 EQU   CRALKACT                                                 02798000
CRALEV29 EQU   CRALKACT                                                 02799000
CRALEV30 EQU   CRALKACT                                                 02800000
CRALEV31 EQU   CRALKACT                                                 02801000
CRALEV32 EQU   CRALKACT                                                 02802000
CRAFRR   EQU   CRAHDR+4                                                 02803000
@NM00067 EQU   ISTAPCRR+137                                             02804000
@NM00066 EQU   APC57FLG                                                 02805000
APCNREL  EQU   APC57FLG                                                 02806000
APCRECRA EQU   APC57FLG                                                 02807000
@NM00065 EQU   APC54FLG                                                 02808000
APCRLST  EQU   APC54FLG                                                 02809000
APCPR153 EQU   APC53FLG                                                 02810000
@NM00064 EQU   APC52FLG                                                 02811000
APCWKF   EQU   APC52FLG                                                 02812000
APCNWF   EQU   APC52FLG                                                 02813000
APCRDQ   EQU   APC52FLG                                                 02814000
APCQENQ  EQU   APC52FLG                                                 02815000
APCSMSR  EQU   APC52FLG                                                 02816000
APCCKRQ  EQU   APC52FLG                                                 02817000
@NM00063 EQU   APC31FLG                                                 02818000
APCSORT  EQU   APC31FLG                                                 02819000
APCRESCH EQU   APC31FLG                                                 02820000
APCTPXIT EQU   APC31FLG                                                 02821000
APCSWTWD EQU   ISTAPCRR+128                                             02822000
APCSAV2  EQU   ISTAPCRR+124                                             02823000
APCSAV1  EQU   ISTAPCRR+120                                             02824000
APCRETCD EQU   APCCOMF+2                                                02825000
@NM00062 EQU   APCCOMF1+1                                               02826000
APCZLBER EQU   APCCOMF1                                                 02827000
APCEXIT  EQU   APCCOMF1                                                 02828000
APCRELR  EQU   APCCOMF1                                                 02829000
APCIRB2  EQU   APCCOMF1                                                 02830000
APCIRB1  EQU   APCCOMF1                                                 02831000
APCSMCR  EQU   APCCOMF1                                                 02832000
APCUETSK EQU   APCCOMF1                                                 02833000
APCSSTSK EQU   APCCOMF1                                                 02834000
APCESTAL EQU   APCSAVE                                                  02835000
APCFRRPM EQU   ISTAPCRR+40                                              02836000
APCQWFO  EQU   ISTAPCRR+36                                              02837000
APCPABSV EQU   ISTAPCRR+32                                              02838000
APCRTRN  EQU   ISTAPCRR+28                                              02839000
APCTCBA  EQU   ISTAPCRR+24                                              02840000
APCPSTA  EQU   ISTAPCRR+20                                              02841000
@NM00061 EQU   APCRFLG+1                                                02842000
APC31R   EQU   APCRFLG                                                  02843000
APC58R   EQU   APCRFLG                                                  02844000
APC57R   EQU   APCRFLG                                                  02845000
APC56R   EQU   APCRFLG                                                  02846000
APC54R   EQU   APCRFLG                                                  02847000
APC53R   EQU   APCRFLG                                                  02848000
APC52R   EQU   APCRFLG                                                  02849000
APC51R   EQU   APCRFLG                                                  02850000
@NM00060 EQU   APCATFLG+1                                               02851000
APC31E   EQU   APCATFLG                                                 02852000
APC58E   EQU   APCATFLG                                                 02853000
APC57E   EQU   APCATFLG                                                 02854000
APC56E   EQU   APCATFLG                                                 02855000
APC54E   EQU   APCATFLG                                                 02856000
APC53E   EQU   APCATFLG                                                 02857000
APC52E   EQU   APCATFLG                                                 02858000
APC51E   EQU   APCATFLG                                                 02859000
APCHDRSV EQU   ISTAPCRR                                                 02860000
ASCPSREG EQU   ISTASCRR+44                                              02861000
ASCUSR01 EQU   ASCUSRGS+12                                              02862000
ASCUSR00 EQU   ASCUSRGS+8                                               02863000
ASCUSR15 EQU   ASCUSRGS+4                                               02864000
ASCUSR14 EQU   ASCUSRGS                                                 02865000
ASCETRYA EQU   ISTASCRR+24                                              02866000
ASCKEY   EQU   ISTASCRR+23                                              02867000
ASCAUDIT EQU   ASCFLG3                                                  02868000
ASCFBDUD EQU   ASCFLG3                                                  02869000
ASCLLKF  EQU   ASCFLG3                                                  02870000
ASCKEYF  EQU   ASCFLG3                                                  02871000
ASCFBDAL EQU   ASCFLG3                                                  02872000
ASCFSRGT EQU   ASCFLG3                                                  02873000
ASCICR   EQU   ASCFLG2                                                  02874000
ASCFSRIC EQU   ASCFLG2                                                  02875000
ASCFBDIC EQU   ASCFLG2                                                  02876000
ASCFBAIC EQU   ASCFLG2                                                  02877000
ASCPASTR EQU   ASCFLG1                                                  02878000
ASCFSR   EQU   ASCFLG1                                                  02879000
ASCFBD   EQU   ASCFLG1                                                  02880000
ASCFBA   EQU   ASCFLG1                                                  02881000
ASCPFCRR EQU   ISTASCRR                                                 02882000
ZCRRU    EQU   ZCRRHRU+3                                                02883000
ZCRRH    EQU   ZCRRHRU                                                  02884000
ZCRWORDA EQU   ISTZCRR+477                                              02885000
ZCRCMNRC EQU   ISTZCRR+476                                              02886000
ZCRRSV97 EQU   ZCRENTER+18                                              02887000
ZCREIC2B EQU   ZCRENTER+18                                              02888000
ZCREAC2B EQU   ZCRENTER+18                                              02889000
ZCRELCAB EQU   ZCRENTER+18                                              02890000
ZCREDCMF EQU   ZCRENTER+18                                              02891000
ZCREBCIF EQU   ZCRENTER+18                                              02892000
ZCREICSG EQU   ZCRENTER+18                                              02893000
ZCREDCK0 EQU   ZCRENTER+18                                              02894000
ZCRECFY0 EQU   ZCRENTER+17                                              02895000
ZCREKCCB EQU   ZCRENTER+17                                              02896000
ZCREDCNB EQU   ZCRENTER+17                                              02897000
ZCREICOE EQU   ZCRENTER+17                                              02898000
ZCREBCNB EQU   ZCRENTER+17                                              02899000
ZCREBC0L EQU   ZCRENTER+17                                              02900000
ZCREBCAL EQU   ZCRENTER+17                                              02901000
ZCREDCQR EQU   ZCRENTER+17                                              02902000
ZCREDCPR EQU   ZCRENTER+16                                              02903000
ZCREBCSB EQU   ZCRENTER+16                                              02904000
ZCREAC1R EQU   ZCRENTER+16                                              02905000
ZCRECCCI EQU   ZCRENTER+16                                              02906000
ZCRECCAI EQU   ZCRENTER+16                                              02907000
ZCRECCBI EQU   ZCRENTER+16                                              02908000
ZCREBCAR EQU   ZCRENTER+16                                              02909000
ZCREBCDR EQU   ZCRENTER+16                                              02910000
ZCREBCBR EQU   ZCRENTER+15                                              02911000
ZCREDCXR EQU   ZCRENTER+15                                              02912000
ZCREDCWB EQU   ZCRENTER+15                                              02913000
ZCREDCWR EQU   ZCRENTER+15                                              02914000
ZCREKCCN EQU   ZCRENTER+15                                              02915000
ZCREKCBN EQU   ZCRENTER+15                                              02916000
ZCREKCBB EQU   ZCRENTER+15                                              02917000
ZCREJC0B EQU   ZCRENTER+15                                              02918000
ZCREJCDB EQU   ZCRENTER+14                                              02919000
ZCREJCCB EQU   ZCRENTER+14                                              02920000
ZCREJCBB EQU   ZCRENTER+14                                              02921000
ZCREJCAB EQU   ZCRENTER+14                                              02922000
ZCREIC1B EQU   ZCRENTER+14                                              02923000
ZCREIC0B EQU   ZCRENTER+14                                              02924000
ZCREICX0 EQU   ZCRENTER+14                                              02925000
ZCREICWB EQU   ZCRENTER+14                                              02926000
ZCREICVB EQU   ZCRENTER+13                                              02927000
ZCREICUB EQU   ZCRENTER+13                                              02928000
ZCREICTB EQU   ZCRENTER+13                                              02929000
ZCREICSC EQU   ZCRENTER+13                                              02930000
ZCREICSB EQU   ZCRENTER+13                                              02931000
ZCREICRB EQU   ZCRENTER+13                                              02932000
ZCREICQB EQU   ZCRENTER+13                                              02933000
ZCREICQA EQU   ZCRENTER+13                                              02934000
ZCREICOB EQU   ZCRENTER+12                                              02935000
ZCREICOA EQU   ZCRENTER+12                                              02936000
ZCREICNB EQU   ZCRENTER+12                                              02937000
ZCREICNA EQU   ZCRENTER+12                                              02938000
ZCREICMB EQU   ZCRENTER+12                                              02939000
ZCREICLB EQU   ZCRENTER+12                                              02940000
ZCREICKG EQU   ZCRENTER+12                                              02941000
ZCREICKE EQU   ZCRENTER+12                                              02942000
ZCREICKB EQU   ZCRENTER+11                                              02943000
ZCREICJB EQU   ZCRENTER+11                                              02944000
ZCREICID EQU   ZCRENTER+11                                              02945000
ZCREICIB EQU   ZCRENTER+11                                              02946000
ZCREICHB EQU   ZCRENTER+11                                              02947000
ZCREICGB EQU   ZCRENTER+11                                              02948000
ZCREICEB EQU   ZCRENTER+11                                              02949000
ZCREICDB EQU   ZCRENTER+11                                              02950000
ZCREICCI EQU   ZCRENTER+10                                              02951000
ZCREICCB EQU   ZCRENTER+10                                              02952000
ZCREICBI EQU   ZCRENTER+10                                              02953000
ZCREICBB EQU   ZCRENTER+10                                              02954000
ZCREICAB EQU   ZCRENTER+10                                              02955000
ZCREICAA EQU   ZCRENTER+10                                              02956000
ZCREHCAN EQU   ZCRENTER+10                                              02957000
ZCREGC0B EQU   ZCRENTER+10                                              02958000
ZCREGC0A EQU   ZCRENTER+9                                               02959000
ZCREGCLA EQU   ZCRENTER+9                                               02960000
ZCREGCEB EQU   ZCRENTER+9                                               02961000
ZCREGCDB EQU   ZCRENTER+9                                               02962000
@NM00059 EQU   ZCRENTER+9                                               02963000
ZCREGCBB EQU   ZCRENTER+9                                               02964000
ZCREGCAB EQU   ZCRENTER+9                                               02965000
ZCREFCEB EQU   ZCRENTER+9                                               02966000
ZCREFCEA EQU   ZCRENTER+8                                               02967000
ZCREECTA EQU   ZCRENTER+8                                               02968000
ZCREECEA EQU   ZCRENTER+8                                               02969000
ZCREECDA EQU   ZCRENTER+8                                               02970000
ZCREECCB EQU   ZCRENTER+8                                               02971000
ZCREECCA EQU   ZCRENTER+8                                               02972000
ZCREECBB EQU   ZCRENTER+8                                               02973000
ZCREECBA EQU   ZCRENTER+8                                               02974000
ZCREDCL0 EQU   ZCRENTER+7                                               02975000
ZCREDCKB EQU   ZCRENTER+7                                               02976000
ZCREDCKA EQU   ZCRENTER+7                                               02977000
ZCREDCJ0 EQU   ZCRENTER+7                                               02978000
ZCREDCI0 EQU   ZCRENTER+7                                               02979000
ZCREDCH0 EQU   ZCRENTER+7                                               02980000
ZCREDCF0 EQU   ZCRENTER+7                                               02981000
ZCREDCE0 EQU   ZCRENTER+6                                               02982000
ZCREDCD0 EQU   ZCRENTER+6                                               02983000
ZCREDCC0 EQU   ZCRENTER+6                                               02984000
ZCREDCB0 EQU   ZCRENTER+6                                               02985000
ZCREDCA0 EQU   ZCRENTER+6                                               02986000
ZCRECC2B EQU   ZCRENTER+6                                               02987000
ZCRECC1B EQU   ZCRENTER+6                                               02988000
ZCRECC1A EQU   ZCRENTER+6                                               02989000
ZCRECC0B EQU   ZCRENTER+5                                               02990000
ZCRECC0A EQU   ZCRENTER+5                                               02991000
ZCREBC0B EQU   ZCRENTER+5                                               02992000
ZCREBC0A EQU   ZCRENTER+5                                               02993000
ZCREBCZ0 EQU   ZCRENTER+5                                               02994000
ZCREBCY0 EQU   ZCRENTER+5                                               02995000
ZCREBCX0 EQU   ZCRENTER+5                                               02996000
ZCREBCXA EQU   ZCRENTER+5                                               02997000
ZCREBCSC EQU   ZCRENTER+4                                               02998000
ZCREBCRB EQU   ZCRENTER+4                                               02999000
ZCREBCRA EQU   ZCRENTER+4                                               03000000
ZCREBCQB EQU   ZCRENTER+4                                               03001000
ZCREBCPB EQU   ZCRENTER+4                                               03002000
ZCREBCOB EQU   ZCRENTER+4                                               03003000
ZCREBCNE EQU   ZCRENTER+4                                               03004000
ZCREBCND EQU   ZCRENTER+4                                               03005000
ZCREBCMB EQU   ZCRENTER+3                                               03006000
ZCREBCLB EQU   ZCRENTER+3                                               03007000
ZCREBCLA EQU   ZCRENTER+3                                               03008000
ZCREBCKB EQU   ZCRENTER+3                                               03009000
ZCREBCKA EQU   ZCRENTER+3                                               03010000
ZCREBCJB EQU   ZCRENTER+3                                               03011000
ZCREBCJA EQU   ZCRENTER+3                                               03012000
ZCREBCID EQU   ZCRENTER+3                                               03013000
ZCREBCIB EQU   ZCRENTER+2                                               03014000
ZCREBCIA EQU   ZCRENTER+2                                               03015000
ZCREBCHB EQU   ZCRENTER+2                                               03016000
ZCREBCHA EQU   ZCRENTER+2                                               03017000
ZCREBCGB EQU   ZCRENTER+2                                               03018000
ZCREBCGA EQU   ZCRENTER+2                                               03019000
ZCREBCFB EQU   ZCRENTER+2                                               03020000
ZCREBCFA EQU   ZCRENTER+2                                               03021000
ZCREBCEB EQU   ZCRENTER+1                                               03022000
ZCREBCDI EQU   ZCRENTER+1                                               03023000
ZCREBCCB EQU   ZCRENTER+1                                               03024000
ZCREBCBI EQU   ZCRENTER+1                                               03025000
ZCREBCBB EQU   ZCRENTER+1                                               03026000
ZCREBCBA EQU   ZCRENTER+1                                               03027000
ZCREBCAM EQU   ZCRENTER+1                                               03028000
ZCREBCAI EQU   ZCRENTER+1                                               03029000
ZCREBCAG EQU   ZCRENTER                                                 03030000
ZCREBCAE EQU   ZCRENTER                                                 03031000
ZCREBCAB EQU   ZCRENTER                                                 03032000
ZCREBCAA EQU   ZCRENTER                                                 03033000
ZCREAC1B EQU   ZCRENTER                                                 03034000
ZCREAC0B EQU   ZCRENTER                                                 03035000
ZCREAC0A EQU   ZCRENTER                                                 03036000
ZCREAC1A EQU   ZCRENTER                                                 03037000
ZCRTNAME EQU   ZCRAUDIT+1                                               03038000
ZCRTID   EQU   ZCRAUDIT                                                 03039000
ZCRREMIC EQU   ISTZCRR+436                                              03040000
ZCRSAVEZ EQU   ISTZCRR+196                                              03041000
ZCRDAFSV EQU   ZCRCIDSV+2                                               03042000
ZCRSAFSV EQU   ZCRCIDSV                                                 03043000
ZCRR13SV EQU   ISTZCRR+188                                              03044000
ZCRR2SV  EQU   ISTZCRR+184                                              03045000
ZCROPCDE EQU   ISTZCRR+183                                              03046000
ZCRPRMTC EQU   ISTZCRR+182                                              03047000
ZCRRCDSV EQU   ISTZCRR+181                                              03048000
ZCRAWQSW EQU   ISTZCRR+180                                              03049000
ZCRTOPQ  EQU   ISTZCRR+180                                              03050000
ZCRLSTFB EQU   ISTZCRR+180                                              03051000
ZCRXSCHD EQU   ISTZCRR+180                                              03052000
ZCRNXTEL EQU   ISTZCRR+180                                              03053000
ZCRSCANQ EQU   ISTZCRR+180                                              03054000
ZCRMOREL EQU   ISTZCRR+180                                              03055000
ZCRFBPRC EQU   ISTZCRR+180                                              03056000
ZCRFSBSV EQU   ISTZCRR+176                                              03057000
ZCRSVWK5 EQU   ZCRWKARA+16                                              03058000
ZCRSVWK4 EQU   ZCRWKARA+12                                              03059000
ZCRSVWK3 EQU   ZCRWKARA+8                                               03060000
ZCRSVWK2 EQU   ZCRWKARA+4                                               03061000
ZCRSVWK1 EQU   ZCRWKARA                                                 03062000
ZCRSVF25 EQU   ZCRSVRTN+96                                              03063000
ZCRSVF24 EQU   ZCRSVRTN+92                                              03064000
ZCRSVF23 EQU   ZCRSVRTN+88                                              03065000
ZCRSVF22 EQU   ZCRSVRTN+84                                              03066000
ZCRSVF21 EQU   ZCRSVRTN+80                                              03067000
ZCRSVF20 EQU   ZCRSVRTN+76                                              03068000
ZCRSVF19 EQU   ZCRSVRTN+72                                              03069000
ZCRSVF18 EQU   ZCRSVRTN+68                                              03070000
ZCRSVF17 EQU   ZCRSVRTN+64                                              03071000
ZCRSVF16 EQU   ZCRSVRTN+60                                              03072000
ZCRSVF15 EQU   ZCRSVRTN+56                                              03073000
ZCRSVF14 EQU   ZCRSVRTN+52                                              03074000
ZCRSVF13 EQU   ZCRSVRTN+48                                              03075000
ZCRSVF12 EQU   ZCRSVRTN+44                                              03076000
ZCRSVF11 EQU   ZCRSVRTN+40                                              03077000
ZCRSVF10 EQU   ZCRSVRTN+36                                              03078000
ZCRSVF9  EQU   ZCRSVRTN+32                                              03079000
ZCRSVF8  EQU   ZCRSVRTN+28                                              03080000
ZCRSVF7  EQU   ZCRSVRTN+24                                              03081000
ZCRSVF6  EQU   ZCRSVRTN+20                                              03082000
ZCRSVF5  EQU   ZCRSVRTN+16                                              03083000
ZCRSVF4  EQU   ZCRSVRTN+12                                              03084000
ZCRSVF3  EQU   ZCRSVRTN+8                                               03085000
ZCRSVF2  EQU   ZCRSVRTN+4                                               03086000
ZCRSVF1  EQU   ZCRSVRTN                                                 03087000
ZCRPVZB  EQU   ISTZCRR+52                                               03088000
ZCRZLB   EQU   ISTZCRR+48                                               03089000
ZCRBFPTR EQU   ISTZCRR+44                                               03090000
ZCRCCWA  EQU   ISTZCRR+40                                               03091000
ZCRPSW   EQU   ZCRPARMS+15                                              03092000
ZCRPCHAR EQU   ZCRPARMS+14                                              03093000
ZCRPRES2 EQU   ZCRPCOD2                                                 03094000
ZCRPMFGF EQU   ZCRPCOD2                                                 03095000
ZCRPFHDR EQU   ZCRPCOD2                                                 03096000
ZCRPPG2  EQU   ZCRPCOD2                                                 03097000
ZCRPRES  EQU   ZCRPCOD1                                                 03098000
ZCRPCFTX EQU   ZCRPCOD1                                                 03099000
ZCRPBUF  EQU   ZCRPCOD1                                                 03100000
ZCRPLSCB EQU   ZCRPCOD1                                                 03101000
ZCRPLSBQ EQU   ZCRPLSBF                                                 03102000
ZCRPFSB  EQU   ZCRPCOD1                                                 03103000
ZCRPLNG  EQU   ZCRPCOD1                                                 03104000
ZCRPPG   EQU   ZCRPCOD1                                                 03105000
ZCRDTODA EQU   ZCRDFRDA                                                 03106000
ZCRMLNG  EQU   ZCRPARMS+8                                               03107000
ZCRTBPTR EQU   ZCRPARMS+4                                               03108000
ZCRCBPTR EQU   ZCRFBPTR                                                 03109000
ZCRCRLCP EQU   ISTZCRR+20                                               03110000
@NM00058 EQU   ZCRSCPSW                                                 03111000
ZCRSKIPT EQU   ZCRSCPSW                                                 03112000
ZCRFSBWE EQU   ZCRSCPSW                                                 03113000
ZCRPRCMP EQU   ZCRSCPSW                                                 03114000
ZCRLREQ  EQU   ZCRSCPSW                                                 03115000
ZCRRJLCP EQU   ZCRSCPSW                                                 03116000
ZCRTPINV EQU   ZCRSCPSW                                                 03117000
ZCRTPEX  EQU   ZCRSCPSW                                                 03118000
@NM00057 EQU   ZCRIBPR                                                  03119000
ZCR3270R EQU   ZCRIBPR                                                  03120000
ZCR3270  EQU   ZCRIBPR                                                  03121000
ZCRLCPFD EQU   ZCRIBPR                                                  03122000
ZCRLCPFR EQU   ZCRIBPR                                                  03123000
ZCRRELK  EQU   ZCRIBPR                                                  03124000
ZCRERR   EQU   ZCRIBPR                                                  03125000
ZCRNOBUF EQU   ZCRIBPR                                                  03126000
@NM00056 EQU   ZCRPFLGS                                                 03127000
ZCRQAHED EQU   ZCRPFLGS                                                 03128000
ZCRF1RES EQU   ZCRGENSW                                                 03129000
ZCRBRIS  EQU   ZCRGENSW                                                 03130000
ZCRCLRBD EQU   ZCRGENSW                                                 03131000
ZCREXRES EQU   ZCRGENSW                                                 03132000
ZCRLCSYN EQU   ZCRGENSW                                                 03133000
ZCRRT06  EQU   ZCRGENSW                                                 03134000
ZCRTSW2  EQU   ZCRGENSW                                                 03135000
ZCRTSW1  EQU   ZCRGENSW                                                 03136000
ZCRINLCP EQU   ZCRFLGS3                                                 03137000
ZCRWRPTR EQU   ZCRFLGS3                                                 03138000
ZCRNOFRE EQU   ZCRFLGS3                                                 03139000
ZCREDRIV EQU   ZCRFLGS3                                                 03140000
ZCRDISC  EQU   ZCRFLGS3                                                 03141000
ZCRTPDIS EQU   ZCRFLGS3                                                 03142000
ZCRTPCON EQU   ZCRFLGS3                                                 03143000
ZCRTIC   EQU   ZCRFLGS3                                                 03144000
ZCRCNLXL EQU   ZCRRESET                                                 03145000
ZCRENDAN EQU   ZCRSWFLD                                                 03146000
ZCRENDXL EQU   ZCRSWFLD                                                 03147000
ZCRENDX  EQU   ZCRSWFLD                                                 03148000
ZCROB1   EQU   ZCRNDLCP                                                 03149000
ZCRENDPR EQU   ZCRSWFLD                                                 03150000
ZCREXTYP EQU   ZCRSWFLD                                                 03151000
ZCRSLCP  EQU   ZCRENDSH                                                 03152000
ZCRIF0E3 EQU   ZCRFLGS2                                                 03153000
ZCRIF0E2 EQU   ZCRFLGS2                                                 03154000
ZCRIF0E1 EQU   ZCRFLGS2                                                 03155000
ZCROB    EQU   ZCRFLGS2                                                 03156000
ZCRFMSED EQU   ZCRFLGS2                                                 03157000
ZCRSHEDI EQU   ZCRFLGS2                                                 03158000
ZCRLOCAL EQU   ZCRFLGS2                                                 03159000
ZCRFEXIT EQU   ZCRFLGS1                                                 03160000
ZCRUNSOL EQU   ZCRFLGS1                                                 03161000
ZCRENDLP EQU   ZCRFLGS1                                                 03162000
ZCRNRMEX EQU   ZCRFLGS1                                                 03163000
ZCRWAIT  EQU   ZCRFLGS1                                                 03164000
ZCRDEQSW EQU   ZCRFLGS1                                                 03165000
ZCRQUESW EQU   ZCRFLGS1                                                 03166000
ZCREXSW  EQU   ZCRFLGS1                                                 03167000
ZCRFRRA  EQU   ISTZCRR+8                                                03168000
ZCRCHAIN EQU   ISTZCRR+4                                                03169000
ZCRFLAG  EQU   ZCRCRR+3                                                 03170000
ZCRLEN   EQU   ZCRCRR+1                                                 03171000
ZCRID    EQU   ZCRCRR                                                   03172000
CCFRSVD1 EQU   CFCCRT                                                   03173000
CCFCR2   EQU   CFCCRT                                                   03174000
CCFCRP   EQU   CFCCRT                                                   03175000
CCFCR1   EQU   CFCCRT                                                   03176000
CCFCS2   EQU   CFCCRT                                                   03177000
CCFCS1   EQU   CFCCRT                                                   03178000
NCFRSVD  EQU   CFCNTRD                                                  03179000
NCFCR2   EQU   CFCNTRD                                                  03180000
NCFCRP   EQU   CFCNTRD                                                  03181000
NCFCR1   EQU   CFCNTRD                                                  03182000
NCFCS2   EQU   CFCNTRD                                                  03183000
NCFCS1   EQU   CFCNTRD                                                  03184000
PFCRSV01 EQU   ISTPFCRR+13                                              03185000
PFCFTA   EQU   ISTPFCRR+12                                              03186000
CRRFRR   EQU   PFCFRRO                                                  03187000
CRRCHAIN EQU   PFCCRRO                                                  03188000
CRRLEN   EQU   PFCCRRLN                                                 03189000
PFCRSV10 EQU   PFCCRR+1                                                 03190000
CRRID    EQU   PFCCRRID                                                 03191000
LCPFTYPE EQU   LCPRPHA                                                  03192000
LCPRSTQH EQU   LCPLCCW                                                  03193000
LCPCLREP EQU   ISTLCPB+44                                               03194000
LCPUBFSB EQU   LCPFLCCW                                                 03195000
LCPRSV77 EQU   ISTLCPB+39                                               03196000
LCPLCCWC EQU   ISTLCPB+38                                               03197000
LCPRSV78 EQU   LCPFLG1                                                  03198000
LCPTRANS EQU   LCPFLG1                                                  03199000
LCPSTLB  EQU   LCPFLG1                                                  03200000
LCPREDRV EQU   LCPFLG1                                                  03201000
LCPDIRPT EQU   LCPFLG1                                                  03202000
LCPINTER EQU   LCPFLG1                                                  03203000
LCPRESET EQU   LCPFLG1                                                  03204000
LCPSTYPE EQU   ISTLCPB+36                                               03205000
LCPFSNCH EQU   ISTLCPB+34                                               03206000
LCPFOSN  EQU   ISTLCPB+32                                               03207000
LCPTLBAD EQU   ISTLCPB+28                                               03208000
LCPFDB2  EQU   LCPFDBA+1                                                03209000
LCPFDB1  EQU   LCPFDBA                                                  03210000
LCPNXLCW EQU   ISTLCPB+20                                               03211000
LCPDAF   EQU   LCPCID+2                                                 03212000
LCPSAF   EQU   LCPCID                                                   03213000
LCPLCCW1 EQU   ISTLCPB+12                                               03214000
LCPRRCNT EQU   LCPSEQ+1                                                 03215000
LCPRRCCT EQU   LCPSEQ                                                   03216000
LCPATOP  EQU   LCPFLAG2                                                 03217000
LCPFREE  EQU   LCPFLAG2                                                 03218000
LCPDSTAT EQU   LCPFLAG2                                                 03219000
LCPEXRES EQU   LCPFID0                                                  03220000
LCPZRIMM EQU   LCPTLBPI                                                 03221000
LCPRSTRT EQU   LCPFLAG2                                                 03222000
LCPASYN  EQU   LCPFLAG2                                                 03223000
LCPPRFLG EQU   LCPFLAG2                                                 03224000
LCPZMIRC EQU   LCPRUCNT                                                 03225000
LCPCHAI2 EQU   LCPCHAIN+1                                               03226000
LCPCHNG  EQU   LCPCHAI1                                                 03227000
LCPZRT0B EQU   LCPMNRCD                                                 03228000
LCPZRT0A EQU   LCPMNRCD                                                 03229000
LCPZRTL9 EQU   LCPZRT09                                                 03230000
LCPZRTL8 EQU   LCPZRT08                                                 03231000
LCPZRTL7 EQU   LCPZRT07                                                 03232000
LCPZRTL6 EQU   LCPZRT06                                                 03233000
LCPZRTL5 EQU   LCPZRT05                                                 03234000
LCPZRTL4 EQU   LCPZRT04                                                 03235000
LCPZRTL3 EQU   LCPZRT03                                                 03236000
LCPZRTL2 EQU   LCPZRT02                                                 03237000
LCPZRT01 EQU   LCPFLAGS                                                 03238000
LCPZRT00 EQU   LCPFLAGS                                                 03239000
LCPLNGTH EQU   ISTLCPB+1                                                03240000
LCPTYPE  EQU   ISTLCPB                                                  03241000
LCCWDATA EQU   ISTLCCW+4                                                03242000
LCCWCNT  EQU   ISTLCCW+2                                                03243000
LCCWACI  EQU   LCCWFLAG                                                 03244000
LCCWRFI  EQU   LCCWFLAG                                                 03245000
LCCWPER  EQU   LCCWLSI                                                  03246000
LCCWIDAT EQU   LCCWFLAG                                                 03247000
LCCWNTVC EQU   LCCWFLAG                                                 03248000
LCCWCKPT EQU   LCCWFLAG                                                 03249000
LCCWCC   EQU   LCCWFLAG                                                 03250000
LCCWCD   EQU   LCCWFLAG                                                 03251000
LCCWTYPE EQU   LCCWCTL                                                  03252000
LCCWMODE EQU   LCCWCTL                                                  03253000
LCCWSOP  EQU   LCCWRWOP                                                 03254000
@NM00055 EQU   LCCWRWOP                                                 03255000
LCCWSD   EQU   LCCWOP                                                   03256000
LCCWSI   EQU   LCCWOP                                                   03257000
BTUTEXT  EQU   ISTBTU+20                                                03258000
BTUEXTR  EQU   ISTBTU+19                                                03259000
BTURSV02 EQU   BTUSYSTR                                                 03260000
BTUPHASE EQU   BTUSYSTR                                                 03261000
BTURSV01 EQU   BTUSYSTR                                                 03262000
BTUBDU   EQU   ISTBTU+14                                                03263000
BTUPAD   EQU   BTURH+3                                                  03264000
BTURH3   EQU   BTURH+2                                                  03265000
BTURH2   EQU   BTURH+1                                                  03266000
BTURH1   EQU   BTURH                                                    03267000
BTUZRTSC EQU   BTURQFLG+1                                               03268000
BTUZRT0B EQU   BTURQFLG+1                                               03269000
BTUZRT0A EQU   BTURQFLG+1                                               03270000
BTUZRT09 EQU   BTURQFLG+1                                               03271000
BTUZRT08 EQU   BTURQFLG+1                                               03272000
BTUZRT07 EQU   BTURQFLG                                                 03273000
BTUZRT06 EQU   BTURQFLG                                                 03274000
BTUZRT05 EQU   BTURQFLG                                                 03275000
BTUZRT04 EQU   BTURQFLG                                                 03276000
BTUZRT03 EQU   BTURQFLG                                                 03277000
BTUZRT02 EQU   BTURQFLG                                                 03278000
BTUZRT01 EQU   BTURQFLG                                                 03279000
BTUZRT00 EQU   BTURQFLG                                                 03280000
BTUSORCE EQU   BTUBTH+4                                                 03281000
BTUDEST  EQU   BTUBTH+2                                                 03282000
BTUCDF   EQU   BTUFID+1                                                 03283000
BTUSCF   EQU   BTUFID+1                                                 03284000
BTUPRY   EQU   BTUFID+1                                                 03285000
BTUASFL  EQU   BTUFID                                                   03286000
BTUPSFL  EQU   BTUFID                                                   03287000
BTUMPF   EQU   BTUFID                                                   03288000
BTUFIDNO EQU   BTUFID                                                   03289000
BDURSV04 EQU   BDUFLAGS                                                 03290000
BDURTOE  EQU   BDUFLAGS                                                 03291000
BDUSTPR  EQU   BDUFLAGS                                                 03292000
BDURSV03 EQU   BDUFLAGS                                                 03293000
BDUALT   EQU   BDUFUNC                                                  03294000
BDUNACK  EQU   BDUFUNC                                                  03295000
BDUACK   EQU   BDUFUNC                                                  03296000
BDUTRPM  EQU   BDUFUNC                                                  03297000
BDUFBMI  EQU   BDUFUNC                                                  03298000
BDULDGPH EQU   BDUFUNC                                                  03299000
BDUHEADP EQU   BDUFUNC                                                  03300000
BDUSOH   EQU   BDUCHECK                                                 03301000
BDURSV01 EQU   BDUMODIF                                                 03302000
BDUMOD0  EQU   BDUMOD1                                                  03303000
BDUCOMND EQU   ISTBDU                                                   03304000
ATCAOS   EQU   ISTATCVT+1584                                            03305000
ATCPOPAB EQU   ATCAOSM+640                                              03306000
ATCVIOPM EQU   ATCAOSM+636                                              03307000
ATCTPMMI EQU   ATCAOSM+632                                              03308000
ATCTPMPB EQU   ATCAOSM+600                                              03309000
ATCRSV88 EQU   ATCAOSM+596                                              03310000
ATCRPLCT EQU   ATCAOSM+594                                              03311000
ATCCRACT EQU   ATCAOSM+592                                              03312000
ATCSRBCT EQU   ATCAOSM+590                                              03313000
ATCRSV75 EQU   ATCAOSM+589                                              03314000
ATCRSV66 EQU   ATCZFLAG                                                 03315000
ATCTPCP1 EQU   ATCAOSM+584                                              03316000
ATCTPCP0 EQU   ATCAOSM+580                                              03317000
ATCAICTN EQU   ATCAOSM+576                                              03318000
ATCZR01  EQU   ATCAOSM+572                                              03319000
ATCMPLTA EQU   ATCAOSM+568                                              03320000
ATCASCB  EQU   ATCAOSM+564                                              03321000
ATCAP86  EQU   ATCAOSM+560                                              03322000
ATCAP85  EQU   ATCAOSM+556                                              03323000
ATCAP84  EQU   ATCAOSM+552                                              03324000
ATCAP83  EQU   ATCAOSM+548                                              03325000
ATCAP82  EQU   ATCAOSM+544                                              03326000
ATCAP69  EQU   ATCAOSM+540                                              03327000
ATCAP66  EQU   ATCAOSM+536                                              03328000
ATCAP62  EQU   ATCAOSM+532                                              03329000
ATCAPC59 EQU   ATCAOSM+528                                              03330000
ATCAP56  EQU   ATCAOSM+524                                              03331000
ATCAP55  EQU   ATCAOSM+520                                              03332000
ATCRCFY0 EQU   ATCAOSM+516                                              03333000
ATCAP41  EQU   ATCAOSM+512                                              03334000
ATCAPC25 EQU   ATCAOSM+508                                              03335000
ATCAP23  EQU   ATCAOSM+504                                              03336000
ATCTPSPB EQU   ATCAOSM+472                                              03337000
ATCTRMPB EQU   ATCAOSM+440                                              03338000
ATCAPBE  EQU   ATCAOSM+436                                              03339000
ATCPSTA  EQU   ATCAOSM+432                                              03340000
ATCSMABF EQU   ATCAOSM+428                                              03341000
ATCSMAPR EQU   ATCAOSM+424                                              03342000
ATCTPWQA EQU   ATCAOSM+420                                              03343000
ATCSMAID EQU   ATCAOSM+416                                              03344000
ATCSMARA EQU   ATCAOSM+412                                              03345000
ATCCACXA EQU   ATCAOSM+408                                              03346000
ATCZLAAB EQU   ATCAOSM+404                                              03347000
ATCATA10 EQU   ATCAOSM+400                                              03348000
ATCHLTCB EQU   ATCAOSM+396                                              03349000
@NM00054 EQU   ATCVTFLG                                                 03350000
ATCVTACT EQU   ATCVTFLG                                                 03351000
ATCRPT40 EQU   ATCAOSM+388                                              03352000
ATCRPT39 EQU   ATCAOSM+384                                              03353000
ATCRPT38 EQU   ATCAOSM+380                                              03354000
ATCRPT37 EQU   ATCAOSM+376                                              03355000
ATCRPT36 EQU   ATCAOSM+372                                              03356000
ATCRPT35 EQU   ATCAOSM+368                                              03357000
ATCRPT34 EQU   ATCAOSM+364                                              03358000
ATCRPT33 EQU   ATCAOSM+360                                              03359000
ATCRPT32 EQU   ATCAOSM+356                                              03360000
ATCRPT31 EQU   ATCAOSM+352                                              03361000
ATCRPT30 EQU   ATCAOSM+348                                              03362000
ATCRPT29 EQU   ATCAOSM+344                                              03363000
ATCRPT28 EQU   ATCAOSM+340                                              03364000
ATCRPT27 EQU   ATCAOSM+336                                              03365000
ATCRPT26 EQU   ATCAOSM+332                                              03366000
ATCRPT25 EQU   ATCAOSM+328                                              03367000
ATCRPT24 EQU   ATCAOSM+324                                              03368000
ATCRPT23 EQU   ATCAOSM+320                                              03369000
ATCRPT22 EQU   ATCAOSM+316                                              03370000
ATCRPT21 EQU   ATCAOSM+312                                              03371000
ATCRPT20 EQU   ATCAOSM+308                                              03372000
ATCRPT19 EQU   ATCAOSM+304                                              03373000
ATCRPT18 EQU   ATCAOSM+300                                              03374000
ATCRPT17 EQU   ATCAOSM+296                                              03375000
ATCRPT16 EQU   ATCAOSM+292                                              03376000
ATCRPT15 EQU   ATCAOSM+288                                              03377000
ATCRPT14 EQU   ATCAOSM+284                                              03378000
ATCRPT13 EQU   ATCAOSM+280                                              03379000
ATCRPT12 EQU   ATCAOSM+276                                              03380000
ATCDMAPP EQU   ATCAOSM+272                                              03381000
ATCAP38  EQU   ATCAOSM+268                                              03382000
ATCAP37  EQU   ATCAOSM+264                                              03383000
ATCZDFJ0 EQU   ATCAOSM+260                                              03384000
ATCAP51  EQU   ATCAOSM+256                                              03385000
ATCZPAB2 EQU   ATCAOSM+224                                              03386000
ATCZPAB1 EQU   ATCAOSM+192                                              03387000
ATCZLFVT EQU   ATCAOSM+188                                              03388000
ATCZLPVT EQU   ATCAOSM+184                                              03389000
ATCZDVTX EQU   ATCAOSM+180                                              03390000
ATCZDVTA EQU   ATCAOSM+176                                              03391000
ATCZDVT9 EQU   ATCAOSM+172                                              03392000
ATCZDVT8 EQU   ATCAOSM+168                                              03393000
ATCZDVT7 EQU   ATCAOSM+164                                              03394000
ATCRSV56 EQU   ATCDAPVT+22                                              03395000
ATCDAPDG EQU   ATCDAPVT+20                                              03396000
ATCDXCEA EQU   ATCDAPVT+16                                              03397000
ATCDCEA  EQU   ATCDAPVT+12                                              03398000
ATCDPCIA EQU   ATCDAPVT+8                                               03399000
ATCDSIOA EQU   ATCDAPVT+4                                               03400000
ATCDEOEA EQU   ATCDAPVT                                                 03401000
ATCZLAEA EQU   ATCLDAPP+16                                              03402000
ATCZLCEA EQU   ATCLDAPP+12                                              03403000
ATCRSV17 EQU   ATCLDAPP+8                                               03404000
ATCSMFRR EQU   ATCLDAPP+4                                               03405000
ATCCDTID EQU   ATCLDAPP                                                 03406000
ATCZAEA  EQU   ATCICAPP+16                                              03407000
ATCZCEA  EQU   ATCICAPP+12                                              03408000
ATCCDTCB EQU   ATCICAPP+8                                               03409000
ATCZSIOA EQU   ATCICAPP+4                                               03410000
ATCCDRPH EQU   ATCICAPP                                                 03411000
ATCAP65  EQU   ATCAOSM+96                                               03412000
ATCZDVT6 EQU   ATCAOSM+92                                               03413000
ATCZDVT4 EQU   ATCAOSM+88                                               03414000
ATCZDVT3 EQU   ATCAOSM+84                                               03415000
ATCZDVT1 EQU   ATCAOSM+80                                               03416000
ATCICNCB EQU   ATCAOSM+76                                               03417000
ATCZPSVT EQU   ATCAOSM+72                                               03418000
ATCZFSVT EQU   ATCAOSM+68                                               03419000
ATCAP64  EQU   ATCAOSM+64                                               03420000
ATCAP63  EQU   ATCAOSM+60                                               03421000
ATCAP61  EQU   ATCAOSM+56                                               03422000
ATCAP58  EQU   ATCAOSM+52                                               03423000
ATCAP57  EQU   ATCAOSM+48                                               03424000
ATCAP54  EQU   ATCAOSM+44                                               03425000
ATCAP53  EQU   ATCAOSM+40                                               03426000
ATCAP52  EQU   ATCAOSM+36                                               03427000
ATCAP34  EQU   ATCAOSM+32                                               03428000
ATCAP32  EQU   ATCAOSM+28                                               03429000
ATCAP31  EQU   ATCAOSM+24                                               03430000
ATCAP12  EQU   ATCAOSM+20                                               03431000
ATCAP11  EQU   ATCAOSM+16                                               03432000
ATCCMTCB EQU   ATCAOSM+12                                               03433000
ATCPRPH  EQU   ATCAOSM+8                                                03434000
ATCGSRBF EQU   ATCGSRBG                                                 03435000
ATCSRBRT EQU   ATCAOSM                                                  03436000
@NM00053 EQU   @NM00052                                                 03437000
ATCVTMAB EQU   @NM00052                                                 03438000
@NM00051 EQU   ATCVTBAM                                                 03439000
ATCVDLOK EQU   ISTATCVT+904                                             03440000
ATCVFPAB EQU   ISTATCVT+872                                             03441000
ATCVDPAB EQU   ISTATCVT+840                                             03442000
ATCIOECB EQU   ISTATCVT+836                                             03443000
ATCINCW3 EQU   ISTATCVT+832                                             03444000
ATCMODTB EQU   ISTATCVT+828                                             03445000
ATCUSSPT EQU   ISTATCVT+824                                             03446000
ATCSRTAB EQU   ISTATCVT+820                                             03447000
@NM00050 EQU   ISTATCVT+819                                             03448000
@NM00049 EQU   ATCSTAT2                                                 03449000
ATCTRSMS EQU   ATCSTAT2                                                 03450000
ATCTRLOK EQU   ATCSTAT2                                                 03451000
ATCTRPSS EQU   ATCSTAT2                                                 03452000
ATCTRESC EQU   ATCSTAT2                                                 03453000
ATCTRAPI EQU   ATCSTAT2                                                 03454000
ATCNMCTR EQU   ISTATCVT+816                                             03455000
ATCSEC51 EQU   ATCSECST                                                 03456000
ATCSEC40 EQU   ATCSIPD+8                                                03457000
ATCSEC30 EQU   ATCSIPD+4                                                03458000
ATCSEC21 EQU   ATCSIPD                                                  03459000
ATCSEC10 EQU   ATCSOPD+4                                                03460000
ATCSEC01 EQU   ATCSOPD                                                  03461000
ATCPOIA  EQU   ATCRNO+1                                                 03462000
@NM00048 EQU   ATCRNO                                                   03463000
ATCPODVT EQU   ISTATCVT+784                                             03464000
ATCS49XL EQU   ISTATCVT+780                                             03465000
ATCS49XI EQU   ISTATCVT+776                                             03466000
ATCLCLCT EQU   ATCVLCNT+2                                               03467000
ATCRNCNT EQU   ATCVLCNT                                                 03468000
ATCCFEAD EQU   ISTATCVT+768                                             03469000
ATCPTR00 EQU   ISTATCVT+736                                             03470000
ATCRSV10 EQU   ISTATCVT+704                                             03471000
ATCTACB  EQU   ISTATCVT+700                                             03472000
ATCVTINM EQU   ISTATCVT+696                                             03473000
ATCTCLIM EQU   ISTATCVT+692                                             03474000
ATCTCLOM EQU   ISTATCVT+688                                             03475000
ATCVTIPB EQU   ISTATCVT+656                                             03476000
ATCTCIPB EQU   ISTATCVT+624                                             03477000
ATCTIPAB EQU   ISTATCVT+592                                             03478000
ATCOCCCB EQU   ISTATCVT+588                                             03479000
ATCOCCOB EQU   ISTATCVT+584                                             03480000
ATCCDLAD EQU   ISTATCVT+580                                             03481000
ATCCCLAD EQU   ISTATCVT+576                                             03482000
ATCDLRPB EQU   ISTATCVT+544                                             03483000
ATCPGPAB EQU   ISTATCVT+512                                             03484000
ATCVPAB1 EQU   ISTATCVT+480                                             03485000
ATCRSV97 EQU   ISTATCVT+476                                             03486000
ATCRDTLK EQU   ISTATCVT+472                                             03487000
ATCVOCLK EQU   ISTATCVT+468                                             03488000
ATCDVTLK EQU   ISTATCVT+456                                             03489000
ATCAP36  EQU   ISTATCVT+452                                             03490000
ATCAP35  EQU   ISTATCVT+448                                             03491000
ATCAP33  EQU   ISTATCVT+444                                             03492000
ATCRSV99 EQU   ISTATCVT+440                                             03493000
ATCONFIG EQU   ISTATCVT+432                                             03494000
ATCNODDS EQU   ISTATCVT+428                                             03495000
ATCNODEL EQU   ISTATCVT+420                                             03496000
ATCRSV69 EQU   ISTATCVT+416                                             03497000
ATCAPCR5 EQU   ISTATCVT+412                                             03498000
ATCLDECB EQU   ISTATCVT+408                                             03499000
ATCLDNCS EQU   ISTATCVT+404                                             03500000
ATCCDPTR EQU   ISTATCVT+400                                             03501000
ATCADEL  EQU   ISTATCVT+396                                             03502000
ATCTODVT EQU   ISTATCVT+392                                             03503000
ATCDEBCH EQU   ISTATCVT+388                                             03504000
ATCHBSIZ EQU   ATCHPGM+2                                                03505000
ATCHBFNO EQU   ATCHPGM                                                  03506000
ATCCRME  EQU   ISTATCVT+380                                             03507000
ATCRVCHS EQU   ISTATCVT+372                                             03508000
ATCECTLP EQU   ISTATCVT+368                                             03509000
ATCZDVTB EQU   ISTATCVT+364                                             03510000
ATCECPRT EQU   ISTATCVT+360                                             03511000
ATCVTLOD EQU   ISTATCVT+356                                             03512000
ATCTRPAB EQU   ISTATCVT+352                                             03513000
ATCMSGM  EQU   ISTATCVT+348                                             03514000
ATCMSGP  EQU   ISTATCVT+344                                             03515000
ATCEPT   EQU   ISTATCVT+340                                             03516000
ATCDVT   EQU   ISTATCVT+336                                             03517000
ATCTRCPT EQU   ISTATCVT+332                                             03518000
ATCDVLOD EQU   ISTATCVT+328                                             03519000
ATCALERT EQU   ISTATCVT+324                                             03520000
ATCEPA   EQU   ISTATCVT+320                                             03521000
ATCSAF   EQU   ISTATCVT+318                                             03522000
ATCXRANG EQU   ISTATCVT+317                                             03523000
ATCLAST  EQU   ATCSHRFG                                                 03524000
ATCSHRTN EQU   ISTATCVT+308                                             03525000
ATCUEP   EQU   ISTATCVT+304                                             03526000
ATCOCRT  EQU   ISTATCVT+300                                             03527000
ATCCSMA  EQU   ATCCSMR                                                  03528000
ATCESC02 EQU   ISTATCVT+292                                             03529000
ATCESC01 EQU   ISTATCVT+288                                             03530000
ATCMNT   EQU   ISTATCVT+272                                             03531000
ATCRSV16 EQU   ISTATCVT+270                                             03532000
ATCMAXID EQU   ISTATCVT+269                                             03533000
ATCMSGSP EQU   ATCCOM+268                                               03534000
ATCACTRM EQU   ATCCOM+264                                               03535000
ATCNERAP EQU   ATCCOM+260                                               03536000
ATCNESAL EQU   ATCCOM+256                                               03537000
ATCRCC65 EQU   ATCCOM+252                                               03538000
ATCRCC26 EQU   ATCCOM+248                                               03539000
ATCRCC63 EQU   ATCCOM+244                                               03540000
ATCRSV11 EQU   ATCCOM+242                                               03541000
ATCVTMID EQU   ATCCOM+240                                               03542000
ATCAPOST EQU   ATCCOM+236                                               03543000
ATCNERFN EQU   ATCCOM+232                                               03544000
ATCNERNE EQU   ATCCOM+228                                               03545000
ATCNERCV EQU   ATCCOM+224                                               03546000
ATCNERST EQU   ATCCOM+220                                               03547000
ATCDCC61 EQU   ATCCOM+216                                               03548000
ATCDCC60 EQU   ATCCOM+212                                               03549000
ATCSRTDF EQU   ATCCOM+208                                               03550000
ATCSRTAD EQU   ATCCOM+204                                               03551000
ATCFIRA  EQU   ATCCOM+200                                               03552000
ATCSMBQ  EQU   ATCCOM+196                                               03553000
ATCSMRC  EQU   ATCCOM+192                                               03554000
ATCSMQU  EQU   ATCCOM+184                                               03555000
ATCSMRQ  EQU   ATCCOM+180                                               03556000
ATCACDA  EQU   ATCCOM+176                                               03557000
ATCSTMA  EQU   ATCCOM+172                                               03558000
ATCFRSTR EQU   ATCCOM+168                                               03559000
ATCGTSTR EQU   ATCCOM+164                                               03560000
ATCREADA EQU   ATCCOM+160                                               03561000
ATCALOAD EQU   ATCCOM+156                                               03562000
ATCBLDLA EQU   ATCCOM+152                                               03563000
ATCFBRPH EQU   ATCCOM+148                                               03564000
ATCBFTRC EQU   ATCCOM+144                                               03565000
ATCTPBUF EQU   ATCTHTRC                                                 03566000
ATCREMOV EQU   ATCCOM+136                                               03567000
ATCADD   EQU   ATCCOM+132                                               03568000
ATCDVTPT EQU   ATCCOM+124                                               03569000
ATCFEPT  EQU   ATCCOM+120                                               03570000
ATCFDVT  EQU   ATCCOM+116                                               03571000
ATCCONFT EQU   ATCCOM+112                                               03572000
ATCPTCHA EQU   ATCCOM+108                                               03573000
ATCAUTHA EQU   ATCCOM+104                                               03574000
ATCACCTA EQU   ATCCOM+100                                               03575000
ATCRDTH  EQU   ATCCOM+96                                                03576000
ATCFRSCH EQU   ATCCOM+92                                                03577000
ATCFSB   EQU   ATCCOM+88                                                03578000
ATCHLTMS EQU   ATCCOM+84                                                03579000
ATCECPRM EQU   ATCCOM+80                                                03580000
ATCECNET EQU   ATCCOM+76                                                03581000
ATCECOPC EQU   ATCCOM+72                                                03582000
ATCVPARM EQU   ATCCOM+68                                                03583000
ATCECVRQ EQU   ATCCOM+64                                                03584000
ATCECSES EQU   ATCCOM+60                                                03585000
ATCOCHA  EQU   ATCCOM+56                                                03586000
ATCDSPLQ EQU   ATCCOM+52                                                03587000
ATCECDSP EQU   ATCCOM+48                                                03588000
ATCVARYQ EQU   ATCCOM+44                                                03589000
ATCECVRY EQU   ATCCOM+40                                                03590000
ATCHALTQ EQU   ATCCOM+36                                                03591000
ATCECHLT EQU   ATCCOM+32                                                03592000
ATCMODQ  EQU   ATCCOM+28                                                03593000
ATCECMOD EQU   ATCCOM+24                                                03594000
ATCASCHD EQU   ATCCOM+20                                                03595000
ATCSRT   EQU   ATCCOM+16                                                03596000
ATCRDT   EQU   ATCCOM+12                                                03597000
ATCDCFRR EQU   ATCCOM+8                                                 03598000
ATCAPI   EQU   ATCCOM+4                                                 03599000
ATCRSV04 EQU   ATCSTAT4                                                 03600000
ATCVTTRC EQU   ATCSTAT4                                                 03601000
ATCNCSD  EQU   ATCSTAT4                                                 03602000
ATCMTST  EQU   ATCSTAT4                                                 03603000
ATCTPRT  EQU   ATCSTAT4                                                 03604000
ATCPRTAT EQU   ATCSTAT4                                                 03605000
@NM00047 EQU   ATCPOFLG                                                 03606000
ATCPOUNS EQU   ATCPOFLG                                                 03607000
ATCHSDMF EQU   ATCSTFLG                                                 03608000
@NM00046 EQU   ATCSTAT1                                                 03609000
ATCMDHLT EQU   ATCSTAT1                                                 03610000
ATCINHLT EQU   ATCSTAT1                                                 03611000
ATCNETSL EQU   ATCSTAT1                                                 03612000
ATCQKHLT EQU   ATCSTAT1                                                 03613000
ATCSNHLT EQU   ATCSTAT1                                                 03614000
ATCACTIV EQU   ATCSTAT1                                                 03615000
ATCSTART EQU   ATCSTAT1                                                 03616000
RPHNEXPO EQU   ISTRPH+104                                               03617000
RPHSAV16 EQU   RPHWORK+60                                               03618000
RPHSAV15 EQU   RPHWORK+56                                               03619000
RPHSAV14 EQU   RPHWORK+52                                               03620000
RPHSAV13 EQU   RPHWORK+48                                               03621000
RPHSAV12 EQU   RPHWORK+44                                               03622000
RPHSAV11 EQU   RPHWORK+40                                               03623000
RPHSAV10 EQU   RPHWORK+36                                               03624000
RPHSAVE9 EQU   RPHWORK+32                                               03625000
RPHSAVE8 EQU   RPHWORK+28                                               03626000
RPHSAVE7 EQU   RPHWORK+24                                               03627000
RPHSAVE6 EQU   RPHWORK+20                                               03628000
RPHSAVE5 EQU   RPHWORK+16                                               03629000
RPHSAVE4 EQU   RPHWORK+12                                               03630000
RPHSAVE3 EQU   RPHWORK+8                                                03631000
RPHSAVE2 EQU   RPHWORK+4                                                03632000
RPHSHALF EQU   RPHSAVE1+2                                               03633000
RPHSBIT8 EQU   RPHSBITS                                                 03634000
RPHSBIT7 EQU   RPHSBITS                                                 03635000
RPHSBIT6 EQU   RPHSBITS                                                 03636000
RPHSBIT5 EQU   RPHSBITS                                                 03637000
RPHSBIT4 EQU   RPHSBITS                                                 03638000
RPHSBIT3 EQU   RPHSBITS                                                 03639000
RPHSBIT2 EQU   RPHSBITS                                                 03640000
RPHSBIT1 EQU   RPHSBITS                                                 03641000
RPHSBYTE EQU   RPHSAVE1                                                 03642000
RPHPABQP EQU   RPHPABQA+1                                               03643000
RPHPABFG EQU   RPHPABQA                                                 03644000
RPHSRP34 EQU   RPHSRPRM+2                                               03645000
RPHSRP12 EQU   RPHSRPRM                                                 03646000
RPHWEGT  EQU   RPHCSPA                                                  03647000
RPHMAJCB EQU   ISTRPH+21                                                03648000
RPHPABOF EQU   ISTRPH+20                                                03649000
RPHRESUM EQU   RPHRESMA+1                                               03650000
RPHRSV01 EQU   RPHWPFLG                                                 03651000
RPHPURGE EQU   RPHWPFLG                                                 03652000
RPHPT    EQU   RPHWPFLG                                                 03653000
RPHWT    EQU   RPHWPFLG                                                 03654000
RPHRSKEY EQU   RPHWPFLG                                                 03655000
RPHDVTA  EQU   ISTRPH+12                                                03656000
RPHTIK   EQU   RPHTSKID+3                                               03657000
@NM00045 EQU   RPHTSKID                                                 03658000
RPHRPHAP EQU   RPHRPHA+1                                                03659000
@NM00044 EQU   RPHRPHA                                                  03660000
RPHGATE  EQU   RPHRPHA                                                  03661000
@NM00043 EQU   RPHFLGB                                                  03662000
RPHRLCRA EQU   RPHFLGB                                                  03663000
RPHNRSAV EQU   RPHFLGB                                                  03664000
RPHPGCMP EQU   RPHFLGB                                                  03665000
RPHFBAPS EQU   RPHFLGB                                                  03666000
RPHBSSP  EQU   RPHFLGB                                                  03667000
RPHLOCK  EQU   RPHFLGB                                                  03668000
RPHFNFLG EQU   RPHFSTLC                                                 03669000
RPHMLTCP EQU   RPHFLAGS                                                 03670000
RPHSMCLR EQU   RPHFLAGS                                                 03671000
RPHSMTYP EQU   RPHFLAGS                                                 03672000
RPHSMQ   EQU   RPHFLAGS                                                 03673000
RPHAUTEX EQU   RPHAPTYP                                                 03674000
RPHSPGIN EQU   RPHFLAGS                                                 03675000
RPHOGIND EQU   RPHFLAGS                                                 03676000
RPHLNGTH EQU   RPHCNTL+1                                                03677000
RPHTYPE  EQU   RPHCNTL                                                  03678000
DYPPAB   EQU   ISTDYPAB+16                                              03679000
DYPRSV01 EQU   ISTDYPAB+12                                              03680000
DYPTSKID EQU   ISTDYPAB+8                                               03681000
DYPCHAIN EQU   ISTDYPAB+4                                               03682000
DYPFLGS  EQU   ISTDYPAB+2                                               03683000
DYPLNGTH EQU   ISTDYPAB+1                                               03684000
DYPTYPE  EQU   ISTDYPAB                                                 03685000
LOKXCL   EQU   @NM00041                                                 03686000
LOKPRY   EQU   @NM00041                                                 03687000
@NM00042 EQU   @NM00041                                                 03688000
@NM00040 EQU   LOKCHNG                                                  03689000
LOKCT    EQU   ISTLOK                                                   03690000
PABRPHA  EQU   PABRPHFG+1                                               03691000
PABNODQ  EQU   PABFLAGS                                                 03692000
PABINHBT EQU   PABFLAGS                                                 03693000
PABERLOK EQU   PABERRLK                                                 03694000
PABSSN   EQU   PABFLAGS                                                 03695000
PABDYNAM EQU   PABFLAGS                                                 03696000
PABNORPR EQU   PABFLAGS                                                 03697000
PABPRIOR EQU   PABFLAGS                                                 03698000
PABAPYP  EQU   PABFLAGS                                                 03699000
PABDVTA  EQU   ISTPAB+9                                                 03700000
PABOFFST EQU   ISTPAB+8                                                 03701000
PABCHNGP EQU   PABCHAIN+1                                               03702000
PABRSV02 EQU   PABCHAIN                                                 03703000
PABRUNNG EQU   PABCHAIN                                                 03704000
PABRESET EQU   PABCHAIN                                                 03705000
PABUNCON EQU   PABCHAIN                                                 03706000
PABCDP   EQU   PABCHAIN                                                 03707000
PABRESCH EQU   PABCHAIN                                                 03708000
PABCHNG  EQU   PABCHAIN                                                 03709000
PABWEQP  EQU   PABWEQA+1                                                03710000
PABRSV01 EQU   PABWEQA                                                  03711000
PABWEQG  EQU   PABWEQA                                                  03712000
CVTLEVL  EQU   CVTRELNO+2                                               03713000
CVTNUMB  EQU   CVTRELNO                                                 03714000
CVTMDL   EQU   CVTFIX+250                                               03715000
@NM00039 EQU   CVTFIX+248                                               03716000
@NM00038 EQU   CVTFIX                                                   03717000
CVTRV482 EQU   CVTXTNT2+128                                             03718000
CVTRV481 EQU   CVTXTNT2+124                                             03719000
CVTRV480 EQU   CVTXTNT2+120                                             03720000
CVTRV479 EQU   CVTXTNT2+118                                             03721000
CVTRV478 EQU   CVTXTNT2+117                                             03722000
CVTRV477 EQU   CVTXTNT2+116                                             03723000
CVTRV476 EQU   CVTXTNT2+115                                             03724000
CVTRV475 EQU   CVTXTNT2+114                                             03725000
CVTRV474 EQU   CVTRV466                                                 03726000
CVTRV473 EQU   CVTRV466                                                 03727000
CVTRV472 EQU   CVTRV466                                                 03728000
CVTRV471 EQU   CVTRV466                                                 03729000
CVTRV470 EQU   CVTRV466                                                 03730000
CVTRV469 EQU   CVTRV466                                                 03731000
CVTRV468 EQU   CVTRV466                                                 03732000
CVTRV467 EQU   CVTRV466                                                 03733000
CVTRV465 EQU   CVTRV457                                                 03734000
CVTRV464 EQU   CVTRV457                                                 03735000
CVTRV463 EQU   CVTRV457                                                 03736000
CVTRV462 EQU   CVTRV457                                                 03737000
CVTRV461 EQU   CVTRV457                                                 03738000
CVTRV460 EQU   CVTRV457                                                 03739000
CVTRV459 EQU   CVTRV457                                                 03740000
CVTRV458 EQU   CVTRV457                                                 03741000
CVTRV456 EQU   CVTXTNT2+108                                             03742000
CVTRV455 EQU   CVTXTNT2+104                                             03743000
CVTRV454 EQU   CVTXTNT2+100                                             03744000
CVTRV453 EQU   CVTXTNT2+96                                              03745000
CVTRV452 EQU   CVTXTNT2+94                                              03746000
CVTRV451 EQU   CVTXTNT2+92                                              03747000
CVTRV450 EQU   CVTXTNT2+90                                              03748000
CVTRV449 EQU   CVTXTNT2+88                                              03749000
CVTRV448 EQU   CVTXTNT2+87                                              03750000
CVTRV447 EQU   CVTXTNT2+86                                              03751000
CVTRV446 EQU   CVTRV438                                                 03752000
CVTRV445 EQU   CVTRV438                                                 03753000
CVTRV444 EQU   CVTRV438                                                 03754000
CVTRV443 EQU   CVTRV438                                                 03755000
CVTRV442 EQU   CVTRV438                                                 03756000
CVTRV441 EQU   CVTRV438                                                 03757000
CVTRV440 EQU   CVTRV438                                                 03758000
CVTRV439 EQU   CVTRV438                                                 03759000
CVTRV437 EQU   CVTRV429                                                 03760000
CVTRV436 EQU   CVTRV429                                                 03761000
CVTRV435 EQU   CVTRV429                                                 03762000
CVTRV434 EQU   CVTRV429                                                 03763000
CVTRV433 EQU   CVTRV429                                                 03764000
CVTRV432 EQU   CVTRV429                                                 03765000
CVTRV431 EQU   CVTRV429                                                 03766000
CVTRV430 EQU   CVTRV429                                                 03767000
CVTRV428 EQU   CVTXTNT2+80                                              03768000
CVTRV427 EQU   CVTXTNT2+76                                              03769000
CVTRV426 EQU   CVTXTNT2+72                                              03770000
CVTRV425 EQU   CVTXTNT2+68                                              03771000
CVTATACT EQU   CVTATCVT                                                 03772000
CVTRV423 EQU   CVTXTNT2+62                                              03773000
CVTRV422 EQU   CVTXTNT2+60                                              03774000
CVTRV421 EQU   CVTXTNT2+58                                              03775000
CVTRV420 EQU   CVTXTNT2+56                                              03776000
CVTRV419 EQU   CVTXTNT2+55                                              03777000
CVTRV418 EQU   CVTXTNT2+54                                              03778000
CVTRV417 EQU   CVTRV409                                                 03779000
CVTRV416 EQU   CVTRV409                                                 03780000
CVTRV415 EQU   CVTRV409                                                 03781000
CVTRV414 EQU   CVTRV409                                                 03782000
CVTRV413 EQU   CVTRV409                                                 03783000
CVTRV412 EQU   CVTRV409                                                 03784000
CVTRV411 EQU   CVTRV409                                                 03785000
CVTRV410 EQU   CVTRV409                                                 03786000
CVTRV408 EQU   CVTRV400                                                 03787000
CVTRV407 EQU   CVTRV400                                                 03788000
CVTRV406 EQU   CVTRV400                                                 03789000
CVTRV405 EQU   CVTRV400                                                 03790000
CVTRV404 EQU   CVTRV400                                                 03791000
CVTRV403 EQU   CVTRV400                                                 03792000
CVTRV402 EQU   CVTRV400                                                 03793000
CVTRV401 EQU   CVTRV400                                                 03794000
CVTICB   EQU   CVTXTNT2+48                                              03795000
CVTSKTA  EQU   CVTXTNT2+44                                              03796000
CVTSHSB  EQU   CVTSHS                                                   03797000
CVTRSV98 EQU   CVTXTNT2+36                                              03798000
CVTRSV97 EQU   CVTXTNT2+34                                              03799000
CVTRSV96 EQU   CVTXTNT2+32                                              03800000
CVTOLTEP EQU   CVTXTNT2+28                                              03801000
CVTQIDA  EQU   CVTQID+1                                                 03802000
CVTRSV95 EQU   CVTQID                                                   03803000
CVTRSV94 EQU   CVTXTNT2+20                                              03804000
CVTRSV93 EQU   CVTXTNT2+16                                              03805000
CVTRSV92 EQU   CVTXTNT2+12                                              03806000
CVTDEBVR EQU   CVTXTNT2+8                                               03807000
CVTRSV91 EQU   CVTXTNT2+6                                               03808000
CVTRSV9H EQU   CVTFLGBT                                                 03809000
CVTRSV9G EQU   CVTFLGBT                                                 03810000
CVTRSV9F EQU   CVTFLGBT                                                 03811000
CVTRSV9E EQU   CVTFLGBT                                                 03812000
CVTRSV9D EQU   CVTFLGBT                                                 03813000
CVTRSV9C EQU   CVTFLGBT                                                 03814000
CVTVME   EQU   CVTFLGBT                                                 03815000
CVTNPE   EQU   CVTFLGBT                                                 03816000
CVTNUCLS EQU   CVTXTNT2+4                                               03817000
CVTDSSVA EQU   CVTDSSV+1                                                03818000
CVTRSV89 EQU   CVTDSSV                                                  03819000
CVTRSV88 EQU   CVTXTNT1+8                                               03820000
CVTRSV87 EQU   CVTXTNT1+4                                               03821000
CVTFACHN EQU   CVTXTNT1                                                 03822000
CVTRV488 EQU   CVTMAP+412                                               03823000
CVTRV487 EQU   CVTMAP+408                                               03824000
CVTRV486 EQU   CVTMAP+404                                               03825000
CVTRV485 EQU   CVTMAP+400                                               03826000
CVTACTAP EQU   CVTMAP+396                                               03827000
CVTAUTH  EQU   CVTMAP+392                                               03828000
CVTATMCA EQU   CVTATMCT+1                                               03829000
CVTATMST EQU   CVTATMCT                                                 03830000
CVTRSV61 EQU   CVTMAP+384                                               03831000
CVTVOLT1 EQU   CVTVOLM1+1                                               03832000
CVTVOLI1 EQU   CVTVOLF1                                                 03833000
CVTSTOA  EQU   CVTMAP+376                                               03834000
CVTRSV58 EQU   CVTMAP+374                                               03835000
CVTRSV57 EQU   CVTMAP+372                                               03836000
CVTDDCE  EQU   CVTMAP+368                                               03837000
CVTPNWFR EQU   CVTMAP+364                                               03838000
CVTSMF   EQU   CVTMAP+360                                               03839000
CVTSULK  EQU   CVTMAP+358                                               03840000
CVTSLKO  EQU   CVTSYSK                                                  03841000
CVTSLKP  EQU   CVTSYSK                                                  03842000
CVTSLKQ  EQU   CVTSYSK                                                  03843000
CVTSLKR  EQU   CVTSYSK                                                  03844000
CVTRSV56 EQU   CVTSYSK                                                  03845000
CVTRSV55 EQU   CVTSYSK                                                  03846000
CVTRSV54 EQU   CVTSYSK                                                  03847000
CVTRSV53 EQU   CVTSYSK                                                  03848000
CVTRSV52 EQU   CVTA1F1                                                  03849000
CVTRSV51 EQU   CVTA1F1                                                  03850000
CVTRSV50 EQU   CVTA1F1                                                  03851000
CVTRSV49 EQU   CVTA1F1                                                  03852000
CVTRSV48 EQU   CVTA1F1                                                  03853000
CVTRSV47 EQU   CVTA1F1                                                  03854000
CVTSRSW  EQU   CVTA1F1                                                  03855000
CVTPFSW  EQU   CVTA1F1                                                  03856000
CVTPCVT  EQU   CVTMAP+352                                               03857000
CVTRSV46 EQU   CVTMAP+344                                               03858000
CVTRSV45 EQU   CVTMAP+340                                               03859000
CVTRSV44 EQU   CVTMAP+338                                               03860000
CVTRSV43 EQU   CVTMAP+336                                               03861000
CVTHJESA EQU   CVTHJES+1                                                03862000
CVTRSV42 EQU   CVTHJES                                                  03863000
CVTEXT2A EQU   CVTEXT2+1                                                03864000
CVTRSV41 EQU   CVTEXT2                                                  03865000
CVTAPFA  EQU   CVTAPF+1                                                 03866000
CVTRSV40 EQU   CVTAPF                                                   03867000
CVTRV518 EQU   CVTINTLA                                                 03868000
CVTRV517 EQU   CVTERPV                                                  03869000
CVTEORM  EQU   CVTMAP+312                                               03870000
CVTMCHPR EQU   CVTMAP+308                                               03871000
CVTTZ    EQU   CVTMAP+304                                               03872000
CVTJEPS  EQU   CVTMAP+300                                               03873000
CVTJESCT EQU   CVTMAP+296                                               03874000
CVTMODE  EQU   CVTMAP+292                                               03875000
CVTPTRV  EQU   CVTMAP+288                                               03876000
CVTREAL  EQU   CVTMAP+284                                               03877000
CVTRSV39 EQU   CVTMAP+280                                               03878000
CVTRSV38 EQU   CVTMAP+276                                               03879000
CVTDMSRA EQU   CVTDMSR+1                                                03880000
CVTRSV37 EQU   CVTDMSR                                                  03881000
CVTQMSGA EQU   CVTQMSG+1                                                03882000
CVTRSV36 EQU   CVTQMSG                                                  03883000
CVTAMFF  EQU   CVTMAP+264                                               03884000
CVTPURGA EQU   CVTPURG+1                                                03885000
CVTRSV35 EQU   CVTPURG                                                  03886000
CVTCBSP  EQU   CVTMAP+256                                               03887000
CVTATERA EQU   CVTATER+1                                                03888000
CVTSYST  EQU   CVTATER                                                  03889000
CVTVOLT2 EQU   CVTTAT                                                   03890000
CVTVOLI2 EQU   CVTVOLF2                                                 03891000
CVTAQAVB EQU   CVTAQAVT+1                                               03892000
CVTRSV34 EQU   CVTTCMFG                                                 03893000
CVTRSV33 EQU   CVTTCMFG                                                 03894000
CVTRSV32 EQU   CVTTCMFG                                                 03895000
CVTRSV31 EQU   CVTTCMFG                                                 03896000
CVTRSV30 EQU   CVTTCMFG                                                 03897000
CVTRSV29 EQU   CVTTCMFG                                                 03898000
CVTRSV28 EQU   CVTTCMFG                                                 03899000
CVTTCRDY EQU   CVTTCMFG                                                 03900000
CVTGTFA  EQU   CVTGTF+1                                                 03901000
CVTRSV27 EQU   CVTGTFST                                                 03902000
CVTRNIO  EQU   CVTGTFST                                                 03903000
CVTUSR   EQU   CVTGTFST                                                 03904000
CVTRV318 EQU   CVTFORM                                                  03905000
CVTRV317 EQU   CVTTMODE                                                 03906000
CVTRV316 EQU   CVTSTATE                                                 03907000
CVTRV315 EQU   CVTGTFS                                                  03908000
CVTGTFAV EQU   CVTGTFS                                                  03909000
CVT0SCR1 EQU   CVTMAP+232                                               03910000
CVTRV515 EQU   CVTMAP+228                                               03911000
CVTRMS   EQU   CVTMAP+224                                               03912000
CVTPATCH EQU   CVTMAP+220                                               03913000
CVTTSCE  EQU   CVTMAP+216                                               03914000
CVTLNKSC EQU   CVTMAP+214                                               03915000
CVTQABST EQU   CVTMAP+212                                               03916000
CVTMDLDS EQU   CVTMAP+208                                               03917000
CVTUSER  EQU   CVTMAP+204                                               03918000
CVTABEND EQU   CVTMAP+200                                               03919000
CVTSMCA  EQU   CVTMAP+196                                               03920000
CVTRSV18 EQU   CVTMAP+192                                               03921000
CVTQLPAQ EQU   CVTMAP+188                                               03922000
CVTQCDSR EQU   CVTMAP+184                                               03923000
CVTRSV17 EQU   CVTOPTB                                                  03924000
CVTRSV16 EQU   CVTOPTB                                                  03925000
CVTFP    EQU   CVTOPTB                                                  03926000
CVTAPTHR EQU   CVTOPTB                                                  03927000
CVTNLOG  EQU   CVTOPTB                                                  03928000
CVTTOD   EQU   CVTOPTB                                                  03929000
CVTCTIMS EQU   CVTOPTB                                                  03930000
CVTPROT  EQU   CVTOPTB                                                  03931000
CVTXPFP  EQU   CVTOPTA                                                  03932000
CVTASCII EQU   CVTOPTA                                                  03933000
CVTRSV13 EQU   CVTOPTA                                                  03934000
CVTRSV12 EQU   CVTOPTA                                                  03935000
CVTNIP   EQU   CVTOPTA                                                  03936000
CVTDDR   EQU   CVTOPTA                                                  03937000
CVTAPR   EQU   CVTOPTA                                                  03938000
CVTCCH   EQU   CVTOPTA                                                  03939000
CVTSNCTR EQU   CVTMAP+180                                               03940000
CVTQMWR  EQU   CVTMAP+176                                               03941000
CVTQOCR  EQU   CVTMAP+172                                               03942000
CVT1EF00 EQU   CVTMAP+168                                               03943000
CVTMZ00  EQU   CVTMAP+164                                               03944000
CVTHEAD  EQU   CVTMAP+160                                               03945000
CVTRSV11 EQU   CVTMAP+156                                               03946000
CVT0PT01 EQU   CVTMAP+152                                               03947000
CVTMSER  EQU   CVTMAP+148                                               03948000
CVTRV516 EQU   CVTIERLC                                                 03949000
CVTILCH  EQU   CVTMAP+140                                               03950000
CVT0DS   EQU   CVTMAP+136                                               03951000
CVTFBOSV EQU   CVTMAP+132                                               03952000
CVTNUCB  EQU   CVTMAP+128                                               03953000
CVTIXAVL EQU   CVTMAP+124                                               03954000
CVTIOQET EQU   CVTMAP+120                                               03955000
CVTDCBA  EQU   CVTMAP+117                                               03956000
CVTMVS2  EQU   CVTDCB                                                   03957000
CVT6DAT  EQU   CVTDCB                                                   03958000
CVT4MPS  EQU   CVTDCB                                                   03959000
CVTRSV09 EQU   CVTDCB                                                   03960000
CVT4MS1  EQU   CVTDCB                                                   03961000
CVT2SPS  EQU   CVTDCB                                                   03962000
CVT1SSS  EQU   CVTDCB                                                   03963000
CVTRSV08 EQU   CVTDCB                                                   03964000
CVTSTB   EQU   CVTMAP+112                                               03965000
CVTQTD00 EQU   CVTMAP+108                                               03966000
CVTQTE00 EQU   CVTMAP+104                                               03967000
CVTCUCB  EQU   CVTMAP+100                                               03968000
CVTSJQ   EQU   CVTMAP+96                                                03969000
CVTPBLDL EQU   CVTMAP+92                                                03970000
CVTTPC   EQU   CVTMAP+88                                                03971000
CVTSVDCB EQU   CVTMAP+84                                                03972000
CVTBRET  EQU   CVTMAP+82                                                03973000
CVTEXIT  EQU   CVTMAP+80                                                03974000
CVT0FN00 EQU   CVTMAP+76                                                03975000
CVTDARA  EQU   CVTDAR+1                                                 03976000
CVTRSV07 EQU   CVTFLGS1                                                 03977000
CVTRSV06 EQU   CVTFLGS1                                                 03978000
CVTRSV05 EQU   CVTFLGS1                                                 03979000
CVTRSV04 EQU   CVTFLGS1                                                 03980000
CVTRSV03 EQU   CVTFLGS1                                                 03981000
CVTRSV02 EQU   CVTFLGS1                                                 03982000
CVTRSV01 EQU   CVTFLGS1                                                 03983000
CVTDMPLK EQU   CVTFLGS1                                                 03984000
CVTXITP  EQU   CVTMAP+68                                                03985000
CVTZDTAB EQU   CVTMAP+64                                                03986000
CVTMSLT  EQU   CVTMAP+60                                                03987000
CVTDATE  EQU   CVTMAP+56                                                03988000
CVTBTERM EQU   CVTMAP+52                                                03989000
CVTSYSAD EQU   CVTMAP+48                                                03990000
CVTXTLER EQU   CVTMAP+44                                                03991000
CVTILK2  EQU   CVTMAP+40                                                03992000
CVTILK1  EQU   CVTMAP+36                                                03993000
CVTPRLTV EQU   CVTMAP+32                                                03994000
CVTPCNVT EQU   CVTMAP+28                                                03995000
CVT0VL00 EQU   CVTMAP+24                                                03996000
CVTXAPG  EQU   CVTMAP+20                                                03997000
CVTBUF   EQU   CVTMAP+16                                                03998000
CVTJOB   EQU   CVTMAP+12                                                03999000
CVTLINK  EQU   CVTMAP+8                                                 04000000
CVT0EF00 EQU   CVTMAP+4                                                 04001000
CVTTCBP  EQU   CVTMAP                                                   04002000
CVT      EQU   CVTMAP                                                   04003000
UCBERADR EQU   UCBUCS+12                                                04004000
UCBFCBID EQU   UCBUCS+8                                                 04005000
UCBERCNT EQU   UCBUCS+7                                                 04006000
UCBRSV51 EQU   UCBUCS+6                                                 04007000
UCBRSV50 EQU   UCBFCBOP                                                 04008000
UCBRSV49 EQU   UCBFCBOP                                                 04009000
UCBRSV48 EQU   UCBFCBOP                                                 04010000
UCBRSV47 EQU   UCBFCBOP                                                 04011000
UCBRSV46 EQU   UCBFCBOP                                                 04012000
UCBRSV45 EQU   UCBFCBOP                                                 04013000
UCBRSV44 EQU   UCBFCBOP                                                 04014000
UCBFCBO1 EQU   UCBFCBOP                                                 04015000
UCBUCSPE EQU   UCBUCSOP                                                 04016000
UCBRSV43 EQU   UCBUCSOP                                                 04017000
UCBRSV42 EQU   UCBUCSOP                                                 04018000
UCBRSV41 EQU   UCBUCSOP                                                 04019000
UCBRSV40 EQU   UCBUCSOP                                                 04020000
UCBRSV39 EQU   UCBUCSOP                                                 04021000
UCBUCSO2 EQU   UCBUCSOP                                                 04022000
UCBUCSO1 EQU   UCBUCSOP                                                 04023000
UCBUCSID EQU   UCBUCS                                                   04024000
UCBMDRBA EQU   UCBMDRBF+1                                               04025000
UCBRV075 EQU   UCBMDRBF                                                 04026000
UCBRV074 EQU   UCB3800X+32                                              04027000
UCBIMAGE EQU   UCB3800X+28                                              04028000
UCBFCBNM EQU   UCB3800X+24                                              04029000
UCBCHAR4 EQU   UCB3800X+20                                              04030000
UCBCHAR3 EQU   UCB3800X+16                                              04031000
UCBCHAR2 EQU   UCB3800X+12                                              04032000
UCBCHAR1 EQU   UCB3800X+8                                               04033000
UCBCGMID EQU   UCB3800X+4                                               04034000
UCBBRSTA EQU   UCBACTIV                                                 04035000
UCBRV063 EQU   UCBACTIV                                                 04036000
UCBRV062 EQU   UCBACTIV                                                 04037000
UCBRV061 EQU   UCBACTIV                                                 04038000
UCBRV060 EQU   UCBACTIV                                                 04039000
UCBRV059 EQU   UCBACTIV                                                 04040000
UCBRV058 EQU   UCBACTIV                                                 04041000
UCBRV057 EQU   UCBACTIV                                                 04042000
UCBRV050 EQU   UCB3800X+2                                               04043000
UCBCGMNO EQU   UCB3800X+1                                               04044000
UCBRV083 EQU   UCBOPTNS                                                 04045000
UCBBRSTR EQU   UCBOPTNS                                                 04046000
UCBRV056 EQU   UCBOPTNS                                                 04047000
UCBRV055 EQU   UCBOPTNS                                                 04048000
UCBRV054 EQU   UCBOPTNS                                                 04049000
UCBRV053 EQU   UCBOPTNS                                                 04050000
UCBRV052 EQU   UCBOPTNS                                                 04051000
UCBRV051 EQU   UCBOPTNS                                                 04052000
UCBRV073 EQU   UCB3540X+7                                               04053000
UCBRV072 EQU   UCBDKBYT                                                 04054000
UCBRV071 EQU   UCBDKBYT                                                 04055000
UCBRV070 EQU   UCBDKBYT                                                 04056000
UCBRV069 EQU   UCBDKBYT                                                 04057000
UCBRV068 EQU   UCBDKBYT                                                 04058000
UCBRV067 EQU   UCBDKBYT                                                 04059000
UCBVLVER EQU   UCBDKBYT                                                 04060000
UCBDKAMX EQU   UCBDKBYT                                                 04061000
UCBVLSER EQU   UCB3540X                                                 04062000
UCBRDATA EQU   UCBOCR+4                                                 04063000
UCBFRID  EQU   UCBOCR                                                   04064000
UCBCLN   EQU   UCBMT+14                                                 04065000
UCBERG   EQU   UCBMT+12                                                 04066000
UCBMS    EQU   UCBMT+11                                                 04067000
UCBNB    EQU   UCBMT+10                                                 04068000
UCBPW    EQU   UCBMT+9                                                  04069000
UCBPR    EQU   UCBMT+8                                                  04070000
UCBSIO   EQU   UCBMT+6                                                  04071000
UCBTW    EQU   UCBMT+5                                                  04072000
UCBTR    EQU   UCBMT+4                                                  04073000
UCBTWT   EQU   UCBMT+3                                                  04074000
UCBTRT   EQU   UCBMT+2                                                  04075000
UCBCTD   EQU   UCBMT                                                    04076000
UCBWTOID EQU   UCBCMEXT+17                                              04077000
UCBRV043 EQU   UCBCMEXT+16                                              04078000
UCBASID  EQU   UCBCMEXT+14                                              04079000
UCBMFCNT EQU   UCBCMEXT+12                                              04080000
UCBPMSK  EQU   UCBCMEXT+10                                              04081000
UCBCCWOF EQU   UCBCMEXT+8                                               04082000
UCBRV041 EQU   UCBCMEXT+6                                               04083000
UCBRV036 EQU   UCBFLP1                                                  04084000
UCBRV035 EQU   UCBFLP1                                                  04085000
UCBERLOG EQU   UCBFLP1                                                  04086000
UCBRV033 EQU   UCBFLP1                                                  04087000
UCBRV032 EQU   UCBFLP1                                                  04088000
UCBRV031 EQU   UCBFLP1                                                  04089000
UCBSHRUP EQU   UCBFLP1                                                  04090000
UCBNSRCH EQU   UCBFLP1                                                  04091000
UCBSNSCT EQU   UCBCMEXT+4                                               04092000
UCBHPDV  EQU   @NM00013                                                 04093000
UCBHALI  EQU   @NM00013                                                 04094000
UCBRSV09 EQU   @NM00013                                                 04095000
UCBRSV08 EQU   @NM00013                                                 04096000
UCBRSV07 EQU   @NM00013                                                 04097000
UCBRSV06 EQU   @NM00013                                                 04098000
UCBRSV05 EQU   @NM00013                                                 04099000
UCBRSV04 EQU   @NM00013                                                 04100000
UCBDTI   EQU   UCBCMEXT+2                                               04101000
UCBSTI   EQU   UCBCMEXT+1                                               04102000
UCBETI   EQU   UCBCMEXT                                                 04103000
UCBEXTP  EQU   UCBEXTPT+1                                               04104000
UCBDDRSW EQU   UCBFLC                                                   04105000
UCBTICBT EQU   UCBFLC                                                   04106000
UCBIVRR  EQU   UCBFLC                                                   04107000
UCBIVRS  EQU   UCBFLC                                                   04108000
UCBITF   EQU   UCBFLC                                                   04109000
UCBUDE   EQU   UCBFLC                                                   04110000
UCBWAA   EQU   UCBFLC                                                   04111000
UCBATTP  EQU   UCBFLC                                                   04112000
UCBUNTYP EQU   UCBTBYT4                                                 04113000
UCBRSV11 EQU   UCBDVCLS                                                 04114000
UCBRSV10 EQU   UCBDVCLS                                                 04115000
UCB3CHAR EQU   UCBDVCLS                                                 04116000
UCB3UREC EQU   UCBDVCLS                                                 04117000
UCB3DISP EQU   UCBDVCLS                                                 04118000
UCB3DACC EQU   UCBDVCLS                                                 04119000
UCB3COMM EQU   UCBDVCLS                                                 04120000
UCB3TAPE EQU   UCBDVCLS                                                 04121000
UCBDVPWR EQU   UCB2OPT7                                                 04122000
UCBVLPWR EQU   UCB2OPT6                                                 04123000
UCB2OPT5 EQU   UCBTBYT2                                                 04124000
UCBRVDEV EQU   UCBRWTAU                                                 04125000
UCBRPS   EQU   UCBDUDN2                                                 04126000
UCBRR    EQU   UCBDUDN1                                                 04127000
UCB2OPT1 EQU   UCBTBYT2                                                 04128000
UCB2OPT0 EQU   UCBTBYT2                                                 04129000
UCB1FEA7 EQU   UCBTBYT1                                                 04130000
UCBD6250 EQU   UCB1FEA6                                                 04131000
UCBD1600 EQU   UCB1FEA5                                                 04132000
UCB1FEA4 EQU   UCBTBYT1                                                 04133000
UCB1FEA3 EQU   UCBTBYT1                                                 04134000
UCB1FEA2 EQU   UCBTBYT1                                                 04135000
UCB1FEA1 EQU   UCBTBYT1                                                 04136000
UCB1FEA0 EQU   UCBTBYT1                                                 04137000
UCBNAME  EQU   UCBOB+13                                                 04138000
UCBRV029 EQU   UCBWGT                                                   04139000
UCBVHRSN EQU   UCBWGT                                                   04140000
UCBVORSN EQU   UCBWGT                                                   04141000
UCBMTPXP EQU   UCBWGT                                                   04142000
UCBREW   EQU   UCBWGT                                                   04143000
UCBPUB   EQU   UCBWGT                                                   04144000
UCBOUT   EQU   UCBWGT                                                   04145000
UCBIN    EQU   UCBWGT                                                   04146000
UCBCPU   EQU   UCBOB+11                                                 04147000
UCBLCI   EQU   UCBOB+10                                                 04148000
UCBCNT   EQU   UCBOB+9                                                  04149000
UCBRV017 EQU   UCBCHM1                                                  04150000
UCBRV016 EQU   UCBCHM1                                                  04151000
UCBRV015 EQU   UCBCHM1                                                  04152000
UCBRV014 EQU   UCBCHM1                                                  04153000
UCBSPB   EQU   UCBPTH1                                                  04154000
UCBPPB   EQU   UCBPTH1                                                  04155000
UCBSPA   EQU   UCBPTH0                                                  04156000
UCBPPA   EQU   UCBPTH0                                                  04157000
UCBSIGP  EQU   UCBFLB                                                   04158000
UCBVALPH EQU   UCBFLB                                                   04159000
UCBCRHSN EQU   UCBFLB                                                   04160000
UCBCRHRV EQU   UCBFLB                                                   04161000
UCBRESVH EQU   UCBFLB                                                   04162000
UCBSPST  EQU   UCBFLB                                                   04163000
UCBASNS  EQU   UCBFLB                                                   04164000
UCBIORST EQU   UCBFLB                                                   04165000
UCBQISCE EQU   UCBFL1                                                   04166000
UCBACTV  EQU   UCBFL1                                                   04167000
UCBSAP   EQU   UCBFL1                                                   04168000
UCBNOTRC EQU   UCBCUB                                                   04169000
UCBPSNS  EQU   UCBFL1                                                   04170000
UCBUSING EQU   UCBPST                                                   04171000
UCBNOTRD EQU   UCBNRY                                                   04172000
UCBBUSYD EQU   UCBBSY                                                   04173000
UCBUA    EQU   UCBCHAN+1                                                04174000
UCBCHA   EQU   UCBCHAN                                                  04175000
UCBDADI  EQU   UCBSTAT                                                  04176000
UCBSYSR  EQU   UCBSTAT                                                  04177000
UCBPRES  EQU   UCBSTAT                                                  04178000
UCBALOC  EQU   UCBSTAT                                                  04179000
UCBUNLD  EQU   UCBSTAT                                                  04180000
UCBRESV  EQU   UCBSTAT                                                  04181000
UCBCHGS  EQU   UCBSTAT                                                  04182000
UCBONLI  EQU   UCBSTAT                                                  04183000
UCBID    EQU   UCBOB+2                                                  04184000
UCBALTPH EQU   UCBFL5                                                   04185000
UCBALTCU EQU   UCBFL5                                                   04186000
UCBNALOC EQU   UCBFL5                                                   04187000
UCBENVRD EQU   UCBFL5                                                   04188000
UCBVSDR  EQU   UCBFL5                                                   04189000
UCBSASK  EQU   UCBFL5                                                   04190000
UCBAMV   EQU   UCBAF                                                    04191000
UCBDCC   EQU   UCBFL5                                                   04192000
UCBMONT  EQU   UCBJBNR                                                  04193000
UCBRV011 EQU   UCBJBNR                                                  04194000
UCBRSV02 EQU   UCBJBNR                                                  04195000
UCBOLDSM EQU   UCBJBNR                                                  04196000
UCBRV003 EQU   UCBJBNR                                                  04197000
UCBDUC   EQU   UCBJBNR                                                  04198000
UCBJES3  EQU   UCBJBNR                                                  04199000
UCBVRDEV EQU   UCBJBNR                                                  04200000
UCBCMSEG EQU   UCBOB                                                    04201000
UCBPFXND EQU   UCB+512                                                  04202000
UCBIOQ   EQU   UCB+508                                                  04203000
UCBLOCK  EQU   UCB+504                                                  04204000
UCBPXST  EQU   UCB+504                                                  04205000
@NM00010 EQU   UCB                                                      04206000
IOSEND   EQU   IOSB+108                                                 04207000
IOSSKR   EQU   IOSEEKA+7                                                04208000
IOSSKH2  EQU   IOSSKHH+1                                                04209000
IOSSKH1  EQU   IOSSKHH                                                  04210000
IOSSKCC  EQU   IOSCCHH                                                  04211000
IOSSKBB  EQU   IOSEEKA+1                                                04212000
IOSSKM   EQU   IOSEEKA                                                  04213000
IOSEEK   EQU   IOSB+92                                                  04214000
IOSMDM   EQU   IOSB+91                                                  04215000
IOSMDB   EQU   IOSB+90                                                  04216000
IOSCKEY7 EQU   IOSCKEY                                                  04217000
IOSCKEY6 EQU   IOSCKEY                                                  04218000
IOSCKEY5 EQU   IOSCKEY                                                  04219000
IOSCKEY4 EQU   IOSCKEY                                                  04220000
@NM00006 EQU   IOSCKEY                                                  04221000
IOSFMSK  EQU   IOSB+88                                                  04222000
IOSCUDEV EQU   IOSPATH+1                                                04223000
@NM00005 EQU   IOSCHN                                                   04224000
IOSPATH3 EQU   IOSCHN                                                   04225000
IOSPATH2 EQU   IOSCHN                                                   04226000
IOSEXP   EQU   IOSCHN                                                   04227000
IOSGDP   EQU   IOSCHN                                                   04228000
IOSAFF   EQU   IOSB+85                                                  04229000
IOSRSS1B EQU   IOSB+84                                                  04230000
IOSDSID  EQU   IOSB+80                                                  04231000
IOSVST   EQU   IOSB+76                                                  04232000
IOSRST   EQU   IOSB+72                                                  04233000
IOSDIE   EQU   IOSB+68                                                  04234000
IOSABN   EQU   IOSB+64                                                  04235000
IOSNRM   EQU   IOSB+60                                                  04236000
IOSPCI   EQU   IOSB+56                                                  04237000
IOSERP   EQU   IOSB+52                                                  04238000
IOSPCHN  EQU   IOSB+48                                                  04239000
IOSSNS   EQU   IOSB+42                                                  04240000
IOSAPMSK EQU   IOSB+40                                                  04241000
IOSRES4A EQU   IOSB+36                                                  04242000
IOSUSE   EQU   IOSB+32                                                  04243000
IOSSRB   EQU   IOSB+28                                                  04244000
IOSCSWRC EQU   IOSCSW+5                                                 04245000
IOSTSB   EQU   IOSTATUS+1                                               04246000
IOSTSA   EQU   IOSTATUS                                                 04247000
IOSCSWCA EQU   IOSCSW                                                   04248000
IOSCC    EQU   @NM00004                                                 04249000
IOSOPT2X EQU   IOSOPT2                                                  04250000
IOSHTP   EQU   IOSOPT2                                                  04251000
IOSRELSE EQU   IOSOPT                                                   04252000
IOSAPR   EQU   IOSOPT                                                   04253000
IOSTSLL  EQU   IOSOPT                                                   04254000
IOSNERP  EQU   IOSOPT                                                   04255000
IOSPSLL  EQU   IOSOPT                                                   04256000
IOSQISCE EQU   IOSOPT                                                   04257000
IOSDEP   EQU   IOSOPT                                                   04258000
IOSBYP   EQU   IOSOPT                                                   04259000
IOSCOD   EQU   IOSB+13                                                  04260000
IOSPKY7  EQU   IOSPKEY                                                  04261000
IOSPGDPX EQU   IOSPKEY                                                  04262000
IOSIDR   EQU   IOSPKEY                                                  04263000
IOSLCL   EQU   IOSPKEY                                                  04264000
@NM00003 EQU   IOSPKEY                                                  04265000
IOSPGAD  EQU   IOSB+8                                                   04266000
IOSASID  EQU   IOSB+6                                                   04267000
IOSPRLVL EQU   IOSB+5                                                   04268000
IOSDVRID EQU   IOSB+4                                                   04269000
IOSPROC  EQU   IOSB+3                                                   04270000
IOSFLC7  EQU   IOSFLC                                                   04271000
IOSFLC6  EQU   IOSFLC                                                   04272000
IOSRWAIT EQU   IOSFLC                                                   04273000
IOSTP    EQU   IOSFLC                                                   04274000
IOSCC3WE EQU   IOSFLC                                                   04275000
IOSVERIF EQU   IOSDVALT                                                 04276000
IOSDVMNT EQU   IOSFLC                                                   04277000
IOSLOG   EQU   IOSFLB                                                   04278000
IOSBDCST EQU   IOSFLB                                                   04279000
IOSMSG   EQU   IOSFLB                                                   04280000
IOSFLB4  EQU   IOSFLB                                                   04281000
IOSFLB3  EQU   IOSFLB                                                   04282000
IOSFLB2  EQU   IOSFLB                                                   04283000
IOSSDR   EQU   IOSFLB                                                   04284000
IOSDIESE EQU   IOSFLB                                                   04285000
IOSIOSB  EQU   IOSFLA                                                   04286000
IOSDOM   EQU   IOSFLA                                                   04287000
IOSEX    EQU   IOSFLA                                                   04288000
IOSSMDB  EQU   IOSFLA                                                   04289000
IOSSMDA  EQU   IOSFLA                                                   04290000
IOSERR   EQU   IOSFLA                                                   04291000
IOSCCHN  EQU   IOSACHN                                                  04292000
IOSDCHN  EQU   IOSACHN                                                  04293000
@NM00002 EQU   SRBSECT+40                                               04294000
@NM00001 EQU   SRBSECT+38                                               04295000
SRBPRIOR EQU   SRBSECT+37                                               04296000
SRBPKF   EQU   SRBSECT+36                                               04297000
SRBSAVE  EQU   SRBSECT+32                                               04298000
SRBPARM  EQU   SRBSECT+28                                               04299000
SRBRMTR  EQU   SRBSECT+24                                               04300000
SRBEP    EQU   SRBSECT+20                                               04301000
SRBPTCB  EQU   SRBFLC+4                                                 04302000
SRBPASID EQU   SRBFLC+2                                                 04303000
SRBCPAFF EQU   SRBFLC                                                   04304000
SRBASCB  EQU   SRBSECT+8                                                04305000
SRBFLNK  EQU   SRBSECT+4                                                04306000
SRBID    EQU   SRBSECT                                                  04307000
@NM00037 EQU   PSA+3668                                                 04308000
PSASTAK  EQU   PSA+3072                                                 04309000
@NM00036 EQU   PSA+1048                                                 04310000
PSAUSEND EQU   PSA+1048                                                 04311000
PSARV062 EQU   PSA+1044                                                 04312000
PSACDAL  EQU   PSA+1040                                                 04313000
PSAWTCOD EQU   PSA+1036                                                 04314000
PSAATCVT EQU   PSA+1032                                                 04315000
PSAPCPSW EQU   PSA+1024                                                 04316000
PSAPIR2  EQU   PSA+1020                                                 04317000
PSARV059 EQU   PSA+1018                                                 04318000
PSASVC13 EQU   PSA+1016                                                 04319000
PSALSFCC EQU   PSA+1012                                                 04320000
PSASFACC EQU   PSA+1008                                                 04321000
PSASTOP  EQU   PSA+992                                                  04322000
PSASTART EQU   PSA+976                                                  04323000
PSARSPSW EQU   PSA+968                                                  04324000
PSASRPSW EQU   PSA+960                                                  04325000
PSARV045 EQU   PSA+892                                                  04326000
PSARV044 EQU   PSA+888                                                  04327000
PSARV043 EQU   PSA+884                                                  04328000
PSARV042 EQU   PSA+880                                                  04329000
PSARV041 EQU   PSA+876                                                  04330000
PSARV040 EQU   PSA+872                                                  04331000
PSARV025 EQU   PSA+868                                                  04332000
PSADSSED EQU   PSA+868                                                  04333000
PSADSSPR EQU   PSA+864                                                  04334000
PSADSSFW EQU   PSA+860                                                  04335000
PSADSS14 EQU   PSA+856                                                  04336000
PSADSSPP EQU   PSA+848                                                  04337000
PSADSSRP EQU   PSA+840                                                  04338000
PSADSS05 EQU   PSADSSF4                                                 04339000
PSADSS10 EQU   PSADSSF4                                                 04340000
PSADSSVE EQU   PSADSSF4                                                 04341000
PSADSSDE EQU   PSADSSF4                                                 04342000
PSADSSC0 EQU   PSADSSF4                                                 04343000
PSADSSIE EQU   PSADSSF4                                                 04344000
PSADSS12 EQU   PSADSSF4                                                 04345000
PSADSSRC EQU   PSADSSF4                                                 04346000
PSARV057 EQU   PSADSSF3                                                 04347000
PSARV056 EQU   PSADSSF3                                                 04348000
PSARV055 EQU   PSADSSF3                                                 04349000
PSADSSMC EQU   PSADSSF3                                                 04350000
PSADSSRW EQU   PSADSSF3                                                 04351000
PSADSSNM EQU   PSADSSF3                                                 04352000
PSADSSES EQU   PSADSSF3                                                 04353000
PSADSSGP EQU   PSADSSF3                                                 04354000
PSADSSF2 EQU   PSADSSFL+1                                               04355000
PSADSSPI EQU   PSADSSF1                                                 04356000
PSADSSOI EQU   PSADSSF1                                                 04357000
PSADSSSP EQU   PSADSSF1                                                 04358000
PSADSSTP EQU   PSADSSF1                                                 04359000
PSADSSDW EQU   PSADSSF1                                                 04360000
PSADSSDD EQU   PSADSSF1                                                 04361000
PSADSSDM EQU   PSADSSF1                                                 04362000
PSADSSMV EQU   PSADSSF1                                                 04363000
PSADSSTS EQU   PSA+816                                                  04364000
PSADSSWK EQU   PSA+812                                                  04365000
PSADSSR3 EQU   PSA+808                                                  04366000
PSADSSR2 EQU   PSA+804                                                  04367000
PSADSSRS EQU   PSA+800                                                  04368000
PSASTOR  EQU   PSA+796                                                  04369000
PSACPUSA EQU   PSA+794                                                  04370000
PSAVSTAP EQU   PSA+792                                                  04371000
PSAWKVAP EQU   PSA+788                                                  04372000
PSAWKRAP EQU   PSA+784                                                  04373000
PSAMCHIC EQU   PSA+783                                                  04374000
PSARV061 EQU   PSA+782                                                  04375000
PSASYMSK EQU   PSA+781                                                  04376000
PSAMCHFL EQU   PSA+780                                                  04377000
PSACR0   EQU   PSA+776                                                  04378000
PSAPSWSV EQU   PSA+768                                                  04379000
PSALITA  EQU   PSA+764                                                  04380000
PSACLHS  EQU   PSAHLHI                                                  04381000
PSALKR15 EQU   PSALKSA+60                                               04382000
PSALKR14 EQU   PSALKSA+56                                               04383000
PSALKR13 EQU   PSALKSA+52                                               04384000
PSALKR12 EQU   PSALKSA+48                                               04385000
PSALKR11 EQU   PSALKSA+44                                               04386000
PSALKR10 EQU   PSALKSA+40                                               04387000
PSALKR9  EQU   PSALKSA+36                                               04388000
PSALKR8  EQU   PSALKSA+32                                               04389000
PSALKR7  EQU   PSALKSA+28                                               04390000
PSALKR6  EQU   PSALKSA+24                                               04391000
PSALKR5  EQU   PSALKSA+20                                               04392000
PSALKR4  EQU   PSALKSA+16                                               04393000
PSALKR3  EQU   PSALKSA+12                                               04394000
PSALKR2  EQU   PSALKSA+8                                                04395000
PSALKR1  EQU   PSALKSA+4                                                04396000
PSALKR0  EQU   PSALKSA                                                  04397000
PSARV023 EQU   PSACLHT+52                                               04398000
PSALOCAL EQU   PSACLHT+48                                               04399000
PSACMSL  EQU   PSACLHT+44                                               04400000
PSAOPTL  EQU   PSACLHT+40                                               04401000
PSATPACL EQU   PSACLHT+36                                               04402000
PSATPDNL EQU   PSACLHT+32                                               04403000
PSATPNCL EQU   PSACLHT+28                                               04404000
PSAIOSLL EQU   PSACLHT+24                                               04405000
PSAIOSUL EQU   PSACLHT+20                                               04406000
PSAIOSCL EQU   PSACLHT+16                                               04407000
PSAIOSSL EQU   PSACLHT+12                                               04408000
PSASALCL EQU   PSACLHT+8                                                04409000
PSAASML  EQU   PSACLHT+4                                                04410000
PSADISPL EQU   PSACLHT                                                  04411000
PSASRSA  EQU   PSA+636                                                  04412000
PSARV050 EQU   PSA+634                                                  04413000
PSADSSGO EQU   PSA+633                                                  04414000
PSARECUR EQU   PSA+632                                                  04415000
PSAHLHIS EQU   PSA+628                                                  04416000
PSAIPCSA EQU   PSA+624                                                  04417000
@NM00035 EQU   PSA+621                                                  04418000
PSAIPCDM EQU   PSA+620                                                  04419000
PSAIPCD  EQU   PSA+616                                                  04420000
@NM00034 EQU   PSA+613                                                  04421000
PSAIPCRM EQU   PSA+612                                                  04422000
PSAIPCR  EQU   PSA+608                                                  04423000
PSAMCHEX EQU   PSA+600                                                  04424000
PSAMPSW  EQU   PSA+592                                                  04425000
PSAEXPS2 EQU   PSA+584                                                  04426000
PSAEXPS1 EQU   PSA+576                                                  04427000
PSAPIREG EQU   PSA+572                                                  04428000
PSARSREG EQU   PSA+568                                                  04429000
PSAGPREG EQU   PSA+556                                                  04430000
PSARV022 EQU   PSASUP4                                                  04431000
PSARV021 EQU   PSASUP4                                                  04432000
PSARV020 EQU   PSASUP4                                                  04433000
PSARV019 EQU   PSASUP4                                                  04434000
PSARV018 EQU   PSASUP4                                                  04435000
PSARV017 EQU   PSASUP4                                                  04436000
PSARV016 EQU   PSASUP4                                                  04437000
PSARV015 EQU   PSASUP4                                                  04438000
PSARV014 EQU   PSASUP3                                                  04439000
PSARV013 EQU   PSASUP3                                                  04440000
PSARV012 EQU   PSASUP3                                                  04441000
PSARV011 EQU   PSASUP3                                                  04442000
PSASPR   EQU   PSASUP3                                                  04443000
PSAPSREG EQU   PSASUP3                                                  04444000
PSAPI2   EQU   PSASUP3                                                  04445000
PSAIOSUP EQU   PSASUP3                                                  04446000
PSALCR   EQU   PSASUP2                                                  04447000
PSARTM   EQU   PSASUP2                                                  04448000
PSAACR   EQU   PSASUP2                                                  04449000
PSAIPCE2 EQU   PSASUP2                                                  04450000
PSAIPCES EQU   PSASUP2                                                  04451000
PSAIPCEC EQU   PSASUP2                                                  04452000
PSAGTF   EQU   PSASUP2                                                  04453000
PSAIPCRI EQU   PSASUP2                                                  04454000
PSARV063 EQU   PSASUP1                                                  04455000
PSATCTL  EQU   PSASUP1                                                  04456000
PSADISP  EQU   PSASUP1                                                  04457000
PSALOCK  EQU   PSASUP1                                                  04458000
PSAPI    EQU   PSASUP1                                                  04459000
PSAEXT   EQU   PSASUP1                                                  04460000
PSASVC   EQU   PSASUP1                                                  04461000
PSAIO    EQU   PSASUP1                                                  04462000
PSAAOLD  EQU   PSA+548                                                  04463000
PSAANEW  EQU   PSA+544                                                  04464000
PSATOLD  EQU   PSA+540                                                  04465000
PSATNEW  EQU   PSA+536                                                  04466000
PSALCCAR EQU   PSA+532                                                  04467000
PSALCCAV EQU   PSA+528                                                  04468000
PSAPCCAR EQU   PSA+524                                                  04469000
PSAPCCAV EQU   PSA+520                                                  04470000
PSACPULA EQU   PSA+518                                                  04471000
PSACPUPA EQU   PSA+516                                                  04472000
PSAPSA   EQU   PSA+512                                                  04473000
FLCHDEND EQU   PSA+512                                                  04474000
FLCCRSAV EQU   FLCMCLA+280                                              04475000
FLCGRSAV EQU   FLCMCLA+216                                              04476000
FLCFPSAV EQU   FLCMCLA+184                                              04477000
FLCFLA   EQU   FLCMCLA+88                                               04478000
FLCRGNCD EQU   FLCMCLA+84                                               04479000
FLCFSAA  EQU   FLCFSA+1                                                 04480000
@NM00033 EQU   FLCFSA                                                   04481000
@NM00032 EQU   FLCMCLA+72                                               04482000
FLCMCIC  EQU   FLCMCLA+64                                               04483000
@NM00031 EQU   FLCMCLA+20                                               04484000
FLCIOAA  EQU   FLCIOA+1                                                 04485000
@NM00030 EQU   FLCIOA                                                   04486000
@NM00029 EQU   FLCMCLA+15                                               04487000
@NM00028 EQU   FLCMCLA+14                                               04488000
@NM00027 EQU   FLCMCLA+12                                               04489000
FLCLCL   EQU   FLCMCLA+8                                                04490000
FLCIOELA EQU   FLCIOEL+1                                                04491000
@NM00026 EQU   FLCIOEL                                                  04492000
FLCCHNID EQU   FLCMCLA                                                  04493000
@NM00025 EQU   PSA+160                                                  04494000
FLCMTRCD EQU   PSA+157                                                  04495000
@NM00024 EQU   PSA+156                                                  04496000
FLCPERA  EQU   FLCPER+1                                                 04497000
@NM00023 EQU   FLCPER                                                   04498000
@NM00022 EQU   PSA+151                                                  04499000
FLCPERCD EQU   PSA+150                                                  04500000
FLCMCNUM EQU   PSA+149                                                  04501000
@NM00021 EQU   PSA+148                                                  04502000
FLCTEAA  EQU   FLCTEA+1                                                 04503000
@NM00020 EQU   FLCTEA                                                   04504000
PSAPIPC  EQU   PSAPICOD                                                 04505000
PSAPIMC  EQU   PSAPICOD                                                 04506000
PSAPIPER EQU   PSAPICOD                                                 04507000
PSARV049 EQU   FLCPICOD                                                 04508000
FLCPILCB EQU   FLCPIILC                                                 04509000
@NM00019 EQU   FLCPIILC                                                 04510000
@NM00018 EQU   PSAEPPSW                                                 04511000
FLCSVCN  EQU   PSAESPSW+2                                               04512000
FLCSILCB EQU   FLCSVILC                                                 04513000
@NM00017 EQU   FLCSVILC                                                 04514000
@NM00016 EQU   PSAESPSW                                                 04515000
FLCEICOD EQU   PSAEEPSW+2                                               04516000
PSASPAD  EQU   PSAEEPSW                                                 04517000
@NM00015 EQU   PSA+128                                                  04518000
FLCINPSW EQU   PSA+120                                                  04519000
FLCMNPSW EQU   PSA+112                                                  04520000
FLCPNPSW EQU   PSA+104                                                  04521000
FLCSNPSW EQU   PSA+96                                                   04522000
FLCENPSW EQU   PSA+88                                                   04523000
FLCTRACE EQU   PSA+84                                                   04524000
FLCTIMER EQU   PSA+80                                                   04525000
FLCCVT2  EQU   PSA+76                                                   04526000
FLCCAW   EQU   PSA+72                                                   04527000
FLCCSW   EQU   PSA+64                                                   04528000
FLCIOPSW EQU   PSA+56                                                   04529000
FLCMOPSW EQU   PSA+48                                                   04530000
FLCPOPSW EQU   PSA+40                                                   04531000
FLCSOPSW EQU   PSA+32                                                   04532000
FLCEOPSW EQU   PSA+24                                                   04533000
@NM00014 EQU   FLCICCW2+4                                               04534000
FLCICCW1 EQU   FLCROPSW                                                 04535000
FLCIPPSW EQU   FLCRNPSW                                                 04536000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04537000
@RC00662 EQU   @RC00659                                                 04538000
@RC00663 EQU   @RC00662                                                 04539000
@ENDDATA EQU   *                                                        04540000
         END   ISTZDMMB,(C'PLS2006',0603,75317)                         04541000
