* /* START OF SPECIFICATIONS ****                                       00002002
*                                                                       00002803
*01*  MODULE-NAME = IDCTSPR0                                            00003203
*02* PROCESSOR = ASSEMBLER                                              00004002
*                                                                       00004403
**** END OF SPECIFICATIONS ***/                                         00006002
         TITLE '***** IDCTSPR0 - PRINT STATIC TEXT *****'               00010002
**********************************************************************  00050002
*                                                                    *  00100002
* MODULE NAME - IDCTSPR0 - STATIC TEXT MODULE FOR PRINT              *  00150002
*                                                                    *  00200002
* DESCRIPTIVE NAME - STATIC TEXT MODULE FOR THE FUNCTION PRINT       *  00250002
*                                                                    *  00300002
* COPYRIGHT - NONE                                                   *  00350002
*                                                                    *  00360002
* STATUS - RELEASE 2  LEVEL 0                                        *  00370003
*                                                                    *  00380002
* FUNCTION - CONTAINS NO EXECUTABLE CODE, ONLY STATIC TEXT ENTRIES   *  00390002
*        FOR THE FUNCTION PRINT                                      *  00392002
*        THIS MODULE IS LOADED BY IDCTP05 WHEN A STATIC TEXT         *  00394002
*        REQUEST IS MADE.                                            *  00396002
*                                                                    *  00398002
* NOTES - NONE                                                       *  00398402
*                                                                    *  00398802
*    DEPENDENCIES - NONE                                             *  00401002
*    RESTRICTIONS - NONE                                             *  00403002
*    REGISTER CONVENTIONS - NA                                       *  00403102
*    PATCH AREA - NA                                                 *  00403202
*                                                                    *  00403402
* MODULE TYPE - TABLES                                               *  00405602
*                                                                    *  00407802
*    PROCESSOR - ASSEMBLER                                           *  00410002
*    MODULE SIZE - 1702                                              *  00412203
*    ATTRIBUTES - READ-ONLY                                          *  00414402
*                                                                    *  00416402
*  ENTRY POINT - NA                                                  *  00416502
*                                                                    *  00416602
*  EXIT NORMAL - NA                                                  *  00417002
*                                                                    *  00417402
*  EXIT ERROR - NA                                                   *  00417802
*                                                                    *  00419402
*  EXTERNAL REFERENCES - NA                                          *  00419702
*                                                                    *  00420702
*  TABLES - NA                                                       *  00420802
*                                                                    *  00421002
*  MACROS - NA                                                       *  00421102
*                                                                    *  00421302
* CHANGE ACTIVITY - CHANGED FORMAT OF ENT 21 9/13/74         @Y30LSEC*  00421602
*                 - DELETED ENTRY 15 9/27/74                 @Y30LSEC*  00422002
*                 - READDED ENTRY 16                         @Y30LSEC*  00422103
*                 - ADDED ENTRY 24 1/7/75                    @Y30SSEC*  00435003
*                                                                    *  00448403
**********************************************************************  00461303
*                                                                    *  00474203
**********************************************************************  00487103
*                                                                    *  00500000
* THIS MODULE IS THE FIRST MODULE OF STATIC TEXT REQUIRED BY THE     *  00550000
* PRINT FUNCTION SUB-ROUTINE MODULE.                                 *  00600000
*                                                                    *  00650000
**********************************************************************  00700002
*                                                                       00750000
*                                                                       00800000
IDCTSPR0  CSECT                                                         00850002
*                                                                       00900000
* THIS SECTION CONTAINS THE INDICES TO REACH AN ENTRY.               *  00950000
*                                                                       01000000
INDEX     DC    H'24'                   NULL INDEX VALUE.      @Y30SSEC 01050003
INDEX1    DC    Y(TXT1-INDEX)           LINE PRINT SUB-TITLE.           01100000
INDEX2    DC    Y(TXT2-INDEX)           KEY OF REC FMT ENTRY.  (CHAR)   01150003
INDEX3    DC    Y(TXT3-INDEX)           CCHHR OF RECORD FMT EN.(CHAR)   01160003
INDEX4    DC    Y(TXT4-INDEX)           RBA OF RECORD FMT ENT. (CHAR)   01170000
INDEX5    DC    Y(TXT5-INDEX)           RELATIVE RECORD ENTRY. (CHAR)   01170103
INDEX6    DC    Y(TXT6-INDEX)           KEY OF REC FMT ENT.   (HEX)     01180003
INDEX7    DC    Y(TXT7-INDEX)           CCHHR OF REC FMT ENT. (HEX)     01190003
INDEX8    DC    Y(TXT8-INDEX)           RBA OF REC ENT. (HEX)  @Y30SVLO 01192003
INDEX9    DC    Y(TXT9-INDEX)           REL. RECORD ENT.(HEX)  @Y30SVLO 01194003
INDEX10   DC    Y(TXT10-INDEX)          KEY OF REC FMT  (DUMP) @Y30SVLO 01194103
INDEX11   DC    Y(TXT11-INDEX)          CCHHR OF RECORD (DUMP) @Y30SVLO 01196003
INDEX12   DC    Y(TXT12-INDEX)          RBA OF REC ENT. (DUMP) @Y30SVLO 01198003
INDEX13   DC    Y(TXT13-INDEX)          REL. RECORD ENT.(DUMP) @Y30SVLO 01198103
INDEX14   DC    Y(TXT14-INDEX)          INVALID DS TYPES.      @Y30SVLO 01199603
INDEX15   DC    H'-1'                   NULL ENTRY             @Y30SVLO 01200203
INDEX16   DC    Y(TXT16-INDEX)          COPY CAT DELIM  ERR    @Y30LSEC 01200303
INDEX17   DC    Y(TXT17-INDEX)          INVALID DELIMITER.     @Y30SVLO 01200403
INDEX18   DC    Y(TXT18-INDEX)          CAT. RELOAD DELIM ERR  @YA04583 01216602
INDEX19   DC    Y(TXT19-INDEX)          CAT. RELOAD INVOKE     @YA04583 01226602
INDEX20   DC    Y(TXT20-INDEX)          TARGET CAT. SIZE ERR.  @YA04583 01228602
INDEX21   DC    Y(TXT21-INDEX)          CAT. NAME ERR.         @YA04583 01230602
INDEX22   DC    Y(TXT22-INDEX)          NO CAT. COMPARE        @YA04583 01232602
INDEX23   DC    Y(TXT23-INDEX)          TRUENAME COMPARE MSG   @YA04583 01233002
INDEX24   DC    Y(TXT24-INDEX)          RECOV ATTR ON COPY CAT @Y30SSEC 01233103
          EJECT                                                         01233302
********************************************************************    01250000
*                                                                    *  01300000
* THIS SECTION CONTAINS THE ENTRIES.                                 *  01350000
*                                                                    *  01400000
********************************************************************    01450000
*                                                                       01500000
* IDC PRINT FSR LISTING OF DATA SET ENTRY. (PR01)                       01510002
*                                                                       01520000
          DS    0F                      ALIGN TO A FULL WORD.           01550000
TXT1      DC    Y(TXT1B-TXT1A)          LENGTH.                         01600000
FLG1A     DC    X'0000'                 FLAG BYTE.                      01650000
*  STATIC TEXT SUB-STRUCTURE.                                           01652000
TXT1A     DC    X'8400'                 STATIC TEXT SUB-STRU FLAG.      01660000
          DC    Y(STE11B-STE11A)        STATIC TEXT LENGTH.             01670000
          DC    Y(STE11A-TXT1A)         STATIC TEXT OFFSET.             01680000
          DC    H'1'                    PRINT LINE OFFSET.              01690000
          DC    Y(STE11B-STE11A)        PRINT LINE LENGTH.              01692000
          DC    H'0'                    CONVERSION FLAGS.               01694000
STE11A    DC    C'-'                    TRIPLE SPACE CHARACTER.         01700000
          DC    C'LISTING OF DATA SET - '                               01750002
STE11B    EQU   *                                                       01760000
TXT1B     EQU   *                                                       01800000
          EJECT                                                         01802000
*                                                                       01810000
* PRINT CHARACTER FORMAT STRUCTURE KEY OF RECORD ENTRY.                 01820000
*                                                                       01830000
          DS    0F                                                      01850000
TXT2      DC    Y(TXT2B-TXT2A)          LENGTH.                         01900000
FLG2A     DC    X'0000'                 FLAG FIELD.                     01950000
* DOUBLE SPACE SUB-STRUCTURE.                                           01960000
TXT2A     DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       02000000
          DC    H'2'                    DOUBLE SPACE COUNT.             02050000
          DC    C'R '                   RELATIVE SPACE INDICATOR.       02100000
* STATIC TEXT SUB-STRUCTURE.                                            02110000
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE.      02150000
          DC    Y(STE21B-STE21A)        STATIC TEXT LENGTH.             02200000
          DC    Y(STE21A-TXT2A)         STATIC TEXT OFFSET.             02250000
          DC    H'1'                    PRINT COLUMN.                   02300000
          DC    Y(STE21B-STE21A)        PRINT FIELD LENGTH.             02350000
          DC    H'0'                    CONVERSION FLAGS.               02352000
* INSERT DATA SUB-STRUCTURE.                                            02360000
          DC    X'2000'                 INSERT DATA SUB-STRUCTURE.      02400000
          DC    H'1'                    INSERT REFERENCE NUMBER.        02450000
          DC    H'0'                    UNUSED                          02500002
          DC    H'17'                   PRINT COLUMN.                   02550000
          DC    H'0'                    DEFAULT                         02600002
          DC    X'0000'                 CONVERSION FLAG.  (CHAR)        02650002
* DOUBLE SPACE SUB-STRUCTURE.                                           02700000
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       02750000
          DC    H'1'                    SPACING FACTOR.                 02800002
          DC    C'R '                   SPACING TYPE.                   02850000
* BLOCK DATA SUBSTRUCTURE.                                              02900000
          DC    X'9000'                 BLOCK DATA EOS FLAGS.           02950000
          DC    H'32767'                MAXIMUM INPUT LENGTH.           03000000
          DC    H'0'                    INPUT OFFSET.                   03050000
          DC    H'1'                    PRINT COLUMN.                   03100000
          DC    H'0'                    DEFAULT                         03150002
          DC    X'0000'                 CONVERSION TYPE.  (CHAR)        03200002
* STATIC TEXT ENTRY.                                                    03250000
STE21A    DC    C'KEY OF RECORD -'                                      03300000
STE21B    EQU   *                                                       03350000
TXT2B     EQU   *                                                       03400000
          EJECT                                                         03450000
*                                                                       03631800
* PRINT CHARACTER FORMAT STRUCTURE RECORD SEQUENCE ENTRY.               03633803
*                                                                       03635800
          DS    0F                                                      03639800
TXT3      DC    Y(TXT3B-TXT3A)          LENGTH.                         03641800
FLG3A     DC    X'0000'                 FLAG FIELD.                     03643800
* DOUBLE SPACE SUB-STRUCTURE.                                           03645800
TXT3A     DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       03647800
          DC    H'2'                    DOUBLE SPACE COUNT.             03648200
          DC    C'R '                   RELATIVE SPACE INDICATOR.       03648600
* STATIC TEXT SUB-STRUCTURE.                                            03649000
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE.      03649400
          DC    Y(STE31B-STE31A)        STATIC TEXT LENGTH.             03649500
          DC    Y(STE31A-TXT3A)         STATIC TEXT OFFSET.             03649600
          DC    H'1'                    PRINT COLUMN.                   03649700
          DC    Y(STE31B-STE31A)        PRINT FIELD LENGTH.             03699700
          DC    H'0'                    CONVERSION FLAGS.  (EBCDIC)     03701700
* INSERT DATA SUB-STRUCTURE.                                            03709700
          DC    X'2000'                 INSERT DATA SUB-STRUCTURE.      03719700
          DC    H'1'                    INSERT REFERENCE NUMBER.        03729700
          DC    H'0'                    UNUSED                          03739702
          DC    H'26'                   PRINT COLUMN.                   03741702
          DC    H'0'                    DEFAULT                         03743702
          DC    X'1060'                 CONVERSION FLAG.  (BD)          03745702
* DOUBLE SPACE SUB-STRUCTURE.                                           03747700
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       03748100
          DC    H'1'                    SPACING FACTOR.                 03748502
          DC    C'R '                   SPACING TYPE.                   03748900
* BLOCK DATA SUBSTRUCTURE.                                              03749300
          DC    X'9000'                 BLOCK DATA EOS FLAGS.           03749400
          DC    H'32767'                MAXIMUM INPUT LENGTH.           03749500
          DC    H'0'                    INPUT OFFSET.                   03749600
          DC    H'1'                    PRINT COLUMN.                   03799600
          DC    H'0'                                                    03809600
          DC    X'0000'                 EBCDIC CONVERSION TYPE.         03819600
* STATIC TEXT ENTRY.                                                    03829600
STE31A    DC    C'RECORD SEQUENCE NUMBER -'                             03839602
STE31B    EQU   *                                                       03841600
TXT3B     EQU   *                                                       03843600
          EJECT                                                         03844000
*                                                                       03845600
* PRINT CHARACTER FORMAT STRUCTURE RBA OF RECORD ENTRY.                 03847600
*                                                                       03848000
TXT4      DC    Y(TXT4B-TXT4A)          LENGTH.                         03848800
FLG4A     DC    X'0000'                 FLAG FIELD.                     03849200
* DOUBLE SPACE SUB-STRUCTURE.                                           03849300
TXT4A     DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       03849400
          DC    H'2'                    DOUBLE SPACE COUNT.             03849500
          DC    C'R '                   RELATIVE SPACE INDICATOR.       03899500
* STATIC TEXT SUB-STRUCTURE.                                            03909500
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE.      03919500
          DC    Y(STE41B-STE41A)        STATIC TEXT LENGTH.             03929500
          DC    Y(STE41A-TXT4A)         STATIC TEXT OFFSET.             03939500
          DC    H'1'                    PRINT COLUMN.                   03941500
          DC    Y(STE41B-STE41A)        PRINT FIELD LENGTH.             03943500
          DC    H'0'                    CONVERSION FLAGS.               03945500
* INSERT DATA SUB-STRUCTURE.                                            03947500
          DC    X'2000'                 INSERT DATA SUB-STRUCTURE.      03947900
          DC    H'1'                    INSERT REFERENCE NUMBER.        03948300
          DC    H'0'                    UNUSED                          03948702
          DC    H'17'                   PRINT COLUMN.                   03949100
          DC    H'0'                    DEFAULT                         03949202
          DC    X'1060'                 CONVERSION FLAG.  (BD,AL,SS)    03949302
* DOUBLE SPACE SUB-STRUCTURE.                                           03949400
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       03999400
          DC    H'1'                    SPACING FACTOR.                 04009402
          DC    C'R '                   SPACING TYPE.                   04019400
* BLOCK DATA SUBSTRUCTURE.                                              04029400
          DC    X'9000'                 BLOCK DATA EOS FLAGS.           04039400
          DC    H'32767'                MAXIMUM INPUT LENGTH.           04041400
          DC    H'0'                    INPUT OFFSET.                   04043400
          DC    H'1'                    PRINT COLUMN.                   04045400
          DC    H'0'                    DEFAULT                         04047402
          DC    X'0000'                 EBCDIC CONVERSION TYPE.         04047800
* STATIC TEXT ENTRY.                                                    04048200
STE41A    DC    C'RBA OF RECORD -'                                      04048600
STE41B    EQU   *                                                       04049000
TXT4B     EQU *                                                         04049100
          EJECT                                                         04051103
*                                                              @Y30DSLO 04051203
* PRINT CHARACTER FORMAT STRUCTURE RELATIVE RECORD ENTRY.      @Y30DSLO 04051303
*                                                              @Y30DSLO 04051403
TXT5      DC    Y(TXT5B-TXT5A)          LENGTH.                @Y30DSLO 04051503
FLG5A     DC    X'0000'                 FLAG FIELD.            @Y30DSLO 04051603
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30DSLO 04051703
TXT5A     DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04051803
          DC    H'2'                    DOUBLE SPACE COUNT.    @Y30DSLO 04051903
          DC    C'R '                   RELATIVE SPACE INDICATOR.       04052003
* STATIC TEXT SUB-STRUCTURE.                                   @Y30DSLO 04052103
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE.      04052203
          DC    Y(STE51B-STE51A)      STATIC TEXT LENGTH.      @Y30DSLO 04052303
          DC    Y(STE51A-TXT5A)       STATIC TEXT OFFSET.      @Y30DSLO 04052403
          DC    H'1'                    PRINT COLUMN.          @Y30DSLO 04052503
          DC    Y(STE51B-STE51A)      PRINT FIELD LENGTH.      @Y30DSLO 04052603
          DC    H'0'                    CONVERSION FLAGS.      @Y30DSLO 04052703
* INSERT DATA SUB-STRUCTURE.                                   @Y30DSLO 04052803
          DC    X'2000'                 INSERT DATA SUB-STRUCTURE.      04052903
          DC    H'1'                    INSERT REFERENCE NUMBER.        04053003
          DC    H'0'                    UNUSED                 @Y30DSLO 04053103
          DC    H'26'                   PRINT COLUMN.          @Y30DSLO 04053203
          DC    H'0'                    DEFAULT                @Y30DSLO 04053303
          DC    X'1060'                 CONVERSION FLAG.  (BD,AL,SS)    04053403
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30DSLO 04053503
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04053603
          DC    H'1'                    SPACING FACTOR.        @Y30DSLO 04053703
          DC    C'R '                   SPACING TYPE.          @Y30DSLO 04053803
* BLOCK DATA SUBSTRUCTURE.                                     @Y30DSLO 04053903
          DC    X'9000'                 BLOCK DATA EOS FLAGS.  @Y30DSLO 04054003
          DC    H'32767'                MAXIMUM INPUT LENGTH.  @Y30DSLO 04054103
          DC    H'0'                    INPUT OFFSET.          @Y30DSLO 04054203
          DC    H'1'                    PRINT COLUMN.          @Y30DSLO 04054303
          DC    H'0'                    DEFAULT                @Y30DSLO 04054403
          DC    X'0000'                 EBCDIC CONVERSION TYPE.         04054503
* STATIC TEXT ENTRY.                                           @Y30DSLO 04054603
STE51A    DC    C'RELATIVE RECORD NUMBER -'                    @Y30DSLO 04054703
STE51B    EQU   *                                              @Y30DSLO 04054803
TXT5B     EQU *                                                @Y30DSLO 04054903
          EJECT                                                @Y30DSLO 04055003
*                                                                       04059403
* PRINT HEX FORMAT STRUCTURE KEY OF RECORD ENTRY.                       04060403
*                                                                       04061403
TXT6      DC    Y(TXT6B-TXT6A)          LENGTH.                         04062403
FLG6A     DC    X'0000'                 FLAG FIELD.                     04063403
* DOUBLE SPACE SUB-STRUCTURE.                                           04064403
TXT6A     DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04065403
          DC    H'2'                    DOUBLE SPACE COUNT.             04066403
          DC    C'R '                   RELATIVE SPACE INDICATOR.       04067403
* STATIC TEXT SUB-STRUCTURE.                                            04068403
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE FLAG. 04069403
          DC    Y(STE61B-STE61A)        STATIC TEXT LENGTH.             04070403
          DC    Y(STE61A-TXT6A)         STATIC TEXT OFFSET.             04071403
          DC    H'1'                    PRINT COLUMN.                   04072403
          DC    Y(STE61B-STE61A)        OUTPUT LENGTH.                  04073403
          DC    H'0'                    CONVERSION FLAGS. (CHAR)        04074403
* INSERT DATA SUB-STRUCTURE.                                            04075403
          DC    X'2000'                 INSERT DATA FLAGS.              04076403
          DC    H'1'                    INSERT REFERENCE NUMBER.        04077403
          DC    H'0'                    UNUSED                          04078403
          DC    H'17'                   PRINT COLUMN.                   04079403
          DC    H'0'                    DEFAULT                         04080403
          DC    X'8000'                 CONVERSION FLAGS. (BH)          04081403
* DOUBLE SPACE SUB-STRUCTURE.                                           04082403
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04083403
          DC    H'1'                    DOUBLE SPACING FACTOR.          04084403
          DC    C'R '                   RELATIVE SPACING TYPE.          04085403
* BLOCK DATA SUB-STRUCTURE.                                             04086403
          DC    X'9000'                 EOF & BLOCK FLAGS.              04087403
          DC    H'32767'                MAXIMUM INPUT LENGTH.           04088403
          DC    H'0'                    INPUT OFFSET.                   04089403
          DC    H'1'                    PRINT COLUMN.                   04090403
          DC    H'0'                    DEFAULT                         04091403
          DC    X'8000'                 CONVERSION FLAGS. (HEX)         04092403
* STATIC TEXT ENTRY.                                                    04093403
STE61A    DC    C'KEY OF RECORD -'                                      04094403
STE61B    EQU   *                                                       04095403
TXT6B     EQU   *                                                       04096403
          EJECT                                                         04097403
*                                                                       04098402
* PRINT HEX FORMAT STRUCTURE RECORD SEQUENCE ENTRY.                     04098703
*                                                                       04099002
TXT7      DC    Y(TXT7B-TXT7A)          LENGTH.                         04099303
FLG7A     DC    X'0000'                 FLAG FIELD.                     04099603
* DOUBLE SPACE SUB-STRUCTURE.                                           04099902
TXT7A     DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04100203
          DC    H'2'                    DOUBLE SPACE COUNT.             04100502
          DC    C'R '                   RELATIVE SPACE INDICATOR.       04100802
* STATIC TEXT SUB-STRUCTURE.                                            04101102
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE FLAG. 04101402
          DC    Y(STE71B-STE71A)        STATIC TEXT LENGTH.             04101703
          DC    Y(STE71A-TXT7A)         STATIC TEXT OFFSET.             04102003
          DC    H'1'                    PRINT COLUMN.                   04102302
          DC    Y(STE71B-STE71A)        OUTPUT LENGTH.                  04102603
          DC    H'0'                    CONVERSION FLAGS. (CHAR)        04102902
* INSERT DATA SUB-STRUCTURE.                                            04103202
          DC    X'2000'                 INSERT DATA FLAGS.              04103502
          DC    H'1'                    INSERT REFERENCE NUMBER.        04103802
          DC    H'0'                    UNUSED                          04104102
          DC    H'26'                   PRINT COLUMN.                   04104403
          DC    H'0'                    DEFAULT                         04104702
          DC    X'1060'                 CONVERSION FLAGS. (BD)          04105003
* DOUBLE SPACE SUB-STRUCTURE.                                           04105302
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04105602
          DC    H'1'                    DOUBLE SPACING FACTOR.          04105902
          DC    C'R '                   RELATIVE SPACING TYPE.          04106202
* BLOCK DATA SUB-STRUCTURE.                                             04106502
          DC    X'9000'                 EOF & BLOCK FLAGS.              04106802
          DC    H'32767'                MAXIMUM INPUT LENGTH.           04107103
          DC    H'0'                    INPUT OFFSET.                   04107402
          DC    H'1'                    PRINT COLUMN.                   04107702
          DC    H'0'                                                    04108002
          DC    X'8000'                 CONVERSION FLAGS. (HEX)         04108302
* STATIC TEXT ENTRY.                                                    04108602
STE71A    DC    C'RECORD SEQUENCE NUMBER -'                             04108903
STE71B    EQU   *                                                       04109203
TXT7B     EQU   *                                                       04109503
          EJECT                                                         04109802
*                                                                       04110102
* PRINT HEX FORMAT STRUCTURE RBA OF RECORD ENTRY.                       04110402
*                                                                       04110702
TXT8      DC    Y(TXT8B-TXT8A)          LENGTH.                         04111003
FLG8A     DC    X'0000'                 FLAG FIELD.                     04111303
* DOUBLE SPACE SUB-STRUCTURE.                                           04111602
TXT8A     DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04111903
          DC    H'2'                    DOUBLE SPACE COUNT.             04112202
          DC    C'R '                   RELATIVE SPACE INDICATOR.       04112502
* STATIC TEXT SUB-STRUCTURE.                                            04112802
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE FLAG. 04113102
          DC    Y(STE81B-STE81A)        STATIC TEXT LENGTH.             04113403
          DC    Y(STE81A-TXT8A)         STATIC TEXT OFFSET.             04113703
          DC    H'1'                    PRINT COLUMN.                   04114002
          DC    Y(STE81B-STE81A)        OUTPUT LENGTH.                  04114303
          DC    H'0'                    CONVERSION FLAGS. (CHAR)        04114602
* INSERT DATA SUB-STRUCTURE.                                            04114902
          DC    X'2000'                 INSERT DATA FLAGS.              04115202
          DC    H'1'                    INSERT REFERENCE NUMBER.        04115502
          DC    H'0'                    UNUSED                          04115802
          DC    H'17'                   PRINT COLUMN.                   04116102
          DC    H'0'                    DEFAULT                         04116402
          DC    X'1060'                 CONVERSION FLAGS. (BD,AL,SS)    04116702
* DOUBLE SPACE SUB-STRUCTURE.                                           04117002
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04117302
          DC    H'1'                    DOUBLE SPACING FACTOR.          04117602
          DC    C'R '                   RELATIVE SPACING TYPE.          04117902
* BLOCK DATA SUB-STRUCTURE.                                             04118202
          DC    X'9000'                 EOF & BLOCK FLAGS.              04118502
          DC    H'32767'                MAXIMUM INPUT LENGTH.           04118802
          DC    H'0'                    INPUT OFFSET.                   04119102
          DC    H'1'                    PRINT COLUMN.                   04119402
          DC    H'0'                                                    04119702
          DC    X'8000'                 CONVERSION FLAGS. (HEX)         04120002
* STATIC TEXT ENTRY.                                                    04120302
STE81A    DC    C'RBA OF RECORD -'                                      04120603
STE81B    EQU   *                                                       04120903
TXT8B     EQU   *                                                       04121203
          EJECT                                                         04121502
*                                                                       04121603
* PRINT HEX FORMAT STRUCTURE RELATIVE RECORD ENTRY.            @Y30DSLO 04121703
*                                                              @Y30DSLO 04121803
TXT9      DC   Y(TXT9B-TXT9A)          LENGTH.                 @Y30DSLO 04121903
FLG9A     DC   X'0000'                 FLAG FIELD.             @Y30DSLO 04122003
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30DSLO 04122103
TXT9A     DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04122203
          DC    H'2'                    DOUBLE SPACE COUNT.    @Y30DSLO 04122303
          DC    C'R '                   RELATIVE SPACE INDICATOR.       04122403
* STATIC TEXT SUB-STRUCTURE.                                   @Y30DSLO 04122503
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE.      04122603
          DC    Y(STE91B-STE91A)      STATIC TEXT LENGTH.      @Y30DSLO 04122703
          DC    Y(STE91A-TXT9A)       STATIC TEXT OFFSET.      @Y30DSLO 04122803
          DC    H'1'                    PRINT COLUMN.          @Y30DSLO 04122903
          DC    Y(STE91B-STE91A)      PRINT FIELD LENGTH.      @Y30DSLO 04123003
          DC    H'0'                    CONVERSION FLAGS.      @Y30DSLO 04123103
* INSERT DATA SUB-STRUCTURE.                                   @Y30DSLO 04123203
          DC    X'2000'                 INSERT DATA SUB-STRUCTURE.      04123303
          DC    H'1'                    INSERT REFERENCE NUMBER.        04123403
          DC    H'0'                    UNUSED                 @Y30DSLO 04123503
          DC    H'26'                   PRINT COLUMN.          @Y30DSLO 04123603
          DC    H'0'                    DEFAULT                @Y30DSLO 04123703
          DC    X'1060'                 CONVERSION FLAG.  (BD,AL,SS)    04123803
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30DSLO 04123903
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04124003
          DC    H'1'                    SPACING FACTOR.        @Y30DSLO 04124103
          DC    C'R '                   SPACING TYPE.          @Y30DSLO 04124203
* BLOCK DATA SUBSTRUCTURE.                                     @Y30DSLO 04124303
          DC    X'9000'                 BLOCK DATA EOS FLAGS.  @Y30DSLO 04124403
          DC    H'32767'                MAXIMUM INPUT LENGTH.  @Y30DSLO 04124503
          DC    H'0'                    INPUT OFFSET.          @Y30DSLO 04124603
          DC    H'1'                    PRINT COLUMN.          @Y30DSLO 04124703
          DC    H'0'                    DEFAULT                @Y30DSLO 04124803
          DC    X'8000'                 CONVERSION FLAGS. (HEX)         04124903
* STATIC TEXT ENTRY.                                           @Y30DSLO 04125003
STE91A    DC    C'RELATIVE RECORD NUMBER -'                    @Y30DSLO 04125103
STE91B    EQU   *                                              @Y30DSLO 04125303
TXT9B     EQU *                                                @Y30DSLO 04125403
          EJECT                                                @Y30DSLO 04125603
*                                                                       04125703
* PRINT DUMP FORMAT STRUCTURE KEY OF RECORD ENTRY.                      04125803
*                                                                       04125903
TXT10     DC    Y(TXT10B-TXT10A)        LENGTH.                         04126003
FLG10A    DC    X'0000'                 FLAG FIELD.                     04126103
* DOUBLE SPACE SUB-STRUCTURE.                                           04126203
TXT10A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04126303
          DC    H'2'                    DOUBLE SPACE COUNT.             04126403
          DC    C'R '                   RELATIVE SPACE INDICATOR.       04126503
* STATIC TEXT SUB-STRUCTURE.                                            04126603
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE FLAG. 04126703
          DC    Y(STE101B-STE101A)        STATIC TEXT LENGTH.           04126803
          DC    Y(STE101A-TXT10A)         STATIC TEXT OFFSET.           04126903
          DC    H'1'                    PRINT COLUMN.                   04127003
          DC    Y(STE101B-STE101A)      OUTPUT LENGTH.                  04127103
          DC    H'0'                    CONVERSION FLAGS. (CHAR)        04127203
* INSERT DATA SUB-STRUCTURE.                                            04127303
          DC    X'2000'                 INSERT DATA FLAGS.              04127403
          DC    H'1'                    INSERT REFERENCE NUMBER.        04127503
          DC    H'0'                    UNUSED                          04127603
          DC    H'17'                   PRINT COLUMN.                   04127802
          DC    H'0'                    DEFAULT                         04128102
          DC    X'8000'                 CONVERSION FLAGS. (BH)          04128403
* DOUBLE SPACE SUB-STRUCTURE.                                           04128702
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04129002
          DC    H'1'                    DOUBLE SPACING FACTOR.          04129302
          DC    C'R '                   RELATIVE SPACING TYPE.          04129602
* BLOCK DATA SUB-STRUCTURE.                                             04129902
          DC    X'9000'                 EOF & BLOCK FLAGS.              04130202
          DC    H'32767'                MAXIMUM INPUT LENGTH.           04130502
          DC    H'0'                    INPUT OFFSET.                   04130802
          DC    H'1'                    PRINT COLUMN.                   04131102
          DC    H'0'                                                    04131402
          DC    X'2000'                 CONVERSION FLAGS. (DUMP)        04131702
* STATIC TEXT ENTRY.                                                    04132002
STE101A   DC    C'KEY OF RECORD -'                                      04132303
STE101B   EQU   *                                                       04132603
TXT10B    EQU   *                                                       04132903
          EJECT                                                         04133202
*                                                                       04133502
* PRINT DUMP FORMAT STRUCTURE RECORD SEQUENCE ENTRY.                    04133803
*                                                                       04134102
TXT11     DC    Y(TXT11B-TXT11A)          LENGTH.                       04134403
FLG11A    DC    X'0000'                 FLAG FIELD.                     04134703
* DOUBLE SPACE SUB-STRUCTURE.                                           04135002
TXT11A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04135303
          DC    H'2'                    DOUBLE SPACE COUNT.             04135602
          DC    C'R '                   RELATIVE SPACE INDICATOR.       04135902
* STATIC TEXT SUB-STRUCTURE.                                            04136202
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE FLAG. 04136502
          DC    Y(STE111B-STE111A)      STATIC TEXT LENGTH.             04136803
          DC    Y(STE111A-TXT11A)       STATIC TEXT OFFSET.             04137103
          DC    H'1'                    PRINT COLUMN.                   04137402
          DC    Y(STE111B-STE111A)      OUTPUT LENGTH.                  04137703
          DC    H'0'                    CONVERSION FLAGS. (CHAR)        04138002
* INSERT DATA SUB-STRUCTURE.                                            04138302
          DC    X'2000'                 INSERT DATA FLAGS.              04138602
          DC    H'1'                    INSERT REFERENCE NUMBER.        04138902
          DC    H'0'                    UNUSED                          04139202
          DC    H'26'                   PRINT COLUMN.                   04139502
          DC    H'0'                    DEFAULT                         04139802
          DC    X'1060'                 CONVERSION FLAGS. (BD,AL,SS)    04140102
* DOUBLE SPACE SUB-STRUCTURE.                                           04140402
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04140702
          DC    H'1'                    DOUBLE SPACING FACTOR.          04141002
          DC    C'R '                   RELATIVE SPACING TYPE.          04141302
* BLOCK DATA SUB-STRUCTURE.                                             04141602
          DC    X'9000'                 EOF & BLOCK FLAGS.              04141902
          DC    H'32767'                MAXIMUM INPUT LENGTH.           04142202
          DC    H'0'                    INPUT OFFSET.                   04142502
          DC    H'1'                    PRINT COLUMN.                   04142802
          DC    H'0'                    DEFAULT                         04143102
          DC    X'2000'                 CONVERSION FLAGS. (DUMP)        04143402
* STATIC TEXT ENTRY.                                                    04143702
STE111A   DC    C'RECORD SEQUENCE NUMBER -'                             04144003
STE111B   EQU   *                                                       04144303
TXT11B    EQU   *                                                       04144603
          EJECT                                                         04144902
*                                                                       04145202
* PRINT DUMP FORMAT STRUCTURE RBA OF RECORD ENTRY.                      04145502
*                                                                       04145802
TXT12     DC    Y(TXT12B-TXT12A)        LENGTH.                         04146103
FLG12A    DC    X'0000'                 FLAG FIELD.                     04146403
* DOUBLE SPACE SUB-STRUCTURE.                                           04146702
TXT12A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04147003
          DC    H'2'                    DOUBLE SPACE COUNT.             04147302
          DC    C'R '                   RELATIVE SPACE INDICATOR.       04147602
* STATIC TEXT SUB-STRUCTURE.                                            04147902
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE FLAG. 04148202
          DC    Y(STE121B-STE121A)      STATIC TEXT LENGTH.             04148503
          DC    Y(STE121A-TXT12A)       STATIC TEXT OFFSET.             04148803
          DC    H'1'                    PRINT COLUMN.                   04149102
          DC    Y(STE121B-STE121A)      OUTPUT LENGTH.                  04149403
          DC    H'0'                    CONVERSION FLAGS. (CHAR)        04149702
* INSERT DATA SUB-STRUCTURE.                                            04150002
          DC    X'2000'                 INSERT DATA FLAGS.              04150302
          DC    H'1'                    INSERT REFERENCE NUMBER.        04150602
          DC    H'0'                    UNUSED                          04150902
          DC    H'17'                   PRINT COLUMN.                   04151202
          DC    H'0'                    DEFAULT                         04151502
          DC    X'1060'                 CONVERSION FLAGS. (BD,AL,SS)    04151803
* DOUBLE SPACE SUB-STRUCTURE.                                           04152102
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04152402
          DC    H'1'                    DOUBLE SPACING FACTOR.          04152702
          DC    C'R '                   RELATIVE SPACING TYPE.          04153002
* BLOCK DATA SUB-STRUCTURE.                                             04153302
          DC    X'9000'                 EOF & BLOCK FLAGS.              04153602
          DC    H'32767'                MAXIMUM INPUT LENGTH.           04153902
          DC    H'0'                    INPUT OFFSET.                   04154202
          DC    H'1'                    PRINT COLUMN.                   04154502
          DC    H'0'                                                    04154802
          DC    X'2000'                 CONVERSION FLAGS. (DUMP)        04155102
* STATIC TEXT ENTRY.                                                    04155402
STE121A   DC    C'RBA OF RECORD -'                                      04155703
STE121B   EQU   *                                                       04156003
TXT12B    EQU   *                                                       04156303
          EJECT                                                         04156602
*                                                              @Y30DSLO 04156703
* PRINT DUMP FORMAT STRUCTURE OF RELATIVE RECORD ENTRY.        @Y30DSLO 04156803
*                                                              @Y30DSLO 04156903
TXT13     DC    Y(TXT13B-TXT13A)        LENGTH.                @Y30DSLO 04157003
FLG13A    DC    X'0000'                 FLAG FIELD.            @Y30DSLO 04157103
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30DSLO 04157203
TXT13A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04157303
          DC    H'2'                    DOUBLE SPACE COUNT.    @Y30DSLO 04157403
          DC    C'R '                   RELATIVE SPACE INDICATOR.       04157503
* STATIC TEXT SUB-STRUCTURE.                                   @Y30DSLO 04157603
          DC    X'0400'                 STATIC TEXT SUB-STRUCTURE FLAG. 04157703
          DC    Y(STE131B-STE131A)      STATIC TEXT LENGTH.    @Y30DSLO 04157803
          DC    Y(STE131A-TXT13A)       STATIC TEXT OFFSET.    @Y30DSLO 04157903
          DC    H'1'                    PRINT COLUMN.          @Y30DSLO 04158003
          DC    Y(STE131B-STE131A)      OUTPUT LENGTH.         @Y30DSLO 04158103
          DC    H'0'                    CONVERSION FLAGS. (CHAR)        04158203
* INSERT DATA SUB-STRUCTURE.                                   @Y30DSLO 04158303
          DC    X'2000'                 INSERT DATA FLAGS.     @Y30DSLO 04158403
          DC    H'1'                    INSERT REFERENCE NUMBER.        04158503
          DC    H'0'                    UNUSED                 @Y30DSLO 04158603
          DC    H'26'                   PRINT COLUMN.          @Y30DSLO 04158703
          DC    H'0'                    DEFAULT                @Y30DSLO 04158803
          DC    X'1060'                 CONVERSION FLAGS. (BD,AL,SS)    04158903
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30DSLO 04159003
          DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04159103
          DC    H'1'                    DOUBLE SPACING FACTOR. @Y30DSLO 04159203
          DC    C'R '                   RELATIVE SPACING TYPE. @Y30DSLO 04159303
* BLOCK DATA SUB-STRUCTURE.                                    @Y30DSLO 04159403
          DC    X'9000'                 EOF & BLOCK FLAGS.     @Y30DSLO 04159503
          DC    H'32767'                MAXIMUM INPUT LENGTH.  @Y30DSLO 04159603
          DC    H'0'                    INPUT OFFSET.          @Y30DSLO 04159703
          DC    H'1'                    PRINT COLUMN.          @Y30DSLO 04159803
          DC    H'0'                                           @Y30DSLO 04159903
          DC    X'2000'                 CONVERSION FLAGS. (DUMP)        04160003
* STATIC TEXT ENTRY.                                           @Y30DSLO 04160103
STE131A   DC    C'RELATIVE RECORD NUMBER -'                    @Y30DSLO 04160203
STE131B   EQU   *                                              @Y30DSLO 04160303
TXT13B    EQU   *                                              @Y30DSLO 04160403
          EJECT                                                @Y30SVLO 04160503
*                                                              @Y30SVLO 04160603
* REPRO INCOMPATIBLE DATA SETS MESSAGE.                        @Y30SVLO 04160703
*                                                              @Y30SVLO 04160803
TXT14     DC  Y(TXT14B-TXT14A)          LENGTH.                @Y30SVLO 04160903
FLG14A    DC  X'8000'                   MESSAGE FLAG.          @Y30SVLO 04161003
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30SVLO 04161103
TXT14A    DC  X'4000'                   SPACE SUB-STRUCTURE FLAG.       04161203
          DC  H'2'                      SPACING FACTOR.        @Y30SVLO 04161303
          DC  C'R '                     SPACING TYPE.          @Y30SVLO 04161403
* STATIC TEXT SUB-STRUCTURE.                                   @Y30SVLO 04161503
          DC  X'8400'                   EOF AND STATIC FLAGS.  @Y30SVLO 04161603
          DC  Y(STE141B-STE141A)        STATIC TEXT LENGTH.    @Y30SVLO 04161703
          DC  Y(STE141A-TXT14A)         STATIC TEXT OFFSET.    @Y30SVLO 04161803
          DC  H'1'                      PRINT COLUMN.          @Y30SVLO 04161903
          DC  Y(STE141B-STE141A)        PRINT FIELD LENGTH.    @Y30SVLO 04162003
          DC  H'0'                      CONVERSION FLAGS (CHAR)         04162103
* STATIC TEXT ENTRY.                                           @Y30SVLO 04162203
STE141A   DC  C'IDC3582I INPUT DATA SET ORGANIZATION'          @Y30SVLO 04162303
          DC  C' INCOMPATIBLE WITH OUTPUT DATA SET'            @Y30SVLO 04162403
STE141B   EQU *                                                @Y30SVLO 04162503
TXT14B    EQU *                                                @Y30SVLO 04162603
          EJECT                                                @Y30DSLO 04162803
          EJECT                                                         04448302
*                                                              @Y30LSEC 04448402
* ENTRY 15 IS NULL                                             @Y30LSEC 04448502
*                                                              @Y30SVLO 04449003
          EJECT                                                         04449103
*                                                                       04449203
* COPY CATALOG DELIMITERS SPECIFIED ERROR                      @Y30LSEC 04449303
*                                                              @Y30LSEC 04449403
TXT16     DC    Y(TXT16B-TXT16A)        LENGTH                 @Y30LSEC 04449503
FLG16A    DC    X'8000'                 MESSAGE FLAG.          @Y30LSEC 04449603
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30LSEC 04449703
TXT16A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       04449803
          DC    H'2'                    DOUBLE SPACE COUNT.    @Y30LSEC 04449903
          DC    C'R '                   SPACING TYPE INDICATOR.         04450003
* STATIC TEXT SUB-STRUCTURE.                                   @Y30LSEC 04450103
          DC    X'8400'                 EOF AND STATIC FLAGS.  @Y30LSEC 04450203
          DC    Y(STE161B-STE161A)      STATIC TEXT LENGTH.    @Y30LSEC 04450303
          DC    Y(STE161A-TXT16A)       STATIC TEXT OFFSET.    @Y30LSEC 04450403
          DC    H'1'                    PRINT COLUMN.          @Y30LSEC 04450503
          DC    Y(STE161B-STE161A)      PRINT FIELD LENGTH.    @Y30LSEC 04450603
          DC    H'0'                    CONVERSION FLAGS  (CHAR)        04450703
* STATIC TEXT ENTRY.                                           @Y30LSEC 04450803
STE161A   DC    C'IDC3581I REPRO OF CATALOGS CANNOT SPECIFY DELIMITERS' 04450903
STE161B   EQU   *                                              @Y30LSEC 04451103
TXT16B    EQU   *                                              @Y30LSEC 04451203
          EJECT                                                         04794702
*                                                                       04794803
* INVALID BEGINNING/ENDING DELIMITER.                          @Y30DSLO 04894703
*                                                              @Y30DSLO 04944703
TXT17     DC   Y(TXT17B-TXT17A)         LENGTH                 @Y30DSLO 04994703
FLG17A    DC   X'8000'                  MESSAGE FLAG.          @Y30DSLO 05044703
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30DSLO 05094703
TXT17A    DC   X'4000'                  SPACE SUB-STRUCTURE FLAG.       05144703
          DC   H'2'                     DOUBLE SPACING FACTOR. @Y30DSLO 05194703
          DC   C'R '                    RELATIVE SPACING TYPE. @Y30DSLO 05244703
* STATIC TEXT SUB-STRUCTURE.                                   @Y30DSLO 05294703
          DC   X'0400'                  STATIC TEXT SUB-STRUCTURE.      05344703
          DC   Y(STE171B-STE171A)       STATIC TEXT LENGTH.    @Y30DSLO 05394703
          DC   Y(STE171A-TXT17A)        STATIC TEXT OFFSET.    @Y30DSLO 05444703
          DC   H'1'                     PRINT COLUMN.          @Y30DSLO 05494703
          DC   Y(STE171B-STE171A)       OUTPUT LENGTH.         @Y30DSLO 05544703
          DC   H'0'                     CONVERSION FLAGS.      @Y30DSLO 05594703
* INSERT DATA SUB-STRUCTURE.                                   @Y30DSLO 05644703
          DC   X'2000'                  INSERT DATA FLAGS.     @Y30DSLO 05694703
          DC   H'1'                     INSERT REFERENCE NUMBER.        05744703
          DC   H'0'                     UNUSED                 @Y30DSLO 05794703
          DC   H'11'                    PRINT COLUMN           @Y30DSLO 05844703
          DC   H'11'                    OUTPUT FIELD LENGTH.   @Y30DSLO 05894703
          DC   H'0'                     CONVERSION FLAGS.      @Y30DSLO 05944703
* STATIC TEXT SUB-STRUCTURE.                                   @Y30DSLO 05994703
          DC   X'8400'                  STATIC TEXT & EOF FLAGS.        06044703
          DC   Y(STE172B-STE172A)       STATIC TEXT LENGTH.    @Y30DSLO 06094703
          DC   Y(STE172A-TXT17A)        STATIC TEXT OFFSET.    @Y30DSLO 06144703
          DC   H'0'                     PRINT COLUMN.          @Y30DSLO 06194703
          DC   Y(STE172B-STE172A)       OUTPUT LENGTH.         @Y30DSLO 06244703
          DC   X'0010'                  CONVERSION FLAGS.      @Y30DSLO 06294703
* STATIC TEXT ENTRY.                                           @Y30DSLO 06344703
STE171A   DC   C'IDC3583I '''                                  @Y30DSLO 06394703
STE171B   EQU  *                                               @Y30DSLO 06444703
STE172A   DC   C''' INCOMPATIBLE WITH INFILE DATA SET TYPE'    @Y30DSLO 06494703
STE172B   EQU  *                                               @Y30DSLO 06544703
TXT17B    EQU  *                                               @Y30DSLO 06594703
          EJECT                                                         06644703
*                                                              @YA04583 11149002
* REPRO FSR CATALOG RELOAD DELIMITER SPEC ERROR                @YA04583 11199002
*                                                              @YA04583 11249002
TXT18     DC    Y(TXT18B-TXT18A)        LENGTH                 @YA04583 11299002
FLG18A    DC    X'8000'                 MESSAGE FLAG.          @YA04583 11349002
* DOUBLE SPACE SUB-STRUCTURE.                                  @YA04583 11399002
TXT18A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       11449002
          DC    H'2'                    DOUBLE SPACE COUNT.    @YA04583 11499002
          DC    C'R '                   SPACING TYPE INDICATOR.         11549002
* STATIC TEXT SUB-STRUCTURE.                                   @YA04583 11599002
          DC    X'8400'                 EOF AND STATIC FLAGS.  @YA04583 11649002
          DC    Y(STE181B-STE181A)      STATIC TEXT LENGTH.    @YA04583 11699002
          DC    Y(STE181A-TXT18A)       STATIC TEXT OFFSET.    @YA04583 11749002
          DC    H'1'                    PRINT COLUMN.          @YA04583 11799002
          DC    Y(STE181B-STE181A)      PRINT FIELD LENGTH.    @YA04583 11849002
          DC    H'0'                    CONVERSION FLAGS  (CHAR)        11899002
* STATIC TEXT ENTRY.                                           @YA04583 11949002
STE181A   DC    C'IDC3570I DELIMITERS MUST NOT BE SPECIFIED'   @YA04583 11999002
          DC    C' WHEN RELOADING A CATALOG'                   @YA04583 12049002
STE181B   EQU   *                                              @YA04583 12099002
TXT18B    EQU   *                                              @YA04583 12149002
          EJECT                                                @YA04583 12199002
*                                                              @YA04583 12249002
* REPRO FSR SUCCESSFUL INITIATION MESSAGE.                     @YA04583 12299002
*                                                              @YA04583 12349002
TXT19     DC    Y(TXT19B-TXT19A)        LENGTH                 @YA04583 12399002
FLG19A    DC    X'8000'                 MESSAGE FLAG.          @YA04583 12449002
* DOUBLE SPACE SUB-STRUCTURE.                                  @YA04583 12499002
TXT19A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       12549002
          DC    H'2'                    DOUBLE SPACE COUNT.    @YA04583 12599002
          DC    C'R '                   SPACING TYPE INDICATOR.         12649002
* STATIC TEXT SUB-STRUCTURE.                                   @YA04583 12699002
          DC    X'8400'                 EOF AND STATIC FLAGS.  @YA04583 12749002
          DC    Y(STE191B-STE191A)      STATIC TEXT LENGTH.    @YA04583 12799002
          DC    Y(STE191A-TXT19A)       STATIC TEXT OFFSET.    @YA04583 12849002
          DC    H'1'                    PRINT COLUMN.          @YA04583 12899002
          DC    Y(STE191B-STE191A)      PRINT FIELD LENGTH.    @YA04583 12949002
          DC    H'0'                    CONVERSION FLAGS  (CHAR)        12999002
* STATIC TEXT ENTRY.                                           @YA04583 13049002
STE191A   DC    C'IDC0571I CATALOG RELOAD HAS BEEN INVOKED'    @YA04583 13099002
STE191B   EQU   *                                              @YA04583 13149002
TXT19B    EQU   *                                              @YA04583 13199002
          EJECT                                                @YA04583 13249002
*                                                              @YA04583 13299002
* REPRO FSR CATALOG SIZE MESSAGE                               @YA04583 13349002
*                                                              @YA04583 13399002
TXT20     DC    Y(TXT20B-TXT20A)        LENGTH                 @YA04583 13449002
FLG20A    DC    X'8000'                 MESSAGE FLAG.          @YA04583 13499002
* DOUBLE SPACE SUB-STRUCTURE.                                  @YA04583 13549002
TXT20A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       13599002
          DC    H'2'                    DOUBLE SPACE COUNT.    @YA04583 13649002
          DC    C'R '                   SPACING TYPE INDICATOR.         13699002
* STATIC TEXT SUB-STRUCTURE.                                   @YA04583 13749002
          DC    X'8400'                 EOF AND STATIC FLAGS.  @YA04583 13799002
          DC    Y(STE201B-STE201A)      STATIC TEXT LENGTH.    @YA04583 13849002
          DC    Y(STE201A-TXT20A)       STATIC TEXT OFFSET.    @YA04583 13899002
          DC    H'1'                    PRINT COLUMN.          @YA04583 13949002
          DC    Y(STE201B-STE201A)      PRINT FIELD LENGTH.    @YA04583 13999002
          DC    H'0'                    CONVERSION FLAGS  (CHAR)        14049002
* STATIC TEXT ENTRY.                                           @YA04583 14099002
STE201A   DC    C'IDC3572I TARGET CATALOG IS TO SMALL TO CONTAIN TH'    14149002
          DC    C'E BACKUP CATALOG'                            @YA04583 14199002
STE201B   EQU   *                                              @YA04583 14249002
TXT20B    EQU   *                                              @YA04583 14299002
          EJECT                                                @YA04583 14349002
*                                                              @YA04583 14399002
* REPRO FSR CATALOG AGREEMENT MESSAGE                          @YA04583 14449002
*                                                              @YA04583 14499002
TXT21     DC    Y(TXT21B-TXT21A)        LENGTH                 @YA04583 14549002
FLG21A    DC    X'8000'                 MESSAGE FLAG.          @YA04583 14599002
* DOUBLE SPACE SUB-STRUCTURE.                                  @YA04583 14649002
TXT21A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       14699002
          DC    H'2'                    DOUBLE SPACE COUNT.    @YA04583 14749002
          DC    C'R '                   SPACING TYPE INDICATOR.         14799002
* STATIC TEXT SUB-STRUCTURE.                                   @YA04583 14849002
          DC    X'0400'                 STATIC FLAGS.          @Y30SSEC 14899002
          DC    Y(STE211B-STE211A)      STATIC TEXT LENGTH.    @YA04583 14949002
          DC    Y(STE211A-TXT21A)       STATIC TEXT OFFSET.    @YA04583 14999002
          DC    H'1'                    PRINT COLUMN.          @YA04583 15049002
          DC    Y(STE211B-STE211A)      PRINT FIELD LENGTH.    @YA04583 15099002
          DC    H'0'                    CONVERSION FLAGS  (CHAR)        15149002
* BLOCK DATA SUB-STRUCTURE.                                    @Y30LSEC 15151002
          DC    X'1000'                 BLOCK FLAGS.           @Y30LSEC 15153002
          DC    H'6'                    BLOCK DATA LENGTH      @Y30LSEC 15155002
          DC    H'0'                    INPUT OFFSET.          @Y30LSEC 15157002
          DC    H'10'                   PRINT COLUMN.          @Y30LSEC 15157402
          DC    H'6'                    PRINT FIELD LENGTH     @Y30LSEC 15157802
          DC    H'0'                    CONVERSION FLAGS(CHAR) @Y30LSEC 15158202
* STATIC TEXT SUB-STRUCTURE.                                   @Y30LSEC 15159002
          DC    X'8400'                 STATIC FLAGS.          @Y30LSEC 15179002
          DC    Y(STE212B-STE212A)      STATIC TEXT LENGTH.    @Y30LSEC 15181002
          DC    Y(STE212A-TXT21A)       STATIC TEXT OFFSET.    @Y30LSEC 15189002
          DC    H'1'                    PRINT COLUMN OFFSET.   @Y30LSEC 15191002
          DC    Y(STE212B-STE212A)      PRINT FIELD LENGTH.    @Y30LSEC 15193002
          DC    X'0010'                 CONVERSION FLAGS  (CHAR,BS)     15195003
* STATIC TEXT ENTRY.                                           @YA04583 15199002
STE211A   DC    C'IDC3573I '                                   @Y30LSEC 15249002
STE211B   EQU   *                                              @Y30LSEC 15259002
STE212A   DC    C' OF BACKUP AND TARGET CATALOG DO NOT AGREE'  @Y30LSEC 15299002
STE212B   EQU   *                                              @Y30LSEC 15349002
TXT21B    EQU   *                                              @YA04583 15399002
          EJECT                                                @YA04583 15449002
*                                                              @YA04583 15499002
* REPRO FSR COMPARE FUNCTION TERMINATION MESSAGE               @YA04583 15549002
*                                                              @YA04583 15599002
TXT22     DC    Y(TXT22B-TXT22A)        LENGTH                 @YA04583 15649002
FLG22A    DC    X'8000'                 MESSAGE FLAG.          @YA04583 15699002
* DOUBLE SPACE SUB-STRUCTURE.                                  @YA04583 15749002
TXT22A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       15799002
          DC    H'1'                    SINGLE SPACE COUNT.    @YA04583 15849002
          DC    C'R '                   SPACING TYPE INDICATOR.         15899002
* STATIC TEXT SUB-STRUCTURE.                                   @YA04583 15949002
          DC    X'8400'                 EOF AND STATIC FLAGS.  @YA04583 15999002
          DC    Y(STE221B-STE221A)      STATIC TEXT LENGTH.    @YA04583 16049002
          DC    Y(STE221A-TXT22A)       STATIC TEXT OFFSET.    @YA04583 16099002
          DC    H'1'                    PRINT COLUMN.          @YA04583 16149002
          DC    Y(STE221B-STE221A)      PRINT FIELD LENGTH.    @YA04583 16199002
          DC    H'0'                    CONVERSION FLAGS  (CHAR)        16249002
* STATIC TEXT ENTRY.                                           @YA04583 16299002
STE221A   DC    C'IDC1574I CATALOG ENTRY COMPARISO'            @YA04583 16349002
          DC    C'N NO LONGER FUNCTIONING'                     @YA04583 16399002
STE221B   EQU   *                                              @YA04583 16449002
TXT22B    EQU   *                                              @YA04583 16499002
          EJECT                                                @YA04583 16549002
*                                                              @YA04583 16599002
* REPRO FSR TRUENAME COMPARISON MESSAGE                        @YA04583 16649002
*                                                              @YA04583 16699002
TXT23     DC    Y(TXT23B-TXT23A)        LENGTH                 @YA04583 16749002
FLG23A    DC    X'8000'                 MESSAGE FLAG.          @YA04583 16799002
* DOUBLE SPACE SUB-STRUCTURE.                                  @YA04583 16849002
TXT23A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       16899002
          DC    H'1'                    SINGLE SPACE COUNT.    @YA04583 16949002
          DC    C'R '                   SPACING TYPE INDICATOR.         16999002
* STATIC TEXT SUB-STRUCTURE.                                   @YA04583 17049002
          DC    X'0400'                 EOF AND STATIC FLAGS.  @YA04583 17099002
          DC    Y(STE231B-STE231A)      STATIC TEXT LENGTH.    @YA04583 17149002
          DC    Y(STE231A-TXT23A)       STATIC TEXT OFFSET.    @YA04583 17199002
          DC    H'1'                    PRINT COLUMN.          @YA04583 17249002
          DC    Y(STE231B-STE231A)      PRINT FIELD LENGTH.    @YA04583 17299002
          DC    H'0'                    CONVERSION FLAGS  (CHAR)        17349002
*                                                              @YA04583 17399002
*INSERT DATA SUB STRUCTURE                                     @YA04583 17449002
*                                                              @YA04583 17499002
          DC    X'2000'                 INSERT DATA FLAGS      @YA04583 17549002
          DC    H'1'                    INSERT REFERENCE       @YA04583 17599002
          DC    H'0'                    UNUSED                 @YA04583 17649002
          DC    H'31'                   PRINT COLUMN           @YA04583 17699002
          DC    H'0'                    DEFAULT                @YA04583 17749002
          DC    X'0000'                 CONVERSION FLAGS       @YA04583 17799002
*                                                              @YA04583 17849002
*INSERT DATA SUB STRUCTURE                                     @YA04583 17899002
*                                                              @YA04583 17949002
          DC    X'A000'                 INSERT DATA FLAGS      @YA04583 17999002
          DC    H'2'                    INSERT REFERENCE       @YA04583 18049002
          DC    H'0'                    UNUSED                 @YA04583 18099002
          DC    H'15'                   PRINT COLUMN           @YA04583 18149002
          DC    H'0'                    DEFAULT                @YA04583 18199002
          DC    X'0000'                 CONVERSION FLAGS       @YA04583 18249002
* STATIC TEXT ENTRY.                                           @YA04583 18299002
STE231A   DC    C'IDC1575I ONLY XXXXXX DEFINES'                @YA04583 18349002
STE231B   EQU   *                                              @YA04583 18399002
TXT23B    EQU   *                                              @YA04583 18449002
          EJECT                                                @Y30SSEC 18451003
*                                                              @Y30SSEC 18453003
* REPRO CATALOG COPY FUNCTION TERMINATION MESSAGE              @Y30SSEC 18455003
*                                                              @Y30SSEC 18457003
TXT24     DC    Y(TXT24B-TXT24A)        LENGTH                 @Y30SSEC 18457403
FLG24A    DC    X'8000'                 MESSAGE FLAG.          @Y30SSEC 18457503
* DOUBLE SPACE SUB-STRUCTURE.                                  @Y30SSEC 18457603
TXT24A    DC    X'4000'                 SPACE SUB-STRUCTURE FLAG.       18507603
          DC    H'1'                    SINGLE SPACE COUNT.    @Y30SSEC 18517603
          DC    C'R '                   SPACING TYPE INDICATOR.         18527603
* STATIC TEXT SUB-STRUCTURE.                                   @Y30SSEC 18537603
          DC    X'8400'                 EOF AND STATIC FLAGS.  @Y30SSEC 18547603
          DC    Y(STE241B-STE241A)      STATIC TEXT LENGTH.    @Y30SSEC 18549603
          DC    Y(STE241A-TXT24A)       STATIC TEXT OFFSET.    @Y30SSEC 18551603
          DC    H'1'                    PRINT COLUMN.          @Y30SSEC 18553603
          DC    Y(STE241B-STE241A)      PRINT FIELD LENGTH.    @Y30SSEC 18555603
          DC    H'0'                    CONVERSION FLAGS  (CHAR)        18556003
* STATIC TEXT ENTRY.                                           @Y30SSEC 18556403
STE241A   DC    C'IDC3584I RECOVERABLE CATALOGS CAN NOT BE '   @Y30SSEC 18556803
          DC    C'COPIED.'                                     @Y30SSEC 18557203
STE241B   EQU   *                                              @Y30SSEC 18657203
TXT24B    EQU   *                                              @Y30SSEC 18707203
          END                                                           18757203
