         TITLE '***** IDCTSLD0 - LISTDSET STATIC TEXT *****'            00050003
* /* START OF SPECIFICATIONS ****                                       00060003
*01* PROCESSOR = ASSEM                                                  00062003
**** END OF SPECIFICATIONS****                                          00064003
************************************************************** @Z40LB26 00200003
*                                                            * @Z40LB26 00250003
* MODULE NAME - IDCTSLD0                                     * @Z40LB26 00300003
*                                                            * @Z40LB26 00310003
* DESCRIPTIVE NAME - VS/2 STATIC TEXT MODULE FOR LISTDSET    * @G24LB31 00350042
*                                                            * @Z40LB26 00360003
* COPYRIGHT - NONE                                           * @Z40LB26 00400003
*                                                            * @Z40LB26 00430003
* STATUS - MSS RELEASE 3, CHANGE LEVEL = 3                   * @ZA29215 00450000
*                                                            * @Z40LB26 00460003
* FUNCTION - CONTAINS NO EXECUTABLE CODE - ONLY STATIC TEXT  * @Z40LB26 00500003
*        ENTRIES FOR THE LISTDSET FUNCTION                   * @Z40LB26 00550003
*                                                            * @Z40LB26 00560003
* NOTES - THIS MODULE IS LOADED BY IDCTP05 WHEN A STATIC     * @Z40LB26 00600003
*        TEXT REQUEST IS MADE                                * @Z40LB26 00650003
*                                                            * @Z40LB26 00660003
* DEPENDENCIES - NONE                                        * @Z40LB26 00700003
*                                                            * @Z40LB26 00710003
* RESTRICTIONS - NONE                                        * @Z40LB26 00750003
*                                                            * @Z40LB26 00760003
* REGISTER CONVENTIONS - NA                                  * @Z40LB26 00800003
*                                                            * @Z40LB26 00850003
* PATCH AREA - NA                                            * @Z40LB26 00900003
*                                                            * @Z40LB26 00910003
* MODULE TYPE - TABLES                                       * @Z40LB26 00950003
*                                                            * @Z40LB26 00960003
* PROCESSOR - ASSEMBLER                                      * @Z40LB26 01000003
*                                                            * @Z40LB26 01010003
* MODULE SIZE - 4352 DECIMAL BYTES                           * @G24LB31 01050042
*                                                            * @Z40LB26 01060003
* ATTRIBUTES - READ ONLY                                     * @Z40LB26 01100003
*                                                            * @Z40LB26 01110003
* CHANGE ACTIVITY -                                          * @Z40LB26 01150003
*   01 04/05/76 - RACF D.S. PROTECTION INFO IN STATUS REPORT * @G24LB31 01152042
*   02 08/11/76 - @G24LB31 CHANGE OFFSET IN USAGE RPT        * @ZM44011 01154042
*   03 01/30/78 - FIX FOR FREE SPACE IN USAGE REPORT         * @ZA29215 01157000
*                                                            * @Z40LB26 01160003
************************************************************** @Z40LB26 01200003
         EJECT                                                 @Z40LB26 01250003
IDCTSLD0 CSECT                                                 @Z40LB26 01300003
************************************************************** @Z40LB26 01350003
*                                                            * @Z40LB26 01400003
*  THIS SECTION CONTAINS THE INDICES TO ADDRESS THE TEXT     * @Z40LB26 01450003
*  ENTRIES                                                   * @Z40LB26 01500003
*                                                            * @Z40LB26 01550003
************************************************************** @Z40LB26 01600003
INDEX    DC    Y((INDEXEND-INDEX1)/2)  COUNT OF ENTRIES        @Z40LB26 01650003
INDEX1   DC    Y(TXT01-INDEX)          USAGE RTP VOL SUBTITLE  @Z40LB26 01700003
INDEX2   DC    Y(TXT02-INDEX)          USAGE RPT GRP SUBTITLE  @Z40LB26 01750003
INDEX3   DC    Y(TXT03-INDEX)          STATUS RPT VOL SUBTITLE @Z40LB26 01900003
INDEX4   DC    Y(TXT04-INDEX)          STATUS RPT GRP SUBTITLE @Z40LB26 01950003
INDEX5   DC    Y(TXT05-INDEX)          GRP OWNER-ADDR LINES    @Z40LB26 02000003
INDEX6   DC    Y(TXT06-INDEX)          USAGE RPT DATA LINES    @Z40LB26 02050003
INDEX7   DC    Y(TXT07-INDEX)          STATUS RPT DATA LINES   @Z40LB26 02100003
INDEX8   DC    Y(TXT08-INDEX)          USAGE RPT SUMMARY LINES @Z40LB26 02150003
INDEX9   DC    Y(TXT09-INDEX)          STATUS RPT SUMMARY LINE @Z40LB26 02200003
INDEX10  DC    Y(TXT10-INDEX)          USAGE RPT LEGEND LINES  @Z40LB26 02250003
INDEX11  DC    Y(TXT11-INDEX)          STATUS RPT LEGEND LINES @Z40LB26 02300003
INDEX12  DC    Y(TXT12-INDEX)          PRINT CONSTANTS         @Z40LB26 02450003
*                                      USED AS INSERT          @Z40LB26 02450403
INDEX13  DC    Y(TXT13-INDEX)          SUB-TITLE LINE FOR      @Z40LB26 02452403
*                                      LEGENDS                 @Z40LB26 02460403
INDEXEND DS    0H                                              @Z40LB26 02480003
         EJECT                                                 @Z40LB26 02500003
************************************************************** @Z40LB26 02550003
*                                                            * @Z40LB26 02600003
*  USAGE REPORT - VOLUME SUBTITLE                            * @Z40LB26 02650003
*                                                            * @Z40LB26 02700003
************************************************************** @Z40LB26 02750003
TXT01    DC    Y(TXT01B-TXT01A)        ENTRY LENGTH            @Z40LB26 02800003
         DC    X'0000'                 FLAGS                   @Z40LB26 02850003
         SPACE 1                                               @Z40LB26 02900003
************************************************************** @Z40LB26 02950003
*                                                            * @Z40LB26 03000003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 03050003
*                                                            * @Z40LB26 03100003
************************************************************** @Z40LB26 03150003
TXT01A   DC    X'8400'                 STATIC TEXT FLAG        @Z40LB26 03200003
         DC    Y(STE01B-STE01A)        TEXT LENGTH             @Z40LB26 03250003
         DC    Y(STE01A-TXT01A)        TEXT OFFSET             @Z40LB26 03300003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 03350003
         DC    Y(STE01B-STE01A)        PRINT FIELD LENGTH      @Z40LB26 03450003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 03454003
************************************************************** @Z40LB26 03460003
*                                                            * @Z40LB26 03470003
*  STATIC TEXT ENTRY                                         * @Z40LB26 03480003
*                                                            * @Z40LB26 03490003
************************************************************** @Z40LB26 03492003
STE01A   DC    C'0'                    SPACE ONE LINE          @Z40LB26 03492403
         DC    C'               NON VSAM SPACE USAGE REPORT'   @Z40LB26 03494003
         DC    C' FOR VOLUME       '                           @Z40LB26 03494803
STE01B   EQU   *                                               @Z40LB26 03496003
TXT01B   EQU   *                                               @Z40LB26 03498003
         EJECT                                                 @Z40LB26 03498403
************************************************************** @Z40LB26 03498803
*                                                            * @Z40LB26 03499203
*  USAGE REPORT - GROUP SUBTITLE                             * @Z40LB26 03499603
*                                                            * @Z40LB26 03499703
************************************************************** @Z40LB26 03499803
TXT02    DC    Y(TXT02B-TXT02A)        ENTRY LENGTH            @Z40LB26 03499903
         DC    X'0000'                 FLAGS                   @Z40LB26 03516603
         SPACE 1                                               @Z40LB26 03533303
************************************************************** @Z40LB26 03550003
*                                                            * @Z40LB26 03560003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 03570003
*                                                            * @Z40LB26 03600003
************************************************************** @Z40LB26 03650003
TXT02A   DC    X'8400'                 STATIC TEXT FLAG        @Z40LB26 03700003
         DC    Y(STE02B-STE02A)        TEXT LENGTH             @Z40LB26 03750003
         DC    Y(STE02A-TXT02A)        TEXT OFFSET             @Z40LB26 03800003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 03850003
         DC    Y(STE02B-STE02A)        PRINT FIELD LENGTH      @Z40LB26 03900003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 03950003
************************************************************** @Z40LB26 04000003
*                                                            * @Z40LB26 04010003
*  STATIC TEXT ENTRY                                         * @Z40LB26 04020003
*                                                            * @Z40LB26 04050003
************************************************************** @Z40LB26 04100003
STE02A   DC    C'0'                    SKIP ONE LINE           @Z40LB26 04150003
         DC    C'        NON VSAM SPACE USAGE REPORT'          @Z40LB26 04220003
         DC    C' FOR GROUP          - VOLUME       '          @Z40LB26 04230003
STE02B   EQU   *                                               @Z40LB26 04250003
TXT02B   EQU   *                                               @Z40LB26 04300003
         EJECT                                                 @Z40LB26 04350003
************************************************************** @Z40LB26 04450003
*                                                            * @Z40LB26 04460003
*  STATUS REPORT - VOLUME SUBTITLE                           * @Z40LB26 04470003
*                                                            * @Z40LB26 04500003
************************************************************** @Z40LB26 04550003
TXT03    DC    Y(TXT03B-TXT03A)        ENTRY LENGTH            @Z40LB26 04600003
         DC    X'0000'                 FLAGS                   @Z40LB26 04650003
         SPACE 1                                               @Z40LB26 04700003
************************************************************** @Z40LB26 04750003
*                                                            * @Z40LB26 04800003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 04850003
*                                                            * @Z40LB26 04900003
************************************************************** @Z40LB26 04950003
TXT03A   DC    X'8400'                 STATIC TEXT FLAG        @Z40LB26 05000003
         DC    Y(STE03B-STE03A)        TEXT LENGTH             @Z40LB26 05050003
         DC    Y(STE03A-TXT03A)        TEXT OFFSET             @Z40LB26 05100003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 05150003
         DC    Y(STE03B-STE03A)        PRINT FIELD LENGTH      @Z40LB26 05200003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 05210003
************************************************************** @Z40LB26 05250003
*                                                            * @Z40LB26 05300003
*  STATIC TEXT ENTRY                                         * @Z40LB26 05350003
*                                                            * @Z40LB26 05420003
************************************************************** @Z40LB26 05450003
STE03A   DC    C'0'                    SPACE ONE LINE          @Z40LB26 05500003
         DC    C'                  NON VSAM STATUS REPORT'     @Z40LB26 05510003
         DC    C' FOR VOLUME       '                           @Z40LB26 05520003
STE03B   EQU   *                                               @Z40LB26 05550003
TXT03B   EQU   *                                               @Z40LB26 05600003
         EJECT                                                 @Z40LB26 05650003
************************************************************** @Z40LB26 05750003
*                                                            * @Z40LB26 05760003
*  STATUS REPORT - GROUP SUBTITLE                            * @Z40LB26 05770003
*                                                            * @Z40LB26 05800003
************************************************************** @Z40LB26 05850003
TXT04    DC    Y(TXT04B-TXT04A)        ENTRY LENGTH            @Z40LB26 05900003
         DC    X'0000'                 FLAGS                   @Z40LB26 05950003
         SPACE 1                                               @Z40LB26 06000003
************************************************************** @Z40LB26 06100003
*                                                            * @Z40LB26 06110003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 06120003
*                                                            * @Z40LB26 06150003
************************************************************** @Z40LB26 06200003
TXT04A   DC    X'8400'                 STATIC TEXT FLAG        @Z40LB26 06250003
         DC    Y(STE04B-STE04A)        TEXT LENGTH             @Z40LB26 06300003
         DC    Y(STE04A-TXT04A)        TEXT OFFSET             @Z40LB26 06350003
         DC    H'1'                    PRINT LOCATION          @Z40LB26 06410003
         DC    Y(STE04B-STE04A)        PRINT FIELD LENGTH      @Z40LB26 06450003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 06500003
************************************************************** @Z40LB26 06550003
*                                                            * @Z40LB26 06560003
*  STATIC TEXT ENTRY                                         * @Z40LB26 06570003
*                                                            * @Z40LB26 06600003
************************************************************** @Z40LB26 06650003
STE04A   DC    C'0'                    SPACE ONE LINE          @Z40LB26 06700003
         DC    C'          NON VSAM STATUS REPORT FOR GROUP'   @Z40LB26 06800003
         DC    C'          - VOLUME       '                    @Z40LB26 06810003
STE04B   EQU   *                                               @Z40LB26 06850003
TXT04B   EQU   *                                               @Z40LB26 06900003
         EJECT                                                 @Z40LB26 06950003
************************************************************** @Z40LB26 07050003
*                                                            * @Z40LB26 07100003
*  OWNER & ADDRESS LINES FOR GROUP REPORT                    * @Z40LB26 07150003
*                                                            * @Z40LB26 07250003
************************************************************** @Z40LB26 07300003
TXT05    DC    Y(TXT05B-TXT05A)        ENTRY LENGTH            @Z40LB26 07350003
         DC    X'0000'                 FLAGS                   @Z40LB26 07400003
         SPACE 1                                               @Z40LB26 07450003
************************************************************** @Z40LB26 07550003
*                                                            * @Z40LB26 07560003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 07570003
*                                                            * @Z40LB26 07600003
************************************************************** @Z40LB26 07650003
TXT05A   DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 07700003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 07750003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 07800003
************************************************************** @Z40LB26 07850003
*                                                            * @Z40LB26 07900003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 07950003
*                                                            * @Z40LB26 08000003
************************************************************** @Z40LB26 08050003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 08100003
         DC    Y(STE05B-STE05A)        TEXT LENGTH             @Z40LB26 08150003
         DC    Y(STE05A-TXT05A)        TEXT OFFSET             @Z40LB26 08200003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 08250003
         DC    Y(STE05B-STE05A)        PRINT FIELD LENGTH      @Z40LB26 08300003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 08310003
************************************************************** @Z40LB26 08350003
*                                                            * @Z40LB26 08400003
*  INSERT DATA SUB-STRUCTURE - GROUP OWNER NAME              * @Z40LB26 08450003
*                                                            * @Z40LB26 08500003
************************************************************** @Z40LB26 08550003
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB26 08600003
         DC    H'10'                   INSERT REFERENCE NUMBER @Z40LB26 08650003
         DC    H'0'                    RESERVED                @Z40LB26 08660003
         DC    H'15'                   PRINT COLUMN            @Z40LB26 08700003
         DC    H'10'                   PRINT FIELD LENGTH      @Z40LB26 08750003
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 08800003
************************************************************** @Z40LB26 08850003
*                                                            * @Z40LB26 08950003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 09000003
*                                                            * @Z40LB26 09050003
************************************************************** @Z40LB26 09100003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 09150003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 09200003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 09250003
************************************************************** @Z40LB26 09300003
*                                                            * @Z40LB26 09350003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 09400003
*                                                            * @Z40LB26 09450003
************************************************************** @Z40LB26 09500003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 09550003
         DC    Y(STE05D-STE05C)        TEXT LENGTH             @Z40LB26 09600003
         DC    Y(STE05C-TXT05A)        TEXT OFFSET             @Z40LB26 09650003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 09700003
         DC    Y(STE05D-STE05C)        PRINT FIELD LENGTH      @Z40LB26 09750003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 09760003
************************************************************** @Z40LB26 09800003
*                                                            * @Z40LB26 09850003
*  INSERT DATA SUB-STRUCTURE - ADDRESS                       * @Z40LB26 09900003
*                                                            * @Z40LB26 09950003
************************************************************** @Z40LB26 10000003
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB26 10050003
         DC    H'20'                   INSERT REFERENCE NUMBER @Z40LB26 10100003
         DC    H'0'                    RESERVED                @Z40LB26 10110003
         DC    H'11'                   PRINT COLUMN            @Z40LB26 10150003
         DC    H'30'                   PRINT FIELD LENGTH      @Z40LB26 10152003
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 10154003
************************************************************** @Z40LB26 10156003
*                                                            * @Z40LB26 10158003
*  STATIC TEXT ENTRIES                                       * @Z40LB26 10158403
*                                                            * @Z40LB26 10158803
************************************************************** @Z40LB26 10159203
STE05A   DC    C'GROUP OWNER:'                                 @Z40LB26 10159603
STE05B   EQU   *                                               @Z40LB26 10159703
STE05C   DC    C'ADDRESS:'                                     @Z40LB26 10159803
STE05D   EQU   *                                               @Z40LB26 10159903
TXT05B   EQU   *                                               @Z40LB26 10173203
         EJECT                                                 @Z40LB26 10183203
************************************************************** @Z40LB26 10185203
*                                                            * @Z40LB26 10185603
*  HEADER AND DATA LINES FOR SPACE USAGE REPORT              * @Z40LB26 10186003
*                                                            * @Z40LB26 10186403
************************************************************** @Z40LB26 10186503
TXT06    DC    Y(TXT06B-TXT06A)        ENTRY LENGTH            @Z40LB26 10186603
         DC    X'4000'                 HEADER FLAG             @Z40LB26 10191003
         DC    H'3'                    HEADER LINE COUNT       @Z40LB26 10193003
         DC    H'4'                    HEADER PLUS FIRST       @Z40LB26 10195003
*                                      DATA LINE               @Z40LB26 10201003
************************************************************** @Z40LB26 10222803
*                                                            * @Z40LB26 10236403
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 10250003
*                                                            * @Z40LB26 10300003
************************************************************** @Z40LB26 10350003
TXT06A   DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 10400003
         DC    Y(STE06B-STE06A)        TEXT LENGTH             @Z40LB26 10450003
         DC    Y(STE06A-TXT06A)        TEXT OFFSET             @Z40LB26 10500003
         DC    H'46'                   PRINT COLUMN            @Z40LB26 10550003
         DC    Y(STE06B-STE06A)        PRINT FIELD LENGTH      @Z40LB26 10600003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 10610003
************************************************************** @Z40LB26 10650003
*                                                            * @Z40LB26 10700003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 10750003
*                                                            * @Z40LB26 10800003
************************************************************** @Z40LB26 10850003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 10950003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 11000003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 11050003
************************************************************** @Z40LB26 11100003
*                                                            * @Z40LB26 11150003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 11200003
*                                                            * @Z40LB26 11250003
************************************************************** @Z40LB26 11300003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 11350003
         DC    Y(STE06D-STE06C)        TEXT LENGTH             @Z40LB26 11400003
         DC    Y(STE06C-TXT06A)        TEXT OFFSET             @Z40LB26 11450003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 11500003
         DC    Y(STE06D-STE06C)        PRINT FIELD LENGTH      @Z40LB26 11550003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 11560003
************************************************************** @Z40LB26 11600003
*                                                            * @Z40LB26 11650003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 11700003
*                                                            * @Z40LB26 11750003
************************************************************** @Z40LB26 11800003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 11850003
         DC    H'1'                    DOUBLE SPACE            @Z40LB26 11900003
         DC    C'R '                   RELATIVE SPAING TYPE    @Z40LB26 11950003
************************************************************** @Z40LB26 11960003
*                                                            * @Z40LB26 11970003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 11980003
*                                                            * @Z40LB26 11990003
************************************************************** @Z40LB26 11992003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 11994003
         DC    Y(STE06E-STE06D)        TEXT LENGTH             @Z40LB26 11996003
         DC    Y(STE06D-TXT06A)        TEXT OFFSET             @Z40LB26 11998003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 11998403
         DC    Y(STE06E-STE06D)        PRINT FIELD LENGTH      @Z40LB26 11998803
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 11999203
************************************************************** @Z40LB26 11999603
*                                                            * @Z40LB26 11999703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 11999803
*                                                            * @Z40LB26 11999903
************************************************************** @Z40LB26 12016603
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 12026603
         DC    H'1'                    DOUBLE SPACE            @Z40LB26 12028603
         DC    C'R '                   RELATIVE SPAING TYPE    @Z40LB26 12030603
************************************************************** @Z40LB26 12033303
*                                                            * @Z40LB26 12050003
*  REPLICATION SUB-STRUCTURE                                 * @Z40LB26 12100003
*                                                            * @Z40LB26 12150003
************************************************************** @Z40LB26 12200003
         DC    X'0800'                 REPLICATION FLAG        @Z40LB26 12250003
         DC    H'10'                   ARGUMENT REFERENCE NO.  @Z40LB26 12400003
         DC    H'7'                    REPLICATED SUB-STRUC-   @Z40LB26 12460003
*                                      TURE COUNT              @Z40LB26 12470003
         DC    H'80'                   BLOCK FORMAT OFFSET     @ZM44011 12510042
*                                      VALUE                   @Z40LB26 12520003
************************************************************** @Z40LB26 12560003
*                                                            * @Z40LB26 12610003
*  BLOCK DATA SUB-STRUCTURE - DATA SET NAME                  * @Z40LB26 12660003
*                                                            * @Z40LB26 12710003
************************************************************** @Z40LB26 12760003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 12810003
         DC    H'44'                   INPUT DATA LENGTH       @Z40LB26 12860003
         DC    H'4'                    INPUT DATA OFFSET       @Z40LB26 12910003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 12960003
         DC    H'44'                   PRINT FIELD LENGTH      @Z40LB26 13010003
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 13060003
************************************************************** @Z40LB26 13070003
*                                                            * @Z40LB26 13110003
*  BLOCK DATA SUB-STRUCTURE - DATA SET ORGAINIZATION         * @Z40LB26 13160003
*                                                            * @Z40LB26 13210003
************************************************************** @Z40LB26 13260003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 13360003
         DC    H'3'                    INPUT DATA LENGTH       @Z40LB26 13410003
         DC    H'64'                   INPUT DATA OFFSET       @Z40LB26 13460003
         DC    H'46'                   PRINT COLUMN            @Z40LB26 13510003
         DC    H'3'                    PRINT FIELD LENGTH      @Z40LB26 13560003
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 13610003
************************************************************** @Z40LB26 13620003
*                                                            * @Z40LB26 13630003
*  BLOCK DATA SUB-STRUCTURE - ALLOCATION UNIT                * @Z40LB26 13640003
*                                                            * @Z40LB26 13650003
************************************************************** @Z40LB26 13652003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 13654003
         DC    H'5'                    INPUT DATA LENGTH       @Z40LB26 13656003
         DC    H'67'                   INPUT DATA OFFSET       @Z40LB26 13658003
         DC    H'51'                   PRINT COLUMN            @Z40LB26 13658403
         DC    H'5'                    PRINT FIELD LENGTH      @Z40LB26 13658803
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 13659203
************************************************************** @Z40LB26 13660003
*                                                            * @Z40LB26 13710003
*  BLOCK DATA SUB-STRUCTURE - NUMBER OF EXTENTS              * @Z40LB26 13760003
*                                                            * @Z40LB26 13810003
************************************************************** @Z40LB26 13860003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 13910003
         DC    H'1'                    INPUT DATA LENGTH       @Z40LB26 13960003
         DC    H'56'                   INPUT DATA OFFSET       @Z40LB26 14010003
         DC    H'59'                   PRINT COLUMN            @Z40LB26 14060003
         DC    H'3'                    PRINT FIELD LENGTH      @Z40LB26 14110003
         DC    X'10A0'                 CONVERSION - BINARY TO  @Z40LB26 14160003
*                                      DECIMAL, SUPPRESS       @Z40LB26 14190003
*                                      LEADING ZEROES AND SIGN @Z40LB26 14200003
************************************************************** @Z40LB26 14210003
*                                                            * @Z40LB26 14260003
*  BLOCK DATA SUB-STRUCTURE - SECONDARY ALLOCATION           * @Z40LB26 14310003
*                                                            * @Z40LB26 14360003
************************************************************** @Z40LB26 14410003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 14460003
         DC    H'4'                    INPUT DATA LENGTH       @Z40LB26 14510003
         DC    H'60'                   INPUT DATA OFFSET       @Z40LB26 14560003
         DC    H'64'                   PRINT COLUMN            @Z40LB26 14610003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 14660003
         DC    H'0'                    CONVERSION - NONE       @Z40LB26 14710003
************************************************************** @Z40LB26 14860003
*                                                            * @Z40LB26 14910003
*  BLOCK DATA SUB-STRUCTURE - TOTAL TRACKS                   * @Z40LB26 14960003
*                                                            * @Z40LB26 15010003
************************************************************** @Z40LB26 15060003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 15110003
         DC    H'2'                    INPUT DATA LENGTH       @Z40LB26 15160003
         DC    H'48'                   INPUT DATA OFFSET       @Z40LB26 15210003
         DC    H'70'                   PRINT COLUMN            @Z40LB26 15260003
         DC    H'5'                    PRINT FIELD LENGTH      @Z40LB26 15310003
         DC    X'10A0'                 CONVERSION - BINARY TO  @Z40LB26 15360003
*                                      DECIMAL, SUPPRESS       @Z40LB26 15380003
*                                      LEADING ZEROES AND SIGN @Z40LB26 15410003
************************************************************** @Z40LB26 15460003
*                                                            * @Z40LB26 15510003
*  BLOCK DATA SUB-STRUCTURE - FREE TRACKS                    * @Z40LB26 15560003
*                                                            * @Z40LB26 15610003
************************************************************** @Z40LB26 15660003
         DC    X'9000'                 BLOCK DATA FLAG         @Z40LB26 15710003
         DC    H'4'                    INPUT DATA LENGTH       @Z40LB26 15760003
         DC    H'72'                   INPUT DATA OFFSET       @Z40LB26 15810003
         DC    H'77'                   PRINT COLUMN            @Z40LB26 15860003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 15910003
         DC    H'0'                    CONVERSION - NONE       @Z40LB26 15960003
************************************************************** @Z40LB26 16510003
*                                                            * @Z40LB26 16560003
*  STATIC TEXT ENTRIES                                       * @Z40LB26 16610003
*                                                            * @Z40LB26 16660003
************************************************************** @Z40LB26 16710003
STE06A   DC    C'DS   ALLOC  NO.   SEC    TOTAL FREE'          @Z40LB26 16760003
STE06B   EQU   *                                               @Z40LB26 16810003
STE06C   DC    C'DATA SET                                '     @Z40LB26 16860003
         DC    C'     ORG  UNIT   EXTS  ALLOC  TRKS  TRKS'     @Z40LB26 16960003
STE06D   DC    C'  '                                           @Z40LB26 17010003
STE06E   EQU   *                                               @Z40LB26 17020003
TXT06B   EQU   *                                               @Z40LB26 17060003
         EJECT                                                 @Z40LB26 17110003
************************************************************** @Z40LB26 17160003
*                                                            * @Z40LB26 17210003
*  HEADER AND DATA LINES FOR STATUS REPORT                   * @Z40LB26 17260003
*                                                            * @Z40LB26 17310003
************************************************************** @Z40LB26 17360003
TXT07    DC     Y(TXT07B-TXT07A)        ENTRY LENGTH           @Z40LB26 17410003
         DC    X'4000'                 HEADER FLAG             @Z40LB26 17460003
         DC    H'3'                    HEADER LINE COUNT       @Z40LB26 17510003
         DC    H'4'                    HEADER PLUS FIRST       @Z40LB26 17560003
*                                      DATA LINE               @Z40LB26 17610003
************************************************************** @Z40LB26 18110003
*                                                            * @Z40LB26 18160003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 18210003
*                                                            * @Z40LB26 18260003
************************************************************** @Z40LB26 18310003
TXT07A   DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 18360003
         DC    Y(STE07B-STE07A)        TEXT LENGTH             @Z40LB26 18410003
         DC    Y(STE07A-TXT07A)        TEXT OFFSET             @Z40LB26 18460003
         DC    H'46'                   PRINT COLUMN            @Z40LB26 18510003
         DC    Y(STE07B-STE07A)        PRINT FIELD LENGTH      @Z40LB26 18560003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 18570003
************************************************************** @Z40LB26 18610003
*                                                            * @Z40LB26 18660003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 18710003
*                                                            * @Z40LB26 18760003
************************************************************** @Z40LB26 18810003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 18860003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 18910003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 18960003
************************************************************** @Z40LB26 19010003
*                                                            * @Z40LB26 19060003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 19110003
*                                                            * @Z40LB26 19160003
************************************************************** @Z40LB26 19210003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 19260003
         DC    Y(STE07D-STE07C)        TEXT LENGTH             @Z40LB26 19270003
         DC    Y(STE07C-TXT07A)        TEXT OFFSET             @Z40LB26 19280003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 19310003
         DC    Y(STE07D-STE07C)        PRINT FIELD LENGTH      @Z40LB26 19320003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 19330003
************************************************************** @Z40LB26 19370003
*                                                            * @Z40LB26 19420003
*  SPACING CONTROL SUB-STRUCTURE                             * @Z40LB26 19470003
*                                                            * @Z40LB26 19520003
************************************************************** @Z40LB26 19570003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 19620003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 19670003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 19720003
************************************************************** @Z40LB26 19730003
*                                                            * @Z40LB26 19740003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 19750003
*                                                            * @Z40LB26 19760003
************************************************************** @Z40LB26 19762003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 19764003
         DC    Y(STE07E-STE07D)        TEXT LENGTH             @Z40LB26 19766003
         DC    Y(STE07D-TXT07A)        TEXT OFFSET             @Z40LB26 19768003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 19768403
         DC    Y(STE07E-STE07D)        PRINT FIELD LENGTH      @Z40LB26 19768803
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 19769203
************************************************************** @Z40LB26 19769603
*                                                            * @Z40LB26 19769703
*  SPACING CONTROL SUB-STRUCTURE                             * @Z40LB26 19769803
*                                                            * @Z40LB26 19769903
************************************************************** @Z40LB26 19786603
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 19796603
         DC    H'1'                    SINGLE SPACE            @Z40LB26 19798603
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 19800603
************************************************************** @Z40LB26 19803303
*                                                            * @Z40LB26 19820003
*  REPLICATION SUB-STRUCTURE                                 * @Z40LB26 19870003
*                                                            * @Z40LB26 19920003
************************************************************** @Z40LB26 19970003
         DC    X'0800'                 REPLICATION FLAG        @Z40LB26 20020003
         DC    H'10'                   ARGUMENT REFERENCE NO.  @Z40LB26 20120003
         DC    H'10'                   REPLICATED SUB-STRUC-   @Z40LB26 20170003
*                                      TURE COUNT              @Z40LB2  20220003
         DC    H'80'                   BLOCK FORMAT OFFSET     @G24LB31 20324042
*                                      VALUE                   @Z40LB26 20330003
************************************************************** @Z40LB26 20370003
*                                                            * @Z40LB26 20420003
*  BLOCK DATA SUB-STRUCTURE - DATA SET NAME                  * @Z40LB26 20470003
*                                                            * @Z40LB26 20520003
************************************************************** @Z40LB26 20570003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 20620003
         DC    H'44'                   INPUT DATA LENGTH       @Z40LB26 20670003
         DC    H'4'                    INPUT DATA OFFSET       @Z40LB26 20720003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 20770003
         DC    H'44'                   PRINT FIELD LENGTH      @Z40LB26 20820003
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 20870003
************************************************************** @Z40LB26 20920003
*                                                            * @Z40LB26 20970003
*  BLOCK DATA SUB-STRUCTURE - CREATE DATE, YEAR              * @Z40LB26 21020003
*                                                            * @Z40LB26 21070003
************************************************************** @Z40LB26 21120003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 21170003
         DC    H'2'                    INPUT DATA LENGTH       @Z40LB26 21220003
         DC    H'48'                   INPUT DATA OFFSET       @Z40LB26 21270003
         DC    H'46'                   PRINT COLUMN            @Z40LB26 21320003
         DC    H'2'                    PRINT FIELD LENGTH      @Z40LB26 21370003
         DC    X'1020'                 CONVERT BINARY TO       @Z40LB26 21420003
*                                      DECIMAL, SUPPRESS SIGN  @Z40LB26 21470003
************************************************************** @Z40LB26 21520003
*                                                            * @Z40LB26 21570003
*  BLOCK DATA SUB-STRUCTURE - CREATE DATE, DAY               * @Z40LB26 21620003
*                                                            * @Z40LB26 21670003
************************************************************** @Z40LB26 21720003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 21770003
         DC    H'2'                    INPUT DATA LENGTH       @Z40LB26 21820003
         DC    H'50'                   INPUT DATA OFFSET       @Z40LB26 21870003
         DC    H'48'                   PRINT COLUMN            @Z40LB26 21920003
         DC    H'3'                    PRINT FIELD LENGTH      @Z40LB26 21970003
         DC    X'1020'                 CONVER  BINARY TO       @Z40LB26 22020003
*                                      DECIMAL, SUPPRESS SIGN  @Z40LB26 22070003
************************************************************** @Z40LB26 22120003
*                                                            * @Z40LB26 22170003
*  BLOCK DATA SUB-STRUCTURE - CREATE DATE, CATALOG OR        * @Z40LB26 22220003
*  VTOC INDICATOR                                            * @Z40LB26 22230003
*                                                            * @Z40LB26 22270003
************************************************************** @Z40LB26 22320003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 22370003
         DC    H'2'                    INPUT DATA LENGTH       @Z40LB26 22420003
         DC    H'66'                   INPUT DATA OFFSET       @Z40LB26 22470003
         DC    H'51'                   PRINT COLUMN            @Z40LB26 22520003
         DC    H'2'                    PRINT FIELD LENGTH      @Z40LB26 22570003
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 22620003
************************************************************** @Z40LB26 22720003
*                                                            * @Z40LB26 22770003
*  BLOCK DATA SUB-STRUCTURE - EXPIRATION DATE, YEAR          * @Z40LB26 22820003
*                                                            * @Z40LB26 22920003
************************************************************** @Z40LB26 22970003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 23020003
         DC    H'2'                    INPUT DATA LENGTH       @Z40LB26 23070003
         DC    H'52'                   INPUT DATA OFFSET       @Z40LB26 23120003
         DC    H'54'                   PRINT COLUMN            @Z40LB26 23170003
         DC    H'2'                    PRINT FIELD LENGTH      @Z40LB26 23220003
         DC    X'1020'                 CONVERT BINARY TO       @Z40LB26 23270003
*                                      DECIMAL, SUPPRESS SIGN  @Z40LB26 23320003
************************************************************** @Z40LB26 23370003
*                                                            * @Z40LB26 23420003
*  BLOCK DATA SUB-STRUCTURE - EXPIRATION DATE, DAY           * @Z40LB26 23470003
*                                                            * @Z40LB26 23520003
************************************************************** @Z40LB26 23570003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 23620003
         DC    H'2'                    INPUT DATA LENGTH       @Z40LB26 23670003
         DC    H'54'                   INPUT DATA OFFSET       @Z40LB26 23720003
         DC    H'56'                   PRINT COLUMN            @Z40LB26 23770003
         DC    H'3'                    PRINT FIELD LENGTH      @Z40LB26 23820003
         DC    X'1020'                 CONVERT BINARY TO       @Z40LB26 23870003
*                                      DECIMAL, SUPPRESS SIGN  @Z40LB26 23920003
************************************************************** @Z40LB26 23970003
*                                                            * @Z40LB26 24020003
*  BLOCK DATA STRUCTURE - EXPIRATION DATE, CATALOG OR        * @Z40LB26 24070003
*  VTOC INDICATOR                                            * @Z40LB26 24080003
*                                                            * @Z40LB26 24120003
************************************************************** @Z40LB26 24170003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 24220003
         DC    H'2'                    INPUT DATA LENGTH       @Z40LB26 24270003
         DC    H'68'                   INPUT DATA OFFSET       @Z40LB26 24320003
         DC    H'59'                   PRINT COLUMN            @Z40LB26 24370003
         DC    H'2'                    PRINT FIELD LENGTH      @Z40LB26 24420003
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 24470003
************************************************************** @Z40LB26 24520003
*                                                            * @Z40LB26 24570003
*  BLOCK DATA STRUCTURE - CATALOGED STATUS                   * @Z40LB26 24620003
*                                                            * @Z40LB26 24720003
************************************************************** @Z40LB26 24770003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 24820003
         DC    H'3'                    INPUT DATA LENGTH       @Z40LB26 24870003
         DC    H'70'                   INPUT DATA OFFSET       @Z40LB26 24920003
         DC    H'62'                   PRINT COLUMN            @Z40LB26 24970003
         DC    H'3'                    PRINT FIELD LENGTH      @Z40LB26 25020003
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 25070003
************************************************************** @Z40LB26 25620003
*                                                            * @Z40LB26 25670003
*  BLOCK DATA STRUCTURE - PROTECTION                         * @Z40LB26 25720003
*                                                            * @Z40LB26 25770003
************************************************************** @Z40LB26 25820003
         DC    X'1000'                 BLOCK DATA FLAG         @Z40LB26 25870003
         DC    H'4'                    INPUT DATA LENGTH       @Z40LB26 25920042
         DC    H'73'                   INPUT DATA OFFSET       @Z40LB26 25970003
         DC    H'66'                   PRINT COLUMN            @Z40LB26 26020003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 26070042
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 26080003
************************************************************** @Z40LB26 26120003
*                                                            * @Z40LB26 26170003
*  BLOCK DATA SUB-STRUCTURE - OWNER NAME                     * @Z40LB26 26220003
*                                                            * @Z40LB26 26270003
************************************************************** @Z40LB26 26320003
         DC    X'9000'                 BLOCK DATA FLAG         @Z40LB26 26370003
         DC    H'8'                    INPUT DATA LENGTH       @Z40LB26 26420003
         DC    H'56'                   INPUT DATA OFFSET       @Z40LB26 26470003
         DC    H'71'                   PRINT COLUMN            @Z40LB26 26520003
         DC    H'8'                    PRINT FIELD LENGTH      @Z40LB26 26570003
         DC    H'0'                    CONVERSION (NONE)       @Z40LB26 26620003
************************************************************** @Z40LB26 27070003
*                                                            * @Z40LB26 27120003
*  STATIC TEXT ENTRIES                                       * @Z40LB26 27170003
*                                                            * @Z40LB26 27220003
************************************************************** @Z40LB26 27270003
STE07A   DC    C'CREATE  EXPIR'                                @Z40LB26 27320003
STE07B   EQU   *                                               @Z40LB26 27370003
STE07C   DC    C'DATA SET                                '     @Z40LB26 27420003
         DC    C'     DATE    DATE    CAT PROT OWNER     '     @Z40LB26 27470003
STE07D   DC    C'  '                                           @Z40LB26 27520003
STE07E   EQU   *                                               @Z40LB26 27530003
TXT07B   EQU   *                                               @Z40LB26 27570003
         EJECT                                                 @Z40LB26 27620003
************************************************************** @Z40LB26 27670003
*                                                            * @Z40LB26 27720003
*  SPACE USAGE REPORT SUMMARY                                * @Z40LB26 27770003
*                                                            * @Z40LB26 27820003
************************************************************** @Z40LB26 27870003
TXT08    DC    Y(TXT08B-TXT08A)        ENTRY LENGTH            @Z40LB26 27920003
         DC    X'4000'                 HEADER FLAG             @Z40LB26 27970003
         DC    H'0'                    HEADER LINE COUNT       @Z40LB26 28020003
         DC    H'10'                   HEADER PLUS FIRST       @Z40LB26 28070003
*                                      DATA LINE               @Z40LB26 28120003
************************************************************** @Z40LB26 28170003
*                                                            * @Z40LB26 28220003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 28270003
*                                                            * @Z40LB26 28320003
************************************************************** @Z40LB26 28370003
TXT08A   DC    X'4100'                 SPACING CONTROL FLAG    @Z40LB26 28420003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 28470003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 28520003
************************************************************** @Z40LB26 28570003
*                                                            * @Z40LB26 28620003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 28670003
*                                                            * @Z40LB26 28720003
************************************************************** @Z40LB26 28770003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 28820003
         DC    Y(STE08B-STE08A)        TEXT LENGTH             @Z40LB26 28830003
         DC    Y(STE08A-TXT08A)        TEXT OFFSET             @Z40LB26 28840003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 28870003
         DC    Y(STE08B-STE08A)        PRINT FIELD LENGTH      @Z40LB26 28920003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 28940003
************************************************************** @Z40LB26 28970003
*                                                            * @Z40LB26 29020003
*  INSERT DATA SUB-STRUCTURE - LISTED DATA SET TRACKS        * @Z40LB26 29070003
*                                                            * @Z40LB26 29120003
************************************************************** @Z40LB26 29170003
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB26 29220003
         DC    H'10'                   INSERT REFERENCE NO.    @Z40LB26 29270003
         DC    H'0'                    RESERVED                @Z40LB26 29280003
         DC    H'40'                   PRINT COLUMN            @Z40LB26 29320003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 29370003
         DC    X'10A0'                 CONVERSION - BINARY TO  @Z40LB26 29420003
*                                      DECIMAL SUPPRESS        @Z40LB26 29470003
*                                      LEADING ZEROES AND SIGN @Z40LB26 29520003
************************************************************** @Z40LB26 29570003
*                                                            * @Z40LB26 29620003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 29670003
*                                                            * @Z40LB26 29720003
************************************************************** @Z40LB26 29770003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 29820003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 29870003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 29920003
************************************************************** @Z40LB26 29970003
*                                                            * @Z40LB26 30020003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 30070003
*                                                            * @Z40LB26 30120003
************************************************************** @Z40LB26 30170003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 30220003
         DC    Y(STE08D-STE08C)        TEXT LENGTH             @Z40LB26 30270003
         DC    Y(STE08C-TXT08A)        TEXT OFFSET             @Z40LB26 30320003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 30370003
         DC    Y(STE08D-STE08C)        PRINT FIELD LENGTH      @Z40LB26 30420003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 30430003
************************************************************** @Z40LB26 30470003
*                                                            * @Z40LB26 30520003
*  INSERT DATA SUB-STRUCTURE - VTOC TRACKS ALLOCATED         * @Z40LB26 30570003
*                                                            * @Z40LB26 30620003
************************************************************** @Z40LB26 30670003
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB26 30720003
         DC    H'20'                   INSERT REFERNECE NO.    @Z40LB26 30770003
         DC    H'0'                    RESERVED                @Z40LB26 30780003
         DC    H'40'                   PRINT COLUMN            @Z40LB26 30820003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 30870003
         DC    X'10A0'                 CONVERSION - BINARY TO  @Z40LB26 30920003
*                                      DECIMAL SUPPRESS        @Z40LB26 30970003
*                                      LEADING ZEROES AND SIGN @Z40LB26 31020003
************************************************************** @Z40LB26 31070003
*                                                            * @Z40LB26 31120003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 31170003
*                                                            * @Z40LB26 31220003
************************************************************** @Z40LB26 31270003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 31320003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 31370003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 31420003
************************************************************** @Z40LB26 31470003
*                                                            * @Z40LB26 31480003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 31482003
*                                                            * @Z40LB26 31484003
************************************************************** @Z40LB26 31490003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 31520003
         DC    Y(STE08F-STE08E)        TEXT LENGTH             @Z40LB26 31570003
         DC    Y(STE08E-TXT08A)        TEXT OFFSET             @Z40LB26 31730003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 31740003
         DC    Y(STE08F-STE08E)        PRINT FIELD LENGTH      @Z40LB26 31750003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 31760003
************************************************************** @Z40LB26 31770003
*                                                            * @Z40LB26 31820003
*  INSERT DATA SUB-STRUCTURE - FREE DSCBS                    * @Z40LB26 31870003
*                                                            * @Z40LB26 31920003
************************************************************** @Z40LB26 31970003
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB26 32020003
         DC    H'30'                   INSERT REFERENCE NO.    @Z40LB26 32070003
         DC    H'0'                    RESERVED                @Z40LB26 32080003
         DC    H'40'                   PRINT COLUMN            @Z40LB26 32120003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 32170003
         DC    X'10A0'                 CONVERSION - BINARY TO  @Z40LB26 32220003
*                                      DECIMAL SUPPRESS        @Z40LB26 32270003
*                                      LEADING ZEROES AND SIGN @Z40LB26 32320003
************************************************************** @Z40LB26 32370003
*                                                            * @Z40LB26 32420003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 32470003
*                                                            * @Z40LB26 32520003
************************************************************** @Z40LB26 32570003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 32620003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 32670003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 32720003
************************************************************** @Z40LB26 32770003
*                                                            * @Z40LB26 32820003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 32870003
*                                                            * @Z40LB26 32920003
************************************************************** @Z40LB26 32970003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 33020003
         DC    Y(STE08H-STE08G)        TEXT LENGTH             @Z40LB26 33070003
         DC    Y(STE08G-TXT08A)        TEXT OFFSET             @Z40LB26 33270003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 33320003
         DC    Y(STE08H-STE08G)        PRINT FIELD LENGTH      @Z40LB26 33370003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 33380003
************************************************************** @Z40LB26 33420003
*                                                            * @Z40LB26 33470003
*  INSERT DATA SUB-STRUCTURE - FREE CYLINDERS                * @Z40LB26 33520003
*                                                            * @Z40LB26 33570003
************************************************************** @Z40LB26 33620003
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB26 33670003
         DC    H'40'                   INSERT REFERENCE NO.    @Z40LB26 33720003
         DC    H'0'                    RESERVED                @Z40LB26 33730003
         DC    H'40'                   PRINT COLUMN            @Z40LB26 33770003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 33820003
         DC    H'0'                    CONVERSION - NONE       @Z40LB26 33870003
************************************************************** @Z40LB26 34020003
*                                                            * @Z40LB26 34070003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 34120003
*                                                            * @Z40LB26 34170003
************************************************************** @Z40LB26 34220003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 34270003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 34320003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 34370003
************************************************************** @Z40LB26 34420003
*                                                            * @Z40LB26 34470003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 34520003
*                                                            * @Z40LB26 34570003
************************************************************** @Z40LB26 34620003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 34670003
         DC    Y(STE08K-STE08J)        TEXT LENGTH             @Z40LB26 34680003
         DC    Y(STE08J-TXT08A)        TEXT OFFSET             @Z40LB26 34690003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 34720003
         DC    Y(STE08K-STE08J)        PRINT FIELD LENGTH      @Z40LB26 34770003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 34780003
************************************************************** @Z40LB26 34820003
*                                                            * @Z40LB26 34870003
*  INSERT DATA SUB-STRUCTURE - FREE TRACKS                   * @Z40LB26 34920003
*                                                            * @Z40LB26 34970003
************************************************************** @Z40LB26 35020003
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB26 35070003
         DC    H'50'                   INSERT REFERENCE NO.    @Z40LB26 35120003
         DC    H'0'                    RESERVED                @Z40LB26 35130003
         DC    H'40'                   PRINT COLUMN            @Z40LB26 35170003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 35220003
         DC    H'0'                    CONVERSION - NONE       @Z40LB26 35270003
************************************************************** @Z40LB26 35420003
*                                                            * @Z40LB26 35470003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 35480003
*                                                            * @Z40LB26 35520003
************************************************************** @Z40LB26 35570003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 35620003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 35670003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 35720003
************************************************************** @Z40LB26 35770003
*                                                            * @Z40LB26 35820003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 35870003
*                                                            * @Z40LB26 35920003
************************************************************** @Z40LB26 35970003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 36020003
         DC    Y(STE08M-STE08L)        TEXT LENGTH             @Z40LB26 36070003
         DC    Y(STE08L-TXT08A)        TEXT OFFSET             @Z40LB26 36120003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 36170003
         DC    Y(STE08M-STE08L)        PRINT FIELD LENGTH      @Z40LB26 36220003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 36222003
************************************************************** @Z40LB26 36230003
*                                                            * @Z40LB26 36270003
*  INSERT DATA SUB-STRUCTURE - FREE EXTENTS                    @Z40LB26 36320003
*                                                            * @Z40LB26 36370003
************************************************************** @Z40LB26 36420003
         DC    X'2000'                 INSERT DATA FLAG        @Z40LB26 36470003
         DC    H'60'                   INSERT REFERENCE NO.    @Z40LB26 36520003
         DC    H'0'                    RESERVED                @Z40LB26 36530003
         DC    H'40'                   PRINT COLUMN            @Z40LB26 36570003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 36620003
         DC    H'0'                    CONVERSION - NONE       @Z40LB26 36670003
************************************************************** @Z40LB26 36790003
*                                                            * @Z40LB26 36800003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 36810003
*                                                            * @Z40LB26 36820003
************************************************************** @Z40LB26 36870003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 36920003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 36970003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 37020003
************************************************************** @Z40LB26 37040003
*                                                            * @Z40LB26 37050003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 37070003
*                                                            * @Z40LB26 37120003
************************************************************** @Z40LB26 37170003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 37220003
         DC    Y(STE08Q-STE08P)        TEXT LENGTH             @Z40LB26 37230003
         DC    Y(STE08P-TXT08A)        TEXT OFFSET             @Z40LB26 37240003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 37270003
         DC    Y(STE08Q-STE08P)        PRINT FIELD LENGTH      @Z40LB26 37320003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 37330003
************************************************************** @Z40LB26 37370003
*                                                            * @Z40LB26 37420003
*  INSERT DATA SUB-STRUCTURE - LARGEST FREE EXTENT           * @Z40LB26 37470003
*                                                            * @Z40LB26 37520003
************************************************************** @Z40LB26 37570003
         DC    X'A000'                 INSERT DATA FLAG        @Z40LB26 37620003
         DC    H'70'                   INSERT REFERENCE NO.    @Z40LB26 37670003
         DC    H'0'                    RESERVED                @Z40LB26 37680003
         DC    H'40'                   PRINT COLUMN            @Z40LB26 37720003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 37770003
         DC    H'0'                    CONVERSION - NONE       @Z40LB26 37820003
************************************************************** @Z40LB26 37970003
*                                                            * @Z40LB26 38020003
*  STATIC TEXT ENTRIES                                       * @Z40LB26 38070003
*                                                            * @Z40LB26 38120003
************************************************************** @Z40LB26 38170003
STE08A   DC    C'TRACKS ALLOCATED TO LISTED DATA SETS:'        @Z40LB26 38220003
STE08B   EQU   *                                               @Z40LB26 38270003
STE08C   DC    C'TRACKS ALLOCATED TO VTOC:'                    @Z40LB26 38320003
STE08D   EQU   *                                               @Z40LB26 38370003
STE08E   DC    C'FREE DSCBS IN VTOC:'                          @Z40LB26 38420003
STE08F   EQU   *                                               @Z40LB26 38470003
STE08G   DC    C'FREE CYLINDERS:'                              @Z40LB26 38520003
STE08H   EQU   *                                               @Z40LB26 38570003
STE08J   DC    C'FREE TRACKS:'                                 @Z40LB26 38620003
STE08K   EQU   *                                               @Z40LB26 38670003
STE08L   DC    C'NUMBER OF FREE EXTENTS:'                      @Z40LB26 38720003
STE08M   EQU   *                                               @Z40LB26 38770003
STE08P   DC    C'LARGEST FREE EXTENT IN CYLINDERS:'            @Z40LB26 38820003
STE08Q   EQU   *                                               @Z40LB26 38870003
TXT08B   EQU   *                                               @Z40LB26 38920003
         EJECT                                                 @Z40LB26 38970003
************************************************************** @Z40LB26 39970003
*                                                            * @Z40LB26 40020003
*  STATUS REPORT SUMMARY                                     * @Z40LB26 40070003
*                                                            * @Z40LB26 40120003
************************************************************** @Z40LB26 40170003
TXT09    DC    Y(TXT09B-TXT09A)        ENTRY LENGTH            @Z40LB26 40172003
         DC    X'4000'                 HEADER FLAG             @Z40LB26 40174003
         DC    H'0'                    HEADER LINE COUNT       @Z40LB26 40176003
         DC    H'2'                    HEADER PLUS FIRST       @Z40LB26 40178003
*                                      DATA LINE               @Z40LB26 40178403
************************************************************** @Z40LB26 40180003
*                                                            * @Z40LB26 40190003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 40200003
*                                                            * @Z40LB26 40210003
************************************************************** @Z40LB26 40212003
TXT09A   DC    X'4100'                 SPACING CONTROL FLAG    @Z40LB26 40220003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 40270003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 40320003
************************************************************** @Z40LB26 40330003
*                                                            * @Z40LB26 40370003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 40420003
*                                                            * @Z40LB26 40470003
************************************************************** @Z40LB26 40520003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 40570003
         DC    Y(STE09B-STE09A)        TEXT LENGTH             @Z40LB26 40620003
         DC    Y(STE09A-TXT09A)        TEXT OFFSET             @Z40LB26 40670003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 40720003
         DC    Y(STE09B-STE09A)        PRINT FIELD LENGTH      @Z40LB26 40770003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 40780003
************************************************************** @Z40LB26 40790003
*                                                            * @Z40LB26 40800003
*  BLOCK DATA SUB-STRUCTURE                                  * @Z40LB26 40820003
*                                                            * @Z40LB26 40870003
************************************************************** @Z40LB26 40920003
         DC    X'9000'                 BLOCK DATA FLAG         @Z40LB26 40970003
         DC    H'4'                    INPUT DATA LENGTH       @Z40LB26 41020003
         DC    H'0'                    INPUT DATA OFFSET       @Z40LB26 41070003
         DC    H'20'                   PRINT COLUMN            @Z40LB26 41120003
         DC    H'4'                    PRINT FIELD LENGTH      @Z40LB26 41170003
         DC    X'10A0'                 CONVERSION - BINARY TO  @Z40LB26 41220003
*                                      DECIMAL, SUPPRESS       @Z40LB26 41270003
*                                      LEADING ZEROES AND SIGN @Z40LB26 41320003
************************************************************** @Z40LB26 41370003
*                                                            * @Z40LB26 41420003
* STATIC TEXT ENTRIES                                        * @Z40LB26 41470003
*                                                            * @Z40LB26 41520003
************************************************************** @Z40LB26 41570003
STE09A   DC    C'DATA SETS LISTED:'                            @Z40LB26 41620003
STE09B   EQU   *                                               @Z40LB26 41670003
TXT09B   EQU   *                                               @Z40LB26 41720003
         EJECT                                                 @Z40LB26 41770003
************************************************************** @Z40LB26 41820003
*                                                            * @Z40LB26 41870003
*  LEGEND FOR STATUS REPORT                                  * @Z40LB26 41920003
*                                                            * @Z40LB26 41970003
************************************************************** @Z40LB26 42020003
TXT10    DC    Y(TXT10B-TXT10A)        ENTRY LENGTH            @Z40LB26 42070003
         DC    H'0'                    FLAGS                   @Z40LB26 42120003
************************************************************** @Z40LB26 42170003
*                                                            * @Z40LB26 42220003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 42270003
*                                                            * @Z40LB26 42320003
************************************************************** @Z40LB26 42370003
TXT10A   DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 42420003
         DC    H'2'                    IGNORE                  @Z40LB26 42470003
         DC    C'R '                   EJECT PAGE              @Z40LB26 42520003
************************************************************** @Z40LB26 43470003
*                                                            * @Z40LB26 43520003
*  STATIC TEXT SUB-STRUCTURE - FIELD DESCRIPTION             * @Z40LB26 43570003
*                                                            * @Z40LB26 43620003
************************************************************** @Z40LB26 43670003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 43720003
         DC    Y(STE10C-STE10B)        TEXT LENGTH             @Z40LB26 43770003
         DC    Y(STE10B-TXT10A)        TEXT OFFSET             @Z40LB26 43780003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 43820003
         DC    Y(STE10C-STE10B)        PRINT FIELD LENGTH      @Z40LB26 43870003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 43880003
************************************************************** @Z40LB26 43920003
*                                                            * @Z40LB26 43970003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 44020003
*                                                            * @Z40LB26 44070003
************************************************************** @Z40LB26 44120003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 44170003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 44220003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 44270003
************************************************************** @Z40LB26 44320003
*                                                            * @Z40LB26 44370003
*  STATIC TEXT SUB-STRUCTURE - CAT                           * @Z40LB26 44420003
*                                                            * @Z40LB26 44470003
************************************************************** @Z40LB26 44520003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 44570003
         DC    Y(STE10D-STE10C)        TEXT LENGTH             @Z40LB26 44620003
         DC    Y(STE10C-TXT10A)        TEXT OFFSET             @Z40LB26 44670003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 44720003
         DC    Y(STE10D-STE10C)        PRINT FIELD LENGTH      @Z40LB26 44770003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 44780003
************************************************************** @Z40LB26 44820003
*                                                            * @Z40LB26 44870003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 44920003
*                                                            * @Z40LB26 44970003
************************************************************** @Z40LB26 45020003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 45070003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 45120003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 45170003
************************************************************** @Z40LB26 45180003
*                                                            * @Z40LB26 45190003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 45200003
*                                                            * @Z40LB26 45210003
************************************************************** @Z40LB26 45212003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 45214003
         DC    Y(STE10D1-STE10D)       TEXT LENGTH             @Z40LB26 45216003
         DC    Y(STE10D-TXT10A)        TEXT OFFSET             @Z40LB26 45218003
         DC    H'15'                   PRINT COLUMN            @Z40LB26 45218403
         DC    Y(STE10D1-STE10D)       PRINT FIELD LENGTH      @Z40LB26 45218803
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 45223403
************************************************************** @Z40LB26 45225603
*                                                            * @Z40LB26 45227803
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 45230003
*                                                            * @Z40LB26 45232203
************************************************************** @Z40LB26 45234403
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 45236603
         DC    H'1'                    SINGLE SPACE            @Z40LB26 45246603
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 45248603
************************************************************** @Z40LB26 45249003
*                                                            * @Z40LB26 45249403
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 45249803
*                                                            * @Z40LB26 45250203
************************************************************** @Z40LB26 45250303
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 45250403
         DC    Y(STE10E-STE10D1)       TEXT LENGTH             @Z40LB26 45250503
         DC    Y(STE10D1-TXT10A)       TEXT OFFSET             @Z40LB26 45250903
         DC    H'15'                   PRINT COLUMN            @Z40LB26 45251303
         DC    Y(STE10E-STE10D1)       PRINT FIELD LENGTH      @Z40LB26 45251403
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 45251503
************************************************************** @Z40LB26 45251703
*                                                            * @Z40LB26 45252603
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 45253003
*                                                            * @Z40LB26 45253103
************************************************************** @Z40LB26 45253303
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 45258803
         DC    H'1'                    SINGLE SPACE            @Z40LB26 45260803
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 45262803
************************************************************** @Z40LB26 45264403
*                                                            * @Z40LB26 45270003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 45320003
*                                                            * @Z40LB26 45370003
************************************************************** @Z40LB26 45420003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 45470003
         DC    Y(STE10F-STE10E)        TEXT LENGTH             @Z40LB26 45520003
         DC    Y(STE10E-TXT10A)        TEXT OFFSET             @Z40LB26 45570003
         DC    H'18'                   PRINT COLUMN            @Z40LB26 45620003
         DC    Y(STE10F-STE10E)        PRINT FIELD LENGTH      @Z40LB26 45670003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 45680003
************************************************************** @Z40LB26 45720003
*                                                            * @Z40LB26 45770003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 45820003
*                                                            * @Z40LB26 45870003
************************************************************** @Z40LB26 45920003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 45970003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 46020003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 46070003
************************************************************** @Z40LB26 46080003
*                                                            * @Z40LB26 46090003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 46100003
*                                                            * @Z40LB26 46110003
************************************************************** @Z40LB26 46112003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 46114003
         DC    Y(STE10G-STE10F)        TEXT LENGTH             @Z40LB26 46116003
         DC    Y(STE10F-TXT10A)        TEXT OFFSET             @Z40LB26 46118003
         DC    H'18'                   PRINT COLUMN            @Z40LB26 46118403
         DC    Y(STE10G-STE10F)        PRINT FIELD LENGTH      @Z40LB26 46118803
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 46118903
************************************************************** @Z40LB26 46119203
*                                                            * @Z40LB26 46119603
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 46119703
*                                                            * @Z40LB26 46119803
************************************************************** @Z40LB26 46119903
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 46136603
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 46146603
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 46148603
************************************************************** @Z40LB26 46153303
*                                                            * @Z40LB26 46170003
*  STATIC TEXT SUB-STRUCTURE - CREATE DATE                   * @Z40LB26 46220003
*                                                            * @Z40LB26 46270003
************************************************************** @Z40LB26 46320003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 46370003
         DC    Y(STE10H-STE10G)        TEXT LENGTH             @Z40LB26 46420003
         DC    Y(STE10G-TXT10A)        TEXT OFFSET             @Z40LB26 46470003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 46520003
         DC    Y(STE10H-STE10G)        PRINT FIELD LENGTH      @Z40LB26 46570003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 46580003
************************************************************** @Z40LB26 46620003
*                                                            * @Z40LB26 46670003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 46720003
*                                                            * @Z40LB26 46770003
************************************************************** @Z40LB26 46820003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 46870003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 46920003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 46970003
************************************************************** @Z40LB26 47020003
*                                                            * @Z40LB26 47070003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 47120003
*                                                            * @Z40LB26 47170003
************************************************************** @Z40LB26 47220003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 47270003
         DC    Y(STE10J-STE10H)        TEXT LENGTH             @Z40LB26 47320003
         DC    Y(STE10H-TXT10A)        TEXT OFFSET             @Z40LB26 47370003
         DC    H'15'                   PRINT COLUMN            @Z40LB26 47420003
         DC    Y(STE10J-STE10H)        PRINT FIELD LENGTH      @Z40LB26 47470003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 47480003
************************************************************** @Z40LB26 47520003
*                                                            * @Z40LB26 47570003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 47620003
*                                                            * @Z40LB26 47670003
************************************************************** @Z40LB26 47720003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 47770003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 47820003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 47870003
************************************************************** @Z40LB26 47880003
*                                                            * @Z40LB26 47890003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 47900003
*                                                            * @Z40LB26 47910003
************************************************************** @Z40LB26 47912003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 47914003
         DC    Y(STE10K-STE10J)        TEXT LENGTH             @Z40LB26 47916003
         DC    Y(STE10J-TXT10A)        TEXT OFFSET             @Z40LB26 47918003
         DC    H'18'                   PRINT COLUMN            @Z40LB26 47918403
         DC    Y(STE10K-STE10J)        PRINT FIELD LENGTH      @Z40LB26 47918803
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 47918903
************************************************************** @Z40LB26 47919203
*                                                            * @Z40LB26 47919603
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 47919703
*                                                            * @Z40LB26 47919803
************************************************************** @Z40LB26 47919903
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 47936603
         DC    H'1'                    SINGLE SPACE            @Z40LB26 47946603
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 47948603
************************************************************** @Z40LB26 47950603
*                                                            * @Z40LB26 47952603
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 47953003
*                                                            * @Z40LB26 47953103
************************************************************** @Z40LB26 47953203
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 47958803
         DC    Y(STE10L-STE10K)        TEXT LENGTH             @Z40LB26 47960803
         DC    Y(STE10K-TXT10A)        TEXT OFFSET             @Z40LB26 47962803
         DC    H'18'                   PRINT COLUMN            @Z40LB26 47963203
         DC    Y(STE10L-STE10K)        PRINT FIELD LENGTH      @Z40LB26 47963603
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 47963703
************************************************************** @Z40LB26 47964003
*                                                            * @Z40LB26 47964103
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 47964203
*                                                            * @Z40LB26 47964303
************************************************************** @Z40LB26 47978203
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 47988203
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 47990203
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 47990603
************************************************************** @Z40LB26 47992203
*                                                            * @Z40LB26 48006103
*  STATIC TEXT SUB-STRUCTURE - DATA SET                      * @Z40LB26 48020003
*                                                            * @Z40LB26 48070003
************************************************************** @Z40LB26 48120003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 48170003
         DC    Y(STE10M-STE10L)        TEXT LENGTH             @Z40LB26 48220003
         DC    Y(STE10L-TXT10A)        TEXT OFFSET             @Z40LB26 48270003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 48320003
         DC    Y(STE10M-STE10L)        PRINT FIELD LENGTH      @Z40LB26 48370003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 48380003
************************************************************** @Z40LB26 48420003
*                                                            * @Z40LB26 48470003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 48520003
*                                                            * @Z40LB26 48570003
************************************************************** @Z40LB26 48620003
         DC    X'4000'                 STATIC TEXT FLAG        @Z40LB26 48670003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 48720003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 48770003
************************************************************** @Z40LB26 48820003
*                                                            * @Z40LB26 48870003
*  STATIC TEXT SUB-STRUCTURE - EXPIR DATE                    * @Z40LB26 48920003
*                                                            * @Z40LB26 48970003
************************************************************** @Z40LB26 49020003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 49070003
         DC    Y(STE10N-STE10M)        TEXT LENGTH             @Z40LB26 49320003
         DC    Y(STE10M-TXT10A)        TEXT OFFSET             @Z40LB26 49370003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 49420003
         DC    Y(STE10N-STE10M)        PRINT FIELD LENGTH      @Z40LB26 49470003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 49480003
************************************************************** @Z40LB26 49520003
*                                                            * @Z40LB26 49570003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 49620003
*                                                            * @Z40LB26 49670003
************************************************************** @Z40LB26 49720003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 49770003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 49820003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 49870003
************************************************************** @Z40LB26 49920003
*                                                            * @Z40LB26 49970003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 50020003
*                                                            * @Z40LB26 50070003
************************************************************** @Z40LB26 50120003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 50170003
         DC    Y(STE10P-STE10N)        TEXT LENGTH             @Z40LB26 50220003
         DC    Y(STE10N-TXT10A)        TEXT OFFSET             @Z40LB26 50270003
         DC    H'15'                   PRINT COLUMN            @Z40LB26 50320003
         DC    Y(STE10P-STE10N)        PRINT FIELD LENGTH      @Z40LB26 50370003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 50380003
************************************************************** @Z40LB26 50420003
*                                                            * @Z40LB26 50470003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 50520003
*                                                            * @Z40LB26 50570003
************************************************************** @Z40LB26 50620003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 50670003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 50720003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 50770003
************************************************************** @Z40LB26 50820003
*                                                            * @Z40LB26 50870003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 50920003
*                                                            * @Z40LB26 50970003
************************************************************** @Z40LB26 51020003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 51030003
         DC    Y(STE10Q-STE10P)        TEXT LENGTH             @Z40LB26 51040003
         DC    Y(STE10P-TXT10A)        TEXT OFFSET             @Z40LB26 51050003
         DC    H'18'                   PRINT COLUMN            @Z40LB26 51060003
         DC    Y(STE10Q-STE10P)        PRINT FIELD LENGTH      @Z40LB26 51062003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 51064003
************************************************************** @Z40LB26 51070003
*                                                            * @Z40LB26 51120003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 51170003
*                                                            * @Z40LB26 51220003
************************************************************** @Z40LB26 51270003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 51320003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 51370003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 51420003
************************************************************** @Z40LB26 51424003
*                                                            * @Z40LB26 51426003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 51428003
*                                                            * @Z40LB26 51428403
************************************************************** @Z40LB26 51428803
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 51429203
         DC    Y(STE10R-STE10Q)        TEXT LENGTH             @Z40LB26 51429603
         DC    Y(STE10Q-TXT10A)        TEXT OFFSET             @Z40LB26 51429703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 51429803
         DC    Y(STE10R-STE10Q)        PRINT FIELD LENGTH      @Z40LB26 51429903
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 51433203
************************************************************** @Z40LB26 51436703
*                                                            * @Z40LB26 51440003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 51450003
*                                                            * @Z40LB26 51460003
************************************************************** @Z40LB26 51462003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 51464003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 51466003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 51468003
************************************************************** @Z40LB26 51470003
*                                                            * @Z40LB26 51520003
*  STATIC TEXT SUB-STRUCTURE - OWNER                         * @Z40LB26 51570003
*                                                            * @Z40LB26 51620003
************************************************************** @Z40LB26 51670003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 51720003
         DC    Y(STE10S-STE10R)        TEXT LENGTH             @Z40LB26 51770003
         DC    Y(STE10R-TXT10A)        TEXT OFFSET             @Z40LB26 51820003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 51870003
         DC    Y(STE10S-STE10R)        PRINT FIELD LENGTH      @Z40LB26 51920003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 51930003
************************************************************** @Z40LB26 51970003
*                                                            * @Z40LB26 52020003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 52070003
*                                                            * @Z40LB26 52120003
************************************************************** @Z40LB26 52170003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 52270003
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 52320003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 52370003
************************************************************** @Z40LB26 52420003
*                                                            * @Z40LB26 52470003
*  STATIC TEXT SUB-STRUCTURE - PROT                          * @Z40LB26 52520003
*                                                            * @Z40LB26 52570003
************************************************************** @Z40LB26 52620003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 52670003
         DC    Y(STE10T-STE10S)        TEXT LENGTH             @Z40LB26 52720003
         DC    Y(STE10S-TXT10A)        TEXT OFFSET             @Z40LB26 52770003
         DC    H'1'                    PRINT COLUMN            @Z40LB26 52820003
         DC    Y(STE10T-STE10S)        PRINT FIELD LENGTH      @Z40LB26 52870003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 52880003
************************************************************** @Z40LB26 52890003
*                                                            * @Z40LB26 52900003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 52902003
*                                                            * @Z40LB26 52904003
************************************************************** @Z40LB26 52906003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 52908003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 52908403
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 52908803
************************************************************** @Z40LB26 52910003
*                                                            * @Z40LB26 52912003
*  STATIC TEXT SUB-STRUCTURE FOR NO PROTECTION               * @G24LB31 52914042
*                                                            * @Z40LB26 52916003
************************************************************** @Z40LB26 52918003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 52918403
         DC    Y(STE10T1-STE10T)       TEXT LENGTH             @G24LB31 52918842
         DC    Y(STE10T-TXT10A)        TEXT OFFSET             @Z40LB26 52919203
         DC    H'15'                   PRINT COLUMN            @Z40LB26 52919603
         DC    Y(STE10T1-STE10T)       PRINT FIELD LENGTH      @G24LB31 52919742
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 52929703
************************************************************** @G24LB31 52939742
*                                                            * @G24LB31 52949742
*  SPACING SUB-STRUCTURE                                     * @G24LB31 52959742
*                                                            * @G24LB31 52961742
************************************************************** @G24LB31 52963742
         DC    X'4000'                 SPACING CONTROL FLAG    @G24LB31 52965742
         DC    H'1'                    SINGLE SPACE            @G24LB31 52967742
         DC    C'R '                   RELATIVE SPACING TYPE   @G24LB31 52968142
************************************************************** @G24LB31 52968542
*                                                            * @G24LB31 52968942
*  STATIC TEXT SUB-STRUCTURE FOR RACF                        * @G24LB31 52969342
*                                                            * @G24LB31 52969442
************************************************************** @G24LB31 52969542
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB31 52969642
         DC    Y(STE10T2-STE10T1)      TEXT LENGTH             @G24LB31 52986342
         DC    Y(STE10T1-TXT10A)       TEXT OFFSET             @G24LB31 52996342
         DC    H'18'                   PRINT COLUMN            @G24LB31 52998342
         DC    Y(STE10T2-STE10T1)      PRINT FIELD LENGTH      @G24LB31 53000342
         DC    H'0'                    CONVERSION FLAGS        @G24LB31 53002342
************************************************************** @G24LB31 53002742
*                                                            * @G24LB31 53002842
*  SPACING SUB-STRUCTURE                                     * @G24LB31 53002942
*                                                            * @G24LB31 53008542
************************************************************** @G24LB31 53010542
         DC    X'4000'                 SPACING CONTROL FLAG    @G24LB31 53012542
         DC    H'1'                    SINGLE SPACE            @G24LB31 53012942
         DC    C'R '                   RELATIVE SPACING TYPE   @G24LB31 53013342
************************************************************** @G24LB31 53013742
*                                                            * @G24LB31 53013842
*  STATIC TEXT SUB-STRUCTURE FOR RF,R                        * @G24LB31 53013942
*                                                            * @G24LB31 53014042
************************************************************** @G24LB31 53027942
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB31 53037942
         DC    Y(STE10T3-STE10T2)      TEXT LENGTH             @G24LB31 53039942
         DC    Y(STE10T2-TXT10A)       TEXT OFFSET             @G24LB31 53040342
         DC    H'18'                   PRINT COLUMN            @G24LB31 53040742
         DC    Y(STE10T3-STE10T2)      PRINT FIELD LENGTH      @G24LB31 53041142
         DC    H'0'                    CONVERSION FLAGS        @G24LB31 53041542
************************************************************** @G24LB31 53041642
*                                                            * @G24LB31 53041742
*  SPACING SUB-STRUCTURE                                     * @G24LB31 53041842
*                                                            * @G24LB31 53046442
************************************************************** @G24LB31 53048442
         DC    X'4000'                 SPACING CONTROL FLAG    @G24LB31 53050442
         DC    H'1'                    SINGLE SPACE            @G24LB31 53050842
         DC    C'R '                   RELATIVE SPACING TYPE   @G24LB31 53050942
************************************************************** @G24LB31 53051042
*                                                            * @G24LB31 53051142
*  STATIC TEXT SUB-STRUCTURE FOR RF,W                        * @G24LB31 53055742
*                                                            * @G24LB31 53057742
************************************************************** @G24LB31 53059742
         DC    X'0400'                 STATIC TEXT FLAG        @G24LB31 53060142
         DC    Y(STE10U-STE10T3)       TEXT LENGTH             @G24LB31 53060242
         DC    Y(STE10T3-TXT10A)       TEXT OFFSET             @G24LB31 53060342
         DC    H'18'                   PRINT COLUMN            @G24LB31 53060442
         DC    Y(STE10U-STE10T3)       PRINT FIELD LENGTH      @G24LB31 53072242
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 53082242
************************************************************** @Z40LB26 53084342
*                                                            * @Z40LB26 53096142
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 53107942
*                                                            * @Z40LB26 53119703
************************************************************** @Z40LB26 53169703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 53219703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 53269703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 53319703
************************************************************** @Z40LB26 53370003
*                                                            * @Z40LB26 53420003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 53470003
*                                                            * @Z40LB26 53520003
************************************************************** @Z40LB26 53570003
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 53620003
         DC    Y(STE10V-STE10U)        TEXT LENGTH             @Z40LB26 53670003
         DC    Y(STE10U-TXT10A)        TEXT OFFSET             @Z40LB26 53720003
         DC    H'18'                   PRINT COLUMN            @Z40LB26 53770003
         DC    Y(STE10V-STE10U)        PRINT FIELD LENGTH      @Z40LB26 53820003
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 53830003
************************************************************** @Z40LB26 53870003
*                                                            * @Z40LB26 53920003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 53970003
*                                                            * @Z40LB26 54020003
************************************************************** @Z40LB26 54070003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 54080003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 54090003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 54100003
************************************************************** @Z40LB26 54110003
*                                                            * @Z40LB26 54112003
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 54114003
*                                                            * @Z40LB26 54116003
************************************************************** @Z40LB26 54118003
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB26 54118403
         DC    Y(STE10W-STE10V)        TEXT LENGTH             @Z40LB26 54118803
         DC    Y(STE10V-TXT10A)        TEXT OFFSET             @Z40LB26 54119203
         DC    H'18'                   PRINT COLUMN            @Z40LB26 54119603
         DC    Y(STE10W-STE10V)        PRINT FIELD LENGTH      @Z40LB26 54119703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 54132203
************************************************************** @Z40LB26 54144903
*                                                            * @Z40LB26 54157403
*  STATIC TEXT ENTRIES                                       * @Z40LB26 54169903
*                                                            * @Z40LB26 54179903
************************************************************** @Z40LB26 54189903
STE10B   DC    C'-FIELD-       -DESCRIPTION-'                  @Z40LB26 54209903
STE10C   DC    C'CAT           CATALOGED STATUS OF DATA SET.'  @Z40LB26 54211903
         DC    C' A BLANK INDICATES CATALOGED.'                @Z40LB26 54213903
STE10D   DC    C'A NUMBER INDICATES A CATALOGED MULTI-VOLUME'  @Z40LB26 54215903
         DC    C' DATA SET ON A GIVEN'                         @Z40LB26 54218003
STE10D1  DC    C'NUMBER OF VOLUMES.'                           @Z40LB26 54218403
STE10E   DC    C'ERR  - A CATALOG ERROR MESSAGE HAS BEEN'      @Z40LB26 54218703
         DC    C' PRINTED'                                     @Z40LB26 54219103
STE10F   DC    C'NO   - NOT CATALOGED'                         @Z40LB26 54219503
STE10G   DC    C'CREATE DATE   LATEST CREATION DATE, WITH'     @Z40LB26 54219603
         DC    C' THE FOLLOWING SUFFIX.'                       @Z40LB26 54219703
STE10H   DC    C'IF NO SUFFIX IS SPECIFIED, DATE IN CATALOG'   @Z40LB26 54219803
         DC    C' AND VTOC ARE THE SAME.'                      @Z40LB26 54236403
STE10J   DC    C'C    - DATE OBTAINED FROM CATALOG'            @Z40LB26 54246403
STE10K   DC    C'V    - DATE OBTAINED FROM VTOC'               @Z40LB26 54248403
STE10L   DC    C'DATA SET      DATA SET NAME'                  @Z40LB26 54250403
STE10M   DC    C'EXPIR DATE    LATEST EXPIRATION DATE, WITH'   @Z40LB26 54252403
         DC    C' THE FOLLOWING SUFFIX.'                       @Z40LB26 54252803
STE10N   DC    C'IF NO SUFFIX IS SPECIFIED, DATE IN CATALOG'   @Z40LB26 54253203
         DC    C' AND VTOC ARE THE SAME.'                      @Z40LB26 54269803
STE10P   DC    C'C    -DATE OBTAINED FROM CATALOG'             @Z40LB26 54279803
STE10Q   DC    C'V    -DATE OBTAINED FROM VTOC'                @Z40LB26 54289803
STE10R   DC    C'OWNER         OWNER OF THE DATA SET'          @Z40LB26 54299803
STE10S   DC    C'PROT          TYPE OF PROTECTION ASSIGNED'    @Z40LB26 54309803
         DC    C' TO DATA SET'                                 @Z40LB26 54311803
STE10T   DC    C'A BLANK INDICATES NO PROTECTION.'             @Z40LB26 54313803
STE10T1  DC    C'RACF  -RACF PROTECTION'                       @G24LB31 54314242
STE10T2  DC    C'RF,R  -RACF PLUS READ AND WRITE PASSWORD '    @G24LB31 54314642
         DC    C'PROTECTION'                                   @G24LB31 54315042
STE10T3  DC    C'RF,W  -RACF PLUS WRITE PASSWORD PROTECTION'   @G24LB31 54315442
STE10U   DC    C'R/W   -READ AND WRITE PASSWORD PROTECTION'    @Z40LB26 54315803
STE10V   DC    C'W     -WRITE PASSWORD PROTECTION'             @Z40LB26 54317803
STE10W   EQU   *                                               @Z40LB26 54318203
TXT10B   EQU   *                                               @Z40LB26 54318603
         EJECT                                                 @Z40LB26 54319003
************************************************************** @Z40LB26 54319403
*                                                            * @Z40LB26 54319503
*  LEGEND FOR SPACE USAGE REPORT                             * @Z40LB26 54319603
*                                                            * @Z40LB26 54353003
************************************************************** @Z40LB26 54369703
TXT11    DC    Y(TXT11B-TXT11A)        ENTRY LENGTH            @Z40LB26 54379703
         DC    H'0'                    FLAGS                   @Z40LB26 54389703
************************************************************** @Z40LB26 54399703
*                                                            * @Z40LB26 54409703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 54411703
*                                                            * @Z40LB26 54413703
************************************************************** @Z40LB26 54415703
TXT11A   DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 54417703
         DC    H'2'                    IGNORED                 @Z40LB26 54418103
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 54418503
************************************************************** @Z40LB26 54517603
*                                                            * @Z40LB26 54518003
*  STATIC TEXT SUB-STRUCTURE - FIELD DESCRIPTION             * @Z40LB26 54518403
*                                                            * @Z40LB26 54518803
************************************************************** @Z40LB26 54519203
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 54519503
         DC    Y(STE11C-STE11B)        TEXT LENGTH             @Z40LB26 54521603
         DC    Y(STE11B-TXT11A)        TEXT OFFSET             @Z40LB26 54529603
         DC    H'1'                    PRINT COLUMN            @Z40LB26 54569503
         DC    Y(STE11C-STE11B)        PRINT FIELD LENGTH      @Z40LB26 54579503
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 54581503
************************************************************** @Z40LB26 54589503
*                                                            * @Z40LB26 54599503
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 54609503
*                                                            * @Z40LB26 54611503
************************************************************** @Z40LB26 54613503
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 54615503
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 54617503
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 54617903
************************************************************** @Z40LB26 54618303
*                                                            * @Z40LB26 54618703
*  STATIC TEXT SUB-STRUCTURE - ALLOC UNIT                    * @Z40LB26 54619103
*                                                            * @Z40LB26 54619203
************************************************************** @Z40LB26 54619303
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 54619403
         DC    Y(STE11D-STE11C)        TEXT LENGTH             @Z40LB26 54669403
         DC    Y(STE11C-TXT11A)        TEXT OFFSET             @Z40LB26 54679403
         DC    H'1'                    PRINT COLUMN            @Z40LB26 54689403
         DC    Y(STE11D-STE11C)        PRINT FIELD LENGTH      @Z40LB26 54699403
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 54701403
************************************************************** @Z40LB26 54709403
*                                                            * @Z40LB26 54711403
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 54713403
*                                                            * @Z40LB26 54715403
************************************************************** @Z40LB26 54717403
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 54717803
         DC    H'1'                    SINGLE SPACE            @Z40LB26 54718203
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 54718603
************************************************************** @Z40LB26 54719003
*                                                            * @Z40LB26 54719103
*  STATIC TEXT SUB-STRUCTURE - ABSTR                         * @Z40LB26 54719203
*                                                            * @Z40LB26 54719303
************************************************************** @Z40LB26 54769303
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 54779303
         DC    Y(STE11E-STE11D)        TEXT LENGTH             @Z40LB26 54789303
         DC    Y(STE11D-TXT11A)        TEXT OFFSET             @Z40LB26 54799303
         DC    H'18'                   PRINT COLUMN            @Z40LB26 54809303
         DC    Y(STE11E-STE11D)        PRINT FIELD LENGTH      @Z40LB26 54811303
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 54811703
************************************************************** @Z40LB26 54813303
*                                                            * @Z40LB26 54815303
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 54817303
*                                                            * @Z40LB26 54817703
************************************************************** @Z40LB26 54818103
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 54818203
         DC    H'1'                    SINGLE SPACE            @Z40LB26 54818303
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 54818403
************************************************************** @Z40LB26 54899203
*                                                            * @Z40LB26 54909203
*  STATIC TEXT SUB-STRUCTURE - BLK                           * @Z40LB26 54911203
*                                                            * @Z40LB26 54913203
************************************************************** @Z40LB26 54915203
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 54917203
         DC    Y(STE11F-STE11E)        TEXT LENGTH             @Z40LB26 54917603
         DC    Y(STE11E-TXT11A)        TEXT OFFSET             @Z40LB26 54918003
         DC    H'18'                   PRINT COLUMN            @Z40LB26 54918403
         DC    Y(STE11F-STE11E)        PRINT FIELD LENGTH      @Z40LB26 54918803
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 54928803
************************************************************** @Z40LB26 54939103
*                                                            * @Z40LB26 54949103
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 54959103
*                                                            * @Z40LB26 54969103
************************************************************** @Z40LB26 54979103
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 54989103
         DC    H'1'                    SINGLE SPACE            @Z40LB26 54999103
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 55009103
************************************************************** @Z40LB26 55011103
*                                                            * @Z40LB26 55013103
*  STATIC TEXT SUB-STRUCTURE - CYL                           * @Z40LB26 55015103
*                                                            * @Z40LB26 55017103
************************************************************** @Z40LB26 55017503
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 55017903
         DC    Y(STE11G-STE11F)        TEXT LENGTH             @Z40LB26 55018303
         DC    Y(STE11F-TXT11A)        TEXT OFFSET             @Z40LB26 55018703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 55018803
         DC    Y(STE11G-STE11F)        PRINT FIELD LENGTH      @Z40LB26 55018903
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 55035603
************************************************************** @Z40LB26 55052303
*                                                            * @Z40LB26 55069003
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 55079003
*                                                            * @Z40LB26 55089003
************************************************************** @Z40LB26 55099003
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 55109003
         DC    H'1'                    SINGLE SPACE            @Z40LB26 55111003
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 55113003
************************************************************** @Z40LB26 55115003
*                                                            * @Z40LB26 55117003
*  STATIC TEXT SUB-STRUCTURE - TRK                           * @Z40LB26 55117403
*                                                            * @Z40LB26 55117803
************************************************************** @Z40LB26 55118203
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 55118603
         DC    Y(STE11H-STE11G)        TEXT LENGTH             @Z40LB26 55118703
         DC    Y(STE11G-TXT11A)        TEXT OFFSET             @Z40LB26 55118803
         DC    H'18'                   PRINT COLUMN            @Z40LB26 55118903
         DC    Y(STE11H-STE11G)        PRINT FIELD LENGTH      @Z40LB26 55168903
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 55170903
************************************************************** @Z40LB26 55178903
*                                                            * @Z40LB26 55188903
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 55198903
*                                                            * @Z40LB26 55208903
************************************************************** @Z40LB26 55210903
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 55212903
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 55214903
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 55216903
************************************************************** @Z40LB26 55217303
*                                                            * @Z40LB26 55217703
*  STATIC TEXT SUB-STRUCTURE - DATA SET                      * @Z40LB26 55218103
*                                                            * @Z40LB26 55218503
************************************************************** @Z40LB26 55218603
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 55218703
         DC    Y(STE11I-STE11H)        TEXT LENGTH             @Z40LB26 55218803
         DC    Y(STE11H-TXT11A)        TEXT OFFSET             @Z40LB26 55268803
         DC    H'1'                    PRINT COLUMN            @Z40LB26 55278803
         DC    Y(STE11I-STE11H)        PRINT FIELD LENGTH      @Z40LB26 55288803
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 55290803
************************************************************** @Z40LB26 55298803
*                                                            * @Z40LB26 55308803
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 55310803
*                                                            * @Z40LB26 55312803
************************************************************** @Z40LB26 55314803
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 55316803
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 55317203
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 55317603
************************************************************** @Z40LB26 55318003
*                                                            * @Z40LB26 55318403
*  STATIC TEXT SUB-STRUCTURE - DS ORG                        * @Z40LB26 55318503
*                                                            * @Z40LB26 55318603
************************************************************** @Z40LB26 55318703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 55368703
         DC    Y(STE11J-STE11I)        TEXT LENGTH             @Z40LB26 55378703
         DC    Y(STE11I-TXT11A)        TEXT OFFSET             @Z40LB26 55388703
         DC    H'1'                    PRINT COLUMN            @Z40LB26 55398703
         DC    Y(STE11J-STE11I)        PRINT FIELD LENGTH      @Z40LB26 55408703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 55409103
************************************************************** @Z40LB26 55410703
*                                                            * @Z40LB26 55412703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 55414703
*                                                            * @Z40LB26 55416703
************************************************************** @Z40LB26 55417103
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 55417503
         DC    H'1'                    SINGLE SPACE            @Z40LB26 55417903
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 55418303
************************************************************** @Z40LB26 55868703
*                                                            * @Z40LB26 55918703
*  STATIC TEXT SUB-STRUCTURE - DA                            * @Z40LB26 55968703
*                                                            * @Z40LB26 56018703
************************************************************** @Z40LB26 56068703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 56118703
         DC    Y(STE11K-STE11J)        TEXT LENGTH             @Z40LB26 56168703
         DC    Y(STE11J-TXT11A)        TEXT OFFSET             @Z40LB26 56218703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 56268703
         DC    Y(STE11K-STE11J)        PRINT FIELD LENGTH      @Z40LB26 56318703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 56328703
************************************************************** @Z40LB26 56368703
*                                                            * @Z40LB26 56418703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 56468703
*                                                            * @Z40LB26 56518703
************************************************************** @Z40LB26 56568703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 56618703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 56668703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 56718703
************************************************************** @Z40LB26 56728703
*                                                            * @Z40LB26 56738703
*  STATIC TEXT SUB-STRUCTURE - DAU                           * @Z40LB26 56748703
*                                                            * @Z40LB26 56758703
************************************************************** @Z40LB26 56760703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 56762703
         DC    Y(STE11L-STE11K)        TEXT LENGTH             @Z40LB26 56764703
         DC    Y(STE11K-TXT11A)        TEXT OFFSET             @Z40LB26 56766703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 56767103
         DC    Y(STE11L-STE11K)        PRINT FIELD LENGTH      @Z40LB26 56767503
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 56767603
************************************************************** @Z40LB26 56767903
*                                                            * @Z40LB26 56768303
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 56768403
*                                                            * @Z40LB26 56768503
************************************************************** @Z40LB26 56768603
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 56785303
         DC    H'1'                    SINGLE SPACE            @Z40LB26 56795303
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 56797303
************************************************************** @Z40LB26 56802003
*                                                            * @Z40LB26 56818703
*  STATIC TEXT SUB-STRUCTURE - IS                            * @Z40LB26 56868703
*                                                            * @Z40LB26 56918703
************************************************************** @Z40LB26 56968703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 57018703
         DC    Y(STE11M-STE11L)        TEXT LENGTH             @Z40LB26 57068703
         DC    Y(STE11L-TXT11A)        TEXT OFFSET             @Z40LB26 57118703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 57168703
         DC    Y(STE11M-STE11L)        PRINT FIELD LENGTH      @Z40LB26 57218703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 57228703
************************************************************** @Z40LB26 57268703
*                                                            * @Z40LB26 57318703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 57368703
*                                                            * @Z40LB26 57418703
************************************************************** @Z40LB26 57468703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 57518703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 57568703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 57618703
************************************************************** @Z40LB26 57668703
*                                                            * @Z40LB26 57718703
*  STATIC TEXT SUB-STRUCTURE - ISU                           * @Z40LB26 57768703
*                                                            * @Z40LB26 57818703
************************************************************** @Z40LB26 57868703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 57918703
         DC    Y(STE11N-STE11M)        TEXT LENGTH             @Z40LB26 57968703
         DC    Y(STE11M-TXT11A)        TEXT OFFSET             @Z40LB26 58018703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 58068703
         DC    Y(STE11N-STE11M)        PRINT FIELD LENGTH      @Z40LB26 58118703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 58128703
************************************************************** @Z40LB26 58168703
*                                                            * @Z40LB26 58218703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 58268703
*                                                            * @Z40LB26 58318703
************************************************************** @Z40LB26 58368703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 58418703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 58468703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 58518703
************************************************************** @Z40LB26 58568703
*                                                            * @Z40LB26 58618703
*  STATIC TEXT SUB-STRUCTURE - PO                            * @Z40LB26 58668703
*                                                            * @Z40LB26 58718703
************************************************************** @Z40LB26 58768703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 58818703
         DC    Y(STE11O-STE11N)        TEXT LENGTH             @Z40LB26 58868703
         DC    Y(STE11N-TXT11A)        TEXT OFFSET             @Z40LB26 58918703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 58968703
         DC    Y(STE11O-STE11N)        PRINT FIELD LENGTH      @Z40LB26 59018703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 59028703
************************************************************** @Z40LB26 59068703
*                                                            * @Z40LB26 59118703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 59168703
*                                                            * @Z40LB26 59218703
************************************************************** @Z40LB26 59268703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 59318703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 59368703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 59418703
************************************************************** @Z40LB26 59468703
*                                                            * @Z40LB26 59518703
*  STATIC TEXT SUB-STRUCTURE - POU                           * @Z40LB26 59568703
*                                                            * @Z40LB26 59618703
************************************************************** @Z40LB26 59668703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 59718703
         DC    Y(STE11P-STE11O)        TEXT LENGTH             @Z40LB26 59768703
         DC    Y(STE11O-TXT11A)        TEXT OFFSET             @Z40LB26 59818703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 59868703
         DC    Y(STE11P-STE11O)        PRINT FIELD LENGTH      @Z40LB26 59918703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 59928703
************************************************************** @Z40LB26 59968703
*                                                            * @Z40LB26 60018703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 60068703
*                                                            * @Z40LB26 60118703
************************************************************** @Z40LB26 60168703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 60218703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 60268703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 60318703
************************************************************** @Z40LB26 60368703
*                                                            * @Z40LB26 60418703
*  STATIC TEXT SUB-STRUCTURE - PS                            * @Z40LB26 60468703
*                                                            * @Z40LB26 60518703
************************************************************** @Z40LB26 60568703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 60618703
         DC    Y(STE11Q-STE11P)        TEXT LENGTH             @Z40LB26 60668703
         DC    Y(STE11P-TXT11A)        TEXT OFFSET             @Z40LB26 60718703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 60768703
         DC    Y(STE11Q-STE11P)        PRINT FIELD LENGTH      @Z40LB26 60818703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 60828703
************************************************************** @Z40LB26 60868703
*                                                            * @Z40LB26 60918703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 60968703
*                                                            * @Z40LB26 61018703
************************************************************** @Z40LB26 61068703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 61118703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 61168703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 61218703
************************************************************** @Z40LB26 61318703
*                                                            * @Z40LB26 61368703
*  STATIC TEXT SUB-STRUCTURE - PSU                           * @Z40LB26 61418703
*                                                            * @Z40LB26 61468703
************************************************************** @Z40LB26 61518703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 61568703
         DC    Y(STE11R-STE11Q)        TEXT LENGTH             @Z40LB26 61618703
         DC    Y(STE11Q-TXT11A)        TEXT OFFSET             @Z40LB26 61668703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 61718703
         DC    Y(STE11R-STE11Q)        PRINT FIELD LENGTH      @Z40LB26 61768703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 61778703
************************************************************** @Z40LB26 61818703
*                                                            * @Z40LB26 61868703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 61918703
*                                                            * @Z40LB26 61968703
************************************************************** @Z40LB26 62018703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 62068703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 62118703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 62168703
************************************************************** @Z40LB26 62218703
*                                                            * @Z40LB26 62268703
*  STATIC TEXT SUB-STRUCTURE - UN                            * @Z40LB26 62318703
*                                                            * @Z40LB26 62368703
************************************************************** @Z40LB26 62418703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 62468703
         DC    Y(STE11S-STE11R)        TEXT LENGTH             @Z40LB26 62518703
         DC    Y(STE11R-TXT11A)        TEXT OFFSET             @Z40LB26 62568703
         DC    H'18'                   PRINT COLUMN            @Z40LB26 62618703
         DC    Y(STE11S-STE11R)        PRINT FIELD LENGTH      @Z40LB26 62668703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 62678703
************************************************************** @Z40LB26 62718703
*                                                            * @Z40LB26 62768703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 62818703
*                                                            * @Z40LB26 62868703
************************************************************** @Z40LB26 62918703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 62968703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 63018703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 63068703
************************************************************** @Z40LB26 63118703
*                                                            * @Z40LB26 63168703
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 63218703
*                                                            * @Z40LB26 63268703
************************************************************** @Z40LB26 63318703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 63368703
         DC    Y(STE11T-STE11S)        TEXT LENGTH             @Z40LB26 63418703
         DC    Y(STE11S-TXT11A)        TEXT OFFSET             @Z40LB26 63468703
         DC    H'24'                   PRINT COLUMN            @Z40LB26 63518703
         DC    Y(STE11T-STE11S)        PRINT FIELD LENGTH      @Z40LB26 63568703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 63578703
************************************************************** @Z40LB26 63618703
*                                                            * @Z40LB26 63668703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 63718703
*                                                            * @Z40LB26 63768703
************************************************************** @Z40LB26 63818703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 63868703
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 63918703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 63968703
************************************************************** @Z40LB26 64018703
*                                                            * @Z40LB26 64068703
*  STATIC TEXT SUB-STRUCTURE - FREE TRKS                     * @Z40LB26 64118703
*                                                            * @Z40LB26 64168703
************************************************************** @Z40LB26 64218703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 64268703
         DC    Y(STE11U-STE11T)        TEXT LENGTH             @Z40LB26 64318703
         DC    Y(STE11T-TXT11A)        TEXT OFFSET             @Z40LB26 64368703
         DC    H'1'                    PRINT COLUMN            @Z40LB26 64418703
         DC    Y(STE11U-STE11T)        PRINT FIELD LENGTH      @Z40LB26 64468703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 64478703
************************************************************** @Z40LB26 64518703
*                                                            * @Z40LB26 64568703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 64618703
*                                                            * @Z40LB26 64668703
************************************************************** @Z40LB26 64718703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 64768703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 64818703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 64868703
************************************************************** @Z40LB26 64968703
*                                                            * @Z40LB26 65018703
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 65068703
*                                                            * @Z40LB26 65118703
************************************************************** @Z40LB26 65168703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 65218703
         DC    Y(STE11U1-STE11U)        TEXT LENGTH            @Z40LB26 65268703
         DC    Y(STE11U-TXT11A)        TEXT OFFSET             @Z40LB26 65318703
         DC    H'15'                   PRINT COLUMN            @Z40LB26 65368703
         DC    Y(STE11U1-STE11U)        PRINT FIELD LENGTH     @Z40LB26 65418703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 65428703
************************************************************** @Z40LB26 65438703
*                                                            * @Z40LB26 65448703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 65458703
*                                                            * @Z40LB26 65460703
************************************************************** @Z40LB26 65462703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 65464703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 65466703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 65467103
************************************************************** @Z40LB26 65467503
*                                                            * @Z40LB26 65467903
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 65468303
*                                                            * @Z40LB26 65468403
************************************************************** @Z40LB26 65468503
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 65468603
         DC    Y(STE11U2-STE11U1)       TEXT LENGTH            @ZA29215 65485300
         DC    Y(STE11U1-TXT11A)        TEXT OFFSET            @Z40LB26 65485900
         DC    H'15'                   PRINT COLUMN            @Z40LB26 65486500
         DC    Y(STE11U2-STE11U1)       PRINT FIELD LENGTH     @ZA29215 65487100
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 65487700
************************************************************** @ZA29215 65488300
*                                                            * @ZA29215 65488900
*  SPACING SUB-STRUCTURE                                     * @ZA29215 65489500
*                                                            * @ZA29215 65490100
************************************************************** @ZA29215 65490700
         DC    X'4000'                 SPACING CONTROL FLAG    @ZA29215 65491300
         DC    H'1'                    SINGLE SPACE            @ZA29215 65491900
         DC    C'R '                   RELATIVE SPACING TYPE   @ZA29215 65492500
************************************************************** @ZA29215 65493100
*                                                            * @ZA29215 65493700
*  STATIC TEXT SUB-STRUCTURE                                 * @ZA29215 65494300
*                                                            * @ZA29215 65494900
************************************************************** @ZA29215 65495500
         DC    X'0400'                 STATIC TEXT FLAG        @ZA29215 65496100
         DC    Y(STE11V-STE11U2)        TEXT LENGTH            @ZA29215 65496700
         DC    Y(STE11U2-TXT11A)        TEXT OFFSET            @ZA29215 65497300
         DC    H'15'                   PRINT COLUMN            @ZA29215 65497900
         DC    Y(STE11V-STE11U2)        PRINT FIELD LENGTH     @ZA29215 65498500
         DC    H'0'                    CONVERSION FLAGS        @ZA29215 65499100
************************************************************** @Z40LB26 65502003
*                                                            * @Z40LB26 65518703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 65568703
*                                                            * @Z40LB26 65618703
************************************************************** @Z40LB26 65668703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 65718703
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 65768703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 65818703
************************************************************** @Z40LB26 65868703
*                                                            * @Z40LB26 65918703
*  STATIC TEXT SUB-STRUCTURE - NO EXTS                       * @Z40LB26 65968703
*                                                            * @Z40LB26 66018703
************************************************************** @Z40LB26 66068703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 66118703
         DC    Y(STE11W-STE11V)        TEXT LENGTH             @Z40LB26 66168703
         DC    Y(STE11V-TXT11A)        TEXT OFFSET             @Z40LB26 66218703
         DC    H'1'                    PRINT COLUMN            @Z40LB26 66268703
         DC    Y(STE11W-STE11V)        PRINT FIELD LENGTH      @Z40LB26 66318703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 66328703
************************************************************** @Z40LB26 66368703
*                                                            * @Z40LB26 66418703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 66468703
*                                                            * @Z40LB26 66518703
************************************************************** @Z40LB26 66568703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 66618703
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 66668703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 66718703
************************************************************** @Z40LB26 66768703
*                                                            * @Z40LB26 66818703
*  STATIC TEXT SUB-STRUCTURE - SEC ALLOC                     * @Z40LB26 66868703
*                                                            * @Z40LB26 66918703
************************************************************** @Z40LB26 66968703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 67018703
         DC    Y(STE11X-STE11W)        TEXT LENGTH             @Z40LB26 67068703
         DC    Y(STE11W-TXT11A)        TEXT OFFSET             @Z40LB26 67118703
         DC    H'1'                    PRINT COLUMN            @Z40LB26 67168703
         DC    Y(STE11X-STE11W)        PRINT FIELD LENGTH      @Z40LB26 67218703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 67228703
************************************************************** @Z40LB26 67268703
*                                                            * @Z40LB26 67318703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 67368703
*                                                            * @Z40LB26 67418703
************************************************************** @Z40LB26 67468703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 67518703
         DC    H'1'                    SINGLE SPACE            @Z40LB26 67568703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 67618703
************************************************************** @Z40LB26 67668703
*                                                            * @Z40LB26 67718703
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 67768703
*                                                            * @Z40LB26 67818703
************************************************************** @Z40LB26 67868703
         DC    X'0400'                 STATIC TEXT FLAG        @Z40LB26 67918703
         DC    Y(STE11Y-STE11X)        TEXT LENGTH             @Z40LB26 67968703
         DC    Y(STE11X-TXT11A)        TEXT OFFSET             @Z40LB26 68018703
         DC    H'15'                   PRINT COLUMN            @Z40LB26 68068703
         DC    Y(STE11Y-STE11X)        PRINT FIELD LENGTH      @Z40LB26 68118703
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 68128703
************************************************************** @Z40LB26 68168703
*                                                            * @Z40LB26 68218703
*  SPACING SUB-STRUCTURE                                     * @Z40LB26 68268703
*                                                            * @Z40LB26 68318703
************************************************************** @Z40LB26 68368703
         DC    X'4000'                 SPACING CONTROL FLAG    @Z40LB26 68418703
         DC    H'2'                    DOUBLE SPACE            @Z40LB26 68468703
         DC    C'R '                   RELATIVE SPACING TYPE   @Z40LB26 68518703
************************************************************** @Z40LB26 68528703
*                                                            * @Z40LB26 68538703
*  STATIC TEXT SUB-STRUCTURE - TOTAL TRKS                    * @Z40LB26 68548703
*                                                            * @Z40LB26 68558703
************************************************************** @Z40LB26 68560703
         DC    X'8400'                 STATIC TEXT FLAG        @Z40LB26 68562703
         DC    Y(TXT11B-STE11Y)        TEXT LENGTH             @Z40LB26 68564703
         DC    Y(STE11Y-TXT11A)        TEXT OFFSET             @Z40LB26 68566703
         DC    H'1'                    PRINT COLUMN            @Z40LB26 68567103
         DC    Y(TXT11B-STE11Y)        PRINT FIELD LENGTH      @Z40LB26 68567503
         DC    H'0'                    CONVERSION FLAGS        @Z40LB26 68567603
************************************************************** @Z40LB26 68676703
*                                                            * @Z40LB26 68680903
*  STATIC TEXT ENTRIES                                       * @Z40LB26 68685103
*                                                            * @Z40LB26 68701903
************************************************************** @Z40LB26 68718503
STE11B   DC    C'-FIELD-       -DESCRIPTION-'                  @Z40LB26 68738503
STE11C   DC    C'ALLOC UNIT    TYPE OF UNIT IN WHICH SPACE'    @Z40LB26 68748503
         DC    C' WAS ALLOCATED'                               @Z40LB26 68758503
STE11D   DC    C'ABSTR - ABSOLUTE TRACKS'                      @Z40LB26 68760503
STE11E   DC    C'BLK   - BLOCKS'                               @Z40LB26 68762503
STE11F   DC    C'CYL   - CYLINDERS'                            @Z40LB26 68764503
STE11G   DC    C'TRK   - TRACKS'                               @Z40LB26 68766503
STE11H   DC    C'DATA SET      DATA SET NAME'                  @Z40LB26 68766903
STE11I   DC    C'DS ORG        DATA SET ORGANIZATION'          @Z40LB26 68767303
STE11J   DC    C'DA  - DIRECT ACCESS'                          @Z40LB26 68767703
STE11K   DC    C'DAU - DIRECT ACCESS UNMOVABLE'                @Z40LB26 68768103
STE11L   DC    C'IS  - INDEXED SEQUENTIAL'                     @Z40LB26 68768203
STE11M   DC    C'ISU - INDEXED SEQUENTIAL UNMOVABLE'           @Z40LB26 68768303
STE11N   DC    C'PO  - PARTITIONED'                            @Z40LB26 68768403
STE11O   DC    C'POU - PARTITIONED UNMOVABLE'                  @Z40LB26 68818403
STE11P   DC    C'PS  - PHYSICAL SEQUENTIAL'                    @Z40LB26 68828403
STE11Q   DC    C'PSU - PHYSICAL SEQUENTIAL UNMOVABLE'          @Z40LB26 68830403
STE11R   DC    C'UN  - UNDEFINED. EITHER NO DATA SET'          @Z40LB26 68838403
         DC    C' ORGANIZATION SPECIFIED,'                     @Z40LB26 68848403
STE11S   DC    C' OR OTHER THAN THE ABOVE.'                    @Z40LB26 68858403
STE11T   DC    C'FREE TRKS     NUMBER OF UNUSED TRACKS IN THE' @Z40LB26 68860403
         DC    C' DATA SET.  BLANK IF THE FREE SPACE'          @Z40LB26 68862403
STE11U   DC    C'CANNOT BE CALCULATED BECAUSE DSORG IS'        @Z40LB26 68864403
         DC    C' DA, IS, OR UN, OR BECAUSE'                   @Z40LB26 68866403
STE11U1  DC    C'DSORG IS PS OR PO AND THE DATA SET HAS TRACK' @Z40LB26 68916403
         DC    C' OVERFLOW OR'                                 @ZA29215 68916600
STE11U2  DC    C'THE END OF DATA SET POINTERS IN THE FORMAT'   @ZA29215 68926600
         DC    C' ONE DSCB ARE INCONSISTENT.'                  @ZA29215 68936600
STE11V   DC    C'NO. EXTS      TOTAL NUMBER OF EXTENTS'        @Z40LB26 68946600
STE11W   DC    C'SEC ALLOC     NUMBER OF BLOCKS, TRACKS, OR'   @Z40LB26 68966803
         DC    C' CYLINDERS TO BE ALLOCATED IF MORE'           @Z40LB26 69016803
STE11X   DC    C'SPACE IS REQUIRED FOR THE DATA SET.  BLANK'   @Z40LB26 69066803
         DC    C' IF GREATER THAN 9999.'                       @Z40LB26 69116803
STE11Y   DC    C'TOTAL TRKS    NUMBER OF TRACKS ALLOCATED TO'  @Z40LB26 69166803
         DC    C' A DATA SET, USED AND UNUSED.'                @Z40LB26 69216803
TXT11B   EQU   *                                               @Z40LB26 69316803
         EJECT                                                 @Z40LB26 69366803
************************************************************** @Z40LB26 69416803
*                                                            * @Z40LB26 69466803
*  MISC PRINT CONSTANTS                                      * @Z40LB26 69516803
*                                                            * @Z40LB26 69566803
************************************************************** @Z40LB26 69616803
TXT12    DC    Y(TXT12B-TXT12A)        ENTRY LENGTH            @Z40LB26 69666803
         DC    H'0'                                            @Z40LB26 69716803
************************************************************** @Z40LB26 69766803
*                                                            * @Z40LB26 69816803
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 69866803
*                                                            * @Z40LB26 69916803
************************************************************** @Z40LB26 69966803
TXT12A   DC    X'8400'                 STATIC TEXT FLAG        @Z40LB26 70016803
         DC    Y(STE12B-STE12A)        TEXT LENGTH             @Z40LB26 70066803
         DC    Y(STE12A-TXT12A)        TEXT OFFSET             @Z40LB26 70116803
         DC    H'1'                    PRINT COLUMN            @Z40LB26 70166803
         DC    Y(STE12B-STE12A)        PRINT FIELD LENGTH      @Z40LB26 70216803
         DC    H'0'                    NO CONVERSION           @Z40LB26 70266803
************************************************************** @Z40LB26 70316803
*                                                            * @Z40LB26 70366803
*  STATIC TEXT ENTRIES                                       * @Z40LB26 70416803
*                                                            * @Z40LB26 70466803
************************************************************** @Z40LB26 70516803
STE12A   DC    C'-V-CR/W W    NOERRPO PS UN DA IS UCYL'        @G24LB31 70566842
         DC    C'  TRK  BLK  ABSTRRACFRF,RRF,W'                @G24LB31 70616842
STE12B   EQU   *                                               @Z40LB26 70666803
TXT12B   EQU   *                                               @Z40LB26 70716803
         EJECT                                                 @Z40LB26 70726803
************************************************************** @Z40LB26 70736803
*                                                            * @Z40LB26 70746803
*  LEGENDS - LEGENDS SUB-TITLE                               * @Z40LB26 70756803
*                                                            * @Z40LB26 70758803
************************************************************** @Z40LB26 70760803
TXT13    DC    Y(TXT13B-TXT13A)        ENTRY LENGTH            @Z40LB26 70762803
         DC    H'0'                    FLAGS                   @Z40LB26 70764803
************************************************************** @Z40LB26 70765203
*                                                            * @Z40LB26 70765603
*  STATIC TEXT SUB-STRUCTURE                                 * @Z40LB26 70766003
*                                                            * @Z40LB26 70766403
************************************************************** @Z40LB26 70766503
TXT13A   DC    X'8400'                 STATIC TEXT FLAG        @Z40LB26 70766603
         DC    Y(STE13B-STE13A)        TEXT LENGTH             @Z40LB26 70766703
         DC    Y(STE13A-TXT13A)        TEXT OFFSET             @Z40LB26 70816703
         DC    H'1'                    PRINT COLUMN            @Z40LB26 70826703
         DC    Y(STE13B-STE13A)        PRINT FIELD LENGTH      @Z40LB26 70836703
         DC    H'0'                    CONVERSION FLAG         @Z40LB26 70846703
************************************************************** @Z40LB26 70856703
*                                                            * @Z40LB26 70858703
*  STATIC TEXT ENTRIES                                       * @Z40LB26 70860703
*                                                            * @Z40LB26 70862703
************************************************************** @Z40LB26 70864703
STE13A   DC    C'0'                                            @Z40LB26 70865103
         DC    C'                            LEGEND'           @Z40LB26 70865503
STE13B   EQU   *                                               @Z40LB26 70865903
TXT13B   EQU   *                                               @Z40LB26 70866303
         END                                                            70866703
