* /* START OF SPECIFICATIONS ****                                       00050002
*                                                                       00100002
*01*  MODULE-NAME = IDCTSRI1                                            00150002
*01*  MODULE-TYPE = MODULE                                              00200002
*02*    PROCESSOR = ASSEMBLER                                           00250002
*                                                                       00300002
**** END OF SPECIFICATIONS ***/                                         00350002
*                                                                       00400002
       TITLE '*** IDCTSRI1 - R/I S/A STATIC TEXT FOR TSO ***'  @Y30SSFR 00450003
**********************************************************************  00500002
*                                                                    *  00550002
* MODULE NAME - IDCTSRI1                                       @YL026UL 00610002
*                                                                    *  00650002
* DESCRIPTIVE NAME - STATIC TEXT MODULE FOR THE READER         @YL026UL 00700002
*                    INTERPRETER AND THE SYSTEM ADAPTER TO     @YL026UL 00704002
*                    BE USED IN THE TSO ENVIRONMENT            @YL026UL 00708002
*                                                                    *  00750002
* COPYRIGHT - NONE                                                   *  00800002
*                                                                    *  00850002
* STATUS - RELEASE=1.5  LEVEL 0                                @YL026UL 00900002
*                                                                    *  00950002
* FUNCTION - CONTAINS NO EXECUTABLE CODE, ONLY STATIC TEXT     @YL026UL 01000002
*        ENTRIES FOR THE R/I AND S/A USED IN THE TSO           @YL026UL 01060002
*        ENVIRONMENT. THIS MODULE IS LOADED BY IDCTP05 WHEN    @YL026UL 01100002
*        A STATIC TEXT REQUEST IS MADE.                        @YL026UL 01150002
*                                                                    *  01200002
* NOTES - NONE                                                       *  01250002
*                                                                    *  01300002
*    DEPENDENCIES - NONE                                             *  01350002
*    RESTRICTIONS - NONE                                             *  01400002
*    REGISTER CONVENTIONS - NA                                       *  01450002
*    PATCH AREA - NA                                                 *  01500002
*                                                                    *  01550002
* MODULE TYPE - TABLES                                               *  01600002
*                                                                    *  01650002
*    PROCESSOR - ASSEMBLER                                           *  01700002
*    MODULE SIZE - 1250 DECIMAL BYTES                          @YL026UL 01750002
*    ATTRIBUTES - READ-ONLY                                          *  01800002
*                                                                    *  01850002
*  ENTRY POINT - NA                                                  *  01900002
*                                                                    *  01950002
*  EXIT NORMAL - NA                                                  *  02000002
*                                                                    *  02050002
*  EXIT ERROR - NA                                                   *  02100002
*                                                                    *  02150002
*  EXTERNAL REFERENCES - NA                                          *  02200002
*                                                                    *  02250002
*  TABLES - NA                                                       *  02300002
*                                                                    *  02350002
*  MACROS - NA                                                       *  02400002
*                                                                    *  02450002
* CHANGE ACTIVITY - NONE                                             *  02500002
*                                                                    *  02550002
**********************************************************************  02600002
*                                                                       02650002
*********************************************************************   02700002
*                                                                    *  02750002
* THIS MODULE IS THE ONLY MODULE OF STATIC TEXT REQUIRED BY    @YL026UL 02800002
* THE READER INTERPRETER USED IN THE TSO ENVIRONMENT. THIS     @YL026UL 02810002
* MODULE IS THE ONLY MODULE OF STATIC TEXT REQUIRED BY THE     @YL026UL 02814002
* TSO PORTION OF THE SYSTEM ADAPTER.                           @YL026UL 02818002
*                                                                    *  02900002
*********************************************************************   02950002
*                                                                       03000002
*                                                                       03050002
IDCTSRI1  CSECT                                                @YL026UL 03100002
*                                                                       03150002
*********************************************************************   03200002
*                                                                    *  03250002
* THIS SECTION OF CODE CONTAINS THE INDICIES REQUIRED TO REACH       *  03300002
* THE STATIC TEXT ENTRIES.                                           *  03350002
*                                                                    *  03400002
*********************************************************************   03450002
*                                                              @YL026UL 03500002
INDEX    DC H'17'                      NUMBER OF ENTRIES       @Y30SSFR 03600003
INDEX1   DC Y(TXT1-INDEX)              NUMBER OUT OF RANGE     @YL026UL 03650002
INDEX2   DC Y(TXT2-INDEX)              INVALID NAME            @YL026UL 03700002
INDEX3   DC Y(TXT3-INDEX)              STRING TOO LONG         @YL026UL 03750002
INDEX4   DC Y(TXT4-INDEX)              STRING LIST TOO LONG    @YL026UL 03800002
INDEX5   DC Y(TXT5-INDEX)              CONFLICTING PARMS #1    @YL026UL 03810002
INDEX6   DC Y(TXT6-INDEX)              MISSING PARAMETER       @YL026UL 03820002
INDEX7   DC Y(TXT7-INDEX)              NUMERIC LIST TOO LONG   @YL026UL 03850002
INDEX8   DC Y(TXT8-INDEX)              PARM CONFLICT PROMPT    @YL026UL 03860002
INDEX9   DC Y(TXT9-INDEX)              BAD DATA ITEM PROMPT    @YL026UL 03870002
INDEX10  DC Y(TXT10-INDEX)             TOO LONG A LIST PROMPT  @YL026UL 03880002
INDEX11  DC Y(TXT11-INDEX)             CONFLICTING PARMS #2    @YL026UL 03890002
INDEX12  DC Y(TXT12-INDEX)             PUTGET ERROR            @YL026UL 03894002
INDEX13  DC Y(TXT13-INDEX)             DSN QUALIFYING ERROR    @YL026UL 03898002
INDEX14  DC Y(TXT14-INDEX)             TSO DEFAULT ERROR       @YL026UL 03898802
INDEX15  DC Y(TXT15-INDEX)             REPETITION IDENT.       @YL026UL 03899602
INDEX16  DC Y(TXT16-INDEX)             EXTRANEOUS DATA CODED   @YL026UL 03899702
INDEX17  DC Y(TXT17-INDEX)             MISSING PARAMETER       @Y30SSFR 03899803
         EJECT                                                 @YL026UL 03900002
**********************************************************************  03950002
*                                                                    *  04000002
* THIS SECTION OF CODE CONTAINS THE TEXT STRUCTURE ENTRIES           *  04050002
*                                                                    *  04100002
**********************************************************************  04150002
*                                                              @YL026UL 04200002
*                                                              @YL026UL 04250002
* NUMERIC VALUE NOT WITHIN ALLOWABLE VALUE RANGE               @YL026UL 04300002
*                                                              @YL026UL 04350002
TXT1     DC Y(TXT1B-TXT1A)             ENTRY LENGTH            @YL026UL 04400002
FLG1A    DC X'8000'                    MESSAGE FLAG            @YL026UL 04450002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 04700002
TXT1A    DC X'0400'                    STATIC TEXT FLAG        @YL026UL 04750002
         DC Y(STE11B-STE11A)           STATIC TEXT LENGTH      @YL026UL 04800002
         DC Y(STE11A-TXT1A)            STATIC TEXT OFFSET      @YL026UL 04850002
         DC H'1'                                               @YL026UL 04900002
         DC Y(STE11B-STE11A)           PRINT FIELD LENGTH      @YL026UL 04950002
         DC H'0'                                               @YL026UL 05000002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 05050002
         DC X'1000'                    BLOCK DATA FLAG         @YL026UL 05100002
         DC H'20'                      INPUT DATA LENGTH       @YL026UL 05150002
         DC H'0'                       INPUT DATA OFFSET       @YL026UL 05200002
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 05250002
         DC H'20'                      OUTPUT PRINT LENGTH     @YL026UL 05300002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 05312002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 05354002
         DC X'0400'                    STATIC TEXT FLAG        @YL026UL 05358002
         DC Y(STE12B-STE12A)           STATIC TEXT LENGTH      @YL026UL 05362002
         DC Y(STE12A-TXT1A)            STATIC TEXT OFFSET      @YL026UL 05366002
         DC H'0'                                               @YL026UL 05370002
         DC Y(STE12B-STE12A)           PRINT FIELD LENGTH      @YL026UL 05374002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 05374802
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 05400002
         DC X'1000'                    BLOCK DATA FLAG         @YL026UL 05450002
         DC H'4'                       INPUT DATA LENGTH       @YL026UL 05500002
         DC H'20'                      INPUT DATA OFFSET       @YL026UL 05550002
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 05600002
         DC H'11'                      OUTPUT PRINT LENGTH     @YL026UL 05650002
         DC X'1050'                    CONVERT FLAGS (BD,BS)   @YL026UL 05660002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 05664002
         DC X'8400'                    STATIC TEXT FLAG        @YL026UL 05668002
         DC Y(STE13B-STE13A)           STATIC TEXT LENGTH      @YL026UL 05672002
         DC Y(STE13A-TXT1A)            STATIC TEXT OFFSET      @YL026UL 05676002
         DC H'0'                                               @Y30SSFR 05680003
         DC Y(STE13B-STE13A)           PRINT FIELD LENGTH      @YL026UL 05684002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 05684802
* STATIC TEXT ENTRY                                            @YL026UL 05710002
STE11A   DC C'IDC3240I '''                                     @YL026UL 05720002
STE11B   EQU *                                                 @YL026UL 05722002
STE12A   DC C''' VALUE OF '''                                  @YL026UL 05724002
STE12B   EQU *                                                 @YL026UL 05726002
STE13A   DC C''' OUT OF RANGE'                                 @YL026UL 05728002
STE13B   EQU *                                                 @YL026UL 05728402
TXT1B    EQU *                                                 @YL026UL 05960002
         EJECT                                                 @YL026UL 06010002
*                                                              @YL026UL 06060002
*                                                              @YL026UL 06110002
* NAME DOES NOT ADHERE TO NAMING RESTRICTIONS                  @YL026UL 06120002
*                                                              @YL026UL 06210002
TXT2     DC Y(TXT2B-TXT2A)             ENTRY LENGTH            @YL026UL 06260002
FLG2A    DC X'8000'                    MESSAGE FLAG            @YL026UL 06310002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 06560002
TXT2A    DC X'0400'                    STATIC TEXT FLAG        @YL026UL 06610002
         DC Y(STE21B-STE21A)           STATIC TEXT LENGTH      @YL026UL 06660002
         DC Y(STE21A-TXT2A)            STATIC TEXT OFFSET      @YL026UL 06710002
         DC H'1'                                               @YL026UL 06760002
         DC Y(STE21B-STE21A)           PRINT FIELD LENGTH      @YL026UL 06810002
         DC H'0'                                               @YL026UL 06860002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 06910002
         DC X'1000'                    BLOCK DATA FLAG         @YL026UL 06960002
         DC H'20'                      INPUT DATA LENGTH       @YL026UL 07010002
         DC H'0'                       INPUT DATA OFFSET       @YL026UL 07060002
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 07110002
         DC H'20'                      OUTPUT PRINT LENGTH     @YL026UL 07160002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 07164002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 07214002
         DC X'0400'                    STATIC TEXT FLAG        @YL026UL 07218002
         DC Y(STE22B-STE22A)           STATIC TEXT LENGTH      @YL026UL 07222002
         DC Y(STE22A-TXT2A)            STATIC TEXT OFFSET      @YL026UL 07226002
         DC H'0'                                               @YL026UL 07230002
         DC Y(STE22B-STE22A)           PRINT FIELD LENGTH      @YL026UL 07234002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 07238002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 07260002
         DC X'9000'                    BLOCK DATA FLAG         @YL026UL 07310002
         DC H'64'                      INPUT DATA LENGTH       @YL026UL 07360002
         DC H'20'                      INPUT DATA OFFSET       @YL026UL 07410002
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 07460002
         DC H'64'                      OUTPUT PRINT LENGTH     @YL026UL 07510002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 07514002
* STATIC TEXT ENTRY                                            @YL026UL 07610002
STE21A   DC C'IDC3241I INVALID '''                             @YL026UL 07730002
STE21B   EQU *                                                 @YL026UL 07760002
STE22A   DC C''' NAME - '''                                    @YL026UL 07770002
STE22B   EQU *                                                 @YL026UL 07780002
TXT2B    EQU *                                                 @YL026UL 07810002
         EJECT                                                 @YL026UL 07860002
*                                                              @YL026UL 07910002
*                                                              @YL026UL 07960002
* STRING CONSTANT EXCEEDS LENGTH LIMIT                         @YL026UL 07970002
*                                                              @YL026UL 08060002
TXT3     DC Y(TXT3B-TXT3A)             ENTRY LENGTH            @YL026UL 08110002
FLG3A    DC X'8000'                    MESSAGE FLAG            @YL026UL 08160002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 08410002
TXT3A    DC X'0400'                    STATIC TEXT FLAG        @YL026UL 08460002
         DC Y(STE31B-STE31A)           STATIC TEXT LENGTH      @YL026UL 08510002
         DC Y(STE31A-TXT3A)            STATIC TEXT OFFSET      @YL026UL 08560002
         DC H'1'                                               @YL026UL 08610002
         DC Y(STE31B-STE31A)           PRINT FIELD LENGTH      @YL026UL 08660002
         DC H'0'                                               @YL026UL 08710002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 08760002
         DC X'1000'                    BLOCK DATA FLAG         @YL026UL 08810002
         DC H'20'                      INPUT DATA LENGTH       @YL026UL 08860002
         DC H'0'                       INPUT DATA OFFSET       @YL026UL 08910002
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 08960002
         DC H'20'                      OUTPUT PRINT LENGTH     @YL026UL 09010002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 09014002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 09064002
         DC X'0400'                    STATIC TEXT FLAG        @YL026UL 09068002
         DC Y(STE32B-STE32A)           STATIC TEXT LENGTH      @YL026UL 09072002
         DC Y(STE32A-TXT3A)            STATIC TEXT OFFSET      @YL026UL 09076002
         DC H'0'                                               @YL026UL 09080002
         DC Y(STE32B-STE32A)           PRINT FIELD LENGTH      @YL026UL 09084002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 09088002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 09110002
         DC X'9000'                    BLOCK DATA FLAG         @YL026UL 09160002
         DC H'64'                      INPUT DATA LENGTH       @YL026UL 09210002
         DC H'20'                      INPUT DATA OFFSET       @YL026UL 09260002
         DC H'1'                       OUTPUT PRINT OFFSET     @YL026UL 09310002
         DC H'64'                      OUTPUT PRINT LENGTH     @YL026UL 09360002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 09364002
* STATIC TEXT ENTRY                                            @YL026UL 09460002
STE31A   DC C'IDC3242I '''                                     @YL026UL 09462002
STE31B   EQU *                                                 @YL026UL 09610002
STE32A   DC C''' VALUE HAS INVALID LENGTH - '                  @YL026UL 09620002
STE32B   EQU *                                                 @YL026UL 09630002
TXT3B    EQU *                                                 @YL026UL 09660002
         EJECT                                                 @YL026UL 09710002
*                                                              @YL026UL 09760002
*                                                              @YL026UL 09810002
* TOO MANY ELEMENTS IN A NON-NUMERIC LIST                      @YL026UL 09820002
*                                                              @YL026UL 09910002
TXT4     DC Y(TXT4B-TXT4A)             ENTRY LENGTH            @YL026UL 09960002
FLG4A    DC X'8000'                    MESSAGE FLAG            @YL026UL 10010002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 10260002
TXT4A    DC X'0400'                    STATIC TEXT FLAG        @YL026UL 10310002
         DC Y(STE41B-STE41A)           STATIC TEXT LENGTH      @YL026UL 10360002
         DC Y(STE41A-TXT4A)            STATIC TEXT OFFSET      @YL026UL 10410002
         DC H'1'                                               @YL026UL 10460002
         DC Y(STE41B-STE41A)           PRINT FIELD LENGTH      @YL026UL 10510002
         DC H'0'                                               @YL026UL 10560002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 10610002
         DC X'1000'                    BLOCK DATA FLAG         @YL026UL 10660002
         DC H'20'                      INPUT DATA LENGTH       @YL026UL 10710002
         DC H'0'                       INPUT DATA OFFSET       @YL026UL 10760002
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 10810002
         DC H'20'                      OUTPUT PRINT LENGTH     @YL026UL 10860002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 10864002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 10914002
         DC X'0400'                    STATIC TEXT FLAG        @YL026UL 10918002
         DC Y(STE42B-STE42A)           STATIC TEXT LENGTH      @YL026UL 10922002
         DC Y(STE42A-TXT4A)            STATIC TEXT OFFSET      @YL026UL 10926002
         DC H'0'                                               @YL026UL 10930002
         DC Y(STE42B-STE42A)           PRINT FIELD LENGTH      @YL026UL 10934002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 10938002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 10960002
         DC X'9000'                    BLOCK DATA FLAG         @YL026UL 11010002
         DC H'64'                      INPUT DATA LENGTH       @YL026UL 11060002
         DC H'20'                      INPUT DATA OFFSET       @YL026UL 11110002
         DC H'1'                       OUTPUT PRINT OFFSET     @YL026UL 11160002
         DC H'64'                      OUTPUT PRINT LENGTH     @YL026UL 11210002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 11214002
* STATIC TEXT ENTRY                                            @YL026UL 11310002
STE41A   DC C'IDC3243I '''                                     @YL026UL 11312002
STE41B   EQU *                                                 @YL026UL 11460002
STE42A   DC C''' LIST TOO LONG BEGINNING AT - '                @YL026UL 11470002
STE42B   EQU *                                                 @YL026UL 11480002
TXT4B    EQU *                                                 @YL026UL 11510002
         EJECT                                                 @YL026UL 11560002
*                                                              @YL026UL 11610002
*                                                              @YL026UL 11660002
* TWO PARAMETERS ARE IN CONFLICT                               @YL026UL 11670002
*                                                              @YL026UL 11760002
TXT5     DC Y(TXT5B-TXT5A)             ENTRY LENGTH            @YL026UL 11810002
FLG5A    DC X'8000'                    MESSAGE FLAG            @YL026UL 11860002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 12110002
TXT5A    DC X'0400'                    STATIC TEXT FLAG        @YL026UL 12160002
         DC Y(STE51B-STE51A)           STATIC TEXT LENGTH      @YL026UL 12210002
         DC Y(STE51A-TXT5A)            STATIC TEXT OFFSET      @YL026UL 12260002
         DC H'1'                                               @YL026UL 12310002
         DC Y(STE51B-STE51A)           PRINT FIELD LENGTH      @YL026UL 12360002
         DC H'0'                                               @YL026UL 12410002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 12460002
         DC X'1000'                    BLOCK DATA FLAG         @YL026UL 12510002
         DC H'20'                      INPUT DATA LENGTH       @YL026UL 12560002
         DC H'0'                       INPUT DATA OFFSET       @YL026UL 12610002
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 12660002
         DC H'20'                      OUTPUT PRINT LENGTH     @YL026UL 12710002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 12714002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 12764002
         DC X'8400'                    STATIC TEXT FLAG        @YL026UL 12768002
         DC Y(STE52B-STE52A)           STATIC TEXT LENGTH      @YL026UL 12772002
         DC Y(STE52A-TXT5A)            STATIC TEXT OFFSET      @YL026UL 12776002
         DC H'0'                                               @YL026UL 12780002
         DC Y(STE52B-STE52A)           PRINT FIELD LENGTH      @YL026UL 12784002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 12788002
* STATIC TEXT ENTRY                                            @YL026UL 13160002
STE51A   DC C'IDC3244I '''                                     @YL026UL 13170002
STE51B   EQU *                                                 @YL026UL 13310002
STE52A   DC C''' (REPLY ''1'') AND '                           @YL026UL 13320002
STE52B   EQU *                                                 @YL026UL 13330002
TXT5B    EQU *                                                 @YL026UL 13360002
         EJECT                                                 @YL026UL 13410002
*                                                              @YL026UL 13460002
*                                                              @YL026UL 13510002
* A PARAMETER IS MISSING                                       @YL026UL 13570002
*                                                              @YL026UL 13610002
TXT6     DC Y(TXT6B-TXT6A)             ENTRY LENGTH            @YL026UL 13660002
FLG6A    DC X'8000'                    MESSAGE FLAG            @YL026UL 13710002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 13960002
TXT6A    DC X'0400'                    STATIC TEXT FLAG        @YL026UL 14010002
         DC Y(STE61B-STE61A)           STATIC TEXT LENGTH      @YL026UL 14060002
         DC Y(STE61A-TXT6A)            STATIC TEXT OFFSET      @YL026UL 14110002
         DC H'1'                                               @YL026UL 14160002
         DC Y(STE61B-STE61A)           PRINT FIELD LENGTH      @YL026UL 14210002
         DC H'0'                                               @YL026UL 14260002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 14310002
         DC X'1000'                    BLOCK DATA FLAG         @YL026UL 14360002
         DC H'20'                      INPUT DATA LENGTH       @YL026UL 14410002
         DC H'0'                       INPUT DATA OFFSET       @YL026UL 14460002
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 14510002
         DC H'20'                      OUTPUT PRINT LENGTH     @YL026UL 14560002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 14564002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 14614002
         DC X'8400'                    STATIC TEXT FLAG        @YL026UL 14618002
         DC Y(STE62B-STE62A)           STATIC TEXT LENGTH      @YL026UL 14622002
         DC Y(STE62A-TXT6A)            STATIC TEXT OFFSET      @YL026UL 14626002
         DC H'0'                                               @YL026UL 14630002
         DC Y(STE62B-STE62A)           PRINT FIELD LENGTH      @YL026UL 14634002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 14638002
* STATIC TEXT ENTRY                                            @YL026UL 15010002
STE61A   DC C'IDC3247I ENTER SUBFIELD OF KEYWORD '''           @YL026UL 15012002
STE61B   EQU *                                                 @YL026UL 15012402
STE62A   DC C''' - '                                           @YL026UL 15064002
STE62B   EQU *                                                 @YL026UL 15160002
TXT6B    EQU *                                                 @YL026UL 15210002
         EJECT                                                 @YL026UL 15260002
*                                                              @YL026UL 15310002
*                                                              @YL026UL 15360002
* TOO MANY ELEMENTS IN A NUMERIC LIST                          @YL026UL 15370002
*                                                              @YL026UL 15460002
TXT7     DC Y(TXT7B-TXT7A)             ENTRY LENGTH            @YL026UL 15510002
FLG7A    DC X'8000'                    MESSAGE FLAG            @YL026UL 15560002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 15810002
TXT7A    DC X'0400'                    STATIC TEXT FLAG        @YL026UL 15860002
         DC Y(STE71B-STE71A)           STATIC TEXT LENGTH      @YL026UL 15910002
         DC Y(STE71A-TXT7A)            STATIC TEXT OFFSET      @YL026UL 15960002
         DC H'1'                                               @YL026UL 16010002
         DC Y(STE71B-STE71A)           PRINT FIELD LENGTH      @YL026UL 16060002
         DC H'0'                                               @YL026UL 16110002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 16160002
         DC X'1000'                    BLOCK DATA FLAG         @YL026UL 16210002
         DC H'20'                      INPUT DATA LENGTH       @YL026UL 16260002
         DC H'0'                       INPUT DATA OFFSET       @YL026UL 16310002
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 16360002
         DC H'20'                      OUTPUT PRINT LENGTH     @YL026UL 16410002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 16414002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 16464002
         DC X'0400'                    STATIC TEXT FLAG        @YL026UL 16468002
         DC Y(STE72B-STE72A)           STATIC TEXT LENGTH      @YL026UL 16472002
         DC Y(STE72A-TXT7A)            STATIC TEXT OFFSET      @YL026UL 16476002
         DC H'0'                                               @YL026UL 16480002
         DC Y(STE72B-STE72A)           PRINT FIELD LENGTH      @YL026UL 16484002
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 16488002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 16510002
         DC X'9000'                    BLOCK DATA FLAG         @YL026UL 16560002
         DC H'4'                       INPUT DATA LENGTH       @YL026UL 16610002
         DC H'20'                      INPUT DATA OFFSET       @YL026UL 16660002
         DC H'1'                       OUTPUT PRINT OFFSET     @YL026UL 16710002
         DC H'10'                      OUTPUT PRINT LENGTH     @YL026UL 16760002
         DC X'1050'                    CONVERSION (BD,BS)      @YL026UL 16810002
* STATIC TEXT ENTRY                                            @YL026UL 16860002
STE71A   DC C'IDC3248I '''                                     @YL026UL 16862002
STE71B   EQU *                                                 @YL026UL 17010002
STE72A   DC C''' LIST TOO LONG BEGINNING AT '                  @YL026UL 17020002
STE72B   EQU *                                                 @YL026UL 17030002
TXT7B    EQU *                                                 @YL026UL 17060002
         EJECT                                                 @YL026UL 17110002
*                                                              @YL026UL 17160002
*                                                              @YL026UL 17210002
* CONFLICTING PARAMETERS PROMPT MESSAGE                        @YL026UL 17220002
*                                                              @YL026UL 17310002
TXT8     DC Y(TXT8B-TXT8A)             ENTRY LENGTH            @YL026UL 17360002
FLG8A    DC X'8000'                    MESSAGE FLAG            @YL026UL 17410002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 17660002
TXT8A    DC X'8400'                    STATIC TEXT FLAG        @YL026UL 17710002
         DC Y(STE81B-STE81A)           STATIC TEXT LENGTH      @YL026UL 17760002
         DC Y(STE81A-TXT8A)            STATIC TEXT OFFSET      @YL026UL 17810002
         DC H'1'                                               @YL026UL 17860002
         DC Y(STE81B-STE81A)           PRINT FIELD LENGTH      @YL026UL 17910002
         DC H'0'                                               @YL026UL 17960002
* STATIC TEXT ENTRY                                            @YL026UL 18710002
STE81A   DC C'IDC3246I ENTER REPLY NUMBER OF PARAMETER TO '    @YL026UL 18722002
         DC C'BE RETAINED - '                                  @YL026UL 18730002
STE81B   EQU *                                                 @YL026UL 18860002
TXT8B    EQU *                                                 @YL026UL 18910002
         EJECT                                                 @YL026UL 18960002
*                                                              @YL026UL 19010002
*                                                              @YL026UL 19060002
* BAD DATA ITEM PROMPT MESSAGE                                 @YL026UL 19110002
*                                                              @YL026UL 19160002
TXT9     DC Y(TXT9B-TXT9A)             ENTRY LENGTH            @YL026UL 19210002
FLG9A    DC X'8000'                    MESSAGE FLAG            @YL026UL 19260002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 19510002
TXT9A    DC X'8400'                    STATIC TEXT FLAG        @YL026UL 19560002
         DC Y(STE91B-STE91A)           STATIC TEXT LENGTH      @YL026UL 19610002
         DC Y(STE91A-TXT9A)            STATIC TEXT OFFSET      @YL026UL 19660002
         DC H'1'                                               @YL026UL 19710002
         DC Y(STE91B-STE91A)           PRINT FIELD LENGTH      @YL026UL 19760002
         DC H'0'                                               @YL026UL 19810002
* STATIC TEXT ENTRY                                            @YL026UL 20560002
STE91A   DC C'IDC3249I REENTER - '                             @YL026UL 20620002
STE91B   EQU *                                                 @YL026UL 20710002
TXT9B    EQU *                                                 @YL026UL 20760002
         EJECT                                                 @YL026UL 20810002
*                                                              @YL026UL 20860002
*                                                              @YL026UL 20910002
* STRING CONSTANT EXCEEDS LENGTH LIMIT                         @YL026UL 20960002
*                                                              @YL026UL 21010002
TXT10    DC Y(TXT10B-TXT10A)           ENTRY LENGTH            @YL026UL 21060002
FLG10A   DC X'8000'                    MESSAGE FLAG            @YL026UL 21110002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 21360002
TXT10A   DC X'8400'                    STATIC TEXT FLAG        @YL026UL 21410002
         DC Y(STE101B-STE101A)         STATIC TEXT LENGTH      @YL026UL 21460002
         DC Y(STE101A-TXT10A)          STATIC TEXT OFFSET      @YL026UL 21510002
         DC H'1'                                               @YL026UL 21560002
         DC Y(STE101B-STE101A)         PRINT FIELD LENGTH      @YL026UL 21610002
         DC H'0'                                               @YL026UL 21660002
* STATIC TEXT ENTRY                                            @YL026UL 22410002
STE101A  DC C'IDC3250I REPLY ''OK'' TO IGNORE EXCESS AND '     @YL026UL 22412002
         DC C'CONTINUE - '                                     @YL026UL 22414002
STE101B  EQU *                                                 @YL026UL 22560002
TXT10B   EQU *                                                 @YL026UL 22610002
         EJECT                                                 @YL026UL 22620002
*                                                              @YL026UL 22660002
*                                                              @YL026UL 22710002
* CONFLICTING PARAMETERS (PART 2 OF MESSAGE)                   @YL026UL 22760002
*                                                              @YL026UL 22810002
TXT11    DC Y(TXT11B-TXT11A)           ENTRY LENGTH            @YL026UL 22860002
FLG11A   DC X'A000'                    MESSAGE FLAG            @YL026UL 22910002
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 23160002
TXT11A   DC X'0400'                    STATIC TEXT FLAG        @YL026UL 23210002
         DC Y(STE111B-STE111A)         STATIC TEXT LENGTH      @YL026UL 23260002
         DC Y(STE111A-TXT11A)          STATIC TEXT OFFSET      @YL026UL 23310002
         DC H'1'                                               @YL026UL 23360002
         DC Y(STE111B-STE111A)         PRINT FIELD LENGTH      @YL026UL 23410002
         DC H'0'                                               @YL026UL 23460002
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 23460802
         DC X'1000'                    BLOCK DATA FLAG         @YL026UL 23461602
         DC H'20'                      INPUT DATA LENGTH       @YL026UL 23462402
         DC H'0'                       INPUT DATA OFFSET       @YL026UL 23463202
         DC H'0'                       OUTPUT PRINT OFFSET     @YL026UL 23463302
         DC H'20'                      OUTPUT PRINT LENGTH     @YL026UL 23463402
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 23467402
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 23467502
         DC X'8400'                    STATIC TEXT FLAG        @YL026UL 23471502
         DC Y(STE112B-STE112A)         STATIC TEXT LENGTH      @YL026UL 23475502
         DC Y(STE112A-TXT11A)          STATIC TEXT OFFSET      @YL026UL 23479502
         DC H'0'                                               @YL026UL 23483502
         DC Y(STE112B-STE112A)         PRINT FIELD LENGTH      @YL026UL 23487502
         DC X'0010'                    CONVERSION (CHAR,BS)    @YL026UL 23492002
* STATIC TEXT ENTRY                                            @YL026UL 23510002
STE111A  DC C'IDC3244I '''                                     @YL026UL 23560002
STE111B  EQU *                                                 @YL026UL 23610002
STE112A  DC C''' (REPLY ''2'') ARE IN CONFLICT'                @YL026UL 23620002
STE112B  EQU *                                                 @YL026UL 23630002
TXT11B   EQU *                                                 @YL026UL 23660002
         EJECT                                                 @YL026UL 23664002
*                                                              @YL026UL 23668002
*                                                              @YL026UL 23672002
* PUTGET ERROR CODE                                            @YL026UL 23676002
*                                                              @YL026UL 23680002
TXT12    DC    Y(TXT12B-TXT12A)        ENTRY LENGTH.           @YL026UL 23684002
         DC    X'8000'                 MESSAGE FLAG.           @YL026UL 23688002
* STATIC TEXT SUB-STRUCTURE.                                   @YL026UL 23692002
TXT12A   DC    X'0400'                 STATIC TEXT FLAG.       @YL026UL 23696002
         DC    Y(STE121B-STE121A)      TEXT LENGTH.            @YL026UL 23700002
         DC    Y(STE121A-TXT12A)       TEXT OFFSET.            @YL026UL 23704002
         DC    H'1'                    PRINT COLUMN.           @YL026UL 23708002
         DC    Y(STE121B-STE121A)      PRINT FIELD LENGTH.     @YL026UL 23708802
         DC    H'0'                    CONVERSION FLAGS. (CHAR)         23709602
* BLOCK DATA SUB-STRUCTURE.                                    @YL026UL 23709702
         DC    X'9000'                 EOF AND BLOCK DATA FLAGS.        23709802
         DC    H'2'                    INPUT LENGTH.           @YL026UL 23709902
         DC    H'0'                    INPUT OFFSET.           @YL026UL 23713902
         DC    H'31'                   PRINT COLUMN.           @YL026UL 23714702
         DC    H'2'                    PRINT FIELD LENGTH.     @YL026UL 23715502
         DC    X'1060'                 CONVERSION FLAGS. (BD,AL,SS)     23715602
* STATIC TEXT ENTRIES.                                         @YL026UL 23716302
STE121A  DC    C'IDC3900I PUTGET ERROR CODE IS'                @YL026UL 23717102
STE121B  EQU   *                                               @YL026UL 23717202
TXT12B   EQU   *                                               @YL026UL 23717302
         EJECT                                                 @YL026UL 23717402
*                                                              @YL026UL 23717502
*                                                              @YL026UL 23717602
* DSN QUALIFYING ERROR                                         @YL026UL 23717702
*                                                              @YL026UL 23717802
TXT13    DC    Y(TXT13B-TXT13A)        ENTRY LENGTH.           @YL026UL 23721802
         DC    X'8000'                 MESSAGE FLAG.           @YL026UL 23722602
* STATIC TEXT SUB-STRUCTURE.                                   @YL026UL 23723402
TXT13A   DC    X'0400'                 STATIC TEXT FLAG.       @YL026UL 23724202
         DC    Y(STE131B-STE131A)      TEXT LENGTH.            @YL026UL 23725002
         DC    Y(STE131A-TXT13A)       TEXT OFFSET.            @YL026UL 23725102
         DC    H'1'                    PRINT COLUMN.           @YL026UL 23725202
         DC    Y(STE131B-STE131A)      PRINT FIELD LENGTH.     @YL026UL 23725302
         DC    H'0'                    CONVERSION FLAGS. (CHAR)         23725402
* BLOCK DATA SUB-STRUCTURE.                                    @YL026UL 23725502
         DC    X'9000'                 EOF AND BLOCK DATA FLAGS.        23725602
         DC    H'44'                   INPUT LENGTH.           @YL026UL 23725702
         DC    H'0'                    INPUT OFFSET.           @YL026UL 23729702
         DC    H'27'                   PRINT COLUMN.           @YL026UL 23730502
         DC    H'44'                   PRINT FIELD LENGTH.     @YL026UL 23731302
         DC    X'0000'                 CONVERSION FLAGS. (CHAR)         23732102
* STATIC TEXT ENTRIES.                                         @YL026UL 23732902
STE131A  DC    C'IDC3901I ERROR QUALIFYING'                    @YL026UL 23733002
STE131B  EQU   *                                               @YL026UL 23733102
TXT13B   EQU   *                                               @YL026UL 23733202
         EJECT                                                 @YL026UL 23733302
*                                                              @YL026UL 23733402
*                                                              @YL026UL 23733502
* TSO DEFAULT ERROR                                            @YL026UL 23733602
*                                                              @YL026UL 23737602
TXT14    DC    Y(TXT14B-TXT14A)        ENTRY LENGTH.           @YL026UL 23738402
         DC    X'A000'                 MESSAGE FLAG.           @YL026UL 23739202
* STATIC TEXT SUB-STRUCTURE.                                   @YL026UL 23740002
TXT14A   DC    X'0400'                 STATIC TEXT FLAG.       @YL026UL 23740802
         DC    Y(STE141B-STE141A)      TEXT LENGTH.            @YL026UL 23740902
         DC    Y(STE141A-TXT14A)       TEXT OFFSET.            @YL026UL 23741002
         DC    H'1'                    PRINT COLUMN.           @YL026UL 23741102
         DC    Y(STE141B-STE141A)      PRINT FIELD LENGTH.     @YL026UL 23741202
         DC    H'0'                    CONVERSION FLAGS. (CHAR)         23741302
* BLOCK DATA SUB-STRUCTURE.                                    @YL026UL 23741402
         DC    X'1000'                 BLOCK DATA FLAGS.       @YL026UL 23741502
         DC    H'2'                    INPUT LENGTH.           @YL026UL 23745502
         DC    H'0'                    INPUT OFFSET.           @YL026UL 23746302
         DC    H'48'                   PRINT COLUMN.           @YL026UL 23747102
         DC    H'2'                    PRINT FIELD LENGTH.     @YL026UL 23747902
         DC    X'1020'                 CONVERSION FLAGS. (BD,SS)        23748702
* BLOCK DATA SUB-STRUCTURE.                                    @YL026UL 23748802
         DC    X'9000'                 EOF AND BLOCK DATA FLAGS.        23748902
         DC    H'2'                    INPUT LENGTH.           @YL026UL 23749002
         DC    H'2'                    INPUT OFFSET.           @YL026UL 23749102
         DC    H'70'                   PRINT COLUMN.           @YL026UL 23749202
         DC    H'2'                    PRINT FIELD LENGTH.     @YL026UL 23749302
         DC    X'1060'                 CONVERSION FLAGS. (BD,AL,SS)     23749402
* STATIC TEXT ENTRIES.                                         @YL026UL 23753402
STE141A  DC    C'IDC3902I ** DEFAULT SERVICE ROUTINE ERROR '   @YL026UL 23754202
         DC    C'CODE   , LOCATE ERROR CODE'                   @YL026UL 23755002
STE141B  EQU   *                                               @YL026UL 23755802
TXT14B   EQU   *                                               @YL026UL 23756602
         EJECT                                                 @YL026UL 23760602
*                                                              @YL026UL 23764602
*                                                              @YL026UL 23768602
* SUBPARM LIST REPETITION IN WHICH ERROR IS FOUND              @YL026UL 23772602
*                                                              @YL026UL 23776602
TXT15    DC Y(TXT15B-TXT15A)           ENTRY LENGTH            @YL026UL 23780602
FLG15A   DC X'8000'                    MESSAGE FLAG            @YL026UL 23784602
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 23804602
TXT15A   DC X'0400'                    STATIC TEXT FLAG        @YL026UL 23808602
         DC Y(STE151B-STE151A)         STATIC TEXT LENGTH      @YL026UL 23812602
         DC Y(STE151A-TXT15A)          STATIC TEXT OFFSET      @YL026UL 23816602
         DC H'1'                                               @YL026UL 23820602
         DC Y(STE151B-STE151A)         PRINT FIELD LENGTH      @YL026UL 23824602
         DC H'0'                                               @YL026UL 23828602
* BLOCK DATA SUBSTRUCTURE                                      @YL026UL 23888602
         DC X'9000'                    BLOCK DATA FLAG         @YL026UL 23892602
         DC H'4'                       INPUT DATA LENGTH       @YL026UL 23896602
         DC H'0'                       INPUT DATA OFFSET       @YL026UL 23900602
         DC H'1'                       OUTPUT PRINT OFFSET     @YL026UL 23904602
         DC H'10'                      OUTPUT PRINT LENGTH     @YL026UL 23908602
         DC X'1070'                    CONVERSION (BD,BS)      @YL026UL 23912602
* STATIC TEXT ENTRY                                            @YL026UL 23916602
STE151A  DC C'IDC3251I FOR SUBFIELD REPETITION '               @YL026UL 23920602
STE151B  EQU *                                                 @YL026UL 23924602
TXT15B   EQU *                                                 @YL026UL 23936602
         EJECT                                                 @YL026UL 23937402
*                                                              @YL026UL 23938202
*                                                              @YL026UL 23939002
* EXTRANEOUS PARAMETERS WERE CODED                             @YL026UL 23939902
*                                                              @YL026UL 23940002
TXT16    DC Y(TXT16B-TXT16A)           ENTRY LENGTH            @YL026UL 23940102
FLG16A   DC X'8000'                    MESSAGE FLAG            @YL026UL 23940202
* STATIC TEXT SUBSTRUCTURE                                     @YL026UL 23944502
TXT16A   DC X'8400'                    STATIC TEXT FLAG        @YL026UL 23945302
         DC Y(STE161B-STE161A)         STATIC TEXT LENGTH      @YL026UL 23946102
         DC Y(STE161A-TXT16A)          STATIC TEXT OFFSET      @YL026UL 23946902
         DC H'1'                                               @YL026UL 23947702
         DC Y(STE161B-STE161A)         PRINT FIELD LENGTH      @YL026UL 23947802
         DC H'0'                                               @YL026UL 23947902
* STATIC TEXT ENTRY                                            @YL026UL 23954002
STE161A  DC C'IDC1252I COMMAND ALLOWS NO PARAMETERS - '        @YL026UL 23954800
         DC C'PARAMETERS IGNORED'                              @YL026UL 24054802
STE161B  EQU *                                                 @YL026UL 24104802
TXT16B   EQU *                                                 @YL026UL 24154802
         EJECT                                                 @Y30SSFR 24164803
*                                                              @Y30SSFR 24174803
*                                                              @Y30SSFR 24184803
* A PARAMETER IS MISSING (NO PROMPTING)                        @Y30SSFR 24194803
*                                                              @Y30SSFR 24196803
TXT17    DC Y(TXT17B-TXT17A)           ENTRY LENGTH            @Y30SSFR 24198803
FLG17A   DC X'8000'                    MESSAGE FLAG            @Y30SSFR 24201603
* STATIC TEXT SUBSTRUCTURE                                     @Y30SSFR 24202803
TXT17A   DC X'0400'                    STATIC TEXT FLAG        @Y30SSFR 24203203
         DC Y(STE171B-STE171A)         STATIC TEXT LENGTH      @Y30SSFR 24203603
         DC Y(STE171A-TXT17A)          STATIC TEXT OFFSET      @Y30SSFR 24204003
         DC H'1'                                               @Y30SSFR 24204403
         DC Y(STE171B-STE171A)         PRINT FIELD LENGTH      @Y30SSFR 24204503
         DC H'0'                                               @Y30SSFR 24204603
* BLOCK DATA SUBSTRUCTURE                                      @Y30SSFR 24204803
         DC X'1000'                    BLOCK DATA FLAG         @Y30SSFR 24254703
         DC H'20'                      INPUT DATA LENGTH       @Y30SSFR 24264703
         DC H'0'                       INPUT DATA OFFSET       @Y30SSFR 24274703
         DC H'0'                       OUTPUT PRINT OFFSET     @Y30SSFR 24284703
         DC H'20'                      OUTPUT PRINT LENGTH     @Y30SSFR 24294703
         DC X'0010'                    CONVERSION (CHAR,BS)    @Y30SSFR 24296703
* STATIC TEXT ENTRY                                            @Y30SSFR 24304403
STE171A  DC C'IDC3253I MISSING SUBFIELD OF KEYWORD '''         @Y30SSFR 24304503
STE171B  EQU *                                                 @Y30SSFR 24304603
TXT17B   EQU *                                                 @Y30SSFR 24374603
         END IDCTSRI1                                                   24404603
