         TITLE 'TIME COMMAND PROCESSOR                                 *00001000
                        '                                               00002000
IKJEFT25 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IKJEFT25  76.163'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @12,0                                               0001 00012000
@PSTART  DS    0H                                                  0001 00013000
         USING @PSTART,@12                                         0001 00014000
         L     @00,@SIZDATD                                        0001 00015000
         GETMAIN  R,LV=(0)                                              00016000
         LR    @11,@01                                             0001 00017000
         USING @DATD,@11                                           0001 00018000
         ST    @13,@SA00001+4                                      0001 00019000
         LM    @00,@01,20(@13)                                     0001 00020000
         ST    @11,8(,@13)                                         0001 00021000
         LR    @13,@11                                             0001 00022000
         XC    @ZTEMPS(@ZLEN),@ZTEMPS                                   00023000
         MVC   @PC00001(16),0(@01)                                 0001 00024000
*     R2=R1;                         /* SAVE REGISTER 1 CONTENTS     */ 00025000
         LR    R2,R1                                               0055 00026000
*     R1=TIME(1:4);                  /*                      @YM01985*/ 00027000
         MVC   @TF00001(4),TIME                                    0056 00028000
         L     R1,@TF00001                                         0056 00029000
*     R15=TIME(5:8);                 /*                      @YM01985*/ 00030000
         MVC   @TF00001(4),TIME+4                                  0057 00031000
         L     R15,@TF00001                                        0057 00032000
*     GENERATE(TSEVENT PPMODE);      /* ISSUE TSEVENT MACRO          */ 00033000
         TSEVENT PPMODE                                                 00034000
*     R1=R2;                         /*RESTORE REGISTER 1 CONTENT    */ 00035000
*                                                                  0059 00036000
*                                                                  0059 00037000
         LR    R1,R2                                               0059 00038000
*     /***************************************************************/ 00039000
*     /*    THESE STATEMENTS INITIALIZE THE POINTERS TO THE          */ 00040000
*     /*    VARIOUS PARAMETER LISTS THAT ARE USED BY THIS            */ 00041000
*     /*    ROUTINE OR BY PUTLINE IN PUTTING OUT THE TIME MESSAGE    */ 00042000
*     /***************************************************************/ 00043000
*     GEN (TIME DEC,ERRET=TIMERR);                                 0060 00044000
         TIME DEC,ERRET=TIMERR                                          00045000
*     GO TO GOODTIME;                                              0061 00046000
         B     GOODTIME                                            0061 00047000
*  TIMERR:                           /* ERROR HANDLING ROUTINE       */ 00048000
*     UPTPTR = ADDR(UPTR);           /* UPT PTR                      */ 00049000
TIMERR   L     @10,@PC00001+4                                      0062 00050000
         ST    @10,UPTPTR                                          0062 00051000
*     ECTPTR = ADDR(EPTR);           /* ECT PTR                      */ 00052000
         L     @10,@PC00001+12                                     0063 00053000
         ST    @10,ECTPTR                                          0063 00054000
*     PUTPARMP = ADDR(PUTPARM);      /* PUTLINE CONTROL LIST PTR     */ 00055000
         LA    @10,PUTPARM                                         0064 00056000
         ST    @10,PUTPARMP                                        0064 00057000
*     ECBPTR = ADDR(PUTECB);         /* ECB POINTER                  */ 00058000
         LA    @10,PUTECB                                          0065 00059000
         ST    @10,ECBPTR                                          0065 00060000
*     PUTECB = NULL;                 /* ZERO ECB                     */ 00061000
         LH    @10,NULL                                            0066 00062000
         ST    @10,PUTECB                                          0066 00063000
*     PUTPARM(BYTE1:PUTLNG)=PUTLIST; /* COPY PUTLINE CONTROL LIST    */ 00064000
         LH    @10,BYTE1                                           0067 00065000
         LA    @06,PUTPARM-1(@10)                                  0067 00066000
         LCR   @10,@10                                             0067 00067000
         AH    @10,PUTLNG                                          0067 00068000
         EX    @10,@SM01036                                        0067 00069000
*     SEGNUM = 1;                    /* NUMBER OF SEGMENTS           */ 00070000
         MVC   SEGNUM(4),@CF00037                                  0068 00071000
*     SEG1PTR = ADDR(ERRLEN);        /* PTR TO MSG SEGMENT           */ 00072000
         L     @10,@CV00852                                        0069 00073000
         LA    @10,ERRLEN-MSGMOD(,@10)                             0069 00074000
         ST    @10,SEG1PTR                                         0069 00075000
*     R3 = ADDR(PUTLBUF);            /* MESSAGE LIST POINTER         */ 00076000
         LA    R3,PUTLBUF                                          0070 00077000
*     R1 = ADDR(PUTPL);              /* PUTLINE PARAMETERS PTR       */ 00078000
         LA    R1,PUTPL                                            0071 00079000
*                                    /* ISSUE ERROR MESSAGE          */ 00080000
*     GENERATE (PUTLINE OUTPUT=((3)),MF=(E,(1)));                  0072 00081000
         PUTLINE OUTPUT=((3)),MF=(E,(1))                                00082000
*     R1=TIME(1:4);                  /*                      @YM01985*/ 00083000
         MVC   @TF00001(4),TIME                                    0073 00084000
         L     R1,@TF00001                                         0073 00085000
*     R15=TIME(5:8);                 /*                      @YM01985*/ 00086000
         MVC   @TF00001(4),TIME+4                                  0074 00087000
         L     R15,@TF00001                                        0074 00088000
*     GENERATE (TSEVENT PPMODE);     /* ISSUE TSEVENT MACRO          */ 00089000
         TSEVENT PPMODE                                                 00090000
*     R15 = NULL;                    /* ZERO RETURN CODE             */ 00091000
         LH    R15,NULL                                            0076 00092000
*     RETURN;                        /* RETURN TO CALLER             */ 00093000
@EL00001 L     @13,4(,@13)                                         0077 00094000
@EF00001 L     @00,@SIZDATD                                        0077 00095000
         LR    @01,@11                                             0077 00096000
         FREEMAIN R,LV=(0),A=(1)                                        00097000
@ER00001 L     @14,12(,@13)                                        0077 00098000
         LM    @00,@12,20(@13)                                     0077 00099000
         BR    @14                                                 0077 00100000
*  GOODTIME:                                                       0078 00101000
*     SAVDATE = R1;                  /* SAVE DATE RETURNED           */ 00102000
GOODTIME ST    R1,@TF00001                                         0078 00103000
         MVC   SAVDATE(4),@TF00001                                 0078 00104000
*     SAVTIME = R0;                  /* SAVE TIME RETURNED           */ 00105000
         ST    R0,@TF00001                                         0079 00106000
         MVC   SAVTIME(4),@TF00001                                 0079 00107000
*     UPTPTR=ADDR(UPTR);             /* UPT PTR                      */ 00108000
         L     @10,@PC00001+4                                      0080 00109000
         ST    @10,UPTPTR                                          0080 00110000
*     ECTPTR=ADDR(EPTR);             /* ECT PTR                      */ 00111000
         L     @10,@PC00001+12                                     0081 00112000
         ST    @10,ECTPTR                                          0081 00113000
*     PUTPARMP=ADDR(PUTPARM);        /* PUTLINE CONTROL LIST PTR     */ 00114000
         LA    @10,PUTPARM                                         0082 00115000
         ST    @10,PUTPARMP                                        0082 00116000
*     ECBPTR=ADDR(PUTECB);           /* ECB PTR                      */ 00117000
*                                                                  0083 00118000
         LA    @10,PUTECB                                          0083 00119000
         ST    @10,ECBPTR                                          0083 00120000
*     PUTECB=NULL;                   /* INITIALIZE ECB TO ZERO       */ 00121000
*                                                                  0084 00122000
         LH    @10,NULL                                            0084 00123000
         ST    @10,PUTECB                                          0084 00124000
*     ASCBPTR = ASCBCUR;             /* ASCB ADDRESSABILITY          */ 00125000
         L     @10,CVTPTR                                          0085 00126000
         L     @10,CVTTCBP(,@10)                                   0085 00127000
         L     ASCBPTR,ASCBCUR(,@10)                               0085 00128000
*     PUTPARM(BYTE1:PUTLNG)=PUTLIST; /* COPY PUTLINE CONTROL LIST    */ 00129000
         LH    @10,BYTE1                                           0086 00130000
         LA    @09,PUTPARM-1(@10)                                  0086 00131000
         LCR   @10,@10                                             0086 00132000
         AH    @10,PUTLNG                                          0086 00133000
         EX    @10,@SM01038                                        0086 00134000
*     CALL CURDATE;                  /* COMPUTE CURRENT DATE         */ 00135000
         BAL   @14,CURDATE                                         0087 00136000
*     CALL CURTIME;                  /* COMPUTE CURRENT TIME         */ 00137000
         BAL   @14,CURTIME                                         0088 00138000
*     CALL SESSTIME;                 /* COMPUTE SESSION TIME         */ 00139000
         BAL   @14,SESSTIME                                        0089 00140000
*     CALL CPUTIME;                  /* COMPUTE CPU TIME             */ 00141000
         BAL   @14,CPUTIME                                         0090 00142000
*     CALL SRVUNITS;                 /* COMPUTE SERVICE UNITS        */ 00143000
         BAL   @14,SRVUNITS                                        0091 00144000
*     /***************************************************************/ 00145000
*     /*    SET UP THE POINTERS TO THE MESSAGE SEGMENTS              */ 00146000
*     /*    FOR PUTLINE                                              */ 00147000
*     /***************************************************************/ 00148000
*     SEGNUM=NUMSEG;                 /* GET NUMBER OF SEGMENTS       */ 00149000
         LH    @10,NUMSEG                                          0092 00150000
         ST    @10,SEGNUM                                          0092 00151000
*     SEG1PTR=ADDR(TIMEMSG);         /* GET PTR TO MSG SEGMENTS      */ 00152000
         L     @10,@CV00852                                        0093 00153000
         ST    @10,SEG1PTR                                         0093 00154000
*                                    /* FOR PUTLINE                  */ 00155000
*     SEG2PTR=ADDR(TIMESBUF);        /* TIME MESSAGE                 */ 00156000
         LA    @10,TIMESBUF                                        0094 00157000
         ST    @10,SEG2PTR                                         0094 00158000
*     SEG3PTR=ADDR(CPULEN);          /* CPU TIME MESSAGE             */ 00159000
         LA    @10,CPULEN                                          0095 00160000
         ST    @10,SEG3PTR                                         0095 00161000
*     SEG4PTR=ADDR(SRVLEN);          /* SESSION TIME MESSAGE         */ 00162000
         LA    @10,SRVLEN                                          0096 00163000
         ST    @10,SEG4PTR                                         0096 00164000
*     SEG5PTR = ADDR(SESLEN);        /* SERVICE UNITS MESSAGE        */ 00165000
         LA    @10,SESLEN                                          0097 00166000
         ST    @10,SEG5PTR                                         0097 00167000
*     SEG6PTR = ADDR(DATELEN);       /* DATE MESSAGE                 */ 00168000
         LA    @10,DATELEN                                         0098 00169000
         ST    @10,SEG6PTR                                         0098 00170000
*     R3=ADDR(PUTLBUF);              /* GET MESSAGE LIST POINTER     */ 00171000
         LA    R3,PUTLBUF                                          0099 00172000
*     R1 = ADDR(PUTPL);              /*PUTLINE PARAMETER POINTER     */ 00173000
*                                                                  0100 00174000
*                                                                  0100 00175000
         LA    R1,PUTPL                                            0100 00176000
*     /***************************************************************/ 00177000
*     /*    ISSUE THE PUTLINE MACRO. CONTROL IS PASSED TO THE        */ 00178000
*     /*    PUTLINE SERVICE ROUTINE                                  */ 00179000
*     /***************************************************************/ 00180000
*     GENERATE (PUTLINE OUTPUT=((3)),MF=(E,(1)));/* ISSUE PUTLINE    */ 00181000
         PUTLINE OUTPUT=((3)),MF=(E,(1))                                00182000
*                                    /* MACRO                        */ 00183000
*                                                                  0102 00184000
*                                                                  0102 00185000
*     R1=TIME(1:4);                  /*                      @YM01985*/ 00186000
         MVC   @TF00001(4),TIME                                    0102 00187000
         L     R1,@TF00001                                         0102 00188000
*     R15=TIME(5:8);                 /*                      @YM01985*/ 00189000
         MVC   @TF00001(4),TIME+4                                  0103 00190000
         L     R15,@TF00001                                        0103 00191000
*     GENERATE(TSEVENT PPMODE);      /* ISSUE TSEVENT MACRO          */ 00192000
         TSEVENT PPMODE                                                 00193000
*     R15=NULL;                      /* SET ZERO RETURN CODE         */ 00194000
         LH    R15,NULL                                            0105 00195000
*     RETURN;                        /* RETURN TO CALLER             */ 00196000
         B     @EL00001                                            0106 00197000
*/*****************************************                        0107 00198000
**                                                                 0107 00199000
** SEGMENT NAME -                                                  0107 00200000
**      CURDATE                                                    0107 00201000
**                                                                 0107 00202000
** FUNCTION -                                                      0107 00203000
**      THIS ROUTINE COMPUTES THE CURRENT DATE.                    0107 00204000
**                                                                 0107 00205000
** OPERATION -                                                     0107 00206000
**      THE TIME RETURNED BY THE TIME MACRO IS CONVERTED INTO MONTH,    00207000
**      DAY AND YEAR.  THE RESULT IS PLACED IN A BUFFER TO BE      0107 00208000
**      PASSED TO PUTLINE.                                         0107 00209000
**                                                                 0107 00210000
** INPUT -                                                         0107 00211000
**      CURRENT TIME                                               0107 00212000
**                                                                 0107 00213000
** OUTPUT -                                                        0107 00214000
**      DATE IN PRINTABLE FORMAT                                   0107 00215000
*                             ****************************************/ 00216000
*                                                                  0107 00217000
*    CURDATE: PROC;                                                0107 00218000
CURDATE  STM   @14,@12,@SA00002                                    0107 00219000
*        CNVRT1(1:6) = CNVRT1(1:6) && CNVRT1(1:6);                 0108 00220000
         XC    CNVRT1(6),CNVRT1                                    0108 00221000
*        CNVRT1(7:8) = SAVDAY;              /* DAY IN CONVERT AREA   */ 00222000
         MVC   CNVRT1+6(2),SAVDAY                                  0109 00223000
*        RFY R4 RSTD;                       /* RESTRICT REG 4        */ 00224000
*        GEN (CVB 4,CNVRT1);                /* CONVERT DAY TO BINARY */ 00225000
         CVB 4,CNVRT1                                                   00226000
*        SAVDAY1 = R4;                      /* SAVE BINARY DAY       */ 00227000
         ST    R4,@TF00001                                         0112 00228000
         MVC   SAVDAY1(4),@TF00001                                 0112 00229000
*        DAY1 = SAVDAY1(3:4);               /* GET 2 CHAR DAY        */ 00230000
         MVC   DAY1(2),SAVDAY1+2                                   0113 00231000
*        R6 = SAVYEAR;                      /* PUT YEAR IN REG 6     */ 00232000
         SLR   R6,R6                                               0114 00233000
         IC    R6,SAVYEAR                                          0114 00234000
*        R7 = SAVDAY;                       /* PUT DAY IN REG 7      */ 00235000
         MVC   @ZT00002+2(2),SAVDAY                                0115 00236000
         L     R7,@ZT00002                                         0115 00237000
*        GEN;                               /* SHIFT FOR YEAR & ZONE */ 00238000
SHIFT28 EQU   28                                                        00239000
SHIFT4  EQU   4                                                         00240000
        SLL   7,SHIFT28                                                 00241000
        SLDL  6,SHIFT4                                                  00242000
*        ZONEYR = R6;                       /* SAVE YEAR WITH ZONE   */ 00243000
         ST    R6,@TF00001                                         0117 00244000
         MVC   ZONEYR(4),@TF00001                                  0117 00245000
*        CNVRT1(1:4) = CNVRT1(1:4) && CNVRT1(1:4);                 0118 00246000
         XC    CNVRT1(4),CNVRT1                                    0118 00247000
*        CNVRT1(5:8) = R6;                  /* PUT INTO CONVERT AREA */ 00248000
         ST    R6,@TF00001                                         0119 00249000
         MVC   CNVRT1+4(4),@TF00001                                0119 00250000
*        GEN (CVB 4,CNVRT1);                /* CONVERT YEAR TO BINARY*/ 00251000
         CVB 4,CNVRT1                                                   00252000
*        SAVYR1 = R4;                       /* SAVE BINARY YEAR      */ 00253000
         ST    R4,@TF00001                                         0121 00254000
         MVC   SAVYR1(4),@TF00001                                  0121 00255000
*        YEAR1 = SAVYR1(4);                 /* GET SINGLE CHAR YEAR  */ 00256000
         MVC   YEAR1(1),SAVYR1+3                                   0122 00257000
*        RFY R4 UNRSTD;                     /* RESTRICT REG 4        */ 00258000
*        TIMEFLG = '00'X;                   /* INITIALIZE FLAGS      */ 00259000
         MVI   TIMEFLG,X'00'                                       0124 00260000
*        MNTH = 1;                          /* INITIALIZE MONTH      */ 00261000
         LA    MNTH,1                                              0125 00262000
*        DO WHILE (SEARCH = '0'B);          /* IF DAY NOT WITHIN     */ 00263000
         B     @DE00126                                            0126 00264000
@DL00126 DS    0H                                                  0127 00265000
*          IF LASTDAY(MNTH) < DAY1 THEN     /* THIS MONTH,           */ 00266000
         LR    @10,MNTH                                            0127 00267000
         ALR   @10,@10                                             0127 00268000
         LH    @10,LASTDAY-2(@10)                                  0127 00269000
         MVC   @ZT00002+2(2),DAY1                                  0127 00270000
         C     @10,@ZT00002                                        0127 00271000
         BNL   @RF00127                                            0127 00272000
*            MNTH = MNTH+1;                 /* INCREMENT TO NEXT     */ 00273000
         AL    MNTH,@CF00037                                       0128 00274000
*          ELSE                             /* ELSE,                 */ 00275000
*            SEARCH = '1'B;                 /* EXIT DO-WHILE         */ 00276000
         B     @RC00127                                            0129 00277000
@RF00127 OI    SEARCH,B'10000000'                                  0129 00278000
*        END;                               /* END DO-WHILE          */ 00279000
@RC00127 DS    0H                                                  0130 00280000
@DE00126 TM    SEARCH,B'10000000'                                  0130 00281000
         BZ    @DL00126                                            0130 00282000
*        SEARCH = '0'B;                     /* RESET SWITCH          */ 00283000
         NI    SEARCH,B'01111111'                                  0131 00284000
*        RFY (R4,R5,R6) RSTD;               /* RESTRICT REGS 4,5,& 6 */ 00285000
*        R5 = YEAR1;                        /* DIVIDE YEAR           */ 00286000
         SLR   R5,R5                                               0133 00287000
         IC    R5,YEAR1                                            0133 00288000
*        R6 = 4;                            /* BY 4.                 */ 00289000
         LA    R6,4                                                0134 00290000
*        R4 = 0;                            /* INIT REMAINDER TO 0   */ 00291000
         SLR   R4,R4                                               0135 00292000
*        GEN (DR 4,6);                      /* DIVIDE                */ 00293000
         DR 4,6                                                         00294000
*        LEAP = R5 +1;                      /* SAVE NUMBER OF LEAP YR*/ 00295000
         LA    LEAP,1                                              0137 00296000
         ALR   LEAP,R5                                             0137 00297000
*        IF LASTDAY(MNTH-1) = DAY1 - 1&     /* IF LAST DAY OF@ZA10157*/ 00298000
*           MNTH > 2 &                      /* MONTH > FEB.  @ZA10157*/ 00299000
*           R4 = 0  THEN                    /* AND LEAP YEAR @ZA10157*/ 00300000
         LR    @10,MNTH                                            0138 00301000
         ALR   @10,@10                                             0138 00302000
         MVC   @ZT00002+2(2),DAY1                                  0138 00303000
         L     @08,@ZT00002                                        0138 00304000
         BCTR  @08,0                                               0138 00305000
         CH    @08,LASTDAY-4(@10)                                  0138 00306000
         BNE   @RF00138                                            0138 00307000
         CH    MNTH,@CH00061                                       0138 00308000
         BNH   @RF00138                                            0138 00309000
         LTR   R4,R4                                               0138 00310000
         BNZ   @RF00138                                            0138 00311000
*              MNTH = MNTH - 1;             /* CORRECT MONTH @ZA10157*/ 00312000
         BCTR  MNTH,0                                              0139 00313000
*        IF R4 = 0 & MNTH > 2 THEN DAY1=DAY1-1;/* ADJUST DAY @ZA10157*/ 00314000
@RF00138 LTR   R4,R4                                               0140 00315000
         BNZ   @RF00140                                            0140 00316000
         CH    MNTH,@CH00061                                       0140 00317000
         BNH   @RF00140                                            0140 00318000
         MVC   @ZT00002+2(2),DAY1                                  0141 00319000
         L     @10,@ZT00002                                        0141 00320000
         BCTR  @10,0                                               0141 00321000
         ST    @10,@TF00001                                        0141 00322000
         MVC   DAY1(2),@TF00001+2                                  0141 00323000
*        IF MNTH > 1 THEN                   /* IF MONTH PAST JAN.    */ 00324000
@RF00140 CH    MNTH,@CH00037                                       0142 00325000
         BNH   @RF00142                                            0142 00326000
*          CURDAY = DAY1 - LASTDAY(MNTH-1); /* GET DAY INTO MONTH    */ 00327000
         LR    @10,MNTH                                            0143 00328000
         ALR   @10,@10                                             0143 00329000
         MVC   @ZT00002+2(2),DAY1                                  0143 00330000
         L     @08,@ZT00002                                        0143 00331000
         SH    @08,LASTDAY-4(@10)                                  0143 00332000
         ST    @08,@TF00001                                        0143 00333000
         MVC   CURDAY(2),@TF00001+2                                0143 00334000
*        ELSE                               /* ELSE                  */ 00335000
*          CURDAY = DAY1;                   /* GET DAY INTO MONTH    */ 00336000
         B     @RC00142                                            0144 00337000
@RF00142 MVC   CURDAY(2),DAY1                                      0144 00338000
*                                           /* PUT MONTH INTO BUFFER */ 00339000
*        DATEBUF(1:MONTHLEN(MNTH))=MONTHNAM(MNTH);                 0145 00340000
@RC00142 LR    @10,MNTH                                            0145 00341000
         ALR   @10,@10                                             0145 00342000
         LH    @10,MONTHLEN-2(@10)                                 0145 00343000
         LR    @15,@10                                             0145 00344000
         BCTR  @15,0                                               0145 00345000
         LR    @14,MNTH                                            0145 00346000
         MH    @14,@CH00902                                        0145 00347000
         LA    @01,MONTHNAM-9(@14)                                 0145 00348000
         EX    @15,@SM01042                                        0145 00349000
*        DATEBUF(MONTHLEN(MNTH)+1)=' ';                            0146 00350000
         LA    @01,DATEBUF(@10)                                    0146 00351000
         MVI   0(@01),C' '                                         0146 00352000
*        I = MONTHLEN(MNTH)+2;              /* SET BUFFER PTR        */ 00353000
         AH    @10,@CH00061                                        0147 00354000
         LR    I,@10                                               0147 00355000
*        R4 = CURDAY;                       /* GET DAY OF MONTH      */ 00356000
         MVC   @ZT00002+2(2),CURDAY                                0148 00357000
         L     R4,@ZT00002                                         0148 00358000
*        GENERATE;                          /* CONVERT TO PRINTABLE  */ 00359000
        CVD    4,UNPACK                                                 00360000
        UNPK  UPAREA(8),UNPACK(8)                                       00361000
*        FZERO = FZERO | 'F0'X;             /* OR IN ZONE            */ 00362000
         OI    FZERO,X'F0'                                         0150 00363000
*        IF UPAREA(7) = 'F0'X THEN          /* IF DAY IS 1 CHARACTER,*/ 00364000
         CLI   UPAREA+6,X'F0'                                      0151 00365000
         BNE   @RF00151                                            0151 00366000
*          DO;                              /* THEN,                 */ 00367000
*            DATEBUF(I) = UPAREA(8);        /* MOVE IN DAY TO BUFFER */ 00368000
         LA    @10,DATEBUF-1(I)                                    0153 00369000
         MVC   0(1,@10),UPAREA+7                                   0153 00370000
*            DATEBUF(I+1) = ',';            /* INSERT COMMA          */ 00371000
         LA    @10,DATEBUF(I)                                      0154 00372000
         MVI   0(@10),C','                                         0154 00373000
*            I = I+2;                       /* INCREMENT BUFFER PTR  */ 00374000
         AH    I,@CH00061                                          0155 00375000
*          END;                                                    0156 00376000
*        ELSE                               /* ELSE,                 */ 00377000
*          DO;                                                     0157 00378000
         B     @RC00151                                            0157 00379000
@RF00151 DS    0H                                                  0158 00380000
*            DATEBUF(I:I+1) = UPAREA(7:8);  /* PUT IN BOTH CHARS     */ 00381000
         LA    @10,DATEBUF-1(I)                                    0158 00382000
         MVC   0(2,@10),UPAREA+6                                   0158 00383000
*            DATEBUF(I+2) = ',';            /* INSERT COMMA          */ 00384000
         LA    @10,DATEBUF+1(I)                                    0159 00385000
         MVI   0(@10),C','                                         0159 00386000
*            I = I+3;                       /* INCREMENT BUFFER PTR  */ 00387000
         AH    I,@CH00335                                          0160 00388000
*          END;                                                    0161 00389000
*        DATEBUF(I:I+1) = '19';             /* CENTURY IN BUFFER     */ 00390000
@RC00151 LA    @10,DATEBUF-1(I)                                    0162 00391000
         MVC   0(2,@10),@CC01016                                   0162 00392000
*        UNPACK(5:8) = ZONEYR;              /* GET YEAR              */ 00393000
         MVC   UNPACK+4(4),ZONEYR                                  0163 00394000
*        GENERATE;                          /* CONVERT TO PRINTABLE  */ 00395000
        UNPK   UPAREA(8),UNPACK(8)                                      00396000
*        FZERO = FZERO | 'F0'X;             /* OR IN ZONE            */ 00397000
         OI    FZERO,X'F0'                                         0165 00398000
*        DATEBUF(I+2:I+3) = UPAREA(7:8);    /* PUT YEAR INTO BUFFER  */ 00399000
         LA    @10,DATEBUF+1(I)                                    0166 00400000
         MVC   0(2,@10),UPAREA+6                                   0166 00401000
*        I = I+3;                           /* INCREMENT BUFFER PTR  */ 00402000
         AH    I,@CH00335                                          0167 00403000
*        DATELEN = I+4;                     /* SEGMENT LENGTH        */ 00404000
         LA    @10,4(,I)                                           0168 00405000
         STH   @10,DATELEN                                         0168 00406000
*        DATEOFF = 39;                      /* SEGMENT OFFSET        */ 00407000
         MVC   DATEOFF(2),@CH00959                                 0169 00408000
*    END CURDATE;                                                  0170 00409000
@EL00002 DS    0H                                                  0170 00410000
@EF00002 DS    0H                                                  0170 00411000
@ER00002 LM    @14,@12,@SA00002                                    0170 00412000
         BR    @14                                                 0170 00413000
*        RFY (R4,R5,R6) UNRSTD;                                    0171 00414000
*/****************************************                         0172 00415000
**                                                                 0172 00416000
** SEGMENT NAME -                                                  0172 00417000
**      CURTIME                                                    0172 00418000
**                                                                 0172 00419000
** FUNCTION -                                                      0172 00420000
**      THIS ROUTINE COMPUTES THE CURRENT TIME.                    0172 00421000
**                                                                 0172 00422000
** OPERATION -                                                     0172 00423000
**      THE TIME RETURNED BY THE TIME MACRO IS CONVERTED TO HOURS, 0172 00424000
**      MINUTES AND SECONDS.  PLACE THE RESULT INTO A BUFFER TO BE 0172 00425000
**      PASSED TO PUTLINE.                                         0172 00426000
**                                                                 0172 00427000
** INPUT -                                                         0172 00428000
**      CURRENT TIME                                               0172 00429000
**                                                                 0172 00430000
** OUTPUT -                                                        0172 00431000
**      CURRENT TIME IN PRINTABLE FORMAT                           0172 00432000
*                          *******************************************/ 00433000
*                                                                  0172 00434000
*    CURTIME: PROC;                                                0172 00435000
CURTIME  STM   @14,@12,@SA00003                                    0172 00436000
*        TIMEBUF = '  :  :  ';               /* INIT MSG BUFFER      */ 00437000
         MVC   TIMEBUF(8),@CC01020                                 0173 00438000
*        R6 = SAVTIME(1);                    /* PICK UP HOURS        */ 00439000
         SLR   R6,R6                                               0174 00440000
         IC    R6,SAVTIME                                          0174 00441000
*        R7 = SAVDAY;                        /* GET DAY FOR ZONE     */ 00442000
         MVC   @ZT00002+2(2),SAVDAY                                0175 00443000
         L     R7,@ZT00002                                         0175 00444000
*        GEN;                                /* SHIFT VALUES         */ 00445000
        SLL  7,SHIFT28                                                  00446000
        SLDL 6,SHIFT4                                                   00447000
*        CNVRT1(1:4) = CNVRT1(1:4) && CNVRT1(1:4);                 0177 00448000
         XC    CNVRT1(4),CNVRT1                                    0177 00449000
*        CNVRT1(5:8) = R6;                   /* VALUE WITH ZONE      */ 00450000
         ST    R6,@TF00001                                         0178 00451000
         MVC   CNVRT1+4(4),@TF00001                                0178 00452000
*        GEN (CVB 4,CNVRT1);                 /* CONVERT TO BINARY    */ 00453000
         CVB 4,CNVRT1                                                   00454000
*        IF R4 > 12 THEN                     /* IF HOURS AFTER NOON  */ 00455000
         LA    @10,12                                              0180 00456000
         CR    R4,@10                                              0180 00457000
         BNH   @RF00180                                            0180 00458000
*          R4 = R4 - 12;                     /* SUBTRACT 12          */ 00459000
         SLR   R4,@10                                              0181 00460000
*        GEN (CVD 4,CVDAREA);                /* CONVERT TO DECIMAL   */ 00461000
@RF00180 DS    0H                                                  0182 00462000
         CVD 4,CVDAREA                                                  00463000
*        SAVER = CVDAREA(5:8);               /* SAVE CONVERTED HOURS */ 00464000
         MVC   SAVER(4),CVDAREA+4                                  0183 00465000
*        R4 = SAVER;                         /* IN REGISTER          */ 00466000
         MVC   @TF00001(4),SAVER                                   0184 00467000
         L     R4,@TF00001                                         0184 00468000
*        GEN (SRL 4,SHIFT4);                 /* DROP ZONE DIGIT      */ 00469000
         SRL 4,SHIFT4                                                   00470000
*        CVDAREA(5:8) = R4;                  /* PUT BACK IN AREA     */ 00471000
         ST    R4,@TF00001                                         0186 00472000
         MVC   CVDAREA+4(4),@TF00001                               0186 00473000
*        SAVTIME(1) = CVDAREA(8);            /* PUT IN ACTUAL HOURS  */ 00474000
         MVC   SAVTIME(1),CVDAREA+7                                0187 00475000
*        UNPACK(5:8) = SAVTIME(1:4);         /* TIME IN UNPACK BUFFER*/ 00476000
         MVC   UNPACK+4(4),SAVTIME                                 0188 00477000
*        GEN;                                /* UNPACK TIME VALUE    */ 00478000
        UNPK    UPAREA(8),UNPACK(8)                                     00479000
*        FZERO = FZERO | 'F0'X;              /* OR IN LAST SIGN DIGIT*/ 00480000
         OI    FZERO,X'F0'                                         0190 00481000
*        TIMEBUF(1:2) = UPAREA(2:3);         /* HOURS IN MSG BUFFER  */ 00482000
         MVC   TIMEBUF(2),UPAREA+1                                 0191 00483000
*        TIMEBUF(4:5) = UPAREA(4:5);         /* MINUTES IN MSG BUFFER*/ 00484000
         MVC   TIMEBUF+3(2),UPAREA+3                               0192 00485000
*        TIMEBUF(7:8) = UPAREA(6:7);         /* SECONDS IN MSG BUFFER*/ 00486000
         MVC   TIMEBUF+6(2),UPAREA+5                               0193 00487000
*        TIMELEN = 12;                       /* MESSAGE LENGTH       */ 00488000
         MVC   TIMELEN(2),@CH00900                                 0194 00489000
*        TIMEOFF = 15;                       /* MESSAGE OFFSET       */ 00490000
         MVC   TIMEOFF(2),@CH00036                                 0195 00491000
*    END CURTIME;                                                  0196 00492000
@EL00003 DS    0H                                                  0196 00493000
@EF00003 DS    0H                                                  0196 00494000
@ER00003 LM    @14,@12,@SA00003                                    0196 00495000
         BR    @14                                                 0196 00496000
*/****************************************                         0197 00497000
**                                                                 0197 00498000
** SEGMENT NAME -                                                  0197 00499000
**      SESSTIME                                                   0197 00500000
**                                                                 0197 00501000
** FUNCTION -                                                      0197 00502000
**      THIS ROUTINE COMPUTES THE TOTAL SESSION TIME.              0197 00503000
**                                                                 0197 00504000
** OPERATION -                                                     0197 00505000
**      SUBTRACT THE USERS LOGON TIME (IN THE PSCB) FROM THE       0197 00506000
**      CURRENT TIME.  CONVERT THE DIFFERENCE INTO HOURS, MINUTES, 0197 00507000
**      AND SECONDS.  PLACE THE RESULT INTO A BUFFER TO BE PASSED  0197 00508000
**      TO PUTLINE.                                                0197 00509000
**                                                                 0197 00510000
** INPUT -                                                         0197 00511000
**       PSCB                                                      0197 00512000
**      CURRENT TIME                                               0197 00513000
**                                                                 0197 00514000
** OUTPUT -                                                        0197 00515000
**       SESSION TIME IN PRINTABLE FORMAT                          0197 00516000
*                             ****************************************/ 00517000
*                                                                  0197 00518000
*    SESSTIME: PROC;                                               0197 00519000
SESSTIME STM   @14,@12,@SA00004                                    0197 00520000
*                                      /* GET TIME IN STCK UNITS     */ 00521000
*        GEN (TIME STCK,TIMESTCK,ERRET=TIMERR);                    0198 00522000
         TIME STCK,TIMESTCK,ERRET=TIMERR                                00523000
*        RFY (R4,R5,R6,R7) RSTD;       /* RESTRICT REGS 4,5,6,7      */ 00524000
*        PSCBPTR = ADDR(PPTR);         /* POINT TO PSCB              */ 00525000
         L     @10,@PC00001+8                                      0200 00526000
         ST    @10,PSCBPTR                                         0200 00527000
*        BUFPTR = ADDR(SESSBUF);       /* PTR TO MSG BUFFER          */ 00528000
         LA    BUFPTR,SESSBUF                                      0201 00529000
*        SESSBUF = '  :  :  ';         /* INITIALIZE MSG BUFFER      */ 00530000
         MVC   SESSBUF(8),@CC01020                                 0202 00531000
*        CNVALUE = STCTIME - PSCBLTIM; /* FIND SESSION TIME IN STCK  */ 00532000
         L     CNVALUE,STCTIME                                     0203 00533000
         SL    CNVALUE,PSCBLTIM(,@10)                              0203 00534000
*        CALL CONVERT;                 /* CALL CONVERSION RTN        */ 00535000
         BAL   @14,CONVERT                                         0204 00536000
*        SESLEN = 12;                  /* MSG SEGMENT LENGTH         */ 00537000
         MVC   SESLEN(2),@CH00900                                  0205 00538000
*        SESOFF = 38;                  /* MSG SEGMENT OFFSET         */ 00539000
         MVC   SESOFF(2),@CH01024                                  0206 00540000
*    END SESSTIME;                                                 0207 00541000
@EL00004 DS    0H                                                  0207 00542000
@EF00004 DS    0H                                                  0207 00543000
@ER00004 LM    @14,@12,@SA00004                                    0207 00544000
         BR    @14                                                 0207 00545000
*        RFY (R4,R5,R6,R7) UNRSTD;                                 0208 00546000
*/***************************************                          0209 00547000
**                                                                 0209 00548000
** SEGMENT NAME -                                                  0209 00549000
**      CPUTIME                                                    0209 00550000
**                                                                 0209 00551000
** FUNCTION -                                                      0209 00552000
**      THIS ROUTINE COMPUTES THE CUMULATIVE CPU TIME.             0209 00553000
**                                                                 0209 00554000
** OPERATION -                                                     0209 00555000
**      THE CPU TIME IS PICKED UP FROM THE ASCB.  IT IS THEN       0209 00556000
**      CONVERTED TO PRIMTABLE FORMAT AND PLACED IN A BUFFER TO    0209 00557000
**      BE PASSED TO PUTLINE.                                      0209 00558000
**                                                                 0209 00559000
** INPUT -                                                         0209 00560000
**      ASCB                                                       0209 00561000
**                                                                 0209 00562000
** OUTPUT -                                                        0209 00563000
**      CPU TIME IN PRINTABLE FORMAT                               0209 00564000
*                          *******************************************/ 00565000
*                                                                  0209 00566000
*    CPUTIME: PROC;                                                0209 00567000
CPUTIME  STM   @14,@12,@SA00005                                    0209 00568000
*        VALASCB = ASCBEJST;                /* GET CPU TIME IN ASCB  */ 00569000
         MVC   VALASCB(8),ASCBEJST(ASCBPTR)                        0210 00570000
*        CNVALUE = CPUASCB;                 /* USE ONLY 1ST WORD     */ 00571000
         L     CNVALUE,CPUASCB                                     0211 00572000
*        BUFPTR = ADDR(CPUSTIME);           /* PTR TO MSG BUFFER     */ 00573000
         LA    BUFPTR,CPUSTIME                                     0212 00574000
*        CPUSTIME = '  :  :  ';             /* INIT MSG BUFFER       */ 00575000
         MVC   CPUSTIME(8),@CC01020                                0213 00576000
*        CALL CONVERT;                      /* CONVERT CPU TIME      */ 00577000
         BAL   @14,CONVERT                                         0214 00578000
*        CPULEN = 12;                       /* MSG SEGMENT LENGTH    */ 00579000
         MVC   CPULEN(2),@CH00900                                  0215 00580000
*        CPUOFF = 20;                       /* MSG SEGMENT OFFSET    */ 00581000
*                                                                  0216 00582000
         MVC   CPUOFF(2),@CH01028                                  0216 00583000
*    END CPUTIME;                                                  0217 00584000
@EL00005 DS    0H                                                  0217 00585000
@EF00005 DS    0H                                                  0217 00586000
@ER00005 LM    @14,@12,@SA00005                                    0217 00587000
         BR    @14                                                 0217 00588000
*/***************************************                          0218 00589000
**                                                                 0218 00590000
** SEGMENT NAME -                                                  0218 00591000
**      SRVUNITS                                                   0218 00592000
**                                                                 0218 00593000
** FUNCTION -                                                      0218 00594000
**      THIS ROUTINE COMPUTES THE SERVICE UNITS.                   0218 00595000
**                                                                 0218 00596000
** OPERATION -                                                     0218 00597000
**      ISSUE SVC 95 TO OBTAIN THE SERVICE UNITS. CONVERT THE VALUE     00598000
**      TO DECIMAL.  PUT THE RESULT INTO A BUFFER TO BE PASSED TO  0218 00599000
**      PUTLINE.                                                   0218 00600000
**                                                                 0218 00601000
** INPUT -                                                         0218 00602000
**      WORKAREA                                                   0218 00603000
**                                                                 0218 00604000
** OUTPUT -                                                        0218 00605000
**      SERVICE UNITS IN PRINTABLE FORMAT                          0218 00606000
*                            *****************************************/ 00607000
*                                                                  0218 00608000
*    SRVUNITS: PROC;                                               0218 00609000
SRVUNITS STM   @14,@12,@SA00006                                    0218 00610000
*        R1 = ADDR(SERVICE);                /* PTR TO RETURN DATA    */ 00611000
         LA    R1,SERVICE                                          0219 00612000
*        GEN (SYSEVENT REQSERVC);           /* ISSUE REQUEST         */ 00613000
         SYSEVENT REQSERVC                                              00614000
*        RFY R4 RSTD;                                              0221 00615000
*        R4 = SRUNITS;                      /* SAVE SERVICE UNITS    */ 00616000
         L     R4,SRUNITS                                          0222 00617000
*        GENERATE;                          /* CONVERT TO DECIMAL    */ 00618000
        CVD   4,CVDAREA                                                 00619000
        UNPK  UPAREA(8),CVDAREA(8)                                      00620000
*        RFY R4 UNRSTD;                     /* UNRESTRICT REG 4      */ 00621000
*        FZERO = FZERO | 'F0'X;             /* OR IN LAST DIGIT      */ 00622000
         OI    FZERO,X'F0'                                         0225 00623000
*        I = 1;                             /* INIT SUBSCRIPT        */ 00624000
         LA    I,1                                                 0226 00625000
*        DO WHILE (SEARCH = '0'B);          /* SEARCH FOR NON-ZERO   */ 00626000
         B     @DE00227                                            0227 00627000
@DL00227 DS    0H                                                  0228 00628000
*          IF UPAREA(I) = 'F0'X THEN        /* IF CHARACTER IS ZERO, */ 00629000
         LA    @10,UPAREA-1(I)                                     0228 00630000
         CLI   0(@10),X'F0'                                        0228 00631000
         BNE   @RF00228                                            0228 00632000
*          DO;                              /* THEN                  */ 00633000
*            I = I+1;                       /* GET NEXT CHARACTER    */ 00634000
         AL    I,@CF00037                                          0230 00635000
*            IF I = 9 THEN                  /* IF END OF FIELD,      */ 00636000
         CH    I,@CH00902                                          0231 00637000
         BNE   @RF00231                                            0231 00638000
*              SEARCH = '1'B;               /* EXIT LOOP             */ 00639000
         OI    SEARCH,B'10000000'                                  0232 00640000
*          END;                                                    0233 00641000
*          ELSE                             /* IF NOT ZERO,          */ 00642000
*            SEARCH = '1'B;                 /* EXIT LOOP             */ 00643000
         B     @RC00228                                            0234 00644000
@RF00228 OI    SEARCH,B'10000000'                                  0234 00645000
*        END;                                                      0235 00646000
@RC00228 DS    0H                                                  0235 00647000
@DE00227 TM    SEARCH,B'10000000'                                  0235 00648000
         BZ    @DL00227                                            0235 00649000
*        SEARCH = '0'B;                     /* RESET SWITCH          */ 00650000
         NI    SEARCH,B'01111111'                                  0236 00651000
*        IF I = 9 THEN                      /* IF ALL ZEROES @YM02220*/ 00652000
         CH    I,@CH00902                                          0237 00653000
         BNE   @RF00237                                            0237 00654000
*          DO;                              /* THEN          @YM02220*/ 00655000
*            SRVTIME(1) = 'F0'X;            /* PRINT 0       @YM02220*/ 00656000
         MVI   SRVTIME,X'F0'                                       0239 00657000
*            SRVLEN = 5;                    /* SET LENGTH    @YM02220*/ 00658000
         MVC   SRVLEN(2),@CH00901                                  0240 00659000
*          END;                             /*               @YM02220*/ 00660000
*        ELSE                               /* OTHERWISE     @YM02220*/ 00661000
*          DO;                              /*               @YM02220*/ 00662000
         B     @RC00237                                            0242 00663000
@RF00237 DS    0H                                                  0243 00664000
*        LEN = 8-I+1;                       /* SET LENGTH OF NON-ZERO   00665000
*                                              CHARACTER STRING      */ 00666000
         LA    LEN,8                                               0243 00667000
         SLR   LEN,I                                               0243 00668000
         AL    LEN,@CF00037                                        0243 00669000
*        SRVTIME(1:LEN) = UPAREA(I:8);      /* PUT INTO MSG BUFFER   */ 00670000
         LR    @10,LEN                                             0244 00671000
         BCTR  @10,0                                               0244 00672000
         LA    @01,UPAREA-1(I)                                     0244 00673000
         EX    @10,@SM01044                                        0244 00674000
*        SRVLEN = LEN+4;                    /* MSG LENGTH            */ 00675000
         LA    @10,4(,LEN)                                         0245 00676000
         STH   @10,SRVLEN                                          0245 00677000
*          END;                                                    0246 00678000
*        SRVOFF = 29;                       /* MSG SEGMENT OFFSET    */ 00679000
*                                                                  0247 00680000
@RC00237 MVC   SRVOFF(2),@CH01032                                  0247 00681000
*    END SRVUNITS;                                                 0248 00682000
@EL00006 DS    0H                                                  0248 00683000
@EF00006 DS    0H                                                  0248 00684000
@ER00006 LM    @14,@12,@SA00006                                    0248 00685000
         BR    @14                                                 0248 00686000
*     /***************************************************************/ 00687000
*     /*    ISSUE THE LIST FORM OF THE PUTLINE MACRO TO ESTABLISH    */ 00688000
*     /*    PARAMETER LIST                                           */ 00689000
*     /***************************************************************/ 00690000
*     GENERATE;                                                    0249 00691000
*                                                                  0249 00692000
PUTLIST    PUTLINE               OUTPUT=(PUTLIST),MF=L                  00693000
PUTEND     EQU                   *                                      00694000
PUTLNG     DC                    AL2(PUTEND-PUTLIST)                    00695000
*     /***************************************************************/ 00696000
*     /* THIS IS THE TIME MESSAGE MODULE CSECT                       */ 00697000
*     /***************************************************************/ 00698000
*     GENERATE;                                                    0250 00699000
MSGMOD     CSECT                                                        00700000
TIMEBUFF   EQU  *                                                       00701000
     DC    H'43'                       LENGTH OF PRIMARY SEGMENT        00702000
     DC    H'00'                       OFFSET TO MESSAGE                00703000
     DC    CL39'IKJ56650I TIME- CPU- SERVICE- SESSION- '                00704000
ERRORBUF EQU *                                                          00705000
     DC   H'76'                                                         00706000
     DC   H'00'                                                         00707000
     DC   CL72'IKJ56651I TIME FUNCTION CANNOT BE PERFORMED BECAUSE OF II00708000
               NOPERATIVE CLOCK'                                        00709000
IKJEFT25   CSECT                                                        00710000
     DS    0H                                                           00711000
*                                                                  0251 00712000
*/****************************************                         0251 00713000
**                                                                 0251 00714000
** SEGMENT NAME -                                                  0251 00715000
**      CONVERT                                                    0251 00716000
**                                                                 0251 00717000
** FUNCTION -                                                      0251 00718000
**      THIS ROUTINE CONVERTS STORE-CLOCK UNITS TO HOURS, MINUTES, 0251 00719000
**      AND SECONDS.                                               0251 00720000
**                                                                 0251 00721000
** OPERATION -                                                     0251 00722000
**      COMPUTE THE HOURS, MINUTES AND SECONDS REPRESENTED         0251 00723000
**      BY THE STORE-CLOCK UNITS. CONVERT TO PRINTABLE FORMAT, AND 0251 00724000
**      PLACE THE RESULT IN A BUFFER TO BE PASSED TO PUTLINE.      0251 00725000
**                                                                 0251 00726000
** INPUT -                                                         0251 00727000
**      STORE-CLOCK VALUE                                          0251 00728000
**      MESSAGE BUFFER                                             0251 00729000
**                                                                 0251 00730000
** OUTPUT -                                                        0251 00731000
**      HOURS, MINUTES AND SECONDS IN PRINTABLE FORMAT             0251 00732000
*                                 ************************************/ 00733000
*                                                                  0251 00734000
*     CONVERT: PROC;                                               0251 00735000
         B     @PB00007                                            0251 00736000
CONVERT  STM   @14,@12,@SA00007                                    0251 00737000
*        RFY (R4,R5,R6,R7) RSTD;       /* RESTRICT REGS 4,5,6, AND 7 */ 00738000
*        GENERATE;                     /* EQUATES FOR SHIFTING       */ 00739000
FOXZERO EQU X'F0'                                                       00740000
*        R7 = BUFPTR;                  /* PTR TO MSG BUFFER          */ 00741000
         LR    R7,BUFPTR                                           0254 00742000
*        R5 = CNVALUE;                 /* VALUE TO BE CONVERTED      */ 00743000
         LR    R5,CNVALUE                                          0255 00744000
*        R6 = STCKSEC;                 /* CONVERSION FACTOR  @ZA03203*/ 00745000
         L     R6,STCKSEC                                          0256 00746000
*        GEN;                                                      0257 00747000
        MR    4,6                        GET TOTAL # SECONDS  @ZA03203  00748000
*        R6 = DECFACTR;                /* DECIMAL FACTOR     @ZA03203*/ 00749000
         L     R6,DECFACTR                                         0258 00750000
*        GEN;                                                      0259 00751000
        DR    4,6                        SHIFT DECIMAL PT     @ZA03203  00752000
*        R4 = 0;                      /* INIT REMAINDER TO 0 @ZA03203*/ 00753000
         SLR   R4,R4                                               0260 00754000
*        R6 = SECPERHR;               /* #SEC PER HOUR       @ZA03203*/ 00755000
         L     R6,SECPERHR                                         0261 00756000
*        GEN;                         /* DIVIDE SEC BY SEC/HR@ZA03203*/ 00757000
        DR    4,6                       GET #HOURS          @ZA03203    00758000
        CVD   5,CVDAREA                 CONVERT TO DECIMAL  @ZA03203    00759000
        UNPK  0(2,7),CVDAREA+6(2)       UNPACK INTO MSG BUF @ZA03203    00760000
        OI    1(7),FOXZERO                                              00761000
*        R6 = SECPERMN;               /* #SEC PER MINUTE     @ZA03203*/ 00762000
         L     R6,SECPERMN                                         0263 00763000
*        R5 = R4;                     /* #SEC LEFT           @ZA03203*/ 00764000
         LR    R5,R4                                               0264 00765000
*        R4 = 0;                      /* INIT REMAINER TO 0  @ZA03203*/ 00766000
         SLR   R4,R4                                               0265 00767000
*        GEN;                         /* DIVIDE SEC BY SEC/MN@ZA03203*/ 00768000
        DR    4,6                       GET #MINUTES        @ZA03203*/  00769000
        CVD   5,CVDAREA                   CONVERT MINUTES TO DECIMAL    00770000
        UNPK  3(2,7),CVDAREA+6(2)         UNPACK INTO MSG BUFFER        00771000
        OI    4(7),FOXZERO                                              00772000
        CVD   4,CVDAREA                   CONVERT SECONDS TO DECIMAL    00773000
        UNPK  6(2,7),CVDAREA+6(2)         UNPACK INTO MESSAGE BUFFER    00774000
        OI    7(7),FOXZERO                                              00775000
*    END CONVERT;                                                  0267 00776000
@EL00007 DS    0H                                                  0267 00777000
@EF00007 DS    0H                                                  0267 00778000
@ER00007 LM    @14,@12,@SA00007                                    0267 00779000
         BR    @14                                                 0267 00780000
*        RFY (R4,R5,R6,R7) UNRSTD;      /* UNRESTRICT REGS 4,5,6 & 7 */ 00781000
*     END IKJEFT25                      /* END THE TIME PROCESSING   */ 00782000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00783000
*/*%INCLUDE SYSLIB  (IKJPTPB )                                        * 00784000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                        * 00785000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00786000
*/*%INCLUDE SYSLIB  (IHAASCB )                                        * 00787000
*;                                                                 0269 00788000
         B     @EL00001                                            0269 00789000
@DATA    DS    0H                                                       00790000
@CH00061 DC    H'2'                                                     00791000
@CH00335 DC    H'3'                                                     00792000
@CH00901 DC    H'5'                                                     00793000
@CH00902 DC    H'9'                                                     00794000
@CH00900 DC    H'12'                                                    00795000
@CH00036 DC    H'15'                                                    00796000
@CH01028 DC    H'20'                                                    00797000
@CH01032 DC    H'29'                                                    00798000
@CH01024 DC    H'38'                                                    00799000
@CH00959 DC    H'39'                                                    00800000
@SM01036 MVC   0(0,@06),PUTLIST                                         00801000
@SM01038 MVC   0(0,@09),PUTLIST                                         00802000
@SM01042 MVC   DATEBUF(0),0(@01)                                        00803000
@SM01044 MVC   SRVTIME(0),0(@01)                                        00804000
@DATD    DSECT                                                          00805000
         DS    0F                                                       00806000
@SA00001 DS    18F                                                      00807000
@PC00001 DS    4F                                                       00808000
@SA00007 DS    15F                                                      00809000
@SA00002 DS    15F                                                      00810000
@SA00003 DS    15F                                                      00811000
@SA00004 DS    15F                                                      00812000
@SA00005 DS    15F                                                      00813000
@SA00006 DS    15F                                                      00814000
@TF00001 DS    F                                                        00815000
@ZTEMPS  DS    0F                                                       00816000
@ZT00002 DC    F'0'                                                     00817000
@ZTEMPND EQU   *                                                        00818000
@ZLEN    EQU   @ZTEMPND-@ZTEMPS                                         00819000
IKJEFT25 CSECT                                                          00820000
         DS    0F                                                       00821000
@CF00037 DC    F'1'                                                     00822000
@CH00037 EQU   @CF00037+2                                               00823000
@DATD    DSECT                                                          00824000
         DS    0D                                                       00825000
PSCBPTR  DS    A                                                        00826000
PUTECB   DS    F                                                        00827000
LEAPDAYS DS    F                                                        00828000
THISYEAR DS    F                                                        00829000
TIMEADDR DS    A                                                        00830000
VAL1     DS    F                                                        00831000
YEAR     DS    H                                                        00832000
         DS    CL2                                                      00833000
PUTPL    DS    CL16                                                     00834000
         ORG   PUTPL                                                    00835000
UPTPTR   DS    AL4                                                      00836000
ECTPTR   DS    AL4                                                      00837000
ECBPTR   DS    AL4                                                      00838000
PUTPARMP DS    AL4                                                      00839000
         ORG   PUTPL+16                                                 00840000
VALASCB  DS    CL8                                                      00841000
         ORG   VALASCB                                                  00842000
CPUASCB  DS    FL4                                                      00843000
@NM00010 DS    FL4                                                      00844000
         ORG   VALASCB+8                                                00845000
TIMEFLG  DS    CL1                                                      00846000
         ORG   TIMEFLG                                                  00847000
SEARCH   DS    BL1                                                      00848000
@NM00011 EQU   TIMEFLG+0                                                00849000
         ORG   TIMEFLG+1                                                00850000
SAVDATE  DS    CL4                                                      00851000
         ORG   SAVDATE                                                  00852000
@NM00012 DS    CL1                                                      00853000
SAVYEAR  DS    CL1                                                      00854000
SAVDAY   DS    CL2                                                      00855000
         ORG   SAVDATE+4                                                00856000
SAVTIME  DS    CL4                                                      00857000
         DS    CL3                                                      00858000
CNVRT1   DS    CL8                                                      00859000
SAVYR1   DS    CL4                                                      00860000
SAVDAY1  DS    CL4                                                      00861000
YEAR1    DS    CL1                                                      00862000
DAY1     DS    CL2                                                      00863000
ZONEYR   DS    CL4                                                      00864000
SAVER    DS    CL4                                                      00865000
CURDAY   DS    CL2                                                      00866000
         DS    CL3                                                      00867000
TIMESTCK DS    CL8                                                      00868000
         ORG   TIMESTCK                                                 00869000
STCTIME  DS    FL4                                                      00870000
@NM00013 DS    FL4                                                      00871000
         ORG   TIMESTCK+8                                               00872000
CVDAREA  DS    CL8                                                      00873000
UPAREA   DS    CL8                                                      00874000
         ORG   UPAREA                                                   00875000
@NM00014 DS    CL7                                                      00876000
FZERO    DS    CL1                                                      00877000
         ORG   UPAREA+8                                                 00878000
UNPACK   DS    CL8                                                      00879000
SERVICE  DS    CL12                                                     00880000
         ORG   SERVICE                                                  00881000
SRUNITS  DS    AL4                                                      00882000
@NM00015 DS    AL4                                                      00883000
@NM00016 DS    AL4                                                      00884000
         ORG   SERVICE+12                                               00885000
TIMESBUF DS    CL70                                                     00886000
         ORG   TIMESBUF                                                 00887000
TIMELEN  DS    FL2                                                      00888000
TIMEOFF  DS    FL2                                                      00889000
TIMEBUF  DS    CL8                                                      00890000
CPULEN   DS    FL2                                                      00891000
CPUOFF   DS    FL2                                                      00892000
CPUSTIME DS    CL8                                                      00893000
SRVLEN   DS    FL2                                                      00894000
SRVOFF   DS    FL2                                                      00895000
SRVTIME  DS    CL8                                                      00896000
SESLEN   DS    FL2                                                      00897000
SESOFF   DS    FL2                                                      00898000
SESSBUF  DS    CL8                                                      00899000
DATELEN  DS    FL2                                                      00900000
DATEOFF  DS    FL2                                                      00901000
DATEBUF  DS    CL18                                                     00902000
         ORG   TIMESBUF+70                                              00903000
         DS    CL2                                                      00904000
PUTLBUF  DS    CL28                                                     00905000
         ORG   PUTLBUF                                                  00906000
SEGNUM   DS    FL4                                                      00907000
SEG1PTR  DS    AL4                                                      00908000
SEG2PTR  DS    AL4                                                      00909000
SEG3PTR  DS    AL4                                                      00910000
SEG4PTR  DS    AL4                                                      00911000
SEG5PTR  DS    AL4                                                      00912000
SEG6PTR  DS    AL4                                                      00913000
         ORG   PUTLBUF+28                                               00914000
IKJEFT25 CSECT                                                          00915000
         DS    0F                                                       00916000
@SIZDATD DC    AL1(1)                                                   00917000
         DC    AL3(@ENDDATD-@DATD)                                      00918000
@CV00852 DC    V(MSGMOD)                                                00919000
         DS    0D                                                       00920000
STCKSEC  DC    F'1048576'                                               00921000
DECFACTR DC    F'1000000'                                               00922000
SECPERHR DC    F'3600'                                                  00923000
SECPERMN DC    F'60'                                                    00924000
NUMSEG   DC    H'6'                                                     00925000
NULL     DC    H'0'                                                     00926000
BYTE1    DC    H'1'                                                     00927000
@CC01020 DC    C'  :  :  '                                              00928000
@CC01016 DC    C'19'                                                    00929000
DATARRAY DS    CL182                                                    00930000
         ORG   DATARRAY                                                 00931000
LASTDAY  DC    H'31'                                                    00932000
         DC    H'59'                                                    00933000
         DC    H'90'                                                    00934000
         DC    H'120'                                                   00935000
         DC    H'151'                                                   00936000
         DC    H'181'                                                   00937000
         DC    H'212'                                                   00938000
         DC    H'243'                                                   00939000
         DC    H'273'                                                   00940000
         DC    H'304'                                                   00941000
         DC    H'334'                                                   00942000
         DC    H'365'                                                   00943000
         DC    H'366'                                                   00944000
MONTHLEN DC    H'7'                                                     00945000
         DC    H'8'                                                     00946000
         DC    H'5'                                                     00947000
         DC    H'5'                                                     00948000
         DC    H'3'                                                     00949000
         DC    H'4'                                                     00950000
         DC    H'4'                                                     00951000
         DC    H'6'                                                     00952000
         DC    H'9'                                                     00953000
         DC    H'7'                                                     00954000
         DC    H'8'                                                     00955000
         DC    H'8'                                                     00956000
MONTHOFF DC    12H'48'                                                  00957000
MONTHNAM DC    CL9'JANUARY'                                             00958000
         DC    CL9'FEBRUARY'                                            00959000
         DC    CL9'MARCH'                                               00960000
         DC    CL9'APRIL'                                               00961000
         DC    CL9'MAY'                                                 00962000
         DC    CL9'JUNE'                                                00963000
         DC    CL9'JULY'                                                00964000
         DC    CL9'AUGUST'                                              00965000
         DC    CL9'SEPTEMBER'                                           00966000
         DC    CL9'OCTOBER'                                             00967000
         DC    CL9'NOVEMBER'                                            00968000
         DC    CL9'DECEMBER'                                            00969000
         ORG   DATARRAY+182                                             00970000
         DS    CL2                                                      00971000
TIME     DC    CL8'TIME    '                                            00972000
@DATD    DSECT                                                          00973000
PUTPARM   PUTLINE   OUTPUT=(PUTPARM),MF=L                               00974000
@DATD    DSECT                                                          00975000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00976000
@ENDDATD EQU   *                                                        00977000
IKJEFT25 CSECT                                                          00978000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00979000
@01      EQU   01                                                       00980000
@02      EQU   02                                                       00981000
@03      EQU   03                                                       00982000
@04      EQU   04                                                       00983000
@05      EQU   05                                                       00984000
@06      EQU   06                                                       00985000
@07      EQU   07                                                       00986000
@08      EQU   08                                                       00987000
@09      EQU   09                                                       00988000
@10      EQU   10                                                       00989000
@11      EQU   11                                                       00990000
@12      EQU   12                                                       00991000
@13      EQU   13                                                       00992000
@14      EQU   14                                                       00993000
@15      EQU   15                                                       00994000
MNTH     EQU   @09                                                      00995000
LEN      EQU   @09                                                      00996000
LEAP     EQU   @08                                                      00997000
I        EQU   @08                                                      00998000
CNVALUE  EQU   @09                                                      00999000
BUFPTR   EQU   @08                                                      01000000
ASCBPTR  EQU   @08                                                      01001000
R0       EQU   @00                                                      01002000
R1       EQU   @01                                                      01003000
R2       EQU   @02                                                      01004000
R3       EQU   @03                                                      01005000
R4       EQU   @04                                                      01006000
R5       EQU   @05                                                      01007000
R6       EQU   @06                                                      01008000
R7       EQU   @07                                                      01009000
R15      EQU   @15                                                      01010000
R14      EQU   @14                                                      01011000
R8       EQU   @08                                                      01012000
CVTPTR   EQU   16                                                       01013000
PTPB     EQU   0                                                        01014000
PSCB     EQU   0                                                        01015000
PSCBATR1 EQU   PSCB+16                                                  01016000
PSCBLTIM EQU   PSCB+20                                                  01017000
CVTMAP   EQU   0                                                        01018000
CVTTCBP  EQU   CVTMAP                                                   01019000
CVTDAR   EQU   CVTMAP+72                                                01020000
CVTFLGS1 EQU   CVTDAR                                                   01021000
CVTDCB   EQU   CVTMAP+116                                               01022000
CVTIERLC EQU   CVTMAP+144                                               01023000
CVTOPTA  EQU   CVTMAP+182                                               01024000
CVTOPTB  EQU   CVTMAP+183                                               01025000
CVTGTF   EQU   CVTMAP+236                                               01026000
CVTGTFST EQU   CVTGTF                                                   01027000
CVTGTFS  EQU   CVTGTFST                                                 01028000
CVTSTATE EQU   CVTGTFST                                                 01029000
CVTTMODE EQU   CVTGTFST                                                 01030000
CVTFORM  EQU   CVTGTFST                                                 01031000
CVTAQAVT EQU   CVTMAP+240                                               01032000
CVTTCMFG EQU   CVTAQAVT                                                 01033000
CVTVOLM2 EQU   CVTMAP+244                                               01034000
CVTTATA  EQU   CVTVOLM2                                                 01035000
CVTTSKS  EQU   CVTTATA                                                  01036000
CVTVOLF2 EQU   CVTTSKS                                                  01037000
CVTTAT   EQU   CVTTATA+1                                                01038000
CVTATER  EQU   CVTMAP+248                                               01039000
CVTEXT1  EQU   CVTMAP+252                                               01040000
CVTPURG  EQU   CVTMAP+260                                               01041000
CVTQMSG  EQU   CVTMAP+268                                               01042000
CVTDMSR  EQU   CVTMAP+272                                               01043000
CVTRSV37 EQU   CVTDMSR                                                  01044000
CVTDMSRF EQU   CVTRSV37                                                 01045000
CVTERPV  EQU   CVTMAP+316                                               01046000
CVTINTLA EQU   CVTMAP+320                                               01047000
CVTAPF   EQU   CVTMAP+324                                               01048000
CVTEXT2  EQU   CVTMAP+328                                               01049000
CVTHJES  EQU   CVTMAP+332                                               01050000
CVTPGSIA EQU   CVTMAP+348                                               01051000
CVTA1F1  EQU   CVTMAP+356                                               01052000
CVTSYSK  EQU   CVTMAP+357                                               01053000
CVTVOLM1 EQU   CVTMAP+380                                               01054000
CVTVOLF1 EQU   CVTVOLM1                                                 01055000
CVTATMCT EQU   CVTMAP+388                                               01056000
CVTXTNT1 EQU   0                                                        01057000
CVTXTNT2 EQU   0                                                        01058000
CVTDSSV  EQU   CVTXTNT2                                                 01059000
CVTFLGBT EQU   CVTXTNT2+5                                               01060000
CVTQID   EQU   CVTXTNT2+24                                              01061000
CVTRV400 EQU   CVTXTNT2+52                                              01062000
CVTRV409 EQU   CVTXTNT2+53                                              01063000
CVTATCVT EQU   CVTXTNT2+64                                              01064000
CVTRV429 EQU   CVTXTNT2+84                                              01065000
CVTRV438 EQU   CVTXTNT2+85                                              01066000
CVTRV457 EQU   CVTXTNT2+112                                             01067000
CVTRV466 EQU   CVTXTNT2+113                                             01068000
CVTFIX   EQU   0                                                        01069000
CVTRELNO EQU   CVTFIX+252                                               01070000
TCBADS   EQU   0                                                        01071000
ASCBCUR  EQU   TCBADS+12                                                01072000
ASCB     EQU   0                                                        01073000
ASCBEJST EQU   ASCB+64                                                  01074000
ASCBFW1  EQU   ASCB+100                                                 01075000
ASCBRCTF EQU   ASCBFW1+2                                                01076000
ASCBFLG1 EQU   ASCBFW1+3                                                01077000
ASCBDSP1 EQU   ASCB+114                                                 01078000
ASCBFLG2 EQU   ASCB+115                                                 01079000
CPTR     EQU   0                                                        01080000
UPTR     EQU   0                                                        01081000
PPTR     EQU   0                                                        01082000
EPTR     EQU   0                                                        01083000
CVTS01   EQU   CVTPGSIA                                                 01084000
CVTLPDIA EQU   CVTS01+12                                                01085000
CVTDIRST EQU   CVTLPDIA                                                 01086000
CVTSLIDA EQU   CVTS01+24                                                01087000
CVTCTLFG EQU   CVTS01+50                                                01088000
CVTRV210 EQU   CVTS01+424                                               01089000
CVTRV219 EQU   CVTS01+425                                               01090000
CVTRV228 EQU   CVTS01+426                                               01091000
CVTRV237 EQU   CVTS01+427                                               01092000
CVTMFRTR EQU   CVTS01+452                                               01093000
CVTRV262 EQU   CVTS01+468                                               01094000
CVTRV271 EQU   CVTS01+469                                               01095000
CVTRV280 EQU   CVTS01+470                                               01096000
CVTRV289 EQU   CVTS01+471                                               01097000
CVTGSDA  EQU   CVTS01+600                                               01098000
TIMEMSG  EQU   MSGMOD                                                   01099000
ERRLEN   EQU   TIMEMSG+44                                               01100000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01101000
ERRTXT   EQU   TIMEMSG+48                                               01102000
ERROFF   EQU   TIMEMSG+46                                               01103000
@NM00017 EQU   TIMEMSG+43                                               01104000
TIMMSG   EQU   TIMEMSG+4                                                01105000
TIMOFF   EQU   TIMEMSG+2                                                01106000
TIMLEN   EQU   TIMEMSG                                                  01107000
CVTRV628 EQU   CVTS01+728                                               01108000
CVTRV627 EQU   CVTS01+724                                               01109000
CVTRV626 EQU   CVTS01+720                                               01110000
CVTRV625 EQU   CVTS01+716                                               01111000
CVTRV624 EQU   CVTS01+712                                               01112000
CVTRV623 EQU   CVTS01+708                                               01113000
CVTRV622 EQU   CVTS01+704                                               01114000
CVTRV621 EQU   CVTS01+700                                               01115000
CVTIHASU EQU   CVTS01+696                                               01116000
CVTRV619 EQU   CVTS01+692                                               01117000
CVTRV618 EQU   CVTS01+688                                               01118000
CVTRV617 EQU   CVTS01+684                                               01119000
CVTRV616 EQU   CVTS01+680                                               01120000
CVTRV615 EQU   CVTS01+676                                               01121000
CVTRV614 EQU   CVTS01+672                                               01122000
CVTRV613 EQU   CVTS01+668                                               01123000
CVTTCASP EQU   CVTS01+664                                               01124000
CVT0PT03 EQU   CVTS01+660                                               01125000
CVT0PT0E EQU   CVTS01+656                                               01126000
CVTRV609 EQU   CVTS01+652                                               01127000
CVTCGK   EQU   CVTS01+648                                               01128000
CVTRAC   EQU   CVTS01+644                                               01129000
CVTRV606 EQU   CVTS01+640                                               01130000
CVTRV605 EQU   CVTS01+636                                               01131000
CVTRV604 EQU   CVTS01+632                                               01132000
CVTEFF02 EQU   CVTS01+628                                               01133000
CVTCBBR  EQU   CVTS01+624                                               01134000
CVTSSCR  EQU   CVTS01+620                                               01135000
CVTEVENT EQU   CVTS01+616                                               01136000
CVTCRCA  EQU   CVTS01+612                                               01137000
CVTTPIO  EQU   CVTS01+608                                               01138000
CVTADV   EQU   CVTS01+604                                               01139000
CVTGSDAB EQU   CVTGSDA                                                  01140000
CVTQV3   EQU   CVTS01+596                                               01141000
CVTQV2   EQU   CVTS01+592                                               01142000
CVTQV1   EQU   CVTS01+588                                               01143000
CVTRPT   EQU   CVTS01+584                                               01144000
CVTSSRB  EQU   CVTS01+580                                               01145000
CVTCSDRL EQU   CVTS01+576                                               01146000
CVTEXP1  EQU   CVTS01+572                                               01147000
CVTRMPMT EQU   CVTS01+568                                               01148000
CVTRMPTT EQU   CVTS01+564                                               01149000
CVTVPSA  EQU   CVTS01+560                                               01150000
CVTVSTOP EQU   CVTS01+556                                               01151000
CVTGTFR8 EQU   CVTS01+552                                               01152000
CVTQUIT  EQU   CVTS01+548                                               01153000
CVTVACR  EQU   CVTS01+544                                               01154000
CVTWTCB  EQU   CVTS01+540                                               01155000
CVTSTPRS EQU   CVTS01+536                                               01156000
CVT0PT02 EQU   CVTS01+532                                               01157000
CVTDARCM EQU   CVTS01+528                                               01158000
CVTIRECM EQU   CVTS01+524                                               01159000
CVTJRECM EQU   CVTS01+520                                               01160000
CVTVEMS0 EQU   CVTS01+516                                               01161000
CVTSPFRR EQU   CVTS01+512                                               01162000
CVTRLSTG EQU   CVTS01+508                                               01163000
CVT0TC0A EQU   CVTS01+504                                               01164000
CVTGMBR  EQU   CVTS01+500                                               01165000
CVTLFRM  EQU   CVTS01+496                                               01166000
CVTRMBR  EQU   CVTS01+492                                               01167000
CVTVIOP  EQU   CVTS01+488                                               01168000
CVTRV307 EQU   CVTS01+486                                               01169000
CVTRV306 EQU   CVTS01+484                                               01170000
CVTRV305 EQU   CVTS01+482                                               01171000
CVTRV304 EQU   CVTS01+480                                               01172000
CVTRV303 EQU   CVTS01+478                                               01173000
CVTRV302 EQU   CVTS01+476                                               01174000
CVTTRCA  EQU   CVTS01+472                                               01175000
CVTRV297 EQU   CVTRV289                                                 01176000
CVTRV296 EQU   CVTRV289                                                 01177000
CVTRV295 EQU   CVTRV289                                                 01178000
CVTRV294 EQU   CVTRV289                                                 01179000
CVTRV293 EQU   CVTRV289                                                 01180000
CVTRV292 EQU   CVTRV289                                                 01181000
CVTRV291 EQU   CVTRV289                                                 01182000
CVTRV290 EQU   CVTRV289                                                 01183000
CVTRV288 EQU   CVTRV280                                                 01184000
CVTRV287 EQU   CVTRV280                                                 01185000
CVTRV286 EQU   CVTRV280                                                 01186000
CVTRV285 EQU   CVTRV280                                                 01187000
CVTRV284 EQU   CVTRV280                                                 01188000
CVTRV283 EQU   CVTRV280                                                 01189000
CVTRV282 EQU   CVTRV280                                                 01190000
CVTRV281 EQU   CVTRV280                                                 01191000
CVTRV279 EQU   CVTRV271                                                 01192000
CVTRV278 EQU   CVTRV271                                                 01193000
CVTRV277 EQU   CVTRV271                                                 01194000
CVTRV276 EQU   CVTRV271                                                 01195000
CVTRV275 EQU   CVTRV271                                                 01196000
CVTRV274 EQU   CVTRV271                                                 01197000
CVTRV273 EQU   CVTRV271                                                 01198000
CVTRV272 EQU   CVTRV271                                                 01199000
CVTRV270 EQU   CVTRV262                                                 01200000
CVTRV269 EQU   CVTRV262                                                 01201000
CVTRV268 EQU   CVTRV262                                                 01202000
CVTRV267 EQU   CVTRV262                                                 01203000
CVTRV266 EQU   CVTRV262                                                 01204000
CVTRV265 EQU   CVTRV262                                                 01205000
CVTRV264 EQU   CVTRV262                                                 01206000
CVTRV263 EQU   CVTRV262                                                 01207000
CVTVFP   EQU   CVTS01+464                                               01208000
CVTVSI   EQU   CVTS01+460                                               01209000
CVTVPSIB EQU   CVTS01+456                                               01210000
CVTMFACT EQU   CVTMFRTR                                                 01211000
CVTMFCTL EQU   CVTS01+448                                               01212000
CVTPVBP  EQU   CVTS01+444                                               01213000
CVTPWI   EQU   CVTS01+440                                               01214000
CVTRV254 EQU   CVTS01+438                                               01215000
CVTRV253 EQU   CVTS01+436                                               01216000
CVTRV252 EQU   CVTS01+434                                               01217000
CVTRV251 EQU   CVTS01+433                                               01218000
CVTRV250 EQU   CVTS01+432                                               01219000
CVTRV249 EQU   CVTS01+431                                               01220000
CVTRV248 EQU   CVTS01+430                                               01221000
CVTRV247 EQU   CVTS01+429                                               01222000
CVTRV246 EQU   CVTS01+428                                               01223000
CVTRV245 EQU   CVTRV237                                                 01224000
CVTRV244 EQU   CVTRV237                                                 01225000
CVTRV243 EQU   CVTRV237                                                 01226000
CVTRV242 EQU   CVTRV237                                                 01227000
CVTRV241 EQU   CVTRV237                                                 01228000
CVTRV240 EQU   CVTRV237                                                 01229000
CVTRV239 EQU   CVTRV237                                                 01230000
CVTRV238 EQU   CVTRV237                                                 01231000
CVTRV236 EQU   CVTRV228                                                 01232000
CVTRV235 EQU   CVTRV228                                                 01233000
CVTRV234 EQU   CVTRV228                                                 01234000
CVTRV233 EQU   CVTRV228                                                 01235000
CVTRV232 EQU   CVTRV228                                                 01236000
CVTRV231 EQU   CVTRV228                                                 01237000
CVTRV230 EQU   CVTRV228                                                 01238000
CVTRV229 EQU   CVTRV228                                                 01239000
CVTRV227 EQU   CVTRV219                                                 01240000
CVTRV226 EQU   CVTRV219                                                 01241000
CVTRV225 EQU   CVTRV219                                                 01242000
CVTRV224 EQU   CVTRV219                                                 01243000
CVTRV223 EQU   CVTRV219                                                 01244000
CVTRV222 EQU   CVTRV219                                                 01245000
CVTRV221 EQU   CVTRV219                                                 01246000
CVTRV220 EQU   CVTRV219                                                 01247000
CVTRV218 EQU   CVTRV210                                                 01248000
CVTRV217 EQU   CVTRV210                                                 01249000
CVTRV216 EQU   CVTRV210                                                 01250000
CVTRV215 EQU   CVTRV210                                                 01251000
CVTRV214 EQU   CVTRV210                                                 01252000
CVTRV213 EQU   CVTRV210                                                 01253000
CVTRV212 EQU   CVTRV210                                                 01254000
CVTRV211 EQU   CVTRV210                                                 01255000
CVTLCCAT EQU   CVTS01+420                                               01256000
CVTPCCAT EQU   CVTS01+416                                               01257000
CVTIPCRP EQU   CVTS01+412                                               01258000
CVTIPCRI EQU   CVTS01+408                                               01259000
CVTIPCDS EQU   CVTS01+404                                               01260000
CVTAIDVT EQU   CVTS01+400                                               01261000
CVTSSAP  EQU   CVTS01+396                                               01262000
CVTEHCIR EQU   CVTS01+392                                               01263000
CVTEHDEF EQU   CVTS01+388                                               01264000
CVTDAIR  EQU   CVTS01+384                                               01265000
CVTPERFM EQU   CVTS01+380                                               01266000
CVT044R2 EQU   CVTS01+376                                               01267000
CVTFETCH EQU   CVTS01+372                                               01268000
CVTRSTWD EQU   CVTS01+368                                               01269000
CVTSPOST EQU   CVTS01+364                                               01270000
CVTIOBP  EQU   CVTS01+360                                               01271000
CVTASMVT EQU   CVTS01+356                                               01272000
CVTRECRQ EQU   CVTS01+352                                               01273000
CVTWSAC  EQU   CVTS01+348                                               01274000
CVTRV149 EQU   CVTS01+344                                               01275000
CVTWSAL  EQU   CVTS01+340                                               01276000
CVTSPSA  EQU   CVTS01+336                                               01277000
CVTGLMN  EQU   CVTS01+332                                               01278000
CVTVEAC0 EQU   CVTS01+328                                               01279000
CVT062R1 EQU   CVTS01+324                                               01280000
CVTRPOST EQU   CVTS01+320                                               01281000
CVTDQIQE EQU   CVTS01+316                                               01282000
CVTCSD   EQU   CVTS01+312                                               01283000
CVTLKRMA EQU   CVTS01+308                                               01284000
CVTRSPIE EQU   CVTS01+304                                               01285000
CVTRENQ  EQU   CVTS01+300                                               01286000
CVTLQCB  EQU   CVTS01+296                                               01287000
CVTFQCB  EQU   CVTS01+292                                               01288000
CVTQCS01 EQU   CVTS01+288                                               01289000
CVTAPFT  EQU   CVTS01+284                                               01290000
CVTPARRL EQU   CVTS01+280                                               01291000
CVTVWAIT EQU   CVTS01+276                                               01292000
CVTGSPL  EQU   CVTS01+272                                               01293000
CVTLSMQ  EQU   CVTS01+268                                               01294000
CVTGSMQ  EQU   CVTS01+264                                               01295000
CVTEXPRO EQU   CVTS01+260                                               01296000
CVTOPCTP EQU   CVTS01+256                                               01297000
CVTSIC   EQU   CVTS01+252                                               01298000
CVTTPIOS EQU   CVTS01+248                                               01299000
CVTRTMS  EQU   CVTS01+244                                               01300000
CVTSDBF  EQU   CVTS01+240                                               01301000
CVTSCBP  EQU   CVTS01+236                                               01302000
CVTSDMP  EQU   CVTS01+232                                               01303000
CVTSV60  EQU   CVTS01+228                                               01304000
CVTRTMCT EQU   CVTS01+224                                               01305000
CVTASCBL EQU   CVTS01+220                                               01306000
CVTASCBH EQU   CVTS01+216                                               01307000
CVTGDA   EQU   CVTS01+212                                               01308000
CVTASVT  EQU   CVTS01+208                                               01309000
CVTVVMDI EQU   CVTS01+204                                               01310000
CVTAQTOP EQU   CVTS01+200                                               01311000
CVTIOSCS EQU   CVTS01+196                                               01312000
CVTSDRM  EQU   CVTS01+192                                               01313000
CVTOPTE  EQU   CVTS01+188                                               01314000
CVTSTXU  EQU   CVTS01+184                                               01315000
CVTQUIS  EQU   CVTS01+180                                               01316000
CVTPARS  EQU   CVTS01+176                                               01317000
CVTS1EE  EQU   CVTS01+172                                               01318000
CVTFRAS  EQU   CVTS01+168                                               01319000
CVTQSAS  EQU   CVTS01+164                                               01320000
CVTCRAS  EQU   CVTS01+160                                               01321000
CVTCRMN  EQU   CVTS01+156                                               01322000
CVTDELCP EQU   CVTS01+152                                               01323000
CVTFRECL EQU   CVTS01+148                                               01324000
CVTGETCL EQU   CVTS01+144                                               01325000
CVTBLDCP EQU   CVTS01+140                                               01326000
CVTAUTHL EQU   CVTS01+136                                               01327000
CVTSCAN  EQU   CVTS01+132                                               01328000
CVTRV144 EQU   CVTS01+130                                               01329000
CVTMAXMP EQU   CVTS01+128                                               01330000
CVTSTCK  EQU   CVTS01+124                                               01331000
CVTRV139 EQU   CVTS01+123                                               01332000
CVTDSSAC EQU   CVTS01+122                                               01333000
CVTRV513 EQU   CVTS01+121                                               01334000
CVTIOSPL EQU   CVTS01+120                                               01335000
CVTPTGT  EQU   CVTS01+116                                               01336000
CVTCSPIE EQU   CVTS01+112                                               01337000
CVTSMFEX EQU   CVTS01+108                                               01338000
CVTOLT0A EQU   CVTS01+104                                               01339000
CVTSRBRT EQU   CVTS01+100                                               01340000
CVTPUTL  EQU   CVTS01+96                                                01341000
CVTASCRL EQU   CVTS01+92                                                01342000
CVTASCRF EQU   CVTS01+88                                                01343000
CVTRV326 EQU   CVTS01+84                                                01344000
CVTRV325 EQU   CVTS01+80                                                01345000
CVTRV324 EQU   CVTS01+76                                                01346000
CVT0VL01 EQU   CVTS01+72                                                01347000
CVTSHRVM EQU   CVTS01+68                                                01348000
CVTRV332 EQU   CVTS01+64                                                01349000
CVTTAS   EQU   CVTS01+60                                                01350000
CVTRSCN  EQU   CVTS01+56                                                01351000
CVTTRAC2 EQU   CVTS01+54                                                01352000
CVTTRACE EQU   CVTS01+52                                                01353000
CVTAPG   EQU   CVTS01+51                                                01354000
CVTSDTRC EQU   CVTCTLFG                                                 01355000
CVTGTRCE EQU   CVTCTLFG                                                 01356000
CVTNOMP  EQU   CVTCTLFG                                                 01357000
CVTRSV79 EQU   CVTCTLFG                                                 01358000
CVTDSTAT EQU   CVTCTLFG                                                 01359000
CVTRSV78 EQU   CVTCTLFG                                                 01360000
CVTRV333 EQU   CVTCTLFG                                                 01361000
CVTRV323 EQU   CVTCTLFG                                                 01362000
CVTSPVLK EQU   CVTS01+49                                                01363000
CVTRSV77 EQU   CVTS01+48                                                01364000
CVTRV331 EQU   CVTS01+44                                                01365000
CVTRV330 EQU   CVTS01+40                                                01366000
CVTRV329 EQU   CVTS01+36                                                01367000
CVTRV328 EQU   CVTS01+32                                                01368000
CVTRV322 EQU   CVTS01+28                                                01369000
CVTSLID  EQU   CVTSLIDA+1                                               01370000
CVTSYLK  EQU   CVTSLIDA                                                 01371000
CVTRV321 EQU   CVTS01+20                                                01372000
CVTRV320 EQU   CVTS01+16                                                01373000
CVTLPDIR EQU   CVTLPDIA+1                                               01374000
CVTRSV69 EQU   CVTDIRST                                                 01375000
CVTRSV68 EQU   CVTDIRST                                                 01376000
CVTRSV67 EQU   CVTDIRST                                                 01377000
CVTRSV66 EQU   CVTDIRST                                                 01378000
CVTRSV65 EQU   CVTDIRST                                                 01379000
CVTRSV64 EQU   CVTDIRST                                                 01380000
CVTRSV63 EQU   CVTDIRST                                                 01381000
CVTDICOM EQU   CVTDIRST                                                 01382000
CVTPVTP  EQU   CVTS01+8                                                 01383000
CVTLPDSR EQU   CVTS01+4                                                 01384000
CVTGETL  EQU   CVTS01                                                   01385000
ASCBEND  EQU   ASCB+208                                                 01386000
ASCBSRBT EQU   ASCB+200                                                 01387000
ASCBSWTL EQU   ASCB+196                                                 01388000
ASCBRS14 EQU   ASCB+195                                                 01389000
ASCBSMCT EQU   ASCB+194                                                 01390000
ASCBRS12 EQU   ASCB+192                                                 01391000
ASCBPCTT EQU   ASCB+188                                                 01392000
ASCBVGTT EQU   ASCB+184                                                 01393000
ASCBLGCB EQU   ASCB+180                                                 01394000
ASCBJBNS EQU   ASCB+176                                                 01395000
ASCBJBNI EQU   ASCB+172                                                 01396000
ASCBMCC  EQU   ASCB+168                                                 01397000
ASCBRTWA EQU   ASCB+164                                                 01398000
ASCBIQEA EQU   ASCB+160                                                 01399000
ASCBXMPQ EQU   ASCB+156                                                 01400000
ASCBRS01 EQU   ASCB+154                                                 01401000
ASCBFMCT EQU   ASCB+152                                                 01402000
ASCBOUXB EQU   ASCB+148                                                 01403000
ASCBOUCB EQU   ASCB+144                                                 01404000
ASCBMECB EQU   ASCB+140                                                 01405000
ASCBQECB EQU   ASCB+136                                                 01406000
ASCBCMSB EQU   ASCB+132                                                 01407000
ASCBCMSF EQU   ASCB+128                                                 01408000
ASCBTCBS EQU   ASCB+124                                                 01409000
ASCBNVSC EQU   ASCB+122                                                 01410000
ASCBVSC  EQU   ASCB+120                                                 01411000
ASCBSRBS EQU   ASCB+118                                                 01412000
ASCBSSRB EQU   ASCB+116                                                 01413000
ASCBRV06 EQU   ASCBFLG2                                                 01414000
ASCBRV05 EQU   ASCBFLG2                                                 01415000
ASCBRV04 EQU   ASCBFLG2                                                 01416000
ASCBSNQS EQU   ASCBFLG2                                                 01417000
ASCBS2S  EQU   ASCBFLG2                                                 01418000
ASCBCEXT EQU   ASCBFLG2                                                 01419000
ASCBPXMT EQU   ASCBFLG2                                                 01420000
ASCBXMPT EQU   ASCBFLG2                                                 01421000
ASCBRF07 EQU   ASCBDSP1                                                 01422000
ASCBRF06 EQU   ASCBDSP1                                                 01423000
ASCBRF05 EQU   ASCBDSP1                                                 01424000
ASCBRF04 EQU   ASCBDSP1                                                 01425000
ASCBRF03 EQU   ASCBDSP1                                                 01426000
ASCBRF02 EQU   ASCBDSP1                                                 01427000
ASCBFAIL EQU   ASCBDSP1                                                 01428000
ASCBNOQ  EQU   ASCBDSP1                                                 01429000
ASCBSWCT EQU   ASCB+112                                                 01430000
ASCBASXB EQU   ASCB+108                                                 01431000
ASCBTMCH EQU   ASCB+104                                                 01432000
ASCBNSWP EQU   ASCBFLG1                                                 01433000
ASCBTYP1 EQU   ASCBFLG1                                                 01434000
ASCBSTND EQU   ASCBFLG1                                                 01435000
ASCBABNT EQU   ASCBFLG1                                                 01436000
ASCBTERM EQU   ASCBFLG1                                                 01437000
ASCBS3S  EQU   ASCBFLG1                                                 01438000
ASCBCMSH EQU   ASCBFLG1                                                 01439000
ASCBTOFF EQU   ASCBFLG1                                                 01440000
ASCBRF01 EQU   ASCBRCTF                                                 01441000
ASCBTMLW EQU   ASCBRCTF                                                 01442000
ASCBOUT  EQU   ASCBRCTF                                                 01443000
ASCBWAIT EQU   ASCBRCTF                                                 01444000
ASCBRV08 EQU   ASCBRCTF                                                 01445000
ASCBFQU  EQU   ASCBRCTF                                                 01446000
ASCBFRS  EQU   ASCBRCTF                                                 01447000
ASCBTMNO EQU   ASCBRCTF                                                 01448000
ASCBAFFN EQU   ASCBFW1                                                  01449000
ASCBDUMP EQU   ASCB+96                                                  01450000
ASCBQSVC EQU   ASCB+92                                                  01451000
ASCBUBET EQU   ASCB+88                                                  01452000
ASCBECB  EQU   ASCB+84                                                  01453000
ASCBJSTL EQU   ASCB+80                                                  01454000
ASCBEWST EQU   ASCB+72                                                  01455000
ASCBTSB  EQU   ASCB+60                                                  01456000
ASCBCSCB EQU   ASCB+56                                                  01457000
ASCBRSM  EQU   ASCB+52                                                  01458000
ASCBLDA  EQU   ASCB+48                                                  01459000
ASCBSTOR EQU   ASCB+44                                                  01460000
ASCBDP   EQU   ASCB+43                                                  01461000
ASCBRV07 EQU   ASCB+42                                                  01462000
ASCBIOSM EQU   ASCB+40                                                  01463000
ASCBSEQN EQU   ASCB+38                                                  01464000
ASCBASID EQU   ASCB+36                                                  01465000
ASCBCPUS EQU   ASCB+32                                                  01466000
ASCBSPL  EQU   ASCB+28                                                  01467000
ASCBLSLQ EQU   ASCB+24                                                  01468000
ASCBFSLQ EQU   ASCB+20                                                  01469000
ASCBIOSP EQU   ASCB+16                                                  01470000
ASCBLOCK EQU   ASCB+12                                                  01471000
ASCBBWDP EQU   ASCB+8                                                   01472000
ASCBFWDP EQU   ASCB+4                                                   01473000
ASCBASCB EQU   ASCB                                                     01474000
ASCBEGIN EQU   ASCB                                                     01475000
ASCBNXT  EQU   TCBADS+8                                                 01476000
TCBCUR   EQU   TCBADS+4                                                 01477000
TCBNXT   EQU   TCBADS                                                   01478000
CVTLEVL  EQU   CVTRELNO+2                                               01479000
CVTNUMB  EQU   CVTRELNO                                                 01480000
CVTMDL   EQU   CVTFIX+250                                               01481000
@NM00009 EQU   CVTFIX+248                                               01482000
@NM00008 EQU   CVTFIX                                                   01483000
CVTRV482 EQU   CVTXTNT2+128                                             01484000
CVTRV481 EQU   CVTXTNT2+124                                             01485000
CVTRV480 EQU   CVTXTNT2+120                                             01486000
CVTRV479 EQU   CVTXTNT2+118                                             01487000
CVTRV478 EQU   CVTXTNT2+117                                             01488000
CVTRV477 EQU   CVTXTNT2+116                                             01489000
CVTRV476 EQU   CVTXTNT2+115                                             01490000
CVTRV475 EQU   CVTXTNT2+114                                             01491000
CVTRV474 EQU   CVTRV466                                                 01492000
CVTRV473 EQU   CVTRV466                                                 01493000
CVTRV472 EQU   CVTRV466                                                 01494000
CVTRV471 EQU   CVTRV466                                                 01495000
CVTRV470 EQU   CVTRV466                                                 01496000
CVTRV469 EQU   CVTRV466                                                 01497000
CVTRV468 EQU   CVTRV466                                                 01498000
CVTRV467 EQU   CVTRV466                                                 01499000
CVTRV465 EQU   CVTRV457                                                 01500000
CVTRV464 EQU   CVTRV457                                                 01501000
CVTRV463 EQU   CVTRV457                                                 01502000
CVTRV462 EQU   CVTRV457                                                 01503000
CVTRV461 EQU   CVTRV457                                                 01504000
CVTRV460 EQU   CVTRV457                                                 01505000
CVTRV459 EQU   CVTRV457                                                 01506000
CVTRV458 EQU   CVTRV457                                                 01507000
CVTRV456 EQU   CVTXTNT2+108                                             01508000
CVTRV455 EQU   CVTXTNT2+104                                             01509000
CVTRV454 EQU   CVTXTNT2+100                                             01510000
CVTRV453 EQU   CVTXTNT2+96                                              01511000
CVTRV452 EQU   CVTXTNT2+94                                              01512000
CVTRV451 EQU   CVTXTNT2+92                                              01513000
CVTRV450 EQU   CVTXTNT2+90                                              01514000
CVTRV449 EQU   CVTXTNT2+88                                              01515000
CVTRV448 EQU   CVTXTNT2+87                                              01516000
CVTRV447 EQU   CVTXTNT2+86                                              01517000
CVTRV446 EQU   CVTRV438                                                 01518000
CVTRV445 EQU   CVTRV438                                                 01519000
CVTRV444 EQU   CVTRV438                                                 01520000
CVTRV443 EQU   CVTRV438                                                 01521000
CVTRV442 EQU   CVTRV438                                                 01522000
CVTRV441 EQU   CVTRV438                                                 01523000
CVTRV440 EQU   CVTRV438                                                 01524000
CVTRV439 EQU   CVTRV438                                                 01525000
CVTRV437 EQU   CVTRV429                                                 01526000
CVTRV436 EQU   CVTRV429                                                 01527000
CVTRV435 EQU   CVTRV429                                                 01528000
CVTRV434 EQU   CVTRV429                                                 01529000
CVTRV433 EQU   CVTRV429                                                 01530000
CVTRV432 EQU   CVTRV429                                                 01531000
CVTRV431 EQU   CVTRV429                                                 01532000
CVTRV430 EQU   CVTRV429                                                 01533000
CVTRV428 EQU   CVTXTNT2+80                                              01534000
CVTRV427 EQU   CVTXTNT2+76                                              01535000
CVTRV426 EQU   CVTXTNT2+72                                              01536000
CVTRV425 EQU   CVTXTNT2+68                                              01537000
CVTATACT EQU   CVTATCVT                                                 01538000
CVTRV423 EQU   CVTXTNT2+62                                              01539000
CVTRV422 EQU   CVTXTNT2+60                                              01540000
CVTRV421 EQU   CVTXTNT2+58                                              01541000
CVTRV420 EQU   CVTXTNT2+56                                              01542000
CVTRV419 EQU   CVTXTNT2+55                                              01543000
CVTRV418 EQU   CVTXTNT2+54                                              01544000
CVTRV417 EQU   CVTRV409                                                 01545000
CVTRV416 EQU   CVTRV409                                                 01546000
CVTRV415 EQU   CVTRV409                                                 01547000
CVTRV414 EQU   CVTRV409                                                 01548000
CVTRV413 EQU   CVTRV409                                                 01549000
CVTRV412 EQU   CVTRV409                                                 01550000
CVTRV411 EQU   CVTRV409                                                 01551000
CVTRV410 EQU   CVTRV409                                                 01552000
CVTRV408 EQU   CVTRV400                                                 01553000
CVTRV407 EQU   CVTRV400                                                 01554000
CVTRV406 EQU   CVTRV400                                                 01555000
CVTRV405 EQU   CVTRV400                                                 01556000
CVTRV404 EQU   CVTRV400                                                 01557000
CVTRV403 EQU   CVTRV400                                                 01558000
CVTRV402 EQU   CVTRV400                                                 01559000
CVTRV401 EQU   CVTRV400                                                 01560000
CVTICB   EQU   CVTXTNT2+48                                              01561000
CVTSKTA  EQU   CVTXTNT2+44                                              01562000
CVTRSV99 EQU   CVTXTNT2+40                                              01563000
CVTRSV98 EQU   CVTXTNT2+36                                              01564000
CVTRSV97 EQU   CVTXTNT2+34                                              01565000
CVTRSV96 EQU   CVTXTNT2+32                                              01566000
CVTOLTEP EQU   CVTXTNT2+28                                              01567000
CVTQIDA  EQU   CVTQID+1                                                 01568000
CVTRSV95 EQU   CVTQID                                                   01569000
CVTRSV94 EQU   CVTXTNT2+20                                              01570000
CVTRSV93 EQU   CVTXTNT2+16                                              01571000
CVTRSV92 EQU   CVTXTNT2+12                                              01572000
CVTDEBVR EQU   CVTXTNT2+8                                               01573000
CVTRSV91 EQU   CVTXTNT2+6                                               01574000
CVTRSV9H EQU   CVTFLGBT                                                 01575000
CVTRSV9G EQU   CVTFLGBT                                                 01576000
CVTRSV9F EQU   CVTFLGBT                                                 01577000
CVTRSV9E EQU   CVTFLGBT                                                 01578000
CVTRSV9D EQU   CVTFLGBT                                                 01579000
CVTRSV9C EQU   CVTFLGBT                                                 01580000
CVTVME   EQU   CVTFLGBT                                                 01581000
CVTNPE   EQU   CVTFLGBT                                                 01582000
CVTNUCLS EQU   CVTXTNT2+4                                               01583000
CVTDSSVA EQU   CVTDSSV+1                                                01584000
CVTRSV89 EQU   CVTDSSV                                                  01585000
CVTRSV88 EQU   CVTXTNT1+8                                               01586000
CVTRSV87 EQU   CVTXTNT1+4                                               01587000
CVTFACHN EQU   CVTXTNT1                                                 01588000
CVTRV488 EQU   CVTMAP+412                                               01589000
CVTRV487 EQU   CVTMAP+408                                               01590000
CVTRV486 EQU   CVTMAP+404                                               01591000
CVTRV485 EQU   CVTMAP+400                                               01592000
CVTACTAP EQU   CVTMAP+396                                               01593000
CVTAUTH  EQU   CVTMAP+392                                               01594000
CVTATMCA EQU   CVTATMCT+1                                               01595000
CVTATMST EQU   CVTATMCT                                                 01596000
CVTRSV61 EQU   CVTMAP+384                                               01597000
CVTVOLT1 EQU   CVTVOLM1+1                                               01598000
CVTVOLI1 EQU   CVTVOLF1                                                 01599000
CVTSTOA  EQU   CVTMAP+376                                               01600000
CVTRSV58 EQU   CVTMAP+374                                               01601000
CVTRSV57 EQU   CVTMAP+372                                               01602000
CVTDDCE  EQU   CVTMAP+368                                               01603000
CVTPNWFR EQU   CVTMAP+364                                               01604000
CVTSMF   EQU   CVTMAP+360                                               01605000
CVTSULK  EQU   CVTMAP+358                                               01606000
CVTSLKO  EQU   CVTSYSK                                                  01607000
CVTSLKP  EQU   CVTSYSK                                                  01608000
CVTSLKQ  EQU   CVTSYSK                                                  01609000
CVTSLKR  EQU   CVTSYSK                                                  01610000
CVTRSV56 EQU   CVTSYSK                                                  01611000
CVTRSV55 EQU   CVTSYSK                                                  01612000
CVTRSV54 EQU   CVTSYSK                                                  01613000
CVTRSV53 EQU   CVTSYSK                                                  01614000
CVTRSV52 EQU   CVTA1F1                                                  01615000
CVTRSV51 EQU   CVTA1F1                                                  01616000
CVTRSV50 EQU   CVTA1F1                                                  01617000
CVTRSV49 EQU   CVTA1F1                                                  01618000
CVTRSV48 EQU   CVTA1F1                                                  01619000
CVTRSV47 EQU   CVTA1F1                                                  01620000
CVTSRSW  EQU   CVTA1F1                                                  01621000
CVTPFSW  EQU   CVTA1F1                                                  01622000
CVTPCVT  EQU   CVTMAP+352                                               01623000
CVTRSV46 EQU   CVTMAP+344                                               01624000
CVTRSV45 EQU   CVTMAP+340                                               01625000
CVTRSV44 EQU   CVTMAP+338                                               01626000
CVTRSV43 EQU   CVTMAP+336                                               01627000
CVTHJESA EQU   CVTHJES+1                                                01628000
CVTRSV42 EQU   CVTHJES                                                  01629000
CVTEXT2A EQU   CVTEXT2+1                                                01630000
CVTRSV41 EQU   CVTEXT2                                                  01631000
CVTAPFA  EQU   CVTAPF+1                                                 01632000
CVTRSV40 EQU   CVTAPF                                                   01633000
CVTRV518 EQU   CVTINTLA                                                 01634000
CVTRV517 EQU   CVTERPV                                                  01635000
CVTEORM  EQU   CVTMAP+312                                               01636000
CVTMCHPR EQU   CVTMAP+308                                               01637000
CVTTZ    EQU   CVTMAP+304                                               01638000
CVTJEPS  EQU   CVTMAP+300                                               01639000
CVTJESCT EQU   CVTMAP+296                                               01640000
CVTMODE  EQU   CVTMAP+292                                               01641000
CVTPTRV  EQU   CVTMAP+288                                               01642000
CVTREAL  EQU   CVTMAP+284                                               01643000
CVTRSV39 EQU   CVTMAP+280                                               01644000
CVTRSV38 EQU   CVTMAP+276                                               01645000
CVTDMSRA EQU   CVTDMSR+1                                                01646000
CVTRV634 EQU   CVTDMSRF                                                 01647000
CVTRV633 EQU   CVTDMSRF                                                 01648000
CVTRV632 EQU   CVTDMSRF                                                 01649000
CVTRV631 EQU   CVTDMSRF                                                 01650000
CVTRV630 EQU   CVTDMSRF                                                 01651000
CVTRV629 EQU   CVTDMSRF                                                 01652000
CVTUDUMP EQU   CVTDMSRF                                                 01653000
CVTSDUMP EQU   CVTDMSRF                                                 01654000
CVTQMSGA EQU   CVTQMSG+1                                                01655000
CVTRSV36 EQU   CVTQMSG                                                  01656000
CVTAMFF  EQU   CVTMAP+264                                               01657000
CVTPURGA EQU   CVTPURG+1                                                01658000
CVTRSV35 EQU   CVTPURG                                                  01659000
CVTCBSP  EQU   CVTMAP+256                                               01660000
CVTATERA EQU   CVTATER+1                                                01661000
CVTSYST  EQU   CVTATER                                                  01662000
CVTVOLT2 EQU   CVTTAT                                                   01663000
CVTVOLI2 EQU   CVTVOLF2                                                 01664000
CVTAQAVB EQU   CVTAQAVT+1                                               01665000
CVTRSV34 EQU   CVTTCMFG                                                 01666000
CVTRSV33 EQU   CVTTCMFG                                                 01667000
CVTRSV32 EQU   CVTTCMFG                                                 01668000
CVTRSV31 EQU   CVTTCMFG                                                 01669000
CVTRSV30 EQU   CVTTCMFG                                                 01670000
CVTRSV29 EQU   CVTTCMFG                                                 01671000
CVTRSV28 EQU   CVTTCMFG                                                 01672000
CVTTCRDY EQU   CVTTCMFG                                                 01673000
CVTGTFA  EQU   CVTGTF+1                                                 01674000
CVTRSV27 EQU   CVTGTFST                                                 01675000
CVTRNIO  EQU   CVTGTFST                                                 01676000
CVTUSR   EQU   CVTGTFST                                                 01677000
CVTRV318 EQU   CVTFORM                                                  01678000
CVTRV317 EQU   CVTTMODE                                                 01679000
CVTRV316 EQU   CVTSTATE                                                 01680000
CVTRV315 EQU   CVTGTFS                                                  01681000
CVTGTFAV EQU   CVTGTFS                                                  01682000
CVT0SCR1 EQU   CVTMAP+232                                               01683000
CVTRV515 EQU   CVTMAP+228                                               01684000
CVTRMS   EQU   CVTMAP+224                                               01685000
CVTPATCH EQU   CVTMAP+220                                               01686000
CVTTSCE  EQU   CVTMAP+216                                               01687000
CVTLNKSC EQU   CVTMAP+214                                               01688000
CVTQABST EQU   CVTMAP+212                                               01689000
CVTMDLDS EQU   CVTMAP+208                                               01690000
CVTUSER  EQU   CVTMAP+204                                               01691000
CVTABEND EQU   CVTMAP+200                                               01692000
CVTSMCA  EQU   CVTMAP+196                                               01693000
CVTRSV18 EQU   CVTMAP+192                                               01694000
CVTQLPAQ EQU   CVTMAP+188                                               01695000
CVTQCDSR EQU   CVTMAP+184                                               01696000
CVTRSV17 EQU   CVTOPTB                                                  01697000
CVTRSV16 EQU   CVTOPTB                                                  01698000
CVTFP    EQU   CVTOPTB                                                  01699000
CVTAPTHR EQU   CVTOPTB                                                  01700000
CVTNLOG  EQU   CVTOPTB                                                  01701000
CVTTOD   EQU   CVTOPTB                                                  01702000
CVTCTIMS EQU   CVTOPTB                                                  01703000
CVTPROT  EQU   CVTOPTB                                                  01704000
CVTXPFP  EQU   CVTOPTA                                                  01705000
CVTASCII EQU   CVTOPTA                                                  01706000
CVTRSV13 EQU   CVTOPTA                                                  01707000
CVTRSV12 EQU   CVTOPTA                                                  01708000
CVTNIP   EQU   CVTOPTA                                                  01709000
CVTDDR   EQU   CVTOPTA                                                  01710000
CVTAPR   EQU   CVTOPTA                                                  01711000
CVTCCH   EQU   CVTOPTA                                                  01712000
CVTSNCTR EQU   CVTMAP+180                                               01713000
CVTQMWR  EQU   CVTMAP+176                                               01714000
CVTQOCR  EQU   CVTMAP+172                                               01715000
CVT1EF00 EQU   CVTMAP+168                                               01716000
CVTMZ00  EQU   CVTMAP+164                                               01717000
CVTHEAD  EQU   CVTMAP+160                                               01718000
CVTRSV11 EQU   CVTMAP+156                                               01719000
CVT0PT01 EQU   CVTMAP+152                                               01720000
CVTMSER  EQU   CVTMAP+148                                               01721000
CVTRV516 EQU   CVTIERLC                                                 01722000
CVTILCH  EQU   CVTMAP+140                                               01723000
CVT0DS   EQU   CVTMAP+136                                               01724000
CVTFBOSV EQU   CVTMAP+132                                               01725000
CVTNUCB  EQU   CVTMAP+128                                               01726000
CVTIXAVL EQU   CVTMAP+124                                               01727000
CVTIOQET EQU   CVTMAP+120                                               01728000
CVTDCBA  EQU   CVTMAP+117                                               01729000
CVTMVS2  EQU   CVTDCB                                                   01730000
CVT6DAT  EQU   CVTDCB                                                   01731000
CVT4MPS  EQU   CVTDCB                                                   01732000
CVTRSV09 EQU   CVTDCB                                                   01733000
CVT4MS1  EQU   CVTDCB                                                   01734000
CVT2SPS  EQU   CVTDCB                                                   01735000
CVT1SSS  EQU   CVTDCB                                                   01736000
CVTRSV08 EQU   CVTDCB                                                   01737000
CVTSTB   EQU   CVTMAP+112                                               01738000
CVTQTD00 EQU   CVTMAP+108                                               01739000
CVTQTE00 EQU   CVTMAP+104                                               01740000
CVTCUCB  EQU   CVTMAP+100                                               01741000
CVTSJQ   EQU   CVTMAP+96                                                01742000
CVTPBLDL EQU   CVTMAP+92                                                01743000
CVTTPC   EQU   CVTMAP+88                                                01744000
CVTSVDCB EQU   CVTMAP+84                                                01745000
CVTBRET  EQU   CVTMAP+82                                                01746000
CVTEXIT  EQU   CVTMAP+80                                                01747000
CVT0FN00 EQU   CVTMAP+76                                                01748000
CVTDARA  EQU   CVTDAR+1                                                 01749000
CVTRSV07 EQU   CVTFLGS1                                                 01750000
CVTRSV06 EQU   CVTFLGS1                                                 01751000
CVTRSV05 EQU   CVTFLGS1                                                 01752000
CVTRSV04 EQU   CVTFLGS1                                                 01753000
CVTRSV03 EQU   CVTFLGS1                                                 01754000
CVTRSV02 EQU   CVTFLGS1                                                 01755000
CVTRSV01 EQU   CVTFLGS1                                                 01756000
CVTDMPLK EQU   CVTFLGS1                                                 01757000
CVTXITP  EQU   CVTMAP+68                                                01758000
CVTZDTAB EQU   CVTMAP+64                                                01759000
CVTMSLT  EQU   CVTMAP+60                                                01760000
CVTDATE  EQU   CVTMAP+56                                                01761000
CVTBTERM EQU   CVTMAP+52                                                01762000
CVTSYSAD EQU   CVTMAP+48                                                01763000
CVTXTLER EQU   CVTMAP+44                                                01764000
CVTILK2  EQU   CVTMAP+40                                                01765000
CVTILK1  EQU   CVTMAP+36                                                01766000
CVTPRLTV EQU   CVTMAP+32                                                01767000
CVTPCNVT EQU   CVTMAP+28                                                01768000
CVT0VL00 EQU   CVTMAP+24                                                01769000
CVTXAPG  EQU   CVTMAP+20                                                01770000
CVTBUF   EQU   CVTMAP+16                                                01771000
CVTJOB   EQU   CVTMAP+12                                                01772000
CVTLINK  EQU   CVTMAP+8                                                 01773000
CVT0EF00 EQU   CVTMAP+4                                                 01774000
CVT      EQU   CVTMAP                                                   01775000
PSCBU    EQU   PSCB+64                                                  01776000
PSCBRSZ  EQU   PSCB+60                                                  01777000
PSCBLINE EQU   PSCB+59                                                  01778000
PSCBCHAR EQU   PSCB+58                                                  01779000
PSCBUPTL EQU   PSCB+56                                                  01780000
PSCBUPT  EQU   PSCB+52                                                  01781000
PSCBRLGB EQU   PSCB+48                                                  01782000
PSCBDEST EQU   PSCB+40                                                  01783000
@NM00007 EQU   PSCB+36                                                  01784000
@NM00006 EQU   PSCB+32                                                  01785000
@NM00005 EQU   PSCB+28                                                  01786000
PSCBLTI2 EQU   PSCB+24                                                  01787000
PSCBATR2 EQU   PSCB+18                                                  01788000
@NM00004 EQU   PSCBATR1                                                 01789000
@NM00003 EQU   PSCBATR1                                                 01790000
@NM00002 EQU   PSCBATR1                                                 01791000
PSCBATTN EQU   PSCBATR1                                                 01792000
PSCBVMNT EQU   PSCBATR1                                                 01793000
PSCBJCL  EQU   PSCBATR1                                                 01794000
PSCBACCT EQU   PSCBATR1                                                 01795000
PSCBCTRL EQU   PSCBATR1                                                 01796000
PSCBGPNM EQU   PSCB+8                                                   01797000
PSCBUSRL EQU   PSCB+7                                                   01798000
PSCBUSER EQU   PSCB                                                     01799000
PTPBFLN  EQU   PTPB+8                                                   01800000
PTPBOPUT EQU   PTPB+4                                                   01801000
@NM00001 EQU   PTPB                                                     01802000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01803000
@RF00231 EQU   @RC00228                                                 01804000
@PB00007 EQU   @EL00001                                                 01805000
@ENDDATA EQU   *                                                        01806000
         END   IKJEFT25,(C'PLS1917',0701,76163)                         01807000
