         TITLE 'IKJEBEAE - EDIT STAE EXIT ROUTINE                      *00001000
                        '                                               00002000
IKJEBEAE CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IKJEBEAE  78.045'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @11,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@11                                         0001 00012000
*   IF R0=TWELVE THEN               /* IS AN SDWA PROVIDED ?         */ 00013000
         CH    R0,@CH00803                                         0041 00014000
         BNE   @RF00041                                            0041 00015000
*NOSDWA:                                                           0042 00016000
*     DO;                           /* NO - CLEANUP AND RETURN       */ 00017000
NOSDWA   DS    0H                                                  0043 00018000
*       R3=R1;                      /* SAVE THE ABEND COMPLETION CODE*/ 00019000
         LR    R3,R1                                               0043 00020000
*       COMMREG=R2;                 /* ADDRESS OF IKJEBECA           */ 00021000
         LR    COMMREG,R2                                          0044 00022000
*     END NOSDWA;                                                  0045 00023000
*   ELSE                            /* A SDWA WAS PROVIDED           */ 00024000
*YESSDWA:                                                          0046 00025000
*     DO;                                                          0046 00026000
         B     @RC00041                                            0046 00027000
@RF00041 DS    0H                                                  0046 00028000
YESSDWA  DS    0H                                                  0047 00029000
*       GEN(STM 14,12,12(13));      /* SAVE THE REGISTERS            */ 00030000
         STM 14,12,12(13)                                               00031000
*       SDWAPTR=R1;                 /* SET UP ADDRESSABILITY TO SDWA */ 00032000
         LR    SDWAPTR,R1                                          0048 00033000
*       COMMREG=SDWAPARM;           /* ADDRESS OF IKJEBECA           */ 00034000
         L     COMMREG,SDWAPARM(,SDWAPTR)                          0049 00035000
*     END YESSDWA;                                                 0050 00036000
*   DATAREG=ADDR(CATEMPBF);         /* ADDR OF WORKAREA IN CA        */ 00037000
@RC00041 LA    DATAREG,CATEMPBF(,COMMREG)                          0051 00038000
*   GENERATE REFS(DATAREG);                                        0052 00039000
           USING @DATD,DATAREG  ADDRESSABILITY TO WORK AREA             00040000
*   AERETPT=R14;                    /* SAVE RETURN ADDRESS           */ 00041000
         ST    R14,AERETPT                                         0053 00042000
*   IF CARECURS='1'B THEN           /* IS RECURSIVE ABEND    @YA01951   00043000
*                                      BIT ON -              @YA01951*/ 00044000
         TM    CARECURS(COMMREG),B'00000010'                       0054 00045000
         BO    @RT00054                                            0054 00046000
*     GOTO EXIT;                    /* YES, RET TO CALLER    @YA01951*/ 00047000
*   ELSE                            /* OTHERWISE,            @YA01951*/ 00048000
*     CARECURS='1'B;                /* TURN BIT ON           @YA01951   00049000
*                                      AND CONTINUE          @YA01951*/ 00050000
         OI    CARECURS(COMMREG),B'00000010'                       0056 00051000
*   RESPECIFY                                                      0057 00052000
*    (R2) UNRSTD;                                                  0057 00053000
*   ZSAVE1=ZSAVE1&&ZSAVE1;          /* ZERO SAVE AREAS               */ 00054000
         XC    ZSAVE1(256,COMMREG),ZSAVE1(COMMREG)                 0058 00055000
*   ZSAVE2=ZSAVE2&&ZSAVE2;          /* ZERO SAVE AREAS               */ 00056000
         XC    ZSAVE2(256,COMMREG),ZSAVE2(COMMREG)                 0059 00057000
*   ZSAVE3=ZSAVE3&&ZSAVE3;          /* ZERO SAVE AREAS               */ 00058000
         XC    ZSAVE3(136,COMMREG),ZSAVE3(COMMREG)                 0060 00059000
*   RTMSAREA=R13;                   /* ADDRESS OF LAST SAVE AREA - 0061 00060000
*                                      NOTE R13 MAY BE BAD IF NO SDWA   00061000
*                                      WAS PROVIDED                  */ 00062000
         ST    R13,RTMSAREA(,COMMREG)                              0061 00063000
*   IF R0^=TWELVE THEN                                             0062 00064000
         CH    R0,@CH00803                                         0062 00065000
         BE    @RF00062                                            0062 00066000
*     RTMXAREA=ADDR(AESVAREA);      /* PLACE ADDR OF THIS SAVEAREA IN   00067000
*                                      THE PREVIOUS AREA TO        0063 00068000
*                                      CROSS-CHAIN THEM              */ 00069000
         LA    @15,AESVAREA(,COMMREG)                              0063 00070000
         ST    @15,RTMXAREA(,R13)                                  0063 00071000
*   R13=ADDR(AESVAREA);             /* ADDR OF SAVE AREA FOR THIS  0064 00072000
*                                      MODULE                        */ 00073000
@RF00062 LA    R13,AESVAREA(,COMMREG)                              0064 00074000
*   CANXTSVA=ADDR(CASVAREA)+2*72;   /* SAVE ADDR OF NEXT SAVEAREA    */ 00075000
         LA    @15,CASVAREA(,COMMREG)                              0065 00076000
         AH    @15,@CH00867                                        0065 00077000
         ST    @15,CANXTSVA(,COMMREG)                              0065 00078000
*   AEWKAREA=AEWKAREA&&AEWKAREA;    /* ZERO WORK AREA                */ 00079000
         XC    AEWKAREA(97),AEWKAREA                               0066 00080000
*   IF R0=TWELVE THEN               /* NO SDWA PROVIDED              */ 00081000
         CH    R0,@CH00803                                         0067 00082000
         BNE   @RF00067                                            0067 00083000
*     DO;                                                          0068 00084000
*       AESDWA='1'B;                /* TURN ON SW SAYING NO SDWA     */ 00085000
*       AEERRMSG='1'B;              /* ISSUE ERROR MESSAGE           */ 00086000
         OI    AESDWA,B'11000000'                                  0070 00087000
*     END;                                                         0071 00088000
*   ELSE                                                           0072 00089000
*     IF SDWACLUP='0'B THEN         /* AE NOT ENTERED FOR CLEANUP  0072 00090000
*                                      ONLY, I.E., A CANCEL OR DETACH*/ 00091000
         B     @RC00067                                            0072 00092000
@RF00067 TM    SDWACLUP(SDWAPTR),B'10000000'                       0072 00093000
         BNZ   @RF00072                                            0072 00094000
*       AEERRMSG='1'B;              /* ISSUE ERROR MSG               */ 00095000
         OI    AEERRMSG,B'01000000'                                0073 00096000
*     ELSE                                                         0074 00097000
*       IF ECTATRM='0'B THEN        /* USER WAS CANCELED             */ 00098000
         B     @RC00072                                            0074 00099000
@RF00072 L     @15,ECTPTR(,COMMREG)                                0074 00100000
         TM    ECTATRM(@15),B'00100000'                            0074 00101000
         BNZ   @RF00074                                            0074 00102000
*         DO;                       /*                       @ZA25432*/ 00103000
*           AECANCEL='1'B;          /* ISSUE 'EDIT CANCELED' MSG     */ 00104000
         OI    AECANCEL,B'00100000'                                0076 00105000
*           CAX22ABN='1'B;          /* SET USER CANCELED     @ZA25432*/ 00106000
         OI    CAX22ABN(COMMREG),B'00000010'                       0077 00107000
*         END;                      /*                       @ZA25432*/ 00108000
*       ELSE                                                       0079 00109000
*         CADSMODS='0'B;            /* ISSUE NO MSG & TURN OFF THE 0079 00110000
*                                      DATASET MODIFIED SWITCH - EDIT   00111000
*                                      DETACHED BY TMP               */ 00112000
         B     @RC00074                                            0079 00113000
@RF00074 NI    CADSMODS(COMMREG),B'01111111'                       0079 00114000
*   CATPUTVF='0'B;                  /* TELL MS NOT VERIFY    @ZA14254*/ 00115000
@RC00074 DS    0H                                                  0080 00116000
@RC00072 DS    0H                                                  0080 00117000
@RC00067 DS    0H                                                  0081 00118000
*   CAABEND='1'B;                   /* INDICATE ABEND IN PROGRESS    */ 00119000
         OI    CAABEND(COMMREG),B'00010000'                        0081 00120000
         NI    CATPUTVF(COMMREG),B'11011111'                       0081 00121000
*                                                                  0082 00122000
*/********************************************************************/ 00123000
*/*                                                                  */ 00124000
*/*      MESSAGE ROUTINES                                            */ 00125000
*/*                                                                  */ 00126000
*/********************************************************************/ 00127000
*                                                                  0082 00128000
*   IF AEERRMSG='1'B THEN                                          0082 00129000
         TM    AEERRMSG,B'01000000'                                0082 00130000
         BNO   @RF00082                                            0082 00131000
*ERRTN:                                                            0083 00132000
*     DO;                           /* ISSUE ERROR MESSAGE           */ 00133000
ERRTN    DS    0H                                                  0084 00134000
*       AECMDLEN=CAMODELN-1;        /* STORE LENGTH OF INSERT        */ 00135000
         LH    @15,CAMODELN(,COMMREG)                              0084 00136000
         BCTR  @15,0                                               0084 00137000
         STH   @15,AECMDLEN                                        0084 00138000
*       AECMDOFF=10;                /* INSERT OFFSET                 */ 00139000
         MVC   AECMDOFF(2),@CH00842                                0085 00140000
*       AECMDNAM(1:AECMDLEN)=CAMODETX(2:AECMDLEN+1);/* MOVE NAME     */ 00141000
         BCTR  @15,0                                               0086 00142000
         EX    @15,@SM00875                                        0086 00143000
*       RESPECIFY                                                  0087 00144000
*        (CCTEST,                                                  0087 00145000
*         LEVEL2) RSTD;                                            0087 00146000
*       IF AESDWA='1'B THEN                                        0088 00147000
         TM    AESDWA,B'10000000'                                  0088 00148000
         BNO   @RF00088                                            0088 00149000
*         CCTEST=R3;                /* CODE SAVED IN REGISTER IF NO     00150000
*                                      SDWA                          */ 00151000
         LR    CCTEST,R3                                           0089 00152000
*       ELSE                        /* PICK UP CODE FROM SDWA WHEN 0090 00153000
*                                      THERE                         */ 00154000
*         DO;                                                      0090 00155000
         B     @RC00088                                            0090 00156000
@RF00088 DS    0H                                                  0091 00157000
*           R3=SDWACMPC;            /* PUT CODE IN R3                */ 00158000
         SLR   R3,R3                                               0091 00159000
         ICM   R3,7,SDWACMPC(SDWAPTR)                              0091 00160000
*           CCTEST=R3;              /* LOAD IN CCTEST--TO CHECK FOR     00161000
*                                      SYSTEM OR USER CODE           */ 00162000
         LR    CCTEST,R3                                           0092 00163000
*         END;                                                     0093 00164000
*       CCTEST=CCTEST&'00FFF000'X;  /* TEST FOR SYSTEM OR USER     0094 00165000
*                                      COMPLETION CODE               */ 00166000
@RC00088 N     CCTEST,@CF00843                                     0094 00167000
*/********************************************************************/ 00168000
*/*                                                                  */ 00169000
*/*      CHECK FOR ABEND DURING SAVE SHICH INDICATES THAT THERE IS   */ 00170000
*/*      INSUFFICIENT SPACE AVAILABLE TO SAVE INTO THE DATASET       */ 00171000
*/*      SPECIFIED. IF SO ISSUE MSGS IKJ52427I AND IKJ52428I.        */ 00172000
*/*  CHECK FOR B37,D37,E37 ABEND. IF SO RECURSION THRU IKJEBEAE IS OK*/ 00173000
*/*                                                                  */ 00174000
*/********************************************************************/ 00175000
*                                                                  0095 00176000
*       IF CCTEST='00B37000'X|CCTEST='00D37000'X|CCTEST='00E37000'X     00177000
*         THEN                      /* CHECK FOR SPECIFIC ABENDS   0095 00178000
*                                                            @OZ01558*/ 00179000
         C     CCTEST,@CF00844                                     0095 00180000
         BE    @RT00095                                            0095 00181000
         C     CCTEST,@CF00845                                     0095 00182000
         BE    @RT00095                                            0095 00183000
         C     CCTEST,@CF00846                                     0095 00184000
         BNE   @RF00095                                            0095 00185000
@RT00095 DS    0H                                                  0096 00186000
*         DO;                                                      0096 00187000
*           CARECURS='0'B;          /* INDICATE RECURSION IS OK    0097 00188000
*                                                            @OZ01558*/ 00189000
         NI    CARECURS(COMMREG),B'11111101'                       0097 00190000
*           CADSMODS='1'B;          /* FORCE RESAVE OPPORTUNITY    0098 00191000
*                                                            @ZA06619*/ 00192000
         OI    CADSMODS(COMMREG),B'10000000'                       0098 00193000
*           IF CAESDSPL=0 THEN      /* WAS SAVE IN CONTROL AT      0099 00194000
*                                                            @ZA26020*/ 00195000
*                                                                  0099 00196000
         ICM   @15,15,CAESDSPL(COMMREG)                            0099 00197000
         BZ    @RT00099                                            0099 00198000
*             /*******************************************************/ 00199000
*             /*                                                     */ 00200000
*             /* THE TIME OF THE X37 ABEND@ZA26020                   */ 00201000
*             /*                                                     */ 00202000
*             /*******************************************************/ 00203000
*                                                                  0100 00204000
*             GOTO ENDOFMSG;        /* ZERO INDICATES X37 IN @ZA26020*/ 00205000
*                                                                  0100 00206000
*           /*********************************************************/ 00207000
*           /*                                                       */ 00208000
*           /* EDIT WORKFILE                                 @ZA26020*/ 00209000
*           /*                                                       */ 00210000
*           /*********************************************************/ 00211000
*                                                                  0101 00212000
*           CAX37ABN='1'B;          /* X37 ABEND IN PROCESS  @ZA09473*/ 00213000
         OI    CAX37ABN(COMMREG),B'00000100'                       0101 00214000
*           GENERATE REFS(CAPTMS,AEMSPLST);                        0102 00215000
*                                        /* PUT OUT INFO MSG @OZ01558*/ 00216000
         IKJEBEML 1547,,,,MF=(E,AEMSPLST)                               00217000
*           RESPECIFY                                              0103 00218000
*            (R15) RSTD;            /*                       @OZ01558*/ 00219000
*           IF R15^=0&R15^=20 THEN  /* AN ERROR OCCURRED     @OZ01558*/ 00220000
         LTR   R15,R15                                             0104 00221000
         BZ    @RF00104                                            0104 00222000
         CH    R15,@CH00125                                        0104 00223000
         BE    @RF00104                                            0104 00224000
*             AERETRY='1'B;         /* INDICATE NO RETRY     @OZ01558*/ 00225000
         OI    AERETRY,B'00010000'                                 0105 00226000
*           RESPECIFY                                              0106 00227000
*            (R15) UNRSTD;          /*                       @OZ01558*/ 00228000
@RF00104 DS    0H                                                  0107 00229000
*           GENERATE REFS(CAPTMS,AEMSPLST);                        0107 00230000
*                                       /* PUT NEXT INFO MSG @OZ01558*/ 00231000
         IKJEBEML 1548,,,,MF=(E,AEMSPLST)                               00232000
*           RESPECIFY                                              0108 00233000
*            (R15) RSTD;            /*                       @OZ01558*/ 00234000
*           IF R15^=0&R15^=20 THEN  /* AN ERROR OCCURRED@OZ01558     */ 00235000
         LTR   R15,R15                                             0109 00236000
         BZ    @RF00109                                            0109 00237000
         CH    R15,@CH00125                                        0109 00238000
         BE    @RF00109                                            0109 00239000
*             AERETRY='1'B;         /* INDICATE NO RETRY     @OZ01558*/ 00240000
         OI    AERETRY,B'00010000'                                 0110 00241000
*         END;                      /*                       @OZ01558*/ 00242000
@RF00109 DS    0H                                                  0112 00243000
*ENDOFMSG:                          /*                       @ZA26020*/ 00244000
*       IF CCTEST^=0 THEN                                          0112 00245000
@RF00095 DS    0H                                                  0112 00246000
ENDOFMSG LTR   CCTEST,CCTEST                                       0112 00247000
         BZ    @RF00112                                            0112 00248000
*SYSCODE:                                                          0113 00249000
*         DO;                       /* IT WAS A SYSTEM COMPLETION  0113 00250000
*                                      CODE                          */ 00251000
SYSCODE  DS    0H                                                  0114 00252000
*           LEVEL2=1;               /* SECOND LEVEL MESSAGE NUMBER   */ 00253000
         LA    LEVEL2,1                                            0114 00254000
*           AECDEOFF=36;            /* OFFSET OF INSERT              */ 00255000
         MVC   AECDEOFF(2),@CH00631                                0115 00256000
*           AECDELEN=SEVEN;         /* OFFSET LENGTH                 */ 00257000
         LA    @10,7                                               0116 00258000
         STH   @10,AECDELEN                                        0116 00259000
*           R5=R3/256;              /* SHIFT RIGHT EIGHT BITS        */ 00260000
         LR    R5,R3                                               0117 00261000
         SRL   R5,8                                                0117 00262000
*           R5=R5|AEZONES;          /* ADD ZONE                      */ 00263000
         O     R5,@CF00787                                         0118 00264000
*           AECDETXT(5:8)=R5;       /* STORE VALUE FOR CONVERSION    */ 00265000
         ST    R5,AECDETXT+4                                       0119 00266000
*           UNPK(AECDETXT(1:3),AECDETXT(5:8));/* UNPACK THE CODE     */ 00267000
         UNPK  AECDETXT(3),AECDETXT+4(4)                           0120 00268000
*           AETABADR=ADDR(AETRNSTB)-CHARZERO;/* START TRANSLATION  0121 00269000
*                                      TABLE HERE                    */ 00270000
         LA    @10,AETRNSTB                                        0121 00271000
         SH    @10,CHARZERO                                        0121 00272000
         ST    @10,AETABADR                                        0121 00273000
*           TR(AECDETXT(1:3),AETRNSLT);/* TRANSLATE TO EBCDIC        */ 00274000
         TR    AECDETXT(3),AETRNSLT(@10)                           0122 00275000
*         END SYSCODE;                                             0123 00276000
*       ELSE                                                       0124 00277000
*USERCODE:                                                         0124 00278000
*         DO;                       /* A USER COMPLETION CODE WAS  0124 00279000
*                                      PRESENT                       */ 00280000
         B     @RC00112                                            0124 00281000
@RF00112 DS    0H                                                  0124 00282000
USERCODE DS    0H                                                  0125 00283000
*           LEVEL2=2;               /* SECOND LEVEL MSG NUMBER       */ 00284000
         LA    LEVEL2,2                                            0125 00285000
*           AECDEOFF=34;            /* OFFSET OF INSERT              */ 00286000
         MVC   AECDEOFF(2),@CH00855                                0126 00287000
*           AECDELEN=EIGHT;         /* INSERT LENGTH                 */ 00288000
         LA    @10,8                                               0127 00289000
         STH   @10,AECDELEN                                        0127 00290000
*           CVD(R3,AECDETXT(5:8));  /* CONVERT TO EBCDIC             */ 00291000
         CVD   R3,@TS00001                                         0128 00292000
         MVC   AECDETXT+4(4),@TS00001+4                            0128 00293000
*           UNPK(AECDETXT(1:4),AECDETXT(5:8));/* PRINTABLE CHARS     */ 00294000
         UNPK  AECDETXT(4),AECDETXT+4(4)                           0129 00295000
*           AECDETXT=AECDETXT|AEZONES;/* ADD ZONE            @ZA26294*/ 00296000
         OC    AECDETXT(4),@CB00787                                0130 00297000
         XC    AECDETXT+4(4),AECDETXT+4                            0130 00298000
*         END USERCODE;                                            0131 00299000
*                                                                  0131 00300000
*       /*************************************************************/ 00301000
*       /*                                                           */ 00302000
*       /* PUT OUT THE MESSAGE CONSTRUCTED BY CALLING IKJEBEMS       */ 00303000
*       /*                                                           */ 00304000
*       /*************************************************************/ 00305000
*                                                                  0132 00306000
*       GENERATE REFS(CAPTMS,LEVEL2,AECMDINS,AECDEINS,AEMSPLST);   0132 00307000
@RC00112 DS    0H                                                  0132 00308000
         IKJEBEML 1285,(LEVEL2),AECMDINS,AECDEINS,MF=(E,AEMSPLST)       00309000
*       RESPECIFY                                                  0133 00310000
*        (CCTEST,                                                  0133 00311000
*         LEVEL2) UNRSTD;                                          0133 00312000
*       RESPECIFY                                                  0134 00313000
*        (R15) RSTD;                                               0134 00314000
*       IF R15^=0&R15^=20 THEN      /* AN ERROR WAS ENCOUNTERED,   0135 00315000
*                                      DON'T RETRY-CLEANUP & EXIT    */ 00316000
         LTR   R15,R15                                             0135 00317000
         BZ    @RF00135                                            0135 00318000
         CH    R15,@CH00125                                        0135 00319000
         BE    @RF00135                                            0135 00320000
*         AERETRY='1'B;             /* INDICATE NO RETRY             */ 00321000
         OI    AERETRY,B'00010000'                                 0136 00322000
*       RESPECIFY                                                  0137 00323000
*        (R15) UNRSTD;                                             0137 00324000
@RF00135 DS    0H                                                  0138 00325000
*     END ERRTN;                                                   0138 00326000
*   IF AECANCEL='1'B THEN           /* SESSION CANCELLED             */ 00327000
@RF00082 TM    AECANCEL,B'00100000'                                0139 00328000
         BNO   @RF00139                                            0139 00329000
*CANMSG:                                                           0140 00330000
*     DO;                           /* ISSUE CANCEL MESSAGE          */ 00331000
CANMSG   DS    0H                                                  0141 00332000
*       GENERATE REFS(CAPTMS,AEMSPLST);                            0141 00333000
          IKJEBEML 1543,,,,MF=(E,AEMSPLST)                              00334000
*                                   /* PUT OUT MSG TELLING USER EDIT    00335000
*                                      SESSION CANCELED              */ 00336000
*       RESPECIFY                                                  0142 00337000
*        (R15) RSTD;                                               0142 00338000
*       IF R15^=0&R15^=20 THEN                                     0143 00339000
         LTR   R15,R15                                             0143 00340000
         BZ    @RF00143                                            0143 00341000
         CH    R15,@CH00125                                        0143 00342000
         BE    @RF00143                                            0143 00343000
*         AERETRY='1'B;             /* DONT RETRY IF AN ERROR      0144 00344000
*                                      OCCURRED                      */ 00345000
         OI    AERETRY,B'00010000'                                 0144 00346000
*       RESPECIFY                                                  0145 00347000
*        (R15) UNRSTD;                                             0145 00348000
@RF00143 DS    0H                                                  0146 00349000
*     END CANMSG;                                                  0146 00350000
*                                                                  0147 00351000
*/********************************************************************/ 00352000
*/*                                                                  */ 00353000
*/*   CLEAN-UP PROCESSING.                                           */ 00354000
*/*                                                                  */ 00355000
*/* 1. STOP AUTOMATIC LINE NUMBER PROMPTING - ISSUE THE SPAUTOPT     */ 00356000
*/*    MACRO INSTRUCTION TO INSURE THAT LINE NUMBER PROMPTING IS     */ 00357000
*/*    STOPPED.                                                      */ 00358000
*/*                                                                  */ 00359000
*/* 2. DELETE THE INPUT STACK - INSURE THAT INPUT FOR PROMPT         */ 00360000
*/*    MESSAGE IN THE RETRY ROUTINE IS FROM THE TERMINAL.            */ 00361000
*/*                                                                  */ 00362000
*/* 3. PLACE THE COMPLETION CODE IN THE ECT AND INDICATE THAT AN     */ 00363000
*/*    ABEND IS IN PROGRESS.                                         */ 00364000
*/*                                                                  */ 00365000
*/* 4. FREE ANY GOTTEN CORE - DETERMINE IF A IKJPARS PDL EXISTS, IF  */ 00366000
*/*    A SUBCOMMAND BUFFER EXISTS, IF AN INCORE DATA SET EXISTS      */ 00367000
*/*    OR IF A GETMAINED BUFFER EXISTS.                              */ 00368000
*/*    ISSUE A FREEMAIN MACRO INSTRUCTION FOR ANY OF THE ABOVE THAT  */ 00369000
*/*    EXISTS.                                                       */ 00370000
*/*                                                                  */ 00371000
*/********************************************************************/ 00372000
*                                                                  0147 00373000
*   GEN( SPAUTOPT );                /* STOP AUTOMATIC LINE # PROMPT  */ 00374000
@RF00139 DS    0H                                                  0147 00375000
          SPAUTOPT                                                      00376000
*   RESPECIFY                                                      0148 00377000
*    (R15) RSTD;                                                   0148 00378000
*   IF R15^=0&R15^=8 THEN           /* ERROR OCCURRED, RETRY       0149 00379000
*                                      IMPOSSIBLE                    */ 00380000
         LTR   R15,R15                                             0149 00381000
         BZ    @RF00149                                            0149 00382000
         CH    R15,@CH00046                                        0149 00383000
         BE    @RF00149                                            0149 00384000
*     AERETRY='1'B;                 /* INDICATE NO RETRY             */ 00385000
         OI    AERETRY,B'00010000'                                 0150 00386000
*   RESPECIFY                                                      0151 00387000
*    (R15) UNRSTD;                                                 0151 00388000
@RF00149 DS    0H                                                  0152 00389000
*   CALL IKJEBMA2(AESTPB);          /* CALL THE CSECT OF IKJEBEMA TO    00390000
*                                      HANDLE THE QUEUE CLEAR & STACK   00391000
*                                      DELETE PUT IN NO-OP AND A 1 0152 00392000
*                                      FOR THE ID=1 KEYWORD ON THE 0152 00393000
*                                      ASSEMBLER CALL MACRO          */ 00394000
         LA    @15,AESTPB                                          0152 00395000
         ST    @15,@AL00001                                        0152 00396000
         L     @15,@CV00758                                        0152 00397000
         LA    @01,@AL00001                                        0152 00398000
         BALR  @14,@15                                             0152 00399000
*   GENERATE;                                                      0153 00400000
          DC    X'4700'                                                 00401000
          DC    AL2(1)                                                  00402000
*   RESPECIFY                                                      0154 00403000
*    (R15) RSTD;                                                   0154 00404000
*   IF R15^=0 THEN                  /* AN ERROR OCCURRED             */ 00405000
         LTR   R15,R15                                             0155 00406000
         BZ    @RF00155                                            0155 00407000
*     AERETRY='1'B;                 /* DO NOT RETRY                  */ 00408000
         OI    AERETRY,B'00010000'                                 0156 00409000
*   RESPECIFY                                                      0157 00410000
*    (R15) UNRSTD;                                                 0157 00411000
@RF00155 DS    0H                                                  0158 00412000
*   ECTRTCD=R3;                     /* STORE RETURN CODE IN ECT      */ 00413000
         L     @15,ECTPTR(,COMMREG)                                0158 00414000
         STCM  R3,7,ECTRTCD(@15)                                   0158 00415000
*   ECTRCDF='1'B;                   /* INDICATE THAT EDIT IS ABENDING*/ 00416000
         MVI   ECTRCDF(@15),B'10000000'                            0159 00417000
*   RESPECIFY                                                      0160 00418000
*    (R2) RSTD;                                                    0160 00419000
*   IF CAFREEDL='0'B THEN           /* DOES A PDL EXIST WHICH      0161 00420000
*                                      REQUIRES FREEING ?            */ 00421000
         TM    CAFREEDL(COMMREG),B'10000000'                       0161 00422000
         BNZ   @RF00161                                            0161 00423000
*FREEPDL:                                                          0162 00424000
*     DO;                           /* IF YES RELEASE IT             */ 00425000
FREEPDL  DS    0H                                                  0163 00426000
*       R2=CAPTPRSD;                /* LOAD PDL ADDRESS              */ 00427000
         L     R2,CAPTPRSD(,COMMREG)                               0163 00428000
*       GEN( IKJRLSA (R2) );        /* FREEMAIN IKJPARS PDL          */ 00429000
          IKJRLSA (R2)                                                  00430000
*       CAFREEDL='1'B;              /* TURN OFF PDL INDICATION       */ 00431000
         OI    CAFREEDL(COMMREG),B'10000000'                       0165 00432000
*     END FREEPDL;                                                 0166 00433000
*   RESPECIFY                                                      0167 00434000
*    (R2) UNRSTD;                                                  0167 00435000
@RF00161 DS    0H                                                  0168 00436000
*   IF CAPTCORE^=0 THEN                                            0168 00437000
         L     @15,CAPTCORE(,COMMREG)                              0168 00438000
         LTR   @15,@15                                             0168 00439000
         BZ    @RF00168                                            0168 00440000
*     DO;                           /* FREE CORE FOR SYNTAX CHECKERS    00441000
*                                      OR RUN BUFFER                 */ 00442000
*       R3=CAPTCORE;                /* PTR TO CORE           @YM04732*/ 00443000
         LR    R3,@15                                              0170 00444000
*       R5=CACORELN;                /* LENGTH OF CORE        @YM04732*/ 00445000
         L     R5,CACORELN(,COMMREG)                               0171 00446000
*       GENERATE REFS(AEFREMNL);                                   0172 00447000
*                                     /*                     @YM04732*/ 00448000
          FREEMAIN E,LV=(R5),A=(R3),SP=1,MF=(E,AEFREMNL)     @YM04732   00449000
*       CAPTCORE=0;                 /* INDICATE CORE FREED           */ 00450000
         SLR   @15,@15                                             0173 00451000
         ST    @15,CAPTCORE(,COMMREG)                              0173 00452000
*     END;                                                         0174 00453000
*   CALL IKJEBMA2(AEFREMNL);        /* BRANCH TO FREE CURRENT INPUT     00454000
*                                      BUFFER DUPLICATE THE ID=0 PARM   00455000
*                                      OF ASSEMBLER/CALL             */ 00456000
@RF00168 LA    @15,AEFREMNL                                        0175 00457000
         ST    @15,@AL00001                                        0175 00458000
         L     @15,@CV00758                                        0175 00459000
         LA    @01,@AL00001                                        0175 00460000
         BALR  @14,@15                                             0175 00461000
*   GENERATE;                                                      0176 00462000
          DC    X'4700'                                                 00463000
          DC    AL2(0)                                                  00464000
*                                                                  0177 00465000
*/********************************************************************/ 00466000
*/*                                                                  */ 00467000
*/*   IF SDWA WAS PASSED AND NO ERRORS WERE ENCOUNTERED IN AE        */ 00468000
*/*   PROCESSING, THEN RETRY--PASS THE RETRY ADDRESS (IN IKJEBEMA),  */ 00469000
*/*   A RETURN CODE OF 4 INDICATING RETRY, AND TELL RTM TO FREE      */ 00470000
*/*   THE SDWA. IF ERRORS OCCURRED IN PROCESSING, A RETURN CODE OF   */ 00471000
*/*   ZERO IS SET TO INDICATE TERMINATION IS TO CONTINUE.            */ 00472000
*/*                                                                  */ 00473000
*/*   IF NO SDWA WAS PASSED, LINK TO IKJEBEEN (END) TO CLEAN UP      */ 00474000
*/*   BEFORE RETURNING.                                              */ 00475000
*/*                                                                  */ 00476000
*/********************************************************************/ 00477000
*                                                                  0177 00478000
*   R1=SDWAPTR;                     /* SET UP POINTER TO SDWA        */ 00479000
         LR    R1,SDWAPTR                                          0177 00480000
*   IF AESDWA='0'B&                 /* SDWA WAS PRESENT              */ 00481000
*       AERETRY='0'B                /* NO ERRORS IN CLEANUP          */ 00482000
*       &SDWACLUP='0'B              /* NOT ENTERED FOR CLEANUP ONLY  */ 00483000
*       &CAINPROC='0'B              /* NOT AN IN-CORE PROCEDURE      */ 00484000
*     THEN                                                         0178 00485000
         TM    AESDWA,B'10010000'                                  0178 00486000
         BNZ   @RF00178                                            0178 00487000
         TM    SDWACLUP(SDWAPTR),B'10000000'                       0178 00488000
         BNZ   @RF00178                                            0178 00489000
         TM    CAINPROC(COMMREG),B'00000100'                       0178 00490000
         BNZ   @RF00178                                            0178 00491000
*RETRY:                                                            0179 00492000
*     DO;                           /* GO TO THE RETRY ROUTINE       */ 00493000
RETRY    DS    0H                                                  0180 00494000
*       R13=RTMSAREA;               /* RESTORE SAVE AREA ADDRESS     */ 00495000
         L     R13,RTMSAREA(,COMMREG)                              0180 00496000
*       DO;                         /* SETRP RETADDR(AERTRY)RC(4)REGS   00497000
*                                      (14,12)FRESDWA(YES)           */ 00498000
*         RESPECIFY                                                0182 00499000
*          (GPR00P,                                                0182 00500000
*           GPR01P,                                                0182 00501000
*           GPR14P,                                                0182 00502000
*           GPR15P) RSTD;                                          0182 00503000
*         GPR01P->SDWARCDE=4;       /* STORE RC INTO SDWA            */ 00504000
         MVI   SDWARCDE(GPR01P),X'04'                              0183 00505000
*         GPR01P->SDWARTYA=ADDR(AERTRY);/* SAVE RETRY ADDRESS        */ 00506000
         MVC   SDWARTYA(4,GPR01P),CAPTRTRY(COMMREG)                0184 00507000
*         GPR01P->SDWAFREE='1'B;    /* SET FLAG TO FREE SDWA         */ 00508000
         OI    SDWAFREE(GPR01P),B'00000100'                        0185 00509000
*         GEN(RETURN (14,12));                                     0186 00510000
         RETURN (14,12)                                                 00511000
*         RESPECIFY                                                0187 00512000
*          (GPR00P,                                                0187 00513000
*           GPR01P,                                                0187 00514000
*           GPR14P,                                                0187 00515000
*           GPR15P) UNRSTD;                                        0187 00516000
*       END;                                                       0188 00517000
*     END RETRY;                                                   0189 00518000
*   ELSE                                                           0190 00519000
*NORETRY:                                                          0190 00520000
*     DO;                           /* NO RETRY-CALL END TO FINISH 0190 00521000
*                                      CLEANUP                       */ 00522000
         B     @RC00178                                            0190 00523000
@RF00178 DS    0H                                                  0190 00524000
NORETRY  DS    0H                                                  0191 00525000
*       IF AERETRY='0'B THEN                                       0191 00526000
         TM    AERETRY,B'00010000'                                 0191 00527000
         BNZ   @RF00191                                            0191 00528000
*         DO;                       /* GO TO END IF ALL STILL OK     */ 00529000
*           PARMREG1=COMMREG;       /* GET COMM AREA PTR     @ZA09473*/ 00530000
         LR    PARMREG1,COMMREG                                    0193 00531000
*           CALL IKJEBEEN;          /* GO TO END             @ZA09473*/ 00532000
         L     @15,@CV00865                                        0194 00533000
         BALR  @14,@15                                             0194 00534000
*         END;                                                     0195 00535000
*EXIT:                                                             0196 00536000
*       IF AESDWA='0'B THEN                                        0196 00537000
@RF00191 DS    0H                                                  0196 00538000
EXIT     TM    AESDWA,B'10000000'                                  0196 00539000
         BNZ   @RF00196                                            0196 00540000
*         DO;                                                      0197 00541000
*           R13=RTMSAREA;           /* SAVE AREA ADDRESS             */ 00542000
         L     R13,RTMSAREA(,COMMREG)                              0198 00543000
*           DO;                     /* SETRP RC(0)REGS(14,12)        */ 00544000
*             RESPECIFY                                            0200 00545000
*              (GPR00P,                                            0200 00546000
*               GPR01P,                                            0200 00547000
*               GPR14P,                                            0200 00548000
*               GPR15P) RSTD;                                      0200 00549000
*             GPR01P->SDWARCDE=0;   /* SAVE RC VALUE                 */ 00550000
         MVI   SDWARCDE(GPR01P),X'00'                              0201 00551000
*             GEN(RETURN (14,12));                                 0202 00552000
         RETURN (14,12)                                                 00553000
*             RESPECIFY                                            0203 00554000
*              (GPR00P,                                            0203 00555000
*               GPR01P,                                            0203 00556000
*               GPR14P,                                            0203 00557000
*               GPR15P) UNRSTD;                                    0203 00558000
*           END;                    /* CONTINUE TERMINATION: ERRORS     00559000
*                                      WERE ENCOUNTERED OR IT WAS AN    00560000
*                                      INCORE PROC                   */ 00561000
*         END;                                                     0205 00562000
*       ELSE                                                       0206 00563000
*         R15=0;                    /* NO SDWA WAS PROVIDED          */ 00564000
         B     @RC00196                                            0206 00565000
@RF00196 SLR   R15,R15                                             0206 00566000
*     END NORETRY;                                                 0207 00567000
@RC00196 DS    0H                                                  0208 00568000
*   R14=AERETPT;                    /* LOAD RETURN ADDRESS           */ 00569000
@RC00178 L     R14,AERETPT                                         0208 00570000
*   RETURN;                                                        0209 00571000
@EL00001 DS    0H                                                  0209 00572000
@EF00001 DS    0H                                                  0209 00573000
@ER00001 BR    @14                                                 0209 00574000
*   END IKJEBEAE                                                   0210 00575000
*                                                                  0210 00576000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00577000
*/*%INCLUDE SYSLIB  (IKJEBECA)                                       */ 00578000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 00579000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00580000
*/*%INCLUDE SYSLIB  (IKJEBEMJ)                                       */ 00581000
*                                                                  0210 00582000
*       ;                                                          0210 00583000
@DATA    DS    0H                                                       00584000
@CH00046 DC    H'8'                                                     00585000
@CH00842 DC    H'10'                                                    00586000
@CH00125 DC    H'20'                                                    00587000
@CH00855 DC    H'34'                                                    00588000
@CH00631 DC    H'36'                                                    00589000
@CH00867 DC    H'144'                                                   00590000
@CH00803 DC    XL2'000C'                                                00591000
@SM00875 MVC   AECMDNAM(0),CAMODETX+1(COMMREG)                          00592000
@DATD    DSECT                                                          00593000
         DS    0F                                                       00594000
@AL00001 DS    1A                                                       00595000
IKJEBEAE CSECT                                                          00596000
         DS    0F                                                       00597000
@CF00787 DC    XL4'0000000F'                                            00598000
@CF00843 DC    XL4'00FFF000'                                            00599000
@CF00844 DC    XL4'00B37000'                                            00600000
@CF00845 DC    XL4'00D37000'                                            00601000
@CF00846 DC    XL4'00E37000'                                            00602000
@DATD    DSECT                                                          00603000
         DS    0D                                                       00604000
         DS    0D                                                       00605000
@TS00001 DS    CL8                                                      00606000
AEWKAREA DS    CL97                                                     00607000
         ORG   AEWKAREA                                                 00608000
AETABADR DS    AL4                                                      00609000
AERETPT  DS    AL4                                                      00610000
AECMDINS DS    CL26                                                     00611000
         ORG   AECMDINS                                                 00612000
AECMDPTR DS    AL4                                                      00613000
AECMDLEN DS    FL2                                                      00614000
AECMDOFF DS    FL2                                                      00615000
AECMDNAM DS    CL18                                                     00616000
         ORG   AEWKAREA+36                                              00617000
AECDEINS DS    CL16                                                     00618000
         ORG   AECDEINS                                                 00619000
AECDEPTR DS    AL4                                                      00620000
AECDELEN DS    FL2                                                      00621000
AECDEOFF DS    FL2                                                      00622000
AECDETXT DS    CL8                                                      00623000
         ORG   AEWKAREA+56                                              00624000
AESRPLST DS    CL8                                                      00625000
AEMSPLST DS    CL12                                                     00626000
AESTPB   DS    CL8                                                      00627000
AEFREMNL DS    CL12                                                     00628000
AESWITCH DS    CL1                                                      00629000
         ORG   AESWITCH                                                 00630000
AESDWA   DS    BL1                                                      00631000
AEERRMSG EQU   AESWITCH+0                                               00632000
AECANCEL EQU   AESWITCH+0                                               00633000
AERETRY  EQU   AESWITCH+0                                               00634000
@NM00079 EQU   AESWITCH+0                                               00635000
         ORG   AEWKAREA+97                                              00636000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00637000
@ENDDATD EQU   *                                                        00638000
IKJEBEAE CSECT                                                          00639000
         DS    0F                                                       00640000
@SIZDATD DC    AL1(0)                                                   00641000
         DC    AL3(@ENDDATD-@DATD)                                      00642000
@CV00758 DC    V(IKJEBMA2)                                              00643000
@CV00865 DC    V(IKJEBEEN)                                              00644000
         DS    0D                                                       00645000
CHARZERO DC    XL2'00F0'                                                00646000
@CB00787 DC    X'0000000F'                                              00647000
AETRNSTB DC    CL16'0123456789ABCDEF'                                   00648000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00649000
@01      EQU   01                                                       00650000
@02      EQU   02                                                       00651000
@03      EQU   03                                                       00652000
@04      EQU   04                                                       00653000
@05      EQU   05                                                       00654000
@06      EQU   06                                                       00655000
@07      EQU   07                                                       00656000
@08      EQU   08                                                       00657000
@09      EQU   09                                                       00658000
@10      EQU   10                                                       00659000
@11      EQU   11                                                       00660000
@12      EQU   12                                                       00661000
@13      EQU   13                                                       00662000
@14      EQU   14                                                       00663000
@15      EQU   15                                                       00664000
COMMREG  EQU   @09                                                      00665000
SDWAPTR  EQU   @04                                                      00666000
GPR00P   EQU   @00                                                      00667000
GPR01P   EQU   @01                                                      00668000
GPR14P   EQU   @14                                                      00669000
GPR15P   EQU   @15                                                      00670000
R13      EQU   @13                                                      00671000
DATAREG  EQU   @12                                                      00672000
R0       EQU   @00                                                      00673000
PARMREG1 EQU   @01                                                      00674000
R1       EQU   @01                                                      00675000
R2       EQU   @02                                                      00676000
R3       EQU   @03                                                      00677000
R5       EQU   @05                                                      00678000
R14      EQU   @14                                                      00679000
R15      EQU   @15                                                      00680000
CCTEST   EQU   @05                                                      00681000
LEVEL2   EQU   @02                                                      00682000
GPR00F   EQU   @00                                                      00683000
GPR01F   EQU   @01                                                      00684000
GPR14F   EQU   @14                                                      00685000
GPR15F   EQU   @15                                                      00686000
PARMREG0 EQU   @00                                                      00687000
RETCDREG EQU   @15                                                      00688000
RETREG   EQU   @14                                                      00689000
R12      EQU   @12                                                      00690000
IKJEBECA EQU   0                                                        00691000
CAPTMS   EQU   IKJEBECA+20                                              00692000
CAPTRTRY EQU   IKJEBECA+32                                              00693000
CAPTPRSD EQU   IKJEBECA+36                                              00694000
CAPRSPDL EQU   CAPTPRSD                                                 00695000
CAFREEDL EQU   CAPRSPDL                                                 00696000
CAPTIBFR EQU   IKJEBECA+40                                              00697000
CAPTCORE EQU   IKJEBECA+64                                              00698000
CACORELN EQU   IKJEBECA+68                                              00699000
CAPTICDS EQU   IKJEBECA+80                                              00700000
CAPTICLN EQU   IKJEBECA+84                                              00701000
CAESDSPL EQU   IKJEBECA+112                                             00702000
CAATTN   EQU   IKJEBECA+120                                             00703000
CACFLAG  EQU   IKJEBECA+124                                             00704000
CACFLAG1 EQU   CACFLAG                                                  00705000
CACFLAG2 EQU   CACFLAG+1                                                00706000
CADSMODS EQU   CACFLAG2                                                 00707000
CAX37ABN EQU   CACFLAG2                                                 00708000
CAX22ABN EQU   CACFLAG2                                                 00709000
CACFLAG3 EQU   CACFLAG+2                                                00710000
CAIMFLG  EQU   CACFLAG3                                                 00711000
CACFLAG4 EQU   CACFLAG+3                                                00712000
CATPUTVF EQU   CACFLAG4                                                 00713000
CAABEND  EQU   CACFLAG4                                                 00714000
CAINPROC EQU   CACFLAG4                                                 00715000
CARECURS EQU   CACFLAG4                                                 00716000
CACFLAG5 EQU   CACFLAG+4                                                00717000
CACFLAG6 EQU   CACFLAG+5                                                00718000
CAPD     EQU   IKJEBECA+152                                             00719000
CADSATTR EQU   CAPD+41                                                  00720000
CADSATR2 EQU   CAPD+42                                                  00721000
CAPTPDXT EQU   IKJEBECA+228                                             00722000
CAEDFLAG EQU   IKJEBECA+236                                             00723000
CAEDFLG2 EQU   IKJEBECA+237                                             00724000
CASAFLAG EQU   IKJEBECA+376                                             00725000
CASAFLG2 EQU   IKJEBECA+377                                             00726000
CASYNLST EQU   IKJEBECA+496                                             00727000
CASYNWA  EQU   IKJEBECA+508                                             00728000
CASYNOPT EQU   IKJEBECA+524                                             00729000
CASYNSW  EQU   CASYNOPT+3                                               00730000
CATMPLST EQU   IKJEBECA+528                                             00731000
CAPTECT  EQU   CATMPLST+4                                               00732000
CAMAWKA  EQU   IKJEBECA+596                                             00733000
MACFLAGS EQU   CAMAWKA+28                                               00734000
MACFLAG2 EQU   CAMAWKA+29                                               00735000
CAMODEMG EQU   IKJEBECA+928                                             00736000
CAMODELN EQU   CAMODEMG+8                                               00737000
CAMODETX EQU   CAMODEMG+12                                              00738000
CATEMPBF EQU   IKJEBECA+2648                                            00739000
CASVAREA EQU   IKJEBECA+3176                                            00740000
CANXTSVA EQU   IKJEBECA+3896                                            00741000
IKJEBECX EQU   0                                                        00742000
SDWA     EQU   0                                                        00743000
SDWAPARM EQU   SDWA                                                     00744000
SDWAFIOB EQU   SDWA+4                                                   00745000
SDWAABCC EQU   SDWAFIOB                                                 00746000
SDWACMPF EQU   SDWAABCC                                                 00747000
SDWACMPC EQU   SDWAABCC+1                                               00748000
SDWACTL1 EQU   SDWA+8                                                   00749000
SDWACMKA EQU   SDWACTL1                                                 00750000
SDWAMWPA EQU   SDWACTL1+1                                               00751000
SDWAPMKA EQU   SDWACTL1+4                                               00752000
SDWACTL2 EQU   SDWA+16                                                  00753000
SDWACMKP EQU   SDWACTL2                                                 00754000
SDWAMWPP EQU   SDWACTL2+1                                               00755000
SDWAPMKP EQU   SDWACTL2+4                                               00756000
SDWAGRSV EQU   SDWA+24                                                  00757000
SDWANAME EQU   SDWA+88                                                  00758000
SDWAEC1  EQU   SDWA+104                                                 00759000
SDWAEMK1 EQU   SDWAEC1                                                  00760000
SDWAMWP1 EQU   SDWAEC1+1                                                00761000
SDWAINT1 EQU   SDWAEC1+2                                                00762000
SDWANXT1 EQU   SDWAEC1+4                                                00763000
SDWAAEC1 EQU   SDWA+112                                                 00764000
SDWAILC1 EQU   SDWAAEC1+1                                               00765000
SDWAINC1 EQU   SDWAAEC1+2                                               00766000
SDWAICD1 EQU   SDWAINC1+1                                               00767000
SDWAEC2  EQU   SDWA+120                                                 00768000
SDWAEMK2 EQU   SDWAEC2                                                  00769000
SDWAMWP2 EQU   SDWAEC2+1                                                00770000
SDWAINT2 EQU   SDWAEC2+2                                                00771000
SDWANXT2 EQU   SDWAEC2+4                                                00772000
SDWAAEC2 EQU   SDWA+128                                                 00773000
SDWAILC2 EQU   SDWAAEC2+1                                               00774000
SDWAINC2 EQU   SDWAAEC2+2                                               00775000
SDWAICD2 EQU   SDWAINC2+1                                               00776000
SDWASRSV EQU   SDWA+136                                                 00777000
SDWAIDNT EQU   SDWA+200                                                 00778000
SDWAMCH  EQU   SDWA+204                                                 00779000
SDWASTCK EQU   SDWAMCH                                                  00780000
SDWAMCHI EQU   SDWAMCH+8                                                00781000
SDWAMCHS EQU   SDWAMCHI                                                 00782000
SDWAMCHD EQU   SDWAMCHI+1                                               00783000
SDWARSR1 EQU   SDWAMCH+12                                               00784000
SDWARSR2 EQU   SDWAMCH+13                                               00785000
SDWAFLGS EQU   SDWA+232                                                 00786000
SDWAERRA EQU   SDWAFLGS                                                 00787000
SDWAERRB EQU   SDWAFLGS+1                                               00788000
SDWAERRC EQU   SDWAFLGS+2                                               00789000
SDWAERRD EQU   SDWAFLGS+3                                               00790000
SDWACLUP EQU   SDWAERRD                                                 00791000
SDWAIOFS EQU   SDWA+238                                                 00792000
SDWARTYA EQU   SDWA+240                                                 00793000
SDWACPUA EQU   SDWA+248                                                 00794000
SDWAPARQ EQU   SDWA+252                                                 00795000
SDWARCDE EQU   SDWAPARQ                                                 00796000
SDWAACF2 EQU   SDWAPARQ+1                                               00797000
SDWAFREE EQU   SDWAACF2                                                 00798000
SDWAACF3 EQU   SDWAPARQ+2                                               00799000
SDWAACF4 EQU   SDWAPARQ+3                                               00800000
SDWALKWA EQU   SDWA+256                                                 00801000
SDWALKWS EQU   SDWALKWA                                                 00802000
SDWARECP EQU   SDWA+292                                                 00803000
SDWASNPA EQU   SDWA+320                                                 00804000
SDWADUMP EQU   SDWASNPA                                                 00805000
SDWADPFS EQU   SDWADUMP+1                                               00806000
SDWADDAT EQU   SDWASNPA+4                                               00807000
SDWASDAT EQU   SDWADDAT                                                 00808000
SDWAPDAT EQU   SDWADDAT+2                                               00809000
SDWADPSA EQU   SDWA+328                                                 00810000
SDWADPSL EQU   SDWADPSA                                                 00811000
SDWARA   EQU   SDWA+400                                                 00812000
SDWADPVA EQU   SDWARA+2                                                 00813000
ECT      EQU   0                                                        00814000
ECTRCDF  EQU   ECT                                                      00815000
ECTRTCD  EQU   ECT+1                                                    00816000
ECTSWS   EQU   ECT+28                                                   00817000
ECTATRM  EQU   ECTSWS                                                   00818000
ECTSWS2  EQU   ECT+40                                                   00819000
ECTSWS21 EQU   ECTSWS2                                                  00820000
AERTRY   EQU   0                                                        00821000
RTMXAREA EQU   8                                                        00822000
AETRNSLT EQU   0                                                        00823000
ICLEN    EQU   0                                                        00824000
IKEBC    EQU   0                                                        00825000
IKEBF15  EQU   0                                                        00826000
IKEBF31  EQU   0                                                        00827000
IKEBP15  EQU   0                                                        00828000
IKEBP31  EQU   0                                                        00829000
IKEBP8   EQU   0                                                        00830000
I001C    EQU   0                                                        00831000
I008P    EQU   0                                                        00832000
I015F    EQU   0                                                        00833000
I015P    EQU   0                                                        00834000
I031F    EQU   0                                                        00835000
I031P    EQU   0                                                        00836000
I256C    EQU   0                                                        00837000
PTICDS   EQU   0                                                        00838000
ECTPTR   EQU   CAPTECT                                                  00839000
ZEROSAVE EQU   CASVAREA+72                                              00840000
ZSAVE1   EQU   ZEROSAVE                                                 00841000
ZSAVE2   EQU   ZEROSAVE+256                                             00842000
ZSAVE3   EQU   ZEROSAVE+512                                             00843000
AESVAREA EQU   CASVAREA+72                                              00844000
RTMSAREA EQU   AESVAREA+4                                               00845000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00846000
@NM00078 EQU   AESVAREA+8                                               00847000
@NM00077 EQU   AESVAREA                                                 00848000
@NM00076 EQU   ECT+52                                                   00849000
@NM00075 EQU   ECT+48                                                   00850000
@NM00074 EQU   ECT+44                                                   00851000
@NM00073 EQU   ECTSWS2+1                                                00852000
@NM00072 EQU   ECTSWS21                                                 00853000
ECTTABND EQU   ECTSWS21                                                 00854000
ECTDEFCS EQU   ECTSWS21                                                 00855000
ECTBKPB  EQU   ECT+36                                                   00856000
ECTUSER  EQU   ECT+32                                                   00857000
ECTDDNUM EQU   ECT+29                                                   00858000
ECTATTN  EQU   ECTSWS                                                   00859000
ECTBKGRD EQU   ECTSWS                                                   00860000
ECTNNOT  EQU   ECTSWS                                                   00861000
ECTNMAL  EQU   ECTSWS                                                   00862000
ECTLOGF  EQU   ECTSWS                                                   00863000
@NM00071 EQU   ECTSWS                                                   00864000
ECTNOPD  EQU   ECTSWS                                                   00865000
ECTSCMD  EQU   ECT+20                                                   00866000
ECTPCMD  EQU   ECT+12                                                   00867000
ECTSMSG  EQU   ECT+9                                                    00868000
ECTMSGF  EQU   ECT+8                                                    00869000
ECTIOWA  EQU   ECT+4                                                    00870000
@NM00070 EQU   SDWA+512                                                 00871000
SDWAVRA  EQU   SDWARA+4                                                 00872000
SDWAURAL EQU   SDWARA+3                                                 00873000
@NM00069 EQU   SDWADPVA                                                 00874000
SDWAEBC  EQU   SDWADPVA                                                 00875000
SDWAHEX  EQU   SDWADPVA                                                 00876000
SDWAVRAL EQU   SDWARA                                                   00877000
@NM00068 EQU   SDWA+396                                                 00878000
SDWACOMP EQU   SDWA+392                                                 00879000
SDWARCPL EQU   SDWA+364                                                 00880000
@NM00067 EQU   SDWADPSA+32                                              00881000
SDWATO4  EQU   SDWADPSL+28                                              00882000
SDWAFRM4 EQU   SDWADPSL+24                                              00883000
SDWATO3  EQU   SDWADPSL+20                                              00884000
SDWAFRM3 EQU   SDWADPSL+16                                              00885000
SDWATO2  EQU   SDWADPSL+12                                              00886000
SDWAFRM2 EQU   SDWADPSL+8                                               00887000
SDWATO1  EQU   SDWADPSL+4                                               00888000
SDWAFRM1 EQU   SDWADPSL                                                 00889000
@NM00066 EQU   SDWADDAT+3                                               00890000
@NM00065 EQU   SDWAPDAT                                                 00891000
SDWAUSPL EQU   SDWAPDAT                                                 00892000
SDWADPSW EQU   SDWAPDAT                                                 00893000
SDWATJPA EQU   SDWAPDAT                                                 00894000
SDWATLPA EQU   SDWAPDAT                                                 00895000
SDWADREG EQU   SDWAPDAT                                                 00896000
SDWADSAH EQU   SDWAPDAT                                                 00897000
SDWADSAS EQU   SDWAPDAT                                                 00898000
@NM00064 EQU   SDWADDAT+1                                               00899000
@NM00063 EQU   SDWASDAT                                                 00900000
SDWAQQS  EQU   SDWASDAT                                                 00901000
SDWACBS  EQU   SDWASDAT                                                 00902000
SDWAGTF  EQU   SDWASDAT                                                 00903000
SDWASWA  EQU   SDWASDAT                                                 00904000
SDWALSQA EQU   SDWASDAT                                                 00905000
SDWASQA  EQU   SDWASDAT                                                 00906000
SDWANUC  EQU   SDWASDAT                                                 00907000
@NM00062 EQU   SDWADUMP+2                                               00908000
@NM00061 EQU   SDWADPFS                                                 00909000
SDWASLST EQU   SDWADPFS                                                 00910000
@NM00060 EQU   SDWADPFS                                                 00911000
SDWADLST EQU   SDWADPFS                                                 00912000
SDWADPT  EQU   SDWADPFS                                                 00913000
SDWADPID EQU   SDWADUMP                                                 00914000
SDWADPLA EQU   SDWA+316                                                 00915000
SDWAREXN EQU   SDWARECP+16                                              00916000
SDWACSCT EQU   SDWARECP+8                                               00917000
SDWAMODN EQU   SDWARECP                                                 00918000
@NM00059 EQU   SDWALKWA+32                                              00919000
SDWATALW EQU   SDWALKWS+28                                              00920000
SDWATDLW EQU   SDWALKWS+24                                              00921000
SDWATNLW EQU   SDWALKWS+20                                              00922000
SDWAAPLW EQU   SDWALKWS+16                                              00923000
SDWAIPLW EQU   SDWALKWS+12                                              00924000
SDWAILLW EQU   SDWALKWS+8                                               00925000
SDWAIULW EQU   SDWALKWS+4                                               00926000
SDWAICLW EQU   SDWALKWS                                                 00927000
SDWAFLLK EQU   SDWAACF4                                                 00928000
SDWACMS  EQU   SDWAACF4                                                 00929000
SDWAOPTM EQU   SDWAACF4                                                 00930000
SDWATADB EQU   SDWAACF4                                                 00931000
SDWATDNB EQU   SDWAACF4                                                 00932000
SDWATNCB EQU   SDWAACF4                                                 00933000
SDWAILCH EQU   SDWAACF4                                                 00934000
SDWAIUCB EQU   SDWAACF4                                                 00935000
SDWAICAT EQU   SDWAACF3                                                 00936000
SDWAIPRG EQU   SDWAACF3                                                 00937000
SDWASALL EQU   SDWAACF3                                                 00938000
SDWAASMP EQU   SDWAACF3                                                 00939000
SDWADISP EQU   SDWAACF3                                                 00940000
@NM00058 EQU   SDWAACF3                                                 00941000
@NM00057 EQU   SDWAACF2                                                 00942000
SDWAUPRG EQU   SDWAACF2                                                 00943000
@NM00056 EQU   SDWAACF2                                                 00944000
SDWASPIN EQU   SDWAACF2                                                 00945000
@NM00055 EQU   SDWAACF2                                                 00946000
SDWARCRD EQU   SDWAACF2                                                 00947000
SDWALCPU EQU   SDWACPUA+2                                               00948000
@NM00054 EQU   SDWACPUA                                                 00949000
SDWARECA EQU   SDWA+244                                                 00950000
@NM00053 EQU   SDWA+239                                                 00951000
@NM00052 EQU   SDWAIOFS                                                 00952000
SDWANIOP EQU   SDWAIOFS                                                 00953000
SDWANOIO EQU   SDWAIOFS                                                 00954000
SDWAIOHT EQU   SDWAIOFS                                                 00955000
SDWAIOQR EQU   SDWAIOFS                                                 00956000
SDWAFMID EQU   SDWA+236                                                 00957000
@NM00051 EQU   SDWAERRD                                                 00958000
SDWAMCIV EQU   SDWAERRD                                                 00959000
SDWARPIV EQU   SDWAERRD                                                 00960000
SDWAMABD EQU   SDWAERRD                                                 00961000
SDWACTS  EQU   SDWAERRD                                                 00962000
SDWASTAE EQU   SDWAERRD                                                 00963000
SDWANRBE EQU   SDWAERRD                                                 00964000
@NM00050 EQU   SDWAERRC                                                 00965000
SDWAEAS  EQU   SDWAERRC                                                 00966000
SDWAPERC EQU   SDWAERRC                                                 00967000
SDWAIRB  EQU   SDWAERRC                                                 00968000
SDWASTAI EQU   SDWAERRC                                                 00969000
SDWASTAF EQU   SDWAERRC                                                 00970000
SDWASRBM EQU   SDWAERRB                                                 00971000
SDWALDIS EQU   SDWAERRB                                                 00972000
SDWAENRB EQU   SDWAERRB                                                 00973000
SDWATYP1 EQU   SDWAERRB                                                 00974000
@NM00049 EQU   SDWAERRB                                                 00975000
SDWAPGIO EQU   SDWAERRA                                                 00976000
SDWATEXC EQU   SDWAERRA                                                 00977000
SDWASVCE EQU   SDWAERRA                                                 00978000
SDWAABTM EQU   SDWAERRA                                                 00979000
SDWASVCD EQU   SDWAERRA                                                 00980000
SDWARKEY EQU   SDWAERRA                                                 00981000
SDWAPCHK EQU   SDWAERRA                                                 00982000
SDWAMCHK EQU   SDWAERRA                                                 00983000
SDWATIME EQU   SDWAMCH+20                                               00984000
SDWARFSA EQU   SDWAMCH+16                                               00985000
@NM00048 EQU   SDWAMCH+14                                               00986000
SDWAVEQR EQU   SDWARSR2                                                 00987000
SDWAPGFX EQU   SDWARSR2                                                 00988000
SDWAFLSQ EQU   SDWARSR2                                                 00989000
SDWAFSQA EQU   SDWARSR2                                                 00990000
SDWANUCL EQU   SDWARSR2                                                 00991000
SDWASPER EQU   SDWARSR2                                                 00992000
SDWAINTC EQU   SDWARSR2                                                 00993000
SDWAOFLN EQU   SDWARSR2                                                 00994000
SDWACHNG EQU   SDWARSR1                                                 00995000
SDWAMSER EQU   SDWARSR1                                                 00996000
@NM00047 EQU   SDWARSR1                                                 00997000
SDWACPID EQU   SDWAMCH+10                                               00998000
SDWATERR EQU   SDWAMCHD                                                 00999000
SDWAFPRX EQU   SDWAMCHD                                                 01000000
SDWAINSF EQU   SDWAMCHD                                                 01001000
SDWAACR  EQU   SDWAMCHD                                                 01002000
SDWASCK  EQU   SDWAMCHD                                                 01003000
SDWAPSWU EQU   SDWAMCHD                                                 01004000
SDWAREGU EQU   SDWAMCHD                                                 01005000
SDWASKYF EQU   SDWAMCHD                                                 01006000
@NM00046 EQU   SDWAMCHS                                                 01007000
SDWARSRF EQU   SDWAMCHS                                                 01008000
SDWARSRC EQU   SDWAMCHS                                                 01009000
SDWAINVP EQU   SDWAMCHS                                                 01010000
SDWATSVL EQU   SDWAMCHS                                                 01011000
SDWARCDF EQU   SDWAMCHS                                                 01012000
SDWASRVL EQU   SDWAMCHS                                                 01013000
SDWASCKE EQU   SDWASTCK+4                                               01014000
SDWASCKB EQU   SDWASTCK                                                 01015000
SDWALNTH EQU   SDWAIDNT+1                                               01016000
SDWASPID EQU   SDWAIDNT                                                 01017000
SDWASR15 EQU   SDWASRSV+60                                              01018000
SDWASR14 EQU   SDWASRSV+56                                              01019000
SDWASR13 EQU   SDWASRSV+52                                              01020000
SDWASR12 EQU   SDWASRSV+48                                              01021000
SDWASR11 EQU   SDWASRSV+44                                              01022000
SDWASR10 EQU   SDWASRSV+40                                              01023000
SDWASR09 EQU   SDWASRSV+36                                              01024000
SDWASR08 EQU   SDWASRSV+32                                              01025000
SDWASR07 EQU   SDWASRSV+28                                              01026000
SDWASR06 EQU   SDWASRSV+24                                              01027000
SDWASR05 EQU   SDWASRSV+20                                              01028000
SDWASR04 EQU   SDWASRSV+16                                              01029000
SDWASR03 EQU   SDWASRSV+12                                              01030000
SDWASR02 EQU   SDWASRSV+8                                               01031000
SDWASR01 EQU   SDWASRSV+4                                               01032000
SDWASR00 EQU   SDWASRSV                                                 01033000
SDWATRN2 EQU   SDWAAEC2+4                                               01034000
SDWAIPC2 EQU   SDWAICD2                                                 01035000
SDWAIMC2 EQU   SDWAICD2                                                 01036000
SDWAIPR2 EQU   SDWAICD2                                                 01037000
@NM00045 EQU   SDWAINC2                                                 01038000
@NM00044 EQU   SDWAILC2                                                 01039000
SDWAIL2  EQU   SDWAILC2                                                 01040000
@NM00043 EQU   SDWAILC2                                                 01041000
@NM00042 EQU   SDWAAEC2                                                 01042000
SDWAADD2 EQU   SDWANXT2+1                                               01043000
@NM00041 EQU   SDWANXT2                                                 01044000
@NM00040 EQU   SDWAEC2+3                                                01045000
SDWASGN2 EQU   SDWAINT2                                                 01046000
SDWAEXP2 EQU   SDWAINT2                                                 01047000
SDWADEC2 EQU   SDWAINT2                                                 01048000
SDWAFPO2 EQU   SDWAINT2                                                 01049000
SDWACC2  EQU   SDWAINT2                                                 01050000
@NM00039 EQU   SDWAINT2                                                 01051000
SDWAPGM2 EQU   SDWAMWP2                                                 01052000
SDWAWAT2 EQU   SDWAMWP2                                                 01053000
SDWAMCK2 EQU   SDWAMWP2                                                 01054000
SDWAECT2 EQU   SDWAMWP2                                                 01055000
SDWAKEY2 EQU   SDWAMWP2                                                 01056000
SDWAEXT2 EQU   SDWAEMK2                                                 01057000
SDWAIO2  EQU   SDWAEMK2                                                 01058000
SDWATRM2 EQU   SDWAEMK2                                                 01059000
@NM00038 EQU   SDWAEMK2                                                 01060000
SDWAPER2 EQU   SDWAEMK2                                                 01061000
@NM00037 EQU   SDWAEMK2                                                 01062000
SDWATRAN EQU   SDWAAEC1+4                                               01063000
SDWAIPC1 EQU   SDWAICD1                                                 01064000
SDWAIMC1 EQU   SDWAICD1                                                 01065000
SDWAIPR1 EQU   SDWAICD1                                                 01066000
@NM00036 EQU   SDWAINC1                                                 01067000
@NM00035 EQU   SDWAILC1                                                 01068000
SDWAIL1  EQU   SDWAILC1                                                 01069000
@NM00034 EQU   SDWAILC1                                                 01070000
@NM00033 EQU   SDWAAEC1                                                 01071000
SDWAADD1 EQU   SDWANXT1+1                                               01072000
@NM00032 EQU   SDWANXT1                                                 01073000
@NM00031 EQU   SDWAEC1+3                                                01074000
SDWASGN1 EQU   SDWAINT1                                                 01075000
SDWAEXP1 EQU   SDWAINT1                                                 01076000
SDWADEC1 EQU   SDWAINT1                                                 01077000
SDWAFPO1 EQU   SDWAINT1                                                 01078000
SDWACC1  EQU   SDWAINT1                                                 01079000
@NM00030 EQU   SDWAINT1                                                 01080000
SDWAPGM1 EQU   SDWAMWP1                                                 01081000
SDWAWAT1 EQU   SDWAMWP1                                                 01082000
SDWAMCK1 EQU   SDWAMWP1                                                 01083000
SDWAECT1 EQU   SDWAMWP1                                                 01084000
SDWAKEY1 EQU   SDWAMWP1                                                 01085000
SDWAEXT1 EQU   SDWAEMK1                                                 01086000
SDWAIO1  EQU   SDWAEMK1                                                 01087000
SDWATRM1 EQU   SDWAEMK1                                                 01088000
@NM00029 EQU   SDWAEMK1                                                 01089000
SDWAPER1 EQU   SDWAEMK1                                                 01090000
@NM00028 EQU   SDWAEMK1                                                 01091000
SDWAIOBR EQU   SDWA+100                                                 01092000
SDWAEPA  EQU   SDWA+96                                                  01093000
@NM00027 EQU   SDWANAME+4                                               01094000
SDWARBAD EQU   SDWANAME                                                 01095000
SDWAGR15 EQU   SDWAGRSV+60                                              01096000
SDWAGR14 EQU   SDWAGRSV+56                                              01097000
SDWAGR13 EQU   SDWAGRSV+52                                              01098000
SDWAGR12 EQU   SDWAGRSV+48                                              01099000
SDWAGR11 EQU   SDWAGRSV+44                                              01100000
SDWAGR10 EQU   SDWAGRSV+40                                              01101000
SDWAGR09 EQU   SDWAGRSV+36                                              01102000
SDWAGR08 EQU   SDWAGRSV+32                                              01103000
SDWAGR07 EQU   SDWAGRSV+28                                              01104000
SDWAGR06 EQU   SDWAGRSV+24                                              01105000
SDWAGR05 EQU   SDWAGRSV+20                                              01106000
SDWAGR04 EQU   SDWAGRSV+16                                              01107000
SDWAGR03 EQU   SDWAGRSV+12                                              01108000
SDWAGR02 EQU   SDWAGRSV+8                                               01109000
SDWAGR01 EQU   SDWAGRSV+4                                               01110000
SDWAGR00 EQU   SDWAGRSV                                                 01111000
SDWANXTP EQU   SDWACTL2+5                                               01112000
SDWASGP  EQU   SDWAPMKP                                                 01113000
SDWAEUP  EQU   SDWAPMKP                                                 01114000
SDWADOP  EQU   SDWAPMKP                                                 01115000
SDWAFPP  EQU   SDWAPMKP                                                 01116000
SDWACCP  EQU   SDWAPMKP                                                 01117000
SDWAILP  EQU   SDWAPMKP                                                 01118000
SDWAINTP EQU   SDWACTL2+2                                               01119000
SDWASPVP EQU   SDWAMWPP                                                 01120000
SDWAWATP EQU   SDWAMWPP                                                 01121000
SDWAMCKP EQU   SDWAMWPP                                                 01122000
@NM00026 EQU   SDWAMWPP                                                 01123000
SDWAKEYP EQU   SDWAMWPP                                                 01124000
SDWAEXTP EQU   SDWACMKP                                                 01125000
SDWAIOP  EQU   SDWACMKP                                                 01126000
SDWANXTA EQU   SDWACTL1+5                                               01127000
SDWASGA  EQU   SDWAPMKA                                                 01128000
SDWAEUA  EQU   SDWAPMKA                                                 01129000
SDWADOA  EQU   SDWAPMKA                                                 01130000
SDWAFPA  EQU   SDWAPMKA                                                 01131000
SDWACCA  EQU   SDWAPMKA                                                 01132000
SDWAILA  EQU   SDWAPMKA                                                 01133000
SDWAINTA EQU   SDWACTL1+2                                               01134000
SDWASPVA EQU   SDWAMWPA                                                 01135000
SDWAWATA EQU   SDWAMWPA                                                 01136000
SDWAMCKA EQU   SDWAMWPA                                                 01137000
@NM00025 EQU   SDWAMWPA                                                 01138000
SDWAKEYA EQU   SDWAMWPA                                                 01139000
SDWAEXTA EQU   SDWACMKA                                                 01140000
SDWAIOA  EQU   SDWACMKA                                                 01141000
@NM00024 EQU   SDWACMPF                                                 01142000
SDWASTCC EQU   SDWACMPF                                                 01143000
@NM00023 EQU   SDWACMPF                                                 01144000
SDWASTEP EQU   SDWACMPF                                                 01145000
SDWAREQ  EQU   SDWACMPF                                                 01146000
CXDATEXT EQU   IKJEBECX                                                 01147000
CAPDEXT  EQU   IKJEBECA+3984                                            01148000
CADSNRC2 EQU   IKJEBECA+3928                                            01149000
CADSNOF2 EQU   IKJEBECA+3926                                            01150000
CADSNLN2 EQU   IKJEBECA+3924                                            01151000
CADSNPT2 EQU   IKJEBECA+3920                                            01152000
@NM00022 EQU   IKJEBECA+3900                                            01153000
CABFRPL  EQU   IKJEBECA+2120                                            01154000
CASCWKA  EQU   IKJEBECA+1448                                            01155000
CAFIBFR  EQU   IKJEBECA+1188                                            01156000
CAAEDCB  EQU   IKJEBECA+1096                                            01157000
CALDROP  EQU   IKJEBECA+1064                                            01158000
CAATNWKA EQU   IKJEBECA+956                                             01159000
CAATNBUF EQU   IKJEBECA+952                                             01160000
CAMODEOF EQU   CAMODEMG+10                                              01161000
CAMODEPT EQU   CAMODEMG+4                                               01162000
CAMODEIS EQU   CAMODEMG                                                 01163000
CASRWKA  EQU   IKJEBECA+728                                             01164000
CAMSWKA  EQU   IKJEBECA+628                                             01165000
@NM00021 EQU   CAMAWKA+30                                               01166000
@NM00020 EQU   MACFLAG2                                                 01167000
MATABLE1 EQU   MACFLAG2                                                 01168000
@NM00019 EQU   MACFLAGS                                                 01169000
MAENDPRC EQU   MACFLAGS                                                 01170000
MAABBREV EQU   MACFLAGS                                                 01171000
MAECTMOD EQU   MACFLAGS                                                 01172000
@NM00018 EQU   CAMAWKA                                                  01173000
CASTAEPL EQU   IKJEBECA+576                                             01174000
CASTAXPL EQU   IKJEBECA+556                                             01175000
CASRPLST EQU   CATMPLST+12                                              01176000
CAPTECB  EQU   CATMPLST+8                                               01177000
CAPTUPT  EQU   CATMPLST                                                 01178000
CASYNSCN EQU   CASYNSW                                                  01179000
CASYNML  EQU   CASYNSW                                                  01180000
CASYNSF  EQU   CASYNSW                                                  01181000
CASYNRFM EQU   CASYNSW                                                  01182000
CASYNIS  EQU   CASYNSW                                                  01183000
@NM00017 EQU   CASYNSW                                                  01184000
CASYNLN  EQU   CASYNSW                                                  01185000
@NM00016 EQU   CASYNSW                                                  01186000
CASYNRCL EQU   CASYNOPT+2                                               01187000
CASYNCD2 EQU   CASYNOPT+1                                               01188000
CASYNCD1 EQU   CASYNOPT                                                 01189000
CASYNTEM EQU   CASYNWA+12                                               01190000
CASYNMS2 EQU   CASYNWA+8                                                01191000
CASYNMS1 EQU   CASYNWA+4                                                01192000
CASYNWAP EQU   CASYNWA+1                                                01193000
CASYNECD EQU   CASYNWA                                                  01194000
CASYNPTO EQU   CASYNLST+8                                               01195000
CASYNPWA EQU   CASYNLST+4                                               01196000
CASYNBFR EQU   CASYNLST                                                 01197000
@NM00015 EQU   IKJEBECA+484                                             01198000
CARECNO  EQU   IKJEBECA+480                                             01199000
CAINSAVE EQU   IKJEBECA+476                                             01200000
@NM00014 EQU   IKJEBECA+472                                             01201000
CAIMLINC EQU   IKJEBECA+468                                             01202000
CAIMLLNO EQU   IKJEBECA+464                                             01203000
CAINCRE  EQU   IKJEBECA+460                                             01204000
CACURNUM EQU   IKJEBECA+456                                             01205000
CANXTREC EQU   IKJEBECA+452                                             01206000
CASTNUM  EQU   IKJEBECA+448                                             01207000
CASAPSWD EQU   IKJEBECA+440                                             01208000
CASADDN  EQU   IKJEBECA+432                                             01209000
CASAMEMB EQU   IKJEBECA+424                                             01210000
CASADSN  EQU   IKJEBECA+380                                             01211000
CASADSNL EQU   IKJEBECA+378                                             01212000
CASADQTY EQU   CASAFLG2                                                 01213000
CASANCTG EQU   CASAFLG2                                                 01214000
CASAALOC EQU   CASAFLAG                                                 01215000
CASAUNCG EQU   CASAFLAG                                                 01216000
CASADSOR EQU   CASAFLAG                                                 01217000
CASAMEM  EQU   CASAFLAG                                                 01218000
CASADISP EQU   CASAFLAG                                                 01219000
CASAINCP EQU   CASAFLAG                                                 01220000
CASAFNCP EQU   CASAFLAG                                                 01221000
CASAVEDS EQU   CASAFLAG                                                 01222000
CADSNREC EQU   IKJEBECA+320                                             01223000
CADSNOFF EQU   IKJEBECA+318                                             01224000
CADSNLEN EQU   IKJEBECA+316                                             01225000
CADSNPTR EQU   IKJEBECA+312                                             01226000
CAEDTSIZ EQU   IKJEBECA+308                                             01227000
CAEDPSWD EQU   IKJEBECA+300                                             01228000
CAEDDDN  EQU   IKJEBECA+292                                             01229000
CAEDMEMB EQU   IKJEBECA+284                                             01230000
CAEDDSN  EQU   IKJEBECA+240                                             01231000
CAEDDSNL EQU   IKJEBECA+238                                             01232000
CAEDPRTC EQU   CAEDFLG2                                                 01233000
CAEDALOC EQU   CAEDFLAG                                                 01234000
CAEDUNCG EQU   CAEDFLAG                                                 01235000
CAEDDSOR EQU   CAEDFLAG                                                 01236000
CAEDMEM  EQU   CAEDFLAG                                                 01237000
CAEDDISP EQU   CAEDFLAG                                                 01238000
CAEDINCP EQU   CAEDFLAG                                                 01239000
CAEDFNCP EQU   CAEDFLAG                                                 01240000
CAEDITDS EQU   CAEDFLAG                                                 01241000
CABLK2   EQU   IKJEBECA+234                                             01242000
CALRECL  EQU   IKJEBECA+232                                             01243000
@NM00013 EQU   IKJEBECA+226                                             01244000
CAPDEND  EQU   CAPD+82                                                  01245000
CADATEXT EQU   CAPD+74                                                  01246000
CAEXTNAM EQU   CAPD+66                                                  01247000
CAPRNAME EQU   CAPD+58                                                  01248000
CACHKOPT EQU   CAPD+56                                                  01249000
CAULRLMX EQU   CAPD+54                                                  01250000
CAULRLDF EQU   CAPD+52                                                  01251000
CAVLRLMX EQU   CAPD+50                                                  01252000
CAVLRLDF EQU   CAPD+48                                                  01253000
CAFLRLMX EQU   CAPD+46                                                  01254000
CAFLRLDF EQU   CAPD+44                                                  01255000
CARECFMD EQU   CAPD+43                                                  01256000
@NM00012 EQU   CADSATR2                                                 01257000
CAINLIST EQU   CADSATR2                                                 01258000
CARUNDS  EQU   CADSATR2                                                 01259000
CAOBJGEN EQU   CADSATR2                                                 01260000
CADSNDEF EQU   CADSATR2                                                 01261000
CALINTAB EQU   CADSATR2                                                 01262000
@NM00011 EQU   CADSATTR                                                 01263000
CALRECLX EQU   CADSATTR                                                 01264000
CALNNUM  EQU   CADSATTR                                                 01265000
CADSCONT EQU   CADSATTR                                                 01266000
CACAPSDF EQU   CADSATTR                                                 01267000
CACAPSRQ EQU   CADSATTR                                                 01268000
CASCAN   EQU   CADSATTR                                                 01269000
CARUN    EQU   CADSATTR                                                 01270000
CADSCODE EQU   CAPD+40                                                  01271000
CASYNAME EQU   CAPD+32                                                  01272000
CATABS   EQU   CAPD+20                                                  01273000
CALENGTH EQU   CAPD+19                                                  01274000
CALINE   EQU   CAPD+18                                                  01275000
CABLKS   EQU   CAPD+16                                                  01276000
CADSQUAL EQU   CAPD+8                                                   01277000
CADSTYPE EQU   CAPD                                                     01278000
@NM00010 EQU   CACFLAG+8                                                01279000
CAPLIRTM EQU   CACFLAG+7                                                01280000
CAPLILFM EQU   CACFLAG+6                                                01281000
@NM00009 EQU   CACFLAG6                                                 01282000
CACHAR60 EQU   CACFLAG6                                                 01283000
CACHAR48 EQU   CACFLAG6                                                 01284000
CAFREE   EQU   CACFLAG6                                                 01285000
@NM00008 EQU   CACFLAG5                                                 01286000
CAEDLNDP EQU   CACFLAG5                                                 01287000
CADSUSED EQU   CACFLAG4                                                 01288000
CASCRC20 EQU   CACFLAG4                                                 01289000
CAPTGTBF EQU   CACFLAG4                                                 01290000
CAFINDIS EQU   CACFLAG4                                                 01291000
@NM00007 EQU   CAIMFLG                                                  01292000
CAIMINPT EQU   CAIMFLG                                                  01293000
CAIMSFPT EQU   CAIMFLG                                                  01294000
CAIMCIN  EQU   CAIMFLG                                                  01295000
CAIMIR   EQU   CAIMFLG                                                  01296000
CAIMSC   EQU   CAIMFLG                                                  01297000
CAIMINS  EQU   CAIMFLG                                                  01298000
CAIMPT   EQU   CAIMFLG                                                  01299000
@NM00006 EQU   CACFLAG2                                                 01300000
CASEQCOL EQU   CACFLAG2                                                 01301000
CAMODMSG EQU   CACFLAG2                                                 01302000
CASCANON EQU   CACFLAG2                                                 01303000
CARECFM  EQU   CACFLAG2                                                 01304000
CANONUM  EQU   CACFLAG1                                                 01305000
CACAPS   EQU   CACFLAG1                                                 01306000
CAENDSC  EQU   CACFLAG1                                                 01307000
CAINITSC EQU   CACFLAG1                                                 01308000
CASCANSW EQU   CACFLAG1                                                 01309000
CAPROMPT EQU   CACFLAG1                                                 01310000
CAVRFYSW EQU   CACFLAG1                                                 01311000
CALNTOVF EQU   CACFLAG1                                                 01312000
CAATTNIS EQU   CAATTN                                                   01313000
@NM00005 EQU   CAATTN                                                   01314000
@NM00004 EQU   IKJEBECA+118                                             01315000
CAMAXBLK EQU   IKJEBECA+116                                             01316000
@NM00003 EQU   IKJEBECA+88                                              01317000
CAPTNBFR EQU   IKJEBECA+76                                              01318000
CAPTCHK  EQU   IKJEBECA+72                                              01319000
CAUTILNO EQU   IKJEBECA+60                                              01320000
CAPTPDCB EQU   IKJEBECA+56                                              01321000
CAPTCDCB EQU   IKJEBECA+52                                              01322000
@NM00002 EQU   IKJEBECA+50                                              01323000
CASCMDLN EQU   IKJEBECA+48                                              01324000
CAPTSCMD EQU   IKJEBECA+44                                              01325000
CAOPERND EQU   CAPTIBFR                                                 01326000
CAPTMSGM EQU   IKJEBECA+28                                              01327000
CAPTUT   EQU   IKJEBECA+24                                              01328000
CAPTLE   EQU   IKJEBECA+16                                              01329000
CAPTAT   EQU   IKJEBECA+12                                              01330000
CAPTAE   EQU   IKJEBECA+8                                               01331000
@NM00001 EQU   IKJEBECA+4                                               01332000
CAPTTMP  EQU   IKJEBECA                                                 01333000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01334000
@RT00054 EQU   EXIT                                                     01335000
@RT00099 EQU   ENDOFMSG                                                 01336000
@ENDDATA EQU   *                                                        01337000
         END   IKJEBEAE,(C'PLS1833',0701,78045)                         01338000
