         TITLE 'IDA019S4 DISABLED EXIT ROUTINE                         *00001000
                        '                                               00002000
IDA019S4 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IDA019S4  78.173'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @15,@04,16(@13)                                     0001 00010000
         USING   IDA019S4,@15                                           00011000
*   IF IOSDIESE=ON THEN             /* SECOND ENTRY?                 */ 00012000
         TM    IOSDIESE(RIOSB),B'10000000'                         0088 00013000
         BO    @RT00088                                            0088 00014000
*     RETURN;                       /* EXIT                          */ 00015000
*                                                                  0089 00016000
*   /*****************************************************************/ 00017000
*   /*                                                               */ 00018000
*   /* IF FIXED CONTROL BLOCKS OPTION, SRB MODE, AND NORMAL CHANNEL  */ 00019000
*   /* END - DEVICE END, THEN POST IOSB AND ECB AND SCHEDULE RESUME  */ 00020000
*   /* ROUTINE OF IDA019S1                                   @ZA10855*/ 00021000
*   /*                                                               */ 00022000
*   /*****************************************************************/ 00023000
*                                                                  0090 00024000
*   IF SRBVFIX=ON&                  /* FIXED BLOCKS AND      @ZA10855*/ 00025000
*       IOMSRBM=ON&                 /* SRB MODE AND          @ZA10855*/ 00026000
*       IOSTATUS=CEDEND&            /* NORMAL STATUS?        @ZA10855*/ 00027000
*       IOSIPIB=ZERO THEN           /* PURGE NOT PROC        @ZA17946*/ 00028000
         L     @04,IOSSRB(,RIOSB)                                  0090 00029000
         TM    SRBVFIX(@04),B'10000000'                            0090 00030000
         BNO   @RF00090                                            0090 00031000
         L     @03,IOSUSE(,RIOSB)                                  0090 00032000
         TM    IOMSRBM(@03),B'00000010'                            0090 00033000
         BNO   @RF00090                                            0090 00034000
         CLC   IOSTATUS(2,RIOSB),@CB00061                          0090 00035000
         BNE   @RF00090                                            0090 00036000
         L     @01,IOSIPIB(,RIOSB)                                 0090 00037000
         LTR   @01,@01                                             0090 00038000
         BNZ   @RF00090                                            0090 00039000
*     DO;                           /* YES                           */ 00040000
*       IOSCOD=NRMCOD;              /* POST IOSB                     */ 00041000
         MVI   IOSCOD(RIOSB),X'7F'                                 0092 00042000
*       ECB=NRMCOD;                 /* POST ECB                      */ 00043000
         L     @01,IOMECBPT(,@03)                                  0093 00044000
         MVI   ECB(@01),X'7F'                                      0093 00045000
*       SRBEP=IOMPGAD;              /* ENTRY PT OF RESUME            */ 00046000
         L     @03,IOMPGAD(,@03)                                   0094 00047000
         ST    @03,SRBEP(,@04)                                     0094 00048000
*       SRBPARM=RIOSB;              /* PASS IOSB TO RESUME           */ 00049000
         ST    RIOSB,SRBPARM(,@04)                                 0095 00050000
*       RFY                                                        0096 00051000
*         R1 RSTD;                  /* LOCK REG                      */ 00052000
*       R1=IOSSRB;                  /* PT TO SRB                     */ 00053000
         LR    R1,@04                                              0097 00054000
*       GEN SETS(SRBFLNK,CVTLSMQ,R0,R15) REFS(CVTPTR);             0098 00055000
               LR  R3,R15                  SAVE BASE REG                00056000
               USING  IDA019S4,R3          ADDRESSIBILITY ACROS SCHE    00057000
               DROP @15                                                 00058000
               SCHEDULE SRB=(1)            SCHEDULE RESUME RTN          00059000
*       RFY                                                        0099 00060000
*         R1 UNRSTD;                /* UNLOCK REG                    */ 00061000
*       R14=R14+EIGHT;              /* INCR RTRN ADDR                */ 00062000
         AL    R14,@CF00058                                        0100 00063000
*     END;                          /* END FAST PATH         @ZA10855*/ 00064000
*   RETURN;                         /* RETURN                        */ 00065000
*                                                                  0102 00066000
@EL00001 DS    0H                                                  0102 00067000
@EF00001 DS    0H                                                  0102 00068000
@ER00001 LM    @15,@04,16(@13)                                     0102 00069000
         BR    @14                                                 0102 00070000
*   /*****************************************************************/ 00071000
*   /*                                                               */ 00072000
*   /* DEFINE PATCH AREA                                             */ 00073000
*   /*                                                               */ 00074000
*   /*****************************************************************/ 00075000
*                                                                  0103 00076000
*PATCH:                                                            0103 00077000
*   GEN(DC   50X'00');                                             0103 00078000
PATCH    DC   50X'00'                                                   00079000
*   END IDA019S4                    /* END OF DIE                    */ 00080000
*                                                                  0104 00081000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00082000
*/*%INCLUDE SYSLIB  (IDAAMBL )                                       */ 00083000
*/*%INCLUDE SYSLIB  (IDAAMB  )                                       */ 00084000
*/*%INCLUDE SYSLIB  (IDAIOMB )                                       */ 00085000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00086000
*/*%INCLUDE SYSLIB  (IDAVSRB )                                       */ 00087000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00088000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00089000
*                                                                  0104 00090000
*       ;                                                          0104 00091000
         B     @EL00001                                            0104 00092000
@DATA    DS    0H                                                       00093000
         DS    0F                                                       00094000
         DS    0F                                                       00095000
@CF00058 DC    F'8'                                                     00096000
         DS    0D                                                       00097000
IOSBPTR  DS    A                                                        00098000
@CB00061 DC    X'0C00'                                                  00099000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00100000
@01      EQU   01                                                       00101000
@02      EQU   02                                                       00102000
@03      EQU   03                                                       00103000
@04      EQU   04                                                       00104000
@05      EQU   05                                                       00105000
@06      EQU   06                                                       00106000
@07      EQU   07                                                       00107000
@08      EQU   08                                                       00108000
@09      EQU   09                                                       00109000
@10      EQU   10                                                       00110000
@11      EQU   11                                                       00111000
@12      EQU   12                                                       00112000
@13      EQU   13                                                       00113000
@14      EQU   14                                                       00114000
@15      EQU   15                                                       00115000
R15      EQU   @15                                                      00116000
R0       EQU   @00                                                      00117000
R1       EQU   @01                                                      00118000
RIOSB    EQU   @02                                                      00119000
R3       EQU   @03                                                      00120000
R4       EQU   @04                                                      00121000
R5       EQU   @05                                                      00122000
R6       EQU   @06                                                      00123000
R7       EQU   @07                                                      00124000
R8       EQU   @08                                                      00125000
R9       EQU   @09                                                      00126000
R10      EQU   @10                                                      00127000
R11      EQU   @11                                                      00128000
R12      EQU   @12                                                      00129000
R13      EQU   @13                                                      00130000
R14      EQU   @14                                                      00131000
CVTPTR   EQU   16                                                       00132000
ECB      EQU   0                                                        00133000
IDAAMBL  EQU   0                                                        00134000
AMBLEOV  EQU   IDAAMBL+12                                               00135000
AMBLEFLG EQU   AMBLEOV                                                  00136000
AMBLDDNM EQU   IDAAMBL+16                                               00137000
AMBLIDF  EQU   AMBLDDNM                                                 00138000
AMBLQ    EQU   AMBLIDF+7                                                00139000
AMBLVC   EQU   IDAAMBL+28                                               00140000
AMBLTYPE EQU   IDAAMBL+30                                               00141000
AMBLSHAR EQU   IDAAMBL+33                                               00142000
AMBLFLG1 EQU   IDAAMBL+35                                               00143000
AMBLFLG2 EQU   IDAAMBL+36                                               00144000
IDAAMB   EQU   0                                                        00145000
AMBEOVR  EQU   IDAAMB+24                                                00146000
AMBFLG0  EQU   AMBEOVR                                                  00147000
AMBFLG1  EQU   IDAAMB+25                                                00148000
AMBDSORG EQU   IDAAMB+26                                                00149000
AMBIOBAD EQU   IDAAMB+28                                                00150000
AMBINFL  EQU   IDAAMB+42                                                00151000
AMBDEBPT EQU   IDAAMB+44                                                00152000
AMBOFLGS EQU   IDAAMB+48                                                00153000
AMBFLG2  EQU   IDAAMB+49                                                00154000
AMBEOVPT EQU   IDAAMB+56                                                00155000
AMBPAMBL EQU   IDAAMB+76                                                00156000
AMBCSWD1 EQU   IDAAMB+84                                                00157000
AMBAFLG  EQU   AMBCSWD1                                                 00158000
IDAIOMB  EQU   0                                                        00159000
IOMAMB   EQU   IDAIOMB+16                                               00160000
IOMECBPT EQU   IDAIOMB+24                                               00161000
IOMPGAD  EQU   IDAIOMB+32                                               00162000
IOMFLAGS EQU   IDAIOMB+40                                               00163000
IOMFL    EQU   IOMFLAGS                                                 00164000
IOMAPEND EQU   IOMFL                                                    00165000
IOMSTIND EQU   IOMFLAGS+2                                               00166000
IOMSRBM  EQU   IOMSTIND                                                 00167000
IOMSAVER EQU   IDAIOMB+52                                               00168000
IOSB     EQU   0                                                        00169000
IOSFLA   EQU   IOSB                                                     00170000
IOSACHN  EQU   IOSFLA                                                   00171000
IOSFLB   EQU   IOSB+1                                                   00172000
IOSDIESE EQU   IOSFLB                                                   00173000
IOSFLC   EQU   IOSB+2                                                   00174000
IOSDVALT EQU   IOSFLC                                                   00175000
IOSPKEY  EQU   IOSB+12                                                  00176000
IOSCOD   EQU   IOSB+13                                                  00177000
IOSOPT   EQU   IOSB+14                                                  00178000
IOSOPT2  EQU   IOSB+15                                                  00179000
@NM00025 EQU   IOSB+20                                                  00180000
IOSCSW   EQU   @NM00025+1                                               00181000
IOSTATUS EQU   IOSCSW+3                                                 00182000
IOSSRB   EQU   IOSB+28                                                  00183000
IOSUSE   EQU   IOSB+32                                                  00184000
IOSIPIB  EQU   IOSB+44                                                  00185000
IOSPATH  EQU   IOSB+86                                                  00186000
IOSCHN   EQU   IOSPATH                                                  00187000
IOSCKEY  EQU   IOSB+89                                                  00188000
IOSEEKA  EQU   IOSB+100                                                 00189000
IOSCCHH  EQU   IOSEEKA+3                                                00190000
IOSSKHH  EQU   IOSCCHH+2                                                00191000
SRBSECT  EQU   0                                                        00192000
SRB      EQU   SRBSECT                                                  00193000
SRBFLNK  EQU   SRB+4                                                    00194000
SRBFLC   EQU   SRB+12                                                   00195000
SRBEP    EQU   SRB+20                                                   00196000
SRBPARM  EQU   SRB+28                                                   00197000
SRBVSAM  EQU   SRB+44                                                   00198000
SRBVFLGS EQU   SRBVSAM                                                  00199000
SRBVFIX  EQU   SRBVFLGS                                                 00200000
CVTMAP   EQU   0                                                        00201000
CVTDAR   EQU   CVTMAP+72                                                00202000
CVTFLGS1 EQU   CVTDAR                                                   00203000
CVTDCB   EQU   CVTMAP+116                                               00204000
CVTIOQET EQU   CVTMAP+120                                               00205000
CVTIERLC EQU   CVTMAP+144                                               00206000
CVTHEAD  EQU   CVTMAP+160                                               00207000
CVTSV76C EQU   CVTHEAD                                                  00208000
CVTOPTA  EQU   CVTMAP+182                                               00209000
CVTOPTB  EQU   CVTMAP+183                                               00210000
CVTGTF   EQU   CVTMAP+236                                               00211000
CVTGTFST EQU   CVTGTF                                                   00212000
CVTGTFS  EQU   CVTGTFST                                                 00213000
CVTSTATE EQU   CVTGTFST                                                 00214000
CVTTMODE EQU   CVTGTFST                                                 00215000
CVTFORM  EQU   CVTGTFST                                                 00216000
CVTAQAVT EQU   CVTMAP+240                                               00217000
CVTTCMFG EQU   CVTAQAVT                                                 00218000
CVTVOLM2 EQU   CVTMAP+244                                               00219000
CVTTATA  EQU   CVTVOLM2                                                 00220000
CVTTSKS  EQU   CVTTATA                                                  00221000
CVTVOLF2 EQU   CVTTSKS                                                  00222000
CVTTAT   EQU   CVTTATA+1                                                00223000
CVTATER  EQU   CVTMAP+248                                               00224000
CVTEXT1  EQU   CVTMAP+252                                               00225000
CVTPURG  EQU   CVTMAP+260                                               00226000
CVTQMSG  EQU   CVTMAP+268                                               00227000
CVTDMSR  EQU   CVTMAP+272                                               00228000
CVTRSV37 EQU   CVTDMSR                                                  00229000
CVTDMSRF EQU   CVTRSV37                                                 00230000
CVTERPV  EQU   CVTMAP+316                                               00231000
CVTINTLA EQU   CVTMAP+320                                               00232000
CVTAPF   EQU   CVTMAP+324                                               00233000
CVTEXT2  EQU   CVTMAP+328                                               00234000
CVTHJES  EQU   CVTMAP+332                                               00235000
CVTPGSIA EQU   CVTMAP+348                                               00236000
CVTA1F1  EQU   CVTMAP+356                                               00237000
CVTSYSK  EQU   CVTMAP+357                                               00238000
CVTVOLM1 EQU   CVTMAP+380                                               00239000
CVTVOLF1 EQU   CVTVOLM1                                                 00240000
CVTATMCT EQU   CVTMAP+388                                               00241000
CVTXTNT1 EQU   0                                                        00242000
CVTXTNT2 EQU   0                                                        00243000
CVTDSSV  EQU   CVTXTNT2                                                 00244000
CVTFLGBT EQU   CVTXTNT2+5                                               00245000
CVTQID   EQU   CVTXTNT2+24                                              00246000
CVTRV400 EQU   CVTXTNT2+52                                              00247000
CVTRV409 EQU   CVTXTNT2+53                                              00248000
CVTATCVT EQU   CVTXTNT2+64                                              00249000
CVTRV429 EQU   CVTXTNT2+84                                              00250000
CVTRV438 EQU   CVTXTNT2+85                                              00251000
CVTRV457 EQU   CVTXTNT2+112                                             00252000
CVTRV466 EQU   CVTXTNT2+113                                             00253000
CVTFIX   EQU   0                                                        00254000
CVTRELNO EQU   CVTFIX+252                                               00255000
IOSATTSC EQU   IOSIPIB                                                  00256000
IOSWTOWA EQU   IOSIPIB                                                  00257000
IOSPCISC EQU   IOSIPIB                                                  00258000
CVTS01   EQU   CVTPGSIA                                                 00259000
CVTLPDIA EQU   CVTS01+12                                                00260000
CVTDIRST EQU   CVTLPDIA                                                 00261000
CVTSLIDA EQU   CVTS01+24                                                00262000
CVTCTLFG EQU   CVTS01+50                                                00263000
CVTLSMQ  EQU   CVTS01+268                                               00264000
CVTRV210 EQU   CVTS01+424                                               00265000
CVTRV219 EQU   CVTS01+425                                               00266000
CVTRV228 EQU   CVTS01+426                                               00267000
CVTRV237 EQU   CVTS01+427                                               00268000
CVTMFRTR EQU   CVTS01+452                                               00269000
CVTRV262 EQU   CVTS01+468                                               00270000
CVTRV271 EQU   CVTS01+469                                               00271000
CVTRV280 EQU   CVTS01+470                                               00272000
CVTRV289 EQU   CVTS01+471                                               00273000
CVTGSDA  EQU   CVTS01+600                                               00274000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00275000
CVTRV628 EQU   CVTS01+728                                               00276000
CVTRV627 EQU   CVTS01+724                                               00277000
CVTRV626 EQU   CVTS01+720                                               00278000
CVTRV625 EQU   CVTS01+716                                               00279000
CVTRV624 EQU   CVTS01+712                                               00280000
CVTRV623 EQU   CVTS01+708                                               00281000
CVTRV622 EQU   CVTS01+704                                               00282000
CVTRV621 EQU   CVTS01+700                                               00283000
CVTIHASU EQU   CVTS01+696                                               00284000
CVTRV619 EQU   CVTS01+692                                               00285000
CVTRV618 EQU   CVTS01+688                                               00286000
CVTRV617 EQU   CVTS01+684                                               00287000
CVTRV616 EQU   CVTS01+680                                               00288000
CVTRV615 EQU   CVTS01+676                                               00289000
CVTRV614 EQU   CVTS01+672                                               00290000
CVTRV613 EQU   CVTS01+668                                               00291000
CVTTCASP EQU   CVTS01+664                                               00292000
CVT0PT03 EQU   CVTS01+660                                               00293000
CVT0PT0E EQU   CVTS01+656                                               00294000
CVTRV609 EQU   CVTS01+652                                               00295000
CVTCGK   EQU   CVTS01+648                                               00296000
CVTRAC   EQU   CVTS01+644                                               00297000
CVTHSM   EQU   CVTS01+640                                               00298000
CVTRV605 EQU   CVTS01+636                                               00299000
CVTRV604 EQU   CVTS01+632                                               00300000
CVTEFF02 EQU   CVTS01+628                                               00301000
CVTCBBR  EQU   CVTS01+624                                               00302000
CVTSSCR  EQU   CVTS01+620                                               00303000
CVTEVENT EQU   CVTS01+616                                               00304000
CVTCRCA  EQU   CVTS01+612                                               00305000
CVTTPIO  EQU   CVTS01+608                                               00306000
CVTADV   EQU   CVTS01+604                                               00307000
CVTGSDAB EQU   CVTGSDA                                                  00308000
CVTQV3   EQU   CVTS01+596                                               00309000
CVTQV2   EQU   CVTS01+592                                               00310000
CVTQV1   EQU   CVTS01+588                                               00311000
CVTRPT   EQU   CVTS01+584                                               00312000
CVTSSRB  EQU   CVTS01+580                                               00313000
CVTCSDRL EQU   CVTS01+576                                               00314000
CVTEXP1  EQU   CVTS01+572                                               00315000
CVTRMPMT EQU   CVTS01+568                                               00316000
CVTRMPTT EQU   CVTS01+564                                               00317000
CVTVPSA  EQU   CVTS01+560                                               00318000
CVTVSTOP EQU   CVTS01+556                                               00319000
CVTGTFR8 EQU   CVTS01+552                                               00320000
CVTQUIT  EQU   CVTS01+548                                               00321000
CVTVACR  EQU   CVTS01+544                                               00322000
CVTWTCB  EQU   CVTS01+540                                               00323000
CVTSTPRS EQU   CVTS01+536                                               00324000
CVT0PT02 EQU   CVTS01+532                                               00325000
CVTDARCM EQU   CVTS01+528                                               00326000
CVTIRECM EQU   CVTS01+524                                               00327000
CVTJRECM EQU   CVTS01+520                                               00328000
CVTVEMS0 EQU   CVTS01+516                                               00329000
CVTSPFRR EQU   CVTS01+512                                               00330000
CVTRLSTG EQU   CVTS01+508                                               00331000
CVT0TC0A EQU   CVTS01+504                                               00332000
CVTGMBR  EQU   CVTS01+500                                               00333000
CVTLFRM  EQU   CVTS01+496                                               00334000
CVTRMBR  EQU   CVTS01+492                                               00335000
CVTVIOP  EQU   CVTS01+488                                               00336000
CVTRV307 EQU   CVTS01+486                                               00337000
CVTRV306 EQU   CVTS01+484                                               00338000
CVTRV305 EQU   CVTS01+482                                               00339000
CVTRV304 EQU   CVTS01+480                                               00340000
CVTRV303 EQU   CVTS01+478                                               00341000
CVTRV302 EQU   CVTS01+476                                               00342000
CVTTRCA  EQU   CVTS01+472                                               00343000
CVTRV297 EQU   CVTRV289                                                 00344000
CVTRV296 EQU   CVTRV289                                                 00345000
CVTRV295 EQU   CVTRV289                                                 00346000
CVTRV294 EQU   CVTRV289                                                 00347000
CVTRV293 EQU   CVTRV289                                                 00348000
CVTRV292 EQU   CVTRV289                                                 00349000
CVTRV291 EQU   CVTRV289                                                 00350000
CVTRV290 EQU   CVTRV289                                                 00351000
CVTRV288 EQU   CVTRV280                                                 00352000
CVTRV287 EQU   CVTRV280                                                 00353000
CVTRV286 EQU   CVTRV280                                                 00354000
CVTRV285 EQU   CVTRV280                                                 00355000
CVTRV284 EQU   CVTRV280                                                 00356000
CVTRV283 EQU   CVTRV280                                                 00357000
CVTRV282 EQU   CVTRV280                                                 00358000
CVTRV281 EQU   CVTRV280                                                 00359000
CVTRV279 EQU   CVTRV271                                                 00360000
CVTRV278 EQU   CVTRV271                                                 00361000
CVTRV277 EQU   CVTRV271                                                 00362000
CVTRV276 EQU   CVTRV271                                                 00363000
CVTRV275 EQU   CVTRV271                                                 00364000
CVTRV274 EQU   CVTRV271                                                 00365000
CVTRV273 EQU   CVTRV271                                                 00366000
CVTRV272 EQU   CVTRV271                                                 00367000
CVTRV270 EQU   CVTRV262                                                 00368000
CVTRV269 EQU   CVTRV262                                                 00369000
CVTRV268 EQU   CVTRV262                                                 00370000
CVTRV267 EQU   CVTRV262                                                 00371000
CVTRV266 EQU   CVTRV262                                                 00372000
CVTRV265 EQU   CVTRV262                                                 00373000
CVTRV264 EQU   CVTRV262                                                 00374000
CVTRV263 EQU   CVTRV262                                                 00375000
CVTVFP   EQU   CVTS01+464                                               00376000
CVTVSI   EQU   CVTS01+460                                               00377000
CVTVPSIB EQU   CVTS01+456                                               00378000
CVTMFACT EQU   CVTMFRTR                                                 00379000
CVTMFCTL EQU   CVTS01+448                                               00380000
CVTPVBP  EQU   CVTS01+444                                               00381000
CVTPWI   EQU   CVTS01+440                                               00382000
CVTRV254 EQU   CVTS01+438                                               00383000
CVTRV253 EQU   CVTS01+436                                               00384000
CVTRV252 EQU   CVTS01+434                                               00385000
CVTRV251 EQU   CVTS01+433                                               00386000
CVTRV250 EQU   CVTS01+432                                               00387000
CVTRV249 EQU   CVTS01+431                                               00388000
CVTRV248 EQU   CVTS01+430                                               00389000
CVTRV247 EQU   CVTS01+429                                               00390000
CVTRV246 EQU   CVTS01+428                                               00391000
CVTRV245 EQU   CVTRV237                                                 00392000
CVTRV244 EQU   CVTRV237                                                 00393000
CVTRV243 EQU   CVTRV237                                                 00394000
CVTRV242 EQU   CVTRV237                                                 00395000
CVTRV241 EQU   CVTRV237                                                 00396000
CVTRV240 EQU   CVTRV237                                                 00397000
CVTRV239 EQU   CVTRV237                                                 00398000
CVTRV238 EQU   CVTRV237                                                 00399000
CVTRV236 EQU   CVTRV228                                                 00400000
CVTRV235 EQU   CVTRV228                                                 00401000
CVTRV234 EQU   CVTRV228                                                 00402000
CVTRV233 EQU   CVTRV228                                                 00403000
CVTRV232 EQU   CVTRV228                                                 00404000
CVTRV231 EQU   CVTRV228                                                 00405000
CVTRV230 EQU   CVTRV228                                                 00406000
CVTRV229 EQU   CVTRV228                                                 00407000
CVTRV227 EQU   CVTRV219                                                 00408000
CVTRV226 EQU   CVTRV219                                                 00409000
CVTRV225 EQU   CVTRV219                                                 00410000
CVTRV224 EQU   CVTRV219                                                 00411000
CVTRV223 EQU   CVTRV219                                                 00412000
CVTRV222 EQU   CVTRV219                                                 00413000
CVTRV221 EQU   CVTRV219                                                 00414000
CVTRV220 EQU   CVTRV219                                                 00415000
CVTRV218 EQU   CVTRV210                                                 00416000
CVTRV217 EQU   CVTRV210                                                 00417000
CVTRV216 EQU   CVTRV210                                                 00418000
CVTRV215 EQU   CVTRV210                                                 00419000
CVTRV214 EQU   CVTRV210                                                 00420000
CVTRV213 EQU   CVTRV210                                                 00421000
CVTRV212 EQU   CVTRV210                                                 00422000
CVTRV211 EQU   CVTRV210                                                 00423000
CVTLCCAT EQU   CVTS01+420                                               00424000
CVTPCCAT EQU   CVTS01+416                                               00425000
CVTIPCRP EQU   CVTS01+412                                               00426000
CVTIPCRI EQU   CVTS01+408                                               00427000
CVTIPCDS EQU   CVTS01+404                                               00428000
CVTAIDVT EQU   CVTS01+400                                               00429000
CVTSSAP  EQU   CVTS01+396                                               00430000
CVTEHCIR EQU   CVTS01+392                                               00431000
CVTEHDEF EQU   CVTS01+388                                               00432000
CVTDAIR  EQU   CVTS01+384                                               00433000
CVTPERFM EQU   CVTS01+380                                               00434000
CVT044R2 EQU   CVTS01+376                                               00435000
CVTFETCH EQU   CVTS01+372                                               00436000
CVTRSTWD EQU   CVTS01+368                                               00437000
CVTSPOST EQU   CVTS01+364                                               00438000
CVTIOBP  EQU   CVTS01+360                                               00439000
CVTASMVT EQU   CVTS01+356                                               00440000
CVTRECRQ EQU   CVTS01+352                                               00441000
CVTWSAC  EQU   CVTS01+348                                               00442000
CVTRV149 EQU   CVTS01+344                                               00443000
CVTWSAL  EQU   CVTS01+340                                               00444000
CVTSPSA  EQU   CVTS01+336                                               00445000
CVTGLMN  EQU   CVTS01+332                                               00446000
CVTVEAC0 EQU   CVTS01+328                                               00447000
CVT062R1 EQU   CVTS01+324                                               00448000
CVTRPOST EQU   CVTS01+320                                               00449000
CVTDQIQE EQU   CVTS01+316                                               00450000
CVTCSD   EQU   CVTS01+312                                               00451000
CVTLKRMA EQU   CVTS01+308                                               00452000
CVTRSPIE EQU   CVTS01+304                                               00453000
CVTRENQ  EQU   CVTS01+300                                               00454000
CVTLQCB  EQU   CVTS01+296                                               00455000
CVTFQCB  EQU   CVTS01+292                                               00456000
CVTQCS01 EQU   CVTS01+288                                               00457000
CVTAPFT  EQU   CVTS01+284                                               00458000
CVTPARRL EQU   CVTS01+280                                               00459000
CVTVWAIT EQU   CVTS01+276                                               00460000
CVTGSPL  EQU   CVTS01+272                                               00461000
CVTGSMQ  EQU   CVTS01+264                                               00462000
CVTEXPRO EQU   CVTS01+260                                               00463000
CVTOPCTP EQU   CVTS01+256                                               00464000
CVTSIC   EQU   CVTS01+252                                               00465000
CVTTPIOS EQU   CVTS01+248                                               00466000
CVTRTMS  EQU   CVTS01+244                                               00467000
CVTSDBF  EQU   CVTS01+240                                               00468000
CVTSCBP  EQU   CVTS01+236                                               00469000
CVTSDMP  EQU   CVTS01+232                                               00470000
CVTSV60  EQU   CVTS01+228                                               00471000
CVTRTMCT EQU   CVTS01+224                                               00472000
CVTASCBL EQU   CVTS01+220                                               00473000
CVTASCBH EQU   CVTS01+216                                               00474000
CVTGDA   EQU   CVTS01+212                                               00475000
CVTASVT  EQU   CVTS01+208                                               00476000
CVTVVMDI EQU   CVTS01+204                                               00477000
CVTAQTOP EQU   CVTS01+200                                               00478000
CVTIOSCS EQU   CVTS01+196                                               00479000
CVTSDRM  EQU   CVTS01+192                                               00480000
CVTOPTE  EQU   CVTS01+188                                               00481000
CVTSTXU  EQU   CVTS01+184                                               00482000
CVTQUIS  EQU   CVTS01+180                                               00483000
CVTPARS  EQU   CVTS01+176                                               00484000
CVTS1EE  EQU   CVTS01+172                                               00485000
CVTFRAS  EQU   CVTS01+168                                               00486000
CVTQSAS  EQU   CVTS01+164                                               00487000
CVTCRAS  EQU   CVTS01+160                                               00488000
CVTCRMN  EQU   CVTS01+156                                               00489000
CVTDELCP EQU   CVTS01+152                                               00490000
CVTFRECL EQU   CVTS01+148                                               00491000
CVTGETCL EQU   CVTS01+144                                               00492000
CVTBLDCP EQU   CVTS01+140                                               00493000
CVTAUTHL EQU   CVTS01+136                                               00494000
CVTSCAN  EQU   CVTS01+132                                               00495000
CVTRV144 EQU   CVTS01+130                                               00496000
CVTMAXMP EQU   CVTS01+128                                               00497000
CVTSTCK  EQU   CVTS01+124                                               00498000
CVTRV139 EQU   CVTS01+123                                               00499000
CVTDSSAC EQU   CVTS01+122                                               00500000
CVTRV513 EQU   CVTS01+121                                               00501000
CVTIOSPL EQU   CVTS01+120                                               00502000
CVTPTGT  EQU   CVTS01+116                                               00503000
CVTCSPIE EQU   CVTS01+112                                               00504000
CVTSMFEX EQU   CVTS01+108                                               00505000
CVTOLT0A EQU   CVTS01+104                                               00506000
CVTSRBRT EQU   CVTS01+100                                               00507000
CVTPUTL  EQU   CVTS01+96                                                00508000
CVTASCRL EQU   CVTS01+92                                                00509000
CVTASCRF EQU   CVTS01+88                                                00510000
CVTRV326 EQU   CVTS01+84                                                00511000
CVTRV325 EQU   CVTS01+80                                                00512000
CVTRV324 EQU   CVTS01+76                                                00513000
CVT0VL01 EQU   CVTS01+72                                                00514000
CVTSHRVM EQU   CVTS01+68                                                00515000
CVTRV332 EQU   CVTS01+64                                                00516000
CVTTAS   EQU   CVTS01+60                                                00517000
CVTRSCN  EQU   CVTS01+56                                                00518000
CVTTRAC2 EQU   CVTS01+54                                                00519000
CVTTRACE EQU   CVTS01+52                                                00520000
CVTAPG   EQU   CVTS01+51                                                00521000
CVTSDTRC EQU   CVTCTLFG                                                 00522000
CVTGTRCE EQU   CVTCTLFG                                                 00523000
CVTNOMP  EQU   CVTCTLFG                                                 00524000
CVTRSV79 EQU   CVTCTLFG                                                 00525000
CVTDSTAT EQU   CVTCTLFG                                                 00526000
CVTRSV78 EQU   CVTCTLFG                                                 00527000
CVTRV333 EQU   CVTCTLFG                                                 00528000
CVTRV323 EQU   CVTCTLFG                                                 00529000
CVTSPVLK EQU   CVTS01+49                                                00530000
CVTRSV77 EQU   CVTS01+48                                                00531000
CVTRV331 EQU   CVTS01+44                                                00532000
CVTRV330 EQU   CVTS01+40                                                00533000
CVTRV329 EQU   CVTS01+36                                                00534000
CVTRV328 EQU   CVTS01+32                                                00535000
CVTRV322 EQU   CVTS01+28                                                00536000
CVTSLID  EQU   CVTSLIDA+1                                               00537000
CVTSYLK  EQU   CVTSLIDA                                                 00538000
CVTRV321 EQU   CVTS01+20                                                00539000
CVTRV320 EQU   CVTS01+16                                                00540000
CVTLPDIR EQU   CVTLPDIA+1                                               00541000
CVTRSV69 EQU   CVTDIRST                                                 00542000
CVTRSV68 EQU   CVTDIRST                                                 00543000
CVTRSV67 EQU   CVTDIRST                                                 00544000
CVTRSV66 EQU   CVTDIRST                                                 00545000
CVTRSV65 EQU   CVTDIRST                                                 00546000
CVTRSV64 EQU   CVTDIRST                                                 00547000
CVTRSV63 EQU   CVTDIRST                                                 00548000
CVTDICOM EQU   CVTDIRST                                                 00549000
CVTPVTP  EQU   CVTS01+8                                                 00550000
CVTLPDSR EQU   CVTS01+4                                                 00551000
CVTGETL  EQU   CVTS01                                                   00552000
IOSPCIWA EQU   IOSPCISC+44                                              00553000
IOSPCIRS EQU   IOSPCISC+8                                               00554000
@NM00030 EQU   IOSPCISC+4                                               00555000
@NM00029 EQU   IOSPCISC                                                 00556000
IOSWRNDR EQU   IOSWTOWA+4                                               00557000
IOSWTOPT EQU   IOSWTOWA+3                                               00558000
IOSWTOCP EQU   IOSWTOWA+2                                               00559000
IOSWTOCH EQU   IOSWTOWA                                                 00560000
IOSATTWA EQU   IOSATTSC+40                                              00561000
@NM00028 EQU   IOSATTSC+24                                              00562000
IOSATTSN EQU   IOSATTSC                                                 00563000
CVTLEVL  EQU   CVTRELNO+2                                               00564000
CVTNUMB  EQU   CVTRELNO                                                 00565000
CVTMDL   EQU   CVTFIX+250                                               00566000
@NM00036 EQU   CVTFIX+248                                               00567000
@NM00035 EQU   CVTFIX                                                   00568000
CVTRV482 EQU   CVTXTNT2+128                                             00569000
CVTRV481 EQU   CVTXTNT2+124                                             00570000
CVTRV480 EQU   CVTXTNT2+120                                             00571000
CVTRV479 EQU   CVTXTNT2+118                                             00572000
CVTRV478 EQU   CVTXTNT2+117                                             00573000
CVTRV477 EQU   CVTXTNT2+116                                             00574000
CVTRV476 EQU   CVTXTNT2+115                                             00575000
CVTRV475 EQU   CVTXTNT2+114                                             00576000
CVTRV474 EQU   CVTRV466                                                 00577000
CVTRV473 EQU   CVTRV466                                                 00578000
CVTRV472 EQU   CVTRV466                                                 00579000
CVTRV471 EQU   CVTRV466                                                 00580000
CVTRV470 EQU   CVTRV466                                                 00581000
CVTRV469 EQU   CVTRV466                                                 00582000
CVTRV468 EQU   CVTRV466                                                 00583000
CVTRV467 EQU   CVTRV466                                                 00584000
CVTRV465 EQU   CVTRV457                                                 00585000
CVTRV464 EQU   CVTRV457                                                 00586000
CVTRV463 EQU   CVTRV457                                                 00587000
CVTRV462 EQU   CVTRV457                                                 00588000
CVTRV461 EQU   CVTRV457                                                 00589000
CVTRV460 EQU   CVTRV457                                                 00590000
CVTRV459 EQU   CVTRV457                                                 00591000
CVTRV458 EQU   CVTRV457                                                 00592000
CVTRV456 EQU   CVTXTNT2+108                                             00593000
CVTRV455 EQU   CVTXTNT2+104                                             00594000
CVTRV454 EQU   CVTXTNT2+100                                             00595000
CVTRV453 EQU   CVTXTNT2+96                                              00596000
CVTRV452 EQU   CVTXTNT2+94                                              00597000
CVTRV451 EQU   CVTXTNT2+92                                              00598000
CVTRV450 EQU   CVTXTNT2+90                                              00599000
CVTRV449 EQU   CVTXTNT2+88                                              00600000
CVTRV448 EQU   CVTXTNT2+87                                              00601000
CVTRV447 EQU   CVTXTNT2+86                                              00602000
CVTRV446 EQU   CVTRV438                                                 00603000
CVTRV445 EQU   CVTRV438                                                 00604000
CVTRV444 EQU   CVTRV438                                                 00605000
CVTRV443 EQU   CVTRV438                                                 00606000
CVTRV442 EQU   CVTRV438                                                 00607000
CVTRV441 EQU   CVTRV438                                                 00608000
CVTRV440 EQU   CVTRV438                                                 00609000
CVTRV439 EQU   CVTRV438                                                 00610000
CVTRV437 EQU   CVTRV429                                                 00611000
CVTRV436 EQU   CVTRV429                                                 00612000
CVTRV435 EQU   CVTRV429                                                 00613000
CVTRV434 EQU   CVTRV429                                                 00614000
CVTRV433 EQU   CVTRV429                                                 00615000
CVTRV432 EQU   CVTRV429                                                 00616000
CVTRV431 EQU   CVTRV429                                                 00617000
CVTRV430 EQU   CVTRV429                                                 00618000
CVTRV428 EQU   CVTXTNT2+80                                              00619000
CVTRV427 EQU   CVTXTNT2+76                                              00620000
CVTRV426 EQU   CVTXTNT2+72                                              00621000
CVTRV425 EQU   CVTXTNT2+68                                              00622000
CVTATACT EQU   CVTATCVT                                                 00623000
CVTRV423 EQU   CVTXTNT2+62                                              00624000
CVTRV422 EQU   CVTXTNT2+60                                              00625000
CVTRV421 EQU   CVTXTNT2+58                                              00626000
CVTRV420 EQU   CVTXTNT2+56                                              00627000
CVTRV419 EQU   CVTXTNT2+55                                              00628000
CVTRV418 EQU   CVTXTNT2+54                                              00629000
CVTRV417 EQU   CVTRV409                                                 00630000
CVTRV416 EQU   CVTRV409                                                 00631000
CVTRV415 EQU   CVTRV409                                                 00632000
CVTRV414 EQU   CVTRV409                                                 00633000
CVTRV413 EQU   CVTRV409                                                 00634000
CVTRV412 EQU   CVTRV409                                                 00635000
CVTRV411 EQU   CVTRV409                                                 00636000
CVTRV410 EQU   CVTRV409                                                 00637000
CVTRV408 EQU   CVTRV400                                                 00638000
CVTRV407 EQU   CVTRV400                                                 00639000
CVTRV406 EQU   CVTRV400                                                 00640000
CVTRV405 EQU   CVTRV400                                                 00641000
CVTRV404 EQU   CVTRV400                                                 00642000
CVTRV403 EQU   CVTRV400                                                 00643000
CVTRV402 EQU   CVTRV400                                                 00644000
CVTRV401 EQU   CVTRV400                                                 00645000
CVTICB   EQU   CVTXTNT2+48                                              00646000
CVTSKTA  EQU   CVTXTNT2+44                                              00647000
CVTCCVT  EQU   CVTXTNT2+40                                              00648000
CVTRSV98 EQU   CVTXTNT2+36                                              00649000
CVTRSV97 EQU   CVTXTNT2+34                                              00650000
CVTRSV96 EQU   CVTXTNT2+32                                              00651000
CVTOLTEP EQU   CVTXTNT2+28                                              00652000
CVTQIDA  EQU   CVTQID+1                                                 00653000
CVTRSV95 EQU   CVTQID                                                   00654000
CVTRSV94 EQU   CVTXTNT2+20                                              00655000
CVTRSV93 EQU   CVTXTNT2+16                                              00656000
CVTRSV92 EQU   CVTXTNT2+12                                              00657000
CVTDEBVR EQU   CVTXTNT2+8                                               00658000
CVTRSV91 EQU   CVTXTNT2+6                                               00659000
CVTRSV9H EQU   CVTFLGBT                                                 00660000
CVTRSV9G EQU   CVTFLGBT                                                 00661000
CVTRSV9F EQU   CVTFLGBT                                                 00662000
CVTRSV9E EQU   CVTFLGBT                                                 00663000
CVTRSV9D EQU   CVTFLGBT                                                 00664000
CVTRSV9C EQU   CVTFLGBT                                                 00665000
CVTVME   EQU   CVTFLGBT                                                 00666000
CVTNPE   EQU   CVTFLGBT                                                 00667000
CVTNUCLS EQU   CVTXTNT2+4                                               00668000
CVTDSSVA EQU   CVTDSSV+1                                                00669000
CVTRSV89 EQU   CVTDSSV                                                  00670000
CVTRSV88 EQU   CVTXTNT1+8                                               00671000
CVTRSV87 EQU   CVTXTNT1+4                                               00672000
CVTFACHN EQU   CVTXTNT1                                                 00673000
CVTRV488 EQU   CVTMAP+412                                               00674000
CVTRV487 EQU   CVTMAP+408                                               00675000
CVTRV486 EQU   CVTMAP+404                                               00676000
CVTRV485 EQU   CVTMAP+400                                               00677000
CVTACTAP EQU   CVTMAP+396                                               00678000
CVTAUTH  EQU   CVTMAP+392                                               00679000
CVTATMCA EQU   CVTATMCT+1                                               00680000
CVTATMST EQU   CVTATMCT                                                 00681000
CVTRSV61 EQU   CVTMAP+384                                               00682000
CVTVOLT1 EQU   CVTVOLM1+1                                               00683000
CVTVOLI1 EQU   CVTVOLF1                                                 00684000
CVTSTOA  EQU   CVTMAP+376                                               00685000
CVTRSV58 EQU   CVTMAP+374                                               00686000
CVTRSV57 EQU   CVTMAP+372                                               00687000
CVTDDCE  EQU   CVTMAP+368                                               00688000
CVTPNWFR EQU   CVTMAP+364                                               00689000
CVTSMF   EQU   CVTMAP+360                                               00690000
CVTSULK  EQU   CVTMAP+358                                               00691000
CVTSLKO  EQU   CVTSYSK                                                  00692000
CVTSLKP  EQU   CVTSYSK                                                  00693000
CVTSLKQ  EQU   CVTSYSK                                                  00694000
CVTSLKR  EQU   CVTSYSK                                                  00695000
CVTRSV56 EQU   CVTSYSK                                                  00696000
CVTRSV55 EQU   CVTSYSK                                                  00697000
CVTRSV54 EQU   CVTSYSK                                                  00698000
CVTRSV53 EQU   CVTSYSK                                                  00699000
CVTRSV52 EQU   CVTA1F1                                                  00700000
CVTRSV51 EQU   CVTA1F1                                                  00701000
CVTRSV50 EQU   CVTA1F1                                                  00702000
CVTRSV49 EQU   CVTA1F1                                                  00703000
CVTRSV48 EQU   CVTA1F1                                                  00704000
CVTRSV47 EQU   CVTA1F1                                                  00705000
CVTSRSW  EQU   CVTA1F1                                                  00706000
CVTPFSW  EQU   CVTA1F1                                                  00707000
CVTPCVT  EQU   CVTMAP+352                                               00708000
CVTRSV46 EQU   CVTMAP+344                                               00709000
CVTRSV45 EQU   CVTMAP+340                                               00710000
CVTRSV44 EQU   CVTMAP+338                                               00711000
CVTRSV43 EQU   CVTMAP+336                                               00712000
CVTHJESA EQU   CVTHJES+1                                                00713000
CVTRSV42 EQU   CVTHJES                                                  00714000
CVTEXT2A EQU   CVTEXT2+1                                                00715000
CVTRSV41 EQU   CVTEXT2                                                  00716000
CVTAPFA  EQU   CVTAPF+1                                                 00717000
CVTRSV40 EQU   CVTAPF                                                   00718000
CVTRV518 EQU   CVTINTLA                                                 00719000
CVTRV517 EQU   CVTERPV                                                  00720000
CVTEORM  EQU   CVTMAP+312                                               00721000
CVTMCHPR EQU   CVTMAP+308                                               00722000
CVTTZ    EQU   CVTMAP+304                                               00723000
CVTJEPS  EQU   CVTMAP+300                                               00724000
CVTJESCT EQU   CVTMAP+296                                               00725000
CVTMODE  EQU   CVTMAP+292                                               00726000
CVTPTRV  EQU   CVTMAP+288                                               00727000
CVTREAL  EQU   CVTMAP+284                                               00728000
CVTRSV39 EQU   CVTMAP+280                                               00729000
CVTRSV38 EQU   CVTMAP+276                                               00730000
CVTDMSRA EQU   CVTDMSR+1                                                00731000
CVTRV634 EQU   CVTDMSRF                                                 00732000
CVTRV633 EQU   CVTDMSRF                                                 00733000
CVTRV632 EQU   CVTDMSRF                                                 00734000
CVTRV631 EQU   CVTDMSRF                                                 00735000
CVTRV630 EQU   CVTDMSRF                                                 00736000
CVTRV629 EQU   CVTDMSRF                                                 00737000
CVTUDUMP EQU   CVTDMSRF                                                 00738000
CVTSDUMP EQU   CVTDMSRF                                                 00739000
CVTQMSGA EQU   CVTQMSG+1                                                00740000
CVTRSV36 EQU   CVTQMSG                                                  00741000
CVTAMFF  EQU   CVTMAP+264                                               00742000
CVTPURGA EQU   CVTPURG+1                                                00743000
CVTRSV35 EQU   CVTPURG                                                  00744000
CVTCBSP  EQU   CVTMAP+256                                               00745000
CVTATERA EQU   CVTATER+1                                                00746000
CVTSYST  EQU   CVTATER                                                  00747000
CVTVOLT2 EQU   CVTTAT                                                   00748000
CVTVOLI2 EQU   CVTVOLF2                                                 00749000
CVTAQAVB EQU   CVTAQAVT+1                                               00750000
CVTRSV34 EQU   CVTTCMFG                                                 00751000
CVTRSV33 EQU   CVTTCMFG                                                 00752000
CVTRSV32 EQU   CVTTCMFG                                                 00753000
CVTRSV31 EQU   CVTTCMFG                                                 00754000
CVTRSV30 EQU   CVTTCMFG                                                 00755000
CVTRSV29 EQU   CVTTCMFG                                                 00756000
CVTRSV28 EQU   CVTTCMFG                                                 00757000
CVTTCRDY EQU   CVTTCMFG                                                 00758000
CVTGTFA  EQU   CVTGTF+1                                                 00759000
CVTRSV27 EQU   CVTGTFST                                                 00760000
CVTRNIO  EQU   CVTGTFST                                                 00761000
CVTUSR   EQU   CVTGTFST                                                 00762000
CVTRV318 EQU   CVTFORM                                                  00763000
CVTRV317 EQU   CVTTMODE                                                 00764000
CVTRV316 EQU   CVTSTATE                                                 00765000
CVTRV315 EQU   CVTGTFS                                                  00766000
CVTGTFAV EQU   CVTGTFS                                                  00767000
CVT0SCR1 EQU   CVTMAP+232                                               00768000
CVTRV515 EQU   CVTMAP+228                                               00769000
CVTRMS   EQU   CVTMAP+224                                               00770000
CVTPATCH EQU   CVTMAP+220                                               00771000
CVTTSCE  EQU   CVTMAP+216                                               00772000
CVTLNKSC EQU   CVTMAP+214                                               00773000
CVTQABST EQU   CVTMAP+212                                               00774000
CVTMDLDS EQU   CVTMAP+208                                               00775000
CVTUSER  EQU   CVTMAP+204                                               00776000
CVTABEND EQU   CVTMAP+200                                               00777000
CVTSMCA  EQU   CVTMAP+196                                               00778000
CVTRSV18 EQU   CVTMAP+192                                               00779000
CVTQLPAQ EQU   CVTMAP+188                                               00780000
CVTQCDSR EQU   CVTMAP+184                                               00781000
CVTRSV17 EQU   CVTOPTB                                                  00782000
CVTRSV16 EQU   CVTOPTB                                                  00783000
CVTFP    EQU   CVTOPTB                                                  00784000
CVTAPTHR EQU   CVTOPTB                                                  00785000
CVTNLOG  EQU   CVTOPTB                                                  00786000
CVTTOD   EQU   CVTOPTB                                                  00787000
CVTCTIMS EQU   CVTOPTB                                                  00788000
CVTPROT  EQU   CVTOPTB                                                  00789000
CVTXPFP  EQU   CVTOPTA                                                  00790000
CVTASCII EQU   CVTOPTA                                                  00791000
CVTRSV13 EQU   CVTOPTA                                                  00792000
CVTRSV12 EQU   CVTOPTA                                                  00793000
CVTNIP   EQU   CVTOPTA                                                  00794000
CVTDDR   EQU   CVTOPTA                                                  00795000
CVTAPR   EQU   CVTOPTA                                                  00796000
CVTCCH   EQU   CVTOPTA                                                  00797000
CVTSNCTR EQU   CVTMAP+180                                               00798000
CVTQMWR  EQU   CVTMAP+176                                               00799000
CVTQOCR  EQU   CVTMAP+172                                               00800000
CVT1EF00 EQU   CVTMAP+168                                               00801000
CVTMZ00  EQU   CVTMAP+164                                               00802000
CVTSV76Q EQU   CVTSV76C                                                 00803000
CVTRSV11 EQU   CVTMAP+156                                               00804000
CVT0PT01 EQU   CVTMAP+152                                               00805000
CVTMSER  EQU   CVTMAP+148                                               00806000
CVTRV516 EQU   CVTIERLC                                                 00807000
CVTILCH  EQU   CVTMAP+140                                               00808000
CVT0DS   EQU   CVTMAP+136                                               00809000
CVTFBOSV EQU   CVTMAP+132                                               00810000
CVTNUCB  EQU   CVTMAP+128                                               00811000
CVTIXAVL EQU   CVTMAP+124                                               00812000
CVTSV76M EQU   CVTIOQET                                                 00813000
CVTDCBA  EQU   CVTMAP+117                                               00814000
CVTMVS2  EQU   CVTDCB                                                   00815000
CVT6DAT  EQU   CVTDCB                                                   00816000
CVT4MPS  EQU   CVTDCB                                                   00817000
CVTRSV09 EQU   CVTDCB                                                   00818000
CVT4MS1  EQU   CVTDCB                                                   00819000
CVT2SPS  EQU   CVTDCB                                                   00820000
CVT1SSS  EQU   CVTDCB                                                   00821000
CVTRSV08 EQU   CVTDCB                                                   00822000
CVTSTB   EQU   CVTMAP+112                                               00823000
CVTQTD00 EQU   CVTMAP+108                                               00824000
CVTQTE00 EQU   CVTMAP+104                                               00825000
CVTCUCB  EQU   CVTMAP+100                                               00826000
CVTSJQ   EQU   CVTMAP+96                                                00827000
CVTPBLDL EQU   CVTMAP+92                                                00828000
CVTTPC   EQU   CVTMAP+88                                                00829000
CVTSVDCB EQU   CVTMAP+84                                                00830000
CVTBRET  EQU   CVTMAP+82                                                00831000
CVTEXIT  EQU   CVTMAP+80                                                00832000
CVT0FN00 EQU   CVTMAP+76                                                00833000
CVTDARA  EQU   CVTDAR+1                                                 00834000
CVTRSV07 EQU   CVTFLGS1                                                 00835000
CVTRSV06 EQU   CVTFLGS1                                                 00836000
CVTRSV05 EQU   CVTFLGS1                                                 00837000
CVTRSV04 EQU   CVTFLGS1                                                 00838000
CVTRSV03 EQU   CVTFLGS1                                                 00839000
CVTRSV02 EQU   CVTFLGS1                                                 00840000
CVTRSV01 EQU   CVTFLGS1                                                 00841000
CVTDMPLK EQU   CVTFLGS1                                                 00842000
CVTXITP  EQU   CVTMAP+68                                                00843000
CVTZDTAB EQU   CVTMAP+64                                                00844000
CVTMSLT  EQU   CVTMAP+60                                                00845000
CVTDATE  EQU   CVTMAP+56                                                00846000
CVTBTERM EQU   CVTMAP+52                                                00847000
CVTSYSAD EQU   CVTMAP+48                                                00848000
CVTXTLER EQU   CVTMAP+44                                                00849000
CVTILK2  EQU   CVTMAP+40                                                00850000
CVTILK1  EQU   CVTMAP+36                                                00851000
CVTPRLTV EQU   CVTMAP+32                                                00852000
CVTPCNVT EQU   CVTMAP+28                                                00853000
CVT0VL00 EQU   CVTMAP+24                                                00854000
CVTXAPG  EQU   CVTMAP+20                                                00855000
CVTBUF   EQU   CVTMAP+16                                                00856000
CVTJOB   EQU   CVTMAP+12                                                00857000
CVTLINK  EQU   CVTMAP+8                                                 00858000
CVT0EF00 EQU   CVTMAP+4                                                 00859000
CVTTCBP  EQU   CVTMAP                                                   00860000
CVT      EQU   CVTMAP                                                   00861000
@NM00034 EQU   SRBVSAM+1                                                00862000
@NM00033 EQU   SRBVFLGS                                                 00863000
@NM00032 EQU   SRB+40                                                   00864000
@NM00031 EQU   SRB+38                                                   00865000
SRBPRIOR EQU   SRB+37                                                   00866000
SRBPKF   EQU   SRB+36                                                   00867000
SRBSAVE  EQU   SRB+32                                                   00868000
SRBRMTR  EQU   SRB+24                                                   00869000
SRBPTCB  EQU   SRBFLC+4                                                 00870000
SRBPASID EQU   SRBFLC+2                                                 00871000
SRBCPAFF EQU   SRBFLC                                                   00872000
SRBASCB  EQU   SRB+8                                                    00873000
SRBID    EQU   SRB                                                      00874000
IOSEND   EQU   IOSB+108                                                 00875000
IOSSKR   EQU   IOSEEKA+7                                                00876000
IOSSKH2  EQU   IOSSKHH+1                                                00877000
IOSSKH1  EQU   IOSSKHH                                                  00878000
IOSSKCC  EQU   IOSCCHH                                                  00879000
IOSSKBB  EQU   IOSEEKA+1                                                00880000
IOSSKM   EQU   IOSEEKA                                                  00881000
IOSEEK   EQU   IOSB+92                                                  00882000
IOSMDM   EQU   IOSB+91                                                  00883000
IOSMDB   EQU   IOSB+90                                                  00884000
IOSCKEY7 EQU   IOSCKEY                                                  00885000
IOSCKEY6 EQU   IOSCKEY                                                  00886000
IOSCKEY5 EQU   IOSCKEY                                                  00887000
IOSCKEY4 EQU   IOSCKEY                                                  00888000
@NM00027 EQU   IOSCKEY                                                  00889000
IOSFMSK  EQU   IOSB+88                                                  00890000
IOSCUDEV EQU   IOSPATH+1                                                00891000
@NM00026 EQU   IOSCHN                                                   00892000
IOSPATH3 EQU   IOSCHN                                                   00893000
IOSPATH2 EQU   IOSCHN                                                   00894000
IOSEXP   EQU   IOSCHN                                                   00895000
IOSGDP   EQU   IOSCHN                                                   00896000
IOSAFF   EQU   IOSB+85                                                  00897000
IOSRSS1B EQU   IOSB+84                                                  00898000
IOSDSID  EQU   IOSB+80                                                  00899000
IOSVST   EQU   IOSB+76                                                  00900000
IOSRST   EQU   IOSB+72                                                  00901000
IOSDIE   EQU   IOSB+68                                                  00902000
IOSABN   EQU   IOSB+64                                                  00903000
IOSNRM   EQU   IOSB+60                                                  00904000
IOSPCI   EQU   IOSB+56                                                  00905000
IOSERP   EQU   IOSB+52                                                  00906000
IOSPCHN  EQU   IOSB+48                                                  00907000
IOSSNS   EQU   IOSB+42                                                  00908000
IOSAPMSK EQU   IOSB+40                                                  00909000
IOSRES4A EQU   IOSB+36                                                  00910000
IOSCSWRC EQU   IOSCSW+5                                                 00911000
IOSTSB   EQU   IOSTATUS+1                                               00912000
IOSTSA   EQU   IOSTATUS                                                 00913000
IOSCSWCA EQU   IOSCSW                                                   00914000
IOSCC    EQU   @NM00025                                                 00915000
IOSUCB   EQU   IOSB+16                                                  00916000
IOSOPT2X EQU   IOSOPT2                                                  00917000
IOSIGP   EQU   IOSOPT2                                                  00918000
IOSHTP   EQU   IOSOPT2                                                  00919000
IOSRELSE EQU   IOSOPT                                                   00920000
IOSAPR   EQU   IOSOPT                                                   00921000
IOSTSLL  EQU   IOSOPT                                                   00922000
IOSNERP  EQU   IOSOPT                                                   00923000
IOSPSLL  EQU   IOSOPT                                                   00924000
IOSQISCE EQU   IOSOPT                                                   00925000
IOSDEP   EQU   IOSOPT                                                   00926000
IOSBYP   EQU   IOSOPT                                                   00927000
IOSPKY7  EQU   IOSPKEY                                                  00928000
IOSPGDPX EQU   IOSPKEY                                                  00929000
IOSIDR   EQU   IOSPKEY                                                  00930000
IOSLCL   EQU   IOSPKEY                                                  00931000
@NM00024 EQU   IOSPKEY                                                  00932000
IOSPGAD  EQU   IOSB+8                                                   00933000
IOSASID  EQU   IOSB+6                                                   00934000
IOSPRLVL EQU   IOSB+5                                                   00935000
IOSDVRID EQU   IOSB+4                                                   00936000
IOSPROC  EQU   IOSB+3                                                   00937000
IOSFLC7  EQU   IOSFLC                                                   00938000
IOSCTCNR EQU   IOSFLC                                                   00939000
IOSRWAIT EQU   IOSFLC                                                   00940000
IOSTP    EQU   IOSFLC                                                   00941000
IOSCC3WE EQU   IOSFLC                                                   00942000
IOSVERIF EQU   IOSDVALT                                                 00943000
IOSDVMNT EQU   IOSFLC                                                   00944000
IOSLOG   EQU   IOSFLB                                                   00945000
IOSBDCST EQU   IOSFLB                                                   00946000
IOSMSG   EQU   IOSFLB                                                   00947000
IOSFLB4  EQU   IOSFLB                                                   00948000
IOSFLB3  EQU   IOSFLB                                                   00949000
IOSNOTRS EQU   IOSFLB                                                   00950000
IOSSDR   EQU   IOSFLB                                                   00951000
IOSIOSB  EQU   IOSFLA                                                   00952000
IOSDOM   EQU   IOSFLA                                                   00953000
IOSEX    EQU   IOSFLA                                                   00954000
IOSSMDB  EQU   IOSFLA                                                   00955000
IOSSMDA  EQU   IOSFLA                                                   00956000
IOSERR   EQU   IOSFLA                                                   00957000
IOSCCHN  EQU   IOSACHN                                                  00958000
IOSDCHN  EQU   IOSACHN                                                  00959000
IOMUFLD  EQU   IDAIOMB+120                                              00960000
IOMNXT1  EQU   IDAIOMB+116                                              00961000
IOMSAVEF EQU   IOMSAVER+60                                              00962000
IOMSAVEE EQU   IOMSAVER+56                                              00963000
IOMSAVED EQU   IOMSAVER+52                                              00964000
IOMSAVEC EQU   IOMSAVER+48                                              00965000
IOMSAVEB EQU   IOMSAVER+44                                              00966000
IOMSAVEA EQU   IOMSAVER+40                                              00967000
IOMSAVE9 EQU   IOMSAVER+36                                              00968000
IOMSAVE8 EQU   IOMSAVER+32                                              00969000
IOMSAVE7 EQU   IOMSAVER+28                                              00970000
IOMSAVE6 EQU   IOMSAVER+24                                              00971000
IOMSAVE5 EQU   IOMSAVER+20                                              00972000
IOMSAVE4 EQU   IOMSAVER+16                                              00973000
IOMSAVE3 EQU   IOMSAVER+12                                              00974000
IOMSAVE2 EQU   IOMSAVER+8                                               00975000
IOMSAVE1 EQU   IOMSAVER+4                                               00976000
IOMSAVE0 EQU   IOMSAVER                                                 00977000
IOMNSEG  EQU   IDAIOMB+50                                               00978000
IOMNBUF  EQU   IDAIOMB+48                                               00979000
IOMNMOD  EQU   IDAIOMB+46                                               00980000
IOMLOCK  EQU   IDAIOMB+45                                               00981000
IOMPFERR EQU   IDAIOMB+44                                               00982000
IOMCKEY  EQU   IDAIOMB+43                                               00983000
@NM00023 EQU   IOMSTIND                                                 00984000
IOMSLOC  EQU   IOMSTIND                                                 00985000
IOMLLOCK EQU   IOMSTIND                                                 00986000
IOMEOVXC EQU   IOMSTIND                                                 00987000
IOMEOVTS EQU   IOMSTIND                                                 00988000
IOMEOVW  EQU   IOMSTIND                                                 00989000
IOMAMUSE EQU   IOMSTIND                                                 00990000
@NM00022 EQU   IOMFL+1                                                  00991000
IOMIRBSW EQU   IOMFL+1                                                  00992000
IOMEEXIT EQU   IOMFL+1                                                  00993000
@NM00021 EQU   IOMFL+1                                                  00994000
IOMCPRB  EQU   IOMFL+1                                                  00995000
IOMDDR   EQU   IOMFL+1                                                  00996000
IOMCSW   EQU   IOMFL                                                    00997000
IOMPGFIX EQU   IOMFL                                                    00998000
IOMADERR EQU   IOMFL                                                    00999000
IOMCBERR EQU   IOMFL                                                    01000000
@NM00020 EQU   IOMFL                                                    01001000
IOMPURGE EQU   IOMFL                                                    01002000
IOMAE    EQU   IOMAPEND                                                 01003000
IOMNE    EQU   IOMAPEND                                                 01004000
IOMIOSB  EQU   IDAIOMB+36                                               01005000
IOMVSL   EQU   IDAIOMB+28                                               01006000
IOMIQE   EQU   IDAIOMB+20                                               01007000
IOMPLH   EQU   IDAIOMB+12                                               01008000
IOMCPA   EQU   IDAIOMB+8                                                01009000
IOMBUFC  EQU   IDAIOMB+4                                                01010000
IOMBID   EQU   IDAIOMB                                                  01011000
AMBTRACE EQU   IDAAMB+120                                               01012000
AMBVIOT  EQU   IDAAMB+116                                               01013000
AMBSZCP  EQU   IDAAMB+114                                               01014000
AMBSZFW  EQU   IDAAMB+112                                               01015000
AMBSZWR  EQU   IDAAMB+110                                               01016000
AMBSZRD  EQU   IDAAMB+108                                               01017000
AMBEXEX  EQU   IDAAMB+100                                               01018000
AMBWSHD  EQU   IDAAMB+96                                                01019000
AMBCPA   EQU   IDAAMB+92                                                01020000
AMBBM2SH EQU   IDAAMB+88                                                01021000
AMBRDCNT EQU   AMBCSWD1+2                                               01022000
@NM00019 EQU   AMBCSWD1+1                                               01023000
@NM00018 EQU   AMBAFLG                                                  01024000
AMBCFX   EQU   AMBAFLG                                                  01025000
AMBSIS   EQU   AMBAFLG                                                  01026000
AMBDFR   EQU   AMBAFLG                                                  01027000
AMBICI   EQU   AMBAFLG                                                  01028000
AMBGSR   EQU   AMBAFLG                                                  01029000
AMBLSR   EQU   AMBAFLG                                                  01030000
@NM00017 EQU   AMBAFLG                                                  01031000
AMBUPLH  EQU   IDAAMB+80                                                01032000
AMBPIXP  EQU   IDAAMB+72                                                01033000
@NM00016 EQU   IDAAMB+68                                                01034000
AMBIWA   EQU   IDAAMB+64                                                01035000
AMBWKA   EQU   IDAAMB+60                                                01036000
AMBAMBXN EQU   AMBEOVPT                                                 01037000
AMBEDB   EQU   IDAAMB+52                                                01038000
AMBRPT   EQU   IDAAMB+50                                                01039000
AMBPUG   EQU   AMBFLG2                                                  01040000
AMBBUSY  EQU   AMBOFLGS                                                 01041000
AMBEXFG  EQU   AMBOFLGS                                                 01042000
@NM00015 EQU   AMBOFLGS                                                 01043000
AMBOPEN  EQU   AMBOFLGS                                                 01044000
@NM00014 EQU   AMBOFLGS                                                 01045000
AMBDEBAD EQU   AMBDEBPT+1                                               01046000
AMBIFLGS EQU   AMBDEBPT                                                 01047000
AMBAMETH EQU   IDAAMB+43                                                01048000
AMBUPX   EQU   AMBINFL                                                  01049000
AMBUCRA  EQU   AMBINFL                                                  01050000
AMBSCRA  EQU   AMBINFL                                                  01051000
AMBCAT   EQU   AMBINFL                                                  01052000
@NM00013 EQU   AMBINFL                                                  01053000
@NM00012 EQU   AMBINFL                                                  01054000
AMBTIOT  EQU   IDAAMB+40                                                01055000
@NM00011 EQU   IDAAMB+38                                                01056000
AMBDDSN  EQU   IDAAMB+35                                                01057000
AMBCDSN  EQU   IDAAMB+32                                                01058000
AMBIOMB  EQU   AMBIOBAD                                                 01059000
@NM00010 EQU   AMBDSORG+1                                               01060000
AMBDORGA EQU   AMBDSORG+1                                               01061000
@NM00009 EQU   AMBDSORG                                                 01062000
AMBINBUF EQU   AMBFLG1                                                  01063000
AMBJRN   EQU   AMBFLG1                                                  01064000
AMBUBF   EQU   AMBFLG1                                                  01065000
AMBSPEED EQU   AMBFLG1                                                  01066000
AMBPCAT  EQU   AMBFLG1                                                  01067000
AMBMCAT  EQU   AMBFLG1                                                  01068000
AMBTYPE  EQU   AMBFLG1                                                  01069000
AMBCREAT EQU   AMBFLG1                                                  01070000
@NM00008 EQU   AMBFLG0                                                  01071000
AMBPSDS  EQU   AMBFLG0                                                  01072000
AMBDSB   EQU   IDAAMB+20                                                01073000
AMBCACB  EQU   IDAAMB+16                                                01074000
AMBPH    EQU   IDAAMB+12                                                01075000
AMBBUFC  EQU   IDAAMB+8                                                 01076000
AMBLINK  EQU   IDAAMB+4                                                 01077000
AMBLEN   EQU   IDAAMB+2                                                 01078000
AMBRSC   EQU   IDAAMB+1                                                 01079000
AMBID    EQU   IDAAMB                                                   01080000
AMBLCMB  EQU   IDAAMBL+64                                               01081000
AMBLBIB  EQU   IDAAMBL+60                                               01082000
AMBLIX   EQU   IDAAMBL+56                                               01083000
AMBLDTA  EQU   IDAAMBL+52                                               01084000
AMBLMIDS EQU   IDAAMBL+42                                               01085000
AMBLNIDS EQU   IDAAMBL+41                                               01086000
@NM00007 EQU   IDAAMBL+40                                               01087000
AMBLNUM  EQU   IDAAMBL+38                                               01088000
AMBLNST  EQU   IDAAMBL+37                                               01089000
@NM00006 EQU   AMBLFLG2                                                 01090000
AMBLSTAG EQU   AMBLFLG2                                                 01091000
@NM00005 EQU   AMBLFLG2                                                 01092000
AMBLDUMY EQU   AMBLFLG1                                                 01093000
AMBLCAT  EQU   AMBLFLG1                                                 01094000
AMBLUCRA EQU   AMBLFLG1                                                 01095000
AMBLSCRA EQU   AMBLFLG1                                                 01096000
AMBLVVIC EQU   AMBLFLG1                                                 01097000
AMBLUPD  EQU   AMBLFLG1                                                 01098000
AMBLCINV EQU   AMBLFLG1                                                 01099000
AMBLFULL EQU   AMBLFLG1                                                 01100000
AMBLLEN  EQU   IDAAMBL+34                                               01101000
@NM00004 EQU   AMBLSHAR                                                 01102000
AMBLWRIT EQU   AMBLSHAR                                                 01103000
AMBLCATO EQU   AMBLSHAR                                                 01104000
AMBLPRIM EQU   AMBLSHAR                                                 01105000
AMBLID   EQU   IDAAMBL+32                                               01106000
@NM00003 EQU   IDAAMBL+31                                               01107000
@NM00002 EQU   AMBLTYPE                                                 01108000
AMBLFIX  EQU   AMBLTYPE                                                 01109000
AMBLBASE EQU   AMBLTYPE                                                 01110000
AMBLAIX  EQU   AMBLTYPE                                                 01111000
AMBLUPGR EQU   AMBLTYPE                                                 01112000
AMBLPATH EQU   AMBLTYPE                                                 01113000
AMBLENO  EQU   AMBLVC+1                                                 01114000
AMBLVRT  EQU   AMBLVC                                                   01115000
AMBLXPT  EQU   IDAAMBL+24                                               01116000
AMBLDFR  EQU   AMBLQ                                                    01117000
AMBLESDS EQU   AMBLQ                                                    01118000
AMBLKSDS EQU   AMBLQ                                                    01119000
AMBLUBF  EQU   AMBLQ                                                    01120000
AMBLFSTP EQU   AMBLQ                                                    01121000
AMBLLSR  EQU   AMBLQ                                                    01122000
AMBLGSR  EQU   AMBLQ                                                    01123000
AMBLDDC  EQU   AMBLQ                                                    01124000
AMBLDCI  EQU   AMBLIDF+4                                                01125000
AMBLCACB EQU   AMBLIDF                                                  01126000
@NM00001 EQU   AMBLEOV+2                                                01127000
AMBLCOMP EQU   AMBLEOV+1                                                01128000
AMBLESET EQU   AMBLEFLG                                                 01129000
AMBLWAIT EQU   AMBLEFLG                                                 01130000
AMBLACB  EQU   IDAAMBL+8                                                01131000
AMBLSCHN EQU   IDAAMBL+4                                                01132000
AMBLPCHN EQU   IDAAMBL                                                  01133000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01134000
@RT00088 EQU   @EL00001                                                 01135000
@RF00090 EQU   @EL00001                                                 01136000
@ENDDATA EQU   *                                                        01137000
         END   IDA019S4,(C'PLS1344',0701,78173)                         01138000
