         TITLE 'IDAIISM1--MVM ISAM INTERFACE SYNAD                     *00001000
                        '                                               00002000
IDAIISM1 CSECT                                                          00003000
         USING *,R15                    ESTABLISH ADDRESSABILITY        00004000
@PSTART  B     ERRXLATE                 GO TO ERROR TRANSLATION         00005000
         USING *,R15                    NEW ADDRESSABILITY              00006000
         B     MSGBUILD                 GO TO ERROR MESSAGE BUILD       00007000
ERRXLATE LR    R11,R15                  RE-ESTABLISH ADDRESSABILITY     00008000
         USING @PSTART,R11              USING REGISTER 11               00009000
         DROP  R15                      RELEASE REGISTER 15             00010000
*   RRPL=R1;                        /* ESTABLISH RPL BASE            */ 00011000
         LR    RRPL,R1                                             0183 00012000
*   RFY                                                            0184 00013000
*     IFGRPL BASED(RRPL);           /* GET RPL ADDRESS               */ 00014000
*   RIICB=RPLIICB;                  /* POINT TO IICB                 */ 00015000
         L     RIICB,RPLIICB+76(,RRPL)                             0185 00016000
*   RDCB=IIDCBPTR;                  /* POINT TO DCB                  */ 00017000
         L     RDCB,IIDCBPTR(,RIICB)                               0186 00018000
*   RFY                                                            0187 00019000
*     IHADCB BASED(RDCB);           /* SET DCB BASE                  */ 00020000
*                                                                  0187 00021000
*   /*****************************************************************/ 00022000
*   /*                                                               */ 00023000
*   /* DETERMINE WHETHER DCB SPECIFIES QISAM OR BISAM.               */ 00024000
*   /*                                                               */ 00025000
*   /*****************************************************************/ 00026000
*                                                                  0188 00027000
*   IF DCBMFPUT=ON|                 /* IF DCB SPECIFIES GET          */ 00028000
*       DCBMFGET=ON THEN            /* OR PUT, MAP ERRORS TO         */ 00029000
         LA    @15,40                                              0188 00030000
         ALR   @15,RDCB                                            0188 00031000
         TM    DCBMFPUT(@15),B'01000000'                           0188 00032000
         BO    @RT00188                                            0188 00033000
         TM    DCBMFGET(@15),B'01000000'                           0188 00034000
         BNO   @RF00188                                            0188 00035000
@RT00188 DS    0H                                                  0189 00036000
*     DO;                           /* THE DCB.                      */ 00037000
*                                                                  0189 00038000
*       /*************************************************************/ 00039000
*       /*                                                           */ 00040000
*       /* IF QISAM, MAP VSAM ERRORS TO THE DCB.                     */ 00041000
*       /*                                                           */ 00042000
*       /*************************************************************/ 00043000
*                                                                  0190 00044000
*       IF RPLERREG='0C'X THEN      /* IF I/O ERROR, DETERMINE       */ 00045000
         CLI   RPLERREG(RRPL),12                                   0190 00046000
         BNE   @RF00190                                            0190 00047000
*         DO;                       /* WHAT KIND IT WAS              */ 00048000
*                                                                  0191 00049000
*           /*********************************************************/ 00050000
*           /*                                                       */ 00051000
*           /* TRANSLATE VSAM I/O ERRORS TO QISAM I/O ERRORS.        */ 00052000
*           /*                                                       */ 00053000
*           /*********************************************************/ 00054000
*                                                                  0192 00055000
*           IF RPLERRCD>=RPLWTERD THEN/* SEE IF WRITE ERROR          */ 00056000
         CLI   RPLERRCD(RRPL),16                                   0192 00057000
         BL    @RF00192                                            0192 00058000
*             DCBEXOER=ON;          /* YES, COME HERE                */ 00059000
         OI    DCBEXOER+52(RDCB),B'00000100'                       0193 00060000
*           ELSE                                                   0194 00061000
*             DCBEXIER=ON;          /* NO--SET READ ERROR            */ 00062000
         B     @RC00192                                            0194 00063000
@RF00192 OI    DCBEXIER+52(RDCB),B'00001000'                       0194 00064000
*         END;                      /* END QISAM I/O ERROR           */ 00065000
*       ELSE                        /* HERE IF LOGICAL ERROR         */ 00066000
*         IF RPLERREG='08'X THEN    /* MAP LOGICAL ERROR             */ 00067000
         B     @RC00190                                            0196 00068000
@RF00190 CLI   RPLERREG(RRPL),8                                    0196 00069000
         BNE   @RF00196                                            0196 00070000
*           DO;                                                    0197 00071000
*                                                                  0198 00072000
*             /*******************************************************/ 00073000
*             /*                                                     */ 00074000
*             /* TRANSLATE VSAM LOGICAL ERRORS TO QISAM LOGICAL      */ 00075000
*             /* ERRORS                                              */ 00076000
*             /*                                                     */ 00077000
*             /*******************************************************/ 00078000
*                                                                  0198 00079000
*             IF DCBEXCD1=CZERO THEN/* IF EXCD NOT SET BY II SCAN    */ 00080000
         LA    @15,52                                              0198 00081000
         ALR   @15,RDCB                                            0198 00082000
         CLI   DCBEXCD1(@15),B'00000000'                           0198 00083000
         BNE   @RF00198                                            0198 00084000
*               DO;                 /* CONVERT NO RECORD FOUND       */ 00085000
*                 IF RPLERRCD=RPLNOREC THEN                        0200 00086000
         CLI   RPLERRCD(RRPL),16                                   0200 00087000
         BNE   @RF00200                                            0200 00088000
*                   DO;             /* TO ISAM NO RECORD FOUND       */ 00089000
*                     DCBEXNKY=ON;  /* SET NO REC FOUND IN DCB IF  0202 00090000
*                                      RESUME LOAD                   */ 00091000
         OI    DCBEXNKY(@15),B'10000000'                           0202 00092000
*                     IF DCBSTLOD=ON THEN                          0203 00093000
         TM    DCBSTLOD(@15),B'00100000'                           0203 00094000
         BO    @RT00203                                            0203 00095000
*                       GO TO EXIT; /* RETURN TO II LOAD             */ 00096000
*                   END;            /* END OF NO RECORD FOUND        */ 00097000
*                 ELSE              /* IF NOT NO RECORD ROUND, IF  0206 00098000
*                                      VOLUME NOT MOUNTED            */ 00099000
*                   IF RPLERRCD=RPLNOMNT THEN                      0206 00100000
         B     @RC00200                                            0206 00101000
@RF00200 CLI   RPLERRCD(RRPL),24                                   0206 00102000
         BNE   @RF00206                                            0206 00103000
*                     DCBEXNKY=ON;  /* SET NO REC FOUND IN DCB       */ 00104000
         OI    DCBEXNKY+52(RDCB),B'10000000'                       0207 00105000
*                   ELSE            /* NOT NO RECORD FOUND TRANSLATE    00106000
*                                      VSAM                          */ 00107000
*                     IF RPLERRCD=RPLSEQCK THEN                    0208 00108000
         B     @RC00206                                            0208 00109000
@RF00206 CLI   RPLERRCD(RRPL),12                                   0208 00110000
         BNE   @RF00208                                            0208 00111000
*                       DCBEXSEQ=ON;/* SEQ CHECK TO ISAM             */ 00112000
         OI    DCBEXSEQ+52(RDCB),B'10000000'                       0209 00113000
*                     ELSE          /* VSAM DUPLICATE RECORD         */ 00114000
*                       IF RPLERRCD=RPLDUP THEN                    0210 00115000
         B     @RC00208                                            0210 00116000
@RF00208 CLI   RPLERRCD(RRPL),8                                    0210 00117000
         BNE   @RF00210                                            0210 00118000
*                         DCBEXDUP=ON;/* IS ISAM DUP RECORD          */ 00119000
         OI    DCBEXDUP+52(RDCB),B'01000000'                       0211 00120000
*                       ELSE        /*                               */ 00121000
*                         IF RPLERRCD=RPLEODER THEN/*        @OZ02676*/ 00122000
         B     @RC00210                                            0212 00123000
@RF00210 CLI   RPLERRCD(RRPL),4                                    0212 00124000
         BNE   @RF00212                                            0212 00125000
*                           DO;     /* CALL II EODAD         @OZ02676*/ 00126000
*                             RFY                                  0214 00127000
*                               R15 RSTD;/* GET REG          @OZ02676*/ 00128000
*                             RFY                                  0215 00129000
*                               IFGACB BASED(IIACBPTR);/* PTR      0215 00130000
*                                                            @OZ02676*/ 00131000
*                             RFY                                  0216 00132000
*                               IFGEXLST BASED(ACBEXLST);/* PT     0216 00133000
*                                                            @OZ02676*/ 00134000
*                             R15=EXLEODP;/* POINT TO EXLST  @OZ02676*/ 00135000
         L     @12,IIACBPTR(,RIICB)                                0217 00136000
         L     @12,ACBEXLST(,@12)                                  0217 00137000
         ICM   R15,15,EXLEODP(@12)                                 0217 00138000
*                             R1=RRPL;/* POINT TO RPL        @OZ02676*/ 00139000
         LR    R1,RRPL                                             0218 00140000
*                             GEN(BR 15);/* EXIT TO EODAD    @OZ02676*/ 00141000
         BR 15                                                          00142000
*                           END;    /* END EODAD CALL        @OZ02676*/ 00143000
*                         ELSE      /* TRY ANOTHER           @OZ02676   00144000
*                                      CALL READ EXCLUSIVE OR        */ 00145000
*                           IF RPLERRCD=RPLEXCL|/* REQUEST AFTER EOD    00146000
*                                      OR                            */ 00147000
*                               RPLERRCD=RPLNOKR|/* OR KEY CHANGE TRY   00148000
*                                      A                             */ 00149000
*                               RPLERRCD=RPLKEYCH THEN             0221 00150000
         B     @RC00212                                            0221 00151000
@RF00212 CLI   RPLERRCD(RRPL),20                                   0221 00152000
         BE    @RT00221                                            0221 00153000
         CLI   RPLERRCD(RRPL),36                                   0221 00154000
         BE    @RT00221                                            0221 00155000
         CLI   RPLERRCD(RRPL),96                                   0221 00156000
         BNE   @RF00221                                            0221 00157000
@RT00221 DS    0H                                                  0222 00158000
*                             DCBEXINV=ON;/* CERTAIN USER ERROR      */ 00159000
         OI    DCBEXINV+52(RDCB),B'00010000'                       0222 00160000
*                           ELSE    /* SPACE ERROR IN VSAM           */ 00161000
*                             IF RPLERRCD=RPLNOEXT|/* (DASD OR MAIN) */ 00162000
*                                 RPLERRCD=RPLNOVRT THEN           0223 00163000
         B     @RC00221                                            0223 00164000
@RF00221 CLI   RPLERRCD(RRPL),28                                   0223 00165000
         BE    @RT00223                                            0223 00166000
         CLI   RPLERRCD(RRPL),40                                   0223 00167000
         BNE   @RF00223                                            0223 00168000
@RT00223 DS    0H                                                  0224 00169000
*                               DCBEXNSP=ON;/* SAME AS FOR ISAM      */ 00170000
         OI    DCBEXNSP+52(RDCB),B'00100000'                       0224 00171000
*                             ELSE  /* TRANSLATE INVALID             */ 00172000
*                               IF RPLERRCD=RPLINLEN THEN          0225 00173000
         B     @RC00223                                            0225 00174000
@RF00223 CLI   RPLERRCD(RRPL),108                                  0225 00175000
         BNE   @RF00225                                            0225 00176000
*                                 DCBEXLTH=ON;/* LENGTH              */ 00177000
         OI    DCBEXLTH+52(RDCB),B'00001000'                       0226 00178000
*                               ELSE/* IF NONE OF THE ABOVE,         */ 00179000
*                                 DO;/* INDICATE UNKNOWN ERROR     0227 00180000
*                                      UNREACHABLE BLOCK             */ 00181000
         B     @RC00225                                            0227 00182000
@RF00225 DS    0H                                                  0228 00183000
*                                   DCBEXBLI=ON;/* ON INPUT/UPDATE   */ 00184000
*                                   DCBEXBLU=ON;                   0229 00185000
         OI    DCBEXBLI+52(RDCB),B'00000011'                       0229 00186000
*                                 END;/* END OF UNKNOWN ERROR        */ 00187000
*               END;                /* END OF LOGICAL ERROR MAP      */ 00188000
*             ELSE                                                 0232 00189000
*               ;                   /* EXCD ALREADY SET              */ 00190000
@RF00198 DS    0H                                                  0233 00191000
*           END;                    /* END OF LOGICAL ERROR          */ 00192000
@RC00198 DS    0H                                                  0234 00193000
*                                                                  0234 00194000
*       /*************************************************************/ 00195000
*       /*                                                           */ 00196000
*       /* TEST FOR THE PRESENCE OF A QISAM SYNAD.                   */ 00197000
*       /*                                                           */ 00198000
*       /*************************************************************/ 00199000
*                                                                  0234 00200000
*       IF DCBSYNAD^=ONE THEN       /* IF A SYNAD IS PRESENT,        */ 00201000
@RF00196 DS    0H                                                  0234 00202000
@RC00190 LA    @12,52                                              0234 00203000
         ALR   @12,RDCB                                            0234 00204000
         CLC   DCBSYNAD(4,@12),@CF00087                            0234 00205000
         BE    @RF00234                                            0234 00206000
*         DO;                       /* GO TO IT.                     */ 00207000
*                                                                  0235 00208000
*           /*********************************************************/ 00209000
*           /*                                                       */ 00210000
*           /* IF CLOSE IS IN CONTROL, RETURN IF SECOND SYNAD ENTRY. */ 00211000
*           /* OTHERWISE, GET THE USER REGISTERS FROM THE SVRB AND GO*/ 00212000
*           /* TO THE SYNAD ROUTINE.                                 */ 00213000
*           /*                                                       */ 00214000
*           /*********************************************************/ 00215000
*                                                                  0236 00216000
*           IF IIFCLOSE=ON THEN     /* IF CLOSE IN CONTROL           */ 00217000
         TM    IIFCLOSE(RIICB),B'00010000'                         0236 00218000
         BNO   @RF00236                                            0236 00219000
*             DO;                   /* COME HERE.                    */ 00220000
*               IF DCBEXCLD=ON THEN /* WAS SYNAD ENTERED             */ 00221000
         TM    DCBEXCLD(@12),B'00100000'                           0238 00222000
         BO    @RT00238                                            0238 00223000
*                 GO TO EXIT;       /* BEFORE? YES, EXIT.            */ 00224000
*               ELSE                /* FIRST TIME CLOSE ERROR        */ 00225000
*                 DO;                                              0240 00226000
*                   R14=RWORK3;     /* GET CLOSE RET ADDR            */ 00227000
         LR    R14,RWORK3                                          0241 00228000
*                   RFY                                            0242 00229000
*                     RWORK3 UNRSTD;/* RELEASE WORK REG              */ 00230000
*                   DCBEXCLD=ON;    /* INDICATE ERROR IN CLOSE       */ 00231000
         OI    DCBEXCLD(@12),B'00100000'                           0243 00232000
*                   RFY                                            0244 00233000
*                     R0 RESTRICTED;/* GET REGISTER                  */ 00234000
*                   IF DCBEXSEQ=ON THEN/* SEQUENCE CHK ERROR?        */ 00235000
         TM    DCBEXSEQ(@12),B'10000000'                           0245 00236000
         BNO   @RF00245                                            0245 00237000
*                     R0=ADDR(PLHKEY);/* SET HIGH KEY PTR            */ 00238000
         L     @12,RPLPLHPT(,RRPL)                                 0246 00239000
         LA    R0,PLHKEY(,@12)                                     0246 00240000
*                   ELSE                                           0247 00241000
*                     R0=ZERO;      /* NO BUFFER ADDR                */ 00242000
         B     @RC00245                                            0247 00243000
@RF00245 SLR   R0,R0                                               0247 00244000
*                   RFY                                            0248 00245000
*                     R15 RESTRICTED;/* GET REGISTER                 */ 00246000
@RC00245 DS    0H                                                  0249 00247000
*                   R15=ADDR(IHADCB);/* SAVE DCB ADDRESS             */ 00248000
         LR    R15,RDCB                                            0249 00249000
*                   RFY                                            0250 00250000
*                     IHADCB BASED(R15);/* CHANGE DCB BASE           */ 00251000
*                   RRPL=TCBRBP;    /* POINT TO SYNCH SVRB           */ 00252000
         L     @12,DCBDEBAD+40(,R15)                               0251 00253000
         L     @12,TCBPTR(,@12)                                    0251 00254000
         L     RRPL,TCBRBP(,@12)                                   0251 00255000
*                   RRPL=SVRBLINK;  /* POINT TO CLOSE SVRB           */ 00256000
         L     @12,SVRBLINK-1(,RRPL)                               0252 00257000
         LA    @12,0(,@12)                                         0252 00258000
         LR    RRPL,@12                                            0252 00259000
*                   IF AUDACBCL=ON&AUDACBRC=OFF THEN               0253 00260000
         TM    AUDACBCL(RIICB),B'01000000'                         0253 00261000
         BNO   @RF00253                                            0253 00262000
         TM    AUDACBRC(RIICB),B'00100000'                         0253 00263000
         BNZ   @RF00253                                            0253 00264000
*                     RRPL=SVRBLINK;/* USE FIRST CLOSE SVRB IF IN  0254 00265000
*                                      PROCESS OF ACB CLOSE  @YM04657*/ 00266000
         L     @12,SVRBLINK-1(,RRPL)                               0254 00267000
         LA    @12,0(,@12)                                         0254 00268000
         LR    RRPL,@12                                            0254 00269000
*                   IF IISAMSYN(ONE)=CZERO THEN/* IF SYNAD NOT LOADED*/ 00270000
@RF00253 CLI   IISAMSYN(RIICB),B'00000000'                         0255 00271000
         BNE   @RF00255                                            0255 00272000
*                     R1=ZERO;      /* ZERO R1                       */ 00273000
         SLR   R1,R1                                               0256 00274000
*                   ELSE                                           0257 00275000
*                     R1=R15;       /* OTHERWISE, DCB ADDR           */ 00276000
*                                                                  0257 00277000
         B     @RC00255                                            0257 00278000
@RF00255 LR    R1,R15                                              0257 00279000
*                   /*************************************************/ 00280000
*                   /*                                               */ 00281000
*                   /* RESTORE USER REGISTERS FROM THE CLOSE SVRB    */ 00282000
*                   /*                                               */ 00283000
*                   /*************************************************/ 00284000
*                                                                  0258 00285000
*                   GEN REFS(SVRBREG2)(LM    R2,R13,SVRBREG2(RRPL));    00286000
@RC00255 DS    0H                                                  0258 00287000
         LM    R2,R13,SVRBREG2(RRPL)                                    00288000
*                   R15=DCBSYNAD;   /* POINT TO SYNAD ROUTINE        */ 00289000
         L     @12,DCBSYNAD+52(,R15)                               0259 00290000
         LR    R15,@12                                             0259 00291000
*                   GO TO SYNAD;    /* TAKE SYNAD EXIT               */ 00292000
         BR    R15                                                 0260 00293000
*                 END;              /* END OF CLOSE SYNAD EXIT       */ 00294000
*             END;                  /* END OF CLOSE CODE             */ 00295000
*                                                                  0263 00296000
*           /*********************************************************/ 00297000
*           /*                                                       */ 00298000
*           /* IF CLOSE IS NOT IN CONTROL, RESTORE REGISTERS FROM THE*/ 00299000
*           /* USER SAVEAREA AND GO TO THE SYNAD ROUTINE.            */ 00300000
*           /*                                                       */ 00301000
*           /*********************************************************/ 00302000
*                                                                  0263 00303000
*           ELSE                    /* HERE IF NOT CLOSE             */ 00304000
*             DO;                                                  0263 00305000
@RF00236 DS    0H                                                  0264 00306000
*               RFY                                                0264 00307000
*                 IHADCB BASED(RDCB);/* RESET DCB BASE               */ 00308000
*               IF DCBEXSEQ=ON THEN /* SEQUENCE CHK ERROR?           */ 00309000
         TM    DCBEXSEQ+52(RDCB),B'10000000'                       0265 00310000
         BNO   @RF00265                                            0265 00311000
*                 R0=ADDR(PLHKEY);  /* SET HIGH KEY PTR              */ 00312000
         L     @12,RPLPLHPT(,RRPL)                                 0266 00313000
         LA    R0,PLHKEY(,@12)                                     0266 00314000
*               ELSE                                               0267 00315000
*                 R0=ZERO;          /* NO BUFFER ADDR                */ 00316000
         B     @RC00265                                            0267 00317000
@RF00265 SLR   R0,R0                                               0267 00318000
*               R13=IIREGBC;        /* POINT TO USER SAVEAREA        */ 00319000
@RC00265 L     R13,IIREGBC(,RIICB)                                 0268 00320000
*               R14=R14SAVE;        /* GET USER RETURN REG           */ 00321000
         L     R14,R14SAVE(,R13)                                   0269 00322000
*               R15=DCBSYNAD;       /* POINT TO SYNAD ROUTINE        */ 00323000
         L     R15,DCBSYNAD+52(,RDCB)                              0270 00324000
*               IF IISAMSYN(ONE)=CZERO THEN/* IF NOT LOADED SYNAD    */ 00325000
         CLI   IISAMSYN(RIICB),B'00000000'                         0271 00326000
         BNE   @RF00271                                            0271 00327000
*                 R1=ZERO;          /* INDICATE NO BUFFER            */ 00328000
         SLR   R1,R1                                               0272 00329000
*               GEN(LM    R2,R12,TWENTY8(R13));/* SET USER REGS      */ 00330000
@RF00271 DS    0H                                                  0273 00331000
         LM    R2,R12,TWENTY8(R13)                                      00332000
*               GO TO SYNAD;        /* TAKE SYNAD EXIT               */ 00333000
         BR    R15                                                 0274 00334000
*               RFY                                                0275 00335000
*                 R0 UNRSTD;        /* RELEASE REGISTER              */ 00336000
*             END;                  /* END OF NON-CLOSE CODE         */ 00337000
*         END;                      /* END OF SYNAD PRESENT          */ 00338000
*                                                                  0277 00339000
*       /*************************************************************/ 00340000
*       /*                                                           */ 00341000
*       /* IF NO QISAM SYNAD, ISSUE 031 ABEND.                       */ 00342000
*       /*                                                           */ 00343000
*       /*************************************************************/ 00344000
*                                                                  0278 00345000
*       ELSE                        /* HERE IF NO SYNAD              */ 00346000
*         DO;                       /* ABEND(QABCODE) DUMP SYSTEM    */ 00347000
@RF00234 DS    0H                                                  0279 00348000
*           RESPECIFY                                              0279 00349000
*            (GPR01F) RESTRICTED;                                  0279 00350000
*           GPR01F=((QABCODE)&'00000FFF'X)*4096;/* COMP CODE IN BITS    00351000
*                                      8-19                          */ 00352000
         L     GPR01F,@CF02043                                     0280 00353000
*           GPR01F=GPR01F|'80000000'X;/* DUMP/STEP/DUMPOPTS FLAG     */ 00354000
         O     GPR01F,@CF02029                                     0281 00355000
*           SVC(13);                /* ISSUE ABEND SVC               */ 00356000
         SVC   13                                                  0282 00357000
*           RESPECIFY                                              0283 00358000
*            (GPR01F) UNRESTRICTED;                                0283 00359000
*         END;                      /* ABEND(QABCODE) DUMP SYSTEM  0284 00360000
*                                      X'031' - ABEND CODE   @Y021130*/ 00361000
*     END;                          /* END OF QISAM CODE             */ 00362000
*                                                                  0286 00363000
*   /*****************************************************************/ 00364000
*   /*                                                               */ 00365000
*   /* MAP VSAM ERRORS TO THE DECB FOR BISAM.                        */ 00366000
*   /*                                                               */ 00367000
*   /*****************************************************************/ 00368000
*                                                                  0286 00369000
*   ELSE                            /* HERE FOR BISAM                */ 00370000
*     DO;                                                          0286 00371000
         B     @RC00188                                            0286 00372000
@RF00188 DS    0H                                                  0287 00373000
*       RDECB=RPLDECB;              /* POINT TO DECB                 */ 00374000
         L     RDECB,RPLDECB+76(,RRPL)                             0287 00375000
*       RFY                                                        0288 00376000
*         DECBS01 BASED(RDECB);     /* DEFINE DECB BASE      @Y021130*/ 00377000
*       IF RPLERREG='0C'X THEN      /* IF AN I/O ERROR OCUR-         */ 00378000
         CLI   RPLERREG(RRPL),12                                   0289 00379000
         BNE   @RF00289                                            0289 00380000
*         DECEXERR=ON;              /* RED, SET CODE IN DECB         */ 00381000
         OI    DECEXERR(RDECB),B'00001000'                         0290 00382000
*       ELSE                                                       0291 00383000
*         IF RPLERREG='08'X THEN    /* IF LOGICAL ERROR              */ 00384000
         B     @RC00289                                            0291 00385000
@RF00289 CLI   RPLERREG(RRPL),8                                    0291 00386000
         BNE   @RF00291                                            0291 00387000
*           IF RPLERRCD=RPLNOREC|   /* MAP RPL EXCEPTION CODES       */ 00388000
*               RPLERRCD=RPLNOMNT THEN/* TO THE DECB.                */ 00389000
         CLI   RPLERRCD(RRPL),16                                   0292 00390000
         BE    @RT00292                                            0292 00391000
         CLI   RPLERRCD(RRPL),24                                   0292 00392000
         BNE   @RF00292                                            0292 00393000
@RT00292 DS    0H                                                  0293 00394000
*             DECEXRNF=ON;          /* SEE QISAM MAPPING             */ 00395000
         OI    DECEXRNF(RDECB),B'10000000'                         0293 00396000
*           ELSE                    /* ABOVE FOR DETAILS             */ 00397000
*             IF RPLERRCD=RPLDUP THEN/* IF VSAM DUPLICATE RCD        */ 00398000
         B     @RC00292                                            0294 00399000
@RF00292 CLI   RPLERRCD(RRPL),8                                    0294 00400000
         BNE   @RF00294                                            0294 00401000
*               DECEXDUP=ON;        /* DUP RCD EXCD IN DECB          */ 00402000
         OI    DECEXDUP(RDECB),B'00000001'                         0295 00403000
*             ELSE                  /* IF NOT ABLE TO EXTEND DATA SET   00404000
*                                      THEN SET                      */ 00405000
*               IF RPLERRCD=RPLNOEXT THEN                          0296 00406000
         B     @RC00294                                            0296 00407000
@RF00294 CLI   RPLERRCD(RRPL),28                                   0296 00408000
         BNE   @RF00296                                            0296 00409000
*                 DECEXNSP=ON;      /* SPACE NOT FOUND IN DECB       */ 00410000
         OI    DECEXNSP(RDECB),B'00100000'                         0297 00411000
*               ELSE                /* IF VSAM FOUND EXCLUSIVE USE 0298 00412000
*                                      CONFLICT                      */ 00413000
*                 IF RPLERRCD=RPLEXCL|/* NO KEY RANGE FOR INSERT     */ 00414000
*                     RPLERRCD=RPLNOKR|/* OR KEY CHANGE ATTEMPT      */ 00415000
*                     RPLERRCD=RPLKEYCH THEN                       0298 00416000
         B     @RC00296                                            0298 00417000
@RF00296 CLI   RPLERRCD(RRPL),20                                   0298 00418000
         BE    @RT00298                                            0298 00419000
         CLI   RPLERRCD(RRPL),36                                   0298 00420000
         BE    @RT00298                                            0298 00421000
         CLI   RPLERRCD(RRPL),96                                   0298 00422000
         BNE   @RF00298                                            0298 00423000
@RT00298 DS    0H                                                  0299 00424000
*                   DECEXINV=ON;    /* SET DECB INVALID REQ          */ 00425000
         OI    DECEXINV(RDECB),B'00010000'                         0299 00426000
*                 ELSE              /* IF VSAM FOUND INVALID RECORD     00427000
*                                      LENGTH                        */ 00428000
*                   IF RPLERRCD=RPLINLEN THEN                      0300 00429000
         B     @RC00298                                            0300 00430000
@RF00298 CLI   RPLERRCD(RRPL),108                                  0300 00431000
         BNE   @RF00300                                            0300 00432000
*                     DECEXRLC=ON;  /* SET DECB RCD LENGTH CHK       */ 00433000
         OI    DECEXRLC(RDECB),B'01000000'                         0301 00434000
*                   ELSE                                           0302 00435000
*                     DECEXUBK=ON;  /* ELSE UNKNOWN ERROR            */ 00436000
         B     @RC00300                                            0302 00437000
@RF00300 OI    DECEXUBK(RDECB),B'00000100'                         0302 00438000
*EXIT:                                                             0303 00439000
*       R1=RRPL;                    /* RESTORE VSAM REG              */ 00440000
@RC00300 DS    0H                                                  0303 00441000
@RC00298 DS    0H                                                  0303 00442000
@RC00296 DS    0H                                                  0303 00443000
@RC00294 DS    0H                                                  0303 00444000
@RC00292 DS    0H                                                  0303 00445000
@RF00291 DS    0H                                                  0303 00446000
@RC00289 DS    0H                                                  0303 00447000
EXIT     LR    R1,RRPL                                             0303 00448000
*     END;                          /* END OF BISAM CODE             */ 00449000
*   RETURN;                         /* RETURN TO CALLER              */ 00450000
@EL00001 DS    0H                                                  0305 00451000
@EF00001 DS    0H                                                  0305 00452000
@ER00001 BR    @14                                                 0305 00453000
*                                                                  0306 00454000
*/*  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00455000
*/*                                                                  */ 00456000
*/*      ISAM INTERFACE ENTRY FOR SYNADAF PROCESSING                 */ 00457000
*/*                                                                  */ 00458000
*/*      THIS ROUTINE IS ENTERED WHEN THE SYNADAF MACRO IS ISSUED    */ 00459000
*/*      FROM AN ISAM PROGRAM THAT IS BEING PROCESSED BY THE ISAM    */ 00460000
*/*      INTERFACE.  IT WILL CONVERT A VSAM MESSAGE TO THE ISAM      */ 00461000
*/*      MESSAGE FORMAT.                                             */ 00462000
*/*                                                                  */ 00463000
*/*  * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */ 00464000
*                                                                  0306 00465000
*   GEN;                                                           0306 00466000
MSGBUILD STM   R14,R12,TWELVE(R13)     SAVE REGISTERS                   00467000
         BALR  R11,0                   RESET BASE                       00468000
         USING *,R11                   SET ADDRESSABILITY               00469000
*   RFY                                                            0307 00470000
*     R10 RSTD;                     /* GET WORK REGISTER             */ 00471000
*   RFY                                                            0308 00472000
*     IDAERMSG BASED(R1);           /* DEFINE MESSAGE BASE           */ 00473000
*   RRPL=ADDR(IDAERMSG)+LENGTH(IDAERMSG);/* PTR TO SYNADAF PARMS     */ 00474000
         LA    RRPL,128                                            0309 00475000
         ALR   RRPL,R1                                             0309 00476000
*   RFY                                                            0310 00477000
*     SPARMS BASED(RRPL);           /* DEFINE PARAMETER BASE         */ 00478000
*   R2=PARM1;                       /* GET DCB ADDRESS               */ 00479000
         L     R2,PARM1(,RRPL)                                     0311 00480000
*   R10=PARM2;                      /* GET DECB ADDRESS              */ 00481000
         L     R10,PARM2-1(,RRPL)                                  0312 00482000
         LA    R10,0(,R10)                                         0312 00483000
*   RFY                                                            0313 00484000
*     IHADCB BASED(R2);             /* CHANGE DCB BASE               */ 00485000
*   RFY                                                            0314 00486000
*     DECBS01 BASED(R10);           /* DEFINE DECB BASE      @Y021130*/ 00487000
*   RFY                                                            0315 00488000
*     IDAIICB BASED(DEBWKPT5);      /* DEFINE IICB BASE              */ 00489000
*                                                                  0316 00490000
*   /*****************************************************************/ 00491000
*   /*                                                               */ 00492000
*   /* IF AN I/O ERROR OCCURRED, LOCATE THE VSAM RPL. (FOR BISAM, THE*/ 00493000
*   /* RPL MAY HAVE BEEN REUSED SINCE THE ERROR WAS ORIGINALLY       */ 00494000
*   /* DETECTED.)                                                    */ 00495000
*   /*                                                               */ 00496000
*   /*****************************************************************/ 00497000
*                                                                  0316 00498000
*   RRPL=ZERO;                      /* INDICATE NO VSAM MSG.         */ 00499000
         SLR   RRPL,RRPL                                           0316 00500000
*   IF DCBMFPUT=ON|                 /* IF DCB SPECIFIES QISAM,       */ 00501000
*       DCBMFGET=ON THEN            /* THE EXCEPTION CODES ARE       */ 00502000
         LA    @12,40                                              0317 00503000
         ALR   @12,R2                                              0317 00504000
         TM    DCBMFPUT(@12),B'01000000'                           0317 00505000
         BO    @RT00317                                            0317 00506000
         TM    DCBMFGET(@12),B'01000000'                           0317 00507000
         BNO   @RF00317                                            0317 00508000
@RT00317 DS    0H                                                  0318 00509000
*     DO;                           /* SET IN THE DCB.               */ 00510000
*       IF DCBEXOER=ON|             /* IF AN I/O ERROR HAS           */ 00511000
*           DCBEXIER=ON THEN        /* OCCURRED, A VSAM ERROR        */ 00512000
         TM    DCBEXOER+52(R2),B'00001100'                         0319 00513000
         BZ    @RF00319                                            0319 00514000
*         RRPL=IIRPLPTR;            /* MESSAGE IS PRESENT.           */ 00515000
         L     @12,DCBDEBAD+40(,R2)                                0320 00516000
         L     @12,DEBEXPT(,@12)                                   0320 00517000
         L     @12,DEBWKPT5(,@12)                                  0320 00518000
         L     RRPL,IIRPLPTR(,@12)                                 0320 00519000
*     END;                          /* END OF QISAM CODE             */ 00520000
*   ELSE                            /* HERE FOR BISAM                */ 00521000
*     DO;                           /* IF AN I/O ERROR HAS           */ 00522000
         B     @RC00317                                            0322 00523000
@RF00317 DS    0H                                                  0323 00524000
*       IF DECEXERR=ON THEN         /* OCCURRED, A VSAM MSG IS       */ 00525000
         TM    DECEXERR(R10),B'00001000'                           0323 00526000
         BNO   @RF00323                                            0323 00527000
*         DO;                       /* PRESENT IF RPL NOT YET        */ 00528000
*           RRPL=IIRPLPTR;          /* REASSIGNED TO NEW DECB.       */ 00529000
         L     @12,DCBDEBAD+40(,R2)                                0325 00530000
         L     @12,DEBEXPT(,@12)                                   0325 00531000
         L     @12,DEBWKPT5(,@12)                                  0325 00532000
         L     RRPL,IIRPLPTR(,@12)                                 0325 00533000
*           DO WHILE RRPL^=ZERO&    /* SEARCH FOR AN RPL UNTIL       */ 00534000
*                 RPLDECB^=ADDR(DECBS01);/* END OF CHAIN OR UNTIL  0326 00535000
*                                                            @Y021130*/ 00536000
         B     @DE00326                                            0326 00537000
@DL00326 DS    0H                                                  0327 00538000
*             RRPL=RPLRPLPT;        /* AN RPL IS FOUND.              */ 00539000
         L     @12,RPLRPLPT+76(,RRPL)                              0327 00540000
         LR    RRPL,@12                                            0327 00541000
*           END;                    /* END OF RPL SEARCH             */ 00542000
@DE00326 LTR   RRPL,RRPL                                           0328 00543000
         BZ    @DC00326                                            0328 00544000
         C     R10,RPLDECB+76(,RRPL)                               0328 00545000
         BNE   @DL00326                                            0328 00546000
@DC00326 DS    0H                                                  0329 00547000
*           IF RRPL^=ZERO THEN      /* IF AN RPL WAS FOUND,          */ 00548000
         LTR   RRPL,RRPL                                           0329 00549000
         BZ    @RF00329                                            0329 00550000
*             DO;                   /* ACQUIRE CONTROL OF IT.        */ 00551000
*               TS(RPLIITSB);       /* IS RPL AVAILABLE?             */ 00552000
         TS    RPLIITSB+76(RRPL)                                   0331 00553000
*               BC(8,RPLAVL);       /* YES, BRANCH.                  */ 00554000
         BC    8,RPLAVL                                            0332 00555000
*               RRPL=ZERO;          /* NO--SET NO RPL PRESENT.       */ 00556000
         SLR   RRPL,RRPL                                           0333 00557000
*             END;                  /* END OF RPL ACQUISITION        */ 00558000
*         END;                      /* END OF BISAM I/O ERROR        */ 00559000
@RF00329 DS    0H                                                  0336 00560000
*     END;                          /* END OF BISAM CODE             */ 00561000
*                                                                  0336 00562000
@RF00323 DS    0H                                                  0337 00563000
*   /*****************************************************************/ 00564000
*   /*                                                               */ 00565000
*   /* IF A VSAM ERROR MESSAGE EXISTS, COPY IT TO THE SYNADAF MESSAGE*/ 00566000
*   /* AREA. (THE RIGHT-HAND SIDE OF THE MESSAGE IS TRUNCATED.)      */ 00567000
*   /*                                                               */ 00568000
*   /*****************************************************************/ 00569000
*                                                                  0337 00570000
*   IF RRPL^=ZERO                   /* IF AN I/O ERROR AND THE       */ 00571000
*     THEN                          /* RPL WAS AVAILABLE, COPY       */ 00572000
@RC00317 LTR   RRPL,RRPL                                           0337 00573000
         BZ    @RF00337                                            0337 00574000
*     DO;                           /* THE VSAM ERROR MESSAGE.       */ 00575000
*RPLAVL:                            /* HERE IF BISAM RPL OK          */ 00576000
*       RFY                                                        0339 00577000
*         R9 RSTD;                  /* GET WORK REGISTER             */ 00578000
RPLAVL   DS    0H                                                  0340 00579000
*       R9=ERMLL1-LENGTH(ERLGTH);   /* GET LENGTH FOR MOVE           */ 00580000
         LH    R9,ERMLL1(,R1)                                      0340 00581000
         SL    R9,@CF00045                                         0340 00582000
*       ERMBFRA(ONE:R9)=VSAMMSG(ONE:R9);/* COPY VSAM MESSAGE         */ 00583000
         LR    @12,R9                                              0341 00584000
         BCTR  @12,0                                               0341 00585000
         L     @08,RPLERMSA(,RRPL)                                 0341 00586000
         EX    @12,@SM02050                                        0341 00587000
*       RPLIITSB=CZERO;             /* RELEASE THE RPL               */ 00588000
         MVI   RPLIITSB+76(RRPL),B'00000000'                       0342 00589000
*       ERMBFRA=BLANKS;             /* BLANK OUT BUFFER ADDR         */ 00590000
         MVI   ERMBFRA+1(R1),C' '                                  0343 00591000
         MVC   ERMBFRA+2(2,R1),ERMBFRA+1(R1)                       0343 00592000
         MVI   ERMBFRA(R1),C' '                                    0343 00593000
*     END;                          /* END OF COPY I/O ERR MSG       */ 00594000
*                                                                  0345 00595000
*   /*****************************************************************/ 00596000
*   /*                                                               */ 00597000
*   /* IF A LOGICAL ERROR OCCURRED OR IF THE RPL USED FOR THE BISAM  */ 00598000
*   /* REQUEST IS UNAVAILABLE, BUILD A MESSAGE USING THE DCB OR DECB */ 00599000
*   /* ERROR CODES.                                                  */ 00600000
*   /*                                                               */ 00601000
*   /*****************************************************************/ 00602000
*                                                                  0345 00603000
*   ELSE                            /* HERE FOR LOGICAL ERROR        */ 00604000
*     DO;                           /* OR RPL NOT AVAILABLE          */ 00605000
*                                                                  0345 00606000
         B     @RC00337                                            0345 00607000
@RF00337 DS    0H                                                  0346 00608000
*       /*************************************************************/ 00609000
*       /*                                                           */ 00610000
*       /* BUILD COMMON PART OF THE MESSAGE.                         */ 00611000
*       /*                                                           */ 00612000
*       /*************************************************************/ 00613000
*                                                                  0346 00614000
*       ERJOBNM=TIOCNJOB;           /* SET JOB NAME                  */ 00615000
         LA    @12,40                                              0346 00616000
         ALR   @12,R2                                              0346 00617000
         L     @08,DCBDEBAD(,@12)                                  0346 00618000
         L     @08,TCBPTR(,@08)                                    0346 00619000
         L     @08,TIOTPTR(,@08)                                   0346 00620000
         MVC   ERJOBNM(8,R1),TIOCNJOB(@08)                         0346 00621000
*       ERSTEPNM=TIOCSTEP;          /* SET STEP NAME                 */ 00622000
         MVC   ERSTEPNM(8,R1),TIOCSTEP(@08)                        0347 00623000
*       RFY                                                        0348 00624000
*         TIOENTRY BASED(R9);       /* DEFINE DDNAME BASE            */ 00625000
*       R9=ADDR(TIOT1)+DCBTIOT;     /* POINT TO DD ENTRY             */ 00626000
         AH    @08,DCBTIOT(,@12)                                   0349 00627000
         LR    R9,@08                                              0349 00628000
*       ERDDNM=TIOEDDNM;            /* SET UP DD NAME                */ 00629000
         MVC   ERDDNM(8,R1),TIOEDDNM(R9)                           0350 00630000
*       ERUNIT=SKIP;                /* SET UNKNOWN UNIT              */ 00631000
         MVC   ERUNIT(3,R1),SKIP                                   0351 00632000
*       ERUNTYPE=DIRECT;            /* SET DIRECT ACCESS             */ 00633000
         MVC   ERUNTYPE(2,R1),DIRECT                               0352 00634000
*       BLNKAREA=BLANKS;            /* BLANK OUT FIRST PART          */ 00635000
         MVI   BLNKAREA+1(R1),C' '                                 0353 00636000
         MVC   BLNKAREA+2(40,R1),BLNKAREA+1(R1)                    0353 00637000
         MVI   BLNKAREA(R1),C' '                                   0353 00638000
*       IF DCBMFGET=ON|             /* IF QISAM MODE,                */ 00639000
*           DCBMFPUT=ON THEN        /* DETERMINE THE ERROR           */ 00640000
         TM    DCBMFGET(@12),B'01000000'                           0354 00641000
         BO    @RT00354                                            0354 00642000
         TM    DCBMFPUT(@12),B'01000000'                           0354 00643000
         BNO   @RF00354                                            0354 00644000
@RT00354 DS    0H                                                  0355 00645000
*         DO;                       /* FROM THE DCB.                 */ 00646000
*                                                                  0356 00647000
*           /*********************************************************/ 00648000
*           /*                                                       */ 00649000
*           /* SET QISAM ERROR DESCRIPTION FROM DCB EXCEPTION CODES. */ 00650000
*           /*                                                       */ 00651000
*           /*********************************************************/ 00652000
*                                                                  0356 00653000
*           IF DCBEXNKY=ON THEN     /* IF NO RECORD FOUND            */ 00654000
         TM    DCBEXNKY+52(R2),B'10000000'                         0356 00655000
         BNO   @RF00356                                            0356 00656000
*             ERDESC=NOKEY;         /* SET MESSAGE DESCRIPTION       */ 00657000
         MVC   ERDESC(15,R1),NOKEY                                 0357 00658000
*           ELSE                                                   0358 00659000
*             IF DCBEXSEQ=ON THEN   /* IF SEQUENCE CHECK ERROR       */ 00660000
         B     @RC00356                                            0358 00661000
@RF00356 TM    DCBEXSEQ+52(R2),B'10000000'                         0358 00662000
         BNO   @RF00358                                            0358 00663000
*               ERDESC=SEQCHK;      /* SET MESSAGE DESCRIPTION       */ 00664000
         MVC   ERDESC(15,R1),SEQCHK                                0359 00665000
*             ELSE                                                 0360 00666000
*               IF DCBEXDUP=ON THEN /* IF DUPLICATE RECORD           */ 00667000
         B     @RC00358                                            0360 00668000
@RF00358 TM    DCBEXDUP+52(R2),B'01000000'                         0360 00669000
         BNO   @RF00360                                            0360 00670000
*                 ERDESC=DUPLIC;    /* SET MESSAGE DESCRIPTION       */ 00671000
         MVC   ERDESC(15,R1),DUPLIC                                0361 00672000
*               ELSE                                               0362 00673000
*                 IF DCBEXINV=ON THEN/* IF INVALID REQUEST           */ 00674000
         B     @RC00360                                            0362 00675000
@RF00360 TM    DCBEXINV+52(R2),B'00010000'                         0362 00676000
         BNO   @RF00362                                            0362 00677000
*                   ERDESC=INVALREQ;/* SET MESSAGE DESCRIPTION       */ 00678000
         MVC   ERDESC(15,R1),INVALREQ                              0363 00679000
*                 ELSE                                             0364 00680000
*                   IF DCBEXNSP=ON THEN/* IF SPACE NOT FOUND         */ 00681000
         B     @RC00362                                            0364 00682000
@RF00362 TM    DCBEXNSP+52(R2),B'00100000'                         0364 00683000
         BNO   @RF00364                                            0364 00684000
*                     ERDESC=NOSPACE;/* SET MESSAGE DESCRIPTION      */ 00685000
         MVC   ERDESC(15,R1),NOSPACE                               0365 00686000
*                   ELSE                                           0366 00687000
*                     IF DCBEXLTH=ON THEN/* IF RECORD LENGTH CHECK   */ 00688000
         B     @RC00364                                            0366 00689000
@RF00364 TM    DCBEXLTH+52(R2),B'00001000'                         0366 00690000
         BNO   @RF00366                                            0366 00691000
*                       ERDESC=INLEN;/* SET MESSAGE DESCRIPTION      */ 00692000
         MVC   ERDESC(15,R1),INLEN                                 0367 00693000
*                     ELSE                                         0368 00694000
*                       ERDESC=UNREACH;/* ELSE UNREACHABLE BLOCK     */ 00695000
         B     @RC00366                                            0368 00696000
@RF00366 MVC   ERDESC(15,R1),UNREACH                               0368 00697000
*         END;                      /* END OF QISAM ERDESC           */ 00698000
*       ELSE                        /* BISAM ERROR DESCRIP           */ 00699000
*         DO;                       /* DETERMINE DECB ERROR          */ 00700000
*                                                                  0370 00701000
         B     @RC00354                                            0370 00702000
@RF00354 DS    0H                                                  0371 00703000
*           /*********************************************************/ 00704000
*           /*                                                       */ 00705000
*           /* SET BISAM ERROR DESCRIPTION FROM THE DECB ERROR FLAGS.*/ 00706000
*           /*                                                       */ 00707000
*           /*********************************************************/ 00708000
*                                                                  0371 00709000
*           IF DECEXERR=ON THEN     /* IF I/O ERROR                  */ 00710000
         TM    DECEXERR(R10),B'00001000'                           0371 00711000
         BNO   @RF00371                                            0371 00712000
*             ERDESC=IOERR;         /* SET MESSAGE DESCRIPTION       */ 00713000
         MVC   ERDESC(15,R1),IOERR                                 0372 00714000
*           ELSE                                                   0373 00715000
*             IF DECEXRNF=ON THEN   /* IF NO RECORD FOUND            */ 00716000
         B     @RC00371                                            0373 00717000
@RF00371 TM    DECEXRNF(R10),B'10000000'                           0373 00718000
         BNO   @RF00373                                            0373 00719000
*               ERDESC=NOKEY;       /* SET MESSAGE DESCRIPTION       */ 00720000
         MVC   ERDESC(15,R1),NOKEY                                 0374 00721000
*             ELSE                                                 0375 00722000
*               IF DECEXDUP=ON THEN /* IF DUPLICATE RECORD           */ 00723000
         B     @RC00373                                            0375 00724000
@RF00373 TM    DECEXDUP(R10),B'00000001'                           0375 00725000
         BNO   @RF00375                                            0375 00726000
*                 ERDESC=DUPLIC;    /* SET MESSAGE DESCRIPTION       */ 00727000
         MVC   ERDESC(15,R1),DUPLIC                                0376 00728000
*               ELSE                                               0377 00729000
*                 IF DECEXNSP=ON THEN/* IF NO SPACE FOUND            */ 00730000
         B     @RC00375                                            0377 00731000
@RF00375 TM    DECEXNSP(R10),B'00100000'                           0377 00732000
         BNO   @RF00377                                            0377 00733000
*                   ERDESC=NOSPACE; /* SET MESSAGE DESCRIPTION       */ 00734000
         MVC   ERDESC(15,R1),NOSPACE                               0378 00735000
*                 ELSE                                             0379 00736000
*                   IF DECEXINV=ON THEN/* IF INVALID REQUEST         */ 00737000
         B     @RC00377                                            0379 00738000
@RF00377 TM    DECEXINV(R10),B'00010000'                           0379 00739000
         BNO   @RF00379                                            0379 00740000
*                     ERDESC=INVALREQ;/* SET MESSAGE DESCRIPTION     */ 00741000
         MVC   ERDESC(15,R1),INVALREQ                              0380 00742000
*                   ELSE                                           0381 00743000
*                     IF DECEXRLC=ON THEN/* IF RECORD LENGTH CHECK   */ 00744000
         B     @RC00379                                            0381 00745000
@RF00379 TM    DECEXRLC(R10),B'01000000'                           0381 00746000
         BNO   @RF00381                                            0381 00747000
*                       ERDESC=INLEN;/* SET MESSAGE DESCRIPTION      */ 00748000
         MVC   ERDESC(15,R1),INLEN                                 0382 00749000
*                     ELSE                                         0383 00750000
*                       ERDESC=UNREACH;/* ELSE UNREACHABLE BLOCK     */ 00751000
         B     @RC00381                                            0383 00752000
@RF00381 MVC   ERDESC(15,R1),UNREACH                               0383 00753000
*         END;                      /* END OF BISAM ERROR            */ 00754000
@RC00381 DS    0H                                                  0384 00755000
@RC00379 DS    0H                                                  0384 00756000
@RC00377 DS    0H                                                  0384 00757000
@RC00375 DS    0H                                                  0384 00758000
@RC00373 DS    0H                                                  0384 00759000
@RC00371 DS    0H                                                  0385 00760000
*     END;                          /* END OF COMMON MSG BUILD       */ 00761000
@RC00354 DS    0H                                                  0386 00762000
*                                                                  0386 00763000
*   /*****************************************************************/ 00764000
*   /*                                                               */ 00765000
*   /* SET THE ERROR DESCRIPTION FIELD TO THE APPROPRIATE BISAM OR   */ 00766000
*   /* QISAM MACRO INSTRUCTION AND SET THE ACCESS METHOD CODE        */ 00767000
*   /*                                                               */ 00768000
*   /*****************************************************************/ 00769000
*                                                                  0386 00770000
*   IF DCBMFPUT=ON|                 /* TEST FOR A QISAM DCB          */ 00771000
*       DCBMFGET=ON THEN            /* IF GET OR PUT, ERROR          */ 00772000
@RC00337 LA    @12,40                                              0386 00773000
         ALR   @12,R2                                              0386 00774000
         TM    DCBMFPUT(@12),B'01000000'                           0386 00775000
         BO    @RT00386                                            0386 00776000
         TM    DCBMFGET(@12),B'01000000'                           0386 00777000
         BNO   @RF00386                                            0386 00778000
@RT00386 DS    0H                                                  0387 00779000
*     DO;                           /* CODE IS IN THE DCB.           */ 00780000
*       ERDAAM=QISAM;               /* SET QISAM CODE                */ 00781000
         MVC   ERDAAM(6,R1),QISAM                                  0388 00782000
*       IF DCBMFGET=ON THEN         /* IF SCAN MODE, COULD BE        */ 00783000
         LA    @12,40                                              0389 00784000
         ALR   @12,R2                                              0389 00785000
         TM    DCBMFGET(@12),B'01000000'                           0389 00786000
         BNO   @RF00389                                            0389 00787000
*         DO;                       /* GET, PUTX, OR SETL ERR        */ 00788000
*           IF DCBEXINV=OFF THEN    /* (IF NOT INVALID)              */ 00789000
         LA    @08,52                                              0391 00790000
         ALR   @08,R2                                              0391 00791000
         TM    DCBEXINV(@08),B'00010000'                           0391 00792000
         BNZ   @RF00391                                            0391 00793000
*             IF IIFSCAN=ON THEN    /* IF SETL SUCCESSFUL            */ 00794000
         L     @12,DCBDEBAD(,@12)                                  0392 00795000
         L     @12,DEBEXPT(,@12)                                   0392 00796000
         L     @12,DEBWKPT5(,@12)                                  0392 00797000
         TM    IIFSCAN(@12),B'10000000'                            0392 00798000
         BNO   @RF00392                                            0392 00799000
*               DO;                 /* THEN GET OR PUTX ERROR        */ 00800000
*                 IF DCBEXOER=ON THEN/* IF UNCORRECTABLE OUTPUT      */ 00801000
         TM    DCBEXOER(@08),B'00000100'                           0394 00802000
         BNO   @RF00394                                            0394 00803000
*                   EROPER=PUTX;    /* ERROR, SET PUTX CODE.         */ 00804000
         MVC   EROPER(6,R1),PUTX                                   0395 00805000
*                 ELSE                                             0396 00806000
*                   EROPER=GET;     /* OTHERWISE, SET GET.           */ 00807000
         B     @RC00394                                            0396 00808000
@RF00394 MVC   EROPER(6,R1),GET                                    0396 00809000
*               END;                /* END OF NON-SETL ERROR         */ 00810000
*             ELSE                                                 0398 00811000
*               EROPER=SETL;        /* SET BAD SETL                  */ 00812000
         B     @RC00392                                            0398 00813000
@RF00392 MVC   EROPER(6,R1),SETL                                   0398 00814000
*         END;                      /* END OF SCAN CODE              */ 00815000
*       ELSE                                                       0400 00816000
*         EROPER=PUT;               /* IF LOAD MODE, SET PUT         */ 00817000
         B     @RC00389                                            0400 00818000
@RF00389 MVC   EROPER(6,R1),PUT                                    0400 00819000
*       IF AUDACBCL=ON&AUDACBRC=OFF THEN                           0401 00820000
@RC00389 L     @12,DCBDEBAD+40(,R2)                                0401 00821000
         L     @12,DEBEXPT(,@12)                                   0401 00822000
         L     @12,DEBWKPT5(,@12)                                  0401 00823000
         TM    AUDACBCL(@12),B'01000000'                           0401 00824000
         BNO   @RF00401                                            0401 00825000
         TM    AUDACBRC(@12),B'00100000'                           0401 00826000
         BNZ   @RF00401                                            0401 00827000
*         EROPER=CLOSE;             /* SET CLOSE OPERATION IF IN   0402 00828000
*                                      PROCESS OF ACB CLOSE  @YM04657*/ 00829000
         MVC   EROPER(6,R1),CLOSE                                  0402 00830000
*     END;                          /* END OF QISAM CODE             */ 00831000
*   ELSE                            /* HERE FOR BISAM                */ 00832000
*     DO;                           /*                               */ 00833000
         B     @RC00386                                            0404 00834000
@RF00386 DS    0H                                                  0405 00835000
*       ERDAAM=BISAM;               /* SET BISAM CODE                */ 00836000
         MVC   ERDAAM(6,R1),BISAM                                  0405 00837000
*       IF DECBTYP2=READK|          /* IF A READ KEY OR READ         */ 00838000
*           DECBTYP2=READKU THEN    /* KEY FOR UPDATE, SET A         */ 00839000
         CLI   DECBTYP2(R10),B'10000000'                           0406 00840000
         BE    @RT00406                                            0406 00841000
         CLI   DECBTYP2(R10),B'00100000'                           0406 00842000
         BNE   @RF00406                                            0406 00843000
@RT00406 DS    0H                                                  0407 00844000
*         EROPER=READ;              /* READ OPERATION.               */ 00845000
         MVC   EROPER(6,R1),READ                                   0407 00846000
*       ELSE                                                       0408 00847000
*         EROPER=WRITE;             /* OTHERWISE, SET WRITE.         */ 00848000
         B     @RC00406                                            0408 00849000
@RF00406 MVC   EROPER(6,R1),WRITE                                  0408 00850000
*     END;                          /* END OF BISAM CODE             */ 00851000
@RC00406 DS    0H                                                  0410 00852000
*   R0SAVE=NOBFRAD;                 /* INDICATE NO BUFFER ADDR       */ 00853000
@RC00386 SLR   @12,@12                                             0410 00854000
         ST    @12,R0SAVE(,R13)                                    0410 00855000
*   GEN(LM    R14,R12,TWELVE(R13)); /* RESTORE USER REGISTERS        */ 00856000
         LM    R14,R12,TWELVE(R13)                                      00857000
*   GEN(BR R14);                    /* RETURN TO SYNADAF             */ 00858000
         BR R14                                                         00859000
*   GEN(IDAPATCH);                  /* DEFINE A PATCH AREA           */ 00860000
         IDAPATCH                                                       00861000
*   GEN(USING @PSTART,R11);         /* RESET BASE REG                */ 00862000
         USING @PSTART,R11                                              00863000
*   END IDAIISM1                                                   0415 00864000
*                                                                  0415 00865000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00866000
*/*%INCLUDE SYSLIB  (IDAIIREG)                                       */ 00867000
*/*%INCLUDE SYSLIB  (IDAIICB )                                       */ 00868000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00869000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00870000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 00871000
*/*%INCLUDE SYSLIB  (IDARPLE )                                       */ 00872000
*/*%INCLUDE SYSLIB  (IDARMRCD)                                       */ 00873000
*/*%INCLUDE SYSLIB  (IEZDEB  )                                       */ 00874000
*/*%INCLUDE SYSLIB  (IDAPLH  )                                       */ 00875000
*/*%INCLUDE SYSLIB  (IDAERMSG)                                       */ 00876000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00877000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                       */ 00878000
*/*%INCLUDE SYSLIB  (IHADECB )                                       */ 00879000
*/*%INCLUDE SYSLIB  (IFGACB  )                                       */ 00880000
*/*%INCLUDE SYSLIB  (IFGEXLST)                                       */ 00881000
*                                                                  0415 00882000
*       ;                                                          0415 00883000
         B     @EL00001                                            0415 00884000
@DATA    DS    0H                                                       00885000
@SM02050 MVC   ERMBFRA(0,R1),VSAMMSG(@08)                               00886000
@DATD    DSECT                                                          00887000
         DS    0F                                                       00888000
IDAIISM1 CSECT                                                          00889000
         DS    0F                                                       00890000
@CF00087 DC    F'1'                                                     00891000
@CF00045 DC    F'8'                                                     00892000
@CF02043 DC    F'200704'                                                00893000
@CF02029 DC    XL4'80000000'                                            00894000
@DATD    DSECT                                                          00895000
         DS    0D                                                       00896000
DEBDAPTR DS    A                                                        00897000
DEBEXPTR DS    A                                                        00898000
DEBSBPTR DS    A                                                        00899000
DECBPT   DS    A                                                        00900000
IDAIISM1 CSECT                                                          00901000
         DS    0F                                                       00902000
@SIZDATD DC    AL1(0)                                                   00903000
         DC    AL3(@ENDDATD-@DATD)                                      00904000
         DS    0D                                                       00905000
SKIP     DC    CL3'N/A'                                                 00906000
DIRECT   DC    CL2'DA'                                                  00907000
QISAM    DC    CL6'QISAM'                                               00908000
BISAM    DC    CL6'BISAM'                                               00909000
READ     DC    CL6'READ'                                                00910000
WRITE    DC    CL6'WRITE'                                               00911000
PUT      DC    CL6'PUT'                                                 00912000
PUTX     DC    CL6'PUTX'                                                00913000
SETL     DC    CL6'SETL'                                                00914000
GET      DC    CL6'GET'                                                 00915000
CLOSE    DC    CL6'CLOSE'                                               00916000
NOKEY    DC    CL15' RCD NOT FOUND'                                     00917000
SEQCHK   DC    CL15'SEQUENCE CHECK'                                     00918000
DUPLIC   DC    CL15'DUPLICATE RCD'                                      00919000
INVALREQ DC    CL15'INVALID REQUEST'                                    00920000
NOSPACE  DC    CL15'NO SPACE AVAIL'                                     00921000
IOERR    DC    CL15'UNCORR I/O ERR'                                     00922000
INLEN    DC    CL15'INVALID LENGTH'                                     00923000
UNREACH  DC    CL15'UNREACH BLOCK'                                      00924000
@DATD    DSECT                                                          00925000
TWELVE   EQU   12                       SAVEAREA OFFSET                 00926000
TWENTY8  EQU   28                       OFFSET TO USER R2               00927000
FORTY    EQU   40                       OFFSET TO SVRB REGS             00928000
@DATD    DSECT                                                          00929000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00930000
@ENDDATD EQU   *                                                        00931000
IDAIISM1 CSECT                                                          00932000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00933000
@01      EQU   01                                                       00934000
@02      EQU   02                                                       00935000
@03      EQU   03                                                       00936000
@04      EQU   04                                                       00937000
@05      EQU   05                                                       00938000
@06      EQU   06                                                       00939000
@07      EQU   07                                                       00940000
@08      EQU   08                                                       00941000
@09      EQU   09                                                       00942000
@10      EQU   10                                                       00943000
@11      EQU   11                                                       00944000
@12      EQU   12                                                       00945000
@13      EQU   13                                                       00946000
@14      EQU   14                                                       00947000
@15      EQU   15                                                       00948000
GPR01F   EQU   @01                                                      00949000
R0       EQU   @00                                                      00950000
R1       EQU   @01                                                      00951000
RDCB     EQU   @01                                                      00952000
RDECB    EQU   @01                                                      00953000
R2       EQU   @02                                                      00954000
RIICB    EQU   @02                                                      00955000
RRPL     EQU   @03                                                      00956000
RWORK3   EQU   @08                                                      00957000
R9       EQU   @09                                                      00958000
R10      EQU   @10                                                      00959000
DEBPTR   EQU   @11                                                      00960000
R13      EQU   @13                                                      00961000
R14      EQU   @14                                                      00962000
R15      EQU   @15                                                      00963000
GPR00F   EQU   @00                                                      00964000
GPR00P   EQU   @00                                                      00965000
GPR01P   EQU   @01                                                      00966000
GPR14F   EQU   @14                                                      00967000
GPR14P   EQU   @14                                                      00968000
GPR15F   EQU   @15                                                      00969000
GPR15P   EQU   @15                                                      00970000
JFCBPTR  EQU   @09                                                      00971000
RACB     EQU   @06                                                      00972000
RBUFF    EQU   @05                                                      00973000
RCORE    EQU   @04                                                      00974000
RDEB     EQU   @11                                                      00975000
RFMADDR  EQU   @07                                                      00976000
RGMLEN   EQU   @09                                                      00977000
RGMSP    EQU   @08                                                      00978000
RLKRETSV EQU   @10                                                      00979000
RPARC    EQU   @07                                                      00980000
RTIOT    EQU   @09                                                      00981000
RWORK1   EQU   @06                                                      00982000
RWORK2   EQU   @07                                                      00983000
R11      EQU   @11                                                      00984000
R12      EQU   @12                                                      00985000
R3       EQU   @03                                                      00986000
R4       EQU   @04                                                      00987000
R5       EQU   @05                                                      00988000
R6       EQU   @06                                                      00989000
R7       EQU   @07                                                      00990000
R8       EQU   @08                                                      00991000
IDAIICB  EQU   0                                                        00992000
IIDCBPTR EQU   IDAIICB+4                                                00993000
IIACBPTR EQU   IDAIICB+8                                                00994000
IIRPLPTR EQU   IDAIICB+12                                               00995000
IIW1CBF  EQU   IDAIICB+16                                               00996000
IIFLAG1  EQU   IDAIICB+24                                               00997000
IIFSCAN  EQU   IIFLAG1                                                  00998000
IIFCLOSE EQU   IIFLAG1                                                  00999000
IIFLAG2  EQU   IDAIICB+28                                               01000000
IIFLAG3  EQU   IDAIICB+36                                               01001000
IISAMSYN EQU   IDAIICB+52                                               01002000
IIREGSAV EQU   IDAIICB+60                                               01003000
IIREGBC  EQU   IIREGSAV+4                                               01004000
IIAUD    EQU   IDAIICB+132                                              01005000
IIAUDHDR EQU   IIAUD                                                    01006000
IIAUDFL1 EQU   IIAUDHDR                                                 01007000
IIAUDFL2 EQU   IIAUDHDR+1                                               01008000
AUDACBCL EQU   IIAUDFL2                                                 01009000
AUDACBRC EQU   IIAUDFL2                                                 01010000
IIGMCNTR EQU   IIAUDHDR+2                                               01011000
IIGMAUD  EQU   IIAUD+4                                                  01012000
AUDCSPLI EQU   IIGMAUD+4                                                01013000
AUDCSPLD EQU   IIGMAUD+12                                               01014000
AUDCSPLB EQU   IIGMAUD+20                                               01015000
AUDCSPLM EQU   IIGMAUD+28                                               01016000
IIGMNTRY EQU   0                                                        01017000
IIGMSPLG EQU   IIGMNTRY+4                                               01018000
IHADCB   EQU   0                                                        01019000
IHADCS00 EQU   0                                                        01020000
DCBFDAD  EQU   IHADCS00+5                                               01021000
IHADCS01 EQU   0                                                        01022000
DCBDVTBL EQU   IHADCS01                                                 01023000
IHADCS11 EQU   0                                                        01024000
DCBRELB  EQU   IHADCS11                                                 01025000
DCBREL   EQU   DCBRELB+1                                                01026000
DCBBUFCB EQU   IHADCS11+4                                               01027000
DCBDSORG EQU   IHADCS11+10                                              01028000
DCBDSRG1 EQU   DCBDSORG                                                 01029000
DCBDSRG2 EQU   DCBDSORG+1                                               01030000
DCBIOBAD EQU   IHADCS11+12                                              01031000
DCBODEB  EQU   DCBIOBAD                                                 01032000
DCBLNP   EQU   DCBODEB                                                  01033000
DCBQSLM  EQU   DCBLNP                                                   01034000
DCBIOBAA EQU   DCBODEB+1                                                01035000
IHADCS50 EQU   0                                                        01036000
DCBSVCXL EQU   IHADCS50                                                 01037000
DCBEODAD EQU   IHADCS50+4                                               01038000
DCBBFALN EQU   DCBEODAD                                                 01039000
DCBHIARC EQU   DCBBFALN                                                 01040000
DCBBFTEK EQU   DCBHIARC                                                 01041000
DCBBFT   EQU   DCBBFTEK                                                 01042000
DCBEXLST EQU   IHADCS50+8                                               01043000
DCBRECFM EQU   DCBEXLST                                                 01044000
DCBRECLA EQU   DCBRECFM                                                 01045000
IHADCS24 EQU   0                                                        01046000
DCBOFLGS EQU   IHADCS24+8                                               01047000
DCBOFLWR EQU   DCBOFLGS                                                 01048000
DCBIFLG  EQU   IHADCS24+9                                               01049000
DCBMACR  EQU   IHADCS24+10                                              01050000
DCBMACR1 EQU   DCBMACR                                                  01051000
DCBMRFE  EQU   DCBMACR1                                                 01052000
DCBMRGET EQU   DCBMRFE                                                  01053000
DCBMRAPG EQU   DCBMACR1                                                 01054000
DCBMRRD  EQU   DCBMRAPG                                                 01055000
DCBMRCI  EQU   DCBMACR1                                                 01056000
DCBMRMVG EQU   DCBMRCI                                                  01057000
DCBMRLCG EQU   DCBMACR1                                                 01058000
DCBMRABC EQU   DCBMACR1                                                 01059000
DCBMRPT1 EQU   DCBMRABC                                                 01060000
DCBMRSBG EQU   DCBMRPT1                                                 01061000
DCBMRCRL EQU   DCBMACR1                                                 01062000
DCBMRCHK EQU   DCBMRCRL                                                 01063000
DCBMRRDX EQU   DCBMRCHK                                                 01064000
DCBMRDMG EQU   DCBMACR1                                                 01065000
DCBMACR2 EQU   DCBMACR+1                                                01066000
DCBMRPUT EQU   DCBMACR2                                                 01067000
DCBMRWRT EQU   DCBMACR2                                                 01068000
DCBMRMVP EQU   DCBMACR2                                                 01069000
DCBMR5WD EQU   DCBMACR2                                                 01070000
DCBMRLDM EQU   DCBMR5WD                                                 01071000
DCBMRLCP EQU   DCBMRLDM                                                 01072000
DCBMR4WD EQU   DCBMACR2                                                 01073000
DCBMRPT2 EQU   DCBMR4WD                                                 01074000
DCBMRTMD EQU   DCBMRPT2                                                 01075000
DCBMR3WD EQU   DCBMACR2                                                 01076000
DCBMRCTL EQU   DCBMR3WD                                                 01077000
DCBMRSTK EQU   DCBMRCTL                                                 01078000
DCBMR1WD EQU   DCBMACR2                                                 01079000
DCBMRSWA EQU   DCBMR1WD                                                 01080000
DCBMRDMD EQU   DCBMRSWA                                                 01081000
IHADCS25 EQU   0                                                        01082000
DCBTIOT  EQU   IHADCS25                                                 01083000
DCBMACRF EQU   IHADCS25+2                                               01084000
DCBMACF1 EQU   DCBMACRF                                                 01085000
DCBMFFE  EQU   DCBMACF1                                                 01086000
DCBMFGET EQU   DCBMFFE                                                  01087000
DCBMFAPG EQU   DCBMACF1                                                 01088000
DCBMFRD  EQU   DCBMFAPG                                                 01089000
DCBMFCI  EQU   DCBMACF1                                                 01090000
DCBMFMVG EQU   DCBMFCI                                                  01091000
DCBMFLCG EQU   DCBMACF1                                                 01092000
DCBMFABC EQU   DCBMACF1                                                 01093000
DCBMFPT1 EQU   DCBMFABC                                                 01094000
DCBMFSBG EQU   DCBMFPT1                                                 01095000
DCBMFCRL EQU   DCBMACF1                                                 01096000
DCBMFCHK EQU   DCBMFCRL                                                 01097000
DCBMFDMG EQU   DCBMACF1                                                 01098000
DCBMACF2 EQU   DCBMACRF+1                                               01099000
DCBMFPUT EQU   DCBMACF2                                                 01100000
DCBMFWRT EQU   DCBMACF2                                                 01101000
DCBMFMVP EQU   DCBMACF2                                                 01102000
DCBMF5WD EQU   DCBMACF2                                                 01103000
DCBMFLDM EQU   DCBMF5WD                                                 01104000
DCBMFLCP EQU   DCBMFLDM                                                 01105000
DCBMF4WD EQU   DCBMACF2                                                 01106000
DCBMFPT2 EQU   DCBMF4WD                                                 01107000
DCBMFTMD EQU   DCBMFPT2                                                 01108000
DCBMF3WD EQU   DCBMACF2                                                 01109000
DCBMFCTL EQU   DCBMF3WD                                                 01110000
DCBMFSTK EQU   DCBMFCTL                                                 01111000
DCBMF1WD EQU   DCBMACF2                                                 01112000
DCBMFSWA EQU   DCBMF1WD                                                 01113000
DCBMFDMD EQU   DCBMFSWA                                                 01114000
DCBDEBAD EQU   IHADCS25+4                                               01115000
DCBIFLGS EQU   DCBDEBAD                                                 01116000
IHADCS27 EQU   0                                                        01117000
DCBGET   EQU   IHADCS27                                                 01118000
DCBPUT   EQU   DCBGET                                                   01119000
DCBGETA  EQU   DCBPUT+1                                                 01120000
IHADCS29 EQU   0                                                        01121000
DCBOPTCD EQU   IHADCS29                                                 01122000
DCBMAC   EQU   IHADCS29+1                                               01123000
DCBSYNAD EQU   IHADCS29+4                                               01124000
DCBMSHI  EQU   IHADCS29+20                                              01125000
DCBEXCD1 EQU   IHADCS29+28                                              01126000
DCBEXNKY EQU   DCBEXCD1                                                 01127000
DCBEXNSP EQU   DCBEXCD1                                                 01128000
DCBEXINV EQU   DCBEXCD1                                                 01129000
DCBEXIER EQU   DCBEXCD1                                                 01130000
DCBEXOER EQU   DCBEXCD1                                                 01131000
DCBEXBLI EQU   DCBEXCD1                                                 01132000
DCBEXBLU EQU   DCBEXCD1                                                 01133000
DCBEXCD2 EQU   IHADCS29+29                                              01134000
DCBEXSEQ EQU   DCBEXCD2                                                 01135000
DCBEXDUP EQU   DCBEXCD2                                                 01136000
DCBEXCLD EQU   DCBEXCD2                                                 01137000
DCBEXLTH EQU   DCBEXCD2                                                 01138000
DCBST    EQU   IHADCS29+108                                             01139000
DCBSTLOD EQU   DCBST                                                    01140000
IHADCS55 EQU   0                                                        01141000
IFGRPL   EQU   0                                                        01142000
RPLCOMN  EQU   IFGRPL                                                   01143000
RPLIDWD  EQU   RPLCOMN                                                  01144000
RPLLEN   EQU   RPLIDWD+3                                                01145000
RPLPLHPT EQU   RPLCOMN+4                                                01146000
RPLECB   EQU   RPLCOMN+8                                                01147000
RPLFDBK  EQU   RPLCOMN+13                                               01148000
RPLRTNCD EQU   RPLFDBK                                                  01149000
RPLERREG EQU   RPLRTNCD                                                 01150000
RPLCNDCD EQU   RPLFDBK+1                                                01151000
RPLCMPON EQU   RPLCNDCD                                                 01152000
RPLERRCD EQU   RPLCNDCD+1                                               01153000
RPLKEYLE EQU   RPLCOMN+16                                               01154000
RPLARG   EQU   RPLCOMN+36                                               01155000
RPLOPTCD EQU   RPLCOMN+40                                               01156000
RPLOPT1  EQU   RPLOPTCD                                                 01157000
RPLECBSW EQU   RPLOPT1                                                  01158000
RPLOPT2  EQU   RPLOPTCD+1                                               01159000
RPLADR   EQU   RPLOPT2                                                  01160000
RPLOPT3  EQU   RPLOPTCD+2                                               01161000
RPLNXTRP EQU   RPLCOMN+44                                               01162000
RPLOPTC2 EQU   RPLCOMN+56                                               01163000
RPLOPT5  EQU   RPLOPTC2                                                 01164000
RPLWRTYP EQU   RPLOPT5                                                  01165000
RPLOPT6  EQU   RPLOPTC2+1                                               01166000
RPLUNTYP EQU   RPLOPT6                                                  01167000
RPLOPT7  EQU   RPLOPTC2+2                                               01168000
RPLCNOPT EQU   RPLOPT7                                                  01169000
RPLOPT8  EQU   RPLOPTC2+3                                               01170000
RPLRBAR  EQU   RPLCOMN+60                                               01171000
RPL6RBA  EQU   RPLRBAR+2                                                01172000
RPLEXTDS EQU   RPLCOMN+68                                               01173000
RPLEXTD1 EQU   RPLEXTDS                                                 01174000
RPLERMSA EQU   RPLCOMN+72                                               01175000
IDARPLE  EQU   0                                                        01176000
RPLIICB  EQU   IDARPLE                                                  01177000
RPLDECB  EQU   IDARPLE+4                                                01178000
RPLRPLPT EQU   IDARPLE+12                                               01179000
RPLIITSB EQU   IDARPLE+16                                               01180000
DEBBASIC EQU   0                                                        01181000
DEBTCBAD EQU   DEBBASIC                                                 01182000
DEBDEBAD EQU   DEBBASIC+4                                               01183000
DEBIRBAD EQU   DEBBASIC+8                                               01184000
DEBOFLGS EQU   DEBIRBAD                                                 01185000
DEBOPATB EQU   DEBBASIC+12                                              01186000
DEBFLGS1 EQU   DEBBASIC+14                                              01187000
DEBUSRPG EQU   DEBBASIC+16                                              01188000
DEBRRQ   EQU   DEBBASIC+20                                              01189000
DEBECBAD EQU   DEBRRQ                                                   01190000
DEBDCBAD EQU   DEBBASIC+24                                              01191000
DEBPROTG EQU   DEBDCBAD                                                 01192000
DEBAPPAD EQU   DEBBASIC+28                                              01193000
DEBBASND EQU   DEBBASIC+32                                              01194000
DEBDASD  EQU   0                                                        01195000
DEBUCBAD EQU   DEBDASD                                                  01196000
DEBACSMD EQU   0                                                        01197000
DEBVOLSQ EQU   DEBACSMD                                                 01198000
DEBVOLBT EQU   DEBVOLSQ                                                 01199000
DEBDSNM  EQU   DEBACSMD+4                                               01200000
DEBUTSAA EQU   DEBDSNM                                                  01201000
DEBACS01 EQU   0                                                        01202000
DEBDSNAM EQU   DEBACS01                                                 01203000
DEBACS02 EQU   0                                                        01204000
DEBDBLK  EQU   DEBACS02                                                 01205000
DEBACS03 EQU   0                                                        01206000
DEBACS04 EQU   0                                                        01207000
DEBTBFRA EQU   DEBACS04                                                 01208000
DEBTCCWA EQU   DEBACS04+4                                               01209000
DEBACS05 EQU   0                                                        01210000
DEBFUCBA EQU   DEBACS05                                                 01211000
DEBLUCBA EQU   DEBACS05+4                                               01212000
DEBACS06 EQU   0                                                        01213000
DEBACS07 EQU   0                                                        01214000
DEBWKPT5 EQU   DEBACS07+12                                              01215000
DEBACS08 EQU   0                                                        01216000
DEBSUBNM EQU   0                                                        01217000
DEB      EQU   0                                                        01218000
DEBAVT   EQU   DEB                                                      01219000
DEBEOEA  EQU   DEBAVT                                                   01220000
DEBEOEAB EQU   DEBEOEA                                                  01221000
DEBSIOA  EQU   DEBAVT+4                                                 01222000
DEBSIOAB EQU   DEBSIOA                                                  01223000
DEBPCIA  EQU   DEBAVT+8                                                 01224000
DEBPCIAB EQU   DEBPCIA                                                  01225000
DEBCEA   EQU   DEBAVT+12                                                01226000
DEBCEAB  EQU   DEBCEA                                                   01227000
DEBXCEA  EQU   DEBAVT+16                                                01228000
DEBXCEAB EQU   DEBXCEA                                                  01229000
DEBPREFX EQU   DEB+20                                                   01230000
DEBXTNP  EQU   DEBPREFX+8                                               01231000
DEBXTN   EQU   0                                                        01232000
DEBXFLG1 EQU   DEBXTN+2                                                 01233000
IDAPLHDR EQU   0                                                        01234000
IDAPLH   EQU   0                                                        01235000
PLHFLG1  EQU   IDAPLH+2                                                 01236000
PLHFLG2  EQU   IDAPLH+3                                                 01237000
PLHEFLGS EQU   IDAPLH+4                                                 01238000
PLHCRBA  EQU   IDAPLH+28                                                01239000
PLHEOVPT EQU   IDAPLH+172                                               01240000
PLHIXSPL EQU   IDAPLH+192                                               01241000
PLHKEY   EQU   IDAPLH+224                                               01242000
IDAERMSG EQU   0                                                        01243000
ERBASE   EQU   IDAERMSG                                                 01244000
ERLGTH   EQU   ERBASE                                                   01245000
ERMLL1   EQU   ERLGTH                                                   01246000
ERMBFRA  EQU   ERBASE+8                                                 01247000
ERJOBNM  EQU   ERBASE+50                                                01248000
ERSTEPNM EQU   ERBASE+59                                                01249000
ERUNIT   EQU   ERBASE+68                                                01250000
ERUNTYPE EQU   ERBASE+72                                                01251000
ERDDNM   EQU   ERBASE+75                                                01252000
EROPER   EQU   ERBASE+84                                                01253000
ERDESC   EQU   ERBASE+91                                                01254000
ERDEVD   EQU   ERBASE+107                                               01255000
ERDAAM   EQU   ERDEVD+15                                                01256000
TCBFIX   EQU   0                                                        01257000
TCBFRS   EQU   TCBFIX                                                   01258000
TCB      EQU   0                                                        01259000
TCBRBP   EQU   TCB                                                      01260000
TCBPIE   EQU   TCB+4                                                    01261000
TCBPMASK EQU   TCBPIE                                                   01262000
TCBTIO   EQU   TCB+12                                                   01263000
TCBCMP   EQU   TCB+16                                                   01264000
TCBCMPF  EQU   TCBCMP                                                   01265000
TCBCPP   EQU   TCBCMPF                                                  01266000
TCBSTCC  EQU   TCBCMPF                                                  01267000
TCBCDBL  EQU   TCBCMPF                                                  01268000
TCBCWTO  EQU   TCBCMPF                                                  01269000
TCBCIND  EQU   TCBCMPF                                                  01270000
TCBCMSG  EQU   TCBCMPF                                                  01271000
TCBTRN   EQU   TCB+20                                                   01272000
TCBABF   EQU   TCBTRN                                                   01273000
TCBMSS   EQU   TCB+24                                                   01274000
TCBPKF   EQU   TCB+28                                                   01275000
TCBFLGS  EQU   TCB+29                                                   01276000
TCBFLGS1 EQU   TCBFLGS                                                  01277000
TCBFLGS2 EQU   TCBFLGS+1                                                01278000
TCBFLGS3 EQU   TCBFLGS+2                                                01279000
TCBFLGS4 EQU   TCBFLGS+3                                                01280000
TCBFLGS5 EQU   TCBFLGS+4                                                01281000
TCBABWF  EQU   TCBFLGS5                                                 01282000
TCBJPQ   EQU   TCB+44                                                   01283000
TCBPURGE EQU   TCBJPQ                                                   01284000
TCBGRS   EQU   TCB+48                                                   01285000
TCBFSA   EQU   TCB+112                                                  01286000
TCBTME   EQU   TCB+120                                                  01287000
TCBJSTCB EQU   TCB+124                                                  01288000
TCBTSFLG EQU   TCB+148                                                  01289000
TCBTSTSK EQU   TCBTSFLG                                                 01290000
TCBSTAB  EQU   TCB+160                                                  01291000
TCBNSTAE EQU   TCBSTAB                                                  01292000
TCBTCT   EQU   TCB+164                                                  01293000
TCBTCTGF EQU   TCBTCT                                                   01294000
TCBSCNDY EQU   TCB+172                                                  01295000
TCBNDSP  EQU   TCBSCNDY                                                 01296000
TCBNDSP1 EQU   TCBNDSP+1                                                01297000
TCBNDSP2 EQU   TCBNDSP+2                                                01298000
TCBNDSP3 EQU   TCBNDSP+3                                                01299000
TCBJSCB  EQU   TCB+180                                                  01300000
TCBRECDE EQU   TCBJSCB                                                  01301000
TCBEXT1  EQU   TCB+196                                                  01302000
TCBBITS  EQU   TCB+200                                                  01303000
TCBNDSP4 EQU   TCBBITS                                                  01304000
TCBNDSP5 EQU   TCBBITS+1                                                01305000
TCBFLGS6 EQU   TCBBITS+2                                                01306000
TCBFLGS7 EQU   TCBBITS+3                                                01307000
TCBDAR   EQU   TCB+204                                                  01308000
TCBDARC  EQU   TCBDAR                                                   01309000
TCBEXT2  EQU   TCB+208                                                  01310000
TCBFOE   EQU   TCB+244                                                  01311000
TCBESTAE EQU   TCB+264                                                  01312000
TCBESTRM EQU   TCBESTAE+1                                               01313000
TCBFBYT1 EQU   TCB+276                                                  01314000
TCBFBYT2 EQU   TCB+277                                                  01315000
TCBRV124 EQU   TCB+278                                                  01316000
TCBRV133 EQU   TCB+279                                                  01317000
TCBXTNT2 EQU   0                                                        01318000
TCBGTF   EQU   TCBXTNT2                                                 01319000
TCBTFLG  EQU   TCBGTF                                                   01320000
TCBRV146 EQU   TCBXTNT2+28                                              01321000
TCBRV155 EQU   TCBXTNT2+29                                              01322000
TCBRV164 EQU   TCBXTNT2+30                                              01323000
TCBRV173 EQU   TCBXTNT2+31                                              01324000
TIOT1    EQU   0                                                        01325000
TIOCNJOB EQU   TIOT1                                                    01326000
TIOCSTEP EQU   TIOT1+8                                                  01327000
TIOENTRY EQU   0                                                        01328000
TIOESTTA EQU   TIOENTRY+1                                               01329000
TIOERLOC EQU   TIOENTRY+2                                               01330000
TIOELINK EQU   TIOERLOC+1                                               01331000
TIOESYOT EQU   TIOELINK                                                 01332000
TIOEDDNM EQU   TIOENTRY+4                                               01333000
TIOESTTC EQU   TIOENTRY+15                                              01334000
TIOESTTB EQU   TIOENTRY+16                                              01335000
POOLSTAR EQU   TIOENTRY+20                                              01336000
DECB     EQU   0                                                        01337000
DECBPTR  EQU   DECB+4                                                   01338000
DECTYPE  EQU   DECBPTR                                                  01339000
DECTYPE1 EQU   DECTYPE                                                  01340000
DECTYPE2 EQU   DECTYPE+1                                                01341000
DECNEXT  EQU   DECB+20                                                  01342000
DECBS01  EQU   0                                                        01343000
DECBECB  EQU   DECBS01                                                  01344000
DECBRB   EQU   DECBECB                                                  01345000
DECBECBF EQU   DECBRB                                                   01346000
DECBTYP1 EQU   DECBS01+4                                                01347000
DECBTYP2 EQU   DECBS01+5                                                01348000
DECBEXC1 EQU   DECBS01+24                                               01349000
DECEXRNF EQU   DECBEXC1                                                 01350000
DECEXRLC EQU   DECBEXC1                                                 01351000
DECEXNSP EQU   DECBEXC1                                                 01352000
DECEXINV EQU   DECBEXC1                                                 01353000
DECEXERR EQU   DECBEXC1                                                 01354000
DECEXUBK EQU   DECBEXC1                                                 01355000
DECEXDUP EQU   DECBEXC1                                                 01356000
DECBEXC2 EQU   DECBS01+25                                               01357000
DECBS02  EQU   0                                                        01358000
@NM00057 EQU   DECBS02                                                  01359000
DECCC2   EQU   @NM00057+1                                               01360000
DECCC3   EQU   @NM00057+2                                               01361000
@NM00059 EQU   DECBS02+4                                                01362000
@NM00060 EQU   @NM00059                                                 01363000
@NM00061 EQU   @NM00059+1                                               01364000
DECTYPRU EQU   @NM00061                                                 01365000
DECNA    EQU   DECBS02+28                                               01366000
DECBS03  EQU   0                                                        01367000
DECCPOL  EQU   DECBS03+20                                               01368000
@NM00069 EQU   DECBS03+36                                               01369000
DECBS04  EQU   0                                                        01370000
@NM00072 EQU   DECBS04+4                                                01371000
@NM00073 EQU   @NM00072                                                 01372000
@NM00076 EQU   DECBS04+8                                                01373000
DECBUFCT EQU   @NM00076                                                 01374000
DECONLTT EQU   DECBUFCT                                                 01375000
DECENTRY EQU   DECBS04+20                                               01376000
DECFLAGS EQU   DECBS04+24                                               01377000
DECWACK  EQU   DECFLAGS                                                 01378000
DECREVRS EQU   DECFLAGS                                                 01379000
DECERRST EQU   DECBS04+29                                               01380000
DECPOLPT EQU   DECBS04+36                                               01381000
IFGACB   EQU   0                                                        01382000
ACBCOMN  EQU   IFGACB                                                   01383000
ACBLENG  EQU   ACBCOMN+2                                                01384000
ACBLENG2 EQU   ACBLENG                                                  01385000
ACBAMBL  EQU   ACBCOMN+4                                                01386000
ACBIXLST EQU   ACBAMBL                                                  01387000
ACBJWA   EQU   ACBIXLST                                                 01388000
ACBMACRF EQU   ACBCOMN+12                                               01389000
ACBMACR1 EQU   ACBMACRF                                                 01390000
ACBADR   EQU   ACBMACR1                                                 01391000
ACBCNV   EQU   ACBMACR1                                                 01392000
ACBMACR2 EQU   ACBMACRF+1                                               01393000
ACBLFB   EQU   ACBCOMN+20                                               01394000
ACBBUFPL EQU   ACBLFB                                                   01395000
ACBRECFM EQU   ACBCOMN+24                                               01396000
ACBCCTYP EQU   ACBCOMN+25                                               01397000
ACBOPT   EQU   ACBCOMN+26                                               01398000
ACBDSORG EQU   ACBOPT                                                   01399000
ACBCROPS EQU   ACBDSORG                                                 01400000
ACBEXLST EQU   ACBCOMN+36                                               01401000
ACBDDNM  EQU   ACBCOMN+40                                               01402000
ACBAMETH EQU   ACBDDNM+3                                                01403000
ACBOFLGS EQU   ACBCOMN+48                                               01404000
ACBEXFG  EQU   ACBOFLGS                                                 01405000
ACBIOSFG EQU   ACBOFLGS                                                 01406000
ACBINFLG EQU   ACBCOMN+50                                               01407000
ACBUJFCB EQU   ACBCOMN+52                                               01408000
ACBWAPTR EQU   ACBUJFCB                                                 01409000
IFGEXLST EQU   0                                                        01410000
EXLCOMN  EQU   IFGEXLST                                                 01411000
EXLLEN   EQU   EXLCOMN+2                                                01412000
EXLEODF  EQU   EXLCOMN+5                                                01413000
EXLEODP  EQU   EXLCOMN+6                                                01414000
EXLSYNF  EQU   EXLCOMN+10                                               01415000
EXLLERF  EQU   EXLCOMN+15                                               01416000
@NM00092 EQU   EXLCOMN+20                                               01417000
EXLLGNF  EQU   EXLCOMN+25                                               01418000
EXLLGNE  EQU   EXLLGNF                                                  01419000
EXLJRNF  EQU   EXLCOMN+30                                               01420000
EXLOPNF  EQU   EXLCOMN+35                                               01421000
IFGEXLEF EQU   0                                                        01422000
EXLENTRY EQU   IFGEXLEF                                                 01423000
EXLFLAG  EQU   EXLENTRY                                                 01424000
EXLENFL  EQU   EXLFLAG                                                  01425000
EXLEXITP EQU   EXLENTRY+1                                               01426000
VSAMMSG  EQU   8                                                        01427000
SYNAD    EQU   0                                                        01428000
R14SAVE  EQU   12                                                       01429000
R0SAVE   EQU   20                                                       01430000
SPARMS   EQU   0                                                        01431000
PARM2    EQU   SPARMS+1                                                 01432000
PARM1    EQU   SPARMS+4                                                 01433000
SVRB     EQU   0                                                        01434000
SVRBLINK EQU   SVRB+29                                                  01435000
SVRBREGS EQU   SVRB+32                                                  01436000
SVRBREG2 EQU   SVRBREGS+8                                               01437000
IKEBC    EQU   0                                                        01438000
IKEBF15  EQU   0                                                        01439000
IKEBF31  EQU   0                                                        01440000
IKEBP15  EQU   0                                                        01441000
IKEBP31  EQU   0                                                        01442000
IKEBP8   EQU   0                                                        01443000
USERSAV  EQU   0                                                        01444000
DEBBAS02 EQU   DEBBASND                                                 01445000
DEBDDS1  EQU   DEBBAS02                                                 01446000
DEBSUCBA EQU   DEBDDS1                                                  01447000
DEBRDCB  EQU   DEBDDS1+4                                                01448000
DEBPDCB  EQU   DEBDDS1+8                                                01449000
DEBWDCB  EQU   DEBDDS1+12                                               01450000
DEBBAS01 EQU   DEBBASND                                                 01451000
DEBISAM  EQU   DEBBAS01                                                 01452000
DEBFIEAD EQU   DEBISAM                                                  01453000
DEBFPEAD EQU   DEBISAM+4                                                01454000
DEBFOEAD EQU   DEBISAM+8                                                01455000
DEBEXPT  EQU   DEBISAM+12                                               01456000
DEBRPSID EQU   DEBEXPT                                                  01457000
TCBPTR   EQU   DEBTCBAD                                                 01458000
TIOTPTR  EQU   TCBTIO                                                   01459000
TIOEDEVE EQU   TIOESTTB                                                 01460000
TIOSTTB  EQU   TIOEDEVE                                                 01461000
DECBS05  EQU   DECNEXT                                                  01462000
BLNKAREA EQU   ERMBFRA                                                  01463000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01464000
DECBLFMT EQU   DECBS05+8                                                01465000
DECBLNNM EQU   DECBS05+4                                                01466000
DECBHDRA EQU   DECBS05                                                  01467000
TIOUCBP  EQU   TIOEDEVE+1                                               01468000
TIOVERF  EQU   TIOSTTB                                                  01469000
TIOUNLD  EQU   TIOSTTB                                                  01470000
TIOMNTD  EQU   TIOSTTB                                                  01471000
TIOSETU  EQU   TIOSTTB                                                  01472000
TIOVLSR  EQU   TIOSTTB                                                  01473000
TIOPVIO  EQU   TIOSTTB                                                  01474000
TIOREQD  EQU   TIOSTTB                                                  01475000
TIOUSED  EQU   TIOSTTB                                                  01476000
DEBEXPTA EQU   DEBEXPT+1                                                01477000
DEBRSV12 EQU   DEBRPSID                                                 01478000
DEBRSV11 EQU   DEBRPSID                                                 01479000
DEBRSV10 EQU   DEBRPSID                                                 01480000
DEBRSV09 EQU   DEBRPSID                                                 01481000
DEBRPSAP EQU   DEBRPSID                                                 01482000
DEBRPSO  EQU   DEBRPSID                                                 01483000
DEBRPSI  EQU   DEBRPSID                                                 01484000
DEBRPSP  EQU   DEBRPSID                                                 01485000
DEBFOEB  EQU   DEBFOEAD+1                                               01486000
DEBNOEE  EQU   DEBFOEAD                                                 01487000
DEBFPEB  EQU   DEBFPEAD+1                                               01488000
DEBNPEE  EQU   DEBFPEAD                                                 01489000
DEBFIEB  EQU   DEBFIEAD+1                                               01490000
DEBNIEE  EQU   DEBFIEAD                                                 01491000
DEBWDCBA EQU   DEBWDCB+1                                                01492000
DEBRSV08 EQU   DEBWDCB                                                  01493000
DEBPDCBA EQU   DEBPDCB+1                                                01494000
DEBRSV07 EQU   DEBPDCB                                                  01495000
DEBRDCBA EQU   DEBRDCB+1                                                01496000
DEBRSV06 EQU   DEBRDCB                                                  01497000
DEBSUCBB EQU   DEBSUCBA+1                                               01498000
DEBSDVM  EQU   DEBSUCBA                                                 01499000
SVRBREG1 EQU   SVRBREGS+4                                               01500000
SVRBREG0 EQU   SVRBREGS                                                 01501000
SVRBWCF  EQU   SVRB+28                                                  01502000
@NM00103 EQU   SVRB                                                     01503000
@NM00102 EQU   SPARMS                                                   01504000
EXLEADDR EQU   EXLEXITP                                                 01505000
EXLEXITM EQU   EXLENFL                                                  01506000
EXLLVNTM EQU   EXLENFL                                                  01507000
EXLGVNTM EQU   EXLENFL                                                  01508000
@NM00101 EQU   EXLENFL                                                  01509000
EXLLNK   EQU   EXLENFL                                                  01510000
EXLACTM  EQU   EXLENFL                                                  01511000
EXLSPEC  EQU   EXLENFL                                                  01512000
EXLOPNP  EQU   EXLCOMN+36                                               01513000
@NM00100 EQU   EXLOPNF                                                  01514000
EXLOPNK  EQU   EXLOPNF                                                  01515000
EXLOPNA  EQU   EXLOPNF                                                  01516000
EXLOPNS  EQU   EXLOPNF                                                  01517000
EXLJRNP  EQU   EXLCOMN+31                                               01518000
@NM00099 EQU   EXLJRNF                                                  01519000
EXLJRNK  EQU   EXLJRNF                                                  01520000
EXLJRNA  EQU   EXLJRNF                                                  01521000
EXLJRNS  EQU   EXLJRNF                                                  01522000
EXLLGNP  EQU   EXLCOMN+26                                               01523000
EXLLGNEX EQU   EXLLGNE                                                  01524000
EXLLGNLE EQU   EXLLGNE                                                  01525000
EXLLGNGE EQU   EXLLGNE                                                  01526000
@NM00098 EQU   EXLLGNF                                                  01527000
EXLLGNK  EQU   EXLLGNF                                                  01528000
EXLLGNA  EQU   EXLLGNF                                                  01529000
EXLLGNS  EQU   EXLLGNF                                                  01530000
@NM00097 EQU   EXLCOMN+21                                               01531000
@NM00096 EQU   @NM00092                                                 01532000
@NM00095 EQU   @NM00092                                                 01533000
@NM00094 EQU   @NM00092                                                 01534000
@NM00093 EQU   @NM00092                                                 01535000
EXLLERP  EQU   EXLCOMN+16                                               01536000
@NM00091 EQU   EXLLERF                                                  01537000
EXLLERK  EQU   EXLLERF                                                  01538000
EXLLERA  EQU   EXLLERF                                                  01539000
EXLLERS  EQU   EXLLERF                                                  01540000
EXLSYNP  EQU   EXLCOMN+11                                               01541000
@NM00090 EQU   EXLSYNF                                                  01542000
EXLSYNK  EQU   EXLSYNF                                                  01543000
EXLSYNA  EQU   EXLSYNF                                                  01544000
EXLSYNS  EQU   EXLSYNF                                                  01545000
@NM00089 EQU   EXLEODF                                                  01546000
EXLEODK  EQU   EXLEODF                                                  01547000
EXLEODA  EQU   EXLEODF                                                  01548000
EXLEODS  EQU   EXLEODF                                                  01549000
@NM00088 EQU   EXLCOMN+4                                                01550000
EXLLEN2  EQU   EXLLEN                                                   01551000
EXLSTYP  EQU   EXLCOMN+1                                                01552000
EXLID    EQU   EXLCOMN                                                  01553000
ACBAPID  EQU   ACBCOMN+72                                               01554000
ACBCBMWA EQU   ACBCOMN+68                                               01555000
ACBUAPTR EQU   ACBCOMN+64                                               01556000
ACBLRECL EQU   ACBCOMN+62                                               01557000
ACBBLKSZ EQU   ACBCOMN+60                                               01558000
ACBBUFSP EQU   ACBCOMN+56                                               01559000
@NM00087 EQU   ACBWAPTR+1                                               01560000
ACBOPTN  EQU   ACBWAPTR                                                 01561000
ACBCAT   EQU   ACBINFLG                                                 01562000
ACBIJRQE EQU   ACBINFLG                                                 01563000
ACBJEPS  EQU   ACBINFLG                                                 01564000
@NM00086 EQU   ACBINFLG                                                 01565000
ACBERFLG EQU   ACBCOMN+49                                               01566000
ACBBUSY  EQU   ACBIOSFG                                                 01567000
ACBLOCK  EQU   ACBEXFG                                                  01568000
@NM00085 EQU   ACBOFLGS                                                 01569000
ACBDSERR EQU   ACBOFLGS                                                 01570000
ACBOPEN  EQU   ACBOFLGS                                                 01571000
ACBEOV   EQU   ACBOFLGS                                                 01572000
@NM00084 EQU   ACBOFLGS                                                 01573000
ACBDEB   EQU   ACBDDNM+5                                                01574000
ACBERFL  EQU   ACBDDNM+4                                                01575000
ACBAM    EQU   ACBAMETH                                                 01576000
ACBINFL  EQU   ACBDDNM+2                                                01577000
ACBTIOT  EQU   ACBDDNM                                                  01578000
ACBUEL   EQU   ACBEXLST                                                 01579000
ACBPASSW EQU   ACBCOMN+32                                               01580000
@NM00083 EQU   ACBCOMN+28                                               01581000
@NM00082 EQU   ACBDSORG+1                                               01582000
ACBDORGA EQU   ACBDSORG+1                                               01583000
@NM00081 EQU   ACBDSORG                                                 01584000
ACBCRNRE EQU   ACBCROPS                                                 01585000
ACBCRNCK EQU   ACBCROPS                                                 01586000
ACBASA   EQU   ACBCCTYP                                                 01587000
@NM00080 EQU   ACBCCTYP                                                 01588000
ACBRECAF EQU   ACBRECFM                                                 01589000
ACBJBUF  EQU   ACBBUFPL+2                                               01590000
@NM00079 EQU   ACBBUFPL                                                 01591000
ACBBUFNI EQU   ACBCOMN+18                                               01592000
ACBBUFND EQU   ACBCOMN+16                                               01593000
ACBSTRNO EQU   ACBCOMN+14                                               01594000
@NM00078 EQU   ACBMACR2                                                 01595000
ACBLOGON EQU   ACBMACR2                                                 01596000
ACBSKP   EQU   ACBMACR2                                                 01597000
ACBCHN   EQU   ACBMACR2                                                 01598000
ACBCBRD  EQU   ACBMACR2                                                 01599000
ACBCBOPN EQU   ACBMACR2                                                 01600000
ACBUBF   EQU   ACBMACR1                                                 01601000
ACBOUT   EQU   ACBMACR1                                                 01602000
ACBIN    EQU   ACBMACR1                                                 01603000
ACBDIR   EQU   ACBMACR1                                                 01604000
ACBSEQ   EQU   ACBMACR1                                                 01605000
ACBBLK   EQU   ACBCNV                                                   01606000
ACBADD   EQU   ACBADR                                                   01607000
ACBKEY   EQU   ACBMACR1                                                 01608000
ACBINRTN EQU   ACBCOMN+8                                                01609000
ACBIBCT  EQU   ACBJWA                                                   01610000
ACBLEN2  EQU   ACBLENG2                                                 01611000
ACBSTYP  EQU   ACBCOMN+1                                                01612000
ACBID    EQU   ACBCOMN                                                  01613000
DECWAREA EQU   DECBS04+44                                               01614000
DECWLNG  EQU   DECBS04+42                                               01615000
DECRSV56 EQU   DECBS04+40                                               01616000
DECPOLPA EQU   DECPOLPT+1                                               01617000
DECNDXPL EQU   DECPOLPT                                                 01618000
DECADRPT EQU   DECBS04+32                                               01619000
DECCSWST EQU   DECBS04+30                                               01620000
DECRSV55 EQU   DECERRST                                                 01621000
DECRSV54 EQU   DECERRST                                                 01622000
DECRSV53 EQU   DECERRST                                                 01623000
DECDSABL EQU   DECERRST                                                 01624000
DECDIAGN EQU   DECERRST                                                 01625000
DECERPER EQU   DECERRST                                                 01626000
DECUNDEF EQU   DECERRST                                                 01627000
DECSIO3  EQU   DECERRST                                                 01628000
DECTPCOD EQU   DECBS04+28                                               01629000
DECRESPN EQU   DECBS04+26                                               01630000
DECRLN   EQU   DECBS04+25                                               01631000
DECSTXNQ EQU   DECFLAGS                                                 01632000
DECSSMSG EQU   DECREVRS                                                 01633000
DECNEGRP EQU   DECFLAGS                                                 01634000
DECNOBUF EQU   DECFLAGS                                                 01635000
DECBADID EQU   DECFLAGS                                                 01636000
DECALTAC EQU   DECFLAGS                                                 01637000
DECDIFAC EQU   DECWACK                                                  01638000
DECERRMS EQU   DECWACK                                                  01639000
DECENTRA EQU   DECENTRY+1                                               01640000
DECCMCOD EQU   DECENTRY                                                 01641000
DECCOUNT EQU   DECBS04+18                                               01642000
DECSENS1 EQU   DECBS04+17                                               01643000
DECSENS0 EQU   DECBS04+16                                               01644000
@NM00077 EQU   DECBS04+12                                               01645000
DECDCBAA EQU   @NM00076+1                                               01646000
DECRSV52 EQU   DECONLTT                                                 01647000
DECRSV51 EQU   DECONLTT                                                 01648000
DECRSV50 EQU   DECONLTT                                                 01649000
DECRSV49 EQU   DECONLTT                                                 01650000
DECRSV48 EQU   DECONLTT                                                 01651000
DECRSV47 EQU   DECONLTT                                                 01652000
DECRCVMS EQU   DECONLTT                                                 01653000
DECONLTS EQU   DECONLTT                                                 01654000
@NM00075 EQU   DECBS04+6                                                01655000
@NM00074 EQU   @NM00072+1                                               01656000
DECSLNTH EQU   @NM00073                                                 01657000
DECSAREA EQU   @NM00073                                                 01658000
DECSTRME EQU   @NM00073                                                 01659000
DECRSV46 EQU   @NM00073                                                 01660000
DECRSV45 EQU   @NM00073                                                 01661000
DECRSV44 EQU   @NM00073                                                 01662000
DECRSV43 EQU   @NM00073                                                 01663000
DECRDAPL EQU   @NM00073                                                 01664000
@NM00071 EQU   DECBS04                                                  01665000
@NM00070 EQU   @NM00069+1                                               01666000
DECRSV42 EQU   @NM00069                                                 01667000
DECADRCH EQU   DECBS03+32                                               01668000
DECRSV41 EQU   DECBS03+28                                               01669000
DECRSV40 EQU   DECBS03+26                                               01670000
DECUCBDX EQU   DECBS03+25                                               01671000
DECRSV39 EQU   DECBS03+24                                               01672000
DECCPOLA EQU   DECCPOL+1                                                01673000
DECNMMSG EQU   DECCPOL                                                  01674000
DECRSV38 EQU   DECBS03+16                                               01675000
@NM00068 EQU   DECBS03+12                                               01676000
@NM00067 EQU   DECBS03+8                                                01677000
@NM00066 EQU   DECBS03+6                                                01678000
DECOPCOD EQU   DECBS03+5                                                01679000
DECRSV37 EQU   DECBS03+4                                                01680000
LINEDECB EQU   DECBS03                                                  01681000
DECNAA   EQU   DECNA+1                                                  01682000
DECRSV36 EQU   DECNA                                                    01683000
DECRECPT EQU   DECBS02+24                                               01684000
DECKYADR EQU   DECBS02+20                                               01685000
@NM00065 EQU   DECBS02+16                                               01686000
@NM00064 EQU   DECBS02+12                                               01687000
@NM00063 EQU   DECBS02+8                                                01688000
@NM00062 EQU   DECBS02+6                                                01689000
DECRSV35 EQU   @NM00061                                                 01690000
DECWRADD EQU   @NM00061                                                 01691000
DECSRKEY EQU   @NM00061                                                 01692000
DECOPRD  EQU   @NM00061                                                 01693000
DECTYPR  EQU   DECTYPRU                                                 01694000
DECTYPU  EQU   DECTYPRU                                                 01695000
DECBKLNS EQU   @NM00061                                                 01696000
DECKEYS  EQU   @NM00061                                                 01697000
DECRELBA EQU   @NM00060                                                 01698000
DECRDEX  EQU   @NM00060                                                 01699000
DECDYNBF EQU   @NM00060                                                 01700000
DECACTAD EQU   @NM00060                                                 01701000
DECFDBCK EQU   @NM00060                                                 01702000
DECEXSRC EQU   @NM00060                                                 01703000
DECOFLOW EQU   @NM00060                                                 01704000
DECVERFY EQU   @NM00060                                                 01705000
DECRSV34 EQU   @NM00057+3                                               01706000
DECCCKFF EQU   DECCC3                                                   01707000
DECCCOPT EQU   DECCC3                                                   01708000
DECCCSDK EQU   DECCC3                                                   01709000
DECCCWDI EQU   DECCC3                                                   01710000
DECCCNBK EQU   DECCC3                                                   01711000
DECCCEXS EQU   DECCC3                                                   01712000
DECCCWRI EQU   DECCC3                                                   01713000
DECRSV33 EQU   DECCC3                                                   01714000
DECCCREX EQU   DECCC2                                                   01715000
DECCCUER EQU   DECCC2                                                   01716000
DECCCEOD EQU   DECCC2                                                   01717000
DECCCERR EQU   DECCC2                                                   01718000
DECCCINV EQU   DECCC2                                                   01719000
DECCCNSP EQU   DECCC2                                                   01720000
DECCCRLC EQU   DECCC2                                                   01721000
DECCCRNF EQU   DECCC2                                                   01722000
@NM00058 EQU   @NM00057                                                 01723000
DECEXRKU EQU   DECBEXC2                                                 01724000
DECEXASR EQU   DECBEXC2                                                 01725000
DECRSV32 EQU   DECBEXC2                                                 01726000
DECRSV31 EQU   DECBEXC2                                                 01727000
DECRSV30 EQU   DECBEXC2                                                 01728000
DECRSV29 EQU   DECBEXC2                                                 01729000
DECRSV28 EQU   DECBEXC2                                                 01730000
DECRSV27 EQU   DECBEXC2                                                 01731000
DECEXOFL EQU   DECBEXC1                                                 01732000
DECBKEY  EQU   DECBS01+20                                               01733000
DECBLOGR EQU   DECBS01+16                                               01734000
DECBAREA EQU   DECBS01+12                                               01735000
DECBDCBA EQU   DECBS01+8                                                01736000
DECBLGTH EQU   DECBS01+6                                                01737000
DECRSV26 EQU   DECBTYP2                                                 01738000
DECRSV25 EQU   DECBTYP2                                                 01739000
DECBWRKN EQU   DECBTYP2                                                 01740000
DECBWRK  EQU   DECBTYP2                                                 01741000
DECRSV24 EQU   DECBTYP2                                                 01742000
DECBRDKU EQU   DECBTYP2                                                 01743000
DECRSV23 EQU   DECBTYP2                                                 01744000
DECBRDK  EQU   DECBTYP2                                                 01745000
DECBARS  EQU   DECBTYP1                                                 01746000
DECBLNS  EQU   DECBTYP1                                                 01747000
DECRSV22 EQU   DECBTYP1                                                 01748000
DECRSV21 EQU   DECBTYP1                                                 01749000
DECRSV20 EQU   DECBTYP1                                                 01750000
DECRSV19 EQU   DECBTYP1                                                 01751000
DECRSV18 EQU   DECBTYP1                                                 01752000
DECRSV17 EQU   DECBTYP1                                                 01753000
DECBRBA  EQU   DECBRB+1                                                 01754000
DECRSV16 EQU   DECBECBF                                                 01755000
DECRSV15 EQU   DECBECBF                                                 01756000
DECRSV14 EQU   DECBECBF                                                 01757000
DECRSV13 EQU   DECBECBF                                                 01758000
DECRSV12 EQU   DECBECBF                                                 01759000
DECRSV11 EQU   DECBECBF                                                 01760000
DECBPOST EQU   DECBECBF                                                 01761000
DECBWAIT EQU   DECBECBF                                                 01762000
DECNEXTA EQU   DECNEXT+1                                                01763000
DECRSV10 EQU   DECNEXT                                                  01764000
DECIOBPT EQU   DECB+16                                                  01765000
DECAREA  EQU   DECB+12                                                  01766000
DECDCBAD EQU   DECB+8                                                   01767000
DECLNGTH EQU   DECBPTR+2                                                01768000
DECWRSFR EQU   DECTYPE2                                                 01769000
DECRSV09 EQU   DECTYPE2                                                 01770000
DECWRSZ  EQU   DECTYPE2                                                 01771000
DECRSV08 EQU   DECTYPE2                                                 01772000
DECWRSD  EQU   DECTYPE2                                                 01773000
DECWRSF  EQU   DECTYPE2                                                 01774000
DECRDSB  EQU   DECTYPE2                                                 01775000
DECRDSF  EQU   DECTYPE2                                                 01776000
DECRSV07 EQU   DECTYPE1                                                 01777000
DECRSV06 EQU   DECTYPE1                                                 01778000
DECRSV05 EQU   DECTYPE1                                                 01779000
DECRSV04 EQU   DECTYPE1                                                 01780000
DECRSV03 EQU   DECTYPE1                                                 01781000
DECRSV02 EQU   DECTYPE1                                                 01782000
DECRSV01 EQU   DECTYPE1                                                 01783000
DECLNS   EQU   DECTYPE1                                                 01784000
DECSDECB EQU   DECB                                                     01785000
TIOTFEND EQU   POOLSTAR+16                                              01786000
TIOPSLOT EQU   POOLSTAR+13                                              01787000
TIOPSTTB EQU   POOLSTAR+12                                              01788000
TIOPPOOL EQU   POOLSTAR+4                                               01789000
TIOPNSRT EQU   POOLSTAR+3                                               01790000
@NM00056 EQU   POOLSTAR+2                                               01791000
TIOPNSLT EQU   POOLSTAR+1                                               01792000
@NM00055 EQU   POOLSTAR                                                 01793000
TIOEFSRT EQU   TIOENTRY+17                                              01794000
TIOSVERF EQU   TIOESTTB                                                 01795000
TIOSUNLD EQU   TIOESTTB                                                 01796000
TIOSMNTD EQU   TIOESTTB                                                 01797000
TIOSSETU EQU   TIOESTTB                                                 01798000
TIOSVLSR EQU   TIOESTTB                                                 01799000
TIOSPVIO EQU   TIOESTTB                                                 01800000
TIOSREQD EQU   TIOESTTB                                                 01801000
TIOSUSED EQU   TIOESTTB                                                 01802000
TIOSBALS EQU   TIOESTTC                                                 01803000
TIOSBALP EQU   TIOESTTC                                                 01804000
TIOSVOLS EQU   TIOESTTC                                                 01805000
TIOSVOLP EQU   TIOESTTC                                                 01806000
TIOSAFFS EQU   TIOESTTC                                                 01807000
TIOSAFFP EQU   TIOESTTC                                                 01808000
TIOSDEFR EQU   TIOESTTC                                                 01809000
TIOSDKCR EQU   TIOESTTC                                                 01810000
TIOEJFCB EQU   TIOENTRY+12                                              01811000
TIOTREM  EQU   TIOELINK                                                 01812000
TIOESSDS EQU   TIOESYOT                                                 01813000
TIOESYIN EQU   TIOELINK                                                 01814000
TIOEQNAM EQU   TIOELINK                                                 01815000
TIOEDYNM EQU   TIOELINK                                                 01816000
TIOTTERM EQU   TIOELINK                                                 01817000
TIOTRV01 EQU   TIOELINK                                                 01818000
TIOSYOUT EQU   TIOELINK                                                 01819000
TIOEWTCT EQU   TIOERLOC                                                 01820000
TIOSDSP2 EQU   TIOESTTA                                                 01821000
TIOSDSP1 EQU   TIOESTTA                                                 01822000
TIOSLABL EQU   TIOESTTA                                                 01823000
TIOSDADS EQU   TIOESTTA                                                 01824000
TIOSJBLB EQU   TIOESTTA                                                 01825000
TIOSPLTS EQU   TIOESTTA                                                 01826000
TIOSPLTP EQU   TIOESTTA                                                 01827000
TIOSLTYP EQU   TIOESTTA                                                 01828000
TIOELNGH EQU   TIOENTRY                                                 01829000
@NM00054 EQU   TCBXTNT2+32                                              01830000
TCBRV181 EQU   TCBRV173                                                 01831000
TCBRV180 EQU   TCBRV173                                                 01832000
TCBRV179 EQU   TCBRV173                                                 01833000
TCBRV178 EQU   TCBRV173                                                 01834000
TCBRV177 EQU   TCBRV173                                                 01835000
TCBRV176 EQU   TCBRV173                                                 01836000
TCBRV175 EQU   TCBRV173                                                 01837000
TCBRV174 EQU   TCBRV173                                                 01838000
TCBRV172 EQU   TCBRV164                                                 01839000
TCBRV171 EQU   TCBRV164                                                 01840000
TCBRV170 EQU   TCBRV164                                                 01841000
TCBRV169 EQU   TCBRV164                                                 01842000
TCBRV168 EQU   TCBRV164                                                 01843000
TCBRV167 EQU   TCBRV164                                                 01844000
TCBRV166 EQU   TCBRV164                                                 01845000
TCBRV165 EQU   TCBRV164                                                 01846000
TCBRV163 EQU   TCBRV155                                                 01847000
TCBRV162 EQU   TCBRV155                                                 01848000
TCBRV161 EQU   TCBRV155                                                 01849000
TCBRV160 EQU   TCBRV155                                                 01850000
TCBRV159 EQU   TCBRV155                                                 01851000
TCBRV158 EQU   TCBRV155                                                 01852000
TCBRV157 EQU   TCBRV155                                                 01853000
TCBRV156 EQU   TCBRV155                                                 01854000
TCBRV154 EQU   TCBRV146                                                 01855000
TCBRV153 EQU   TCBRV146                                                 01856000
TCBRV152 EQU   TCBRV146                                                 01857000
TCBRV151 EQU   TCBRV146                                                 01858000
TCBRV150 EQU   TCBRV146                                                 01859000
TCBRV149 EQU   TCBRV146                                                 01860000
TCBRV148 EQU   TCBRV146                                                 01861000
TCBRV147 EQU   TCBRV146                                                 01862000
TCBRV145 EQU   TCBXTNT2+26                                              01863000
TCBRV144 EQU   TCBXTNT2+24                                              01864000
TCBRV143 EQU   TCBXTNT2+20                                              01865000
TCBRV142 EQU   TCBXTNT2+16                                              01866000
TCBRSV49 EQU   TCBXTNT2+12                                              01867000
TCBRSV48 EQU   TCBXTNT2+8                                               01868000
TCBRCMP  EQU   TCBXTNT2+5                                               01869000
TCBRSVAB EQU   TCBXTNT2+4                                               01870000
TCBGTFA  EQU   TCBGTF+1                                                 01871000
TCBRSV47 EQU   TCBTFLG                                                  01872000
TCBRSV46 EQU   TCBTFLG                                                  01873000
TCBRSV45 EQU   TCBTFLG                                                  01874000
TCBRSV44 EQU   TCBTFLG                                                  01875000
TCBRSV43 EQU   TCBTFLG                                                  01876000
TCBDSPIT EQU   TCBTFLG                                                  01877000
TCBERRTN EQU   TCBTFLG                                                  01878000
TCBASYNC EQU   TCBTFLG                                                  01879000
@NM00053 EQU   TCB+296                                                  01880000
TCBSCBQ  EQU   TCB+292                                                  01881000
TCBSWASA EQU   TCB+288                                                  01882000
TCBDBTB  EQU   TCB+284                                                  01883000
TCBRPT   EQU   TCB+280                                                  01884000
TCBRV141 EQU   TCBRV133                                                 01885000
TCBRV140 EQU   TCBRV133                                                 01886000
TCBRV139 EQU   TCBRV133                                                 01887000
TCBRV138 EQU   TCBRV133                                                 01888000
TCBRV137 EQU   TCBRV133                                                 01889000
TCBRV136 EQU   TCBRV133                                                 01890000
TCBRV135 EQU   TCBRV133                                                 01891000
TCBRV134 EQU   TCBRV133                                                 01892000
TCBRV132 EQU   TCBRV124                                                 01893000
TCBRV131 EQU   TCBRV124                                                 01894000
TCBRV130 EQU   TCBRV124                                                 01895000
TCBRV129 EQU   TCBRV124                                                 01896000
TCBRV128 EQU   TCBRV124                                                 01897000
TCBRV127 EQU   TCBRV124                                                 01898000
TCBRV126 EQU   TCBRV124                                                 01899000
TCBRV125 EQU   TCBRV124                                                 01900000
TCBRV123 EQU   TCBFBYT2                                                 01901000
TCBRV122 EQU   TCBFBYT2                                                 01902000
TCBECBNV EQU   TCBFBYT2                                                 01903000
TCBSSSYN EQU   TCBFBYT2                                                 01904000
TCBFPRAP EQU   TCBFBYT2                                                 01905000
TCBFDW   EQU   TCBFBYT2                                                 01906000
TCBFMW   EQU   TCBFBYT2                                                 01907000
TCBCNCB  EQU   TCBFBYT2                                                 01908000
TCBLLH   EQU   TCBFBYT1                                                 01909000
TCBRV113 EQU   TCBFBYT1                                                 01910000
TCBEOT   EQU   TCBFBYT1                                                 01911000
TCBRTM2  EQU   TCBFBYT1                                                 01912000
TCBPGNLY EQU   TCBFBYT1                                                 01913000
TCBNDIOS EQU   TCBFBYT1                                                 01914000
TCBACTIV EQU   TCBFBYT1                                                 01915000
TCBEOTFM EQU   TCBFBYT1                                                 01916000
TCBAFFN  EQU   TCB+274                                                  01917000
TCBCCPVI EQU   TCB+272                                                  01918000
TCBUKYSP EQU   TCB+268                                                  01919000
TCBMODE  EQU   TCBESTAE+3                                               01920000
TCBERTYP EQU   TCBESTAE+2                                               01921000
TCBRV314 EQU   TCBESTRM                                                 01922000
TCBRV313 EQU   TCBESTRM                                                 01923000
TCBRV312 EQU   TCBESTRM                                                 01924000
TCBRV311 EQU   TCBESTRM                                                 01925000
TCBRV310 EQU   TCBESTRM                                                 01926000
TCBRV309 EQU   TCBESTRM                                                 01927000
TCBRV308 EQU   TCBESTRM                                                 01928000
TCBETERM EQU   TCBESTRM                                                 01929000
TCBSCBKY EQU   TCBESTAE                                                 01930000
TCBRTM12 EQU   TCB+260                                                  01931000
TCBTCBID EQU   TCB+256                                                  01932000
TCBRSV96 EQU   TCB+252                                                  01933000
TCBSWA   EQU   TCB+248                                                  01934000
TCBFOEA  EQU   TCBFOE+1                                                 01935000
TCBRSV42 EQU   TCBFOE                                                   01936000
TCBRV306 EQU   TCB+240                                                  01937000
TCBRSV41 EQU   TCB+239                                                  01938000
TCBTID   EQU   TCB+238                                                  01939000
TCBRSVAA EQU   TCB+237                                                  01940000
TCBABCUR EQU   TCB+236                                                  01941000
TCBTMSAV EQU   TCB+232                                                  01942000
TCBIOTIM EQU   TCB+228                                                  01943000
TCBRTWA  EQU   TCB+224                                                  01944000
TCBBACK  EQU   TCB+220                                                  01945000
TCBTIRB  EQU   TCB+216                                                  01946000
TCBAECB  EQU   TCB+212                                                  01947000
TCBEXT2A EQU   TCBEXT2+1                                                01948000
TCBRSV39 EQU   TCBEXT2                                                  01949000
TCBSTMCT EQU   TCB+207                                                  01950000
TCBSYSCT EQU   TCB+206                                                  01951000
TCBRSV37 EQU   TCB+205                                                  01952000
TCBEXSVC EQU   TCBDAR                                                   01953000
TCBRSV36 EQU   TCBDAR                                                   01954000
TCBDARWT EQU   TCBDAR                                                   01955000
TCBDARO  EQU   TCBDAR                                                   01956000
TCBDARMC EQU   TCBDARC                                                  01957000
TCBDARD  EQU   TCBDAR                                                   01958000
TCBDARS  EQU   TCBDAR                                                   01959000
TCBDARP  EQU   TCBDAR                                                   01960000
TCBGTOFM EQU   TCBFLGS7                                                 01961000
TCBADMP  EQU   TCBFLGS7                                                 01962000
TCBRSTSK EQU   TCBFLGS7                                                 01963000
TCBRSV35 EQU   TCBFLGS7                                                 01964000
TCBSTACK EQU   TCBFLGS7                                                 01965000
TCBRSV34 EQU   TCBFLGS7                                                 01966000
TCBRSV33 EQU   TCBFLGS7                                                 01967000
TCBGPECB EQU   TCBFLGS7                                                 01968000
TCBNTJS  EQU   TCBFLGS6                                                 01969000
TCBAPG   EQU   TCBFLGS6                                                 01970000
TCBMIGR  EQU   TCBFLGS6                                                 01971000
TCBRV303 EQU   TCBFLGS6                                                 01972000
TCBSPVLK EQU   TCBFLGS6                                                 01973000
TCBCPU   EQU   TCBFLGS6                                                 01974000
TCBPIE17 EQU   TCBFLGS6                                                 01975000
TCBRV    EQU   TCBFLGS6                                                 01976000
TCBRSV79 EQU   TCBNDSP5                                                 01977000
TCBRSV78 EQU   TCBNDSP5                                                 01978000
TCBRSV77 EQU   TCBNDSP5                                                 01979000
TCBRSV76 EQU   TCBNDSP5                                                 01980000
TCBRSV75 EQU   TCBNDSP5                                                 01981000
TCBRSV74 EQU   TCBNDSP5                                                 01982000
TCBRSV95 EQU   TCBNDSP5                                                 01983000
TCBRSV94 EQU   TCBNDSP5                                                 01984000
TCBRSV93 EQU   TCBNDSP4                                                 01985000
TCBRSV92 EQU   TCBNDSP4                                                 01986000
TCBRSV91 EQU   TCBNDSP4                                                 01987000
TCBRSV90 EQU   TCBNDSP4                                                 01988000
TCBRSV89 EQU   TCBNDSP4                                                 01989000
TCBRSV88 EQU   TCBNDSP4                                                 01990000
TCBRSV87 EQU   TCBNDSP4                                                 01991000
TCBRSV86 EQU   TCBNDSP4                                                 01992000
TCBEXT1A EQU   TCBEXT1+1                                                01993000
TCBRSV32 EQU   TCBEXT1                                                  01994000
TCBEXCPD EQU   TCB+192                                                  01995000
TCBIOBRC EQU   TCB+188                                                  01996000
TCBDDWTC EQU   TCB+186                                                  01997000
TCBDDEXC EQU   TCB+184                                                  01998000
TCBJSCBB EQU   TCBJSCB+1                                                01999000
@NM00052 EQU   TCBRECDE                                                 02000000
TCBREC   EQU   TCBRECDE                                                 02001000
TCBMDIDS EQU   TCB+176                                                  02002000
TCBNDINT EQU   TCBNDSP3                                                 02003000
TCBRSV27 EQU   TCBNDSP3                                                 02004000
TCBRSV26 EQU   TCBNDSP3                                                 02005000
TCBRSV25 EQU   TCBNDSP3                                                 02006000
TCBRSV24 EQU   TCBNDSP3                                                 02007000
TCBSRBND EQU   TCBNDSP3                                                 02008000
TCBRV302 EQU   TCBNDSP3                                                 02009000
TCBLJSND EQU   TCBNDSP3                                                 02010000
TCBABE   EQU   TCBNDSP2                                                 02011000
TCBDSS   EQU   TCBNDSP2                                                 02012000
TCBOWAIT EQU   TCBNDSP2                                                 02013000
TCBIWAIT EQU   TCBNDSP2                                                 02014000
TCBNDTS  EQU   TCBNDSP2                                                 02015000
TCBNDSVC EQU   TCBNDSP2                                                 02016000
TCBSTPP  EQU   TCBNDSP2                                                 02017000
TCBABD   EQU   TCBNDSP2                                                 02018000
TCBRSV22 EQU   TCBNDSP1                                                 02019000
TCBPIEND EQU   TCBNDSP1                                                 02020000
TCBTPSP  EQU   TCBNDSP1                                                 02021000
TCBDDRND EQU   TCBNDSP1                                                 02022000
TCBRSPND EQU   TCBNDSP1                                                 02023000
TCBRSTND EQU   TCBNDSP1                                                 02024000
TCBDARPN EQU   TCBNDSP1                                                 02025000
TCBDARTN EQU   TCBNDSP1                                                 02026000
TCBNDSP0 EQU   TCBNDSP                                                  02027000
TCBUSER  EQU   TCB+168                                                  02028000
TCBTCTB  EQU   TCBTCT+1                                                 02029000
TCBRSV9C EQU   TCBTCTGF                                                 02030000
TCBRSV9B EQU   TCBTCTGF                                                 02031000
TCBRSV9A EQU   TCBTCTGF                                                 02032000
TCBRSV99 EQU   TCBTCTGF                                                 02033000
TCBRSV98 EQU   TCBTCTGF                                                 02034000
TCBRSV97 EQU   TCBTCTGF                                                 02035000
TCBRSV20 EQU   TCBTCTGF                                                 02036000
TCBSMFGF EQU   TCBTCTGF                                                 02037000
TCBSTABB EQU   TCBSTAB+1                                                02038000
TCBSTCUR EQU   TCBNSTAE                                                 02039000
TCBRV301 EQU   TCBNSTAE                                                 02040000
TCBSYNCH EQU   TCBNSTAE                                                 02041000
TCBHALT  EQU   TCBNSTAE                                                 02042000
TCBPPSUP EQU   TCBNSTAE                                                 02043000
TCB33E   EQU   TCBNSTAE                                                 02044000
TCBQUIES EQU   TCBNSTAE                                                 02045000
TCBSTABE EQU   TCBNSTAE                                                 02046000
TCBAQE   EQU   TCB+156                                                  02047000
TCBPQE   EQU   TCB+152                                                  02048000
TCBTSDP  EQU   TCB+151                                                  02049000
TCBTSLP  EQU   TCB+150                                                  02050000
TCBSTPCT EQU   TCB+149                                                  02051000
TCBCPUBN EQU   TCBTSFLG                                                 02052000
TCBDYDSP EQU   TCBTSFLG                                                 02053000
TCBRSV18 EQU   TCBTSFLG                                                 02054000
TCBRSV17 EQU   TCBTSFLG                                                 02055000
TCBTIOTG EQU   TCBTSFLG                                                 02056000
TCBATT   EQU   TCBTSFLG                                                 02057000
TCBSTPPR EQU   TCBTSFLG                                                 02058000
TCBRV300 EQU   TCBTSTSK                                                 02059000
TCBECB   EQU   TCB+144                                                  02060000
TCBIQE   EQU   TCB+140                                                  02061000
TCBLTC   EQU   TCB+136                                                  02062000
TCBOTC   EQU   TCB+132                                                  02063000
TCBNTC   EQU   TCB+128                                                  02064000
TCBJSTCA EQU   TCBJSTCB+1                                               02065000
TCBRSV16 EQU   TCBJSTCB                                                 02066000
TCBTQET  EQU   TCBTME                                                   02067000
TCBTCB   EQU   TCB+116                                                  02068000
TCBFSAB  EQU   TCBFSA+1                                                 02069000
TCBQEL   EQU   TCBFSA                                                   02070000
TCBGRS15 EQU   TCBGRS+60                                                02071000
TCBGRS14 EQU   TCBGRS+56                                                02072000
TCBGRS13 EQU   TCBGRS+52                                                02073000
TCBGRS12 EQU   TCBGRS+48                                                02074000
TCBGRS11 EQU   TCBGRS+44                                                02075000
TCBGRS10 EQU   TCBGRS+40                                                02076000
TCBGRS9  EQU   TCBGRS+36                                                02077000
TCBGRS8  EQU   TCBGRS+32                                                02078000
TCBGRS7  EQU   TCBGRS+28                                                02079000
TCBGRS6  EQU   TCBGRS+24                                                02080000
TCBGRS5  EQU   TCBGRS+20                                                02081000
TCBGRS4  EQU   TCBGRS+16                                                02082000
TCBGRS3  EQU   TCBGRS+12                                                02083000
TCBGRS2  EQU   TCBGRS+8                                                 02084000
TCBGRS1  EQU   TCBGRS+4                                                 02085000
TCBGRS0  EQU   TCBGRS                                                   02086000
TCBJPQB  EQU   TCBJPQ+1                                                 02087000
TCBRSV15 EQU   TCBPURGE                                                 02088000
TCBRSV14 EQU   TCBPURGE                                                 02089000
TCBRSV13 EQU   TCBPURGE                                                 02090000
TCBRSV12 EQU   TCBPURGE                                                 02091000
TCBRSV11 EQU   TCBPURGE                                                 02092000
TCBRSV10 EQU   TCBPURGE                                                 02093000
TCBRSV09 EQU   TCBPURGE                                                 02094000
TCBJPQF  EQU   TCBPURGE                                                 02095000
TCBJLB   EQU   TCB+40                                                   02096000
TCBLLS   EQU   TCB+36                                                   02097000
TCBDSP   EQU   TCB+35                                                   02098000
TCBLMP   EQU   TCB+34                                                   02099000
TCBPNDSP EQU   TCBFLGS5                                                 02100000
TCBFCD1  EQU   TCBFLGS5                                                 02101000
TCBSTP   EQU   TCBFLGS5                                                 02102000
TCBSYS   EQU   TCBFLGS5                                                 02103000
TCBANDSP EQU   TCBFLGS5                                                 02104000
TCBPAGE  EQU   TCBFLGS5                                                 02105000
TCBUXNDF EQU   TCBABWF                                                  02106000
TCBFC    EQU   TCBFLGS5                                                 02107000
TCBONDSP EQU   TCBFLGS4                                                 02108000
TCBMPCND EQU   TCBFLGS4                                                 02109000
TCBMPCVQ EQU   TCBFLGS4                                                 02110000
TCBUXNDV EQU   TCBFLGS4                                                 02111000
TCBHNDSP EQU   TCBFLGS4                                                 02112000
TCBRQENA EQU   TCBFLGS4                                                 02113000
TCBSER   EQU   TCBFLGS4                                                 02114000
TCBNDUMP EQU   TCBFLGS4                                                 02115000
TCBDWSTA EQU   TCBFLGS3                                                 02116000
TCBRSV08 EQU   TCBFLGS3                                                 02117000
TCBRSV07 EQU   TCBFLGS3                                                 02118000
TCBRSV06 EQU   TCBFLGS3                                                 02119000
TCBABGM  EQU   TCBFLGS3                                                 02120000
TCBABTRM EQU   TCBFLGS3                                                 02121000
TCBADINP EQU   TCBFLGS3                                                 02122000
TCBFSM   EQU   TCBFLGS3                                                 02123000
TCBFTS   EQU   TCBFLGS2                                                 02124000
TCBFETXR EQU   TCBFLGS2                                                 02125000
TCBFDSOP EQU   TCBFLGS2                                                 02126000
TCBFJMC  EQU   TCBFLGS2                                                 02127000
TCBFSMC  EQU   TCBFLGS2                                                 02128000
TCBFABOP EQU   TCBFLGS2                                                 02129000
TCBFSTI  EQU   TCBFLGS2                                                 02130000
TCBFOINP EQU   TCBFLGS2                                                 02131000
TCBFX    EQU   TCBFLGS1                                                 02132000
TCBFS    EQU   TCBFLGS1                                                 02133000
TCBFT    EQU   TCBFLGS1                                                 02134000
TCBPDUMP EQU   TCBFLGS1                                                 02135000
TCBRSV04 EQU   TCBFLGS1                                                 02136000
TCBFERA  EQU   TCBFLGS1                                                 02137000
TCBFE    EQU   TCBFLGS1                                                 02138000
TCBFA    EQU   TCBFLGS1                                                 02139000
TCBZERO  EQU   TCBPKF                                                   02140000
TCBFLAG  EQU   TCBPKF                                                   02141000
TCBMSSB  EQU   TCBMSS+1                                                 02142000
TCBRSV03 EQU   TCBMSS                                                   02143000
TCBTRNB  EQU   TCBTRN+1                                                 02144000
TCBRSV02 EQU   TCBABF                                                   02145000
TCBOLTEP EQU   TCBABF                                                   02146000
TCBTCP   EQU   TCBABF                                                   02147000
TCBTCPP  EQU   TCBABF                                                   02148000
TCBRSV01 EQU   TCBABF                                                   02149000
TCBGRPH  EQU   TCBABF                                                   02150000
TCBNOCHK EQU   TCBABF                                                   02151000
TCBMOD91 EQU   TCBABF                                                   02152000
TCBCMPC  EQU   TCBCMP+1                                                 02153000
TCBRV318 EQU   TCBCMSG                                                  02154000
TCBRV317 EQU   TCBCIND                                                  02155000
TCBRV316 EQU   TCBCWTO                                                  02156000
TCBCASID EQU   TCBCDBL                                                  02157000
TCBNOCC  EQU   TCBSTCC                                                  02158000
TCBDMPO  EQU   TCBCPP                                                   02159000
TCBCSTEP EQU   TCBCMPF                                                  02160000
TCBCREQ  EQU   TCBCMPF                                                  02161000
TCBDEB   EQU   TCB+8                                                    02162000
TCBPIEA  EQU   TCBPIE+1                                                 02163000
TCBPM    EQU   TCBPMASK                                                 02164000
@NM00051 EQU   TCBPMASK                                                 02165000
TCBFRS6  EQU   TCBFRS+24                                                02166000
TCBFRS4  EQU   TCBFRS+16                                                02167000
TCBFRS2  EQU   TCBFRS+8                                                 02168000
TCBFRS0  EQU   TCBFRS                                                   02169000
ERDACOM  EQU   ERDEVD+14                                                02170000
ERDASEEK EQU   ERDEVD                                                   02171000
COMMA8   EQU   ERBASE+106                                               02172000
COMMA7   EQU   ERBASE+90                                                02173000
COMMA6   EQU   ERBASE+83                                                02174000
COMMA5   EQU   ERBASE+74                                                02175000
COMMA4   EQU   ERBASE+71                                                02176000
COMMA3   EQU   ERBASE+67                                                02177000
COMMA2   EQU   ERBASE+58                                                02178000
COMMA1   EQU   ERBASE+49                                                02179000
ERMVOL   EQU   ERBASE+43                                                02180000
COMMA9   EQU   ERBASE+42                                                02181000
ERMDSID  EQU   ERBASE+36                                                02182000
COMMA05  EQU   ERBASE+35                                                02183000
ERRBA    EQU   ERBASE+27                                                02184000
COMMA0   EQU   ERBASE+26                                                02185000
ERTIME   EQU   ERBASE+18                                                02186000
ERCOMMA  EQU   ERBASE+17                                                02187000
ERDATE   EQU   ERBASE+12                                                02188000
ERMZERO2 EQU   ERLGTH+6                                                 02189000
ERMLL2   EQU   ERLGTH+4                                                 02190000
ERMZERO1 EQU   ERLGTH+2                                                 02191000
@NM00050 EQU   PLHIXSPL+8                                               02192000
PLHIXBFC EQU   PLHIXSPL+4                                               02193000
PLHSSRBA EQU   PLHIXSPL                                                 02194000
PLHISPLP EQU   IDAPLH+188                                               02195000
PLHIIOB  EQU   IDAPLH+184                                               02196000
PLHIBUFC EQU   IDAPLH+180                                               02197000
PLHNRBA  EQU   IDAPLH+176                                               02198000
PLHDDDD  EQU   PLHEOVPT                                                 02199000
PLHAR14  EQU   IDAPLH+168                                               02200000
@NM00049 EQU   IDAPLH+164                                               02201000
@NM00048 EQU   IDAPLH+160                                               02202000
PLHASAVE EQU   IDAPLH+156                                               02203000
@NM00047 EQU   IDAPLH+152                                               02204000
@NM00046 EQU   IDAPLH+148                                               02205000
@NM00045 EQU   IDAPLH+144                                               02206000
@NM00044 EQU   IDAPLH+140                                               02207000
@NM00043 EQU   IDAPLH+136                                               02208000
@NM00042 EQU   IDAPLH+132                                               02209000
@NM00041 EQU   IDAPLH+128                                               02210000
@NM00040 EQU   IDAPLH+124                                               02211000
@NM00039 EQU   IDAPLH+120                                               02212000
@NM00038 EQU   IDAPLH+116                                               02213000
PLHRET1  EQU   IDAPLH+112                                               02214000
@NM00037 EQU   IDAPLH+110                                               02215000
PLHRETO  EQU   IDAPLH+108                                               02216000
PLHSAVE6 EQU   IDAPLH+104                                               02217000
PLHSAVE5 EQU   IDAPLH+100                                               02218000
PLHSAVE4 EQU   IDAPLH+96                                                02219000
PLHSAVE3 EQU   IDAPLH+92                                                02220000
PLHSAVE2 EQU   IDAPLH+88                                                02221000
PLHSAVE1 EQU   IDAPLH+84                                                02222000
PLHARET  EQU   IDAPLH+80                                                02223000
PLHDIOB  EQU   IDAPLH+76                                                02224000
@NM00036 EQU   IDAPLH+74                                                02225000
PLHRDFC  EQU   IDAPLH+72                                                02226000
PLHRDFP  EQU   IDAPLH+68                                                02227000
PLHFSP   EQU   IDAPLH+64                                                02228000
PLHRECP  EQU   IDAPLH+60                                                02229000
PLHNBUFC EQU   IDAPLH+56                                                02230000
PLHDBUFC EQU   IDAPLH+52                                                02231000
PLHLRECL EQU   IDAPLH+48                                                02232000
PLHARDB  EQU   IDAPLH+44                                                02233000
@NM00035 EQU   IDAPLH+43                                                02234000
PLHEOVR  EQU   IDAPLH+42                                                02235000
PLHRCODE EQU   IDAPLH+41                                                02236000
PLHJCODE EQU   IDAPLH+40                                                02237000
PLHJNRBA EQU   IDAPLH+36                                                02238000
PLHJRNLL EQU   IDAPLH+32                                                02239000
PLHJORBA EQU   PLHCRBA                                                  02240000
PLHDSIDA EQU   IDAPLH+24                                                02241000
PLHCRPL  EQU   IDAPLH+20                                                02242000
PLHMRPL  EQU   IDAPLH+16                                                02243000
PLHBFRNO EQU   IDAPLH+15                                                02244000
PLHFRCNT EQU   IDAPLH+14                                                02245000
PLHRMIN  EQU   IDAPLH+13                                                02246000
PLHDSTYP EQU   IDAPLH+12                                                02247000
PLHACB   EQU   IDAPLH+8                                                 02248000
@NM00034 EQU   IDAPLH+6                                                 02249000
@NM00033 EQU   PLHEFLGS+1                                               02250000
PLHDSCAN EQU   PLHEFLGS                                                 02251000
PLHINVAL EQU   PLHEFLGS                                                 02252000
PLHEODX  EQU   PLHEFLGS                                                 02253000
PLHNOADV EQU   PLHEFLGS                                                 02254000
@NM00032 EQU   PLHEFLGS                                                 02255000
PLHSKPER EQU   PLHEFLGS                                                 02256000
PLH1ST   EQU   PLHEFLGS                                                 02257000
PLHNOSPC EQU   PLHEFLGS                                                 02258000
PLHIWAIT EQU   PLHFLG2                                                  02259000
PLHSVADV EQU   PLHFLG2                                                  02260000
PLHCIINS EQU   PLHFLG2                                                  02261000
PLHKRE   EQU   PLHFLG2                                                  02262000
PLHADDTE EQU   PLHFLG2                                                  02263000
PLHKEYMD EQU   PLHFLG2                                                  02264000
PLHSQINS EQU   PLHFLG2                                                  02265000
PLHUPD   EQU   PLHFLG2                                                  02266000
PLHDRSCN EQU   PLHFLG1                                                  02267000
PLHDRPND EQU   PLHFLG1                                                  02268000
PLHASYRQ EQU   PLHFLG1                                                  02269000
PLHRDEXC EQU   PLHFLG1                                                  02270000
PLHSSR   EQU   PLHFLG1                                                  02271000
PLHASKBF EQU   PLHFLG1                                                  02272000
PLHENDRQ EQU   PLHFLG1                                                  02273000
PLHEOVW  EQU   PLHFLG1                                                  02274000
PLHATV   EQU   IDAPLH+1                                                 02275000
PLHAVL   EQU   IDAPLH                                                   02276000
PLHELTH  EQU   IDAPLHDR+2                                               02277000
PLHCNT   EQU   IDAPLHDR+1                                               02278000
PLHID    EQU   IDAPLHDR                                                 02279000
DEBXRV40 EQU   DEBXTN+28                                                02280000
DEBXRV39 EQU   DEBXTN+24                                                02281000
DEBXXARG EQU   DEBXTN+20                                                02282000
DEBXMCF2 EQU   DEBXTN+19                                                02283000
DEBXMCF1 EQU   DEBXTN+18                                                02284000
DEBXDSO2 EQU   DEBXTN+17                                                02285000
DEBXDSO1 EQU   DEBXTN+16                                                02286000
DEBXDBPR EQU   DEBXTN+12                                                02287000
DEBXDCBM EQU   DEBXTN+8                                                 02288000
DEBXDSAB EQU   DEBXTN+4                                                 02289000
DEBXRV48 EQU   DEBXTN+3                                                 02290000
DEBXRV47 EQU   DEBXFLG1                                                 02291000
DEBXRV46 EQU   DEBXFLG1                                                 02292000
DEBXRV45 EQU   DEBXFLG1                                                 02293000
DEBXRV44 EQU   DEBXFLG1                                                 02294000
DEBXRV43 EQU   DEBXFLG1                                                 02295000
DEBXRV42 EQU   DEBXFLG1                                                 02296000
DEBXTSKC EQU   DEBXFLG1                                                 02297000
DEBXCDCB EQU   DEBXFLG1                                                 02298000
DEBXLNGH EQU   DEBXTN                                                   02299000
DEBTBLOF EQU   DEBPREFX+14                                              02300000
DEBAMTYP EQU   DEBPREFX+13                                              02301000
DEBLNGTH EQU   DEBPREFX+12                                              02302000
DEBDCBMK EQU   DEBXTNP                                                  02303000
DEBDSCBA EQU   DEBPREFX+1                                               02304000
DEBWKARA EQU   DEBPREFX                                                 02305000
DEBXCEAD EQU   DEBXCEA+1                                                02306000
DEBXCENP EQU   DEBXCEAB                                                 02307000
DEBRSV35 EQU   DEBXCEAB                                                 02308000
DEBRSV34 EQU   DEBXCEAB                                                 02309000
DEBRSV33 EQU   DEBXCEAB                                                 02310000
DEBRSV32 EQU   DEBXCEAB                                                 02311000
DEBCEAD  EQU   DEBCEA+1                                                 02312000
DEBCENP  EQU   DEBCEAB                                                  02313000
DEBRSV31 EQU   DEBCEAB                                                  02314000
DEBRSV30 EQU   DEBCEAB                                                  02315000
DEBRSV29 EQU   DEBCEAB                                                  02316000
DEBRSV28 EQU   DEBCEAB                                                  02317000
DEBPCIAD EQU   DEBPCIA+1                                                02318000
DEBPCINP EQU   DEBPCIAB                                                 02319000
DEBRSV27 EQU   DEBPCIAB                                                 02320000
DEBRSV26 EQU   DEBPCIAB                                                 02321000
DEBRSV25 EQU   DEBPCIAB                                                 02322000
DEBRSV24 EQU   DEBPCIAB                                                 02323000
DEBSIOAD EQU   DEBSIOA+1                                                02324000
DEBSIONP EQU   DEBSIOAB                                                 02325000
DEBFIX   EQU   DEBSIOAB                                                 02326000
DEBIOVR  EQU   DEBSIOAB                                                 02327000
DEBSIOX  EQU   DEBSIOAB                                                 02328000
DEBPGFX  EQU   DEBSIOAB                                                 02329000
DEBEOEAD EQU   DEBEOEA+1                                                02330000
DEBEOENP EQU   DEBEOEAB                                                 02331000
DEBRSV22 EQU   DEBEOEAB                                                 02332000
DEBRSV21 EQU   DEBEOEAB                                                 02333000
DEBRSV20 EQU   DEBEOEAB                                                 02334000
DEBRSV19 EQU   DEBEOEAB                                                 02335000
DEBSUBID EQU   DEBSUBNM                                                 02336000
DEBSIOA2 EQU   DEBACS08+24                                              02337000
DEBRPSIO EQU   DEBACS08+20                                              02338000
DEBFREED EQU   DEBACS08+16                                              02339000
@NM00031 EQU   DEBACS08+12                                              02340000
@NM00030 EQU   DEBACS08+8                                               02341000
DEBDISAD EQU   DEBACS08+4                                               02342000
@NM00029 EQU   DEBACS08                                                 02343000
DEBRPSST EQU   DEBACS07+64                                              02344000
DEBARECK EQU   DEBACS07+60                                              02345000
DEBAREWT EQU   DEBACS07+56                                              02346000
DEBACHK  EQU   DEBACS07+52                                              02347000
DEBAWRIT EQU   DEBACS07+48                                              02348000
DEBASETL EQU   DEBACS07+44                                              02349000
DEBAREAD EQU   DEBACS07+40                                              02350000
DEBCRECK EQU   DEBACS07+36                                              02351000
DEBCREWT EQU   DEBACS07+32                                              02352000
DEBCCHK  EQU   DEBACS07+28                                              02353000
DEBCWRIT EQU   DEBACS07+24                                              02354000
DEBCSETL EQU   DEBACS07+20                                              02355000
DEBCREAD EQU   DEBACS07+16                                              02356000
DEBWKPT4 EQU   DEBACS07+8                                               02357000
DEBGET   EQU   DEBACS07+4                                               02358000
@NM00028 EQU   DEBACS07                                                 02359000
DEBPUT   EQU   DEBACS06+4                                               02360000
DEBDCBFA EQU   DEBACS06                                                 02361000
DEBLUCBB EQU   DEBLUCBA+1                                               02362000
DEBRSV18 EQU   DEBLUCBA                                                 02363000
DEBFUCBB EQU   DEBFUCBA+1                                               02364000
DEBRSV17 EQU   DEBFUCBA                                                 02365000
DEBTCCWB EQU   DEBTCCWA+1                                               02366000
DEBRSV16 EQU   DEBTCCWA                                                 02367000
DEBTBFRB EQU   DEBTBFRA+1                                               02368000
DEBRSV15 EQU   DEBTBFRA                                                 02369000
DEBDBPEF EQU   DEBACS03+8                                               02370000
DEBDBPP  EQU   DEBACS03+4                                               02371000
DEBDTPP  EQU   DEBACS03                                                 02372000
DEBDBPE  EQU   DEBDBLK+1                                                02373000
DEBDBPT  EQU   DEBDBLK                                                  02374000
DEBEXTNM EQU   DEBDSNAM                                                 02375000
DEBRSV14 EQU   DEBDSNM+4                                                02376000
DEBUTSAB EQU   DEBUTSAA+1                                               02377000
DEBRSV13 EQU   DEBUTSAA                                                 02378000
DEBVOLNM EQU   DEBACSMD+2                                               02379000
DEBVLSEQ EQU   DEBVOLSQ+1                                               02380000
DEBRSV42 EQU   DEBVOLBT                                                 02381000
DEBRSV41 EQU   DEBVOLBT                                                 02382000
DEBRSV40 EQU   DEBVOLBT                                                 02383000
DEBRSV39 EQU   DEBVOLBT                                                 02384000
DEBRSV38 EQU   DEBVOLBT                                                 02385000
DEBRSV37 EQU   DEBVOLBT                                                 02386000
DEBRSV36 EQU   DEBVOLBT                                                 02387000
DEBEXFUL EQU   DEBVOLBT                                                 02388000
DEBNMTRK EQU   DEBDASD+14                                               02389000
DEBENDHH EQU   DEBDASD+12                                               02390000
DEBENDCC EQU   DEBDASD+10                                               02391000
DEBSTRHH EQU   DEBDASD+8                                                02392000
DEBSTRCC EQU   DEBDASD+6                                                02393000
DEBBINUM EQU   DEBDASD+4                                                02394000
DEBUCBA  EQU   DEBUCBAD+1                                               02395000
DEBDVMOD EQU   DEBUCBAD                                                 02396000
DEBAPPB  EQU   DEBAPPAD+1                                               02397000
DEBEXSCL EQU   DEBAPPAD                                                 02398000
DEBDCBB  EQU   DEBDCBAD+1                                               02399000
DEBDEBID EQU   DEBPROTG                                                 02400000
DEBECBB  EQU   DEBECBAD+1                                               02401000
DEBPRIOR EQU   DEBECBAD                                                 02402000
DEBUSRPB EQU   DEBUSRPG+1                                               02403000
DEBNMEXT EQU   DEBUSRPG                                                 02404000
DEBRSV05 EQU   DEBBASIC+15                                              02405000
DEBXTNIN EQU   DEBFLGS1                                                 02406000
DEBAPFIN EQU   DEBFLGS1                                                 02407000
DEBF1CEV EQU   DEBFLGS1                                                 02408000
DEBCINDI EQU   DEBFLGS1                                                 02409000
DEBRSV02 EQU   DEBFLGS1                                                 02410000
DEBRSV01 EQU   DEBFLGS1                                                 02411000
DEBEOFDF EQU   DEBFLGS1                                                 02412000
DEBPWCKD EQU   DEBFLGS1                                                 02413000
DEBQSCNT EQU   DEBBASIC+13                                              02414000
DEBACCS  EQU   DEBOPATB                                                 02415000
DEBPOSIT EQU   DEBOPATB                                                 02416000
DEBZERO  EQU   DEBOPATB                                                 02417000
DEBABEND EQU   DEBOPATB                                                 02418000
DEBIRBB  EQU   DEBIRBAD+1                                               02419000
DEBRERR  EQU   DEBOFLGS                                                 02420000
DEBLABEL EQU   DEBOFLGS                                                 02421000
DEBSPLIT EQU   DEBOFLGS                                                 02422000
DEBDCB   EQU   DEBOFLGS                                                 02423000
DEBRLSE  EQU   DEBOFLGS                                                 02424000
DEBEOF   EQU   DEBOFLGS                                                 02425000
DEBDISP  EQU   DEBOFLGS                                                 02426000
DEBDEBB  EQU   DEBDEBAD+1                                               02427000
DEBAMLNG EQU   DEBDEBAD                                                 02428000
DEBTCBB  EQU   DEBTCBAD+1                                               02429000
DEBNMSUB EQU   DEBTCBAD                                                 02430000
RPLSAVE2 EQU   IDARPLE+24                                               02431000
RPLSAVE  EQU   IDARPLE+20                                               02432000
@NM00027 EQU   IDARPLE+17                                               02433000
RPLIIBFR EQU   IDARPLE+8                                                02434000
RPLEMLEN EQU   RPLCOMN+70                                               02435000
RPLACTIV EQU   RPLCOMN+69                                               02436000
RPLBRANC EQU   RPLEXTD1                                                 02437000
RPLNIB   EQU   RPLEXTD1                                                 02438000
RPLGVNT  EQU   RPLEXTD1                                                 02439000
RPLLVNT  EQU   RPLEXTD1                                                 02440000
RPLEXIT  EQU   RPLEXTD1                                                 02441000
RPLNEXIT EQU   RPLEXTD1                                                 02442000
RPLEXSCH EQU   RPLEXTD1                                                 02443000
RPLDDDD  EQU   RPL6RBA+2                                                02444000
RPLS2S2  EQU   RPL6RBA                                                  02445000
RPLS1S1  EQU   RPLRBAR                                                  02446000
RPLRSV88 EQU   RPLOPT8                                                  02447000
RPLUNCON EQU   RPLOPT8                                                  02448000
RPLACTV  EQU   RPLOPT8                                                  02449000
RPLSESS  EQU   RPLOPT8                                                  02450000
RPLPEND  EQU   RPLOPT8                                                  02451000
RPLODPRM EQU   RPLOPT8                                                  02452000
RPLODACP EQU   RPLOPT8                                                  02453000
RPLODACQ EQU   RPLOPT8                                                  02454000
RPLRSV78 EQU   RPLOPT7                                                  02455000
RPLRSV77 EQU   RPLOPT7                                                  02456000
RPLRLSOP EQU   RPLOPT7                                                  02457000
RPLRSV75 EQU   RPLOPT7                                                  02458000
RPLQOPT  EQU   RPLOPT7                                                  02459000
RPLCNIMM EQU   RPLCNOPT                                                 02460000
RPLCNANY EQU   RPLCNOPT                                                 02461000
RPLCNALL EQU   RPLCNOPT                                                 02462000
RPLRSV68 EQU   RPLOPT6                                                  02463000
RPLRSV67 EQU   RPLOPT6                                                  02464000
RPLLOCK  EQU   RPLOPT6                                                  02465000
RPLNCOND EQU   RPLOPT6                                                  02466000
RPLCOND  EQU   RPLOPT6                                                  02467000
RPLEOT   EQU   RPLUNTYP                                                 02468000
RPLEOM   EQU   RPLUNTYP                                                 02469000
RPLEOB   EQU   RPLUNTYP                                                 02470000
RPLWROPT EQU   RPLOPT5                                                  02471000
RPLNODE  EQU   RPLOPT5                                                  02472000
RPLERACE EQU   RPLWRTYP                                                 02473000
RPLEAU   EQU   RPLWRTYP                                                 02474000
RPLNERAS EQU   RPLWRTYP                                                 02475000
RPLPSOPT EQU   RPLOPT5                                                  02476000
RPLSSNIN EQU   RPLOPT5                                                  02477000
RPLDLGIN EQU   RPLOPT5                                                  02478000
RPLBUFL  EQU   RPLCOMN+52                                               02479000
RPLRLEN  EQU   RPLCOMN+48                                               02480000
RPLCHAIN EQU   RPLNXTRP                                                 02481000
RPLOPT4  EQU   RPLOPTCD+3                                               02482000
RPLALIGN EQU   RPLOPT3                                                  02483000
RPLFMT   EQU   RPLOPT3                                                  02484000
RPLFLD   EQU   RPLOPT3                                                  02485000
RPLVFY   EQU   RPLOPT3                                                  02486000
RPLBLK   EQU   RPLOPT3                                                  02487000
RPLSFORM EQU   RPLOPT3                                                  02488000
RPLEODS  EQU   RPLOPT3                                                  02489000
RPLNSP   EQU   RPLOPT2                                                  02490000
RPLUPD   EQU   RPLOPT2                                                  02491000
@NM00026 EQU   RPLOPT2                                                  02492000
RPLCNV   EQU   RPLOPT2                                                  02493000
RPLADD   EQU   RPLADR                                                   02494000
RPLKEY   EQU   RPLOPT2                                                  02495000
RPLECBIN EQU   RPLECBSW                                                 02496000
RPLGEN   EQU   RPLOPT1                                                  02497000
RPLKGE   EQU   RPLOPT1                                                  02498000
RPLASY   EQU   RPLOPT1                                                  02499000
RPLSKP   EQU   RPLOPT1                                                  02500000
RPLSEQ   EQU   RPLOPT1                                                  02501000
RPLDIR   EQU   RPLOPT1                                                  02502000
RPLLOC   EQU   RPLOPT1                                                  02503000
RPLDAF   EQU   RPLARG+2                                                 02504000
RPLSAF   EQU   RPLARG                                                   02505000
RPLAREA  EQU   RPLCOMN+32                                               02506000
RPLTCBPT EQU   RPLCOMN+28                                               02507000
RPLDACB  EQU   RPLCOMN+24                                               02508000
RPLCCHAR EQU   RPLCOMN+20                                               02509000
RPLSTRID EQU   RPLCOMN+18                                               02510000
RPLKEYL  EQU   RPLKEYLE                                                 02511000
RPLFDB3  EQU   RPLERRCD                                                 02512000
RPLFDB2  EQU   RPLCMPON                                                 02513000
RPLSTAT  EQU   RPLCOMN+12                                               02514000
RPLPOST  EQU   RPLECB                                                   02515000
RPLWAIT  EQU   RPLECB                                                   02516000
RPLLEN2  EQU   RPLLEN                                                   02517000
RPLREQ   EQU   RPLIDWD+2                                                02518000
RPLSTYP  EQU   RPLIDWD+1                                                02519000
RPLID    EQU   RPLIDWD                                                  02520000
DCBLPDT  EQU   IHADCS55                                                 02521000
DCBWKPT6 EQU   IHADCS29+196                                             02522000
DCBWKPT5 EQU   IHADCS29+192                                             02523000
DCBWKPT4 EQU   IHADCS29+188                                             02524000
DCBWKPT3 EQU   IHADCS29+184                                             02525000
DCBWKPT2 EQU   IHADCS29+180                                             02526000
DCBWKPT1 EQU   IHADCS29+176                                             02527000
@NM00025 EQU   IHADCS29+174                                             02528000
DCBRORG1 EQU   IHADCS29+172                                             02529000
DCBLIOV  EQU   IHADCS29+164                                             02530000
DCBNOREC EQU   IHADCS29+162                                             02531000
@NM00024 EQU   IHADCS29+161                                             02532000
DCBLEMI1 EQU   IHADCS29+156                                             02533000
DCBRORG2 EQU   IHADCS29+154                                             02534000
@NM00023 EQU   IHADCS29+153                                             02535000
DCBLECI  EQU   IHADCS29+148                                             02536000
DCBNBOV  EQU   IHADCS29+146                                             02537000
DCBOVDEV EQU   IHADCS29+145                                             02538000
DCBLETI  EQU   IHADCS29+140                                             02539000
DCBLPDA  EQU   IHADCS29+132                                             02540000
DCBFTHI  EQU   IHADCS29+125                                             02541000
DCBNTHI  EQU   IHADCS29+124                                             02542000
DCBFTMI1 EQU   IHADCS29+117                                             02543000
DCBHIIOV EQU   IHADCS29+116                                             02544000
DCBFTCI  EQU   IHADCS29+109                                             02545000
DCBSTLTF EQU   DCBST                                                    02546000
DCBSTLBF EQU   DCBST                                                    02547000
DCBSTNMC EQU   DCBST                                                    02548000
@NM00022 EQU   DCBST                                                    02549000
DCBSTNCY EQU   DCBST                                                    02550000
DCBSTKSQ EQU   DCBST                                                    02551000
DCBSTSSM EQU   DCBST                                                    02552000
DCBNREC  EQU   IHADCS29+104                                             02553000
DCBRORG3 EQU   IHADCS29+100                                             02554000
DCBNCRHI EQU   IHADCS29+98                                              02555000
DCBTDC   EQU   IHADCS29+96                                              02556000
DCBHIRSH EQU   IHADCS29+95                                              02557000
DCBHIROV EQU   IHADCS29+94                                              02558000
DCBHIRPD EQU   IHADCS29+93                                              02559000
DCBHIRCM EQU   IHADCS29+92                                              02560000
DCBLDT   EQU   IHADCS29+90                                              02561000
DCBHMASK EQU   IHADCS29+89                                              02562000
DCBFIRSH EQU   IHADCS29+86                                              02563000
DCBNLEV  EQU   IHADCS29+85                                              02564000
DCBLEMI3 EQU   IHADCS29+80                                              02565000
DCBFTMI3 EQU   IHADCS29+73                                              02566000
DCBLEMI2 EQU   IHADCS29+68                                              02567000
DCBFTMI2 EQU   IHADCS29+61                                              02568000
DCBHIRTI EQU   IHADCS29+60                                              02569000
DCBFREED EQU   IHADCS29+56                                              02570000
DCBRELEX EQU   IHADCS29+52                                              02571000
DCBPUTX  EQU   IHADCS29+48                                              02572000
DCBRELSE EQU   IHADCS29+44                                              02573000
DCBLWKN  EQU   IHADCS29+40                                              02574000
DCBLRAN  EQU   IHADCS29+36                                              02575000
DCBESETL EQU   IHADCS29+32                                              02576000
DCBLRECL EQU   IHADCS29+30                                              02577000
@NM00021 EQU   DCBEXCD2                                                 02578000
DCBEXRDE EQU   DCBEXLTH                                                 02579000
DCBEXOFL EQU   DCBEXCD2                                                 02580000
DCBEXIDA EQU   DCBEXCD1                                                 02581000
DCBSETL  EQU   IHADCS29+24                                              02582000
DCBMSHIA EQU   DCBMSHI+1                                                02583000
DCBNCP   EQU   DCBMSHI                                                  02584000
DCBSMSW  EQU   IHADCS29+18                                              02585000
DCBSMSI  EQU   IHADCS29+16                                              02586000
DCBMSWA  EQU   IHADCS29+12                                              02587000
DCBBLKSI EQU   IHADCS29+10                                              02588000
DCBRKP   EQU   IHADCS29+8                                               02589000
DCBCYLOF EQU   IHADCS29+3                                               02590000
DCBNTM   EQU   IHADCS29+2                                               02591000
DCBMACRE EQU   DCBMAC                                                   02592000
DCBMACAW EQU   DCBMAC                                                   02593000
DCBMACUW EQU   DCBMAC                                                   02594000
DCBMACUR EQU   DCBMAC                                                   02595000
@NM00020 EQU   DCBMAC                                                   02596000
DCBOPTR  EQU   DCBOPTCD                                                 02597000
DCBOPTL  EQU   DCBOPTCD                                                 02598000
@NM00019 EQU   DCBOPTCD                                                 02599000
DCBOPTY  EQU   DCBOPTCD                                                 02600000
DCBOPTI  EQU   DCBOPTCD                                                 02601000
DCBOPTM  EQU   DCBOPTCD                                                 02602000
DCBOPTUF EQU   DCBOPTCD                                                 02603000
DCBOPTW  EQU   DCBOPTCD                                                 02604000
DCBPUTA  EQU   DCBGETA                                                  02605000
@NM00018 EQU   DCBPUT                                                   02606000
DCBDEBA  EQU   DCBDEBAD+1                                               02607000
@NM00017 EQU   DCBIFLGS                                                 02608000
DCBIFIOE EQU   DCBIFLGS                                                 02609000
DCBIFPCT EQU   DCBIFLGS                                                 02610000
DCBIFEC  EQU   DCBIFLGS                                                 02611000
DCBMFSTI EQU   DCBMFDMD                                                 02612000
DCBMFAWR EQU   DCBMFSTK                                                 02613000
DCBMFUIP EQU   DCBMFTMD                                                 02614000
DCBMFIDW EQU   DCBMFLCP                                                 02615000
DCBMFWRK EQU   DCBMFMVP                                                 02616000
DCBMFRDQ EQU   DCBMFWRT                                                 02617000
DCBMFGTQ EQU   DCBMFPUT                                                 02618000
DCBMFSTL EQU   DCBMACF2                                                 02619000
DCBMFCK  EQU   DCBMFDMG                                                 02620000
DCBMFRDX EQU   DCBMFCHK                                                 02621000
DCBMFDBF EQU   DCBMFSBG                                                 02622000
DCBMFRDI EQU   DCBMFLCG                                                 02623000
DCBMFRDK EQU   DCBMFMVG                                                 02624000
DCBMFWRQ EQU   DCBMFRD                                                  02625000
DCBMFPTQ EQU   DCBMFGET                                                 02626000
DCBMFECP EQU   DCBMACF1                                                 02627000
DCBMRSTI EQU   DCBMRDMD                                                 02628000
DCBMRAWR EQU   DCBMRSTK                                                 02629000
DCBMRUIP EQU   DCBMRTMD                                                 02630000
DCBMRIDW EQU   DCBMRLCP                                                 02631000
DCBMRWRK EQU   DCBMRMVP                                                 02632000
DCBMRRDQ EQU   DCBMRWRT                                                 02633000
DCBMRGTQ EQU   DCBMRPUT                                                 02634000
DCBMRSTL EQU   DCBMACR2                                                 02635000
DCBMRCK  EQU   DCBMRDMG                                                 02636000
DCBPGFXA EQU   DCBMRRDX                                                 02637000
DCBMRDBF EQU   DCBMRSBG                                                 02638000
DCBMRRDI EQU   DCBMRLCG                                                 02639000
DCBMRRDK EQU   DCBMRMVG                                                 02640000
DCBMRWRQ EQU   DCBMRRD                                                  02641000
DCBMRPTQ EQU   DCBMRGET                                                 02642000
DCBMRECP EQU   DCBMACR1                                                 02643000
@NM00016 EQU   DCBIFLG                                                  02644000
DCBIBIOE EQU   DCBIFLG                                                  02645000
DCBIBPCT EQU   DCBIFLG                                                  02646000
DCBIBEC  EQU   DCBIFLG                                                  02647000
DCBOFIOF EQU   DCBOFLGS                                                 02648000
DCBOFUEX EQU   DCBOFLGS                                                 02649000
DCBOFTM  EQU   DCBOFLGS                                                 02650000
DCBOFPPC EQU   DCBOFLGS                                                 02651000
DCBOFOPN EQU   DCBOFLGS                                                 02652000
DCBOFEOV EQU   DCBOFLGS                                                 02653000
DCBOFLRB EQU   DCBOFLGS                                                 02654000
DCBOFIOD EQU   DCBOFLWR                                                 02655000
DCBDDNAM EQU   IHADCS24                                                 02656000
DCBEXLSA EQU   DCBEXLST+1                                               02657000
DCBRECKL EQU   DCBRECFM                                                 02658000
DCBRECCC EQU   DCBRECFM                                                 02659000
DCBRECSB EQU   DCBRECFM                                                 02660000
DCBRECBR EQU   DCBRECFM                                                 02661000
DCBRECTO EQU   DCBRECLA                                                 02662000
DCBRECL  EQU   DCBRECLA                                                 02663000
DCBEODA  EQU   DCBEODAD+1                                               02664000
DCBBFA   EQU   DCBBFTEK                                                 02665000
DCBH0    EQU   DCBBFTEK                                                 02666000
DCBBFTKD EQU   DCBBFTEK                                                 02667000
DCBBFTE  EQU   DCBBFT                                                   02668000
DCBBFTKR EQU   DCBBFT                                                   02669000
DCBBFTS  EQU   DCBBFT                                                   02670000
DCBH1    EQU   DCBBFTEK                                                 02671000
DCBSVCXA EQU   DCBSVCXL+1                                               02672000
@NM00015 EQU   DCBSVCXL                                                 02673000
DCBODEBA EQU   DCBIOBAA                                                 02674000
@NM00014 EQU   DCBQSLM                                                  02675000
DCBUPDBT EQU   DCBQSLM                                                  02676000
DCBUPDCM EQU   DCBQSLM                                                  02677000
DCB1DVDS EQU   DCBQSLM                                                  02678000
@NM00013 EQU   DCBDSRG2                                                 02679000
DCBDSGTR EQU   DCBDSRG2                                                 02680000
DCBACBM  EQU   DCBDSRG2                                                 02681000
@NM00012 EQU   DCBDSRG2                                                 02682000
DCBDSGTQ EQU   DCBDSRG2                                                 02683000
DCBDSGTX EQU   DCBDSRG2                                                 02684000
DCBDSGGS EQU   DCBDSRG2                                                 02685000
DCBDSGU  EQU   DCBDSRG1                                                 02686000
DCBDSGPO EQU   DCBDSRG1                                                 02687000
DCBDSGMQ EQU   DCBDSRG1                                                 02688000
DCBDSGCQ EQU   DCBDSRG1                                                 02689000
DCBDSGCX EQU   DCBDSRG1                                                 02690000
DCBDSGDA EQU   DCBDSRG1                                                 02691000
DCBDSGPS EQU   DCBDSRG1                                                 02692000
DCBDSGIS EQU   DCBDSRG1                                                 02693000
DCBBUFL  EQU   IHADCS11+8                                               02694000
DCBBUFCA EQU   DCBBUFCB+1                                               02695000
DCBBUFNO EQU   DCBBUFCB                                                 02696000
DCBDEVT  EQU   DCBREL                                                   02697000
DCBKEYLE EQU   DCBRELB                                                  02698000
DCBTRBAL EQU   IHADCS01+6                                               02699000
@NM00011 EQU   IHADCS01+5                                               02700000
@NM00010 EQU   IHADCS01+4                                               02701000
DCBDVTBA EQU   DCBDVTBL+1                                               02702000
@NM00009 EQU   DCBDVTBL                                                 02703000
DCBKEYCN EQU   IHADCS00+4                                               02704000
DCBRELAD EQU   IHADCS00                                                 02705000
@NM00008 EQU   IHADCB                                                   02706000
IIGMLEN  EQU   IIGMSPLG+1                                               02707000
IIGMPOOL EQU   IIGMSPLG                                                 02708000
IIGMADDR EQU   IIGMNTRY                                                 02709000
AUDCLM   EQU   AUDCSPLM+1                                               02710000
AUDCSPM  EQU   AUDCSPLM                                                 02711000
AUDCMSGA EQU   IIGMAUD+24                                               02712000
AUDCLB   EQU   AUDCSPLB+1                                               02713000
AUDCSPB  EQU   AUDCSPLB                                                 02714000
AUDCBFRS EQU   IIGMAUD+16                                               02715000
AUDCLD   EQU   AUDCSPLD+1                                               02716000
AUDCSPD  EQU   AUDCSPLD                                                 02717000
AUDCDEB  EQU   IIGMAUD+8                                                02718000
AUDCLI   EQU   AUDCSPLI+1                                               02719000
AUDCSPI  EQU   AUDCSPLI                                                 02720000
AUDCIICB EQU   IIGMAUD                                                  02721000
@NM00007 EQU   IIAUDFL2                                                 02722000
AUDDEBXF EQU   IIAUDFL2                                                 02723000
AUDBFRRT EQU   IIAUDFL2                                                 02724000
AUDBFREX EQU   IIAUDFL2                                                 02725000
AUDIIFBF EQU   IIAUDFL2                                                 02726000
AUDURSYN EQU   IIAUDFL1                                                 02727000
AUDIISYN EQU   IIAUDFL1                                                 02728000
AUDPRMOD EQU   IIAUDFL1                                                 02729000
AUDDCBRT EQU   IIAUDFL1                                                 02730000
AUDDCBEX EQU   IIAUDFL1                                                 02731000
AUDACBRO EQU   IIAUDFL1                                                 02732000
AUDACBOP EQU   IIAUDFL1                                                 02733000
@NM00006 EQU   IIREGSAV+12                                              02734000
IIREGFC  EQU   IIREGSAV+8                                               02735000
@NM00005 EQU   IIREGSAV                                                 02736000
IISVCLST EQU   IDAIICB+48                                               02737000
IITBUFL  EQU   IDAIICB+45                                               02738000
IIBUFNO  EQU   IDAIICB+44                                               02739000
IIMSGPTR EQU   IDAIICB+40                                               02740000
IIMSGL   EQU   IDAIICB+37                                               02741000
@NM00004 EQU   IIFLAG3                                                  02742000
MBFALN   EQU   IIFLAG3                                                  02743000
IIBUFL   EQU   IDAIICB+34                                               02744000
IIKEYSL  EQU   IDAIICB+32                                               02745000
IIRPLL   EQU   IDAIICB+29                                               02746000
MKEYLE   EQU   IIFLAG2                                                  02747000
MBUFNO   EQU   IIFLAG2                                                  02748000
MBUFL    EQU   IIFLAG2                                                  02749000
MRECFM   EQU   IIFLAG2                                                  02750000
MOPTCD   EQU   IIFLAG2                                                  02751000
MBLKSI   EQU   IIFLAG2                                                  02752000
MLRECL   EQU   IIFLAG2                                                  02753000
MRKP     EQU   IIFLAG2                                                  02754000
IIACBL   EQU   IDAIICB+25                                               02755000
IIQBFRS  EQU   IIFLAG1                                                  02756000
@NM00003 EQU   IIFLAG1                                                  02757000
IIFTEST  EQU   IIFLAG1                                                  02758000
IIDATA   EQU   IIFLAG1                                                  02759000
@NM00002 EQU   IIFLAG1                                                  02760000
IIFGET   EQU   IIFLAG1                                                  02761000
IIKEYPT  EQU   IDAIICB+20                                               02762000
IIMAXLRL EQU   IIW1CBF+2                                                02763000
IISAVLRL EQU   IIW1CBF                                                  02764000
IICBLEN  EQU   IDAIICB+2                                                02765000
@NM00001 EQU   IDAIICB+1                                                02766000
IICBID   EQU   IDAIICB                                                  02767000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02768000
@RC00192 EQU   @RC00190                                                 02769000
@RT00203 EQU   EXIT                                                     02770000
@RC00225 EQU   @RC00198                                                 02771000
@RC00223 EQU   @RC00198                                                 02772000
@RC00221 EQU   @RC00198                                                 02773000
@RC00212 EQU   @RC00198                                                 02774000
@RC00210 EQU   @RC00198                                                 02775000
@RC00208 EQU   @RC00198                                                 02776000
@RC00206 EQU   @RC00198                                                 02777000
@RC00200 EQU   @RC00198                                                 02778000
@RT00238 EQU   EXIT                                                     02779000
@RC00188 EQU   @EL00001                                                 02780000
@RF00319 EQU   @RC00317                                                 02781000
@RC00366 EQU   @RC00354                                                 02782000
@RC00364 EQU   @RC00354                                                 02783000
@RC00362 EQU   @RC00354                                                 02784000
@RC00360 EQU   @RC00354                                                 02785000
@RC00358 EQU   @RC00354                                                 02786000
@RC00356 EQU   @RC00354                                                 02787000
@RC00392 EQU   @RC00389                                                 02788000
@RF00391 EQU   @RC00389                                                 02789000
@RF00401 EQU   @RC00386                                                 02790000
@RC00394 EQU   @RC00392                                                 02791000
@ENDDATA EQU   *                                                        02792000
         END   IDAIISM1,(C'PLS1656',0602,75012)                         02793000
