         TITLE 'IDAVBPJ2 VBPJOURNAL MERGE MODULE                       *00001000
                        '                                               00002000
IDAVBPJ2 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IDAVBPJ2  76.099'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @11,@01                                             0001 00016000
         USING @DATD,@11                                           0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LM    @00,@01,20(@13)                                     0001 00019000
         ST    @11,8(,@13)                                         0001 00020000
         LR    @13,@11                                             0001 00021000
JSCBDISP EQU 188                                                        00022000
JSCBAOS1 EQU  72                                                        00023000
JSCBAOS2 EQU 192                                                        00024000
*   R2=R1->JRBPTR;                  /* STORE INPUT PARM BLOCK ADDR ON   00025000
*                                      REG 2                         */ 00026000
         L     R2,JRBPTR(,R1)                                      0058 00027000
*   RFY                                                            0059 00028000
*     JRBLOCK BASED(R2);            /* BASE INPUT INTERFACE BLOCK ON    00029000
*                                      REG 2                         */ 00030000
*   RFY                                                            0060 00031000
*     R1 UNRSTD;                                                   0060 00032000
*   RFY                                                            0061 00033000
*     VBPDSPCT BASED(BLKADDR);      /* BASE DSPCT HEADER ON INPUT  0061 00034000
*                                      BLOCK                         */ 00035000
*                                                                  0061 00036000
*   /*****************************************************************/ 00037000
*   /*                                                               */ 00038000
*   /* IF THIS IS THE FIRST ENTRY FOR THIS DATASET THEN GETMAIN FOR  */ 00039000
*   /* THE DSPCT HEADER                                              */ 00040000
*   /*                                                               */ 00041000
*   /*****************************************************************/ 00042000
*                                                                  0062 00043000
*   IF BLKNVA=ZERO THEN                                            0062 00044000
         L     @10,BLKNVA(,R2)                                     0062 00045000
         LTR   @10,@10                                             0062 00046000
         BNZ   @RF00062                                            0062 00047000
*     DO;                                                          0063 00048000
*                                                                  0063 00049000
*       /*************************************************************/ 00050000
*       /*                                                           */ 00051000
*       /* GET LOCAL LOCK                                    @Z40WSSR*/ 00052000
*       /*                                                           */ 00053000
*       /*************************************************************/ 00054000
*                                                                  0064 00055000
*       GEN SETS(R0,R1,R14,R15) REFS(PSALITA);                     0064 00056000
*                                                          /*@VS07802*/ 00057000
   SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,                     *00058000
               RELATED=(DSPCT,(IDAVBPJ2(UNLOCK1)))                      00059000
*       RFY                                                        0065 00060000
*        (R4,                                                      0065 00061000
*         R7) RSTD;                 /*                       @VS07802*/ 00062000
*       R4=JSCBACT->JSCBTCBP;       /* PASS TCB ADDR         @VS07802*/ 00063000
         L     @10,PSATOLD                                         0066 00064000
         L     @10,TCBJSCB(,@10)                                   0066 00065000
         L     @10,JSCBACT(,@10)                                   0066 00066000
         L     R4,JSCBTCBP(,@10)                                   0066 00067000
*       R7=ADDR(ASCB);              /* PASS ASCB ADDR TO GETMAIN   0067 00068000
*                                                            @Z40WSSR*/ 00069000
         L     R7,PSAAOLD                                          0067 00070000
*       DO;                         /* GETMAIN (RU) LV(VBPHLEN)    0068 00071000
*                                      SP(JSCBACT->JSCBSWSP) KEY(1)     00072000
*                                      BRANCH                        */ 00073000
*         RESPECIFY                                                0069 00074000
*          (GPR01F,                                                0069 00075000
*           GPR03F,                                                0069 00076000
*           GPR00F) RESTRICTED;                                    0069 00077000
*         GPR01F=0;                 /* REG 1 MUST BE ZERO            */ 00078000
         SLR   GPR01F,GPR01F                                       0070 00079000
*         GPR03F=2;                 /* RU-TYPE GETMAIN               */ 00080000
         LA    GPR03F,2                                            0071 00081000
*         GPR00F=VBPHLEN;           /* LENGTH REQUESTED              */ 00082000
         L     @06,BLKADDR(,R2)                                    0072 00083000
         L     GPR00F,VBPHLEN(,@06)                                0072 00084000
*         GPR03F=GPR03F|((JSCBACT->JSCBSWSP)*256);/* SP IN BYTE 2    */ 00085000
         SLR   @06,@06                                             0073 00086000
         IC    @06,JSCBSWSP(,@10)                                  0073 00087000
         SLA   @06,8                                               0073 00088000
         OR    GPR03F,@06                                          0073 00089000
*         GPR03F=GPR03F|((1)*65536*16);/* KEY IN BYTE 1              */ 00090000
         O     GPR03F,@CF01989                                     0074 00091000
*         CALL CVTCRMN;             /* BRANCH ENTRY POINT            */ 00092000
         L     @10,CVTPTR                                          0075 00093000
         L     @15,CVTCRMN(,@10)                                   0075 00094000
         BALR  @14,@15                                             0075 00095000
*         RESPECIFY                                                0076 00096000
*          (GPR01F,                                                0076 00097000
*           GPR03F,                                                0076 00098000
*           GPR00F) UNRESTRICTED;                                  0076 00099000
*       END;                        /* GETMAIN (RU) LV(VBPHLEN)    0077 00100000
*                                      SP(JSCBACT->JSCBSWSP) KEY(1)     00101000
*                                      BRANCH                        */ 00102000
*       RFY                                                        0078 00103000
*        (R4,                                                      0078 00104000
*         R7) UNRSTD;               /*                       @VS07802*/ 00105000
*       RFY                                                        0079 00106000
*        (R1,                                                      0079 00107000
*         R3) RSTD;                 /*                       @VS07802*/ 00108000
*       R3=R1;                      /* SAVE GETMAIN ADDR     @VS07802*/ 00109000
         LR    R3,R1                                               0080 00110000
*       RFY                                                        0081 00111000
*         R1 UNRSTD;                /*                       @VS07802*/ 00112000
*                                                                  0081 00113000
*       /*************************************************************/ 00114000
*       /*                                                           */ 00115000
*       /* RELEASE LOCAL LOCK                                @Z40WSSR*/ 00116000
*       /*                                                           */ 00117000
*       /*************************************************************/ 00118000
*                                                                  0082 00119000
*       GEN SETS(R0,R1,R14,R15) REFS(PSALITA);                     0082 00120000
*                                                          /*@VS07802*/ 00121000
   SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                                *00122000
               RELATED=(DSPCT,(IDAVBPJ2(LOCK1)))                        00123000
*       RFY                                                        0083 00124000
*         R1 RSTD;                  /*                       @VS07802*/ 00125000
*       R1=R3;                      /* RESTOR REG 1          @VS07802*/ 00126000
         LR    R1,R3                                               0084 00127000
*       RFY                                                        0085 00128000
*         R3 UNRSTD;                /*                       @VS07802*/ 00129000
*       BLKGMA=R1;                  /* UPDATE PARM LIST WITH GETMAIN    00130000
*                                      AREA ADDR                     */ 00131000
         ST    R1,BLKGMA(,R2)                                      0086 00132000
*       BLKNVA=R1;                                                 0087 00133000
         ST    R1,BLKNVA(,R2)                                      0087 00134000
*       RFY                                                        0088 00135000
*        (R4,                                                      0088 00136000
*         R5,                                                      0088 00137000
*         R6,                                                      0088 00138000
*         R7) RSTD;                 /*                       @Z40WSSR*/ 00139000
*       R4=R1;                      /* PASS ADDR OF AREA TO BE ZEROED   00140000
*                                                            @Z40WSSR*/ 00141000
         LR    R4,R1                                               0089 00142000
*       R5=VBPHLEN;                 /* PASS LENGTH OF AREA TO BE   0090 00143000
*                                      ZEROED                @Z40WSSR*/ 00144000
         L     @10,BLKADDR(,R2)                                    0090 00145000
         L     R5,VBPHLEN(,@10)                                    0090 00146000
*       R6=ZERO;                    /*                       @Z40WSSR*/ 00147000
         SLR   R6,R6                                               0091 00148000
*       R7=ZERO;                    /*                       @Z40WSSR*/ 00149000
         SLR   R7,R7                                               0092 00150000
*       MVCL(R4,R6);                /* ZERO DSPCT GOTTEN     @Z40WSSR*/ 00151000
         MVCL  R4,R6                                               0093 00152000
*       RFY                                                        0094 00153000
*        (R4,                                                      0094 00154000
*         R5,                                                      0094 00155000
*         R6,                                                      0094 00156000
*         R7) UNRSTD;               /*                       @Z40WSSR*/ 00157000
*                                                                  0094 00158000
*       /*************************************************************/ 00159000
*       /*                                                           */ 00160000
*       /* MOVE DSPCT HEADER FROM JOURNALED AREA TO VIRTUAL ADDR     */ 00161000
*       /*                                                           */ 00162000
*       /*************************************************************/ 00163000
*                                                                  0095 00164000
*       RFY                                                        0095 00165000
*         VBPDSPCT BASED(BLKNVA);                                  0095 00166000
*       VBPHJJ=BLKADDR->VBPHJJ;     /* MOVE JOURNALED DSPCT IN     0096 00167000
*                                                            @Z40WSSR*/ 00168000
         L     @10,BLKNVA(,R2)                                     0096 00169000
         L     @03,BLKADDR(,R2)                                    0096 00170000
         MVC   VBPHJJ(52,@10),VBPHJJ(@03)                          0096 00171000
*       VBPHSPUL=JSCBACT->JSCBSWSP; /* SAVE SUBPOOL NUMBER IN THE  0097 00172000
*                                      DSPCT HEADER FOR LATER      0097 00173000
*                                      GETMAINING THE MAP    @Z40WSSR*/ 00174000
         L     @03,PSATOLD                                         0097 00175000
         L     @03,TCBJSCB(,@03)                                   0097 00176000
         L     @03,JSCBACT(,@03)                                   0097 00177000
         IC    @00,JSCBSWSP(,@03)                                  0097 00178000
         STC   @00,VBPHSPUL(,@10)                                  0097 00179000
*       VBPHTCB=JSCBACT->JSCBTCBP;  /* SAVE TCB ADDR IN DSPCT      0098 00180000
*                                                            @Z40WSSR*/ 00181000
*                                                                  0098 00182000
         L     @03,JSCBTCBP(,@03)                                  0098 00183000
         ST    @03,VBPHTCB(,@10)                                   0098 00184000
*       /*************************************************************/ 00185000
*       /*                                                           */ 00186000
*       /* ACTIVATE THE LOGICAL GROUP                        @YM02774*/ 00187000
*       /*                                                           */ 00188000
*       /*************************************************************/ 00189000
*                                                                  0099 00190000
*       R1=ADDR(ACA);               /* LOAD R1 WITH PARM LIST ADDR 0099 00191000
*                                                            @YM02774*/ 00192000
         LA    R1,ACA                                              0099 00193000
*       ACASYM=VBPHSYM;             /* SET S SYMBOL IN PARM LIST   0100 00194000
*                                                            @YM02774*/ 00195000
         MVC   ACASYM(8),VBPHSYM(@10)                              0100 00196000
*       ACAFLG1=HEX00;              /* INDICATE ACTIVATE FOR VIO   0101 00197000
*                                                            @VS07397*/ 00198000
         MVI   ACAFLG1,B'00000000'                                 0101 00199000
*       ACAASID=ASCBASID;           /* SET ASID IN PARM LIST @YM02774*/ 00200000
         L     @10,PSAAOLD                                         0102 00201000
         LH    @10,ASCBASID(,@10)                                  0102 00202000
         N     @10,@CF01991                                        0102 00203000
         STH   @10,ACAASID                                         0102 00204000
*       RFY                                                        0103 00205000
*         R1 UNRSTD;                /*                       @YM02774*/ 00206000
*       DO;                         /* ILRCALL                     0104 00207000
*                                      ACA(ADDR(ACA))OP(ACTIVATE)    */ 00208000
*         RESPECIFY                                                0105 00209000
*           R1 RSTD;                                               0105 00210000
*         DECLARE                   /* ILRGOS ENTRY POINT    @Z40WPWG*/ 00211000
*           ILRGOS ENTRY BASED(ASMGOS) VALRG(0);                   0106 00212000
*         DECLARE                   /* ILRTRPAG ENTRY POINT  @Z40WPWG*/ 00213000
*           ILRTRPAG ENTRY BASED(ASMTRPAG) VALRG(0);               0107 00214000
*         DCL                                                      0108 00215000
*           ILRACAOP FIXED(8) BASED(R1);                           0108 00216000
*         R1=ADDR(ACA);             /* SET OPCODE            @Z40WPWG*/ 00217000
         LA    R1,ACA                                              0109 00218000
*         ILRACAOP=20;                                             0110 00219000
         MVI   ILRACAOP(R1),X'14'                                  0110 00220000
*         CALL ILRGOS;              /*                       @Z40WPWG*/ 00221000
         L     @10,CVTPTR                                          0111 00222000
         L     @10,CVTASMVT(,@10)                                  0111 00223000
         L     @15,ASMGOS(,@10)                                    0111 00224000
         BALR  @14,@15                                             0111 00225000
*         RESPECIFY                                                0112 00226000
*           R1 UNRSTD;                                             0112 00227000
*       END;                        /* ILRCALL                     0113 00228000
*                                      ACA(ADDR(ACA))OP(ACTIVATE)  0113 00229000
*                                                            @YM02774*/ 00230000
*       RFY                                                        0114 00231000
*        (R1,                                                      0114 00232000
*         R15) RSTD;                /*                       @YM02774*/ 00233000
*                                                                  0114 00234000
*       /*************************************************************/ 00235000
*       /*                                                           */ 00236000
*       /* IF ACTIVATE IS UNSUCCESSFUL THEN                  @YM02774*/ 00237000
*       /*                                                           */ 00238000
*       /*************************************************************/ 00239000
*                                                                  0115 00240000
*       IF R15>EIGHT THEN                                          0115 00241000
         C     R15,@CF00051                                        0115 00242000
         BNH   @RF00115                                            0115 00243000
*         DO;                       /*                       @YM02774*/ 00244000
*           DO;                     /* WTOP MF(E,MSG1)               */ 00245000
*             RFY                                                  0118 00246000
*               GPR01P RSTD;        /* RESTRICT REG 1                */ 00247000
*             GPR01P=ADDR(MSG1);    /* ADDRESS CONTROL PROGRAM LIST  */ 00248000
         LA    GPR01P,MSG1                                         0119 00249000
*             SVC(35);              /* ISSUE WTO SVC                 */ 00250000
         SVC   35                                                  0120 00251000
*             RFY                                                  0121 00252000
*               GPR01P UNRSTD;      /* RELEASE REG 1                 */ 00253000
*           END;                    /* WTOP MF(E,MSG1)       @YM02774*/ 00254000
*           RETURN CODE(4);         /* PASS AN ERROR RETURN CODE TO     00255000
*                                      THE INVOKER                   */ 00256000
         L     @13,4(,@13)                                         0123 00257000
         L     @00,@SIZDATD                                        0123 00258000
         LR    @01,@11                                             0123 00259000
         FREEMAIN R,LV=(0),A=(1)                                        00260000
         LA    @15,4                                               0123 00261000
         L     @14,12(,@13)                                        0123 00262000
         LM    @00,@12,20(@13)                                     0123 00263000
         BR    @14                                                 0123 00264000
*         END;                      /*                       @YM02774*/ 00265000
*       ELSE                                                       0125 00266000
*         IF R15=EIGHT THEN                                        0125 00267000
@RF00115 C     R15,@CF00051                                        0125 00268000
         BNE   @RF00125                                            0125 00269000
*           DO;                     /* RETURN CODE OF 8 IMPLIES    0126 00270000
*                                      LOGICAL GROUP RELEASED      0126 00271000
*                                                            @ZA00139*/ 00272000
*             VBPHDEL=ON;           /* SET ON SCRATCHED SWITCH     0127 00273000
*                                                            @Z40WSSR*/ 00274000
         L     @14,BLKNVA(,R2)                                     0127 00275000
         OI    VBPHDEL(@14),B'00001000'                            0127 00276000
*           END;                    /* END OF SCRATCHED TEST @ZA00139*/ 00277000
*       RFY                                                        0129 00278000
*        (R15) UNRSTD;              /*                       #YM02774*/ 00279000
@RF00125 DS    0H                                                  0130 00280000
*       R1=ADDR(ACA);               /* LOAD REG 1 WITH ACA ADDR    0130 00281000
*                                                            @YM02774*/ 00282000
         LA    R1,ACA                                              0130 00283000
*       VBPHLGN=ACALGN;             /* MOVE LGN PASSED BY ASM IN   0131 00284000
*                                      DSPCT HEADER          @Z40WSSR*/ 00285000
*                                                                  0131 00286000
         L     @10,BLKNVA(,R2)                                     0131 00287000
         MVC   VBPHLGN(8,@10),ACALGN                               0131 00288000
*       /*************************************************************/ 00289000
*       /*                                                           */ 00290000
*       /* IF LGID IS < THE PAGE RECLAIM LIMIT OF 64K PAGES THEN THE */ 00291000
*       /* DSPAGEID GENERATOR = LGID                         @Z40WSSR*/ 00292000
*       /*                                                           */ 00293000
*       /*************************************************************/ 00294000
*                                                                  0132 00295000
*       IF VBPHLGID<RECLMLIM THEN                                  0132 00296000
         L     @03,VBPHLGID(,@10)                                  0132 00297000
         CL    @03,@CF01947                                        0132 00298000
         BNL   @RF00132                                            0132 00299000
*         VBPHDSG=VBPHLGID;         /* SET LGID              @Z40WSSR*/ 00300000
*                                                                  0133 00301000
         STH   @03,VBPHDSG(,@10)                                   0133 00302000
*       /*************************************************************/ 00303000
*       /*                                                           */ 00304000
*       /* ELSE DSPAGEID GENERATOR = 0                       @YM02774*/ 00305000
*       /*                                                           */ 00306000
*       /*************************************************************/ 00307000
*                                                                  0134 00308000
*       ELSE                                                       0134 00309000
*         VBPHDSG=ZERO;             /* ELSE ZERO DSPAGEID    @Z40WSSR*/ 00310000
*                                                                  0134 00311000
         B     @RC00132                                            0134 00312000
@RF00132 L     @10,BLKNVA(,R2)                                     0134 00313000
         SLR   @03,@03                                             0134 00314000
         STH   @03,VBPHDSG(,@10)                                   0134 00315000
*       /*************************************************************/ 00316000
*       /*                                                           */ 00317000
*       /* SAVE LGN AND DSPAGEID GENERATOR IN SAVE AREA      @YM02774*/ 00318000
*       /*                                                           */ 00319000
*       /*************************************************************/ 00320000
*                                                                  0135 00321000
*       LGNSAVE=ACALGN;             /* SAVE LGN IN DSPCT     @Z40WSSR*/ 00322000
@RC00132 L     @10,BLKNVA(,R2)                                     0135 00323000
         MVC   LGNSAVE(8,@10),ACALGN                               0135 00324000
*       DSGSAVE=VBPHDSG;            /* SAVE DSPAGEID IN DSPCT      0136 00325000
*                                                            @Z40WSSR*/ 00326000
         LH    @03,VBPHDSG(,@10)                                   0136 00327000
         N     @03,@CF01991                                        0136 00328000
         STH   @03,DSGSAVE(,@10)                                   0136 00329000
*       OPTSAVE=VBPHOPT;            /* SAVE OPTIONS BYTE IN DSPCT  0137 00330000
*                                      WHICH DOES NOT GET OVERLAID ON   00331000
*                                      A SUBSEQUENT MERGE    @Z40WSSR*/ 00332000
         MVC   OPTSAVE(1,@10),VBPHOPT(@10)                         0137 00333000
*     END;                          /*                       #YM02774*/ 00334000
*                                                                  0138 00335000
*   /*****************************************************************/ 00336000
*   /*                                                               */ 00337000
*   /* ELSE FOR ALL SUBSEQUENT ENTRIES FOR THE SAME DATASET MOVE THE */ 00338000
*   /* JOURNALED COPY OF THE DSPCT HEADER INTO THE ONE BUILT IN SWA  */ 00339000
*   /*                                                               */ 00340000
*   /*****************************************************************/ 00341000
*                                                                  0139 00342000
*   ELSE                                                           0139 00343000
*     DO;                           /*                       @YM02774*/ 00344000
         B     @RC00062                                            0139 00345000
@RF00062 DS    0H                                                  0140 00346000
*       VBPHJJ=BLKADDR->VBPHJJ;     /* MOVE JOURNALED HEADER @Z40WSSR*/ 00347000
*                                                                  0140 00348000
         L     @10,BLKNVA(,R2)                                     0140 00349000
         L     @03,BLKADDR(,R2)                                    0140 00350000
         MVC   VBPHJJ(52,@10),VBPHJJ(@03)                          0140 00351000
*       /*************************************************************/ 00352000
*       /*                                                           */ 00353000
*       /* RESTORE THE LGN AND DSPAGEID GENERATOR AND SCRATCH STATUS */ 00354000
*       /* FLAG FROM NON MERGE PORTION OF DSPCT              @ZA00139*/ 00355000
*       /*                                                           */ 00356000
*       /*************************************************************/ 00357000
*                                                                  0141 00358000
*       VBPHOPT=OPTSAVE;            /* SCRATCH STATUS        @ZA00139*/ 00359000
         MVC   VBPHOPT(1,@10),OPTSAVE(@10)                         0141 00360000
*       VBPHLGN=LGNSAVE;            /*                       @YM02774*/ 00361000
         MVC   VBPHLGN(8,@10),LGNSAVE(@10)                         0142 00362000
*       VBPHDSG=DSGSAVE;            /*                       @YM02774*/ 00363000
         LH    @03,DSGSAVE(,@10)                                   0143 00364000
         N     @03,@CF01991                                        0143 00365000
         STH   @03,VBPHDSG(,@10)                                   0143 00366000
*     END;                          /*                       @YM02774*/ 00367000
*   VBPHRBN=BLKRBN;                 /* MOVE RBN ALSO         @YM02774*/ 00368000
@RC00062 L     @10,BLKNVA(,R2)                                     0145 00369000
         L     @03,BLKRBN(,R2)                                     0145 00370000
         ST    @03,VBPHRBN(,@10)                                   0145 00371000
*   VBPHRST=ON;                     /* INDICATE RESTARTED DSPCT,   0146 00372000
*                                      VOPEN NOT DONE YET    @Z40WSSR*/ 00373000
*   VBPHJRN=OFF;                    /* RESET PAGES ADDED INDICATOR 0147 00374000
*                                                            @Z40WSSR*/ 00375000
         OI    VBPHRST(@10),B'00100000'                            0147 00376000
         NI    VBPHJRN(@10),B'11111101'                            0147 00377000
*   VBPHWAD=ZERO;                   /* RESET WINDOW ADDR     @Z40WSSR*/ 00378000
         SLR   @03,@03                                             0148 00379000
         ST    @03,VBPHWAD(,@10)                                   0148 00380000
*   VBPHPRL=ZERO;                   /* RESET PRIOR OP FLAG   @Z40WSSR*/ 00381000
         ST    @03,VBPHPRL(,@10)                                   0149 00382000
*   VBPHPAS=OFF;                    /* RESET PRIOR OP FLAG   @Z40WSSR*/ 00383000
         NI    VBPHPAS(@10),B'11101111'                            0150 00384000
*   RETURN CODE(0);                 /* MAKE A SUCCESSFUL RETURN TO 0151 00385000
*                                      INVOKER               @YM02774*/ 00386000
         L     @13,4(,@13)                                         0151 00387000
         L     @00,@SIZDATD                                        0151 00388000
         LR    @01,@11                                             0151 00389000
         FREEMAIN R,LV=(0),A=(1)                                        00390000
         SLR   @15,@15                                             0151 00391000
         L     @14,12(,@13)                                        0151 00392000
         LM    @00,@12,20(@13)                                     0151 00393000
         BR    @14                                                 0151 00394000
*   END IDAVBPJ2                                                   0152 00395000
*                                                                  0152 00396000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00397000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00398000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00399000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00400000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                       */ 00401000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00402000
*/*%INCLUDE SYSLIB  (ILRACA  )                                       */ 00403000
*/*%INCLUDE SYSLIB  (ILRASMVT)                                       */ 00404000
*/*%INCLUDE SYSLIB  (IDAVBPH )                                       */ 00405000
*                                                                  0152 00406000
*       ;                                                          0152 00407000
@DATA    DS    0H                                                       00408000
@DATD    DSECT                                                          00409000
         DS    0F                                                       00410000
@SA00001 DS    18F                                                      00411000
IDAVBPJ2 CSECT                                                          00412000
         DS    0F                                                       00413000
@CF00051 DC    F'8'                                                     00414000
@CF01947 DC    F'65536'                                                 00415000
@CF01989 DC    F'1048576'                                               00416000
@CF01991 DC    XL4'0000FFFF'                                            00417000
@DATD    DSECT                                                          00418000
         DS    0D                                                       00419000
ASMVTPTR DS    A                                                        00420000
ACAST    DS    CL24                                                     00421000
         ORG   ACAST                                                    00422000
ACA      DS    CL24                                                     00423000
         ORG   ACA                                                      00424000
ACAOP    DS    FL1                                                      00425000
ACAFLG1  DS    BL1                                                      00426000
         ORG   ACAFLG1                                                  00427000
ACAFMEM  DS    BL1                                                      00428000
ACARSV5  EQU   ACAFLG1+0                                                00429000
ACAFFIX  EQU   ACAFLG1+0                                                00430000
ACAFSPL  EQU   ACAFLG1+0                                                00431000
ACAFSYM  EQU   ACAFLG1+0                                                00432000
ACARSV1  EQU   ACAFLG1+0                                                00433000
ACARSV2  EQU   ACAFLG1+0                                                00434000
ACARSV3  EQU   ACAFLG1+0                                                00435000
         ORG   ACA+2                                                    00436000
ACAASID  DS    FL2                                                      00437000
ACARSV4  DS    CL4                                                      00438000
ACALGN   DS    CL8                                                      00439000
         ORG   ACALGN                                                   00440000
ACALPID  DS    CL8                                                      00441000
         ORG   ACALPID                                                  00442000
ACALGID  DS    FL4                                                      00443000
         ORG   ACALGID                                                  00444000
ACAFLSID DS    CL4                                                      00445000
         ORG   ACALPID+4                                                00446000
ACARPN   DS    FL4                                                      00447000
         ORG   ACARPN                                                   00448000
ACAAIAP  DS    AL4                                                      00449000
         ORG   ACA+16                                                   00450000
ACASYM   DS    CL8                                                      00451000
         ORG   ACASYM                                                   00452000
ACATOLP  DS    CL8                                                      00453000
         ORG   ACATOLP                                                  00454000
ACATOLGI DS    FL4                                                      00455000
         ORG   ACATOLGI                                                 00456000
ACAMAXPN DS    FL4                                                      00457000
         ORG   ACATOLP+4                                                00458000
ACATORPN DS    FL4                                                      00459000
         ORG   ACATORPN                                                 00460000
@NM00036 DS    FL4                                                      00461000
         ORG   ACAST+24                                                 00462000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00463000
@ENDDATD EQU   *                                                        00464000
IDAVBPJ2 CSECT                                                          00465000
         DS    0F                                                       00466000
@SIZDATD DC    AL1(0)                                                   00467000
         DC    AL3(@ENDDATD-@DATD)                                      00468000
         DS    0D                                                       00469000
MSG1     DS    CL75                                                     00470000
         ORG   MSG1                                                     00471000
MSG101   DC    H'71'                                                    00472000
MSG102   DC    B'1000000000000000'                                      00473000
MSG103   DC    CL67'IEC006I UNABLE TO ACTIVATE A VIO DATA SET DURING REC00474000
               START PROCESSING'                                        00475000
MSG104   DC    B'0000000000000000'                                      00476000
MSG105   DC    B'0000000000100000'                                      00477000
         ORG   MSG1+75                                                  00478000
VBPJPTC  DC    CL35'PATCH AREA                         '                00479000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00480000
@01      EQU   01                                                       00481000
@02      EQU   02                                                       00482000
@03      EQU   03                                                       00483000
@04      EQU   04                                                       00484000
@05      EQU   05                                                       00485000
@06      EQU   06                                                       00486000
@07      EQU   07                                                       00487000
@08      EQU   08                                                       00488000
@09      EQU   09                                                       00489000
@10      EQU   10                                                       00490000
@11      EQU   11                                                       00491000
@12      EQU   12                                                       00492000
@13      EQU   13                                                       00493000
@14      EQU   14                                                       00494000
@15      EQU   15                                                       00495000
GPR00F   EQU   @00                                                      00496000
GPR01F   EQU   @01                                                      00497000
GPR01P   EQU   @01                                                      00498000
R0       EQU   @00                                                      00499000
R1       EQU   @01                                                      00500000
R2       EQU   @02                                                      00501000
R3       EQU   @03                                                      00502000
R4       EQU   @04                                                      00503000
R5       EQU   @05                                                      00504000
R6       EQU   @06                                                      00505000
R7       EQU   @07                                                      00506000
R14      EQU   @14                                                      00507000
R15      EQU   @15                                                      00508000
GPR03F   EQU   @03                                                      00509000
GPR00P   EQU   @00                                                      00510000
GPR14F   EQU   @14                                                      00511000
GPR14P   EQU   @14                                                      00512000
GPR15F   EQU   @15                                                      00513000
GPR15P   EQU   @15                                                      00514000
CVTPTR   EQU   16                                                       00515000
PSA      EQU   0                                                        00516000
FLCRNPSW EQU   PSA                                                      00517000
FLCROPSW EQU   PSA+8                                                    00518000
FLCICCW2 EQU   PSA+16                                                   00519000
PSAEEPSW EQU   PSA+132                                                  00520000
PSAESPSW EQU   PSA+136                                                  00521000
FLCSVILC EQU   PSAESPSW+1                                               00522000
PSAEPPSW EQU   PSA+140                                                  00523000
FLCPIILC EQU   PSAEPPSW+1                                               00524000
FLCPICOD EQU   PSAEPPSW+2                                               00525000
PSAPICOD EQU   FLCPICOD+1                                               00526000
FLCTEA   EQU   PSAEPPSW+4                                               00527000
FLCPER   EQU   PSA+152                                                  00528000
FLCMCLA  EQU   PSA+168                                                  00529000
FLCIOEL  EQU   FLCMCLA+4                                                00530000
FLCIOA   EQU   FLCMCLA+16                                               00531000
FLCFSA   EQU   FLCMCLA+80                                               00532000
PSATOLD  EQU   PSA+540                                                  00533000
PSAAOLD  EQU   PSA+548                                                  00534000
PSASUPER EQU   PSA+552                                                  00535000
PSASUP1  EQU   PSASUPER                                                 00536000
PSASUP2  EQU   PSASUPER+1                                               00537000
PSASUP3  EQU   PSASUPER+2                                               00538000
PSASUP4  EQU   PSASUPER+3                                               00539000
PSACLHT  EQU   PSA+640                                                  00540000
PSALKSA  EQU   PSA+696                                                  00541000
PSAHLHI  EQU   PSA+760                                                  00542000
PSALITA  EQU   PSA+764                                                  00543000
PSADSSFL EQU   PSA+836                                                  00544000
PSADSSF1 EQU   PSADSSFL                                                 00545000
PSADSSF3 EQU   PSADSSFL+2                                               00546000
PSADSSF4 EQU   PSADSSFL+3                                               00547000
PSARSVT  EQU   PSA+896                                                  00548000
JRBPTR   EQU   0                                                        00549000
JRBLOCK  EQU   0                                                        00550000
BLKADDR  EQU   JRBLOCK                                                  00551000
@NM00001 EQU   JRBLOCK+4                                                00552000
BLKRBN   EQU   JRBLOCK+8                                                00553000
BLKNVA   EQU   JRBLOCK+12                                               00554000
BLKGMA   EQU   JRBLOCK+16                                               00555000
TCBFIX   EQU   0                                                        00556000
TCBFRS   EQU   TCBFIX                                                   00557000
TCB      EQU   0                                                        00558000
TCBPIE   EQU   TCB+4                                                    00559000
TCBPMASK EQU   TCBPIE                                                   00560000
TCBCMP   EQU   TCB+16                                                   00561000
TCBCMPF  EQU   TCBCMP                                                   00562000
TCBCPP   EQU   TCBCMPF                                                  00563000
TCBSTCC  EQU   TCBCMPF                                                  00564000
TCBCDBL  EQU   TCBCMPF                                                  00565000
TCBCWTO  EQU   TCBCMPF                                                  00566000
TCBCIND  EQU   TCBCMPF                                                  00567000
TCBCMSG  EQU   TCBCMPF                                                  00568000
TCBTRN   EQU   TCB+20                                                   00569000
TCBABF   EQU   TCBTRN                                                   00570000
TCBMSS   EQU   TCB+24                                                   00571000
TCBPKF   EQU   TCB+28                                                   00572000
TCBFLGS  EQU   TCB+29                                                   00573000
TCBFLGS1 EQU   TCBFLGS                                                  00574000
TCBFLGS2 EQU   TCBFLGS+1                                                00575000
TCBFLGS3 EQU   TCBFLGS+2                                                00576000
TCBFLGS4 EQU   TCBFLGS+3                                                00577000
TCBFLGS5 EQU   TCBFLGS+4                                                00578000
TCBABWF  EQU   TCBFLGS5                                                 00579000
TCBJPQ   EQU   TCB+44                                                   00580000
TCBPURGE EQU   TCBJPQ                                                   00581000
TCBGRS   EQU   TCB+48                                                   00582000
TCBFSA   EQU   TCB+112                                                  00583000
TCBTME   EQU   TCB+120                                                  00584000
TCBJSTCB EQU   TCB+124                                                  00585000
TCBTSFLG EQU   TCB+148                                                  00586000
TCBTSTSK EQU   TCBTSFLG                                                 00587000
TCBSTAB  EQU   TCB+160                                                  00588000
TCBNSTAE EQU   TCBSTAB                                                  00589000
TCBTCT   EQU   TCB+164                                                  00590000
TCBTCTGF EQU   TCBTCT                                                   00591000
TCBSCNDY EQU   TCB+172                                                  00592000
TCBNDSP  EQU   TCBSCNDY                                                 00593000
TCBNDSP1 EQU   TCBNDSP+1                                                00594000
TCBNDSP2 EQU   TCBNDSP+2                                                00595000
TCBNDSP3 EQU   TCBNDSP+3                                                00596000
TCBJSCB  EQU   TCB+180                                                  00597000
TCBRECDE EQU   TCBJSCB                                                  00598000
TCBEXT1  EQU   TCB+196                                                  00599000
TCBBITS  EQU   TCB+200                                                  00600000
TCBNDSP4 EQU   TCBBITS                                                  00601000
TCBNDSP5 EQU   TCBBITS+1                                                00602000
TCBFLGS6 EQU   TCBBITS+2                                                00603000
TCBFLGS7 EQU   TCBBITS+3                                                00604000
TCBDAR   EQU   TCB+204                                                  00605000
TCBDARC  EQU   TCBDAR                                                   00606000
TCBEXT2  EQU   TCB+208                                                  00607000
TCBXSCT  EQU   TCB+240                                                  00608000
TCBXSCT1 EQU   TCBXSCT                                                  00609000
TCBFOE   EQU   TCB+244                                                  00610000
TCBESTAE EQU   TCB+264                                                  00611000
TCBESTRM EQU   TCBESTAE+1                                               00612000
TCBFBYT1 EQU   TCB+276                                                  00613000
TCBFBYT2 EQU   TCB+277                                                  00614000
TCBRV124 EQU   TCB+278                                                  00615000
TCBRV133 EQU   TCB+279                                                  00616000
TCBXTNT2 EQU   0                                                        00617000
TCBGTF   EQU   TCBXTNT2                                                 00618000
TCBTFLG  EQU   TCBGTF                                                   00619000
TCBRV146 EQU   TCBXTNT2+28                                              00620000
TCBRV155 EQU   TCBXTNT2+29                                              00621000
TCBRV164 EQU   TCBXTNT2+30                                              00622000
TCBRV173 EQU   TCBXTNT2+31                                              00623000
ASCB     EQU   0                                                        00624000
ASCBSUPC EQU   ASCB+16                                                  00625000
ASCBASID EQU   ASCB+36                                                  00626000
ASCBFW1  EQU   ASCB+100                                                 00627000
ASCBRCTF EQU   ASCBFW1+2                                                00628000
ASCBFLG1 EQU   ASCBFW1+3                                                00629000
ASCBDSP1 EQU   ASCB+114                                                 00630000
ASCBFLG2 EQU   ASCB+115                                                 00631000
ASCBLKGP EQU   ASCB+128                                                 00632000
ASCBSRQ  EQU   ASCB+180                                                 00633000
ASCBSRQ1 EQU   ASCBSRQ                                                  00634000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00635000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00636000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00637000
IEZJSCB  EQU   0                                                        00638000
JSCBSEC1 EQU   IEZJSCB+188                                              00639000
JSCHPCE  EQU   JSCBSEC1+4                                               00640000
JSCBTCBP EQU   JSCBSEC1+20                                              00641000
JSCBDCB  EQU   JSCBSEC1+36                                              00642000
JSCBOPTS EQU   JSCBSEC1+48                                              00643000
JSCBSWT1 EQU   JSCBSEC1+55                                              00644000
JSCBWTP  EQU   JSCBSEC1+64                                              00645000
JSCBWTFG EQU   JSCBWTP                                                  00646000
JSCBEND1 EQU   IEZJSCB+260                                              00647000
CVTMAP   EQU   0                                                        00648000
CVTDAR   EQU   CVTMAP+72                                                00649000
CVTFLGS1 EQU   CVTDAR                                                   00650000
CVTDCB   EQU   CVTMAP+116                                               00651000
CVTIERLC EQU   CVTMAP+144                                               00652000
CVTOPTA  EQU   CVTMAP+182                                               00653000
CVTOPTB  EQU   CVTMAP+183                                               00654000
CVTGTF   EQU   CVTMAP+236                                               00655000
CVTGTFST EQU   CVTGTF                                                   00656000
CVTGTFS  EQU   CVTGTFST                                                 00657000
CVTSTATE EQU   CVTGTFST                                                 00658000
CVTTMODE EQU   CVTGTFST                                                 00659000
CVTFORM  EQU   CVTGTFST                                                 00660000
CVTAQAVT EQU   CVTMAP+240                                               00661000
CVTTCMFG EQU   CVTAQAVT                                                 00662000
CVTVOLM2 EQU   CVTMAP+244                                               00663000
CVTTATA  EQU   CVTVOLM2                                                 00664000
CVTTSKS  EQU   CVTTATA                                                  00665000
CVTVOLF2 EQU   CVTTSKS                                                  00666000
CVTTAT   EQU   CVTTATA+1                                                00667000
CVTATER  EQU   CVTMAP+248                                               00668000
CVTEXT1  EQU   CVTMAP+252                                               00669000
CVTPURG  EQU   CVTMAP+260                                               00670000
CVTQMSG  EQU   CVTMAP+268                                               00671000
CVTDMSR  EQU   CVTMAP+272                                               00672000
CVTRSV37 EQU   CVTDMSR                                                  00673000
CVTDMSRF EQU   CVTRSV37                                                 00674000
CVTERPV  EQU   CVTMAP+316                                               00675000
CVTINTLA EQU   CVTMAP+320                                               00676000
CVTAPF   EQU   CVTMAP+324                                               00677000
CVTEXT2  EQU   CVTMAP+328                                               00678000
CVTHJES  EQU   CVTMAP+332                                               00679000
CVTPGSIA EQU   CVTMAP+348                                               00680000
CVTA1F1  EQU   CVTMAP+356                                               00681000
CVTSYSK  EQU   CVTMAP+357                                               00682000
CVTVOLM1 EQU   CVTMAP+380                                               00683000
CVTVOLF1 EQU   CVTVOLM1                                                 00684000
CVTATMCT EQU   CVTMAP+388                                               00685000
CVTXTNT1 EQU   0                                                        00686000
CVTXTNT2 EQU   0                                                        00687000
CVTDSSV  EQU   CVTXTNT2                                                 00688000
CVTFLGBT EQU   CVTXTNT2+5                                               00689000
CVTQID   EQU   CVTXTNT2+24                                              00690000
CVTRV400 EQU   CVTXTNT2+52                                              00691000
CVTRV409 EQU   CVTXTNT2+53                                              00692000
CVTATCVT EQU   CVTXTNT2+64                                              00693000
CVTRV429 EQU   CVTXTNT2+84                                              00694000
CVTRV438 EQU   CVTXTNT2+85                                              00695000
CVTRV457 EQU   CVTXTNT2+112                                             00696000
CVTRV466 EQU   CVTXTNT2+113                                             00697000
CVTFIX   EQU   0                                                        00698000
CVTRELNO EQU   CVTFIX+252                                               00699000
ASMVT    EQU   0                                                        00700000
ASMFLAG1 EQU   ASMVT                                                    00701000
ASMFLAG2 EQU   ASMVT+1                                                  00702000
ASMGOS   EQU   ASMVT+12                                                 00703000
ASMTRPAG EQU   ASMVT+16                                                 00704000
ASMSTAGQ EQU   ASMVT+32                                                 00705000
ASMPCCWQ EQU   ASMVT+64                                                 00706000
ASMLSAI  EQU   ASMVT+144                                                00707000
ASMGOSQS EQU   ASMVT+152                                                00708000
ASMWKSA1 EQU   ASMVT+368                                                00709000
ASMWKSA2 EQU   ASMVT+448                                                00710000
ASMWKSA3 EQU   ASMVT+528                                                00711000
ASMWKSA4 EQU   ASMVT+608                                                00712000
ASMWKSA5 EQU   ASMVT+688                                                00713000
ASMPOOLS EQU   0                                                        00714000
ASMCPAVQ EQU   ASMPOOLS+8                                               00715000
ASMCPRSQ EQU   ASMPOOLS+16                                              00716000
VBPDSPCT EQU   0                                                        00717000
VBPHFIX  EQU   VBPDSPCT                                                 00718000
VBPHJJ   EQU   VBPHFIX                                                  00719000
VBPHLEN  EQU   VBPHJJ+4                                                 00720000
VBPHLGN  EQU   VBPHJJ+8                                                 00721000
VBPHLGID EQU   VBPHLGN                                                  00722000
VBPHSYM  EQU   VBPHJJ+16                                                00723000
VBPHDSG  EQU   VBPHJJ+26                                                00724000
VBPHOPT  EQU   VBPHJJ+32                                                00725000
VBPHRST  EQU   VBPHOPT                                                  00726000
VBPHPAS  EQU   VBPHOPT                                                  00727000
VBPHDEL  EQU   VBPHOPT                                                  00728000
VBPHJRN  EQU   VBPHOPT                                                  00729000
VBPHSTA  EQU   VBPHJJ+33                                                00730000
VBPHWAD  EQU   VBPHJJ+40                                                00731000
VBPHPRL  EQU   VBPHJJ+44                                                00732000
VBPHRBN  EQU   VBPHJJ+48                                                00733000
VBPHBUFC EQU   VBPHFIX+52                                               00734000
VBPHVCB  EQU   VBPHFIX+60                                               00735000
VBPHSAVE EQU   VBPHFIX+64                                               00736000
SECSAVE  EQU   VBPHFIX+136                                              00737000
DSGSAVE  EQU   SECSAVE+8                                                00738000
LGNSAVE  EQU   SECSAVE+10                                               00739000
OPTSAVE  EQU   SECSAVE+18                                               00740000
VBPHSPUL EQU   VBPHFIX+208                                              00741000
VBPHTCB  EQU   VBPHFIX+212                                              00742000
VBPVCB   EQU   0                                                        00743000
VBPVFXD  EQU   VBPVCB                                                   00744000
VBPVAPTR EQU   VBPVFXD+36                                               00745000
ILRGOS   EQU   0                                                        00746000
ILRACAOP EQU   0                                                        00747000
IKEBC    EQU   0                                                        00748000
IKEBF15  EQU   0                                                        00749000
IKEBF31  EQU   0                                                        00750000
IKEBP15  EQU   0                                                        00751000
IKEBP31  EQU   0                                                        00752000
IKEBP8   EQU   0                                                        00753000
ILRTRPAG EQU   0                                                        00754000
VBPVASIN EQU   0                                                        00755000
PSARSVTE EQU   PSARSVT                                                  00756000
JSCBSEC2 EQU   JSCBEND1                                                 00757000
JSCBSEC3 EQU   JSCBEND1                                                 00758000
JSCBJCT  EQU   JSCBSEC3                                                 00759000
JSCBJCTA EQU   JSCBJCT+1                                                00760000
JSCBASID EQU   JSCBSEC3+8                                               00761000
JSCBFBYT EQU   JSCBSEC3+10                                              00762000
JSCBJNL  EQU   JSCBSEC3+28                                              00763000
JSCBJJSB EQU   JSCBJNL                                                  00764000
JSCBSUB  EQU   JSCBSEC3+40                                              00765000
JSCSCT   EQU   JSCBSEC3+68                                              00766000
JSCBSWSP EQU   JSCBSEC3+87                                              00767000
JSCBACT  EQU   JSCBSEC3+88                                              00768000
JSCRSV45 EQU   JSCBSEC3+112                                             00769000
JSCRSV46 EQU   JSCRSV45                                                 00770000
JSCRSV47 EQU   JSCRSV45+2                                               00771000
CVTS01   EQU   CVTPGSIA                                                 00772000
CVTLPDIA EQU   CVTS01+12                                                00773000
CVTDIRST EQU   CVTLPDIA                                                 00774000
CVTSLIDA EQU   CVTS01+24                                                00775000
CVTCTLFG EQU   CVTS01+50                                                00776000
CVTCRMN  EQU   CVTS01+156                                               00777000
CVTASMVT EQU   CVTS01+356                                               00778000
CVTRV210 EQU   CVTS01+424                                               00779000
CVTRV219 EQU   CVTS01+425                                               00780000
CVTRV228 EQU   CVTS01+426                                               00781000
CVTRV237 EQU   CVTS01+427                                               00782000
CVTMFRTR EQU   CVTS01+452                                               00783000
CVTRV262 EQU   CVTS01+468                                               00784000
CVTRV271 EQU   CVTS01+469                                               00785000
CVTRV280 EQU   CVTS01+470                                               00786000
CVTRV289 EQU   CVTS01+471                                               00787000
CVTGSDA  EQU   CVTS01+600                                               00788000
ASM1WKSV EQU   ASMWKSA1                                                 00789000
ASM1RGSV EQU   ASM1WKSV                                                 00790000
ASM1WRKA EQU   ASM1WKSV+60                                              00791000
ASM2WKSV EQU   ASMWKSA2                                                 00792000
ASM2WRKA EQU   ASM2WKSV+52                                              00793000
ASM2FLGS EQU   ASM2WRKA+12                                              00794000
ASM3WKSV EQU   ASMWKSA3                                                 00795000
ASM4WKSV EQU   ASMWKSA4                                                 00796000
ASM4RGSV EQU   ASM4WKSV                                                 00797000
ASM5WKSV EQU   ASMWKSA5                                                 00798000
ASM5RGSV EQU   ASM5WKSV                                                 00799000
FLC      EQU   PSA                                                      00800000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00801000
ASM5FLGS EQU   ASM5WKSV+64                                              00802000
ASM5AIA  EQU   ASM5WKSV+60                                              00803000
ASM5GCTR EQU   ASM5WKSV+56                                              00804000
ASM5SR14 EQU   ASM5WKSV+52                                              00805000
@NM00040 EQU   ASM5RGSV+4                                               00806000
ASM5RG2  EQU   ASM5RGSV                                                 00807000
@NM00039 EQU   ASM4RGSV+4                                               00808000
ASM4RG2  EQU   ASM4RGSV                                                 00809000
ASM3SR13 EQU   ASM3WKSV+28                                              00810000
ASM3R14B EQU   ASM3WKSV+24                                              00811000
ASM3R14A EQU   ASM3WKSV+20                                              00812000
ASM3GRPA EQU   ASM3WKSV+16                                              00813000
ASM3TMPA EQU   ASM3WKSV+12                                              00814000
ASM3PIOP EQU   ASM3WKSV+8                                               00815000
ASM3GENQ EQU   ASM3WKSV+4                                               00816000
ASM3SWPQ EQU   ASM3WKSV                                                 00817000
ASM2SR14 EQU   ASM2WRKA+16                                              00818000
@NM00038 EQU   ASM2WRKA+13                                              00819000
ASM2WFLG EQU   ASM2FLGS                                                 00820000
ASM2RFLG EQU   ASM2FLGS                                                 00821000
ASM2DUPQ EQU   ASM2WRKA+8                                               00822000
ASM2CAQ  EQU   ASM2WRKA+4                                               00823000
ASM2PAQ  EQU   ASM2WRKA                                                 00824000
ASM2RGSV EQU   ASM2WKSV                                                 00825000
ASM1NXTA EQU   ASM1WRKA+4                                               00826000
ASM1ASCB EQU   ASM1WRKA                                                 00827000
ASM1RG15 EQU   ASM1RGSV+56                                              00828000
@NM00037 EQU   ASM1RGSV+4                                               00829000
ASM1RG1  EQU   ASM1RGSV                                                 00830000
CVTRV628 EQU   CVTS01+728                                               00831000
CVTRV627 EQU   CVTS01+724                                               00832000
CVTRV626 EQU   CVTS01+720                                               00833000
CVTRV625 EQU   CVTS01+716                                               00834000
CVTRV624 EQU   CVTS01+712                                               00835000
CVTRV623 EQU   CVTS01+708                                               00836000
CVTRV622 EQU   CVTS01+704                                               00837000
CVTRV621 EQU   CVTS01+700                                               00838000
CVTIHASU EQU   CVTS01+696                                               00839000
CVTSUSP  EQU   CVTS01+692                                               00840000
CVTT6SVC EQU   CVTS01+688                                               00841000
CVTCDAL  EQU   CVTS01+684                                               00842000
CVTTCTL  EQU   CVTS01+680                                               00843000
CVTRSUME EQU   CVTS01+676                                               00844000
CVTJTERM EQU   CVTS01+672                                               00845000
CVTASMRM EQU   CVTS01+668                                               00846000
CVTTCASP EQU   CVTS01+664                                               00847000
CVT0PT03 EQU   CVTS01+660                                               00848000
CVT0PT0E EQU   CVTS01+656                                               00849000
CVTRV609 EQU   CVTS01+652                                               00850000
CVTCGK   EQU   CVTS01+648                                               00851000
CVTRAC   EQU   CVTS01+644                                               00852000
CVTRV606 EQU   CVTS01+640                                               00853000
CVTRV605 EQU   CVTS01+636                                               00854000
CVTRV604 EQU   CVTS01+632                                               00855000
CVTEFF02 EQU   CVTS01+628                                               00856000
CVTCBBR  EQU   CVTS01+624                                               00857000
CVTSSCR  EQU   CVTS01+620                                               00858000
CVTEVENT EQU   CVTS01+616                                               00859000
CVTCRCA  EQU   CVTS01+612                                               00860000
CVTTPIO  EQU   CVTS01+608                                               00861000
CVTADV   EQU   CVTS01+604                                               00862000
CVTGSDAB EQU   CVTGSDA                                                  00863000
CVTQV3   EQU   CVTS01+596                                               00864000
CVTQV2   EQU   CVTS01+592                                               00865000
CVTQV1   EQU   CVTS01+588                                               00866000
CVTRPT   EQU   CVTS01+584                                               00867000
CVTSSRB  EQU   CVTS01+580                                               00868000
CVTCSDRL EQU   CVTS01+576                                               00869000
CVTEXP1  EQU   CVTS01+572                                               00870000
CVTRMPMT EQU   CVTS01+568                                               00871000
CVTRMPTT EQU   CVTS01+564                                               00872000
CVTVPSA  EQU   CVTS01+560                                               00873000
CVTVSTOP EQU   CVTS01+556                                               00874000
CVTGTFR8 EQU   CVTS01+552                                               00875000
CVTQUIT  EQU   CVTS01+548                                               00876000
CVTVACR  EQU   CVTS01+544                                               00877000
CVTWTCB  EQU   CVTS01+540                                               00878000
CVTSTPRS EQU   CVTS01+536                                               00879000
CVT0PT02 EQU   CVTS01+532                                               00880000
CVTDARCM EQU   CVTS01+528                                               00881000
CVTIRECM EQU   CVTS01+524                                               00882000
CVTJRECM EQU   CVTS01+520                                               00883000
CVTVEMS0 EQU   CVTS01+516                                               00884000
CVTSPFRR EQU   CVTS01+512                                               00885000
CVTRLSTG EQU   CVTS01+508                                               00886000
CVT0TC0A EQU   CVTS01+504                                               00887000
CVTGMBR  EQU   CVTS01+500                                               00888000
CVTLFRM  EQU   CVTS01+496                                               00889000
CVTRMBR  EQU   CVTS01+492                                               00890000
CVTVIOP  EQU   CVTS01+488                                               00891000
CVTRV307 EQU   CVTS01+486                                               00892000
CVTRV306 EQU   CVTS01+484                                               00893000
CVTRV305 EQU   CVTS01+482                                               00894000
CVTRV304 EQU   CVTS01+480                                               00895000
CVTRV303 EQU   CVTS01+478                                               00896000
CVTRV302 EQU   CVTS01+476                                               00897000
CVTTRCA  EQU   CVTS01+472                                               00898000
CVTRV297 EQU   CVTRV289                                                 00899000
CVTRV296 EQU   CVTRV289                                                 00900000
CVTRV295 EQU   CVTRV289                                                 00901000
CVTRV294 EQU   CVTRV289                                                 00902000
CVTRV293 EQU   CVTRV289                                                 00903000
CVTRV292 EQU   CVTRV289                                                 00904000
CVTRV291 EQU   CVTRV289                                                 00905000
CVTRV290 EQU   CVTRV289                                                 00906000
CVTRV288 EQU   CVTRV280                                                 00907000
CVTRV287 EQU   CVTRV280                                                 00908000
CVTRV286 EQU   CVTRV280                                                 00909000
CVTRV285 EQU   CVTRV280                                                 00910000
CVTRV284 EQU   CVTRV280                                                 00911000
CVTRV283 EQU   CVTRV280                                                 00912000
CVTRV282 EQU   CVTRV280                                                 00913000
CVTRV281 EQU   CVTRV280                                                 00914000
CVTRV279 EQU   CVTRV271                                                 00915000
CVTRV278 EQU   CVTRV271                                                 00916000
CVTRV277 EQU   CVTRV271                                                 00917000
CVTRV276 EQU   CVTRV271                                                 00918000
CVTRV275 EQU   CVTRV271                                                 00919000
CVTRV274 EQU   CVTRV271                                                 00920000
CVTRV273 EQU   CVTRV271                                                 00921000
CVTRV272 EQU   CVTRV271                                                 00922000
CVTRV270 EQU   CVTRV262                                                 00923000
CVTRV269 EQU   CVTRV262                                                 00924000
CVTRV268 EQU   CVTRV262                                                 00925000
CVTRV267 EQU   CVTRV262                                                 00926000
CVTRV266 EQU   CVTRV262                                                 00927000
CVTRV265 EQU   CVTRV262                                                 00928000
CVTRV264 EQU   CVTRV262                                                 00929000
CVTRV263 EQU   CVTRV262                                                 00930000
CVTVFP   EQU   CVTS01+464                                               00931000
CVTVSI   EQU   CVTS01+460                                               00932000
CVTVPSIB EQU   CVTS01+456                                               00933000
CVTMFACT EQU   CVTMFRTR                                                 00934000
CVTMFCTL EQU   CVTS01+448                                               00935000
CVTPVBP  EQU   CVTS01+444                                               00936000
CVTPWI   EQU   CVTS01+440                                               00937000
CVTRV254 EQU   CVTS01+438                                               00938000
CVTRV253 EQU   CVTS01+436                                               00939000
CVTRV252 EQU   CVTS01+434                                               00940000
CVTRV251 EQU   CVTS01+433                                               00941000
CVTRV250 EQU   CVTS01+432                                               00942000
CVTRV249 EQU   CVTS01+431                                               00943000
CVTRV248 EQU   CVTS01+430                                               00944000
CVTRV247 EQU   CVTS01+429                                               00945000
CVTRV246 EQU   CVTS01+428                                               00946000
CVTRV245 EQU   CVTRV237                                                 00947000
CVTRV244 EQU   CVTRV237                                                 00948000
CVTRV243 EQU   CVTRV237                                                 00949000
CVTRV242 EQU   CVTRV237                                                 00950000
CVTRV241 EQU   CVTRV237                                                 00951000
CVTRV240 EQU   CVTRV237                                                 00952000
CVTRV239 EQU   CVTRV237                                                 00953000
CVTRV238 EQU   CVTRV237                                                 00954000
CVTRV236 EQU   CVTRV228                                                 00955000
CVTRV235 EQU   CVTRV228                                                 00956000
CVTRV234 EQU   CVTRV228                                                 00957000
CVTRV233 EQU   CVTRV228                                                 00958000
CVTRV232 EQU   CVTRV228                                                 00959000
CVTRV231 EQU   CVTRV228                                                 00960000
CVTRV230 EQU   CVTRV228                                                 00961000
CVTRV229 EQU   CVTRV228                                                 00962000
CVTRV227 EQU   CVTRV219                                                 00963000
CVTRV226 EQU   CVTRV219                                                 00964000
CVTRV225 EQU   CVTRV219                                                 00965000
CVTRV224 EQU   CVTRV219                                                 00966000
CVTRV223 EQU   CVTRV219                                                 00967000
CVTRV222 EQU   CVTRV219                                                 00968000
CVTRV221 EQU   CVTRV219                                                 00969000
CVTRV220 EQU   CVTRV219                                                 00970000
CVTRV218 EQU   CVTRV210                                                 00971000
CVTRV217 EQU   CVTRV210                                                 00972000
CVTRV216 EQU   CVTRV210                                                 00973000
CVTRV215 EQU   CVTRV210                                                 00974000
CVTRV214 EQU   CVTRV210                                                 00975000
CVTRV213 EQU   CVTRV210                                                 00976000
CVTRV212 EQU   CVTRV210                                                 00977000
CVTRV211 EQU   CVTRV210                                                 00978000
CVTLCCAT EQU   CVTS01+420                                               00979000
CVTPCCAT EQU   CVTS01+416                                               00980000
CVTIPCRP EQU   CVTS01+412                                               00981000
CVTIPCRI EQU   CVTS01+408                                               00982000
CVTIPCDS EQU   CVTS01+404                                               00983000
CVTAIDVT EQU   CVTS01+400                                               00984000
CVTSSAP  EQU   CVTS01+396                                               00985000
CVTEHCIR EQU   CVTS01+392                                               00986000
CVTEHDEF EQU   CVTS01+388                                               00987000
CVTDAIR  EQU   CVTS01+384                                               00988000
CVTPERFM EQU   CVTS01+380                                               00989000
CVT044R2 EQU   CVTS01+376                                               00990000
CVTFETCH EQU   CVTS01+372                                               00991000
CVTRSTWD EQU   CVTS01+368                                               00992000
CVTSPOST EQU   CVTS01+364                                               00993000
CVTIOBP  EQU   CVTS01+360                                               00994000
CVTRECRQ EQU   CVTS01+352                                               00995000
CVTWSAC  EQU   CVTS01+348                                               00996000
CVTRV149 EQU   CVTS01+344                                               00997000
CVTWSAL  EQU   CVTS01+340                                               00998000
CVTSPSA  EQU   CVTS01+336                                               00999000
CVTGLMN  EQU   CVTS01+332                                               01000000
CVTVEAC0 EQU   CVTS01+328                                               01001000
CVT062R1 EQU   CVTS01+324                                               01002000
CVTRPOST EQU   CVTS01+320                                               01003000
CVTDQIQE EQU   CVTS01+316                                               01004000
CVTCSD   EQU   CVTS01+312                                               01005000
CVTLKRMA EQU   CVTS01+308                                               01006000
CVTRSPIE EQU   CVTS01+304                                               01007000
CVTRENQ  EQU   CVTS01+300                                               01008000
CVTLQCB  EQU   CVTS01+296                                               01009000
CVTFQCB  EQU   CVTS01+292                                               01010000
CVTQCS01 EQU   CVTS01+288                                               01011000
CVTAPFT  EQU   CVTS01+284                                               01012000
CVTPARRL EQU   CVTS01+280                                               01013000
CVTVWAIT EQU   CVTS01+276                                               01014000
CVTGSPL  EQU   CVTS01+272                                               01015000
CVTLSMQ  EQU   CVTS01+268                                               01016000
CVTGSMQ  EQU   CVTS01+264                                               01017000
CVTEXPRO EQU   CVTS01+260                                               01018000
CVTOPCTP EQU   CVTS01+256                                               01019000
CVTSIC   EQU   CVTS01+252                                               01020000
CVTTPIOS EQU   CVTS01+248                                               01021000
CVTRTMS  EQU   CVTS01+244                                               01022000
CVTSDBF  EQU   CVTS01+240                                               01023000
CVTSCBP  EQU   CVTS01+236                                               01024000
CVTSDMP  EQU   CVTS01+232                                               01025000
CVTSV60  EQU   CVTS01+228                                               01026000
CVTRTMCT EQU   CVTS01+224                                               01027000
CVTASCBL EQU   CVTS01+220                                               01028000
CVTASCBH EQU   CVTS01+216                                               01029000
CVTGDA   EQU   CVTS01+212                                               01030000
CVTASVT  EQU   CVTS01+208                                               01031000
CVTVVMDI EQU   CVTS01+204                                               01032000
CVTAQTOP EQU   CVTS01+200                                               01033000
CVTIOSCS EQU   CVTS01+196                                               01034000
CVTSDRM  EQU   CVTS01+192                                               01035000
CVTOPTE  EQU   CVTS01+188                                               01036000
CVTSTXU  EQU   CVTS01+184                                               01037000
CVTQUIS  EQU   CVTS01+180                                               01038000
CVTPARS  EQU   CVTS01+176                                               01039000
CVTS1EE  EQU   CVTS01+172                                               01040000
CVTFRAS  EQU   CVTS01+168                                               01041000
CVTQSAS  EQU   CVTS01+164                                               01042000
CVTCRAS  EQU   CVTS01+160                                               01043000
CVTDELCP EQU   CVTS01+152                                               01044000
CVTFRECL EQU   CVTS01+148                                               01045000
CVTGETCL EQU   CVTS01+144                                               01046000
CVTBLDCP EQU   CVTS01+140                                               01047000
CVTAUTHL EQU   CVTS01+136                                               01048000
CVTSCAN  EQU   CVTS01+132                                               01049000
CVTRV144 EQU   CVTS01+130                                               01050000
CVTMAXMP EQU   CVTS01+128                                               01051000
CVTSTCK  EQU   CVTS01+124                                               01052000
CVTRV139 EQU   CVTS01+123                                               01053000
CVTDSSAC EQU   CVTS01+122                                               01054000
CVTRV513 EQU   CVTS01+121                                               01055000
CVTIOSPL EQU   CVTS01+120                                               01056000
CVTPTGT  EQU   CVTS01+116                                               01057000
CVTCSPIE EQU   CVTS01+112                                               01058000
CVTSMFEX EQU   CVTS01+108                                               01059000
CVTOLT0A EQU   CVTS01+104                                               01060000
CVTSRBRT EQU   CVTS01+100                                               01061000
CVTPUTL  EQU   CVTS01+96                                                01062000
CVTASCRL EQU   CVTS01+92                                                01063000
CVTASCRF EQU   CVTS01+88                                                01064000
CVTRV326 EQU   CVTS01+84                                                01065000
CVTRV325 EQU   CVTS01+80                                                01066000
CVTRV324 EQU   CVTS01+76                                                01067000
CVT0VL01 EQU   CVTS01+72                                                01068000
CVTSHRVM EQU   CVTS01+68                                                01069000
CVTRV332 EQU   CVTS01+64                                                01070000
CVTTAS   EQU   CVTS01+60                                                01071000
CVTRSCN  EQU   CVTS01+56                                                01072000
CVTTRAC2 EQU   CVTS01+54                                                01073000
CVTTRACE EQU   CVTS01+52                                                01074000
CVTAPG   EQU   CVTS01+51                                                01075000
CVTSDTRC EQU   CVTCTLFG                                                 01076000
CVTGTRCE EQU   CVTCTLFG                                                 01077000
CVTNOMP  EQU   CVTCTLFG                                                 01078000
CVTRSV79 EQU   CVTCTLFG                                                 01079000
CVTDSTAT EQU   CVTCTLFG                                                 01080000
CVTRSV78 EQU   CVTCTLFG                                                 01081000
CVTRV333 EQU   CVTCTLFG                                                 01082000
CVTRV323 EQU   CVTCTLFG                                                 01083000
CVTSPVLK EQU   CVTS01+49                                                01084000
CVTRSV77 EQU   CVTS01+48                                                01085000
CVTRV331 EQU   CVTS01+44                                                01086000
CVTRV330 EQU   CVTS01+40                                                01087000
CVTRV329 EQU   CVTS01+36                                                01088000
CVTRV328 EQU   CVTS01+32                                                01089000
CVTRV322 EQU   CVTS01+28                                                01090000
CVTSLID  EQU   CVTSLIDA+1                                               01091000
CVTSYLK  EQU   CVTSLIDA                                                 01092000
CVTRV321 EQU   CVTS01+20                                                01093000
CVTRV320 EQU   CVTS01+16                                                01094000
CVTLPDIR EQU   CVTLPDIA+1                                               01095000
CVTRSV69 EQU   CVTDIRST                                                 01096000
CVTRSV68 EQU   CVTDIRST                                                 01097000
CVTRSV67 EQU   CVTDIRST                                                 01098000
CVTRSV66 EQU   CVTDIRST                                                 01099000
CVTRSV65 EQU   CVTDIRST                                                 01100000
CVTRSV64 EQU   CVTDIRST                                                 01101000
CVTRSV63 EQU   CVTDIRST                                                 01102000
CVTDICOM EQU   CVTDIRST                                                 01103000
CVTPVTP  EQU   CVTS01+8                                                 01104000
CVTLPDSR EQU   CVTS01+4                                                 01105000
CVTGETL  EQU   CVTS01                                                   01106000
JSCBEND3 EQU   JSCBSEC3+120                                             01107000
JSCRSV52 EQU   JSCBSEC3+116                                             01108000
JSCRSV51 EQU   JSCRSV47+1                                               01109000
JSCRSV50 EQU   JSCRSV47                                                 01110000
JSCRSV49 EQU   JSCRSV46+1                                               01111000
JSCRSV48 EQU   JSCRSV46                                                 01112000
JSCRSV44 EQU   JSCBSEC3+108                                             01113000
JSCRSV43 EQU   JSCBSEC3+104                                             01114000
JSCRSV42 EQU   JSCBSEC3+100                                             01115000
JSCBASWA EQU   JSCBSEC3+96                                              01116000
JSCBUFPT EQU   JSCBSEC3+92                                              01117000
JSCRSV33 EQU   JSCBSEC3+86                                              01118000
JSCDDNUM EQU   JSCBSEC3+84                                              01119000
JSCRSV53 EQU   JSCBSEC3+82                                              01120000
JSCDDNNO EQU   JSCBSEC3+80                                              01121000
JSCBVATA EQU   JSCBSEC3+76                                              01122000
JSCTMCOR EQU   JSCBSEC3+72                                              01123000
JSCSCTP  EQU   JSCSCT+1                                                 01124000
JSCRSV55 EQU   JSCSCT                                                   01125000
JSCRSV54 EQU   JSCBSEC3+64                                              01126000
JSCDSABQ EQU   JSCBSEC3+60                                              01127000
JSCBSSIB EQU   JSCBSEC3+56                                              01128000
JSCBFRBA EQU   JSCBSEC3+48                                              01129000
JSCRSV28 EQU   JSCBSEC3+46                                              01130000
JSCBSONO EQU   JSCBSEC3+44                                              01131000
JSCBSUBA EQU   JSCBSUB+1                                                01132000
JSCRSV31 EQU   JSCBSUB                                                  01133000
JSCBSMLR EQU   JSCBSEC3+36                                              01134000
JSCBJNLR EQU   JSCBSEC3+32                                              01135000
JSCBJNLA EQU   JSCBJNL+1                                                01136000
JSCBJSBT EQU   JSCBJJSB                                                 01137000
JSCBJSBX EQU   JSCBJJSB                                                 01138000
JSCBJSBA EQU   JSCBJJSB                                                 01139000
JSCBJSBI EQU   JSCBJJSB                                                 01140000
@NM00033 EQU   JSCBJJSB                                                 01141000
JSCBJNLE EQU   JSCBJJSB                                                 01142000
JSCBJNLF EQU   JSCBJJSB                                                 01143000
JSCBJNLN EQU   JSCBJJSB                                                 01144000
@NM00032 EQU   JSCBSEC3+24                                              01145000
JSCBJRBA EQU   JSCBSEC3+16                                              01146000
JSCBIECB EQU   JSCBSEC3+12                                              01147000
JSCBRV08 EQU   JSCBSEC3+11                                              01148000
JSCBRV07 EQU   JSCBFBYT                                                 01149000
JSCBRV06 EQU   JSCBFBYT                                                 01150000
JSCBRV05 EQU   JSCBFBYT                                                 01151000
JSCBRV04 EQU   JSCBFBYT                                                 01152000
JSCBRV03 EQU   JSCBFBYT                                                 01153000
JSCBRV02 EQU   JSCBFBYT                                                 01154000
JSCBADSP EQU   JSCBFBYT                                                 01155000
JSCBRV01 EQU   JSCBFBYT                                                 01156000
JSCBTJID EQU   JSCBASID                                                 01157000
JSCBPSCB EQU   JSCBSEC3+4                                               01158000
JSCJCTP  EQU   JSCBJCTA                                                 01159000
JSCRSV24 EQU   JSCBJCT                                                  01160000
JSCBEND2 EQU   JSCBSEC2                                                 01161000
PSARSAV  EQU   PSARSVTE+60                                              01162000
PSARSTK  EQU   PSARSVTE+56                                              01163000
PSAESAV3 EQU   PSARSVTE+52                                              01164000
PSAESTK3 EQU   PSARSVTE+48                                              01165000
PSAESAV2 EQU   PSARSVTE+44                                              01166000
PSAESTK2 EQU   PSARSVTE+40                                              01167000
PSAESAV1 EQU   PSARSVTE+36                                              01168000
PSAESTK1 EQU   PSARSVTE+32                                              01169000
PSAPSAV  EQU   PSARSVTE+28                                              01170000
PSAPSTK  EQU   PSARSVTE+24                                              01171000
PSAMSAV  EQU   PSARSVTE+20                                              01172000
PSAMSTK  EQU   PSARSVTE+16                                              01173000
PSASSAV  EQU   PSARSVTE+12                                              01174000
PSASSTK  EQU   PSARSVTE+8                                               01175000
PSANSTK  EQU   PSARSVTE+4                                               01176000
PSACSTK  EQU   PSARSVTE                                                 01177000
VBPVMOVE EQU   VBPVCB+40                                                01178000
VCBSAVAD EQU   VBPVFXD+32                                               01179000
VBPVMAP  EQU   VBPVFXD+8                                                01180000
VBPVLEN  EQU   VBPVFXD+4                                                01181000
VBPVNAME EQU   VBPVFXD                                                  01182000
VBPHMAD  EQU   VBPDSPCT+216                                             01183000
VBPHJRNP EQU   VBPHFIX+209                                              01184000
SECSAVO  EQU   SECSAVE+4                                                01185000
@NM00044 EQU   SECSAVE                                                  01186000
VBPHSAVO EQU   VBPHSAVE+4                                               01187000
@NM00043 EQU   VBPHSAVE                                                 01188000
VBPHFRAR EQU   VBPHFIX+56                                               01189000
VBPHVOP  EQU   VBPHBUFC                                                 01190000
VBPHWSZ  EQU   VBPHJJ+38                                                01191000
VBPHMMP  EQU   VBPHJJ+36                                                01192000
VBPHNMP  EQU   VBPHJJ+34                                                01193000
@NM00042 EQU   VBPHSTA                                                  01194000
VBPHCLO  EQU   VBPHSTA                                                  01195000
VBPHSCR  EQU   VBPHSTA                                                  01196000
@NM00041 EQU   VBPHSTA                                                  01197000
VBPHRW   EQU   VBPHSTA                                                  01198000
VBPHOPE  EQU   VBPHSTA                                                  01199000
VBPHJOU  EQU   VBPHOPT                                                  01200000
VBPHPADD EQU   VBPHOPT                                                  01201000
VBPHPGLD EQU   VBPHOPT                                                  01202000
VBPHINS  EQU   VBPHOPT                                                  01203000
VBPHDSSZ EQU   VBPHJJ+28                                                01204000
VBPHPNP  EQU   VBPHJJ+24                                                01205000
VBPHSYM2 EQU   VBPHSYM+4                                                01206000
VBPHSYM1 EQU   VBPHSYM                                                  01207000
VBPHLPG2 EQU   VBPHLGID+2                                               01208000
VBPHLPG1 EQU   VBPHLGID                                                 01209000
VBPHNAME EQU   VBPHJJ                                                   01210000
ASMCPRES EQU   ASMCPRSQ+4                                               01211000
ASMCPTAK EQU   ASMCPRSQ                                                 01212000
ASMCPCNT EQU   ASMCPAVQ+4                                               01213000
ASMCPAVL EQU   ASMCPAVQ                                                 01214000
ASMCPEXT EQU   ASMPOOLS+6                                               01215000
ASMCPSIZ EQU   ASMPOOLS+4                                               01216000
ASMCPID  EQU   ASMPOOLS                                                 01217000
ASMRSV12 EQU   ASMVT+1000                                               01218000
ASMSAVE  EQU   ASMVT+928                                                01219000
ASMWKSA7 EQU   ASMVT+848                                                01220000
ASMWKSA6 EQU   ASMVT+768                                                01221000
ASMACEPC EQU   ASMVT+344                                                01222000
ASMSWKPC EQU   ASMVT+328                                                01223000
ASMBWKPC EQU   ASMVT+312                                                01224000
ASMIOEPC EQU   ASMVT+296                                                01225000
ASMRSV10 EQU   ASMVT+280                                                01226000
ASMPVACE EQU   ASMVT+276                                                01227000
ASMPIOFR EQU   ASMVT+272                                                01228000
ASMPVACQ EQU   ASMVT+268                                                01229000
ASMPMSGS EQU   ASMVT+264                                                01230000
ASMPMSG0 EQU   ASMVT+260                                                01231000
ASMPFRLG EQU   ASMVT+256                                                01232000
ASMPRLG  EQU   ASMVT+252                                                01233000
ASMPACT  EQU   ASMVT+248                                                01234000
ASMPSAV  EQU   ASMVT+244                                                01235000
ASMPCMP  EQU   ASMVT+240                                                01236000
ASMPCMPA EQU   ASMVT+236                                                01237000
ASMPCMPN EQU   ASMVT+232                                                01238000
ASMPCMPD EQU   ASMVT+228                                                01239000
ASMPEX   EQU   ASMVT+224                                                01240000
ASMVRMTR EQU   ASMVT+220                                                01241000
ASMPSRBC EQU   ASMVT+216                                                01242000
ASMPSRMT EQU   ASMVT+212                                                01243000
ASMPSWPD EQU   ASMVT+208                                                01244000
ASMPTM   EQU   ASMVT+204                                                01245000
ASMPFRSW EQU   ASMVT+200                                                01246000
ASMPFRSL EQU   ASMVT+196                                                01247000
ASMPQIOE EQU   ASMVT+192                                                01248000
ASMRSV8  EQU   ASMVT+184                                                01249000
ASMTASCB EQU   ASMVT+180                                                01250000
ASMRLGWQ EQU   ASMVT+176                                                01251000
ASMRLGRQ EQU   ASMVT+172                                                01252000
ASMTMECB EQU   ASMVT+168                                                01253000
ASMTCBPT EQU   ASMVT+164                                                01254000
ASMREQCT EQU   ASMVT+160                                                01255000
ASMGOSWK EQU   ASMGOSQS+4                                               01256000
ASMGOSWT EQU   ASMGOSQS                                                 01257000
ASMLSAIH EQU   ASMLSAI+4                                                01258000
ASMLSAIL EQU   ASMLSAI                                                  01259000
ASMCINV  EQU   ASMVT+140                                                01260000
ASMSTGXA EQU   ASMVT+136                                                01261000
ASMLGVT  EQU   ASMVT+132                                                01262000
ASMSLOTV EQU   ASMVT+128                                                01263000
ASMERRS  EQU   ASMVT+124                                                01264000
ASMNVSC  EQU   ASMVT+120                                                01265000
ASMVSC   EQU   ASMVT+116                                                01266000
ASMSLOTS EQU   ASMVT+112                                                01267000
ASMBKSLT EQU   ASMVT+108                                                01268000
ASMRSV7  EQU   ASMVT+92                                                 01269000
ASMPSRB  EQU   ASMVT+88                                                 01270000
ASMSRBCT EQU   ASMVT+84                                                 01271000
ASMIOCNT EQU   ASMVT+80                                                 01272000
ASMBURST EQU   ASMVT+76                                                 01273000
ASMPCCWN EQU   ASMVT+72                                                 01274000
ASMPCCWC EQU   ASMPCCWQ+4                                               01275000
ASMPCCWA EQU   ASMPCCWQ                                                 01276000
ASMRSV6  EQU   ASMVT+48                                                 01277000
ASMIORQC EQU   ASMVT+44                                                 01278000
ASMIORQR EQU   ASMVT+40                                                 01279000
ASMSTAGL EQU   ASMSTAGQ+4                                               01280000
ASMSTAGF EQU   ASMSTAGQ                                                 01281000
ASMRSV5  EQU   ASMVT+28                                                 01282000
ASMMSGBF EQU   ASMVT+24                                                 01283000
ASMEREC  EQU   ASMVT+20                                                 01284000
ASMPART  EQU   ASMVT+8                                                  01285000
ASMSART  EQU   ASMVT+4                                                  01286000
ASMRSV4  EQU   ASMVT+2                                                  01287000
ASMWARM  EQU   ASMFLAG2                                                 01288000
ASMQUICK EQU   ASMFLAG2                                                 01289000
ASMNOTPT EQU   ASMFLAG2                                                 01290000
ASMNOTMR EQU   ASMFLAG2                                                 01291000
ASMNOSAV EQU   ASMFLAG2                                                 01292000
ASMCALLQ EQU   ASMFLAG2                                                 01293000
ASMPLPAS EQU   ASMFLAG1                                                 01294000
ASMCOMMF EQU   ASMFLAG1                                                 01295000
ASMPLPAF EQU   ASMFLAG1                                                 01296000
ASMNODPX EQU   ASMFLAG1                                                 01297000
ASMRSV1  EQU   ASMFLAG1                                                 01298000
ASMNOLCL EQU   ASMFLAG1                                                 01299000
ASMNOCWQ EQU   ASMFLAG1                                                 01300000
ASMDUPLX EQU   ASMFLAG1                                                 01301000
CVTLEVL  EQU   CVTRELNO+2                                               01302000
CVTNUMB  EQU   CVTRELNO                                                 01303000
CVTMDL   EQU   CVTFIX+250                                               01304000
@NM00035 EQU   CVTFIX+248                                               01305000
@NM00034 EQU   CVTFIX                                                   01306000
CVTRV482 EQU   CVTXTNT2+128                                             01307000
CVTRV481 EQU   CVTXTNT2+124                                             01308000
CVTRV480 EQU   CVTXTNT2+120                                             01309000
CVTRV479 EQU   CVTXTNT2+118                                             01310000
CVTRV478 EQU   CVTXTNT2+117                                             01311000
CVTRV477 EQU   CVTXTNT2+116                                             01312000
CVTRV476 EQU   CVTXTNT2+115                                             01313000
CVTRV475 EQU   CVTXTNT2+114                                             01314000
CVTRV474 EQU   CVTRV466                                                 01315000
CVTRV473 EQU   CVTRV466                                                 01316000
CVTRV472 EQU   CVTRV466                                                 01317000
CVTRV471 EQU   CVTRV466                                                 01318000
CVTRV470 EQU   CVTRV466                                                 01319000
CVTRV469 EQU   CVTRV466                                                 01320000
CVTRV468 EQU   CVTRV466                                                 01321000
CVTRV467 EQU   CVTRV466                                                 01322000
CVTRV465 EQU   CVTRV457                                                 01323000
CVTRV464 EQU   CVTRV457                                                 01324000
CVTRV463 EQU   CVTRV457                                                 01325000
CVTRV462 EQU   CVTRV457                                                 01326000
CVTRV461 EQU   CVTRV457                                                 01327000
CVTRV460 EQU   CVTRV457                                                 01328000
CVTRV459 EQU   CVTRV457                                                 01329000
CVTRV458 EQU   CVTRV457                                                 01330000
CVTRV456 EQU   CVTXTNT2+108                                             01331000
CVTRV455 EQU   CVTXTNT2+104                                             01332000
CVTRV454 EQU   CVTXTNT2+100                                             01333000
CVTRV453 EQU   CVTXTNT2+96                                              01334000
CVTRV452 EQU   CVTXTNT2+94                                              01335000
CVTRV451 EQU   CVTXTNT2+92                                              01336000
CVTRV450 EQU   CVTXTNT2+90                                              01337000
CVTRV449 EQU   CVTXTNT2+88                                              01338000
CVTRV448 EQU   CVTXTNT2+87                                              01339000
CVTRV447 EQU   CVTXTNT2+86                                              01340000
CVTRV446 EQU   CVTRV438                                                 01341000
CVTRV445 EQU   CVTRV438                                                 01342000
CVTRV444 EQU   CVTRV438                                                 01343000
CVTRV443 EQU   CVTRV438                                                 01344000
CVTRV442 EQU   CVTRV438                                                 01345000
CVTRV441 EQU   CVTRV438                                                 01346000
CVTRV440 EQU   CVTRV438                                                 01347000
CVTRV439 EQU   CVTRV438                                                 01348000
CVTRV437 EQU   CVTRV429                                                 01349000
CVTRV436 EQU   CVTRV429                                                 01350000
CVTRV435 EQU   CVTRV429                                                 01351000
CVTRV434 EQU   CVTRV429                                                 01352000
CVTRV433 EQU   CVTRV429                                                 01353000
CVTRV432 EQU   CVTRV429                                                 01354000
CVTRV431 EQU   CVTRV429                                                 01355000
CVTRV430 EQU   CVTRV429                                                 01356000
CVTRV428 EQU   CVTXTNT2+80                                              01357000
CVTRV427 EQU   CVTXTNT2+76                                              01358000
CVTRV426 EQU   CVTXTNT2+72                                              01359000
CVTRV425 EQU   CVTXTNT2+68                                              01360000
CVTATACT EQU   CVTATCVT                                                 01361000
CVTRV423 EQU   CVTXTNT2+62                                              01362000
CVTRV422 EQU   CVTXTNT2+60                                              01363000
CVTRV421 EQU   CVTXTNT2+58                                              01364000
CVTRV420 EQU   CVTXTNT2+56                                              01365000
CVTRV419 EQU   CVTXTNT2+55                                              01366000
CVTRV418 EQU   CVTXTNT2+54                                              01367000
CVTRV417 EQU   CVTRV409                                                 01368000
CVTRV416 EQU   CVTRV409                                                 01369000
CVTRV415 EQU   CVTRV409                                                 01370000
CVTRV414 EQU   CVTRV409                                                 01371000
CVTRV413 EQU   CVTRV409                                                 01372000
CVTRV412 EQU   CVTRV409                                                 01373000
CVTRV411 EQU   CVTRV409                                                 01374000
CVTRV410 EQU   CVTRV409                                                 01375000
CVTRV408 EQU   CVTRV400                                                 01376000
CVTRV407 EQU   CVTRV400                                                 01377000
CVTRV406 EQU   CVTRV400                                                 01378000
CVTRV405 EQU   CVTRV400                                                 01379000
CVTRV404 EQU   CVTRV400                                                 01380000
CVTRV403 EQU   CVTRV400                                                 01381000
CVTRV402 EQU   CVTRV400                                                 01382000
CVTRV401 EQU   CVTRV400                                                 01383000
CVTICB   EQU   CVTXTNT2+48                                              01384000
CVTSKTA  EQU   CVTXTNT2+44                                              01385000
CVTRSV99 EQU   CVTXTNT2+40                                              01386000
CVTRSV98 EQU   CVTXTNT2+36                                              01387000
CVTRSV97 EQU   CVTXTNT2+34                                              01388000
CVTRSV96 EQU   CVTXTNT2+32                                              01389000
CVTOLTEP EQU   CVTXTNT2+28                                              01390000
CVTQIDA  EQU   CVTQID+1                                                 01391000
CVTRSV95 EQU   CVTQID                                                   01392000
CVTRSV94 EQU   CVTXTNT2+20                                              01393000
CVTRSV93 EQU   CVTXTNT2+16                                              01394000
CVTRSV92 EQU   CVTXTNT2+12                                              01395000
CVTDEBVR EQU   CVTXTNT2+8                                               01396000
CVTRSV91 EQU   CVTXTNT2+6                                               01397000
CVTRSV9H EQU   CVTFLGBT                                                 01398000
CVTRSV9G EQU   CVTFLGBT                                                 01399000
CVTRSV9F EQU   CVTFLGBT                                                 01400000
CVTRSV9E EQU   CVTFLGBT                                                 01401000
CVTRSV9D EQU   CVTFLGBT                                                 01402000
CVTRSV9C EQU   CVTFLGBT                                                 01403000
CVTVME   EQU   CVTFLGBT                                                 01404000
CVTNPE   EQU   CVTFLGBT                                                 01405000
CVTNUCLS EQU   CVTXTNT2+4                                               01406000
CVTDSSVA EQU   CVTDSSV+1                                                01407000
CVTRSV89 EQU   CVTDSSV                                                  01408000
CVTRSV88 EQU   CVTXTNT1+8                                               01409000
CVTRSV87 EQU   CVTXTNT1+4                                               01410000
CVTFACHN EQU   CVTXTNT1                                                 01411000
CVTRV488 EQU   CVTMAP+412                                               01412000
CVTRV487 EQU   CVTMAP+408                                               01413000
CVTRV486 EQU   CVTMAP+404                                               01414000
CVTRV485 EQU   CVTMAP+400                                               01415000
CVTACTAP EQU   CVTMAP+396                                               01416000
CVTAUTH  EQU   CVTMAP+392                                               01417000
CVTATMCA EQU   CVTATMCT+1                                               01418000
CVTATMST EQU   CVTATMCT                                                 01419000
CVTRSV61 EQU   CVTMAP+384                                               01420000
CVTVOLT1 EQU   CVTVOLM1+1                                               01421000
CVTVOLI1 EQU   CVTVOLF1                                                 01422000
CVTSTOA  EQU   CVTMAP+376                                               01423000
CVTRSV58 EQU   CVTMAP+374                                               01424000
CVTRSV57 EQU   CVTMAP+372                                               01425000
CVTDDCE  EQU   CVTMAP+368                                               01426000
CVTPNWFR EQU   CVTMAP+364                                               01427000
CVTSMF   EQU   CVTMAP+360                                               01428000
CVTSULK  EQU   CVTMAP+358                                               01429000
CVTSLKO  EQU   CVTSYSK                                                  01430000
CVTSLKP  EQU   CVTSYSK                                                  01431000
CVTSLKQ  EQU   CVTSYSK                                                  01432000
CVTSLKR  EQU   CVTSYSK                                                  01433000
CVTRSV56 EQU   CVTSYSK                                                  01434000
CVTRSV55 EQU   CVTSYSK                                                  01435000
CVTRSV54 EQU   CVTSYSK                                                  01436000
CVTRSV53 EQU   CVTSYSK                                                  01437000
CVTRSV52 EQU   CVTA1F1                                                  01438000
CVTRSV51 EQU   CVTA1F1                                                  01439000
CVTRSV50 EQU   CVTA1F1                                                  01440000
CVTRSV49 EQU   CVTA1F1                                                  01441000
CVTRSV48 EQU   CVTA1F1                                                  01442000
CVTRSV47 EQU   CVTA1F1                                                  01443000
CVTSRSW  EQU   CVTA1F1                                                  01444000
CVTPFSW  EQU   CVTA1F1                                                  01445000
CVTPCVT  EQU   CVTMAP+352                                               01446000
CVTRSV46 EQU   CVTMAP+344                                               01447000
CVTRSV45 EQU   CVTMAP+340                                               01448000
CVTRSV44 EQU   CVTMAP+338                                               01449000
CVTRSV43 EQU   CVTMAP+336                                               01450000
CVTHJESA EQU   CVTHJES+1                                                01451000
CVTRSV42 EQU   CVTHJES                                                  01452000
CVTEXT2A EQU   CVTEXT2+1                                                01453000
CVTRSV41 EQU   CVTEXT2                                                  01454000
CVTAPFA  EQU   CVTAPF+1                                                 01455000
CVTRSV40 EQU   CVTAPF                                                   01456000
CVTRV518 EQU   CVTINTLA                                                 01457000
CVTRV517 EQU   CVTERPV                                                  01458000
CVTEORM  EQU   CVTMAP+312                                               01459000
CVTMCHPR EQU   CVTMAP+308                                               01460000
CVTTZ    EQU   CVTMAP+304                                               01461000
CVTJEPS  EQU   CVTMAP+300                                               01462000
CVTJESCT EQU   CVTMAP+296                                               01463000
CVTMODE  EQU   CVTMAP+292                                               01464000
CVTPTRV  EQU   CVTMAP+288                                               01465000
CVTREAL  EQU   CVTMAP+284                                               01466000
CVTRSV39 EQU   CVTMAP+280                                               01467000
CVTRSV38 EQU   CVTMAP+276                                               01468000
CVTDMSRA EQU   CVTDMSR+1                                                01469000
CVTRV634 EQU   CVTDMSRF                                                 01470000
CVTRV633 EQU   CVTDMSRF                                                 01471000
CVTRV632 EQU   CVTDMSRF                                                 01472000
CVTRV631 EQU   CVTDMSRF                                                 01473000
CVTRV630 EQU   CVTDMSRF                                                 01474000
CVTRV629 EQU   CVTDMSRF                                                 01475000
CVTUDUMP EQU   CVTDMSRF                                                 01476000
CVTSDUMP EQU   CVTDMSRF                                                 01477000
CVTQMSGA EQU   CVTQMSG+1                                                01478000
CVTRSV36 EQU   CVTQMSG                                                  01479000
CVTAMFF  EQU   CVTMAP+264                                               01480000
CVTPURGA EQU   CVTPURG+1                                                01481000
CVTRSV35 EQU   CVTPURG                                                  01482000
CVTCBSP  EQU   CVTMAP+256                                               01483000
CVTATERA EQU   CVTATER+1                                                01484000
CVTSYST  EQU   CVTATER                                                  01485000
CVTVOLT2 EQU   CVTTAT                                                   01486000
CVTVOLI2 EQU   CVTVOLF2                                                 01487000
CVTAQAVB EQU   CVTAQAVT+1                                               01488000
CVTRSV34 EQU   CVTTCMFG                                                 01489000
CVTRSV33 EQU   CVTTCMFG                                                 01490000
CVTRSV32 EQU   CVTTCMFG                                                 01491000
CVTRSV31 EQU   CVTTCMFG                                                 01492000
CVTRSV30 EQU   CVTTCMFG                                                 01493000
CVTRSV29 EQU   CVTTCMFG                                                 01494000
CVTRSV28 EQU   CVTTCMFG                                                 01495000
CVTTCRDY EQU   CVTTCMFG                                                 01496000
CVTGTFA  EQU   CVTGTF+1                                                 01497000
CVTRSV27 EQU   CVTGTFST                                                 01498000
CVTRNIO  EQU   CVTGTFST                                                 01499000
CVTUSR   EQU   CVTGTFST                                                 01500000
CVTRV318 EQU   CVTFORM                                                  01501000
CVTRV317 EQU   CVTTMODE                                                 01502000
CVTRV316 EQU   CVTSTATE                                                 01503000
CVTRV315 EQU   CVTGTFS                                                  01504000
CVTGTFAV EQU   CVTGTFS                                                  01505000
CVT0SCR1 EQU   CVTMAP+232                                               01506000
CVTRV515 EQU   CVTMAP+228                                               01507000
CVTRMS   EQU   CVTMAP+224                                               01508000
CVTPATCH EQU   CVTMAP+220                                               01509000
CVTTSCE  EQU   CVTMAP+216                                               01510000
CVTLNKSC EQU   CVTMAP+214                                               01511000
CVTQABST EQU   CVTMAP+212                                               01512000
CVTMDLDS EQU   CVTMAP+208                                               01513000
CVTUSER  EQU   CVTMAP+204                                               01514000
CVTABEND EQU   CVTMAP+200                                               01515000
CVTSMCA  EQU   CVTMAP+196                                               01516000
CVTRSV18 EQU   CVTMAP+192                                               01517000
CVTQLPAQ EQU   CVTMAP+188                                               01518000
CVTQCDSR EQU   CVTMAP+184                                               01519000
CVTRSV17 EQU   CVTOPTB                                                  01520000
CVTRSV16 EQU   CVTOPTB                                                  01521000
CVTFP    EQU   CVTOPTB                                                  01522000
CVTAPTHR EQU   CVTOPTB                                                  01523000
CVTNLOG  EQU   CVTOPTB                                                  01524000
CVTTOD   EQU   CVTOPTB                                                  01525000
CVTCTIMS EQU   CVTOPTB                                                  01526000
CVTPROT  EQU   CVTOPTB                                                  01527000
CVTXPFP  EQU   CVTOPTA                                                  01528000
CVTASCII EQU   CVTOPTA                                                  01529000
CVTRSV13 EQU   CVTOPTA                                                  01530000
CVTRSV12 EQU   CVTOPTA                                                  01531000
CVTNIP   EQU   CVTOPTA                                                  01532000
CVTDDR   EQU   CVTOPTA                                                  01533000
CVTAPR   EQU   CVTOPTA                                                  01534000
CVTCCH   EQU   CVTOPTA                                                  01535000
CVTSNCTR EQU   CVTMAP+180                                               01536000
CVTQMWR  EQU   CVTMAP+176                                               01537000
CVTQOCR  EQU   CVTMAP+172                                               01538000
CVT1EF00 EQU   CVTMAP+168                                               01539000
CVTMZ00  EQU   CVTMAP+164                                               01540000
CVTHEAD  EQU   CVTMAP+160                                               01541000
CVTRSV11 EQU   CVTMAP+156                                               01542000
CVT0PT01 EQU   CVTMAP+152                                               01543000
CVTMSER  EQU   CVTMAP+148                                               01544000
CVTRV516 EQU   CVTIERLC                                                 01545000
CVTILCH  EQU   CVTMAP+140                                               01546000
CVT0DS   EQU   CVTMAP+136                                               01547000
CVTFBOSV EQU   CVTMAP+132                                               01548000
CVTNUCB  EQU   CVTMAP+128                                               01549000
CVTIXAVL EQU   CVTMAP+124                                               01550000
CVTIOQET EQU   CVTMAP+120                                               01551000
CVTDCBA  EQU   CVTMAP+117                                               01552000
CVTMVS2  EQU   CVTDCB                                                   01553000
CVT6DAT  EQU   CVTDCB                                                   01554000
CVT4MPS  EQU   CVTDCB                                                   01555000
CVTRSV09 EQU   CVTDCB                                                   01556000
CVT4MS1  EQU   CVTDCB                                                   01557000
CVT2SPS  EQU   CVTDCB                                                   01558000
CVT1SSS  EQU   CVTDCB                                                   01559000
CVTRSV08 EQU   CVTDCB                                                   01560000
CVTSTB   EQU   CVTMAP+112                                               01561000
CVTQTD00 EQU   CVTMAP+108                                               01562000
CVTQTE00 EQU   CVTMAP+104                                               01563000
CVTCUCB  EQU   CVTMAP+100                                               01564000
CVTSJQ   EQU   CVTMAP+96                                                01565000
CVTPBLDL EQU   CVTMAP+92                                                01566000
CVTTPC   EQU   CVTMAP+88                                                01567000
CVTSVDCB EQU   CVTMAP+84                                                01568000
CVTBRET  EQU   CVTMAP+82                                                01569000
CVTEXIT  EQU   CVTMAP+80                                                01570000
CVT0FN00 EQU   CVTMAP+76                                                01571000
CVTDARA  EQU   CVTDAR+1                                                 01572000
CVTRSV07 EQU   CVTFLGS1                                                 01573000
CVTRSV06 EQU   CVTFLGS1                                                 01574000
CVTRSV05 EQU   CVTFLGS1                                                 01575000
CVTRSV04 EQU   CVTFLGS1                                                 01576000
CVTRSV03 EQU   CVTFLGS1                                                 01577000
CVTRSV02 EQU   CVTFLGS1                                                 01578000
CVTRSV01 EQU   CVTFLGS1                                                 01579000
CVTDMPLK EQU   CVTFLGS1                                                 01580000
CVTXITP  EQU   CVTMAP+68                                                01581000
CVTZDTAB EQU   CVTMAP+64                                                01582000
CVTMSLT  EQU   CVTMAP+60                                                01583000
CVTDATE  EQU   CVTMAP+56                                                01584000
CVTBTERM EQU   CVTMAP+52                                                01585000
CVTSYSAD EQU   CVTMAP+48                                                01586000
CVTXTLER EQU   CVTMAP+44                                                01587000
CVTILK2  EQU   CVTMAP+40                                                01588000
CVTILK1  EQU   CVTMAP+36                                                01589000
CVTPRLTV EQU   CVTMAP+32                                                01590000
CVTPCNVT EQU   CVTMAP+28                                                01591000
CVT0VL00 EQU   CVTMAP+24                                                01592000
CVTXAPG  EQU   CVTMAP+20                                                01593000
CVTBUF   EQU   CVTMAP+16                                                01594000
CVTJOB   EQU   CVTMAP+12                                                01595000
CVTLINK  EQU   CVTMAP+8                                                 01596000
CVT0EF00 EQU   CVTMAP+4                                                 01597000
CVTTCBP  EQU   CVTMAP                                                   01598000
CVT      EQU   CVTMAP                                                   01599000
JSCBCSCB EQU   JSCBSEC1+68                                              01600000
JSCBPMG  EQU   JSCBWTP+2                                                01601000
JSCBWTSP EQU   JSCBWTP+1                                                01602000
JSCRSV23 EQU   JSCBWTFG                                                 01603000
JSCRSV22 EQU   JSCBWTFG                                                 01604000
JSCRSV21 EQU   JSCBWTFG                                                 01605000
JSCRSV20 EQU   JSCBWTFG                                                 01606000
JSCRSV19 EQU   JSCBWTFG                                                 01607000
JSCRSV18 EQU   JSCBWTFG                                                 01608000
JSCBRET  EQU   JSCBWTFG                                                 01609000
JSCBIOFG EQU   JSCBWTFG                                                 01610000
@NM00031 EQU   JSCBSEC1+60                                              01611000
JSCBQMPI EQU   JSCBSEC1+56                                              01612000
JSCBPMSG EQU   JSCBSWT1                                                 01613000
JSCRSV16 EQU   JSCBSWT1                                                 01614000
JSCRSV15 EQU   JSCBSWT1                                                 01615000
JSCRSV14 EQU   JSCBSWT1                                                 01616000
JSCRSV13 EQU   JSCBSWT1                                                 01617000
JSCRSV12 EQU   JSCBSWT1                                                 01618000
JSCRSV11 EQU   JSCBSWT1                                                 01619000
JSCBPASS EQU   JSCBSWT1                                                 01620000
JSCBTTTR EQU   JSCBSEC1+52                                              01621000
JSCRSV10 EQU   JSCBSEC1+49                                              01622000
JSCBAUTH EQU   JSCBOPTS                                                 01623000
JSCSIOTS EQU   JSCBOPTS                                                 01624000
JSCRSV08 EQU   JSCBOPTS                                                 01625000
JSCRSV07 EQU   JSCBOPTS                                                 01626000
JSCRSV06 EQU   JSCBOPTS                                                 01627000
JSCBLONG EQU   JSCBOPTS                                                 01628000
JSCRSV05 EQU   JSCBOPTS                                                 01629000
JSCRSV04 EQU   JSCBOPTS                                                 01630000
JSCBSECB EQU   JSCBSEC1+44                                              01631000
JSCRSV03 EQU   JSCBSEC1+41                                              01632000
JSCBSTEP EQU   JSCBSEC1+40                                              01633000
JSCBDCBA EQU   JSCBDCB+1                                                01634000
JSCRSV02 EQU   JSCBDCB                                                  01635000
JSCBID   EQU   JSCBSEC1+32                                              01636000
JSCBDBTB EQU   JSCBSEC1+28                                              01637000
JSCBIJSC EQU   JSCBSEC1+24                                              01638000
JSCBPCC  EQU   JSCBSEC1+16                                              01639000
JSCBTCP  EQU   JSCBSEC1+12                                              01640000
JSCBSHR  EQU   JSCBSEC1+8                                               01641000
JSCHPCEA EQU   JSCHPCE+1                                                01642000
JSCRSV32 EQU   JSCHPCE                                                  01643000
JSCRSV01 EQU   JSCBSEC1                                                 01644000
@NM00030 EQU   IEZJSCB                                                  01645000
ASCBEND  EQU   ASCB+208                                                 01646000
ASCBSRBT EQU   ASCB+200                                                 01647000
ASCBSWTL EQU   ASCB+196                                                 01648000
ASCBRS14 EQU   ASCB+195                                                 01649000
ASCBSMCT EQU   ASCB+194                                                 01650000
ASCBRS12 EQU   ASCB+192                                                 01651000
ASCBPCTT EQU   ASCB+188                                                 01652000
ASCBVGTT EQU   ASCB+184                                                 01653000
ASCBRV43 EQU   ASCBSRQ4                                                 01654000
ASCBRV42 EQU   ASCBSRQ4                                                 01655000
ASCBRV41 EQU   ASCBSRQ4                                                 01656000
ASCBRV40 EQU   ASCBSRQ4                                                 01657000
ASCBRV39 EQU   ASCBSRQ4                                                 01658000
ASCBRV38 EQU   ASCBSRQ4                                                 01659000
ASCBRV37 EQU   ASCBSRQ4                                                 01660000
ASCBRV36 EQU   ASCBSRQ4                                                 01661000
ASCBRV35 EQU   ASCBSRQ3                                                 01662000
ASCBRV34 EQU   ASCBSRQ3                                                 01663000
ASCBRV33 EQU   ASCBSRQ3                                                 01664000
ASCBRV32 EQU   ASCBSRQ3                                                 01665000
ASCBRV31 EQU   ASCBSRQ3                                                 01666000
ASCBRV30 EQU   ASCBSRQ3                                                 01667000
ASCBRV29 EQU   ASCBSRQ3                                                 01668000
ASCBRV28 EQU   ASCBSRQ3                                                 01669000
ASCBRV27 EQU   ASCBSRQ2                                                 01670000
ASCBRV26 EQU   ASCBSRQ2                                                 01671000
ASCBRV25 EQU   ASCBSRQ2                                                 01672000
ASCBRV24 EQU   ASCBSRQ2                                                 01673000
ASCBRV23 EQU   ASCBSRQ2                                                 01674000
ASCBRV22 EQU   ASCBSRQ2                                                 01675000
ASCBRV21 EQU   ASCBSRQ2                                                 01676000
ASCBRV20 EQU   ASCBSRQ2                                                 01677000
ASCBRV19 EQU   ASCBSRQ1                                                 01678000
ASCBRV18 EQU   ASCBSRQ1                                                 01679000
ASCBRV17 EQU   ASCBSRQ1                                                 01680000
ASCBRV16 EQU   ASCBSRQ1                                                 01681000
ASCBRV15 EQU   ASCBSRQ1                                                 01682000
ASCBRV14 EQU   ASCBSRQ1                                                 01683000
ASCBRV13 EQU   ASCBSRQ1                                                 01684000
ASCBSTA  EQU   ASCBSRQ1                                                 01685000
ASCBJBNS EQU   ASCB+176                                                 01686000
ASCBJBNI EQU   ASCB+172                                                 01687000
ASCBMCC  EQU   ASCB+168                                                 01688000
ASCBRTWA EQU   ASCB+164                                                 01689000
ASCBIQEA EQU   ASCB+160                                                 01690000
ASCBXMPQ EQU   ASCB+156                                                 01691000
ASCBRS01 EQU   ASCB+154                                                 01692000
ASCBFMCT EQU   ASCB+152                                                 01693000
ASCBOUXB EQU   ASCB+148                                                 01694000
ASCBOUCB EQU   ASCB+144                                                 01695000
ASCBMECB EQU   ASCB+140                                                 01696000
ASCBQECB EQU   ASCB+136                                                 01697000
ASCBLSQH EQU   ASCBLKGP+4                                               01698000
ASCBLOCK EQU   ASCBLKGP                                                 01699000
ASCBTCBS EQU   ASCB+124                                                 01700000
ASCBNVSC EQU   ASCB+122                                                 01701000
ASCBVSC  EQU   ASCB+120                                                 01702000
ASCBSRBS EQU   ASCB+118                                                 01703000
ASCBSSRB EQU   ASCB+116                                                 01704000
ASCBRV06 EQU   ASCBFLG2                                                 01705000
ASCBRV05 EQU   ASCBFLG2                                                 01706000
ASCBRV04 EQU   ASCBFLG2                                                 01707000
ASCBSNQS EQU   ASCBFLG2                                                 01708000
ASCBS2S  EQU   ASCBFLG2                                                 01709000
ASCBCEXT EQU   ASCBFLG2                                                 01710000
ASCBPXMT EQU   ASCBFLG2                                                 01711000
ASCBXMPT EQU   ASCBFLG2                                                 01712000
ASCBRF07 EQU   ASCBDSP1                                                 01713000
ASCBRF06 EQU   ASCBDSP1                                                 01714000
ASCBRF05 EQU   ASCBDSP1                                                 01715000
ASCBRF04 EQU   ASCBDSP1                                                 01716000
ASCBRF03 EQU   ASCBDSP1                                                 01717000
ASCBRF02 EQU   ASCBDSP1                                                 01718000
ASCBFAIL EQU   ASCBDSP1                                                 01719000
ASCBNOQ  EQU   ASCBDSP1                                                 01720000
ASCBSWCT EQU   ASCB+112                                                 01721000
ASCBASXB EQU   ASCB+108                                                 01722000
ASCBTMCH EQU   ASCB+104                                                 01723000
ASCBNSWP EQU   ASCBFLG1                                                 01724000
ASCBTYP1 EQU   ASCBFLG1                                                 01725000
ASCBSTND EQU   ASCBFLG1                                                 01726000
ASCBABNT EQU   ASCBFLG1                                                 01727000
ASCBTERM EQU   ASCBFLG1                                                 01728000
ASCBS3S  EQU   ASCBFLG1                                                 01729000
ASCBCMSH EQU   ASCBFLG1                                                 01730000
ASCBTOFF EQU   ASCBFLG1                                                 01731000
ASCBRF01 EQU   ASCBRCTF                                                 01732000
ASCBTMLW EQU   ASCBRCTF                                                 01733000
ASCBOUT  EQU   ASCBRCTF                                                 01734000
ASCBWAIT EQU   ASCBRCTF                                                 01735000
ASCBRV08 EQU   ASCBRCTF                                                 01736000
ASCBFQU  EQU   ASCBRCTF                                                 01737000
ASCBFRS  EQU   ASCBRCTF                                                 01738000
ASCBTMNO EQU   ASCBRCTF                                                 01739000
ASCBAFFN EQU   ASCBFW1                                                  01740000
ASCBDUMP EQU   ASCB+96                                                  01741000
ASCBRV44 EQU   ASCB+92                                                  01742000
ASCBUBET EQU   ASCB+88                                                  01743000
ASCBECB  EQU   ASCB+84                                                  01744000
ASCBJSTL EQU   ASCB+80                                                  01745000
ASCBEWST EQU   ASCB+72                                                  01746000
ASCBEJST EQU   ASCB+64                                                  01747000
ASCBTSB  EQU   ASCB+60                                                  01748000
ASCBCSCB EQU   ASCB+56                                                  01749000
ASCBRSM  EQU   ASCB+52                                                  01750000
ASCBLDA  EQU   ASCB+48                                                  01751000
ASCBSTOR EQU   ASCB+44                                                  01752000
ASCBDP   EQU   ASCB+43                                                  01753000
ASCBRV07 EQU   ASCB+42                                                  01754000
ASCBIOSM EQU   ASCB+40                                                  01755000
ASCBSEQN EQU   ASCB+38                                                  01756000
ASCBCPUS EQU   ASCB+32                                                  01757000
ASCBSPL  EQU   ASCB+28                                                  01758000
ASCBIOSP EQU   ASCB+24                                                  01759000
ASCBSYNC EQU   ASCBSUPC+4                                               01760000
ASCBSVRB EQU   ASCBSUPC                                                 01761000
ASCBCMSF EQU   ASCB+12                                                  01762000
ASCBBWDP EQU   ASCB+8                                                   01763000
ASCBFWDP EQU   ASCB+4                                                   01764000
ASCBASCB EQU   ASCB                                                     01765000
ASCBEGIN EQU   ASCB                                                     01766000
@NM00005 EQU   TCBXTNT2+32                                              01767000
TCBRV181 EQU   TCBRV173                                                 01768000
TCBRV180 EQU   TCBRV173                                                 01769000
TCBRV179 EQU   TCBRV173                                                 01770000
TCBRV178 EQU   TCBRV173                                                 01771000
TCBRV177 EQU   TCBRV173                                                 01772000
TCBRV176 EQU   TCBRV173                                                 01773000
TCBRV175 EQU   TCBRV173                                                 01774000
TCBRV174 EQU   TCBRV173                                                 01775000
TCBRV172 EQU   TCBRV164                                                 01776000
TCBRV171 EQU   TCBRV164                                                 01777000
TCBRV170 EQU   TCBRV164                                                 01778000
TCBRV169 EQU   TCBRV164                                                 01779000
TCBRV168 EQU   TCBRV164                                                 01780000
TCBRV167 EQU   TCBRV164                                                 01781000
TCBRV166 EQU   TCBRV164                                                 01782000
TCBRV165 EQU   TCBRV164                                                 01783000
TCBRV163 EQU   TCBRV155                                                 01784000
TCBRV162 EQU   TCBRV155                                                 01785000
TCBRV161 EQU   TCBRV155                                                 01786000
TCBRV160 EQU   TCBRV155                                                 01787000
TCBRV159 EQU   TCBRV155                                                 01788000
TCBRV158 EQU   TCBRV155                                                 01789000
TCBRV157 EQU   TCBRV155                                                 01790000
TCBRV156 EQU   TCBRV155                                                 01791000
TCBRV154 EQU   TCBRV146                                                 01792000
TCBRV153 EQU   TCBRV146                                                 01793000
TCBRV152 EQU   TCBRV146                                                 01794000
TCBRV151 EQU   TCBRV146                                                 01795000
TCBRV150 EQU   TCBRV146                                                 01796000
TCBRV149 EQU   TCBRV146                                                 01797000
TCBRV148 EQU   TCBRV146                                                 01798000
TCBRV147 EQU   TCBRV146                                                 01799000
TCBRV145 EQU   TCBXTNT2+26                                              01800000
TCBRV144 EQU   TCBXTNT2+24                                              01801000
TCBRV143 EQU   TCBXTNT2+20                                              01802000
TCBRV142 EQU   TCBXTNT2+16                                              01803000
TCBRSV49 EQU   TCBXTNT2+12                                              01804000
TCBEVENT EQU   TCBXTNT2+8                                               01805000
TCBRCMP  EQU   TCBXTNT2+5                                               01806000
TCBRSVAB EQU   TCBXTNT2+4                                               01807000
TCBGTFA  EQU   TCBGTF+1                                                 01808000
TCBRSV47 EQU   TCBTFLG                                                  01809000
TCBRSV46 EQU   TCBTFLG                                                  01810000
TCBRSV45 EQU   TCBTFLG                                                  01811000
TCBRSV44 EQU   TCBTFLG                                                  01812000
TCBRSV43 EQU   TCBTFLG                                                  01813000
TCBDSPIT EQU   TCBTFLG                                                  01814000
TCBERRTN EQU   TCBTFLG                                                  01815000
TCBASYNC EQU   TCBTFLG                                                  01816000
@NM00004 EQU   TCB+296                                                  01817000
TCBSVCA2 EQU   TCB+292                                                  01818000
TCBSWASA EQU   TCB+288                                                  01819000
TCBDBTB  EQU   TCB+284                                                  01820000
TCBRPT   EQU   TCB+280                                                  01821000
TCBRV141 EQU   TCBRV133                                                 01822000
TCBRV140 EQU   TCBRV133                                                 01823000
TCBRV139 EQU   TCBRV133                                                 01824000
TCBRV138 EQU   TCBRV133                                                 01825000
TCBRV137 EQU   TCBRV133                                                 01826000
TCBRV136 EQU   TCBRV133                                                 01827000
TCBRV135 EQU   TCBRV133                                                 01828000
TCBRV134 EQU   TCBRV133                                                 01829000
TCBRV132 EQU   TCBRV124                                                 01830000
TCBRV131 EQU   TCBRV124                                                 01831000
TCBRV130 EQU   TCBRV124                                                 01832000
TCBRV129 EQU   TCBRV124                                                 01833000
TCBRV128 EQU   TCBRV124                                                 01834000
TCBRV127 EQU   TCBRV124                                                 01835000
TCBRV126 EQU   TCBRV124                                                 01836000
TCBRV125 EQU   TCBRV124                                                 01837000
TCBRV123 EQU   TCBFBYT2                                                 01838000
TCBRV122 EQU   TCBFBYT2                                                 01839000
TCBECBNV EQU   TCBFBYT2                                                 01840000
TCBSSSYN EQU   TCBFBYT2                                                 01841000
TCBFPRAP EQU   TCBFBYT2                                                 01842000
TCBFDW   EQU   TCBFBYT2                                                 01843000
TCBFMW   EQU   TCBFBYT2                                                 01844000
TCBCNCB  EQU   TCBFBYT2                                                 01845000
TCBLLH   EQU   TCBFBYT1                                                 01846000
TCBRV113 EQU   TCBFBYT1                                                 01847000
TCBEOT   EQU   TCBFBYT1                                                 01848000
TCBRTM2  EQU   TCBFBYT1                                                 01849000
TCBPGNLY EQU   TCBFBYT1                                                 01850000
TCBNDIOS EQU   TCBFBYT1                                                 01851000
TCBRV327 EQU   TCBFBYT1                                                 01852000
TCBEOTFM EQU   TCBFBYT1                                                 01853000
TCBAFFN  EQU   TCB+274                                                  01854000
TCBRV326 EQU   TCB+272                                                  01855000
TCBUKYSP EQU   TCB+268                                                  01856000
TCBMODE  EQU   TCBESTAE+3                                               01857000
TCBERTYP EQU   TCBESTAE+2                                               01858000
TCBRV314 EQU   TCBESTRM                                                 01859000
TCBRV313 EQU   TCBESTRM                                                 01860000
TCBRV312 EQU   TCBESTRM                                                 01861000
TCBRV311 EQU   TCBESTRM                                                 01862000
TCBRV310 EQU   TCBESTRM                                                 01863000
TCBRV309 EQU   TCBESTRM                                                 01864000
TCBRV308 EQU   TCBESTRM                                                 01865000
TCBETERM EQU   TCBESTRM                                                 01866000
TCBSCBKY EQU   TCBESTAE                                                 01867000
TCBRTM12 EQU   TCB+260                                                  01868000
TCBTCBID EQU   TCB+256                                                  01869000
TCBSTAWA EQU   TCB+252                                                  01870000
TCBSWA   EQU   TCB+248                                                  01871000
TCBFOEA  EQU   TCBFOE+1                                                 01872000
TCBRSV42 EQU   TCBFOE                                                   01873000
TCBCCPVI EQU   TCBXSCT+2                                                01874000
TCBRV325 EQU   TCBXSCT+1                                                01875000
TCBRV324 EQU   TCBXSCT1                                                 01876000
TCBRV323 EQU   TCBXSCT1                                                 01877000
TCBRV322 EQU   TCBXSCT1                                                 01878000
TCBRV321 EQU   TCBXSCT1                                                 01879000
TCBRV320 EQU   TCBXSCT1                                                 01880000
TCBRV319 EQU   TCBXSCT1                                                 01881000
TCBS3A   EQU   TCBXSCT1                                                 01882000
TCBACTIV EQU   TCBXSCT1                                                 01883000
TCBRSV41 EQU   TCB+239                                                  01884000
TCBTID   EQU   TCB+238                                                  01885000
TCBRSVAA EQU   TCB+237                                                  01886000
TCBABCUR EQU   TCB+236                                                  01887000
TCBTMSAV EQU   TCB+232                                                  01888000
TCBIOTIM EQU   TCB+228                                                  01889000
TCBRTWA  EQU   TCB+224                                                  01890000
TCBBACK  EQU   TCB+220                                                  01891000
TCBTIRB  EQU   TCB+216                                                  01892000
TCBAECB  EQU   TCB+212                                                  01893000
TCBEXT2A EQU   TCBEXT2+1                                                01894000
TCBRSV39 EQU   TCBEXT2                                                  01895000
TCBSTMCT EQU   TCB+207                                                  01896000
TCBSYSCT EQU   TCB+206                                                  01897000
TCBRSV37 EQU   TCB+205                                                  01898000
TCBEXSVC EQU   TCBDAR                                                   01899000
TCBDARMS EQU   TCBDAR                                                   01900000
TCBDARWT EQU   TCBDAR                                                   01901000
TCBDARO  EQU   TCBDAR                                                   01902000
TCBDARMC EQU   TCBDARC                                                  01903000
TCBDARD  EQU   TCBDAR                                                   01904000
TCBDARS  EQU   TCBDAR                                                   01905000
TCBDARP  EQU   TCBDAR                                                   01906000
TCBGTOFM EQU   TCBFLGS7                                                 01907000
TCBADMP  EQU   TCBFLGS7                                                 01908000
TCBRSTSK EQU   TCBFLGS7                                                 01909000
TCBSVCS  EQU   TCBFLGS7                                                 01910000
TCBSTACK EQU   TCBFLGS7                                                 01911000
TCBRSV34 EQU   TCBFLGS7                                                 01912000
TCBRSV33 EQU   TCBFLGS7                                                 01913000
TCBGPECB EQU   TCBFLGS7                                                 01914000
TCBNTJS  EQU   TCBFLGS6                                                 01915000
TCBAPG   EQU   TCBFLGS6                                                 01916000
TCBMIGR  EQU   TCBFLGS6                                                 01917000
TCBRV303 EQU   TCBFLGS6                                                 01918000
TCBSPVLK EQU   TCBFLGS6                                                 01919000
TCBCPU   EQU   TCBFLGS6                                                 01920000
TCBPIE17 EQU   TCBFLGS6                                                 01921000
TCBRV    EQU   TCBFLGS6                                                 01922000
TCBRSV79 EQU   TCBNDSP5                                                 01923000
TCBRSV78 EQU   TCBNDSP5                                                 01924000
TCBRSV77 EQU   TCBNDSP5                                                 01925000
TCBRSV76 EQU   TCBNDSP5                                                 01926000
TCBRSV75 EQU   TCBNDSP5                                                 01927000
TCBRSV74 EQU   TCBNDSP5                                                 01928000
TCBRSV95 EQU   TCBNDSP5                                                 01929000
TCBRSV94 EQU   TCBNDSP5                                                 01930000
TCBRSV93 EQU   TCBNDSP4                                                 01931000
TCBRSV92 EQU   TCBNDSP4                                                 01932000
TCBRSV91 EQU   TCBNDSP4                                                 01933000
TCBRSV90 EQU   TCBNDSP4                                                 01934000
TCBRSV89 EQU   TCBNDSP4                                                 01935000
TCBRSV88 EQU   TCBNDSP4                                                 01936000
TCBRSV87 EQU   TCBNDSP4                                                 01937000
TCBRSV86 EQU   TCBNDSP4                                                 01938000
TCBEXT1A EQU   TCBEXT1+1                                                01939000
TCBRSV32 EQU   TCBEXT1                                                  01940000
TCBEXCPD EQU   TCB+192                                                  01941000
TCBIOBRC EQU   TCB+188                                                  01942000
TCBDDWTC EQU   TCB+186                                                  01943000
TCBDDEXC EQU   TCB+184                                                  01944000
TCBJSCBB EQU   TCBJSCB+1                                                01945000
@NM00003 EQU   TCBRECDE                                                 01946000
TCBREC   EQU   TCBRECDE                                                 01947000
TCBMDIDS EQU   TCB+176                                                  01948000
TCBNDINT EQU   TCBNDSP3                                                 01949000
TCBRSV27 EQU   TCBNDSP3                                                 01950000
TCBRSV26 EQU   TCBNDSP3                                                 01951000
TCBRSV25 EQU   TCBNDSP3                                                 01952000
TCBRSV24 EQU   TCBNDSP3                                                 01953000
TCBSRBND EQU   TCBNDSP3                                                 01954000
TCBRV302 EQU   TCBNDSP3                                                 01955000
TCBLJSND EQU   TCBNDSP3                                                 01956000
TCBABE   EQU   TCBNDSP2                                                 01957000
TCBDSS   EQU   TCBNDSP2                                                 01958000
TCBOWAIT EQU   TCBNDSP2                                                 01959000
TCBIWAIT EQU   TCBNDSP2                                                 01960000
TCBNDTS  EQU   TCBNDSP2                                                 01961000
TCBNDSVC EQU   TCBNDSP2                                                 01962000
TCBSTPP  EQU   TCBNDSP2                                                 01963000
TCBABD   EQU   TCBNDSP2                                                 01964000
TCBRSV22 EQU   TCBNDSP1                                                 01965000
TCBPIEND EQU   TCBNDSP1                                                 01966000
TCBTPSP  EQU   TCBNDSP1                                                 01967000
TCBDDRND EQU   TCBNDSP1                                                 01968000
TCBRSPND EQU   TCBNDSP1                                                 01969000
TCBRSTND EQU   TCBNDSP1                                                 01970000
TCBDARPN EQU   TCBNDSP1                                                 01971000
TCBDARTN EQU   TCBNDSP1                                                 01972000
TCBNDSP0 EQU   TCBNDSP                                                  01973000
TCBUSER  EQU   TCB+168                                                  01974000
TCBTCTB  EQU   TCBTCT+1                                                 01975000
TCBRSV9C EQU   TCBTCTGF                                                 01976000
TCBRSV9B EQU   TCBTCTGF                                                 01977000
TCBRSV9A EQU   TCBTCTGF                                                 01978000
TCBRSV99 EQU   TCBTCTGF                                                 01979000
TCBRSV98 EQU   TCBTCTGF                                                 01980000
TCBRSV97 EQU   TCBTCTGF                                                 01981000
TCBRSV20 EQU   TCBTCTGF                                                 01982000
TCBSMFGF EQU   TCBTCTGF                                                 01983000
TCBSTABB EQU   TCBSTAB+1                                                01984000
TCBSTCUR EQU   TCBNSTAE                                                 01985000
TCBRV301 EQU   TCBNSTAE                                                 01986000
TCBSYNCH EQU   TCBNSTAE                                                 01987000
TCBHALT  EQU   TCBNSTAE                                                 01988000
TCBPPSUP EQU   TCBNSTAE                                                 01989000
TCB33E   EQU   TCBNSTAE                                                 01990000
TCBQUIES EQU   TCBNSTAE                                                 01991000
TCBSTABE EQU   TCBNSTAE                                                 01992000
TCBAQE   EQU   TCB+156                                                  01993000
TCBPQE   EQU   TCB+152                                                  01994000
TCBTSDP  EQU   TCB+151                                                  01995000
TCBTSLP  EQU   TCB+150                                                  01996000
TCBSTPCT EQU   TCB+149                                                  01997000
TCBCPUBN EQU   TCBTSFLG                                                 01998000
TCBDYDSP EQU   TCBTSFLG                                                 01999000
TCBRSV18 EQU   TCBTSFLG                                                 02000000
TCBRSV17 EQU   TCBTSFLG                                                 02001000
TCBTIOTG EQU   TCBTSFLG                                                 02002000
TCBATT   EQU   TCBTSFLG                                                 02003000
TCBSTPPR EQU   TCBTSFLG                                                 02004000
TCBRV300 EQU   TCBTSTSK                                                 02005000
TCBECB   EQU   TCB+144                                                  02006000
TCBIQE   EQU   TCB+140                                                  02007000
TCBLTC   EQU   TCB+136                                                  02008000
TCBOTC   EQU   TCB+132                                                  02009000
TCBNTC   EQU   TCB+128                                                  02010000
TCBJSTCA EQU   TCBJSTCB+1                                               02011000
TCBRSV16 EQU   TCBJSTCB                                                 02012000
TCBTQET  EQU   TCBTME                                                   02013000
TCBTCB   EQU   TCB+116                                                  02014000
TCBFSAB  EQU   TCBFSA+1                                                 02015000
TCBQEL   EQU   TCBFSA                                                   02016000
TCBGRS15 EQU   TCBGRS+60                                                02017000
TCBGRS14 EQU   TCBGRS+56                                                02018000
TCBGRS13 EQU   TCBGRS+52                                                02019000
TCBGRS12 EQU   TCBGRS+48                                                02020000
TCBGRS11 EQU   TCBGRS+44                                                02021000
TCBGRS10 EQU   TCBGRS+40                                                02022000
TCBGRS9  EQU   TCBGRS+36                                                02023000
TCBGRS8  EQU   TCBGRS+32                                                02024000
TCBGRS7  EQU   TCBGRS+28                                                02025000
TCBGRS6  EQU   TCBGRS+24                                                02026000
TCBGRS5  EQU   TCBGRS+20                                                02027000
TCBGRS4  EQU   TCBGRS+16                                                02028000
TCBGRS3  EQU   TCBGRS+12                                                02029000
TCBGRS2  EQU   TCBGRS+8                                                 02030000
TCBGRS1  EQU   TCBGRS+4                                                 02031000
TCBGRS0  EQU   TCBGRS                                                   02032000
TCBJPQB  EQU   TCBJPQ+1                                                 02033000
TCBRSV15 EQU   TCBPURGE                                                 02034000
TCBRSV14 EQU   TCBPURGE                                                 02035000
TCBRSV13 EQU   TCBPURGE                                                 02036000
TCBRSV12 EQU   TCBPURGE                                                 02037000
TCBRSV11 EQU   TCBPURGE                                                 02038000
TCBRSV10 EQU   TCBPURGE                                                 02039000
TCBRSV09 EQU   TCBPURGE                                                 02040000
TCBJPQF  EQU   TCBPURGE                                                 02041000
TCBJLB   EQU   TCB+40                                                   02042000
TCBLLS   EQU   TCB+36                                                   02043000
TCBDSP   EQU   TCB+35                                                   02044000
TCBLMP   EQU   TCB+34                                                   02045000
TCBPNDSP EQU   TCBFLGS5                                                 02046000
TCBFCD1  EQU   TCBFLGS5                                                 02047000
TCBSTP   EQU   TCBFLGS5                                                 02048000
TCBSYS   EQU   TCBFLGS5                                                 02049000
TCBANDSP EQU   TCBFLGS5                                                 02050000
TCBPAGE  EQU   TCBFLGS5                                                 02051000
TCBUXNDF EQU   TCBABWF                                                  02052000
TCBFC    EQU   TCBFLGS5                                                 02053000
TCBONDSP EQU   TCBFLGS4                                                 02054000
TCBMPCND EQU   TCBFLGS4                                                 02055000
TCBMPCVQ EQU   TCBFLGS4                                                 02056000
TCBUXNDV EQU   TCBFLGS4                                                 02057000
TCBHNDSP EQU   TCBFLGS4                                                 02058000
TCBRQENA EQU   TCBFLGS4                                                 02059000
TCBSER   EQU   TCBFLGS4                                                 02060000
TCBNDUMP EQU   TCBFLGS4                                                 02061000
TCBDWSTA EQU   TCBFLGS3                                                 02062000
TCBRSV08 EQU   TCBFLGS3                                                 02063000
TCBRSV07 EQU   TCBFLGS3                                                 02064000
TCBRSV06 EQU   TCBFLGS3                                                 02065000
TCBABGM  EQU   TCBFLGS3                                                 02066000
TCBABTRM EQU   TCBFLGS3                                                 02067000
TCBADINP EQU   TCBFLGS3                                                 02068000
TCBFSM   EQU   TCBFLGS3                                                 02069000
TCBFTS   EQU   TCBFLGS2                                                 02070000
TCBFETXR EQU   TCBFLGS2                                                 02071000
TCBFDSOP EQU   TCBFLGS2                                                 02072000
TCBFJMC  EQU   TCBFLGS2                                                 02073000
TCBFSMC  EQU   TCBFLGS2                                                 02074000
TCBFABOP EQU   TCBFLGS2                                                 02075000
TCBFSTI  EQU   TCBFLGS2                                                 02076000
TCBFOINP EQU   TCBFLGS2                                                 02077000
TCBFX    EQU   TCBFLGS1                                                 02078000
TCBFS    EQU   TCBFLGS1                                                 02079000
TCBFT    EQU   TCBFLGS1                                                 02080000
TCBPDUMP EQU   TCBFLGS1                                                 02081000
TCBNONPR EQU   TCBFLGS1                                                 02082000
TCBFERA  EQU   TCBFLGS1                                                 02083000
TCBFE    EQU   TCBFLGS1                                                 02084000
TCBFA    EQU   TCBFLGS1                                                 02085000
TCBZERO  EQU   TCBPKF                                                   02086000
TCBFLAG  EQU   TCBPKF                                                   02087000
TCBMSSB  EQU   TCBMSS+1                                                 02088000
TCBRSV03 EQU   TCBMSS                                                   02089000
TCBTRNB  EQU   TCBTRN+1                                                 02090000
TCBRSV02 EQU   TCBABF                                                   02091000
TCBOLTEP EQU   TCBABF                                                   02092000
TCBTCP   EQU   TCBABF                                                   02093000
TCBTCPP  EQU   TCBABF                                                   02094000
TCBRSV01 EQU   TCBABF                                                   02095000
TCBGRPH  EQU   TCBABF                                                   02096000
TCBNOCHK EQU   TCBABF                                                   02097000
TCBMOD91 EQU   TCBABF                                                   02098000
TCBCMPC  EQU   TCBCMP+1                                                 02099000
TCBRV318 EQU   TCBCMSG                                                  02100000
TCBRV317 EQU   TCBCIND                                                  02101000
TCBRV316 EQU   TCBCWTO                                                  02102000
TCBCASID EQU   TCBCDBL                                                  02103000
TCBNOCC  EQU   TCBSTCC                                                  02104000
TCBDMPO  EQU   TCBCPP                                                   02105000
TCBCSTEP EQU   TCBCMPF                                                  02106000
TCBCREQ  EQU   TCBCMPF                                                  02107000
TCBTIO   EQU   TCB+12                                                   02108000
TCBDEB   EQU   TCB+8                                                    02109000
TCBPIEA  EQU   TCBPIE+1                                                 02110000
TCBPM    EQU   TCBPMASK                                                 02111000
@NM00002 EQU   TCBPMASK                                                 02112000
TCBRBP   EQU   TCB                                                      02113000
TCBFRS6  EQU   TCBFRS+24                                                02114000
TCBFRS4  EQU   TCBFRS+16                                                02115000
TCBFRS2  EQU   TCBFRS+8                                                 02116000
TCBFRS0  EQU   TCBFRS                                                   02117000
BLKLEN   EQU   @NM00001+1                                               02118000
BLKID    EQU   @NM00001                                                 02119000
@NM00029 EQU   PSA+3668                                                 02120000
PSASTAK  EQU   PSA+3072                                                 02121000
@NM00028 EQU   PSA+1048                                                 02122000
PSAUSEND EQU   PSA+1048                                                 02123000
PSARV062 EQU   PSA+1044                                                 02124000
PSACDAL  EQU   PSA+1040                                                 02125000
PSAWTCOD EQU   PSA+1036                                                 02126000
PSAATCVT EQU   PSA+1032                                                 02127000
PSAPCPSW EQU   PSA+1024                                                 02128000
PSAPIR2  EQU   PSA+1020                                                 02129000
PSARV059 EQU   PSA+1018                                                 02130000
PSASVC13 EQU   PSA+1016                                                 02131000
PSALSFCC EQU   PSA+1012                                                 02132000
PSASFACC EQU   PSA+1008                                                 02133000
PSASTOP  EQU   PSA+992                                                  02134000
PSASTART EQU   PSA+976                                                  02135000
PSARSPSW EQU   PSA+968                                                  02136000
PSASRPSW EQU   PSA+960                                                  02137000
PSARV045 EQU   PSA+892                                                  02138000
PSARV044 EQU   PSA+888                                                  02139000
PSARV043 EQU   PSA+884                                                  02140000
PSARV042 EQU   PSA+880                                                  02141000
PSARV041 EQU   PSA+876                                                  02142000
PSARV040 EQU   PSA+872                                                  02143000
PSARV025 EQU   PSA+868                                                  02144000
PSADSSED EQU   PSA+868                                                  02145000
PSADSSPR EQU   PSA+864                                                  02146000
PSADSSFW EQU   PSA+860                                                  02147000
PSADSS14 EQU   PSA+856                                                  02148000
PSADSSPP EQU   PSA+848                                                  02149000
PSADSSRP EQU   PSA+840                                                  02150000
PSADSS05 EQU   PSADSSF4                                                 02151000
PSADSS10 EQU   PSADSSF4                                                 02152000
PSADSSVE EQU   PSADSSF4                                                 02153000
PSADSSDE EQU   PSADSSF4                                                 02154000
PSADSSC0 EQU   PSADSSF4                                                 02155000
PSADSSIE EQU   PSADSSF4                                                 02156000
PSADSS12 EQU   PSADSSF4                                                 02157000
PSADSSRC EQU   PSADSSF4                                                 02158000
PSARV057 EQU   PSADSSF3                                                 02159000
PSARV056 EQU   PSADSSF3                                                 02160000
PSARV055 EQU   PSADSSF3                                                 02161000
PSADSSMC EQU   PSADSSF3                                                 02162000
PSADSSRW EQU   PSADSSF3                                                 02163000
PSADSSNM EQU   PSADSSF3                                                 02164000
PSADSSES EQU   PSADSSF3                                                 02165000
PSADSSGP EQU   PSADSSF3                                                 02166000
PSADSSF2 EQU   PSADSSFL+1                                               02167000
PSADSSPI EQU   PSADSSF1                                                 02168000
PSADSSOI EQU   PSADSSF1                                                 02169000
PSADSSSP EQU   PSADSSF1                                                 02170000
PSADSSTP EQU   PSADSSF1                                                 02171000
PSADSSDW EQU   PSADSSF1                                                 02172000
PSADSSDD EQU   PSADSSF1                                                 02173000
PSADSSDM EQU   PSADSSF1                                                 02174000
PSADSSMV EQU   PSADSSF1                                                 02175000
PSADSSTS EQU   PSA+816                                                  02176000
PSADSSWK EQU   PSA+812                                                  02177000
PSADSSR3 EQU   PSA+808                                                  02178000
PSADSSR2 EQU   PSA+804                                                  02179000
PSADSSRS EQU   PSA+800                                                  02180000
PSASTOR  EQU   PSA+796                                                  02181000
PSACPUSA EQU   PSA+794                                                  02182000
PSAVSTAP EQU   PSA+792                                                  02183000
PSAWKVAP EQU   PSA+788                                                  02184000
PSAWKRAP EQU   PSA+784                                                  02185000
PSAMCHIC EQU   PSA+783                                                  02186000
PSARV061 EQU   PSA+782                                                  02187000
PSASYMSK EQU   PSA+781                                                  02188000
PSAMCHFL EQU   PSA+780                                                  02189000
PSACR0   EQU   PSA+776                                                  02190000
PSAPSWSV EQU   PSA+768                                                  02191000
PSACLHS  EQU   PSAHLHI                                                  02192000
PSALKR15 EQU   PSALKSA+60                                               02193000
PSALKR14 EQU   PSALKSA+56                                               02194000
PSALKR13 EQU   PSALKSA+52                                               02195000
PSALKR12 EQU   PSALKSA+48                                               02196000
PSALKR11 EQU   PSALKSA+44                                               02197000
PSALKR10 EQU   PSALKSA+40                                               02198000
PSALKR9  EQU   PSALKSA+36                                               02199000
PSALKR8  EQU   PSALKSA+32                                               02200000
PSALKR7  EQU   PSALKSA+28                                               02201000
PSALKR6  EQU   PSALKSA+24                                               02202000
PSALKR5  EQU   PSALKSA+20                                               02203000
PSALKR4  EQU   PSALKSA+16                                               02204000
PSALKR3  EQU   PSALKSA+12                                               02205000
PSALKR2  EQU   PSALKSA+8                                                02206000
PSALKR1  EQU   PSALKSA+4                                                02207000
PSALKR0  EQU   PSALKSA                                                  02208000
PSARV023 EQU   PSACLHT+52                                               02209000
PSALOCAL EQU   PSACLHT+48                                               02210000
PSACMSL  EQU   PSACLHT+44                                               02211000
PSAOPTL  EQU   PSACLHT+40                                               02212000
PSATPACL EQU   PSACLHT+36                                               02213000
PSATPDNL EQU   PSACLHT+32                                               02214000
PSATPNCL EQU   PSACLHT+28                                               02215000
PSAIOSLL EQU   PSACLHT+24                                               02216000
PSAIOSUL EQU   PSACLHT+20                                               02217000
PSAIOSCL EQU   PSACLHT+16                                               02218000
PSAIOSSL EQU   PSACLHT+12                                               02219000
PSASALCL EQU   PSACLHT+8                                                02220000
PSAASML  EQU   PSACLHT+4                                                02221000
PSADISPL EQU   PSACLHT                                                  02222000
PSASRSA  EQU   PSA+636                                                  02223000
PSARV050 EQU   PSA+634                                                  02224000
PSADSSGO EQU   PSA+633                                                  02225000
PSARECUR EQU   PSA+632                                                  02226000
PSAHLHIS EQU   PSA+628                                                  02227000
PSAIPCSA EQU   PSA+624                                                  02228000
@NM00027 EQU   PSA+621                                                  02229000
PSAIPCDM EQU   PSA+620                                                  02230000
PSAIPCD  EQU   PSA+616                                                  02231000
@NM00026 EQU   PSA+613                                                  02232000
PSAIPCRM EQU   PSA+612                                                  02233000
PSAIPCR  EQU   PSA+608                                                  02234000
PSAMCHEX EQU   PSA+600                                                  02235000
PSAMPSW  EQU   PSA+592                                                  02236000
PSAEXPS2 EQU   PSA+584                                                  02237000
PSAEXPS1 EQU   PSA+576                                                  02238000
PSAPIREG EQU   PSA+572                                                  02239000
PSARSREG EQU   PSA+568                                                  02240000
PSAGPREG EQU   PSA+556                                                  02241000
PSARV022 EQU   PSASUP4                                                  02242000
PSARV021 EQU   PSASUP4                                                  02243000
PSARV020 EQU   PSASUP4                                                  02244000
PSARV019 EQU   PSASUP4                                                  02245000
PSARV018 EQU   PSASUP4                                                  02246000
PSARV017 EQU   PSASUP4                                                  02247000
PSARV016 EQU   PSASUP4                                                  02248000
PSARV015 EQU   PSASUP4                                                  02249000
PSARV014 EQU   PSASUP3                                                  02250000
PSARV013 EQU   PSASUP3                                                  02251000
PSARV012 EQU   PSASUP3                                                  02252000
PSAESTA  EQU   PSASUP3                                                  02253000
PSASPR   EQU   PSASUP3                                                  02254000
PSAPSREG EQU   PSASUP3                                                  02255000
PSAPI2   EQU   PSASUP3                                                  02256000
PSAIOSUP EQU   PSASUP3                                                  02257000
PSALCR   EQU   PSASUP2                                                  02258000
PSARTM   EQU   PSASUP2                                                  02259000
PSAACR   EQU   PSASUP2                                                  02260000
PSAIPCE2 EQU   PSASUP2                                                  02261000
PSAIPCES EQU   PSASUP2                                                  02262000
PSAIPCEC EQU   PSASUP2                                                  02263000
PSAGTF   EQU   PSASUP2                                                  02264000
PSAIPCRI EQU   PSASUP2                                                  02265000
PSATYPE6 EQU   PSASUP1                                                  02266000
PSATCTL  EQU   PSASUP1                                                  02267000
PSADISP  EQU   PSASUP1                                                  02268000
PSALOCK  EQU   PSASUP1                                                  02269000
PSAPI    EQU   PSASUP1                                                  02270000
PSAEXT   EQU   PSASUP1                                                  02271000
PSASVC   EQU   PSASUP1                                                  02272000
PSAIO    EQU   PSASUP1                                                  02273000
PSAANEW  EQU   PSA+544                                                  02274000
PSATNEW  EQU   PSA+536                                                  02275000
PSALCCAR EQU   PSA+532                                                  02276000
PSALCCAV EQU   PSA+528                                                  02277000
PSAPCCAR EQU   PSA+524                                                  02278000
PSAPCCAV EQU   PSA+520                                                  02279000
PSACPULA EQU   PSA+518                                                  02280000
PSACPUPA EQU   PSA+516                                                  02281000
PSAPSA   EQU   PSA+512                                                  02282000
FLCHDEND EQU   PSA+512                                                  02283000
FLCCRSAV EQU   FLCMCLA+280                                              02284000
FLCGRSAV EQU   FLCMCLA+216                                              02285000
FLCFPSAV EQU   FLCMCLA+184                                              02286000
FLCFLA   EQU   FLCMCLA+88                                               02287000
FLCRGNCD EQU   FLCMCLA+84                                               02288000
FLCFSAA  EQU   FLCFSA+1                                                 02289000
@NM00025 EQU   FLCFSA                                                   02290000
@NM00024 EQU   FLCMCLA+72                                               02291000
FLCMCIC  EQU   FLCMCLA+64                                               02292000
@NM00023 EQU   FLCMCLA+20                                               02293000
FLCIOAA  EQU   FLCIOA+1                                                 02294000
@NM00022 EQU   FLCIOA                                                   02295000
@NM00021 EQU   FLCMCLA+15                                               02296000
@NM00020 EQU   FLCMCLA+14                                               02297000
@NM00019 EQU   FLCMCLA+12                                               02298000
FLCLCL   EQU   FLCMCLA+8                                                02299000
FLCIOELA EQU   FLCIOEL+1                                                02300000
@NM00018 EQU   FLCIOEL                                                  02301000
FLCCHNID EQU   FLCMCLA                                                  02302000
@NM00017 EQU   PSA+160                                                  02303000
FLCMTRCD EQU   PSA+157                                                  02304000
@NM00016 EQU   PSA+156                                                  02305000
FLCPERA  EQU   FLCPER+1                                                 02306000
@NM00015 EQU   FLCPER                                                   02307000
@NM00014 EQU   PSA+151                                                  02308000
FLCPERCD EQU   PSA+150                                                  02309000
FLCMCNUM EQU   PSA+149                                                  02310000
@NM00013 EQU   PSA+148                                                  02311000
FLCTEAA  EQU   FLCTEA+1                                                 02312000
@NM00012 EQU   FLCTEA                                                   02313000
PSAPIPC  EQU   PSAPICOD                                                 02314000
PSAPIMC  EQU   PSAPICOD                                                 02315000
PSAPIPER EQU   PSAPICOD                                                 02316000
PSARV049 EQU   FLCPICOD                                                 02317000
FLCPILCB EQU   FLCPIILC                                                 02318000
@NM00011 EQU   FLCPIILC                                                 02319000
@NM00010 EQU   PSAEPPSW                                                 02320000
FLCSVCN  EQU   PSAESPSW+2                                               02321000
FLCSILCB EQU   FLCSVILC                                                 02322000
@NM00009 EQU   FLCSVILC                                                 02323000
@NM00008 EQU   PSAESPSW                                                 02324000
FLCEICOD EQU   PSAEEPSW+2                                               02325000
PSASPAD  EQU   PSAEEPSW                                                 02326000
@NM00007 EQU   PSA+128                                                  02327000
FLCINPSW EQU   PSA+120                                                  02328000
FLCMNPSW EQU   PSA+112                                                  02329000
FLCPNPSW EQU   PSA+104                                                  02330000
FLCSNPSW EQU   PSA+96                                                   02331000
FLCENPSW EQU   PSA+88                                                   02332000
FLCTRACE EQU   PSA+84                                                   02333000
FLCTIMER EQU   PSA+80                                                   02334000
FLCCVT2  EQU   PSA+76                                                   02335000
FLCCAW   EQU   PSA+72                                                   02336000
FLCCSW   EQU   PSA+64                                                   02337000
FLCIOPSW EQU   PSA+56                                                   02338000
FLCMOPSW EQU   PSA+48                                                   02339000
FLCPOPSW EQU   PSA+40                                                   02340000
FLCSOPSW EQU   PSA+32                                                   02341000
FLCEOPSW EQU   PSA+24                                                   02342000
@NM00006 EQU   FLCICCW2+4                                               02343000
FLCCVT   EQU   FLCICCW2                                                 02344000
FLCICCW1 EQU   FLCROPSW                                                 02345000
FLCIPPSW EQU   FLCRNPSW                                                 02346000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02347000
@ENDDATA EQU   *                                                        02348000
         END   IDAVBPJ2,(C'PLS2101',0701,76099)                         02349000
