         TITLE 'EP=BLSCRTCB - IPCS DAS GET ZZ2 POINTER FOR CURRENT TCB *00001000
                        '                                               00002000
*     /* CHANGE ACTIVITY                                                00003000
*    THIS MODULE IS WRITTEN FOR @G57LPSR                                00004000
BLSCRTCB CSECT ,                                                   0002 00005000
@MAINENT DS    0H                                                  0002 00006000
         USING *,@15                                               0002 00007000
         B     @PROLOG                                             0002 00008000
         DC    AL1(16)                                             0002 00009000
         DC    C'BLSCRTCB  78.065'                                 0002 00010000
         DROP  @15                                                      00011000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00012000
         BALR  @12,0                                               0002 00013000
@PSTART  DS    0H                                                  0002 00014000
         USING @PSTART,@12                                         0002 00015000
         L     @00,@SIZDATD                                        0002 00016000
         BLSCGETF R,LV=(0)                                              00017000
         LR    @11,@01                                             0002 00018000
         USING @DATD,@11                                           0002 00019000
         ST    @13,@SA00001+4                                      0002 00020000
         LM    @00,@01,20(@13)                                     0002 00021000
         ST    @11,8(,@13)                                         0002 00022000
         LR    @13,@11                                             0002 00023000
         MVC   @PC00001(4),0(@01)                                  0002 00024000
         EJECT                                                          00025000
*                                                                  0124 00026000
*   /*****************************************************************/ 00027000
*   /*                                                               */ 00028000
*   /* INITIALIZE MODULE STATUS                                      */ 00029000
*   /*                                                               */ 00030000
*   /*****************************************************************/ 00031000
*                                                                  0124 00032000
*   DMCBPTR=ADDR(DMCBPARM);         /* BASE THE DMCB                 */ 00033000
         L     DMCBPTR,@PC00001                                    0124 00034000
*   MODNAME=LMODNMC;                /* INIT THE MODULE NAME          */ 00035000
         MVC   MODNAME(8),@CC01223                                 0125 00036000
*   RETCODE=F0C;                    /* INIT THE MODULE RETURN CODE   */ 00037000
         SLR   @10,@10                                             0126 00038000
         ST    @10,RETCODE                                         0126 00039000
*   ANCHOR=F0C;                     /* INIT THE MESSAGE LIST ANCHOR  */ 00040000
*                                                                  0127 00041000
         ST    @10,ANCHOR                                          0127 00042000
*   /*****************************************************************/ 00043000
*   /*                                                               */ 00044000
*   /* VALIDATE THE ZZ1 CONTROL BLOCK POINTER                        */ 00045000
*   /*                                                               */ 00046000
*   /*****************************************************************/ 00047000
*                                                                  0128 00048000
*   IF ZZ1IDE^=ZZZIDENT THEN        /* TEST FOR INVALID ZZ1 BLK OR 0128 00049000
*                                      ZZ1 PTR                       */ 00050000
         L     @02,DMCBZZ1P(,DMCBPTR)                              0128 00051000
         CLC   ZZ1IDE(4,@02),@CC00038                              0128 00052000
         BE    @RF00128                                            0128 00053000
*     DO;                           /* INVALID ZZ1 BLOCK OR ZZ1    0129 00054000
*                                      POINTER                       */ 00055000
*       CHSTR847=ZZ2ZZ1P;           /* ZZ1 POINTER IN ZZ2            */ 00056000
         L     @02,DMCBTVP(,DMCBPTR)                               0130 00057000
         MVC   CHSTR847(4),ZZ2ZZ1P(@02)                            0130 00058000
*       CHSTR88=LHEX0FC;            /* TRANSLATE IT TO PRINTABLE HEX */ 00059000
         MVI   CHSTR88,X'0F'                                       0131 00060000
*       UNPK(CTEMP,CHSTR8);                                        0132 00061000
         UNPK  CTEMP(9),CHSTR8(8)                                  0132 00062000
*       TR(CTEMP,HEXTBL);                                          0133 00063000
         TR    CTEMP(9),HEXTBL                                     0133 00064000
*       DO;                         /* BLSDMSG                     0134 00065000
*                                      (ZZ2,INVCB,ANCHOR,BLSDMSGS) 0134 00066000
*                                      INSERT(LZZ1C,LZZ1C,CTEMP18)   */ 00067000
*         IOPTLIST(1)=ADDR(IOPTLIST(4));/* CHAIN TO NEXT INSERT      */ 00068000
         LA    @15,IOPTLIST+12                                     0135 00069000
         ST    @15,IOPTLIST                                        0135 00070000
*         IOPTLIST(2)=ADDR(LZZ1C);  /* INSERT NAME POINTER           */ 00071000
         LA    @15,@CC01221                                        0136 00072000
         ST    @15,IOPTLIST+4                                      0136 00073000
*         IOPTLIST(3)=0;            /* ZERO RESERVED FIELD           */ 00074000
         ST    @10,IOPTLIST+8                                      0137 00075000
*         RFY                                                      0138 00076000
*           I015F BASED(ADDR(IOPTLIST(3)));/* ACCESS BYTES 1-2       */ 00077000
*         I015F=LENGTH(LZZ1C);      /* INSERT LENGTH                 */ 00078000
         LA    @14,3                                               0139 00079000
         LA    @09,IOPTLIST+8                                      0139 00080000
         STH   @14,I015F(,@09)                                     0139 00081000
*         IOPTLIST(4)=ADDR(IOPTLIST(7));/* CHAIN TO NEXT INSERT      */ 00082000
         LA    @09,IOPTLIST+24                                     0140 00083000
         ST    @09,IOPTLIST+12                                     0140 00084000
*         IOPTLIST(5)=ADDR(LZZ1C);  /* INSERT NAME POINTER           */ 00085000
         ST    @15,IOPTLIST+16                                     0141 00086000
*         IOPTLIST(6)=0;            /* ZERO RESERVED FIELD           */ 00087000
         ST    @10,IOPTLIST+20                                     0142 00088000
*         RFY                                                      0143 00089000
*           I015F BASED(ADDR(IOPTLIST(6)));/* ACCESS BYTES 1-2       */ 00090000
*         I015F=LENGTH(LZZ1C);      /* INSERT LENGTH                 */ 00091000
         LA    @15,IOPTLIST+20                                     0144 00092000
         STH   @14,I015F(,@15)                                     0144 00093000
*         IOPTLIST(7)=0;            /* LAST INSERT                   */ 00094000
         ST    @10,IOPTLIST+24                                     0145 00095000
*         IOPTLIST(8)=ADDR(CTEMP18);/* INSERT NAME POINTER           */ 00096000
         LA    @15,CTEMP18                                         0146 00097000
         ST    @15,IOPTLIST+28                                     0146 00098000
*         IOPTLIST(9)=0;            /* ZERO RESERVED FIELD           */ 00099000
         ST    @10,IOPTLIST+32                                     0147 00100000
*         RFY                                                      0148 00101000
*           I015F BASED(ADDR(IOPTLIST(9)));/* ACCESS BYTES 1-2       */ 00102000
*         I015F=LENGTH(CTEMP18);    /* INSERT LENGTH                 */ 00103000
         LA    @10,IOPTLIST+32                                     0149 00104000
         MVC   I015F(2,@10),@CH00048                               0149 00105000
*         CALL BLSDMSG0(ZZ2,INVCB,ANCHOR,BLSDMSGS,'00000000'B,ADDR(     00106000
*             IOPTLIST));           /* BUILD MESSAGE                 */ 00107000
         ST    @02,@AL00001                                        0150 00108000
         LA    @10,@CF01215                                        0150 00109000
         ST    @10,@AL00001+4                                      0150 00110000
         LA    @10,ANCHOR                                          0150 00111000
         ST    @10,@AL00001+8                                      0150 00112000
         L     @10,ZZ2MSGSP(,@02)                                  0150 00113000
         ST    @10,@AL00001+12                                     0150 00114000
         LA    @10,@CB01237                                        0150 00115000
         ST    @10,@AL00001+16                                     0150 00116000
         LA    @10,IOPTLIST                                        0150 00117000
         ST    @10,@AFTEMPS                                        0150 00118000
         LA    @10,@AFTEMPS                                        0150 00119000
         ST    @10,@AL00001+20                                     0150 00120000
         L     @15,ZZ2MSG0P(,@02)                                  0150 00121000
         LA    @01,@AL00001                                        0150 00122000
         BALR  @14,@15                                             0150 00123000
*       END;                        /* BLSDMSG                     0151 00124000
*                                      (ZZ2,INVCB,ANCHOR,BLSDMSGS) 0151 00125000
*                                      INSERT(LZZ1C,LZZ1C,CTEMP18)   */ 00126000
*       DO;                         /* BLSDMSG                     0152 00127000
*                                      (ZZ2,HDRMSG,ANCHOR,BLSDMSGS)     00128000
*                                      LIFO                        0152 00129000
*                                      ROUTE(TERM)INSERT(MODNAME)    */ 00130000
*         IOPTLIST(1)=0;            /* LAST INSERT                   */ 00131000
         SLR   @10,@10                                             0153 00132000
         ST    @10,IOPTLIST                                        0153 00133000
*         IOPTLIST(2)=ADDR(MODNAME);/* INSERT NAME POINTER           */ 00134000
         LA    @02,MODNAME                                         0154 00135000
         ST    @02,IOPTLIST+4                                      0154 00136000
*         IOPTLIST(3)=0;            /* ZERO RESERVED FIELD           */ 00137000
         ST    @10,IOPTLIST+8                                      0155 00138000
*         RFY                                                      0156 00139000
*           I015F BASED(ADDR(IOPTLIST(3)));/* ACCESS BYTES 1-2       */ 00140000
*         I015F=LENGTH(MODNAME);    /* INSERT LENGTH                 */ 00141000
         LA    @10,IOPTLIST+8                                      0157 00142000
         MVC   I015F(2,@10),@CH00048                               0157 00143000
*         CALL BLSDMSG0(ZZ2,HDRMSG,ANCHOR,BLSDMSGS,'10010000'B,ADDR(    00144000
*             IOPTLIST));           /* BUILD MESSAGE                 */ 00145000
         L     @10,DMCBTVP(,DMCBPTR)                               0158 00146000
         ST    @10,@AL00001                                        0158 00147000
         LA    @02,@CF01213                                        0158 00148000
         ST    @02,@AL00001+4                                      0158 00149000
         LA    @02,ANCHOR                                          0158 00150000
         ST    @02,@AL00001+8                                      0158 00151000
         L     @02,ZZ2MSGSP(,@10)                                  0158 00152000
         ST    @02,@AL00001+12                                     0158 00153000
         LA    @02,@CB01240                                        0158 00154000
         ST    @02,@AL00001+16                                     0158 00155000
         LA    @02,IOPTLIST                                        0158 00156000
         ST    @02,@AFTEMPS                                        0158 00157000
         LA    @02,@AFTEMPS                                        0158 00158000
         ST    @02,@AL00001+20                                     0158 00159000
         L     @15,ZZ2MSG0P(,@10)                                  0158 00160000
         LA    @01,@AL00001                                        0158 00161000
         BALR  @14,@15                                             0158 00162000
*       END;                        /* BLSDMSG                     0159 00163000
*                                      (ZZ2,HDRMSG,ANCHOR,BLSDMSGS)     00164000
*                                      LIFO                        0159 00165000
*                                      ROUTE(TERM)INSERT(MODNAME)    */ 00166000
*       DO;                         /* ABEND(F145C) DUMP USER        */ 00167000
*         RESPECIFY                                                0161 00168000
*          (GPR01F) RESTRICTED;                                    0161 00169000
*         GPR01F=(F145C)&'00000FFF'X;/* COMP CODE IN BITS 20-31      */ 00170000
         LA    GPR01F,145                                          0162 00171000
*         GPR01F=GPR01F|'80000000'X;/* DUMP/STEP/DUMPOPTS FLAG       */ 00172000
         O     GPR01F,@CF00061                                     0163 00173000
*         SVC(13);                  /* ISSUE ABEND SVC               */ 00174000
         SVC   13                                                  0164 00175000
*         RESPECIFY                                                0165 00176000
*          (GPR01F) UNRESTRICTED;                                  0165 00177000
*       END;                        /* ABEND(F145C) DUMP USER INVALID   00178000
*                                      ZZ1 POINTER OR ZZ1 BLOCK      */ 00179000
*     END;                          /* INVALID ZZ1 BLOCK OR ZZ1    0167 00180000
*                                      POINTER                       */ 00181000
*                                                                  0167 00182000
*   /*****************************************************************/ 00183000
*   /*                                                               */ 00184000
*   /* SEARCH THE IPCS VARIABLE LIST FOR A TASK VARIABLE THAT IS USED*/ 00185000
*   /* WITH THE CURRENT TCB OR UNTIL END OF LIST(ZERO OR ZZZNULL) IS */ 00186000
*   /* DETECTED                                                      */ 00187000
*   /*                                                               */ 00188000
*   /*****************************************************************/ 00189000
*                                                                  0168 00190000
*   FOUND=OFF;                      /* INIT THE FOUND SWITCH         */ 00191000
@RF00128 NI    FOUND,B'01111111'                                   0168 00192000
*   P1=ZZ1ZZ2P;                     /* OBTAIN HEAD OF ZZ2 CHAIN FROM    00193000
*                                      DMCBZZ1P                      */ 00194000
         L     @10,DMCBZZ1P(,DMCBPTR)                              0169 00195000
         L     P1,ZZ1ZZ2P(,@10)                                    0169 00196000
*   DO WHILE P1^=ZZZNULL&P1^=F0C&FOUND=OFF;/* RUN THE ZZ2 BLOCK CHAIN*/ 00197000
         B     @DE00170                                            0170 00198000
@DL00170 DS    0H                                                  0171 00199000
*     IF P1->ZZ2TCBP=PSATOLD THEN   /* TEST FOR TCB MATCH            */ 00200000
         CLC   ZZ2TCBP(4,P1),PSATOLD                               0171 00201000
         BNE   @RF00171                                            0171 00202000
*       FOUND=ON;                   /* TCB'S MATCH                   */ 00203000
         OI    FOUND,B'10000000'                                   0172 00204000
*     ELSE                                                         0173 00205000
*       P1=P1->ZZ2ZZ2P;             /* NEXT ZZ2 BLOCK                */ 00206000
         B     @RC00171                                            0173 00207000
@RF00171 L     P1,ZZ2ZZ2P(,P1)                                     0173 00208000
*   END;                            /* RUN THE ZZ2 BLOCK CHAIN       */ 00209000
@RC00171 DS    0H                                                  0174 00210000
@DE00170 CL    P1,@CF00061                                         0174 00211000
         BE    @DC00170                                            0174 00212000
         LTR   P1,P1                                               0174 00213000
         BZ    @DC00170                                            0174 00214000
         TM    FOUND,B'10000000'                                   0174 00215000
         BZ    @DL00170                                            0174 00216000
@DC00170 DS    0H                                                  0175 00217000
*   IF FOUND=OFF THEN               /* CHAIN RUN, TEST NO TCB MATCH  */ 00218000
         TM    FOUND,B'10000000'                                   0175 00219000
         BNZ   @RF00175                                            0175 00220000
*     DO;                           /* ABEND(F134C) DUMP USER        */ 00221000
*       RESPECIFY                                                  0177 00222000
*        (GPR01F) RESTRICTED;                                      0177 00223000
*       GPR01F=(F134C)&'00000FFF'X; /* COMP CODE IN BITS 20-31       */ 00224000
         LA    GPR01F,134                                          0178 00225000
*       GPR01F=GPR01F|'80000000'X;  /* DUMP/STEP/DUMPOPTS FLAG       */ 00226000
         O     GPR01F,@CF00061                                     0179 00227000
*       SVC(13);                    /* ISSUE ABEND SVC               */ 00228000
         SVC   13                                                  0180 00229000
*       RESPECIFY                                                  0181 00230000
*        (GPR01F) UNRESTRICTED;                                    0181 00231000
*     END;                          /* ABEND(F134C) DUMP USER NO ZZ2    00232000
*                                      BLOCK MATCHES THE CURRENT TCB */ 00233000
*   DMCBTVP=P1;                     /* UPDATE THE ZZ2 BLOCK POINTER  */ 00234000
@RF00175 ST    P1,DMCBTVP(,DMCBPTR)                                0183 00235000
*   RETURN CODE(RETCODE);                                          0184 00236000
         L     @10,RETCODE                                         0184 00237000
         L     @13,4(,@13)                                         0184 00238000
         L     @00,@SIZDATD                                        0184 00239000
         LR    @01,@11                                             0184 00240000
         BLSCFREF R,LV=(0),A=(1)                                        00241000
         LR    @15,@10                                             0184 00242000
         L     @14,12(,@13)                                        0184 00243000
         LM    @00,@12,20(@13)                                     0184 00244000
         BR    @14                                                 0184 00245000
         EJECT                                                          00246000
*                                                                  0185 00247000
*   /*****************************************************************/ 00248000
*   /*                                                               */ 00249000
*   /* PROCEDURE STATEMENTS END                                      */ 00250000
*   /*                                                               */ 00251000
*   /*****************************************************************/ 00252000
*                                                                  0185 00253000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00254000
*                                                                  0185 00255000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00256000
*     GPR01F FIXED(31) REG(1);                                     0185 00257000
*   DECLARE                         /* COMMON VARIABLES              */ 00258000
*     I256C CHAR(256) BASED,                                       0186 00259000
*     I031F FIXED(31) BASED,                                       0186 00260000
*     I031P PTR(31) BASED,                                         0186 00261000
*     I015F FIXED(15) BASED,                                       0186 00262000
*     I015P PTR(15) BASED,                                         0186 00263000
*     I008P PTR(8) BASED,                                          0186 00264000
*     I001C CHAR(1) BASED;                                         0186 00265000
*   DECLARE                                                        0187 00266000
*     IOPTLIST(9) PTR(31) BDY(WORD);/* OPTION LIST ARRAY             */ 00267000
*   GENERATE NODEFS NOREFS DATA;                                   0188 00268000
*   END                             /* BLRPEND                       */ 00269000
*                                                                  0189 00270000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00271000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00272000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00273000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00274000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00275000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00276000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00277000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00278000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00279000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00280000
*/*%INCLUDE SYSLIB  (BLSDSERV)                                       */ 00281000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00282000
*                                                                  0189 00283000
*       ;                                                          0189 00284000
@EL00001 L     @13,4(,@13)                                         0189 00285000
@EF00001 L     @00,@SIZDATD                                        0189 00286000
         LR    @01,@11                                             0189 00287000
         BLSCFREF R,LV=(0),A=(1)                                        00288000
@ER00001 LM    @14,@12,12(@13)                                     0189 00289000
         BR    @14                                                 0189 00290000
@DATA    DS    0H                                                       00291000
@CH00048 DC    H'8'                                                     00292000
@DATD    DSECT                                                          00293000
         DS    0F                                                       00294000
@SA00001 DS    18F                                                      00295000
@PC00001 DS    1F                                                       00296000
@AL00001 DS    6A                                                       00297000
@AFTEMPS DS    1F                                                       00298000
BLSCRTCB CSECT                                                          00299000
         DS    0F                                                       00300000
@CF01213 DC    F'4071'                                                  00301000
@CF01215 DC    F'4072'                                                  00302000
@CF00061 DC    XL4'80000000'                                            00303000
@DATD    DSECT                                                          00304000
         DS    0D                                                       00305000
ANCHOR   DS    A                                                        00306000
FOUND    DS    BL1                                                      00307000
         DS    CL3                                                      00308000
MODSTAT  DS    CL12                                                     00309000
         ORG   MODSTAT                                                  00310000
MODNAME  DS    CL8                                                      00311000
RETCODE  DS    FL4                                                      00312000
         ORG   MODSTAT+12                                               00313000
         DS    CL4                                                      00314000
CHSTR8   DS    CL8                                                      00315000
         ORG   CHSTR8                                                   00316000
@NM00093 DS    CL3                                                      00317000
CHSTR847 DS    CL4                                                      00318000
         ORG   CHSTR847                                                 00319000
CHSTR846 DS    CL3                                                      00320000
CHSTR87  DS    CL1                                                      00321000
         ORG   CHSTR8+7                                                 00322000
CHSTR88  DS    CL1                                                      00323000
         ORG   CHSTR8+8                                                 00324000
CTEMP    DS    CL9                                                      00325000
         ORG   CTEMP                                                    00326000
CTEMP18  DS    CL8                                                      00327000
         ORG   CTEMP18                                                  00328000
CTEMP14  DS    CL4                                                      00329000
CTEMP58  DS    CL4                                                      00330000
         ORG   CTEMP58                                                  00331000
CTEMP56  DS    CL2                                                      00332000
CTEMP78  DS    CL2                                                      00333000
         ORG   CTEMP+9                                                  00334000
         DS    CL3                                                      00335000
IOPTLIST DS    9A                                                       00336000
BLSCRTCB CSECT                                                          00337000
         DS    0F                                                       00338000
@SIZDATD DC    AL1(0)                                                   00339000
         DC    AL3(@ENDDATD-@DATD)                                      00340000
         DS    0D                                                       00341000
@CC01223 DC    C'BLSCRTCB'                                              00342000
@CC00038 DC    C'IPCS'                                                  00343000
@CC01221 DC    C'ZZ1'                                                   00344000
@CB01237 DC    B'00000000'                                              00345000
@CB01240 DC    B'10010000'                                              00346000
@DATD    DSECT                                                          00347000
         SPACE 2                                                        00348000
*********************************************************************** 00349000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00350000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00351000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00352000
*********************************************************************** 00353000
         SPACE                                                          00354000
BLSCRTCB CSECT                                                          00355000
         ORG                                                            00356000
         DS    0D                                                       00357000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSCRTCB+19)/20+7)/8)CL8'BLSCRTCB'     00358000
BLSCRTCB CSECT                                                          00359000
*                         /*                                            00360000
HEXTBL   EQU   *-240                                                    00361000
         DC    CL16'0123456789ABCDEF'                                   00362000
@DATD    DSECT                                                          00363000
         SPACE 2                                                        00364000
*********************************************************************** 00365000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00366000
*********************************************************************** 00367000
         SPACE                                                          00368000
         DS    0D                                                       00369000
@DATD    DSECT                                                          00370000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00371000
@ENDDATD EQU   *                                                        00372000
BLSCRTCB CSECT                                                          00373000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00374000
@01      EQU   01                                                       00375000
@02      EQU   02                                                       00376000
@03      EQU   03                                                       00377000
@04      EQU   04                                                       00378000
@05      EQU   05                                                       00379000
@06      EQU   06                                                       00380000
@07      EQU   07                                                       00381000
@08      EQU   08                                                       00382000
@09      EQU   09                                                       00383000
@10      EQU   10                                                       00384000
@11      EQU   11                                                       00385000
@12      EQU   12                                                       00386000
@13      EQU   13                                                       00387000
@14      EQU   14                                                       00388000
@15      EQU   15                                                       00389000
P1       EQU   @04                                                      00390000
DMCBPTR  EQU   @03                                                      00391000
R0       EQU   @00                                                      00392000
R1       EQU   @01                                                      00393000
R2       EQU   @02                                                      00394000
R3       EQU   @03                                                      00395000
R4       EQU   @04                                                      00396000
R5       EQU   @05                                                      00397000
R9       EQU   @09                                                      00398000
RB       EQU   @11                                                      00399000
RD       EQU   @13                                                      00400000
RE       EQU   @14                                                      00401000
RF       EQU   @15                                                      00402000
GPR01F   EQU   @01                                                      00403000
RA       EQU   @10                                                      00404000
RC       EQU   @12                                                      00405000
R6       EQU   @06                                                      00406000
R7       EQU   @07                                                      00407000
R8       EQU   @08                                                      00408000
PSA      EQU   0                                                        00409000
FLCRNPSW EQU   PSA                                                      00410000
FLCROPSW EQU   PSA+8                                                    00411000
FLCICCW2 EQU   PSA+16                                                   00412000
PSAEEPSW EQU   PSA+132                                                  00413000
PSAESPSW EQU   PSA+136                                                  00414000
FLCSVILC EQU   PSAESPSW+1                                               00415000
PSAEPPSW EQU   PSA+140                                                  00416000
FLCPIILC EQU   PSAEPPSW+1                                               00417000
FLCPICOD EQU   PSAEPPSW+2                                               00418000
PSAPICOD EQU   FLCPICOD+1                                               00419000
FLCTEA   EQU   PSAEPPSW+4                                               00420000
FLCPER   EQU   PSA+152                                                  00421000
FLCMCLA  EQU   PSA+168                                                  00422000
FLCIOEL  EQU   FLCMCLA+4                                                00423000
FLCIOA   EQU   FLCMCLA+16                                               00424000
FLCFSA   EQU   FLCMCLA+80                                               00425000
PSATOLD  EQU   PSA+540                                                  00426000
PSASUPER EQU   PSA+552                                                  00427000
PSASUP1  EQU   PSASUPER                                                 00428000
PSASUP2  EQU   PSASUPER+1                                               00429000
PSASUP3  EQU   PSASUPER+2                                               00430000
PSASUP4  EQU   PSASUPER+3                                               00431000
PSACLHT  EQU   PSA+640                                                  00432000
PSALKSA  EQU   PSA+696                                                  00433000
PSAHLHI  EQU   PSA+760                                                  00434000
PSADSSFL EQU   PSA+836                                                  00435000
PSADSSF1 EQU   PSADSSFL                                                 00436000
PSADSSF3 EQU   PSADSSFL+2                                               00437000
PSADSSF4 EQU   PSADSSFL+3                                               00438000
PSARSVT  EQU   PSA+896                                                  00439000
ZZ1      EQU   0                                                        00440000
ZZ1IDE   EQU   ZZ1                                                      00441000
ZZ1ZZ2P  EQU   ZZ1+36                                                   00442000
ZZ1ATTN  EQU   ZZ1+360                                                  00443000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00444000
ZZ1F     EQU   ZZ1+368                                                  00445000
ZZ1N     EQU   ZZ1+1116                                                 00446000
ZZ2      EQU   0                                                        00447000
ZZ2AMD   EQU   ZZ2                                                      00448000
@NM00013 EQU   ZZ2AMD+7                                                 00449000
ZZ2PRT   EQU   ZZ2+138                                                  00450000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00451000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00452000
ZZ2A     EQU   ZZ2+272                                                  00453000
ZZ2AF    EQU   ZZ2A+16                                                  00454000
ZZ2APID  EQU   ZZ2A+64                                                  00455000
ZZ2AD    EQU   ZZ2A+74                                                  00456000
ZZ2ADD   EQU   ZZ2AD                                                    00457000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00458000
ZZ2ADM   EQU   ZZ2AD+46                                                 00459000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00460000
ZZ2ADP   EQU   ZZ2AD+56                                                 00461000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00462000
ZZ2AQAS  EQU   ZZ2A+144                                                 00463000
ZZ2AQD   EQU   ZZ2A+160                                                 00464000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00465000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00466000
ZZ2STG   EQU   ZZ2+960                                                  00467000
ZZ2ALLOP EQU   ZZ2+992                                                  00468000
ZZ2FREEP EQU   ZZ2+996                                                  00469000
ZZ2FF19P EQU   ZZ2+1000                                                 00470000
ZZ2FRE1P EQU   ZZ2+1004                                                 00471000
ZZ2FF18P EQU   ZZ2+1008                                                 00472000
ZZ2DYNAP EQU   ZZ2+1012                                                 00473000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00474000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00475000
ZZ2STAIP EQU   ZZ2+1024                                                 00476000
ZZ2FF02P EQU   ZZ2+1028                                                 00477000
ZZ2GETLP EQU   ZZ2+1032                                                 00478000
ZZ2PARSP EQU   ZZ2+1036                                                 00479000
ZZ2PTGTP EQU   ZZ2+1040                                                 00480000
ZZ2PUTLP EQU   ZZ2+1044                                                 00481000
ZZ2SCANP EQU   ZZ2+1048                                                 00482000
ZZ2STCKP EQU   ZZ2+1052                                                 00483000
ZZ2ALOCP EQU   ZZ2+1056                                                 00484000
ZZ2MSGSP EQU   ZZ2+1060                                                 00485000
ZZ2TRMOP EQU   ZZ2+1064                                                 00486000
ZZ2TRMVP EQU   ZZ2+1068                                                 00487000
ZZ2MSG0P EQU   ZZ2+1076                                                 00488000
ZZ2PUTNP EQU   ZZ2+1084                                                 00489000
ZZ2TRMNP EQU   ZZ2+1088                                                 00490000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00491000
ZZ2ADSDP EQU   ZZ2+1096                                                 00492000
ZZ2APDRP EQU   ZZ2+1100                                                 00493000
ZZ2FDSDP EQU   ZZ2+1104                                                 00494000
ZZ2FPDRP EQU   ZZ2+1108                                                 00495000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 00496000
ZZ2TCBP  EQU   ZZ2+1256                                                 00497000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00498000
ZZ2DVTP  EQU   ZZ2+1276                                                 00499000
ZZ2BVTP  EQU   ZZ2+1280                                                 00500000
ZZ2CPPL  EQU   ZZ2+1292                                                 00501000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00502000
ZZ2ITR   EQU   ZZ2+2840                                                 00503000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00504000
ZZ2ITSE  EQU   ZZ2+2864                                                 00505000
ZZ2ES    EQU   ZZ2+2872                                                 00506000
ZZ2AMDX  EQU   ZZ2+7160                                                 00507000
ZZ2AXO   EQU   ZZ2+7934                                                 00508000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00509000
CMD      EQU   0                                                        00510000
CMDT     EQU   CMD+4                                                    00511000
PSCB     EQU   0                                                        00512000
PSCBATR1 EQU   PSCB+16                                                  00513000
ECT      EQU   0                                                        00514000
ECTSWS   EQU   ECT+28                                                   00515000
ECTSWS2  EQU   ECT+40                                                   00516000
ECTSWS21 EQU   ECTSWS2                                                  00517000
UPT      EQU   0                                                        00518000
UPTSWS   EQU   UPT+12                                                   00519000
SA       EQU   0                                                        00520000
SA1      EQU   SA                                                       00521000
SAR      EQU   SA+12                                                    00522000
BVT      EQU   0                                                        00523000
BVTPUTLP EQU   BVT+4                                                    00524000
BVTPUTOP EQU   BVT+12                                                   00525000
BVTPUTTP EQU   BVT+16                                                   00526000
BVTPUTVP EQU   BVT+20                                                   00527000
BVTPUTAP EQU   BVT+24                                                   00528000
BVTPRTTP EQU   BVT+28                                                   00529000
BVTPRTAP EQU   BVT+32                                                   00530000
BVTPUTDP EQU   BVT+36                                                   00531000
BVTMONP  EQU   BVT+40                                                   00532000
BVTMON2P EQU   BVT+44                                                   00533000
BVTVSARP EQU   BVT+48                                                   00534000
BVTVSENP EQU   BVT+64                                                   00535000
BVTVSERP EQU   BVT+68                                                   00536000
BVTVSGEP EQU   BVT+72                                                   00537000
BVTVSGUP EQU   BVT+76                                                   00538000
BVTVSPOP EQU   BVT+80                                                   00539000
BVTVSPUP EQU   BVT+84                                                   00540000
BVTMPKNP EQU   BVT+104                                                  00541000
BVTMONLP EQU   BVT+108                                                  00542000
BVTPUTCP EQU   BVT+132                                                  00543000
BVTMPK1P EQU   BVT+136                                                  00544000
BVTZZ2RP EQU   BVT+140                                                  00545000
BVTPGMRP EQU   BVT+144                                                  00546000
BVTMONAP EQU   BVT+148                                                  00547000
BVTBLDDP EQU   BVT+152                                                  00548000
BVTBLDLP EQU   BVT+156                                                  00549000
BVTPGMCP EQU   BVT+160                                                  00550000
BVTPGMDP EQU   BVT+164                                                  00551000
BVTPGMLP EQU   BVT+168                                                  00552000
BVTMONCP EQU   BVT+180                                                  00553000
BVTMONDP EQU   BVT+184                                                  00554000
BVTMONTP EQU   BVT+188                                                  00555000
BVTPARIP EQU   BVT+192                                                  00556000
BVTPARUP EQU   BVT+196                                                  00557000
BVTPRTNP EQU   BVT+204                                                  00558000
BVTVSCRP EQU   BVT+208                                                  00559000
BVTVSMRP EQU   BVT+212                                                  00560000
BVTMONXP EQU   BVT+216                                                  00561000
BVTTRMAP EQU   BVT+228                                                  00562000
BLSDMSGS EQU   0                                                        00563000
BLSDMSG0 EQU   0                                                        00564000
DVT      EQU   0                                                        00565000
DVTDEQPP EQU   DVT+8                                                    00566000
DVTENQPP EQU   DVT+12                                                   00567000
DVTAUTHP EQU   DVT+20                                                   00568000
DVTLPCLP EQU   DVT+24                                                   00569000
DVTBP00P EQU   DVT+28                                                   00570000
DVTCN00P EQU   DVT+32                                                   00571000
DVTDF00P EQU   DVT+36                                                   00572000
DVTDS00P EQU   DVT+44                                                   00573000
DVTFL00P EQU   DVT+48                                                   00574000
DVTFP00P EQU   DVT+52                                                   00575000
DVTGD00P EQU   DVT+56                                                   00576000
DVTGG00P EQU   DVT+60                                                   00577000
DVTGP00P EQU   DVT+64                                                   00578000
DVTND00P EQU   DVT+68                                                   00579000
DVTND01P EQU   DVT+72                                                   00580000
DVTOD00P EQU   DVT+76                                                   00581000
DVTPS00P EQU   DVT+80                                                   00582000
DVTSD00P EQU   DVT+84                                                   00583000
DVTSL00P EQU   DVT+88                                                   00584000
DVTTL00P EQU   DVT+92                                                   00585000
DVTUD00P EQU   DVT+96                                                   00586000
DVTUP00P EQU   DVT+100                                                  00587000
DVTLP00P EQU   DVT+104                                                  00588000
DVTLALLP EQU   DVT+108                                                  00589000
DVTLPFMP EQU   DVT+112                                                  00590000
DVTCLOSP EQU   DVT+116                                                  00591000
DVTOPENP EQU   DVT+120                                                  00592000
DVTPERAP EQU   DVT+124                                                  00593000
DVTDALLP EQU   DVT+128                                                  00594000
DMCB     EQU   0                                                        00595000
DMCBTVP  EQU   DMCB+8                                                   00596000
DMCBFTY  EQU   DMCB+20                                                  00597000
DMCBOPN  EQU   DMCB+21                                                  00598000
DMCBRMOD EQU   DMCB+23                                                  00599000
DMCBOUT  EQU   DMCBRMOD                                                 00600000
DMCBOPTS EQU   DMCB+24                                                  00601000
DMCBGKY  EQU   DMCBOPTS                                                 00602000
DMCBMFLG EQU   DMCB+28                                                  00603000
DMCBBUFP EQU   DMCB+32                                                  00604000
DMCBKEYP EQU   DMCB+44                                                  00605000
DMCBRI   EQU   DMCB+64                                                  00606000
DMCBZZ1P EQU   DMCB+76                                                  00607000
DMCBFRE  EQU   DMCB+88                                                  00608000
DMCBEOB  EQU   DMCB+92                                                  00609000
DMCBACBE EQU   DMCB+124                                                 00610000
DMCBSPEC EQU   DMCB+380                                                 00611000
DMCBAMS  EQU   DMCB+416                                                 00612000
DMCBAUDT EQU   DMCB+568                                                 00613000
DMCBLSCP EQU   DMCBAUDT+16                                              00614000
I015F    EQU   0                                                        00615000
BLSCALOC EQU   0                                                        00616000
BLSDADSD EQU   0                                                        00617000
BLSDAPDR EQU   0                                                        00618000
BLSDDEQP EQU   0                                                        00619000
BLSDENQP EQU   0                                                        00620000
BLSDENQ0 EQU   0                                                        00621000
BLSDFDSD EQU   0                                                        00622000
BLSDFPDR EQU   0                                                        00623000
BLSEAUTH EQU   0                                                        00624000
BLSELPCL EQU   0                                                        00625000
BLSELPFM EQU   0                                                        00626000
BLSFBP00 EQU   0                                                        00627000
BLSFCLOS EQU   0                                                        00628000
BLSFCN00 EQU   0                                                        00629000
BLSFDALL EQU   0                                                        00630000
BLSFDF00 EQU   0                                                        00631000
BLSFDS00 EQU   0                                                        00632000
BLSFFL00 EQU   0                                                        00633000
BLSFFP00 EQU   0                                                        00634000
BLSFGD00 EQU   0                                                        00635000
BLSFGG00 EQU   0                                                        00636000
BLSFGP00 EQU   0                                                        00637000
BLSFLALL EQU   0                                                        00638000
BLSFLP00 EQU   0                                                        00639000
BLSFND00 EQU   0                                                        00640000
BLSFND01 EQU   0                                                        00641000
BLSFOD00 EQU   0                                                        00642000
BLSFOPEN EQU   0                                                        00643000
BLSFPERA EQU   0                                                        00644000
BLSFPS00 EQU   0                                                        00645000
BLSFSD00 EQU   0                                                        00646000
BLSFSL00 EQU   0                                                        00647000
BLSFTL00 EQU   0                                                        00648000
BLSFUD00 EQU   0                                                        00649000
BLSFUP00 EQU   0                                                        00650000
BLSUALLO EQU   0                                                        00651000
BLSUBLDD EQU   0                                                        00652000
BLSUBLDL EQU   0                                                        00653000
BLSUDYNA EQU   0                                                        00654000
BLSUFREE EQU   0                                                        00655000
BLSUFRE1 EQU   0                                                        00656000
BLSUMON  EQU   0                                                        00657000
BLSUMONA EQU   0                                                        00658000
BLSUMONC EQU   0                                                        00659000
BLSUMOND EQU   0                                                        00660000
BLSUMONL EQU   0                                                        00661000
BLSUMONT EQU   0                                                        00662000
BLSUMONX EQU   0                                                        00663000
BLSUMON2 EQU   0                                                        00664000
BLSUMPKN EQU   0                                                        00665000
BLSUMPK1 EQU   0                                                        00666000
BLSUPARI EQU   0                                                        00667000
BLSUPARU EQU   0                                                        00668000
BLSUPGMC EQU   0                                                        00669000
BLSUPGMD EQU   0                                                        00670000
BLSUPGML EQU   0                                                        00671000
BLSUPGMR EQU   0                                                        00672000
BLSUPRTA EQU   0                                                        00673000
BLSUPRTN EQU   0                                                        00674000
BLSUPRTT EQU   0                                                        00675000
BLSUPUTA EQU   0                                                        00676000
BLSUPUTC EQU   0                                                        00677000
BLSUPUTD EQU   0                                                        00678000
BLSUPUTL EQU   0                                                        00679000
BLSUPUTN EQU   0                                                        00680000
BLSUPUTO EQU   0                                                        00681000
BLSUPUTT EQU   0                                                        00682000
BLSUPUTV EQU   0                                                        00683000
BLSUSTAI EQU   0                                                        00684000
BLSUTRMA EQU   0                                                        00685000
BLSUTRMN EQU   0                                                        00686000
BLSUTRMO EQU   0                                                        00687000
BLSUTRMV EQU   0                                                        00688000
BLSUVSAR EQU   0                                                        00689000
BLSUVSCR EQU   0                                                        00690000
BLSUVSEN EQU   0                                                        00691000
BLSUVSER EQU   0                                                        00692000
BLSUVSGE EQU   0                                                        00693000
BLSUVSGU EQU   0                                                        00694000
BLSUVSMR EQU   0                                                        00695000
BLSUVSPO EQU   0                                                        00696000
BLSUVSPU EQU   0                                                        00697000
BLSUZZ2C EQU   0                                                        00698000
BLSUZZ2D EQU   0                                                        00699000
BLSUZZ2R EQU   0                                                        00700000
DMCBDMGR EQU   0                                                        00701000
DMCBRQC  EQU   0                                                        00702000
IKJEFF02 EQU   0                                                        00703000
IKJEFF18 EQU   0                                                        00704000
IKJEFF19 EQU   0                                                        00705000
IKJGETL  EQU   0                                                        00706000
IKJPARS  EQU   0                                                        00707000
IKJPTGT  EQU   0                                                        00708000
IKJPUTL  EQU   0                                                        00709000
IKJSCAN  EQU   0                                                        00710000
IKJSTCK  EQU   0                                                        00711000
I001C    EQU   0                                                        00712000
I008P    EQU   0                                                        00713000
I015P    EQU   0                                                        00714000
I031F    EQU   0                                                        00715000
I031P    EQU   0                                                        00716000
I256C    EQU   0                                                        00717000
DMCBPARM EQU   0                                                        00718000
CPPL     EQU   ZZ2CPPL                                                  00719000
CPPLUPT  EQU   CPPL+4                                                   00720000
CPPLPSCB EQU   CPPL+8                                                   00721000
CPPLECT  EQU   CPPL+12                                                  00722000
PSARSVTE EQU   PSARSVT                                                  00723000
DMCBVSM  EQU   DMCBAMS                                                  00724000
DMCBQSM  EQU   DMCBAMS                                                  00725000
FLC      EQU   PSA                                                      00726000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00727000
DMCBRES7 EQU   DMCBQSM+96                                               00728000
DMCBDCB  EQU   DMCBQSM                                                  00729000
DMCBACB  EQU   DMCBVSM+76                                               00730000
DMCBRPL  EQU   DMCBVSM                                                  00731000
PSARSAV  EQU   PSARSVTE+60                                              00732000
PSARSTK  EQU   PSARSVTE+56                                              00733000
PSAESAV3 EQU   PSARSVTE+52                                              00734000
PSAESTK3 EQU   PSARSVTE+48                                              00735000
PSAESAV2 EQU   PSARSVTE+44                                              00736000
PSAESTK2 EQU   PSARSVTE+40                                              00737000
PSAESAV1 EQU   PSARSVTE+36                                              00738000
PSAESTK1 EQU   PSARSVTE+32                                              00739000
PSAPSAV  EQU   PSARSVTE+28                                              00740000
PSAPSTK  EQU   PSARSVTE+24                                              00741000
PSAMSAV  EQU   PSARSVTE+20                                              00742000
PSAMSTK  EQU   PSARSVTE+16                                              00743000
PSASSAV  EQU   PSARSVTE+12                                              00744000
PSASSTK  EQU   PSARSVTE+8                                               00745000
PSANSTK  EQU   PSARSVTE+4                                               00746000
PSACSTK  EQU   PSARSVTE                                                 00747000
CPPLCBUF EQU   CPPL                                                     00748000
DMCBWRK  EQU   DMCB+648                                                 00749000
DMCBRES8 EQU   DMCB+640                                                 00750000
DMCBMODN EQU   DMCB+632                                                 00751000
DMCBCARY EQU   DMCBAUDT+20                                              00752000
DMCBCLC  EQU   DMCBAUDT+12                                              00753000
DMCBOPC  EQU   DMCBAUDT+8                                               00754000
DMCBFRC  EQU   DMCBAUDT+4                                               00755000
DMCBALC  EQU   DMCBAUDT                                                 00756000
DMCBFR   EQU   DMCB+412                                                 00757000
DMCBRES6 EQU   DMCB+410                                                 00758000
DMCBIRSC EQU   DMCB+408                                                 00759000
DMCBSUBC EQU   DMCB+404                                                 00760000
DMCBDRBP EQU   DMCB+400                                                 00761000
DMCBRSZM EQU   DMCB+398                                                 00762000
DMCBRSZA EQU   DMCB+396                                                 00763000
DMCBCISZ EQU   DMCB+394                                                 00764000
DMCBDCBL EQU   DMCB+392                                                 00765000
DMCBDCLR EQU   DMCB+390                                                 00766000
DMCBDCFM EQU   DMCB+389                                                 00767000
DMCBRES5 EQU   DMCB+388                                                 00768000
DMCBLBRT EQU   DMCB+386                                                 00769000
DMCBLBSQ EQU   DMCB+384                                                 00770000
DMCBLBPS EQU   DMCB+383                                                 00771000
DMCBLBTY EQU   DMCB+382                                                 00772000
DMCBRES4 EQU   DMCB+381                                                 00773000
DMCBSPRS EQU   DMCBSPEC                                                 00774000
DMCBSPRN EQU   DMCBSPEC                                                 00775000
DMCBSPCT EQU   DMCBSPEC                                                 00776000
DMCBSPRL EQU   DMCBSPEC                                                 00777000
DMCBSPSE EQU   DMCB+376                                                 00778000
DMCBSPPR EQU   DMCB+372                                                 00779000
DMCBSPTY EQU   DMCB+369                                                 00780000
DMCBODIS EQU   DMCB+368                                                 00781000
DMCBDISP EQU   DMCB+367                                                 00782000
DMCBSTAT EQU   DMCB+366                                                 00783000
DMCBRES3 EQU   DMCB+364                                                 00784000
DMCBMEMB EQU   DMCB+356                                                 00785000
DMCBMODL EQU   DMCB+348                                                 00786000
DMCBRES9 EQU   DMCB+340                                                 00787000
DMCBPID  EQU   DMCB+332                                                 00788000
DMCBTYPE EQU   DMCB+328                                                 00789000
DMCBDSN  EQU   DMCB+284                                                 00790000
DMCBUNIT EQU   DMCB+276                                                 00791000
DMCBDSOR EQU   DMCB+274                                                 00792000
DMCBVOL  EQU   DMCB+268                                                 00793000
DMCBDDNM EQU   DMCB+260                                                 00794000
DMCBSYNM EQU   DMCB+132                                                 00795000
DMCBRPLF EQU   DMCB+128                                                 00796000
DMCBDCBE EQU   DMCBACBE                                                 00797000
DMCBARC  EQU   DMCB+120                                                 00798000
DMCBCPC  EQU   DMCB+116                                                 00799000
DMCBRET  EQU   DMCB+112                                                 00800000
DMCBSTL  EQU   DMCB+96                                                  00801000
DMCBRES2 EQU   DMCB+85                                                  00802000
DMCBSPID EQU   DMCB+84                                                  00803000
DMCBRESC EQU   DMCB+80                                                  00804000
DMCBMSGS EQU   DMCB+72                                                  00805000
DMCBMSG0 EQU   DMCB+68                                                  00806000
DMCBRRL  EQU   DMCB+60                                                  00807000
DMCBRBA  EQU   DMCB+56                                                  00808000
DMCBMSG  EQU   DMCB+52                                                  00809000
DMCBKEYL EQU   DMCB+48                                                  00810000
DMCBKPC  EQU   DMCBKEYP                                                 00811000
DMCBORL  EQU   DMCB+40                                                  00812000
DMCBBLEN EQU   DMCB+36                                                  00813000
DMCBBFPC EQU   DMCBBUFP                                                 00814000
DMCBRES1 EQU   DMCB+31                                                  00815000
DMCBACCM EQU   DMCB+30                                                  00816000
DMCBREJ  EQU   DMCB+29                                                  00817000
DMCBRESB EQU   DMCBMFLG                                                 00818000
DMCBFMOD EQU   DMCBMFLG                                                 00819000
DMCBLOPT EQU   DMCB+27                                                  00820000
DMCBLRM  EQU   DMCB+26                                                  00821000
DMCBLRQ  EQU   DMCB+25                                                  00822000
DMCBOPRS EQU   DMCBOPTS                                                 00823000
DMCBLRD  EQU   DMCBOPTS                                                 00824000
DMCBBWD  EQU   DMCBOPTS                                                 00825000
DMCBUPD  EQU   DMCBOPTS                                                 00826000
DMCBAPX  EQU   DMCBOPTS                                                 00827000
DMCBRNO  EQU   DMCBGKY                                                  00828000
DMCBKYD  EQU   DMCBOPTS                                                 00829000
DMCBRMRS EQU   DMCBRMOD                                                 00830000
DMCBRM5  EQU   DMCBRMOD                                                 00831000
DMCBRM6  EQU   DMCBRMOD                                                 00832000
DMCBTMP  EQU   DMCBOUT                                                  00833000
DMCBRQST EQU   DMCB+22                                                  00834000
DMCBRESA EQU   DMCBOPN                                                  00835000
DMCBSOUT EQU   DMCBOPN                                                  00836000
DMCBSIN  EQU   DMCBOPN                                                  00837000
DMCBVSF  EQU   DMCBFTY                                                  00838000
DMCBKSF  EQU   DMCBFTY                                                  00839000
DMCBFTRS EQU   DMCBFTY                                                  00840000
DMCBSHF  EQU   DMCBFTY                                                  00841000
DMCBIRL  EQU   DMCB+16                                                  00842000
DMCBRTC  EQU   DMCB+12                                                  00843000
DMCBNEXT EQU   DMCB+4                                                   00844000
DMCBID   EQU   DMCB                                                     00845000
DVT99999 EQU   DVT+256                                                  00846000
DVT0064P EQU   DVT+252                                                  00847000
DVT0063P EQU   DVT+248                                                  00848000
DVT0062P EQU   DVT+244                                                  00849000
DVT0061P EQU   DVT+240                                                  00850000
DVT0060P EQU   DVT+236                                                  00851000
DVT0059P EQU   DVT+232                                                  00852000
DVT0058P EQU   DVT+228                                                  00853000
DVT0057P EQU   DVT+224                                                  00854000
DVT0056P EQU   DVT+220                                                  00855000
DVT0055P EQU   DVT+216                                                  00856000
DVT0054P EQU   DVT+212                                                  00857000
DVT0053P EQU   DVT+208                                                  00858000
DVT0052P EQU   DVT+204                                                  00859000
DVT0051P EQU   DVT+200                                                  00860000
DVT0050P EQU   DVT+196                                                  00861000
DVT0049P EQU   DVT+192                                                  00862000
DVT0048P EQU   DVT+188                                                  00863000
DVT0047P EQU   DVT+184                                                  00864000
DVT0046P EQU   DVT+180                                                  00865000
DVT0045P EQU   DVT+176                                                  00866000
DVT0044P EQU   DVT+172                                                  00867000
DVT0043P EQU   DVT+168                                                  00868000
DVT0042P EQU   DVT+164                                                  00869000
DVT0041P EQU   DVT+160                                                  00870000
DVT0040P EQU   DVT+156                                                  00871000
DVT0039P EQU   DVT+152                                                  00872000
DVT0038P EQU   DVT+148                                                  00873000
DVT0037P EQU   DVT+144                                                  00874000
DVT0036P EQU   DVT+140                                                  00875000
DVT0035P EQU   DVT+136                                                  00876000
DVT0034P EQU   DVT+132                                                  00877000
DVT0011P EQU   DVT+40                                                   00878000
DVT0005P EQU   DVT+16                                                   00879000
DVT0002P EQU   DVT+4                                                    00880000
DVT0001P EQU   DVT                                                      00881000
BVT99999 EQU   BVT+256                                                  00882000
BVT0064P EQU   BVT+252                                                  00883000
BVT0063P EQU   BVT+248                                                  00884000
BVT0062P EQU   BVT+244                                                  00885000
BVT0061P EQU   BVT+240                                                  00886000
BVT0060P EQU   BVT+236                                                  00887000
BVT0059P EQU   BVT+232                                                  00888000
BVT0057P EQU   BVT+224                                                  00889000
BVT0056P EQU   BVT+220                                                  00890000
BVTSTBLP EQU   BVT+200                                                  00891000
BVT0045P EQU   BVT+176                                                  00892000
BVT0044P EQU   BVT+172                                                  00893000
BVT0033P EQU   BVT+128                                                  00894000
BVT0032P EQU   BVT+124                                                  00895000
BVT0031P EQU   BVT+120                                                  00896000
BVT0030P EQU   BVT+116                                                  00897000
BVT0029P EQU   BVT+112                                                  00898000
BVT0026P EQU   BVT+100                                                  00899000
BVT0025P EQU   BVT+96                                                   00900000
BVT0024P EQU   BVT+92                                                   00901000
BVT0023P EQU   BVT+88                                                   00902000
BVT0016P EQU   BVT+60                                                   00903000
BVT0015P EQU   BVT+56                                                   00904000
BVT0014P EQU   BVT+52                                                   00905000
BVT0003P EQU   BVT+8                                                    00906000
BVT0001P EQU   BVT                                                      00907000
SA99     EQU   SA+72                                                    00908000
SARC     EQU   SAR+56                                                   00909000
SARB     EQU   SAR+52                                                   00910000
SARA     EQU   SAR+48                                                   00911000
SAR9     EQU   SAR+44                                                   00912000
SAR8     EQU   SAR+40                                                   00913000
SAR7     EQU   SAR+36                                                   00914000
SAR6     EQU   SAR+32                                                   00915000
SAR5     EQU   SAR+28                                                   00916000
SAR4     EQU   SAR+24                                                   00917000
SAR3     EQU   SAR+20                                                   00918000
SAR2     EQU   SAR+16                                                   00919000
SAR1     EQU   SAR+12                                                   00920000
SAR0     EQU   SAR+8                                                    00921000
SARF     EQU   SAR+4                                                    00922000
SARE     EQU   SAR                                                      00923000
SAFWD    EQU   SA+8                                                     00924000
SABAK    EQU   SA+4                                                     00925000
SA1L     EQU   SA1+1                                                    00926000
SA1P     EQU   SA1                                                      00927000
UPTPREFL EQU   UPT+23                                                   00928000
UPTPREFX EQU   UPT+16                                                   00929000
@NM00068 EQU   UPT+15                                                   00930000
UPTLDEL  EQU   UPT+14                                                   00931000
UPTCDEL  EQU   UPT+13                                                   00932000
UPTWTP   EQU   UPTSWS                                                   00933000
UPTMODE  EQU   UPTSWS                                                   00934000
UPTALD   EQU   UPTSWS                                                   00935000
UPTPAUS  EQU   UPTSWS                                                   00936000
UPTNCOM  EQU   UPTSWS                                                   00937000
UPTMID   EQU   UPTSWS                                                   00938000
UPTNPRM  EQU   UPTSWS                                                   00939000
UPTRCVR  EQU   UPTSWS                                                   00940000
UPTUSER  EQU   UPT+2                                                    00941000
@NM00067 EQU   UPT                                                      00942000
@NM00066 EQU   ECT+52                                                   00943000
@NM00065 EQU   ECT+48                                                   00944000
@NM00064 EQU   ECT+44                                                   00945000
@NM00063 EQU   ECTSWS2+1                                                00946000
@NM00062 EQU   ECTSWS21                                                 00947000
ECTTABND EQU   ECTSWS21                                                 00948000
ECTDEFCS EQU   ECTSWS21                                                 00949000
ECTBKPB  EQU   ECT+36                                                   00950000
ECTUSER  EQU   ECT+32                                                   00951000
ECTDDNUM EQU   ECT+29                                                   00952000
ECTATTN  EQU   ECTSWS                                                   00953000
ECTBKGRD EQU   ECTSWS                                                   00954000
ECTNNOT  EQU   ECTSWS                                                   00955000
ECTNMAL  EQU   ECTSWS                                                   00956000
ECTLOGF  EQU   ECTSWS                                                   00957000
ECTATRM  EQU   ECTSWS                                                   00958000
@NM00061 EQU   ECTSWS                                                   00959000
ECTNOPD  EQU   ECTSWS                                                   00960000
ECTSCMD  EQU   ECT+20                                                   00961000
ECTPCMD  EQU   ECT+12                                                   00962000
ECTSMSG  EQU   ECT+9                                                    00963000
ECTMSGF  EQU   ECT+8                                                    00964000
ECTIOWA  EQU   ECT+4                                                    00965000
ECTRTCD  EQU   ECT+1                                                    00966000
ECTRCDF  EQU   ECT                                                      00967000
PSCBU    EQU   PSCB+64                                                  00968000
PSCBRSZ  EQU   PSCB+60                                                  00969000
PSCBLINE EQU   PSCB+59                                                  00970000
PSCBCHAR EQU   PSCB+58                                                  00971000
PSCBUPTL EQU   PSCB+56                                                  00972000
PSCBUPT  EQU   PSCB+52                                                  00973000
PSCBRLGB EQU   PSCB+48                                                  00974000
PSCBDEST EQU   PSCB+40                                                  00975000
@NM00060 EQU   PSCB+36                                                  00976000
@NM00059 EQU   PSCB+32                                                  00977000
@NM00058 EQU   PSCB+28                                                  00978000
PSCBLTI2 EQU   PSCB+24                                                  00979000
PSCBLTIM EQU   PSCB+20                                                  00980000
PSCBATR2 EQU   PSCB+18                                                  00981000
@NM00057 EQU   PSCBATR1                                                 00982000
@NM00056 EQU   PSCBATR1                                                 00983000
@NM00055 EQU   PSCBATR1                                                 00984000
PSCBATTN EQU   PSCBATR1                                                 00985000
PSCBVMNT EQU   PSCBATR1                                                 00986000
PSCBJCL  EQU   PSCBATR1                                                 00987000
PSCBACCT EQU   PSCBATR1                                                 00988000
PSCBCTRL EQU   PSCBATR1                                                 00989000
PSCBGPNM EQU   PSCB+8                                                   00990000
PSCBUSRL EQU   PSCB+7                                                   00991000
PSCBUSER EQU   PSCB                                                     00992000
CMDT1    EQU   CMDT                                                     00993000
CMDO     EQU   CMD+2                                                    00994000
CMDL     EQU   CMD                                                      00995000
ZZ299999 EQU   ZZ2+8192                                                 00996000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  00997000
ZZ2AXOL  EQU   ZZ2AXO                                                   00998000
@NM00054 EQU   ZZ2+7288                                                 00999000
@NM00053 EQU   ZZ2AMDX+4                                                01000000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01001000
ZZ2HSD   EQU   ZZ2+3056                                                 01002000
@NM00052 EQU   ZZ2ES                                                    01003000
@NM00051 EQU   ZZ2+2868                                                 01004000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01005000
@NM00050 EQU   ZZ2ITSE                                                  01006000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01007000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01008000
@NM00049 EQU   ZZ2ITR+20                                                01009000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01010000
@NM00048 EQU   ZZ2ITRE                                                  01011000
ZZ2ITREP EQU   ZZ2ITRE                                                  01012000
ZZ2ITREW EQU   ZZ2ITRE                                                  01013000
@NM00047 EQU   ZZ2ITR+9                                                 01014000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01015000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01016000
ZZ2ITRPP EQU   ZZ2ITR                                                   01017000
@NM00046 EQU   ZZ2+1544                                                 01018000
ZZ2PGM   EQU   ZZ2+1536                                                 01019000
@NM00045 EQU   ZZ2+1526                                                 01020000
ZZ2CW    EQU   ZZ2+1524                                                 01021000
@NM00044 EQU   ZZ2+1504                                                 01022000
@NM00043 EQU   ZZ2+1352                                                 01023000
ZZ2FFSYP EQU   ZZ2+1348                                                 01024000
ZZ2SASYP EQU   ZZ2+1344                                                 01025000
ZZ2RDSYP EQU   ZZ2+1340                                                 01026000
ZZ2RASYP EQU   ZZ2+1336                                                 01027000
ZZ2PHSYP EQU   ZZ2+1332                                                 01028000
ZZ2ESSYP EQU   ZZ2+1328                                                 01029000
ZZ200SYP EQU   ZZ2+1324                                                 01030000
ZZ2SCWP  EQU   ZZ2+1320                                                 01031000
ZZ2TTLP  EQU   ZZ2+1316                                                 01032000
ZZ2LOADP EQU   ZZ2+1312                                                 01033000
ZZ2VRESP EQU   ZZ2+1308                                                 01034000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01035000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01036000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01037000
ZZ2VRSAP EQU   ZZ2+1288                                                 01038000
ZZ2RVTP  EQU   ZZ2+1284                                                 01039000
@NM00042 EQU   ZZ2+1272                                                 01040000
@NM00041 EQU   ZZ2+1268                                                 01041000
ZZ2RPLP  EQU   ZZ2+1260                                                 01042000
@NM00040 EQU   ZZ2+1252                                                 01043000
@NM00039 EQU   ZZ2+1112                                                 01044000
@NM00038 EQU   ZZ2+1080                                                 01045000
ZZ2FT25P EQU   ZZ2+1072                                                 01046000
@NM00037 EQU   ZZ2+976                                                  01047000
ZZ2TOD   EQU   ZZ2+968                                                  01048000
ZZ2STGN  EQU   ZZ2STG+4                                                 01049000
ZZ2STGP  EQU   ZZ2STG                                                   01050000
@NM00036 EQU   ZZ2+952                                                  01051000
ZZ2SCMDE EQU   ZZ2+944                                                  01052000
ZZ2SCMDN EQU   ZZ2+936                                                  01053000
ZZ2IDENT EQU   ZZ2+928                                                  01054000
ZZ2A9999 EQU   ZZ2A+656                                                 01055000
@NM00035 EQU   ZZ2A+224                                                 01056000
@NM00034 EQU   ZZ2A+220                                                 01057000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01058000
@NM00033 EQU   ZZ2AQD+56                                                01059000
@NM00032 EQU   ZZ2AQDF                                                  01060000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01061000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01062000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01063000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01064000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01065000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01066000
@NM00031 EQU   ZZ2AQDT+1                                                01067000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01068000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01069000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01070000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01071000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01072000
ZZ2AQDOF EQU   ZZ2AQD                                                   01073000
ZZ2AQD00 EQU   ZZ2AQD                                                   01074000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01075000
@NM00030 EQU   ZZ2AQAS+12                                               01076000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01077000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01078000
@NM00029 EQU   ZZ2AQAS+2                                                01079000
ZZ2AQAST EQU   ZZ2AQAS                                                  01080000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01081000
ZZ2AZZ6P EQU   ZZ2A+140                                                 01082000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01083000
ZZ2ADPL  EQU   ZZ2ADP                                                   01084000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01085000
ZZ2ADML  EQU   ZZ2ADM                                                   01086000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01087000
ZZ2ADDL  EQU   ZZ2ADD                                                   01088000
@NM00028 EQU   ZZ2A+72                                                  01089000
ZZ2APIDB EQU   ZZ2APID+3                                                01090000
ZZ2APIDA EQU   ZZ2APID                                                  01091000
@NM00027 EQU   ZZ2A+24                                                  01092000
@NM00026 EQU   ZZ2AF+5                                                  01093000
ZZ2AFX   EQU   ZZ2AF+5                                                  01094000
@NM00025 EQU   ZZ2AF+3                                                  01095000
ZZ2AFS   EQU   ZZ2AF+2                                                  01096000
ZZ2AFD   EQU   ZZ2AF+2                                                  01097000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01098000
ZZ2AF$   EQU   ZZ2AF+2                                                  01099000
@NM00024 EQU   ZZ2AF+2                                                  01100000
ZZ2AFM   EQU   ZZ2AF+2                                                  01101000
@NM00023 EQU   ZZ2AF+2                                                  01102000
@NM00022 EQU   ZZ2AF+1                                                  01103000
ZZ2AFV   EQU   ZZ2AF+1                                                  01104000
@NM00021 EQU   ZZ2AF+1                                                  01105000
ZZ2AFC   EQU   ZZ2AF+1                                                  01106000
@NM00020 EQU   ZZ2AF                                                    01107000
ZZ2AFFS  EQU   ZZ2AF                                                    01108000
ZZ2AFT   EQU   ZZ2AF                                                    01109000
ZZ2AFP   EQU   ZZ2AF                                                    01110000
@NM00019 EQU   ZZ2A+8                                                   01111000
ZZ2ALINE EQU   ZZ2A+4                                                   01112000
@NM00018 EQU   ZZ2A+3                                                   01113000
ZZ2ASE   EQU   ZZ2A+2                                                   01114000
ZZ2ACH   EQU   ZZ2A                                                     01115000
@NM00017 EQU   ZZ2+264                                                  01116000
@NM00016 EQU   ZZ2+263                                                  01117000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01118000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01119000
ZZ2PRTL  EQU   ZZ2PRT                                                   01120000
@NM00015 EQU   ZZ2AMD+56                                                01121000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01122000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01123000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01124000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01125000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01126000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01127000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01128000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01129000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01130000
@NM00014 EQU   @NM00013                                                 01131000
ZZ2AMD2  EQU   @NM00013                                                 01132000
ZZ2AMD1  EQU   @NM00013                                                 01133000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01134000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01135000
ZZ2AMDT  EQU   ZZ2AMD                                                   01136000
ZZ199999 EQU   ZZ1+3072                                                 01137000
@NM00012 EQU   ZZ1+2160                                                 01138000
ZZ1TRTAS EQU   ZZ1+1904                                                 01139000
ZZ1TRUPC EQU   ZZ1+1648                                                 01140000
ZZ1TRCTX EQU   ZZ1+1392                                                 01141000
ZZ1NASID EQU   ZZ1N+274                                                 01142000
ZZ1NSTRL EQU   ZZ1N+272                                                 01143000
ZZ1NOFF  EQU   ZZ1N+268                                                 01144000
ZZ1NBDY  EQU   ZZ1N+264                                                 01145000
ZZ1NADE  EQU   ZZ1N+260                                                 01146000
ZZ1NADB  EQU   ZZ1N+256                                                 01147000
ZZ1NSTR  EQU   ZZ1N                                                     01148000
@NM00011 EQU   ZZ1+1080                                                 01149000
ZZ1TREBC EQU   ZZ1+824                                                  01150000
ZZ1TRHEX EQU   ZZ1+568                                                  01151000
@NM00010 EQU   ZZ1+377                                                  01152000
ZZ1USTAE EQU   ZZ1+376                                                  01153000
@NM00009 EQU   ZZ1F+1                                                   01154000
@NM00008 EQU   ZZ1F                                                     01155000
ZZ1FM    EQU   ZZ1F                                                     01156000
ZZ1FX    EQU   ZZ1F                                                     01157000
ZZ1FU    EQU   ZZ1F                                                     01158000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01159000
@NM00007 EQU   ZZ1EVE                                                   01160000
ZZ1EVEP  EQU   ZZ1EVE                                                   01161000
ZZ1EVEW  EQU   ZZ1EVE                                                   01162000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01163000
@NM00006 EQU   ZZ1+144                                                  01164000
ZZ1FPP   EQU   ZZ1+140                                                  01165000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01166000
@NM00005 EQU   ZZ1+84                                                   01167000
ZZ1PLINE EQU   ZZ1+80                                                   01168000
ZZ1PGSZ  EQU   ZZ1+76                                                   01169000
ZZ1PCNT  EQU   ZZ1+72                                                   01170000
@NM00004 EQU   ZZ1+68                                                   01171000
ZZ1TPAGE EQU   ZZ1+64                                                   01172000
ZZ1TLINE EQU   ZZ1+60                                                   01173000
@NM00003 EQU   ZZ1+52                                                   01174000
ZZ1DMCBP EQU   ZZ1+48                                                   01175000
ZZ1DSDP  EQU   ZZ1+44                                                   01176000
ZZ1PDRP  EQU   ZZ1+40                                                   01177000
ZZ1327WP EQU   ZZ1+32                                                   01178000
ZZ1ACBP  EQU   ZZ1+28                                                   01179000
@NM00002 EQU   ZZ1+24                                                   01180000
ZZ1PDCBP EQU   ZZ1+20                                                   01181000
ZZ1BLRBL EQU   ZZ1+16                                                   01182000
@NM00001 EQU   ZZ1+12                                                   01183000
ZZ1PNULL EQU   ZZ1+8                                                    01184000
ZZ1NULL  EQU   ZZ1+4                                                    01185000
@NM00092 EQU   PSA+3668                                                 01186000
PSASTAK  EQU   PSA+3072                                                 01187000
@NM00091 EQU   PSA+1048                                                 01188000
PSAUSEND EQU   PSA+1048                                                 01189000
PSARV062 EQU   PSA+1044                                                 01190000
PSACDAL  EQU   PSA+1040                                                 01191000
PSAWTCOD EQU   PSA+1036                                                 01192000
PSAATCVT EQU   PSA+1032                                                 01193000
PSAPCPSW EQU   PSA+1024                                                 01194000
PSAPIR2  EQU   PSA+1020                                                 01195000
PSARV059 EQU   PSA+1018                                                 01196000
PSASVC13 EQU   PSA+1016                                                 01197000
PSALSFCC EQU   PSA+1012                                                 01198000
PSASFACC EQU   PSA+1008                                                 01199000
PSASTOP  EQU   PSA+992                                                  01200000
PSASTART EQU   PSA+976                                                  01201000
PSARSPSW EQU   PSA+968                                                  01202000
PSASRPSW EQU   PSA+960                                                  01203000
PSARV045 EQU   PSA+892                                                  01204000
PSARV044 EQU   PSA+888                                                  01205000
PSARV043 EQU   PSA+884                                                  01206000
PSARV042 EQU   PSA+880                                                  01207000
PSARV041 EQU   PSA+876                                                  01208000
PSARV040 EQU   PSA+872                                                  01209000
PSARV025 EQU   PSA+868                                                  01210000
PSADSSED EQU   PSA+868                                                  01211000
PSADSSPR EQU   PSA+864                                                  01212000
PSADSSFW EQU   PSA+860                                                  01213000
PSADSS14 EQU   PSA+856                                                  01214000
PSADSSPP EQU   PSA+848                                                  01215000
PSADSSRP EQU   PSA+840                                                  01216000
PSADSS05 EQU   PSADSSF4                                                 01217000
PSADSS10 EQU   PSADSSF4                                                 01218000
PSADSSVE EQU   PSADSSF4                                                 01219000
PSADSSDE EQU   PSADSSF4                                                 01220000
PSADSSC0 EQU   PSADSSF4                                                 01221000
PSADSSIE EQU   PSADSSF4                                                 01222000
PSADSS12 EQU   PSADSSF4                                                 01223000
PSADSSRC EQU   PSADSSF4                                                 01224000
PSARV057 EQU   PSADSSF3                                                 01225000
PSARV056 EQU   PSADSSF3                                                 01226000
PSARV055 EQU   PSADSSF3                                                 01227000
PSADSSMC EQU   PSADSSF3                                                 01228000
PSADSSRW EQU   PSADSSF3                                                 01229000
PSADSSNM EQU   PSADSSF3                                                 01230000
PSADSSES EQU   PSADSSF3                                                 01231000
PSADSSGP EQU   PSADSSF3                                                 01232000
PSADSSF2 EQU   PSADSSFL+1                                               01233000
PSADSSPI EQU   PSADSSF1                                                 01234000
PSADSSOI EQU   PSADSSF1                                                 01235000
PSADSSSP EQU   PSADSSF1                                                 01236000
PSADSSTP EQU   PSADSSF1                                                 01237000
PSADSSDW EQU   PSADSSF1                                                 01238000
PSADSSDD EQU   PSADSSF1                                                 01239000
PSADSSDM EQU   PSADSSF1                                                 01240000
PSADSSMV EQU   PSADSSF1                                                 01241000
PSADSSTS EQU   PSA+816                                                  01242000
PSADSSWK EQU   PSA+812                                                  01243000
PSADSSR3 EQU   PSA+808                                                  01244000
PSADSSR2 EQU   PSA+804                                                  01245000
PSADSSRS EQU   PSA+800                                                  01246000
PSASTOR  EQU   PSA+796                                                  01247000
PSACPUSA EQU   PSA+794                                                  01248000
PSAVSTAP EQU   PSA+792                                                  01249000
PSAWKVAP EQU   PSA+788                                                  01250000
PSAWKRAP EQU   PSA+784                                                  01251000
PSAMCHIC EQU   PSA+783                                                  01252000
PSARV061 EQU   PSA+782                                                  01253000
PSASYMSK EQU   PSA+781                                                  01254000
PSAMCHFL EQU   PSA+780                                                  01255000
PSACR0   EQU   PSA+776                                                  01256000
PSAPSWSV EQU   PSA+768                                                  01257000
PSALITA  EQU   PSA+764                                                  01258000
PSACLHS  EQU   PSAHLHI                                                  01259000
PSALKR15 EQU   PSALKSA+60                                               01260000
PSALKR14 EQU   PSALKSA+56                                               01261000
PSALKR13 EQU   PSALKSA+52                                               01262000
PSALKR12 EQU   PSALKSA+48                                               01263000
PSALKR11 EQU   PSALKSA+44                                               01264000
PSALKR10 EQU   PSALKSA+40                                               01265000
PSALKR9  EQU   PSALKSA+36                                               01266000
PSALKR8  EQU   PSALKSA+32                                               01267000
PSALKR7  EQU   PSALKSA+28                                               01268000
PSALKR6  EQU   PSALKSA+24                                               01269000
PSALKR5  EQU   PSALKSA+20                                               01270000
PSALKR4  EQU   PSALKSA+16                                               01271000
PSALKR3  EQU   PSALKSA+12                                               01272000
PSALKR2  EQU   PSALKSA+8                                                01273000
PSALKR1  EQU   PSALKSA+4                                                01274000
PSALKR0  EQU   PSALKSA                                                  01275000
PSARV023 EQU   PSACLHT+52                                               01276000
PSALOCAL EQU   PSACLHT+48                                               01277000
PSACMSL  EQU   PSACLHT+44                                               01278000
PSAOPTL  EQU   PSACLHT+40                                               01279000
PSATPACL EQU   PSACLHT+36                                               01280000
PSATPDNL EQU   PSACLHT+32                                               01281000
PSATPNCL EQU   PSACLHT+28                                               01282000
PSAIOSLL EQU   PSACLHT+24                                               01283000
PSAIOSUL EQU   PSACLHT+20                                               01284000
PSAIOSCL EQU   PSACLHT+16                                               01285000
PSAIOSSL EQU   PSACLHT+12                                               01286000
PSASALCL EQU   PSACLHT+8                                                01287000
PSAASML  EQU   PSACLHT+4                                                01288000
PSADISPL EQU   PSACLHT                                                  01289000
PSASRSA  EQU   PSA+636                                                  01290000
PSARV050 EQU   PSA+634                                                  01291000
PSADSSGO EQU   PSA+633                                                  01292000
PSARECUR EQU   PSA+632                                                  01293000
PSAHLHIS EQU   PSA+628                                                  01294000
PSAIPCSA EQU   PSA+624                                                  01295000
@NM00090 EQU   PSA+621                                                  01296000
PSAIPCDM EQU   PSA+620                                                  01297000
PSAIPCD  EQU   PSA+616                                                  01298000
@NM00089 EQU   PSA+613                                                  01299000
PSAIPCRM EQU   PSA+612                                                  01300000
PSAIPCR  EQU   PSA+608                                                  01301000
PSAMCHEX EQU   PSA+600                                                  01302000
PSAMPSW  EQU   PSA+592                                                  01303000
PSAEXPS2 EQU   PSA+584                                                  01304000
PSAEXPS1 EQU   PSA+576                                                  01305000
PSAPIREG EQU   PSA+572                                                  01306000
PSARSREG EQU   PSA+568                                                  01307000
PSAGPREG EQU   PSA+556                                                  01308000
PSARV022 EQU   PSASUP4                                                  01309000
PSARV021 EQU   PSASUP4                                                  01310000
PSARV020 EQU   PSASUP4                                                  01311000
PSARV019 EQU   PSASUP4                                                  01312000
PSARV018 EQU   PSASUP4                                                  01313000
PSARV017 EQU   PSASUP4                                                  01314000
PSARV016 EQU   PSASUP4                                                  01315000
PSARV015 EQU   PSASUP4                                                  01316000
PSARV014 EQU   PSASUP3                                                  01317000
PSARV013 EQU   PSASUP3                                                  01318000
PSARV012 EQU   PSASUP3                                                  01319000
PSAESTA  EQU   PSASUP3                                                  01320000
PSASPR   EQU   PSASUP3                                                  01321000
PSAPSREG EQU   PSASUP3                                                  01322000
PSAPI2   EQU   PSASUP3                                                  01323000
PSAIOSUP EQU   PSASUP3                                                  01324000
PSALCR   EQU   PSASUP2                                                  01325000
PSARTM   EQU   PSASUP2                                                  01326000
PSAACR   EQU   PSASUP2                                                  01327000
PSAIPCE2 EQU   PSASUP2                                                  01328000
PSAIPCES EQU   PSASUP2                                                  01329000
PSAIPCEC EQU   PSASUP2                                                  01330000
PSAGTF   EQU   PSASUP2                                                  01331000
PSAIPCRI EQU   PSASUP2                                                  01332000
PSATYPE6 EQU   PSASUP1                                                  01333000
PSATCTL  EQU   PSASUP1                                                  01334000
PSADISP  EQU   PSASUP1                                                  01335000
PSALOCK  EQU   PSASUP1                                                  01336000
PSAPI    EQU   PSASUP1                                                  01337000
PSAEXT   EQU   PSASUP1                                                  01338000
PSASVC   EQU   PSASUP1                                                  01339000
PSAIO    EQU   PSASUP1                                                  01340000
PSAAOLD  EQU   PSA+548                                                  01341000
PSAANEW  EQU   PSA+544                                                  01342000
PSATNEW  EQU   PSA+536                                                  01343000
PSALCCAR EQU   PSA+532                                                  01344000
PSALCCAV EQU   PSA+528                                                  01345000
PSAPCCAR EQU   PSA+524                                                  01346000
PSAPCCAV EQU   PSA+520                                                  01347000
PSACPULA EQU   PSA+518                                                  01348000
PSACPUPA EQU   PSA+516                                                  01349000
PSAPSA   EQU   PSA+512                                                  01350000
FLCHDEND EQU   PSA+512                                                  01351000
FLCCRSAV EQU   FLCMCLA+280                                              01352000
FLCGRSAV EQU   FLCMCLA+216                                              01353000
FLCFPSAV EQU   FLCMCLA+184                                              01354000
FLCFLA   EQU   FLCMCLA+88                                               01355000
FLCRGNCD EQU   FLCMCLA+84                                               01356000
FLCFSAA  EQU   FLCFSA+1                                                 01357000
@NM00088 EQU   FLCFSA                                                   01358000
@NM00087 EQU   FLCMCLA+72                                               01359000
FLCMCIC  EQU   FLCMCLA+64                                               01360000
@NM00086 EQU   FLCMCLA+20                                               01361000
FLCIOAA  EQU   FLCIOA+1                                                 01362000
@NM00085 EQU   FLCIOA                                                   01363000
@NM00084 EQU   FLCMCLA+15                                               01364000
@NM00083 EQU   FLCMCLA+14                                               01365000
@NM00082 EQU   FLCMCLA+12                                               01366000
FLCLCL   EQU   FLCMCLA+8                                                01367000
FLCIOELA EQU   FLCIOEL+1                                                01368000
@NM00081 EQU   FLCIOEL                                                  01369000
FLCCHNID EQU   FLCMCLA                                                  01370000
@NM00080 EQU   PSA+160                                                  01371000
FLCMTRCD EQU   PSA+157                                                  01372000
@NM00079 EQU   PSA+156                                                  01373000
FLCPERA  EQU   FLCPER+1                                                 01374000
@NM00078 EQU   FLCPER                                                   01375000
@NM00077 EQU   PSA+151                                                  01376000
FLCPERCD EQU   PSA+150                                                  01377000
FLCMCNUM EQU   PSA+149                                                  01378000
@NM00076 EQU   PSA+148                                                  01379000
FLCTEAA  EQU   FLCTEA+1                                                 01380000
@NM00075 EQU   FLCTEA                                                   01381000
PSAPIPC  EQU   PSAPICOD                                                 01382000
PSAPIMC  EQU   PSAPICOD                                                 01383000
PSAPIPER EQU   PSAPICOD                                                 01384000
PSARV049 EQU   FLCPICOD                                                 01385000
FLCPILCB EQU   FLCPIILC                                                 01386000
@NM00074 EQU   FLCPIILC                                                 01387000
@NM00073 EQU   PSAEPPSW                                                 01388000
FLCSVCN  EQU   PSAESPSW+2                                               01389000
FLCSILCB EQU   FLCSVILC                                                 01390000
@NM00072 EQU   FLCSVILC                                                 01391000
@NM00071 EQU   PSAESPSW                                                 01392000
FLCEICOD EQU   PSAEEPSW+2                                               01393000
PSASPAD  EQU   PSAEEPSW                                                 01394000
@NM00070 EQU   PSA+128                                                  01395000
FLCINPSW EQU   PSA+120                                                  01396000
FLCMNPSW EQU   PSA+112                                                  01397000
FLCPNPSW EQU   PSA+104                                                  01398000
FLCSNPSW EQU   PSA+96                                                   01399000
FLCENPSW EQU   PSA+88                                                   01400000
FLCTRACE EQU   PSA+84                                                   01401000
FLCTIMER EQU   PSA+80                                                   01402000
FLCCVT2  EQU   PSA+76                                                   01403000
FLCCAW   EQU   PSA+72                                                   01404000
FLCCSW   EQU   PSA+64                                                   01405000
FLCIOPSW EQU   PSA+56                                                   01406000
FLCMOPSW EQU   PSA+48                                                   01407000
FLCPOPSW EQU   PSA+40                                                   01408000
FLCSOPSW EQU   PSA+32                                                   01409000
FLCEOPSW EQU   PSA+24                                                   01410000
@NM00069 EQU   FLCICCW2+4                                               01411000
FLCCVT   EQU   FLCICCW2                                                 01412000
FLCICCW1 EQU   FLCROPSW                                                 01413000
FLCIPPSW EQU   FLCRNPSW                                                 01414000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01415000
@ENDDATA EQU   *                                                        01416000
         END   BLSCRTCB,(C'PLS2149',0701,78065)                         01417000
