         TITLE 'IPCS DELDSN AND DELPROB SUBCOMMANDS - MODULE BLSELPFR  *00001000
                        '                                               00002000
* THIS MODULE WRITTEN FOR @G57LPAF.                                     00003000
BLSELPFR CSECT ,                                                   0002 00004000
@MAINENT DS    0H                                                  0002 00005000
         USING *,@15                                               0002 00006000
         B     @PROLOG                                             0002 00007000
         DC    AL1(16)                                             0002 00008000
         DC    C'BLSELPFR  78.068'                                 0002 00009000
         DROP  @15                                                      00010000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00011000
         BALR  @12,0                                               0002 00012000
@PSTART  DS    0H                                                  0002 00013000
         USING @PSTART,@12                                         0002 00014000
         L     @00,@SIZDATD                                        0002 00015000
         BLSUALLS R,LV=(0)                                              00016000
         LR    @11,@01                                             0002 00017000
         USING @DATD,@11                                           0002 00018000
         ST    @13,@SA00001+4                                      0002 00019000
         LM    @00,@01,20(@13)                                     0002 00020000
         ST    @11,8(,@13)                                         0002 00021000
         LR    @13,@11                                             0002 00022000
         MVC   @PC00001(12),0(@01)                                 0002 00023000
*                                      BLSDMSG                       */ 00024000
*                                                                  0122 00025000
*   /*****************************************************************/ 00026000
*   /*                                                               */ 00027000
*   /* START OF EXECUTABLE CODE                                      */ 00028000
*   /*                                                               */ 00029000
*   /*****************************************************************/ 00030000
*                                                                  0123 00031000
*   ZZ2PTR=ADDR(ZZ2PARM);           /* INITIALIZE ZZ2 POINTER        */ 00032000
         L     ZZ2PTR,@PC00001                                     0123 00033000
*   RETC=ZERO;                      /* INITIALIZE THE RETURN         */ 00034000
         SLR   RETC,RETC                                           0124 00035000
*   RETCDE=ZERO;                    /* CODES                         */ 00036000
         SLR   RETCDE,RETCDE                                       0125 00037000
*   DSRPTR=ZERO;                    /* CLEAR POINTER TO CHAIN        */ 00038000
         L     @14,@PC00001+8                                      0126 00039000
         SLR   @04,@04                                             0126 00040000
         ST    @04,DSRPTR(,@14)                                    0126 00041000
*   BUFPTR=ADDR(BUFFER);            /* SET POINTER TO BUFFER         */ 00042000
         LA    BUFPTR,BUFFER                                       0127 00043000
*   DSRECLN=LENGTH(ALELEM);         /* SET LENGTH OF ELEMENT         */ 00044000
         MVC   DSRECLN(4),@CF01088                                 0128 00045000
*   RECTYPE=PDRDSNC;                /* SET RECORD TYPE TO DATA SET   */ 00046000
         MVC   RECTYPE(2),@CC00983                                 0129 00047000
*   RECPID=PROBID;                  /* SET PROBLEM ID INTO KEY       */ 00048000
         L     @14,@PC00001+4                                      0130 00049000
         MVC   RECPID(8),PROBID(@14)                               0130 00050000
*   ENDFLAG=OFF;                    /* SET END FLAG OFF              */ 00051000
         SLR   ENDFLAG,ENDFLAG                                     0131 00052000
*   DSCOUNT=ZERO;                   /* CLEAR DATA SET COUNT          */ 00053000
         SLR   DSCOUNT,DSCOUNT                                     0132 00054000
*   CURPTR=ZERO;                    /* CLEAR CURRENT POINTER         */ 00055000
*                                                                  0133 00056000
         SLR   CURPTR,CURPTR                                       0133 00057000
*   /*****************************************************************/ 00058000
*   /*                                                               */ 00059000
*   /* POSITION THE PDR AT FIRST DATASET RECORD BLSPNT (ZZ1PDRP)     */ 00060000
*   /* AREAL(BUFPTR)AREALEN(LENGTH(BUFFER))GENEQ                     */ 00061000
*   /* ARG(SRCHKEY)ARGLEN(LENGTH(SRCHKEY))                           */ 00062000
*   /*                                                               */ 00063000
*   /*****************************************************************/ 00064000
*                                                                  0134 00065000
*   DO;                             /* BLSPNT (ZZ1PDRP) AREAL(BUFPTR)   00066000
*                                      AREALEN(LENGTH(BUFFER))GENEQ A   00067000
*                                      RG(SRCHKEY)ARGLEN(LENGTH(SRCHK   00068000
*                                      EY))                          */ 00069000
*     RFY                                                          0135 00070000
*       GPR01P RSTD;                                               0135 00071000
*     GPR01P=ZZ1PDRP;               /* ADDRESS DMCB                  */ 00072000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0136 00073000
         L     GPR01P,ZZ1PDRP(,@14)                                0136 00074000
*     RFY                                                          0137 00075000
*       DMCB BASED(GPR01P);                                        0137 00076000
*     IF((GPR01P&'FFFFFFF8'X)=GPR01P)&DMCBID='DMCB'/* VALID DMCB ?   */ 00077000
*       THEN                                                       0138 00078000
         LR    @14,GPR01P                                          0138 00079000
         N     @14,@CF01066                                        0138 00080000
         CLR   @14,GPR01P                                          0138 00081000
         BNE   @RF00138                                            0138 00082000
         CLC   DMCBID(4,GPR01P),@CC01067                           0138 00083000
         BNE   @RF00138                                            0138 00084000
*       DO;                                                        0139 00085000
*         DMCBBUFP=BUFPTR&'7FFFFFFF'X;/* PLACE BUFFER ADDRESS IN DMCB*/ 00086000
         LR    @14,BUFPTR                                          0140 00087000
         N     @14,@CF01068                                        0140 00088000
         ST    @14,DMCBBUFP(,GPR01P)                               0140 00089000
*         DMCBBLEN=LENGTH(BUFFER)&'7FFFFFFF'X;/* PLACE BUFFER LENGTH    00090000
*                                      IN DMCB                       */ 00091000
         MVC   DMCBBLEN(4,GPR01P),@CF01089                         0141 00092000
*         DMCBKEYP=ADDR(SRCHKEY);   /* PLACE KEY ADDRESS IN DMCB     */ 00093000
         LA    @14,SRCHKEY                                         0142 00094000
         ST    @14,DMCBKEYP(,GPR01P)                               0142 00095000
*         DMCBKEYL=(LENGTH(SRCHKEY))&'7FFFFFFF'X;/* PLACE KEY LENGTH    00096000
*                                      IN DMCB                       */ 00097000
         MVC   DMCBKEYL(4,GPR01P),@CF00627                         0143 00098000
*         DMCBKYD='1'B;             /* INDICATE KEYED ACCESS         */ 00099000
*         DMCBGKY='1'B;             /* INDICATE GENERIC KEY          */ 00100000
*         DMCBAPX='0'B;             /* INDICATE EXACT KEY MATCH      */ 00101000
*         DMCBLRD='0'B;             /* LET ARG DETERMINE POSITION    */ 00102000
         OI    DMCBKYD(GPR01P),B'11000000'                         0147 00103000
         NI    DMCBAPX(GPR01P),B'11011011'                         0147 00104000
*         DMCBRQST=DMCBPOR;         /* INDICATE POINT REQUEST        */ 00105000
         MVI   DMCBRQST(GPR01P),X'08'                              0148 00106000
*         CALL DMCBRI->DMCBDMGR;    /* CALL BLSCRQST                 */ 00107000
         L     @15,DMCBRI(,GPR01P)                                 0149 00108000
         BALR  @14,@15                                             0149 00109000
*       END;                                                       0150 00110000
*     ELSE                                                         0151 00111000
*       DO;                                                        0151 00112000
         B     @RC00138                                            0151 00113000
@RF00138 DS    0H                                                  0152 00114000
*         RFY                                                      0152 00115000
*          (GPR00F,                                                0152 00116000
*           GPR15F) RSTD;                                          0152 00117000
*         GPR00F=0;                 /* INDICATE NO MESSAGE CHAIN     */ 00118000
         SLR   GPR00F,GPR00F                                       0153 00119000
*         GPR15F=16;                /* INDICATE INVALID DMCB         */ 00120000
         LA    GPR15F,16                                           0154 00121000
*         RFY                                                      0155 00122000
*          (GPR00F,                                                0155 00123000
*           GPR15F);                                               0155 00124000
*       END;                                                       0156 00125000
*     RFY                                                          0157 00126000
*       DMCB;                                                      0157 00127000
@RC00138 DS    0H                                                  0158 00128000
*     RFY                                                          0158 00129000
*       GPR01P;                                                    0158 00130000
*   END;                            /* BLSPNT (ZZ1PDRP) AREAL(BUFPTR)   00131000
*                                      AREALEN(LENGTH(BUFFER))GENEQ A   00132000
*                                      RG(SRCHKEY)ARGLEN(LENGTH(SRCHK   00133000
*                                      EY)) POINT TO FIRST RECORD    */ 00134000
*   IF RETCDE=ZZZFLAGE THEN                                        0160 00135000
         C     RETCDE,@CF00054                                     0160 00136000
         BNE   @RF00160                                            0160 00137000
*     DO;                                                          0161 00138000
*       DO;                         /* BLSDMSG                     0162 00139000
*                                      (ZZ2,NOMSG,DMCBMSG,BLSDMSGS)  */ 00140000
*         CALL BLSDMSG0(ZZ2,NOMSG,DMCBMSG,BLSDMSGS,'00000000'B,0);/*    00141000
*                                      BUILD MESSAGE                 */ 00142000
         ST    ZZ2PTR,@AL00001                                     0163 00143000
         LA    @14,@CF01062                                        0163 00144000
         ST    @14,@AL00001+4                                      0163 00145000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0163 00146000
         L     @14,ZZ1PDRP(,@14)                                   0163 00147000
         LA    @14,DMCBMSG(,@14)                                   0163 00148000
         ST    @14,@AL00001+8                                      0163 00149000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                               0163 00150000
         ST    @14,@AL00001+12                                     0163 00151000
         LA    @14,@CB01071                                        0163 00152000
         ST    @14,@AL00001+16                                     0163 00153000
         LA    @14,@CF00051                                        0163 00154000
         ST    @14,@AL00001+20                                     0163 00155000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                               0163 00156000
         LA    @01,@AL00001                                        0163 00157000
         BALR  @14,@15                                             0163 00158000
*       END;                        /* BLSDMSG                     0164 00159000
*                                      (ZZ2,NOMSG,DMCBMSG,BLSDMSGS)     00160000
*                                      PURGE MESSAGE CHAIN           */ 00161000
*       RETC=ZZZFLAGW;                                             0165 00162000
         LA    RETC,4                                              0165 00163000
*     END;                                                         0166 00164000
*   ELSE                                                           0167 00165000
*     IF RETCDE^=ZZZFLAGI THEN                                     0167 00166000
         B     @RC00160                                            0167 00167000
@RF00160 SLR   @14,@14                                             0167 00168000
         CR    RETCDE,@14                                          0167 00169000
         BE    @RF00167                                            0167 00170000
*       DO;                                                        0168 00171000
*         IF RETCDE=ZZZFLAGT THEN                                  0169 00172000
         C     RETCDE,@CF00057                                     0169 00173000
         BNE   @RF00169                                            0169 00174000
*           MSGPTR=NULLPTR;                                        0170 00175000
         ST    @14,MSGPTR                                          0170 00176000
*         ELSE                                                     0171 00177000
*           DO;                                                    0171 00178000
         B     @RC00169                                            0171 00179000
@RF00169 DS    0H                                                  0172 00180000
*             MSGPTR=DMCBMSG;                                      0172 00181000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0172 00182000
         L     @14,ZZ1PDRP(,@14)                                   0172 00183000
         L     @04,DMCBMSG(,@14)                                   0172 00184000
         ST    @04,MSGPTR                                          0172 00185000
*             DMCBMSG=NULLPTR;                                     0173 00186000
         SLR   @04,@04                                             0173 00187000
         ST    @04,DMCBMSG(,@14)                                   0173 00188000
*           END;                                                   0174 00189000
*         DO;                       /* BLSDMSG                     0175 00190000
*                                      (ZZ2,4043,MSGPTR,BLSDMSGS)  0175 00191000
*                                      LIFO ROUTE(TERM)              */ 00192000
@RC00169 DS    0H                                                  0176 00193000
*           CALL BLSDMSG0(ZZ2,4043,MSGPTR,BLSDMSGS,'10010000'B,0);/*    00194000
*                                      BUILD MESSAGE                 */ 00195000
         ST    ZZ2PTR,@AL00001                                     0176 00196000
         LA    @14,@CF01072                                        0176 00197000
         ST    @14,@AL00001+4                                      0176 00198000
         LA    @14,MSGPTR                                          0176 00199000
         ST    @14,@AL00001+8                                      0176 00200000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                               0176 00201000
         ST    @14,@AL00001+12                                     0176 00202000
         LA    @14,@CB01073                                        0176 00203000
         ST    @14,@AL00001+16                                     0176 00204000
         LA    @14,@CF00051                                        0176 00205000
         ST    @14,@AL00001+20                                     0176 00206000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                               0176 00207000
         LA    @01,@AL00001                                        0176 00208000
         BALR  @14,@15                                             0176 00209000
*         END;                      /* BLSDMSG                     0177 00210000
*                                      (ZZ2,4043,MSGPTR,BLSDMSGS)  0177 00211000
*                                      LIFO ROUTE(TERM)              */ 00212000
*         DO;                       /* ABEND(ACODE2) DUMP USER       */ 00213000
*           RESPECIFY                                              0179 00214000
*            (GPR01F) RESTRICTED;                                  0179 00215000
*           GPR01F=(ACODE2)&'00000FFF'X;/* COMP CODE IN BITS 20-31   */ 00216000
         LA    GPR01F,123                                          0180 00217000
*           GPR01F=GPR01F|'80000000'X;/* DUMP/STEP/DUMPOPTS FLAG     */ 00218000
         O     GPR01F,@CF00066                                     0181 00219000
*           SVC(13);                /* ISSUE ABEND SVC               */ 00220000
         SVC   13                                                  0182 00221000
*           RESPECIFY                                              0183 00222000
*            (GPR01F) UNRESTRICTED;                                0183 00223000
*         END;                      /* ABEND(ACODE2) DUMP USER       */ 00224000
*       END;                                                       0185 00225000
*     ELSE                                                         0186 00226000
*                                                                  0186 00227000
*       /*************************************************************/ 00228000
*       /*                                                           */ 00229000
*       /* BUILD LIST ELEMENT FOR EACH ASSOCIATION RECORD            */ 00230000
*       /*                                                           */ 00231000
*       /*************************************************************/ 00232000
*                                                                  0186 00233000
*       DO WHILE(ENDFLAG=OFF);      /* READ DATA SET RECORDS         */ 00234000
         B     @RC00167                                            0186 00235000
@RF00167 B     @DE00186                                            0186 00236000
@DL00186 DS    0H                                                  0187 00237000
*         RESPECIFY                                                0187 00238000
*           ALELEM BASED(CURPTR);                                  0187 00239000
*                                                                  0187 00240000
*         /***********************************************************/ 00241000
*         /*                                                         */ 00242000
*         /* GET NEXT ASSOCIATION BLSGET (ZZ1PDRP) SEQ               */ 00243000
*         /*                                                         */ 00244000
*         /***********************************************************/ 00245000
*                                                                  0188 00246000
*         DO;                       /* BLSGET (ZZ1PDRP) SEQ          */ 00247000
*           RFY                                                    0189 00248000
*             GPR01P RSTD;                                         0189 00249000
*           GPR01P=ZZ1PDRP;         /* ADDRESS DMCB                  */ 00250000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0190 00251000
         L     GPR01P,ZZ1PDRP(,@14)                                0190 00252000
*           RFY                                                    0191 00253000
*             DMCB BASED(GPR01P);                                  0191 00254000
*           IF((GPR01P&'FFFFFFF8'X)=GPR01P)&DMCBID='DMCB'/* VALID  0192 00255000
*                                      DMCB ?                        */ 00256000
*             THEN                                                 0192 00257000
         LR    @14,GPR01P                                          0192 00258000
         N     @14,@CF01066                                        0192 00259000
         CLR   @14,GPR01P                                          0192 00260000
         BNE   @RF00192                                            0192 00261000
         CLC   DMCBID(4,GPR01P),@CC01067                           0192 00262000
         BNE   @RF00192                                            0192 00263000
*             DO;                                                  0193 00264000
*               DMCBKYD='0'B;       /* INDICATE UNKEYED ACCESS       */ 00265000
*               DMCBRNO='0'B;       /* INDICATE SEQUENTIAL           */ 00266000
*               DMCBAPX='0'B;       /* RESET APPROX BIT              */ 00267000
*               DMCBUPD='0'B;       /* DEFAULT FOR GET IS NUP        */ 00268000
         NI    DMCBKYD(GPR01P),B'00001111'                         0197 00269000
*               DMCBRQST=DMCBGER;   /* INDICATE GET REQUEST          */ 00270000
         MVI   DMCBRQST(GPR01P),X'04'                              0198 00271000
*               CALL DMCBRI->DMCBDMGR;/* CALL BLSCRQST               */ 00272000
         L     @15,DMCBRI(,GPR01P)                                 0199 00273000
         BALR  @14,@15                                             0199 00274000
*             END;                                                 0200 00275000
*           ELSE                                                   0201 00276000
*             DO;                                                  0201 00277000
         B     @RC00192                                            0201 00278000
@RF00192 DS    0H                                                  0202 00279000
*               RFY                                                0202 00280000
*                (GPR00F,                                          0202 00281000
*                 GPR15F) RSTD;                                    0202 00282000
*               GPR00F=0;           /* INDICATE NO MESSAGE CHAIN     */ 00283000
         SLR   GPR00F,GPR00F                                       0203 00284000
*               GPR15F=16;          /* INDICATE INVALID DMCB         */ 00285000
         LA    GPR15F,16                                           0204 00286000
*               RFY                                                0205 00287000
*                (GPR00F,                                          0205 00288000
*                 GPR15F);                                         0205 00289000
*             END;                                                 0206 00290000
*           RFY                                                    0207 00291000
*             DMCB;                                                0207 00292000
@RC00192 DS    0H                                                  0208 00293000
*           RFY                                                    0208 00294000
*             GPR01P;                                              0208 00295000
*         END;                      /* BLSGET (ZZ1PDRP) SEQ          */ 00296000
*         IF RETCDE=ZZZFLAGE THEN                                  0210 00297000
         C     RETCDE,@CF00054                                     0210 00298000
         BNE   @RF00210                                            0210 00299000
*           DO;                                                    0211 00300000
*             DO;                   /* BLSDMSG                     0212 00301000
*                                      (ZZ2,NOMSG,DMCBMSG,BLSDMSGS)  */ 00302000
*               CALL BLSDMSG0(ZZ2,NOMSG,DMCBMSG,BLSDMSGS,'00000000'B,0) 00303000
*                   ;               /* BUILD MESSAGE                 */ 00304000
         ST    ZZ2PTR,@AL00001                                     0213 00305000
         LA    @14,@CF01062                                        0213 00306000
         ST    @14,@AL00001+4                                      0213 00307000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0213 00308000
         L     @14,ZZ1PDRP(,@14)                                   0213 00309000
         LA    @14,DMCBMSG(,@14)                                   0213 00310000
         ST    @14,@AL00001+8                                      0213 00311000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                               0213 00312000
         ST    @14,@AL00001+12                                     0213 00313000
         LA    @14,@CB01071                                        0213 00314000
         ST    @14,@AL00001+16                                     0213 00315000
         LA    @14,@CF00051                                        0213 00316000
         ST    @14,@AL00001+20                                     0213 00317000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                               0213 00318000
         LA    @01,@AL00001                                        0213 00319000
         BALR  @14,@15                                             0213 00320000
*             END;                  /* BLSDMSG                     0214 00321000
*                                      (ZZ2,NOMSG,DMCBMSG,BLSDMSGS)     00322000
*                                      PURGE MESSAGES                */ 00323000
*             ENDFLAG=ON;                                          0215 00324000
         LA    ENDFLAG,1                                           0215 00325000
*           END;                                                   0216 00326000
*         ELSE                                                     0217 00327000
*           IF RETCDE^=ZZZFLAGI THEN                               0217 00328000
         B     @RC00210                                            0217 00329000
@RF00210 SLR   @14,@14                                             0217 00330000
         CR    RETCDE,@14                                          0217 00331000
         BE    @RF00217                                            0217 00332000
*             DO;                                                  0218 00333000
*               IF RETCDE=ZZZFLAGT THEN                            0219 00334000
         C     RETCDE,@CF00057                                     0219 00335000
         BNE   @RF00219                                            0219 00336000
*                 MSGPTR=NULLPTR;                                  0220 00337000
         ST    @14,MSGPTR                                          0220 00338000
*               ELSE                                               0221 00339000
*                 DO;                                              0221 00340000
         B     @RC00219                                            0221 00341000
@RF00219 DS    0H                                                  0222 00342000
*                   MSGPTR=DMCBMSG;                                0222 00343000
         L     @14,ZZ2ZZ1P(,ZZ2PTR)                                0222 00344000
         L     @14,ZZ1PDRP(,@14)                                   0222 00345000
         L     @04,DMCBMSG(,@14)                                   0222 00346000
         ST    @04,MSGPTR                                          0222 00347000
*                   DMCBMSG=NULLPTR;                               0223 00348000
         SLR   @04,@04                                             0223 00349000
         ST    @04,DMCBMSG(,@14)                                   0223 00350000
*                 END;                                             0224 00351000
*               DO;                 /* BLSDMSG                     0225 00352000
*                                      (ZZ2,4043,MSGPTR,BLSDMSGS)  0225 00353000
*                                      LIFO ROUTE(TERM)              */ 00354000
@RC00219 DS    0H                                                  0226 00355000
*                 CALL BLSDMSG0(ZZ2,4043,MSGPTR,BLSDMSGS,'10010000'B,0) 00356000
*                     ;             /* BUILD MESSAGE                 */ 00357000
         ST    ZZ2PTR,@AL00001                                     0226 00358000
         LA    @14,@CF01072                                        0226 00359000
         ST    @14,@AL00001+4                                      0226 00360000
         LA    @14,MSGPTR                                          0226 00361000
         ST    @14,@AL00001+8                                      0226 00362000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                               0226 00363000
         ST    @14,@AL00001+12                                     0226 00364000
         LA    @14,@CB01073                                        0226 00365000
         ST    @14,@AL00001+16                                     0226 00366000
         LA    @14,@CF00051                                        0226 00367000
         ST    @14,@AL00001+20                                     0226 00368000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                               0226 00369000
         LA    @01,@AL00001                                        0226 00370000
         BALR  @14,@15                                             0226 00371000
*               END;                /* BLSDMSG                     0227 00372000
*                                      (ZZ2,4043,MSGPTR,BLSDMSGS)  0227 00373000
*                                      LIFO ROUTE(TERM)              */ 00374000
*               DO;                 /* ABEND(ACODE2) DUMP USER       */ 00375000
*                 RESPECIFY                                        0229 00376000
*                  (GPR01F) RESTRICTED;                            0229 00377000
*                 GPR01F=(ACODE2)&'00000FFF'X;/* COMP CODE IN BITS 0230 00378000
*                                      20-31                         */ 00379000
         LA    GPR01F,123                                          0230 00380000
*                 GPR01F=GPR01F|'80000000'X;/* DUMP/STEP/DUMPOPTS  0231 00381000
*                                      FLAG                          */ 00382000
         O     GPR01F,@CF00066                                     0231 00383000
*                 SVC(13);          /* ISSUE ABEND SVC               */ 00384000
         SVC   13                                                  0232 00385000
*                 RESPECIFY                                        0233 00386000
*                  (GPR01F) UNRESTRICTED;                          0233 00387000
*               END;                /* ABEND(ACODE2) DUMP USER       */ 00388000
*             END;                                                 0235 00389000
*           ELSE                                                   0236 00390000
*             IF(PDRKPID^=PROBID|PDRKRCTY^=PDRDSNC) THEN           0236 00391000
         B     @RC00217                                            0236 00392000
@RF00217 L     @14,@PC00001+4                                      0236 00393000
         CLC   PDRKPID(8,BUFPTR),PROBID(@14)                       0236 00394000
         BNE   @RT00236                                            0236 00395000
         CLC   PDRKRCTY(2,BUFPTR),@CC00983                         0236 00396000
         BE    @RF00236                                            0236 00397000
@RT00236 DS    0H                                                  0237 00398000
*               ENDFLAG=ON;                                        0237 00399000
         LA    ENDFLAG,1                                           0237 00400000
*             ELSE                                                 0238 00401000
*                                                                  0238 00402000
*               /*****************************************************/ 00403000
*               /*                                                   */ 00404000
*               /* GETMAIN STORAGE AFTER EVERY FOURTH RECORD         */ 00405000
*               /*                                                   */ 00406000
*               /*****************************************************/ 00407000
*                                                                  0238 00408000
*               IF DSCOUNT=GMCOUNT|DSRPTR=ZERO THEN                0238 00409000
         B     @RC00236                                            0238 00410000
@RF00236 C     DSCOUNT,@CF00043                                    0238 00411000
         BE    @RT00238                                            0238 00412000
         L     @14,@PC00001+8                                      0238 00413000
         L     @14,DSRPTR(,@14)                                    0238 00414000
         LTR   @14,@14                                             0238 00415000
         BNZ   @RF00238                                            0238 00416000
@RT00238 DS    0H                                                  0239 00417000
*                 DO;                                              0239 00418000
*                   RESPECIFY                                      0240 00419000
*                     R1 RESTRICTED;                               0240 00420000
*                   DO;             /* GETMAIN (RC)                0241 00421000
*                                      LV(DSRECLN*GMCOUNT)         0241 00422000
*                                      SP(ZZZSPEXC) RTCD(RETC)       */ 00423000
*                     RESPECIFY                                    0242 00424000
*                      (GPR01F,                                    0242 00425000
*                       GPR15F,                                    0242 00426000
*                       GPR00F) RESTRICTED;                        0242 00427000
*                     GPR01F=0;     /* REG 1 MUST BE ZERO            */ 00428000
         SLR   GPR01F,GPR01F                                       0243 00429000
*                     GPR15F=0;     /* RC-TYPE GETMAIN               */ 00430000
         SLR   GPR15F,GPR15F                                       0244 00431000
*                     GPR00F=DSRECLN*GMCOUNT;/* LENGTH REQUESTED     */ 00432000
         L     GPR00F,DSRECLN                                      0245 00433000
         SLA   GPR00F,2                                            0245 00434000
*                     GPR15F=GPR15F|((ZZZSPEXC)*256);/* SP IN BYTE 2 */ 00435000
         O     GPR15F,@CF00322                                     0246 00436000
*                     SVC(120);     /* RC/RU-FORM OF GETMAIN         */ 00437000
         SVC   120                                                 0247 00438000
*                     RETC=GPR15F;  /* SET RETURN CODE               */ 00439000
         LR    RETC,GPR15F                                         0248 00440000
*                     RESPECIFY                                    0249 00441000
*                      (GPR01F,                                    0249 00442000
*                       GPR15F,                                    0249 00443000
*                       GPR00F) UNRESTRICTED;                      0249 00444000
*                   END;            /* GETMAIN (RC)                0250 00445000
*                                      LV(DSRECLN*GMCOUNT)         0250 00446000
*                                      SP(ZZZSPEXC) RTCD(RETC)       */ 00447000
*                                                                  0250 00448000
*                   /*************************************************/ 00449000
*                   /*                                               */ 00450000
*                   /* SETUP FOR NEXT ELEMENT                        */ 00451000
*                   /*                                               */ 00452000
*                   /*************************************************/ 00453000
*                                                                  0251 00454000
*                   IF RETCDE=ZZZFLAGI THEN                        0251 00455000
         SLR   @14,@14                                             0251 00456000
         CR    RETCDE,@14                                          0251 00457000
         BNE   @RF00251                                            0251 00458000
*                     DO;                                          0252 00459000
*                       IF CURPTR^=ZERO THEN                       0253 00460000
         CR    CURPTR,@14                                          0253 00461000
         BE    @RF00253                                            0253 00462000
*                         ALPTR=R1;                                0254 00463000
         ST    R1,ALPTR(,CURPTR)                                   0254 00464000
*                       CURPTR=R1;                                 0255 00465000
@RF00253 LR    CURPTR,R1                                           0255 00466000
*                       IF DSRPTR=ZERO THEN                        0256 00467000
         L     @14,@PC00001+8                                      0256 00468000
         L     @08,DSRPTR(,@14)                                    0256 00469000
         LTR   @08,@08                                             0256 00470000
         BNZ   @RF00256                                            0256 00471000
*                         DSRPTR=R1;                               0257 00472000
         ST    R1,DSRPTR(,@14)                                     0257 00473000
*                       RESPECIFY                                  0258 00474000
*                         R1;                                      0258 00475000
@RF00256 DS    0H                                                  0259 00476000
*                       ALKEY=PDRKEY;                              0259 00477000
         MVC   ALKEY(14,CURPTR),PDRKEY(BUFPTR)                     0259 00478000
*                       ALDSREC=PDRDSREC;                          0260 00479000
         MVC   ALDSREC(64,CURPTR),PDRDSREC(BUFPTR)                 0260 00480000
*                       ALPTR=ZERO;                                0261 00481000
         SLR   @14,@14                                             0261 00482000
         ST    @14,ALPTR(,CURPTR)                                  0261 00483000
*                       DSCOUNT=ONE;                               0262 00484000
         LA    DSCOUNT,1                                           0262 00485000
*                     END;                                         0263 00486000
*                                                                  0263 00487000
*                   /*************************************************/ 00488000
*                   /*                                               */ 00489000
*                   /* ABEND IF GETMAIN FAILED                       */ 00490000
*                   /*                                               */ 00491000
*                   /*************************************************/ 00492000
*                                                                  0264 00493000
*                   ELSE                                           0264 00494000
*                     DO;                                          0264 00495000
         B     @RC00251                                            0264 00496000
@RF00251 DS    0H                                                  0265 00497000
*                       DO;         /* BLSDMSG                     0265 00498000
*                                      (ZZ2,04015,MSGPTR,BLSDMSGS) 0265 00499000
*                                      LIFO ROUTE(TERM)              */ 00500000
*                         CALL BLSDMSG0(ZZ2,04015,MSGPTR,BLSDMSGS, 0266 00501000
*                             '10010000'B,0);/* BUILD MESSAGE        */ 00502000
         ST    ZZ2PTR,@AL00001                                     0266 00503000
         LA    @14,@CF01080                                        0266 00504000
         ST    @14,@AL00001+4                                      0266 00505000
         LA    @14,MSGPTR                                          0266 00506000
         ST    @14,@AL00001+8                                      0266 00507000
         L     @14,ZZ2MSGSP(,ZZ2PTR)                               0266 00508000
         ST    @14,@AL00001+12                                     0266 00509000
         LA    @14,@CB01073                                        0266 00510000
         ST    @14,@AL00001+16                                     0266 00511000
         LA    @14,@CF00051                                        0266 00512000
         ST    @14,@AL00001+20                                     0266 00513000
         L     @15,ZZ2MSG0P(,ZZ2PTR)                               0266 00514000
         LA    @01,@AL00001                                        0266 00515000
         BALR  @14,@15                                             0266 00516000
*                       END;        /* BLSDMSG                     0267 00517000
*                                      (ZZ2,04015,MSGPTR,BLSDMSGS) 0267 00518000
*                                      LIFO ROUTE(TERM)              */ 00519000
*                       DO;         /* ABEND(ACODE1) DUMP USER       */ 00520000
*                         RESPECIFY                                0269 00521000
*                          (GPR01F) RESTRICTED;                    0269 00522000
*                         GPR01F=(ACODE1)&'00000FFF'X;/* COMP CODE IN   00523000
*                                      BITS 20-31                    */ 00524000
         LA    GPR01F,122                                          0270 00525000
*                         GPR01F=GPR01F|'80000000'X;/*             0271 00526000
*                                      DUMP/STEP/DUMPOPTS FLAG       */ 00527000
         O     GPR01F,@CF00066                                     0271 00528000
*                         SVC(13);  /* ISSUE ABEND SVC               */ 00529000
         SVC   13                                                  0272 00530000
*                         RESPECIFY                                0273 00531000
*                          (GPR01F) UNRESTRICTED;                  0273 00532000
*                       END;        /* ABEND(ACODE1) DUMP USER       */ 00533000
*                     END;                                         0275 00534000
*                 END;                                             0276 00535000
*               ELSE                                               0277 00536000
*                 DO;                                              0277 00537000
         B     @RC00238                                            0277 00538000
@RF00238 DS    0H                                                  0278 00539000
*                   DSCOUNT=DSCOUNT+ONE;                           0278 00540000
         AL    DSCOUNT,@CF00046                                    0278 00541000
*                   ALPTR=CURPTR+LENGTH(ALELEM);                   0279 00542000
         LA    @14,88                                              0279 00543000
         LR    @04,CURPTR                                          0279 00544000
         ALR   @04,@14                                             0279 00545000
         ST    @04,ALPTR(,CURPTR)                                  0279 00546000
*                   CURPTR=CURPTR+LENGTH(ALELEM);                  0280 00547000
         ALR   CURPTR,@14                                          0280 00548000
*                   ALKEY=PDRKEY;                                  0281 00549000
         MVC   ALKEY(14,CURPTR),PDRKEY(BUFPTR)                     0281 00550000
*                   ALDSREC=PDRDSREC;                              0282 00551000
         MVC   ALDSREC(64,CURPTR),PDRDSREC(BUFPTR)                 0282 00552000
*                   ALPTR=ZERO;                                    0283 00553000
         SLR   @14,@14                                             0283 00554000
         ST    @14,ALPTR(,CURPTR)                                  0283 00555000
*                 END;                                             0284 00556000
*       END;                                                       0285 00557000
@RC00238 DS    0H                                                  0285 00558000
@RC00236 DS    0H                                                  0285 00559000
@RC00217 DS    0H                                                  0285 00560000
@RC00210 DS    0H                                                  0285 00561000
@DE00186 LTR   ENDFLAG,ENDFLAG                                     0285 00562000
         BZ    @DL00186                                            0285 00563000
*   RETURN CODE(RETC);                                             0286 00564000
*                                                                  0286 00565000
@RC00167 DS    0H                                                  0286 00566000
@RC00160 L     @13,4(,@13)                                         0286 00567000
         L     @00,@SIZDATD                                        0286 00568000
         LR    @01,@11                                             0286 00569000
         BLSUFRES R,LV=(0),A=(1)                                        00570000
         LR    @15,@10                                             0286 00571000
         L     @14,12(,@13)                                        0286 00572000
         LM    @00,@12,20(@13)                                     0286 00573000
         BR    @14                                                 0286 00574000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00575000
*                                                                  0287 00576000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 00577000
*     GPR00F FIXED(31) REG(0),                                     0287 00578000
*     GPR01F FIXED(31) REG(1),                                     0287 00579000
*     GPR15F FIXED(31) REG(15),                                    0287 00580000
*     GPR01P PTR(31) REG(1);                                       0287 00581000
*   DECLARE                         /* COMMON VARIABLES              */ 00582000
*     I256C CHAR(256) BASED,                                       0288 00583000
*     I031F FIXED(31) BASED,                                       0288 00584000
*     I031P PTR(31) BASED,                                         0288 00585000
*     I015F FIXED(15) BASED,                                       0288 00586000
*     I015P PTR(15) BASED,                                         0288 00587000
*     I008P PTR(8) BASED,                                          0288 00588000
*     I001C CHAR(1) BASED;                                         0288 00589000
*   GENERATE NODEFS NOREFS DATA;                                   0289 00590000
*   END                             /* BLRPEND                       */ 00591000
*                                                                  0290 00592000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00593000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00594000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00595000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00596000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00597000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00598000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00599000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00600000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00601000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00602000
*/*%INCLUDE SYSLIB  (BLSDSERV)                                       */ 00603000
*/*%INCLUDE SYSLIB  (BLSPDR  )                                       */ 00604000
*/*%INCLUDE SYSLIB  (BLSDALE )                                       */ 00605000
*                                                                  0290 00606000
*       ;                                                          0290 00607000
@EL00001 L     @13,4(,@13)                                         0290 00608000
@EF00001 L     @00,@SIZDATD                                        0290 00609000
         LR    @01,@11                                             0290 00610000
         BLSUFRES R,LV=(0),A=(1)                                        00611000
@ER00001 LM    @14,@12,12(@13)                                     0290 00612000
         BR    @14                                                 0290 00613000
@DATA    DS    0H                                                       00614000
@DATD    DSECT                                                          00615000
         DS    0F                                                       00616000
@SA00001 DS    18F                                                      00617000
@PC00001 DS    3F                                                       00618000
@AL00001 DS    6A                                                       00619000
BLSELPFR CSECT                                                          00620000
         DS    0F                                                       00621000
@CF00051 DC    F'0'                                                     00622000
@CF00046 DC    F'1'                                                     00623000
@CF00043 DC    F'4'                                                     00624000
@CF00054 DC    F'8'                                                     00625000
@CF00627 DC    F'10'                                                    00626000
@CF00057 DC    F'16'                                                    00627000
@CF01088 DC    F'88'                                                    00628000
@CF00322 DC    F'256'                                                   00629000
@CF01089 DC    F'952'                                                   00630000
@CF01080 DC    F'4015'                                                  00631000
@CF01072 DC    F'4043'                                                  00632000
@CF01062 DC    F'-1'                                                    00633000
@CF00066 DC    XL4'80000000'                                            00634000
@CF01066 DC    XL4'FFFFFFF8'                                            00635000
@CF01068 DC    XL4'7FFFFFFF'                                            00636000
@DATD    DSECT                                                          00637000
         DS    0D                                                       00638000
DSRECLN  DS    F                                                        00639000
MSGPTR   DS    A                                                        00640000
SRCHKEY  DS    CL10                                                     00641000
         ORG   SRCHKEY                                                  00642000
RECTYPE  DS    CL2                                                      00643000
RECPID   DS    CL8                                                      00644000
         ORG   SRCHKEY+10                                               00645000
BUFFER   DS    CL952                                                    00646000
BLSELPFR CSECT                                                          00647000
         DS    0F                                                       00648000
@SIZDATD DC    AL1(0)                                                   00649000
         DC    AL3(@ENDDATD-@DATD)                                      00650000
         DS    0D                                                       00651000
@CC01067 DC    C'DMCB'                                                  00652000
@CC00983 DC    C'DS'                                                    00653000
@CB01071 DC    B'00000000'                                              00654000
@CB01073 DC    B'10010000'                                              00655000
@DATD    DSECT                                                          00656000
         SPACE 2                                                        00657000
*********************************************************************** 00658000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00659000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00660000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00661000
*********************************************************************** 00662000
         SPACE                                                          00663000
BLSELPFR CSECT                                                          00664000
         ORG                                                            00665000
         DS    0D                                                       00666000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSELPFR+19)/20+7)/8)CL8'BLSELPFR'     00667000
@DATD    DSECT                                                          00668000
         SPACE 2                                                        00669000
*********************************************************************** 00670000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00671000
*********************************************************************** 00672000
         SPACE                                                          00673000
         DS    0D                                                       00674000
@DATD    DSECT                                                          00675000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00676000
@ENDDATD EQU   *                                                        00677000
BLSELPFR CSECT                                                          00678000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00679000
@01      EQU   01                                                       00680000
@02      EQU   02                                                       00681000
@03      EQU   03                                                       00682000
@04      EQU   04                                                       00683000
@05      EQU   05                                                       00684000
@06      EQU   06                                                       00685000
@07      EQU   07                                                       00686000
@08      EQU   08                                                       00687000
@09      EQU   09                                                       00688000
@10      EQU   10                                                       00689000
@11      EQU   11                                                       00690000
@12      EQU   12                                                       00691000
@13      EQU   13                                                       00692000
@14      EQU   14                                                       00693000
@15      EQU   15                                                       00694000
CURPTR   EQU   @06                                                      00695000
ENDFLAG  EQU   @09                                                      00696000
DSCOUNT  EQU   @08                                                      00697000
RETC     EQU   @10                                                      00698000
BUFPTR   EQU   @07                                                      00699000
ZZ2PTR   EQU   @05                                                      00700000
R0       EQU   @00                                                      00701000
R1       EQU   @01                                                      00702000
R2       EQU   @02                                                      00703000
R3       EQU   @03                                                      00704000
R4       EQU   @04                                                      00705000
R5       EQU   @05                                                      00706000
R9       EQU   @09                                                      00707000
RB       EQU   @11                                                      00708000
RD       EQU   @13                                                      00709000
RE       EQU   @14                                                      00710000
RF       EQU   @15                                                      00711000
RETCDE   EQU   @15                                                      00712000
GPR01P   EQU   @01                                                      00713000
GPR00F   EQU   @00                                                      00714000
GPR15F   EQU   @15                                                      00715000
GPR01F   EQU   @01                                                      00716000
RA       EQU   @10                                                      00717000
RC       EQU   @12                                                      00718000
R6       EQU   @06                                                      00719000
R7       EQU   @07                                                      00720000
R8       EQU   @08                                                      00721000
DMCB     EQU   0                                                        00722000
DMCBID   EQU   DMCB                                                     00723000
DMCBFTY  EQU   DMCB+20                                                  00724000
DMCBOPN  EQU   DMCB+21                                                  00725000
DMCBRQST EQU   DMCB+22                                                  00726000
DMCBRMOD EQU   DMCB+23                                                  00727000
DMCBOUT  EQU   DMCBRMOD                                                 00728000
DMCBOPTS EQU   DMCB+24                                                  00729000
DMCBKYD  EQU   DMCBOPTS                                                 00730000
DMCBGKY  EQU   DMCBOPTS                                                 00731000
DMCBRNO  EQU   DMCBGKY                                                  00732000
DMCBAPX  EQU   DMCBOPTS                                                 00733000
DMCBUPD  EQU   DMCBOPTS                                                 00734000
DMCBLRD  EQU   DMCBOPTS                                                 00735000
DMCBMFLG EQU   DMCB+28                                                  00736000
DMCBBUFP EQU   DMCB+32                                                  00737000
DMCBBLEN EQU   DMCB+36                                                  00738000
DMCBKEYP EQU   DMCB+44                                                  00739000
DMCBKEYL EQU   DMCB+48                                                  00740000
DMCBMSG  EQU   DMCB+52                                                  00741000
DMCBRI   EQU   DMCB+64                                                  00742000
DMCBACBE EQU   DMCB+124                                                 00743000
DMCBSPEC EQU   DMCB+380                                                 00744000
DMCBAMS  EQU   DMCB+416                                                 00745000
DMCBAUDT EQU   DMCB+568                                                 00746000
DMCBLSCP EQU   DMCBAUDT+16                                              00747000
DMCBDMGR EQU   0                                                        00748000
ZZ1      EQU   0                                                        00749000
ZZ1PDRP  EQU   ZZ1+40                                                   00750000
ZZ1ATTN  EQU   ZZ1+360                                                  00751000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00752000
ZZ1F     EQU   ZZ1+368                                                  00753000
ZZ1N     EQU   ZZ1+1116                                                 00754000
ZZ2      EQU   0                                                        00755000
ZZ2AMD   EQU   ZZ2                                                      00756000
@NM00013 EQU   ZZ2AMD+7                                                 00757000
ZZ2PRT   EQU   ZZ2+138                                                  00758000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00759000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00760000
ZZ2A     EQU   ZZ2+272                                                  00761000
ZZ2AF    EQU   ZZ2A+16                                                  00762000
ZZ2APID  EQU   ZZ2A+64                                                  00763000
ZZ2AD    EQU   ZZ2A+74                                                  00764000
ZZ2ADD   EQU   ZZ2AD                                                    00765000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00766000
ZZ2ADM   EQU   ZZ2AD+46                                                 00767000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00768000
ZZ2ADP   EQU   ZZ2AD+56                                                 00769000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00770000
ZZ2AQAS  EQU   ZZ2A+144                                                 00771000
ZZ2AQD   EQU   ZZ2A+160                                                 00772000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00773000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00774000
ZZ2STG   EQU   ZZ2+960                                                  00775000
ZZ2ALLOP EQU   ZZ2+992                                                  00776000
ZZ2FREEP EQU   ZZ2+996                                                  00777000
ZZ2FF19P EQU   ZZ2+1000                                                 00778000
ZZ2FRE1P EQU   ZZ2+1004                                                 00779000
ZZ2FF18P EQU   ZZ2+1008                                                 00780000
ZZ2DYNAP EQU   ZZ2+1012                                                 00781000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00782000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00783000
ZZ2STAIP EQU   ZZ2+1024                                                 00784000
ZZ2FF02P EQU   ZZ2+1028                                                 00785000
ZZ2GETLP EQU   ZZ2+1032                                                 00786000
ZZ2PARSP EQU   ZZ2+1036                                                 00787000
ZZ2PTGTP EQU   ZZ2+1040                                                 00788000
ZZ2PUTLP EQU   ZZ2+1044                                                 00789000
ZZ2SCANP EQU   ZZ2+1048                                                 00790000
ZZ2STCKP EQU   ZZ2+1052                                                 00791000
ZZ2ALOCP EQU   ZZ2+1056                                                 00792000
ZZ2MSGSP EQU   ZZ2+1060                                                 00793000
ZZ2TRMOP EQU   ZZ2+1064                                                 00794000
ZZ2TRMVP EQU   ZZ2+1068                                                 00795000
ZZ2MSG0P EQU   ZZ2+1076                                                 00796000
ZZ2PUTNP EQU   ZZ2+1084                                                 00797000
ZZ2TRMNP EQU   ZZ2+1088                                                 00798000
ZZ2ENQ0P EQU   ZZ2+1092                                                 00799000
ZZ2ADSDP EQU   ZZ2+1096                                                 00800000
ZZ2APDRP EQU   ZZ2+1100                                                 00801000
ZZ2FDSDP EQU   ZZ2+1104                                                 00802000
ZZ2FPDRP EQU   ZZ2+1108                                                 00803000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00804000
ZZ2DVTP  EQU   ZZ2+1276                                                 00805000
ZZ2BVTP  EQU   ZZ2+1280                                                 00806000
ZZ2CPPL  EQU   ZZ2+1292                                                 00807000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00808000
ZZ2ITR   EQU   ZZ2+2840                                                 00809000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00810000
ZZ2ITSE  EQU   ZZ2+2864                                                 00811000
ZZ2ES    EQU   ZZ2+2872                                                 00812000
ZZ2AMDX  EQU   ZZ2+7160                                                 00813000
ZZ2AXO   EQU   ZZ2+7934                                                 00814000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00815000
CMD      EQU   0                                                        00816000
CMDT     EQU   CMD+4                                                    00817000
PSCB     EQU   0                                                        00818000
PSCBATR1 EQU   PSCB+16                                                  00819000
ECT      EQU   0                                                        00820000
ECTSWS   EQU   ECT+28                                                   00821000
ECTSWS2  EQU   ECT+40                                                   00822000
ECTSWS21 EQU   ECTSWS2                                                  00823000
UPT      EQU   0                                                        00824000
UPTSWS   EQU   UPT+12                                                   00825000
SA       EQU   0                                                        00826000
SA1      EQU   SA                                                       00827000
SAR      EQU   SA+12                                                    00828000
BVT      EQU   0                                                        00829000
BVTPUTLP EQU   BVT+4                                                    00830000
BVTPUTOP EQU   BVT+12                                                   00831000
BVTPUTTP EQU   BVT+16                                                   00832000
BVTPUTVP EQU   BVT+20                                                   00833000
BVTPUTAP EQU   BVT+24                                                   00834000
BVTPRTTP EQU   BVT+28                                                   00835000
BVTPRTAP EQU   BVT+32                                                   00836000
BVTPUTDP EQU   BVT+36                                                   00837000
BVTMONP  EQU   BVT+40                                                   00838000
BVTMON2P EQU   BVT+44                                                   00839000
BVTVSARP EQU   BVT+48                                                   00840000
BVTVSENP EQU   BVT+64                                                   00841000
BVTVSERP EQU   BVT+68                                                   00842000
BVTVSGEP EQU   BVT+72                                                   00843000
BVTVSGUP EQU   BVT+76                                                   00844000
BVTVSPOP EQU   BVT+80                                                   00845000
BVTVSPUP EQU   BVT+84                                                   00846000
BVTMPKNP EQU   BVT+104                                                  00847000
BVTMONLP EQU   BVT+108                                                  00848000
BVTPUTCP EQU   BVT+132                                                  00849000
BVTMPK1P EQU   BVT+136                                                  00850000
BVTZZ2RP EQU   BVT+140                                                  00851000
BVTPGMRP EQU   BVT+144                                                  00852000
BVTMONAP EQU   BVT+148                                                  00853000
BVTBLDDP EQU   BVT+152                                                  00854000
BVTBLDLP EQU   BVT+156                                                  00855000
BVTPGMCP EQU   BVT+160                                                  00856000
BVTPGMDP EQU   BVT+164                                                  00857000
BVTPGMLP EQU   BVT+168                                                  00858000
BVTMONCP EQU   BVT+180                                                  00859000
BVTMONDP EQU   BVT+184                                                  00860000
BVTMONTP EQU   BVT+188                                                  00861000
BVTPARIP EQU   BVT+192                                                  00862000
BVTPARUP EQU   BVT+196                                                  00863000
BVTPRTNP EQU   BVT+204                                                  00864000
BVTVSCRP EQU   BVT+208                                                  00865000
BVTVSMRP EQU   BVT+212                                                  00866000
BVTMONXP EQU   BVT+216                                                  00867000
BVTTRMAP EQU   BVT+228                                                  00868000
BLSDMSGS EQU   0                                                        00869000
BLSDMSG0 EQU   0                                                        00870000
DVT      EQU   0                                                        00871000
DVTDEQPP EQU   DVT+8                                                    00872000
DVTENQPP EQU   DVT+12                                                   00873000
DVTAUTHP EQU   DVT+20                                                   00874000
DVTLPCLP EQU   DVT+24                                                   00875000
DVTBP00P EQU   DVT+28                                                   00876000
DVTCN00P EQU   DVT+32                                                   00877000
DVTDF00P EQU   DVT+36                                                   00878000
DVTDS00P EQU   DVT+44                                                   00879000
DVTFL00P EQU   DVT+48                                                   00880000
DVTFP00P EQU   DVT+52                                                   00881000
DVTGD00P EQU   DVT+56                                                   00882000
DVTGG00P EQU   DVT+60                                                   00883000
DVTGP00P EQU   DVT+64                                                   00884000
DVTND00P EQU   DVT+68                                                   00885000
DVTND01P EQU   DVT+72                                                   00886000
DVTOD00P EQU   DVT+76                                                   00887000
DVTPS00P EQU   DVT+80                                                   00888000
DVTSD00P EQU   DVT+84                                                   00889000
DVTSL00P EQU   DVT+88                                                   00890000
DVTTL00P EQU   DVT+92                                                   00891000
DVTUD00P EQU   DVT+96                                                   00892000
DVTUP00P EQU   DVT+100                                                  00893000
DVTLP00P EQU   DVT+104                                                  00894000
DVTLALLP EQU   DVT+108                                                  00895000
DVTLPFMP EQU   DVT+112                                                  00896000
DVTCLOSP EQU   DVT+116                                                  00897000
DVTOPENP EQU   DVT+120                                                  00898000
DVTPERAP EQU   DVT+124                                                  00899000
DVTDALLP EQU   DVT+128                                                  00900000
PDREC    EQU   0                                                        00901000
PDRKEY   EQU   PDREC                                                    00902000
PDRGRP   EQU   PDRKEY                                                   00903000
PDRKRCTY EQU   PDRGRP                                                   00904000
PDRKPID  EQU   PDRGRP+2                                                 00905000
PDRINFO  EQU   PDREC+16                                                 00906000
ALELEM   EQU   0                                                        00907000
ALKEY    EQU   ALELEM                                                   00908000
ALGRP    EQU   ALKEY                                                    00909000
ALKPID   EQU   ALGRP+2                                                  00910000
ALDSREC  EQU   ALELEM+16                                                00911000
ALDSNM   EQU   ALDSREC                                                  00912000
ALPTR    EQU   ALELEM+84                                                00913000
BLSCALOC EQU   0                                                        00914000
BLSDADSD EQU   0                                                        00915000
BLSDAPDR EQU   0                                                        00916000
BLSDDEQP EQU   0                                                        00917000
BLSDENQP EQU   0                                                        00918000
BLSDENQ0 EQU   0                                                        00919000
BLSDFDSD EQU   0                                                        00920000
BLSDFPDR EQU   0                                                        00921000
BLSEAUTH EQU   0                                                        00922000
BLSELPCL EQU   0                                                        00923000
BLSELPFM EQU   0                                                        00924000
BLSFBP00 EQU   0                                                        00925000
BLSFCLOS EQU   0                                                        00926000
BLSFCN00 EQU   0                                                        00927000
BLSFDALL EQU   0                                                        00928000
BLSFDF00 EQU   0                                                        00929000
BLSFDS00 EQU   0                                                        00930000
BLSFFL00 EQU   0                                                        00931000
BLSFFP00 EQU   0                                                        00932000
BLSFGD00 EQU   0                                                        00933000
BLSFGG00 EQU   0                                                        00934000
BLSFGP00 EQU   0                                                        00935000
BLSFLALL EQU   0                                                        00936000
BLSFLP00 EQU   0                                                        00937000
BLSFND00 EQU   0                                                        00938000
BLSFND01 EQU   0                                                        00939000
BLSFOD00 EQU   0                                                        00940000
BLSFOPEN EQU   0                                                        00941000
BLSFPERA EQU   0                                                        00942000
BLSFPS00 EQU   0                                                        00943000
BLSFSD00 EQU   0                                                        00944000
BLSFSL00 EQU   0                                                        00945000
BLSFTL00 EQU   0                                                        00946000
BLSFUD00 EQU   0                                                        00947000
BLSFUP00 EQU   0                                                        00948000
BLSUALLO EQU   0                                                        00949000
BLSUBLDD EQU   0                                                        00950000
BLSUBLDL EQU   0                                                        00951000
BLSUDYNA EQU   0                                                        00952000
BLSUFREE EQU   0                                                        00953000
BLSUFRE1 EQU   0                                                        00954000
BLSUMON  EQU   0                                                        00955000
BLSUMONA EQU   0                                                        00956000
BLSUMONC EQU   0                                                        00957000
BLSUMOND EQU   0                                                        00958000
BLSUMONL EQU   0                                                        00959000
BLSUMONT EQU   0                                                        00960000
BLSUMONX EQU   0                                                        00961000
BLSUMON2 EQU   0                                                        00962000
BLSUMPKN EQU   0                                                        00963000
BLSUMPK1 EQU   0                                                        00964000
BLSUPARI EQU   0                                                        00965000
BLSUPARU EQU   0                                                        00966000
BLSUPGMC EQU   0                                                        00967000
BLSUPGMD EQU   0                                                        00968000
BLSUPGML EQU   0                                                        00969000
BLSUPGMR EQU   0                                                        00970000
BLSUPRTA EQU   0                                                        00971000
BLSUPRTN EQU   0                                                        00972000
BLSUPRTT EQU   0                                                        00973000
BLSUPUTA EQU   0                                                        00974000
BLSUPUTC EQU   0                                                        00975000
BLSUPUTD EQU   0                                                        00976000
BLSUPUTL EQU   0                                                        00977000
BLSUPUTN EQU   0                                                        00978000
BLSUPUTO EQU   0                                                        00979000
BLSUPUTT EQU   0                                                        00980000
BLSUPUTV EQU   0                                                        00981000
BLSUSTAI EQU   0                                                        00982000
BLSUTRMA EQU   0                                                        00983000
BLSUTRMN EQU   0                                                        00984000
BLSUTRMO EQU   0                                                        00985000
BLSUTRMV EQU   0                                                        00986000
BLSUVSAR EQU   0                                                        00987000
BLSUVSCR EQU   0                                                        00988000
BLSUVSEN EQU   0                                                        00989000
BLSUVSER EQU   0                                                        00990000
BLSUVSGE EQU   0                                                        00991000
BLSUVSGU EQU   0                                                        00992000
BLSUVSMR EQU   0                                                        00993000
BLSUVSPO EQU   0                                                        00994000
BLSUVSPU EQU   0                                                        00995000
BLSUZZ2C EQU   0                                                        00996000
BLSUZZ2D EQU   0                                                        00997000
BLSUZZ2R EQU   0                                                        00998000
DMCBRQC  EQU   0                                                        00999000
IKJEFF02 EQU   0                                                        01000000
IKJEFF18 EQU   0                                                        01001000
IKJEFF19 EQU   0                                                        01002000
IKJGETL  EQU   0                                                        01003000
IKJPARS  EQU   0                                                        01004000
IKJPTGT  EQU   0                                                        01005000
IKJPUTL  EQU   0                                                        01006000
IKJSCAN  EQU   0                                                        01007000
IKJSTCK  EQU   0                                                        01008000
I001C    EQU   0                                                        01009000
I008P    EQU   0                                                        01010000
I015F    EQU   0                                                        01011000
I015P    EQU   0                                                        01012000
I031F    EQU   0                                                        01013000
I031P    EQU   0                                                        01014000
I256C    EQU   0                                                        01015000
ZZ2PARM  EQU   0                                                        01016000
PROBID   EQU   0                                                        01017000
DSRPTR   EQU   0                                                        01018000
DMCBVSM  EQU   DMCBAMS                                                  01019000
DMCBQSM  EQU   DMCBAMS                                                  01020000
CPPL     EQU   ZZ2CPPL                                                  01021000
CPPLUPT  EQU   CPPL+4                                                   01022000
CPPLPSCB EQU   CPPL+8                                                   01023000
CPPLECT  EQU   CPPL+12                                                  01024000
PDRSTREC EQU   PDRINFO                                                  01025000
PDRODATE EQU   PDRSTREC                                                 01026000
PDROWNNM EQU   PDRSTREC+32                                              01027000
PDRDEREC EQU   PDRINFO                                                  01028000
PDRDESCR EQU   PDRDEREC                                                 01029000
PDRDESC  EQU   PDRDESCR                                                 01030000
PDRTRREC EQU   PDRINFO                                                  01031000
PDRTRARR EQU   PDRTRREC                                                 01032000
PDRHSREC EQU   PDRINFO                                                  01033000
PDRDSREC EQU   PDRINFO                                                  01034000
PDRDSNM  EQU   PDRDSREC                                                 01035000
PDRSVALU EQU   PDRODATE                                                 01036000
*                                      START UNREFERENCED COMPONENTS    01037000
PDRSVNUM EQU   PDRSVALU+3                                               01038000
PDRSVRES EQU   PDRSVALU                                                 01039000
PDRDSRES EQU   PDRDSREC+52                                              01040000
PDRMEMB  EQU   PDRDSNM+44                                               01041000
PDRDSN   EQU   PDRDSNM                                                  01042000
PDRHYMSD EQU   PDRHSREC+4                                               01043000
PDRHSLEN EQU   PDRHSREC                                                 01044000
PDRTRKD  EQU   PDRTRARR                                                 01045000
PDRDSSEQ EQU   PDRSTREC+396                                             01046000
PDRRES6  EQU   PDRSTREC+392                                             01047000
PDRTRKL  EQU   PDRSTREC+388                                             01048000
PDRDESCL EQU   PDRSTREC+384                                             01049000
PDRABS   EQU   PDRSTREC+256                                             01050000
PDRRES5  EQU   PDRSTREC+252                                             01051000
PDRFIXID EQU   PDRSTREC+192                                             01052000
PDRFTIME EQU   PDRSTREC+184                                             01053000
PDRFDATE EQU   PDRSTREC+176                                             01054000
PDRFSTAT EQU   PDRSTREC+172                                             01055000
PDRRES4  EQU   PDRSTREC+167                                             01056000
PDRPTFID EQU   PDRSTREC+160                                             01057000
PDRTTIME EQU   PDRSTREC+152                                             01058000
PDRTDATE EQU   PDRSTREC+144                                             01059000
PDRTSTAT EQU   PDRSTREC+140                                             01060000
PDRRES3  EQU   PDRSTREC+135                                             01061000
PDRAPRID EQU   PDRSTREC+128                                             01062000
PDRITIME EQU   PDRSTREC+120                                             01063000
PDRIDATE EQU   PDRSTREC+112                                             01064000
PDRISTAT EQU   PDRSTREC+104                                             01065000
PDRRTIME EQU   PDRSTREC+96                                              01066000
PDRRDATE EQU   PDRSTREC+88                                              01067000
PDRPTIME EQU   PDRSTREC+80                                              01068000
PDRPDATE EQU   PDRSTREC+72                                              01069000
PDRPSTAT EQU   PDRSTREC+64                                              01070000
PDRUSER  EQU   PDRSTREC+56                                              01071000
PDRSYS   EQU   PDRSTREC+48                                              01072000
PDRGROUP EQU   PDRSTREC+40                                              01073000
PDROWNLN EQU   PDROWNNM+7                                               01074000
PDROWNID EQU   PDROWNNM                                                 01075000
PDRRES1  EQU   PDRSTREC+27                                              01076000
PDRSEV   EQU   PDRSTREC+26                                              01077000
PDRCOMP  EQU   PDRSTREC+16                                              01078000
PDROTIME EQU   PDRSTREC+8                                               01079000
CPPLCBUF EQU   CPPL                                                     01080000
DMCBRES7 EQU   DMCBQSM+96                                               01081000
DMCBDCB  EQU   DMCBQSM                                                  01082000
DMCBACB  EQU   DMCBVSM+76                                               01083000
DMCBRPL  EQU   DMCBVSM                                                  01084000
ALRESV2  EQU   ALELEM+80                                                01085000
ALDSRES  EQU   ALDSREC+52                                               01086000
ALMEMB   EQU   ALDSNM+44                                                01087000
ALDSN    EQU   ALDSNM                                                   01088000
ALRESV   EQU   ALELEM+14                                                01089000
ALRECSQ  EQU   ALKEY+10                                                 01090000
ALKPNUM  EQU   ALKPID+3                                                 01091000
ALKPREF  EQU   ALKPID                                                   01092000
ALKRCTY  EQU   ALGRP                                                    01093000
PDRRESV  EQU   PDREC+14                                                 01094000
PDRRECSQ EQU   PDRKEY+10                                                01095000
PDRKPNUM EQU   PDRKPID+3                                                01096000
PDRKPREF EQU   PDRKPID                                                  01097000
DVT99999 EQU   DVT+256                                                  01098000
DVT0064P EQU   DVT+252                                                  01099000
DVT0063P EQU   DVT+248                                                  01100000
DVT0062P EQU   DVT+244                                                  01101000
DVT0061P EQU   DVT+240                                                  01102000
DVT0060P EQU   DVT+236                                                  01103000
DVT0059P EQU   DVT+232                                                  01104000
DVT0058P EQU   DVT+228                                                  01105000
DVT0057P EQU   DVT+224                                                  01106000
DVT0056P EQU   DVT+220                                                  01107000
DVT0055P EQU   DVT+216                                                  01108000
DVT0054P EQU   DVT+212                                                  01109000
DVT0053P EQU   DVT+208                                                  01110000
DVT0052P EQU   DVT+204                                                  01111000
DVT0051P EQU   DVT+200                                                  01112000
DVT0050P EQU   DVT+196                                                  01113000
DVT0049P EQU   DVT+192                                                  01114000
DVT0048P EQU   DVT+188                                                  01115000
DVT0047P EQU   DVT+184                                                  01116000
DVT0046P EQU   DVT+180                                                  01117000
DVT0045P EQU   DVT+176                                                  01118000
DVT0044P EQU   DVT+172                                                  01119000
DVT0043P EQU   DVT+168                                                  01120000
DVT0042P EQU   DVT+164                                                  01121000
DVT0041P EQU   DVT+160                                                  01122000
DVT0040P EQU   DVT+156                                                  01123000
DVT0039P EQU   DVT+152                                                  01124000
DVT0038P EQU   DVT+148                                                  01125000
DVT0037P EQU   DVT+144                                                  01126000
DVT0036P EQU   DVT+140                                                  01127000
DVT0035P EQU   DVT+136                                                  01128000
DVT0034P EQU   DVT+132                                                  01129000
DVT0011P EQU   DVT+40                                                   01130000
DVT0005P EQU   DVT+16                                                   01131000
DVT0002P EQU   DVT+4                                                    01132000
DVT0001P EQU   DVT                                                      01133000
BVT99999 EQU   BVT+256                                                  01134000
BVT0064P EQU   BVT+252                                                  01135000
BVT0063P EQU   BVT+248                                                  01136000
BVT0062P EQU   BVT+244                                                  01137000
BVT0061P EQU   BVT+240                                                  01138000
BVT0060P EQU   BVT+236                                                  01139000
BVT0059P EQU   BVT+232                                                  01140000
BVT0057P EQU   BVT+224                                                  01141000
BVT0056P EQU   BVT+220                                                  01142000
BVTSTBLP EQU   BVT+200                                                  01143000
BVT0045P EQU   BVT+176                                                  01144000
BVT0044P EQU   BVT+172                                                  01145000
BVT0033P EQU   BVT+128                                                  01146000
BVT0032P EQU   BVT+124                                                  01147000
BVT0031P EQU   BVT+120                                                  01148000
BVT0030P EQU   BVT+116                                                  01149000
BVT0029P EQU   BVT+112                                                  01150000
BVT0026P EQU   BVT+100                                                  01151000
BVT0025P EQU   BVT+96                                                   01152000
BVT0024P EQU   BVT+92                                                   01153000
BVT0023P EQU   BVT+88                                                   01154000
BVT0016P EQU   BVT+60                                                   01155000
BVT0015P EQU   BVT+56                                                   01156000
BVT0014P EQU   BVT+52                                                   01157000
BVT0003P EQU   BVT+8                                                    01158000
BVT0001P EQU   BVT                                                      01159000
SA99     EQU   SA+72                                                    01160000
SARC     EQU   SAR+56                                                   01161000
SARB     EQU   SAR+52                                                   01162000
SARA     EQU   SAR+48                                                   01163000
SAR9     EQU   SAR+44                                                   01164000
SAR8     EQU   SAR+40                                                   01165000
SAR7     EQU   SAR+36                                                   01166000
SAR6     EQU   SAR+32                                                   01167000
SAR5     EQU   SAR+28                                                   01168000
SAR4     EQU   SAR+24                                                   01169000
SAR3     EQU   SAR+20                                                   01170000
SAR2     EQU   SAR+16                                                   01171000
SAR1     EQU   SAR+12                                                   01172000
SAR0     EQU   SAR+8                                                    01173000
SARF     EQU   SAR+4                                                    01174000
SARE     EQU   SAR                                                      01175000
SAFWD    EQU   SA+8                                                     01176000
SABAK    EQU   SA+4                                                     01177000
SA1L     EQU   SA1+1                                                    01178000
SA1P     EQU   SA1                                                      01179000
UPTPREFL EQU   UPT+23                                                   01180000
UPTPREFX EQU   UPT+16                                                   01181000
@NM00068 EQU   UPT+15                                                   01182000
UPTLDEL  EQU   UPT+14                                                   01183000
UPTCDEL  EQU   UPT+13                                                   01184000
UPTWTP   EQU   UPTSWS                                                   01185000
UPTMODE  EQU   UPTSWS                                                   01186000
UPTALD   EQU   UPTSWS                                                   01187000
UPTPAUS  EQU   UPTSWS                                                   01188000
UPTNCOM  EQU   UPTSWS                                                   01189000
UPTMID   EQU   UPTSWS                                                   01190000
UPTNPRM  EQU   UPTSWS                                                   01191000
UPTRCVR  EQU   UPTSWS                                                   01192000
UPTUSER  EQU   UPT+2                                                    01193000
@NM00067 EQU   UPT                                                      01194000
@NM00066 EQU   ECT+52                                                   01195000
@NM00065 EQU   ECT+48                                                   01196000
@NM00064 EQU   ECT+44                                                   01197000
@NM00063 EQU   ECTSWS2+1                                                01198000
@NM00062 EQU   ECTSWS21                                                 01199000
ECTTABND EQU   ECTSWS21                                                 01200000
ECTDEFCS EQU   ECTSWS21                                                 01201000
ECTBKPB  EQU   ECT+36                                                   01202000
ECTUSER  EQU   ECT+32                                                   01203000
ECTDDNUM EQU   ECT+29                                                   01204000
ECTATTN  EQU   ECTSWS                                                   01205000
ECTBKGRD EQU   ECTSWS                                                   01206000
ECTNNOT  EQU   ECTSWS                                                   01207000
ECTNMAL  EQU   ECTSWS                                                   01208000
ECTLOGF  EQU   ECTSWS                                                   01209000
ECTATRM  EQU   ECTSWS                                                   01210000
@NM00061 EQU   ECTSWS                                                   01211000
ECTNOPD  EQU   ECTSWS                                                   01212000
ECTSCMD  EQU   ECT+20                                                   01213000
ECTPCMD  EQU   ECT+12                                                   01214000
ECTSMSG  EQU   ECT+9                                                    01215000
ECTMSGF  EQU   ECT+8                                                    01216000
ECTIOWA  EQU   ECT+4                                                    01217000
ECTRTCD  EQU   ECT+1                                                    01218000
ECTRCDF  EQU   ECT                                                      01219000
PSCBU    EQU   PSCB+64                                                  01220000
PSCBRSZ  EQU   PSCB+60                                                  01221000
PSCBLINE EQU   PSCB+59                                                  01222000
PSCBCHAR EQU   PSCB+58                                                  01223000
PSCBUPTL EQU   PSCB+56                                                  01224000
PSCBUPT  EQU   PSCB+52                                                  01225000
PSCBRLGB EQU   PSCB+48                                                  01226000
PSCBDEST EQU   PSCB+40                                                  01227000
@NM00060 EQU   PSCB+36                                                  01228000
@NM00059 EQU   PSCB+32                                                  01229000
@NM00058 EQU   PSCB+28                                                  01230000
PSCBLTI2 EQU   PSCB+24                                                  01231000
PSCBLTIM EQU   PSCB+20                                                  01232000
PSCBATR2 EQU   PSCB+18                                                  01233000
@NM00057 EQU   PSCBATR1                                                 01234000
@NM00056 EQU   PSCBATR1                                                 01235000
@NM00055 EQU   PSCBATR1                                                 01236000
PSCBATTN EQU   PSCBATR1                                                 01237000
PSCBVMNT EQU   PSCBATR1                                                 01238000
PSCBJCL  EQU   PSCBATR1                                                 01239000
PSCBACCT EQU   PSCBATR1                                                 01240000
PSCBCTRL EQU   PSCBATR1                                                 01241000
PSCBGPNM EQU   PSCB+8                                                   01242000
PSCBUSRL EQU   PSCB+7                                                   01243000
PSCBUSER EQU   PSCB                                                     01244000
CMDT1    EQU   CMDT                                                     01245000
CMDO     EQU   CMD+2                                                    01246000
CMDL     EQU   CMD                                                      01247000
ZZ299999 EQU   ZZ2+8192                                                 01248000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  01249000
ZZ2AXOL  EQU   ZZ2AXO                                                   01250000
@NM00054 EQU   ZZ2+7288                                                 01251000
@NM00053 EQU   ZZ2AMDX+4                                                01252000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01253000
ZZ2HSD   EQU   ZZ2+3056                                                 01254000
@NM00052 EQU   ZZ2ES                                                    01255000
@NM00051 EQU   ZZ2+2868                                                 01256000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01257000
@NM00050 EQU   ZZ2ITSE                                                  01258000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01259000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01260000
@NM00049 EQU   ZZ2ITR+20                                                01261000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01262000
@NM00048 EQU   ZZ2ITRE                                                  01263000
ZZ2ITREP EQU   ZZ2ITRE                                                  01264000
ZZ2ITREW EQU   ZZ2ITRE                                                  01265000
@NM00047 EQU   ZZ2ITR+9                                                 01266000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01267000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01268000
ZZ2ITRPP EQU   ZZ2ITR                                                   01269000
@NM00046 EQU   ZZ2+1544                                                 01270000
ZZ2PGM   EQU   ZZ2+1536                                                 01271000
@NM00045 EQU   ZZ2+1526                                                 01272000
ZZ2CW    EQU   ZZ2+1524                                                 01273000
@NM00044 EQU   ZZ2+1504                                                 01274000
@NM00043 EQU   ZZ2+1352                                                 01275000
ZZ2FFSYP EQU   ZZ2+1348                                                 01276000
ZZ2SASYP EQU   ZZ2+1344                                                 01277000
ZZ2RDSYP EQU   ZZ2+1340                                                 01278000
ZZ2RASYP EQU   ZZ2+1336                                                 01279000
ZZ2PHSYP EQU   ZZ2+1332                                                 01280000
ZZ2ESSYP EQU   ZZ2+1328                                                 01281000
ZZ200SYP EQU   ZZ2+1324                                                 01282000
ZZ2SCWP  EQU   ZZ2+1320                                                 01283000
ZZ2TTLP  EQU   ZZ2+1316                                                 01284000
ZZ2LOADP EQU   ZZ2+1312                                                 01285000
ZZ2VRESP EQU   ZZ2+1308                                                 01286000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01287000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01288000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01289000
ZZ2VRSAP EQU   ZZ2+1288                                                 01290000
ZZ2RVTP  EQU   ZZ2+1284                                                 01291000
@NM00042 EQU   ZZ2+1272                                                 01292000
@NM00041 EQU   ZZ2+1268                                                 01293000
ZZ2RPLP  EQU   ZZ2+1260                                                 01294000
ZZ2TCBP  EQU   ZZ2+1256                                                 01295000
@NM00040 EQU   ZZ2+1252                                                 01296000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 01297000
@NM00039 EQU   ZZ2+1112                                                 01298000
@NM00038 EQU   ZZ2+1080                                                 01299000
ZZ2FT25P EQU   ZZ2+1072                                                 01300000
@NM00037 EQU   ZZ2+976                                                  01301000
ZZ2TOD   EQU   ZZ2+968                                                  01302000
ZZ2STGN  EQU   ZZ2STG+4                                                 01303000
ZZ2STGP  EQU   ZZ2STG                                                   01304000
@NM00036 EQU   ZZ2+952                                                  01305000
ZZ2SCMDE EQU   ZZ2+944                                                  01306000
ZZ2SCMDN EQU   ZZ2+936                                                  01307000
ZZ2IDENT EQU   ZZ2+928                                                  01308000
ZZ2A9999 EQU   ZZ2A+656                                                 01309000
@NM00035 EQU   ZZ2A+224                                                 01310000
@NM00034 EQU   ZZ2A+220                                                 01311000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01312000
@NM00033 EQU   ZZ2AQD+56                                                01313000
@NM00032 EQU   ZZ2AQDF                                                  01314000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01315000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01316000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01317000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01318000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01319000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01320000
@NM00031 EQU   ZZ2AQDT+1                                                01321000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01322000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01323000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01324000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01325000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01326000
ZZ2AQDOF EQU   ZZ2AQD                                                   01327000
ZZ2AQD00 EQU   ZZ2AQD                                                   01328000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01329000
@NM00030 EQU   ZZ2AQAS+12                                               01330000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01331000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01332000
@NM00029 EQU   ZZ2AQAS+2                                                01333000
ZZ2AQAST EQU   ZZ2AQAS                                                  01334000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01335000
ZZ2AZZ6P EQU   ZZ2A+140                                                 01336000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01337000
ZZ2ADPL  EQU   ZZ2ADP                                                   01338000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01339000
ZZ2ADML  EQU   ZZ2ADM                                                   01340000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01341000
ZZ2ADDL  EQU   ZZ2ADD                                                   01342000
@NM00028 EQU   ZZ2A+72                                                  01343000
ZZ2APIDB EQU   ZZ2APID+3                                                01344000
ZZ2APIDA EQU   ZZ2APID                                                  01345000
@NM00027 EQU   ZZ2A+24                                                  01346000
@NM00026 EQU   ZZ2AF+5                                                  01347000
ZZ2AFX   EQU   ZZ2AF+5                                                  01348000
@NM00025 EQU   ZZ2AF+3                                                  01349000
ZZ2AFS   EQU   ZZ2AF+2                                                  01350000
ZZ2AFD   EQU   ZZ2AF+2                                                  01351000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01352000
ZZ2AF$   EQU   ZZ2AF+2                                                  01353000
@NM00024 EQU   ZZ2AF+2                                                  01354000
ZZ2AFM   EQU   ZZ2AF+2                                                  01355000
@NM00023 EQU   ZZ2AF+2                                                  01356000
@NM00022 EQU   ZZ2AF+1                                                  01357000
ZZ2AFV   EQU   ZZ2AF+1                                                  01358000
@NM00021 EQU   ZZ2AF+1                                                  01359000
ZZ2AFC   EQU   ZZ2AF+1                                                  01360000
@NM00020 EQU   ZZ2AF                                                    01361000
ZZ2AFFS  EQU   ZZ2AF                                                    01362000
ZZ2AFT   EQU   ZZ2AF                                                    01363000
ZZ2AFP   EQU   ZZ2AF                                                    01364000
@NM00019 EQU   ZZ2A+8                                                   01365000
ZZ2ALINE EQU   ZZ2A+4                                                   01366000
@NM00018 EQU   ZZ2A+3                                                   01367000
ZZ2ASE   EQU   ZZ2A+2                                                   01368000
ZZ2ACH   EQU   ZZ2A                                                     01369000
@NM00017 EQU   ZZ2+264                                                  01370000
@NM00016 EQU   ZZ2+263                                                  01371000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01372000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01373000
ZZ2PRTL  EQU   ZZ2PRT                                                   01374000
@NM00015 EQU   ZZ2AMD+56                                                01375000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01376000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01377000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01378000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01379000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01380000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01381000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01382000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01383000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01384000
@NM00014 EQU   @NM00013                                                 01385000
ZZ2AMD2  EQU   @NM00013                                                 01386000
ZZ2AMD1  EQU   @NM00013                                                 01387000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01388000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01389000
ZZ2AMDT  EQU   ZZ2AMD                                                   01390000
ZZ199999 EQU   ZZ1+3072                                                 01391000
@NM00012 EQU   ZZ1+2160                                                 01392000
ZZ1TRTAS EQU   ZZ1+1904                                                 01393000
ZZ1TRUPC EQU   ZZ1+1648                                                 01394000
ZZ1TRCTX EQU   ZZ1+1392                                                 01395000
ZZ1NASID EQU   ZZ1N+274                                                 01396000
ZZ1NSTRL EQU   ZZ1N+272                                                 01397000
ZZ1NOFF  EQU   ZZ1N+268                                                 01398000
ZZ1NBDY  EQU   ZZ1N+264                                                 01399000
ZZ1NADE  EQU   ZZ1N+260                                                 01400000
ZZ1NADB  EQU   ZZ1N+256                                                 01401000
ZZ1NSTR  EQU   ZZ1N                                                     01402000
@NM00011 EQU   ZZ1+1080                                                 01403000
ZZ1TREBC EQU   ZZ1+824                                                  01404000
ZZ1TRHEX EQU   ZZ1+568                                                  01405000
@NM00010 EQU   ZZ1+377                                                  01406000
ZZ1USTAE EQU   ZZ1+376                                                  01407000
@NM00009 EQU   ZZ1F+1                                                   01408000
@NM00008 EQU   ZZ1F                                                     01409000
ZZ1FM    EQU   ZZ1F                                                     01410000
ZZ1FX    EQU   ZZ1F                                                     01411000
ZZ1FU    EQU   ZZ1F                                                     01412000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01413000
@NM00007 EQU   ZZ1EVE                                                   01414000
ZZ1EVEP  EQU   ZZ1EVE                                                   01415000
ZZ1EVEW  EQU   ZZ1EVE                                                   01416000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01417000
@NM00006 EQU   ZZ1+144                                                  01418000
ZZ1FPP   EQU   ZZ1+140                                                  01419000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01420000
@NM00005 EQU   ZZ1+84                                                   01421000
ZZ1PLINE EQU   ZZ1+80                                                   01422000
ZZ1PGSZ  EQU   ZZ1+76                                                   01423000
ZZ1PCNT  EQU   ZZ1+72                                                   01424000
@NM00004 EQU   ZZ1+68                                                   01425000
ZZ1TPAGE EQU   ZZ1+64                                                   01426000
ZZ1TLINE EQU   ZZ1+60                                                   01427000
@NM00003 EQU   ZZ1+52                                                   01428000
ZZ1DMCBP EQU   ZZ1+48                                                   01429000
ZZ1DSDP  EQU   ZZ1+44                                                   01430000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01431000
ZZ1327WP EQU   ZZ1+32                                                   01432000
ZZ1ACBP  EQU   ZZ1+28                                                   01433000
@NM00002 EQU   ZZ1+24                                                   01434000
ZZ1PDCBP EQU   ZZ1+20                                                   01435000
ZZ1BLRBL EQU   ZZ1+16                                                   01436000
@NM00001 EQU   ZZ1+12                                                   01437000
ZZ1PNULL EQU   ZZ1+8                                                    01438000
ZZ1NULL  EQU   ZZ1+4                                                    01439000
ZZ1IDE   EQU   ZZ1                                                      01440000
DMCBWRK  EQU   DMCB+648                                                 01441000
DMCBRES8 EQU   DMCB+640                                                 01442000
DMCBMODN EQU   DMCB+632                                                 01443000
DMCBCARY EQU   DMCBAUDT+20                                              01444000
DMCBCLC  EQU   DMCBAUDT+12                                              01445000
DMCBOPC  EQU   DMCBAUDT+8                                               01446000
DMCBFRC  EQU   DMCBAUDT+4                                               01447000
DMCBALC  EQU   DMCBAUDT                                                 01448000
DMCBFR   EQU   DMCB+412                                                 01449000
DMCBRES6 EQU   DMCB+410                                                 01450000
DMCBIRSC EQU   DMCB+408                                                 01451000
DMCBSUBC EQU   DMCB+404                                                 01452000
DMCBDRBP EQU   DMCB+400                                                 01453000
DMCBRSZM EQU   DMCB+398                                                 01454000
DMCBRSZA EQU   DMCB+396                                                 01455000
DMCBCISZ EQU   DMCB+394                                                 01456000
DMCBDCBL EQU   DMCB+392                                                 01457000
DMCBDCLR EQU   DMCB+390                                                 01458000
DMCBDCFM EQU   DMCB+389                                                 01459000
DMCBRES5 EQU   DMCB+388                                                 01460000
DMCBLBRT EQU   DMCB+386                                                 01461000
DMCBLBSQ EQU   DMCB+384                                                 01462000
DMCBLBPS EQU   DMCB+383                                                 01463000
DMCBLBTY EQU   DMCB+382                                                 01464000
DMCBRES4 EQU   DMCB+381                                                 01465000
DMCBSPRS EQU   DMCBSPEC                                                 01466000
DMCBSPRN EQU   DMCBSPEC                                                 01467000
DMCBSPCT EQU   DMCBSPEC                                                 01468000
DMCBSPRL EQU   DMCBSPEC                                                 01469000
DMCBSPSE EQU   DMCB+376                                                 01470000
DMCBSPPR EQU   DMCB+372                                                 01471000
DMCBSPTY EQU   DMCB+369                                                 01472000
DMCBODIS EQU   DMCB+368                                                 01473000
DMCBDISP EQU   DMCB+367                                                 01474000
DMCBSTAT EQU   DMCB+366                                                 01475000
DMCBRES3 EQU   DMCB+364                                                 01476000
DMCBMEMB EQU   DMCB+356                                                 01477000
DMCBMODL EQU   DMCB+348                                                 01478000
DMCBRES9 EQU   DMCB+340                                                 01479000
DMCBPID  EQU   DMCB+332                                                 01480000
DMCBTYPE EQU   DMCB+328                                                 01481000
DMCBDSN  EQU   DMCB+284                                                 01482000
DMCBUNIT EQU   DMCB+276                                                 01483000
DMCBDSOR EQU   DMCB+274                                                 01484000
DMCBVOL  EQU   DMCB+268                                                 01485000
DMCBDDNM EQU   DMCB+260                                                 01486000
DMCBSYNM EQU   DMCB+132                                                 01487000
DMCBRPLF EQU   DMCB+128                                                 01488000
DMCBDCBE EQU   DMCBACBE                                                 01489000
DMCBARC  EQU   DMCB+120                                                 01490000
DMCBCPC  EQU   DMCB+116                                                 01491000
DMCBRET  EQU   DMCB+112                                                 01492000
DMCBSTL  EQU   DMCB+96                                                  01493000
DMCBEOB  EQU   DMCB+92                                                  01494000
DMCBFRE  EQU   DMCB+88                                                  01495000
DMCBRES2 EQU   DMCB+85                                                  01496000
DMCBSPID EQU   DMCB+84                                                  01497000
DMCBRESC EQU   DMCB+80                                                  01498000
DMCBZZ1P EQU   DMCB+76                                                  01499000
DMCBMSGS EQU   DMCB+72                                                  01500000
DMCBMSG0 EQU   DMCB+68                                                  01501000
DMCBRRL  EQU   DMCB+60                                                  01502000
DMCBRBA  EQU   DMCB+56                                                  01503000
DMCBKPC  EQU   DMCBKEYP                                                 01504000
DMCBORL  EQU   DMCB+40                                                  01505000
DMCBBFPC EQU   DMCBBUFP                                                 01506000
DMCBRES1 EQU   DMCB+31                                                  01507000
DMCBACCM EQU   DMCB+30                                                  01508000
DMCBREJ  EQU   DMCB+29                                                  01509000
DMCBRESB EQU   DMCBMFLG                                                 01510000
DMCBFMOD EQU   DMCBMFLG                                                 01511000
DMCBLOPT EQU   DMCB+27                                                  01512000
DMCBLRM  EQU   DMCB+26                                                  01513000
DMCBLRQ  EQU   DMCB+25                                                  01514000
DMCBOPRS EQU   DMCBOPTS                                                 01515000
DMCBBWD  EQU   DMCBOPTS                                                 01516000
DMCBRMRS EQU   DMCBRMOD                                                 01517000
DMCBRM5  EQU   DMCBRMOD                                                 01518000
DMCBRM6  EQU   DMCBRMOD                                                 01519000
DMCBTMP  EQU   DMCBOUT                                                  01520000
DMCBRESA EQU   DMCBOPN                                                  01521000
DMCBSOUT EQU   DMCBOPN                                                  01522000
DMCBSIN  EQU   DMCBOPN                                                  01523000
DMCBVSF  EQU   DMCBFTY                                                  01524000
DMCBKSF  EQU   DMCBFTY                                                  01525000
DMCBFTRS EQU   DMCBFTY                                                  01526000
DMCBSHF  EQU   DMCBFTY                                                  01527000
DMCBIRL  EQU   DMCB+16                                                  01528000
DMCBRTC  EQU   DMCB+12                                                  01529000
DMCBTVP  EQU   DMCB+8                                                   01530000
DMCBNEXT EQU   DMCB+4                                                   01531000
*                                      END UNREFERENCED COMPONENTS      01532000
@RC00251 EQU   @RC00238                                                 01533000
@ENDDATA EQU   *                                                        01534000
         END   BLSELPFR,(C'PLS1241',0701,78068)                         01535000
